{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 882
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>I was really, really excited about Dennis' return visit.</p>\n<p>I'm a big fan of &quot;low hangers,&quot;  especially when they're attached to a really hot guy!</p>\n<p>Dennis had dropped a lot of hints that he was interested in doing some guy-on-guy stuff. He was really excited too!</p>\n<p>His only concern: he wanted someone hot.</p>\n<p>Now, everyone has a different idea of what &quot;hot&quot; is. I learned that early on!</p>\n<p>&quot;So what are you looking for?&quot; I asked.</p>\n<p>&quot;Maybe someone in their twenties,&quot; he said. &quot;Handsome face, nice body, not too hairy.&quot;</p>\n<p>He seemed to put a lot of emphasis on the &quot;handsome face&quot; part.</p>\n<p>I thought about it, and I knew his perfect match would be Evan!</p>\n<p>I was nervous when they first met, because I wanted Dennis' first experience to be good.</p>\n<p>I could tell they immediately clicked.</p>\n<p>Dennis was giving Evan lots of compliments, and Evan (who I know pretty well at this point) had that look in his eye (which I have also come to know pretty well).</p>\n<p>&quot;I like his chin, the jaw,&quot; Dennis said about Evan when asked. &quot;He's very good looking.&quot;</p>\n<p>I could tell what Evan was thinking. We had told him about Dennis' cock! </p>\n<p>&quot;I was a little concerned,&quot; Dennis said.&quot;This is my first time. I want somebody who looks good.&quot;</p>\n<p>I think the most interesting thing about this video is how much concern Dennis shows for his partner.</p>\n<p>He's tender but rough, and you can tell he wants to make sure that Evan is enjoying himself.</p>\n<p>Which Evan did!</p>",
  "models": [
    {
      "name": "Dennis",
      "person_id": 17727
    },
    {
      "name": "Evan",
      "person_id": 17915
    }
  ],
  "release_date": "2009-09-26",
  "scene_id": 2697831,
  "series": [],
  "tags": [
    "Old",
    "Hairy",
    "Muscular",
    "Athlete/Jock",
    "Anal",
    "Big Dick"
  ],
  "title": "Dennis & Evan"
}