{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1081
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>I was intrigued to see Calvin with another guy and how it would go down. He&rsquo;s one of our newer guys but is very sexual with few inhibitions. Remember, he wants to have sex 20-plus times a week! Jonathan has been so fun to shoot, not just because he&rsquo;s friendly with a great personality, but he&rsquo;s got that amazing runner&rsquo;s body and big cock. But then again, so does Calvin! Two big cocks, two great bodies and one intense, hot hook-up on film. I couldn&rsquo;t wait to get started. Question was, who was going to bottom? </p>\n<p>They got to know each other a little and almost immediately hit it off. I knew it would be easy as their personalities are very similar. They talked for a while on the bed and then Jonathan decided he was ready to volunteer: he wanted to get fucked. This was great because Calvin had already planned to bottom so now, for his first time on film, Jonathan was going to bottom and we were going to have some flip-flop action.</p>\n<p>&ldquo;When you&rsquo;re having sex, do you tend to be more aggressive?&rdquo;</p>\n<p>&ldquo;It depends on what they&rsquo;re looking for,&rdquo; Calvin said. &ldquo;I never punch or anything like that, but I definitely like to pull some hair.&rdquo;</p>\n<p>The two of them made out for a while and you could see through their jeans that they were both hard. When they got undressed, each of their cocks was at attention and Jonathan dove in first, sucking on Calvin&rsquo;s big eight-incher before flipping him over and munching on his ass. Before I knew it, Jonathan was straddled over Calvin, riding him good. </p>\n<p>Then Jonathan took control. When Calvin came, he shot all over his stomach. Then Jonathan knelt down and started sucking on his cock, almost as if he was trying to get it hard again. </p>\n<p>I think Jonathan wanted to ride it a little more. Oh well, there&rsquo;s always next time!</p>",
  "models": [
    {
      "name": "Calvin",
      "person_id": 17763
    },
    {
      "name": "Jonathan",
      "person_id": 19059
    }
  ],
  "release_date": "2010-08-07",
  "scene_id": 2699811,
  "series": [],
  "tags": [
    "Swallow",
    "Twink",
    "Athlete/Jock",
    "Anal",
    "Big Dick",
    "Flip Flop"
  ],
  "title": "Calvin & Jonathan"
}