{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 4074509
    }
  ],
  "collections": [
    "Men"
  ],
  "description": "Since Dante Colle is all alone in his camper, he's been masturbating more than ever before. When cute Scottish twinks Callum and Cole invite him to join them for a steamy video call, he jumps at the chance. The guys chat a bit, then Dante gets things started as he takes off his shirt and invites the sexy Scots to do the same. Dante might be thousands of miles away, but he directs the action, showing Cole exactly how to suck Callum's cock and telling them just what he wants to see. The twinks 69 and Callum opens up Cole's hole with his fingers as Dante watches, stroking his cock and teasing his ass with a dildo. Callum instructs both Dante and Cole to ease just the head inside at the exact same time, Cole riding Callum and Dante fucking himself with the dildo! Dante strokes his huge cock as he watches Callum and Cole flip fuck. He blows a huge load on his laptop screen as the twinks kneel in front of their webcam for a virtual facial, then Callum cums in Cole's mouth before enjoying Cole's jizz.",
  "models": [
    {
      "name": "Callum",
      "person_id": 71911
    },
    {
      "name": "Cole",
      "person_id": 71921
    },
    {
      "name": "Dante Colle",
      "person_id": 17408
    }
  ],
  "release_date": "2020-05-18",
  "scene_id": 4414562,
  "series": [
    "Drill My Hole"
  ],
  "tags": [
    "Piercing",
    "Tattoo",
    "Muscular",
    "American",
    "Brown Hair",
    "Short",
    "Average Dick",
    "European",
    "Blond Hair",
    "Black Hair",
    "Big Dick",
    "Sex",
    "Threesome",
    "Cum Shot",
    "Facial",
    "Handjob",
    "Masturbation",
    "Nipple Play",
    "Anal Fingering",
    "Ass Licking",
    "Blowjob",
    "Deep Throat",
    "Face Fuck",
    "Bedroom",
    "Indoors",
    "Outdoors",
    "18-24",
    "Twink",
    "Anal",
    "Bareback",
    "69",
    "Doggystyle",
    "Flip Flop",
    "Dildo",
    "Sex Toys"
  ],
  "title": "Remote Control: Episode 1"
}