{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 4223133
    }
  ],
  "collections": [
    "Men"
  ],
  "description": "If there's one man who changed the course of queer men's fantasies forever, it's erotic illustrator Tom of Finland. In partnership with Tom of Finland, and with the help of some of today's best artists and directors, Men.com has brought Tom's most iconic sexual visions to life. The journey begins with a classic TOF outdoor scenario set in 1957, as birdwatcher Theo Brady is caught spying on fisherman Kurtis Wolfe, and watches Kurtis submit to muscular uniformed cop Matthew Camp before joining for a threesome. Moving on into the 1970s, Matthew Camp, Ricky Roman, River Wilson, and DeAngelo Jackson get greased up to bring Tom's beloved Kake comic story, \"Service Station,\" to life. Then Nate Grimes, Kurtis Wolfe, Dirk Caber, and Jaxx Thanatos enact the wet-dream-like tale of a young man's erotic transformation into a leather man. In the present day, Joey Mills and fellow twinks Sean Ford, Angel Rivera, Tannor Reed, and River Wilson explore the erotic playground at Tom's house, embodying the evolution of the gay scene and Tom's enduring legacy. Finally, visit an avant-garde future landscape where the virtual is the real, as Francois Sagat transports himself to a biodigital sexual playground and calls on fellow erotic devotees DeAngelo Jackson, Ty Mitchell, and Mickey Taylor to enact his every fantasy.",
  "models": [
    {
      "name": "Angel Rivera",
      "person_id": 65014
    },
    {
      "name": "DeAngelo Jackson",
      "person_id": 64944
    },
    {
      "name": "Dirk Caber",
      "person_id": 24059
    },
    {
      "name": "Francois Sagat",
      "person_id": 40042
    },
    {
      "name": "Jaxx Thanatos",
      "person_id": 45222
    },
    {
      "name": "Kurtis Wolfe",
      "person_id": 39994
    },
    {
      "name": "Matthew Camp",
      "person_id": 57676
    },
    {
      "name": "Mickey Taylor",
      "person_id": 40564
    },
    {
      "name": "Nate Grimes",
      "person_id": 40590
    },
    {
      "name": "Ricky Roman",
      "person_id": 57317
    },
    {
      "name": "River Wilson",
      "person_id": 40086
    },
    {
      "name": "Sean Ford",
      "person_id": 56961
    },
    {
      "name": "Tannor Reed",
      "person_id": 67651
    },
    {
      "name": "Theo Brady",
      "person_id": 65232
    },
    {
      "name": "Ty Mitchell",
      "person_id": 39959
    }
  ],
  "release_date": "2020-06-02",
  "scene_id": 4415264,
  "series": [
    "Drill My Hole"
  ],
  "tags": [
    "One-on-One",
    "Orgy",
    "Sex",
    "Threesome",
    "Cumshot Clean-Up",
    "Cum Shot",
    "Handjob",
    "Nipple Play",
    "Anal Fingering",
    "Anal Fisting",
    "Ass Licking",
    "Blowjob",
    "Deep Throat",
    "Face Fuck",
    "Spanking",
    "Bar",
    "Car",
    "Garage",
    "Night Club",
    "Outdoors",
    "Anal",
    "Bareback",
    "Interracial",
    "Doggystyle",
    "Flip Flop"
  ],
  "title": "Tom of Finland: Master Cut"
}