{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 4074503
    }
  ],
  "collections": [
    "Men"
  ],
  "description": "Group video calls aren't just for meetings anymore: six of Men.com's favorite studs put technology to good use for a virtual circle jerk as Luis Rubi, Dante Colle, Calvin Banks, Johnny Hill, Elijah Wilde, and Rhyheim Shabazz call in to get off. The guys catch up with some good-natured teasing and banter until Dante orders everyone who's still got pants on to get their dicks out ASAP! Calvin shows off his new molded dildo but, like Elijah and Rhyheim, he keeps things old-school by just using his hands. Dante penetrates his hole with his fave glass dildo, pretending it's Rhyheim's huge cock, while Johnny and Luis work their dicks with strokers. Luis twerks for everyone as he fucks his toy, slapping his ass by special request from Elijah, as the guys discuss whether they prefer to bottom or top, and who loves having their faces sat on. Dante can't wait any longer and cums, then cums a second time as Calvin and Luis both shoot. Rhyheim blows a big load, Johnny cums, and Elijah orgasms too to finish things off.",
  "models": [
    {
      "name": "Calvin Banks",
      "person_id": 57556
    },
    {
      "name": "Dante Colle",
      "person_id": 17408
    },
    {
      "name": "Elijah Wilde",
      "person_id": 72301
    },
    {
      "name": "Johnny Hill",
      "person_id": 65458
    },
    {
      "name": "Luis Rubi",
      "person_id": 56323
    },
    {
      "name": "Rhyheim Shabazz",
      "person_id": 72501
    }
  ],
  "release_date": "2020-06-15",
  "scene_id": 4415565,
  "series": [
    "Drill My Hole"
  ],
  "tags": [
    "Piercing",
    "Tattoo",
    "Muscular",
    "American",
    "Brown Hair",
    "Short",
    "Average Dick",
    "Latin",
    "Black Hair",
    "Big Dick",
    "Black",
    "Shaved",
    "Orgy",
    "Cum Shot",
    "Masturbation",
    "Bedroom",
    "18-24",
    "25-34",
    "35 Plus",
    "Twink",
    "Anal",
    "Interracial",
    "Dildo",
    "Sex Toys"
  ],
  "title": "Remote Control: Episode 5"
}