{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 4203829
    }
  ],
  "collections": [
    "Men"
  ],
  "description": "Tattooed, British vers couple Mickey Taylor and Ronnie Stone are spending their time reading, enjoying tasty candy, and going for walks in the woods, as Mickey tidies their place in his own special way. Meanwhile in the not-too-distant countryside, housemates-with-benefits Clayton Fox and Harri Oakland are working out in the fields, tending to their coops, and baking together. Although these couples might not be able to meet up in the flesh just yet, they set up a hot video call. Experienced Mickey kicks things off by showing the guys Ronnie's inked ass, then tells his man to get his cock hard so he can display his dick tat! Clayton wants in on the action, sucking Harri's cock, and soon Mickey and Harri are both teasing their bottoms' holes and fucking them doggystyle. Ronnie is the first to cum, and Harri and Clayton watch, jacking their cocks, as Mickey tastes it. Clayton shoots his load just before Mickey gives Ronnie a facial, then Clayton waits in position for Harri's jizz to cover his face.",
  "models": [
    {
      "name": "Clayton Fox",
      "person_id": 72771
    },
    {
      "name": "Harri Oakland",
      "person_id": 72751
    },
    {
      "name": "Mickey Taylor",
      "person_id": 40564
    },
    {
      "name": "Ronnie Stone",
      "person_id": 72761
    }
  ],
  "release_date": "2020-06-22",
  "scene_id": 4416063,
  "series": [
    "Drill My Hole"
  ],
  "tags": [
    "Piercing",
    "Tattoo",
    "Muscular",
    "European",
    "Blond Hair",
    "Short",
    "Average Dick",
    "Average Body",
    "Black Hair",
    "Brown Hair",
    "One-on-One",
    "Sex",
    "Cumshot Clean-Up",
    "Cum Shot",
    "Cum Swap",
    "Facial",
    "Anal Fingering",
    "Ass Licking",
    "Blowjob",
    "Deep Throat",
    "Face Fuck",
    "Spanking",
    "Bedroom",
    "25-34",
    "Twink",
    "Anal",
    "Bareback",
    "Doggystyle"
  ],
  "title": "Remote Control: Episode 6"
}