{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "It’s been years since Max Schutler has appeared in a Lucas Entertainment film, so what better way to make a return than at Rocco Steele’s breeding party? Rocco’s gathering aside from him and Max currently consists of Leo Alexander, Raul Korso, Joey Pele, Zander Craze, Max Toro, and Craig Daniel. Max has his sights set on Rocco from the onset: around 3:20 he starts sucking on Rocco’s 10 inches of thick daddy meat. And a note on Joey Pele: this guy has bulked up quite a bit, and with his increased muscle mass so too has his sex drive blown up. Zander Craze gets him started by swallowing his uncut cock, and for a while Joey gives into his submissive side by sharing Rocco Steele’s daddy cock with Raul Korso. But be sure to make note of the action around 32:45, as Joey hops from hole to hole: he fucks Craig Daniel, moves to Raul Korso, and then back to Craig. Meanwhile, Rocco can’t get enough of Max: Rocco focuses on Max by fucking the returning performer slowly and deeply on his back. Admittedly, it’s hard keeping up with all of the incredible action, and clocking in at over 50 minutes, this is a bareback orgy of astounding quality you do not want to miss out on!",
  "models": [
    {
      "name": "Craig Daniel",
      "person_id": null
    },
    {
      "name": "Joey Pele",
      "person_id": null
    },
    {
      "name": "Leo Alexander",
      "person_id": null
    },
    {
      "name": "Max Schutler",
      "person_id": null
    },
    {
      "name": "Max Toro",
      "person_id": null
    },
    {
      "name": "Raul Korso",
      "person_id": null
    },
    {
      "name": "Rocco Steele",
      "person_id": null
    },
    {
      "name": "Zander Craze",
      "person_id": null
    }
  ],
  "release_date": "2015-04-10",
  "scene_id": 13408,
  "series": "Rocco Steele's Breeding Party",
  "title": "Max Schutler And Joey Pele Steal The Show At Rocco's Breeding Party"
}