{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "From the Kristen Bjorn website: Out for a walk on a beautiful fall day, Marco Rubi spots some guys in a window that invite him up. Always horny and always adventurous, Marco accepts the invitation. At first Marco and Mirek Ceslar pair up as Marco’s head is taken into Mirek’s hands and is face fucked. Jan Faust has taken the same position and is forcing his cock down David Kadera’s hungry throat. Mirek and Jan switch up and the oral exhilaration continues. David’s tongue drives Mirek wild with pleasure that he sprays his hot load all over David’s face and hungry mouth. Jan continues to fuck away at Marco’s mouth until he shoots his thick creamy load onto his chin. Marco takes Jan’s throbbing cock into his mouth to savor the thick cum that is dripping from his swollen head as the thick cum globs off of Marco’s chin. As Marco and David are kissing each other Jan and Mirek are pounding their raw cocks into their asses. David and Marco open their muscular mounds so they can feel the full depth of the hard cocks fucking them. Jan and Mirek pull out to show us there huge, uncut throbbing cocks before driving them deep inside of the hungry holes in front of them. The guys then flip positions as well as partners as David squats over Jan and Marco over Mirek. David and Marco love a hot cock in their asses and take these two cocks for a wild ride. David and Marco’s balls have drawn up tight and swollen to capacity as they continue to ride Jan and Mirek’s huge cocks. Releasing himself to the pleasures, David explodes his huge load as Jan continues to plow his ass. Marco’s cock has become so engorged that he is left with no other choice but to blow his load. Mirek’s pounding assists Marco’s cum to fully empty from his balls.",
  "models": [],
  "release_date": "2018-02-15",
  "scene_id": 19686,
  "series": "KristenBjorn.com",
  "title": "Jan Faust, Mirek Ceslar, David Kadera, Marco Rubi | Bareback Blond Fouresome"
}