{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Jonathan drives around looking for the nearest police station, when he gets a phone call from a mysterious voice, who leads him through a terrifying game called “Discipline”. At stake is leading porn director Michael Lucas’s life. Jonathan has no choice but to obey his frightening digital captor, who leads him to an apartment plastered with Lucas Entertainment memorabilia, where the built Rob Nelson and the trim Giuseppe Pardi are waiting for him in nothing but underwear. They want him to fuck them like he fucked Avi Dar in one of his movies, and Jonathan has no choice but to oblige them. Rob pulls out a camera… and his uncut cock! Jonathan strips for the boys and they enter into a hot, blood-pumping threesome of grave consequences. They suck each other’s cocks in a variety of three-way positions, until Jonathan flips Giuseppe onto his shoulders in order to plow the depths of his tight little ass. Jonathan fucks Giuseppe as Rob feeds the boy his cock, and then Rob fucks Jonathan while he’s deep in Giuseppe’s ass! A brutally hot fuck chain puts Jonathan to full use, and they continue this in a standing position. Rob plants his cock deep in Giuseppe’s ass, and Giuseppe rides the sculpted hairy muscle man like the stallion he is. Finally, Rob and Jonathan double-penetrate the horny Giuseppe, giving him more cock than he’s ever had in his life! Jonathan and Giuseppe both finish up their loads on Rob’s hot torso, and Rob completes the trinity with a huge globbing faceful of cum for Giuseppe!",
  "models": [
    {
      "name": "Giuseppe Pardi",
      "person_id": null
    },
    {
      "name": "Jonathan Agassi",
      "person_id": null
    },
    {
      "name": "Rob Nelson",
      "person_id": null
    }
  ],
  "release_date": "2010-11-23",
  "scene_id": 2821,
  "series": "Trapped in the Game",
  "title": "Jonathan Agassi, Giuseppe Pardi, and Rob Nelson"
}