{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Who better than the master himself to open up this scene: Michael Lucas rides bottom-stud Scott Carter at every speed and in every position possible. Michael fucks Scott slow and fast alike, and when he stares up begging for more, Michael grabs Scott's throat, spits in his face, and slaps his face -- making him the bottom-whore that he is! The scene then shifts to the smooth, blond beauty Phillip Aubrey getting hammered by the merciless stud-top Spencer Reed, all with Philip's hands tightly tied behind his back. Talk about no escape! Spencer pounds his hard cock so deep and so fast into Phillip's tight boy-ass that he can't help but cry out \"fuck\" over and over again, which only instigates Spencer to drill him harder than before. If that isn't enough, Israeli sex-god Jonathan Agassi and Brazilian beauty Harry Louis double-team Greek stud Rio Silver, turning the versatile sex-fiend into a total bottom for this intense romp! Harry gets so sexed up while Rio simultaneously blows him and gets fucked by Jonathan, that Harry sticks his dick into Jonathan's own ass: while Jonathan fucks Rio, he's actually fucking himself on Harry's fat, 9-inch cock! Eventually it's Harry's turn to pump Rio's hole while the bottom sucks on Jonathan's hard cock. What a workout! And for the finale, it's a wonder the slim, baby-faced, Paris playboy Sebastian Ritz can handle the deep plunges of Rafael Alencar's massive, 10-inch cock. But he's going to have to since Rafael tells Sebastian that he's going to have to take it for a long time! And he does: Rafael eventually flips Sebastian onto his back, throws his legs over his shoulders, and slowly drills the bottom balls-deep until he blows his load all over his face!",
  "models": [
    {
      "name": "Harry Louis",
      "person_id": null
    },
    {
      "name": "Jonathan Agassi",
      "person_id": null
    },
    {
      "name": "Michael Lucas",
      "person_id": null
    },
    {
      "name": "Phillip Aubrey",
      "person_id": null
    },
    {
      "name": "Rafael Alencar",
      "person_id": null
    },
    {
      "name": "Rio Silver",
      "person_id": null
    },
    {
      "name": "Scott Carter",
      "person_id": null
    },
    {
      "name": "Sebastian Ritz",
      "person_id": null
    },
    {
      "name": "Spencer Reed",
      "person_id": null
    }
  ],
  "release_date": "2011-04-08",
  "scene_id": 3150,
  "series": "FUCK!",
  "title": "Drilling for Cum!"
}