{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Sir Ari Gold is performing in a jazz club as assassin Michael Lucas comes in and is focused on one concern: murder. But his hit draws the attention of muscle-stud performer Adam Killian, who follows after Lucas in hot pursuit, leading them both down the streets on New York and into a subway station where Lucas manages to hop on a train car and evade Killian. Rafael Alencar and Braxton Bond are back at their lair sharing shots after Junior's hit. Their celebration turns steamy when Rafael pushes his face into Braxton's for deep tongue-kissing. The kissing heats up and Braxton falls to his knees and worships Rafael's stiff massive cock through his tight, white briefs. As Braxton worships Rafael's cock, Rafael orders Braxton to look at him while he slurps down every inch of his monster cock. The two return to kissing while Rafael peels off Braxton's pants and throws him over the pool table, rubbing his raging cock along Braxton's quivering ass. When he's finally ready, Rafael lubes up and plunges his cock so deep into Braxton that he stamps his feet! Rafael teases Braxton's ass by pulling his cock in and out, sending the bottom into squirms and anxious moans! But Rafael's dick alone isn't enough for the insatiable Braxton, so Rafael flips his bottom onto his back and takes out a big, black dildo to open up Braxton's hole even wider while blowing him at the same time! But why stop with one dildo? Rafael pulls out a red dildo as big as the black one and double-fucks Braxton without mercy! Rafael knows no limit when he sticks his own dick into Braxton's ass with the dildos, triple-fucking him, causing Braxton to moan and cry out! All of the excitement leads Rafael to an intense climax, where his shoots his hot, thick load all over Braxton's legs and licks it up!",
  "models": [
    {
      "name": "Braxton Bond",
      "person_id": null
    },
    {
      "name": "Rafael Alencar",
      "person_id": null
    }
  ],
  "release_date": "2011-04-11",
  "scene_id": 3161,
  "series": "ASSASSIN",
  "title": "Aggressive Power-Top Rafael Alencar Triple-Fucks Braxton Bond"
}