{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Once Junior Stellano squeezes his thick, 7-inch cock into Rafael Carreras' tight, Cuban asshole, there's no turning back. With Rafael down on all fours, Junior doesn't just pump him -- he orders Rafael to beg for his cock. Rafael wants nothing more than to please his top master, so he pumps his ass hard back and forth on Junior's stiff dick. But soon it's Junior's turn, and Rafael tosses the stud around in all positions while he fucks him until he drops a juicy load down Junior's throat! As the scene shifts, we see slender, slim stud Jake Steel taking a seat on top of Alexsander Freitas' fat Brazilian cock. After all, if there's one thing Jake loves, it's getting rammed by dominant tops! When Alexsander is done with Jake on top, he flips him over and fucks him from behind. With every thrust, Jake cries out in pleasure. Alexsander certainly doesn't have any complaints -- he tells Jake more than once how tight his asshole is! After Jake and Alexsander are finished, the scene moves on to Jay Roberts and Brice Farmer, who redefine the concept of flip-fucking. Slender, French hottie Brice starts out by teaching Slovak beauty Jay a lesson in submission: Jay is defenseless on his back while Brice fucks him steadily. But Jay is no stranger to fucking himself: the two switch places and Brice hops on top of Jay's cock and rides him like mad. Keep an eye out for Brice's uncut cock flopping around -- not to mention the intense cum shots! In the final scene, blond bombshell Logan Stevens proves that he's one hell of a bottom. He submits to Ace Rockwood completely, who fucks Logan so fast and so hard that he has to stop multiple times to lube back up! Lucky for Ace, Logan took every last thrust like a champ!",
  "models": [
    {
      "name": "Ace Rockwood",
      "person_id": null
    },
    {
      "name": "Alexsander Freitas",
      "person_id": null
    },
    {
      "name": "Brice Farmer",
      "person_id": null
    },
    {
      "name": "Jake Steel",
      "person_id": null
    },
    {
      "name": "Jay Roberts",
      "person_id": null
    },
    {
      "name": "Junior Stellano",
      "person_id": null
    },
    {
      "name": "Logan Stevens",
      "person_id": null
    },
    {
      "name": "Rafael Carreras",
      "person_id": null
    }
  ],
  "release_date": "2011-04-22",
  "scene_id": 3183,
  "series": "FUCK!",
  "title": "Load-Busting Ass Fucking!"
}