{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "There's one man up for the task of breaking in Israel sex-god Matan Shalev: Michael Lucas himself. Craving nothing less than deep, hot penetration, Michael orders Matan onto his back with his ass raised high in the air so he can fuck him with every last inch of his huge cock! And if screams of passion make the man, then Matan deserves an award -- he howls and moans in ecstasy has Michael flips him around into different positions, never once letting up on Matan's ass with his throbbing jackhammer of a meat-rod. Continuing with the theme of a sexy top showing a beautiful bottom who's boss, who better than the beefy stud Pavlus Guell riding the ass of slim hottie Diego Cruz. All Diego can do is bite his pillow and moan with his eyes clenched shut as Pavlus plunges deep into the twink's ass with his hard, throbbing cock. The longer Pavlus drills Diego, the closer the two come to reaching climax, squirting their hot gooey juice! But unlike Diego and Pavlus, smooth bombshell Steven Daigle and furry powerhouse Arpad Miklos redefine what it means to be vocal during sex. All Steven can do is lean over a leather couch while Arpad gyrates his thick piece in and out of his tight asshole -- screaming \"yeah\" and \"oh fuck\" the entire time! Arpad is such a merciless top that he doesn't even bother with lube: even better, he uses his own spit! The closeups on Steven's clenched face make the action especially erotic! The scene finishes out with bottom-whore Braxton Bond proving just how much he loves cock -- and there's no better veiny piece for him to take that Cezar Dior's 11-inch monster! And Braxton sure knows what he's doing -- he rides Cezar in every position possible. Cesar especially enjoys himself when Braxton hops on top of his cock and pumps him as only an expert power-bottom can! Their hot sprays of cum at the end are well earned!",
  "models": [
    {
      "name": "Arpad Miklos",
      "person_id": null
    },
    {
      "name": "Braxton Bond",
      "person_id": null
    },
    {
      "name": "Cezar Dior",
      "person_id": null
    },
    {
      "name": "Diego Cruz",
      "person_id": null
    },
    {
      "name": "Matan Shalev",
      "person_id": null
    },
    {
      "name": "Michael Lucas",
      "person_id": null
    },
    {
      "name": "Pavlvs Guell",
      "person_id": null
    },
    {
      "name": "Steven Daigle",
      "person_id": null
    }
  ],
  "release_date": "2011-05-06",
  "scene_id": 3207,
  "series": "FUCK!",
  "title": "Intense and Sweaty Man Sex!"
}