{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Does it get any hotter than this? The scene opens with all-American stud Spencer Reed sprawled out on a chair enjoying the rough gyrations of Israeli hunk Avi Dar as he bounces up and down on his hard, 8-inch dick. Because Spencer is large and in charge, he doesn't even have to do much work in the beginning: all he needs to do is stare at Avi with his intense eyes, and the bottom rides him even harder than before! But when Spencer has enough of Avi power-bottoming, he stands tall and picks Avi up, ravenously thrusting him up and down on his cock. As the scene transitions to Adam Killian, all the tattooed hunk has to say to blond sex-pot John Magnum is, \"Yeah, ride it,\" and John's meaty bubble butt hammers up and down with vigorous momentum. Adam continues to conquer John's ass when he tosses him onto his back and jackhammers him so hard that John's head lolls back and fourth and his eyes roll up into his head. Then, unexpectedly, the two flip-fuck and Adam's ass is slammed by John's 8-inch cut cock until they both erupt cum! The scene once again shifts to none other than the Israeli sex-god himself, Jonathan Agassi, as he slams fellow Israeli hunk, Naor Tal. If there is one thing that Naor enjoys it's a good ass-pounding, and Jonathan is more than happy to oblige. He bends Naor over a balcony in the open air of Israel and hammers his tight hole repeatedly. The two climax with Naor on his back as Jonathan pumps away until they both blow their cum all over Naor's chest! In the final scene, power-top Rafael Alencar proves that kitchens are meant for more than just cooking. He bends the sexy Matan Shalev over a kitchen sink and plunges his fat, throbbing, 10-inch cock all the way up his ass. With every inch that Matan takes, he moans and thrives in ecstasy. Rafael knows exactly what he want, so he orders Matan to position his left leg on the top of the refrigerator, allowing Rafael the deepest penetration possible! Rafael finishes with Matan pinned on his back until he cums in the bottom's wide, open mouth!",
  "models": [
    {
      "name": "Adam Killian",
      "person_id": null
    },
    {
      "name": "Avi Dar",
      "person_id": null
    },
    {
      "name": "John Magnum",
      "person_id": null
    },
    {
      "name": "Jonathan Agassi",
      "person_id": null
    },
    {
      "name": "Matan Shalev",
      "person_id": null
    },
    {
      "name": "Naor Tal",
      "person_id": null
    },
    {
      "name": "Rafael Alencar",
      "person_id": null
    },
    {
      "name": "Spencer Reed",
      "person_id": null
    }
  ],
  "release_date": "2011-05-20",
  "scene_id": 3227,
  "series": "FUCK!",
  "title": "Hardcore Ass Pounding!"
}