{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Sean Xavier is a tall, lean black stud with a problem: his damn television just won’t work. While on the phone with a repairmen who gives him nothing but the runaround, hunky Latino stranger Alexander Garrett shows up at Sean’s house and offers some help. Luckily, the only problem is the power cable: it’s unplugged. Alexander inserts the cable into the wall socket, and when he looks back up Sean has his own power plug standing alert and ready for service. With a wide, gorgeous smile, Alexander pulls down Sean’s shorts, and his thick, massive black cock bounces out. The piece of meat vanishes down Alexander’s throat as he swallows and slurps on his reward for fixing Sean’s TV. Alexander struggles to handle Sean’s big, black cock down his throat, but it’s a challenge he happily undertakes. Sean wants to see what Alexander has to offer, so they both strip down; Alexander has a gorgeous, muscular body with lightly tanned skin. Sean lays him down on the sofa, smothering the Latin hunk with passionate kisses while running his hands up and down his ripped body. Alexander’s tight, smooth asshole is calling out for a tongue bath, and Sean obliges. When Alexander’s tight, puckering hole is ready for dick, Sean rolls on a condom and slips his fat, hard piece into the Latino’s rectum. It’s difficult at first, but Alexander accommodates Sean’s size. After flipping Alexander around in different positions, Sean sucks the Latino’s fat, sexy dick, getting him hard before he fucks Sean’s mocha hole. The gay sex of these two hot guys ends in an explosion of cum!",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": null
    },
    {
      "name": "Sean Xavier",
      "person_id": null
    }
  ],
  "release_date": "2011-11-11",
  "scene_id": 3984,
  "series": "Top Service",
  "title": "Alexander Garrett and Sean Xavier Fuck"
}