{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Lucas Entertainment exclusive Jonathan Agassi takes charge of the first interview for \"Auditions 43: Euro Guys\" -- and who better than him to talk to the burly, sexy Bruno Knight and Leo Helio, whose sweet face and tight, killer body scream sex. As the guys chat with Jonathan, it's easy to get swept away by Bruno's British accent, a fact apparent when seeing the chemistry between him and Leo. Jonathan knows the boys are after sex, so when the discussion ends, the real fun begins! Bruno is an aggressive top: he tears off Leo's clothes (along with his own) as they bump and grind into each other. There's lots of heavy kissing, touching, pit licking, and moaning to enjoy -- all in the boys' tight white briefs. Bruno is both dominant and passionate, and he wastes no time throwing Leo on his back, slipping off the blond's underwear, and using his mouth to pleasure Leo's beautiful, erect dick. Bruno's bearded lips pucker up and suck happily on Leo's meat; Leo loves submitting to the strong top before getting rolled over and having his ass eaten out. When Bruno is ready to be serviced, he stands up, pulls Leo to the edge of the bed, yanks down his briefs, and presents his cock to Leo, who eats it up, sucking and swallowing to please Bruno. The guys spend a lot of time making each other stiff and excited, and when Bruno's ready, he slips on a condom and invades Leo's ass. Bruno is a loud and powerful guy in bed, and Leo's tight ass is just the ticket to get him off and hot to fuck his boy's tight hole. These two hot guys have apposing body types, and they couldn't look sexier together: Bruno's furry frame thrashing into Leo's smooth, tight body as he lies on his back with his asshole opened wide, it's no wonder they reach the explosive cum shot that they do!",
  "models": [
    {
      "name": "Bruno Knight",
      "person_id": null
    },
    {
      "name": "Leo Helios",
      "person_id": null
    }
  ],
  "release_date": "2011-11-21",
  "scene_id": 4051,
  "series": "Auditions 43: Euro Guys",
  "title": "Bruno Knight Hammers Blond Hottie Leo Helios"
}