{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Lucas Entertainment exclusive Vito Gallo debuts in the fourth installment of the Gentlemen line as a street-smart writer who can’t keep his eyes off hot blond businessman Chris Daniels. Vito himself is a diamond in the rough: sure he’s hot, but while he lingers at the counter of his favorite bar and admires the executive patrons from afar, he can’t help but feel jealousy. After he misses a chance to say hello to Chris, he focuses on the young hotshots Jessie Colter and Trey Turner. Vito reads their lips: “I want you to fuck me,” Jessie whispers in Trey’s ear. That’s exactly what they do in Jessie’s executive suite when the rest of the office has gone home. They kiss passionately while groping and grinding, removing each piece of their suits slowly. Jessie clears off his desk and hops on top as they kiss, but Trey is more interested in undoing his pants and taking out his hard cock. Trey Turner yanks down Jessie Colter’s underwear and starts swallowing and deep-throating his dick; Jessie moans and grunts with each slurp. Jessie’s lean torso flexes, accented by the light down of fuzz on his chest and stomach. The hot guys reverse and Jessie falls to his knees, taking Trey into his mouth. He stares up at his business partner with needy eyes as he sucks and slurps to please Trey. Both Jessie and Trey lust for each other, and it’s never been so clear as when they exchange rimjobs, which couldn’t be deeper or wetter. It’s a precursor to some hot fucking, and the guys reveal themselves to be the gay pornstars they truly are. Trey bends Jessie over the desk first and fucks him, but Jessie strips off his suit, lays down on the desk, and with his cock hard and tall, invites Trey to sit down on it and take a ride. Jessie’s never been deeper in Trey as he fucks him with loud moans leading up to an intense and explosive gay cum shot!",
  "models": [
    {
      "name": "Jessie Colter",
      "person_id": null
    },
    {
      "name": "Trey Turner",
      "person_id": null
    }
  ],
  "release_date": "2012-02-17",
  "scene_id": 4484,
  "series": "Gentlemen 04: In Hot Pursuit",
  "title": "Hot Businessmen Jessie Colter and Trey Turner Fuck and Swallow Cum"
}