{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "He’s all alone: Jonathan Agassi returns from a brief, solitary vacation away from the island paradise Ibiza only to find it empty and echoing with his calls for attention. He wanders the forgotten streets, filled with still cars and lined with empty shops. A convenient store draws his attention, and while browsing the shelves the quiet is broken by the distant hum of motorcycle engines. Jonathan dashes outside to see Will Helm and Kriss Aston patrolling the streets. They explain to Jonathan that the island is deserted; everyone fled after terrible news was passed down via mass communications. If Jonathan wants to know what it is, he has to follow them. Kriss and Will lead Jonathan back to the home of Issac Jones, who shows him a looping broadcast: the tampering of scientists searching for the elusive Higgs Boson -- the God Particle -- at the CERN facility in Switzerland has caused instability in the Earth’s core, and the world will end in six days. These are Jonathan’s last days alive. In shock, Will and Kriss calm Jonathan by taking him to a ruined watchtower overlooking Ibiza Island. If this is truly their last days, these men are not going to waste their time with tears. Kriss and Will both approach Jonathan at the tower’s summit, groping his lean body with their hands and smothering his face and neck with kisses. Under the high-noon sun the guys take off their shirts to let their sculpted bodies breathe. Jonathan drops to his knees when Kriss and Will undo their pants: both of their hard, uncut cocks are standing erect, bouncing up and down as the two flex their cocks, enticing Jonathan to suck them both, one after the other. Kriss is eager to taste Jonathan, so the hulking bottom bends down and sucks on the Israeli stud’s cut dick while his boyfriend watches, ever turned on by seeing his man with someone else. Will is next, and both Kriss and Jonathan show his big piece of meat special attention. The three have an unforgettable cock-party: they swap wet blowjobs, complete with plenty of deep-throating and 69 fun, while total-top Will and versatile Agassi play with Kriss’ ass here and there, licking and tasting it. When Will is ready for Kriss’ ass, the hungry bottom bends over the tower ledge and grits his teeth as the young, hot, and horny top penetrates him, thrusting deep and slowly while Jonathan jerks his cock before swapping in and doing the fucking himself. Jonathan and Will take turns back and forth; the action reaches its height when Jonathan fucks Kriss while Will enters Jonathan’s from behind for one of the hottest three-way fucks around! The cum-hungry Jonathan hangs his head over the tower ledge as Kriss and Will jerk their cum all over the Israeli slut!",
  "models": [
    {
      "name": "Jonathan Agassi",
      "person_id": null
    },
    {
      "name": "Kriss Aston",
      "person_id": null
    },
    {
      "name": "Will Helm",
      "person_id": null
    }
  ],
  "release_date": "2012-03-16",
  "scene_id": 4610,
  "series": "The Last Day",
  "title": "Jonathan Agassi, Will Helm, and Kriss Aston's Threesome in Ibiza"
}