{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Jonathan Agassi is suspicious about the coming end of days -- he investigates the island paradise looking for clues about the disappearance of all the inhabitants. What he finds is the hideout of Damien Crosse, a sociopath with one goal in life: to become the most famous person there ever was. With the help of his right-hand man, Rafael Carreras, they stage the communications transmission that sets Ibiza to panic. When they’re done with him, the anchorman is killed and the duo celebrates. In a dark storage room built from cold cinder blocks, the two Cuban madmen begin feverishly kissing and tearing their clothes off. Rafael’s pants are the first to come down, and Damien wastes no time bending over and sucking him off. This isn’t any meek blowjob: Damien aggressively slurps, strokes, and sucks on Rafael’s huge, erect, 10-inch Cuban cock, who groans and grabs Damien while he’s fast at work. Damien eventually opens his throat up completely and deep-throats Rafael’s notorious cock, a task not easy but one Damien pulls off time and again. The guys switch positions and Damien leans against the wall, his own fat cock hard and alert. Rafael gobbles him up, causing Damien to moan in his gravely and dangerous voice. His hard, flexing body looks like a work of art throughout the action. Rafael is known for being a power-top, and it’s no surprise when he takes Damien over to the storeroom’s window and bends him down. Rafael’s tongue digs deep into Damien’s asshole; he even flaps his mouth and lips in between Damien’s ass cheeks! When Damien is ready, he takes Rafael’s hard cock deep into his body, who starts by fucking him slow and gains momentum with each thrust and pound he delivers. It’s difficult at first, but Damien learns how to accept the pain as pleasure. But the power dynamic shifts and Damien throws Rafael onto a bed and eats out his ass before sticking his dick inside the Cuban. Rafael isn’t used to being on the bottom, but there’s no place to go as Damien fucks him like a crazed dog. Rafael clutches the cot and squirms as Damien mounts and pounds him. The two madmen culminate their secret fuck with hot cumshots!",
  "models": [
    {
      "name": "Damien Crosse",
      "person_id": null
    },
    {
      "name": "Rafael Carreras",
      "person_id": null
    }
  ],
  "release_date": "2012-03-30",
  "scene_id": 4611,
  "series": "The Last Day",
  "title": "Rafael Carreras and Damien Crosse Drain Their Uncut Cuban Cocks"
}