{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Issac Jones manages to escape from Adriano Carrasco after their dangerous and sizzling encounter and reunites with Will Helm and Kriss Aston. They find Jonathan Agassi at the docks where he intends to confront the crazed mastermind Damien Crosse. But Damien gets the upper hand and leaves Jonathan to drown in the waters of Ibiza. Issac refuses to allow that to happen and finds the courage to rescue his friend, and when Jonathan is free he pursues Damien. He follows him to the bar of Bruno Fernando Gutierrez, a thug drowning his sorrows in booze. Jonathan walks into the bar, but instead of fighting with Bruno, he seduces him by saying he wants to have sex. Bruno is also hungry for sex and alcohol, so Jonathan uses it to his advantage. Jonathan strips his clothes off and soaks his cock in beer before turning around and sticking the head of the bottle up his ass, the only lubrication being alcohol. Bruno loves the crazed attention and rushes to eat out Jonathan’s beer-soaked ass before taking off his shirt and pulling down his pants. His cock is big, fat, and hard, and Jonathan knows what he has to do with it. He sets onto it with a hot and hard blowjob, sucking the piece of meat thrust in his face. But it’s Jonathan’s ass that Bruno wants, and goes for it again with another tongue bath before bending Jonathan over a bar table and fucking him straight up the ass. Jonathan said he wanted to have sex and sex alone, so that’s exactly what Bruno delivers to him: Bruno treats Jonathan like a whipped animal as he pumps and pounds his hole. Bruno gets tired of doggy style and sits Jonathan right on top of his cock and lets him ride until they both cum an explosion! With Bruno drained and tired, Jonathan easily overpowers and restrains him as he runs toward the final showdown with Damien. Whose last day will it be?",
  "models": [
    {
      "name": "Bruno Fernandez Gutierrez",
      "person_id": null
    },
    {
      "name": "Jonathan Agassi",
      "person_id": null
    }
  ],
  "release_date": "2012-04-27",
  "scene_id": 4613,
  "series": "The Last Day",
  "title": "Jonathan Agassi Rides Bruno Fernandez Gutierrez's Hard Dick"
}