{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Montreal’s gay nightlife has a flashy tradition of lavish dance clubs and open bars loaded with alcohol. But the real fun happens behind the scenes as DJ Brandon Jones teaches us when the dark, sexy Edji Da Silva steals him away from the dance floor and pulls him back stage. Edji slams Brandon against the wall, holds his arms above his head and starts kissing him, whispering that before too long, he’s going to fuck Brandon hard. They take their shirts off and compare chests: Brandon’s body is gorgeous, lean and toned with every muscle sculpted. Edji is thicker and stronger, which matches his dominant personality. Edji pulls Brandon deeper into the darkness of the backstage where he takes off his pants and presents his erection to Brandon. Instead of returning to the floor, he opens up his throat and swallows Edji, servicing every inch the Arabic Parisian has to offer. Edji finds an empty booth after the club shuts down and bends Brandon over, eating out his ass before rubbing his erection along Brandon’s ass crack, teasing him with what’s to come. Edji stuffs his fat cock down Brandon’s throat again before slipping on a condom and bending the toned DJ over and smearing his ass with lube. Brandon wants Edji to give it to him, and he does just that. Edji doesn’t hold back as he starts thrusting deep into Brandon. Each thrust causes the bottom to moan; Brandon’s made it his job to please Edji, and when he rolls onto his back with his legs spread eagle, the Arabic top penetrates him deep, only to pull out and enter again. All of the fucking and sucking brings Edji to climax, and he blasts his cum into Brandon’s mouth!",
  "models": [
    {
      "name": "Brandon Jones",
      "person_id": null
    },
    {
      "name": "Edji Da Silva",
      "person_id": null
    }
  ],
  "release_date": "2012-04-06",
  "scene_id": 4723,
  "series": "Open Bar",
  "title": "Lucas Exclusive Edji Da Silva Hammers Brandon Jones' Ass"
}