{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "It’s going to be a great weekend getaway: that’s a fact as far as young, smooth hotshot Tate Ryder is concerned. When he and his hunky pal Vito Gallo arrive, they take their bags upstairs to their room before meeting up with their other friends. While on the stairs, Vito gets a different idea and grabs hold of Tate’s arm. Why rush? This is their weekend to relax and have fun. While on the stairs they begin making out and pulling off their clothes; Tate’s shirt is the first to come off, and he’s quick to pull up Vito’s and tease his nipples with his lips and tongue. Tate takes down Vito’s pants, and no sooner are they past his waste that his massive cock is poking out. The monster dick is a challenge Tate is more than excited to take on: he opens wide, loosens his throat up, and wraps his lips around Vito’s head and shaft as he settles in to give the sexy power-top a deep, tonsil-tickling blowjob. Tate loosens his pants up to let his own hard cock have some air, but Vito wastes no time dropping to his knees and eating up the bottom’s smooth, cut dick while admiring its shape and size. Tate turns around, bends over, and presents his puckering hole to Vito, who points his tongue out and lathers the sphincter with saliva. With Tate teased and exited, Vito treats him like the needy bottom he is and bends him over the railing: if he knows what’s good for him, he best be prepared to handle what Vito has to offer. It’s difficult at first -- Vito’s size and girth is considerable, and Tate winces and grits his teeth as his hands wrap around the railing. But he loosens up and allows Vito to fuck him all the way up his ass. Vito sits down on the steps and Tate sits down on him! The pair of hot guys moves to the living room where Tate gets fucked on his back until they both blow their cum!",
  "models": [
    {
      "name": "Tate Ryder",
      "person_id": null
    },
    {
      "name": "Vito Gallo",
      "person_id": null
    }
  ],
  "release_date": "2012-04-30",
  "scene_id": 4819,
  "series": "Cabin Retreat",
  "title": "Lucas Exclusives Vito Gallo and Tate Ryder Milk Their Cocks for Cum"
}