{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Johnny Venture is a showoff that deserves admiration: while vacationing at the log cabin in the woods with the rest of his hot guy pals, he’s showering with the stall partially open. On display are his rugged good looks, six-pack stomach, and fat cock (which is so thick it looks like a beer can). It’s routine that during his early morning showers Johnny jerks off so he can make it out the door with a clear mind, but his session is interrupted this morning when Ben Driver sneaks into the bathroom to take a piss. Johnny is happy to see Ben, a guy he always thought was cute, and with his big floppy dick hanging out of his pants over the toilet bowl, Johnny can’t take his eyes off of it. If Johnny wants it, he’s not going to say no, so Johnny drops to his knees and opens wide to show what he’s capable of. Ben is nearly 10 inches and thick, so Johnny has no choice but to prove his mettle as he works on the shaft and head with his hands and mouth, delicately taking care of Ben’s foreskin during the process. The guys are really hot for each other and start making out -- Johnny gives Ben a taste of his own dick as they kiss -- until Ben falls to his knees and opens up his mouth to suck on Johnny’s thick, fat cock. Johnny bends over the tub and puckers his asshole for Ben to eat out, giving him a small sampling of what he’s capable of. Leaning over the tub and clenching his teeth, Ben finally gives the showering stud what he was after all along -- a deep ass fucking! Ben promised to go gentle, but he and Johnny have different definitions of the word! Ben’s body is toned and lean, and he knows how to thrust his massive cock as Johnny takes it, loving every second! Johnny even takes control of the scenario: with Ben on his back, he hops on and takes control of the monster cock, pumping his hole up and down on it until they’re both ready to blast their cum, and there is plenty of it!",
  "models": [
    {
      "name": "Ben Driver",
      "person_id": null
    },
    {
      "name": "Johnny Venture",
      "person_id": null
    }
  ],
  "release_date": "2012-05-21",
  "scene_id": 4822,
  "series": "Cabin Retreat",
  "title": "Ben Driver Plows Johnny Venture"
}