{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "It’s a rainy evening in Manhattan when Rafael Carreras bumps into Aaron Blake as he wanders out of a porn shop. He’s looking to get off, and when he and Rafael lock eyes, they both know exactly what they want: each other! Rafael takes Aaron back to his apartment where they simultaneously make out and peel off their jackets and clothes. Aaron’s hands won’t leave Rafael’s cock alone as it grows hard in his white briefs. Aaron gets Rafael out of his clothes save his briefs and white wifebeater top -- it’s a look that brings out Rafael’s rich golden skin, making him all the hotter. As they kiss, Aaron’s hand continues to work on Rafael’s cock until he drops to his knees and sucks on his stiff uncut meat. As the sexy bottom boy sucks and swallows, Rafael feels up his body. Once Aaron is stripped naked, Rafael lays him down and tastes his cock; all the while he is running his hands along the hottie’s lean muscular body! Rafael’s lips and tongue move down from Aaron’s cock and balls to his hole where he proceeds to eat him out, prepping his hole for Rafael’s meat. Aaron is on his back and throws his legs up in the air when Rafael is ready to slide in. All of Rafael’s 10 inches of uncut cock are a lot to take at first, but Aaron relaxes himself and lets the Cuban top ease in after awhile. Once Rafael is in Aaron, he rides him rhythmically before totally wrapping his arms around him and lifting him up. Rafael stands tall and thrust into Aaron as he’s cradled! Eventually he sets him down and rides his ass doggy style until they shoot their hot cum!",
  "models": [
    {
      "name": "Aaron Blake",
      "person_id": null
    },
    {
      "name": "Rafael Carreras",
      "person_id": null
    }
  ],
  "release_date": "2012-05-25",
  "scene_id": 4949,
  "series": "Cock Riders",
  "title": "Aaron Blake Rides Rafael Carreras' Uncut Dick"
}