{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Johnny Venture is rough trade that is always horny. When he’s not scoring for cash, he’s looking around to see who he can bend over and fuck like a dog for the sheer fun of it. Ryan Russell catches his eye as he’s groping his crotch in an ally known for its seedy activity. A few deep, hard kisses lures Johnny back to Ryan place, where they are free to get into each other completely. After making out and pulling their shirts off, Johnny shows off his compact, worked-out body for Ryan. They pull out their packages (though they’re still wearing white briefs) and Ryan feels around to find out what he’s in store for. Johnny plays it cool, but he knows he’s got a cock hidden in his underwear that’s thicker than a cannon, and he’s always ready to blast off in a hot guy’s mouth! Ryan can’t wait to test his skills, so he pulls down Johnny’s underwear and starts sucking on Johnny’s dick, who leans back and simply enjoys the ride. They switch positions and Johnny opens his throat up for Ryan’s hard uncut cock -- he even pumps his face for a while! In a flip-flopping turn of events, Ryan first plays with Johnny’s hole, which is one of the smoothest and tightest in the gay industry! But this bud isn’t going to be plucked tonight: it’s Johnny who rolls the condom on and situates Ryan on his hands and knees. Johnny is into fucking, so when he enters Ryan he’s anything but gentle. Ass pounding, hole slamming -- it’s what Johnny is into, and Ryan at times doesn’t know if he can take it. Just watch the clenching expressions on his face. Johnny flips him around position after position until they’re ready to bust their loads!",
  "models": [
    {
      "name": "Johnny Venture",
      "person_id": null
    },
    {
      "name": "Ryan Russell",
      "person_id": null
    }
  ],
  "release_date": "2012-06-11",
  "scene_id": 4985,
  "series": "Drain Your Load",
  "title": "Johnny Venture Drills Ryan Russell's Hole"
}