{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Both Tate Ryder and Will Helm are young, handsome, and full of energy, and when they start sucking on each other it’s hard to pry them off their cocks. Will Helm returns for a second go-around with Cuban porn star Damien Crosse: they romantically suck each other’s cocks overlooking the sea. Rafael Carreras and Leo Helios swallow each other’s cocks while they take a bath together -- all of the water and soap makes them slippery and ready to suck. Ben Brown and Scott Carter prepare each other’s cock with some deep and sensual sucked on the beach. Jessie Colter opens up his throat for Jean Franko’s huge uncut cock. Adam Killian drops his dress pants for his business partner, Cavin Knight, to suck his cock after a long day in the office. If John Magnum wants a promotion, he’s going to have to first orally pleasure his boss, Jeremy Bilding -- it’s guaranteed to be a treat! And Arpad Miklos shoves his cock down the throat of his subordinate, Steven Daigle.",
  "models": [
    {
      "name": "Arpad Miklos",
      "person_id": null
    },
    {
      "name": "Ben Brown",
      "person_id": null
    },
    {
      "name": "Damien Crosse",
      "person_id": null
    },
    {
      "name": "Issac Jones",
      "person_id": null
    },
    {
      "name": "Jean Franko",
      "person_id": null
    },
    {
      "name": "Jeremy Bilding",
      "person_id": null
    },
    {
      "name": "Jessie Colter",
      "person_id": null
    },
    {
      "name": "John Magnum",
      "person_id": null
    },
    {
      "name": "Jonathan Agassi",
      "person_id": null
    },
    {
      "name": "Leo Helios",
      "person_id": null
    },
    {
      "name": "Rafael Carreras",
      "person_id": null
    },
    {
      "name": "Scott Carter",
      "person_id": null
    },
    {
      "name": "Steven Daigle",
      "person_id": null
    },
    {
      "name": "Tate Ryder",
      "person_id": null
    },
    {
      "name": "Will Helm",
      "person_id": null
    }
  ],
  "release_date": "2012-09-07",
  "scene_id": 5302,
  "series": "Cock Suckers",
  "title": "Lucas Men Work Out Their Jaws on Huge Dicks"
}