{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Adam Killian is a gay porn star of a near legendary proportions, but he is tested when having to nearly unhinge his jaw to swallow up Vito Gallo’s cock. Jonathan Agassi takes not one dick but two as he swallows Kriss Aston and Will Helm in an old fort overlooking the island of Ibiza. Rafael Carreras and Damien Crosse sneak away to a warehouse where they get their uncut Cuban cocks hard for swapping some deep blowjobs. Issac Jones is held captive, and the only way he’s going to be able to free himself is to use his mouth to pleasure Adriano Carrasco’s big, floppy dick. Bruno Fernandez Gutierrez shoves his huge fat cock down Jonathan Agassi’s throat. Both Adam Killian and Jonathan Agassi pair up with each other where they strip out of their suits and 69 one another. Jonathan just can’t get enough, as he hosts a suck-fest threesome with Giuseppe Pardi and Rob Nelson. Harry Louis unleashes his big fat uncut cock for Hugo Martin to suck. And blond hunks Aaron Mark and Carsten Andersson suck each others cocks.",
  "models": [
    {
      "name": "Aaron Mark",
      "person_id": null
    },
    {
      "name": "Adam Killian",
      "person_id": null
    },
    {
      "name": "Adriano Carrasco",
      "person_id": null
    },
    {
      "name": "Bruno Fernandez Gutierrez",
      "person_id": null
    },
    {
      "name": "Carsten Andersson",
      "person_id": null
    },
    {
      "name": "Damien Crosse",
      "person_id": null
    },
    {
      "name": "Giuseppe Pardi",
      "person_id": null
    },
    {
      "name": "Hugo Martin",
      "person_id": null
    },
    {
      "name": "Issac Jones",
      "person_id": null
    },
    {
      "name": "Jonathan Agassi",
      "person_id": null
    },
    {
      "name": "Kriss Aston",
      "person_id": null
    },
    {
      "name": "Rafael Carreras",
      "person_id": null
    },
    {
      "name": "Rob Nelson",
      "person_id": null
    },
    {
      "name": "Vito Gallo",
      "person_id": null
    },
    {
      "name": "Will Helm",
      "person_id": null
    }
  ],
  "release_date": "2012-09-24",
  "scene_id": 5304,
  "series": "Cock Suckers",
  "title": "Lucas Entertainment's Hottest Oral Sex Shots"
}