{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Jessy wakes up and while Jonathan is still asleep he sneaks out and heads to Mitchell’s photo shoot. His temptation and guilt continue to lead him into delusion but Mitchell’s attraction only heats up. After Mitchell is done photographing his models Alex Marte, Adam Killian and Trenton Ducati, him and Jessy leave to explore the beautiful beaches. Adam, Alex, and Trenton head outside and spread out their towels to soak up some sunshine: they’re always anxious to further bronze their sculpted muscular bodies. But the guys don’t even allow themselves to lie down and relax. They quickly move from admiring each other’s physiques to kissing. Adam lands in the middle of their mutual affection; Trenton runs his hands all over his muscular ass while Alex kisses him and pulls out his hard uncut cock, which Adam slips into his mouth. Trenton takes off Adam’s Speedo and wraps his lips around the thick shaft that is revealed. Adam happily bottoms and services the two tops at once; Alex and Trenton are towering walls over muscle standing over Adam as he sucks on both their hard fat cocks. Alex and Trenton stand Adam up and reward him for his hard work: Trenton sucks on Adam’s cock once more while Alex works on his legendary ass -- he tickles Adam’s tight hole with his eager tongue. A daisy chain forms soon after: Trenton eats out Adam’s ass while Alex moves behind him and licks him clean. With all of the guys prepped for penetration, Adam is the first to get fucked. He sits down on Trenton’s big dick and bounces up and down while Alex stuffs his own cock into Trenton’s mouth. Adam turns into a double-stuffed whore when he spreads out on his back: Trenton continues to fuck his ass while Alex grabs his face and pumps his mouth. Trenton surrenders his hole next, and Adam is the one who takes it: he fucks Trenton on a ledge overlooking a stunning view of the sapphire-blue Aegean Sea. Alex decides he’s ready to fuck some ass himself, so the guys move over to the pool: Adam sits down for a blowjob while Alex takes Trenton from behind and pounds his ass. After they’re done fucking the cum bursts from their cocks! But these three aren’t the only men getting naked. As we see local Mitchell Rock showing Jessy the beaches of Mykonos and seducing him to let go of his relationship and enjoy what he can offer. Jessy reluctantly gives in but there comes a high price for his infidelity. Jessy begins to reflect into himself but journey becomes intense as he opens his eyes and begins to feel everything. But the man in the mirror starts to shattered quickly as it is man against himself.",
  "models": [
    {
      "name": "Adam Killian",
      "person_id": null
    },
    {
      "name": "Alex Marte",
      "person_id": null
    },
    {
      "name": "Trenton Ducati",
      "person_id": null
    }
  ],
  "release_date": "2012-09-28",
  "scene_id": 5396,
  "series": "Awake",
  "title": "Adam, Alex, and Trenton Suck Cock and Flip-Fuck"
}