{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "D.O., one of the hottest hunks ever to slam dudes in the ass on camera, has decided that Lucas Entertainment is the perfect place where he will be surrendering his own hole for the first time ever. The lucky guy to pop his cherry is none other than Hot Rod, a black hunk with beautiful eyes, a killer body, and one of the biggest cocks around. After Adam introduces the stars and talks to them for a bit, D.O. and Hot Rod can't contain themselves anymore and begin kissing and exploring each other's bodies. D.O. pulls down Hot Rod's tight red briefs and starts throating his huge cock, letting it slide far into his mouth until he gags. Hot Rod and D.O. flip back and forth sucking each other off harder than the last. The guys move over to rimming, and D.O. first eats out Hot Rod's chocolate hole before the black stud bends him over and gives him a deep lathering and tongue fucking. When D.O. is prepared and can't take it anymore, Hot Rod slides on a condom and then slips into D.O.'s tight hole doggy style. All D.O. can do is bend over and rest his head on the bed while D.O. thrusts deep inside of him. D.O. moans and groans while clutching at the sheets, which only encourages D.O. to penetrate deeper and harder! D.O. flips over onto his back so Hot Rod can jackhammer him while jerking his own cock. After D.O. reaches his limit and can't handle it anymore he puts on a condom himself and flips Hot Rod onto his back, and he is not gentle at all as he pounds him hard, deep, and long -- showing the mocha stud exactly what it's like to take a huge dick! Hot Rod and D.O. slam each other so hard they blast geysers of cum at the end of their romp!",
  "models": [
    {
      "name": "D.O.",
      "person_id": null
    },
    {
      "name": "Hot Rod",
      "person_id": null
    }
  ],
  "release_date": "2012-10-19",
  "scene_id": 5514,
  "series": "Auditions 48: Popping D.O.'s Cherry",
  "title": "D.O. Bottoms for the First Time"
}