{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Lucas Entertainment Exclusive Seth Treston and his boyfriend Billy Santoro flew all the way from Seattle to New York City to demonstrate exactly what they’re made of as porn stars. And that’s by breaking Lucas Entertainment’s mold and having anal sex together without condoms for the first time in the studio’s history! Housed in a beautiful Manhattan apartment, Billy and Seth walk around in their underwear, enticing each other into a soft and passionate session of kissing. After his lips are wet, Seth falls to his knees and starts sucking on Billy’s thick cock. Billy can never get enough of Seth’s ass, so the couple moves to the sofa where Seth teases Billy’s cock with some gyration -- and Billy teases Seth’s hole with some wet rimming. Billy sticks his fingers inside Seth, prompting him to grab his boyfriend’s cock with these words on his lips: “I want it.” If he wants it, he shall have it -- raw. Billy penetrates Seth skin-on-skin, and with all of the top’s moaning, it’s evident how incredible the bareback feeling is. After awhile Seth doesn’t ride Billy as hard as he’d like. “You’re teasing me,” he says, which leads him to stick his dick inside Seth deep and pound him hard! The couple doesn’t shy away from sex positions: they try them all out in their raw bareback sex romp. Billy Santoro pumps Seth Treston long and hard, and when he can’t hold on anymore, he releases his load deep inside Seth’s ass. Afterward, Billy grabs Seth and demands that he push the cum out, which he licks right out of the bottom’s puckering hole! When the two are spent they whisper to one another, “I love you.”",
  "models": [
    {
      "name": "Billy Santoro",
      "person_id": null
    },
    {
      "name": "Seth Treston",
      "person_id": null
    }
  ],
  "release_date": "2013-09-06",
  "scene_id": 6776,
  "series": "Bareback Lovers",
  "title": "Premiere Bareback Sex Starring Exclusive Seth Treston and Billy Santoro"
}