{
  "collections": [
    "Lucas Entertainment"
  ],
  "description": "Saucy Cuban Rafael Carreras' retirement from the hardcore gay porn industry hasn't lasted long: the Lucas Entertainment team is in Ibiza, and Rafael was free to have a chat with Slovak hunk Jay Roberts, who gets hotter and hotter every time he appears on camera. Rafael's sizzling Cuban blood heats up the lust between these two hot guys right away -- Rafael lays back as Jay uses his lips and tongue to worship the Cuban's smooth, tanned skin. The boys pull each other's pants off and begin grinding in their white brief underwear, their dicks growing and getting hard. Rafael is an ass man, and he enjoys tearing down Jay's underwear and slipping his finger into his tight asshole, testing what he's going to be fucking soon. But first he gives his bottom some service with an excited blow job, sucking and teasing Jay's cock and foreskin; he's not afraid to work his hand while sucking, and Jay loves it, throwing his arms back and closing his eyes in ecstasy. Jay can't resist getting Rafael's cock in his mouth, so he unleashes the uncut monster and starts to suck on the Cuban's meat. They flip back and forth using their wet lips to service each other until Rafael's worked up enough that all he craves is sliding into Jay's ass. First he teases it, poking and sliding his shaft along Jay's crack. When ready, Rafael rolls on a condom and plunges his cock deep inside Jay, who can do nothing but thrust his ass up and take each pelvic slam Rafael has to offer. Rafael Carreras is at his best when he's fucking a guy, and Jay is a passionate and willing bottom. When he's on his back, he's moans and groans as Rafael grabs a hold of him and drills hard and deep -- the sweat is rolling off their gorgeous bodies! At the climax of their steamy encounter, Rafael and Jay squirt their cum all over the bottom's body!",
  "models": [
    {
      "name": "Jay Roberts",
      "person_id": null
    },
    {
      "name": "Rafael Carreras",
      "person_id": null
    }
  ],
  "release_date": "2013-11-06",
  "scene_id": 6958,
  "series": "The Rafael Carreras Collection",
  "title": "Rafael Carreras Proves He's the Best Top to Jay Roberts"
}