{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 3462934
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "It's a hot day in the office and everyone's got the same idea for how to deal with it. Alura Jenson and Riley Mitchell are both indulging in a little strip-down in their separate offices, oiling themselves up and getting all hot and bothered. Tragedy strikes and opportunity knocks when Alura trips and falls through the wall separating their offices. Instead of letting a little unexpected office maintenance get them down Alura and Riley start fooling around while Alura's stuck in the wall, Alura sucking Riley's long hard cock while he \"tries\" to get her out. When Nathan Styles comes in to talk to Alura about work he's shocked to discover the steamy scene taking place, however when he realizes there's room for one more in their wall-bound booty worship he eagerly joins in, fucking Alura's hungry pussy while Riley slides into his tight ass. The three hotties take turns fucking, sucking, licking and sticking themselves into each other until they reach their explosive climax drenching the office in an absolute geyser of squirt, cum and sweat.",
  "models": [
    {
      "name": "Alura TNT Jenson",
      "person_id": 2407
    },
    {
      "name": "Nathan Styles",
      "person_id": 57319
    },
    {
      "name": "Riley Mitchel",
      "person_id": 56269
    }
  ],
  "release_date": "2019-08-23",
  "scene_id": 4365091,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Big Ass",
    "Bubble Butt",
    "Thick",
    "Voluptuous",
    "Italian",
    "Blonde",
    "High Heels",
    "Garter Belt",
    "Bald Pussy",
    "Innie Pussy",
    "Medium Skin",
    "Black Stockings",
    "Huge Tits",
    "Enhanced",
    "Piercing",
    "Tattoo",
    "Muscular",
    "American",
    "Brown Hair",
    "Short",
    "Big Dick",
    "Average Dick",
    "Sex",
    "Threesome",
    "Cum on Pussy",
    "Cum Shot",
    "Handjob",
    "Blowjob",
    "Face Fuck",
    "Pussy Fingering",
    "Indoors",
    "Twink",
    "Anal",
    "Bareback",
    "Big Tits Worship",
    "Bisexual",
    "Doggystyle",
    "Doggystyle - Standing",
    "Missionary",
    "Oil"
  ],
  "title": "Bisexual Breakthrough"
}