{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 3788454
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "When Dante Colle comes in for an interview at Argos Santini and Brook Page's innovative technology he's feeling calm, cool and ready to do whatever it takes to lock down his dream job. Dante knows all of the right things to say to impress the two high-powered executives, but they're not willing to give him an offer until he shows that he's exactly as committed to innovation as he claims to be. Argos and Brook tell Dante to put a vibrating butt plug into his tight hole and from their phones they control it as he tries to show off his office administration skills. Before long it becomes clear that these horny head honchos have a lot more on their mind than just testing Dante's secretarial skills as they invite him to take part in a hot and heavy bisexual three-way right there in the interview room. Dante hungrily sucks Argos' hard cock and licks Brook's pussy, desperate to please the tech giants with his eager body, and they match him with their ferocious sexual appetites until all three are ready to innovate each other all the way to climax!",
  "models": [
    {
      "name": "Argos Santini",
      "person_id": 57167
    },
    {
      "name": "Brook Page",
      "person_id": 9045
    },
    {
      "name": "Dante Colle",
      "person_id": 17408
    }
  ],
  "release_date": "2019-11-29",
  "scene_id": 4405692,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Sex",
    "Threesome",
    "Rimjob",
    "Blowjob",
    "Face Fuck",
    "Oral Train",
    "Pussy Licking",
    "Indoors",
    "Office",
    "Anal",
    "Bareback",
    "Big Tits Worship",
    "Bisexual",
    "Cowgirl",
    "Doggystyle",
    "Doggystyle Blowjob",
    "Fuck n Lick",
    "Missionary",
    "Reverse Cowgirl",
    "Reverse Cowgirl BJ",
    "Anal Toys",
    "Sex Toys",
    "Blouse",
    "Skirt",
    "Medium Ass",
    "Tattoo",
    "Athletic",
    "Caucasian",
    "Blonde",
    "High Heels",
    "Trimmed Pussy",
    "Innie Pussy",
    "Medium Skin",
    "Big Tits",
    "Enhanced",
    "Piercing",
    "Tattoo",
    "Muscular",
    "American",
    "Brown Hair",
    "Short Hair",
    "Average Dick"
  ],
  "title": "Anal Innovation"
}