{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 3788458
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "Tall and fit Kirk Cummings knows he's in trouble when he shows up late for his anniversary with nothing to show for it but some gas station roses. The blonde sex pot Lisey Sweet isn't going to let her husband's laziness go unpunished, so she lures him into the bedroom and teases him with her round and perky tits before blindfolding him. While Kirk is blindfolded, Lisey brings in the hung ebony stud Dillon Diaz and starts giving him a deep blowjob, slurping and spitting on his big cock in front of her husband. When Kirk realizes what's happening he prepares to storm off, but Lisey and Dillon put him in his place, reminding him that he could learn something by watching what a real man can do with Lisey's perfect pussy. Lisey and Dillon tease the punished husband, fucking his mouth with a big strap-on dildo before putting it on top of his cock, showing him all that he's missing out on by not giving her the treatment she deserves. Soon, Kirk can't contain himself anymore and admits that he loves the way he's being treated, letting Dillon shove his hard cock deep inside of him while his wife rides his face to control his moaning.",
  "models": [
    {
      "name": "Dillon Diaz",
      "person_id": 55463
    },
    {
      "name": "Kirk Cummings",
      "person_id": 39365
    },
    {
      "name": "Lisey Sweet",
      "person_id": 27276
    }
  ],
  "release_date": "2019-12-13",
  "scene_id": 4408833,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "2 on 1 (2 Males)",
    "Threesome",
    "Cum Shot",
    "Facial",
    "Ass Licking",
    "Blowjob",
    "Blowjob - Double",
    "Deep Throat",
    "Gagging",
    "Pussy Licking",
    "Bedroom",
    "Indoors",
    "Anal",
    "Bareback",
    "Bisexual",
    "Interracial",
    "Cowgirl",
    "Doggystyle",
    "Doggystyle - Standing",
    "Fuck n Lick",
    "Missionary",
    "Reverse Cowgirl",
    "Reverse Cowgirl BJ",
    "Blindfold",
    "Dildo",
    "Sex Toys",
    "Strap-on",
    "Medium Ass",
    "Piercing",
    "Tattoo",
    "Average Body",
    "Caucasian",
    "Blonde",
    "High Heels",
    "Thong",
    "Trimmed Pussy",
    "Outie Pussy",
    "Medium Skin",
    "Nude Stockings",
    "Small Tits",
    "Natural Tits",
    "Tattoo",
    "Muscular",
    "American",
    "Brown Hair",
    "Short Hair",
    "Average Dick",
    "Black",
    "Black Hair"
  ],
  "title": "Get Fucked, Cuck"
}