{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 3904644
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "Wolf Hudson and his beautiful babe Keira Croft are sneaking in some heavy petting in the steam room at their gym. The brown haired hottie can't resist Wolf's sweat slick body, kissing and grinding on him. Little do the flirty couple know, but they have a fan in the tall, chiseled Bama Romello! The ebony adonis watches the couple, getting worked up after his workout by the sight of them. When Bama's surprised by his boyfriend, he tries to play it cool but once all four are in the steam room he can't resist staring as Kiera stealthily strokes Wolf's cock under his towel. Bama's boyfriend doesn't want to play ball, so Bama decides that if he wants to play with the bisexual babes he'll have to do it very carefully. Keira starts sucking Wolf's thick cock, showing off her ass for Bama as she gags and slurps on the massive rod. Keira shows how much she likes being watched by turning and taking Bama's cock down her throat, the boyfriend blissfully unaware of the rapidly escalating bisexual orgy developing beside him. When the boyfriend can't take the heat he gets out of the steam room, leaving the horny hotties to really get wild. The guys take turns slamming their cocks into Keira's perfect pussy, the whole gang going wild on each other until Wolf gets a chance to slide his cock deep into Bama's ass. Bama moans into Keira's wet pussy, pleasuring her just as much as Wolf is pleasuring him. Keira climbs on Bama's back, stacking the two hungry holes on top of each other for Wolf to use. This wood hot house won't be the only thing steaming up while you watch this wild and uninhibited bisexual fuck fest!",
  "models": [
    {
      "name": "Bama Romello",
      "person_id": 64940
    },
    {
      "name": "Keira Croft",
      "person_id": 57346
    },
    {
      "name": "Wolf Hudson",
      "person_id": 56435
    }
  ],
  "release_date": "2020-02-21",
  "scene_id": 4411583,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Piercing",
    "Tattoo",
    "Muscular",
    "American",
    "Brown Hair",
    "Shaved",
    "Average Dick",
    "Bikini",
    "Small Ass",
    "Piercing",
    "Tattoo",
    "Athletic",
    "Caucasian",
    "Black Hair",
    "Trimmed Pussy",
    "Innie Pussy",
    "Medium Skin",
    "Medium Tits",
    "Natural Tits",
    "Black",
    "Black Hair",
    "Short",
    "Big Dick",
    "Sex",
    "Threesome",
    "Cumshot Clean-Up",
    "Cum Shot",
    "Handjob",
    "Nipple Play",
    "Ass Licking",
    "Blowjob",
    "Blowjob - Double",
    "Deep Throat",
    "Face Fuck",
    "Gagging",
    "Oral Train",
    "Pussy Licking",
    "Indoors",
    "Sauna",
    "25-34",
    "Anal",
    "Bareback",
    "Bisexual",
    "Caught",
    "cheating",
    "Interracial",
    "Ass Stacking",
    "Doggystyle",
    "Doggystyle - Standing",
    "Doggystyle Blowjob",
    "Flip Flop",
    "Reverse Cowgirl",
    "Stand And Carry"
  ],
  "title": "Stuffed in the Steam Room"
}