{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 3904642
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "European beefcake Tomm struts into the locker room, his big white robe hiding his furry torso and a massive hard-on. When he spots Sarah Key in a sexy black dress, seemingly out of place in the men's change room he approaches her and soon she's gently sucking and kissing his massive cock. A few feet away, the pair have an admirer in the bushy bearded Jerry. Jerry watches the two horny hotties, stroking himself as they play with each other's bodies before slowly approaching them. Tomm invites Jerry to taste his dick and the sexy chiseled stud is quick to take him up on the offer.  The trio play together, Tomm stroking Sarah's pussy as she tongues Jerry's cock and balls, before moving to the shower where they can make things even steamier. Sarah keeps her red stilettos on as her and Tomm take turns servicing Jerry's throbbing cock then pops her leg up to give Tomm access to her wet and ready pussy. The boys need more though, so she straps on a thick purple dildo and lets them take turns slobbering on it before she pops it into Jerry's hungry hole. Jerry rides Sarah while stuffing Tomm's dick into his mouth, loving every second of getting used from both sides. After Sarah's opened him up, Jerry gets drilled by Tomm, letting the dark haired stud fuck the cum out of him right there on the shower floor.",
  "models": [
    {
      "name": "Jerry",
      "person_id": 66331
    },
    {
      "name": "Sarah Key",
      "person_id": 29977
    },
    {
      "name": "Thomas Friedl",
      "person_id": 56495
    }
  ],
  "release_date": "2020-02-07",
  "scene_id": 4411000,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Dress",
    "Small Ass",
    "Tattoo",
    "Athletic",
    "Caucasian",
    "Brunette",
    "High Heels",
    "Thong",
    "Bald Pussy",
    "Outie Pussy",
    "Medium Skin",
    "Small Tits",
    "Natural Tits",
    "Tattoo",
    "Muscular",
    "European",
    "Brown Hair",
    "Shaved",
    "Average Dick",
    "Bear",
    "Short",
    "2 on 1 (2 Males)",
    "Sex",
    "Threesome",
    "Cum On Ass",
    "Cum Shot",
    "Handjob",
    "Blowjob",
    "Blowjob - Double",
    "Deep Throat",
    "Face Fuck",
    "Oral Train",
    "Bathroom",
    "Indoors",
    "Shower",
    "25-34",
    "Anal",
    "Bareback",
    "Bisexual",
    "Ballerina",
    "Reverse Cowgirl",
    "Reverse Cowgirl BJ",
    "Side Fuck",
    "Side Fuck BJ",
    "Sex Toys",
    "Strap-on"
  ],
  "title": "Strap Him in the Shower"
}