{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 3934173
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "Muscular Damien Stone is such a bad boy. Stealing a silicone ass at a sex shop, really? Luckily, the hottest cop in town, Nicholas Ryder, is here to bring the criminal to justice... that is, until he decides to fuck the stolen fake ass himself. Not even hiding from the handcuffed Damien, he steadily pounds the silicone toy. He can't contain himself, and in the excitement, he grabs the nearest curtain and rips it off the window. Nicholas gets a phone call and has to leave the interrogatory room. However, a hot police babe comes in. Well, well, looks like black haired Megan Maiden wants to be fucked by Nicholas too! She completely ignores Damien, strips down and hides under the curtain. Nicholas comes back and as soon as he starts banging Megan's pussy, he feels how better the real thing is. What a plot twist when Megan uncovers herself and pretends to arrest Nicholas, only to fill his eager asshole with a huge baton. Yes, the police force isn't what it used to be. It's Megan's turn to get a phone call and leave the room, but not before giving keys to Damien so he can free himself and... run away, right? WRONG! Damien wants to have a taste of Nicholas' ass too! The cop is still bending over the table, waiting for Megan's baton. He gets Damien's meat instead and doesn't hate it at all. When Megan comes back, she's happy (and fucking horny) to see that Damien did not flee. The steamy threesome and cumfest that follow will have you wondering what the word \"justice\" truly means.",
  "models": [
    {
      "name": "Damien Stone",
      "person_id": 39832
    },
    {
      "name": "Megan Maiden",
      "person_id": 67991
    },
    {
      "name": "Nicholas Ryder",
      "person_id": 40278
    }
  ],
  "release_date": "2020-03-13",
  "scene_id": 4412520,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Muscular",
    "American",
    "Black Hair",
    "Short",
    "Criminal",
    "Average Dick",
    "Tattoo",
    "Brown Hair",
    "Police",
    "Cap",
    "Tank Top",
    "Small Ass",
    "Piercing",
    "Tattoo",
    "Athletic",
    "Caucasian",
    "Black Hair",
    "Police",
    "Boots",
    "Thong",
    "Bald Pussy",
    "Innie Pussy",
    "Medium Skin",
    "Small Tits",
    "Natural Tits",
    "Sex",
    "Threesome",
    "Cumshot Clean-Up",
    "Cum Shot",
    "Facial",
    "Bondage",
    "Handjob",
    "Kinky",
    "Masturbation",
    "Sneaky",
    "Blowjob",
    "Face Sitting",
    "Pussy Licking",
    "Spanking",
    "Indoors",
    "Police Station",
    "25-34",
    "Anal",
    "Bisexual",
    "Work Fantasies",
    "Doggystyle - Standing",
    "Doggystyle Blowjob",
    "Missionary",
    "Missionary BJ",
    "Handcuffs",
    "Sex Toys"
  ],
  "title": "Pass The Baton"
}