{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 3946650
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "When burly hunk Wolf Hudson heard he had new neighbors moving in, he never would have dreamed that it would be a sexy young couple like Michael Jackman and Cytherea. Wolf spies on the ripped jock Michael as he unpacks some boxes, savoring every peek of the brown haired stud's chiseled body. Wolf hides when he spots Cytherea, thinking that the long auburn haired hottie might be mad at the peeping tom, but Michael tells her that they've got an audience for their hot and heavy christening of their new bed and the beautiful Cytherea can't wait to give him a show. Michael dives deep into Cythere'as pussy, licking and kissing it as she throws her legs over her head, giving Wolf a perfect view. Wolf strokes his big hard cock as he watches the couple, getting off as he watches Cytherea's head bob on Michael's long cock. Michael brings Cytherea beside the window, fucking her up against a ladder just to give the horny shaved-headed stud the perfect view of his cock slamming in and out of Cytherea's tight pink pussy. Michael rails Cytherea until her legs are shaking with pleasure, but Cytherea isn't finished, she tells Michael to put on his coat and head over to Wolf's apartment. Wolf hungrily pulls Michael into his apartment and spreads the tall hunk's legs, slamming his huge cock into the horny bisexual dude's ass as he gasps and moans. Cytherea watches from next door, stroking herself as she works herself towards an explosive squirting orgasm all over the window! Wolf can't believe it and he's so turned on that he has to blow his own load all over Michael's eager face.",
  "models": [
    {
      "name": "Cytherea",
      "person_id": 23828
    },
    {
      "name": "Michael Jackman",
      "person_id": 56473
    },
    {
      "name": "Wolf Hudson",
      "person_id": 56435
    }
  ],
  "release_date": "2020-03-27",
  "scene_id": 4412854,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Socks",
    "T-Shirt",
    "Small Ass",
    "Tattoo",
    "Athletic",
    "Caucasian",
    "Latina",
    "Red Head",
    "Trimmed Pussy",
    "Innie Pussy",
    "Medium Skin",
    "Medium Tits",
    "Natural Tits",
    "Tattoo",
    "American",
    "Shaved",
    "Average Dick",
    "Brown Hair",
    "Short",
    "Sex",
    "Threesome",
    "Cumshot Clean-Up",
    "Cum Shot",
    "Facial",
    "Kissing",
    "Masturbation",
    "Squirt",
    "Voyeur",
    "Anal Fingering",
    "Ass Licking",
    "Blowjob",
    "Pussy Licking",
    "Bedroom",
    "Indoors",
    "25-34",
    "Twink",
    "Bisexual",
    "Couples Fantasies",
    "Doggystyle - Standing",
    "Missionary",
    "Side Fuck"
  ],
  "title": "Welcome to the Neighborhood"
}