{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 4280633
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "Barrel-chested beefcake Mam Steel comes home to find his girlfriend, raven-haired femme fatale, Sherly Quinn tied to the bed with some sexy wrist restraints. Ever obliging, Mam quickly releases her only to find the tables turned when Sherly quickly binds him to the bed instead! Mam's surprised, but he's certainly not complaining when Sherly pulls down his pants and starts giving him a deep and sloppy blowjob. Meanwhile, pervy voyeur Jeremy Spark watches the action unfold over a hidden camera, stroking his hard cock while the sexy couple get down to business. Sherly slips a blindfold onto Mam as she swallows his meaty cock, just in time for Jeremy to arrive and give the stud an unexpected treat. Jeremy gives mam's cock a sensual lick, taking turns with Sherlyas they both worship Mam's body. When Sherly takes off Mam's blindfold he doesn't want to admit how much he loves the feeling of another man's lips around his cock, but when Jeremy starts slurping his shaft again his eyes roll back in ecstasy. Sherly lets Mam suck and lick her perfect tits as Jeremy's cock worship continues. Sherly hops onto Mam's cock, riding it as she sucks Jeremy's cock, the tattooed beauty loving every second with both men using her body. Sherly decides its time to unleash the beast, in more than one way. Jeremy uncuffs Mam as Sherly returns to the room with a big black strap-on, ready to introduce Mam's butt to the world of pegging. Sherly fucks the submissive stud as Jeremy pops his cock into his mouth, the trio passionately plugging each other in a bisexual fuck fest. After getting railed by Sherly, Mam watches as Jeremy slides behind the sexy woman and ferociously fucks her tight pussy. With Sherly's hungry hole satisfied, the guys come together to shower her ass with their hot white loads in a sexy splattering finale.",
  "models": [
    {
      "name": "Jeremy Spark",
      "person_id": 40750
    },
    {
      "name": "Mam Steel",
      "person_id": 23054
    },
    {
      "name": "Sherly Quinn",
      "person_id": 73251
    }
  ],
  "release_date": "2020-07-31",
  "scene_id": 4416909,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Piercing",
    "Tattoo",
    "Muscular",
    "American",
    "Blond Hair",
    "Short",
    "Big Dick",
    "Bear",
    "Brown Hair",
    "Average Dick",
    "Medium Ass",
    "Tattoo",
    "Average Body",
    "Caucasian",
    "Black Hair",
    "Briefs",
    "Bald Pussy",
    "Innie Pussy",
    "Medium Skin",
    "Medium Tits",
    "Natural Tits",
    "Sex",
    "Threesome",
    "Cum On Ass",
    "Cum Shot",
    "Handjob",
    "Blowjob",
    "Deep Throat",
    "Face Fuck",
    "Bedroom",
    "Indoors",
    "25-34",
    "Anal",
    "Bisexual",
    "Doggystyle",
    "Doggystyle Blowjob",
    "Missionary",
    "Missionary BJ",
    "Reverse Cowgirl",
    "Reverse Cowgirl BJ",
    "Blindfold",
    "Bondage",
    "Sex Toys",
    "Strap-on",
    "Pegging"
  ],
  "title": "A Bit Of Both - Part 4"
}