{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 4280632
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "Beefcake hunk Chase has been called in to do some repairs on the office that horny couple Alice Paradise and Derek share. The kinky couple watch as Chase bends over, inspecting their radiator rod but all they can think about is checking out his. Before the muscular maintenance man leaves Derek and Alice propose a little bit of fun together and soon Alice is taking Chase's big uncut cock down her throat while her horny husband watches. Derek isn't content to remain a voyeur and soon he's bending the knee to lick and suck Chase's thick dick, too. The two hung hunks bend Alice over a chair and stuff her from both sides, Derek hungrily watching as Chase pounds Alice's pussy and eager for his chance to take the handyman's tool for a ride. Once he's warmed up by Chase, Alice gets her taste of Derek's ass, fucking him with a big strap-on while Chase stuffs her from behind. Whatever's broken when these three meet each other is certainly fixed by the time Derek and Chase are blasting their twin loads all over Alice in the climax of this frisky bisexual romp.",
  "models": [
    {
      "name": "Alice Paradise",
      "person_id": 72411
    },
    {
      "name": "Chase",
      "person_id": 40701
    },
    {
      "name": "Derek",
      "person_id": 40398
    }
  ],
  "release_date": "2020-07-17",
  "scene_id": 4416746,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "American",
    "Brown Hair",
    "Short",
    "Average Dick",
    "Piercing",
    "Average Body",
    "Skirt",
    "T-Shirt",
    "Small Ass",
    "Tattoo",
    "Athletic",
    "Caucasian",
    "Brunette",
    "High Heels",
    "Bald Pussy",
    "Outie Pussy",
    "Medium Skin",
    "Medium Tits",
    "Natural Tits",
    "Sex",
    "Threesome",
    "Cum on Tits",
    "Cum Shot",
    "Handjob",
    "Kissing",
    "Blowjob",
    "Blowjob - Double",
    "Deep Throat",
    "Face Fuck",
    "Pussy Fingering",
    "Titty Fuck",
    "Indoors",
    "Office",
    "25-34",
    "Anal",
    "Bisexual",
    "Work Fantasies",
    "Doggystyle",
    "Doggystyle - Standing",
    "Doggystyle Blowjob",
    "Sex Toys",
    "Strap-on"
  ],
  "title": "A Bit Of Both - Part 3"
}