{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 4280630
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "Muscular stud Ryan introduces his new girlfriend, the fiery petite redhead Lydia Moser, to his oldest friend, Dylan. When Lydia hears that the two beefy dudes used to get up to some wild stuff in college, she's hungry for a demonstration. Lydia tells the guys that she'll strip for them if they'll give her a show. Dylan and Ryan kiss while Lydia watches, taking off her top to show off her perky tits and sexy tattoos. Everybody wants more and soon Lydia is watching the boys grope each other's hard cocks while she slides off her panties. Dylan drops to his knees and wraps his lips around Ryan's thick cock, cradling and stroking his balls while Lydia teases her wet pussy. The guys invite Lydia in on the action as they take turns fucking her mouth with their matching massive cocks. Lydia gets spit-roasted by the horny jocks, moaning as they stuff her pussy and mouth. Lydia has a surprise for Dylan though as she reveals a long, thick strap-on that she slides into his tight ass. Lydia and Ryan take turns pounding the tall muscular dude's hole until his eyes are rolling into the back of his head with ecstasy. This sexy trio can't get enough of each other, climaxing in a set of sticky facials that will make you want to catch up with some college friends ASAP.",
  "models": [
    {
      "name": "Dylan",
      "person_id": 40412
    },
    {
      "name": "Lydia Moser",
      "person_id": 72531
    },
    {
      "name": "Ryan",
      "person_id": 22863
    }
  ],
  "release_date": "2020-06-19",
  "scene_id": 4416034,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Muscular",
    "American",
    "Brown Hair",
    "Short",
    "Average Dick",
    "Blouse",
    "Small Ass",
    "Tattoo",
    "Petite",
    "Caucasian",
    "Red Head",
    "Bald Pussy",
    "Outie Pussy",
    "Pale Skin",
    "Small Tits",
    "Natural Tits",
    "Sex",
    "Threesome",
    "Cum Shot",
    "Facial",
    "Handjob",
    "Blowjob",
    "Blowjob - Double",
    "Deep Throat",
    "Face Fuck",
    "Indoors",
    "Kitchen",
    "Living Room",
    "25-34",
    "Anal",
    "Bisexual",
    "Doggystyle",
    "Doggystyle - Standing",
    "Fuck n Lick",
    "Side Fuck",
    "Dildo",
    "Sex Toys",
    "Strap-on"
  ],
  "title": "A Bit Of Both - Part 1"
}