{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 3691834
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "Sexy brunette Sarah Kay is sad because she can't keep her cute boyfriend Jeffrey Lloyd interested. The couple seek the help of their trusted friend, the tall and handsome Ezra Gibson who provides a sensitive ear and a thick cock to help the couple work through this rough patch. Jeffrey sucks Ezra's big cock from soft to hard, working it with his lips and tongue as Ezra strips off Sarah's tight pink bodysuit. Ezra sucks on Sarah's beautiful nipples while Jeffrey takes the throbbing rod all the way down his throat. It's a nonstop chorus of pleasure as the trio take turns tasting and teasing each other, Jeffrey wrapping his hands around the back of Sarah's head as he helps her take his entire cock while Ezra greedily tongue fucks Jeffrey's hole. Soon Ezra is riding Jeffrey's huge cock, letting it slam into his tight ass while Sarah blows him. Sarah wants her turn too, sliding Jeffrey's cock into her dripping pussy before letting Ezra suck it with the condom still on. The sexy MMF threesome goes and goes as the horny trio explore every possible combination before busting their thick loads all over each other in an epic fuck fest for the ages.",
  "models": [
    {
      "name": "Ezra Gibson",
      "person_id": 59572
    },
    {
      "name": "Jeffrey Lloyd",
      "person_id": 61762
    },
    {
      "name": "Sarah Kay",
      "person_id": 62594
    }
  ],
  "release_date": "2020-08-07",
  "scene_id": 4417374,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Piercing",
    "Muscular",
    "European",
    "Brown Hair",
    "Short",
    "Big Dick",
    "Tattoo",
    "Black Hair",
    "Body Suit",
    "Small Ass",
    "Tattoo",
    "Athletic",
    "Czech",
    "Brunette",
    "Bald Pussy",
    "Outie Pussy",
    "Medium Skin",
    "Small Tits",
    "Natural Tits",
    "Sex",
    "Threesome",
    "Cum Swap",
    "Facial",
    "Handjob",
    "Ass Licking",
    "Blowjob",
    "Deep Throat",
    "Face Fuck",
    "Oral Train",
    "Pussy Licking",
    "Indoors",
    "Living Room",
    "18-24",
    "25-34",
    "Anal",
    "Bisexual",
    "Cowgirl",
    "Cowgirl Blowjob",
    "Doggystyle",
    "Reverse Cowgirl",
    "Reverse Cowgirl BJ"
  ],
  "title": "Bi Cuckold #03 Scene 1"
}