{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 4645509
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "Vicky Love knows exactly how to get what she wants, and when she wants to see her boyfriend Steven getting fucked in the ass by beefy stud Micky Bold she proposes an ultimatum, either the twink rides the square jawed stud's thick cock or she'll put a massive black dildo in his tight ass. Steven decides that he wants the real thing and lets Micky shove his hand down his pants and roughly fondle his cock while the trio kiss and stroke each other. Soon Micky has his cock out and Steven slurps and worships it while Vicky teases him with her beautiful tits, bobbing his head up and down on the meaty rod while he gets ready for the pummeling his hole is about to take. Steven hops onto Micky's cock and lets it slide all the way into his hole while Vicky takes Steven into her mouth, overwhelming the brown-haired dude with pleasure as he gets it form both side. Vicky wants it all though and soon Micky is slamming her pussy while she moans in ecstasy as her cuckolded boyfriend watches the jock railing his girl. The horny bisexual three way builds and builds until al three are ready to climax, moaning and grinding all over each other until they've all reached the heights of pleasure.",
  "models": [
    {
      "name": "Micky Bold",
      "person_id": 60832
    },
    {
      "name": "Vicky Love",
      "person_id": 62604
    }
  ],
  "release_date": "2020-09-25",
  "scene_id": 4418889,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Average Body",
    "European",
    "Brown Hair",
    "Short",
    "Big Dick",
    "Dress",
    "Small Ass",
    "Athletic",
    "Hungarian",
    "Brunette",
    "Thong",
    "Trimmed Pussy",
    "Outie Pussy",
    "Medium Skin",
    "Small Tits",
    "Natural Tits",
    "Sex",
    "Threesome",
    "Cum Shot",
    "Facial",
    "Handjob",
    "Kissing",
    "Blowjob",
    "Blowjob - Double",
    "Deep Throat",
    "Face Fuck",
    "Pussy Licking",
    "Indoors",
    "Living Room",
    "25-34",
    "Anal",
    "Bisexual",
    "Rough Sex",
    "Doggystyle",
    "Side Fuck",
    "Side Fuck BJ"
  ],
  "title": "Bi Cuckold #03 Scene 4"
}