{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 4645515
    }
  ],
  "collections": [
    "WhyNotBi"
  ],
  "description": "Charlie Red is a sexy redhead with an appetite that knows no boundaries. She teases and strokes her tight pussy getting dripping wet as she works herself into a frenzy and soon we understand why. Charlie has been hooking up with her boyfriend but she's got someone else on her mind, her burly stepbrother Thomas Friedl. When Thomas interrupts the couple to intimidate the new guy, Kevin is shocked to see just how close these two step-siblings are as Thomas starts groping and fingering Charlie right in front of the confused twink. However, Kevin can't deny how hot the two are together and starts hungrily eating out Charlie while Thomas massages her gorgeous tits. Kevin can't stop at just Charlie though and soon he's eagerly licking and sucking Thomas' massive cock and balls, sharing it with his girlfriend as they playfully experiment with this bisexual scenario. Soon the trio are taking turns sucking and fucking, Kevin taking Thomas' dick deep into his tight ass while Charlie teases him. The sexy perverts slam and slurp their way to total erotic bliss as they cum together in a three way bisexual blow-up!",
  "models": [
    {
      "name": "Charlie Red",
      "person_id": 58530
    },
    {
      "name": "Kevin Jade",
      "person_id": 63756
    }
  ],
  "release_date": "2020-10-02",
  "scene_id": 4419023,
  "series": [
    "Why Not Bi"
  ],
  "tags": [
    "Dress",
    "Small Ass",
    "Piercing",
    "Tattoo",
    "Athletic",
    "Czech",
    "Red Head",
    "Stepsister",
    "High Heels",
    "Thong",
    "Bald Pussy",
    "Outie Pussy",
    "Medium Skin",
    "Small Tits",
    "Natural Tits",
    "Average Body",
    "European",
    "Brown Hair",
    "Short",
    "Step-brother",
    "Average Dick",
    "2 on 1 (2 Males)",
    "Sex",
    "Threesome",
    "Cumshot Clean-Up",
    "Cum Swap",
    "Facial",
    "Masturbation",
    "Ass Licking",
    "Blowjob",
    "Blowjob - Double",
    "Oral Train",
    "Pussy Licking",
    "Indoors",
    "Living Room",
    "18-24",
    "Anal",
    "Bisexual",
    "Cowgirl",
    "Doggystyle",
    "Fuck n Lick",
    "Side Fuck",
    "Side Fuck BJ"
  ],
  "title": "Bi Stepbrothers 5: Scene 1"
}