{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 77989
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Dirk Caber is visiting Ty Roderick in his humble apartment. He's surprised by it's coziness, and although there's a friendliness here, there's also a feeling of uneasiness in this meeting. It becomes clear that this is Dirk's first time, as he tries to assure Ty about his intentions, more for himself than his . He wants Ty more than anything, but Dirk is clear that if they go ahead with it his wife cannot find out. Ty is relaxed, and calm. It is apparent through his business_like demeanor that this isn't his first time at the rodeo. Ty is clear about the arrangement, articulating that as long as he's taken care of, Dirk won't need to worry.Dirk sits down next to Ty and touches his knee, hesitant, unsure. Ty moves his hand from his knee to the tenting crotch of his pants. Showing him the stiffness in his pants, what he's missing, what he could have. Ty takes Dirk by the neck tie and pulls him in, closer. He's unsure what to think, but soon lets himself go, forgetting his emotional baggage and experiencing the moment, enjoying the hard bodied young man he's kissing. Ty slowly undresses, exposing his fuzzy chest, and while making out with Dirk, he strips him of his shirt and his tie. Ty grabs Dirk's nipple, to his the older man's surprise and delight. Ty pulls his cut cock from his pants, Dirk's cock leaking precum at the sight of it. Ty knows what he's doing, and is really knows how to push Dirk's buttons. As he climbs on top of the older man he slowly inserts his cock into his salt and pepper ass, fucking slowly but with building intensity. As he holds the Dirk close, he kisses him while he pounds deeper and deeper. He's nearly brought him over the edge, but takes a few moments break to regroup and kiss him. Moving him onto his back, Ty fucks him until he explodes all over his chest. Ty, pulls out and responds in kind with a mess of hot cum.",
  "models": [
    {
      "name": "Dirk Caber",
      "person_id": 59446
    },
    {
      "name": "Ty Roderick",
      "person_id": 63840
    }
  ],
  "release_date": "2015-08-25",
  "scene_id": 4377879,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Blowjob",
    "Daddy/DILF",
    "Anal",
    "Big Dick",
    "HD"
  ],
  "title": "Sugar Daddies Scene 3"
}