{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 77988
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Wolf Hudson is lying in bed with his boyfriend Ian Levine, but his attention is focused on his phone which is constantly pinging. Ian is getting increasingly annoyed that his boyfriend's attention on anything other than him. When Wolf tells him that he has to message the man on the other side of the phone if he wants to pay his rent, Ian gets angry and jealous. Ian is familiar with having to work all the time and not have any money, and Wolf explains that older men can sometimes want to feel involved in a younger man's life. And, they can show an interest in helping younger guys out. When Ian learns that he has sex with these men, he gets insecure, but Wolf reminds Ian how much fun they have and tickles him. They kiss passionately, lovingly. Wolf climbs on top of his younger boyfriend dry humping him, slowly removing Ian's clothes. Wolf sucks the bottom boy's dick and wets his ass, moving back to the dick slowly sucking up and down.Ian climbs up on top of his older boyfriend in a 69 and sucks Wolf's long dick, cherishing every inch, getting his ass ready for it. Wolf slowly inserts his giant dick into his younger partner, and flips him over, working it in till he can take every inch. Ian loves the attention, and the dick feels so right. Wolf fucks his boy on his side and they both explode on Ian's stomach. Post coitus Ian asks him if he's turning tricks, but Wolf tells him it's just Sugar Daddies. Jealous that he gets to have sex with other people, while he's faithful, Wolf has the perfect solution...",
  "models": [
    {
      "name": "Ian Levine",
      "person_id": 60092
    },
    {
      "name": "Wolf Hudson",
      "person_id": 64052
    }
  ],
  "release_date": "2015-08-18",
  "scene_id": 4377860,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Rimjob",
    "Anal Play",
    "Blowjob",
    "Daddy/DILF",
    "Anal",
    "HD"
  ],
  "title": "Sugar Daddies Scene 2"
}