{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 78500
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Tommy Defendi is outside shirtless, smoking a cigarette when Duncan Black comes out to talk with him. Duncan's fiancee made him stay in the other room and now she's gone! Duncan wonders if Tommy has any idea where she is. He explains that their engagement is over, and that Duncan's an idiot because she's probably with her ex who she's been texting her the whole time they've been there. <br><br>Tommy laughs at Duncan when he says she is the love of his life, and believes he did his sister a favor by breaking them up. Tommy doesn't belive he can be blamed, because Duncan knew exactly what he was doing the night before when he told him about his experiences. Duncan leaves to angrily pack his bags, hurt. Tommy comes in to express his apologies. The boys begin to make out, and Tommy pushes Duncan down on the bed, pulling off his shirt and pants and kisses on his nipples. <br><br>Duncan sucks on his cock, and climbs up on Tommy, he fucks the younger guys's ass, Duncan riding it up and down. Duncan lies down on his back as he gets fucked by Tommy. He keeps ramming Duncan flipping him this way and that, he gazes into his eyes, longingly as he fucks Duncan. He's close so he slows it down and moves duncan onto his back. As he keeps fucking him, he takes the younger man's cock in hand, getting him hard as a rock and he soon cums all over himself. Tommy pulls out of him and finishes all over Duncan's his tight abs.",
  "models": [
    {
      "name": "Duncan Black",
      "person_id": 58540
    },
    {
      "name": "Tommy Defendi",
      "person_id": 63412
    }
  ],
  "release_date": "2015-09-29",
  "scene_id": 4377949,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Mature",
    "Rimjob",
    "Anal Play",
    "Blowjob",
    "College",
    "Hairy",
    "Straight Guy",
    "Anal",
    "Bisexual",
    "Caught",
    "Gay",
    "Boyfriends",
    "HD"
  ],
  "title": "His Sister's Lover Scene 4"
}