{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 79012
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Osiris Blade and Adam Russo meet in the hall as Osiris exits the bathroom, water droplets from the shower glistening on his chiseled ebony frame. Adam can't help but stare, but he can't give in to the temptation of his daughter's boyfriend. Chatting briefly about changing, he exits awkwardly. <br><br>Sexual tension is palpable as Adam asks Osiris why he invited him up to the cottage. Expecting the conventional reason he's surprised when, placing his hand on his girlfriend's father's shoulder, Osiris leans in to kiss him. Showing him the selfish reason, but leaving Adam conflicted. <br><br>Unsure of how he's feeling, Adam needs to go. His daughter, Osiris' girlfriend who was watching from outside, slams the front door and leaves too in angry disbelief. <br><br>After a time Osiris goes to Adam's house. Osiris knows what he feels and wants. Taking charge, he kisses Adam. Pressing himself to the older man, they strip each other down. Adam kisses Osiris' dark nipples before exposing his hardening cut black dick by pulling down his pink briefs. <br><br>Adam takes it into his mouth, moving his mouth up and down Osiris' length. Sucking on his balls, Osiris moans with satisfaction. Adam climbs on top of Osiris who moves his mouth over Adam's cut cock, ready for Adam's face fucking. Osiris rolls him over sensually kissing, Adam whimpering in delight. Osiris' tongue makes its way down to his daddy hole. Rimming, wetting it as Adam responds with an equally enthusiastic ass licking, trying to force his tongue into Osiris' hole. <br><br>Osiris pushes his cock into Adam's waiting hole, fucking his pink hairy asshole with beautiful black cock. Adam grunts in pleasure and pain, taking every inch of the black God's cock, his dick squirting as Osiris pounds his prostate. <br><br>Adam climbs out from under Osiris, while Osiris teases his cock head, coaxing an orgasm from within his dick onto his chiseled abs.",
  "models": [
    {
      "name": "Adam Russo",
      "person_id": 57892
    },
    {
      "name": "Osiris Blade",
      "person_id": 62022
    }
  ],
  "release_date": "2015-10-27",
  "scene_id": 4378000,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Masturbation",
    "Rimjob",
    "Reality",
    "Anal Play",
    "Blowjob",
    "College",
    "Hairy",
    "Muscular",
    "Anal",
    "Interracial",
    "Reality Porn",
    "Big Dick",
    "HD"
  ],
  "title": "His Daughter's Boyfriend 2 Scene 4"
}