{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 116216
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "After enjoying the cold winter air, the fathers and their sons return to the house to warm up. The conversation turns to career paths, and Damon Andros' son criticizes how his mother was never able to commit to one single job. Ty Roderick, on the other hand, doesn't believe there's anything wrong with exploring different paths. Ty's father and Damon's son disagree, explaining that people need stability. When Damon finally speaks his mind, he confesses to be on Ty's side. If people want to expand their horizons to get experience and learn new things, why shouldn't they As the night comes to an end, Ty's father and Damon's son head to bed. Damon decides to stay up a little while longer to look over at some of the pictures that his boyfriend's son took. Going through them, Damon sees just how talented the boy is. Ty turn to face Damon and thanks him for having his back earlier. They glance into each other's eyes for a moment, feeling a stronger bond between each other. Then, Ty leans in to kiss his new dad. The guys are making out on the couch. Ty removes Damon's shirt and kisses his hairy chest. Clothes are coming off, piece by piece, until there's nothing left. Damon gets on his knees to suck on Ty's big dick, as the young man enjoys. Ty tries thrusting his cock down Damon's throat, choking him. They flip suck, giving Ty the chance to thank his new dad the best way he can. Damon gets on all fours, spreading his ass cheeks for the boy. Ty gets deep inside of his dad's hairy hole with his tongue. He sits back down on the couch and strokes his thick tool as Damon gets ready to swallow his cum. Ty shoots his load into Damon's mouth, sucking the rest off of the boy's cock.",
  "models": [
    {
      "name": "Damon Andros",
      "person_id": 59418
    },
    {
      "name": "Ty Roderick",
      "person_id": 63840
    }
  ],
  "release_date": "2016-05-10",
  "scene_id": 4378493,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Rimjob",
    "Reality",
    "Anal Play",
    "Blowjob",
    "Hairy",
    "Reality Porn",
    "Big Dick",
    "HD"
  ],
  "title": "Fathers And Step-Sons 4 Scene 2"
}