{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 116217
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Nick Capra is shoveling snow, when his boyfriend's son, Killian James, comes to lend him a hand. After working hard and long, the entrance is cleared and the guys move indoors to remove their sweaty clothes. When Nick takes his shirt off, he reveals his muscled pecs and beefy biceps. Killian can't help but stare at his hot new daddy, who's wearing nothing but his briefs. Killian takes his turn removing his clothes, making sure Nick gets to see his bare body. However, this horny young boy doesn't stop there. He takes his underwear off, standing completely naked in front of Nick, teasing him. Nick tries not to look, but Killian can tell he likes what he sees. So he walks up to him, and places a kiss on his dad's lips. Nick hesitates for a moment, pulling away, but the temptation is stronger than him. When Killian kisses him again, Nick forgets his worries and makes out with his boyfriend's son. The boys lie on the floor, where Killian starts to stroke Nick's tool using his mouth, sliding his juicy lips back and forth. They take turns sucking each other off, till Nick places Killian face down on the ground. He spreads the boy's cheeks and rims his tasty hole, going deep with his tongue in preparation for his big dick. Once loose, Nick takes his cock and plunges it inside of his son's ass, fucking him. He rams his tool hard and rough, making Killian moan at every thrust. Killian takes his daddy's big dick in different positions, until they lie side by side to jerk off, and both shooting their loads on themselves.",
  "models": [
    {
      "name": "Killian James",
      "person_id": 63762
    },
    {
      "name": "Nick Capra",
      "person_id": 63812
    }
  ],
  "release_date": "2016-05-17",
  "scene_id": 4378627,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Rimjob",
    "Anal Play",
    "Blowjob",
    "Daddy/DILF",
    "Anal",
    "Big Dick",
    "HD"
  ],
  "title": "Fathers And Step-Sons 4 Scene 3"
}