{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 77984
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Robert Axel is running beside Wolf Hudson in the park, encouraging him to push himself harder and harder with sets of pushups and sprints. But unluckily, Wolf soon overdoes it and they have to cut the workout short. Robert helps an injured Wolf through the doorway, laying him up on the bed with a sprained ankle. While Robert is icing down Wolf's ankle, Wolf tells him how he appreciates him and thanks him for so much he's been able to achieve he's been since he met him. Robert feels much the same way, inspired as he's watched him overcome the obstacles he's faced. Robert checks Wolf's ankle for injury, and warms it with his hands from the cold ice. He begins to slowly massage his foot, increasing the blood flow to his tender appendage. As the massage begins to creep up to Wolf's calf he is clearly enjoying the pressure. That's when Robert catches the glances Wolf is sending him, and their gazes meet. Leaning in for a kiss, Wolf takes a chance and they being to make out, tonguing each passionately. Robert climbs on top of his injured student and massages his chest while he's kissing him with building intensity. Soon they're naked, the hulking men rubbing their leaking cocks together. Wolf leans over and takes his trainer's thick black meat into his mouth, sucking up and down. Stopping the sexy blowjob for a few seconds so that he might kiss him again, Robert returns the favor, sucking on Wolf's dick and sucking on his hefty balls. Wolf moves onto his stomach and Robert begins to rim his tight hole sensually, getting his protege's ass all wet for his thick black cock. Their lips touching again every so often, Robert moves Wolf into a spooning position, giving him full access. Robert lovingly kisses Wolf's head, spooning him. Soon, Wolf needs wants to return the favor, and they flip their positions, wolf fucks his ebony trainer. It's not long before Wolf brings himself to the edge and cums over his own abs. Then he begins to make out with his trainer, sending Robert over the edge, his dick becoming a cum fountain, pulsing puddles of cum.",
  "models": [
    {
      "name": "Robert Axel",
      "person_id": 62314
    },
    {
      "name": "Wolf Hudson",
      "person_id": 64052
    }
  ],
  "release_date": "2015-08-13",
  "scene_id": 4378033,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Reality",
    "Reality Porn"
  ],
  "title": "Guys Kissing Guys Scene 2"
}