{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 115538
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Sam Truitt is led back to the basement where he is once again chained next to his comrade Ty Roderick. Ty is happy with the fact that his fellow POW was able to restrain himself from giving away vital information, but isn't so pleased that he had literally slept with their enemy. Especially rather than a comrade like himself, but Sam explains that his actions merely helped him to avoid sudden death. Curiosity piqued however, he asks Ty what he meant about not choosing his comrade instead. Realizing how ridiculous it sounds, he tells Ty to forget he ever mentioned it. How could it matter anyways, since they probably won't survive Ty assures Sam that they will be busting out of here and returning home. Suddenly, he drops the key to their chains from his mouth, grabs it, and after freeing Sam, he leans down to kiss him. The two soldiers make out, forgetting for a moment all their worries. They take off their clothes, getting completely naked on the basement floor. Sam lays on his back, with Ty on his knees fucking his mouth. He leans down for his own taste of Sam's thick cock, as they hurriedly suck each other off.Afraid of getting caught, Ty lifts his partner's legs and plunges his big dick inside of his ass. He rams his hungry hole with all his strength before flipping him over to give it to him doggystyle. Overcome with pleasure, Sam lays on his back again and jerks his thick cut tool as he watches Ty hammer his slim ass. Ty pulls his dick out of his hole and jerks it along with Sam. Both men cum in a hurried frenzy, cumming onto Sam's smooth sailor_boy stomach.",
  "models": [
    {
      "name": "Sam Truitt",
      "person_id": 62098
    },
    {
      "name": "Ty Roderick",
      "person_id": 63840
    }
  ],
  "release_date": "2016-04-26",
  "scene_id": 4378411,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Masturbation",
    "Rimjob",
    "Blowjob",
    "Hairy",
    "Soldier",
    "Anal",
    "Big Dick",
    "HD"
  ],
  "title": "Prisoner of War 2 Scene 4"
}