{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 117815
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Billy Santoro has been coaxing gays out of the closet for a long time. Josh Stone was once a typical client, too far in the closet to even fantasize about kissing a man. But now, he's out and is completely out of control! Once again he's surprised his muscular masseuse by booking an appointment under a false name.Billy's slick hands explore Josh's lower back, and his expression reveals the pleasure he experiences. When the deep tissue massage reaches an end, Billy indicates to the boy it's time to turn over. Josh has a plan to get Billy to fuck him again, but his hunky massager sees right through his sneakiness. As Billy rubs his tender quads Josh lets out moans of pleasure. After a little bit of teasing, Billy concedes and agrees to one last encounter with Josh. He quickly jerks the towel off his tenting crotch, before taking it into his mouth, sucking it hard. Billy exposes the rippling back muscles hiding from beneath his shirt, and Jimmy rubs his back. Billy begins rimming Josh's ass, his moans building in intensity as he's being eaten out. Billy's stiff cock tents his pants which he rubs against Josh's waiting ass. Making out, Josh climbs on top of a nude Billy. He sucks his cock before climbing on top of his muscular masseuse, and pushing his thick hard cock into his spit slicked ass.Bobbing up and down on Billy's cock, it isn't long before Billy really begins fucking Josh from below, pounding his eager ass. Josh's stiff cock rubs against Billy's abs. He lays him down on his back and fucks him from above. Josh is pushed over the edge by his masseuse's slow fuck, getting close and cumming all over his stomach. After fucking some more, Billy cums onto Josh's stomach in an explosive body trembling climax.",
  "models": [
    {
      "name": "Billy Santoro",
      "person_id": 59242
    },
    {
      "name": "Josh Stone",
      "person_id": 61732
    }
  ],
  "release_date": "2016-06-21",
  "scene_id": 4378670,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Masturbation",
    "Rimjob",
    "Anal Play",
    "Blowjob",
    "Hairy",
    "Muscular",
    "Anal",
    "Big Dick",
    "HD"
  ],
  "title": "Gay Massage House 4 Scene 2"
}