{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 79697
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Adam just found out he's being cheated on and the trust he had in Cutler is broken. Trying to make up, Cutler leans in to kiss his resistant partner but Adam isn't ready to forgive him. Not wanting to throw their life away, Cutler needs to convince his love he wants him back. Trying to shift blame, Cutler brings up Adam's habit of making out with other guys at bars. Adam argues it's not the same, and doesn't want to forgive, but Cutler's insistent, passionate kiss works. They embrace, pulling off each other's shirts, Cutler kissing Adam's hairy stomach and nipples. Cutler pulls off their pants, and Adam takes the girthy black dick before him into his mouth, stroking the extra length with his hand. They 69, Cutler playing with Adam's balls before licking his ass, wetting down his hole, before slowly working his thick rod into his ass, bareback. Raw fucking Adam's ass deep, his hole is worked out to the max as the whole girthy length disappears into him. Cutler pulls Adam on top, his slick dick pushing into him from another direction. Adam rubs Cutler's ebony chest as he grabs his firm ass cheeks, plunging his cock deep into him. Cutler cracks a big smile, knowing the pleasure he's bringing his boyfriend. Cutler fucks him sideways, his thick cock sliding in and out of him as Adam jerks his cock. Cutler slows down the pace as Adam is about to come, teasing him. Picking back up in intensity, Adam's eyes roll into the back of his head as he's pounded out. Adam responds with a mix of pleasure and pain, the large cock almost too much for him, but bringing him closer and closer to the edge. Adam's whole body spasms with the release, unloading onto his stomach. Cutler and Adam make out, Adam's hand caressing Cutler's thigh as his boyfriend blows his big load all over his ebony stomach.",
  "models": [
    {
      "name": "Adam Russo",
      "person_id": 57892
    },
    {
      "name": "Cutler X",
      "person_id": 59952
    }
  ],
  "release_date": "2015-11-05",
  "scene_id": 4378173,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Mature",
    "Masturbation",
    "Rimjob",
    "Blowjob",
    "Hairy",
    "Muscular",
    "Anal",
    "Bareback",
    "Interracial",
    "Big Dick"
  ],
  "title": "Real Couples Bareback Scene 2"
}