{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 114458
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Armond Rizzo wasn't expecting anyone to show up at his place tonight. Yet, someone is knocking on his door. He opens to see a man he has never seen before. After introducing himself as Billy's boyfriend, a very alarmed Armond invites Jaxton Wheeler inside for a chat. <br><br>Jaxton begins by telling him that Billy is unstable and warns him that he shouldn't mess with his head, but Armond refuses to believe anything this stranger is telling him. This only infuriates Jaxton even more. He is not happy with how Armond is treating his guest, and decides to return the discourtesy. He pushes the petite impolite boy against the wall, and requests to know where he and his boyfriend had sex. <br><br>Once in the bedroom, Jaxton throws Armond on the bed and lays his hulking frame on top of him. This is a perfect time to show this boy how to respect his elders. He kisses Armond on the neck and down his hairless body. The boy attempts to leave, but Jaxton grabs his wrists and holds them down on the bed. Trying to fight back, he finds that he is no match for this large hairy man. Jaxton unbuttons his pants and shoves his uncut cock in this youngster's mouth, fucking it. Armond tries to push him away again, but Jaxton turns the boy over on his stomach and forcefully removes his pants. He places his hands around Armond's neck and begins to pound his Latino ass. Powerfully, he shoves the boys head down on the bed, fucking him some more with his big cock. When Jaxton feels like Armond has had enough, he takes his dick out of him and cums all over him. Armond starts to jerk off and ends up cumming on himself as well. After asserting his dominance he gets up and leaves, having taught this boy a valuable lesson. Maybe now Armond will stay away from his boyfriend!",
  "models": [
    {
      "name": "Armond Rizzo",
      "person_id": 58442
    },
    {
      "name": "Jaxton Wheeler",
      "person_id": 64278
    }
  ],
  "release_date": "2016-02-23",
  "scene_id": 4379180,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "Cum Shot",
    "Masturbation",
    "Blowjob",
    "College",
    "Hairy",
    "Muscular",
    "Latin",
    "Anal",
    "Big Dick",
    "HD"
  ],
  "title": "Cheaters Scene 2"
}