{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 117410
    }
  ],
  "collections": [
    "Mile High"
  ],
  "description": "Brandon Wilde doesn't know that car troubles will be the catalyst for the most exciting sexual adventure of his life.<br><br> After being stranded on the side of the road in the middle of winter, Brandon is given the run around by road side assistance. Thinking he's completely out of luck, he's relieved when a mysterious black SUV pulls up behind him. A group of strapping young men, Jaxton Wheeler, Billy Santoro, Jack Hunter, Logan Moore and Vadim Black get out and offer to help. After a few minutes they have his car back up and running. Brandon is delighted. To thank them, he invites his knights in shining armor over to his house for a few drinks.<br><br> After some good conversation, the men begin to loosen up. It doesn't take long before they start undressing, putting their tattoos and tight bodies on display. The sexual chemistry in the air is intense; 'it's all just bros here,' one of them says. 'Your girlfriend won't even know.'<br><br> Brandon makes the first move, taking Vadim's cock in his mouth while everyone else watches. The action quickly heats up with Brandon taking center stage. There's passionate kissing, intense anal sex, and tag teamed blowjobs, finally ending with Brandon jerking off while Jack fucks him. The rest of the boys follow suit, taking turns unloading all over him while he lays beneath them, completely satisfied.",
  "models": [
    {
      "name": "Billy Santoro",
      "person_id": 59242
    },
    {
      "name": "Brandon Wilde",
      "person_id": 59726
    },
    {
      "name": "Jack Hunter",
      "person_id": 60258
    },
    {
      "name": "Jaxton Wheeler",
      "person_id": 64278
    },
    {
      "name": "Logan Moore",
      "person_id": 61128
    },
    {
      "name": "Vadim Black",
      "person_id": 63366
    }
  ],
  "release_date": "2016-06-02",
  "scene_id": 4393188,
  "series": [
    "Icon Male"
  ],
  "tags": [
    "18-24",
    "Tattoo",
    "Muscular",
    "American",
    "Black Hair",
    "Short",
    "Average Dick",
    "Cum Shot"
  ],
  "title": "Brandon Wilde's First Gangbang Scene 1"
}