{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Jason Styles finishes his laundry, new roomie Dante Martin asks him how he's coming along in his new surroundings. Jason seems nervous as Dante grills him about his past, particularly as it pertains to questions about Jason's ex-girlfriend. As he carefully answers Dante's questions, he wonders what his new roommate is trying to hint at, when Date alludes to the dildo stashed in Jason's laundry basket. Jason is embarrassed but Dante quickly assures him that it's no big deal, even confessing to Jason that he, himself, is also gay. Jason is clearly a closted case, and Dante wonders just what kind of tactics it will take to make Jason comfortable. Finally he just decides on the direct approach, asking Jason if he wants to fuck. Jason gets sheepish but Dante assures him they are safe and no one will find out, as he already starts to work his hands inside Jason's shorts. Pulling out his dick, Dante drops to his knees and begins to suck Jason off. It's been so long since Jason had any action that he almost busts his nut immediately, but he holds off, propping Dante up on the counter-top where he dives face first into Dante's ass, tonguing him from behind as he strokes his cock.With Dante more than ready to take it raw, Jason slides his hard cock inside Dante from behind and begins to fuck him standing up against the counter. Dante strokes his cock as Jason pounds away, fucking Dante with the pent up aggression of someone unleashed for the first time. Dante takes it like a champ and begs for more, mounting Jason- first normally and then flipping around to ride him reverse, as his bubble butt bounces up and down on Jason's hard, bare cock. Jason pushes him up against the wall, pounding him from behind as Dante's strokes his the jizz right out of his cock, and the sight of it makes Jason so hot that he pulls out and blasts Dante's ass with his load, before shoving it right back inside and continuing to plow away, just washing machine sounds it's buzzer on Jason's final load. Well, still have the dry cycle to go, right guys?Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Jason Styles",
      "person_id": 46660
    }
  ],
  "release_date": "2016-03-02",
  "scene_id": 114350,
  "series": "NDR - 12 - Jason Styles & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Fuck Roommates"
}