{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Luca Rosso can sense there's something a bit odd about his contractor, almost like he's hiding something. Jake Karhoff does fine work, and Luca is pleased with his services, but he just keeps acting strange around Luca. Coming back from lunch, Luca thinks he discovers the reason why, as he spies Jake rummaging through some of his stuff in the garage. Luca has no shame in his game, but he can tell the box of dildos that Jake has stumbled upon is a bit of a shocker to this wood working stud, but also, that he isn't totally turned off. So later, Luca decides to test his theory, asking Jake to help with one other job in back bedroom. Jake assures him he's the man for the job, but when he gets back into the bedroom, he doesn't seem to understand what's going on. Luca grabs him by his tool belt and pulls him closer, and Jake suddenly seems to get it.  And when Luca unzips Jake's work pants and pulls out his stiffening cock, he realizes that Jake definitely has the right tool for the job. Falling to his knees, Luca takes Jake's cock into his mouth as Jake throws his head back against the wall. Jake quickly gets with the program, and as Luca leads him over to the bed, Jake tries giving head for the first time. Luca can attest that he's a fast learner and is curious just how far Jake is willing to take it, as he pulls out one of the infamous dildos that Jake was eyeing earlier in the garage. Jake leans back and spreads his legs, as Luca slowly slips the dildo into Jake's waiting hole. Moving it back and forth, loosening up Jake's virgin ass, Luca has designs to try it out for himself, and by this point, Jake is down for whatever, so Luca removes the dildo and replaces it with his own dick, pounding Jake as he strokes himself off. Jake is unleashed, screaming for Luca to fuck him harder, and Luca is ready to burst, but first he wants to feel Jake's cock inside him, so they switch up, and Jake lays the hard lumber to Luca, fucking him from behind before flipping him over in time for both of them to spray Luca down with a hard day's worth of jizz. Turns out Jake is that rarity in a contractor: a man who talks the talk and actually delivers the wood Enjoy!",
  "models": [
    {
      "name": "Jake Karhoff",
      "person_id": 37028
    },
    {
      "name": "Luca Rosso",
      "person_id": 46612
    }
  ],
  "release_date": "2016-03-03",
  "scene_id": 114369,
  "series": "NDB - 4641 - Jake Karhoff & Luca Rosso",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Blowjob",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Oral",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Constructive Cocks"
}