{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As soldier Darin Silvers leaves to attend to some business, little does he know he's about to be invaded. Brendan Phillips is looking for an easy score, but perhaps he should have cased Darin's place a little more thoroughly, because mid-job- Darin returns and immediately notices the ladder missing from the front of the house. After completing a perimeter sweep, he discovers Brendan's point of entry and begins to search the house, weapon drawn and ready to fire. When he makes it back to his bedroom, he can see Brendan's feet poking out from behind the bed, and moments later, he's got the would-be thief on his knees with his hands behind his head. But instead of calling the cops, Darin begins to unbutton his uniform, and Brendan realizes something else is about to be broken in.Darin convinces Brendan that his best play is to do what Darin says, and as soon as Brendan agrees, Darin shoves his cock down Brendan's throat, showing no mercy as he fucks Brendan's face. Brendan sucks cock like his freedom depends on it, but if he truly wants to walk away free he's gonna have to do a little more for Brendan, who bends him over and penetrates from behind. Brendan's virgin ass takes it slowly at first, but increasingly, Brendan discovers how much he likes taking this hard cock, as Darin continues to pound away, flipping Brendan over and drenching him with a load, before shoving his cock back inside Brendan's mouth, who sucks it down and finishes him off. And as Brendan launches his own load, he realizes he not only got off, but he got off lucky. Enjoy!",
  "models": [
    {
      "name": "Brendan Phillips",
      "person_id": 38107
    },
    {
      "name": "Darin Silvers",
      "person_id": 46621
    }
  ],
  "release_date": "2016-02-26",
  "scene_id": 114453,
  "series": "NDO - 4642 - Darin Silvers & Brendan Phillips",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "HD Movies",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Breaking in a Fresh Hole"
}