{
  "collections": [
    "Icon Male"
  ],
  "description": "Billy Santoro is worried that his boyfriend suspects of his affair with Kory Houston. But Kory figures that it might be for the best, since they won't have to sneak around anymore. Their secret love affair would finally be out in the open. Nonetheless, Billy fears for their lives, seeing as his boyfriend has done time for attempted murder in the past. Taken aback by this news, Kory contemplates whether or not they should continue seeing each other. But Billy is not ready to give up on him. In fact, he would be devastated if Kory left him. Kory leans in to give him a hug, promising that he would never do such a thing. He kisses Billy on the neck, another on the cheek, and one more on the lips. As they start to make out, Billy reaches inside of Kory's pants to feel his hard on. Then, the boys take their shirts off and get right down to business. Billy unbuttons his lover's pants and pulls out his uncut dick for him to suck. As he's giving him a blowjob, Billy looks up to notice how pleased Kory is. Now it's Kory's turn to go down on his hairy guy and suck his huge cock. As he's performing oral pleasure, Kory prepares Billy's hole by massaging it with his fingers. When ready, Billy sits on his young boy's long dick, feeling his cock far inside of him. Kory looks at Billy riding his tool, before flipping him over on the bed, pounding his ass hard. Now that Kory had his moment, it's time for Billy to show him what he's got. He gets on top of Kory and slides his cock up inside him, fucking him fast and hard to the point that the bed is shaking. Kory can't help but jerk off while watching his big man fuck him. This makes him cum all over himself. But before Billy does the same, he continues to pound Kory's ass some more. When he feels like he's about to cum, Billy gets up on the side of the bed and shoots his load on Kory's stomach.",
  "models": [
    {
      "name": "Billy Santoro",
      "person_id": 35626
    },
    {
      "name": "Kory Houston",
      "person_id": 37898
    }
  ],
  "release_date": "2016-03-01",
  "scene_id": 114459,
  "series": "Cheaters",
  "tags": [
    "Anal",
    "Big Cock",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Cheaters, Scene #03"
}