{
  "collections": [
    "Icon Male"
  ],
  "description": "Josh Stone has been working hard to get back on his feet since his psychiatric diagnosis. Even his supportive tutor, Rodney Steel, has been helping him out with his homework, so he wouldn't fall behind. <br><br>When Rodney arrives at Josh's house for their weekly sessions, he finds his student on his bed, feeling miserable. Josh has made so much progress over the past few weeks and this makes Rodney question what happened. Josh explains that he was dumped by the boy he was seeing. To make him feel better, Rodney tells him that he probably needs to be with someone older, mature and who doesn't mind being with him. Then, he puts a hand on Josh's thigh and admits that he wished he was younger, because he'd be in a better position to help him. But for Josh, age isn't an issue. <br><br>Instead of working on his homework, Josh is making out with his much older tutor. Rodney takes the initiative by taking off their clothes. Each are taking turns to suck the other's cock. They get into a 69 position, where Josh sucks Rodney's big dick, while Rodney eats Josh's ass. This tutor has waited long enough. He places Josh on his back and thrusts his hard cock inside of his favorite student's hole. Rodney pounds his ass, while Josh is jerking himself off. He tells Rodney he's getting close to shoot his load, then cums all over his chest. Rodney takes his cock out of Josh's ass, and does the same. This student has now found a new kind of support from his caring tutor. ",
  "models": [
    {
      "name": "Josh Stone",
      "person_id": 46615
    },
    {
      "name": "Rodney Steele",
      "person_id": 37971
    }
  ],
  "release_date": "2016-02-18",
  "scene_id": 114461,
  "series": "Hot Daddies",
  "tags": [
    "Anal",
    "Ass Play",
    "College",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Hot Daddies"
}