{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Derek Atlas is already behind the 8 ball. His interview with club owner Brett Beckham has just begun, and already he's feeling inadequately prepared as Brett grills him on his appearance, his tardiness and his overall first impression. To be honest, Brett's not really feeling positive about hiring Derek in any capacity, and he tells Derek as much, only to see his prospective employee grovel and beg for an opportunity. Brett admires Derek's fortitude, and as Derek fights for a job, Brett sees something of himself in the newbie, so he makes Derek an offer, but in order to protect himself, his offer comes with a condition. Derek asks what the condition is and Brett places his hand on Derek's knee, running his hand up Derek's thigh closer to his crotch. Derek looks at Brett and in a moment he understands.  Willing but unsure, he tells Brett he's got a girlfriend that he doesn't want to find out. Brett tells him that's precisely what he's counting on as he begins to unbutton Derek's shirt, revealing his massive hairy chest and arms. They kiss as Brett drops to his knees, taking his cock deep down his throat and gagging on it as Derek leans back on the sofa. Brett begins to unzip his pants as he continues to suck Derek off, loosening  his own tie. Undressed now, Brett flips onto his back and gets his first glimopse at the skill-set Derek brings to the company, as Derek rocks Brett's legs high into the air, sucking him off and tonguing his hole, working Brett's balls in between. Brett is impressed with Derek's ability to improvise, and he can tell Derek is a fast learner, but what he really wants to see is Derek's ability to deliver the goods, so he mounts his new hire and gives him a test ride, bouncing on Derek's hard cock reverse as Derek watches his boss' ass bounce up and down against his stomach. Brett his hard as a rock as he grinds on Derek's cock, but Derek is not a mindless automoton, and he wants his too, so he flips Brett back over and proceeds to pound him doggy style, and then flipping again over into missionary, Derek fucking Brett like a seasoned veteran as Brett strokes his cock and comes close to losing it, finally launching jizz all over himself as Derek continues to pound away, before Derek pulls out and feeds Brett his own load in what has to be considered the wildest interview he's ever been on. As he finishes up, Brett tells him to see his tailor to be fitted for suitable attire, and tells Derek to make sure and bring his A game come Monday morning.Enjoy!",
  "models": [
    {
      "name": "Derek Atlas",
      "person_id": 46661
    },
    {
      "name": "Brett Beckham",
      "person_id": 46662
    }
  ],
  "release_date": "2016-02-25",
  "scene_id": 114488,
  "series": "NDB - 4643 - Derek Atlas & Brett Beckham",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Workplace Secrets"
}