{
  "collections": [
    "Icon Male"
  ],
  "description": "Having a mother who always puts her job before her family has given her son, Josh Stone, a chance to really bond with his step-dad, Max Sargent. Both are sitting silently on the bed. Josh breaks the silence and asks Max if he's feeling guilty about them secretly hooking up. Things are more complicated than ever for Max. He now has a decision to make; marry Josh's mother, or be with her son Josh? To help his step-dad make his choice easier, Josh leans in for a kiss. Max kisses him back, and suddenly, all of his doubts seem to disappear. They slowly start removing their clothes as they passionately make out. While Max is lying on his back, with his son on top of him, he begins warming up Josh's asshole with his fingers. Turned on by this, Josh gets on his knees and shoves his dick inside of his stepfather's mouth. Max strokes Josh's cock while sucking on it back and forth. Then Max flips his son over onto his stomach and kisses down his back all the way to his ass. When he reaches the young boy's ass, he begins eating his hole, making sure to get it ready for his huge cock. After loosening his anus, Max shoves his cock up Josh's ass, fucking his son nice and slow. Then Josh lays on his back with his legs up for Max to fuck him even deeper. Feeling Max's warm dick inside of him, Josh can't help but jerk off. Within seconds, Josh's cum sprays all over himself. Max pulls out and jerks off until shooting his load on his son's cock.",
  "models": [
    {
      "name": "Max Sargent",
      "person_id": 46614
    },
    {
      "name": "Josh Stone",
      "person_id": 46615
    }
  ],
  "release_date": "2016-03-08",
  "scene_id": 114460,
  "series": "Cheaters",
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Cheaters, Scene #04"
}