{
  "collections": [
    "Icon Male"
  ],
  "description": "Young Armond Rizzo isn't very content with the fact that Billy Santoro, the older man he's been seeing in secret, is still with his boyfriend. Feeling 'second placed', Armond feels he should tell the truth so they could finally be together. But Billy is concerned that if he tells his boyfriend that he's been cheating on him, he might get violent. Despaired, Billy lowers his head and places his hands over his face. <br><br>To comfort him, Armond leans in to kiss Billy's ear, then slowly makes his way down the neck. To forget about his concerns over his boyfriend, Billy turns his head to face Armond and makes out with him. Armond slides his hand inside of Billy's half buttoned shirt feeling his warm hairy chest. <br><br>Things get steamier when Armond decides to get on top of his man and proceeds by taking off his shirt, showing off his ripped abs and tight muscles. Clothes are flying off fast as the two get closer as they've ever been. Billy flips his young mistress onto his stomach before taking his briefs off, revealing his hot bubble butt. Unable to resist, he begins rimming that horny hole, making sure to soak it well, inside and out. With Armond's moaning, Billy can tell that this young boy wants his cock inside of him. Billy lays on top of him with his solid cock rubbing against Armond's wet hole. Billy grabs him by the back of the neck and kisses him, while massaging his lover's muscled ass and hole with his big furry hands. Armond sits on top of Billy, who's huge dick starts to penetrate him. Once inside, Billy grabs him by the waists, holds him down while he fucks him. Then he flips Armond on his back, puts his legs over his shoulders, and pounds that ass hard. <br><br>Billy gives Armond a rest, but isn't done with him yet. To sooth that hole, Billy licks and lubes it up some more before turning him on his stomach and putting his huge cock back inside. Billy now rests on top of little Armond's body, shoving his tool back inside. <br><br>Armond begins to jerk off, while Billy continues to fuck him. As he gets close to ejaculating, Armond gets on top of Billy, and cums all over his partner's hairy body. Billy pulls out his cock out of Armond and also cums on himself. They both lay still on the bed.",
  "models": [
    {
      "name": "Armond Rizzo",
      "person_id": 35573
    },
    {
      "name": "Billy Santoro",
      "person_id": 35626
    }
  ],
  "release_date": "2016-02-16",
  "scene_id": 114457,
  "series": "Cheaters",
  "tags": [
    "Anal",
    "Big Cock",
    "College",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Latino",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Cheaters"
}