{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With a knock at the door, Max King's scheme kicks into gear. Scotty Zee is a hot guy Max has been checking out at the gym, and when he found out Scotty is a massage therapist, he booked him immediately for a session. But Max isn't just looking for a relaxing massage... his real aim is to find out which way Scotty swings, and to see just how far Scotty is willing to go. As Scotty runs his hands down Max's back, Max senses that Scotty is being more than just professional, and when Scotty confirms that he had a boyfriend but is single now, Max makes his move, reaching back and cupping Scotty's cock through his pants. Scotty asks him what he's doing, and Max apologizes. Scotty assures him that he's a professional therapist, but tells Max he'll make an exception, and with that, Max reaches into Scotty's pants and pulls his cock out above the waistline, as Scotty runs his hand up Max's thigh to his taint, massaging Max's cock as he bends down to rim his client. Max closes his eyes and enjoys Scotty's technique, just as Scotty rolls him over and takes his cock into his mouth. Max grows hard inside Scotty's mouth, as Scotty deep throats Max's dick. Max is getting hotter and hotter for Scotty's cock to be inside him, so they switch up and Max sucks Scotty off until Scotty is nice and hard to do the job. Hard cock in hand, Scotty plunges his rod deep into Max who lay on the table face down. Scotty proceeds fuck Max from behind on the massage table as Max strokes himself. Scotty fucks Max just how he likes, sensual and gentle at first, and then eventually graduating to a hard pounding, and Max takes every hard inch with pleasure, until he spits his load all over himself, just as Scotty pulls out to wet him down with a second splash of jizz, just like he planned all along.Enjoy!",
  "models": [
    {
      "name": "Max King",
      "person_id": 36067
    },
    {
      "name": "Scotty Zee",
      "person_id": 46672
    }
  ],
  "release_date": "2016-03-11",
  "scene_id": 114568,
  "series": "NDO - 4644 - Max King & Scotty Zee",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Mutual Touch"
}