{
  "collections": [
    "Icon Male"
  ],
  "description": "Trying to overcome his drug addiction, young teen Tommy Regan takes a trip to a remote location with his sponsor Nick Capra. After a long walk around the lake, the boys head back to the house. <br><br>Nick grabs some sodas from the refrigerator. He tells this youth that he is proud of the progress he's made and that he'll keep supporting him even after his recovery. Touched by the man's words, he admits how grateful he is to have Nick in his life. Since they've arrived at the cottage, drugs have been the least of his cares, and that what he needed was to simply get off the merry-go-round. Nick tells him he'll find other rides, better ones. Tommy laughs and Nick realizes how sexual his answer could be interpreted. Nick tells the dirty minded boy that he can think what he likes. They both stare at each other for a moment, then Tommy walks up to his sponsor to kiss him. Nick places his hands under Tommy's shirt to feel his little tight muscles. He slides his hands up the boy's smooth body and takes his shirt off. Nick lifts him up with his big arms and carries him out of the room. Seems like Tommy found himself a better ride. <br><br>In the bedroom, Nick gently places Tommy on the bed and lays on top of him, kissing him. He stands back up to remove his shirt, while Tommy starts unbuttoning his pants to give him a blowjob. After enjoying getting his huge cock sucked, he feels like it's his turn to pleasure his boy. He starts by licking on Tommy's nipples before making his way down his body. Nick removes Tommy's pants and put his legs up to get a taste of this young boy's ass. After rimming his hole, Tommy gets in a doggy style position, letting his sponsor know he wants to get fucked. Nick accepts to give his son what he wants. He slides his big dick inside of Tommy's ass and fucks him hard. Tommy seems to enjoy getting fucked by this older man that he lays down on his back and spreads his ass cheeks. Nick continue to ram his ass. Tommy jerks off as he's getting fucked and shoots his load on his body. Nick lays down next to his young boy and jerks off until he cums on himself. Little Tommy may have a new addiction thanks to Nick.",
  "models": [
    {
      "name": "Nick Capra",
      "person_id": 35574
    },
    {
      "name": "Tommy Regan",
      "person_id": 46617
    }
  ],
  "release_date": "2016-03-03",
  "scene_id": 114543,
  "series": "Hot Daddies",
  "tags": [
    "Anal",
    "Ass Play",
    "DILF",
    "Daddies",
    "HD",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Hot Daddies"
}