{
  "collections": [
    "Icon Male"
  ],
  "description": "It has been twenty years since their last encounter. Max Sargent is feeling a little anxious seeing his old comrade-in-arms, Rodney Steele, after so many years. He opens the front door and there stands Rodney. Before words are exchanged, they hug deeply, showing just how much they've missed each other. They move to the living room, where they talk about the events in their lives over these missed out years. When Max tells him that he came out as a gay man, Rodney is a bit surprised since they both use to talk about women all the time. Nonetheless, this doesn't change how Rodney feels about him. Instead, he reaches inside of his backpack and takes out a canteen. Max doesn't quite understand at first, but Rodney explains that Max had given this to him to avoid going into shock, saving his life. He wants his savior to have it as a memory of the kind of man he used to be. He stands up, looking at Max, and expresses his love to him. In disbelief, Max stands, waiting to see what Rodney will do. And just as he'd hoped, Rodney walks over to him, kissing him.These two daddies are taking it to the next level. In the bedroom, Rodney doesn't hesitate removing his clothes first. Max takes notice of his nipples before moving down to give him a blowjob. Rodney places his hands on top of his partner's head, pushing it down so that he deep throats his uncut cock. Then these two old friends get into a sitting position, where Rodney's ass is over Max's cock. As he lowers his body, Max's big dick slowly penetrates Rodney's hungry hole. Once completely inside of him, Rodney begins to ride Max's big tool. Laying on the bed, Rodney enjoys watching his old mate fuck him that he starts jerking himself off. Max is so turned on by this, that he can't keep it in any longer. He takes his cock out and cums on Rodney balls, followed by Rodney cumming all over his stomach. It appears as if they've been waiting a very long time for this to happen. But now that it has, it was most definitely worth the wait.",
  "models": [
    {
      "name": "Rodney Steele",
      "person_id": 37971
    },
    {
      "name": "Max Sargent",
      "person_id": 46614
    }
  ],
  "release_date": "2016-02-25",
  "scene_id": 114544,
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Mature",
    "Oral/ Blowjob",
    "Safe Sex"
  ],
  "title": "Hot Daddies, Scene #03"
}