{
  "collections": [
    "Next Door Raw"
  ],
  "description": "For Johnny Torque, hard times are settling in, as he reconciles the reality that he just fucked everyone he can possibly fuck. Watching yet another scene of his get cut for lack of a bottom willing to take the pounding, Torque finds himself at a cross-roads of sorts, which is how Markie More finds him: spaced out, pondering his options, looking lost. Markie asks him what's up and Johnny tells Markie he's considering bottoming for the first time. Now anyone who has been around knows that is no minor admission, and Markie doesn't believe his own ears the first time so he makes Johnny repeat himself just to be sure. Johnny confirms that he's thinking about it, just as director Rocco informs Johnny that yet another bottom has canceled out on the Torque Experience. With his decision all but made for him, Johnny relents as Markie tells him to just go with it. They embrace and Markie quickly goes down on Johnny, sucking him until he's hot and horny to fuck. Johnny returns the favor, and they 69 each other until Markie is nice and hard, whereupon he bends Johnny over and slowly eases his raw cock inside Johnny's virgin hole. Taking it easy at first, Johnny asks if Markie is all the way in. Markie laughs and tells him it's just the tip, then proceeds to slide the rest of it in. Johnny's eyes bulge as Markie's cock resonates inside him, but he has to admit, it doesn't feel unpleasurable, and so Markie continues, boning Johnny from behind and slowly breaking him in. Johnny flips over and mounts Markie, riding the length of his hard cock up and down, stroking himself in the process. After fucking hard reverse cowboy, Markie puts Johnny in his favorite position, which is just straight missionary while Johnny strokes his cock, as Markie proceeds to fuck Johnny as hard as he can take it, and Johnny screams with every hard thrust. Johnny tells Markie to flip him back over again and he rides Markie one last time, letting loose a load years in the making as Markie continues to pound away, before Markie pulls out, blasts Johnny's hole with his own load and sticks his messy cock right back in Johnny's hole to continue the initiation. Enjoy!",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-03-09",
  "scene_id": 114677,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Torque That Ass"
}