{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Johnny Torque is one of the coolest guys at school, and a friend of Texas Holcum's brother.  When Johnny drops by to hang out with Texas's bro, Texas is home alone.  His brother went to the gym, so Johnny decides to hang out and pass some time chatting with Texas.  Johnny takes out a pornographic magazine, featuring photos of naked girls.  Johnny sees that Texas is kind of grossed out by the magazine.  This is a clear indication to Johnny that Texas MUST prefer boys.  Texas has never even had a girlfriend!  It all just adds up.  Johnny knows that the right thing to do would be to help Texas become accustomed to nice, hard dick. Johnny's begins the process by pulling out his cock and guiding Texas's hand to it.  Texas is so nervous he can barely look in Johnny's direction.  But, being the sweetheart he is, Johnny talks softly and warmly to Texas, encouraging him to relax and enjoy the experience. Soon, Texas is licking and sucking the fat dick, letting his inhibitions slowly melt.  The next step Johnny takes is removing Texas's shirt and laying him down on the kitchen table.  Johnny takes out Texas's swollen cock and returns the oral favor by slurping on Texas's ripe dick nice and deep.  When Johnny feels Texas is ready for the final step, he bends sweet Tex over the table and slides his pulsating erection into Texas's tight, virgin ass.  He works up to a good, solid pace, pounding Texas like good, older friend should.  Next, Johnny sits in a chair and lets Texas ride his dick.  Texas sure likes this a lot!  He has a bit more control than he did in the last position.  Finally, Tex lays on his back on the table and Johnny gives him a hard fucking.  Join this fun learning experience and watch Texas have his very first, but definitely not last, sexual experience with a boy!",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Texas Holcum",
      "person_id": 37600
    }
  ],
  "release_date": "2016-03-08",
  "scene_id": 114678,
  "series": "NDT - 8311 - Johnny Torque & Texas Holcum",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Facial",
    "Facial Hair",
    "Latino",
    "Oral",
    "Slim",
    "Straight Men",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "His First Dick"
}