{
  "collections": [
    "Next Door Taboo"
  ],
  "description": "As Tom Faulk vaccuums in his parents room, he finds a strange box full of sex toys. Calling out to his step-brother, Alex Greene, he brings the box into his room. Alex takes one quick look through the box's contents and concedes that it probably just belongs to his mom. Eyeing the dildos and rope, Tom seems disgusted, but Alex assures him there's nothing particularly weird about any of it. He punctuates his point by wagging a giant dildo at his step-brother, who seems confused as to why Alex seems to have so much off-hand knowledge about dildos.<br></br>Alex reveals that he's defintely played with his ass before, and mentions that it's kind of weird Tom never has, prodding his step-brother to give it a try before he dismisses it outright. Tom is skeptical, but eventually he lets his brother talk him into it, and moments later, he's ass up on all fours on Alex's bed as his step-brother takes turns inserting different dildos. <br></br>The small one is no problem, and the glass dildo felt kind of nice, but as Alex inserts his own cock, Tom quickly chooses that one as his favorite. Imagine his surprise when he turns around to discover Alex behind him, thrusting and pounding. Tom is surprised, but also realizes how good it feels and decides to just trust his step-brother and go with it, and so Alex lays him down on his back and begins to suck him off, before mounting Tom back on top of his giant cock. Tom rides his step-brother as Alex jerks him off, fucking the cum right out of this newbie, before pulling out and blasting him in the face with his first facial. And even though Tom is a noob, he takes it like a champ, which sets Alex's imagination running at all the potential trouble the two of them can get into in the future.<br></br>Enjoy!",
  "models": [
    {
      "name": "Alex Greene",
      "person_id": 37421
    },
    {
      "name": "Tom Faulk",
      "person_id": 36996
    }
  ],
  "release_date": "2016-03-10",
  "scene_id": 114652,
  "series": "NDB - 4645 - Alex Greene & Tom Faulk",
  "tags": [],
  "title": "Brotherly Playtime"
}