{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Lately, on Johnny Riley's morning runs, he's noticed a really hot guy who just so happens to run the same path at the same time. Bridger Watts has been cross-training in this area for a while, so it's actually kind of odd that he and Johnny are just crossing paths now, but if there's one thing Bridger has learned running these woodsy trails, it's when to pounce. Running up on Johnny this latest morning, Bridger slips Johnny his number before running off. Johnny finishes his jog, showers up and decides to give him a call. <br/><br/>Next thing he knows, Bridger is pushing him onto the bed, stripping him of his jeans and throat deep on his cock, taking every inch of Johnny's dick deep into his mouth. Johnny throws his head back against the bed as Bridger jerks his cock, moving up to straddle Johnny's face, and plunging his own dick in Johnny's mouth as he continues to jerk Johnny off. Johnny swallows Bridger's cock whole as Bridger fucks his mouth, but what Bridger is really after is that sweet ass, so he flips Johnny over and plunges his tongue deep in Johnny's hole, getting it nice and ready for his cock.<br><br>Bridger slips it in, pushing his weight on Johnny's back as he pounds Johnny from behind. All that running is clearly paying off, as Bridger's stamina seems limitless, fucking Johnny in any and every position he desires, before flipping him onto his back as Johnny strokes himself, Bridger fucks the cum right out of him before pulling out and blasting Johnny's face with his own load as the rain begins to fall outside Johnny's window. Looks like tomorrow they may just have to stay in instead.<br><br>Enjoy!",
  "models": [
    {
      "name": "Bridger Watts",
      "person_id": 38083
    },
    {
      "name": "Johnny Riley",
      "person_id": 38266
    }
  ],
  "release_date": "2016-03-04",
  "scene_id": 114789,
  "series": "NDO - 4646 - Bridger Watts & Johnny Riley",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Muscular",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Runners Tease"
}