{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "It's a good thing Osiris Blade is always prepared for friends to drop by.  On this occasion, his good buddies, Bam Bam and Dylan Henri happened to show up to hang out.  Osiris pulls out a deck of cards to inspire a playful attitude and enjoy some friendly, competitive fun.    Instead of playing a boring game of Old Maid, Osiris tells the guys that the game they'll be playing is a version of the classic favorite, Strip Poker!  Bam and Dylan don't protest, and before long, Bam is pulling his pants down to expose to his friends his large, swelling cock.    When Bam loses yet again in the next round of play, he finds himself with Dylan's big dick in his mouth.  That's the way it goes at Osiris's house...it's all or nothing!    After Bam Bam gets a taste of both hard cocks, Osiris lets Dylan slide his fat erection in and out of his mouth, while Bam Bam works on Osiris's boner.  From there, they switch things up so Dylan can enjoy a taste of Osiris's tight hole as Bam Bam gets a turn having his dick sucked.      This gets the trio juiced up for some fucking, so, being a gracious host, Osiris takes Bam Bam's thick cock in his eager ass.  Dylan and Bam Bam kiss passionately as Osiris takes a good banging.  Then Dylan gets in there and slams that sweet hole for a while too.    Bam Bam likes this and offers up his own tight pocket.  Dylan takes advantage and pounds him for a while.      This is an adventure that must be experienced to be believed!  Join these three as their simple card game turns into a fuck fest where everyone gets a piece of ace!     Enjoy!",
  "models": [
    {
      "name": "Bam Bam",
      "person_id": 3033
    },
    {
      "name": "Osiris Blade",
      "person_id": 37349
    },
    {
      "name": "Dylan Henri",
      "person_id": 38264
    }
  ],
  "release_date": "2016-03-01",
  "scene_id": 114755,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Black",
    "Climax",
    "Condom",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Card Decks & Hard Dicks"
}