{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Markie More cracks open fellow roomie Arad's laptop to print an email, he discovers something he was not expecting. Upon load up, a video of Arad begins streaming, and Markie realizes his roommate does cam shows for money. Watching Arad as he shows off his muscles for the camera, Markie forgets all about the email and instead unzips his pants and pulls out his cock. Stroking himself, he fantasizes about the possibility that his roomie might not be so straight afterall, and he gets lost in his fantasies, so much so that he fails to notice Arad coming in and catching him. Arad is understandably pissed at the breach of privacy, and Markie is obviously embarrassed that his cock is still hanging out and getting even harder as Arad tells him all about the camming he does for money to pay the rent. Markie touches Arad's knee and he pulls away, so Markie offers Arad the chance to skip rent altogether, and suddenly, Arad is more than willing to play nice. Whatever. Markie doesn't care if it means he gets a taste of that sweet action, and he starts at the bottom working his way up, taking Arad in his mouth and sucking him down to the base, back up to the head, before gagging on it and repeating the whole thing. Markie sucks Arad hard as a rock, as Arad fingers Markie's sweet hole, flipping him onto his back on the sofa to eat him out and moisten him up for Arad's hard cock. Once he's good and ready, Markie mounts Arad's cock, bouncing up and down on it as Arad gives his firm ass a hard smack. Arad flips Markie over into missionary and pounds away as Markie strokes himself to the brink of orgasm, but Arad has saved the hardest position for last, turning Markie over one last time and fucking the absolute hell out of him as he strokes his dick, launching his load onto the ottoman below as Arad continues to go at it, pulling out at the last second to blast his roommate's chest with a powerful load that should be good for at least 30 days of rent free living.",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-03-17",
  "scene_id": 114939,
  "series": "NDB - 4647 - Arad & Markie More",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Dark Hair",
    "Facial Hair",
    "Gay Porn",
    "Muscular",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "I Thought He Was Straight"
}