{
  "collections": [
    "Active Duty"
  ],
  "description": "This one's a real eye-opener and a cock-hardener, too!  It's our beloved veteran, Ivan James, matched up with a soldier I think will soon be winning lots of hearts, Colby Foust.  Colby is still a newcummer and doing a helluva job getting accustomed to the Active Duty way.  Boy, Ivan sure seems glad to help break him in!Colby is obviously an earnest-hearted cadet, looking to show the troop what he's made of.  The boys start out this time very slowly, pulling out their nice cocks and stroking them to work up a couple of stiff erections.  After just a bit, Colby can't contain himself any longer and asks Ivan if he wants to 'help me with this?' 'oh, YEAH,' Ivan replies, already salivating.      Claude does some nice work here, coming around from behind Ivan, getting a shot from underneath.  We see Ivan slurping down on Colby's sweet dick, and Ivan's precious, delicate balls at the same time.    The guys go back into some side-by-side stroking for just a moment before Colby returns the favor by wrapping his wet lips around that thick boner on Ivan.  This is when we get to enjoy those hot tattoos on Colby...very sexy!    Then it's time to see what Colby can really do with that beautiful cock.  Ivan bends over the bed and presents his tight, warm hole to Colby.  Claude captures a nice insertion just before Colby begins working up the intensity.  It's easy to tell Colby is seriously enjoying Ivan's tender ass.  He remarks how nice it is, with certain pleasure bubbling up in his voice as he tells Claude.  'Fuck him hard,' Claude recommends.  'Yeah, fuck me,' Ivan chimes in.    It's when Ivan goes to his back to be fucked that Colby really loses himself and shows us a little of what's to come for this strong, gorgeous recruit.  I loved watching Ivan jack his big stiffie while Colby continued to slam his hole.  I'd say this part is my favorite.  Like I said, this will be one we look back on someday and get all nostalgic.  I don't need to tell anyone that Colby certainly has potential to become an Active Duty favorite...I think for some he already has.",
  "models": [
    {
      "name": "Ivan James",
      "person_id": 37630
    },
    {
      "name": "Colby Foust",
      "person_id": 46713
    }
  ],
  "release_date": "2016-02-21",
  "scene_id": 115097,
  "series": "AD - 70 - Ivan James & Colby Foust",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "First Time",
    "Hairy",
    "Jerk Off",
    "Muscular",
    "Shower",
    "Tattoos"
  ],
  "title": "Ivan James & Colby Foust"
}