{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Fed up with his boyfriend's distant demeanor and complete neglect in the bedroom, Quentin Gainz is ready to seek the helping hand of a stranger, so he turns to the web to find himself a stud to fill in. Mark Long is more than eager for a little strange, so when Quentin finds him online and asks him over immediately, Mark jumps at the chance. Upon arrival, Quentin leads him back to his bedroom, pulling of his shorts and laying Mark back on the bed, pulling out his giant cock. Mark is much more hung than Quentin's beau, and he's all over it immediately, downing Mark's cock halfway before choking on its mass. Mark tells him to lick it up and down and Quentin does as he is told, tonguing Mark's balls and working his way up to the tip of the head, taking it back in his mouth and downing it again. Mark is ready to fuck Quentin in half, pushing him up against the wall and shoving his bare cock into Quentin. Quentin tenses up for just a moment as Mark shoves it all the way in, then eases onto it as Mark pumps the head of his cock in and out, deeper and deeper with each thrust. As Mark continues to pound away, Quentin grabs the side of the headboard and cracks a faint smile, before pushing Mark onto the bed and mounting him, grinding on his cock and taking all of it deep and hard. Once he's had his fill of that, Quentin is ready to cum, so Mark throws him into missionary as Quentin strokes himself clean. With his chest covered in his own jizz, Marki flips him over onto his knees and pounds him doggy style, fucking him harder than he has yet, just as Quentin's boyfriend comes through the door. Quentin looks him in the eye and then back over his shoulder, telling Mark not to stop. Quentin's boyfriend gives him the finger just as Mark pulls out and blasts his load all over Quentin's scandalous behind, shoving it right back in so as to keep fucking the insatiable little cheater pushing back against him with the cum-covered ass.Enjoy!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2016-03-16",
  "scene_id": 115131,
  "series": "NDR - 14 - Mark Long & Quentin Gainz",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Bareback Cheaters"
}