{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Brendan Phillips watches a cam show online, he fantasizes about having a big cock in front of him NOW! Andy Banks has been camming solo for awhile, and has quite a few loyal followers, but when he gets a direct message from Brendan, it gives him the idea to include another person in his exhibition. Brendan is definitely a hot piece of ass that Andy would like to tap, so when Brendan agrees to come over, Andy is stoked, though a bit concerned if all the cameras will throw Brendan off.</br<br>Well to his surprise, when Brendan comes over, he pulls out his own camera to record the proceedings, so Andy takes it in hand and tells Brendan to suck his dick while he films. Brendan takes off his shirt to show of his svelte figure, taking Andy's cock deep into his mouth and slobbering all over the head as Andy grabs the back of his head and fucks his mouth, then pushing him back onto the sofa to return the favor, before flipping Brendan over to get a taste of his sweet ass before filling it up with his rock hard dick. Andy moistens Brendan's hole rimming him, but Brendan is insatiable and wants the cock now, so Andy fills him up and proceeds to pump him from behind, grabbing Brendan by his waist as he pulls him in closer. Brendan strokes his dick as Andy pounds away from behind, but Andy's viewers want to see him pile drive the new guy, so Brendan positions himself on the floor as Andy hovers above him, cock in hand, before dropping the hammer on Brendan again. Andy fucks Brendan nice and hard, before moving him back up to the sofa to finish him off missionary style. Brendan strokes his cock and Andy fucks the cum right out of him, puddling up on his stomach as Andy pulls out and blasts him with a made for TV load that hits its mark and leaves Brendan in a messy state of euphoria, better than he could have envisioned.</br<br>Enjoy!",
  "models": [
    {
      "name": "Andy Banks",
      "person_id": 34758
    },
    {
      "name": "Brendan Phillips",
      "person_id": 38107
    }
  ],
  "release_date": "2016-03-18",
  "scene_id": 115189,
  "series": "NDO - 4648 - Andy Banks & Brendan Phillips",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming"
  ],
  "title": "Hard For You"
}