{
  "collections": [
    "Active Duty"
  ],
  "description": "Not long after their trousers are off, Michael tells Allen to scooch over and suck his fat cock. No arguments from Allen! Allen takes Michael's lovely erection very deep, slurping it with lots of gusto. I especially enjoyed the way Allen runs his hands all over Michael's strong, tattooed chest. He had absolutely no reservations when it came to enjoying his fellow recruits amazing body. Just a wonderful job by Allen...blowjob that is!<br/><br/>Michael goes to his knees to take a more dominant position, and uses this leverage to slap that stiff cock on Allen's open mouth and tongue. This gets Michael hungry for a taste of dick for himself, so Allen lays back and lets him get more than a mouthful. Gosh, look at the gorgeous cock on Allen! I somehow am always awestruck by his massive, wonderful cock. Michael sure does the job to the fullest here, taking the whole length, nice and slow. This leads right in to some hot 69 action, where both boys let loose, sucking fervently and jerking each other good. 'Now that feels REALLY good!' Allen tells Michael as Michael works on his swollen meat.<br/><br/>  Then we go right into some good, solid fucking. Allen bends over the side of the bed and allows Michael to slide that big dick right into his tight, hungry ass. Michael has never been scared to show a squad mate what kind of power he's capable of delivering. And with a willing and eager partner like Allen, Michael is blasting at full power!  Claude does a bang-up job of getting some wonderful shots of Allen's face while being pounded. He also sneaks underneath the boys and captures a great angle of Michael's cock going in and out of that tight hole, while Allen tugs his hard dong. HOT!!!<br/><br/>Before the glorious finish, Allen switches to his back. This leads in to a final eruption that ended up being a little bit unique from what we're used to seeing, and the credit is all due to Claude. As Michael is really getting close, putting all his effort into pumping Allen good, Claude tells him to jerk finish by 'jerking all over him.' And golly, what an amazing eruption! This is a must-see and certainly in the running for my favorite ending.",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 37870
    },
    {
      "name": "Michael II",
      "person_id": 37370
    }
  ],
  "release_date": "2016-02-28",
  "scene_id": 115190,
  "series": "AD - 72 - Michael & Allen Lucas",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Rimming",
    "Smooth",
    "Tattoos"
  ],
  "title": "Michael & Allen Lucas"
}