{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Wesley Woods has been waiting patiently at Jason Styles's grandfather's house for hours.  He can't believe he's going to be reunited with his old high school buddy!  Jason is coming home for the weekend and the two have made plans to hang out.  But Jason has NO idea how excited Wesley is!The two hug and retire to Jason's childhood room to relax and catch up.  Wesley doesn't waste too much time before telling Jason that he's recently come out to friends and family as gay.  Jason is surprised, but expresses that he's totally cool with it.  Wesley uses Jason's initial bewilderment to take advantage of the situation.  Jason says he's cool with is and even has gay friends.  Wesley reminds Jason of some of the things they'd do back in school, and asks Jason if any of those gay friends suck his dick the way he used to!  Jason is thrown off again, and a bit scared by this.  But he can't resist Wesley's handsome face and sexy moves.  He lets his old friend wrap those lips around his cock and relive an old memory.  This sucking turns into 69ing when the guys move to the bed.  Jason decides to let go of his inhibitions and sucks Wesley's big, hard cock as Wesley tongues Jason's tight, tender hole.  This leads Jason to really become very turned on.  He decides to allow Jason to fuck him.  They start out nice and slow.  Jason climbs atop Wesley and rides him, but first fitting in that massive, bare cock into his sweet, virgin ass.  Once they work up a nice pace, Wesley really begins to thrust upward aggressively.  It feels good inside Jason's hole.  As they bone, at one point, Jason's grandfather pokes his head inside the door!  Luckily, the boys were able to hide just in time.  And as soon as gramps is gone, Wesley takes Jason all the way to pleasure town for a nostalgic eruption of suppressed passion.",
  "models": [
    {
      "name": "Wesley Woods",
      "person_id": 38354
    },
    {
      "name": "Jason Styles",
      "person_id": 46660
    }
  ],
  "release_date": "2016-03-23",
  "scene_id": 115132,
  "series": "NDR - 15 - Wesley Woods & Jason Styles",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Barely Reunited"
}