{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Poor Roman Todd! Literally. Roman has a rep with his friends of borrowing money and failing to pay it back, so when his latest attempts to score a loan from one of his buds goes sour, Roman turns to his buddy's younger brother. Scotty Zee may be young, but he's not dumb, and he despite his financial woes, Roman's still a hot stud who likes a great fuck, so when Roman solicits Scotty for a loan, Scotty offers a counter-offer. Roman is wary at first but death and taxes being the only inevitably in life, it looks like Scotty's got him between a rock and hard place.Speaking of hard, Scotty unzips Roman's jeans and begins sucking him off, deep throating him so well that Roman forgets where he's at and gets rock hard. When Scotty lays back, Roman realizes he's going to have to reciprocate as part of the deal, so he sucks his first cock as Scotty closes his eyes and takes it all in. Scotty's been fantasizing about having Roman fuck his brains out for quite some time, and now that it's reality, he wants to soak in the moment, but he can't help having some extra fun at Roman's expense, so before he has Roman fuck him, he tells Roman to eat his ass and get it ready. Roman obliges and once Scotty is satisfied, he tells Roman to put it in. Roman fucks hard and indiscriminantly, which would normally be a turn-off, but it's just how Scotty wants it as Roman plows him missionary and then up against the wall in standing doggy. Scotty throws Roman back onto the bed and mounts him, riding him as he strokes his cock and then launching his load that sprays everywhere, falling off of Roman's cock and tonguing at his shaft as he loses load all over Scotty's face, thus completing the Loan for Load program.Enjoy!",
  "models": [
    {
      "name": "Roman Todd",
      "person_id": 46827
    },
    {
      "name": "Scotty Zee",
      "person_id": 46672
    }
  ],
  "release_date": "2016-03-24",
  "scene_id": 115277,
  "series": "NDB - 4649 - Roman Todd & Scotty Zee",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "My Brother's Straight Friend"
}