{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Alex Tanner watches a movie in his room, his older step-brother Dylan Knight comes in and takes away his laptop, telling him he's gotta show him something. When Dylan proceeds to just load up a bunch of big dick pix, Alex is like, 'What the fuck, bro?'Still, he has to admit Dylan has good taste in big dicks, and when he makes a remark about it, Dylan protests, telling Alex that these aren't even big dicks, and then he pulls down his pants to prove it, whipping out his massive dick that makes Alex's eyes bulge. Alex confesses that his cock isn't quite the show piece that Dylan is hauling, telling Dylan its more of a grower. Dylan takes that as an invite and immediately pounces on Alex's cock with his mouth.Alex is a little surprised, but who doesn't want a blow job, so he just goes with it, and has to admit, halfway in, that his step-brother sucks a mean dick. Alex returns the favor as Dylan sits up onto his knees, feeding Alex his giant hard cock, before flipping Alex onto his back and hoisting his legs into the air, focussing his attention on Alex's sweet hole. Dylan tongues at Alex's hole as Alex emits soft moans, which grow even louder as Dylan plunges his huge cock deep inside his step-brother.  Slinging Alex's legs over his shoulders, Dylan pounds away as Alex gets louder and louder, before bending him over and going at him from behind. Alex is stroking his cock and ready to cum, but he wants to be in control first, so he sets his step-brother onto his back and mounts him, riding him like a horse as he strokes his load out of his cock, just as Dylan pulls out and blasts him in the face with the family goo.As both brothers begin to wipe themselves clean, they agree that a gag order regarding the parents is in strict order.Enjoy!",
  "models": [
    {
      "name": "Dylan Knight",
      "person_id": 31577
    },
    {
      "name": "Alex Tanner",
      "person_id": 38001
    }
  ],
  "release_date": "2016-03-25",
  "scene_id": 115278,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Oral",
    "Red Head",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Big Brother's Big Dick"
}