{
  "collections": [
    "Active Duty"
  ],
  "description": "Well, this is one for the books for a few reasons.  First, it's an extremely hot encounter involving 3 amazing recruits. Second, it was unexpected!  As you can see, at first Claude was all set to shoot a one-on-one match up with only Colton Phobos and John.  But as fate would have it, the incredible Ivan James makes an appearance and cranks the heat up even more.  So Claude chats with the boys for a spell, and even before the underwear come off, these soldiers have their hands in each other's briefs.  Not long after they're both nude, Colton is taking John's enormous cock deep.  Boy, he sure knows how to work a nice, thick slab of meat!  I love the lusty looks Colton shoots us while he pleasures John.  If you wanna really see Colton show us how much he loves taking girthy cock in his holes, check out his hook up with Ryan Jordan.  It's easy to see in his eyes how much he's enjoying himself.  John, on the other hand, is, of course, not nearly as loose!  After John goes to his knees and enjoys more of Colton's eager sucking, he lays down on his stomach so Colton can show him how good a nice rimming feels.  This is when John decides he needs to regroup for a while.  I think the intensity of what he was feeling became a little bit much to handle in the moment, and I can't fault this solid recruit for needing to get his wherewithal.  And we can all count ourselves lucky he did, because this left the door wide open for -- guess who -- that's right, it's one of our favorite new veterans, Ivan James!Colton doesn't waste too much time before swallowing Ivan's pulsating erection.  But that ass of Colton's can't wait too much longer to be fucked, so Ivan gives the little slut exactly what he's craving.  From here, we see Ivan slide that hard dick into Colton's tight hole and slam him like a proper soldier should.  And my golly, Colton sure does take it well!  So well, in fact, that John decides he can't pass up the opportunity to fuck this insatiable bottom.  He steps back in and goes through with fucking his first male ass!  It turns out to be an incredible moment for everyone in the room.  Thing.I don't think I need to say that we certainly have some incredible adventures in store with all three of these boys.",
  "models": [
    {
      "name": "Ivan James",
      "person_id": 37630
    },
    {
      "name": "Colton Phobos",
      "person_id": 46601
    },
    {
      "name": "John",
      "person_id": 46729
    }
  ],
  "release_date": "2016-03-06",
  "scene_id": 115291,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "First Time",
    "Jerk Off",
    "Muscular",
    "Rimming",
    "Smooth",
    "Straight",
    "Tattoos",
    "Threesome"
  ],
  "title": "Ivan James, Colton Phobos & John"
}