{
  "collections": [
    "Next Door Twink"
  ],
  "description": "It's frustrating when your parents are away and your vehicle isn't working properly. Jackson Cooper can't function like a grown up without his car! Luckily, Mom said he could call Triple D whenever he had an issue. Markie More, an authorized Triple D mechanic is arriving to handle the situation and get Jackson's motor running...in more ways than one!When Jackson meets Markie at the door, he can barely keep his jaw from hitting the floor. Markie is HOT! As Markie works to diagnose the problem, Jackson watches through a window from the house. When his cock begins to swell as he imagines sexy scenarios, Jackson squeezes it a bit from outside his tight jeans.  When Markie comes in to the house to discuss payment, Jackson is surprised and unprepared for this. His mom said the emergency service would be free, but he didn't count on needing a replacement battery.  Jackson sees it as the perfect situation to offer himself to Markie, who fights off the advances at first. But then, in a moment of frustration, Markie decides to give the punk just what he wants. He rips off his work jumper and shoves his hardening cock into Jackson's soft, Twink mouth, fucking the sweet boy's face good for a while.Then Markie bends Jackson over for a taste of that tender hole. Once it's nice and wet, Markie slides his pulsating erection deep into that eager ass. Jackson takes the mechanic's hard pounding as he laughs to himself about the serendipity of the afternoon.  They move to a comfortable chair where Jackson sits on Markie's fat dick and takes a wild ride, letting his own cock spin like a propeller. And before Markie gets back into his coverall and gathers his clipboard and keys, he's slamming Jackson's tight ass up against the couch, just before erupting warm ooze all over the young adult's face. I think they might wanna keep this call OFF THE BOOKS!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Jackson Cooper",
      "person_id": 38267
    }
  ],
  "release_date": "2016-03-22",
  "scene_id": 115253,
  "series": "NDT - 8312 - Markie More & Jackson Cooper",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Twink",
    "Uniform"
  ],
  "title": "Emergency Serviced"
}