{
  "collections": [
    "Active Duty"
  ],
  "description": "In the first moments Princeton Price is by himself, we catch a glimpse of that magnetic, enchanting smile. Princeton has such a gorgeous mouth. He smiles when he means it, too. It lends to the feeling I have that Princeton is just a total natural. By the end of this here session, you'll know exactly what I mean!<br/><br/>When he finally pulls off his gray boxer shorts, we find out he's well equipped with a nice cock that's just starting to fatten up for us. Claude does a wonderful job of getting in tight, nice and early at this point, to show us Princeton's tight, luxurious balls.<br/><br/>  From there, we have Princeton go up on his knees and get more intense with his tugging. He's so sensuous. As Claude shoots from a vantage point that looks downward on Princeton, we enjoy Princeton using one free hand to touch himself all over. He definitely loosened up RIGHT away!<br/><br/> Next, we have Princeton on his back and Claude capturing an upwards view, toward Princeton's face. We see him peeking around his large dick as he jerks it. This is where we start to see some very boner-inducing play.<br/><br/>  After this, we have a location change, and see Princeton comfortably lounging on a long, stretched-out piece of red furniture. Claude comes right underneath Princeton and shows us what it would be like to be looking up as Princeton stares down at us beneath his swollen dick, jerking, with his legs on either sides of our head.<br/><br/>  And finally, we're back in bed with Princeton, getting to look down at his hand furiously tugging his cock. We get to imagine what it's like to be him, enjoying a nice stroke while being videotaped like this for the first time. It's enough to make Princeton shoot a nice, thick load, and Claude sure documents it well for our pleasure. Let's keep our eyes peeled for this amazing dude to come back and rock our worlds again. I know he's on my watch list!",
  "models": [
    {
      "name": "Princeton Price",
      "person_id": 46796
    }
  ],
  "release_date": "2016-03-02",
  "scene_id": 115252,
  "series": "AD - 73 - Princeton Price",
  "tags": [
    "Big Dick",
    "Brunette",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Solo",
    "War Chest"
  ],
  "title": "Princeton Price"
}