{
  "collections": [
    "Icon Male"
  ],
  "description": "Max Sargent walks in on his daughter, distraught. She and Tommy Regan have broken up, and she blames herself. Max is filled with questions, and goes to visit the cause of her anguish; the man who took his help and repaid his daughter in grief. Asking why Tommy broke up with his daughter, Tommy ashamedly says he has been thinking of her father, of him, and he wasn't fair to her.Max leans in, stroking Tommy's cheek he leans in for a kiss. Making out with unbridled passion, he pushes Tommy down onto the bed. Kissing his chest, he moves down his toned tight stomach. Their lips and bodies entangled, older and younger making out. Pulling off his pants, Tommy turns his attention to his ex's Daddy's body. He strokes his muscular sides, exploring the object of his desire. Max sucks on Tommy's cock, tonguing his balls before making out with him again. Stiff as a board, he strokes himself as he slicks up Tommy's hole with a deep rimjob.Excited by the older man, Tommy sucks on his incredibly girthy dick, filling his mouth with every inch of his stiff thickness. Tommy obliges Max, presents once again his tight hairless ass to the older man. He sucks on Max's dick, who jerks off Tommy as the younger man's ass twitches with excitement. Taking his teacher role to heart, he instructs the younger man how to bottom for his first super thick cock. As he stretches out his hole, Max starts slowly, upping the intensity until he's pounding Tommy with his massive rod. Tommy moans with pleasure as Max penetrates him deeply, the boy taking the pounding with sweet lust in his eyes. Max exclaims that Tommy's ass feels so good on his dick. As Tommy strokes Max's chest while he fucks him into pure ecstasy. Max rubs Tommy's in kind as the boy strokes himself, his ass filled with Max's cock. Grabbing him around the neck, Max fucks him quickly. Tommy's cock is extra hard as he's being fucked, pushing him over the edge, Tommy shoots strings of cum out of his cut cock. Pulling out of his younger lover, forbidden lover Max cums over his ex-son-in-law's shaved balls.",
  "models": [
    {
      "name": "Max Sargent",
      "person_id": 46614
    },
    {
      "name": "Tommy Regan",
      "person_id": 46617
    }
  ],
  "release_date": "2016-03-29",
  "scene_id": 115391,
  "tags": [
    "Anal",
    "Closeted/Straight",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Jerking Off",
    "Masturbation",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Rimming",
    "Safe Sex"
  ],
  "title": "His Daughter's Boyfriend 3, Scene #03"
}