{
  "collections": [
    "Icon Male"
  ],
  "description": "For Jaxton Wheeler, love is whatever makes you happy, even if that love comes from money. And for a while now, he has been seeing a very generous man, his own sugar daddy, Tony Salerno. <br><br>At home, Jaxton is taking a shower when he gets a call from his buddy Alexander Gustavo. Still wet, he picks up the phone and tells his pal that they will be joining Tony and one if his wealthy friends at a hotel suite. <br><br>Later that same day, Jaxton and Alexander arrive at the hotel. Tony introduces them to his friend, Billy Santoro, who seems to have a huge attraction towards Alex. And the feeling seems to be mutual. They all move into the living room to get a little more comfortable. After some talks and drinks, Tony turns to Jaxton and tells him that they should leave the room, leaving Alex and Billy to get better acquainted. <br><br>In the next room, Tony is excited that Billy and Alex seem to be enjoying each other's company. He leans in to give his man a kiss, but instead, Jaxton stops him to ask him a favor. He explains to Tony that his mother will be undergoing surgery, which will leave her helpless for the first few weeks of her recovery. He would feel better if Tony could get her mother a nurse to take care of her during that time. But Tony feels he's been spending a lot of money on him lately, on top of paying his rent and education. <br><br>Jaxton says he's doing the best he can to find a job and the thought of not being able to support his mother for her operation is not making him feel better about himself. His sugar daddy changes his mind and decides to pay for his mother's medical care. He leans in to give Jaxton a reassuring kiss. <br><br>Tony sits on the bed, while Jaxton stand in front of him, kissing him. Tony begins by unbuttoning his hot man's shirt. After completely removing it, he holds his body close to him sucking on his nipples and kissing his hairy chest. Jaxton pushes his sugar daddy down on the bed and slowly removes his pants, revealing his hard dick. He plays with every inch of his dick. Jaxton decides he should have his big dick sucked before fucking Tony. He lays down on the bed, enjoying his cock in Tony's warm mouth. Jaxton puts a hand on top of his daddy's head and shoves it down, deepthroating his tool. Jaxton turns him over on his back, bringing Tony's knees to his chest to open his ass cheeks. He slides his cock slowly inside of his daddy, stretching his hole. Once his big cock is inside of him, he starts fucking Tony harder at every thrust, making the bed shake and bang against the wall. <br><br>Jaxton flips man over to a doggy style position. With his head in the pillows, Tony takes a rough pounding. These men are ready to shoot their loads. Jaxton fucks Tony on his back again, while Tony jerks off. Just before this bottom is about to climax, Jaxton pulls out and both men cum on Tony's stomach.",
  "models": [
    {
      "name": "Jaxton Wheeler",
      "person_id": 38281
    },
    {
      "name": "Tony Salerno",
      "person_id": 37744
    }
  ],
  "release_date": "2016-03-17",
  "scene_id": 115392,
  "series": "Sugar Daddies 3",
  "tags": [
    "Anal",
    "Big Cock",
    "College",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "Hairy Guys",
    "Mature",
    "Muscular Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Safe Sex",
    "White Collar/Suits"
  ],
  "title": "Sugar Daddies 3"
}