{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Johnny Torque and his new beau enjoy an evening with friends, his ex-Johnny Riley tries to keep it cool and light, so as not to create an awkward situation. The last thing he expected is for Johnny to follow him to the bathroom for a moment alone. Once inside, Johnny tells him that he wants to fuck his ass raw, and that his current boyfriend is lame in bed.<br><br>And without even waiting for approval, Torque shoves his tongue down Johnny's throat and pushes him up against the bathroom sink, stripping him out of his pants and falling to his knees to suck him off. <br><br>Absence must make the dick grow stronger because Torque is feverishly aggressive as slobbers up and down Johnny's knob before bending him over and spitting on the head of his cock, shoving it into Johnny and pounding him into the mirror from behind. Johnny takes the dick just like old times, his bubble butt bouncing against Torque's stomach as Torque thrusts in and out. <br><br>Johnny remembers why he and Johnny were so good together as he moves him over to the john to mount him. They fuck hard like that as Torque sits and Johnny rides, but Torque isn't risking his relationship to let someone else be in control, so when he's had his fill of Johnny's cowboy routine, he lifts him up and sets him on his back on a bench and proceeds to fuck the cum right out of his ex, pulling out and blasting Johnny with his pent up load before shoving it right back in for a little extra taste of this ass from the past.",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 38266
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    }
  ],
  "release_date": "2016-04-06",
  "scene_id": 115352,
  "series": "NDR - 17 - Johnny Torque & Johnny Riley",
  "tags": [
    "Amateur",
    "Anal Cream Pie",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Fucked Raw By My Ex"
}