{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Fresh off the plane for a Vegas weekend, Markie More is in no mood to waste anytime getting his party freak on. Once he settles in at his hotel, he immediately hits the Strip to try and dredge up some action. The best thing about Sin City is its full of sinners like Derek Atlas, guys just waiting for an opportunity for a quick score. So as Markie spots him leaning at the bus stop, he gives him a look and that's all it takes for Derek to follow. They agree to head back to Markie's hotel room and Derek tells Markie he needs a quick shower before.Cut to the hotel room, and Derek comes out of the shower to find Markie seated in the corner naked, legs spread, stroking his cock. Derek makes his way over to Markie, losing his robe and exposing his own hard cock. Markie doesn't hesitate to swallow every inch of Derek's meat, gagging on this stranger's cock as he runs his hands up Derek's chest. Derek gets hard as can be, throwing Markie onto the bed and going down on him before flipping him over and eating his ass. Derek tongues Markie's hole until it's nice and ready for a good stiff one, which Derek shoves inside Markie from behind. Pounding him doggy style, Derek shows no regard for Markie, fucking him as hard as he can. Markie takes every inch willingly and begs for more, flipping Derek over and riding him as he uses his hands to spread his cheeks even wider for Derek's rod. Markie is ready to cum so Derek flips him onto his back and gives him a fast finish, pounding him while stroking Markie's cock for him, making him spit his load all over his own stomach as Derek pulls out and blasts him with his jizz. As he lay there covered in cum, it dawns on Markie to ask the stranger lying next to him what his name is.",
  "models": [
    {
      "name": "Derek Atlas",
      "person_id": 46661
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-03-31",
  "scene_id": 115334,
  "series": "NDB - 4651 - Derek Atlas & Markie More",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Beefy",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "Hairy",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "How To Cruise Street Style"
}