{
  "collections": [
    "Icon Male"
  ],
  "description": "Braxton Smith finishes telling Tommy Regan about the time he hooked up with his personal trainer. But Tommy is confused as to why this story is relevant seeing as he is a straight man in a relationship with his girlfriend. However, Braxton is not convinced that having a girlfriend means anything and therefore dares him to make out with him without getting a boner.  Disgusted by the idea, Tommy ignores him by trying to watch TV. But this straight boy seems annoyed with the fact that Braxton thinks he's gay. To prove that he's wrong, Tommy decides to take up on his challenge in the hope that Braxton won't mention it again. Braxton leans in and kisses Tommy on the lips. By the looks of it, Tommy seems uneasy kissing another guy. But after getting a taste of it, he looks like he's actually enjoying it. Braxton reaches for Tommy's crotch and feels a big lump. He unzips his pants and pulls out a long hard dick. This boy might not be all that straight anymore. In the bedroom, the boys take their clothes off in no time. Tommy doesn't appear to be questioning his sexuality anymore. He goes down on Braxton and begins sucking on his stiff rod. After going back and forth sucking each other off, Braxton wants to see just how far Tommy is will go. Braxton gets behind Tommy and rubs his dick on his ass. Then, he slowly pushes it inside of his hole, inch by inch. After stretching it, Tommy places himself in a doggy style position, with his back arched and his ass up for Braxton to fuck him deep. This time, Braxton's dick just slides right back in. Excited, he doesn't hold back and begins pounding his ass. Tommy moaning in pleasure at every thrust. Braxton flips him on his back to fuck him some more, while Tommy jerks off. Can't keep it in any longer, Tommy shoots his cum on his smooth body. Seeing his bottom climax, Braxton pulls out his cock and let's his cum fall on Tommy's stomach.",
  "models": [
    {
      "name": "Braxton Smith",
      "person_id": 46868
    },
    {
      "name": "Tommy Regan",
      "person_id": 46617
    }
  ],
  "release_date": "2016-03-22",
  "scene_id": 115390,
  "series": "His Daughter's Boyfriend 3",
  "tags": [
    "Anal",
    "Closeted/Straight",
    "Cumshot/cum",
    "HD",
    "Hairy Guys",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex"
  ],
  "title": "His Daughter's Boyfriend 3, Scene #02"
}