{
  "collections": [
    "Icon Male"
  ],
  "description": "Tony Salerno comes out of his room to notice Jaxton Wheeler and Billy Santoro have left and Alexander Gustavo sleeping on the couch. He wakes him up to ask about the other boys' whereabouts, but he is just as clueless as Tony. In any case, Tony decides not to wait for them and to treat themselves with breakfast by calling room service.Meanwhile, in the hotel's spa, Jaxton and Billy are enjoying themselves in the hot tub. But things quickly change when Billy admits to knowing Jaxton's true agenda for being with Tony. This young stud decides to give this ignorant mature man a reality check, and states that Alex is treating him the same way. In any case, Billy is convinced he knows just what kind of man Jaxton is and believes he should pick on someone his own size. With that said, Billy jumps out of the hot tub, leaving an angry Jaxton behind. While Billy puts on his bathrobe, Jaxton storms in and expresses his anger towards him. He assumes jealousy is getting the best of him, but Billy disagrees and says he could just buy him off if he wanted to. But it wouldn't come cheap.Jaxton wants to show what he's worth to this sugar daddy. He makes Billy get on his knees and forces him to suck his big dick. With one hand over Billy's head, Jaxton makes sure he gets every inch of his cock in his mouth. Billy stands up and opens his ass up for Jaxton to rim. They flip flop, giving each the chance to taste their hole.  Jaxton gets comfortable on the bench while Billy starts riding his cock, bouncing on it. They exchange positions, but Jaxton puts his sugar daddy's legs over his shoulders and pushes his knees down on his chest, spreading that asshole. He slides his uncut cock back inside and starts pounding his ass. He fucks Billy hard until he makes him cum all over himself. Billy pulls out and shoots his load on his daddy as well.",
  "models": [
    {
      "name": "Billy Santoro",
      "person_id": 35626
    },
    {
      "name": "Jaxton Wheeler",
      "person_id": 38281
    }
  ],
  "release_date": "2016-03-31",
  "scene_id": 115394,
  "series": "Sugar Daddies 3",
  "tags": [
    "Anal",
    "Big Cock",
    "College",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "Hairy Guys",
    "Jerking Off",
    "Masturbation",
    "Mature",
    "Muscular Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Sugar Daddies 3, Scene #03"
}