{
  "collections": [
    "Icon Male"
  ],
  "description": "While Jaxton and Billy are having sex in the hotel spa, Tony Salerno and Alexander Gustavo are having their own time together back in the room. Tony is telling Alexander about a blind date he had years ago and how the dating world today has made it difficult for him to find someone. But he was lucky enough to meet Jaxton, and at a bar of all places.  Without taking a second to think, Alexander accidently reveals to Tony that the bar they met is actually where Jaxton goes to hustle. Once Tony puts the pieces together, he realizes that Jaxton is in fact a professional escort. To deal with this news, he leaves to go to his room, alone. Feeling guilty, Alexander goes to check up on him. Tony believes he's done him a favor. His only concern is not being able to find someone else after Jaxton. But this young buck doesn't think it will be a problem. Maybe, just maybe, the right guy is closer than he thinks. He asks Tony what he thinks of him and he admits of thinking Alexander being hotter than Jaxton. Without hesitation, Alex leans in and kisses Tony on the lips. He pulls away to look at Tony's reaction, and what he notices is a smile that gently forms on his face. After making out for a while, they take their shirts off. Alexander removes his man's pants and licks his genitals, from his balls to the tip of his dick. Then, he starts sucking on it. Tony takes his turn and changes places with his new hot boy. He takes off the rest of what Alexander is wearing, and wets his cock with his mouth. Tony feels ready to take it to the next level. He sits on top of Alexander, who slowly slides his hard cock up of this sugar daddy's hole. Tony gets on all fours on the bed with his hot boy behind him ramming his cock up his ass. He fucks him so hard that Tony falls flat on the bed, but Alexander does not stop there. He continues fucking Tony as hard as he can. Tony turns on his back, with his legs up for Alexander to fuck him some more. This will help him cum faster. He jerks off and within seconds, cums on himself. Then, Alexander pulls out just in time to shoot his load on his daddy.",
  "models": [
    {
      "name": "Tony Salerno",
      "person_id": 37744
    },
    {
      "name": "Alexander Gustavo",
      "person_id": 46883
    }
  ],
  "release_date": "2016-04-07",
  "scene_id": 115395,
  "series": "Sugar Daddies 3",
  "tags": [
    "Anal",
    "Big Cock",
    "College",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Mature",
    "Oral/ Blowjob",
    "Safe Sex"
  ],
  "title": "Sugar Daddies 3, Scene #04"
}