{
  "collections": [
    "Icon Male"
  ],
  "description": "Max Sargent walks into the living room just as her daughter ends her phone call. Her father asks who she was speaking to. She tells her dad that it was her boyfriend and that he'll be coming over tomorrow to meet him. Max is not convinced and is worried that she's moving a little too fast with this boy, since they've only been going out for a short period of time. Nonetheless, she is confident that they will get along and that he will like him. The time has come to meet her daughter's boyfriend. After some time chatting in the living room, Max's daughter leaves to go to the bathroom, leaving her boyfriend, Tommy Regan, alone with her father. There is a short awkward silence, before Tommy begins talking about his recent move to his new apartment. When mentioning the lack of furniture in his place, Max offers to give him some old stuff from his storage room. Tommy is stunned by his kindness and thanks him for the offer.The next day, Max helps Tommy get all of the furniture inside of the apartment. Once everything seems to be in place, Max decides its time for him to go home. However, Tommy refuses him to leave without having a drink with him first. With a glass of vodka in their hands, Tommy asks Max if he's usually that generous with his daughter's boyfriends. Max tells him that he is the kind of father who would normally wait on the porch with a shotgun. But, he feels Tommy isn't like the other boys she's dated. Tommy goes on saying that he never had a father growing up. Her mother raised him all on her own. Max understand where he's coming from, since he never had a son himself. Max puts his drink down on the table and gets up from the couch as it is time for him to get going. Tommy gets up as well to give Max a hug, before he walks out the door.At home, Max hops in the shower after a long hard day of moving furniture inside of Tommy's apartment. He washes his hairy, sweaty body with soap and is begins picturing his daughter's boyfriend in his mind. At the same time, Tommy is also taking a shower back at his place. He too starts dreaming about Max, but doesn't comprehend what it really means. Is Tommy seeing Max as the father he never had or is he feeling something more?Meanwhile, Max can't help but imagine doing dirty things to Tommy. He knows this is wrong, especially as he's dating his little girl. But he reaches for his hard dick and begins stroking it anyways. He figures since he can't sleep with him, there's no harm in jerking off at the thought of him. As the water from the shower is pouring down his body, Max jerks off just thinking about that little blond boy he'd like to fuck. He shoots his cum in the shower, and suddenly feels guilty of having had these thoughts about his daughter's boyfriend. Tommy notices he has a hard on just thinking about Max. Without any hesitation, he grabs his stiff cock and slowly starts to jerk off. He can't seem to get Max out of his thoughts, which makes his stroke that dick faster. Tommy ejaculates and his cum drips down from the top of his cock. Tommy and his friend Braxton Smith are hanging out over at Tommy's new apartment. Braxton is impressed on how good his place looks. Tommy confesses that it was his girlfriend's dad who actually hooked him up with the furniture. After talking highly of him, Braxton senses that his pal might have hidden feelings for this older man, since he's never heard him talk about his girl that way. Tommy is bugged by his remark, because he's a straight man. But Braxton doesn't find this surprising at all. In fact, this reminds him of the time he had sex with his personal trainer, Nick Capra. After his workout, Braxton tells Nick that his goal is to have arms as big as his. Nick guarantees he'll get more noticed, especially from gay men. Braxton is impressed how many guys have given Nick their phone numbers, he would never assume that a guy is gay. Now he's wondering if his personal trainer is gay, and asks him if he enjoys the attention he gets from boys. Nick nods, and confesses that he is into guys, but prefers a certain type. After describing it to him, Braxton realizes that he's talking about him. Things heat up as Braxton starts to feel and rub Nick's biceps. As he hoped would happen, Nick leans in to kiss him on the lips. He slides his hands in Braxton's shorts and grabs his tight ass cheeks firmly. He pulls down his pants and removes his shirt, exposing his naked body. Nick takes his clothes off as well and gets on his knees to eat the boy's ass, rimming it deep with his tongue. Max turns around to face Nick, who now stands. He takes his turns and gets on his knees to suck on his trainer's big dick. Nick puts a hand behind his head pushing him to take more of his dick. Then decides to return the favor by going down on Braxton and sucking his rock hard cock. Max lays down on the floor with his legs up. While holding them in place, Nick slides his cock inside of Max's ass. To avoid hurting him too much, he takes it slow and easy when moving his dick back and forth. Max moaning at every thrust. When his hole has loosened up, Max switches places with Nick, finding himself sitting on top of him, bouncing on his tool. He jerks off while getting fucked by his trainer resulting him to shoot his load on his hairy chest. He pulls Nick's cock out of him and rests next to him. As Nick jerks off, getting ready to cum, Max helps by rubbing his balls, making him cum on himself.",
  "models": [
    {
      "name": "Braxton Smith",
      "person_id": 46868
    },
    {
      "name": "Max Sargent",
      "person_id": 46614
    },
    {
      "name": "Nick Capra",
      "person_id": 35574
    },
    {
      "name": "Tommy Regan",
      "person_id": 46617
    }
  ],
  "release_date": "2016-03-15",
  "scene_id": 115389,
  "series": "His Daughter's Boyfriend 3",
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Jocks",
    "Mature",
    "Muscular Guys",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex"
  ],
  "title": "His Daughter's Boyfriend 3, Scene #01"
}