{
  "collections": [
    "Next Door Originals"
  ],
  "description": "When Arad comes home from a long day at work, he hears strange sounds coming from the bedroom. Cracking the door, he spies his boyfriend cheating on him with some other random stranger. As his boyfriend protests, Arad storms out vowing to get revenge, and a quick scroll through his phone produces an old flame that is more than willing to oblige.Zander Cole has been waiting for Arad to ring him back up, so when he gets the message, he arranges to host Arad ASAP.That night, when Arad arrives, his boyfriend is blowing up his phone, but Zander takes a hold of it and tosses it aside, telling Arad he'll take care of him, as he drops to his knees and takes Arad's cock into his mouth, nibbling on it gently and sucking on it slowly, as Arad gets hard inside his mouth. Zander takes care to move delicately, knowing that his partner is a little emotional, but once he starts, Arad forgets all about his boyfriend and focuses on what's in front of him, throwing Zander onto the bed and returning the favor as they 69 each other. Arad, hard cock in hand, is ready to fuck the pain away, so he flips Zander over and spreads his legs wide, launching his tongue deep into Zander's asshole before replacing it with his cock and proceeding to pound Zander from behind. Zander relishes every moment, and savors every inch as Arad flips onto his back and Zander rides him reverse, grinding on him and doing his best to make him forget his troubles, but what Arad really needs is to regain some control, so he sets Zander onto his back and begins fucking with reckless abandon, pounding Zander as he strokes himself and spits his load, and Arad doesn't stop pounding until he's ready to burst, pulling out and blasting Zander with a bittersweet load. As Arad leans down to kiss Zander, he asks him if he can stay the night, a move that likely marks the end of Arad's relationship with his boyfriend. Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Zander Cole",
      "person_id": 46904
    }
  ],
  "release_date": "2016-04-01",
  "scene_id": 115426,
  "series": "NDO - 4652 - Arad & Zander Cole",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Bad Boyfriends"
}