{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As the build up to election draws near, it's serious business in Dylan Knights campaign office. Stumping hard for their man, Dylan's office of interns have been working around the clock and at least one of them, young Alex Tanner, appears to be feeling the effects of the non-stop bustle. Fellow intern Brett Beckham has noticed Alex getting a bit flustered all day, and he's also noticed that Alex is packing a sweet little ass beneath his khaki dress slacks. When Alex steals away to make copies of the speech he's edited, Brett takes it upon himself to do a little informal polling, telling Alex he needs to relax and already easing his hand up Alex's tie as he slips his other hand on Alex's ass. Alex tells him they should set up a night and have drinks, but Brett is way ahead of him and is already unbuttoning his shirt, pushing Alex down to his knees as he starts to unzip his fly. Alex takes Brett's cock in his mouth and begins to suck him off, downing his cock and feeling him deep in his throat. Brett puts his hand on Alex's head and pushes him further down his shaft, before pushing the new intern up against the desk and eating his ass out, fantasizing about what he's going to do to it. Alex closes his eyes and can see stars as Brett strokes his cock, spitting on his hole as he stands up to enter from behind. Brett moves Alex over to a small ottoman and grabs him by the tie, plunging his cock deep into Alex as he bends on all fours. Brett pounds Alex from behind as Alex takes every inch, before they switch and it's Brett lying on the ottoman as Alex rides him, his hard dick slapping against his stomach with every push. Brett flips him onto his back as Alex strokes himself off, cumming all over his stomach as Brett pulls out and wets him with even more jizz, leaving Alex cum-covered but much more relaxed than he was when he entered the closet.Enjoy!",
  "models": [
    {
      "name": "Alex Tanner",
      "person_id": 38001
    },
    {
      "name": "Brett Beckham",
      "person_id": 46662
    }
  ],
  "release_date": "2016-04-07",
  "scene_id": 115463,
  "tags": [
    "Ass Play",
    "Athletic",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Climax",
    "Condom",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Red Head",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Hard Politics: Raging Interns"
}