{
  "collections": [
    "Active Duty"
  ],
  "description": "Golly, what an amazing duo!  This is the amazing Mike Hollister with Dominic, both of whom I'm sure you'll recall. <br><br>Claude chats up the boys and we get an idea of the vibe.  I think I can safely say that Mike is a bit nervous at this point.  Dominic, however, is champing at the bit to get a piece of Mike!  He doesn't waste too much time before stuffing his mouth full of fat cock. <br><br> Then Mike really gets into the action and goes to his knees to get better leverage, where he continues to jam his hard cock in and out of Dom's soft mouth.  What great looking action from the underneath perspective here.  'Fuck his face, he likes it,' Claude says.  To this, Mike simply smiles with pleasure. <br><br>After the face jamming, Mike bends over and allows Dominic to rim his ass.  Now this can be a very interesting experience the first time.  Mike certainly didn't DISlike it, but let's make a note to have his next partner really put some work into this area.  I think Mike will LOVE getting his ass eaten after a little practice.  Dominic, on the other hand, enjoyed tasting that tight, virgin hole.  It definitely had him cranked up to take a firm dick in his own hole!  But before that happens, Dom flips onto his back and lets Mike thrust into his mouth a bit more, just to be sure that cock is nice and ready to fuck its first ass. <br><br>And boy, does Mike fly out of the gates!  It doesn't take much time before Mike is railing that sweet ass and loving it.  You can tell how much power Mike is delivering by Dominic's reactions.  He puts down a lot of power and really loses himself in the moment.  The look of pure ecstasy on his face is priceless. ",
  "models": [
    {
      "name": "Dominic",
      "person_id": 37534
    },
    {
      "name": "Mike Hollister",
      "person_id": 46909
    }
  ],
  "release_date": "2016-03-13",
  "scene_id": 115519,
  "series": "AD - 76 - Mike Hollister & Dominic",
  "tags": [
    "Anal Sex",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "First Time",
    "Rim",
    "Rimming",
    "Tattoos",
    "Twink"
  ],
  "title": "Mike Hollister & Dominic"
}