{
  "collections": [
    "Icon Male"
  ],
  "description": "Lieutenant Alexander Gustavo and his devoted soldier Trent descent to the basement where two prisoners are held captive. Alexander wants valuable information from them, but neither one will talk. He asks Trent to free the weaker of the two, Sam Truitt, so that they can have a chat alone. He might just get something out of him.He brings Sam into a bedroom. After a series of questions, Alexander offers to save the boy's life, if he gives him what he truly wants. He leans in and kisses his prisoner. Alexander pulls the young boy's thick cock out of his pants and puts it in his mouth. After getting it wet, he pushes his enemy's legs up and makes his way to his tight hole. He rims his ass with his tongue and fingers, doing his best to loosen it up for his tool. When ready, he gets on his knees and slides his cock inside of Sam's ass. Feeling the tightness on his hole, Alexander stretches him open by thrusting his cock hard and fast, showing no mercy to the boy. Sam has no choice but to take it, afraid he might otherwise suffer the consequences.  They flip flop, giving Sam the chance to fuck the enemy leader. He rims Alex's hole and shoves his thick cock up his ass, fucking him as hard as he can. But Alexander takes the role of the top back from Sam, who now gets ready on all fours. Alexander slams his hard rod back and forth in Sam's now loosened hole. As they get ready to cum, Sam lays down on the bed and jerks himself off while still getting fucked by Alexander. Soon, he shoots his load all over himself, followed by Alexander, who also sprays a load of cum on his prisoner.",
  "models": [
    {
      "name": "Alexander Gustavo",
      "person_id": 46883
    },
    {
      "name": "Sam Truitt",
      "person_id": 36117
    }
  ],
  "release_date": "2016-04-12",
  "scene_id": 115536,
  "series": "Prisoner of War 2",
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "HD",
    "Masturbation",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex",
    "Soldier"
  ],
  "title": "Prisoner of War 2, Scene #02"
}