{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Bridger Watts surveys the property of his old high school buddy, he tries not to think about his impending divorce or the problems he's having at home. Thankful that Quentin Gainz is letting him crash for a few days, Bridger stands in the shower letting the water drip down off face as he contemplates his next move. Quentin happens by the restroom and catches a glimpse of Bridger standing still, statuesque in movement but also in appearance, and Quentin feels a mixture of sympathy for his friend, but also lust for the sight in front of him. As he rummages through the refrigerator, Quentin doesn't hear Bridger creep up behind him and lightly touch him on the stomach. Startled, Quentin turns suddenly to find Bridger standing in his towel. Bridger asks him if he always spies on men in the shower or if it's just him, and Quentin replies that he's never done it before.With that, Bridger pulls Quentin in closer and the two embrace, passionately, as Bridger lets his towel fall to the floor.Moving into the bedroom, Quentin pushes Bridger up against the wall, running his hands along Bridger's chest, before Bridger throws Quentin back onto the bed, inching from his mouth down his body to Quentin's cock, which Bridger swallows whole, downing Quentin as he gets hard as a rock. Bridger deep throats his host before they switch, and it's Quentin's turn to show what he's capable of, as Bridger grabs the back of his head and pushes Quentin down further onto his cock. WIth his raw cock hard and ready for some action, Bridger asks Quentin if he's ever taken it bareback, and Quentin replies that he's never taken it period. Bridger gets a smile on his face as he plunges his cock deep inside his friend's ass, and Quentin shivers as Bridger pushes inch by inch, deeper and deeper.Bridger pounds Quentin's ass from behind, raw dogging him from behind, first in doggy and then again as Quentin rides him reverse. Bridger can't help but fall for Quentin's tight little ass and his uncanny ability to take the dick, and since it's been a while since he's been laid either way, he's ready to burst, but first, he turns Quentin over and pounds him in missionary as Quentin strokes his cock. Bridger pulls out and blasts his host with a facial load as Quentin spits his own load all over himself in a bro-tastic finish that does not bode well for Bridger's (soon to be) former wife.",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    },
    {
      "name": "Bridger Watts",
      "person_id": 38083
    }
  ],
  "release_date": "2016-04-13",
  "scene_id": 115512,
  "series": "NDR - 18 - Bridger Watts & Quentin Gainz",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial",
    "Facial Hair",
    "Gay Porn",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Bareback Bros"
}