{
  "collections": [
    "Active Duty"
  ],
  "description": "Here's a fun one...it's Nico and Colby Foust, two recruits that are certainly anything but boring!  Wow, this one's a very powerful encounter, and by that I mean these boys pack a lot of punch.  Not too long after ol' Claude gives the boys the go ahead, they go from jerking their fattening meats to hot oral.  Nico's the one to go down and take in a heaping mouthful of Colby's cock.  Nico has definitely had some experience with big dicks like Colby's.  I just love the way he takes that big thing all the way down his throat.  He's not afraid to go all in!  Now THAT'S a quality we like to see on the battlefield.  Yes sir, this freshly initiated soldier just might have what it takes.Colby's no slouch either.  'Now it's my turn,' Nico tells him, and without hesitation, Colby jumps on that large erection, sliding his lips down the throbbing shaft.  He likes to bob hard and quick, something Nico seems to very much appreciate.  Then Nico switches back to sucking Colby's dick, just to make sure it's perfectly hard to do some real damage.  And my heavens, does he get him riled up!  I could scarcely believe how thick and excited Colby was when he slid that throbbing cock into Nico's ass.  He starts out gently here, letting Nico get an initial idea, but then really cranks up the intensity.  'Yeah, fuck his ass!' Claude says with excitement as he aims his shot upward, showing us how Nico is jerking his fat, hard dick as he gets good 'n' fucked.  After slamming Nico silly from behind, Colby lays on his back to give Nico a ride, just like the real cowboys do.  Check out Nico go!  Even when he's on top, Nico keeps the train chugging, bouncing like a wild man on Colby's stiffie.  From there, Nico goes to his back so Colby can pound the cum right out of him.  It's really a beautiful, photo finish, and every member of the squad should watch and appreciate the level of dedication that came out of these boys, especially considering one of them is a first timer!",
  "models": [
    {
      "name": "Colby Foust",
      "person_id": 46713
    },
    {
      "name": "Nico",
      "person_id": 46913
    }
  ],
  "release_date": "2016-03-20",
  "scene_id": 115533,
  "series": "AD - 78 - Nico & Colby Foust",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "First Time",
    "Jerk Off",
    "Shower",
    "Smooth",
    "Tattoos"
  ],
  "title": "Nico & Colby Foust"
}