{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Working in Washington is all work and no play for the guys who grind the gears of government behind the scenes. For Dylan Knight, his work keeps him busy around the clock, with barely any time to shave, much less to take a break and enjoy himself. Intern Luca Rosso has seen Dylan in action and can attest to the hours he puts in, but also has suspiscions that they are taking a toll on the Senator's aide. Luca tells Dylan as much over drinks and tells him he needs to find a way to unwind or he'll go crazy. Dylan tells him he wishes he knew how to unwind, and Luca takes the hint, placing his hand on Dylan's knee as he moves in to kiss him. Dylan protests that Luca has the wrong idea, but Luca looks him dead in the eye and Dylan's objections melt away as he leans back in towards Luca's mouth.In no time, they are both naked on Dylan's bed, Luca going down on his boss as Dylan's cock gets rock hard at the touch of his tongue.Dylan returns the favor as Luca fucks his mouth, then he straddles Dylan's face and begins to suck him off as Dylan eats his ass. Luca works the shaft down to the balls and then works his way down to moisten up Dylan's hole for his hard cock. Dylan continues to work his tongue around Luca's hole but what he's really looking for is a good hard lay, so he commands Luca to fuck him as hard as he can.Luca obliges, laying Dylan flat on his stomach and pounding him from behind, kissing the back of his neck as he works his hips back and forth. Dylan takes every inch like a champ before Luca flips him over and proceeds to fuck him even harder, pounding him all over the bed as Dylan strokes himself off, jizzing on his stomach as Luca pulls out and filibusters his own load before falling on the Senator's aide for some much needed sleep.Enjoy!",
  "models": [
    {
      "name": "Dylan Knight",
      "person_id": 31577
    },
    {
      "name": "Luca Rosso",
      "person_id": 46612
    }
  ],
  "release_date": "2016-04-14",
  "scene_id": 115546,
  "series": "NDB - 4655 - Dylan Knight & Luca Rosso",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Oral",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Hard Politics: Could I Be Gay?"
}