{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Brendan Phillips' mind is working overtime and his fantasies are running wild. What he craves is a hard, raw cock, special delivered straight to his waiting hole. Orlando Fox is a big dicked perv who is more than willing the fill the position, so when Brendan texts him soliciting an NSA hook-up, Orlando only needs an addy and a time-frame. Brendan sends him the necessary digits and then tells him about his fantasy. Orlando comes over, enters without knocking, and makes his way to Brendan's bedroom, where he finds a note telling him to undress. Doing as he's instructed, he enters Brendan's room to find him naked on the bed, ass up in the air ready, willing and able. Orlando wastes no time, falling to his knees and giving Brendan a lick fromt he tip of his cock, down the shaft and straight ahead into Brendan's waiting hole, moistening it up for Orlando's 8 inch cock. Brendan has his fill of Orlando's rimming before sitting up to suck off this stranger, as Orlando pushes his head further down onto his cock. Brendan gags on it and smiles, telling Orlando to fuck him raw.Orlando doesn't have to be told twice, bending Brendan over and grabbing him by the shoulders, pulling him back onto Orlando's rod as Brendan's ass slaps against his stomach. Orlando fucks Brendan good and hard from behind before Brendan climbs on top, reverse mounting Orlando as he strokes his cock. Brendan grinds on Orlando and is ready to burst, so he flips over onto his back and tells Orlando to fuck the cum out of him. Orlando picks up the pace and begins to fuck with reckless abandon as Brendan loses his load all over himself, just as Orlando pulls out and coats him with his load, before shoving his cock back and making a cummy mess of Brendan's slutty hole, and bringing his fantasies out of the dark and into reality.Enjoy!",
  "models": [
    {
      "name": "Orlando Fox",
      "person_id": 37350
    },
    {
      "name": "Brendan Phillips",
      "person_id": 38107
    }
  ],
  "release_date": "2016-04-20",
  "scene_id": 115640,
  "series": "NDR - 19 - Orlando Fox & Brendan Phillips",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Latino",
    "Masturbation",
    "Oral",
    "Rimming",
    "Smooth"
  ],
  "title": "Ass Up Breeding"
}