{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Jason Maddox rises early for his morning run, he happens to check the weather out his window and notices what appears to be a vagrant sleeping on his stoop. Marching out to deal with it, he discovers Scott Riley perched and resting on his napsack, peacefully, but Jason is in no mood for bullshit, and marches Scott back inside to call the police. Once inside, Scott pleads his case, telling Jason he's been around undetected for weeks, and that there has to be something the two of them can work out.Upon hearing this, Jason notices for the first time that Scott is quite the looker, despite his living condition. Jason tells him that he thinks he knows a way they can work this out, sliding his hand up Scott's thigh. Scott is incredulous, but Jason tells him it's the only way, and since he's fairly compromised and without a lot of options, Scott has little choice but to comply.And once Jason begins sucking him off and he gets immediately hard, Jason realizes he's not so averse to a little play among strangers. Jason strips him out of his jeans as he keeps downing Scott's cock. Scott gets nice and hard but it's Jason who is out to get served here, so he stands up and undresses as Scott returns the favor. Scott sucks him off like his livelihood depended on it, and he's good enough that Jason has long since forgotten about calling the cops, but he's also not quite satisfied, so he tells Scott if he wants to stay, he's gotta give up that ass. Scott is hesitant, but he mounts Jason's cock and begins to ride, grinding his host's cock as Jason thrusts into him. Scott can feel every inch of Jason inside him and realizes this is not much of a punishment. Jason flips Scott over onto an ottoman and pounds him from behind as Scott grabs the sides and holds on for dear life, stroking his cock with his other hand. Ready to drop his load, Jason flips Scott over one more time onto his back as Scott strokes himself dry, spitting his load onto his stomach as Jason pulls out and showers him.Sitting there, cum covered and exhausted, Jason makes good on his promise, offering Scott a real shower and a warm place to stay. Looks like their arrangement is going to work out just fine.Enjoy!",
  "models": [
    {
      "name": "Jason Maddox",
      "person_id": 34755
    },
    {
      "name": "Scott Riley",
      "person_id": 46987
    }
  ],
  "release_date": "2016-04-15",
  "scene_id": 115743,
  "series": "NDO - 4656 - Jason Maddox & Scott Riley",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Muscular",
    "Tattoo/Piercing"
  ],
  "title": "Right to Squatting"
}