{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Darin Silvers and Andy Banks go way back, all the way to elementary school since their friendship began, so as they get home from the gym and turn on the game, everything is normal. That is, until Darin mentions that his brother has come out of the closet and the old friends start opening up about their own desires and fantasies. Darin seems incredulous, but also, as if he's harboring some secret, whereas Andy clearly is all about the dick and it is obvious. Making a leap of faith, both guys let it slip that they'd be into the other, and as they sit in awkward silence for a moment, Andy moves in, kissing Darin on his mouth as he begins to grope Darin's cock through his workout shorts. Andy drops down and whips Darin's cock out, sucking on it as Darin runs his hands through Andy's hair. Andy swallows Darin's hard on and tries to slip a finger up his ass but Darin isn't having any of that, so Andy tells him they should switch, and immediately Darin returns the favor, fingering Andy's hole as he strokes himself up to fuck his old BFF. Daring positions himself behind Andy, who backs his ass into Darin as Darin slips his hard cock deep inside. They fuck like that on Andy's parents' bed before Andy turns his buddy over and rides him cowboy. Andy can't believe how close he already is to cumming as Darin continues to plug away, moving Andy onto his back as he plows him missionary, while Andy strokes himself clean and dirties himself up in the process. Darin feels Andy tighten his hole around Darin's cock just as he's cumming, and the pressure triggers Darin too, who pulls out and blasts Andy with a really healthy (and really pent up) load, telling his buddy they've got to keep all of this a secret.Enjoy!",
  "models": [
    {
      "name": "Andy Banks",
      "person_id": 34758
    },
    {
      "name": "Darin Silvers",
      "person_id": 46621
    }
  ],
  "release_date": "2016-04-21",
  "scene_id": 115759,
  "series": "NDB - 4657 - Darin Silvers & Andy Banks",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Muscular",
    "Smooth",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Sandbox Virgins"
}