{
  "collections": [
    "Active Duty"
  ],
  "description": "Now I hope you all get to see this one.  We know how fantastic and talented each of these boys is, and this is one helluva match up.  Ivan James has become a huge favorite and it's no wonder when you consider the way he performs. Ivan is a well-known cock fiend which made it easy to predict that he would be the first to stuff his face with firm dick meat, especially considering Ryan Jordan's magnificent erection.  That thing got swollen and ready instantly.  Ivan went in for the kill immediately, swallowing Ryan's man pole all the way down.  Then Ryan gets a turn to enjoy some knob slobbing and although Ryan's cock is a work of art, Ivan's ain't nothin' to spit at!  Ivan's dick is luxuriously girthy and always excited, especially when Ivan's hole is filled.  So after some good sucking, the guys get even deeper by switching into some hot 69 action.  This is wonderful to see.  Two guys having a good ol' time, jacking and bobbing on each other. And then it's time for Ivan to get what he's been looking most forward to.  He climbs atop Ryan's hulking, pulsating dong and eases it into his sweet ass.  Ivan is one of the best dick cowboys on the AD squad and this is a great example of how talented he is.  Then we have Ivan bent over the bed, taking it nice a deep from his pal.  Ryan's dick is so large and in charge that Ivan has to ease into this position.  After some slow going, Ryan works into a good pace, banging that tender hole like a strong soldier.  And then we end up getting to see Ivan spray a healthy load while on his back, getting railed even more.  It's an awesome climax after an incredibly hot build up.  Get comfortable for this one, cause you're gonna wanna take it all in!",
  "models": [
    {
      "name": "Ivan James",
      "person_id": 37630
    },
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    }
  ],
  "release_date": "2016-03-27",
  "scene_id": 115745,
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Tattoos",
    "Twink"
  ],
  "title": "Ryan Jordan & Ivan James"
}