{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Jack Hunter is home alone quite often, which wouldn't be so bad except that living off the beaten path, he tends to hear strange noises and experience odd occurrences that occasionally give him the creeps. It'd be nice if his boyfriend were around, but he's usually away at work, when Jack thinks he sees a figure on his property, he calls for some security investigation.<br/><br/> Mark Long speaks softly and carries a big stick. Well, technically, he carries two big sticks: one on his belt and one in his pants, so as he investigates the situation over at Jack's address, he can't help but wonder if maybe there isn't a real problem at all, and that this is just some sort of ruse, and when Jack reaches out for his pants, Mark realizes what Jack really wants is the firm hand of authority to guide and protect him. Mark uses his nightstick to push Jack back onto the sofa, and then pulls out his meat stick and shoves it in Jack's mouth. Jack downs Mark's 8' cock like it's nothing, swallowing whole in one gulp, as he tongues Mark's dick like his safety depended on it. Mark fucks Jack's mouth, placing his night stick around Jack's neck and pulling him in closer, gagging him with his hard on before taking off his uniform and bending Jack over, sliding his raw cock deep inside of Jack's waiting ass as he bends over. Mark grabs Jack by the waist and commences to pounding him from behind, then watching as Jack mounts him and grinds hard on his dick.<br/><br/>Jack is packing a healthy cock too, and it slaps against his stomach as he bounces up and down on Mark's long arm of the law. Ready to spit his load, Jack begs Mark to turn him over and fuck the cum out of him, so Mark pounds away, his bare cock filling Jack up with every thrust as Jack spits his load without discretion, spraying it all over the living room floor as Mark pulls out and wets him down with a second load. As they embrace, Jack tells his boyfriend that tomorrow he should dress up like a doctor, and Mark agrees.<br/><br/>Enjoy!  ",
  "models": [
    {
      "name": "Jack Hunter",
      "person_id": 48318
    },
    {
      "name": "Mark Long",
      "person_id": 18862
    }
  ],
  "release_date": "2016-04-27",
  "scene_id": 115867,
  "series": "NDR - 20 - Mark Long & Jack Hunter",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Keeping Things Interesting"
}