{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Vinnie was hired by Luca's Dad to clean the pool thoroughly each and every day. He always does a great job cleaning it but today Lucas has been spying on Vinnie in the hot sun cleaning. He began rubbing his crotch once Vinnie took is shirt off in the scorching hot sun. Vinnie could tell he was watching so he was showing off his body some. Lucas decided to confront Vinnie on his cleaning skills which Vinnie thought he was going to receive praise but nope Lucas berated him instead. Vinnie isn't taking this shit from some snobby rich young man and he tells Lucas just that. Once he speaks his mind he grabs Lucas and pulls him close to start kissing him and Lucas is shocked but really not because he's been wanting that dick for a long time.  Vinnie pushes Lucas down to his knees and tells him to suck his dick. Lucas is eager and takes his dick into his wet mouth. Vinnie has a thick cock which fills Lucas's mouth full.  They take the action inside the house where Vinnie gets a taste of that big dick. They pleasure each other's balls and dicks until Vinnie is ready to lube up that ass with his tongue. Lucas has one of the best asses Vinnie has seen and he dives right in tasting the sweet nectar of this young stud. Vinnie is now ready to shove his fat cock into this tight white ass. Lucas takes it deep as Vinnie fucks him hard in multiple positions. Lucas has soft moans of delight as Vinnie pumps back and forth pushing the cum out of Lucas. His load shoots all over the place covering his whole chest. Vinnie loves what he just saw and wants to cum hi his mouth. Lucas stands up and starts to suck off Vinnie until his hot load seeps out of his mouth and drips off the side of his chin.",
  "models": [
    {
      "name": "Lucas Grande",
      "person_id": 47140
    },
    {
      "name": "Vinnie Stefano",
      "person_id": 46606
    }
  ],
  "release_date": "2016-05-02",
  "scene_id": 115866,
  "series": "DL - 16 - Vinnie Stefano & Lucas Grande",
  "tags": [],
  "title": "Pool Daddy"
}