{
  "collections": [
    "Active Duty"
  ],
  "description": "Hey Troops,These are just two hot peas in one sexy pod!  These strong, slightly bashful boys are so great together.  It's Colton Phobos and newcummer Nico.  You've seen how much Colton loves his holes to be filled, sometimes more than one at a time, and now you'll see him here, handling a brand new recruit who's ready for action.  If you saw Colton get pummeled by John and Ivan James, you know what I was talking about.  That was such a great time, and I think Colton took some of that experience and used it this time.  John had a trial by fire on that occasion, as it was not only his first threesome, but also his first time hooking up with another guy, ever!  Both lovely boys made him feel comfortable, and he ended up railing Colton's hungry ass after watching Ivan fuck him like a veteran.  Colton is the perfect little slut to be paired with a newbie because he's so willing and accommodating.  Our boy Claude talks with the two a little bit before they strip down extremely quickly and get into some nice blowjob stuff.  Of course Colton, the little cock fiend, jumps right on Nico as soon as he can and slurps on that dick.  Remember, this is Nico's first time on camera and there is still some reluctance there.  But as we come to find out, Nico was born for this!  Once he loosens up a little bit, he reaches for the oil, pops the top, and squeezes out a healthy portion which he slathers all over Colton's milky-smooth ass cheeks, making sure to rub his tight hole too.  Colton gets into some very hot writhing as Nico plays with his hole.  This is around where Claude gets in tight and shows us how amazing that slut's pink little hole looks.  After Colton gets his fill (for now), Nico takes Colton's swollen cock into his mouth and enjoys for a spell.  But Nico can't hold himself back from needing to bury his dick in Colton's ass.  They get to the fucking quickly and Nico dives in head first, vigorously pounding that tight pocket on Colton.  'Make him earn his money,' Claude says out of pure excitement.  Nico does some serious damage for a while, then goes back down for more of a taste of Colton's delicious dick.  He even let's Colton grab his head and fuck his mouth aggressively.  And then they kiss!  Boyyyy do they kiss.  What a hot moment stuck in between the nasty, wild fuck and suck session.  Then Colton decides to take Nico to pound town and show him how it feels to get banged to the limit on camera.  Well I think he liked it because he wanted to switch again and slam that hard cock back into Colton for a few more rounds.  This is where Nico really hits his stride.  It takes some doin' for a lot of these fresh, new recruits sometimes, but once they get going, you can't stop 'em!  I've noticed that often, before a rookie can loosen up nerves-wise, he's gotta get loosened up asshole-wise.  That was certainly the case this time.  Once Nico is back in the driver's seat, the action shoots through the roof.  Colton takes some serious punishment here and it's type he craves.  Nico sure doled it out well for a first-timer.  I'm confident Nico will find a warm welcome among peers here on the squad.  Claude again does some nice work here, showing us just how nice Colton's fat, erect cock looks while his ass gets torn up by a ravenous military stud.  Then Colton turns over to be fucked from behind for a while.  He ends up struggling so hard to endure the painful pleasure, we see him biting the sheet!  Next, Colton climbs on top of Nico's hard boner and takes a sexy ride.  He really slams that hungry hole down Nico's shaft with gusto.  He loves it deep and we can't fault him for it!And just before these boys jack their meat until they spray hot cum side-by-side, Colton gets just one more turn on Nico's large dong.  I guess he wanted to make sure he wouldn't soon forget the feeling of that big ol' thing sliding in and out of his mouth.  Enjoy these guys, and let's all welcome Nico to the AD Troop!",
  "models": [
    {
      "name": "Colton Phobos",
      "person_id": 46601
    },
    {
      "name": "Nico",
      "person_id": 46913
    }
  ],
  "release_date": "2016-04-03",
  "scene_id": 115941,
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Hairy",
    "Jerk Off",
    "Kissing",
    "Rough",
    "Tattoos"
  ],
  "title": "Nico & Colton Phobos"
}