{
  "collections": [
    "Active Duty"
  ],
  "description": "Hey Troops,I really liked the energy from this handsome recruit, and I picked up on it right away. He sat down with a smile on his face, ready to show us what he can do. Trey seems like the total package! He's immaculately physically tuned and his personality is exactly what we need here on the squad.Claude chit chats with Trey for a few moments and we learn that (no surprise) Trey is a personal trainer and practically lives in the gym. My goodness, what an amazing chest on this fine boy. And it doesn't end there, just wait until you see him pull of those sweatpants!Yes, once that beautiful cock comes out, we really get a sense of eye candy we're dealing with. Trey is just at the top of charts. He has amazing skin, a playful smile, and that ab definition is unreal. Did I mention that perfectly shaped swollen cock?!And Trey knows exactly how to give us the goods. He's certainly no stranger to yankin' his meat and getting himself in just the right mood. He spends some time on the couch getting warmed up, and Claude does a really nice job of showing us the goods.Claude sneaks in tight, getting us a close look at Trey's strong hands, working his meaty shaft and massaging those luxurious balls. From down low, Claude shows up what it might be like to have a blowjob perspective.  Then Trey gets on his feet to continue the party. Again, Claude goes in close for a wonderful view of Trey's taint. This is a sexy look at what's, in my opinion, one of Trey's most excellent hidden assets! It's around here that Trey really starts jamming, tugging his erection like a fiend for pleasure.  Claude moves over Trey's shoulder to show us a POV shot. This is where I noticed something especially unique...it's a very rare DICK TATTOO!! Yes, this crazy soldier has a dick tattoo, and he wants you to see it! I couldn't make out exactly what it says, but I mean to ask Claude if he found out. Haha, what a special treat! It's a sign that Trey isn't afraid to let his wild side cum out and play.We move on from here right into some pillow fucking. WOW! Check out the power in Trey's ass and thighs. It's a thing of beauty that really has me thinking of who I'd like to see him pound...any ideas, troops??Get comfortable and get set to enjoy this fine young cadet. He has all the trappings of a perfect recruit. And I know with that enthusiasm and attitude, Trey will not only be learning a lot here with us, I think we'll all get to see a few brand new things!",
  "models": [
    {
      "name": "Trey III",
      "person_id": 47036
    }
  ],
  "release_date": "2016-04-06",
  "scene_id": 115990,
  "series": "AD - 83 - Trey",
  "tags": [
    "Brunette",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Trey"
}