{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Ian Levine might still be a student but it's safe to say he knows what he's doing. Dylan Knight may be a teacher but that doesn't mean he's above being taught a lesson or two. So when Ian shows up 'by chance' at Dylan's house fundraising for the soccer team, he acts surprised as his teacher answers the door. But moments later, when Ian excuses himself to the restroom but instead undresses and stretches out on Dylan's bed, that's when Dylan realizes he's been played for a fool. Shielding his eyes,  he asks Ian to put his clothes back on, but Ian convinces him that no one will believe him if Ian tells, and Dylan finds himself compromised. Looks like Ian is going to get his candy one way or the other, as he unzips his teacher's pants and starts to suck Dylan off. Dylan's dick gets long and hard, and it's no wonder Ian has a crush on him. As Dylan checks out his student, it's clear that Ian is packing a nice bubble butt for Dylan, so he flips Ian onto his back and tongues at his hole, moistening up Ian's hole for before Dylan delivers today's lesson. <br><br>Ian throws his head back against the bed as Dylan tongue fucks him, but Ian wants the real thing, so Dylan plunges his huge cock deep inside his star pupil, fucking him missionary as he sucks on Ian's toes. Ian can't believe he's in the thoes of his long running fantasy, and Dylan is fucking to teach a lesson to the would-be blackmailer, who loses his load almost as soon as Dylan starts fucking him. <br><br>Out for his own enjoyment now, Dylan flips the teacher's pet over and proceeds to pound him from behind, wetting him with a cum curriculum that won't be on any test later. Laying there, cum covered and satisfied, Ian only has to worry now about what he's going to do actually do with all the fundraising chocolate.",
  "models": [
    {
      "name": "Dylan Knight",
      "person_id": 31577
    },
    {
      "name": "Ian Levine",
      "person_id": 34468
    }
  ],
  "release_date": "2016-04-22",
  "scene_id": 115963,
  "series": "NDO - 4658 - Dylan Knight & Ian Levine",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "Mature",
    "Oral",
    "Rimming",
    "Smooth",
    "Uncut cock"
  ],
  "title": "Want My Candy?"
}