{
  "collections": [
    "Next Door Taboo"
  ],
  "description": "For new step-brothers Markie More and Addison Graham, getting along has been a little slow going. Markie suspects there's something a little off about Addison, and Addison is pretty sure he's got a crush on his new sibling. And then there's the logistical matter of trying to secure some private time in a house with only one restroom. This last complication is what finally gets the ball rolling between the two of them, as Addison notices Markie sneaking around the side of the yard one day, and follows him out to Markie's secret stash spot, where he's got a whole bag of sex toys, lube, you name it. <br></br>Addison watches Markie stroke his hard cock from a distance, biting his lip as he spies from the bushes. Tripping on some loose brush, Addison ducks back behind the house, but it's too late and Markie chases him back into the house, making him promise not to tell their parents. Addison tells Markie he can make that promise, under one condition, as he eyes the bulge in Markie's jeans. Markie follows his eyes but immediately protests, telling Addsion he's not gay. Addison tells him to pretend he's a toy, and begins to suck Markie off. Markie closes his eyes and realizes it feels way better than his FleshJack, so he just goes with it, grabbing Addison by the back of the head and pulling him deeper onto Markie's dick. Addison slobs on Markie's knob until it's good and hard, then leans back for Markie to reciprocate, but Markie is having none of that, and instead shoves his cock back into Addison's mouth, face fucking him from above before sliding up and sitting his ass on Addison's tongue, riding his lips as Addison tongues his hole. <br></br>Thoroughly worked up now, Markie is ready to fuck, so he bends Addison into a little ball and pile drives his ass standing on the bed. Addison crunches and feels the full length of Markie's hard dick with every thrust, and Markie only gets more enthusiastic when he bends Addison over and fucks him from behind, grabbing him by the shoulders as he pounds away on his step-brother's ass. Addison is living out his fantasy as Markie flips him over one more time, fucking him missionary as Addison spits his load onto himself, just as Markie pulls out and blasts him with the family seed. As Addison lay covered in cum, he asks Markie if it he still wants to fuck his little toy, and Markie responds that he's just trading one toy for another. Addison does not mind the insult.<br></br>Enjoy!",
  "models": [
    {
      "name": "Addison Graham",
      "person_id": 32786
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-04-28",
  "scene_id": 115991,
  "series": "NDB - 4659 - Markie More & Addison Graham",
  "tags": [],
  "title": "My New Brother: Our First Encounter"
}