{
  "collections": [
    "Active Duty"
  ],
  "description": "As we head into warmer months, I start thinkin' about the beach.  I start dreamin about strong boys on leave, playin in the sand, spillin a little beer to make a one-handed catch in front of some pretty girls.  I can see these boys, Ryan Jordan and Allen Lucas, doing just that, laughing and forgetting about the rest of the world.  Allen had a good tasting of Ryan's enormous cock.  Goodness, that thing is like an angry python.  Thankfully, Allen is an experienced snake charmer and knows the techniques for taming such dangerous beasts.  He really goes to town, sucking and jerking like the full-throttle Active veteran he is.  Then Ryan goes to his feet to let Allen get more of what he wants.  He gobbles down Ryan's boner a bit more before Ryan turns around to give Allen a taste of his sweet hole.  I love seeing inexperienced, straight boys get rimmed.  It's not a totally familiar feeling, but as you see in Ryan's face, it can be pretty awesome!From there, we get a nice underneath shot of Ryan's cock sliding into Allen's ass.  He fucks him from behind for a while before Ryan goes to his back on the bed.  Allen is obviously a pro and knows how to ride a fat military cock like Ryan's.  Watch him go.  He really gets a good bounce going, and Ryan gets into it, eventually thrusting upward into Allen's amazing, accommodating ass.  Then they get into some doggystyle, where Ryan unloads ALMOST his whole clip.  I can see that Ryan is gaining confidence.  This position is one where Ryan truly opened up and drilled that hungry ass.  And finally, for what ended up being my favorite part, Allen gets fucked on his back.  I loved seeing that hole get fully rammed.",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 37870
    },
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    }
  ],
  "release_date": "2016-04-10",
  "scene_id": 116041,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Jerk Off",
    "Rim",
    "Rimming",
    "Tattoos",
    "Twink",
    "White Butt"
  ],
  "title": "Allen Lucas & Ryan Jordan"
}