{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Excitement is abound for Max Penn as he recounts the news of making the baseball team to his sister's boyfriend, Dante Martin. Dante is thrilled for Max, but Max seems a bit preoccupied. Dante senses this and asks him what's up, and Max reveals that he's carrying quite a bit of tightness and tension in his shoulder and it has him worried for his start in the big game. Worried that he may not be able to pitch in his debut, concern has turned to stress, which is sitting right in the back of Max's neck, so Dante offers to massage the tightness away, since he's licensed to do so. Max agrees and the next thing he knows, he's lying face first in the living room wearing nothing but his jock. Dante rubs Max down, gaze fixed to Max's bubble butt sticking up in the air. Max makes the remark that Dante is spending so much time around his ass that Max would swear he's interested in guys, if he weren't dating his sister. Dante has a laugh and rubs up Max's spine, unbuttoning his pants and pulling out his cock. Seems that in working out Max's stiffness he's worked up a bit of his own, so he circles around to the front of the massage table and Max opens his eyes to see Dante's hard cock right in his face. With a look, Max realizes his intuitions were spot on, and moments later he's got Dante's cock deep down his throat, gagging on Dante's dick as Dante chokes him even more. Satisfied that his girlfriend's brother is much better at giving head than his sister, Dante moves forward with his plan, flipping Max over and straddling his face as he licks Max's hole and plays with his taint, alternating between rimming and sucking Max off, while Max continues to choke down Dante's hard on. Dante is ready so hot to fuck he flips Max over onto his stomach and begins to shove his raw cock inside. Max protests that Dante doesn't have a condom and Dante tells him to shut up and take it. 'Someone in this family is getting my raw dick,' he exclaims, pushing his cock all the way inside Max as Max moans with pleasure. Dante teases Max by pulling his cock all the way out and sliding it back in, before he grabs Max's shoulders and proceeds to pound him from behind. Dante fucks hard and Max takes every inch like a champ, even flipping over to be in control as he rides Dante's meat stick like a horse. Dante watches as Max bounces his perfect bubble butt up and down, and Dante is so hot he's ready to spit his load, so he flips Max over one last time and fucks him missionary as Max strokes his cock, shooting a load himself before Dante pulls out, blasts his holes, and then breeds the hole, shoving his cock right back inside to pitch Max on a little extra inning action. Max is definitely game.Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Max Penn",
      "person_id": 38088
    }
  ],
  "release_date": "2016-05-04",
  "scene_id": 116042,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock Strap",
    "Masturbation",
    "Muscular",
    "Rimming"
  ],
  "title": "My Sister's Boyfriend: Magic Rub"
}