{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Cameron Foster has had it up to here with his step brother, Johnny Riley. Johnny's been acting like a real useless layabout lately, and Cameron is at his limit entertaining Johnny's freeloading bullshit. He doesn't work, he doesn't clean, he doesn't help out around the house, and honestly, Cameron is starting to wonder if maybe he's just all the way useless.So when Cameron comes home it still un-tidy while Johnny lounges on the sofa like he always does, something in Cameron snaps. Yelling at Johnny, Cameron runs down an indictment of his transgressions and asks him what he's good for.Johnny tells him he's sorry he doesn't have a pussy to put out for such a dick, which is meant as an insult but only gives Cameron an idea, and he whips out his dick and immediately shoves Johnny's head down onto it. Johnny is obviously resistant but Cameron threatens to kick his ass, and Johnny can tell he's serious, so he gets to sucking STAT.Choking on Cameron's cock, Johnny strokes his own dick but Cameron isn't here for niceties, bending Johnny over and entering from the rear, fucking his step brother hard from behind as Johnny clenches and grabs a hold of the sheets. Cameron fucks with revenge on his mind, tearing Johnny up before flipping him over missionary and proceeding to finish the hard lesson he's engaged in. Johnny strokes himself feverishly, launching his load as Cameron holds his ankles and plugs away, pulling out and dousing Johnny with his punishment before telling him to clean himself, this room and the rest of the house up before Cameron gets out of the shower.",
  "models": [
    {
      "name": "Cameron Foster",
      "person_id": 16727
    },
    {
      "name": "Johnny Riley",
      "person_id": 38266
    }
  ],
  "release_date": "2016-04-29",
  "scene_id": 116019,
  "series": "NDO - 4660 - Cameron Foster & Johnny Riley",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Gay Porn",
    "Hardcore",
    "Jerking off",
    "Masturbation",
    "Muscular",
    "Oral",
    "Uncut cock"
  ],
  "title": "Step Brother Punishment"
}