{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Still adjusting to being home from deployment, Private Damien Michaels is finding that not everyone is thrilled to have him home, particularly his girlfriend, who has been giving him attitude since he got back. As Damien has some beers with fellow boot-camper and long time buddy Brandon Moore, Damien's girlfriend gives him a call and starts even more trouble. Brandon witnesses this, and though he's inclined to just keep his mouth shut and mind his own business, he can't help but think maybe he's got a solution to Damien's problem. Brandon asks Damien if he got any action overseas and Damien looks incredulously at him, reiterating that he's been deployed, to which Brandon confesses that boot camp didn't stop him from getting his freak on. Damien picks up what Brandon is putting down, and asks him who he fucked. Brandon corrects him that he was the one getting fucked, which raises Damien's eye brow a bit as Brandon runs his hand up Damien's thigh. Damien is hesitant but admits a hole is a hole, and with that, Brandon unfastens Damien's camo fatigues and begins to suck him off. Damien gets just as hard as you'd expect a guy to get when he hasn't had sex in a year, and it doesn't hurt that Brandon really knows how to suck a dick, deep throating it and gagging on it long and hard in a way that Damien's girl never bothered. His inhibitions out the window, Damien embraces the situation and flips Brandon over on the sofa, tonguing his ass from behind as he strokes his cock in anticipation. Brandon closes his eyes as Damien slips his cock in from behind, pounding his fellow soldier doggy style as Brandon grabs a hold of the couch. Damien fucks like a man deprived, and Brandon enjoys every pounding inch as Damien fucks the cum right out of Brandon, who unmounts Damien's cock and jerks him into his waiting mouth, as Damien fires his rockets and shoots his ammo all over Brandon's waiting face. They don't call it Bootycamp for nothing!Enjoy!",
  "models": [
    {
      "name": "Brandon Moore",
      "person_id": 35927
    },
    {
      "name": "Damien Michaels",
      "person_id": 37846
    }
  ],
  "release_date": "2016-05-05",
  "scene_id": 116084,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Facial",
    "Hairy",
    "Hardcore",
    "Military",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Str8 to Bootycamp"
}