{
  "collections": [
    "Active Duty"
  ],
  "description": "Hey Troops,   Today we have a freshly turned 18 year old on our hands standing 5 foot 7 and weighing in at 145lbs. He's smooth young easy going and eager to perform and hopefully make it into the berrics to play with all the other soldiers.   Lee has a slim physique and he knows how to keep his balls and cock smooth as butter. He has a great looking cock, nice, thick and he loves to stroke it fast. His enticing eyes peer into you when he looks at the camera. Those pretty blues just yell for more attention as he plays with himself building up the momentum for his final explosive ending.    Lee relaxes on the couch legs spread out balls touching the softness of the fabric as he slowly strokes his dick showing it off for you viewers. He might do it slow at times but he tugs fast at it as well squeezing his hard dick.   Claude catches some amazing views of his white tight furry ass from below showing all there is for your viewing pleasure. Lee is shy to a point but eager to prove that he has what it takes to be on the front lines. He has plenty of years ahead of him to build up his sexy body even more and to show off that tasty cock. Not sure how he gets his balls so smooth maybe it's his age or he's just great with his hands.   Finally Lee keeps stroking his hard dick fast and hard. Claude has a great wide shot of him but Lee is ready to cum so he has to move in close and right when he does Lee lets loose his load which you would think has been sitting in his soft balls for weeks but this is his second time around and with that much cum coming out I'm sure we'll see him again in the future partaking in some real action with our Veterans.",
  "models": [
    {
      "name": "Lee Harting",
      "person_id": 47163
    }
  ],
  "release_date": "2016-04-20",
  "scene_id": 116183,
  "tags": [
    "Brunette",
    "First Time",
    "Jerk Off",
    "Shower",
    "Solo",
    "Twink",
    "War Chest"
  ],
  "title": "Lee Harting"
}