{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Things have been a little tense around the house since Addison seduced his step-brother Markie a few weeks ago. Markie's denial has given way to open lust, so as Addison comes into the bathroom to brush his teeth while Markie is showering, he cracks the shower door and steals a look at Addison's sweet ass as he begins to stroke his cock. Addison can see him in the mirror, and the thought of taking Markie's raw cock is dominating his mind. Addison takes a look over his shoulder and sees Markie staring back at him intently, toweling off and making his way over to the vanity where he presses his lips against Addison's back, sliding his mouth down Addison's spine and then back up to his neck, where they kiss hard.Markie bends Addison over the counter and falls to his knees, plunging his tongue straight in Addison's hole as he runs his hands up his step-brother's back. Addison closes his eyes and enjoys the moment, as Markie turns him around and begins to suck him off, stroking his own cock all the while. Addison loves the feeling of Markie's mouth on his cock, but what he really wants is to feel Markie's hard dick pounding him, skin to skin, so he turns around and drops to his knees, taking Markie deep into his mouth as Markie's boner grows hard enough to cut diamonds. Sufficiently ready to have his way, Markie bends Addison over a bench and shoves his raw dick inside his step-brother, pounding him like the cock fiend that he is. Addison loves every minute of it, biting his lip with every thrust, before switching positions to ride Markie's meat stick. Addision grinds on Markie's dick, bouncing up and down as he jerks himself off, spitting his load as Markie fucks him missionary, and then watching as Markie pulls out and blasts him with a milky white load of his own right as they hear the sound of their parents pulling up outside.Enjoy!",
  "models": [
    {
      "name": "Addison Graham",
      "person_id": 32786
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-05-11",
  "scene_id": 116182,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "My New Brother: Baring it All"
}