{
  "collections": [
    "Icon Male"
  ],
  "description": "Andy has received an offer from the biggest law firm in Los Angeles that he simply couldn't refuse. As he and his wife get ready to leave to meet Adam Russo, the man who made their dreams possible, Andy begins to feel a little anxious.In his office, Adam admits that he's been watching Andy closely, impressed about all the hard work he's been doing. As they continue to discuss about his past achievements, one of Adam's employees, Billy Santoro, walks in to drop off some files. He looks over at Andy, and takes this occasion to introduce himself. Shortly after, Adam concludes his meeting with Andy. One day, while working late at the office again, Andy hears a peculiar sound coming from the office across the hall. He makes his way to the window to have a look, and catches Adam making out with Billy.Billy stands half naked in Adam's office. He gets down on his knees, pulls his boss's pants down and sucks on his big dick. Andy can't seem to look away. He watches as Billy gets on a chair with his ass open. Adam stretches his hole with his hands and plays with it with his tongue. He reaches inside, tasting that hairy hole. After loosening him up, he takes his cock and pushes it inside of Billy's ass, fucking him hard while pounding on those ass cheeks. Trying to get deep inside of Billy, he flips him over on his back, while holding his legs up. He thrusts his hot cock back in and fucks him harder than before, making Billy moan even louder now. Adam pulls his dick out and jerks himself off, while watching Billy do the same. They both shoot their loads on Billy's furry body. Stunned with what he just witnessed, Andy leaves quietly and in a hurry before someone notices the Peeping Tom.",
  "models": [
    {
      "name": "Billy Santoro",
      "person_id": 35626
    },
    {
      "name": "Adam Russo",
      "person_id": 35627
    }
  ],
  "release_date": "2016-04-14",
  "scene_id": 116191,
  "tags": [
    "Anal",
    "Ass to Mouth",
    "Big Cock",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Mature",
    "Muscular Guys",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex",
    "White Collar/Suits"
  ],
  "title": "The Devil Is In The Details, Scene #01"
}