{
  "collections": [
    "Active Duty"
  ],
  "description": "My goodness, what a very special display we have this time! It's our experienced veteran Quentin, our sexy ball of fun, Ivan James, and a junior squad member, Zack Matthews. Quentin doesn't waste much time before wrapping his mouth around Ivan's swollen cock. Zack definitely likes what he sees! Ivan notices how excited he is to be right there, witnessing the incredibly hot blowjob, so Ivan goes in and takes Zack's dick into his mouth and shows him what an AD vet can really do. After a little while, Zack gets hungry himself, so Quentin gets on his feet and feeds him his plump dick. Ivan, of course, keeps working that big, throbbing knob on Zack.   They go from triple-oral action, to some real fucking on the bed.  Quentin and Ivan know that they tag team better than almost anyone, so Zack is willing to offer his tender hole.   Then Quentin decided to get a better view.  This was awesome!  Leave it to our boy to really mix things up and have the balls to be different.  Quentin actually laid on the FLOOR to get a view from underneath Ivan's ass as Ivan slammed Zack from behind.  And then, Quentin stuck his finger in there and did his part to help out. Once Ivan decides to tag his buddy, Quentin steps up with his large dick, ready to do damage.  And does he ever!  Zack really did a great job enduring the hard fucking from these strong boys.  It reaffirms what I thought about Zack being such a perfect new recruit for us.  He's a hungry bottom that loves getting filled in multiple holes at once, and isn't afraid of some solid pounding.  While Quentin does his thing, Ivan fucks Zack's face.   And it wasn't long before Quentin wanted to be fucked too.  Ivan started it off, really getting deep in Quentin.  They got into some gorgeous kissing, just before Ivan called in the new boy to show 'em what he's made of.  Holy cow, Zack can FUCK!  Yessir, Zack unloaded a full clip on Quentin's ass.  But Ivan wasn't quite satisfied, so he jumped back in for a while before they all ended up back on the bed.  Then Ivan decided he wanted to feel Zack's hard dick pound him, so Zack happily broke him off a nice piece too!   This was an amazing fuck party that has me so excited to see more of Zack.  I especially loved the big ending, right on Zack's face.  Finally, Claude chats with the guys about how they liked it.  They're a threesome with awesome energy, and this was about as fun as it gets!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Ivan James",
      "person_id": 37630
    },
    {
      "name": "Zack Matthews",
      "person_id": 46985
    }
  ],
  "release_date": "2016-04-17",
  "scene_id": 116145,
  "series": "AD - 86 - Quentin Gainz, Ivan James & Zack Matthews",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Hairy",
    "Kissing",
    "Muscular",
    "Smooth",
    "Tattoos",
    "Threesome"
  ],
  "title": "Quentin Gainz, Ivan James & Zack Matthews"
}