{
  "collections": [
    "Icon Male"
  ],
  "description": "After watching two fallen angels have sex, Adam tells Andy that he's been watching him his entire life and he's never seen anyone with a heart as dark as his. With Adam's help, Andy can become a star, a hot shot lawyer, appearing in all the big magazines. All he has to do, is give himself to Adam. <br><br>Adam leans in and presses his lips on Andy's. As they begin to make out on the couch, Adam snaps Andy's shirt open and caresses his smooth body, before removing the rest of his clothes. And while never parting his man's lips, Adam gets undressed as well.<br><br>Andy goes down on his boss to suck on his big cock. Adam watches, pleased to see how far Andy is willing to go. Adam lies down on the couch, enjoying the blowjob, when Andy decides to stand next to his boss' head and shoves his dick inside his mouth, fucking it. <br><br> After taking Andy's cut dick down his throat, Adam places him on his back with his legs up, spreading his ass cheeks. He rims his hole, tonguing it, in preparation for his thick tool. He takes his big dick and pushes it up Andy's ass, showing no mercy to the new recruiter. Adam holds him down as he pounds his virgin ass away. He flips him over to his front side and continues to fuck. As Andy gets fucked by his boss, he jerks himself off, getting ready to climax. Before he does, he lies down on the couch, while Adam stands at his head, jerking as well. Andy finally shoots his load on his stomach and Adam lets his cum fall all over his man's chest. ",
  "models": [
    {
      "name": "Adam Russo",
      "person_id": 35627
    },
    {
      "name": "Andy Banks",
      "person_id": 47130
    }
  ],
  "release_date": "2016-05-05",
  "scene_id": 116194,
  "series": "The Devil Is In The Details",
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "DILF",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex",
    "White Collar/Suits"
  ],
  "title": "The Devil Is In The Details"
}