{
  "collections": [
    "Icon Male"
  ],
  "description": "Adam recognizes the hard work and progress Andy has been making since he began employment at the firm. Feeling that he is ready to move on to the next step, he invites Andy over to his place. But, without telling him what he can expect of the evening, and without any further instruction, Adam leaves.<br><br>Back home, Andy is just about ready to meet up with his boss when he sees his wife looking a little upset. When he asks her to explain she breaks down, ranting about how things haven't been the same since he started working at that firm. After more arguing, Andy's wife storms out in tears.<br><br>Later that night, Andy and his boss have a drink as they discuss Andy's future with the firm. Pleased with how things have been going, Adam brings Andy into the living room, where he is asked to watch the events unfold. <br><br>Andy sits quietly watching two fallen angels, Vittorio Naxos and Jay Johnson, as they kiss each other deeply. Jay goes down on Vittorio, sucking on his cock. He moves his head back and forth as he strokes his own dick while he's sucking. Vittorio gets his own turn, pushing Jay onto his back and sucking on his big dick. Kissing further, they rub their bare skin against each other.<br><br>Jay lays down again, and Vittorio climbs over him, sitting on top of his long cut dick. He bounces up and down until Jay decides to take matters into his own hands. Placing Vittorio on his back, he lifts his legs up and thrusts his cock back in his hole. He repeatedly slams his fallen angel fuck stick in and out of him, banging against his ass cheeks. <br><br>Vittorio continues to take a rough fuck from Jay in many different positions, before laying down side by side. They jerk off, until they send their loads spraying onto each other. ",
  "models": [
    {
      "name": "Jay Johnson",
      "person_id": 47131
    },
    {
      "name": "Vittorio Naxos",
      "person_id": 47129
    }
  ],
  "release_date": "2016-04-28",
  "scene_id": 116193,
  "series": "The Devil Is In The Details",
  "tags": [
    "Anal",
    "Cumshot/cum",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Oral/ Blowjob",
    "Safe Sex"
  ],
  "title": "The Devil Is In The Details"
}