{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Andy Banks is in some deep trouble. As Officer Scott Riley executes a search warrant on Andy's residence, Andy knows his goose is cooked. He tells Officer Riley he's clean, but moments later, Officer Riley locates Andy's stash. Confronted with the prospect of going to the slammer, Andy tries to negotiate a compromise. Officer Riley contemplates this offer, and takes off his belt. Andy protests but Officer Riley tells him he can either do him or the boys downtown in a cell. Given this option, Andy opens his mouth and starts sucking, as Officer Riley pulls him in closer. He puts his hand on the back of Andy's head and shoves his cock all the way down Andy's throat, as Andy bobs on his dick and sucks it like his freedom depended on it. Satisfied that he's down with the program, Officer Riley throws Andy back on the bed and sucks him off to get him hard, and once he's firm enough to do the job, Officer Riley mounts Andy and rides him. Who knew this cop was a straight up dick fiend? Andy is surprised but realizes that if his freedom depends on fucking this cop's brains out... well, that's just what he'll have to do, so he bends Scott over and proceeds to pound him from behind, fucking him hard as Officer Riley pushes his ass back up against Andy's cock.Andy flips him over and fucks him missionary as Scott strokes himself off, pulling out and dousing Scott with his load as the Scott jerks himself off and cums all over himself. Laying there, cum covered and exhausted, Officer Riley is too tired to bother following up on the bust.Enjoy!",
  "models": [
    {
      "name": "Andy Banks",
      "person_id": 34758
    },
    {
      "name": "Scott Riley",
      "person_id": 46987
    }
  ],
  "release_date": "2016-05-13",
  "scene_id": 116276,
  "series": "NDO - 4664 - Andy Banks & Scott Riley",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock",
    "Masturbation",
    "Oral",
    "Smooth",
    "Uniform"
  ],
  "title": "Hard Crackin' Cop"
}