{
  "collections": [
    "Icon Male"
  ],
  "description": "Ty Roderick is flipping through the photos on his camera as he and his new step-brother Killian James get to know each other. The conversation moves from what they wanted to be growing up, to what it was like growing up with their dads. Killian mentions Ty's dark spirit, commenting about how hot it is, triggering his savior complex. This peaks his interest, and Ty flirtatiously asks him if he wants to try and save him. Killian leans in slowly, unsure, but Ty makes the first move, kissing him. Killian pulls himself into Ty. Kneeling on the bed, Killian's hand reaches down and squeezes Ty's firm cheek. Killian's tongue darts in and out of Ty's mouth. Taking their shirts off, their mouths explore further down. Killian's face nears Ty's lightly hairy lower stomach. Ty gives him access, pulling his shorts down and letting Killian take in every inch of Ty's sexy body.Sucking his dick and licking his balls, he explores his step brother. Running his tongue over Ty's thick shaft, he flicks the underside of his head while sucking on his huge rod. Getting hornier and hornier, soon Ty decides it's Killian's turn. Ty pushes him down onto the mattress, folding his legs up over his head to rim his ass, and giving him a wet blowjob. Ty penetrates his brother slowly but deeply, his cock exploring his tight ass. Moaning in ecstasy, Killian asks for more! Ty grabs him from behind around the neck, and kisses the nape passionately.Climbing on top, Killian rides his huge cock, bobbing his muscular frame up and down over him. Ty responds by fucking him from below, hitting his prostate with every thrust, until Killian blows his load onto Ty's toned stomach. This pushes Ty over the edge and, standing over Killian, he sprays his cum right into Killian's waiting mouth.",
  "models": [
    {
      "name": "Killian James",
      "person_id": 47145
    },
    {
      "name": "Ty Roderick",
      "person_id": 35566
    }
  ],
  "release_date": "2016-05-24",
  "scene_id": 116218,
  "series": "Fathers And Sons 4",
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "Cumshot/cum",
    "HD",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex"
  ],
  "title": "Fathers And Sons 4, Scene #04"
}