{
  "collections": [
    "Icon Male"
  ],
  "description": "Nick Capra didn't think he could find love again, especially after coming out as a gay man so late in life. That was, until he met Damon Andros. After only a few months into their relationship, the couple have decided to get married. But before they can move forward, they need to share the big news with their sons. The news about their dads' engagement is unexpectedly dropped over dinner, but the boys are nevertheless thrilled for them! Later that night, Nick is lying in bed, thinking. He tells Damon how surprised he was over his own son's reaction. He didn't expect Ty to take it so well. He also tells Damon how impressed he was of Killian. He always hoped that his son would be as motivated as Killian is. But Damon tells Nick to let his son be who he is. They stare into each other's eyes, and Nick leans in to give Damon a kiss. Nick rolls on top of Damon, pressing his hairy body against his. Damon grabs Nick's ass, squeezing it, as they continue to passionately make out. Damon flips him onto his back, kisses him on the neck and slowly makes his way down to Nick's huge bulge. Nick watches Damon suck on his big dick, drooling down on his balls. Nick gets on all fours with Damon behind him licking and eating his hole. Damon gets on his knees behind him and pushes his rock hard meat inside of Nick's ass. He fucks him hard, banging against his bubble butt. Nick falls flat on the bed, still receiving a rough pounding. They change position, Damon lying on his back with Nick sitting on his tool, riding it. He jerks off as he bounces on top of Damon, which makes him cum instantly all over his man. When Damon is about to shoot his load, Nick gets in a doggy style position and takes it all on his ass.",
  "models": [
    {
      "name": "Damon Andros",
      "person_id": 47146
    },
    {
      "name": "Nick Capra",
      "person_id": 35574
    }
  ],
  "release_date": "2016-05-03",
  "scene_id": 116215,
  "series": "Fathers And Sons 4",
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Oral/ Blowjob",
    "Reality",
    "Rimming"
  ],
  "title": "Fathers And Sons 4, Scene #01"
}