{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Johnny Riley warms himself in the hospitality of Derrick Dime's hotel room, he wonders what Derrick is looking for in exchange. Johnny's not opposed to doing something nice for Derrick, especially since he's let him shower and stay overnight, which sure beats the park bench Johnny was about to crash on. When he asks Derrick point blank what he expects, Derrick is cool as hell, telling Johnny he's definitely into him but doesn't expect him to do anything. Put at ease, Johnny is even more compelled to do something nice for Derrick, so he slowly begins to undress and take off his pants. Derrick's eyes widen and he asks this new stranger what he's doing, to which Johnny replies that he's repaying the favor with a favor. Derrick doesn't need to be told twice, as Johnny moves down to give him head, marvelling at the size of Derrick's huge cock, getting harder and harder now at the promise of Johnny's mouth.Johnny sucks Derrick off real good, and Derrick returns the favor, but as he kneels on the bed staring at Johnny with his dick rock hard, he confesses that what he'd really like is to fuck Johnny from behind. Johnny obliges but tells him to go slow, on account of his giant dick and Johnny's relative newness to taking giant dicks. Derrick concedes and slowly plunges his cock deep inside Johnny, who acclimates to it quickly. Soon enough, Johnny instructs Derrick to fuck him harder, and Derrick follows suit, grabbing Johnny by the waist and taking him to poundtown, as the fuck in every imaginable position before Derrick blasts Johnny with a load straight to the dome, wetting Johnny with a facial that more than makes up for letting him stay in the room. If only every strange encounter ended so nicely.Enjoy!",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Johnny Riley",
      "person_id": 38266
    }
  ],
  "release_date": "2016-05-18",
  "scene_id": 116327,
  "series": "NDR - 23 - Derrick Dime & Johnny Riley",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Abandon Ass"
}