{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Tommy Regan and Scotty Zee have been living next door to each other for a little while, long enough to get to know each other but not long enough that they are particularly close. Still, Tommy won't hesitate to ask a favor if he needs one, which is what brings him by today. Apparently Tommy's wife forgot to pay the electric bill and now Tommy has no hot water to shower with, so he swings by Scotty's place to see if he can grab a quick refresher. Scotty is more than happy to oblige, but not just because he's trying to be neighborly. Scotty secretly lusts after Tommy and as he spies him in the shower, Scotty decides to act on his cravings.As the two guys watch a little tv, Tommy notices Scotty staring at him and confronts him.   Tommy becomes uncomfortable and begins to head to the door, but Scotty gives chase and apologizes. Tommy seems much more angry than he should be, and Scotty wonders where this sudden hostility is coming from. When he asks Tommy, he has no answer, and instead grabs Scotty and kisses him hard against the entryway. Scotty is confused, but as Tommy leads him back to the bedroom, Scotty doesn't protest, deciding instead to go with it. Tommy quickly undresses and Scotty follows suit, kissing down Tommy's body and making his way down to his neighbor's cock. Pulling it out, it's even nicer up close, and Scotty quickly devours it, deep throating Tommy in attempts to show him that he made the right choice. One look at Tommy's head, thrown back against the pillow, is all the confirmation Scotty needs to go further. He mounts Tommy's hard cock and rides him, bouncing his little bubble butt up and down on Tommy's cock as Tommy explores new forbidden territory.   But Tommy's trip has just begun, as Scotty offers to turn the tables. Tommy tells Scotty to take it slow, but once Scotty's cock is inside Tommy, filling him up, Tommy throws his inhibitions to the wind, telling Scotty to fuck him harder as he strokes himself off, cumming on himself just as Scotty pulls out and blasts him with is nut. Laying there covered in cum and confusion, Scotty wonders what this means for the future. As for Tommy, well... at least he knows where he can catch a hot shower to clean up before he goes back to the Misses.  Enjoy!",
  "models": [
    {
      "name": "Scotty Zee",
      "person_id": 46672
    },
    {
      "name": "Tommy Regan",
      "person_id": 47184
    }
  ],
  "release_date": "2016-05-06",
  "scene_id": 116324,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "A Next Door Story : First Time with my Neighbor"
}