{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "In an old, musty room underneath city sidewalks, Dylan Henri and his associate, Nubius, run a bondage service.  A young man named Leander has decided to find out what the whole thing is all about.  <br/><br/>Leander has never been chained before, and he certainly hasn't had two large men take turns fucking him.  But as Nubius and Dylan finally return, after initially cuffing him, it's far too late for sweet Leander to change his mind.  <br/><br/>Leander is blindfolded as the two kiss him all over his face and neck.  The next thing he knows, he's being fed a monster cock.  The stiff shaft works its way in and out of his mouth for a while before Dylan decides to pull down the blindfold.  Leander can now see that the two fat erections he's been slurping down are indeed Dylan and Nubius's.  He sucks for a while longer, making sure to give equal attention to each dick.  Then, Dylan pulls him up and goes down on him, taking Leander's hard dick into his mouth.  Leander and Nubius kiss as Dylan sucks each of their cocks.  <br/><br/>And then, of course, it's Nubius's turn.  He returns the favors to both of the other men, taking their thick cocks deep into his throat.  Dylan joins him, and Leander can't believe he's experiencing both of these hot dungeon masters sharing his lucky dick!  <br/><br/>See how much further this erotic and strange experience goes for Leander, as the three work their way up to hard fucking.  Leander is letting them take turns pounding his ass.  This is a twisted look at a wild, three-way bondage encounter. <br/><br/>Enjoy!",
  "models": [
    {
      "name": "Dylan Henri",
      "person_id": 38264
    },
    {
      "name": "Leander",
      "person_id": 38265
    },
    {
      "name": "Nubius",
      "person_id": 21196
    }
  ],
  "release_date": "2016-04-26",
  "scene_id": 116326,
  "series": "NDE - 222 - Dylan Henri, Leander & Nubius",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Black",
    "Deep throat",
    "Facial",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Interracial",
    "Masturbation",
    "Red Head",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Cuff Love"
}