{
  "collections": [
    "Active Duty"
  ],
  "description": "We have another real fun one this time: it's our favorite, spunky AD veteran, Ivan James, paired up with a newer recruit, Dominic.<br/><br/>  Dominic is first to swing into action, leaning over and taking in a mouthful of Ivan's swelling dick. He's a great cocksucker and it comes through. Ivan even remarks to Claude over his exceptional oral skills. As Dominic sucks on Ivan's enormous erection, Ivan checks out that amazing ass, imagining the work he's gonna do on it.<br/><br/>  But before they get into any fucking, Ivan's having his first taste of Dommy's salami. But it's not too long before Ivan decides not to waste any more time before penetrating Dominic's tight hole. They start out doggystyle on the bed, with Ivan standing behind Dom. Claude gets nice and tight, underneath, showing us just how nice that fat, pulsating dick looks squeezing in and out of Dominic's gorgeous ass.<br/><br/>   Not much later, Dominic is on his back, taking more hard slamming. I really liked seeing him get fucked like this.  Dominic is the type of boy on whom you can empty a full clip and he'll be beggin' for more. Ivan sure liked this, I can tell. These too meshed so well together, I bet they'd jump at the chance to bring another squad member in with the same easy-going personality they have.<br/><br/>   And before they both end up exploding on one another, Dominic takes the opportunity to have one last taste of Ivan's sweet cock. Get a good look at how incredibly hard, wet and irresistible Ivan's boner is. Gosh, what a lucky set of lips on Dominic this time! ",
  "models": [
    {
      "name": "Dominic",
      "person_id": 37534
    },
    {
      "name": "Ivan James",
      "person_id": 37630
    }
  ],
  "release_date": "2016-04-24",
  "scene_id": 116320,
  "series": "AD - 88 - Dominic & Ivan James",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Hairy",
    "Jerk Off",
    "Muscular",
    "Tattoos"
  ],
  "title": "Dominic & Ivan James"
}