{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As new housemate Zane Porter sleeps on the sofa, one of his new roomies, Ian Levine, spots his cock flopping out of his shorts. Figuring he might as well break in the new guy to the routine, Ian Levine gives into temptation and helps himself to a taste. As he sucks on Zane's big sleeping dick, it grows huge in his mouth just as Zane wakes up. Horrified, Zane asks Ian what the fuck he's doing, and Ian doesn't really have a good answer. Luckily for him though, Zane is already half hard, and it's been so long since Zane has had any action that he stops and considers the situation in front of him, and ultimately decides it's better than nothing, so he lets Ian continue, which is perhaps the best decision he's made in a while, as Ian gets straight to sucking him off like a champ, deep-throating Zane's giant cock as he plays with Zane's balls. Zane is horny as he's been in a while, and he's ready to fuck anything that moves, so he flips Ian over and goes to town tonguing his ass, fingering his hole and getting it ready for such a massive cock. But Ian was born ready, and he wants nothing more than to feel the pounding of Zane behind him, so he backs his ass up to Zane's cock as Zane plunges it deep inside him and proceeds to commencing a savage fuck fest in the living room. Zane fucks Ian from behind, then in missionary, and lastly he lets Ian bounce on his meat-stick as Ian strokes his load out, whereupon Zane turns him around and proceeds to blast Ian with the massive load he started in search of. As he wipes the jizz from off the side of his head, Zane swears him to secrecy from the other roomies, which Ian agrees to provided the two of them might hook up again.  Enjoy!",
  "models": [
    {
      "name": "Ian Levine",
      "person_id": 34468
    },
    {
      "name": "Zane Porter",
      "person_id": 37299
    }
  ],
  "release_date": "2016-05-12",
  "scene_id": 116444,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Condom",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "While You Were Sleeping"
}