{
  "collections": [
    "Active Duty"
  ],
  "description": "This time we have a very special introduction to make. This is Chase. He's our newest recruit and so far Chase has stolen our hearts. There just isn't enough I can say to tell you just how sweet and agreeing he is. I just know Chase will become an integral part of the troop, and maintain a solid position as a dependable go-to man.There's no denying Chase is handsome and well-built. He's about average height and has some amazing muscle mass and tone all over his magnificent body. Claude does some nice work moving in tight and capturing some shots of Chase's face. He certainly has those chiseled features we love seeing in our soldiers.  When Chase goes to his feet, Claude swoops underneath for a wonderful shot of the balls as Chase gives himself an oily boner massage. He has a very nice cock and he certainly knows how to handle it well. We also get a look from Chase's own perspective, and see how nice his hands work the stiff cock.  And then we get one of my favorite parts of the solo -- the couch grind! Wow, Chase is amazing at getting into a rhythm and working his body up and down in a sensual way. He turned this into a dance that will really get you interested in seeing him in action. You know what they say, a man can fuck only as good as he can dance!As Chase works toward a big finish, we see lots of sweat forming and that big, swollen dick isn't getting any less greasy. This solo is at the thick end of the sultry spectrum. Chase is the type of guy that gets into the fun and gets in deep. My prediction is that his strong, solid persona will add heaps of intensity to his upcoming encounters. And take a look at his amazing load! This is one guy I'm putting on my watch list!",
  "models": [
    {
      "name": "Chase",
      "person_id": 47270
    }
  ],
  "release_date": "2016-05-04",
  "scene_id": 116443,
  "series": "AD - 91 - Chase",
  "tags": [
    "Brunette",
    "Jerk Off",
    "Muscular",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Chase"
}