{
  "collections": [
    "Active Duty"
  ],
  "description": "My goodness, what an amazing thing to capture on camera!  This was such a cock-stiffener.  I'm more than delighted to say that we have Matthew Reeves back, after his incredible solo debut, and joining him is our hungry bottom, Colton Phobos.  <br></br>Colton didn't hardly waste any time getting his lips around Matthew's stiffie.  And what a trooper Matthew was, even from this early point!  It's easy to see that he simply enjoyed the sensuous blowjob so much his inhibitions were already melting.  <br></br>Colton really gave this newbie the full treatment, sucking him off for a good while before shifting gears.  It sure buttered Matthew up because there certainly was no protesting when Colton mounted his cock!  And goodness, what a ride.  Matthew is a natural.  He had all the right moves to make Colton think he was being fucked by an old vet.  Check out the way Matthew jerks his FIRST cock while Colton writhes and rides.  It's a beautiful thing.<br></br>Then Matthews goes ahead and takes more of power role, sliding that hard dong into Colton from behind.  Gosh, the girls must love this straight boy because he definitely ain't no slouch when it comes to working up a good fuck rhythm.  <br></br>Next, Colton went to his back to take more punishment.  Claude does some excellent work here, getting a view from way up top, showing us how great Colton looks while getting slammed.  And Matthew, of course, grabbing the bull by the horn, stretching Colton's sexy legs forward, taking advantage of that slutty soldier's hole.  And we end up with a couple insane eruptions from each recruit, Colton's while being plowed from behind.  ",
  "models": [
    {
      "name": "Colton Phobos",
      "person_id": 46601
    },
    {
      "name": "Matthew Reeves",
      "person_id": 47223
    }
  ],
  "release_date": "2016-05-01",
  "scene_id": 116409,
  "series": "AD - 90 - Colton Phobos & Matthew Reeves",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "First Time",
    "Jerk Off",
    "Straight",
    "Tattoos"
  ],
  "title": "Colton Phobos & Matthew Reeves"
}