{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With their own sex life stagnating, Max Penn and Dante Martin have hatched a plan to try and spice things up. Both of them have been eyeing the hot guy at the gym who always comes alone, but the only problem with muscled stud Benjamin Swift is that they are pretty sure he's straight. This doesn't deter them, it just means they have to be a little more creative if they want him to come play.With his plan hatched and the help of a few incriminating photos, Dante approaches Benjamin one afternoon in the parking lot, and makes him an offer he can't refuse. Bejamin tells him he isn't gay and can't believe Dante and Max are blackmailing him for sex, but Dante tells him it isn't the first time someone tried it, signaling to Max that the plan is a go. Benjamin concedes and in no time finds himself back at their pad, laid out on the bed, as both Dante and Max team up to suck him off. Max deep throats his cock while Dante tongues his balls, and then they both tongue his head, flicking it as they kiss each other. Benjamin has to admit it feels better than his girlfriend, and decides that, all things considered, maybe this isn't so bad. WIth his hard on raging and staring back at them, Max decides he wants some of that dick, and Benjamin tells him it's too bad he doesn't have a pussy. Max winks slyly and turns around to mount Benjamin's pole, sliding down on top of it and working his hips as he bounces up and down on Benjamin's cock while sucking Dante off. Benjamin stares at Max's bouncing butt and fucks him hard as Dante chokes him with his cock, and then they switch, as Max lay on his stomach while Dante pounds him from behind. Max sucks off Benjamin as he strokes his cock, losing his load as Dante pulls out and both he and Benjamin blast him with jizz, sure to be kept a little secret between the three of them.Enjoy!",
  "models": [
    {
      "name": "Benjamin Swift",
      "person_id": 47301
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Max Penn",
      "person_id": 38088
    }
  ],
  "release_date": "2016-05-19",
  "scene_id": 116445,
  "series": "NDB - 4665 - Dante Martin, Max Penn & Benjamin Swift",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Straight Men",
    "Threesome"
  ],
  "title": "The Hot Gym Guy"
}