{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "During his time as a private attorney, Dylan Knight has seen some dumb dicks, but the case that has made its way across his desk has to rank right up there with bonehead moves. Markie More has been busted, dead to rights on CCTV doing less than savory things on company time, and while Dylan is sure he can clear Markie of any legal trouble, it looks like Markie is gonna lose his job no matter what, which kind of sucks for him, because the only thing keeping him out of jail is his lawyer, and Dylan needs to get paid. Without employment, Markie certainly doesn't have legal fees at his disposal, which could prompt an even more dramatic downward spiral for our hero. Given these circumstances, it isn't hard to see why Markie would offer to 'take care' of Dylan in another way, especially when he finds out that Dylan's relationship with his boyfriend is on the rocks. Dylan realizes Markie can't pay, so he figures he might as well extract some measure of compensation for his hard work, and agrees to head back to Markie's place, where Markie strips him out of his clothes and begins to suck him off. Sucking dick like his freedom depended on it, Dylan fucks Markie's mouth as Markie slaps his dick against his tongue, before straddling Dylan reverse cowboy. Giving new meaning to the term 'mounting a defense' Markie grinds and rids Dylan willingly and ably, but truth be told, what Dylan would really like is for Markie to flip the script fuck Dylan's brains out. Telling him as much, Markie obliges, throwing Dylan down face first onto the bed and entering from behind, pounding him out as Dylan strokes his cock, spitting a huge load all over his chest as Markie pulls out and offers his best 'plea', smearing his seed all over Dylan's stomach as the Defense rests.Enjoy!",
  "models": [
    {
      "name": "Dylan Knight",
      "person_id": 31577
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-05-26",
  "scene_id": 116792,
  "series": "NDB - 4667 - Dylan Knight & Markie More",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Body-Builder",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Pro-Boner"
}