{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As his grandfather prepares dinner, Brandon Moore comes in with Scotty Zee, the new handy man, fresh from showing him all the things around the house that needs fixing. While they've banged out most of the items on the list, they're still not quite finished but the day is already starting to wind down, so Brandon asks Scotty if he'd like to stay for dinner. Scotty accepts and while his grandfather cooks, the guys take a load off in the other room. Brandon, little troublemaker that he is, decides he's had about enough of Scotty giving him 'fuck me' eyes and decides to do something about it, inching across the room silently and making his way over to Scotty's reclining feet. Slowly he begins to unzip Scotty's cover-alls, pulling his cock as Scotty silently questions him. Brandon puts his finger to his lips and tells Scotty to hush, as he starts to go down on him, deep-throating his cock as Scotty sits back. Clearly undeterred by the threat of getting caught, Scotty embraces the situation, pushing Brandon's head down onto his cock and then turning Brandon around to tongue his asshole, fingering him as he fantasizes burying his raw cock deep in Brandon's hole.  <br> <br>Minutes later, his fantasy is reality as Scotty has Brandon pushed up against the wall, mere inches of plaster separating them from Brandon's gramps in the kitchen. Brandon bounces his sexy ass against Scotty's thick cock, as Scotty grabs him by the waist and pounds him harder, and when grandpa has to go to the store for one last ingredient, Brandon and Scotty move to the center of the room, getting much louder as Scotty fucks him raw dog missionary style. Brandon strokes himself off as Scotty fucks the cum out of him, and then Scotty pulls out and blasts Brandon's freshly fucked hole with his load, before shoving it back inside and continuing to fuck away, at least until they hear the sound of the car pulling back up in the driveway.<br> <br>Enjoy",
  "models": [
    {
      "name": "Brandon Moore",
      "person_id": 35927
    },
    {
      "name": "Scotty Zee",
      "person_id": 46672
    }
  ],
  "release_date": "2016-05-25",
  "scene_id": 116768,
  "series": "NDR - 24 - Scotty Zee & Brandon Moore",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Red Head",
    "Rimming",
    "Tattoo/Piercing",
    "Workers"
  ],
  "title": "Handy Man To-Do"
}