{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As they pull up to his parents' house Luca Rosso tries to maintain a level of calm, as he can tell Zander Cole is a bit nervous for what's about to go down. Zander asks if Luca's parents are home and Luca tells him they're out of town and not to worry. Zander has never been with anyone before and Luca is focused on not losing him to nerves before they even get started, so he kisses Zander and tells him not to worry as they make their way inside. Once inside, Luca lays Zander out on the couch and begins to slowly undress him, kissing him down his chest and making his way to Zander's fly, unzipping it and pulling Zander out of his pants. Luca takes Zander's cock in his hand, gently massaging it before bending over to give it a kiss on the head, and then graduating to full on deep throating. Zander's cock grows full and thick inside Luca's mouth, as he throws his head back against the pillow and enjoys his first blow job. Luca asks him if he wants to switch and Zander is game even though he's worried he won't be as good at it. Luca tells him not to worry as he stands up, and Zander proceeds to suck him off with technique that is surprisingly natural for a first timer. Luca tells him as much, and with his confidence sky-rocketing, Zander seems ready for what comes next.Luca bends Zander over on the sofa, slowly entering from behind, filling Zander as he pumps from behind. Taking care not to go too fast, Luca eases his cock in and out of Zander, until Zander tells him to fuck him harder. Surprised, Luca obliges, and begins to pound his boyfriend from behind. Zander loves every second of it, as they move to the other sofa and Zander mounts Luca, grinding on his cock as he bounces up and down. Luca holds Zander by the legs and proceeds to slam him down onto his cock, then flips him onto his back and pile drives him while Zander strokes his dick, spitting his load out onto his stomach and Luca pulls out and coats him with his own happy ending. As Zander cleans himself up, exasperated and satisfied, it's obvious that this may have been his first time, but will definitely not be his last.Enjoy!",
  "models": [
    {
      "name": "Luca Rosso",
      "person_id": 46612
    },
    {
      "name": "Zander Cole",
      "person_id": 46904
    }
  ],
  "release_date": "2016-05-20",
  "scene_id": 116767,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock",
    "Latino",
    "Oral",
    "Smooth"
  ],
  "title": "Virgin Trick"
}