{
  "collections": [
    "Active Duty"
  ],
  "description": "We sure get lucky sometimes and this is most certainly as lucky as it gets.  I'm sure we all remember the incredible Zack Matthews who recently jerked his fat military meat for us recently.  I'm overjoyed to say that he's BACK!!!  And even more excited that he's agreed to hook up with a guy for the FIRST TIME ever, and that guy is our very own troop veteran, Allen Lucas!  <br></br>As soon as the underwear come off, Allen is hard as a rock!  Although Zack had a really great attitude, and, in my opinion, a lot of confidence for a first timer, he was more reticent than our veteran Allen.  Allen realized this early and did a nice job easing Zack into the water.   <br></br>Allen leaned over and began sucking Zack's dick to fatten it up.  It didn't take much before Zack became hungry for his FIRST taste of cock ever!  Ohhhh boy!  My favorite thing is seeing straight boys giving head for the first time.  And WOW!  Zack is a fuckin' natural!  I ain't kiddin' neither.  He sucks Allen's enormous erection like a dang professional, looking into Claude's camera, and enjoying every minute with that throbbing dick in his mouth.   <br></br>Then, of course, Allen goes in for another taste.  Zack lays back down on the bed so Allen can go to work on that big dick.   <br></br>After Allen does some vigorous work on Zack's fat dong, he turns him around and spreads his ass for a good taste of that tight, VIRGIN hole!  Goodness, what a sweet ass on that boy Zack!   <br></br>And then it's all the way the pound town!  We see Allen's swollen-to-the-max dick slide gently into Zack's virgin hole and slowly build up the in-and-out pace.  Zack suffers through this first part so well for a rookie, it sure impressed Claude and Allen.   <br></br>This is where the magic happens!  Allen decides to show Zack what getting fucked is all about.  He gets up to a good rhythm and Zack, amazingly, hangs in there and loves it!  Claude gets us some great shots, including several of Zack's handsome, smiling face as he's being rammed.   <br></br>And the fun doesn't end there.  Zack decides to really show us what he's made of by riding Allen's hard dick.  I can't believe how good he is!  He rides like a seasoned veteran and bounces just right on Allen's happy cock.   <br></br>Finally, the guys jack their stiffies until they each erupt, side-by-side.  This is a fantastic display from our newest man, and I know he's gonna become the star of our roster in no time.",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 37870
    },
    {
      "name": "Zack Matthews",
      "person_id": 46985
    }
  ],
  "release_date": "2016-05-08",
  "scene_id": 116765,
  "series": "AD - 92 - Zack Matthews & Allen Lucas",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "First Time",
    "Jerk Off",
    "Kissing",
    "Muscular",
    "Rimming",
    "Smooth",
    "Straight",
    "Tattoos"
  ],
  "title": "Zack Matthews & Allen Lucas"
}