{
  "collections": [
    "Next Door Raw"
  ],
  "description": "The club is popping and the drinks are flowing for the employees of the go-go club but backstage, the real heat is happening, as Brendan Phillips eyes bartender Addison Graham while he grabs his back stock. Noticing Addison's hard on through his short shorts, Brendan tells Addison he should help him out before he goes back out to his clientele. Addison is worried about his shift but Brendan tells him someone else will cover him, as he reaches for Addison's cock. Addison has been crushing on Brendan for quite some time, and though it's not ideal, he's eager to seize on the offer, so he tells one of his bar backs to cover him and closes the storage closet door, as Brendan pulls his shorts off and begins to suck him off. Addison's hard on grows from passive to full on and raging as Brendan just keeps on deep throating him. Growing more horny by the second, Addison pushes Brendan up against the wall and tears him out of his shorts, falling to his knees as he returns the favor, sucking Brendan's huge cock as he strokes himself off. Brendan, who is used to getting his way, pushes Addison's head further down onto his cock before flipping around to let Addison have his way with him. Addison doesn't hesitate, shoving his raw cock all the way inside Brendan, pumping him full of hot hard cock. As Addison thrusts and pounds, Brendan strokes himself off, as they switch positions and Brendan rides Addison reverse, legs spread, cock hard as a rock, as he spits his load all over the floor below. Flipping him over one more time, Addison pushes Brendan up against the counter and proceeds to fuck him as hard as he can. Brendan begs Addison to breed his hole, and Addison complies, gushing his load all over Brendan's hole before shoving his raw cock back inside, just as the bar back calls for Addison to come back to work.Enjoy!",
  "models": [
    {
      "name": "Addison Graham",
      "person_id": 32786
    },
    {
      "name": "Brendan Phillips",
      "person_id": 38107
    }
  ],
  "release_date": "2016-06-01",
  "scene_id": 116811,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock Strap",
    "Masturbation",
    "Rimming",
    "Smooth"
  ],
  "title": "Raw Hookup"
}