{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Officer Ducati and his buddy Bruce who is a PO are on break enjoying some donuts in the police cruiser when they see a few punks hanging out side drinking beer and talking about smoking the weed. Officer Ducati notices that one of them is Trent who is on house arrest but he is obviously out of his house. The two decide to go fuck with the college kids. Trent and his friend Kyle try to hide the beer but it's too late. The officers confront them and take them inside Trent's house to have a talking too about their misbehaving. The PO takes Kyle to a different area of the house while Trenton and Trent are in the living room. Trent knows exactly what's going to happen and he isn't too pleased about it. Officer Ducati tells him to get on his knees and suck his cock unless he wants to go to jail. Trent reluctant at first but gets into a nice groove handling Trenton's massive cock. He blows him extremely well gagging all over that fat dick of his. The Officer is calling all the shots and now it's time for him to bend over and spread that ass wide open for all to see. Trenton rims that sexy smooth College ass placing some fingers inside as well telling Trent to finger himself. Officer Ducati is having too much fun with this but is ready to fuck this little offender hard. He has Trent sit on his hard throbbing cock and ride his shaft up and down until he's ready to bend him over and fuck him hard and deep. Trenton is pounding that sweet smooth ass and can feel his balls ready to burst so he flips the kid on to his back and pumps away and finally blows his load all over Trent's smooth young chest. Trenton isn't done with him yet and wants a nice facial from this College stud.",
  "models": [
    {
      "name": "Trent Ferris",
      "person_id": 33019
    },
    {
      "name": "Trenton Ducati",
      "person_id": 32299
    }
  ],
  "release_date": "2016-06-13",
  "scene_id": 116854,
  "series": "DL - 19 - Trenton Ducati & Trent Ferris",
  "tags": [],
  "title": "Busted and Banged Part 1"
}