{
  "collections": [
    "Icon Male"
  ],
  "description": "After committing his greatest sin, Nick Capra turns to the church for forgiveness. Entering the confessional, he tells Father of the events that led to his infidelity. Nick's stepson, Josh Stone, had been staying at the couple's house for several days. Since Nick works from home, he and Josh had had plenty of time to get to know each other... maybe even a little too much. Josh and Nick are having a nice talk out on the terrace when, without warning, Josh kisses his new step-dad on the lips. Confused, Nick pulled away but Josh persists until Nick can no longer fight him and gives in. Kissing passionately, they slowly make their way to the bedroom, where Nick gently laid Josh on the bed. Climbing on top of him, he presses his toned muscular body against his new son's. Nick removes the young boy's clothes and goes down on him to suck on his cut cock. Holding Josh's dick, he licks and sucks on the young man's balls. It isn't long before Josh wants to taste his step-dad's thick mature cock. Getting on his knees, Nick thrusts his tool in and out of his boy's mouth. Ready to take a ride on his mother's new man, Josh lies down on his back, while Nick holds his legs up. Nick works on rimming his stepson's hungry hole in preparation for his big dick. After loosening him up, Nick plunges his dick all the way up into the boy's ass. He fucks Josh in different positions, on his side and on his stomach, until Nick flips the boy onto his back, and jerks off on top of him. Nick's cum comes running down on Josh, who shortly after shoots his load onto his stomach.",
  "models": [
    {
      "name": "Nick Capra",
      "person_id": 35574
    },
    {
      "name": "Josh Stone",
      "person_id": 46615
    }
  ],
  "release_date": "2016-05-12",
  "scene_id": 116992,
  "series": "Forgive Me Father 4",
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Mature",
    "Muscular Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex"
  ],
  "title": "Forgive Me Father 4, Scene #01"
}