{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Coming over to meet up for a work out, Jonah Marx happens by Colton Phobos' window only to catch him in bed, legs spread, going to town on himself. This wouldn't be such a big deal to Jonah except that Colton also has a giant dildo shoved up his ass, which is news to Jonah. They've been friends for a long time, and Colton has never mentioned that he likes dick, nor has he ever shown any signs. But now here he is, dildo clearly being used, as Jonah spies from the doorway. Making a bit of noise, Colton realizes he's being watched and for one awkward second, the guys don't really know what to do, but Jonah breaks the silence and surprises Colton when he asks if he can watch. Colton is surprised but not weirded out by the proposition, so he continues to fuck himself while Jonah begins to stroke himself off. Seeing Jonah's hard cock while he fucks himself with a fake one, Colton reaches out to grab Jonah's member. Jonah is hesitant at first, but quickly relents, and in no time he finds himself getting blown by Colton, pushing his friend's head deeper and deeper onto his hard cock. Colton begs Jonah to fuck him, and Jonah obliges, mounting Colton from behind with his raw cock and pounding him out doggy style, before flipping him over. Pulling out, Jonah sucks Colton off, giving his first blow job before shoving his bareback dick back inside Colton missionary, as Colton strokes his load out all over himself just as Jonah is ready to bust his nut. He pulls out and blasts Colton with his load and the two guys have a laugh as they clean themselves up and promise to keep the secret between the two of them.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Colton Phobos",
      "person_id": 47420
    },
    {
      "name": "Jonah Marx",
      "person_id": 47421
    }
  ],
  "release_date": "2016-06-08",
  "scene_id": 117057,
  "series": "NDR - 26 - Colton Phobos & Jonah Marx",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Toys"
  ],
  "title": "Does It Feel Like My Dildo"
}