{
  "collections": [
    "Next Door Taboo"
  ],
  "description": "With their parents gone, step-brothers Johnny Torque and Javier Cruz are tasked with finding something to do with their day, so Johnny suggests they take the quad out for a spin. After a day of hard riding, Johnny pulls up under a tree to catch his breath. Reaching for his shirt, he feels something hard in Javier's pants, and quickly realizes his brother has a hard on. Javier is embarrassed, both because his secret is out, but also because Johnny isn't necessarily known to take it easy when he's got you in a pickle. Knowing his goose is cooked, Javier pleads with Johnny to keep his secret, telling him he'll owe him. Smiling, Johnny unzips his pants and tells Javier he'll be collecting on that debt immediately, and shoves his cock inside Javier's mouth. Realizing he's just been gifted the easiest 'get out of jail free' card, Javier gets to work, deep throating Johnny's cock until it grows rock hard in his mouth. Javier can sense that Johnny is kind of into it, but when Johnny pushes him back against the seat and kisses him hard on the lips, telling him not to say a word, well then Javier realizes this was all just an excuse, and that Johnny's just as into dick as he is. Johnny verifies this as he works his way down Javier's body to his cock, sucking him off right there out in the open. With both brothers hard and horny as hell, Johnny tells Javier to bend over, and he enters from behind, pounding Javier on the quad. Javier bounces his ass in rhythm, aided by the shocks of the quad, as his ass slaps against Johnny's stomach before gliding up and down Johnny's shaft. <br><br>Johnny turns him over onto his back as Javier strokes himself off, spitting his load onto his chest as his step-brother pulls out and shoots his load all over him, commencing their secret in a jizz-filled pact, and making a mess that they better clean up before their parents come home.<br><br>Enjoy!",
  "models": [
    {
      "name": "Javier Cruz",
      "person_id": 47392
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    }
  ],
  "release_date": "2016-06-02",
  "scene_id": 117050,
  "series": "NDB - 4669 - Johnny Torque & Javier Cruz",
  "tags": [],
  "title": "Handy Step Brother"
}