{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm so glad to see our boy James back!  He was such a hard-working soldier, and stormed out onto the frontlines with some very sexy energy a little while back. He's decided to resume a bit more of a prominent role here on the squad again. All it took was one look at Mike Hollister.  Once Claude gives the ol' go-ahead, the recruits strip naked and do some work on their dicks, fattening them up for action. James is first to initiate contact. He just turns, leans in, and wraps those soft lips around Mike's strong cock. And then we have Mike returning the favor, taking James's pumped-up stiffy into his mouth and bobbing nice and hard. Mike is the type of guy you can always depend on to do things the right way. After Mike sucks for a while, James wants another go, so Mike stands up to allow himself to work in some nice hip thrusting. James, as we know, likes to be face fucked, so Mike did wonderfully here, playing into his partner's strengths.But don't think too quick...Mike might look like a sweetie, but when you see the way he punishes James's ass, you might change your mind! That's right, once Mike slides his throbbing dick into James's eager ass, all bets are off.  Then, when James turns over to his back, Mike slows down a tad, but he's only changing gears. He works back up to that intensity and Claude moves around behind Mike to show us the strength in his legs and ass.  After a steaming hot kiss, Mike hops up on the bed and continues the fuck session, this time doggystyle. There's an incredible moment where Claude gets underneath James's face, with Mike's face just behind it. This is an excellent showing for both boys. There're a lot of incredible moments here that I think many of us will be coming back to experience.",
  "models": [
    {
      "name": "James III",
      "person_id": 37283
    },
    {
      "name": "Mike Hollister",
      "person_id": 46909
    }
  ],
  "release_date": "2016-05-15",
  "scene_id": 117056,
  "series": "AD - 94 - James & Mike Hollister",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Duo",
    "Jerk Off",
    "Kissing",
    "Muscular",
    "Tattoos",
    "White Butt"
  ],
  "title": "James & Mike Hollister"
}