{
  "collections": [
    "Active Duty"
  ],
  "description": "Now I want you to remember this young man, because you'll soon be seeing (I hope) plenty more of him.  That's how sure I am there'll be a booming demand for this fresh, hot recruit, Leo Balcony!  Just as I woulda thunk, Leo is an outdoorsy, guy's guy.  He tells Claude that he enjoys hiking and riding motorcycles.  I can tell Leo grew up using his hands and getting dirty.  Leo peels off his shirt and pants and we see that his body is toned to perfection.  He has a few nice, sexy tattoos on his shoulder and arm.  Right from get-go, I can tell he has no reservations about this experience.  It's his first time getting naked on camera for an audience and he is definitely comfortable.  He takes his sweet time before showing us what's underneath his gray boxer shorts.  But it's worth the tease -- Leo's dick is absolutely magnificent.  When it pops out, it's already fully flared, yearning for tender attention.  Leo knows exactly how to please himself, reaching right for the lube and greasing up his anaconda.  Claude shows us a few more great views of Leo while he manipulates his girthy meat on the edge of the bed, then Leo moves to a standing position.  I really like the way we get to have a look at Leo's dick from Leo's own perspective.  Then we have Leo reclining on a long, red, velvet-looking chair.  Claude shoots him at first from Leo's feet and we see his toes just barely sticking into the frame.  We can also see his ass a little more.  He has one hand behind his head and the other jerking that stiff meat for us.  After a little while, he incorporates both hands and really gets the blood flowing, from his balls to the head of his dick.  And then we get some wonderful pillow fucking.  Claude gets close to show us just how exquisite Leo's ass is.  Goodness, that soft, flawless skin would look good getting pounded!  Let's hope we're lucky enough to see that happen very soon.",
  "models": [
    {
      "name": "Leo Balcony",
      "person_id": 47461
    }
  ],
  "release_date": "2016-06-01",
  "scene_id": 117052,
  "series": "AD - 99 - Leo Balcony",
  "tags": [
    "Big Dick",
    "Brunette",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Solo",
    "Tattoos",
    "Twink",
    "War Chest"
  ],
  "title": "Leo Balcony"
}