{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "When a hot, pumped-up new guy shows up at Caleb King and Osiris Blade's gym, there's a bit of a stir.  Damian Flexxx has been conditionally hired as the newest trainer at their downtown facility and the boys can't wait to get trained. As Damian helps Osiris do a chest workout with dumbbells, Damian's crotch goes right into Osiris's face.  Caleb notices and realizes it couldn't have been a mistake.  Using just the right subtlety, Osiris and Caleb coax Damian out of his yoga tights and Caleb has the immense pleasure of being the first guy at the gym to suck the new trainer's cock!  And Osiris jumps right in to get a piece of Caleb's soft, skilled mouth. Damian really likes the vibe so he decides to see if Caleb would be willing to eat his ass.  Caleb, being the dick and ass fiend he is, happily has a taste of Damian's hole.  As he enjoys Damian's ass, Osiris gives Caleb a sensuous blowjob.  It's not long before Damian decides he wants to try out Osiris's mouth as well.  They switch things up and Caleb buries his face in Osiris's ass while Osiris slurps deep on Damian's hard cock. Once the boys are warmed up, Damian cranks things up to the next level, sliding his throbbing erection into Osiris's tight ass.  Caleb assists in the drill by fucking Osiris's mouth at the same time.  They take turns on Osiris's sweet bottom, before Caleb takes a turn getting pounded by each dude.  Wow, Damian heard the clientele was eager to sweat, but this is ridiculous!!!   Enjoy!",
  "models": [
    {
      "name": "Caleb King",
      "person_id": 38285
    },
    {
      "name": "Damian Flexxx",
      "person_id": 47374
    },
    {
      "name": "Osiris Blade",
      "person_id": 37349
    }
  ],
  "release_date": "2016-05-24",
  "scene_id": 117173,
  "series": "NDE - 224 - Damian Flexxx, Osiris Blade & Caleb King",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Black",
    "Blonde",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Humping Iron"
}