{
  "collections": [
    "Next Door Originals"
  ],
  "description": "On the set of his latest shoot, Johnny Riley tries to unwind between shots in his dressing room, pouring himself a drink and maybe taking 5 minutes for a little personal attention, taking off his robe and dialing up a little eye candy on the old device. Unfortunately for him, his room as a stow-away, as star-crossed production assistant Ethan Slade crouced behind a mirror filming him. Johnny hears a slight stir behind the mirror and shoots up, demanding to know who is in his room. As Ethan sheepishly reveals himself, Johnny's only concern is the contents of the video, and he immediately enters into damage control mode, telling Ethan he's gotta delete the video. Ethan balks at the this request, and so Johnny moves to bribery, telling Ethan he can have whatever he wants.   Still unrobed, Ethan's gaze falls to Johnny's package. Johnny sees this and with a look acknowledges Ethan's curiosity, telling him he can have what he desires if they can work out a deal. WIth that, Ethan pushes Johnny back into his chair and proceeds to finish what Johnny started, sucking him off in his recliner as his bubble butt starts to poke out of his cargo pants. Johnny as to admit this feels even better than some pathetic jerk off sesh, so when Ethan positions himself in a 69, Johnny obliges, eating Ethan's asshole as Ethan continues to suck his cock. Sliding down Johnny's body, Ethan mounts Johnny in the chair, riding him backwards as Johnny watches his ass grind on his cock, and then flipping him over for some doggystyle pounding. All of this is well and good, but Ethan didn't risk his job just to get some dick, so he tells Johnny it's time to switch. Johnny, caught between a rock and Ethan's hard place, has no choice but to accomodate the request, so he mounts Ethan and starts to stroke himself off as Ethan pounds away, losing his load all over the production lackey just as Ethan is ready to pull out and lose his own load.  As both guys lay cum covered and exhausted, Johnny implores Ethan to erase the video again, but Ethan has second thoughts, now that he realizes what a hot bottom this top star really is. Enjoy!",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 38266
    },
    {
      "name": "Ethan Slade",
      "person_id": 47398
    }
  ],
  "release_date": "2016-06-03",
  "scene_id": 117148,
  "series": "NDO - 4670 - Johnny Riley & Ethan Slade",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Famously Fucked"
}