{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For best buds Andy Banks and Jason Maddox, it seems like everyone is getting some action but them. Fresh from their game but still suffering from a case of blue balls, Jason takes a shower while Andy rummages through his DVDs to find something to watch. Stumbling across some decent porn, Andy pops it in and quickly gets a hard on at what he sees, scrambling to put it away when he hears the shower shut off. As Jason finds him with a puddle in his shorts and a guilty look on his face, Andy concedes that he's too horny to play video games or do anything else. Jason agrees that he's also fairly pent up, and with a look, Andy makes a move, resting his hand on Jason's thigh. Jason seems a bit uncomfortable but he also doesn't shoo Andy away, which gives him the confidence to try and push it a little further, sliding his hand up Jason's leg. Jason begins to protest, but Andy reasons that if he really wanted him to stop he'd have already said somthing. With that, Andy slides down Jason's body and pulls his cock out from his boxers, taking it in his mouth as Jason closes his eyes and tries to tell himself this is normal. As Andy continues to suck him off, Jason lets his concerns evaporate, as he pushes Andy's head down further onto his cock, gagging his buddy with his rock hard dick. Andy sucks Jason off for a while before Jason returns the favor, and now rock hard himself, Andy begs Jason to fuck him hard.<br/><br/> Jason is a bit unsure of what he's doing, but he slides his cock inside Andy and begins to pound, as Andy moans with pleasure. Jason has to admit his cock feels really nice as he goes in and out of Andy's bubble butt, but Andy wants control, so he positions Jason on his back and mounts him, riding him like a horse as he bounces up and down, grabbing the headboard as Jason pounds him from below. With both guys ready to explode, Andy flips over one more time onto his back, as Jason goes for end zone, fucking Andy hard as he strokes himself off, jizzing all over his stomach and chest as Jason pulls out and blasts him with his load. Better a puddle on your stomach than in your pants, he reasons, as the two of them get cleaned up for dinner.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Andy Banks",
      "person_id": 34758
    },
    {
      "name": "Jason Maddox",
      "person_id": 34755
    }
  ],
  "release_date": "2016-06-09",
  "scene_id": 117174,
  "series": "NDB - 4671 - Andy Banks & Jason Maddox",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Masturbation",
    "Muscular",
    "Straight Men"
  ],
  "title": "STR8 Basketcase"
}