{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Tommy is at it again and this time he's beating off in a public locker room hoping to get caught. Tommy is smacking his dick on the lockers and yoga mats just waiting for an unexpecting patron to coming walking in. Javier has no idea what he's walking into but he sees Tommy turn around quick when he comes into the locker room. He only got a glimpse of that big dick and now is curious about it. Tommy acts sorry that he got caught but he's really not. Javier wants to see the goods now that he's been caught red handed. Tommy flops his big thick dick out and Javier can't believe how big it is.  He grabs it with both hands stroking it and also examining how fat it is. Tommy moves it closer to his mouth and now Javier takes it inside and loves the taste of it. He can feel the precum on his tongue as he licks Tommy's shaft up and down. He has to use both hands with this thick heavy meat. Tommy isn't selfish at all and begins to blow Javier's sexy uncut dick. Two big cocks in one locker room is a sight to see. Tommy is vocal and eager to see that ass so he turns Javier over and spreads his ass wide open to dive his face right in between those firm hairy cheeks. Tommy is in heaven as he rims that tight eager ass of Javier's. That ass is dripping with spit now so Tommy grabs hold of Javier's hip and pushes his big dick balls deep into that sexy ass. Now he's fucking him really good making sure he takes care of this big dick that will have cum ready to blow soon. Javier rides that massive cock also sliding up and down. You can see just how meaty this dick is as it squeezes deep into his ass. Finally Tommy gets him on the ground and piles deep into him hard and fast until Javier can't take it anymore and cums all over himself with Tommy's hard throbbing cock inside of him.",
  "models": [
    {
      "name": "Javier Cruz",
      "person_id": 35606
    },
    {
      "name": "Tommy DeLuca",
      "person_id": 47463
    }
  ],
  "release_date": "2016-06-16",
  "scene_id": 117126,
  "series": "EBD - 531 - Tommy DeLuca & Javier Cruz",
  "tags": [],
  "title": "Locker Room Surprise"
}