{
  "collections": [
    "Active Duty"
  ],
  "description": "Here's a nice taste of some ol' fashioned fun!  When you have a guy like Dominic involved, the mood will be light and sexy, and when Ryan Jordan's in the mix, you can't count on laughter!   <br><br>Before they take off their underwear, as they fatten up their boners, Claude says, 'First one to show his hard dick is gonna get it sucked.' The boys snicker and Ryan whips out his giant, erect cock.  Sure enough, Claude hit it on the head, as Dominic goes right in to enjoy Ryan's stiffie.  <br><br>As he sucks, Claude gets a wide shot to show us there's something full-grown inside Dom's undies.  Ryan doesn't waste any time before returning the favor and pleasing Dommy's salami.  Ryan looks great taking in a nice, swollen dick.  He has one of those lean physiques that you know packs a lot of power along with the aesthetic appeal. <br><br>Next we see a shot from underneath as Ryan's big, fat dick squeezes its way into Dominic's soft, tight ass.  Boy is that a gorgeous shot!  Once it gets in there, Ryan doesn't hesitate too long before working up to a vigorous rhythm.   <br><br>And then we go straight to the cowboy position where Dom gets his chance to feel like a bull rider.  And I ain't just whistlin'!!  Ryan takes this opportunity to continue the ramming, but from his back this time.  Dom hangs in there though, still loving the feeling of his incredible ass being exploited.   <br><br>Before it's all over, Ryan wants to fuck Dom while he's on his back.  This seems to be Ryan's go-to when he wants to hit that mark and erupt with a huge cum blast.  ",
  "models": [
    {
      "name": "Dominic",
      "person_id": 37534
    },
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    }
  ],
  "release_date": "2016-06-05",
  "scene_id": 117224,
  "series": "AD - 100 - Dominic & Ryan Jordan",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Jerk Off",
    "Smooth",
    "Tattoos"
  ],
  "title": "Dominic & Ryan Jordan"
}