{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With the sun beating down on him and the long day of work taking its toll, Mark Long takes five to go take a leak behind the barn, but figures that, while he's there, he may as well rub one out and get back to work, so he dials up some eye candy on his phone and begins to go to town, unaware that property owner Markie More is just around the corner looking for him. <br> </br>Markie happens across Mark leaning and jerking, and commences to spy on him, rubbing his own cock in eager approval as he watches Mark play with his giant 8 inch cock. Sneaking up on him, Markie busts him in the act, and asks him what he's doing. Mark has no real excuse, and is embarrassed at first, but then realizes Markie is pretty pissed that he's wasting time on the job, asking Mark what he intends to do to make it up to him. <br> </br>Mark is fresh out of ideas, but luckily Markie has one floating around in his head, as he reaches out for Mark's dick, which clearly takes Mark by surprise, but he's kind of out of options here, as Markie leads him back to the main house. <br> </br>Once inside, Markie undresses his hired hand, who is clearly nervous. Mark tells him that he's never done this before, and Markie assures him it will be fine, as he starts to move his way down Mark's body with his mouth, stopping as he removes Mark's jeans and resuming as he begins to suck Mark off. Mark throws his head back against the sofa as Markie give him head, and his hard on reaches maximum density as Markie makes his way back up Mark's body. <br> </br>Unzipping his own pants, Markie gives Mark a look that he doesn't understand, and so Markie clarifies that Mark's overtime hour starts now, shoving his dick inside the newbies mouth as Mark learns on the fly how to give a blowjob. He must be doing a fine job because Markie is hard as a rock moments later, as Mark works his shaft and balls with his tongue. <br> </br>Next, Markie hoists Mark's legs into the air, tonguing his asshole as he strokes his cock in anticipation. Mark asks him what he has in mind and Markie lets him know with a look, as he slides his raw dick inside Mark's virgin hole, slowly slipping it all the way in. <br> </br>Mark feels the burn for a second and then as Markie slowly works it, begins to feel pleasure. Markie works his tempo up faster and faster, fucking Mark hard from behind and then flipping him over and pounding him missionary as Mark strokes his cock. Markie pounds him all over his living room before Mark finally spits onto his stomach, just as Markie pulls out and blasts his hole with his load, shoving his cock back inside to continue Mark's act of repayment as Mark suspiciously resists less and less to the 'punishment'.<br> </br>Enjoy!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-06-15",
  "scene_id": 117222,
  "series": "NDR - 27 - Mark Long & Markie More",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Hardcore",
    "Oral",
    "Pornstar",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Taking His First Dick"
}