{
  "collections": [
    "Active Duty"
  ],
  "description": "I can tell you right off the bat that this one's goin' down in the books!  It's just about as hot as it gets when you have veteran squad leader, Quentin Gainz, paired up with a more recent favorite, Zack Matthews.  Once Claude gives the go-ahead, the boys spend a couple minutes loosening up and fattening their cocks.  Once the clothes come off, Zack takes initiative and leans over for a mouthful of Quentin's beautiful dick.  We know Quentin and we know that when he gets the urge to suck cock, there ain't nothin' stopping him.  After a few minutes, Quentin already wants to switch in order to get Zack's throbbing dong between his lips.  The guys move naturally into some passionate, slow-and-deep kissing.  Gosh, these guys know how to smooch!  This is something we get to see multiple times here, and each time they kiss seems to be more sensuous.Well this turns out to be too much excitement to put off the fucking any longer.  Zack lies on his back on the bed and Quentin climbs atop his ready erection, slides it into his tight, eager ass, and gets a nice rhythm started.  Then they move to a standing position against the bed so Zack really explore what he can really do with Quentin's sweet, tight hole.  Claude starts out nice and close, right under the boys, showing us that nice, hard-fucking penetration.  Next we get to see from above Zack punishing that tender, bubble butt.  His big, masculine hands and sexy tattoos are just the hottest thing I've seen in a while.  And then, before the big, grand finale, Zack has Quentin go to his back for more drilling.  I had so much fun seeing these guys together again.  We see here that it sure hasn't taken Zack long to grow into a solid, power position in the squad.  He certainly showed us here that he's hungry to take on even greater challenges.",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Zack Matthews",
      "person_id": 46985
    }
  ],
  "release_date": "2016-05-29",
  "scene_id": 117207,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Jerk Off",
    "Kissing",
    "Smooth",
    "Tattoos"
  ],
  "title": "Quentin Gainz & Zack Matthews"
}