{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With the skies overcast and the afternoon light waning, Arad steps out for a smoke and to take in the scenery. Great minds must think alike, because at that same moment, Zak Bishop has stepped out for some fresh air. Sipping on his pinot, Zak catches Arad out of the corner of his eye, and notices the handsome stranger eyeing him. With a look, it's obvious they both have one thing on their minds, and as Arad steps over and whispers something in his ear, Zak is already leading him back to his room at the villa. Once there, Zak undresses and leads Arad to his sofa, as Arad kisses down his naked body, his strong arms on display as he lowers himself down to Zak's thighs, kissing them gently before taking Zak's hard cock into his mouth. Slobbering all over it, Arad deep throats Zak while stroking himself off, flipping him over and tonguing his asshole deep and hard as Zak clutches the back of the chair. Standing up to admire Zak's perfect bubble butt, Arad smacks his cock against Zak's waiting hole before plunging it deep inside this perfect stranger, fucking him from behind softly at first, but then grabbing Zak by his shoulders as he increases his rhythm. Flipping over, Zak mounts Arad's hard cock as Arad grabs him by the waist and thrusts full force up into Zak, flipping him over one more time onto his back, fucking him missionary position as Zak shoots his load all over himself. Arad pulls out and blasts Zak with a sticky ending to a perfectly timed connection.Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Zak Bishop",
      "person_id": 47446
    }
  ],
  "release_date": "2016-06-10",
  "scene_id": 117386,
  "series": "NDO - 4672 - Arad & Zak Bishop",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "The Connection"
}