{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Casey More is having a bit of an existential crisis. Seems as though he may or may not have enjoyed having his girlfriend's finger shoved up his ass a little too much, and now he's having some serious second doubts about himself. To try and get a handle on the situation, he's asked his gay friend Bridger to help him out. Bridger is willing to help but a little confused, asking Casey if what he wants is a recommendation to a friend. Casey tells him no, that he wants Bridger to fuck his ass, and for a brief awkward moment, silence ensues, broken by Casey moving in towards Bridger as the two of them lock lips. Bridger tells him he'll help him, but that his dick is a little bigger than a finger. Casey laughs until Bridger whips out his giant, half-hard cock, and then he realizes he may have bit off more than he can chew. Speaking of chewing, Bridger has worked his way down to Casey's groin and removed his pants, playfully nibbling on Casey's head before downing it in one gulp. Casey returns the favor, getting even more horny at the idea of Bridger's cock filling him up, and so once Bridger is nice and hard, Casey bends over to take all of it. Bridger slides his cock inside Casey, who loves it even more than he anticipated, as Bridger commences to raw dog him in every position, fucking his brains out and giving Casey a full demo before pounding him missionary as Casey spews his load all over himself. Bridger pulls out and blasts Casey's virgin ass with his seed, shoving his cock back inside to finish the job as Casey moans and groans and forgets all about his girlfriend.Enjoy!",
  "models": [
    {
      "name": "Bridger Watts",
      "person_id": 38083
    },
    {
      "name": "Casey More",
      "person_id": 47679
    }
  ],
  "release_date": "2016-06-22",
  "scene_id": 117406,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Brunette",
    "Caucasian",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Muscular",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Fuck My Str8 Hole"
}