{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As best buds Tom Faulk and River Elliott sit on the couch sharing in a little boredom induced mutal masturbation session, they don't hear Tom's step-brother Gabriel come into the room. Gabriel doesn't care much for the porn on the screen, but the sight of a couple nice hard dicks in his living room definitely has his interest piqued. Sneaking up the guys, he startles them at first, but they are taken aback even further when he pulls off his shorts and joins them on the couch. Now with so much exposed man meat just prime for the taking, Gabriel has them right where he wants them, grabbing River's cock first, and then Tom's, working both like ski poles before deciding to make his bold move. He starts to go down on River, who opens his eyes to see Tom's step-brother blowing him. His eyes grow wide as he looks over at Tom, who gives him a look like, 'Who cares?' so they both go with it- River pushing Gabriel's head further down onto his huge cock as Tom continues to stroke himself off and watch. Gabriel proves to be a real cock pig, gagging himself on both of their cocks, switching from one to another as River eats his asshole in preparation for a hard pounding. Gabriel mounts River's rock hard dick and proceeds to ride the absolute fuck out of him, bouncing with reckless abandon as he begs River to fuck him harder with his straight boy dick. Wearing River out, Gabriel sets his sites on step-brother Tom, who is also packing quite a hammer, and he proceeds to bend Gabriel over and continue the fuck fest, slapping his ass as Gabriel grabs a hold of the back of the sofa. Flipping over one more time, Gabriel sucks Tom off as River lays him down into missionary and fucks the cum right out of him, pulling out as both he and Tom blast this dirty cock fiend with a couple of loads, just as their parents can be heard pulling up outside.Enjoy!",
  "models": [
    {
      "name": "Gabriel Cross",
      "person_id": 32093
    },
    {
      "name": "Tom Faulk",
      "person_id": 36996
    },
    {
      "name": "River Elliott",
      "person_id": 47477
    }
  ],
  "release_date": "2016-06-16",
  "scene_id": 117482,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial",
    "Hardcore",
    "Jock",
    "Masturbation",
    "Rimming",
    "Smooth",
    "Straight Men",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Dirty Step-Brother"
}