{
  "collections": [
    "Active Duty"
  ],
  "description": "This one was just so much laid-back fun!  Mike Hollister showed up this time with a guitar, unannounced, and played a little impromptu show for Claude and his scene partner, Scott Millie.  Scott is a brand new recruit who's never hooked up with another guy, let alone on camera!  <br/><br/>Once the undies come off, Scott gets right to the fun.  He wraps those sexy lips around Mike's cock and sucks just like he's seen his girlfriends do.  'You might have to tell him how to suck.  He's never had a dick in his life...in his mouth OR his ass!' Claude says to Mike as Scott gives his all.  <br/><br/>Then Mike goes to his feet so Scott can lay on his stomach and continue enjoying that fine dick.  I was really liking the way Scott naturally shapes his lips when he sucks.  <br/><br/>After a good, long introductory oral session for Scott, Mike bends him over the bed and shows him what it's like to get fucked.  Claude gets underneath the guys to show us that initial penetration of Scott's virgin ass.  Once he works his swollen cock in there, he's off and running pretty quickly, slamming Scott like a true AD soldier!  <br/><br/>Then they get into some serious action.  Scott climbs up on top of Mike and allows him to jam that stiff cock into his ass so vigorously.  It's a wonder Scott came out of this in one piece, considering it was his first dick!  <br/><br/>After that throttling, Scott goes to his back, where Mike continues his teaching session.  This is a trial by fire that will truly inspire (pardon the rhyme).  It looks like we have a couple of real live ones here...here's to looking forward to a bright future for them at Active Duty!",
  "models": [
    {
      "name": "Mike Hollister",
      "person_id": 46909
    },
    {
      "name": "Scott Millie",
      "person_id": 47422
    }
  ],
  "release_date": "2016-06-12",
  "scene_id": 117401,
  "series": "AD - 102 - Scott Millie & Mike Hollister",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Tattoos"
  ],
  "title": "Scott Millie & Mike Hollister"
}