{
  "collections": [
    "Active Duty"
  ],
  "description": "Now this is what I like to see!  Chris is definitely a nice little departure from the usual.  He's a big boy with a big heart, and a warm, glowing personality.  He's one of those guys you know can really bring the heat in the right situation, but uses his power sparingly...he's a gentle giant, with a very large cock.Pretty much from the jump, Claude gets in nice and tight, showing us what it would be like to be right under Chris's big dick as it swells up in his strong, masculine hands.  He works up a nice, rhythmic stroke and shoots us a few glances.  This is some great positioning on Claude's part. We get a real sense of that hulking dong right at the beginning.  Then Claude moves out further for a nice look at this whole beautiful specimen.  I simply love Chris's body hair.  A perfect dispersal of manliness.  From a wide shot to over-the-shoulder, Claude gets a nice range here.  We get to see that fine cock stroked from Chris's perspective.Chris moves on over to a nice, red velvet day bed so he can stretch out a bit.  He looks very casual as he continues to tug his firm meat.  But it's not long before he's back on the side of the bed, really jerking at a feverish tempo.  Claude goes back in to show us the fine texture of Chris's luxurious balls.  Finally, we get down to the blast-off point and Chris shoots a healthy load for us.  Hmmm, I wonder whether Chris would make a better top or bottom.  On one hand, I could see him using that large, muscular frame to level some hard-fucking damage on a sweet virgin ass, but I'd also very much like to see him get banged by another recruit with a lot of moxie.  Keep a lookout for Chris in the near future...I know I will.",
  "models": [
    {
      "name": "Chris IV",
      "person_id": 47553
    }
  ],
  "release_date": "2016-06-15",
  "scene_id": 117485,
  "series": "AD - 103 - Chris",
  "tags": [
    "Big Dick",
    "Brunette",
    "Hairy",
    "Jerk Off",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Chris"
}