{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Scotty Zee texts with a friend, he hears some curious news about his best friend, River. Word around the rumor mill is that River is secretly gay, which confuses Scotty, since River knows he's gay, so it seems like at some point River would have mentioned it. Still, Scotty's friend persists, and Scotty can't help but wonder if she is right, so he sets a little trap for his friend, leaving the door unlocked and heading to his bedroom to take a nap. When River comes over, he finds Scotty passed out and ass out, naked on the bed spread eagle. It's all River can do from bursting in his pants right on site, but he slowly hugs the wall and takes another peek to make sure Scotty is asleep. Assured that he is, River fixates on his friend's perfect ass, rubbing his cock as he imagines what it'd be like to indulge in such a sweet piece of meat. Letting his curiosity get the better of him, RIver moves in closer and proceeds to quietly inhale all of Scotty's essence as he strokes himself off. 'How's it smell?' Scotty asks, startling River who takes a giant step back, embarrassed and speechless. With his friend's status confirmed, Scotty takes it from there, telling River not to explain himself as Scotty grabs his waistline and begins to suck River off. Downing his cock, Scotty indulges River's fantasy to the letter, laying on his back and sucking on his balls as River straddles his face and gags on Scotty's cock, spitting on the head and slurping it up before gagging himself back down on Scotty's shaft. With their inhibitions out of the way, it's time for Scotty to find out if his friend can actually fuck or not, and River is up to the task, plunging his rock hard rod deep in Scotty's waiting ass, pounding his hole as Scotty strokes himself off, then blasting Scotty with his first load as Scotty lay cum covered and full of ideas for the future. After all, what are best friends for, anyway?Enjoy!",
  "models": [
    {
      "name": "Scotty Zee",
      "person_id": 46672
    },
    {
      "name": "River Elliott",
      "person_id": 47477
    }
  ],
  "release_date": "2016-06-24",
  "scene_id": 117598,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Red Head",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Tricked Out of the Closet"
}