{
  "collections": [
    "Active Duty"
  ],
  "description": "This is what I like to call a 'perfect storm.' There ain't no hotter possible combo than these 3 recruits!  As you may know, Quentin Gainz and Ivan James have been toying with the idea of becoming a regularly appearing, tag-team duo.  If you saw them hook up with Zack Matthews recently, you know exactly the kind of incredible energy they work up together.  Well this time, Colton Phobos is on the receiving end of their take-no-prisoners style of team power fucking.And once they do get the ol' green light, their hard cocks come out and these boys get into some seriously hot business!  Quentin starts out standing on the couch, Ivan sucking his hard thang, and Colton services Ivan's stiff, girthy meat.  Then Colton switches gears, stands up, and shares Quentin's irresistible cock with hungry Ivan.  Wow, what a spectacular sight!Once Quentin gets on down from his high post, he returns some of the favor by slurping down on his tag partner's huge erection.  As Quentin enjoys Ivan's fat dong, Colton takes Quentin's hard cock nice 'n' deep.  Things heat up even further and Ivan goes back to sucking Quentin and Colton wraps his soft mouth around Ivan's throbbing dick.  Eventually, Ivan comes up with a capital idea, and tells Quentin he should go around and get some of Colton's ass!  Being the fiend for nice, tight hole that Quentin is, he doesn't hesitate.  He moves around to the other side of him and works that big, pulsating cock into Colton's ass.  After a good banging from Quentin, Ivan jumps in and serves up some serious punishment, fucking Colton harder than you could imagine.  Once each member of the tag team bang duo gets a good helping of Colton's tender hole, they decide to DOUBLE PENETRATE that tight ass!!!  That's right.  Colton starts out on top of Ivan, sliding down that cock about half way.  Then, Quentin steps in and ever-so-gently pushes his fat dick on there too!  Once they get going, the guys actually work up to a nice, healthy rhythm.  The end up side by side on the couch, blowing monster loads all over themselves and each other.  My goodness, this is certainly one we'll all be talking about for a long time to come.  Now the decision we have before us might be a tough one: who should these tag-team partners bang next?!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Ivan James",
      "person_id": 37630
    },
    {
      "name": "Colton Phobos",
      "person_id": 46601
    }
  ],
  "release_date": "2016-07-03",
  "scene_id": 117540,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Sandwich Fuck",
    "Smooth",
    "Tattoos",
    "Threesome"
  ],
  "title": "Quentin Gainz, Ivan James & Colton Phobos"
}