{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Jonah Marx gets more than he bargained for when he happens across the gym bag left by workout buddy Archer Jaques. As he lifts it up, out falls Archer's little pink toy, and after tinkering with it for a second Jonah decides it might be fun to try, so he reclines on the couch and puts it to task, fucking himself with it manually before initiating the automatic controls on it. Archer realizes he's left his stuff over at Jonah's and heads back to pick it up, but as he happens by the living room window, he notices Jonah spread out on the sofa with a raging hard-on and a very familiar looking pink toy lodged deep in his ass. Archer smiles before Jonah notices him, and sheepishly tries to cover himself up. But it's too late. Archer asks him how he likes the toy and Jonah, obviously embarrassed, tells him that it's ok. Realizing that his dick hungry friend is also a little liar, Archer pushes Jonah further, offering to show him how to properly use it, and grabbing it before Jonah can protest. Jonah lays back as Archer fucks him softly with the setting on low, bending over to suck Jonah off as he does. Jonah likes the dildo but the blow job really gets him started, as he shoves Archer's head deeper down the shaft of his cock, gagging his buddy's mouth before flipping him over to wet his hole in anticipation of Jonah's rock hard cock. With Archer's ass high in the air, Jonah returns the favor, fucking Archer softly at first and then ratcheting up the intensity as he fucks Archer from behind, grabbing him around his neck as he leans in close and continues to pound. Jonah flips Archer over and proceeds to pound him silly, fucking the cum out of his buddy who strokes himself dry, before Jonah pulls out and blasts Archer with is first man to man load. As they lay there drained and tired, Jonah envisions a new regular addition to their workout routine.Enjoy!",
  "models": [
    {
      "name": "Archer Jacques",
      "person_id": 47561
    },
    {
      "name": "Jonah Marx",
      "person_id": 47421
    }
  ],
  "release_date": "2016-06-30",
  "scene_id": 117599,
  "series": "NDB - 4677 - Jonah Marx & Archer Jaques",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth",
    "Toys"
  ],
  "title": "First Time Ass Play"
}