{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Killian James has got Tommy Regan right where he wants him, and for Tommy, there's going to be repercussions. Flashback a few days ago where Tommy and his boys were bullying Killian, calling him names and generally having a good time at his expense, but now the tables are turned, as Killian's little plan to abduct and punish Tommy has gone off with only one little hitch: turns out Tommy is actually just acting out to mask his true feelings, and now that Killian has confronted him, Tommy has come clean with his desires. Killian is confused for a second but decides to call Tommy on his bluff, telling him if he's sincere then he won't mind sucking Killian's dick. Tommy gets wide eyed at this prospect, but once Killian's dick is shoved into his face, it's his mouth that gets wide.Downing Killian's cock in a very convincing manner, Tommy's actions certainly seem to back up his claim that he likes dick, and has Killian returns the favor, Tommy's growing hard on confirms any lingering doubt. With his captive rock hard and wondering what comes next, Killian mounts Tommy slowly, sliding his cock inside Tommy's virgin ass as Tommy winces from the size of Killian's dick. Killian picks up the pace steadily, pounding Tommy from behind, from above and from below, as Tommy strokes his cock and spreads his legs, losing his load as Killian fucks the cum out of him, before pulling out and dousing Tommy's chest with his load, a kinky conclusion to a rather convoluted kidnapping.Enjoy!",
  "models": [
    {
      "name": "Killian James",
      "person_id": 47476
    },
    {
      "name": "Tommy Regan",
      "person_id": 47184
    }
  ],
  "release_date": "2016-06-17",
  "scene_id": 117538,
  "series": "NDO - 4674 - Killian James & Tommy Regan",
  "tags": [
    "Amateur",
    "Big Dick",
    "Big Muscles",
    "Body-Builder",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "The Hard Truth"
}