{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Best buddies Michael Del Ray and Javier Cruz share quite a lot of things: their home, plenty of interests... hell, they even end up banging the same chicks from time to time, so as the two of them sit around killing time playing video games and shooting the shit, Michael gets the idea to share something else with Javier, rubbing his dick against the back of his neck as Javier focuses on the TV. <br/><br/>Javier is at first horrorfied, and as Michael taunts him with his cock, Javier isn't sure if his buddy is serious. But when he tells him to suck his dick, he decides to oblige. Michael is immediately taken aback, having no idea that Javier would accomodate him, but as Javier tongues his dick head, Michael goes with it, and before long, both guys have disrobed and Michael as returned the favor: dropping to his knees as Javier shoves his cock in the back of his throat. Having traded blow job for blow job, Michael asks Javier if he wants to finish with a mutual jerk off, but Javier has something else in mind, as he straddles Micheal's huge, rock hard cock and proceeds to mount it, riding Michael's big dick like a cowboy. Michael fucks him in every position, flipping him over and pounding him from behind before inverting him on the floor and pile driving him as Javier strokes himself off. Michael fucks hard as Javier launches his load all over himself, coating his body Michael blasts his face with his pent up load, leaving Javier happy as a clam, his  glistening body covered with cum.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Javier Cruz",
      "person_id": 47392
    },
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    }
  ],
  "release_date": "2016-06-23",
  "scene_id": 117539,
  "series": "NDB - 4675 - Michael Del Ray & Javier Cruz",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Cum swallow",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Latino",
    "Oral",
    "Rimming",
    "Twink"
  ],
  "title": "I Told You It Was Big"
}