{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As he lay in bed tossing and turning, Derrick Dime can't seem to shake the memories of his past, and as he twirls the wedding ring on his finger, he can't help but think he's made a mistake. The next day, he decides to act on it, as repairman Michael Del Ray finishes up at the property Derrick is restoring. Bonding over some post-work beers, the two guys get to talking about their significant others, and Michael lets slip that he feels like he may as well switch teams. Hearing this, Derrick perks up, and slides a hand down Michael's cover-alls. Michael is surprised by the move, and asks Derrick what his angle is. Derrick tells him about his wedding planner, and the series of events that led him to engaging in gay sex for the first time. Michael nods, now fully understanding what Derrick is trying to negotiate, and so he asks Derrick what he has in mind, just to see where Derrick's head is at.And predictably, Derrick's head is already in the gutter, as he unzips Michael's uniform and slides his hands down Michael's body, pulling Michael's cock out and beginning to suck him off. Michael decides to go with it, since he's not getting any action at home anyway, and Derrick proceeds to give the best head he's had in a long while. Michael's cock grows hard in anticipation of Derrick's pounding, as they switch up and Michael sucks Derrick off.Fully hard and ready to fuck, Derrick bends Michael over and slips his massive cock inside Michael's tight hole, pounding him raw from behind and smacking him on the ass as Michael begs him for more.Flipping over, Michael rides Derrick's cock like a champ, not at all showing signs of a first-timer. Derrick holds Michael by the waist as he bounces up and down, slamming him down onto Derrick's cock as Michael strokes himself, jizzing all over Derrick's stomach as he continues to ride, before sliding off sucking Derrick off as he facializes Michael with his pent up, long overdue load. Cleaning himself off, Derrick realizes he has been denying his true desires for the better part of his marriage, while Michael discovers a side of himself he didn't know existed.",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    }
  ],
  "release_date": "2016-07-06",
  "scene_id": 117694,
  "series": "NDR - 30 - Derrick Dime & Michael Del Ray",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Uniform",
    "Workers"
  ],
  "title": "Arousing Memories"
}