{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm happy to say that one of our newest and finest has RETURNED! Chase is a fine young soldier who did a solo a little while back and we all have been wishing and hoping he'd return so we could witness his very first experience with a fellow recruit. Dominic, the trusty, hungry bottom, was eager to step in and initiate Chase. Dominic had to coax Chase just a tad, but Chase agreed to let Dom suck his dick. Reluctantly, yes, but gosh that Dom is good! Once he wrapped his mouth around Chase's hardening cock, it was all downhill. The look on Chase's face alone tells the story. He let Dominic service him for a good while and Claude got in nice and tight so we could see that pulsating meat nice and wet as it slid in and out of Dom's sweet mouth. The innocent blowjob turned out to be a slippery slope for poor Chase...he couldn't resist fucking that sweet ass on Dominic. And let me say, Dominic is quickly becoming known for his amazing ass. Check out the way Sawyer and Quentin destroyed it, if you already haven't. Now THAT's a great example of how a tight, hungry hole should get handled.He starts off slamming Dom's ass from behind, as Dominic is bent of the arm of the couch.  Then they switch it up and Dominic goes to his back for more insanely intense punishment. This is really an example of a 'grudge fuck.' 'You bastard, I can't believe you made me do this!' Chase says as he fucks his new friend. Chase was so irresistibly drawn to rail that sweet ass on Dominic, he couldn't help but operate against his better judgement. Sorry, Chase!",
  "models": [
    {
      "name": "Dominic",
      "person_id": 37534
    },
    {
      "name": "Chase",
      "person_id": 47270
    }
  ],
  "release_date": "2016-06-26",
  "scene_id": 117692,
  "series": "AD - 106 - Dominic & Chase&#65279;",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Muscular",
    "Rough",
    "Tattoos",
    "White Butt"
  ],
  "title": "Dominic & Chase&#65279;"
}