{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With his cross-country move in full swing, Gabriel Cross is just beginning to settle into his new town, and though it's a far cry from the big city, little by little he's getting used to the relative solitude and small town way of life. While he generally sees the same faces every day, one in particular has stood out- that of a man who looks suspiciously like Gabriel's crazy stalker ex, as crazy as that seems to him.<br/><br/> But crazy is the norm with Jonah- always been that way- so when Gabriel is startled by a home invader's voice, he is only somewhat relieved to discover that it is Jonah, who has somehow tracked him down.<br/><br/>And while Gabriel knows he's bad news in the long run, he must admit that Jonah is the best sex he ever had, and now that he's face to face with him again, Gabriel realizes he wouldn't mind taking a stroll down memory lane. So when Jonah grabs him by his ass Gabriel relents, falling to his knees and sucking Jonah off. Jonah's cock swells to rock hard as Gabriel gags on his dick, and his desire for Gabriel's sweet ass grows more and more uncontrollable by the moment, so he pushes Gabriel against the bed and begins to get his hole ready, tonguing it as he strokes Gabriel's cock. Jonah is rock hard to fuck and Gabriel is more than willing, so Jonah plunges his cock deep within Gabriel, burying it deep in his ass as he pounds from behind.<br/><br/> Gabriel takes it like a champ, and when they switch positions and it's his turn to be on top, Gabriel rides Jonah's dick hard, slamming himself onto Jonah's hard cock as he works his perfect little bubble butt. Jonah fucks the cum right out of his ex as Gabriel bends over to take his load, and Jonah pulls out, blasts Gabriel with his nut, then shoves his dick back inside and continues to fuck him, telling him to just accept that the two of them are meant to be together. Only time will tell if Jonah's wish comes true.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Gabriel Cross",
      "person_id": 32093
    },
    {
      "name": "Jonah Marx",
      "person_id": 47421
    }
  ],
  "release_date": "2016-06-29",
  "scene_id": 117601,
  "series": "NDR - 29  - Jonah Marx & Gabriel Cross",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Muscular",
    "Rimming"
  ],
  "title": "My Favorite Stalker"
}