{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "It's finally arrived.  It's the day Damian Brooks has been awaiting.  It's time for his headshots!  Damian is trying out for a big modeling gig in the city.  He's pulled out all the stops and hired the most renown photographer in the area, the one-and-only JP Richards.Known as the best in the biz, JP is also known for being a pervert.  Damian isn't too worried about that.  He's willing to roll with a little ogling if it means he'll get the best pictures for his portfolio.  They meet up and JP takes Damian into the downtown streets to add some urban flair to the photos.  Damian is impressed with how professionally JP treats him.  He doesn't seem at all like the horny cock hound Damian heard about...until they get back to JP's studio!The long day of shooting has stressed Damian out a bit and he can tell JP has been checking him out.  In fact, Damian noticed JP was rocking a 'side pipe,' an expression for a visible erection underneath pants.  Damian decides that a little sexual release is just what he needs.  He pulls down his jeans so JP can get a better look at his ass.  JP's trained photographer's eyes like what they see, so he pulls Damian's pants completely off and the two passionately kiss.  This leads Damian to go to his knees and take JP's throbbing cock into his mouth.  He sucks for a while before JP returns the favor and sucks Damian's hard dick.  JP also takes the opportunity to have a nice taste of Damian's incredibly hot bubble butt.  It leads right to what Damian was hoping for...JP slides his fat cock into Damian's sweet, tender hole and works up to an intense fucking.  After railing Damian on his back for a while, JP turns his model around for some more firm pounding.  Join these guys and learn the best way to ensure your headshots will be free of charge!",
  "models": [
    {
      "name": "JP Richards",
      "person_id": 27253
    },
    {
      "name": "Damian Brooks",
      "person_id": 31593
    }
  ],
  "release_date": "2016-06-07",
  "scene_id": 117600,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Black",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Damian Brooks & JP Richards"
}