{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Bridger Watts tends the land one sunny afternoon, he spots what appears to be a vagabond drifter on his property, sneaking over by the barn. Inspecting the situation, he discovers a young and somewhat frenetic Zak Bishop trying to flee. After catching up with him, Bridger finds out that Zak is a runaway in need of some basic care. Figuring he can help out a stranger, Bridger offer the youngster a hot shower and a warm meal, but before Zak can indulge, Bridger lets him know that he expects something in return. Zak asks him if he can do some work around the farm, but Bridger has an idea for Zak to do some work in another area, as he unzips his pants and unfurls his giant cock, telling Zak to wrap his pretty little lips around it. Though he might not have any experience milking a cow, Zak shows immediate talent at sucking a cock bone dry, deep throating Bridger's raging hard on and gagging himself with it. Bridger is one kinky farmhand, and Zak's young body has him all worked up, so Bridger pushes him against a counter and returns the favor, slowly sucking Zak off as he massages his balls in his hands. Zak tells Bridger he's about to cum, but Bridger isn't even close to being finished, so he turns Zak around and proceeds to tongue his asshole, getting it nice and moist for Bridger's plow to do some work. Shoving his cock into Zak, the young runaway lets out a small gasp of pleasure. Having never felt a real man, Zak closes his eyes and takes in every inch, as Bridger fucks him every way possible, and as Bridger hovers above him, pounding him out in missionary, Zak loses his load all over his chest, exploding in a mess all over the bed, as Bridger pulls out and soaks him with his own load, before telling him to get cleaned up before the evening supper. <br/><br/>Enjoy!",
  "models": [
    {
      "name": "Bridger Watts",
      "person_id": 38083
    },
    {
      "name": "Zak Bishop",
      "person_id": 47446
    }
  ],
  "release_date": "2016-07-01",
  "scene_id": 117798,
  "series": "NDO - 4678 - Bridger Watts & Zak Bishop",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Lost Bottom Boy"
}