{
  "collections": [
    "Active Duty"
  ],
  "description": "I just get giddy when we have a favorite of mine back to hone his ever expanding set of skills and push his boundaries.  I'm talkin' 'bout Zack Matthews!  He's the incredibly hot, outrageously sexy stud who we recently saw get tag teamed by Ivan James and Quentin Gainz.  Alongside him this time is Gabriel Watson, a handsome newer recruit with certainly potential for miles.  What a nice job Gabriel does!  I have to admit, I was a little nervous for the young man, being as green as he is, but he swallowed down that fat, swollen cock like a natural.  He definitely seemed to enjoy it too, because after some good bobbing and slurping, Gabriel had a nice stiffy to serve up to hungry Zack!  I'm so proud of how great of a cocksucker Zack has become.  Gabriel really puts him to the test, thrusting his hard meat in and out of that eager mouth.  Zack stayed focused, taking down lots of Gabriel's cock.  And if that wasn't enough, Gabriel decides to go back in for MORE of Zack's tasty dick.  Claude does some nice work here, showing us Gabriel's bubby ass and luxurious balls as he lays on his stomach to blow Zack this time.  Then we really get the party started!  Zack sticks his hard dick into Gabriel's tight little hole and shows him what a serious pounding from a decorated AD man is like!  But Gabriel came here to get the FULL experience.  And Zack likes the idea too!  He lets Gabriel return the favor by sliding his own throbbing member in.  I do love watching Zack get fucked.  He's a big guy and he really is starting to enjoy taking dick, nice and deep.  After some good ramming while Zack is on the bed on his back, he spreads his cheeks wide so Claude can get a nice shot of Zack's tight, pink hole...yummy!  Then it's more hard pounding from Gabriel.  I think Gabriel really held his own this time!  Zack is a heavy hitter, and more experienced than Gabriel, but I can tell Zack really enjoyed himself, yet again.",
  "models": [
    {
      "name": "Zack Matthews",
      "person_id": 46985
    },
    {
      "name": "Gabriel Watson",
      "person_id": 47692
    }
  ],
  "release_date": "2016-07-10",
  "scene_id": 117844,
  "series": "AD - 110 - Gabriel Watson & Zack Matthews",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Tattoos"
  ],
  "title": "Gabriel Watson & Zack Matthews"
}