{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Johnny Torque is just trying to get through his work day, but it seems like one thing after another is preventing him from doing so. First it's his ex-girlfriend on the line, harrassing him and accusing him of cheating. Then there's his co-worker Ivan James making passes at him while they're on the job. Johnny's head is spinning with bullshit, so when his ex calls back a second time to bother him some more, Johnny decides he might as well give in, so he heads into the house to find Ivan in order to give him what he's after. Ivan is on his knees fixing a duct in the floor when Johnny walks in and immediately shoves his head into his crotch. Ivan asks him if he really wants to do this and Johnny just unzips his cover-alls and shoves his cock inside Ivan's waiting mouth.   Ivan doesn't need any more prompting than that, taking Johnny's cock between his lips and deep-throating his co-worker as he unzips his own suit. Johnny's naked body glistens in the afternoon sunlight as Ivan continues to suck him off, and as he gets harder and harder, he begins to realize this wasn't such a bad idea afterall. Dropping to his knees, he returns the favor, sucking Ivan's giant cock as he begins to play with Ivan's taint, getting him ready for Johnny's cock.  Ivan is ready for a nice pounding, but neither guy has a condom, so Johnny says 'fuck it' and just sticks it in raw, his bare cock sliding in and out of Ivan's exposed hole, as Ivan closes his eyes and strokes himself off.  Johnny fucks Ivan from behind bent over the back of the couch before moving to the sofa to let Ivan ride him. Ivan bounces his bubble butt up and down on Johnny's hard dick, before flipping over to bust as nut all over himself, just as Johnny pulls out and blasts him with his own load, before shoving it back in to breed Ivan's hole. As he watches his raw cock slide in and out, he thinks of his ex, who is, at least, justified now when she accuses him of fucking around on her. Enjoy!",
  "models": [
    {
      "name": "Ivan James",
      "person_id": 37374
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    }
  ],
  "release_date": "2016-07-13",
  "scene_id": 117872,
  "series": "NDR - 31 - Johnny Torque & Ivan James",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Workers"
  ],
  "title": "Work Place Revenge"
}