{
  "collections": [
    "Active Duty"
  ],
  "description": "I have to say, I was a little surprised at the conclusion of this hot 'n' steamy hookup.  You'll find out why in a minute.  For starters, though, it sure is a breath of fresh air to see our strong, handsome stud, Allen Lucas again!  He's come back to us to pound another fresh recruit into Active Duty shape, and this time he's doing some work on sweet Brian Torrez.  Wow, Brian doesn't hesitate to give it his all, from the start.  He leans over and takes Allen's pulsating dong deep.  For what it's worth, Brian is definitely a great cock sucker.  He has a nice mouth and works the whole expansive surface area of that hulking thing very thoroughly.  All the excitement gets Allen hungry for a taste of Brian's ass, and goodness, it is an amazing rump!  Brian's butt is bubbly, tan, incredible.  Allen goes face deep, letting his tongue explore the uncharted area.  Once he gets that hole properly excited, Allen works to slide his still-throbbing cock into Brian's tight ass.  Now this is where things get VERY interesting!  Claude show us what that huge, hard dick looks like from underneath as it punishes Brian's tender hole.  Allen really lays into him, making sure he knows exactly what kind thing Brian can look forward to if he ends up becoming an actual AD squad member. Allen goes from plowing him from behind, to letting Brian climb atop and ride that stiffy.  I enjoy the way Claude shot this.  We see how truly soft Brain's ass is, and we get a sense of how Brian works as a cowboy.  And the initiation session does not end there.  Brian went to his back for Allen's continued lesson.",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 37870
    },
    {
      "name": "Brian Torrez",
      "person_id": 47555
    }
  ],
  "release_date": "2016-06-19",
  "scene_id": 117845,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Duo",
    "Gay",
    "Jerk Off",
    "Rimming",
    "Tattoos"
  ],
  "title": "Allen Lucas & Brian Torrez"
}