{
  "collections": [
    "Icon Male"
  ],
  "description": "Brandon Wilde is a boy who's privileged upbringing has given him everything he's ever wanted. Even though he is engaged to be married, he recently told his therapist about his habit of watching gay porn. To help him work through latent issues, he's been referred to expert masseuse, Billy Santoro. <br><br>As his muscles are being working on, conversation turns to secrets he's been keeping. Billy is there to help, and Brandon is there to conquer his inner feelings. <br><br>Billy pulls out all the stops in his sexual journey. Reading him loud and clear, his hands reach under the sheet covering him, and massages his erect cock. Brandon trembles with excitement, his cock jumping in anticipation. Both can feel the pent up erotic tension, and they share a passionate kiss before Billy dives down on the rich boy's cock and sucks it base to tip.<br><br>Billy flips him over. The attraction is magnetic as his full body presses against Brandon. Billy's tongue plunges deep in between Brandon's bubble ass cheeks. Presenting towards him, Billy wets his hole deeply, before Brandon plunges two fingers in.<br><br>Taking his turn to service Billy, Brandon takes his time slowly sucking his masseuse's thick rod. As they get down to fucking Brandon is clearly made for it. He pushes his ass against each of Billy's thrusts, urging him for deeper and deeper fucking.<br><br>As Billy plows him on the massage table he pushes every inch into him. Brandon strokes a thick load out of his cock, shooting his load onto his stomach, before tasting the seed on his hand. Pounding his ass, Billy uses the boy's ass, bringing himself to the edge, before blowing his load onto Brandon's tanned stomach.  ",
  "models": [
    {
      "name": "Billy Santoro",
      "person_id": 35626
    },
    {
      "name": "Brandon Wilde",
      "person_id": 35638
    }
  ],
  "release_date": "2016-06-28",
  "scene_id": 117816,
  "series": "Gay Massage House 4",
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "HD",
    "Hairy Guys",
    "Masturbation",
    "Muscular Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Gay Massage House 4"
}