{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Dante Martin and Lance Taylor enjoy a relaxing get-away weekend in the wine country, the day unwinds slowly and without agenda. As they bask in the summer sun and enjoy the fruits of the land, a serene peace comes over both of them, and also, a nagging urge to get naughty, so Lance leads Dante back to the hotel suite where they let the effects of the wine take hold and throw caution to the wind, as Dante strips Lance out of his clothes, hastily unbuttoning his own shirt as he works his way down Lance's tanned and toned body, revealing his cock from inside his shorts and downing it like the bottles of vino that came before. A bit tipsy, the guys take turns servicing the other, as Lance takes Dante's giant cock in his mouth as Dante fucks his mouth while Lance strokes himself off. Dante mounts Lance and rides him, leaning back as Lance strokes Dante's cock for him, before they switch up, letting Dante have his way with Lance as he lay on his stomach.<br/><br/> Dante pounds him from behind, nibbling on Lance's neck as they lay body to body. Flipping him over one more time, Dante spreads Lance wide open in missionary, hiking his legs up over Dante's shoulders as he continues to pound away. Lance strokes his cock as Dante fills him up, and Lance loses his wine soaked load all over his stomach as Dante pulls out and soaks him with a huge load of his own. As they lay there, sun kissed and covered in sweat, the promise of the evening's festivities suggest that their day is only half over.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Lance Taylor",
      "person_id": 47600
    }
  ],
  "release_date": "2016-07-07",
  "scene_id": 117827,
  "series": "NDB - 4679 - Lance Taylor & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Muscular",
    "Smooth"
  ],
  "title": "Blame it on the Wine"
}