{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Max Penn sits around the house killing time and bored on a lazy afternoon, he suddenly perks up when his brother comes home fromt he gym with his best friend. Arad and Max's brother have been hitting the gym for a while now, and the results sure are apparent when Max scopes out Arad's rock hard bod as he sits on the sofa. With his brother taking one of his patented long showers, Max makes his move, first admiring Arad's python biceps before working his way down to the spitting cobra in Arad's pants. Gently massaging his cock through his compression shorts, Max talks Arad into letting him have his way, and finds Arad surprisingly receptive. Wasting no time, Max slides Arad's shorts off of him and begins to work his cock, first with his hand and then with his mouth, as Arad closes his eyes and grows hard inside Max's mouth. Sucking him off, it becomes obvious that Arad is definitely into this kind of workout, especially when he pushes Max back against the sofa and returns the favor, downing Max's cock before flipping him over and tonguing his hole. Arad slips a finger deep inside Max, but Max wants the real thing, so Arad hoists Max's legs over his shoulders and slides his cock deep inside, pounding Max's hole as he strokes himself off. Max cums immediately all over himself, but tells Arad to keep fucking him so he can cum again. Arad does as he's told, flipping Max over and pushing him up against the back of the sofa as he fucks him from behind. Arad gives Max a hearty slap on the ass as he grinds away, flipping him over one more time as Max rides Arad, bouncing up and down on Arad's rock hard cock as Max shoots his second load, before telling Arad to pull out and cum on his ass. Arad coats Max with his load just as Max's brother turns off the shower, none the wiser to his little brother's sneaky exploits. Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Max Penn",
      "person_id": 38088
    }
  ],
  "release_date": "2016-07-08",
  "scene_id": 117927,
  "series": "NDO - 4680 - Arad & Max Penn",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Latino",
    "Oral",
    "Rimming"
  ],
  "title": "My Brother's Sexy Friend"
}