{
  "collections": [
    "Active Duty"
  ],
  "description": "By now ol' James has become known around here as one of our finest, most solid cadets (in more ways than one).  He's been with us for a good stretch, always showing us that strength, sexiness, and cool factor never go out of style.  It's such a joy for myself to see him cumming full circle, joining one of our newer dudes, Scott Millie!<br><br>After Claude says hi to the boys and welcomes them back, Scott doesn't hesitate to strip off his clothes, allow James to do the same, then lean over and put his warm mouth on James's throbbing dick.  James lets him really go nuts, opening up his throat to take that firm erection deep.  Then the guys move around so James can stretch his legs while enjoying slutty Scott's thorough blowjob.  <br><br>Once James is good 'n' ready, He bends Scott over the bed and slides that cock right into his tight ass.  Claude shows us a great shot of the gorgeous penetration as James works up a nice pace.  We get so see James's tasty balls doing their job as Claude shoots from underneath the action.<br><br>Next, Scott lays on his back for more hard pounding from that pulsating cock.  James serves up more intense fucking and seems to drive Scott absolutely to the edge.  Claude gets in tight so we can get a look at James's unrelenting power, ramming that firm dong in and out of that hungry hole.  <br><br>Then it's back on his stomach so James can take more advantage, this time with James completely on the bed with Scott, using his body weight to leverage even more strength into each thrust.  <br><br>Once they work themselves up to just the right point, they lay side-by-side and crank out a couple of nice loads for us.  I think it goes without saying that THIS is one for the AD books!  ",
  "models": [
    {
      "name": "James III",
      "person_id": 37283
    },
    {
      "name": "Scott Millie",
      "person_id": 47422
    }
  ],
  "release_date": "2016-07-17",
  "scene_id": 118058,
  "series": "AD - 112 - Scott Millie & James",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Shower",
    "Smooth",
    "Tattoos"
  ],
  "title": "Scott Millie & James"
}