{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For school friends Scott Demarco and Johnny Riley, prom is coming up and neither of them have a date. Scott has someone in mind but hasn't asked her yet, whereas Johnny doesn't have anyone in mind to ask. As they part ways, Scott tells Johnny to think it over. Johnny watches Scott as he takes his detour, but realizes that isn't the way to Scott's house, so he follows a little behind, and when he catches up to Scott, he's taken cover behind a building, leaning up against it as he jacks himself off in the broad daylight. Watching him, Johnny realizes why he doesn't have a girl on his mind for the dance, since what he really wants is to help Scott out with his hard on. Sneaking up behind him, he pounces on Scott and startles him, who quickly puts his cock back in his pants and asks Johnny why he's following him. Johnny confesses his desire to fool around. Scott is surprised by the confession, but still horny as hell, so when Johnny tells him that his parents won't be home for a few hours, Scott decides to give his buddy a chance.Back at the house, Johnny makes good on the opportunity, falling to his knees and getting his first good look at Scott's dick up close. Scott is rock hard as Johnny sucks him off, downing his cock to the base of the shaft before working the balls with his tongue. Scott returns the favor before flipping Johnny over and eating his ass, tonguing his hole as he strokes Johnny off. Scott works him into a frenzy with his tongue, and Johnny begs for Scott's cock, deep and hard. Scott works it inside Johnny slowly, before pulling out and slamming Johnny's virgin ass, pounding him from behind as Johnny closes his eyes and takes every inch. Showing that he's a quick learner, Johnny mounts Scott on the sofa, riding him as he strokes his cock, the head bouncing up and down on Scott's chest as Johnny grinds his ass on Scott's cock. Scott fucks Johnny good and hard as the sweat pours off of Johnny's glistening body, and he loses his load all over his stomach as Scott pulls out and douses him with a facial that will Johnny will remember long after prom is forgotten.Enjoy!",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 38266
    },
    {
      "name": "Scott Demarco",
      "person_id": 47616
    }
  ],
  "release_date": "2016-07-14",
  "scene_id": 118059,
  "series": "NDB - 4681 - Scott Demarco & Johnny Riley",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Facial",
    "Fraternity",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Straight Men"
  ],
  "title": "Are We Gay?"
}