{
  "collections": [
    "Next Door Originals"
  ],
  "description": "For realtor Mark Long, if it wasn't for hard luck, he wouldn't have any luck at all. Fallen on tough times, he's taken to crashing at the listing he's supposed to be selling. All was going well until the day of the open house, when fellow agent Colton Phobos discovers Mark asleep in the master bedroom. Colton tells Mark he's got an offer and that Mark is about to be ass out. Mark tells him about his financial woes and asks Colton if there's any way to work out a split of the commission. Colton sees Mark's giant cock, outlined by his tight pants and reaches for it, telling Mark they can probably work something out if he's willing to play along. Looks like Mark's hard luck is about to help him out, as he pulls down his pants, revealing his massive 8' dick. Colton unzips his pants and motions for Mark to get started, telling him to watch the teeth. Mark sucks Colton off but Colton is much more interested in taking Mark's deluxe cock for a ride, so after a little 69 to get him hard, Colton mounts Mark's cock and proceeds to ride him, slowly at first, as he feels Mark's huge dick splitting him open. Little by little, he picks up the pace until he's bouncing on Mark's meat stick in rhythm. Properly warmed up, Colton gets on all fours and sticks his ass up in the air, looking over his shoulder and telling Mark to pound him. Mark obliges, slapping up against Colton's ass as his giant cock goes in and out. Colton is ready to blow his load as he flips over to his back, stroking himself as Mark continues to bang away. Colton loses his load as Mark pulls out and covers him, shooting his load all over Colton's face and chest just as the sounds of the buyer's car pulls up outside.",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Colton Phobos",
      "person_id": 47420
    }
  ],
  "release_date": "2016-07-15",
  "scene_id": 118171,
  "series": "NDO - 4682 - Colton Phobos & Mark Long",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "How Much You Want"
}