{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Under the hot sun, poolboy Jake Davis does his job as homeowner Dante Martin relieves him with a pitcher of lemonade. Jake has done work for Dante and his husband for a while, and Dante asks Jake about his girlfriend. Jake tells him that his girl is really boring in the bedroom, and it's obvious to Dante that Jake is seeking something more, sexually. Jake tells him that his main problem is that he hates the apps and online solutions, and is just looking for a fuck buddy that he already knows. Smiling, Dante places his hand on Jake's knee, and Jake realizes he's been dropping hints unknowingly. Taken aback, Jake nonetheless finds the offer appealing, and so when Dante offers to stretch Jake's horizon's, the poolboy agrees. Moments later, Jake is sweating harder than the condensation on the pitcher of lemonade, as Dante peels off his skivvies and downs his hard cock. Jake gets hard as a rock immediately, as Dante deep throats his dick down to the base, teasing the head with a flick of his tongue before they move inside. Once in the house, Jake strips Dante out of his clothes and returns the favor, sucking him off, spitting on the head, then downing him all over again. Dante is hungry for Jake's ass, so he has him straddle his face.Jake grinds his ass as Dante tongues his hole, jacking himself hard as Dante slips a finger inside himself. Dante's hard as a rock but he wants something more, so he mounts Jake's cock reverse cowboy, his meaty ass right in Jake's face as he bounces up and down on his meat stick. Jake is uninhibited, fucking Dante hard and rough just like he likes it as they switch from cowboy to doggie style. Jake pounds Dante hard from behind, grabbing him by his shoulders and then around the neck, all the while filling Dante up with his hard dick.Jake pumps hard as Dante strokes himself off, shooting a huge load all over the room as Jake pulls out and coats Dante with his own over-due load. Sated, sweaty and covered in cum, it's a good thing the pool is clean to go rinse off.",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Jake Davis",
      "person_id": 47743
    }
  ],
  "release_date": "2016-07-27",
  "scene_id": 118174,
  "series": "NDR - 33 - Jake Davis & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Dirty Poolboy"
}