{
  "collections": [
    "Active Duty"
  ],
  "description": "I know everyone will be excited about this one.  We have Chase and Flip, two boys that look incredible doing positively anything, especially fucking!  Since Chase graced us with a solo tug session not long ago, I've been eagerly anticipating his next appearance.  Chase doesn't have a shy bone in his body and he had Flip sucking his cock right outta the gates.  Flip didn't have any reservations either, a clear sign Flip enjoys hard dick in his mouth.  Flip really loses himself with that massive erection between his lips.  Now THAT's what I like to see in a fresh recruit.  That passion for pleasing a fellow serviceman can certainly go a long way in an outfit like ours.  Here's where we get to see how Chase returns a favor, and I can tell he puts in a good deal of effort.  It's plain to see that Flip probably has a bit more experience than Chase, but that's not to say Chase doesn't have great fundamentals in the sock sucking department.  Then Flip actually goes back for another taste of that delicious cock!  But it's not much longer before Chase gets too excited to delay the next step.  He gets behind Flip and slides his big, hard dick inside Flip's tight ass.  After some incredibly hot fucking from behind, Flip goes to his back on the bed for even more rough slamming.  Chase impressed me so much with the way he lit up this sweet rookie's ass!  And what a glorious finish!  Flip blasts an awesome load all over his own stomach as Chase drills him.  It's just a perfect culmination to a hookup that really exceeded my expectations.",
  "models": [
    {
      "name": "Chase",
      "person_id": 47270
    },
    {
      "name": "Flip",
      "person_id": 47640
    }
  ],
  "release_date": "2016-07-24",
  "scene_id": 118126,
  "series": "AD - 114 - Chase & Flip",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Tattoos"
  ],
  "title": "Chase & Flip"
}