{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Zak Bishop walks home from the gym, someone lurks unsuspected. Casey More has noticed Zak eyeballing him at the gym and has decided today will be the day he does something about it, so he rolls up on Zak and offers him a ride home. Once in the car, Casey wastes no time about his intentions, telling Zak he knows he cruises the gym for dudes and he knows Zak has been looking at him. So Casey comes right out and asks Zak, 'You wanna suck my dick or what?' Zak quickly confirms that he does, and the two of them go up to Casey's room at the frat house. Casey tells him they've gotta be cool because of his roomies, and then closes his door and pulls down his pants. Zak marvels at his cock, imagining what it would feel like deep inside him, and falls to his knees to suck it off. Casey pushes Zak's head further down onto his cock, impatient with Zak's technique. Midway through, he tells Zak to lay back as he demonstrates how he wants his dick sucked. Zak remarks that Casey seems really good at sucking dick for a guy with 'no experience' and also notes that Casey's cock gets harder and harder the more he sucks. With Casey fully hard, he tells Zak to ride him.Zak mounts him reverse as he strokes himself off, his own cock at maximum density as Casey fucks from underneath. They switch and Casey hits it from the back as Zak crouches on all fours. Casey shows no mercy, grabbing Zak's bubble butt by his hips and pulling him closer with every thrust.Casey flips Zak over as he continues to pound away as Zak strokes himself feverishly, losing his load all over himself as Casey pulls out and wets him down with his frat boy jizz, exasperated and spent, just as he hears some of his bros downstairs.Enjoy!",
  "models": [
    {
      "name": "Casey More",
      "person_id": 47679
    },
    {
      "name": "Zak Bishop",
      "person_id": 47446
    }
  ],
  "release_date": "2016-07-21",
  "scene_id": 118214,
  "series": "NDB - 4683 - Casey More & Zak Bishop",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock",
    "Masturbation",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "The Frat Boy Pick Up"
}