{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With a team of movers helping to load up his father's trailer, it's a veritable feast of eye candy for Brandon Moore, but it's the new guy, Lance Taylor, that catches his eye. So when Lance's boss assigns him to load out back for a few hours alone, Brandon seizes upon the opportunity to isolate and seduce him. It won't take much, since there were definite fireworks inside when Lance and Brandon first made eye contact, and now that he's all alone with Brandon, Lance's only concern is whether or not they'll get caught. Brandon assures him the others are disposed inside, as he unzips Lance's cover-alls down to his cock, pulling it out and taking it all the way down his throat. Lance closes his eyes and pushes Brandon's head deeper, as Brandon spits on the head and tongues Lance's balls. Pushing him up against the side of the trailer, Lance and Brandon kiss as Lance slips his hand down Brandon's pants, squeezing his ass before shoving him up against some boxes to return the favor, sucking him off as he takes off his pants and shoes. Brandon is ready to see Lance's loading skills, so he bends over as Lance eats his ass, fingering him as he strokes his cock in anticipation, before shoving it hard and raw into Brandon's waiting, hungry hole. Lance rocks Brandon's world, pounding him from behind as Brandon enjoys every moment of it. They fuck every way the little trailer will allow before Brandon shoots his load all over himself as Lance pulls out and douses his hole with the messiest load in the trailer, breeding Brandon's gaping hole with his seed just as Lance's boss comes around the trailer and congratulates Lance for his excellent attention to customer satisfaction.</br></br>Enjoy!",
  "models": [
    {
      "name": "Brandon Moore",
      "person_id": 35927
    },
    {
      "name": "Lance Taylor",
      "person_id": 47600
    }
  ],
  "release_date": "2016-08-17",
  "scene_id": 118371,
  "series": "NDR - 34 - Brandon Moore & Lance Taylor",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Brunette",
    "Caucasian",
    "Climax",
    "Creampie",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Uniform"
  ],
  "title": "Load That Ass"
}