{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Derrick Dime's married life keeps getting more and more complicated, as it seems everyone wants a piece. As his brother-in-law, Quentin Gainz, approaches the house to pick up a box of things, he notices Derrick on the porch with the air conditioner repair guy. It's obvious to Quentin that Derrick is interested in guys. But Quentin also has his sister to look out for, and it is in his interest to keep her happy, so Quentin makes a proposal to Derrick: he'll take care of his needs from now on, if Derrick agrees to cut out the other guys and cut down the risk to his marriage. Derrick agrees, picturing all the things Quentin has in mind. But he doesn't have to imagine it, because Quentin falls to his knees, immediately taking Derrick's huge cock between his lips as he sucks Derrick off. Derrick's cock grows hard in Quentin's mouth, but it's Quentin's sexy ass that Derrick is really interested in, so Quentin bends over the bed as Derrick plunges his raw meat stick deep into Quentin's hole. Quentin takes Derrick's cock whole as Derrick pounds him from behind, fucking doggy style as Quentin lay on his stomach before Quentin flips over and takes a ride on Derrick's dick. Bouncing up and down, Quentin gets his fill, but if he's going to replace all the men in Derrick's life, he realizes he'll have to give as well as he can take, so they switch positions and Quentin proceeds to give the Derrick the bare back fuck of his life, pounding him as Derrick strokes his rock hard cock before spitting his load all over himself, as Quentin pulls out and blasts Derrick's hole with his sticky jizz, proving that keeping it in the family is still an option if you can't keep it in your pants.Enjoy!",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2016-08-10",
  "scene_id": 118380,
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "The Brother-In-Law"
}