{
  "collections": [
    "Active Duty"
  ],
  "description": "Here's a fun match up that really hooked me from the very start.  One of our finest veterans, Ivan James is back to give newbie Will a little schooling in the Active Duty tradition.  Will has NEVER hooked up with another dude and Ivan is really champing at the bit to get down 'n' dirty.  It turns out Will was SO eager to try out his first cock, as soon as Ivan pulls it out, Will leans in and puts it in his mouth, even before he takes out his OWN dick!  He gets right to the thing for which he was salivatin' and Ivan's pleased to satisfy his hunger for curiosity.  They go from the couch to the bed where the boys get lots more comfy, stripping all their clothes off.  Will continues bobbing on Ivan's enormous cock, finding his stride and beginning to develop a nice rookie technique.  Then we have Ivan returning the favor by showing Will through a little practice of his own.  We already know Ivan knows how to handle an excited dick in his mouth.  This time, he sure gives Will the virgin experience of a lifetime.  And it certainly doesn't end there.  Ivan convinces Will to let him try and push his massive pulsating cock into Will's tight, virgin ass.  Will lets him and Claude gets tight on an incredible penetration.  Next, Will goes to his back and Ivan slides his erection in nice and slow for a second round of hard fucking.  By this time, Will is definitely on board, as evidenced by his fat boner!  He tugs away while Ivan punishes his ass.  These guys worked out to be fantastic together.  I could certainly see these two teaming up in the future, when Will gets just a little more experience under his belt.  But what the hell, I think he's confident enough after even just this experience to jump into deeper waters.",
  "models": [
    {
      "name": "Ivan James",
      "person_id": 37630
    },
    {
      "name": "Will II",
      "person_id": 47620
    }
  ],
  "release_date": "2016-08-07",
  "scene_id": 118381,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "First Time",
    "Jerk Off",
    "Tattoos"
  ],
  "title": "Will & Ivan James"
}