{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Austin is relaxing by the pool listening to music and taking in all the sun on a beautiful summer day. What he doesn't know is that Wesley is knocking on his front door but he can't hear a thing. Wesley checks all the windows and still doesn't see anyone so he heads to the backyard and sees Austin laid out. He calls out Austin's name a few times but he can't hear a thing because of the headphones wrapped around his ears. Wesley shakes Austin which scares him a little bit but then he recognizes Wesley. Wesley is Austin's Dad's best friend and he's known Austin for 12 years as well. Austin informs Wesley that his Dad is not home and then he begins to rub Wesley's leg which turns him on and they both begin to kiss. Wesley has wanted to fuck Austin for many years now and he finally has the chance. Austin starts to service that big dick in the summer heat spitting and licking his way up and down Wesley's big thick shaft. Wesley than spreads Austin's legs far and wide so he can now blow that sexy young cock while using his fingers to bang that young ass. Austin is moaning and groaning every time those fingers go in and out of his ass all the while Wesley sucking his cock something fierce. The sweat is kicking in from the heat so they take the action in to the house where Wesley lubes that young ass up with his wet eager tongue. Once Austin's ass is wet and ready Wesley gives his cock to the young buck deep and hard. Austin ends up riding him amazingly working his hips in perfection until Wesley flips him onto his knees and fucks the cum out of him. Austin is still begging for it so Wesley strokes his dick until his load splashes all over Austin's face. Enjoy!",
  "models": [
    {
      "name": "Austin Ryder",
      "person_id": 47827
    },
    {
      "name": "Wesley Woods",
      "person_id": 47826
    }
  ],
  "release_date": "2016-08-22",
  "scene_id": 118367,
  "series": "DL - 24 - Wesely Woods & Austin Ryder",
  "tags": [],
  "title": "My Dad's Best Friend"
}