{
  "collections": [
    "Active Duty"
  ],
  "description": "It certainly shouldn't be a surprise that I go absolutely nuts anytime I hear Quentin Gainz is stepping up to do a little Active Duty.  Well he's BACK!  And boy, what fun romp this turned out to be.  As you know, Quentin has assumed the unofficial role of Troop Leader/Hottie/Badass, and every time we have the pleasure of seeing him, we're reminded why.  This time is no different.  He's joined by a brand new recruit named Johnny, and Quentin is charged here with introducing Johnny to what being a soldier is all about.  Not soon after both boys have peeled off their shirts and pulled out their fattening cocks, Quentin suggests Johnny boy come on in for a taste, which he does without any protest.  WOW, talk about a natural!  Johnny was born to suck dick.  But I guess anyone would go wild after going through life with NO cock in your mouth!   Quentin lets Johnny have a field day, even helping his rhythm with a hand of the back of his head.  After Johnny really breaks down that first wall and Quentin thinks he's ready for the next stage, they move to the bed.  Quentin, one of the best blowjob artists on the planet, gives Johnny the ultimate experience: long, deep sucking, fast, then slow, with more passion than you can shake a stick at.   After a while, Johnny decides he wants another go.  I think he took a few tips from Quentin and wanted to see if he could improve from watching.  And he really does hit a good stride here.   And then, the real test.  I must say, Johnny accepts Quentin's fat, pulsating dick like a true gentleman.  No complaining, no resisting, just total go-with-the-flow attitude.  Quentin definitely pushed Johnny as far as possible, working up quickly to a fevered pace, fucking Johnny's VIRGIN ass like the Active Duty stud he is.  It's not too long before Johnny is actually telling Claude how good it feels!  Oh yeah, Johnny is the right type of guy we like to see on the squad.  He's a big slut. And for being such a trooper, right from the jump, Johnny gets to fuck Quentin's tight hole.  There ain't a finer reward than that, folks!  Then, before it's all over, Johnny opts for just a little more training, and has Quentin fuck his eager ass one more time, this time from behind.  Quentin is happy to provide further assistance.",
  "models": [
    {
      "name": "Johnny II",
      "person_id": 47512
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2016-07-31",
  "scene_id": 118312,
  "series": "AD - 116 - Quentin Gainz & Johnny",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Bisexual",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "First Time",
    "Muscular",
    "Straight",
    "Tattoos"
  ],
  "title": "Quentin Gainz & Johnny"
}