{
  "collections": [
    "Falcon Studios"
  ],
  "description": "First to arrive at their 'Desert Getaway' locked rental house, handsome Jacob Peterson and sexy Jonah Fontana have an hour to kill while they wait for their friends to arrive with the keys. Their attraction for each other is clear and with time on their hands, they don't waste a minute. With the beautiful desert landscape as their backdrop, Jacob Peterson and Jonah Fontana press their lips together in a passionate kiss and fall back onto the outdoor lounge chair. Jonah peels off Jacob's shirt, revealing ripped, washboard abs, and then undoes Jacob's fly. Jacob's thick, uncut cock springs to attention, and Jonah wraps his lips around Jacob's meaty tool. The two strip naked under the hot desert sun, and Jonah plants his scruffy face into Jacob's crack. After lubing up Jacob's ass with spit, Jonah slaps his dick across Jacob's butt, then inches his shaft inside his hole. With Jonah pounding away, Jacob's balls sway and his giant cock bounces with each satisfying thrust. Ready to switch it up, Jonah gets on his back and invites Jacob to hit it. Jacob spreads Jonah's legs wide for a deep, sensual penetration. Jonah savors every minute of it, and jerks his big cock in time with Jacob's thrusting. A move to doggy style lets both studs show off their tight muscle while they fuck with abandon. Jonah reclines back to receive a massive facial from Jacob, the thick, white cum dripping down his bearded chin. Jonah jerks out his own load onto his washboard stomach, and the two share a final kiss in the fading desert light.",
  "models": [
    {
      "name": "Jacob Peterson",
      "person_id": 37909
    },
    {
      "name": "Jonah Fontana",
      "person_id": 47678
    }
  ],
  "release_date": "2016-07-08",
  "scene_id": 118313,
  "series": "Desert Getaway",
  "tags": [
    "Anal Sex",
    "Bodybuilder",
    "Cumshot",
    "Foreskin",
    "Hairy",
    "Oral Sex",
    "Outdoor Sex",
    "Rimming"
  ],
  "title": "Desert Getaway"
}