{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Cooper Cabana is having some dark dreams in the broad daylight. Taking a post workout nap, he dreams of tall and dark stranger having his way with him. His intruder would be forceful and show no mercy, and luckily for Cooper, Casper Young is just such a figure. Gaining entry to Cooper's house was easy, and now that he's in Cooper's room, he makes sure Cooper is sleeping before turning his focus on Cooper's ass, which looks even better up close than it did in the window. Casper cannot resist having a grab, and reaches out, first to just brush against Cooper's skin, but finally indulging and allowing himself to take a taste of Cooper's exposed hole. Cooper stirs from his sleep and finds Casper hovering over him, as Casper immediately silences his protests with is hand. Covering his mouth, he tells Cooper he won't hurt him, and to just enjoy it, shoving his cock into Cooper's mouth. Cooper accepts his fate and also has to admit to himself that Casper is a hot fucking thief, so he resigns himself to whatever Casper has in mind, sucking Casper's cock as it grows inside his mouth. Casper throws Cooper back against the bed and returns the favor, flipping Cooper over to resume eating his ass, getting it nice and ready for Casper's hungry cock.He plunges his dick deep inside Cooper, pounding him from behind as Cooper strokes himself off. Bending the flexible fuckboy all around, Casper throws Cooper's legs over his shoulders as Cooper strokes his cock hard, spitting his load as Casper bumps and grinds, before he pulls out and jizzes all over this stranger lying beneath him. As they kiss, Cooper rubs his chest and tells Casper he does yoga 4 times a week if he ever wants to come spy some more.Enjoy!",
  "models": [
    {
      "name": "Casper Young",
      "person_id": 47674
    },
    {
      "name": "Cooper Cabana",
      "person_id": 47675
    }
  ],
  "release_date": "2016-07-22",
  "scene_id": 118311,
  "series": "NDO - 4684 - Cooper Cabana & Casper Young",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Dreamy Intruder"
}