{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For best friends Damien Hyde & Johnny Riley, reuniting means spending the day laughing and reminiscing about the old days. All is well and good until Damien brings up the fact that he still thinks about the days when they used to mess around. Johnny hasn't thought about those memories in a long time, and when Damien mentions it, Johnny is visibly uncomfortable, but Damien assures him that it's all normal, and that he's never told anyone about their past together.  Sitting alone on the couch, it's obvious Damien wants to rekindle the arrangement, but Johnny has some reservations. Damien puts his hand on Johnny's leg and his touch reassures Johnny, and also reminds him of how much fun they used to have. So he reluctantly relents, lowering his head as he unzips Damien's pants, sucking on Damien's cock as it grows hard in his mouth. Damien closes his eyes and Johnny works his cock like the old days, putting his hand on the back of Johnny's head and pushing him down to gag on his cock, before flipping over and pushing Johnny up against the sofa as he eats his asshole. Damien moistens up Johnny's hole, flicking his tongue around as Johnny clutches a couch cushion. Damien sits up and slides his cock where his mouth used to be, slipping his hard dick inside Johnny and pounding his bubble butt from behind. Damien realizes Johnny's cock is a lot bigger than it used to be back in the day, as Damien shows off his stroke, fucking Johnny hard before flipping over and letting his boy take a ride. Johnny grinds on Damien's cock, moaning loudly as he works his hips, slamming Damien with every thrust. Damien flips Johnny over onto his back and fucks him missionary before pulling out and blasting Johnny with his load as Johnny follows suit, finishing the job as he loses his load all over his stomach. As he rubs the cum into his skin, Johnny realizes it has been far too long since he spent such quality time with his best buddy, a mistake he vows not to repeat. Enjoy!",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 38266
    },
    {
      "name": "Damien Hyde",
      "person_id": 47711
    }
  ],
  "release_date": "2016-07-28",
  "scene_id": 118483,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Rimming",
    "Uncut cock"
  ],
  "title": "Best Friend Reunion"
}