{
  "collections": [
    "Active Duty"
  ],
  "description": "Boy, we just keep getting so lucky with these handsome fresh recruits, rolling on in to try their hands at something new.  Today, that fresh recruit is Jacob and that something new is Ryan Jordan's fat, swollen cock!I really love the juxtaposition of these dudes.  Jacob is a big, handsome redhead and Ryan Jordan is a spunky, cute fireplug.  They both showed up in military green and Claude chatted with 'em a little to loosen up the atmosphere.  Apparently it worked because Jacob was quick to lean over and wrap his lips around Ryan's growing erection.  He sure got down to the slurpin' like he was thirstin' for good dick.After a little while on the couch, Ryan goes to his feet and lets Jacob continue to enjoy that hard meat.They head back over to the couch where Ryan goes right into a routine with which he's become quite familiar.  By Jacob's reaction to the servicing, I think he's really found something new that he likes very much.  What a surprise! After Ryan calms Jacob's nerves a bit with his soothing blowjob skills, Jacob agrees to finally let the real fun begin.  Ryan bends him over the couch and slides his hard dick into Jacob's nervous-but-willing ass. Wow, I forgot how nice Ryan's balls look when he fucks.  Then slap so nicely against Jacob's taint as some good pounding really breaks Jacob in and the guys move over to the desk where Jacob decides to let Ryan fuck him some more, this time while Jacob is on his back.Even though they set down a pillow, the desk situation becomes a little uncomfortable, so they move to the floor where Ryan shows Jacob the pile-driver technique.  Finally, the boys end up back on the couch, where we see Ryan bang a healthy load out of Jacob for an awesome grand finale.  Cheers, troops, I think we've hooked another fine solder for our sweet little outfit!",
  "models": [
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    },
    {
      "name": "Jacob II",
      "person_id": 47764
    }
  ],
  "release_date": "2016-08-14",
  "scene_id": 118482,
  "series": "AD - 120 - Ryan Jordan & Jacob",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Duo",
    "Gay",
    "Jerk Off",
    "White Butt"
  ],
  "title": "Ryan Jordan & Jacob"
}