{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Wesley Woods is looking to shake everything up. With he and his lover recently separated, Wesley is thinking about doing some redecorating to kind of freshen up the lingering memories. Wesley and his previous boyfriend have used a handyman, Markie More, for quite some time, but honestly Wesley's ex was more involved with over-seeing him, and if Wesley is being honest with himself, Markie isn't that good of a handyman. Wesley conveys as much to Markie who sees his cushy gig about to be terminated, so he resorts to some fast talking and Wesley decides he'll give him one more chance. Thankful, the two of them sit on the couch as the rain begins to come down outside. Markie's clothes are a bit damp from working out in the drizzle and so Wesley throws his cover-alls into the dryer. 'Classic set up,' Markie thinks, assuming Wesley is trying to get him out of his pants. Markie makes a move and Wesley rebukes him, telling Markie he must've gotten the wrong idea.  Markie looks down at his mostly naked body, and then back at Wesley, assuring him that if Wesley really wants to see where Markie's talents lie, he'll let Markie finish what he's started. Wesley relents as Markie falls to his knees, taking his employer's  cock in his mouth as Wesley closes his eyes and admits to himself it's been too long. Wesley realizes Markie really is talented with his mouth, and when he flips him over and returns the favor, Wesley realizes Markie is also well equipped for the job at hand. Looking to fuck away some of his frustrations, Wesley bends Markie over and eats his ass before plunging his raw cock deep inside his handyman's hole. Markie's lips part as Wesley thrusts away, pounding Markie doggystyle as he grabs Markie by the waist and pulls him closer. Markie proves to be a hot and willing piece of ass, but Wesley wants to see how Markie delivers the goods, so he flips over onto his back as Markie fills him up, raw dogging Wesley as he shoots his load, begging Markie to keep going until he blows his own load. Markie wets Wesley's hole with his load and as they fall down on top of each other, Wesley is forced to admit: all this time he's been sorely underutilizing his homestead help.",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Wesley Woods",
      "person_id": 38354
    }
  ],
  "release_date": "2016-08-03",
  "scene_id": 118585,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Workers"
  ],
  "title": "Handy Handyman"
}