{
  "collections": [
    "Men Over 30"
  ],
  "description": "Osiris has never met with Geoff before but they have no place to hookup. They found each other online and Geoff gave him an address to meet up at. Once Osiris arrives at the address he calls his friend just to let him know where he is at because he arrived at a sketchy dirty warehouse. He hangs up on the phone and moments after Geoff comes walking in and Osiris who is a little worried has to ask him why this place of all places. Geoff chose this place because his friend owns the warehouse and neither of them had a place to fuck so once Osiris hears his explanation they get down to business. Geoff pulls out Osiris's long fat dick and Geoff can't believe how beautifully big this cock is. He takes care of every inch with his tongue licking the shaft from the base of the balls to the tip of the cock back and forth as well as deep throating it. Osiris is hard as a rock and extremely turned on. Geoff's dick needs some attention too so Osiris repays the favor and his eye light up once he sees how big Geoff's dick is. Lots of dick in this warehouse and two sweet asses that will get plowed with them sexy cocks. Geoff wants to fuck that bubble ass first so he puts a condom on and slowly pushes into the tight smooth ass pushing as his cock pulsates into Osiris. It's so tight Geoff can't pump fast enough and has to fuck him slowly in and out from behind. You can see Osiris's big hard cock flopping around as he is being fucked. Just about to cum Geoff pulls out and wants to feel Osiris's big dick inside of him when he does release his load. Osiris fucks him on the tire with slow long stokes which Geoff can see every inch going deep inside of him. He's watching that dick and finally his ass tightens and he shoots his load all over the place leaving Osiris to do the same but he fucks Geoff's face and leaves him with a mouthful.",
  "models": [
    {
      "name": "Geoff Gregorio",
      "person_id": 47777
    },
    {
      "name": "Osiris Blade",
      "person_id": 35601
    }
  ],
  "release_date": "2016-08-12",
  "scene_id": 118525,
  "series": "MOT - 546 - Osiris Blade & Geoff Gregorio",
  "tags": [],
  "title": "Warehouse Hookup Part 1"
}