{
  "collections": [
    "Active Duty"
  ],
  "description": "Take a look at these two fine specimens!  They're a couple of sexy peas in a steamy pod and they're hookin' up for the first time.  We've grown to know Allen Lucas very well and have seen him turn from eager, curious fresh recruit, to bold, daring squad leader.  He's exactly the man for this job, initiating brand new boy, Gabriel Watson into the fold.  Allen finally suggested Gabriel have a taste of his cock, so he sure did, and what do ya know?!  Gabriel took to it like a fish to water.  And then what a treat for Gabriel.  Allen reciprocates by taking Gabriel's absolutely enormous erection very deep down his throat.  The action at this point becomes so hot, the guys naturally move into an intense 69 formation and go to work on each other's throbbing knobs for a while. All this fun was plenty to convince Gabriel to take the ultimate leap and try fucking his first guy!  Claude gets underneath the guys and we see a wonderful view of Gabriel going in and out, starting slowly first, then building up some speed and fucking that sweet recruit real good.  Then the soldiers move right into phase 2 of this operation: Gabriel lays flat on his back on the bed and Allen gets on top of him to ride that big boner.  He starts out nice 'n' easy but gets going really fast and hard, bouncing down hard on Gabriel's lucky cock.  And then finally, Allen goes to his back so Gabriel can fuck the cum right out of him.  And what a great job he does of that!  Allen explodes like a firehose as Gabriel bangs that tender pocket with purpose and duty.  ",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 37870
    },
    {
      "name": "Gabriel Watson",
      "person_id": 47692
    }
  ],
  "release_date": "2016-08-21",
  "scene_id": 118586,
  "series": "AD - 122 - Allen Lucas & Gabriel Watson",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Rimming"
  ],
  "title": "Allen Lucas & Gabriel Watson"
}