{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Scott Demarco is being kind of a party pooper. Tired and a little fussy, he's not really feeling it when buddy Ethan Slade calls to make birthday plans for his special day, telling Ethan instead that he plans on just chilling around the house. Little does he know Ethan is already posted as his house waiting to surprise him. As Ethan hides, waiting for the right moment to spring his surprise, Scott reclines on the bed, stretching out as he starts to get horny. Scott peels off his shorts as Ethan watches him stroke himself on the bed. Laughing to himself, Ethan jumps out of hiding and scares Scott half to death. They wrestle and end up on the floor, Scott still naked, Ethan eyeing his sexy dick, standing straight up and begging for attention. Feeling a bit awkward, Ethan reaches out and grabs a hold of it, looking at Scott's reaction as he does. Scott seems to be ok with it, so Ethan slides down and begins to suck him off. Scott caressess Ethan's head as he tongues his shaft, and Ethan looks up at him as he nibbles on the head playfully, downing Scott's cock to the base as Scott closes his eyes. Moving to the bed, Scott returns the favor and Ethan realizes his fantasy is becoming a reality, as he slides up to ride Scott's cock. Mounting him, he grinds on Scott's hard on as he bounces up and down, taking Scott's cock like a champ as Scott gives his ass a firm smack. They fuck for a while as Ethan strokes himself hard, before they switch, and it's Scott's turn to take his first cock. Ethan slides it in slowly, before working up to speed, fucking Scott hard as he makes himself cum, spitting his load all over his stomach as Ethan pulls out and blasts him with a birthday load long over-due.Enjoy!",
  "models": [
    {
      "name": "Ethan Slade",
      "person_id": 47398
    },
    {
      "name": "Scott Demarco",
      "person_id": 47616
    }
  ],
  "release_date": "2016-07-29",
  "scene_id": 118583,
  "series": "NDO - 4686 - Scott Demarco & Ethan Slade",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim"
  ],
  "title": "Virgin Birthday Surprise"
}