{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Scotty Zee walks out into the kitchen to start his day, he's greeted by his mom's newest boyfriend, Damien Michaels. Damien and Scotty don't exactly hit it off, but Damien is in a bit of a bind. WIth Scotty's mother's birthday coming up, Damien would like to get her something nice, but a recent lay-off has him kind of short of disposable cash, so he asks Scotty if he has any ideas.Scotty takes a bite of his apple and decides he knows a way he can get one up on Damien while helping him at the same time. Damien is eager and willing, unaware of what Scotty's plan entails. When they enter Scotty's room, Damien gets a better idea, as Scotty's laptop is open on his bed. Scotty confesses that he's been web-camming for money, and Damien begins to put two and two together. Telling Damien they can make a lot of money, it's clear that Damien is a bit hesitant to try it, but Scotty assures him they can reach their goal is Damien plays along, and so, reluctantly, Damien peels off his shirt and pants, revealing his muscle bound body to both Scotty and the folks at home. As he watches cash instantly pour into their account, Damien becomes a believer, and Scotty knows he has him right where he wants him, so he begins by going down on Damien, sucking off his huge cock as Damien closes his eyes and pushes his head further down onto his cock. Damien loosens up and discovers it isn't so bad, so when it's time to flip positions, Damien is hesitant but willing, and he blows Scotty like a natural born champ.With money beginning to add up, Scotty goes for the brass ring, telling Damien that the members would love to see him take a dick. Damien is definitely slow to agree, but Scotty assures him he'll take it easy on him, sliding his cock in slowly and working Damien's hole until he's more accustomed to it, before picking up the pace and pounding out Damien's virgin hole for everyone to see. Damien grabs the bed as Scotty fucks him from behind, then they switch and Damien shows off his riding skills, bouncing on Scotty's cock like he'd done it a thousand times before. With their goal almost met, Scotty decides to get his, so they switch and Scotty lets Damien have a piece, as Damien fucks the cum right out of Scotty before pulling out and blowing his load as well. When the smoke clears, the account is full of money and Scotty definitely has a new partner for his shows.Enjoy!",
  "models": [
    {
      "name": "Damien Michaels",
      "person_id": 37846
    },
    {
      "name": "Scotty Zee",
      "person_id": 46672
    }
  ],
  "release_date": "2016-08-05",
  "scene_id": 118555,
  "series": "NDO - 4688 - Damien Michaels & Scotty Zee",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Hardcore",
    "Masturbation",
    "Mature",
    "Oral",
    "Red Head",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "My Mom's Boyfriend - Desperate Times"
}