{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Good friends Roman Todd and Quentin Gainz are just out by the pool enjoying a little R'n'R, soaking up some rays, taking a quick dip, horsing around- all standard fare- until a game of grab ass gets a little too heated. Quentin runs off into the house as Roman gives chase. Quentin hides around a ledge as Roman comes around the corner and de-pants his buddy and Roman returns the favor. Now with both guys standing naked in the living room, one thing leads to another and before he knows it, Quentin is on his knees sucking off his friend in bed. Roman gags Quentin with his cock as Quentin takes his rod all the way to the base, spitting on the head as he comes up for air before dropping back down and letting it hit the back of his throat. Roman is hard as a rock and ready to fuck like crazy, so he bends Quentin over and eats his ass from behind as he strokes his cock, plunging it deep in Quentin's ass and pounding his bro doggy style as Quentin grabs onto the sheets for dear life. Roman fucks Quentin hard from behind before Quentin takes control, mounting Roman's dick and riding him as he gets closer to cumming. Roman flips Quentin over one last time and fucks him missionary as Quentin's load shoots out all over him. Roman pulls out and blasts Quentin with a super load that makes a hot mess all down Quentin's face and chest, prompting him to suggest the two of them take another lap in the pool. Roman smiles, ready for round 2.Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    },
    {
      "name": "Roman Todd",
      "person_id": 46827
    }
  ],
  "release_date": "2016-08-11",
  "scene_id": 118699,
  "series": "NDB - 4689 - Roman Todd & Quentin Gainz",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Playful Buddies"
}