{
  "collections": [
    "Active Duty"
  ],
  "description": "Will is returning here after having his first experience with a dude when he hooked up with Ivan James.  I'm certainly not surprised to see him back.  Ivan did such a great job of making Will feel comfortable, I knew Will would be back, salivating for fresh cock.  We also have Chase this time, a recruit that has earned his nickname and reputation as the troop 'Wildman.' And the cockfiend himself, Johnny, is back to get his fill and make a couple new friends.   All three guys are nice and hard right from the get go, so Chase steps up with some serious initiative and plants his lips around Johnny's thick hog.  Will follows suit and gets into some deep sucking on Chase's throbbing dong.  Johnny, at this point relaxes and enjoys the ride...for now.   The guys switch directions and Will gets to kick back for a little while as Johnny takes on Chase's fat dick and Chase swings over to Will's stiffy.  , handsomely rewards sweet Will for his excellent work just minutes before.  Johnny decides to add some variety by walking over to the end of the couch and letting Chase continue blowing him while Johnny stands.  Will goes to his knees and gets some more of Chase's sweet cock.  Unfortunately, Johnny had to split unexpectedly.  But when a soldier is eliminated from the battlefield, his team continues in his honor, and in this case, with ever greater vigor.   Will stands up and leans over the couch, presenting his tight hole to Chase.  Chase gladly slides his fat dick into that tender pocket and works up to his signature frenzied pace.   After an incredible pounding from behind, Will goes to his back, still up against the couch, and let's Chase ram him even HARDER!   The guys move to a more practical and comfortable spot on the couch and Chase literally fucks the cum out of Will.  This adventure showed me that these two are willing to roll with the punches, take what cums, and still work their way to an incredibly explosive finish.",
  "models": [
    {
      "name": "Chase",
      "person_id": 47270
    },
    {
      "name": "Johnny II",
      "person_id": 47512
    },
    {
      "name": "Will II",
      "person_id": 47620
    }
  ],
  "release_date": "2016-08-28",
  "scene_id": 118704,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Tattoos",
    "Threesome"
  ],
  "title": "Will, Chase & Johnny"
}