{
  "collections": [
    "Active Duty"
  ],
  "description": "Y'all are gonna just melt when you meet this brand new recruit.  His name is Scott and he's the most delicious thing I've seen in TOO long!  Claude really let Scott get down how he likes.  Scott seems to be a young, but very confident young man and he certainly knows how to pleasure himself.  Scott has that special leadership quality and I'm hoping we'll get plenty of opportunities to see him put it to use.  Once Scott peels off his Military green t-shirt, his jeans, and his sexy green undies, we get to take in the sight of his tight young body. He's lean but has some nice muscular development and it's easy to see he has such potential for the future.  His strong happy cock's already fattening up and as he plays with that tasty dong, he leans back on the couch to fully recline and sprawl out.  He's so relaxed and cool!  Scott takes the liberty of really using his free hand to touch all over his body.  We see the genuine ecstasy on Scott's face as he enjoys every moment of this display for us.  Check out that tight, bubbly ass.  I'm hoping Scott will be willing to take a stiff dick in that tender 18-year-old hole!  I know we have plenty of soldiers on the roster who would be champing at the bit! Sock lovers will enjoy that he kept nice looking, athletic socks on for this session.  Tight abs, strong legs, and lean, thick arms.  Yes, please!  Once back on the couch, Scott uses plenty of oil to finish the job.  As Scott works up to that final moment, his intensity builds and crescendos in an eruption of passionate release.  What an amazing debut from this young hunk!  Let's all hope he's back soon, maybe mixing things up next time with a new acquaintance.",
  "models": [
    {
      "name": "Scott Finn",
      "person_id": 47961
    }
  ],
  "release_date": "2016-08-31",
  "scene_id": 118705,
  "tags": [
    "Big Dick",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "War Chest"
  ],
  "title": "Scott"
}