{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Ty Thomas has been planning a special birthday surprise for boyfriend Jake Davis for quite some time, and when Markie More knocks on the door looking even better than he does in his pictures, Ty realizes he's made the right choice. He gives Markie the run down, and tells him that his boyfriend will be so turned on by the idea, but asks Markie if it's ok if he watches. Markie obliges and Ty tells Jake to get his ass home pronto for his gift. Upon arrival, Ty's wish comes true, as Jake is completely surprised but also very intrigued at his boyfriend's gift. Markie takes him by the hand and leads him to a chaise lounge as Ty assumes a position on a nearby chair. Markie slowly inches his lips down Jake's body to his cock, taking it gently into his mouth, nibbling delicately on it and teasing Jake before downing it in one fell swoop. Markie swallows Jake's cock from shaft to tip, flipping Jake over to eat his ass at Ty's request. Markie tongues Jake's hole, moistening it up for his hard cock as Ty strokes himself in the corner. After Jake sucks him off for a second, Markie plunges his cock deep into Jake's hole and proceeds to give him the fuck of his life. Markie fucks Jake from behind with no regard, raw dogging Jake as he smacks his ass, pulling the head out and sticking it right back in, as Jake takes every inch like a champ. Ty is rock hard watching his boyfriend take the cock, as Markie flips him over and has Jake ride his meat stick before flipping Jake over one last time to breed his hole. Jake loses his load as Markie continues to pound, jizzing all over himself as boyfriend Ty also gets close to busting. Markie pulls out and cums all over Jake's hole before shoving it back in, just as Ty shoots his load all over his shirt. Markie looks up from the chaise over at Ty and asks if he gets to fuck him next. Ty just winks as the three of them laugh.Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Jake Davis",
      "person_id": 47743
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2016-08-24",
  "scene_id": 118700,
  "series": "NDR - 37 - Markie More, Jake Davis & Ty Thomas",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "While He Watches (Part One)"
}