{
  "collections": [
    "Next Door Raw"
  ],
  "description": "For vacationing lovers Scotty Zee and Gabriel Cross, a weekend getaway at a remote vineyard B&B is just what the doctor ordered to cure them of their city restlessness, and once they arrive at the grounds, they discover an even more enchanting layout than they anticipated. Strolling the property, they remark how large the estate is, and simultaneously realize they are all alone at the resort, so Scotty asks Gabriel if he's into a little skinny dipping. Gabriel approves and after an intimate time at the pool, the two young lovers retreat back to their room. Gabriel pushes Scotty onto the bed and teases his hole with his cock, before laying Scotty out and going down on him. Scotty's cock grows long and hard as Gabriel deep throats him, tonguing his balls and working his way down to Scotty's ass. Scotty returns the favor to Gabriel and he gets rock hard and ready to fuck, bending Scotty over and plunging his tongue deep in Scotty's hole, fingering it as he gives Scotty a smack on the cheeks. Scotty begs for Gabriel's cock and is not disappointed as Gabriel fills him up fast, pounding him as Scotty rides, his own hard cock slapping Gabriel's stomach as he grinds. Gabriel wants to feel Scotty's cock so they switch up, and Scotty fucks Gabriel doggy style as Gabriel instructs Scotty to fuck him harder. Scotty obliges as Gabriel twerks on his cock, and satisfied, they switch one more time as Gabriel fucks Scotty missionary. Scotty strokes his cock as Gabriel fucks hard, losing his load as Gabriel pulls out and breeds his hole, covering him cum as the sun begins to set for evening.Enjoy!",
  "models": [
    {
      "name": "Gabriel Cross",
      "person_id": 32093
    },
    {
      "name": "Scotty Zee",
      "person_id": 46672
    }
  ],
  "release_date": "2016-08-31",
  "scene_id": 118891,
  "series": "NDR - 38 - Gabriel Cross & Scotty Zee",
  "tags": [
    "Amateur",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Creampie",
    "Cum swallow",
    "Gay Porn",
    "HD Movies",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Cum Filled Getaway"
}