{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brian is in the gym bathroom taking selfies and filming himself play with his hard cock while waiting for someone to come up to the glory hole. He's having a great time in the bathroom stall while waiting for another gym patron to take a peak in the hole. Alessio comes walking in to wash his hands and notices the glory hole. He walks up to it and sees Brain filming himself stroking his dick. Alessio is extremely curious and Brian can see Alessio's eyes looking up at him through the glory hole. Alessio waves the hard dick over and Brain slides it right through the hole into Alessio's eager mouth. Brian pumps his mouth hard giving Alessio what he wants. Alessio finally calls Brian out from the stall. The two are face to face now and Alessio drops back down to his knees to finish what he started. Brian is all horned up now and begins to suck on Alessio's hard cock. Brian continuously deep throats the cock gagging every single time letting all the drool ooze out after each deep throat. Brian loves to be face fucked hard and forceful just the way Alessio is doing it. Brian has had enough of his face being fucked so he bends Alessio over the trash can and fucks him hard and deep making him bite on his knuckles as Brian slaps his balls with each hard thrust. Alessio loves to be pounded like this so much that he almost cums but its too soon for that because now it's time for him to turn the tables and fuck Brian. Alessio bends him over, spreading that sweet ass pushing his dick inside. He pumps him deep then sits back in the chair and lets Brian ride his pulsating cock until he cums straight up in the air with Alessio stroking every last bit of cum out. Enjoy!",
  "models": [
    {
      "name": "Alessio Romero",
      "person_id": 28032
    },
    {
      "name": "Brian Bonds",
      "person_id": 28078
    }
  ],
  "release_date": "2016-09-23",
  "scene_id": 118886,
  "series": "MOT548 - Brian Bonds & Alessio Romero",
  "tags": [],
  "title": "Gym Glory Hole"
}