{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As patient Derek Reed sits in his office, psychiatrist Markie More suspects he is close to gaining insight into Derek's problem. Initially, Markie assumed Derek sought him out on recommendation, but he's quickly realizing that Derek has a sex addiction problem, and that the main reason he's here is because of the way Markie fills out his pants. Derek stares at Markie's buldge as his fantasies run wild. Sensing this Markie re-positions himself in his chair as Derek inches closer to him. Markie informs Derek that he'd be violating his ethical oath in engaging with Derek, but Derek's hand on his crotch convinces Markie to indulge in a secret tryst, so Derek begins to unzip his pants, slowly kissing Markie's stomach before fitting his lips around the head of Markie's cock. Markie begins to sweat as Derek works his magic, deep throating Markie as his cock gets full and thick. Getting his dick sucked, Markie loosens up to the idea and becomes more and more comfortable with Derek, enough to return the favor. Pensively, Derek bends Markie over and eats his ass. Markie leans on the wall enjoying this new sensation and wondering what other surprises Derek has in mind. He quickly finds out, as Derek slaps his cock on Markie's ass, insinuating that he wants to put it in. Markie is hesitant at first, but allows it, as Derek plunges his cock deep inside Markie's hole, pounding him from behind as Markie takes every inch. Derek fucks him from behind, and then lets Markie take a ride on his meat stick, before switching, telling Markie he wants him to fuck the cum out of him. So Markie shoves his cock inside Derek, fucking him hard as Derek strokes himself off. Markie pounds Derek into submission, and he loses his load on his chest as Markie pulls out and douses him with sticky mess. As they lay there in Markie's office, it becomes pretty clear this is one issue that is going to need much more exploration.Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Derek Reed",
      "person_id": 47854
    }
  ],
  "release_date": "2016-08-12",
  "scene_id": 118892,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Pornstar",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Sex Crazed"
}