{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Ty Thomas is all set to open his gym tomorrow, and it's not a day too soon, as he has membership pledges already chomping at the bit to get started. But there's a snag: turns out Ty's gym isn't ready to pass fire inspection, and inspector Jake Davis won't be able to come back for a week at least. Ty is absolutely beside himself at the news, and immediately kicks into damage control to try and fix the situation. He promises Jake and his staff free memberships, but Jake is unmoved by Ty's bribery. Desperate, Ty offers the only thing he can think of, grabbing at Jake's snake as the inspector jumps back. Jake tells Ty he doesn't swing that way, but Ty persists, telling Jake he can tell he needs the release. Jake doesn't immediately resist and that's all the lead Ty needs, falling instantly to his knees and pulling Jake's cock out of his uniform. Jake's cock hits Ty's tongue with a thud as Ty downs it. Deep throating it, Ty feels Jake get hard inside his mouth as Jake realizes he's really doing this. Ty asks Jake if he wants to be sucked off but Jake tells him he's gotten all horny now, and he tells Ty to get ready to have his ass fucked. Ty gladly bends over his new incline bench as Jake unravels his hose, plunging it into Ty's ass and pounding him hard from behind. Ty takes all of Jake's pent up heat as they fuck all over the gym, ending up on a regular bench as Jake fucks the cum out of Ty, stroking him as he jizzes all over himself, before pulling out and spraying his load all over this independent business owner. Cum covered and out of options, Ty is further relieved as Jake tells him to open his gym and keep his mouth shut.Enjoy!",
  "models": [
    {
      "name": "Jake Davis",
      "person_id": 47743
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2016-09-02",
  "scene_id": 118954,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "Jerking off",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Feel the Flames"
}