{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Don't you hate running out of clean underwear?  Johnny Torque sure does, but at least he's thought of a remedy.  His stepbrother, Griffin Barrows, still hasn't returned home from the gym and Griffin ALWAYS has fresh pairs!  <br></br>Johnny quickly scampers from his own room to Griffin's and begins rifling through drawers.  Just when he finds a pair that'll fit, he hears his stepbro coming up the entryway stairs!  Johnny knows that if caught, Griffin will be PISSED to find him trespassing in his personal space, so he jumps in Griffin's closet to hide.  <br></br>Griffin peels off his shirt and pants, but then hears something.  When he discovers Johnny in the closet, Griffin has no choice but to take advantage of the situation.  He mentions how inappropriate their parents would find the situation, but he offers to keep quiet if Johnny accepts a simple blowjob from his stepbrother!  Johnny reluctantly lets Griffin wrap his mouth around that fattening cock...but Johnny makes sure to explain he's NOT GAY!  <br></br>Griffin is too busy enjoying his stepbrother's luscious erection sliding in and out between his wet lips.  And Johnny realizes how GOOD this actually feels!  He's absolutely shocked at how good Griffin sucks dick.  When Griffin feels the time is just right, he grabs Johnny by the dick and leads him over to the bed so Johnny can try fucking his face.  After a little while, Griffin convinces Johnny to try sucking a hard cock himself!  With plenty of hesitation, Johnny leans down and the boys get into a hot 69 position.  Johnny really gets into a nice rhythm, jamming his cock deep into Griffin's throat.<br></br>Then Griffin decides his stepbrother should take the ultimate step...and fuck his tight ass!  Johnny, lost in the ecstasy of the moment, agrees.  Griffin climbs atop Johnny's massive pole and takes if for a ride he's been dreaming about for a long time.  Johnny jacks his stepbro as he bounces.  <br></br>You've gotta see the rest to believe it.  Griffin really takes Johnny on an incredible, first-time adventure, right in their parents' own house!  It's an amazing encounter you won't soon forget.  ",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 47885
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    }
  ],
  "release_date": "2016-08-18",
  "scene_id": 118951,
  "series": "NDB - 4691 - Johnny Torque & Griffin Barrows",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Barrowed Undies"
}