{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "When Jordano Santoro discovered he'd be sharing a room with Trent, he was a bit nervous.  You see, they're on vacation in Cancun with a group of their friends and Jordano knows Trent to be something of a pervert.  Trent was caught on the last trip, jerking off while watching another friend nap.Sure enough, while Jordano sleeps, on the very first day of the trip, Trent pulls out his camera and begins snapping pictures of a naked, sleeping Jordano.  But Jordano isn't really asleep, he's only pretending. As Trent pulls down the covers to get a better shot of Jordano's plump, sexy ass cheeks, Jordano decides to just go with it.  He writhes around as Trent takes pictures, signaling that he likes what's unfolding here.  Trent picks up on the signals and offers Jordano a taste of his massive cock.  Jordano accepts the offer with both lips and slurps down deep on that meaty dick.  It gets harder in his mouth and Jordano positions himself so Trent can jerk him off while he sucks.  After some of this, Trent turns his friend over to sample his sweet, tight hole.  He rims him good in preparation for the next step.  Watch Jordano go all the way with his friend, taking his big, hard erection into his ass.  First, Jordano rides it, then Trent lays him on the bed and continues to pound him.  Join them until the end, when Jordano erupts while being fucked.  It's a crazy, impromptu, wild adventure.  It just goes to show that anything can happen when you're on Summer vacation in a tropical locale.",
  "models": [
    {
      "name": "Jordano Santoro",
      "person_id": 21259
    },
    {
      "name": "Trent King",
      "person_id": 47859
    }
  ],
  "release_date": "2016-09-13",
  "scene_id": 118953,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bald",
    "Big Dick",
    "Black",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Muscular",
    "Oral",
    "Rimming"
  ],
  "title": "Snap Happy"
}