{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Dante Martin and his boyfriend Damian Black get busy in Dante's bed, roommate Allen Lucas lurks in secret hiding in Dante's closet. Stirring around, the two hear him and discover his spying. An irate Dante demands answers, but Allen can only offer up weak sauce excuses. Dante notices Allen staring at both of their cocks and asks Allen what he's doing. Allen confesses that he's never seen another cock besides his own, and Dante picks up on Allen's cue, asking him if he wants to touch them. When Allen doesn't immediately decline, both Dante and Damian close in on him, swinging dicks hanging out in the breeze as they inch them closer and closer to Allen's face. Confronted with two giant hungry cocks, Allen gives in and takes one in each hand, alternating as he gives each one a little taste, before plunging both of them into his mouth. Dante notices that Allen, himself, is packing quite the package, and he decides to take a ride on Allen's pole while Damian continues to feed Allen eight inches of meat. Allen fucks Dante well but what he really wants is to see what it feels like to get fucked, so Damian and Dante abandon the original plan and decide to take full advantage of the treat they've been gifted, taking turns pounding Allen's virgin ass. Allen takes the pounding like a champ, as Damian loses his load all over Allen's face. Feeling the cum dripping down his face, cockpig Allen spits his load as Dante fucks him harder and harder, pulling out and dousing Allen with a huge facial load that seems like it will never end. Now cum covered and broken in, Allen realizes why Dante was always sneaking around the house, and Dante realizes why he always thought he heard something coming from the closet. Looks like both guys will be able to be more open now.Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Damian Black",
      "person_id": 34655
    },
    {
      "name": "Allen Lucas",
      "person_id": 47889
    }
  ],
  "release_date": "2016-08-25",
  "scene_id": 118952,
  "series": "NDB - 4693 - Dante Martin, Allen Lucas & Damian Black",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Condom",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Closet Case Hookup"
}