{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With everyone playing, catching the little buggers proves harder and harder to do, and so the resourceful player will resort to unorthodox tactics in attempts to catch them all. Such is the strategy currently being employed by Scotty Zee, who has tracked one to a stranger's backyard. The only problem is that when Scotty knocks on the door to gain entrance to the back yard, he is greeted by Lance Ford, fellow master and quite a hot piece of ass, for what it's worth. And predictably, Lance is of no mind to let Scotty waltz in and lay claim to his home turf, so he tells Scotty to scram, and heads to the back to try and capture his prize. Minutes later, Scotty shows up, out of breath and determined to secure his treasure, but Lance tells him he'll have to earn it the hard way. With a look, Scotty lets him know that won't be much of a problem, and next thing you know, these two masters have retired to the bedroom to play a different sort of game. <br></br>Scotty starts by kissing his way down Lance's body to his rock hard cock, then proceeds to suck Lance's dick until it's hard enough to cut diamonds. Flipping Lance over, Scotty tongues Lance's hole, fingering him with his thumb as he readies Lance for a nice hard lay. Lance is ready to see Scotty's game face as Scotty plunges his cock deep inside Lance's ass, pounding him from behind as Lance closes his eyes and grabs a hold of the pillow. Scotty's thick cock fills Lance up as he pokes from behind, before Lance decides to take control of the situation, mounting Scotty and bouncing on his cock as Scotty thrusts away. Lance rests his hands on Scotty's knees as Scotty's cock goes in and out of Lance's hole. They kiss passionately as Lance tells Scotty to make him cum, so Scotty flips Lance onto his back, fucking him missionary as Lance strokes the load out of his cock. Covered in his own jizz, Lance watches Scotty pull out and blast him with a master load, coating him in cum. They fall onto the bed, sweaty and exasperated, agreeing that they can wait a while before trying to catch them all.<br></br>Enjoy!",
  "models": [
    {
      "name": "Lance Ford",
      "person_id": 47871
    },
    {
      "name": "Scotty Zee",
      "person_id": 46672
    }
  ],
  "release_date": "2016-08-19",
  "scene_id": 118901,
  "series": "NDO - 4690 - Scotty Zee & Lance Ford",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Poke-U-Man Go"
}