{
  "collections": [
    "Active Duty"
  ],
  "description": "When we told Jason he'd be having his first experience with Quentin Gainz, Jason didn't put up any hesitation.  Of course Quentin is always ready to go, being the laid-back, cool guy he is.  Claude gives them the go ahead and the clothing comes off pretty quickly.  Jason leans over and plants his lips around that big, thick piece of hard meat.  After some good bobbing, Quentin gets hungry for stiff cock himself, so he has Jason lean back and allow him to reciprocate.  Jason's cock is nice 'n' happy, just right for Quentin to work on, but it's not long before Jason is craving more for himself...what a cock fiend!  Haha, I think we have some good times ahead with Jason, joining him as he tries plenty of new things here at AD.To even things out a bit, the boys get into a 69 position.  Jason really seizes the opportunity and just goes to town on Quentin's lucky dick.  And of course, Quentin gets down to business as usual.  From there, Quentin stands up and really lets Jason indulge for a while.  After getting mouthful after mouthful of Quentin's chubby cock, the guys switch again and Quentin services his new pal for a while.  Once Quentin feels Jason is perfectly primed for the next step, he bends over a desk and lets Jason jam his erection deep into Quentin's ass.  These boys are just beautiful together and the shots of Jason's hard dick penetrating Quentin's tender hole are just incredible.  They move over to the bed and Jason continues enjoying Quentin's ass.  Claude gets some great shots of Jason from behind so we see his lean-but-strong butt pumping that cock in and out of Quentin.  Finally, Quentin goes to his back and takes the final round of Jason's pounding.  This one turned out so incredibly hot (as I could've predicted with Quentin) and to be just such a feel-good experience all around.",
  "models": [
    {
      "name": "Jason III",
      "person_id": 47836
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2016-09-11",
  "scene_id": 118905,
  "series": "AD - 128 - Quentin Gainz & Jason",
  "tags": [
    "69",
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Jerk Off",
    "Smooth",
    "Tattoos",
    "Twink"
  ],
  "title": "Quentin Gainz & Jason"
}