{
  "collections": [
    "Next Door Originals"
  ],
  "description": "For massage students Arad and Austin Everett, a little extra practice could go a long way. Both guys are struggling to pass, so this practice session really is a good opportunity for both guys to brush up on their customer satisfaction skills. Agreeing to trade off, Austin undresses and assumes the position first as Arad begins to rub him down. Arad's natural talent is evident immediately, and Austin wonders how Arad could possibly need the extra reps. To his credit, Arad has an ulterior motive for taking part in the exercise, and with Austin's tiny bubble butt perched high in the air, Arad makes his move, slipping a tongue in Austin's crack and licking him from taint to top. Austin's eyes widen as he turns around and gives Arad a shocked look, but Arad's confident gaze tells him everything he needs to know, so Austin just closes his eyes and goes with the flow. Arad takes his silent agreement as permission and begins to suck Austin off, flicking his tongue on Austin's head and then working down the shaft before downing his dick in a single gulp. Austin's cock is rock hard, standing straight up in the air as Arad strokes it softly. With his interest full piqued, Austin tells Arad it's time to switch, so Arad lay on the bed as Austin returns the favor, sucking Arad off as he works his way up Arad's sculpturesque body to his massive chest. Arad is hard as a rock and tells him to fish the condom out of his front pants pocket. Austin is hesitant at the suggestion but figures he may as well, so he mounts Arad's waiting cock and goes for a ride. Arad pumps him full of hot dick as Austin bounces up and down, before they switch and Arad bends Austin over the side of the bed. Arad fucks him hard from behind as Austin takes every pounding thrust gladly. Ready to cum, Austin flips over onto his back and strokes himself off as Arad fucks him missionary, pulling out to blast Austin's cum stained body with a second load. 'Maybe his technique isn't by the book,' a thouroughly relaxed Austin thinks, 'but it sure is effective at getting the job done.'Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Austin Everett",
      "person_id": 47865
    }
  ],
  "release_date": "2016-08-26",
  "scene_id": 118900,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Blonde",
    "Condom",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Touch & Play "
}