{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Installing security systems isn't the most exciting job, despite what one might think, but every now and again, Jack Hunter enjoys a perk or two. Take his install at the Hyde residence, where lonesome playboy Damien Hyde makes it obvious that he intends to give Jack an extra tip for his service. Jack defers coyly, but Damien insists, and as a man who is used to getting what he wants, Damien refuses to take no for an answer. Luckily for Jack, this spoiled heir is also devastatingly handsome, and his naked post-shower parade around the house has made it obvious to Jack that he's packing more than just a big wallet. So, Jack figures, there are much worse fates than being seduced by a rich customer, and he decides to go with it, despite Damien's initial warning that he plays a little rough. Jack exhales and nervously watches as Damien removes his work pants, grabbing at his cock before stripping Jack bare and sucking him off. Jack's fantasies couldn't prepare him for the reality, as Damien playfully tickles his balls with his tongue before stripping out of his shorts. Jack lay on his back as Damien shoves his cock in his mouth, face fucking him until he gags as Damien eyes Jack's sweet hole. Flipping him over, he tongues Jack's asshole while spreading Jack's cheeks wide. Slapping his ass with his cock, Damien slips it inside, and Jack closes his eyes and smiles, taking every inch that Damien can dish out. Damien keeps his word and fucks Jack harder than he's ever had it, pounding him from behind before giving him the business missionary with his thick, raw cock. Jack takes the dick like a champ as he strokes himself off, cumming on his stomach as Damien fucks away. Damien pulls out and splashes his load all over Jack's hole, before breeding it with the head of his cock going in and out slowly. At least now Jack realizes what Damien meant when he said an 'extra tip.'Enjoy!",
  "models": [
    {
      "name": "Damien Hyde",
      "person_id": 47711
    },
    {
      "name": "Jack Hunter",
      "person_id": 48318
    }
  ],
  "release_date": "2016-09-07",
  "scene_id": 119155,
  "series": "NDR - 39 - Damien Hyde & Jack Hunter",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Blonde",
    "Climax",
    "Creampie",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "How Secure Are You?"
}