{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Enjoy a taste of bareback action from NextDoorRaw -- a special condom free scene exclusive to the members of NextDoorWorld!<br/><br/>With a move out date scheduled for tomorrow and a house full of stuff still yet to be packed, roommates Markie More & Lance Taylor have a lot to do. Working together, they manage to get all but the last room loaded up. As they enter the final bedroom, Lance makes the remark that they'll need to wait on the bed til tomorrow so they'll have some place to sleep tonight. Markie double takes at the thought of sharing a bed with a guy, but Lance assures him he'll be fine. Markie tells Lance he's sure he'll try to make a move for his dick, and Lance teases him that he'd probably like it. When Markie doesn't fight this assertion, Lance presses him on it, grabbing at his cock, calling Markie's bluff and outright daring him to pass it up. Unknown to Lance, Markie talks a straight game but has thought about his roommate more than once, and Lance has definitely fantasized about Markie's strong arms wrapped around him.<br/><br/>With the rest of their belongings all packed away, it seems now is the moment for both guys to reveal their tendencies, and as Lance sits there with his hand on Markie's cock, the make or break moment is now. Lance begins to lean in, pulling Markie's waistline down to reveal his semi-hard cock. Lance takes it into his mouth, checking to see if Markie is weirded out by the whole exchange. Markie closes his eyes and enjoys the sensation, and that's all the endorsement that Lance needs. Quickly he begins to undress as Markie's cock gets hard in his mouth. Sweating and hard enough to cut diamonds, Markie returns the favor, spreading his legs wide and sucking him off, before re-positioning himself underneath Lance for some sweet 69 action. Lance loves that the two of them are finally messing around, and can't believe Markie's eagerness as he tongues Lance's asshole, but what Lance really wants is to feel the full measure of Markie's rock hard raw dick inside him. Markie obliges, fucking Lance from behind, kissing his back as he pulls Lance in closer. They fuck all over the bed as Lance strokes himself off, losing his load as Markie fucks him missionary before pulling out to breed his hole. As Lance lay, cum covered and tired from the day's events, he and Markie talk about the possibility of a simple one bedroom apartment next.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Lance Taylor",
      "person_id": 47600
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-08-23",
  "scene_id": 119156,
  "series": "NDW - 124  - Markie More & Lance Taylor",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Roommate Seduction: Moving Day"
}