{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Sam is on his daily paper route routine but today is going to be different, extremely different. Word on the street is that this one house all his friends skip has a beast of a man who only comes out at night to pick up his paper. Nobody really knows what he looks like but the rumors suggest that he is mean and very big. Sam contemplates going to knock on the door as he stares from across the street. Finally he sucks it up and walks towards the door where he knocks and waits and waits and waits. To his surprise no one answers the door so he turns around but then hears a deep voice calling him back. He turns around and behold Mr. Bigg is towering over him at the door. Mr. Bigg wants to know what the hell he wants. Sam can't utter a word. Mr. Bigg tells him to come inside for some water. Sam gets his water and downs it as quick as he can. He gets up but Mr. Bigg sets him back down and begins to scare him with the rumors from the neighborhood. Sam isn't scared but Mr. Bigg tells him once hes fucked he's staying fucked. Sams eyes open wide as does his mouth once Mr. Bigg drops his pants. Sam goes for it, he takes the dick all the way into his mouth pleasing Mr. Bigg as well as he can. The big uncut cock feels great down in his throat. He's been waiting to service him for weeks now. Mr. Bigg lifts him up into the air kissing him and swirling him around. Mr. Bigg takes Sam's clothes off and sucks his big veiny cock. It's not long until Mr. Bigg is fucking this young boy all over his house. Sam's moans are driving Mr. Bigg crazy as he pumps deep into him with each thrust building up his cum that's waiting in his balls to be released by Sam's tight ass. Enjoy!",
  "models": [
    {
      "name": "Bryan Knight",
      "person_id": 48025
    },
    {
      "name": "Sam Arthur",
      "person_id": 48024
    }
  ],
  "release_date": "2016-10-31",
  "scene_id": 119216,
  "series": "DL - 30 - Sam Arthur & Bryan Knight",
  "tags": [],
  "title": "Mr. Bigg"
}