{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For teammates Daniel Flores and Ty Thomas, playing on the same team is just the beginning of their bond. Best buds for quite some time, they decide to celebrate after a big win by raiding Daniel's parents' liquor cabinet. With the drinks taking effect, Ty drifts off to sleep, sporting a massive sleep hard on that peeks out from the side of his shorts. Daniel steals a glance and notices the head poking out, and temptation gets the best of him. Ty has no idea he's into guys but Daniel decides to take a shot, rubbing the tip of Ty's penis lightly, trying not to stir him as he slowly takes it in his hand. Stirring awake, Ty is stunned to see Daniel fiddling around in his pants, and though his initial reaction is to recoil, he finally admits he hasn't been getting any at home. Daniel sees his opening and tells Ty to close his eyes and blame it on the alcohol, which works for Ty, as Daniel begins to deep throat his cock. Shocked at how good it feels and how good Daniel is, Ty pushes Daniels head further down onto his dick, telling Daniel that they have to keep this a secret. Daniel smiles as he sucks on Ty's balls, asking Ty if he wants to try it. Ty is hesitant but feels curious, taking Daniel's cock in his mouth, Ty does his best to please his friend, but what Ty really wants is Ty's hard cock deep inside him. Ty obliges, shoving his dick inside Daniel's hole and pounding him from behind as Daniel etches a grin across his face. Ty is a quick study, and they fuck all over Daniel's living room, finally concluding with Daniel on his back stroking himself to orgasm as Ty blasts his face with his virgin load. Ty laughs when Daniel tells him his parents won't be home all weekend. Enjoy!",
  "models": [
    {
      "name": "Daniel Flores",
      "person_id": 48010
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2016-09-15",
  "scene_id": 119212,
  "series": "NDB - 4699 - Ty Thomas & Daniel Flores",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Blowjob",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Jock",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Extra Score"
}