{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As he showers alone, Alex Tanner wonders if this random dildo in the corner belongs to anyone, but continues to go about his routine. Midway through, new arrival Ty Thomas enters the shower, and at first glance, Alex assumes he must've doubled back for it. From his perspective, Ty finds it pretty bold that Alex would bring his dildo to a community shower, and both guys commence to showering assuming the other is keeping a secret. Ty finds it strange that Alex is so openly advertising, but he has to admit Alex has a nice little ass and is cute as hell. Alex still can't tell if Ty is into guys or just playing coy, but as they continue to shower, it becomes obvious what is on both guys' minds. After making eye contact, Ty boldly inches closer to Alex, staring at him as he takes Alex's hand and rests it on his cock. Alex grips it and slowly massages it as Ty gets hard in his grasp. They kiss as the shower rains down upon them, and Ty pushes Alex up against the wall, kissing down his back and spreading his cheeks wide, tonguing his hole as Alex leans against the wall. Rock hard, Ty plunges his cock deep inside Alex and fucks him standing up from behind. Alex takes every thrust that Ty delivers before they move over to the bench, where Alex spreads his legs and rides Ty reverse, bouncing on his cock as steam fills the room. Flipping him over onto his back, Ty fucks Alex missionary as Alex strokes himself off, spitting jizz all over himself as Ty pulls out and messes Alex's clean body with his own load. As they talk afterwards, they each discover that the dildo doesn't belong to either one of them, which prompts them to suddenly wonder who set them up in the first place.Enjoy!",
  "models": [
    {
      "name": "Alex Tanner",
      "person_id": 38001
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2016-10-07",
  "scene_id": 119226,
  "series": "NDO - 4706 - Alex Tanner & Ty Thomas",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Red Head",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "STR8 Bait Hostel: The Setup"
}