{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With his most recent relationship crumbling, Michael Del Ray recounts all of his laments about his girlfriend to best buddy Lance Ford over a couple of beers. Michael asks Lance if he has the same problems with the guys he dates, and Lance tells him that there's heartache on both sides. 'Yeah,' Michael counters, 'but I hear at least guys give better head.'With that, Lance seizes the opportunity to cash in on a fantasy he's harbored for years, and that's to have Michael's meaty cock all to himself. <br><br>Boldly, he makes move, getting up and brushing Michael on the leg. Michael quickly recognizes Lance's intent, and tells him he was just kidding. Lance inches he hand up Michael's thigh, asking him if he's sure. Michael tells him he's not stopping him, and that's all the lead Lance needs. Unzipping his pants, he takes Michael's cock in his mouth and downs it whole, licking the shaft as Michael's eyes widen. As his cock grows harder, Michael is amazed as Lance just keeps going deeper, taking the full girth of his dick down his throat all the way to the base. Michael realizes that what he's heard is true, and asks Lance if he has any more secrets to share. Lance tells him to fuck him in the ass, bending over the table. Michael kneels down and spits on Lance's hole, tonguing him from behind as he strokes his cock, then plunging it all the way down as he spreads Lance's bubble butt wide open. Michael's dick is everything he thought it would be, and Lance proves he's up to the task as Michael proceeds to pound him on the table.<br><br>'Let's finish this in bed,' Lance says, and Michael guides him to the bedroom where Lance rides the dick like a champ, bouncing and grinding on Michael's dick.Michael flips him over onto his back and fucks him until he cums. Then, ready to burst, he pulls out and empties himself all over his friend, his girl troubles a distant memory in his mind.<br><br>Enjoy!",
  "models": [
    {
      "name": "Lance Ford",
      "person_id": 47871
    },
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    }
  ],
  "release_date": "2016-09-29",
  "scene_id": 119213,
  "series": "NDB - 4703 - Michael Del Ray & Lance Ford",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "What Are Friends For?"
}