{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With a knock on the door, Johnny Riley introduces himself to new hunky neighbor Markie More. Markie is still settling in, but Johnny seems impervious to this fact, inviting himself in and making himself at home. When Markie excuses himself to take a phone call, he returns to find Johnny rifling around in his closet, going through his clothes and sniffing his underwear. Markie finds this endearingly sweet, and rather than getting upset, he asks Johnny if this is regular behavior. <br></br>Johnny kisses him on the mouth as they fall back onto Markie's chaise, and works his way down Markie's body. Pulling out Markie's cock, Johnny realizes Markie's assets are not just on display around the room, and he takes Markie's perfect cock into his mouth, sucking his neighbor off as Markie smiles and goes along for the ride. Shifting around and straddling Markie's face, Johnny grinds his hole on Markie's tongue as Markie steadies himself to fuck Johnny good and proper.With his cock ready for action, Markie bends Johnny over and fucks him raw from behind, smacking Johnny on his bubble butt before grabbing him by the waist and pounding him even harder. Johnny takes the dick like a champ as Markie fucks him all over the living room, and as Markie fucks him missionary he spits his load all over himself. Markie keeps fucking, seeding Johnny's hole from behind before pulling out and watching his load ooze out of Johnny slowly. Smiling and exhausted, Johnny realizes he's gonna get along with the new neighbor just fine.<br></br>Enjoy!",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 38266
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-09-21",
  "scene_id": 119205,
  "series": "NDR - 41 - Markie More & Johnny Riley",
  "tags": [
    "Amateur",
    "Anal Cream Pie",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Creampie",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "The New Next Door Neighbor"
}