{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Madam Hostel does not trust the newest guest to check in. There's just something about Daniel Flores that doesn't seem right, so Madam enlists henchman Damian Hyde to investigate. Madam's instincts prove spot on when Damian finds Daniel's stash of drugs, in direct conflict with the hostel's house rules. Daniel catches Damian looking through his stuff and demands an explanation, but he is put in his place when Damian tells him how much trouble he's in. Damian tells him to just grab his shit and beat it, but Daniel tells him he has nowhere to go, and asks Damian if there's any way to work it out. Damian senses the desperation in Daniel's voice and begins to tug at his crotch, unzipping his fly as Daniel looks up and realizes what he's gotten himself into. He protests, but Damian assures him this is the only possible compromise available. Reluctantly, Daniel concedes, taking a look at Damian's cock and noticing how big it is. 'You like that?' Damian asks, and Daniel doesn't say no. Hesitant at first, he takes Damian's cock into his mouth and begins to suck it as Damian closes his eyes and pushes his mouth all the way down. Despite his reluctance, Daniel shows off a talent for sucking off, and even kind of gets into it. Damian senses this and in an attempt to make a concession, lays Daniel down and returns the favor, sucking him off as he fingers Daniel's hole. Prepping it for what comes next, Damian rubs his cock between Daniel's cheeks before plunging it deep into Daniel's waiting ass. Daniel takes it like a champ as Damian fucks him on his back. Daniel strokes his cock as Damian continues to pound, flipping him over and letting Daniel take a ride before putting him back in missionary to bust his nut. Damian explodes all over Daniel's face as Daniel busts his load all over his stomach, leaving him covered in cum, but at least with a roof over his head for the night.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Damien Hyde",
      "person_id": 47711
    },
    {
      "name": "Daniel Flores",
      "person_id": 48010
    }
  ],
  "release_date": "2016-09-30",
  "scene_id": 119227,
  "series": "NDO - 4704 - Damian Hyde & Daniel Flores",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Brunette",
    "Climax",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Interracial",
    "Jerking off",
    "Oral",
    "Rimming",
    "Slim",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "STR8 Bait Hostel: Straight Boys Never Learn"
}