{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Weary traveler Alex Tanner has found his way to Madam Hostel's lodge and is ready for a good night's rest. Trying to save a few bucks on his trip, he's both anxious and excited to be staying in the hostel, and even though the Madam seems a little odd, Alex tells himself it's worth the money. Plus, the hostel's porter, Damien Hyde, is no eye sore. Alex isn't sure if Damien is flirting with him or if everyone here is just a little forward, but nonetheless, he turns the key and unpacks in his room. After a nice shower, Alex is ready to rest his road legs, and so he falls asleep. Sometime later, Damien checks on Alex to see if he needs turn down service, and finds him ass out and ass up in the air. Damien can't resist the temptation and begins to stroke himself, fixated on the idea of pounding Alex's sweet little ass to his heart's content. As he fondles his cock, Damian decides to risk it, and slips a finger inside Alex's hole, massaging it as he continues to get hard. Alex wakes up and looks over his shoulder, asking Damien what he's doing. Incredulous, Damien doesn't even stop to answer, asking Alex if he likes it. Alex concedes that he does, and Damien asks him if he wants him to stop. Alex tells him no and Damien lowers his head, plunging his tongue deep down into Alex's hole as Alex grabs the sheets and bites the pillow. Once he's nice and ready, Damien eases his giant cock into Alex, who takes it like a champ, as Damien proceeds to pop Alex's cherry. Alex begins to understand what Madam Hostel meant by 'giving something back' as Damien proceeds to own his ass in every possible way, fucking him from behind, underneath, missionary, doggy, etc. Alex strokes himself off as Damien gets closer and closer. Alex loses his load as Damien pulls out and blasts his face, and as he lays there cum covered and still exhausted, Alex asks what other amenities the hostel provides. Damien just smiles a knowing, sly grin.Enjoy!",
  "models": [
    {
      "name": "Alex Tanner",
      "person_id": 38001
    },
    {
      "name": "Damien Hyde",
      "person_id": 47711
    }
  ],
  "release_date": "2016-09-16",
  "scene_id": 119204,
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "STR8 Bait Hostel: Turn Down Service"
}