{
  "collections": [
    "Next Door Originals"
  ],
  "description": "It's all set...Tom Faulk has the house to himself for the weekend and his girlfriend, Erica, is coming over for a little fun.  Tom has cleaned the whole house and bought a few sex toys for them to share in having a naughty time.  But then Erica calls and bails out!  Tom's efforts have all been in vain.  But it looks like his roommate, Brendan Phillips, had some plans change too.  Now it seems they'll be home together for the weekend.  And when Brendan hears Tom's girlfriend isn't coming over, he gets a few naughty ideas of his own.When Tom goes in to take a shower, Brendan leaves a Fleshjack in Tom's room as a little surprise.  Tom is confused, but also curious.  Brendan watches him secretly, hiding behind a door.  When the time is right, Brendan sneaks up as Tom fucks the Fleshjack.  He grabs the toy and begins helping Tom jack his big, hard cock.  Tom is shocked and thrown completely off guard!  It feels SO good to have someone else do the stroking with that thing!  The sensation is too good to stop Brendan.  Tom loses himself in the moment and the roomies find themselves kissing passionately.  The kissing leads them to move to the bed where Brendan cranks up the heat by sucking Tom's throbbing erection.  Brendan suggests that since Tom likes eating pussy, Tom should try eating his ass.  Tom quickly realizes that he's been missing out.  The rimming makes Brendan's tight hole hungry for dick so he bends over the bed and tells Tom to fuck him.  At this point, Tom is in WAY too deep to go back now.  He slides his large, hard cock into Brendan's ass and works up a nice pace.  Join these dudes as they make the best of a weekend together, despite some spoiled plans. Enjoy!",
  "models": [
    {
      "name": "Brendan Phillips",
      "person_id": 38107
    },
    {
      "name": "Tom Faulk",
      "person_id": 36996
    }
  ],
  "release_date": "2016-09-20",
  "scene_id": 119229,
  "series": "NDW - 126 - Brendan Phillips & Tom Faulk",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Masturbation",
    "Rimming",
    "Toys"
  ],
  "title": "Helpful Roommate"
}