{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As boyfriend Markie sleeps, Lance Ford draws a bath in the freshly renovated bathroom that has just been completed. This being the first weekend since it was finished, neither has gotten the chance to really unwind in the tub, so Lance has decided that instead of breakfast in bed, this weekend will kick off with a wet tryst. As Markie enters, he sees Lance sitting in the tub waiting. Walking over, the steam from the tub is nothing compared to the heat in Markie's loins. He gives Lance a kiss and lowers himself into the water, kissing his way down Lance's neck and chest, slowly pulling at the head of Lance's cock with his lips, before taking it all in. Lance leans back against the tub as Markie tongues every inch of him, standing with his rock hard cock as Lance sits up to return the favor. Turning him around, Markie fingers Lance's hole, eating him out before splashing his cock between Lance's cheeks, slowly inching it deep inside of his lover.Lance takes it slow and hard, then begs Markie to fuck him harder. Markie does as instructed, pounding Lance from behind, then sitting up to let Lance have his turn to control the flow. Lance rides Markie perfectly as he strokes himself, telling Markie he wants it harder. Markie leans him up against the vanity and finishes the task, fucking Lance until he sprays his seed and then pulling out to blast Lance with his load. Freshly shagged, they sink back into the tub to clean themselves off.Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Lance Ford",
      "person_id": 47871
    }
  ],
  "release_date": "2016-09-09",
  "scene_id": 119201,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Condom",
    "Cum swallow",
    "Facial",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Breaking in the Tub"
}