{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With their fellow roomie busy out by the pool, Brandon Rivers steals away inside to go check on Johnny Torque, who has been gone for quite some time now. Passing by a cracked doorway, Brandon catches Johnny in the middle of a furious self-love session, but makes the mistake of bumping the door and Johnny looks up and sees him, giving chase as Brandon flees. Catching up to him on the sofa, he throws Brandon down and with his dick still out, puts it all up in Brandon's face. To his astonishment, Brandon takes it willingly, opening his mouth and sucking on the tip, then downing it completely as Johnny feeds it to him. Brandon sucks Johnny off quietly so as not to alarm or bring any suspicion. Johnny trades off with Brandon and gives him head, licking his balls as he jerks Brandon off, and Brandon gets all the way turned on, asking Johnny if he's ever had his ass eaten. Johnny shakes his head but bends over anyway as Brandon eats him out, tonguing Johnny deep as he realizes how much it turns him on. Ready to fuck, Johnny bends him over and pounds Brandon's sweet ass from behind. Brandon takes it like a champ but tells Johnny he wants to be in control, so he mounts Johnny and proceeds to ride him good and proper. Johnny watches Brandon's bubble butt bounce on his cock, giving it a nice smack as he watches his cock disappear inside Brandon.  As they fuck, they hear the back door open and sprint to the bathroom. Fairly positive that they haven't been caught, Brandon tells Johnny to fuck the cum out of him so Johnny pins him up against the sink and pounds him hard as Brandon strokes himself to orgasm. Covered in his own cum, Brandon tells Johnny to feed him his load, so he gets down on his knees as Johnny quenches his lustful thirst. Exhaling, they hear the door creak and catch their other roommate spying through the door. Seems what goes around cums around after all. Enjoy!",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Brandon Rivers",
      "person_id": 48007
    }
  ],
  "release_date": "2016-09-08",
  "scene_id": 119200,
  "series": "NDB - 4697 - Johnny Torque & Brandon Rivers",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athlete",
    "Blowjob",
    "Caucasian",
    "Condom",
    "Facial Hair",
    "Gay Porn",
    "Hardcore",
    "Jerking off",
    "Masturbation",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Caught You Watching"
}