{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With very few rooms available at the hostel, travellers Quentin Gainz and Tom Faulk are forced to share a room, even though they are total strangers. Madam Hostel has already set them up to ensure that they get acquainted with a little trickery, and as the guys get settled into their room, the Madam's plan begins to take shape. Both guys find notes under their pillows. Tom's note reaffirms his suspicions that Quentin is interested in his cock, and to his credit, Quentin's note appears to be from Tom inviting him to do just that, so when Tom falls asleep, Quentin's curiosity gets the best of him and he takes a peek under the covers, spying on Tom's nice cock resting up against his leg. Quentin takes it in his hand and slowly massages it. Tom stirs but doesn't wake, and his cock swells up semi-hard. Quentin moves his head closer to have a taste just as Tom wakes up. Petrified, Quentin freezes, and Tom asks him what he's doing. Assessing the situation, Tom realizes what's happening and taunts Quentin, asking him if he wants this cock. Quentin nods in the affirmative and Tom tells him to get started. Quentin wastes no time getting to it, downing Tom's cock in one gulp, as Tom gags him. Sitting up, Tom gets into it as Quentin strokes himself while sucking on Tom's balls. Tom rocks Quentin back up against the wall propped up on a desk as he eats Quentin's ass before sliding his cock inside his stranger roomie. Quentin takes the dick like a pro, as Tom gives him every inch of his giant cock. Tom folds Quentin over onto his side as he continues to pound away, coming close to bursting as Quentin loses his nut all over himself, before Tom blasts him with his load. Smiling in the aftermath, the guys realize that they've been set up, though neither seems to really mind, after the fact.Enjoy!",
  "models": [
    {
      "name": "Tom Faulk",
      "person_id": 36996
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2016-09-23",
  "scene_id": 119398,
  "series": "NDO - 4702 - Tom Faulk & Quentin Gainz",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Muscular",
    "Oral",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "STR8 Bait Hostel: Mysterious Encounter"
}