{
  "collections": [
    "Active Duty"
  ],
  "description": "Now this one turned out to be seriously a lot of fun.  It's two bad dudes that we know so well, Quentin Gainz and Ivan James, along with a newcummer, Mr. Scott Ambrose.  Ivan must've come into the room hungry for cock because he doesn't waste any time taking Quentin's dick between his lips and sucking down on sweet meat.  Scott LIKES what he sees.  Ivan sees the interest and lets him get in on the fun.  As Scott goes down and gets a mouthful of Quentin, Ivan switches gears by standing up on the couch so Quentin can suck HIS dick!  It's a three-man crazy train and they're just leaving the station!Quentin really was excited when he met Scott and learned he and Ivan would be charged with the task of initiation.  It's no surprise that Quentin's next move is to lock lips with Scott for a deep, intense kiss that STILL has me worked up!  As they smooch, Ivan works on Scott's fat, erect cock.  Gosh, they're giving him the deluxe treatment!  I think that's a good sign.Then Ivan takes a turn on Scott's lips and Quentin goes down sucks Ivan while jerking Scott for a while.  WOW, things heat up here.  Being Squad Captain has its perks.  Quentin takes advantage of his high rank by having Scott blow him for a while, THEN taking first dibs on his tight hole.  When he slides his massive cock into Scott's ass, Ivan steps back in and fills Scott's mouth with his stiff meat.  Ivan's not letting Scott keep all that good dick to himself.  Quentin takes a little break from banging rookie Scott to fuck his good buddy for a while.  I think it's the kissin' chemistry that inspires the next piece of hot action: Quentin takes round 2 on Scott's tight hole.  This time though, he lets loose for a little while before relinquishing so Ivan can step up and have a chance at that newbie ass.",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Ivan James",
      "person_id": 37630
    },
    {
      "name": "Scott Ambrose",
      "person_id": 47701
    }
  ],
  "release_date": "2016-10-02",
  "scene_id": 119426,
  "series": "AD - 134 - Ivan James, Quentin Gainz & Scott Ambrose",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "First Time",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos",
    "Threesome",
    "White Butt"
  ],
  "title": "Ivan James, Quentin Gainz & Scott Ambrose"
}