{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With a knock on the door, teacher Jake Davis is suddenly confronted with a blast from his not so distant past. As Roman Todd stands in his doorway, a flood of memories comes back to Jake. After some meaningless small talk, Jake grills Roman about the purpose of his visit, and Roman shocks Jake with a wedding invitation. As Jake reads it, he shakes his head, barely able to process the reality in front of him. He asks Roman what this means for the two of them, and Roman tells him it's over and can't happen anymore. Jake takes Roman by the hand and tells him he'd like to send him off one final time. Roman is reluctant, but as Jake inches closer, brushing against Roman's cock starting to stiffen up inside his shorts, it becomes obvious to Jake as to what Roman really wants.  Kissing him hard, Roman throws Jake down onto his desk and begins to work his way up and down Jake's body. Jake falls to his knees and takes Roman's hard cock into his mouth, downing it immediately as Roman closes his eyes and leans against the ledge. Jake's hands run up Roman's body as he sucks him off, and Roman's cock gets rock hard as Jake works his magic. Switching places, Roman sucks Jake off with a passion and hunger he has yet to feel with his fiance, rocking Jake's legs high into the air as Roman playfully tongues his ass.  Jake begs Roman to fuck him hard, and Roman obliges, plunging his cock deep inside Jake as he fucks him missionary on the desk top. Jake strokes himself as Roman fucks hard, bending Jake over and taking him from behind, then letting Jake take a ride as he bounces on Roman's sexy dick while getting ever closer to losing his nut, busting it as Roman continues to pound away. Roman pulls out and blasts Jake with his load, and as Jake lay there cum covered and sated, he suspects this won't be the last time the two of them mingle. Hopefully the future wife will understand.  Enjoy!",
  "models": [
    {
      "name": "Roman Todd",
      "person_id": 46827
    },
    {
      "name": "Jake Davis",
      "person_id": 47743
    }
  ],
  "release_date": "2016-09-22",
  "scene_id": 119424,
  "series": "NDB - 4701 - Roman Todd & Jake Davis",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "Hardcore",
    "Muscular",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "I'm Getting Married"
}