{
  "collections": [
    "Active Duty"
  ],
  "description": "Golly, these are a couple of COOL cats!  I just love this duo and I think the whole squad will too.  We have 'fresh steez' Matthew Reeves paired up with 'smokin' hot' Scott. It doesn't take too long before Scott subtly suggests Matthew lean on over and have a taste.  Matthew enthusiastically dives right in, taking Scott's happy cock into his warm mouth.Scott wasn't about to let Matthew have ALL the fun.  After a little while, the guys reposition so Scott can service Matthew for a while.  Scott sure knows how to work a hard cock.  It's easy to see how well he does by Matthew's reaction.  The guys move from the couch to a standing position so Scott can continue pleasuring Matthew.  Scott takes advantage of this opportunity to display his impressive collection of cock-sucking skills.  In fact, Matthew enjoys it so much, he decides to have some more of Scott's dick.  Scott reclines on the couch and lets Matthew do some more work.  Then, before anything else, the boys sit together on the couch and kiss passionately for a while.  I don't blame 'em...good sucking like that only leads to genuine, hot intimacy.  And then of course some fucking!  Scott gets on all fours on top of a black, leather footstool and allows Matthew to penetrate his tight ass.  Then they switch things up a bit, with Scott going to his back for more punishment.  This is some of the hottest action I've seen come to us in a while and I know everyone's gonna fall in love with this pairing.  They're such hot dudes and they have a long way to go in this troop, as far as I'm concerned.",
  "models": [
    {
      "name": "Matthew Reeves",
      "person_id": 47223
    },
    {
      "name": "Scott Finn",
      "person_id": 47961
    }
  ],
  "release_date": "2016-09-25",
  "scene_id": 119425,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Jerk Off",
    "Kissing",
    "Tattoos",
    "White Butt"
  ],
  "title": "Matthew Reeves & Scott"
}