{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "In the dungeon, no one is safe from the wrath of Caleb King.  This time, JP Richards is on the receiving end.  Blindfolded and bound, JP doesn't know what or who will be doling out punishment today, but he knows he'll likely have to deal with a seriously angry cock.Caleb enters, gives JP one look up and down, and commences with a regimen of harsh treatment.  Caleb employs the use of nipple tweaking, in combination with some deep, passionate kissing.  JP knows this is part of the routine, but the blindfold has him totally in the dark and unable to anticipate what this madman might do next. When Caleb feels his prisoner is ready, he pulls off JP's blindfold and shoves his own pulsating cock into JP's mouth.  JP goes with the program, taking the hard shaft into his throat, sucking, slurping and licking when appropriate.  He certainly doesn't want this guy any more pissed off than he is.  Caleb decides to have JP lie down so he can taste his asshole.  The experience turns Caleb to thinking about going a step further.  After some good ass eating, Caleb stands up and shoves his thick boner into JP's tight hole.  JP takes the ramming on his back for a while before Caleb lets him turn around for more punishment.  After some good fucking, Caleb decides he'd like JP to taste his ass.  JP follows the instruction and licks Caleb's hole.  JP isn't bad at this, so Caleb rewards him by allowing him to fuck his ass.  This is one hot dungeon encounter that'll give you pleasant nightmares for some time to cum. Enjoy!",
  "models": [
    {
      "name": "JP Richards",
      "person_id": 27253
    },
    {
      "name": "Caleb King",
      "person_id": 38285
    }
  ],
  "release_date": "2016-09-27",
  "scene_id": 119736,
  "series": "NDE - 233 - JP Richards & Caleb King",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Climax",
    "Condom",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Interracial",
    "Jerking off",
    "Jock Strap",
    "Muscular",
    "Oral",
    "Rimming"
  ],
  "title": "Dungeon Lust"
}