{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With the night winding down and everyone a little groggy from the movie, Scotty Zee and Victor Powers search their respective apps for a hook-up while Lance Taylor saunters off to bed. Neither Scotty nor Victor seems to be having any luck, and Scotty laments how many pic collectors and flakes are out there. Victor laments that he can't seem to find any willing action, and Scotty offers to help out a friend. Victor considers Scotty's offer, and while he's not really into dudes, he has to admit it beats the prospect of going home with blue balls, so Scotty begins to go down on him. Victor is a little worried about Lance catching them but Scotty assures him he's asleep. Victor concedes as Scotty begins to show off his skills. Immediately Victor realizes he's made the correct choice, as Scotty is a pro at sucking dick. Victor's cock is hard as a rock as Scotty downs it, gulping up Victor's balls as he tongues his shaft. Stroking himself, Scotty asks Victor to return the favor. Victor, caught up in the moment, agrees and begins sucking Scotty's cock, just as Lance wanders back out into the living room. Watching his straight friend suck off his gay roommate turns Lance on, and he makes eye contact with Scotty as he whips his dick out and watches. Moments later, Victor catches Lance watching and welcomes him into the fray, as he bends over and lets Lance eat his asshole. Lance tongues at Victor's hole before stuffing it with his hard dick, as Victor continues to suck Scotty's dick. Lance pounds Victor's virgin ass before trading off to Scotty, who bends Victor over and has his way with him before the two of them nut all over this straight boy with the big muscles. Cum covered, Victor strokes himself dry, spitting his load all over his chest as the three of them high five. No blue balls for these lads tonight! Enjoy!",
  "models": [
    {
      "name": "Scotty Zee",
      "person_id": 46672
    },
    {
      "name": "Lance Taylor",
      "person_id": 47600
    },
    {
      "name": "Victor Powers",
      "person_id": 48138
    }
  ],
  "release_date": "2016-10-06",
  "scene_id": 119715,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Virgin Butt Buddy"
}