{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With his family new to the area, Johnny Riley hasn't seen much action since he moved, either sexual or social, so when local pastor's son Jake Davis invites him over, Johnny is excited, and when he sees how big the pastor's house is, he seriously considers pursuing a career in the spiritual sciences. Moments later, Johnny has serious reservations about what he's gotten himself into, as Jake conducts a series of tests to determine Johnny's status with the Lord.  Reading the test info, Jake has serious concerns that Johnny isn't being wholly truthful, but even more concerning are the results that suggest Johnny is harboring a secret crush on Jake. Johnny denies this, but Jake's test has never lied to him before, so he boldly insinuates that Johnny just needs instruction, and begins to administer the family method. Johnny is reluctant at first, but as Jake rubs his body, Johnny loosens up and the bulge in his pants tells Jake everything he needs to know. He guides Johnny through it all, slowly undressing him as he feeds him his cock, then taking his time to reciprocate before instructing Johnny on the more invasive aspects of church life. Johnny swallows it all, taking it willingly as he loosens up his reservations before cumming clean before Jake and unleashing all his inhibitions.  As Johnny lay there exhausted and exposed, Jake tells him he's passed the hardest test, and welcomes him to the church life.",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 38266
    },
    {
      "name": "Jake Davis",
      "person_id": 47743
    }
  ],
  "release_date": "2016-10-13",
  "scene_id": 119701,
  "series": "NDB - 4707 - Jake Davis & Johnny Riley",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Athletic",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Testing the Limits"
}