{
  "collections": [
    "Active Duty"
  ],
  "description": "If ya want sexy, this is it!  There's so much chemistry between Chase and Jason, I'm not surprised this one ended with a couple serious explosions.  This time, CHASE is the one taking a pounding!  Jason was thrilled to find this out and it shows.  This was Chase's very first time being fucked in the ass and we're overjoyed he chose to do it here with us.Once they got good 'n' goin', Jason leaned right on over and took Chase's fat dong between his lips and went right into some nice bobbin' and suckin.' It isn't too long before Chase decides it's his turn to get a taste.  They guys switch so Chase can take a good, hearty mouthful.  They move from the bed to the floor, where Jason stands up so Chase can jerk himself and continue sucking.  But Jason hasn't had his fill yet.  They trade positions and Jason really shows Chase how good he is with that cute mouth. Then it's time for the real thing!  Chase gets into doggy position on the bed and prepares to take Jason's big, happy dick into his ass.  The guys fuck in this position for a while.  Jason takes the opportunity to lean in and really crank up the intimacy with Chase.  After some nice ass slapping, the guys move the party over to a dresser where Jason continues drilling Chase's tight hole from behind.  Finally, Chase goes to his back, right there on the dresser so he can look at Jason while he gets fucked.  This is when things get the hottest!  There's some great kissing and we see a strong connection form between these two. And then we get a big finish from both guys, all over Jason's chest.  This is an amazing duo that I think have yet to really show us their whole potential.",
  "models": [
    {
      "name": "Chase",
      "person_id": 47270
    },
    {
      "name": "Jason III",
      "person_id": 47836
    }
  ],
  "release_date": "2016-10-09",
  "scene_id": 119927,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "White Butt"
  ],
  "title": "Chase & Jason"
}