{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Miles Taylor supervises, new pledge Brandon Wilde quietly goes through the tasks laid out before him, mostly cleaning and scrubbing the house's mess. Still, Brandon wonders why Miles has him doing all of it in nothing but a jock. What Brandon doesn't know is that this is all standard for the frat, and while Miles wants to see Brandon pitch in and help clean, what he really wants is to see how open Brandon is to other 'chores'. Brandon feels the weight of Miles' stare on his ass as he bends over to dust a credenza, but when Miles snaps his jock with his longing eyes, Brandon realizes what's really going on. Miles gives Brandon a look and lets him know what is expected of his membership to the frat, and Brandon seems willing enough, so Miles buries his head into Brandon's bubble butt and proceeds to initiate the newbie.Tonguing Brandon's ass, Miles realizes what a strong candidate he has before him, and when his pledge takes it upon himself to return the favor, Brandon's approval is all but guaranteed, but first, Miles wants to truly take this ass for a test spin, so he has Brandon mount his huge cock and give it a ride.<br></br>Brandon responds like a pro, bouncing on Miles and working his ass up and down. Miles puts Brandon through his paces, fucking him all over the room in every position before his pledge can take it no longer, spitting his hot load all over himself as Miles pulls out and coats him, anointing him into the Brotherhood with a bang.<br></br>Enjoy!",
  "models": [
    {
      "name": "Brandon Wilde",
      "person_id": 48192
    },
    {
      "name": "Miles Taylor",
      "person_id": 48191
    }
  ],
  "release_date": "2016-10-14",
  "scene_id": 119940,
  "series": "NDO - 4708 - Miles Taylor & Brandon Wilde",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Jock",
    "Jock Strap",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Bubble Butt Pledge"
}