{
  "collections": [
    "Next Door Originals"
  ],
  "description": "They just can't get enough!  Griffin Barrows is in love with the sight, smell, and taste of Brandon Rivers's sweet arm pits.  Watch his tongue make long, sensuous laps, then his fingers touch the delicate strands of hair.  And Brandon finds solace in Griffin's warm pits.  They emit a certain smell that reminds him he's safe.  Griffin's pits are where Brandon goes to feel both at home and aroused.  This time, Griffin's starting out by enjoying some face time with Brandon's pits, then stimulating Brandon's nipples with his tongue.  It's something Griffin knows to heighten Brandon's senses, making every inch of his body feel so vulnerable.  Then, after Brandon licks around Griffin's body, Griffin lays his lover down, then gently begins licking and sucking his hard, eager cock.  Griffin has primed Brandon perfectly.  Brandon feels as if this is the most intense blowjob he's ever experienced...indeed it may be.  Then Brandon returns the favor by sucking Griffin's stiff pole, then flipping Griffin's legs forward so Brandon can access Griffin's tight hole.  He licks and flicks and causes Griffin to grow quite in the mood to be fucked.  Brandon slides his dick into Griffin and works up a nice rhythm.  Griffin jerks his meat while Brandon pounds that tender ass.  After some intense fucking, Brandon climbs atop Griffin's big boner and goes for a ride.  He bounces for a while before turning around on the bed to allow Griffin to continue banging him, doggystyle this time.  Check out Brandon's wild cumshot all over gorgeous Griffin's face.  This is a wild, hot hookup that you'll especially enjoy if you celebrate the darkest, most essential elements of the male physique.   Enjoy!",
  "models": [
    {
      "name": "Brandon Rivers",
      "person_id": 48007
    },
    {
      "name": "Griffin Barrows",
      "person_id": 47885
    }
  ],
  "release_date": "2016-10-18",
  "scene_id": 119942,
  "series": "NDW - 128 - Griffin Barrows & Brandon Rivers",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming"
  ],
  "title": "Pit Addicts"
}