{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As a dick for hire, Markie More doesn't always know where the day will take him, but when he first came over to Ty Thomas' residence to ply his trade with Ty's boyfriend, Markie had a feeling he'd be back sooner than later. Perhaps it was the lustful look as Ty watched them from the other side of the room, or maybe it was the fact that Ty's load nearly hit the ceiling when he spewed it watching them fuck, but whatever the clue was, Markie knew it was only a matter of time before he found himself being called back to Ty's front door. What he didn't count on was that Ty's insatiable lust would prompt him to call the very next day, and yet, 24 hours later, Markie finds himself in a familar place.  <br></br>To Ty's credit, he wasn't planning on calling Markie back, and technically he's more of a top, but watching Markie fuck his boyfriend changed Ty's mind about both, and so he tells Markie he'd like to be fucked hard.  Markie does as he's told, fucking Ty 8 ways from Sunday. Ty takes every inch like a champ, making Markie think perhaps Ty is less of a pure top than he pretends. <br></br>But Ty proves his mettle there as well, when Markie offers to let Ty fuck him. Ty is up to the task, fucking Markie hard from behind as Markie grinds up and down on his hungry cock, spitting his load as Ty continues to fuck him, then taking Ty's load all over his back as Ty wets him down. As they embrace, exhausted and satisfied, Ty tells Markie that his boyfriend can never know about their extra meeting, and Markie promises to keep Ty's secret... for now.",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2016-10-19",
  "scene_id": 120064,
  "series": "NDR - 45 - Markie More & Ty Thomas",
  "tags": [
    "Anal Cream Pie",
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Bareback",
    "Big Loads",
    "Brunette",
    "Creampie",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "While he Watches"
}