{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Allen Lucas begins with the whipped cream, applying it liberally all over the naked, statuesque physique laid out before him. Covering all vital and exposed bits first, he then sets to strategically placing various fruits, and when he's done, escort Jimmy Clay is a veritable human sundae that Allen is just sure will bring a surprise. Allen won't have to wait long to find out, as just as he's finishing up is culinary masterpiece, boyfriend Scott Demarco comes through the door. Allen rushes to greet him and cover his eyes, leading him into the kitchen where Jimmy lays on the kitchen table. Seeing Jimmy laid out before him, covered in sweets, Scott is confused, asking Allen what's going on. Allen explains it's a gift to him, an edible escort, and immediately Scott's eyes light up.     Allen and Scott make their way over to Jimmy on the table, and begin to snack away, licking every inch of Jimmy's body. For Jimmy, the sensation is nothing short of spectacular, as Scoot works his way up to Jimmy's mouth, taking the strawberry placed there and replacing it with his tongue. They kiss as Scott works his way back down to Jimmy's cock, sucking him off as Allen continues to lick about his body. Allen stands up and Scott alternates between Jimmy and Allen, getting both of them rock hard and ready for what comes next. Since it's his gift, Allen gives Scott first dibs on Jimmy's sweet ass, and Scott jumps at the opportunity, slamming Jimmy from behind as he sucks Allen's cock. Scott fucks Jimmy hard from behind while Allen watches him work, then they all line up and Allen fucks Jimmy while Jimmy fucks Scott, running a train before flipping Jimmy back over one last time. Scott then proceeds to fuck the cum out of Jimmy, who shoots a massive load as Scott pulls out and does the same, leaving only Allen to add the finishing touch to this cream filled sundae, which he does with a master chef's touch. Who said desert had to be filling?    Enjoy!",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 47889
    },
    {
      "name": "Jimmy Clay",
      "person_id": 9918
    },
    {
      "name": "Scott Demarco",
      "person_id": 47616
    }
  ],
  "release_date": "2016-10-21",
  "scene_id": 120063,
  "series": "NDO - 4710 - Scott Demarco, Allen Lucas & Jimmy Clay",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Edible Escort"
}