{
  "collections": [
    "Hot House"
  ],
  "description": "Micah Brandt is bound, gagged, and plugged. His dom, Austin Wolf, walks over and plays with Micah's ass, eliciting intense moaning from the submissive bottom. Both men are dressed in kinky black leather. Austin takes the butt plug out, then pushes it back in, using extra spit for lube. Removing Micah's ball gag, Austin shoves his cock down Micah's throat. Thick strands of spit coat Austin's cock as Micah gags and chokes on Austin's huge meat. Flipping on to his back, Micah jerks his cock while receiving an intense face fucking from Austin. Putting Micah's legs up in the air, Austin goes down and rims Micah's delicious ass. Jerking his cock, Micah moans and gasps with intense pleasure as Austin eats his hole. With Micah's butt eager and willing, Austin slips his cock inside and starts fucking. Micah is overwhelmed by the sensation of Austin's dick filling up his hole. Gaining in intensity, Austin delivers a searing pounding to Micah's prostate that makes Micah ooze cum over his stomach. But they're not done yet - Austin keeps going, and Micah keeps jerking his hard cock. Sweat totally covers their bodies as they move to a seated position with Austin on his back and Micah riding Austin's thick rod. As Austin's cock penetrates deep into Micah's ass, Micah jerks his cock until he blows another load, dripping his cum across Austin's chest. Sliding off Austin's cock, Micah jerks Austin's cock until Austin blows a huge, gushing load, which Micah catches in his mouth. Grabbing Micah's leather harness, Austin pulls him close for a final, sweaty, cummy kiss.",
  "models": [
    {
      "name": "Austin Wolf",
      "person_id": 37357
    },
    {
      "name": "Micah Brandt",
      "person_id": 17903
    }
  ],
  "release_date": "2016-10-06",
  "scene_id": 120178,
  "series": "Skuff: Rough Trade 1",
  "tags": [
    "Anal Sex",
    "Bodybuilder",
    "Bondage",
    "Ebony",
    "Interracial",
    "Kissing",
    "Leather",
    "Masturbation",
    "Nipple Play",
    "Sex Toys"
  ],
  "title": "Skuff: Rough Trade 1, Scene #01"
}