{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Daniel Flores had been having trouble getting to sleep, and also noticed he had been feeling less energetic.  He decided a trip to the doc was in order.  When Dr. Damian Flexxx greeted Daniel at the doctor's office, Daniel was shocked at how big and handsome he was.  Damian had never seen such a hot doc!Dr. Flexxx was caring and thorough in his examination.  After checking Daniel's general health, Dr. Flexxx asked Daniel to remove his clothing -- all of it.  Daniel sure didn't argue.  He was really hoping to find an answer to his problems and was willing to fully cooperate.  When Daniel pulled off his underwear, Dr. Flexxx noticed Daniel's cock was swollen and hard.  The Doc knew exactly the problem.  It was a clear-cut case of blue balls.Dr. Flexxx informed Daniel of the issue and got to work right away, clearing out the blockage.  First, he stroked Daniel's stiff cock with his hand for a little while, feeling out the medical situation.  Then Dr. Flexxx removed his own clothes and had Daniel suck his own swelling cock.  Sometimes erection can be temporarily contagious.  It's a good thing Dr. Flexxx specialized in boners during his pre-med studies.  Daniel sucked as vigorously as he could.  Bobbing his head up and down, back and forth as his mouth worked on the Doctor's hard dick.  After a good bit of this, Doctor Flexxx turned around and bent over the examination table so Daniel could lick his ass.  When the time was just right, Dr. Flexxx got behind Daniel and slid his hulking dick into his patient's tight hole.  Join Daniel for his trip to the Dr. Flexxx's, and see this good doctor help Daniel expel lots of troublesome cum.  Enjoy!",
  "models": [
    {
      "name": "Damian Flexxx",
      "person_id": 47374
    },
    {
      "name": "Daniel Flores",
      "person_id": 48010
    }
  ],
  "release_date": "2016-11-22",
  "scene_id": 120132,
  "series": "NDE - 237 - Daniel Flores & Damian Flexxx",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Beefy",
    "Black",
    "Climax",
    "Condom",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Muscular",
    "Oral",
    "Rimming"
  ],
  "title": "Medickal Relief"
}