{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "As Jay Alexander hangs out in the park, he has no idea that model scout, Chris Harder is watching him.  Just when the moment's right, Chris makes his move, approaching Jay.  He tells him he likes his look and gives Jay his card.  Jay is intrigued by the prospect of modeling, and even more intrigued by Chris himself.    When Jay gets home, he calls Chris, who is happy to set up an appointment for evaluation.  After a few questions from Chris, Jay is advanced to the next level of scout evaluation, which involves becoming nude.     And once the undies drop, Chris wraps his mouth around Jay's hardening cock.  This is a very important step in the evaluation process.  It's the details that matter and Chris needs to know how Jay's boner tastes.     Then, of course, they kiss for a while and jerk each other.  Then it's time for Jay to display his ass-eating abilities.  Jay knows that if he wants to break into the industry, he needs to take advantage of this opportunity.  That means licking this scout's tight hole.     Then, in an effort to get an idea of Jay's stamina and strength, Chris has Jay fuck his asshole.  They start out with Jay behind Chris, pounding him over Chris's desk.  Then Chris goes to his back on the couch to allow Jay to show him just how great a fit he is for the modeling job.  Sit in on this interview to find out just how rigorous the process can be for an aspiring model.     Enjoy!",
  "models": [
    {
      "name": "Chris Harder",
      "person_id": 47785
    },
    {
      "name": "Jay Alexander",
      "person_id": 48033
    }
  ],
  "release_date": "2016-10-11",
  "scene_id": 120151,
  "series": "NDE - 234 - Jay Alexander & Chris Harder",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Black",
    "Climax",
    "Facial",
    "Facial Hair",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Interracial",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Park Scouting"
}