{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Wesley Woods has been pining for superstar underwear model Ryan Rose all weekend long, but the whole time it seemed like Ryan was more interested in Euro studs Ken Rodeo and Brute. After several hours of partying and reveling in the spectacle of San Francisco Pride, Wesley and Ryan suddenly bump into each other on the street, and something clicks. Ryan reaches out and pulls Wesley close for a kiss, and they quickly head back to the house to go all the way! They make out passionately, and their throbbing boners burst out of their tight briefs. Ryan falls backwards on the bed and Wesley eagerly deepthroats Ryan's huge, stiff cock. Ryan's incredible washboard abs flex as Wesley bathes Ryan's cock in spit. Rising up on his knees, Wesley enjoys expert oral pleasure as Ryan returns the favor. Before long, Wesley has his ass in the air with Ryan's face buried in his tasty ass. After teasing Wesley by rubbing his cock along Wesley's crack, Ryan finally slides his huge dick into Wesley's hole. Wesley's dick swings in the air as he rides Ryan reverse cowboy style. Ryan thrusts up from below, then puts Wesley on his side for intensely deep penetration. Pulling Wesley to the edge of the bed, Ryan stands and unleashes the full power of his pounding, delivering an intense fuck that brings Wesley to an immense orgasm. Pulling out, Ryan jerks his cock and blasts a massive, spurting load directly into Wesley's face. Afterwards, they go up to the roof and make out high above the Castro. Looking up from the street below, JJ sees his two best friends and cheers them on: 'Yes! I knew it!' They all laugh as Wesley exclaims, 'Oh my god, I love Pride!'",
  "models": [
    {
      "name": "Ryan Rose",
      "person_id": 27407
    },
    {
      "name": "Wesley Woods",
      "person_id": 47985
    }
  ],
  "release_date": "2016-10-14",
  "scene_id": 120189,
  "series": "Wild Weekend Part 2",
  "tags": [
    "Anal Sex",
    "Buttplay",
    "Cumshot",
    "Masturbation",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Wild Weekend Part 2"
}