{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With roommates acting a little odd, Austin Everett makes his way to the store for some household goods. Before he leaves, a strange premonition tells him to double back inside for just a second, and when he does, he hears strange noises coming from upstairs. Quietly, he creeps to the bedroom door where he can make out the muted moans of Brandon Wilde and Drake Riley, mid-coitus, nary a care in the world. Spying on them, he watches Brandon sucking off Drake in Drake's bed, and they are so into it that they don't notice Austin peeking in on them. When Brandon finally does notice, an awkward silence ensues, and Drake and Brandon begin reeling for excuses. Austin tells them to shut up and asks why he wasn't invited. Confused, the two guys ask Austin if he wants to join, and they have their answer when Austin begins unzipping his pants.Brandon takes one look at Austin's huge cock and immediately regrets not asking him to join sooner, but he makes up for that transgression by deep throating the giant dick in front of him as Drake eats his ass from behind. Austin slides around to where Drake is operating and replaces Drake's tongue with his hard cock, plunging it deep inside Brandon, who takes every inch as Drake looks on. Fucking his roommate hard, Austin smacks Brandon on the ass as Brandon takes Drake's cock into his mouth, and they pig roast him like that before switching. Drake flips Brandon over onto his back and continues to pound his hole as Brandon strokes himself off, letting his load fly all over his stomach as Austin and Drake pull out and further douse him with a man made shower. Laying there, cum covered and exhausted, the three roommates make a pact to share and share alike from now on.Enjoy!",
  "models": [
    {
      "name": "Austin Everett",
      "person_id": 47865
    },
    {
      "name": "Brandon Wilde",
      "person_id": 48192
    },
    {
      "name": "Drake Riley",
      "person_id": 48224
    }
  ],
  "release_date": "2016-10-27",
  "scene_id": 120134,
  "series": "NDB - 4711 - Brandon Wilde, Austin Everett & Drake Riley",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Blonde",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock Strap",
    "Masturbation",
    "Oral",
    "Rimming",
    "Threesome"
  ],
  "title": "Friends Don't Keep Secrets"
}