{
  "collections": [
    "Active Duty"
  ],
  "description": "This duo is nothing but crazy, laid-back fun!  It's our veteran Ryan Jordan matched up with newer recruit, Craig Cameron.  The vibe is there right from the jump, and it's one that I really like. <br/><br/>As Ryan bobs on that happy knob, Craig keeps admiring the size and beauty of Ryan's gigantic stiffy.  I think he was getting a little anxious to give it a try.  But before he can, Ryan gets on his knees on the floor and services Craig for a bit longer. <br/><br/> Finally, Craig gets to sidle up on his stomach next to Ryan and attempt to fit that hulking boner in his mouth.  'This is definitely THE biggest cock I've ever had in my hand,' Craig says before he wraps his wet lips around it.  <br/><br/>Craig slowly works up to getting down more and more of that long, girthy dong, eventually going to his knees on the floor while Ryan stands.  <br/><br/>From there, the guys go back to the bed, where Ryan gets on his stomach so Craig can slide his erection into Ryan's ass.  We get an excellent view of the cock penetrating Ryan's tender hole, then we watch Craig work up to a nice pounding pace. <br/><br/> Then Ryan switches to his back so Craig can continue fucking him but also jerk his extremely swollen dick.  The guys laugh at how Craig needs to use 2 hands to actually jerk Ryan's cock effectively.  <br/><br/>Then the rubber hits the road for Craig.  It's his turn to get fucked and Ryan is aaaaaall smiles!  Craig gets on all fours and Ryan pushes his gargantuan cock into that sensitive pocket. <br/><br/> Eventually, Ryan does get his whole shaft all the way in there and manages to work up a very nice rhythm.  Craig even goes to his back and Ryan jerks Craig's meaty cock.  ",
  "models": [
    {
      "name": "Craig Cameron",
      "person_id": 48022
    },
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    }
  ],
  "release_date": "2016-10-23",
  "scene_id": 120448,
  "series": "AD - 140 - Ryan Jordan & Craig Cameron",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Tattoos"
  ],
  "title": "Ryan Jordan & Craig Cameron"
}