{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With sun-soaked buddy Mikey Junior just waking up by the pool, Drake Riley realizes he's going to be in quite a bit of pain as soon as the sunburn sets in, so Drake offers to rub aloe on Mikey's tender spots. Mikey can't believe how cooked he is, and Drake's soothing hands feel amazing as he rubs the lotion on Mikey's back and shoulders. Flipping him over onto his stomach, Drake rubs Mikey's legs, inching his hands up Mikey's thighs and resisting his temptation to squeeze Mikey's perfect looking bubble butt. As Mikey relaxes and closes his eyes, Drake gives in to his urges and takes a cursory swipe with his tongue of Mikey's ass. Mikey's eyes bulge as he looks over his shoulder, but Drake is indignant, asking Mikey if he wants him to stop. Mikey hesitates, unsure how to answer, and Drake takes that as confirmation to continue, diving in full bore and tonguing Mikey's hole. Mikey is not sure what feels better: the aloe soothing into his skin or Drake's tongue penetrating him, as he flips back over and kisses up Drake's body, making his way back down to Drake's hard dick. Mikey sucks him off and then begs Drake to finish the job, so Drake bends him over and gives Mikey every inch of his cock, plunging it in raw and filling Mikey up in a way he's never experienced. Drake takes it slow at first, but once he's confident that Mikey can handle it, he slowly increases his speed and ferocity, fucking Mikey hard in every which way. Mikey strokes himself off as Drake continues to pound away, shooting jizz across his chest as Drake pulls out. Drake tells Mikey he wants him to suck him off, and Mikey obliges, so Drake pulls out and fucks Mikey's mouth, shooting his load all over Mikey's sun-drenched face.Enjoy!",
  "models": [
    {
      "name": "Drake Riley",
      "person_id": 48224
    },
    {
      "name": "Mikey Junior",
      "person_id": 48340
    }
  ],
  "release_date": "2016-11-02",
  "scene_id": 120451,
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Massage",
    "Rimming",
    "Smooth"
  ],
  "title": "Red Ass Lobster"
}