{
  "collections": [
    "Next Door Originals"
  ],
  "description": "After a night of good company, Mikey Junior decides to stay over instead of driving home. Austin Everett has no problem with this arrangement, but come morning time, Austin stirs awake to find Mikey's hands down his pants. Maybe it was the wine or maybe Mikey has been keeping a secret, but whatever the reason, Austin can definitely feel Mikey's hard on pressing against his back through Mikey's underwear, but when he rolls over and laughs it off, Mikey is suddenly indignant and confused, adamant that he didn't mean it.  Austin tells him it's no big deal, and that guys fuck around. This is news to Mikey, who thus far has never messed around with a guy, so Austin admits that he's messed around, and that it's just a fact that guys give better head. Mikey seems to question the validity of Austin's statement, so Austin tells him his theory that guys know what guys like, and so are more suited to satisfy each other sexually. Mikey remains skeptical, so Austin decides there's only one way to prove his theory, pulling Mikey's pants down and beginning to suck him off.  Mikey's curiosity quickly grows, as does his cock, and eyeing Austin's monster dick, he tells Austin he wants to ride it. Austin obliges, giving Mikey every inch of his gigantic cock, which Mikey takes slowly and surely. More accustomed to the sensation, Mikey bends over for Austin, who picks up the pace and proceeds to pound Mikey from behind, watching Mikey's ass slap against his pelvis as the dick disappears deep inside Mikey's bubble butt. Austin flips Mikey over and fucks the cum out of him, blasting him with a morning load that's sure to make Mikey re-think some things he swore he was sure of, just last night.  Enjoy!",
  "models": [
    {
      "name": "Austin Everett",
      "person_id": 47865
    },
    {
      "name": "Mikey Junior",
      "person_id": 48340
    }
  ],
  "release_date": "2016-11-18",
  "scene_id": 120597,
  "series": "NDO - 4718 - Austin Everett & Mikey Junior",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Straight Men",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Tired Hands"
}