{
  "collections": [
    "Hard Friction"
  ],
  "description": "Tattooed muscle man Rocco Steele locks lips with ginger-blond hunk Johnny V. Johnny strokes Rocco's massive cock, then sinks to his knees to perform oral worship. Few men could manage Rocco's enormous girth and length, but Johnny shows off just how good he is. As saliva drips from Johnny's mouth, Rocco grunts approvingly, shoving his meat even deeper down Johnny's throat. Johnny bends over and Rocco dives in face first. With his fingers, Rocco spreads saliva along the rim of Johnny's hole and pushes it deep inside. Reclining on his back, Rocco points his meat straight up in the air, and Johnny lowers himself down. It's no easy task, but Johnny keeps at it until he takes Rocco's entire cock in his hole. Standing up, Johnny takes Rocco's cock doggy style, and Rocco unleashes the full power of his intense thrusting. Johnny grits his teeth and squeezes his eyes closed as his hard cock swings back and forth in rhythm with Rocco's intense fucking. Rocco pulls all the way out, then thrusts all the way back in, over and over, stretching Johnny's ass wide every time. Moving to missionary position, Johnny throws a leg over Rocco's shoulder for maximum penetration. Sweat glistens on Rocco's shoulders and Johnny's chest as their intense, connected fucking picks up speed. Jerking his cock, with Rocco still inside him, Johnny explodes with an epic load that spurts across his washboard abs. Reaching for his own cock, Rocco strokes himself until he bursts forth with a hot, white load that drips across Johnny's cock and balls.",
  "models": [
    {
      "name": "Johnny V",
      "person_id": 34806
    },
    {
      "name": "Rocco Steele",
      "person_id": 35607
    }
  ],
  "release_date": "2016-10-21",
  "scene_id": 120535,
  "series": "Backstage Pass 2",
  "tags": [
    "Anal",
    "Big Dick",
    "Bodybuilder",
    "Oral",
    "Tattoos",
    "butt play",
    "butts",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "Backstage Pass 2, Scene #01"
}