{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With new neighbor Paul Canon on his couch, Ian Greene tactfully inquires about what Paul does for a living, disclosing to Paul that he does adult films in the process. Paul, a student loans collector, has ethical issues with his own job, but seems to project unfounded assumptions on what Ian does for a living. Ian reassures him that Paul has the wrong idea, and asks him if he's ever had sex with a porn star. Paul denies the possibility, and Ian asks him if he knows what he's missing. Paul, again, answers in the negative, and so Ian inches closer, kisses Paul on his ear and asks him if he'd like to. Paul stammers, but Ian has already begun to slide down Paul's body to remove his pants, taking Paul's cock in his mouth and downing it to the base. Paul stiffens his back and his cock, locking up at the touch of Ian's tongue, and Ian proves his professional acumen as Paul gets rock hard inside his mouth. Paul is instantly ready to fuck, so he flips Ian over, tonguing his ass to get it ready for penetration while stroking Ian's dick from behind. Ian's bubble butt is well maintained and ready for action, so Paul slides his cock deep inside. Ian takes every inch of Paul's thick cock with no problem, telling Paul to pound him. Paul does as instructed, fucking Ian hard from behind, then slamming Ian up and down as Ian rides, before finally flipping over his new neighbor onto his back. Ian watches Paul fuck the cum out of him, then begs for Paul's seed. Paul pulls out and blasts him with a huge load, coating him in jizz like a real pro, as Ian tells him to imagine getting paid for this. Paul smiles and considers taking Ian's advice to change careers. Enjoy!",
  "models": [
    {
      "name": "Ian Greene",
      "person_id": 48341
    },
    {
      "name": "Paul Canon",
      "person_id": 36900
    }
  ],
  "release_date": "2016-11-17",
  "scene_id": 120595,
  "series": "NDB - 4717 - Paul Canon & Ian Greene",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Deep Greeting"
}