{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With their parents gone, step-brothers Jack Hunter and Brandon Moore come home to discover that someone left some pretty raunchy porn on the screen. Confused, the brothers search the house and find no one, but quickly shift focus to the quality of the porn. Both guys agree it's pretty hot, and it doesn't take much to get these two in the mood. Assuming they are alone in the house, Brandon and Jack begin to make out, stripping out of their clothes as Brandon begins to suck Jack off. <br></br>With his mouth full of cock, Brandon hears a noise from the corner, and Jack investigates to discover exchange student Sasha Alexander hiding in the corner. Though he had talked of a wife back in Russia, it's clear that Sasha enjoys what he sees, so the brothers decide to make him an honorary member of the family, leading him back to the bedroom to pop his gay cherry with a bang. And they don't ease Sasha into it either, as both he and Jack immediately try their hand at tagging Brandon, double penetrating him like the dirty little cock pig that he is. Brandon takes the pounding, before flipping over to take Jack's cock solo as he sucks Sasha off, and the three of them turn Brandon's body into a homemade canvas, spraying him with their loads as he rubs it into his skin. Sasha looks down at his first brotherly load, smeared all over 'brother' Brandon, and realizes his foreign education is not just limited to the classroom.  Enjoy!",
  "models": [
    {
      "name": "Brandon Moore",
      "person_id": 35927
    },
    {
      "name": "Jack Hunter",
      "person_id": 48318
    },
    {
      "name": "Sasha Alexander",
      "person_id": 48319
    }
  ],
  "release_date": "2016-11-04",
  "scene_id": 120522,
  "series": "NDO - 4714 - Sasha Alexander, Jack Hunter & Brandon Moore",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Cum swallow",
    "Deep throat",
    "Double Anal",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Threesome",
    "Uncut cock"
  ],
  "title": "The Exchange Student"
}