{
  "collections": [
    "Hot House"
  ],
  "description": "Crackling leather stretches against the muscled bodies of Sebastian Kross and Griffin Barrows. Naked but for his Rough Trade black three-point harness, Griffin sinks to his knees and swallows every inch of Sebastian's huge cock. Griffin's deep throating fetish takes center stage as strings of saliva drip to the floor as Sebastian facefucks Griffin's wet, eager mouth. Griffin reclines on a fuck bench and leans his head back, opening his mouth to receive Sebastian's member. Grabbing Griffin's harness, Sebastian rams his lengthy dick all the way down Griffin's throat, his balls slapping against Griffin's face with each vigorous pump. After nearly 10 minutes of taking Sebastian's thick and long cock down his throat, Griffin's so turned on that he turns around and offers up his butt. Sebastian parts Griffin's ass cheeks and dives in tongue first. He spits on Griffin's hole, then uses his tongue to drive his saliva down Griffin's fuck chute. Spit drips from Griffin's hole down his smooth nut sack as Sebastian plays with the sensitive head of Griffin's swollen, throbbing cock. With Griffin's hole lubed and ready to get fucked, Sebastian lays down flat on the bench. Griffin lowers himself down and uses his beefy legs to ride Sebastian's rod. As Sebastian picks up speed, his huge, low-hanging nuts swing back and forth through the air with wet slaps. Griffin's hole stretches wide as Sebastian's cock drives deeper inside. Sweat drips from both their bodies as they move to a sling. Ramming his meat into Griffin, Sebastian produces primal moans from the insatiable bottom. As Sebastian pummels Griffin's prostate, Griffin reaches an incredible climax, blasting his torso with giant gobs of cum. Sebastian shoots his load on Griffin's ass, then scoops it up and feeds it to him, capping it off with passionate kissing.",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 48772
    },
    {
      "name": "Sebastian Kross",
      "person_id": 35799
    }
  ],
  "release_date": "2016-10-20",
  "scene_id": 120541,
  "series": "Skuff: Rough Trade 1",
  "tags": [
    "Anal Sex",
    "Kissing",
    "Leather"
  ],
  "title": "Skuff: Rough Trade 1"
}