{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "It's a hot summer day and Jaxton is hard at work pulling weeds and cleaning up the pool at his client's house. He's been working his ass off for hours and finally decides that maybe today is the day he'll take a dip in the pool since nobody is home and it's insanely hot outside. Jaxton looks around and doesn't see a soul. He drops his shorts and jumps into the pool. As he comes up out of the water Marco is standing above him asking him why his dirty ass is swimming in his clean pool. Jaxton doesn't really have an explanation except for that it's hot outside.  Marco leans in and tells Jaxton that maybe this one time he'll keep it a secret from his Dad but Jaxton has to do Marco a favor. Jaxton pulls him into the water and Marco is pissed but now that hes all wet him and Jaxton start making out in the pool. They end up naked in the pool kissing passionately until Jaxton sits up on the spa with his hard cock straight up in the air. Marco sees the rigid cock and begins to suck Jaxton's sexy dick deep and hard. Jaxton is enjoying the young lips wrapped around his throbbing cock but he wants to taste that smooth Latin ass. He flips Marco up onto the spas edge and spreads his legs wide to reveal his sexy tight hole. Jaxton bangs that sweet beautiful ass with his finger as he lubes it up with his tongue going in and out. Marco is in rimming heaven as his pool Daddy suckles on his sweet tasty hole. They decide to take the action inside where Marco blows Jaxton again. Jaxton is ready for desert and he sits on the couch as Marco mounts up on his big dick and slowly slides down taking in every inch. Marco sweet young moans begin as Jaxton pushes deep into his ass fucking him slow and hard. Marco has the sexy moves as he works that cock with his hips. Jaxton then fucks him in two more positions until he blasts his nut all over Marcos chest. Marco blows his built up load deep into Jaxton's mouth.",
  "models": [
    {
      "name": "Jaxton Wheeler",
      "person_id": 48335
    },
    {
      "name": "Marco Montgomery",
      "person_id": 48337
    }
  ],
  "release_date": "2016-11-28",
  "scene_id": 120516,
  "series": "DL - 31 - Jaxton Wheeler & Marco Montgomery",
  "tags": [],
  "title": "Pool Daddy"
}