{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Infringing upon his roommate's privacy, Michael Del Ray has helped himself to try out Dakota Young's newest Fleshjack, and by the looks of it, he's getting a lot of satisfaction from his impromptu demo, so much so that he doesn't notice when Dakota re-enters the room. Busted, Michael shows no remorse, telling Dakota he's made a wise purchase, slipping it off his cock to hand back to it's rightful owner. Dakota is trying his best to get angry but the sight of Michael's huge cock has him distracted. Michael fast talks him into letting him finish what he's started, and Dakota agrees, which eventually leads to a little mutual cock handling. Dakota is clearly enamored with Michael's big dick, fantasizing to himself what it'd be like to take his own test drive.  Michael suspends the charade and tells Dakota he can suck it. Dakota obliges, taking Michael's cock as deep into his mouth as he can. Michael's cock grows even bigger as he offers to return the favor, and as Michael sucks Dakota off, Dakota wonders if he could handle a nice stiff ride. Michael tries it out, as Dakota mounts his cock. Michael fucks him from below as Dakota slowly inches himself down the shaft. Michael's cock fills him up, and he's ready to let his roommate take control, so he bends over as Michael fucks him from behind, then flips onto his back as Michael fucks the cum out of him, pulling out and shooting a massive load all over Dakota's face and chest. With both guys exhausted from the exercise, Michael asks Dakota if he's got any more secret toys he can play with, as Dakota just laughs a knowing laugh.",
  "models": [
    {
      "name": "Dakota Young",
      "person_id": 48374
    },
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    }
  ],
  "release_date": "2016-11-11",
  "scene_id": 120770,
  "series": "NDO - 4716 - Michael Del Ray & Dakota Young",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Rimming",
    "Smooth"
  ],
  "title": "Let Me Hold It"
}