{
  "collections": [
    "Active Duty"
  ],
  "description": "Now these boys are two that know how to have a good time!  Ricky Stance and Scott Millie are a great combo and I'm not surprised.  Ricky is building his experience here with us at AD and he's been a real 'blast' to watch.  At this point, Scott's shown us that he ain't afraid of nothin'.  Claude exchanges a few pleasantries with these recruits, but they sure don't mince words.  These boys came hungry for cock and they like the prospects of getting their fill today.  Once Scott pulls off his undies, Ricky starts the party, leaning over and getting a mouthful of that luscious erection.  And then it's payback time, when the guys switch so Scott can taste Ricky for a while.  WOW!  I forgot just how massive and mouthwatering Ricky's gigantic dick is.  Then Ricky stands up to get a little more room to thrust his hips toward Scott's eager mouth.  Claude, in epic fashion, gets underneath to show us Ricky's tight balls going back and forth toward Scott's chin.  After that, Scott bends his ass over the couch to take his punishment like a man.  Claude is right up close as Ricky pushes his impossibly large dong into that tight, eager hole.  The real good fucking from behind continues until Ricky positions Scott on his back so he can look this boy in the face as he delivers the pain.  We get some great moments here as Scott winces in ecstasy while his ass continues taking that beautiful dick.Finally, the guys get into a pretty unique position, where Scott moves to a lower spot on the couch, still on his back, and Ricky fucks him while on his own knees.  It turned out just wild!",
  "models": [
    {
      "name": "Ricky Stance",
      "person_id": 38358
    },
    {
      "name": "Scott Millie",
      "person_id": 47422
    }
  ],
  "release_date": "2016-11-06",
  "scene_id": 120768,
  "series": "AD - 144 - Ricky Stance & Scott Millie",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Jerk Off",
    "Tattoos",
    "Uniform",
    "White Butt"
  ],
  "title": "Ricky Stance & Scott Millie"
}