{
  "collections": [
    "Next Door Raw"
  ],
  "description": "For Christian Bay, it seems the trappings of celebrity are all around him. His manager has him booked on a bullshit tour and it seems like he can never get a moment's peace, which is definitely affecting his ability to write any new material. <br></br>When stranded motorist Scotty Zee knocks on is door to use the phone, Christian is noticeably distracted, and though Scotty recognizes him, he plays it cool and uses the phone for a ride, then leaves. But something tells Scotty to come back, so he does, surprising Christian in his living room. Christian is nervous that Scotty may be a stalker, but Scotty seems to understand Christian's position, and quickly deduces that Christian's main problem is that he has no release, no personal enjoyment. <br></br>Scotty puts his hands on Christian's shoulders and offers him a back-rub. Christian is pensive, but Scotty persists, making a pass at Christian as he rubs him down. Christian asks Scotty how he knew he was gay, and Scotty tells him he just decided to take a chance.<br></br>Luckily for Scotty, his chance pays off, as Christian turns from his piano bench and slowly kisses Scotty's body. It's been so long since Christian has been fucked properly, given that so few people in his camp know about his sexuality, and Scotty seems capable of pushing all the right buttons, so Christian leans over his bench and tells Scotty to fuck him hard. <br></br>Scotty obliges, plunging his raw cock deep inside Christian, holding him by the waist as he pounds away, then flipping him over and fucking him missionary on the bench. Scotty hits all the right notes, making Christian cum hard all over himself before pulling out and seeding Christian's hole.<br></br>Christian, cum covered and exhausted, changes his tune and his outlook. No doubt he'll be singing Scotty's praises on his next album.<br></br>Enjoy!",
  "models": [
    {
      "name": "Christian Bay",
      "person_id": 48481
    },
    {
      "name": "Scotty Zee",
      "person_id": 46672
    }
  ],
  "release_date": "2016-11-23",
  "scene_id": 120771,
  "series": "NDR - 50 - Scotty Zee & Christian Bay",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Celebrity Stalker"
}