{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Muscled Alexander Volkov arrives for his spa day, and Ryan Rose lets him in. Alexander strips down, revealing an incredible physique worthy of a Greek god. With massage oil, Ryan delivers deep tissue relief to Alexander's bulging muscles, but Alexander's huge, uncut cock demands attention as well. Stroking Alexander's cock with one hand, Ryan slips the fingers of his other hand into Alexander's tight ass crack. Stripping off his uniform, Ryan's hard cock is irresistible to Alexander's cock-hungry mouth. Alexander rolls over on his back, allowing Ryan total oral access to his hard cock. Ryan rims inside Alexander's foreskin while playing with his nipple. Removing the headrest on the table, Ryan pulls Alexander foward and facefucks his throat. Ryan's huge, lengthy cock disappears in Alexander's mouth, and Ryan leans foward to 69 Alexander's cock. Moving to a king-size bed, Ryan puts his ass in the air for Alexander to get a taste. With his probing tongue, Alexander drives his saliva into Ryan's hole, then drives his cock in doggy style. Their gorgeous, smooth bodies show off every muscle as they writhe in erotic ecstasy. Trading roles, Alexander gives up his ass to Ryan's powerful rod. Picking up speed and intensity, Ryan delivers a pounding that leaves Alexander breathless, slamming his cock deep against Alexander's prostate. Flipping Alexander into missionary, Ryan's thrusting becomes so intense that a trail of precum drips from Alexander's rock hard cock. Reaching his climax, Ryan pulls Alexander close and blasts huge ropes of precum that arc across Alexander's face and into his mouth. Alexander closes his mouth around Ryan's still-shooting cock, and when he opens to suck Ryan's cock, huge waves of semen spill out. Leaning back on the bed, Ryan uses his tongue to stimulate Alexander's erect nipple, causing Alexander to unleash massive spurts of cum that splash all over his washboard abs.",
  "models": [
    {
      "name": "Ryan Rose",
      "person_id": 27407
    },
    {
      "name": "Alexander Volkov",
      "person_id": 48369
    }
  ],
  "release_date": "2016-11-11",
  "scene_id": 120781,
  "series": "Deep Release",
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Buttplay",
    "Cumshot",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Deep Release, Scene #04"
}