{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Navy seamen Tegan Zayne and Spencer Whitman are on the job in the boiler room, making sure everything is ship-shape. When Spencer's navy blues start slipping off his ass, Tegan sees an opportunity to get better acquainted. As Spencer's pants fall, his throbbing, uncut cock is exposed. Unbuttoning their shirts, both men reveal their hairy, muscled chests and plump nipples. Going down to his knees, Tegan gets a mouthful of Spencer's huge, foreskinned meat, rubbing his tongue inside the tip. Thick gobs of spit pour from Tegan's mouth when Spencer withdraws his cock from the back of Tegan's throat. Pinching his nipple, Spencer thrusts his hips and fucks Tegan's face faster. Rising to his feet, Tegan stands at attention while Spencer returns the oral favor. The thrill of sucking cock on the job has both men boned up and eager for more. Spreading his hairy ass cheeks, Tegan gets his hole eaten out by Spencer. The feeling of Spencer's scruffy beard in his hairy Hole makes Tegan's cock swell. Licking his finger, Spencer prods Tegan's hole, preparing it for pounding. Tegan throws his legs in the air, and Spencer shoves his meat deep into Tegan's hole. Sweat drips on their bodies, and Tegan's ass hair surrounds the shaft of Spencer's girthy cock. Trading places, Spencer bends over and takes Tegan's dick doggy style. Spencer jerks his hard cock as Tegan pounds on Spencer's prostate. Pulling out, Tegan works his cock and explodes with a massive, spurting load that drenches Spencer's hairy ass with cum. Spencer turns around and Tegan gets down on his knees, his mouth wide to swallow Spencer's thick, white load.",
  "models": [
    {
      "name": "Tegan Zayne",
      "person_id": 46884
    },
    {
      "name": "Spencer Whitman",
      "person_id": 46992
    }
  ],
  "release_date": "2016-11-11",
  "scene_id": 120930,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Oral",
    "Uniforms",
    "butts",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "Destroyer, Scene #01"
}