{
  "collections": [
    "Pride Studios"
  ],
  "description": "Toby is a maintenance worker/janitor, cleaning the floors of a locker room.  He is wearing headphones while rocking out to one of his favorite songs. He can't hear a thing as he moves around the locker room cleaning every inch. Cesar walks into the Locker Room, undresses and discovers he does not have a towel in his locker and all the other towels are dirty. He tries to get the attention of Toby who cannot hear him over his music.  Cesar has to talk loudly to get Toby's attention.  When Toby turns around he is instantly attracted to the naked body of Cesar and finds himself at a loss for words.  The two begin kissing and soon Toby is on his knees sucking Cesar's hard uncut cock. The look in Toby's eyes as he takes every inch of that uncut cock of Cesar's shows just how much he is enjoying it. Cesar gets down on his knees and starts to suck on Toby's hard cock. Toby loves his dick sucked but he loves his ass rimmed even more. Cesar bends him over the bench and spreads his legs wide to prop open his tight little hole. Cesar buries his face in it, licking and sucking all over Toby's round ass.  Cesar's big uncut cock is ready to fuck Toby's little ass. He pushes deep into him making him cringe with delight. The feel of his uncut, thick dick throbbing deep in his tight butt almost makes Toby buckle down to his knees. Cesar sees the enjoyment and wants to feel a hard dick inside of him. They switch positions and Toby fucks Cesar up against the lockers going deep and hard. It's been awhile since Cesar has had some cock in his lovely ass.   Cesar gets his fill and decides to fuck Toby again but this time he has him lay down on the bench. He lifts his smooth legs up in the air and pushes his fat dick into Toby once again. He can tell Toby is getting close to cumming so he fucks him faster and deeper until Toby explodes all over himself. Once Cesar sees his load he can't contain his own and cums hard gushing out loads of cum right after another.  Enjoy!",
  "models": [
    {
      "name": "Cesar Rossi",
      "person_id": 48499
    },
    {
      "name": "Toby Springs",
      "person_id": 32948
    }
  ],
  "release_date": "2017-01-03",
  "scene_id": 121007,
  "series": "PO - 17 - Toby Springs & Cesar Rossi",
  "tags": [],
  "title": "Instant Attraction"
}