{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Returning home from the casino, Dante Martin notices boyfriend Griffin Barrows is decidedly quiet and sad. Once prodded, Griffin confesses to losing all his money at the tables that night, and wonders how he'll pay the rent or even buy food. Dante is understanding in his damage control, telling Griffin they'll be ok, and that he can lend him some money til he gets paid again. Griffin smiles weakly, thankfully promising to pay Dante back. Dante tells him he can start to pay it back right now... with that ass. Griffin looks up to see if Dante is serious, and positive that he's not joking, they begin to make out in the car, moving inside to the bedroom.Once there, Griffin takes care of Dante, working his way down Dante's body and pulling off his pants, sucking him off as Dante lays back in bed. Dante swells up nice and hard at the thought of giving Barrows a nice pounding, but first, he rocks back onto his shoulders and tells Griffin to eat his ass. Grifffin plunges his tongue deep into Dante's hole as Dante strokes himself, and once he's nice and ready, he bends Griffin over with his ass up in the air, slowly working his raw cock all the way into Griffin, then, grabbing him by the waist, he proceeds to unleash on his boyfriend's ass, fucking Griffin all over the bed before dousing him with his load, then breeding the cum covered hole over and over again, as Griffin smiles at the thought of having such a good provider who always has his back.Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Griffin Barrows",
      "person_id": 47885
    }
  ],
  "release_date": "2016-12-07",
  "scene_id": 121079,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Loads",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Muscular",
    "Oral",
    "Rimming"
  ],
  "title": "Bedroom Jackpot"
}