{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Kory's plane arrived late so he didn't show up to his step uncle's house at the agreed time.  He walks into his step uncle's house while calling out his name but he no response back. He walks into his room and sees his step uncle in bed wearing nothing but the sheet that is barely laid on him. Kory begins to rub his cock inching his way closer to his step uncle. He pulls his big hard dick out and begins to stroke it fast. Kory is standing above him when his uncle Spencer opens his eyes to see a big fat dick being stroked near his face. Kory doesn't know he's awake yet until Spencer tells him to slow down and suck his cock. Kory is turned on and gets between his step uncle's legs and begins to suck on his big, thick, uncut throbbing cock. Kory is running his hands through his step uncle's manly hairy chest while deep throating his big dick. Kory can't get enough of that juicy cock but Spencer wants a taste of that sweet young cock. He grabs it and begins to give Kory his best blow job he's ever had. Kory can't believe he hadn't done this sooner. Uncle Spencer lays Kory out on his bed spreading his legs wide and pushing his back down to reveal his sexy smooth hole. Spencer dives head first in burying his face between those smooth milky white butt cheeks. He licks his ass up and down tonguing that young hole deep with his wet mouth. Kory's sweet revealed hole is all lubed up with spit from his step uncle's mouth. Spencer mounts him pushing his fat cock slowly deep into Kory until he's balls deep. He starts to thrust into Kory hard and fast making every inch count as he fucks his Nephew. Kory then rides that big dick sitting on it slowly and sliding up and down with precision. The length and thickness begins to stretch Kory's young ass making it easier to glide up his step uncle's hard aching shaft. Spencer lays his Nephew onto the bed and fucks the cum right out of him which makes him shoot his load all over Kory's jazzed up chest.  Enjoy!",
  "models": [
    {
      "name": "Kory Houston",
      "person_id": 37495
    },
    {
      "name": "Spencer Whitman",
      "person_id": 47027
    }
  ],
  "release_date": "2017-01-23",
  "scene_id": 121076,
  "series": "DL - 33 - Spencer Whitman & Kory Houston",
  "tags": [],
  "title": "Uncle Spencer"
}