{
  "collections": [
    "Active Duty"
  ],
  "description": "Now I just wanna warn y'all right from the giddy up: this could quite possibly be the best hookup of the year, and I ain't foolin'. It's our golden boy, Quentin Gainz, matched up with someone we've been sorely missing, Mr. Princeton Price.  <br/><br/>The clothes came off pretty quickly and Princeton couldn't keep his eyes off Quentin's luscious dick. It wasn't too long before Quentin invited him to give it a taste.  <br/><br/>These guys switch and Princeton lets Quentin take some cock down his throat. And what a gorgeous cock it is indeed. Quentin even pauses at one point, still jerking Princeton, just to admire and tell him how truly nice his dick is.  <br/><br/>Quentin moves from that hard cock to Princeton's tight hole, licking, sucking, and kissing like a starved fiend. Princeton relaxes and enjoys the ride, tugging his stiffy all the while. And then, when the moment is juuuust right, Quentin gets on top of Princeton, sliding that hard dick inside his ass, and working up a nice rhythm.  <br/><br/>Quentin rides him for a while, then goes face first on the bed, allowing Princeton to slide that firm dick in from behind. My goodness, do they crank up the heat from here! There's really no way to capture just how intense these guys fuck. <br/><br/>From there, they get a bit unusual and I love it. Princeton stands all the way upright on the bed, while Quentin sticks his ass up in a pile-driver position.  <br/><br/>Then we get my favorite, Princeton switching roles and taking some dick from Quentin. He gets on top of him, reverse cowboy, and works into a very nice little groove. <br/><br/>And finally, we end with a real bang! Quentin gets behind Princeton and gives him one of his signature, squad-captain poundings. After a little while, Princeton goes to his back. Now THIS is a soldiers' finish.",
  "models": [
    {
      "name": "Princeton Price",
      "person_id": 46796
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2016-11-27",
  "scene_id": 121075,
  "series": "AD - 150 - Princeton Price & Quentin Gainz",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Facial",
    "Jerk Off",
    "Muscular",
    "Rimming",
    "Smooth",
    "Tattoos"
  ],
  "title": "Princeton Price & Quentin Gainz"
}