{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Dorm roomies Ty Thomas and Christian Bay could not be more opposite in their approach to school. While Christian always has his head in a book, Ty is only here for the parties. Christian wonders how Ty manages to keep from dropping out, and Ty wonders how Christian keeps from going crazy. Ty thinks that Christian needs to loosen up just a little, and Christian agrees, but confesses that he really doesn't know how to relax and unwind. Ty tells him everyone at college is just out to get their kicks in, but still Christian has his doubts, so Ty enacts a plan to bait the studious Christian into a situation he can't resist, feigning a nap as his semi-hard cock peeks out from underneath his shorts. Christian would like nothing more than to take Ty's cock into his mouth but he also worries that it might freak Ty out. Chancing it, he steals over to Ty's side of the bed, quietly parting his lips and wrapping them around Ty's dick, sucking him off in his sleep as he fantasizes about Ty bending him over, eating his ass and then fucking his virgin hole any and every which way. Ty peeks out of the corner of his eye, content to let Christian continue unabated, as he imagines Christian's bubble butt bouncing on his dick before spitting his hot load all over his roomie's face. As Ty sits up and confronts him, Christian is shaken and apologizes, but Ty tells him there's nothing to be sorry for, and that he figured this was the only way to prompt Christian to act on his urges. Christian seems both relieved and excited that his fantasies are about to become reality, while Ty is just happy his roomie is so good at passing simple tests.  Enjoy!",
  "models": [
    {
      "name": "Christian Bay",
      "person_id": 48481
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2016-12-08",
  "scene_id": 121078,
  "series": "NDB - 4723 - Ty Thomas & Christian Bay",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "Hardcore",
    "Jerking off",
    "Masturbation",
    "Oral"
  ],
  "title": "Bait the Nerd"
}