{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Sitting around eating their lunch, Scott Demarco and Dante Martin hatch a plan to get a little mid-day action brewing. Horny as all hell, Scott asks Dante to line up a meeting with the cute boy from massage class, and together, they figure out a strategy to see if Lance Ford is willing and able. When Lance comes over, Dante suggests that they work on getting in some of their credit hours for school, and so Lance begins to massage Dante as Scott joins him in a four handed massage. While rubbing his back, Dante's cock peeks out from between his legs and Lance is visibly taken aback by it's size. Scott sees him staring at it and remarks how big it is. Lance plays coy and pretends he doesn't notice, but Dante stops him and makes him confess. As Scott pulls out his cock to compare, Lance is now confronted with two willing and able studs looking to bring him a little pleasure, and Lance can not say no, he takes Dante's standing cock in his hand and begins to stroke it as Dante begins to suck Scott off. Lance reaches into his pants and begins to work his cock hard as Scott fixates and fantasizes about getting a piece of Lance's sweet ass. Reality is just as good as he imagined, as he plunges his cock deep into Lance's waiting hole, pounding him from behind as Lance continues to suck Dante off. Scott fucks with a sense of purpose before he and Dante switch, allowing Dante to have his turn. Dante flips Lance over and fucks him hard, grabbing him by the waist and pulling him in closer with every forceful thrust, as Lance shoots his load all over his chest. Seeing this, both Dante and Scott pull out and blast Lance's face with a double load all over his glasses, earning Lance a little bit of extra credit towards his hours. Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Scott Demarco",
      "person_id": 47616
    },
    {
      "name": "Lance Ford",
      "person_id": 47871
    }
  ],
  "release_date": "2016-12-09",
  "scene_id": 121116,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Gay Couple",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Muscular",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Earned Hours"
}