{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As he models his prospective outfit for the festival, Jake Davis' excitement is palpatable. Decked out in a leather harness, he fantasizes about all the hot guys that will be there. Friend Michael Del Ray has a chuckle, unaware of what goes on at these types of events. Jake tries to explain it, and Michael tells him he's just going for all the cock. Jake responds that cock is all he's interested in, and Michael's ears perk up. He briefly considers offering his own member for Jake's consumption, but decides it's too weird. Jake sees all of this taking place inside Michael's mind, and prods him just a bit, telling him he won't tell anyone and that it's just a blow job. Micheal relents cautiously, as Jake begins to suck him off. Instantly, Michael's reservations melt away, as he realizes Jake is really fucking good at giving head. As his cock swells to maximum density, Michael is convinced, flipping Jake over and pounding him from behind, pile driving his giant raw cock deep inside Jake's waiting ass. Jake takes Micheal's cock with a smile as Micheal continues to pound away, flipping Jake over into missionary and fucking the cum out of him, before pulling out and absolutely coating Jake's leather clad body with a load of hot and sticky straight boy cum. As Jake wipes the jizz off his face, he tells Michael he's always invited to join him at the fest, if he wants a little more of that kind of action. Enjoy!",
  "models": [
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    },
    {
      "name": "Jake Davis",
      "person_id": 47743
    }
  ],
  "release_date": "2016-12-14",
  "scene_id": 121228,
  "series": "NDR - 53 - Michael Del Ray & Jake Davis",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Leather Virgin"
}