{
  "collections": [
    "Active Duty"
  ],
  "description": "Hey Troops,Say 'howdie' to Mr. Tex Long.  He's our newest recruit and he's absolutely delicious!  He's a tall, fun-loving gym rat with just a great attitude.  That's right, don't let that hard, chiseled exterior fool you.  Tex simply exudes a sweet warmth that I know will bring a wonderful vibe to the squad.Once Claude lets him get down to it, Tex pulls off his tank top and we see his lightly tattooed, heavily toned upper body.  Yowza!  Tex has the type of body I can't resist: his long, powerful torso and those athletic arms are so sexy!  Then Tex takes off his shorts and undies to fatten up his gorgeous dick.  Yes, Tex is quite well qualified to join the squad, and THEN some!  As he lays on the bed, getting his cock rock solid for us, Claude moves in tight for a closer look.  There's a moment when we start out looking into Tex's dreamy, blue eyes, then a slow pan down to see Tex's fair complexion with juuuuust the right amount of chest hair, then down to his luscious erection.  From the bed, Tex goes to his feet and Claude gets the shot from underneath.  Oh boy, I love seeing those tight balls.  Tex is that rare kind of specimen...strength, masculinity, and style.  Then he relaxes a bit and sits on the edge of the bed to continue tugging his firm dick.  He goes from sitting to pillow humping and we get some incredible looks at his unbelievable ass.  Wow, now that is a shapely butt!  It's between bubbly and athletic, but when you see it in action, pumping his hips into the pillow, it's easy to see that ass is built for hard fucking.Tex goes back to jerking on the edge of the bed and Claude goes over Tex's shoulder to give us a nice POV view.  Like many of our other recruits, Tex has those gruff, powerful hands I enjoy.  His dick such a perfect fit with them, especially when they're really working hard on that stiffie.  After a little while, Tex lays back on the bed and stretches his body out.  This is where he becomes extra relaxed and let's a little bit of his guard down.  I think with a tad more experience, this is the side of Tex that will come out further.  He's a super-hot, laid back dude who's here to blow of some steam and explore things he never has before.  I know we'll be looking forward to enjoying some time with Tex in the near future.",
  "models": [
    {
      "name": "Tex Long",
      "person_id": 48608
    }
  ],
  "release_date": "2016-12-07",
  "scene_id": 121226,
  "series": "AD - 153 - Tex Long",
  "tags": [
    "Big Dick",
    "Blonde",
    "Muscular",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Tex Long"
}