{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With a knock on the door, a simple delivery becomes a sudden stroll down memory lane for Quentin Gainz and James Huntsman. Buddies from high school, they are both surprised to see each other when James makes a delivery drop at Quentin's house. After some quick catching up, James asks Quentin what's so heavy inside the box, and Quentin responds that he just has a big package. James laughs, recalling the times in high school that they messed around, telling Quentin it still stands as some of the best head he's ever gotten. Quentin raises his eyebrows at this, telling James he's learned some new tricks. James is curious, and Quentin seems willing, so without even moving from the doorway, Quentin throws James up against the wall, stripping him out of his uniform to reveal his massive body. It's clear James has been keeping up with himself as Quentin inches down his muscle sculpted body to his cock. Taking it into his mouth, both guys experience a warm feeling of fond memories, as Quentin spins James around and begins to tongue at his hole. Quentin wasn't lying about a new batch of tricks, and when James spins him around and slaps his cock against Quentin's hole, Quentin tells him he can take the whole thing now, not just the tip. James tests out Quentin's claim, shoving his cock deep inside Quentin and pounding him from behind against the doorway, laying out on top of the box and fucking him missionary as Quentin strokes his batch all over his chest, cumming hard as James pulls out and blasts him with a package load special delivery.Enjoy!",
  "models": [
    {
      "name": "James Huntsman",
      "person_id": 16691
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2016-12-15",
  "scene_id": 121227,
  "tags": [
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Familiar Package"
}