{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Asher Devin arrives for his appointment at the Internal Specialists. While checking him in, physician's assistant Skippy Baxter can't help checking out Asher's cute butt. Skippy leads Asher to the exam room. Realizing he forgot his pen, Skippy leaves Asher alone for a few minutes. While Skippy is out, Asher strips down to his nearly see-through white briefs. When Skippy comes back in, he does a double take when he notices Asher's massive bulge. The examination begins as Skippy notes Asher's weight and listens to his heart. The sexual tension between nurse and patient gets more intense with each passing minute. Taking a chance, Asher grabs Skippy's hand and moves it to his throbbing boner. 'Damn boy, you're packing big!' exclaims Skippy. Throwing caution to the wind, they make out passionately as Asher strips off Skippy's scrubs. Asher's briefs come off, and Skippy goes down to get a taste of Asher's big, hard dick. Trading places, Asher takes a turn swallowing Skippy's thick meat, wrapping his hand around Skippy's shaft, and using his lips to suck on the fat mushroom head. Skippy raises his legs in the air so Asher can work his tongue up into Skippy's eager hole. Apparently, Skippy needs some sexual healing even more than his patient! Turning around, Skippy leans over the examination table and takes Asher's bone doggy style. Asher rams his cock into Skippy HARD, eliciting uncontrollable moans of pleasure. The tension builds until Skippy lets loose with massive spurts of cum, shooting all the way up past his shoulders. Asher grabs his rod and blasts Skippy's cock and balls with thick, white gobs of cum.",
  "models": [
    {
      "name": "Asher Devin",
      "person_id": 50447
    },
    {
      "name": "Skippy Baxter",
      "person_id": 47586
    }
  ],
  "release_date": "2016-12-08",
  "scene_id": 121464,
  "series": "Internal Specialists",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Hairy",
    "Kissing",
    "Uniforms"
  ],
  "title": "Internal Specialists, Scene #02"
}