{
  "collections": [
    "Falcon Studios"
  ],
  "description": "The crew is chilling over pizza and beverage at their vacation house on the river, settling in after the drive up from San Francisco. Ryan Rose asks European studs Brute and Ken Rodeo why they decided to come visit. Ken says that they wanted to see what San Francisco Pride was all about, and Brute adds that they want to 'shag as many blokes as possible.' Ken says that he views American guys as a challenge - because they're more uptight sexually! The Americans protest, proclaiming that they're just as sexually liberated as Europeans. But it's late, and the guys head to bed without resolving their debate. Later, as Wesley Woods is undressing for bed, he hears a knock at his door. It's Ken, and he wastes no time telling Wesley, 'I want you to fuck me!' 'That's very to the point,' says Wesley, feeling a bit shocked, but something about Ken's assertiveness really turns him on. They start making out, and Ken goes down on Wesley's cock. Moving into a 69 position, Wesley eats Ken's ass while Ken continues sucking Wesley's dick. Ken jerks his cock and rides Wesley's face while moaning with pleasure. 'Fuck, you taste good!' exclaims Wesley. Wesley leans back on the bed, and Ken sits on Wesley's cock and rides it like a cowboy. They switch to doggy style, and Wesley gives his cock to Ken with long, powerful strokes: all the way in, all the way out. Rolling on to his side, Ken makes his hole extra tight for Wesley to fuck him sideways. Moving to missionary, Ken strokes himself off while getting fucked, blasting his creamy load on his stomach. Wesley jerks his load out into Ken's open mouth, dripping cum on his chin, and bends down to taste his load on Ken's lips.",
  "models": [
    {
      "name": "Ken Rodeo",
      "person_id": 48575
    },
    {
      "name": "Wesley Woods",
      "person_id": 46991
    }
  ],
  "release_date": "2016-12-14",
  "scene_id": 121459,
  "series": "Wild Weekend Part 1",
  "tags": [
    "Anal",
    "Big Dick",
    "Oral",
    "bathroom sex",
    "butts",
    "cum shots",
    "international",
    "rimming",
    "sixty nine",
    "underwear"
  ],
  "title": "Wild Weekend Part 1"
}