{
  "collections": [
    "Hot House"
  ],
  "description": "New patient Armond Rizzo makes his first visit to Dr. Austin Wolf's office. Armond, who just got new insurance, says he chose Dr. Wolf because so many of his friends recommended Dr. Wolf's 'amazing work.' Armond is hoping he can have the same kind of 'experience' his friends have had with Dr. Wolf, whose powerful, muscular physique is impossible to ignore, even under his white lab coat. The routine physical begins as Dr. Wolf removes Armond's shirt to take his vitals, which also gives Dr. Wolf the chance to admire Armond's ripped body. As Dr. Wolf takes Armond's temperature, Armond slyly reaches down and fondles Dr. Wolf's massive bulge, and things really heat up! Unzipping Dr. Wolf's fly, Armond exposes the throbbing boner and bends down to savor the taste. Dr. Wolf grabs the back of Armond's head, guiding him to suck his cock deeper and deeper. Piece by piece, Dr. Wolf removes his clothing as Armond continues his oral service. A bit of nipple play gives Dr. Wolf extra pleasure as they take their doctor-patient relationship to the next level. Climbing on the exam table, Armond spreads his ass and Dr. Wolf beings his internal examination. With his fingers and his tongue, Dr. Wolf stretches Armond's hole. A surgical steel probe allows Dr. Wolf to go even deeper. Standing up, Dr. Wolf slams his cock into Armond's ass, eliciting gasps of pleasure from his patient. 'Yes doctor, fuck me!' Armond groans, as Dr. Wolf administers a rough, sweaty pounding. Displaying his acrobatic strength, Armond does a handstand as Dr. Wolf slams into his prostate from behind. The relentless pounding nearly takes Armond's breath away. Leaning back on the exam table, Dr. Wolf positions Armond on his cock and slams into him from below, and the intense stimulation on Armond's prostate makes him blow a thick, sweet load. Grabbing his cock, Dr. Wolf unloads with gushing spurts of cum that splash directly onto Armond's freshly fucked hole. ",
  "models": [
    {
      "name": "Armond Rizzo",
      "person_id": 34078
    },
    {
      "name": "Austin Wolf",
      "person_id": 37357
    }
  ],
  "release_date": "2016-12-15",
  "scene_id": 121466,
  "series": "Internal Specialists",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder",
    "Latino",
    "Sex Toys",
    "Uniforms"
  ],
  "title": "Internal Specialists"
}