{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "When Tommy Deluca invites his friend Trent King over for a game of chess, he's looking for more than just a friendly game. He's had his eye on Trent for a few weeks, ever since they met in the park. He thinks he's been noticing vibes from Trent, but isn't totally sure. Tommy figures there's no harming in making a move.It's not long into the chess match before Tommy notices Trent is rubbing something underneath his workout pants. It appears to be an absolutely enormous erection. Tommy plays along, rubbing on his own growing boner. When their eyes lock, Tommy knows it's on. They stand up, move toward each other and passionately kiss. They peel their shirts off, then Tommy goes right down for a taste of Trent's gigantic cock.  Wow, Tommy can barely believe the size of it! Nonetheless, he wraps his mouth around it and takes it as deeply as possible. Then it's Trent's turn, as he goes to his knees to suck on Tommy's fat, throbbing dick. They move to a comfy love seat where Tommy services Trent's hulking meat a little more, just before Trent switches spots so he can taste Tommy's tight asshole. Then Tommy returns that favor and licks Trent's hole, preparing it for what's next. When the time is just right, Trent bends over and accepts Tommy's incredibly large dong into his tight ass. Tommy really knows how to work up a nice pace.  He fucks Trent like a master of sensuousness. But it's not over until Trent gets a turn to fuck Tommy. This action is intense. This is a pairing of 2 of the hugest dicks you'll ever see.   Enjoy!",
  "models": [
    {
      "name": "Tommy Deluca",
      "person_id": 14412
    },
    {
      "name": "Trent King",
      "person_id": 47859
    }
  ],
  "release_date": "2016-12-20",
  "scene_id": 121613,
  "series": "NDE - 239 - Trent King & Tommy Deluca",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Black",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Checkmates"
}