{
  "collections": [
    "Fetish Force"
  ],
  "description": "Deep in Lance Hart's dungeon, pup Tyler Rush is shackled inside his steel crate. His hard bone hangs out of reach between his legs, a butt plug spreads his ass, and a leather hood covers his face. Lance arrives, rattling the cage. It's time to let Tyler out for a piss, but Lance makes him wait. Reaching through the bars, Lance grabs his pup's cock and balls, teasing him and building anticipation for the release. Slowly, Lance unties the shackles that bound Tyler to the bars. Lance opens the door, and Tyler backs out of the cage. When Tyler tries to speak, he is disciplined firmly: puppies don't talk, they bark, whimper, and moan! Lance makes Tyler wait until he can't hold it any longer: the butt plug slips out and Tyler pisses all over the floor. Furious at his pup for this disobedience, Lance grabs a flogger and teaches Tyler a lesson. After the flogger comes the cane. Pink lines appear up and down Tyler's perfect, tender ass. 'No rest for you puppy,' Lance says as he replaces Tyler's restraining hood for a pup mask. With the push of a button, restraints lower from the ceiling, and Lance straps Tyler's hands in. Lance walks over to the table and holds up a giant ass hook. The mere sight of it makes Tyler start to whimper. Despite Tyler's protesting, Lance slides in the bulbous tip and ties it off on the suspended restraint bar. Grabbing Tyler's cock and balls, Lance gives a tight squeeze while bouncing the hook in Tyler's ass, making him whimper and moans. Using a thin, black rope, Lance wraps a tight knot around Tyler's junk and ties it to the bars of the cage. As Tyler's balls turn blue, Lance tries to decide what twisted method to punish him with next!",
  "models": [
    {
      "name": "Lance Hart",
      "person_id": 48134
    },
    {
      "name": "Tyler Rush",
      "person_id": 48744
    }
  ],
  "release_date": "2017-01-05",
  "scene_id": 121657,
  "series": "Pig Puppy",
  "tags": [],
  "title": "Pig Puppy"
}