{
  "collections": [
    "Active Duty"
  ],
  "description": "No matter what you celebrate this time of year, we can certainly all cum together to enjoy Quentin Gainz, Princeton Price, Craig Cameron, Ryan Jordan, Zack Matthews, and Ripley.  These AD favorites are absolutely incredible together here, laughing, goofing off, and keeping each other warm.  This will definitely be the hottest Holiday party you attend this year!From the start, these boys are doing a lot of joking and goofing around; what else can you expect from these goofballs??  They switch things up after a bit, and Zack moves over to enjoy Quentin's hard dick, Ripley and Craig get into some deep kissing, and Princeton gets himself a nice taste of Ryan's stiffy. Once the boys really get comfortable and into a nice rhythm, Quentin decides he'd like to lick some ass and balls, so Ryan accommodates by letting him share with Princeton, who had been slurping down on Ryan's cock.  As Quentin sucks, Zack works on Quentin's firm erection, bobbing hard so Santa will bring him what he wants this year.  Next, Craig and Quentin stand up and engage in an extremely hot make out session.  Ryan seizes the opportunity and takes on both of their very hard cocks.  Like I said, Princeton is a fiend for tight hole.  He moves around to the other side and Ryan bends over to let him do some rimming.  Quentin joins him and the two share that sweet ass for a while.  The rest of the gang kisses, licks, and sucks each other, just before we get down to some real holiday fucking.First, we start out seeing Quentin pushing his big, firm cock in and out of Zack's ass, getting him warmed up for the rest of the party.  Then we see Princeton just getting down to business with Ryan's hungry hole.  I knew when he was eating that luscious ass that he would certainly be taking first dibs!  And we also have Craig slamming Ripley's hole.  This is such a fun six-way romp, it'll certainly put you smack dab in the mood for holiday fun.  The passionate kissing, the hard-pounding sex, the sensuous sucking, and the joyous laughter bring this whole thing together just perfectly.",
  "models": [
    {
      "name": "Craig Cameron",
      "person_id": 48022
    },
    {
      "name": "Princeton Price",
      "person_id": 46796
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Ripley Grey",
      "person_id": 48493
    },
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    },
    {
      "name": "Zack Matthews",
      "person_id": 46985
    }
  ],
  "release_date": "2016-12-18",
  "scene_id": 121739,
  "series": "Christmas 2016 - 6-Man Orgy",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Gay",
    "Group",
    "Jerk Off",
    "Kissing",
    "Muscular",
    "Smooth",
    "Tattoos",
    "White Butt"
  ],
  "title": "Christmas 2016 - 6-Man Orgy"
}