{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Dalton Riley hears boyfriend Lance Ford packing a bag in the closet, he realizes their fight is more serious than he originally thought. Lance, pissed to catch Dalton cheating, is ready to leave, as Dalton does his best to convince him the affair meant nothing to him. Lance isn't wholly convinced, but also doesn't relish the thought of leaving the love of his life. As Dalton continues to sweet talk, Lance softens, and Dalton tells Lance he doesn't want him to go.  'Stay with me,' he says, and Lance caves in as they embrace. Moving to the bedroom, Dalton throws Lance down on the bed, kissing down his chest as he takes off all of Lance's clothes. Lance returns the favor as Dalton lays on his back, removing his pants and taking Dalton's cock in his mouth. Dalton closes his eyes and moans as Lance tongues at his balls, flicking his taint before rolling him up onto his shoulders and plunging his tongue deep in Dalton's hole. Dalton then flips the script, pushing Lance down onto his stomach as he returns the favor, before plunging his raw cock deep inside his boyfriend's waiting ass. Lance emits a grunt of pleasure as Dalton pushes his dick all the way inside, pumping Lance from behind as Lance spreads his cheeks to take every inch. They flip over, and Lance rides Dalton, grinding his hips as he rides Dalton like a champ, stroking his cock as Dalton runs his hands up and down Lance's chest. Almost ready to blow his load, Dalton flips Lance back over onto his back, fucking him missionary as Lance spits his load onto his chest.  Dalton pulls out and blasts Lance's hole with a sticky puddle of jizz, breeding his boyfriend with the head of his cock as Lance pulls him closer to his lips. They kiss in a sweaty mess, and Lance thinks to himself, 'Maybe we should fight more often.'  Enjoy!",
  "models": [
    {
      "name": "Dalton Riley",
      "person_id": 48651
    },
    {
      "name": "Lance Ford",
      "person_id": 47871
    }
  ],
  "release_date": "2017-01-04",
  "scene_id": 121744,
  "series": "NDR - 56 - Dalton Riley & Lance Ford",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Make-Up Sex"
}