{
  "collections": [
    "Active Duty"
  ],
  "description": "This one is kind a fun little jump backward in time.  Here we have now veteran, Dante, and that sweet, fresh-faced recruit, Scott.  Claude chats a little while before letting the guys get comfortable with each other.  Dante doesn't waste too much time before pulling out his dick and working it chubbing it up.  Scott's eyes get bigger when he sees that throbbing thing and Dante invites him to have a taste.  But Claude sees Scott's rookie reluctance and suggests Dante go in first, and suck Scott's hardening cock.  With a big smile, Dante obliges and takes Scott's beautiful dick into his mouth.  When Dante lays on his back again, Scott doesn't hesitate this time to blow him.  Gosh, Scott's a newbie but I can tell by the way he puts his heart and soul into slurping down Dante's swollen dong that he has so much potential. And then Scott goes to his feet to get some more head from Dante.  Now we know Dante can handle some cock down his throat, but Scott sure tests his limits here.  He puts a hand behind Dante's head and face fucks him good.  Since Dante did such a great job sucking that stiffy, Scott decides to let him fuck his ass.  On his back, Scott takes Dante's hard cock.  It's a slow, steady squeeze getting that big dick in there at first, but once Dante gets into a good stride, he opens fire and lets Scott have it.  Then Scott turns around and Dante gives him a good doggystyle pounding.  Scott turns onto his side a little bit so he can continue getting fucked, but also look at Dante.  Then, before they're done, Scott goes completely to his back again, this time jerking his dick until it erupts, blasting a hot load all over his stomach. ",
  "models": [
    {
      "name": "Dante II",
      "person_id": 47835
    },
    {
      "name": "Scott Finn",
      "person_id": 47961
    }
  ],
  "release_date": "2016-12-25",
  "scene_id": 121740,
  "series": "AD - 158 - Scott & Dante",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Jerk Off",
    "White Butt"
  ],
  "title": "Scott & Dante"
}