{
  "collections": [
    "Next Door Originals"
  ],
  "description": "When he saw Jacob Durham struggling on the weight bench in need of a spot, Johnny Riley never imagined he'd end up having his first gay experience, but when a man is stuck in the throes of a bad marriage, anything is possible. Jacob lives for these encounters, and this isn't the first time he's lured a married straight guy back to his place on the pretense of beers and a game. Johnny doesn't really take a whole lot of convincing, since he's not getting any at home, but he's still somewhat surprised when Jake matter of factly tells him he wants to suck him off. Johnny thinks he might be bluffing, but when Jacob sits next to Johnny on the sofa and runs his hands up Johnny's leg and grabs a handful of cock, it becomes apparent that Jacob isn't fucking around. Jacob downs Johnny's cock to the base, playing with his asshole as he sucks off the head, and caught in the moment, Johnny reciprocates before Jacob is sure he's all in.  Taking him back to his bedroom, Jacob crouches on all fours and tells Johnny to fuck him hard. Johnny plunges his cock deep within his new friend's ass, pounding him from behind before flipping him over and grabbing his ankles to pound some more. Having taught him the pleasures of topping, Jacob flips Johnny over and tongues at his hole, before finishing off by popping Johnny's cherry, spreading his legs and fucking the cum out of Johnny before wetting him down with his well earned load.   Enjoy!",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 38266
    },
    {
      "name": "Jacob Durham",
      "person_id": 48613
    }
  ],
  "release_date": "2017-01-13",
  "scene_id": 121791,
  "series": "NDO - 4734 - Jacob Durham & Johnny Riley",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Beefy",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock",
    "Muscular",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Gym Cruise"
}