{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As a massage therapist, Griffin Barrows sees a lot of different bodies, but as he works his trade on James Huntsman's back, he can't help but marvel at the specimen before him. James' ripped back and arms are holding more than their fair share of tension, and as Griffin kneads and prods, he feels James begin to loosen up. James admits to Griffin that he's in need of some serious release, and Griffin affirms that assessment when he flips James over and begins working on his chest. James is carrying tension in his arms, his pecs, and his thighs, but Griffin senses that where James is in most need of attention is between his legs, so he wraps his fingers around the shaft of James' meaty cock and gives it a squeeze. James asks him if this treatment will cost him extra, and Griffin winks, telling him it's a first timer's discount, before plunging down full bore on James' cock, sucking at the head and working his way down to the base. Griffin deep throats as James closes his eyes and enjoys it, but when Griffin turns him back over and begins to eat his ass, James realizes he's in for a completely unexpected surprise. Flipping him back over, Griffin strokes James' cock a bit more before mounting it, slowly lowering himself onto James' dick. James gives his ass a smack and Griffin rides him like a cowboy, grinding on James' cock as he plays with his taint.  James, fully piqued, takes the situation under control and bends Griffin over his table, pounding him from behind as Griffin smiles with every thrust. He twists back onto his back and begins to work himself off as James fucks the cum out of him, pulling out and launching his pent up load all over Griffin's sweat drenched body. Slapping his cock against Griffin's taint, James doubles down on his promise to come back soon.",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 47885
    },
    {
      "name": "James Huntsman",
      "person_id": 16691
    }
  ],
  "release_date": "2017-01-06",
  "scene_id": 121742,
  "series": "NDO - 4732 - James Huntsman & Griffin Barrows",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Beefy",
    "Big Muscles",
    "Blowjob",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "Hardcore",
    "Pre-Condom",
    "Rimming"
  ],
  "title": "Celebrity Massage"
}