{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Markie More enters the company gym for his daily workout, he finds a young, fresh faced college age guy on one of the machines. Since he normally has the gym all to himself, Markie strikes up a convo and finds out his workout companion is none other than his boss's son. Christian Bay has recently moved home to attend college, and with nothing better to do, he figured he'd kill some time at the gym. Now that his workout is almost over, he tells Markie he likes to end his routine with some 'hard cardio'. Stepping closer to Markie and rubbing his arm, the insinuation is clear, and Markie isn't having any of it, fearing the repercussions it may have.  Christian, already one step ahead of Markie, threatens to blackmail Markie to the boss, and tells Markie his only choice is to do what Christian wants. Sensing that he's in a no win situation, Markie concedes, telling Christian he'll oblige, but that he isn't going to be nice about it.  'Even better,' Christian replies, eyeing Markie's ripped chest and imagining the damage a guy like that could do to him. Markie, true to his word, throws Christian down to his knees, shoving his cock in Christian's mouth. The boss's son takes Markie's dick all the way down his throat as Markie closes his eyes and enjoys it. Propping Christian up on pull up machine, Markie strokes his cock while he tongues Christian's hole, getting it nice and ready for some hard pumping.  Markie shoves his raw cock inside Christian, pounding him from behind and showing no mercy for the would-be blackmailer. Flipping him over, Markie fucks Christian missionary as Christian drops his load, spitting it all over his chest as Markie pulls out and blasts his hole, shoving his cum-drenched cock back inside his boss's son and breeding his hole, nice and proper.  Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Christian Bay",
      "person_id": 48481
    }
  ],
  "release_date": "2016-12-28",
  "scene_id": 121743,
  "series": "NDR - 55 - Markie More & Christian Bay",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Oral",
    "Rimming"
  ],
  "title": "The Boss's Son"
}