{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Scotty Zee sets off on his run, he wonders if the cute blonde guy will be in the park like he usually is, and towards the end, he spots him over on a trail path. Cruising by him, Scotty shoots him a look, wondering if the guy will pick up on its meaning, and whether or not the guy is even into the idea. Ty Thomas has also noticed Scotty on his runs, and when Scotty passes, he decides to follow and see where it leads. Scotty non-chalantly returns to his house, leaving the sliding door open, and waits. Moments later, Ty enters silently, walking right up to Scotty and kissing him hard against a wall, running his hands down into Scotty's pants and taking off his shirt. Falling down to his knees, Ty begins to suck Scotty off, flipping him around and eating his ass before pulling out his cock and standing up.  'I'm gonna fuck you raw,' he whispers into Scotty's ear, before plunging his cock all the way inside, slowly fucking Scotty from behind as Scotty nudges his ass back into it with every thrust. Scotty wonders if Ty takes a dick as good as he gives it, and finds out he does, fucking him on the table as Ty lay on his back stroking himself. Scotty is ready to burst but wants to get fucked while he busts his nut, so he mounts Ty one more time, riding him as he spits his load all over the floor, then getting down on his hands and knees as Ty blasts his face. Sucking the last drop dry, Scotty smiles up at Ty who smiles back down at him, asking him what time he plans on running tomorrow.",
  "models": [
    {
      "name": "Scotty Zee",
      "person_id": 46672
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2017-01-11",
  "scene_id": 121813,
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Colored hair",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Pre-Condom",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "First Time Cruiser"
}