{
  "collections": [
    "Active Duty"
  ],
  "description": "Take a look at this new hunk! His name is Rick Tolls and he's matched up with our reliable, go-to stud, Ryan Jordan. Rick has NEVER hooked up with another dude before, but he's stripping down on camera so we can watch his first time.  <br/><br/>When Claude leaves them to it, they pull off their clothing fairly quickly. Rick leans over and gets the party started, taking Ryan's big, lovely dick between his lips. Ryan moves to the edge of the bed to let Rick ease a little further into this uncharted water.  <br/><br/>And next is Rick's turn! Hungry Ryan gets right in there and returns the favor. We know Ryan can slurp a good cock, and he certainly does so here.  <br/><br/>All that good, good suckin' leads Rick to lay back and put his feet in the air so Ryan's pulsating erection can slide right into his tight hole. It definitely takes some time going into that virgin ass, but once Ryan's stiffy is in, Ryan diligently starts working toward a nice rhythm.  <br/><br/>After the time on his back, Rick gets on all fours on the bed and lets Ryan stuff his hard cock in there again. Claude goes underneath and we get to see that strong ass on Ryan do work. Rick buries his face in the bed as Ryan works that sweet ass.  <br/><br/>So Ryan adds another rookie notch to his belt and Rick comes away with the experience of a lifetime. I think everyone's gonna LOVE this cumshot from Ryan. Rick bends down from standing and lets Ryan shoot all over his sexy ass.  ",
  "models": [
    {
      "name": "Rick Tolls",
      "person_id": 48592
    },
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    }
  ],
  "release_date": "2017-01-01",
  "scene_id": 121808,
  "series": "AD - 160 - Ryan Jordan & Rick Tolls",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Ryan Jordan & Rick Tolls"
}