{
  "collections": [
    "Hot House"
  ],
  "description": "It's quiet on the Hot House set as Austin Wolf preps his photography gear. Production assistant Gabriel Cross introduces today's subject: Alexander Volkov. 'Today's going to be a closed set. You guys can go,' announces Austin to the other crew. After loosening Alexander's tie, Austin steps behind the camera and starts shooting. After a few poses, Austin instructs Gabriel to remove Alexander's shirt. As Gabriel opens Alexander's shirt to reveal his smooth, muscular torso, their eyes meet and they share a smile. Alexander's next look is an edgy black bodysuit, and after that Alexander steps into a tight, white jockstrap. They wrap the shoot, and Alexander turns around to show off the huge bulge in his jockstrap. 'Did you enjoy that?' asks Austin. Alexander affirms, and Austin and Gabriel both move in to make out with the ripped hunk standing before them. Unbuttoning his fly, Austin shoves down his jeans and puts his cock in Alexander's mouth. Gabriel bends down to suck Alexander's hard meat, then stands up and makes out with Austin while Alexander alternates between sucking their cocks. Gabriel proves he has a perfect mouth for cocksucking too, trading places with Alexander and using his mouth to stimulate the sensitive tips of Alexander and Austin's cocks. Bending over a stool, Alexander sucks Gabriel's cock as Austin rims Alexander's ass. With Alexander lubed up, Austin slides his thick meat into Alexander's backdoor. Gabriel plays with Alexander's nipples as they make out, sharing long, passionate kisses. Alexander shows off his versatility when he becomes the meat in a fuck sandwich between Austin and Gabriel. Switching things up, Gabriel spreads his legs as Austin and Alexander take turns fucking him. Gabriel strokes his rock-hard dick and busts a nut, shooting his cum onto his stomach with Alexander still inside him. Kneeling down, Gabriel opens his mouth to catch Alexander and Austin's hot loads, letting their semen splash across his tongue and roll down his face.",
  "models": [
    {
      "name": "Austin Wolf",
      "person_id": 37357
    },
    {
      "name": "Gabriel Cross",
      "person_id": 37748
    },
    {
      "name": "Alexander Volkov",
      "person_id": 48369
    }
  ],
  "release_date": "2017-01-05",
  "scene_id": 121850,
  "series": "Depths Of Focus",
  "tags": [
    "Anal Sex",
    "Bodybuilder",
    "Group Sex",
    "Kissing",
    "Masturbation",
    "Nipple Play"
  ],
  "title": "Depths Of Focus, Scene #01"
}