{
  "collections": [
    "Active Duty"
  ],
  "description": "By now we've come to know and love each of these hot dudes very well.  This time we have Craig Cameron, Chase, and honorary squad captain, Quentin Gainz.  These guys have some pretty strong personalities and come with a lot of leadership qualities and we certainly see some interesting minglings.  They go from some nice stroking off the bat to Quentin blowing Chase and Chase sucking that fat dick on Craig.  Boy I love how that powerful dong looks across Chase's face.  After a little while, they switch directions and Quentin heads up the front of the suck train. Then Chase gets into a power position, standing up next to the couch, with Quentin on his knees, bobbing on Chase's happy dick, and Craig on his back on the floor taking Quentin's cock down his throat. These insatiable recruits can't keep their dicks out of each other's asses for too long when they're together.  Chase steps up to the plate first (of course), and slides his big cock into Quentin's tight hole.  This is a testament to how crucial Quentin is in any three-way.  As Chase works up some nice momentum, Quentin sucks on Craig's large boner.  Then it's Craig's turn to take some punishment.  Isn't it always the case that the loudest mouth always gets fucked the hardest?  Well that sure happens here, as Chase is happy to show Craig what it feels like to get railed with a big dick entering your mouth at the same time. high.  But this party certainly can't end without Chase receiving some retaliation from these fine soldiers!  Chase bends over and accepts Quentin's eager boner, while wrapping his lips around Craig's rock hard cock.  And as a nice payback, Craig switches spots with Quentin to give Chase's ass a piece of his dick's mind.  From start to finish, this three-way romp has it all: romance, hard fucking, goofing around, and of course, three amazing cum blasts.",
  "models": [
    {
      "name": "Chase",
      "person_id": 47270
    },
    {
      "name": "Craig Cameron",
      "person_id": 48022
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2017-01-08",
  "scene_id": 122060,
  "series": "AD - 162 - Chase, Craig Cameron & Quentin Gainz",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Deep Throat",
    "Facial",
    "Gay",
    "Kissing",
    "Muscular",
    "Sandwich Fuck",
    "Smooth",
    "Tattoos",
    "Threesome",
    "White Butt"
  ],
  "title": "Chase, Craig Cameron & Quentin Gainz"
}