{
  "collections": [
    "Men Over 30"
  ],
  "description": "Dustin and Hans have been a couple for a while now and they are in the gym locker room getting ready for a workout, Dustin brings up the idea of them having a 3-way.  Hans is not sure that they are ready for this step because Dustin got very jealous in his last relationship and he isn't sure if he has overcome it.  Dustin convinces him that things are different with their relationship and that he knows he can handle it.  Just as Hans asks where they will find a third, Cameron walks into the locker room.  Dustin and Hans check him out and talk about whether he would be a good match and Hans says 'how do you know he is even gay?'  With that Dustin approaches Cameron and tells him that they are interested in a 3-way and Cameron is more than happy to be their 1st!  They all embrace in a 3-way kiss and soon have their cocks out and Dustin drops to his knees and starts sucking Cameron and Hans.  Hans then comes down and both Dustin and he share Cameron's cock kissing and sucking.  Cameron then sucks both of them for a while giving them pleasure they both deserve and to balance out all the emotions.  Hans begins to rim Cameron's ass, at the request of Dustin, while Dustin shoves his cock down Cameron's throat face fucking his wet eager mouth.  Once Cameron's ass is nice and wet, Dustin fucks him while Hans gets his cock sucked.  Hans takes his turn with Cameron's ass while Dustin gets his cock blown.  Hans tells them he wants Cameron to eat his ass to get it ready for Dustin to fuck his tight hole.  While Cameron is eating Hans's beefy ass, Hans has his mouth full with Dustin's cock.  Dustin then fucks Hans while Cameron holds his legs as Hans's deep throats Cameron.   Dustin decides he wants to be fucked by his man plus Cameron at the same time, so he puts himself in the middle and gets spit roasted. The train has begun with all three sexy eager men pumping back and forth enjoying all the sweaty contact.  Totally turned on, Dustin exclaims he is about to cum and Hans drops to his knees as both Cameron and Dustin shoot their loads on Hans face.  As he laps up their cum, he blasts his own load all over the floor. Enjoy!",
  "models": [
    {
      "name": "Cameron Kincade",
      "person_id": 28035
    },
    {
      "name": "Dustin Steele",
      "person_id": 34302
    },
    {
      "name": "Hans Berlin",
      "person_id": 48552
    }
  ],
  "release_date": "2017-02-03",
  "scene_id": 122065,
  "tags": [],
  "title": "First Time 3-Way"
}