{
  "collections": [
    "Active Duty"
  ],
  "description": "Now this one falls under the esteemed category of unbelievable. It's our fresh-faced, fuck machine, Scott, paired up with a sexy recruit we've only seen a couple times before, James Devlin.  So with Scott poised to ease sweet James into the water, Claude leaves the two to strip down and fatten up their dicks. James turns out to be the eager beaver and leans over to suck Scott first.  We all know Scott is a fiend for that cock in his mouth, so he doesn't waste too much time before asking if he can return the favor, and of course, James is happy to let him! Scott knows James isn't quite as experienced as himself, so he uses some very sensuous techniques.  Next, James goes to his feet to let Scott continue the suck party. James gets back on the bed, on his stomach this time, to follow Scott's lead, sucking again, this time putting in everything he's got to please his new pal.  And then it's the moment when James must prove himself a worthy AD recruit. He gets up on the bed and spreads his cheeks for Scott's entry.'Is it a tight hole, alright?' Claude asks Scott. 'Oh yeah!' he answers back as he continues breaking in James virgin ass. I must admit, James does in fact take it like a man. After receiving that cock on his back for a while, James goes to his hands and knees to take more. Here's where Scott really gets into the fun and enjoys stretching James's tender hole. We get some excellent close up shots and finally see an awesome, ecstatic eruption.",
  "models": [
    {
      "name": "James Devlin",
      "person_id": 48435
    },
    {
      "name": "Scott Finn",
      "person_id": 47961
    }
  ],
  "release_date": "2017-01-15",
  "scene_id": 122280,
  "series": "AD - 164 - James Devlin & Scott",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "James Devlin & Scott"
}