{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With his wife away visiting her parents, hubby Quentin Gainz looks to fulfill a deep rooted fantasy that he's kept under wraps for the length of his marriage. Quentin seeks a true boyfriend experience, but he needs to be discreet. Luckily, escort Dalton Briggs specializes in intimate meetings, and is more than equipped to handle the task. He pushes Quentin against the wall as they kiss tenderly, before he works his way down Quentin's body and unzips his pants. Pulling out Quentin's cock, he finds it rock hard in anticipation. Sucking him playfully, Dalton teases Quentin before working his way back up to Quentin's neck. Qunetin throws him onto the bed and returns the favor, pulling Dalton's pants off and downing his cock in one gulp, deep throating him before moving up and sitting on his face. Dalton tongues Quentin's hole as Quentin spreads his cheeks wide, sliding back down to Dalton's midsection as Dalton slaps his cock against Quentin's hole. Quentin begs for Dalton's cock, and Dalton gives it to him raw, filling Quentin up and sating his thirst for dick. Dalton fucks Quentin every which way, finally making Quentin cum as Dalton pounds him missionary before pulling out and blasting Quentin with his load. Slowly, he breeds Quentin's cum soaked hole with his throbbing cock, as Quentin closes his eyes and smiles, content that reality has more than exceeded his fantasy..Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    },
    {
      "name": "Dalton Briggs",
      "person_id": 47222
    }
  ],
  "release_date": "2017-01-25",
  "scene_id": 122286,
  "series": "NDR - 59 - Quentin Gainz & Dalton Briggs",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "The Boyfriend Experience"
}