{
  "collections": [
    "Falcon Studios"
  ],
  "description": "It's been a busy week of recruitment for the members of 'Urban Spokes', an elite club of San Francisco's hottest gay cyclists. Three new recruits arrive for initiation into the club at the hands of intimidating club leaders Trenton Ducati and Ryan Rose. Whoever performs best gets the chip that signifies membership into the club. Stripping off their clothes, Connor Patricks, Rod Peterson, and Griffin Barrows present themselves to the whims of Ryan and Trenton. Rod makes out with Ryan, then lowers himself to the ground to suck Ryan's cock. Griffin and Connor tag team Trenton's hefty cock, taking turns with oral service. Trenton's abs flex as his hips thrust his cock forward. Rod switches with Griffin, and Ryan grabs the back of Griffin's head guiding it deeper and deeper onto Ryan's hard cock. Taking things up a notch, Griffin jumps up on a table, opens his mouth, and swallows Ryan's cock upside down. Trenton spreads Griffin's legs and buries his face in the tight, pink center. As Ryan and Connor suck Griffin's cock, Trenton and Rod take turns rimming Griffin's hole. Ryan sucks both of Griffin's low-hanging balls into his mouth as Rod and Connor press their tongues deep into Griffin's ass. With Griffin's hole totally wet and slick, Trenton thrusts inside with his big, girthy cock. Griffin moans as Trenton's intense pumping stretches his hole wide and deep. Ryan holds Griffin's feet high in the air, pressing his cock and balls against Griffin's face at the same time. When Ryan's ready to take a turn, Griffin gets on his hands and knees, and Ryan unleashes a brutal doggy-style pounding that has Griffin screaming for more! Ryan's big balls slap against Griffin's ass with each powerful thrust. Rolling onto his back, Griffin lifts his legs in the air again for Trenton's pummeling cock. Ryan strokes his cock as he kneels over Griffin's face. Connor is the first to cum, shooting his cum stream across Griffin's torso. Rod busts his nut on Griffin's pecs, and Ryan lets loose with a massive burst that falls across Griffin's lips. With Trenton still inside him, Griffin dumps his hot load onto his stomach. Pulling out, Trenton strokes out a thick load that drenches Griffin's cock and balls. As Griffin lays back, covered with four loads, Trenton throws the chip on his chest: 'Welcome to the fucking club!'",
  "models": [
    {
      "name": "Connor Patricks",
      "person_id": 21604
    },
    {
      "name": "Griffin Barrows",
      "person_id": 48772
    },
    {
      "name": "Rod Peterson",
      "person_id": 48747
    },
    {
      "name": "Ryan Rose",
      "person_id": 27407
    },
    {
      "name": "Trenton Ducati",
      "person_id": 19816
    }
  ],
  "release_date": "2017-02-03",
  "scene_id": 122471,
  "series": "Urban Spokes",
  "tags": [
    "Anal Sex",
    "Bodybuilder",
    "Cumshot",
    "Feet",
    "Group Sex",
    "Hairy",
    "Masturbation",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Urban Spokes, Scene #04"
}