{
  "collections": [
    "Active Duty"
  ],
  "description": "Well who better to break in a fresh recruit than the one and only Ryan Jordan?!  Ryan is back and he's giving a lesson to sweet, inexperienced Tyler Marshall.  We all remember Tyler from his smokin' hot solo and we've convinced him to come back and hook up with another dude for his very first time.  <br></br>Of course, Ryan was quick to strip down to nothin', and offer Tyler some help with his swelling cock.  Tyler accepts and Ryan goes right to town on Tyler's exceptionally large dick.  <br></br>Then Tyler stands up so he can put a little pushin' into the fun, gently fucking Ryan's face.  I think with a little time and the right training, Tyler will be comfortably face fucking fellow recruits with a little more passion and confidence.  Baby steps, Tyler!<br></br>Then Tyler's initiation kicks up to the next level as Ryan accepts Tyler's hulking erection into his tender ass.  Claude gets real tight so we can experience a little bit of what Ryan feels as Tyler pushes in and works up a medium pace, at least to start with.  <br></br>Then Ryan goes to his back to take some more good fucking from this squad rookie.  Now y'all just ain't gon believe the job Tyler does here.  I think that massive dick has something to do with it, but he really gives Ryan a solid banging!  <br></br>And the finish is no let down!  Tyler busts his healthy nut onto Ryan's hole and smears his hot load around.  Then both boys go to a couch where Ryan erupts a nice blast, and Tyler blows off ANOTHER thick, creamy load!  Wow, this was an incredible display from a virgin newbie, and I know we'll be seeing this absolute fuck machine in the near future.",
  "models": [
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    },
    {
      "name": "Tyler Marshall",
      "person_id": 48684
    }
  ],
  "release_date": "2017-01-29",
  "scene_id": 122477,
  "series": "AD - 168 - Ryan Jordan & Tyler Marshall",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Deep Throat",
    "Duo",
    "First Time",
    "Jerk Off",
    "Smooth",
    "Straight",
    "Tattoos"
  ],
  "title": "Ryan Jordan & Tyler Marshall"
}