{
  "collections": [
    "Active Duty"
  ],
  "description": "Now this one's a treat!  It's a bit of a throwback because we've already 'grown' to love him, but this is Dante's first actual encounter with another guy!  He had just cum off his solo and was feeling eager, so we hooked him up with our best and brightest, Quentin Gainz, of course!To everyone's chagrin, Dante was actually first to try suckin' Quentin's cock.  And he went in with a big ol' smile on his cute face.  My goodness, Dante certainly has some natural talent.  Of course we know how much of a cock fiend Quentin is, so it's shouldn't be a surprise that he was excited to get a taste of this newbie's dick.  What a wonderful introduction to the troop.  Well Dante decides he hasn't had enough of a taste of Quentin, so Quentin stands and Dante plants those lips around that stiff shaft again. Then comes the good stuff!  Quentin gets in position on the bed, bent over on all fours, ass in the air in presentation to Dante.  Claude gets low, right underneath the gorgeous action as Dante sticks his firm cock into another guy for the first time. They decide to switch things up a bit, so Quentin goes to his back on the bed and Dante gets right back in there.  I enjoy this because they're able to connect more by looking each other in the face this time.  I really think there's some great chemistry here between these two boys.  Dante even takes the liberty, at one point, of jerking off his new friend while fucking him.  What an ambitious dude!  What a lucky squad we all are to have guys like Dante and Quentin as part of our team.  I'd say look out for Dante in the future, but we already know how that story turns out!  This one was heaps of fun, and sure ended with a couple warm, heaping blasts.",
  "models": [
    {
      "name": "Dante II",
      "person_id": 47835
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2017-02-05",
  "scene_id": 122581,
  "series": "AD - 170 - Quentin Gainz & Dante",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Tattoos"
  ],
  "title": "Quentin Gainz & Dante"
}