{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When his brother fails to get the time off from work, Chris Blades' plans for a weekend in Vegas have just hit a snag. Facing the prospect of having to hang out by himself all weekend, Chris' brother suggests that Chris hit up an old buddy who now happens to live in Vegas. Chris has a past with Bridger Watts, a past that even his brother doesn't know about. When Bridger comes over, the guys share a beer and it's obvious to Bridger that Chris has something on his mind. Bridger tells him not to worry about the past, and asks Chris if he still thinks of the times they used to mess around back in the day. Chris nods his head, and with that, Bridger embraces Chris and the kiss long and hard, as Bridger removes the towel around Chris' waist and exposes his tight body. Throwing him down onto the bed, Bridger rekindles old memories when he begins to suck Chris off, and after Chris returns the favor, he mounts Bridger's cock, spreading his legs wide as he grinds away. Bridger strokes Chris' as he thrusts into him, before flipping him over and pounding him from behind. Chris takes the dick just like he used to, and it's just as nice as Bridger remembers. Chris' cock is rock hard as Bridger fucks him missionary, spitting his load all over his chest as Bridger pulls out and unleashes a load many years overdue. As they lay there, cum covered and reunited, Chris realizes there's more than one way to have a debaucherous weekend in the desert, confident that what happens here, stays here. Enjoy!",
  "models": [
    {
      "name": "Bridger Watts",
      "person_id": 38083
    },
    {
      "name": "Chris Blades",
      "person_id": 48683
    }
  ],
  "release_date": "2017-02-08",
  "scene_id": 122580,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Brother's Best Friend"
}