{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "The night shift at the old theatre downtown can be a creepy time to work.  Osiris Blade is on duty tonight.  While shooing away mice and telling local riffraff to 'beat it!' sometimes Osiris hears mysterious creaks and footsteps.  Tonight, he knows there's someone there.  He can feel someone...or something, watching from the shadows of the ornately adorned interior of the historic building.  Osiris waits in the dark to catch a glimpse of the phantom.  Just at the right time, Osiris flicks on a stage light, illuminating the mysterious presence.  It's a scantily clad young man named Leo Brooks.  Leo wears only a black, shear cape, a pair of red underwear, and a mask over his eye area.  'AHA!' Osiris exclaims as Leo spins around to face him.  'Now show me what you've got,' Osiris demands.  Leo, knowing he's been caught with no escape, decides to indulge the theatre caretaker...with dance.  Somehow, from behind the stage, a hypnotic dance track starts up.  Neither Leo nor Osiris knows who is playing the music.  Leo gyrates his body to the beat.  As the rhythm obscures his senses, Osiris approaches the phantom on the stage.  They come together and kiss.  Osiris drops to his knees, pulls out Leo's cock and sucks it with desperate passion.  They remove their costumes and Leo returns the favor, slurping down Osiris's erect dong.  Neither can believe the intensity of his own desire, in the moment, for wild indiscretion.  Osiris gets behind Leo and puts his face in Leo's ass, licking the tight, eager hole.  He reaches up from underneath and strokes Leo's firm dick.  When the moment is right, Leo stands up and bends Osiris over to slide his hard cock into the night watchman's plump rear end.  He pounds and pounds, ramming Osiris with his throbbing meat.  Join these two strangers, meeting in the night, as they experience one another right on the stage of the old theatre.  None can resist the PHANTOM OF ALLURE!",
  "models": [
    {
      "name": "Leo Brooks",
      "person_id": 48622
    },
    {
      "name": "Osiris Blade",
      "person_id": 37349
    }
  ],
  "release_date": "2017-02-14",
  "scene_id": 122579,
  "series": "NDE - 243 - Leo Brooks & Osiris Blade",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Black",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Phantom Of Allure"
}