{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Jake Davis knocked on his neighbor's door, he never thought he'd soon be analyzing the construct of his marriage, but when Gabriel Cross enlightens him to the concept of an open relationship, Jake is immediately intrigued, concluding that ultimately his wife would find out. Gabriel smiles and tells him his secret is safe, and without much more convincing, he's going down on his straight, married guy from next door. Jake can't believe how good Gabriel is at giving head, remarking that he puts much more effort into it than his wife. Gabriel smiles again, realizing he's about to introduce Jake to a whole new world of sexual expression. He bends over his bar stool and props his ass into the air, instructing Jake to dive in face first. Jake tongue fucks his hole as he strokes his hard cock, standing up and plunging it raw into Gabriel. He fucks Gabriel long and hard from behind before ceding control to Gabriel and letting him take a ride. Gabriel bounces on Jake's hard cock til he's content, then flips over onto his back and tells Jake to blow his load. Jake cums all over Gabriel's taint, dipping his throbbing head in the jizzy mess before seeding Gabriel's hole with his cum covered cock. Jake continues to pound away, fucking the cum out of Gabriel as he spits his load all over his chest. Jake kisses Gabriel and promises to return the borrowed sugar as soon as he can steal away again. Enjoy!",
  "models": [
    {
      "name": "Gabriel Cross",
      "person_id": 32093
    },
    {
      "name": "Jake Davis",
      "person_id": 47743
    }
  ],
  "release_date": "2017-02-22",
  "scene_id": 122645,
  "series": "NDR - 63 - Jake Davis & Gabriel Cross",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Straight Sugar"
}