{
  "collections": [
    "Raging Stallion"
  ],
  "description": "With cameras pointing at them from every direction, three muscled men make out and grope each other's naked bodies. On the left, Bruce Beckham displays his massive chest. Scruffy stud Mick Stallone sits in the middle, and Jason Vario is on the right. Mick gets down on his knees to suck Jason's cock. Bruce stands up, and his massive cock swings through the air like a baseball bat. Bruce and Mick take turns deepthroating Jason's hard, uncut cock. Wet spit accumulates on Jason's shaft. Standing up, Bruce rams his jawbreaking cock down Jason's throat. Mick continues to stuff his face with Jason's meat. Jason falls backwards on the bed, and Mick sits on his face. As Jason rims Mick's ass, Bruce uses his mouth to work Jason's dick. Returning the oral favor, Jason gags himself on Bruce's cock as Mick shoves his tongue inside Bruce's hole. Spreading Bruce's ass apart, Mick blows spit right into the center of Bruce's pink asshole and spreads it around with his tongue. Switching it up, Mick braces himself against the bed and takes Bruce's cock doggystyle. Jason moves behind Bruce and fucks him while standing. Bruce thrusts back and forth from the middle of the fuck-sandwich, turning up the heat. The three-way connection shared by these horny men amplifies the intensity of their deep, vigorous fucking. Mick is eager to have Jason's cock in his ass too, and Jason is happy to give Mick what he wants. With Jason's cock stretching out Mick's ass, Bruce stuffs his cock down Mick's throat. Bruce's hand presses down on the back of Mick's neck, guiding his mouth down on the shaft of Bruce's cock. Switching sides again, Bruce pushes his huge dick into Mick's ass while Mick wraps his lips around Jason's cock. With Mick's ass stretched to the limit, he reclines in a chair and strokes his cock, watching as Bruce makes out with Jason. Jason beats out a thick, white load onto Bruce's muscular ass. Bruce unleashes his hot cum on Jason's chest. Mick lets loose with a gusher of cum across his hairy, washboard abs. ",
  "models": [
    {
      "name": "Bruce Beckham",
      "person_id": 47967
    },
    {
      "name": "Jason Vario",
      "person_id": 48591
    },
    {
      "name": "Mick Stallone",
      "person_id": 48927
    }
  ],
  "release_date": "2017-02-03",
  "scene_id": 122683,
  "series": "Object of Desire",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Oral",
    "Tattoos",
    "masturbation",
    "rimming"
  ],
  "title": "Object of Desire"
}