{
  "collections": [
    "Active Duty"
  ],
  "description": "Hey Troops,Here we go with another fresh, fine-lookin' recruit!  Kevin Reed is here to strip down and show us what he's got.  Claude is getting to know Kevin a little better before he starts havin' fun.  Kevin certainly seems a bit nervous, but I can't blame him.  This is Kevin's very first time being nude on camera, and of course his first time jerking his hard meat for an audience.  We've seen reluctant rookies before, and when it's all over, they're always quite a bit more loosened up.  Once Claude gives the green light, Kevin takes his time squeezing his dick underneath his blue jeans.  He wants to be sure the first time we see it, it's fully flared!  And my goodness!  When Kevin does give us the big reveal, my mouth was watering!  Kevin has just a gorgeous cock.  It's big, it's in excellent proportion, and I love its fair complexion.  And boy does it stand at attention!I really enjoy Kevin's skin all over, in fact.  He has a nice, lean chest, the perfect amount of hair, and sweet, sexy nipples.  As Kevin tugs his beautiful boner, he reclines on the couch and Claude moves around him to give us a great look at this wonderful specimen.  After a little while, Kevin stands up and Claude gets low and tight to show us Kevin's balls and ass.  Kevin is so well put together.  I love seeing his taint and the delicate hair that covers his delicious areas.  Then we get a view from Kevin's perspective, looking down on his strong, masculine hands as they work that stiffy.  Kevin goes back to the couch, but this time puts his feet all the way up so we can enjoy them AND his sweet ass all at once.  While he cranks his meat, Kevin's free hand flirts with his hungry hole.  Well at least I'd assume it's hungry.  I can usually tell when a new recruit is already looking forward to mixing things up with fellow troop members and I have a feeling Kevin will be jumping at the first opportunity to have his ass filled with a fat cock much like his own.  Kevin stands up again and this time Claude moves around to the backside and we see Kevin's ass clinching and working as he strokes his erection for us.  Then it's back to the couch where Kevin works up to a nice, relieving blast.  Ah yes, the thrill of accomplishment never feels as good.  Kevin is a great guy and I think we'll have tons of fun watching him grow and explore here with us.",
  "models": [
    {
      "name": "Kevin Reed",
      "person_id": 48937
    }
  ],
  "release_date": "2017-02-08",
  "scene_id": 122700,
  "series": "AD - 171 - Kevin Reed",
  "tags": [
    "Blonde",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Kevin Reed"
}