{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Park is in the shower enjoying the hot water as he rubs his body down with soap but what he does not know is that Jack is outside in the hallway breaking into his room. Jack slowly opens the door and creeps inside while Park is still showering. Park can't hear a thing as Jack is roaming around his room until by accident, Jack makes a noise. Park dries off and creeps up to his bathroom door and he can see Jack going through his wallet. Park rushes him and throws him onto the bed as he jumps on top of him so he cannot escape. Park is pissed and tells him that as payment his young ass and mouth is now his. Park and Hunter love to role play and they've both wanted to do this scenario for quite some time now. The excitement from the role play builds up as the make out and Jack starts blowing Park. He licks his shaft and balls stroking it ever so lightly as he pleases every inch of Park. Park bends Jack over to reveal his sexy smooth ass as he buries his face between them sexy butt cheeks. He tugs on Jack's big cock from behind milking him ever so slowly until finally Park is ready to fuck that ass. Park fucks him deep and hard showing the young buck who is boss. Park decides it's time for him to be fucked so he pulls out of Jack and starts to suck on his big thick cock getting it ready for his tight hole. Jack is well fucking hung with low hanging balls that swing like a pendulum. Jack is nice and hard ready to push his big dick into Park. Jack fucks Park deep and hard from behind then he lets him ride his monster shaft. The thickness is spreading Park's hole wide but the pleasure is too good to stop now. They both lay on their backs stroking their cocks to see who is going to bust first and Park lets his load out all over himself. Jack loves the sight of cum and nuts all over Park's face and rubs his cum all over him making sure he eats every last bit of it. Enjoy!",
  "models": [
    {
      "name": "Park Wiley",
      "person_id": 27892
    },
    {
      "name": "Jack Hunter",
      "person_id": 48990
    }
  ],
  "release_date": "2017-03-06",
  "scene_id": 122790,
  "series": "DL - 39 - Jack Hunter & Park Wiley",
  "tags": [],
  "title": "Thief Of Hearts"
}