{
  "collections": [
    "Hot House"
  ],
  "description": "A white towel barely covers Austin Wolf's throbbing manhood as he stretches out in the sauna. His hairy, muscled body is on full display as cut, lean hunk Scott Riley sits down on the bench across the room. Sensing Scott's presence, Austin's hand grazes past his nipples on their way down to his crotch, adjusting his boner underneath the towel. Scott begins playing with his cock as Austin's towel falls off completely and his thick cock swings through the air. Standing up, Austin gives Scott a full-on look before wrapping himself in a towel and heading to the communal shower. Austin stands under the warm running water and strokes himself as Scott rounds the corner. Scott and Austin's boners are both at full attention as they stand across from each other, flexing their muscles. Turning around, Scott shows off his ass to Austin, who gazes at Scott's round, firm butt with anticipation. Reaching over, Austin grabs Scott by the balls and pulls him close. Standing together under the water, they finally kiss. Scott tongues at Austin's nipples, and Austin uses his fingers to probe Austin's ass. Sinking to his knees, Scott opens his jaws and inhales Austin's massive man meat. Austin grabs his nipples to enhance his pleasure as he throat-fucks Scott's handsome, scruffy face. Bending over a changing bench, Scott spreads his cheeks for Austin to explore with his tongue. With Scott's ass lubed up, Austin uses his thumb to probe Scott's hole, then slides his thick cock in. To fully dominate Scott, Austin positions him with his face on the floor and his ass in the air for a pile-driving fuck. Moving back to the bench, Scott lays on his back and jerks out a thick, white load. Austin strokes himself until he shoots his wad in Scott's mouth.",
  "models": [
    {
      "name": "Austin Wolf",
      "person_id": 37357
    },
    {
      "name": "Scott Riley",
      "person_id": 37829
    }
  ],
  "release_date": "2017-02-09",
  "scene_id": 122799,
  "series": "Bathhouse Ballers",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder",
    "Kissing",
    "Masturbation"
  ],
  "title": "Bathhouse Ballers, Scene #02"
}