{
  "collections": [
    "Active Duty"
  ],
  "description": "Oh boy, this is an absolute gem!  We have veteran Princeton Price paired up with two fresh rookie recruits, Phillip Fox and Diego.  This one is incredibly hot.<br/><br/>When Claude lets these three get down to business, Princeton doesn't hesitate to plant his luscious lips on Diego's hard cock and allow Phillip to suck his stiff dong.  <br/><br/>I love watching Diego receive pleasure here.  He really wears his heart on his sleeve.  It turns on Princeton so much, the two become extremely intimate with a long, hot kiss while Phillip continues to service Princeton.  <br/><br/>The guys get into an amazing three-way suck formation, where each soldier hits a nice stride, taking each other's erection deep down their throats.  Eventually Princeton, the insatiable boy he is, switches gears to feasting on Phillip's tight, enticing ass.  <br/><br/>When it's good 'n' ready, Princeton slides his stiff cock into Phillip's sweet ass and works up a nice rhythm.  Wow, Phillip's ass not only looks incredible getting pounded by strong Princeton, Phillip is a trooper!  <br/><br/>Then the guys switch things up a bit, as Princeton sucks Diego's cock and Phillip continues to take Princeton's stiffy in his ass.  Claude does a great job of showing us just how smoking hot this is!  <br/><br/>Then Phillip goes to his back to allow Princeton to keep fucking him while Princeton and Diego get into some more making out.  Princeton goes from fucking and French kissing to sharing Diego's cock with Phillip WHILE he continues to drill Phillip's tight ass!  <br/><br/>Diego decides it's his turn to fuck Phillip's hole, so gets on his back.  Phillip mounts him and carefully lets Diego's hard dick slide up into him.  Princeton gives support to both guys with encouraging kisses.  Once Phillip gets accustomed to Diego's large cock, they're off and running.  <br/><br/>Then Phillip goes to his back again so Diego can pound him out properly.  This one ends in a terrific fashion, with Phillip getting covered with warm, sticky loads. ",
  "models": [
    {
      "name": "Diego II",
      "person_id": 49082
    },
    {
      "name": "Phillip Fox",
      "person_id": 48688
    },
    {
      "name": "Princeton Price",
      "person_id": 46796
    }
  ],
  "release_date": "2017-02-12",
  "scene_id": 122985,
  "series": "AD - 172 - Princeton Price, Phillip Fox & Diego",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Kissing",
    "Muscular",
    "Tattoos",
    "Threesome"
  ],
  "title": "Princeton Price, Phillip Fox & Diego"
}