{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Jacob Peterson walks alone towards the bachelor party bus he took to the club with his buddies. The driver, Alex Mecum, lets him in and asks, 'Where are the guys?' 'They're out having fun,' Jacob replies, clearly feeling left out. Alex joins Jacob in the back of the bus to keep him company, and Jacob shows Alex some pics he took on his phone, including one of Jacob's buddy Ryan Rose getting his dick sucked in the club! When Alex hands Jacob's phone back to him, he leans in for a kiss, and Jacob reciprocates by grabbing Alex's bulge. Opening his fly, Alex pulls out his huge, thick, throbbing erection, and Jacob uses his tongue to provide expert oral service. As they strip down inside the party bus, Alex reveals his ripped body and furry chest; Jacob shows off his smooth swimmer's bod. Wrapping his lips around Jacob's uncut meat, Alex eagerly swallows every inch of it. After getting his dick sucked, Jacob turns around and gives Alex the chance to taste his sweet hole. Rising to his feet, Alex uses the tip of his cock to tease Jacob's tight hole, then presses in until his cock is balls deep. After pounding Jacob's ass doggy style, they move to a seated position with Alex on the bench and Jacob riding him. Alex picks up speed, stretching Jacob's hole with every thrust. Putting Jacob on his back, Alex grinds his dick into Jacob's sweet spot. Grabbing his cock, Jacob strokes until hot, white cum overflows from his foreskin. Alex jerks out a massive load, shooting multiple ropes through the air and drenching Jacob's chest and cock with spunk. ",
  "models": [
    {
      "name": "Alex Mecum",
      "person_id": 46654
    },
    {
      "name": "Jacob Peterson",
      "person_id": 37703
    }
  ],
  "release_date": "2017-03-15",
  "scene_id": 122937,
  "series": "About Last Night",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "About Last Night"
}