{
  "collections": [
    "Falcon Studios"
  ],
  "description": "At the gay bar near their Russian River vacation house, JJ Knight and Josh Conners are gossiping about their friends' hookups. So far JJ hasn't gotten any action during the weekend, but as Wesley reminds him, 'The night's still young!' After taking a piss, JJ exits the bathroom and finds Josh Conners cruising the hallway. They lock eyes and retreat to a dark corner, where Josh slips off JJ's shorts and inhales his massive boner. Eager to explore Josh's ass, JJ bends him over, spreads his cheeks, and dives face-first into Josh's eager hole. After an intense tongue-fucking session, JJ stands up and thrusts his massive cock in doggy style, using a bit of spit for lube. Josh's sexy bubble butt ripples with every impact of JJ's energetic fucking. Flipping over to missionary position, Josh jerks his cock as JJ pounds relentlessly. As they approach orgasm, Josh kneels on the floor, making himself the target for JJ's load. With massive spurts, JJ launches his cum and coats Josh's neck with drippy semen. The epic cumshot sends Josh over the edge, and he splashes his load onto the floor of the bar. After trading their final kisses, JJ makes his way back to hang out with his friends. 'You smell like sex!' exclaims Wesley boozily. JJ notices his cousin, Brute, hanging off of Ryan Rose, who was JJ's best friend and roommate in college. JJ asks Wesley, 'What's up with them?' 'While we were resting earlier, they fucked!' slurs Wesley. 'Can you believe that?' JJ doesn't take the news well; he slams his bottle down and storms out, leaving his best friends stranded at the bar!",
  "models": [
    {
      "name": "JJ Knight",
      "person_id": 47462
    },
    {
      "name": "Josh Conners",
      "person_id": 35706
    }
  ],
  "release_date": "2017-02-15",
  "scene_id": 122928,
  "series": "Wild Weekend Part 1",
  "tags": [
    "Anal",
    "Big Dick",
    "Bodybuilder",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "Wild Weekend Part 1"
}