{
  "collections": [
    "Hot House"
  ],
  "description": "Jimmy Durano should have finished painting the office already, but he's barely halfway done. Jimmy's boss, Ace Era, is furious with him, but Jimmy doesn't give a fuck: he shows Ace what he thinks of him by rolling a giant stripe of paint across Ace's expensive dress shirt and tie. Ace is so mad he tries to fight Jimmy, but Jimmy has the upper hand because he knows how to subdue his blustering boss. Grabbing the back of Ace's head, Jimmy pushes Ace's face into his crotch. Whipping out his dick, Jimmy slaps it across Ace's lips, and since Ace is such an eager cock whore, he can't resist opening his mouth and allowing Jimmy's meat down his throat. Jimmy strips off his shirt, revealing his perfectly smooth torso and bulging muscles. Ace bends over a desk and Jimmy eats his ass. Paint splatters across ace's face and arms as their rampant connection gets more and more intense. Jimmy strokes his hard, uncut cock as he presses his face into Ace's ass. After teasing Ace with the tip of his cock, Jimmy thrusts his thick meat inside Ace's hole. He pounds Ace with vigorous, slamming pumps, and the tattoo that says 'FUCK ME' across Ace's ass bounces with the force of the impact. Turning over, Ace throws his right leg over Jimmy's shoulder and gets totally drilled by Jimmy's cock. The intense pressure makes Ace spill his seed, shooting it across his muscular torso. Getting down on his knees, Ace opens his mouth as Jimmy blows his load; cum spills everywhere. When Jimmy stands and heads toward the door, Ace asks, 'Where are you going?' 'You fucking finish the job,' says Jimmy, as he slams the used condom against the sticky paint on the wall. ",
  "models": [
    {
      "name": "Ace Era",
      "person_id": 50187
    },
    {
      "name": "Jimmy Durano",
      "person_id": 17864
    }
  ],
  "release_date": "2017-03-02",
  "scene_id": 122946,
  "series": "Dirty Work",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder",
    "Daddy",
    "Hairy"
  ],
  "title": "Dirty Work"
}