{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Beau is an art enthusiast and he's always looking out for exotic ground breaking pieces. Beau is the last one to leave the art exhibit as he engulfs himself with all the erotic dildos and pictures of beautiful naked men on the walls. Trent is closing up the shop when he sees that Beau is still admiring his work. Trent asks him if he has any questions about his work before he closes up. Beau is only curious if Trent is working on any new masterpieces. Lucky for Beau Trent is working on his best one yet as he pulls down his pants to reveal the work of art. Beau can't believe the life size artistic value that lies before him. He drops to his knees and begins servicing Trent's massive uncut cock. The thick throbbing masterpiece fills Beaus mouth up with each lick and suck. They take the action into the back room where Beau continues to blow Trent. Trent bends him over to rim his big smooth ass getting it ready for his monster cock. Trent tells Beau to prepare as he slowly pushes his uncut dick into that tight smooth ass. Beau can feel every inch pulsating as his ass clinches all around Trent's sexy dick. Trent uses his masterpiece in many positions fucking Beau until he explodes like a fountain all over himself. That load doesn't stop there as the two begin to jerkoff together and Beau blows another load which this time makes Trent shoot his load into Beaus awaiting mouth.    Enjoy!",
  "models": [
    {
      "name": "Beau Reed",
      "person_id": 49034
    },
    {
      "name": "Trent King",
      "person_id": 47859
    }
  ],
  "release_date": "2017-03-14",
  "scene_id": 123080,
  "series": "E245 - Trent King & Beau Reed",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Black",
    "Brunette",
    "Condom",
    "Cum swallow",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Masturbation",
    "Oral",
    "Uncut cock"
  ],
  "title": "The Masterpiece"
}