{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Faced with the sudden prospect of being cut off by his parents, Chase Klein wonders what he'll do for money and a place to live. Luckily, Markie More is here to help, but unfortunately for Chase, Markie's helpful ideas aren't really very comforting. After finding a promising lead for a modeling gig, Markie and Chase's hopes are dashed when they discover the job is for gay modeling. Chase assumes they're back to square one but Markie thinks the two of them can swing it, especially considering the rate of pay. Markie convinces Chase it's all a state of mind, and to prove it, he bets he can get Chase hard without even touching his dick. Skeptical, Chase obliges and Markie begins to gently caress his friend's chest, working his way down Chase's stomach before removing his towel and exposing Chase's hard cock. Chase is surprised that Markie was right, and decides he needs to carry out the act to the end to make sure he can do the job, so Markie continues to push, sucking Chase's cock before bending him over to break in his virgin ass. Chase asks him to take it slowly, but midway through discovers that he actually enjoys Markie's pounding, as he strokes himself off while Markie continues to fuck him from behind. He rolls over onto his back and works his load up before spitting it all over himself as Markie pulls out and soaks him with his nut. Laying there cum covered, both guys agree that they're ready to go make some of that sweet porn cash.  Enjoy!",
  "models": [
    {
      "name": "Chase Klein",
      "person_id": 48553
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2017-03-10",
  "scene_id": 123040,
  "series": "NDO - 4750 - Markie More & Chase Klein",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Gay Together"
}