{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Dalton's grandma is headed to a friend's for the day so he thinks. He finishes up his sandwich and heads into his room to beat off to some porn. Dakota the neighborhood brat is creeping around Dalton's house seeing if he is home. Dalton can't hear the knock at the door as he lies comfortably in his bed stroking his cock. Dakota heads around back to see if anyone is inside the house but he still can't find anyone. Dalton notices he has a message waiting from him on his Grinder account but there is no picture with the profile so he puts his phone down and jumps into the shower to finish beating off. Dakota notices the side door to the garage is open so he walks inside and into the house where he finishes a sandwich left from Dalton. Dakota makes his way to Dalton's bedroom and sees that he is in the shower. He creeps up next to the door and can see Dalton playing with himself so he unzips his pants and pulls out his cock to stroke to Dakotas sexy body. Dalton has new clue he is being watched and is quite enjoying himself and he rubs himself down while stroking his hard dick. Dakota decides to get naked and prop himself on the bed bent over and ass up waiting for Dalton to get out. Dalton gets out of the shower and is stunned to see Dalton butt ass naked on his bed. He's not sure how he got in nor why but Dakota tells him that it was him on Grinder. Dalton more relaxed now jumps on this opportunity to breed his smooth sexy ass. Dalton buries his face between Dakota's sweet ass licking and tongue fucking him. They jump into a hot sexy 69 slurping up and down licking balls and cock. Dakota wants that raw cock deep in his ass and Dalton gives it to him deep and hard.  Dalton man handles Dakota and fucks that sweet ass until Dakota explodes like a fountain while being fucked. Dalton flips him over onto his back and finishes himself off by breeding his ass and letting loose of every drop of his warm cum deep inside. Just as they are relaxed Dalton's grandma comes bursting in the door and can't believe her poor old eyes.",
  "models": [
    {
      "name": "Dakota Young",
      "person_id": 48374
    },
    {
      "name": "Dalton Riley",
      "person_id": 48651
    }
  ],
  "release_date": "2017-03-08",
  "scene_id": 123144,
  "series": "NDR - 65 - Dalton Riley & Dakota Young",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Brunette",
    "Creampie",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "Hardcore",
    "Masturbation",
    "Muscular",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "The Neighborhood Brat"
}