{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Ty Thomas is an innocent young man who finds himself desperately seeking another man's touch. While searching through online personals and postings, Ty stumbles across what seems to be one of the sweetest posts. The title of a posting by a bubble-butt bottom in search of roses grabs Ty's attention, he can't help but find that to be super cute and immediately heads to the store to grab a dozen. This day couldn't be off to a better start and he already has his bubble butt bottom and he is a romantic as well! Roses in hand, Ty roams the park in search of his Juliet. Rather unsure of why the guy wanted to meet in a park, he settles with the guy must be discreet and doesn't want his roommates to know. After realizing he is pretty much the only person in the park, he begins to give up hope... perhaps it was a fake post, he has encountered his fair share of those through this site. At that moment, he notices a young man who is very attractive sitting on a park bench who seems to be waiting for something or someone. Ty nervously approaches this young man, Justin Owen, and inquires if he is the one who asked for roses. Justin confused looks at the roses and then Ty only to reject him and say he has the wrong guy. As Ty walks away apologetic, Justin begins to soften to the fact that Ty is so innocent and obviously doesn't know what 'roses' mean in this particular situation. He finds Ty very attractive and although Justin is in a bit of a financial bind, he can't help but fall for the hopeless romantic to had the balls to show up a the park with a dozen roses for a stranger. Quickly, Justin stops Ty and explains his position and let's Ty know, he is interested roses or not. Returning to Ty's place, the story quickly turns from romance to heated passion as we encounter the two in an intense fuck session that reveals the pent up passion and need for one another. Deep tongue action, oral and wet ass eating leads Ty to power fucking Justin's warm hole to the point of mutually exploding as they release themselves to one another. Who says roses don't get you what you really want?Enjoy!",
  "models": [
    {
      "name": "Justin Owen",
      "person_id": 26592
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2017-03-17",
  "scene_id": 123145,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim"
  ],
  "title": "Ro$e$"
}