{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When the going gets tough, Dante Martin takes a break. Chris Blades is Dante's private trainer, and he's starting to get tired of Dante's excuses. Today, Chris has taken Dante out for a morning run. After a few minutes, Dante sits on a bench and says he needs a break.<br/><br/>   It's a good thing Chris found a way to still motivate Dante to get a good workout. You see, Dante is a horny guy who simply can't turn down an opportunity for hot sex. When Dante subtly hints at doing another exercise for cardio, Chris knows exactly what to do.<br/><br/>   They jog back to Dante's place where Chris wastes no time getting down to some passionate kissing with his client. Dante sucks and licks Chris's hard nipples, enjoying the salty taste of Chris's skin. They pull each other's clothes off and Chris takes Dante's stiff cock in his mouth, allowing Dante to thrust in and out.<br/><br/>   Then Chris lays on his back and Dante services his throbbing erection, being sure to thoroughly work that firm erection. Dante knows Chris is a stickler for proper form when doing cardio.<br/><br/> Then the guys get into a 69 position and Chris buries his face in Dante's ass, licking his tight hole. Dante continues sucking Chris's large cock.<br/><br/>   Next is the most strenuous part of the routine: fucking Chris's sweet ass. Dante squeezes his hard dick into that tender hole and works up a great pace, drilling his trainer and getting a nice burn. Dante stands up on the bed after a while, pile driving Chris's hungry hole for even more intense reps. Dante can tell by Chris's reaction that he's knocking today's workout out the park.<br/><br/> Finally, Dante goes to his knees to bring the cardio level to a climax. Watch this previously unmotivated client turn into a cardio animal as he finds the perfect workout, of which even his sexy trainer approves.<br/><br/> Enjoy!",
  "models": [
    {
      "name": "Chris Blades",
      "person_id": 48683
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    }
  ],
  "release_date": "2017-03-22",
  "scene_id": 123283,
  "series": "NDR - 67 - Chris Blades & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Cumswapping",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Real Cardio"
}