{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Leatherman barber Rikk York is working on a 'High n' Tight' cut for his client, Mick Stallone. They make conversation about where to go out and what the local guys are like. Rikk's assistant, Jackson Grant, overhears the conversation and shares a knowing glance with Mick through the mirror. Jackson pulls up his shirt and starts stroking his cock. 'Again?' Rikk says. Pulling back the barber smock, reveals that Mick has already started stroking himself. Jackson comes over and goes down on Mick's hard cock. Joining in, Rikk thrusts his hard cock down Mick's throat. Jackson makes out with Rikk as Mick switches to sucking Jackson's cock. Jackson stands as Rikk and Mick both kneel and suck on his meat, lick his balls, and make out with each other. Rikk gets on the barber's chair so Mick can rim Rikk's hairy ass. It's time for the boss to get what he wants: Jackson fucks Rikk's face while Mick stands up and plows Rikk's hairy hole with his hard cock. Switching out the chair for a bench, Rikk lays down and has Jackson sit on his cock. Mick watches while feeding Rikk his cock. Straddling Rikk's face, Mick makes out with Jackson as Rikk continues thrusting his cock up into Jackson's tight hole. Rikk spreads Mick's asshole and shoves his tongue between Mick's cheeks. Jackson and Mick blow their loads at the same time, shooting their hot, white cum onto Rikk's hairy abs. Mick makes out with Rikk as Rikk strokes himself and lets loose with his own stream of sticky jizz.",
  "models": [
    {
      "name": "Jackson Grant",
      "person_id": 49061
    },
    {
      "name": "Mick Stallone",
      "person_id": 48927
    },
    {
      "name": "Rikk York",
      "person_id": 47778
    }
  ],
  "release_date": "2017-02-24",
  "scene_id": 123236,
  "series": "High n' Tight",
  "tags": [
    "Anal",
    "Big Dick",
    "Hairy",
    "Oral",
    "Tattoos",
    "cum shots",
    "international",
    "masturbation",
    "rimming"
  ],
  "title": "High n' Tight, Scene #01"
}