{
  "collections": [
    "Active Duty"
  ],
  "description": "This time we have 2 of our favorite veterans hooking up for the first time. And when I say 'for the first time,' I really mean it in Craig Cameron's case! Yes, this is a little bit of a rewind to Craig's VERY first time hooking up with another dude! At this point, Craig had only jerked his cock for us. Craig is lucky here to get matched up with our unofficial squad captain, Quentin Gainz.After they take their clothes off, Quentin asks Craig, 'you wanna try and suck this dick?' You can just see that doe-eyed look on Craig's face as he says, 'yeah, sure.' What a sweet introduction to having firm meat in his mouth. Craig gets on all fours and sucks down on Quentin's swollen cock.  After getting a nice taste, Craig takes a break so he can watch Quentin's example. Quentin lays on his side and services Craig for a while, playing with his own dick while he sucks. Once Craig gets a good look at how it's done properly, he jumps back into the cockpit and stuffs Quentin's hard cock in his mouth again.  The guys let their guards down a little more and the two get into a 69 position. What a trooper Craig is here!  After their hot 69 session, Quentin climbs atop Craig's eager erection and starts bouncing, slow at first.  Craig stands up and uses his strength to slam Quentin's ass.  Gosh, this is quite an amazing show of power for a newer recruit.  Quentin switches to his back for a while so he can watch Craig continue to bang his tight hole.  Then it's Quentin's time to take Craig's ass virginity. Claude gets low to give us a great look at that cock sliding carefully into that untouched hole.  Then finally, Craig turns around to get a lesson in being fucked doggystyle. With a little coaching from both Quentin and Claude, Craig learns to stick his ass upward. This little blast from the past is a fun look back at one of our troop favorites, getting introduced to how things go here at AD. I know everyone's gonna enjoy this sexy, fun romp.",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Craig Cameron",
      "person_id": 48022
    }
  ],
  "release_date": "2017-02-26",
  "scene_id": 123340,
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Jerk Off",
    "Kissing",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Craig Cameron & Quentin Gainz"
}