{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Michael and Allen are trying to figure out the issue with the vans engine. Allen is teaching Michael everything he knows about cars and he's slowly catching on. Allen tells Michael what he wants done by the time he gets back from lunch and Michael tells him no problem. Soon after Allen heads out for lunch Michael decides to jump in the back seat of the van and starts to watch some porn on his mobile. He pulls his dick out stroking it slowly but keeping an eye out for his boss as well. Allen comes back into the garage and notices Michael beating off so he peaks in on him from the outside of the van. Allen likes what he sees and starts rubbing his own cock. Michael is too involved with pulling on his fat cock that he doesn't see Allen until he is right in front of him. Michael begins to apologize for his misconduct but Allen instead gives him a helping hand. The boss is calling the shots now. He tells Michael to lean back as he starts to suck on his throbbing cock. Allen loves how full his mouth is as he strokes and sucks on his dick. They get outside the van where Michael gets down on his knees to service his eager boss. Allen turns around and grabs Michaels face to bury it between his ass cheeks. Michael tongues Allen's ass prepping it for his thick dick. Before you know it Michael is fucking his bosses ass up against the van and inside of it until he fucks the cum right out of him. Michael then breeds Allen's ass with a hot load of jizz. Enjoy!",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 47889
    },
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    }
  ],
  "release_date": "2017-03-15",
  "scene_id": 123341,
  "series": "NDR - 66 - Michael Del Ray & Allen Lucas",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Workers"
  ],
  "title": "Fully Charged"
}