{
  "collections": [
    "Active Duty"
  ],
  "description": "Oh boy, these two recruits are a couple of my recent favorites.  It's Princeton Price along with Scott, a matchup I can't believe we're having for the first time.  Princeton makes the first move, leaning over and taking Scott's hard dick into his mouth.  I love Scott's big, thick cock.  Claude gets close up to show us how sexy Princeton looks as he services that throbbing erection.  After a little while on the bed, the guys stand up so Princeton can continue to slurp Scott's hard dick, and jerk his own dong at the same time.  The guys move back to the bed, where Princeton goes to his knees while Scott gets a taste of some nice cock for himself.  As Scott enjoys Princeton's stiffy, Princeton bends forward, playing with Scott's tight hole.  Then Princeton spreads those incredible cheeks and licks Scott's tight, tender hole.  Princeton makes sure to tug Scott's cock a bit while he rims.  Oh what a beautiful ass on that boy!  Princeton really gets in there, licking from every possible angle.  Now at this point you might think Scott would be taking Princeton's dick into his ass.  Not this time, it's Princeton's who's getting stuffed full of Scott's big, throbbing boner.  My goodness, this gets hot!  We've seen a lot of progress from Scott and I think mostly in the area of pounding ass.  This here is a testament to how far he's come with us.  Just watch the power Scott has as he slams Princeton's ass and jerks his dick at the same time.  I just have to hand it to these boys; they've both come a long way.  It's been a joy to watch their progress and know that they're heading in the right direction.  The payoff, this time, for their hard work is blasting their loads and feeling that satisfaction.  ",
  "models": [
    {
      "name": "Princeton Price",
      "person_id": 46796
    },
    {
      "name": "Scott Finn",
      "person_id": 47961
    }
  ],
  "release_date": "2017-03-05",
  "scene_id": 123397,
  "series": "AD - 178 - Princeton Price & Scott",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Muscular",
    "Rimming",
    "Smooth"
  ],
  "title": "Princeton Price & Scott"
}