{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Kyler is the local towel boy at his gym where he works the typical 9-5 job. The main reason Kyler works at this job is because he has an insatiable jock fetish among other things. He loves to clean up after all the hunks have left and smell any jock straps, underwear and even shower towels that have been left behind. As he is cleaning up he finds a very sexy black and red jock strap which he just can't ignore. He rubs it all over his face taking in deep breaths of the lovely smell coming off of them. He begins to pull his hard cock out stroking it and decides to wrap the jock around his shaft to use it to stroke with. He pulls it back and forth eagerly wanting so much to know whose it is. He sniffs it deeply again but this time Myles, who just showered, comes walking out and sees Kyler sniffing his jock. He startles Kyler and drops his towel asking him, Is this what you were looking for? Kyler doesn't say a word but Myles walks towards him and pushes him down onto his knees. Kyler now has Myles big thick cock deep in his throat. Myles face fucks him deep until he flips him around and pushes him up against the locker. Myles spreads his legs to reveal his pink tight hole. He buries his face between Kyler's soft young cheeks licking and tongue fucking his ass. Myles can tell that this sexy ass is now lubed up and ready to be fucked. Myles fucks Kyler doggy style up against the lockers until he has him ride his meaty cock. His shaft is so thick Kyler can only take it for so long so Myles lays him on his back and cums all over his smooth young skin. Kyler rubs Myles cum into his skin and begs him to fuck him again until he can nut all over himself which in a matter of seconds Kyler does blast his built up nut. Enjoy!",
  "models": [
    {
      "name": "Myles Landon",
      "person_id": 38092
    },
    {
      "name": "Kyler Ash",
      "person_id": 47944
    }
  ],
  "release_date": "2017-04-03",
  "scene_id": 123398,
  "series": "DL - 41 - Myles Landon & Kyler Ash",
  "tags": [],
  "title": "Towel Boy"
}