{
  "collections": [
    "Next Door Originals"
  ],
  "description": "When his potential step-brother to be invades his space, Brandon Moore decides to turn misfortune into opportunity. Dante Martin is a hen pecked nerd in every sense of the word, but Brandon can see through those pants his mama dressed him in that Dante is nonetheless packing some serious meat in his jeans. Quickly corrupting his search engine with porn, Brandon exposes Dante to the carnal side of things, and once he sees Dante is ripe for seducing, he offers to show Dante first hand what it's all about.   He wraps his lips around Dante's cock and the virgin nerd forgets all of his mother's stern warnings and lectures, and pushes Brandon's face down onto his stiff cock. Brandon tells him to bend over and he timidly obeys, as Brandon plunges his tongue deep into Dante's ass. Dante gasps as Brandon works his magic, and assured that Dante is all in, he tells the mama's boy to suck his cock. Dante is hesitant at first, but he proves a quick study, downing Brandon's cock and sucking his balls. By now Brandon is more than ready to ride Dante's cock, so he mounts him and spreads his legs wide, leaning back as he grinds on Dante's pole. Dante tells him it feels amazing as Brandon flips over onto his knees, ass up in the air for Dante to pound. Dante pile drives him from above before flipping him over and fuckng the cum out of him, before dousing with a load that explodes from years of pent up regression. Covered in cum, Brandon tells him maybe it won't be so bad if they end up step-brothers afterall. Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Brandon Moore",
      "person_id": 35927
    }
  ],
  "release_date": "2017-03-24",
  "scene_id": 123403,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth"
  ],
  "title": "Big Dick Nerd"
}