{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With good friend Ty Thomas coming over, Paul Canon and his boyfriend Jackson Traynor prepare their den for a movie night. Ty brings his new roomie Dalton Briggs over with him. Straight boy Dalton is rumored to have a giant dick, at least that's the rumor his ex-girlfriend is circulating, and as the movie drags on and Jackson and Dalton both fall asleep, Paul and Ty confer about the validity of this statement. All intial evidence appears to support the claim, as Paul and Ty eye the buldge in Dalton's pants. Paul tells Ty that if he won't start something with Dalton then Paul will, as he makes his way over to where Dalton is sleeping. Ty is skeptical, and worried Dalton will wake up to find them hovering over him like a couple of pervs. Dalton tells Ty they're way past the point of appearances, and Ty is shocked to find out Dalton's been awake the whole time. Luckily, Dalton seems to be into the idea, so Paul and Ty quickly take advantage of the situation and begin tag teaming his cock, taking turns blowing him as Jackson lay sleeping beside them. Paul decides to mount this huge cock in front of him, even as Ty protests. Paul isn't worried about his boyfriend's reaction, but when Jackson stirs awake, he's definitely not calm and cool about it, until Ty grabs him by his crotch and tells him to just enjoy it. Jackson is skeptical but Ty quickly has his pants down and deep throats Jackson's cock as Paul continues to ride Dalton. With everybody up and aroused, the room quickly turns into a four man fuckfest, as Ty and Paul take turns fucking each other, as Dalton gives Jackson a taste of his big dick. Ty and Paul cum so many times they lose count, and Jackson is happy he joined in as Dalton pounds him from behind, before pulling out to wet him down with a massive straight boy load all over his sweat drenched body. Paul and Jackson share a cum filled kiss as all four guys retire to sleep away their debaucherous fuck marathon. Enjoy!",
  "models": [
    {
      "name": "Dalton Briggs",
      "person_id": 47222
    },
    {
      "name": "Jackson Traynor",
      "person_id": 49107
    },
    {
      "name": "Paul Canon",
      "person_id": 36900
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2017-03-29",
  "scene_id": 123479,
  "series": "NDR - 68 - Paul Canon, Ty Thomas, Dalton Briggs & Jackson Traynor",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Deep throat",
    "Gay Couple",
    "Gay Porn",
    "Hardcore",
    "Oral",
    "Orgy",
    "Rimming",
    "Smooth"
  ],
  "title": "Cuddle Puddle"
}