{
  "collections": [
    "Active Duty"
  ],
  "description": "Hey Troops,Here are a couple of good ol' boys if I ever seen 'em!  It's one of our very favorites, Zack Matthews, along with a recruit with whom we haven't had the opportunity to become very acquainted, Ripley Grey.Now I don't think anyone could forget the sizzling solo jerk session (that almost sounds like a Jamaican recipe) Ripley did for us not long ago.  We also saw Rip participate in the epic Christmas orgy, which actually took place AFTER this hookup with Zack.  So this is a little bit of a rewind, but it gives us a chance to see Ripley interacting with a fellow soldier for his first time on camera...which is always my favorite!From the first time we were blessed enough to witness Zack in action, I've been hooked.  His first tryst on camera for us was an incredible three-way with none other than AD icon Quentin Gainz and squad top-dog, Ivan James.  Ivan took advantage of Zack's ass in an aggressive way that showed us Zack was playing for keeps and that he was willing to stretch himself as far as possible for the benefit of the troop.  Now, several encounters later, Zack is breaking in a newbie himself!  It's clear right from the jump that Ripley is excited.  The boys waste no time before engaging in a deep, passionate kiss, letting their hands wander and explore each other.  They pull one another's clothes off and Ripley goes right in for a taste of Zack's luscious cock.  Claude thinks quick here, moving around behind him, getting an excellent shot of Ripley's tight hole.  The ecstasy on Zack's face is something to behold.  Wow, Ripley seems to be proving right away that he knows how to properly polish a knob!  He bobs hard and deep on Zack's thick boner, not letting up at all.  Eventually, Zack gets hungry for hard meat himself and the guys switch positions on the bed.I think we've all come to love seeing Zack's gorgeous face pleasuring a big, firm dick.  He really makes an art out of it, using plenty of spit and jerking, and sucking balls is all part of his amazing repertoire.  Claude goes around back here for a bit to catch a great shot of Zack's tight, tender hole.  Zack can't hold off for too long though.  Something tells me he's been saving himself for this hot hookup.  Claude gets down low and we watch Zack's throbbing dong slide into Ripley's ass.  Ripley doesn't protest much so Zack quickly works up into a hard, slamming rhythm, pounding that warm pocket like the powerful soldier he is.  Even though Ripley is clearing doing his best to tolerate Zack's punishment, the two let that true chemistry flow, kissing while that ass gets banged.  Ripley goes from his back to all fours and Zack reinserts his erection into that inviting hole.  Now THIS is where things get interesting!  Zack uses this position to leverage even more power.  This is that moment for Ripley when he realizes there ain't no goin' back!  These guys are two of my favorites, even though one is relatively new.  There's no question Ripley was cut out for our little squad.  He's got the look, the intensity, and, of course, the body!  What a fantastic ending for these dudes here.  Big, juicy loads all over their chests and stomachs, and guess what...there's plenty more where that cum from!",
  "models": [
    {
      "name": "Zack Matthews",
      "person_id": 46985
    },
    {
      "name": "Ripley Grey",
      "person_id": 48493
    }
  ],
  "release_date": "2017-03-12",
  "scene_id": 123526,
  "series": "AD - 180 - Ripley Grey & Zack Matthews",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Deep Throat",
    "Duo",
    "Gay",
    "Smooth",
    "Tattoos",
    "White Butt"
  ],
  "title": "Ripley Grey & Zack Matthews"
}