{
  "collections": [
    "Active Duty"
  ],
  "description": "It's three of AD's finest, at your service!  We have a new recruit (who I already love), Richard Buldger, along with two monumental veterans, Ryan Jordan and Quentin Gainz. Right from the get-go, these are three peas in a pod.  As soon as they're naked, which happens real quick, Ryan repositions himself to the middle so he can get both Quentin and Richard's cocks in his hands at once haha!  I told you this boy was a fiend!Ryan stands up on the bed and slides his hard cock into Richard's mouth and Quentin gets busy servicing Richard's thick dick.  From there, the guys relax a bit, getting into an incredibly hot three-way suck positon.  Quentin tastes Ryan, Ryan slurps Richard, and of course Richard continues to impress while enjoying Quentin's stiffie.  Then Quentin decides he wants to prep Ryan's ass for the pounding it's gonna take soon.  He gets behind him and licks all around his tight hole while Ryan bobs up and down vigorously on Richard's swollen dong.  Quentin takes his time pushing his fat dick into Ryan's ass.  Claude gets low and tight to show us.  Once he gets in past the gate, he's off and galloping like a Clydesdale.  Then the guys switch it up so Richard can have a go at that amazing ass on Ryan.  Quentin moves around to Ryan's face and Ryan goes to his back to offer Richard his hole.  Wow, Richard is certainly a powerful top!  Finally, the guys all blow their juicy loads in an incredible culmination.  Congrats to Richard!  I think it's safe to say he's proved himself here with two of the undoubted AD best.  Thanks guys, we'll see ya soon!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    },
    {
      "name": "Richard Buldger",
      "person_id": 49059
    }
  ],
  "release_date": "2017-03-19",
  "scene_id": 123525,
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Jerk Off",
    "Muscular",
    "Rimming",
    "Smooth",
    "Tattoos",
    "Threesome"
  ],
  "title": "Richard Buldger, Ryan Jordan & Quentin Gainz"
}