{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Quentin is finding it hard to work on his career in acting due to the lack of respect his straight roommate Jimmy shows. Even if tolerating it solves his rent issues, the sound of the straight couple fucking all the time is more than he can bare. Quentin finds himself at the mercy of his friend Ty Thomas who seems to be facing troubling times as well with his struggle to find his own sexuality and what he wants out of life. Desperate to find a why to expand his webcam business and clients in order to kick Jimmy out of his place, Quentin decides he enter a local underwear dance content at a gay bar to promote his webcam show. After some convincing, Ty agrees to join Quentin on his adventure and the boys find themselves emerged in an night out on the gay town where paths cross once again with troubled pasts. All seems well, until Ty is reunited with his ex-boyfriend Mark Long who isn't happy about the encounter and storms out. When Mark's best friend, Markie More, stumbles upon Ty while looking for his friend and finds himself in a position of built of heated lust and both Markie and Ty take advantage of the moment that leads to Markie finally filling his mouth with that big dick of Ty's he'd been thinking about since the day he saw him taking a shower. He devours Ty's manhood leaving his rock hard and dripping wet as he pre-cums all over the group in the alley and then flips Ty around and sinks his tongue deep in Ty's ass. After tasting all him and getting his hole nice and wet, Markie quickly drops his pants and slides his throbbing dick inside of Ty making his moan through the alleyway. This turns into a deep and hard fuck sending Ty into animalistic behaviours as he throws Markie onto a nearby stack of tires and gives him the blowjob of his life, nothing like ass to mouth! After Markie is pre-cumming all in Ty's mouth, he grabs Ty and throws him on his back on the tires and slides his dick back inside Ty and fucks him missinoary as they intensely make out. This is all great, until the need to be in control drives Ty to flip Markie and ride his dick until his blows his load all over this hole. Markie hasn't taste Ty enough yet, so he begs for his load on his knees to finish out this intense fuck session where everyone can see their business in the alley, even Mark.",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2017-04-07",
  "scene_id": 123610,
  "series": "NDO - Straight Chexxx",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Climax",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming"
  ],
  "title": "Straight Chexxx Episode 2"
}