{
  "collections": [
    "Club Inferno Dungeon"
  ],
  "description": "Big daddy Joey D lets his boys out of their cage. Furry cub Gage Lennox and smooth, lean Issac Lin jump on the leather bench, assume a doggy style stance, and spread their asses. Lubing up his black-gloved hands, Joey simultaneously works his fists into both their holes. Giant strands of lube stretch down as Joey ramps up, twisting his fists like corkscrews into the dual eager holes. The bottoms squint their eyes and bite their lips, focusing on the intense anal wreckage Joey is perpetrating on their holes. Gage shows off his gaping man hole, ringed with hair slicked down from the lube. Rolling onto their backs, the two fist-hungry butt sluts throw their legs in the air and give Joey total control over their asses. Their stomachs heave with deep breaths as Joey's expert fist pummeling works its magic. 'Gonna carve me out?' asks Gage. 'Gonna carve that hole out? Fuck yeah!' Joey puts them in an even more adventurous position: as he lays on his back, Gage and Issac squat down onto his raised fists and fuck themselves by rocking back and forth. Flipping onto their backs again, Issac and Gage point their asses at the ceiling as Joey gut-punches their holes into total submission. 'Look at those nice, stretched-out holes,' says Joey as he admires his work. With Gage and Issac's holes wrecked, all three men stroke their cocks, building to an immense climax. Joey blows his load first, releasing his cum with guttural moans. Issac and Gage release jets of cum simultaneously, grunting like wild animals, then lean in for praise from daddy Joey. ",
  "models": [
    {
      "name": "Gage Lennox",
      "person_id": 49005
    },
    {
      "name": "Issac Lin",
      "person_id": 49164
    },
    {
      "name": "Joey D",
      "person_id": 49163
    }
  ],
  "release_date": "2017-04-06",
  "scene_id": 123638,
  "series": "Deep Hole Dungeon",
  "tags": [
    "Ass Shot",
    "Buttplay",
    "Cumshot",
    "Daddies",
    "Fisting",
    "Group Sex",
    "Hairy",
    "Jockstrap",
    "Muscle Men",
    "Tattoos",
    "Uncut"
  ],
  "title": "Deep Hole Dungeon"
}