{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Enlisting Mikey Junior's assistance to help sort his grandfather's storage unit, Gabriel Cross realizes he hasn't heard any stirring from Mikey's back room in quite some time. Deciding to take a break from what he's doing, he sets out to find where Mikey is holed up and to see what he's gotten himself into. As soon as he gets to the door of the back room, he realizes it's not about what Mikey's gotten into, but what's gotten into Mikey, as he finds his helper leaned up against the wall with a dildo shoved up his ass. Gabriel smiles at first, but becomes more and more impressed with Mikey's ability to take a big cock as he continues to watch. Stroking himself off, he decides to abandon the sorting and to pass the time with a different activity, approaching Mikey and taking over control of the dildo. He fucks Mikey with the dildo until it's obvious they both want more, and so Mikey falls to his knees and sucks Gabriel off. Gabriel fingers his ass as he does, before bending him up against a shelf and fucking him hard from behind. He pounds Mikey's ass and Mikey takes every inch, before they switch up and Mikey mounts Gabriel, slowly going up and down on Gabriel's rock hard cock. Mikey grinds his ass on Gabriel's dick until he's had his fill, and once he's ready to cum, he tells Gabriel to fuck him hard. Gabriel does so, laying Mikey on his back and pounding him missionary as Mikey loses his nut all over his chest. Turned on by the sight of it, Gabriel flips Mikey over, banging out his sweet ass one last time before nutting all over his hole. Gabriel shoves his raw cock back inside Mikey's cum dripped ass, and continues to fuck him hard, and Mikey, to his credit, is definitely ready for round 2. Enjoy!",
  "models": [
    {
      "name": "Gabriel Cross",
      "person_id": 32093
    },
    {
      "name": "Mikey Junior",
      "person_id": 48340
    }
  ],
  "release_date": "2017-04-05",
  "scene_id": 123634,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming"
  ],
  "title": "Warehouse Packin"
}