{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Muscle stud Woody Fox hits the outdoor showers at the campgrounds. Hidden beneath enormous redwoods, the area offers up some instant excitement when Woody spies Seth Santoro naked under the water. Slowly stripping down, Woody casts subtle glances towards Seth, and Seth looks over his shoulder to return eye contact. As Woody turns on the water in the next shower stall, he turns around to show off his swelling cock. Working the soap into a thick lather, Seth scrubs his muscular butt, then invites Woody to help wash his back. As Woody walks up from behind, his massive boner thrusts into Seth's ass cheeks. With the water running over their bulging muscles, Seth and Woody turn to each other and kiss passionately. Sinking to his knees, Seth inhales Woody's enormous uncut cock. The oral service works Woody up to the point where he's eager to get a taste of Seth's tight hole. Spreading Seth's meaty ass, Woody dives in tongue first for an epic rim job that has Seth eager for more. Moving to a nearby bench, Woody alternates between rimming Seth's ass and sucking his thick cock. Legs in the air, Seth eagerly awaits Woody's massive tool inside of him, and Woody delivers. With powerful thrusting, Woody dominates Seth's tight hole. Turning around and bracing himself against the shower wall, Seth takes Woody's cock doggy style. When Woody sits down on the bench, Seth lowers himself down on Woody's meat and uses his powerful legs to ride it up and down. Woody starts to thrust up from beneath Seth, which makes Seth's hard cock shoot a massive load! Kneeling down, Seth opens his mouth and catches Woody's load in his mouth.",
  "models": [
    {
      "name": "Seth Santoro",
      "person_id": 37664
    },
    {
      "name": "Woody Fox",
      "person_id": 26552
    }
  ],
  "release_date": "2017-04-05",
  "scene_id": 123766,
  "series": "Pitching Tents",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "butt play",
    "cum shots",
    "rimming"
  ],
  "title": "Pitching Tents"
}