{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Like Narcissus, Ian Greene observes his reflection in the waters of the fountain's pool. He's so enthralled by the reflection in the water, he hardly notices that tall, hairy Bulrog has entered the chamber. Suddenly, Bulrog grabs Ian from behind, breaking the spell, and they begin to kiss with passion and vigor. Ian's hands reach into Bulrog's loincloth and pull out his thick, pierced, uncut cock. Bulrog wets his finger and rubs it on Ian's hole, stretching the butt cheeks apart and lubing the tight, pink entry. As they kiss, Ian strokes Bulrog's cock with reverence and awe. Ian then bends over, and Bulrog dives in with his tongue. His skillful rimming sends Ian into uncontrollable moans of pleasure. Spreading Ian's ass wide, Bulrog delivers wet gobs of spit that slowly roll down inside Ian's hole. To show his appreciation, Ian gets down on his knees and inhales Bulrog's meaty cock, piercing and all. Showering Bulrog's cock with his spit, Ian uses his thick lips to rub up and down the girthy shaft. Precum leaks from Ian's cock as he uses his free hand to stroke himself, and Ian soon explodes with a massive load that shoots all over the floor, never releasing Bulrog's cock from his mouth. Bulrog blows his wad right after, his hairy chest heaving as his semen seeps out from his pierced dick and dribbles into Ian's open mouth. As Bulrog strips out every last drop of cum, Ian laps it up with his tongue and lets it flow down across his chin. Standing up, Ian and Bulrog snowball the cum back and forth, tasting the white, creamy drops on their lips.",
  "models": [
    {
      "name": "Ian Greene",
      "person_id": 49212
    },
    {
      "name": "Bulrog",
      "person_id": 49213
    }
  ],
  "release_date": "2017-04-10",
  "scene_id": 123869,
  "series": "Erectus",
  "tags": [
    "Big Dick",
    "Bodybuilder",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "Erectus, Scene #04"
}