{
  "collections": [
    "Next Door Originals"
  ],
  "description": "The drama continues as Mark and Markie face troubling times in their friendship following Markie's steamy encounter with Mark's ex, Ty. While the tensions rise, Mark discovers that his over-sexed Captain American neighbor is actually his hot trainer he has been lusting for and finds himself in an opportune moment when Jimmy invites him to explore the wild side with him as his girlfriend watches. Ty is struggling to find himself sexually and although Markie's become a regular satisfaction in his life, they quickly realize that the two of them are looking for something totally different. The sexual games are underway for Ty and the adventures are beginning, but Markie is seeking to fill a missing piece as a result of his broken heart and lack of honesty with his best friend, Mark. Quentin Gainz is finally catching a break and has his big audition with a hot casting director named Dean Phoenix. However, Quentin finds himself in a compromising situation when he is late for his first audition and Dean isn't so happy. The two can't seem to end the heated moment as a lesson in being professional turns to a heated lesson of what it takes to get on top. This steamy and deep penetrating affair will make you sweat just watching as they find some clever ways to fuck in the theatre. Quentin finds Dean's mature hands know exactly how to put him in his place and Dean shows Quentin what a legendary dick is suppose to feel like as he pumps away. The session is so intense that Quentin actually begins to find himself falling for a man for the first time. Enjoy!",
  "models": [
    {
      "name": "Dean Phoenix",
      "person_id": 8952
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2017-04-14",
  "scene_id": 123867,
  "series": "NDO - Straight Chexxx",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "Hardcore",
    "Mature",
    "Muscular",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Straight Chexxx Episode 3"
}