{
  "collections": [
    "Active Duty"
  ],
  "description": "Scott is back with us again and if you haven't seen him alone you should check him out stroking his dick. Scott has that young delicious look that makes you want to lick his body up and down. His been with some great vets in the past and he can pound some ass, just check out the latest scene he is in. Scott does love to be on the receiving end from time to time but it has been awhile so it's nice to see Quentin banging out that tight ass. It's been awhile since Quentin has sucked on some cock and he ends up giving Scott the best BJ of his life. Quentin was hungry for that cock to be deep inside his mouth. He's the vet of all vets some might even call him the Drill Master. He doesn't shy away from orgies let alone some steamy 3-ways but he's been longing for a one on one session with Scott. The time has come for some intense fucking by these two sexy men. Scott dives into Quentin's tight ass first. Scott fucks him on the bed missionary style and doggy style. Scott's sexy dick looks amazing as it penetrates that eager ass. It's been some time since Scott's ass has had a hard cock in it and today is the day Quentin gets to fuck it. He has to slowly push into Scott who is bent over on the bed. Scott hasn't been fucked in a while so his ass is tighter than usual, so tight that Claude has to remind him to breathe easy. Quentin moves Scott to the chair where he keeps him bent over while pushing his face into the chair while he fucks him. Scott makes some amazing moans and groans as he gets fucked. The time has finally revealed itself where Quentin busts his built up load all over Scott's cock and balls. Scott continues to stroke himself with Quentin's cum all over him until he finally releases his own thick load all over his own chest. These two sexy studs gave an amazing performance and we are sure you will love every minute of it.",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Scott Finn",
      "person_id": 47961
    }
  ],
  "release_date": "2017-04-09",
  "scene_id": 123813,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Scott & Quentin Gainz"
}