{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Gardener Alessandro Haddad is working on getting the grounds in shape while interior designer Zander Cole installs the finishing touches in the bedroom. Lead contractor Alex Mecum observes Zander's work - and Zander's fuckable ass in his tight jeans. Zander pulls out Alex's massive cock and puts his lips to work. Alex's hairy, muscular body flexes as he enjoys Zander's expert head. When Zander lies down on the bed, Alex presses his scruffy face into Zander's ass crack, licking feverishly at his tight hole. Alessandro sees what's happening and wants to join in, stripping off his clothes and working his cock inside his white briefs. He sits on the bed and offers his cock for Zander's mouth. Alex stands up and puts his cock in Zander's mouth. With Alessandro's cock still in Zander's mouth, Alex lubes up his meat and fucks Zander's hole doggy style. Alex and Alessandro trade places, egging each other on to fuck Zander deeper and harder. Standing back, Alex watches as Alessandro pounds Zander's ass. Then Alex joins in, making Alessandro the meat in the middle of a heated fuck sandwich. Rolling Zander over, Alex fucks him missionary style while Alessandro fucks Zander's mouth. Alessandro shoots a massive load across Zander's chest, and Zander starts cumming right after, with Alex still inside him. Stroking his cock, Alex shoots a thick load across Zander's stomach. With Zander bathed in cum, the three of them share a supercharged three-way kiss.",
  "models": [
    {
      "name": "Alessandro Haddad",
      "person_id": 49254
    },
    {
      "name": "Alex Mecum",
      "person_id": 37766
    },
    {
      "name": "Zander Cole",
      "person_id": 47103
    }
  ],
  "release_date": "2017-04-28",
  "scene_id": 123987,
  "series": "Property Lovers",
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Cumshot",
    "Group Sex",
    "Hairy",
    "Masturbation",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Property Lovers, Scene #04"
}