{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Dante Martin and Dalton Riley decided to spice up their love life, they never expected to land such a pistol packing stud as Mark Long. Mark's M.O. is usually just to watch, and as Dante begins to suck Dalton off, Mark realizes there is plenty of eye-candy in front of him. But as soon as Mark whips out his cock and begins to stroke it Dante and Dalton mutually agree that Mark should be more involved, and Mark doesn't protest when Dalton suggests he let them suck him off, so the two of them get to work. Dalton works the head as Dante licks the shaft, as Mark throws his head back in ecstatic pleasure. Mark tells Dante he wants to watch him fuck Dalton, and Dante does, pounding his boyfriend from behind. Dante can tell Mark likes the view and he tells him to come get a piece. Mark plunges his huge cock deep inside Dante as he continues to plow Dalton beneath him. Dante has loosened Dalton up but now he wants some of Mark's cock for himself, so he mounts the stranger with the big dick and rides him as Dante becomes the watcher. Dalton switches between Mark and Dante, riding them both until he's ready to lose his load. Dante pounds him from below as Dalton sprays hot jizz  all over the sofa, then Dante asks Mark if he wants to breed Dalton's hole together and Mark is down.  They bend Dalton over and take turns blasting him with their loads and then breeding his dripping hole. Dalton and Dante agree they should've done this a long time ago, and Mark suddenly wonders the two of them are doing for dinner.",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Dalton Riley",
      "person_id": 48651
    }
  ],
  "release_date": "2017-04-12",
  "scene_id": 123968,
  "series": "NDR - 71 - Mark Long, Dante Martin & Dalton Riley",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Brunette",
    "Climax",
    "Cum swallow",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "Hairy",
    "Hardcore",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Straight Watchers"
}