{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With disagreeable weather raining out plans for a fishing trip, Markie More and his girlfriend's brother, Dalton Briggs, find themselves just moping around the house with nothing to do. Markie makes the comment that days like these are great for staying in bed and just fucking the afternoon away, and Dalton confesses that he hasn't had sex in a while. Conversation turns to a literal dick measuring contest, and Markie can't believe how big Dalton's cock gets when he's hard.Dalton asks Markie if he's ever messed around with a dude and he can sense Markie's tension when he denies that he ever has. Silence consumes the room as Dalton reaches out and grabs Markie's dick, slowly beginning to give him a hand job. Markie bites his lip as Dalton bends over to suck on the head, and as Dalton works his way down the shaft, Markie closes his eyes and leans his head back.Going with it, Dalton continues to suck Markie off until he's nice and hard, and once he's sure Markie is down with the program, he asks Markie to reciprocate. Gripping the base of Dalton's cock, Markie isn't sure he's gonna be able to handle it, but Dalton assures him he'll be fine, so he slowly  works the head with his tongue before deep throating half of it at once. Markie sucks him a little too well for it to have only been his first time, letting Dalton know his sister's boyfriend has likely done this sort of thing before.  Dalton tells Markie to bend over and slaps his cock against Markie's hole.Markie senses what comes next and tells him to take it easy. Dalton promises he will, burying his meatstick deep into Markie's tight hole. Forgetting his promise, he begins to fuck harder and harder, until he's plowing Markie feverishly. To his credit, Markie takes the pounding like a champ, and Dalton's rock hard cock definitely suggests it has been a while since he's had any action. He fucks the cum out of Markie before pulling out and dousing Markie with his pent up load, making a mess of Markie and the sofa and the pillows and the floor. Cum-covered and out of breath, Markie remarks how much better this was than going fishing. Dalton agrees whole-heartedly.",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Dalton Briggs",
      "person_id": 47222
    }
  ],
  "release_date": "2017-04-28",
  "scene_id": 124006,
  "series": "NDO - 4764 - Markie More & Dalton Briggs",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Beefy",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Rain Delay"
}