{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Fed up with the secretive living arrangement, Allen Lucas is hopping mad and on the verge of spilling the beans. Roman Todd is stuck between a rock and a hard place, as he realizes his father would kill him if he finds out Allen is more than just a roommate, but as he tries to soothe his father's suspicions in the living room, Allen is yelling to himself in the kitchen. Roman tries to quiet Allen but he's having none of it, and demands that the only way he won't tell is if Roman fucks him right now in the kitchen. Roman realizes he has no easy way out, so he puts his hand over Allen's mouth and begins to undress him. Throwing him up against the fridge and pulling out his cock. Allen falls to his knees to suck him off, and Roman checks over his shoulder to see if his father is wise to what's happening. Oblivious, he sips his tea on the sofa, as Allen flips Roman around and eats his ass. Roman's cock is hard and the fear of getting caught turns him on, so he turns Allen around and rubs his cock up down Allen's crack, slipping a finger deep inside his hole, before he dives tongue first into Allen's ass. He gets Allen good and ready, then stands and silently plunges his raw cock deep inside Allen, who lets out a moan through Roman's cupped fingers.  Roman pounds him from behind up against the fridge, then the boldly move to the dining room where Roman has a seat while Allen rides him. Allen's cock bounces up and down as Roman continues to fuck him hard, flipping him over and pounding him missionary as Allen loses his massive load all over his chest. He begs for Roman to feed him his load and Roman does as instructed, pulling out and dripping his load all over Allen's mouth as Allen sucks him dry. Roman finishes just in time to look up and see his father in the hallway staring at them, as Allen smiles from ear to ear.Enjoy!",
  "models": [
    {
      "name": "Roman Todd",
      "person_id": 46827
    },
    {
      "name": "Allen Lucas",
      "person_id": 47889
    }
  ],
  "release_date": "2017-04-26",
  "scene_id": 124007,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Facial",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Daddy's Boy"
}