{
  "collections": [
    "Active Duty"
  ],
  "description": "We got a sweet surprise for you today. We welcome Rix back to the war room and he did such a great job showcasing his skills in his solo that we brought him back as fast as we could so fast that his first scene is days away from going live. He will be with one of our newest vets Richard Buldger who has just a mere two scenes under his belt but he has proven his worth in the fog of war. Rix is still fresh so Richard takes the reigns by sucking his big dick. Once Richard has him warmed up and comfortable in his new surroundings he stands up and has Rix suck on his fat cock. Rix can't believe how thick it is and this is his first time having another man's dick in his mouth. Richards's veiny cock is stretching out Rix's mouth but that's ok because Rix will be stretching out Richards's ass very soon. Rix is ready for his new position as he pushes into Richards's ass for the very first time. He can't believe how tight and great his ass feels as it wraps around his throbbing cock. Rix has him bent over the bed ball slapping him as Richard gets fucked hard. Richard eye fucks the camera as Rix's raw cock penetrates him. Richard slowly slides down Rix's hard shaft taking every inch deep into him. He slowly builds momentum on his new poll and before you know it he's riding that dick like a pro. Rix isn't one to relinquish control so he grabs Richards's hips and starts to thrust deep and hard up into Richard. The moment we have all been waiting for has finally come and Rix is the first to blow his load all over Richards cock and balls. Richard uses some of Rix's creamy cum to stroke with as he beats his nut out and with one last stroke he shoots a thick load all over himself.Enjoy!",
  "models": [
    {
      "name": "Richard Buldger",
      "person_id": 49059
    },
    {
      "name": "Rix",
      "person_id": 49169
    }
  ],
  "release_date": "2017-04-23",
  "scene_id": 124146,
  "series": "AD - 192 - Rix & Richard Buldger",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "First Time",
    "Gay",
    "Smooth",
    "Tattoos"
  ],
  "title": "Rix & Richard Buldger"
}