{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Watching the hired hand do his handiwork around the bushes, Lance Ford has another area that needs Chris Blades' attention. Rather than approaching the gardener with an awkward pitch, Lance decides to subtley bate Chris with the lure of cold hard cash. Chris takes the bait and follows its lead to Lance's bedroom, where he finds Lance already laying in bed, shirt off, ready to pounce. With a look, Chris understands what Lance is after, and Lance doesn't hesitate to act on his fantasy, kissing down Chris' chest and revealing his cock. He immediately begins to suck Chris off, and Chris remarks that he's glad he took the bait. Lance smiles and continues to work the shaft with his tongue, before Chris throws him back onto the bed and flips him over, perching Lance's ass high in the air and taking a nice big bite. He tongues Lance's hole until Lance is good and ready to fuck, then lets Lance mount him. Lance slowly lowers himself onto Chris' cock, feeling every inch as it slides deep inside him, before bouncing up and down on it. Chris holds on to Lance's waist as he fucks up into Lance's ass, before switching up and laying Lance face down on the bed. Chris pile drives him, fucking him hard as Lance clings to the comforter with every hard thrust. Lance is rock hard as Chris continues to pound, fucking the cum out of Lance before pulling out and wetting him with his load. In a sweaty heap, the guys kiss each other as Lance asks about Chris' availability in the future. Chris tells him he's just a fill-in for the regular gardener, and Lance tells him he wasn't talking about the garden.   Enjoy!",
  "models": [
    {
      "name": "Chris Blades",
      "person_id": 48683
    },
    {
      "name": "Lance Ford",
      "person_id": 47871
    }
  ],
  "release_date": "2017-05-05",
  "scene_id": 124154,
  "series": "NDO - 4766 - Chris Blades & Lance Ford",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Raking in the Dough"
}