{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Scott Demarco eyes new team member Tobias getting in a workout after practice one day, and tells the rookie that the rest of the team is really impressed with his play and his attitude, but Scott senses there's something else that needs tobe addressed. Scott tells him that he seems tense, and asks him if he's getting any at home. Tobias confesses that he's never actually been with a girl, and a lightbulb flickers in Scott's head. Following Tobias back to the locker room, Scott tells him that he knows a few ways to help Tobias loosen up. Tobias is somewhat timid, but doesn't fight Scott's advances too hard, so Scott tells him he's gonna love it, pulling Tobias' shorts down and immediately gulping on the cock in front of him. Tobias' eyes roll back into his head as he experiences his first blow job, as his cock gets rock hard in Scott's mouth. Convinced Scott might be onto something, he rocks Scott back onto his back and returns the favor, sucking on the head of Scott's hard cock and working his way down the shaft. As Tobias deep throats him, Scott eyes that sweet ass he's seen running around the court. Bending Tobias over, he slowly sticks his raw cock deep into Tobias, pounding the rookie from behind just like a real pro. Tobias takes every inch willingly, stroking his cock as he mounts Scott's dick, bouncing up and down before spiiting his load while Scott continues to raw dog him. Scott asks him if he wants his hole bred, and Tobias says sure, so Scott pulls out and blasts his hole, before seeding it over and over again, his cum covered cock causing Tobias to pulsate with every thrust. Exhausted and satisfied, Scott tells Tobias that after a few more sessions, he'll be nice and loose like everyone else on the team.  Enjoy!",
  "models": [
    {
      "name": "Scott Demarco",
      "person_id": 47616
    },
    {
      "name": "Tobias",
      "person_id": 49346
    }
  ],
  "release_date": "2017-05-10",
  "scene_id": 124246,
  "series": "NDR - 74 - Scott Demarco & Tobias",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Beefy",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Straight Men"
  ],
  "title": "Rookie Score"
}