{
  "collections": [
    "Raging Stallion"
  ],
  "description": "The gritty cruise bar is closing down after a hot, sexy night, but Jack Vidra and Jack Andy aren't ready to go home yet. As the staff tries to clean up, they can't stop making out with each other. Manuel Skye announces last call, adding, 'If you're not the one I'm fucking, get out of here!' Jack Andy and Jack Vidra ignore him, and instead pull their dicks out and rub them together. Manuel and his barback CJ exchange a conspiratorial look, as if to say, 'Let's see how this plays out.' Jack Vidra gets down on his knees and Jack Andy fucks his throat deep and hard. In the background, Manuel and CJ exchange deep kisses and grope each other's muscular bodies. As Jack Vidra worships Jack Andy's tool, Manuel and CJ come out from behind the bar and join them, instigating a four-man oral orgy. Jack Vidra sucks Manuel's massive meat as CJ attends to Jack Andy's throbbing tool. Manuel sinks to his knees to service Jack Vidra's lengthy cock, and adds to the intense pleasure by reaching up and tugging on Jack's plump, pink nipples. Jack Vidra leans against the pool table between Jack Andy and CJ, and Manuel services all their cocks at once. Using Manuel's face as a target, Jack Andy is the first to shoot, followed immediately by Jack Vidra's hot cum. With their loads blown, Manuel kicks them out (with a wink and a smile) so he and CJ can finish closing down the bar.",
  "models": [
    {
      "name": "CJ Phillips",
      "person_id": 49367
    },
    {
      "name": "Jack Andy",
      "person_id": 49301
    },
    {
      "name": "Jack Vidra",
      "person_id": 48034
    },
    {
      "name": "Manuel Skye",
      "person_id": 49302
    }
  ],
  "release_date": "2017-05-01",
  "scene_id": 124349,
  "series": "Two Dick Minimum",
  "tags": [
    "Big Dick",
    "Bodybuilder",
    "GroupSex / Orgies",
    "Leather",
    "Oral",
    "Tattoos",
    "cum shots",
    "masturbation"
  ],
  "title": "Two Dick Minimum, Scene #04"
}