{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Jimmy is snapping photos of his new model Marco. They've been acquainted for some time now but Jimmy schedule has finally opened up and Marco can now get the pictures he's always wanted to pursue is modeling career. Jimmy continues to direct Marco on how to position his body. Jimmy can't believe how sexy Marco is. He finally gets him to take his shirt off revealing his sexy young firm body. Just before things could heat up Jimmy calls an end to the photo shoot but Marco wants to take photos of Jimmy now which with after some hesitation Jimmy agrees to it but feels as if Marco wants more than to take photos. Knowing where this will go, Jimmy begins to take his shirt off and then drops his pants revealing his stiff cock underneath his underwear. Once Marco sees that package he drops the camera and gets down on his knees to service Jimmy's sexy hard cock. Marco loves the size and feel of Jimmy's dick in his mouth as he sucks and strokes on it. Jimmy moves Marco over to the couch where he bends him over and spreads his ass wide open and begins to rim his beautiful smooth ass. Jimmy has is face deep between his but cheeks licking and fingering his tight hole preparing it for his big throbbing cock. Marco is ready for that dick so Jimmy pushes in slowly balls deep and begins to fuck that tight ass of Marco's. Marco moans in pleasure with each thrust into him. Jimmy loves his tight ass and wants to feel him ride his dick up and down. They switch it up and Marco rides that stiff cock like a champ. Jimmy is amazed at the skills of this young man as he rides him up and down. Marco is ready to pop so Jimmy lays him on his back and fucks him some more but just before Marco cums Jimmy pulls his dick out and blasts his load all over Marco making him shoot his load as well. Enjoy!",
  "models": [
    {
      "name": "Marco Montgomery",
      "person_id": 48337
    },
    {
      "name": "Jimmy Durano",
      "person_id": 49384
    }
  ],
  "release_date": "2017-05-15",
  "scene_id": 124359,
  "tags": [],
  "title": "Click"
}