{
  "collections": [
    "Active Duty"
  ],
  "description": "The best of the best is back and that's Quentin Gainz, one of our best combat veterans by far. He's back with  Mathias who has never been with a man and only did a solo with us which was amazing and one of the reasons we brought him back. Once Quentin saw pictures of him we brought him back from leave and now Quentin's the lucky guy to pop Mathias' man cherry. Once Mathias met him and they both became relaxed soon after they both had their cocks out stroking away. Mathias was a little shy but once Quentin's mouth was wrapped around his cock he was in the moment for the rest of the sexy session. Once Mathias got his eager curious lips around that sexy dick Quentin couldn't believe it was his first time sucking cock. The care Mathias was giving and the tongue action that he was doing to Quentin's stiff cock was nothing short of hot. Don't forget this is Mathias's first time ever having his dick in a man's sexy butt. Once he was in he couldn't stop, all he wanted to do was pound Quentin out. Mathias couldn't believe how great a man's ass could feel wrapped around his dick. The tightness and eagerness coming from Quentin probably made it even better. Quentin blasts his nut while being fucked and once Mathias sees that cream he pulls his raw cock out and nuts all over Quentin's back. It is an amazing site to see and ohh you have to watch the outgoing interview at the very end as Claude gets the final word from both of these men.Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Mathias",
      "person_id": 49149
    }
  ],
  "release_date": "2017-05-07",
  "scene_id": 124358,
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "First Time",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos",
    "White Butt"
  ],
  "title": "Quentin Gainz & Mathias"
}