{
  "collections": [
    "Falcon Studios"
  ],
  "description": "'Please me,' says the Devil (Dean Monroe) to his Dark Angel servants. Duty-bound to satisfy their master, Dark Angels Sean Zevran, Arad Winwin, and Gabriel Alanzo press their hands on Dean's muscular body. The four menacing demons of the underworld turn to each other and savor the pleasures of their flesh. Gabriel opens his mouth to receive Sean's monster cock, slathering it with spit, as Dean swallows Arad's massive sword. Sean eats Gabriel's ass, and Arad spits into Dean's mouth. Borrowing the Devil's throne, Sean takes a seat as Arad services him orally. The four dirty angels congregate together in a seething, writhing mass of bulging muscles, hard cocks, and open mouths. Sean and Dean tag team Gabriel's cock as Arad face fucks him. As Dean relaxes on his throne and watches, Sean thrusts his cock inside Gabriel's ass and pounds him with all his supernatural strength. Gabriel licks Dean's nipples, always trying to please his master. Dean savors the taste of Arad's spectacular cock as it slides into his gullet. But now it's time for the boss to get what he really wants: his hole pounded. Sean slides in first, stretching out Dean's hole. Arad steps up next and drives his meat deep inside Dean. As Dean strokes his cock, Arad moves up to Dean's face and shoots his load into Dean's open mouth and across his dark beard. Sean pounds Gabriel's load out of him, but he's sure to deliver it directly to his master. Sean sprays his load across Dean's thigh, and Dean shoots off a white-hot load. ",
  "models": [
    {
      "name": "Arad Winwin",
      "person_id": 49394
    },
    {
      "name": "Dean Monroe",
      "person_id": 11436
    },
    {
      "name": "Gabriel Alanzo",
      "person_id": 49392
    },
    {
      "name": "Sean Zevran",
      "person_id": 33509
    }
  ],
  "release_date": "2017-05-12",
  "scene_id": 124675,
  "series": "Earthbound - Heaven to Hell 2",
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Bodybuilder",
    "Buttplay",
    "Group Sex",
    "Latino",
    "Masturbation",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Earthbound - Heaven to Hell 2"
}