{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Sent on a fact-finding mission by his employer, Lord, Henchman (JJ Knight) encounters a mysterious motorcyclist. Biker approaches Henchman, and doesn't flinch when Henchman cops a feel. But the moment Henchman tries to remove the Biker's helmet, he gets immediately rebuffed. Ducking inside a dark and dirty warehouse, Henchman removes Biker's motorcycle jacket - no shirt underneath. Clawing at Biker's pants, Henchman opens the fly and services Biker's hard cock. Still, he refuses to remove his helmet. Henchman tongues the sensitive tip of Biker's cock and tugs on his big balls. Rising to his feet, Henchman won't take no for an answer: he has to know who he's dealing with. Finally, acquiescing, Biker reveals his identity: Blake Riley. They kiss passionately, completely caught up in mutual lust. Getting on his knees, Biker fishes Henchman's monster cock out of his pants and gives Henchman an intense oral workout. Biker squats down and sits on Henchman's face, using a set of utility stairs to get at just the right height. Pushing his tongue up into Biker's hole, Henchman eagerly savors the warm, soft flesh. Sitting down on top of Henchman, Biker somehow manages to cram Henchman's humongous schlong into his hole. The enormous length and girth of Henchman's cock stretches the skin of Biker's hole, and he braces himself against the stairs to better withstand Henchman's intense pounding. Jerking his hard dick, Biker pumps out a copious load across Henchman's washboard abs. As Henchman strokes himself, Biker laps up his own load from JJ's torso. As Biker teases Henchman with his tongue, Henchman ejaculates a massive, spurting load that shoots across the room and hits Biker in the side of the head. After licking Henchman's cock clean, Biker shares the taste with Henchman in a final, fiery kiss.",
  "models": [
    {
      "name": "JJ Knight",
      "person_id": 38220
    },
    {
      "name": "Blake Riley",
      "person_id": 49393
    }
  ],
  "release_date": "2017-05-19",
  "scene_id": 124677,
  "tags": [
    "Anal Sex",
    "Bodybuilder",
    "Cumshot",
    "Masturbation",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Earthbound - Heaven to Hell 2, Scene #04"
}