{
  "collections": [
    "Next Door Originals"
  ],
  "description": "No sooner has new neighbor Dalton Riley introduced himself that Dante Martin sees the conflict between him and his boyfriend. Dalton's intial reasoning for stopping by was just to welcome Dante to the neighborhood, but it quickly escalates to a potential booty call when Dalton's boyfriend storms off and Dalton catches Dante on the porch. Texting him, he asks if Dante wants to hang now, and Dante tells him he's waiting on the patio. Moments later, Dante is leading Dalton into his house to show Dalton how a real man treats his boyfriend. They kiss hard on the mouth as Dante works his way down Dalton's body, pulling out his neglected cock and giving it a squeeze before going down on his new neighbor. Dalton closes his eyes and enjoys the attention Dante deep throats him, stroking himself hard as Dalton lay back on the bed. Switching roles, Dalton sits up and returns the favor to Dante, running his hand up and down Dante's ripped and muscular body, and squeezing his ass in anticipation. Dante tells Dalton he wants to get fucked, and promptly mounts the neighbor's hard cock, bouncing on it as Dalton smacks him from behind. Having had his way with Dalton's cock, Dante is ready to cede control to Dalton, so he bends over and lets Dalton hit from behind. Dalton seizes the opportunity and pounds Dante doggy style, fucking him hard as Dante takes every inch willingly, before flipping over onto his back. With his legs spread wide, Dante watches Dalton continue to thrust away, as Dalton strokes Dante's load right out of him, fucking him even harder as Dante's cock spews jizz all over himself. Dalton pulls out and blasts Dante with his own pent up load, and as they fall on top of one another, Dante tells Dalton that he wants to be his new boyfriend now.Enjoy!",
  "models": [
    {
      "name": "Dalton Riley",
      "person_id": 48651
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    }
  ],
  "release_date": "2017-05-26",
  "scene_id": 124672,
  "series": "NDO - 4772 - Dante Martin & Dalton Riley",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Home Wrecker"
}