{
  "collections": [
    "Pride Studios"
  ],
  "description": "Rico is in his workshop when Cameron comes in to check on his pressure washer that Rico was supposed to fix.  Rico shows Cameron that the motor is shot on it and says there is nothing he can do to get it to work.  However, there is still the matter of payment for labor.  Cameron does not want to pay him because it was not fixed, but Rico has other ideas on how Cameron can pay him. Cameron doesn't have any money on him but instead pulls out condoms from his pocket. Rico is really confused about it and laughs but then makes Cameron an offer they both can't refuse. He propositions him and soon they are lip locked. They start tearing their clothes off kissing all over each other.  Cameron drops to his knees eagerly and begins sucking on Rico's uncut cock deep throating it and slobbering it all up. Rico who is excited and getting his payment in many different ways drops to his knees for a taste of Cameron's hard cock. Sooner after Rico is deep throating Cameron until he wants him to rim his smooth ass to get it ready for some good fucking.  Cameron bends Rico over and shoves his face deep between Rico's furry butt cheeks. Cameron tongue fucks Rico until he can't handle it no more and needs that dick in his tight ass. Rico tells Cameron to sit in the char and as soon as he does Rico lowers himself on to that hard cock balls deep. Rico loves the feel of Cameron's dick and shows him just how much by grinding his cock like a pro.  Cameron switches it up and bends Rico over fucking him doggy style until he flips him over on his back and cums all over Rico's cock and balls. Rico loves the site of all that cum and has Cameron get down on his knees and blasts his hot load all over his face. Rico is satisfied with his payment and tells Cameron to pack up his gear.<br/> <br/>Enjoy!",
  "models": [
    {
      "name": "Cameron Kincade",
      "person_id": 28035
    },
    {
      "name": "Rico Leon",
      "person_id": 49421
    }
  ],
  "release_date": "2017-05-23",
  "scene_id": 124795,
  "series": "PO - 27 - Cameron Kincade & Rico Leon",
  "tags": [],
  "title": "Trade For Pay"
}