{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Dakota Young has found his way into a funk, and his teacher Mike Stone has noticed. Mr. Stone has offered to help his student with some one on one tutoring, but despite the extra attention, Dakota confesses that he just can't seem to focus. He tells Mr. Stone that he's too distracted by that, looking down at the bulge in Mr. Stone's slacks. Mr. Stone is surprised, but his pants don't lie, he's definitely attracted to his student. He asks Dakota if he's ever touched a man's body and Dakota says he hasn't. He asks him him if he'd like to and Dakota nods. With that, Mike unzips his pants and Dakota feasts his eyes on his teacher's cock, reaching out and grabbing it eagerly before taking it into his mouth. Dakota proves to be a quick study as he devours Mike's dick, sucking the head and then working his way down the shaft. Mike is rock hard and ready to continue the lesson, so they head up to Dakota's room where Mike takes him to the school of hard knocks, pounding Dakota's perfect ass from behind before lifting him up and bouncing him on his cock reverse cowboy while standing. He throws Dakota back onto his back and pounces on top of him, fucking him good and hard as Dakota strokes himself off, spitting his load onto his stomach as Mike pulls out and douses his student with drops of knowledge, coating Dakota's face in a sticky mess that definitely will have an influence on his final grade.<br></br>Enjoy! ",
  "models": [
    {
      "name": "Dakota Young",
      "person_id": 48374
    },
    {
      "name": "Mike Stone",
      "person_id": 49428
    }
  ],
  "release_date": "2017-06-02",
  "scene_id": 124766,
  "series": "NDO - 4774 - Mike Stone & Dakota Young",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Twink"
  ],
  "title": "Teacher's Secret"
}