{
  "collections": [
    "Club Inferno Dungeon"
  ],
  "description": "In Pig Alley, Mike Tanner has his sizeable cock planted in Seamus O'Reilly's hole and Nate Grimes is feeding him his thick tasty meat. The insatiable pig that he is, Seamus' huge dick is hard as a rock as he takes it from both ends. Mike starts pounding away at Seamus' ass to thoroughly get his hole primed for a proper fisting. Nate asks, 'You almost 'bout ready for my fist?' and Seamus replies affirmatively...as much as he can with Nate's cock deeply lodged in his throat. Mike pulls out to switch spots with Nate, Seamus leaves his legs in the air and Nate comes around to prep Seamus even more...with his tongue. Delivering a wet sloppy rim job, Nate pulls his face out of Seamus' hole just to replace it with his hand. An expert fisting bottom, Seamus takes it like a champ while he swallows Mike's cock. Now on all fours, Seamus is getting his ass punched by Nate and the back of his throat smashed by Mike's dick. Mike's not going to escape this three-way fisting throw down without getting his ass stretched. He switches spots with Seamus and gets the same treatment, Nate gets to punching Mike's hole as he swallows Seamus massive dick. Before it's all over, Nate coaxes both Mike and Seamus to bend over and take his fists at the same time. In a display of simultaneous extreme hole stretching, Nate's fists go deep inside both sloppy holes for a marathon fisting session until Nate sits on the floor fists punching up into the standing Mike and Seamus while they jerk their loads onto his face in an explosive finale.",
  "models": [
    {
      "name": "Mike Tanner",
      "person_id": 27686
    },
    {
      "name": "Nate Grimes",
      "person_id": 49334
    },
    {
      "name": "Seamus O'Reilly",
      "person_id": 32692
    }
  ],
  "release_date": "2017-05-04",
  "scene_id": 124755,
  "series": "Pig Alley",
  "tags": [
    "Anal Sex",
    "Ass Shot",
    "Buttplay",
    "Cumshot",
    "Fisting",
    "Group Sex",
    "Oral Sex",
    "Tattoos"
  ],
  "title": "Pig Alley, Scene #02"
}