{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Well well well, it looks like Zander is up to his old tricks once again. This time he's rummaging around in his Stepdad's camera bag. He has plenty of dick pics on his own cell phone camera but the quality with this camera is amazing. He checks the bag for any other useful contents but he pulls the camera out and is satisfied with just that. Zander begins to take selfies and then unzips his pants and continues to take more pictures but this time of his cock. Engulfed in the moment Zander has no clue that his Stepdad D is standing right behind him curious as to why his young hands all over his equipment. Zander turns around and sees his Stepdad and right at that moment D takes the camera out of his hands. Zander didn't get a chance to delete his cock pics from the camera but it's too late now as his Stepdad has seen his dick. Now that D has seen it on camera he wants to see it in real life. Zander doesn't hesitate and takes his cock out for his Stepdad. He doesn't want to piss him off. They begin to passionately kiss and Zander drops to his knees to service him in all ways possible. His Stepdad is engulfed with how sexy and smooth Zander is and can't get enough of him as he chokes on his hard cock. D wants a taste of that ass so he bends him over and buries his face between his soft smooth butt cheeks. Zander loves how hungry his Stepdad is for his tight hole. Zander's ass is lubed up with enough spit so D slowly pushes his throbbing dick balls deep into his Stepson. Zander takes it dam well as D begins to pump his young eager ass. His Stepdad then has him ride his cock in the chair for a bit until this young buck is nearing rupture. They end up in missionary on the chair and Zander unleashes a well built up load all over his smooth firm chest. His Stepdad can't take no more and nuts all over his cumed on chest. Enjoy!",
  "models": [
    {
      "name": "Zander Cole",
      "person_id": 49432
    },
    {
      "name": "D Arclyte",
      "person_id": 49433
    }
  ],
  "release_date": "2017-05-29",
  "scene_id": 124796,
  "tags": [],
  "title": "Stepdad's Camera"
}