{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "As Jacen Zhu scans the internets he happens across an escort ad featuring a guy he recognizes from his gym, so he decides to give him a call and see what services are provided. Fortunately for Jacen, Rex Cobra is a full service provider, and within an hour, he's knocking on Jacen's door ready for action. Rex looks like his pictures, with one exception: his smooth chest is now covered in hair. Jacen tells him he likes it even more than the pictures, and Rex lets out a relieved smile, asking Jacen what he wants to do. Jacen responds that he wants to have his way with Rex, and so Rex leans back and lets him take control. Jacen sucks Rex's thick hard cock, slapping it against his cheek before deep throating it. Rex gags Jacen on his pole as Jacen tongues the head, and once he's had his fill, he mounts Rex's meatstick and rides him hard. Rex decides Jacen has had control for long enough, flipping him over and showing him who is boss, as he spreads his legs and fucks the cum out of him. Jacen spits his load all over his chest, but he won't be satisfied until Rex does the same, so he begs Rex for his seed. In the name of customer satisfaction, Rex does has he's requested, pulling out and dousing Jacen with his load, as it spatters all over Jacen's chest. Rubbing his cock in the puddle of jizz, Rex asks Jacen if he got his money's worth, but the cum drenched smile on Jacen's face tells him everything he needs to know.Enjoy!",
  "models": [
    {
      "name": "Jacen Zhu",
      "person_id": 49106
    },
    {
      "name": "Rex Cobra",
      "person_id": 37382
    }
  ],
  "release_date": "2017-05-23",
  "scene_id": 125111,
  "series": "NDE - 251 - Jacen Zhu & Rex Cobra",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Black",
    "Blowjob",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Muscular",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Raunchy Rendezvous"
}