{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As they sun bathe by the pool, James Huntsman asks his friend Jordan Boss what's up with him and his girl. Jordan brushes off the questions with a flip of his wrist, and James tells Jordan he suspects that he isn't into women at all. Jordan mildly protests but James persists, asking him if he's ever thought about being with a guy. Jordan's hesitation tells James everything he needs to know, so he whips his dick out of his board shorts and asks Jordan if he wants a piece. Jordan balks at first, but James wags his cock a little and Jordan pounces on it, telling them they should move inside before the neighbors see them. James agrees and moments later, he's throwing Jordan onto the bed shoving his cock down his throat. Jordan sucks a mean cock for a first timer, and James can see he's unleashed a monster, as Jordan deep throats James and works his balls. James is rock hard and ready for more, so Jordan mounts him and begins to ride his dick, slowly at first until he's acclimated, and then increasingly faster. James smiles at Jordan's assertiveness before flipping him over and pounding him doggy style from behind. He gives Jordan's ass a nice hard smack, grabbing Jordan by his shoulders and fucking him even harder, before flipping him over into missionary. Jordan strokes his cock as James continue to thrust in and out, and Jordan spews his load all over himself. James pulls out and shoots his load onto Jordan's stomach, dripping cum all over Jordan's body as the two of them joke about how much Jordan loves the cock. This time, Jordan proudly admits it, now understanding that their friendship is about to go to the next level.Enjoy!",
  "models": [
    {
      "name": "James Huntsman",
      "person_id": 16691
    },
    {
      "name": "Jordan Boss",
      "person_id": 38179
    }
  ],
  "release_date": "2017-06-09",
  "scene_id": 125117,
  "series": "NDO - 4776 - James Huntsman & Jordan Boss",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "First Time Friends"
}