{
  "collections": [
    "Next Door Originals"
  ],
  "description": "For old high school buddies Markie More and Derek Bolt, time sure has flown by. Where once they were teammates in the locker room, now they find themselves married and with adult responsibilities. Still, memories persist as they share a beer by the pool. With their wives away on a day trip, Markie and Derek begin to reminisce about the days gone by, and inevitably, the subject of a particular drunken hook-up comes up. Derek rolls his eyes has Markie recalls what good blow job Derek gave him, and Derek counters that Markie seemed to enjoy it as much as he did. Markie cannot deny Derek, and in an instant, the two old friends are up in the bedroom taking a stroll down memory lane. Derek begins by sucking Markie off, and he's just as good as Markie remembers. Markie returns the favor, getting Derek nice and hard before mounting him. He rides Derek's hard cock, cupping his hands on his ass and spreading his cheeks to allow Derek full access to his hole. Derek pounds away and it's just as good as he remembers. He bends Markie over and pounds him from behind as Markie clutches the bedsheets with every thrust, before the two of them switch, and Markie takes the helm and assumes the dominant role, fucking Derek missionary and stroking Derek's cock,  fucking the cum out of him before pulling out and soaking him with his pent up, married man's load. Derek lay cum-covered in the bed as he and Markie share a laugh for memories revisited.  Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Derek Bolt",
      "person_id": 49243
    }
  ],
  "release_date": "2017-06-16",
  "scene_id": 125209,
  "series": "NDO - 4778 - Markie More & Derek Bolt",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Tattoo/Piercing"
  ],
  "title": "Horny Husbands"
}