{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Nate is wrapping up his paint job while his boss Wesley is outside by the shed putting all the paint away. It's a sunny hot day out and Nate has been working hard all day long painting and then some. Nate takes a sip of water and spills some down his chest which turns him on. He begins to rub the water all over his chest and he pulls down his overalls. He lies down on the mattress and pushes all the paint supplies out of the way to make room for his legs as he man spreads them giving him enough room to pull out his big cock. Meanwhile Wesley is still packing up the gear outside and becomes curious as to what is taking Nate so long. Boss man heads up stairs to find out what is going on. Nate has his cock out stroking it and playing with his big furry balls. Wesley hears some quite moans as he walks closer to the door. He pushes the door open startling Nate who tries to hide his cock but it's too late,his boss as seen his erection. Nate who is completely embarresed figures his fired but Wesley on the other hand decides to help him out by wrapping his eager mouth around that big young cock. He starts to service Nate's juicy hard dick until he drives Nate onto his big throbbing cock. Nate never thought he'd be sucking on his boss's dick let alone has his boss's fingers banging his tight hole. Wesley takes control of his young employee and starts to loosen up his ass with his fingers while Nate's mouth is full of his throbbing cock. Wesley wastes no time in throwing a condom on and pushing his thick dick into Nate's eager hole. He begins to fuck him balls deep hard and fast making Nate moan and whimper with pleasure. Soon enough Nate is riding that cock up and down sliding on every inch of his boss's hard shaft. Wesley continues to fuck Nate on the mattress until his balls are ready to be emptied and so he lies him down on his back and fuck's the cum right out of Nate which makes him unload his built up load all over Nate.  Enjoy!",
  "models": [
    {
      "name": "Nate Grimes",
      "person_id": 49529
    },
    {
      "name": "Wesley Woods",
      "person_id": 47826
    }
  ],
  "release_date": "2017-06-12",
  "scene_id": 125457,
  "series": "Boss Man",
  "tags": [],
  "title": "Boss Man, Scene #01"
}