{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Newbie Casey Jacks is a Bay Area guy with a great attitude and a cute little ass. Immediately sparks are flying between him and Scotty Zee, as Scotty is more excited than usual for this coupling. Casey, for his part, is also excited about the prospect of taking Scotty's big dick, and it's all Rocco can do to keep them from going at each other during the interview. Rocco finally concedes and lets them have their way with each other, and they set to kissing hard as the strip out of their clothes. Casey deep throats Scotty's cock before they switch up, and Scotty lays Casey on his back, working his balls with his mouth before flipping Casey over and tonguing his hole. Giving his ass a hearty smack, Scotty is rock hard, and Casey begs him to fuck him hard, so Scotty obliges him, plunging his meaty cock deep into Casey's hole and pounding him from behind. Casey takes every inch before flipping over and taking control, mounting Scotty and giving him the ride of his life. Casey is close to nutting, and when Scotty flips him over and fucks him missionary, Casey loses his load almost instantly, but Scotty keeps going, fucking Casey even harder until he's ready himself. Pulling out, he hoses Casey down with his load, wetting his chest as he sprays all over the bed. As they embrace for one final sweaty kiss, Rocco asks Scotty if Casey should come back and the look on Scotty's face says it all.  Emjoy!",
  "models": [
    {
      "name": "Casey Jacks",
      "person_id": 49626
    },
    {
      "name": "Scotty Zee",
      "person_id": 46672
    }
  ],
  "release_date": "2017-07-06",
  "scene_id": 125528,
  "series": "NDB - 4783 - Scotty Zee & Casey Jacks",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Scotty Zee Hooks Up With Casey Jacks"
}