{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With his shitty credit and a lack of network resources, Paul Canon was pretty sure his rental application was going to be denied, and sure enough, property manager Dalton Riley delivers the bad news after running the credit check. After discussing his lack of options, Dalton decides that he may be able to help Paul out and rent him a room at his place if the price is right. Paul balks, and Dalton finds out that Paul also doesn't have employment presently. Paul realizes he really doesn't have a lot of options, but fortunately for him, Dalton has an idea that for an arrangement that Paul might be able to swing. Namely, Dalton tells him he can rent him the place provided that Paul shows some form of physical appreciation. Paul quickly understands the terms of the agreement, and as Dalton falls to his knees and begins to suck him off, Paul decides this might be the best offer he'll ever have, so he willingly goes along with whatever Dalton wants. For his part, what Dalton wants is a piece of Paul's sweet ass, and maybe even a test ride on Paul's cannon, so he bends Paul over and has his way with him, raw dogging him from behind before flipping him over and fucking him missionary on the table. Satisfied that Paul's got the necessary assets, he looks to see if Paul knows how to use them, mounting Paul's rock hard cock and riding him reverse cowboy as he strokes himself off. As Paul thrusts and pounds, Dalton loses his load all over the floor, telling Paul to finish inside him. Paul does as he's told, fucking Dalton raw until he shoots his load deep inside him, then pulling out and watching it spill out of his hole in a sticky, wet mess. Slapping his cum drenched cock against Dalton's hole, the two of them agree that this is the start of a beautiful situation.Enjoy!",
  "models": [
    {
      "name": "Dalton Riley",
      "person_id": 48651
    },
    {
      "name": "Paul Canon",
      "person_id": 36900
    }
  ],
  "release_date": "2017-06-28",
  "scene_id": 125541,
  "series": "NDR - 81 - Dalton Riley & Paul Canon",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Brunette",
    "Caucasian",
    "Climax",
    "Creampie",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Physical Rent"
}