{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With a house full of stuff to pack up, Ethan Slade decides to take a break from all the moving. As moving buddy Jackson Traynor returns to the house from running a supply errand, he finds Ethan on the sofa, pants down to his ankles, dick shamelessly on hard in his hands. Questioning his motives, Jackson asks Ethan what's so important that he can't wait. Ethan shows Jackson what he's jacking off to and Jackson agrees it's a nice ass, and decides to join him. Moments later, Jackson realizes he's stroking his cock looking at a guy's ass, and Ethan quickly goes for the close, telling Jackson it's fine, and dialing up some straight porn for him to look at while Ethan begins to suck him off. Jackson admits it's kind of weird but goes with it, and is quickly rewarded when Ethan turns out to give great head, deep throating Jackson in a manner which he's never experienced with a woman. Jackson seems onboard, so Ethan asks him to return the favor, and it turns out that the straight boy is a fast study, quickly figuring out how to give a good blow job. With both guys rock hard, Ethan decides to mount Jackson, riding his cock reverse as he shows off his own nice ass. Jackson agrees it's even nicer than the one in the porn, and Ethan takes this vote of confidence as a free pass to have his way with the straight boy cock inside of him, so he rides it to his heart's content before telling Jackson to bend him over and pound the cum out of him. Jackson does as he's told, long dicking Ethan as he bends over the side of the sofa, before flipping him back over and fucking him until he spits his load all over his chest. Jackson pulls out and blasts Ethan in the face with his load as Ethan smiles and tells him he did a pretty good job for a straight boy, but maybe he could use a few more reps. Jackson smiles at that thought.  Enjoy!",
  "models": [
    {
      "name": "Ethan Slade",
      "person_id": 47398
    },
    {
      "name": "Jackson Traynor",
      "person_id": 49107
    }
  ],
  "release_date": "2017-06-30",
  "scene_id": 125564,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "First Time Move"
}