{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Jake Archer is in his underwear in the living room checking out his phone when Gabriel Alanzo enters while listening to his headphones.  Gabriel is dancing and making Jake giggle when he comes over and makes the moves on Jake.  They make out and grind pelvis on pelvis through the cotton fabric of their tighty whities when Ryan Rose casually walks in and joins the action.  Ryan sits down and immediately becomes the focus of the other two hunks.  Jake and Gabriel take turns sucking Ryan, working his hard member and licking every inch of his ripped body.  Jake pulls out his fully erect manhood and slips it into Ryan's mouth as Gabriel completes the chain down between Ryan's legs.  Not a writhing body goes without attention as the threesome works and pumps and grinds on every patch of available skin. Jake gives Gabriel lots of oral pleasure as Ryan enters him from behind.  Gabriel wants in on the riding action and the guys switch it up so everyone can get a bit of Ryan inside their tight bodies. Ryan takes turns on each lucky stud, giving them exactly what they want and need.  Jake is the first to give in, and as Ryan keeps up a steady pace, Jake lets loose all over his own perfect abs.  When Gabriel sees Jake let go, he follows suit and explodes his passion all over Jake's panting body.  That's Ryan's cue to join the guys and finish up as he covers Jake with a shower of cum from above.  The guys kiss and continue to enjoy each other's bodies in the afterglow of their 'Intimate', fun and sensual escapade.",
  "models": [
    {
      "name": "Gabriel Alanzo",
      "person_id": 49392
    },
    {
      "name": "Jake Archer",
      "person_id": 49606
    },
    {
      "name": "Ryan Rose",
      "person_id": 27407
    }
  ],
  "release_date": "2017-06-23",
  "scene_id": 125793,
  "series": "Intimate",
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Cumshot",
    "Foreskin",
    "Group Sex",
    "Latino",
    "Oral Sex",
    "Tattoos"
  ],
  "title": "Intimate"
}