{
  "collections": [
    "Hot House"
  ],
  "description": "Ripped stud, Sean Zevran, is training his muscled-up client, Skyy Knox, at the gym. They work their bulging biceps and perfect pecs before they call it a day and hit the locker room. The well-worked, sweaty hunks peel off their dirty gym clothes as Skyy tries to make small talk. Sean knows what he wants and shows off his thick, uncut cock to get Skyy's undivided attention. The massive hardon makes Skyy hard as a rock and the two gym rats start making out. Skyy needs that pulsing pole down his throat so he gets on his knees to service Sean on the bench by the lockers. Sean face fucks his eager-to-please client and cops a feel of his smooth, tight ass while he plows his face. Sean is throbbing hard and ready for more. Before he goes any further, he needs a taste of Skyy's sweet hole. The anticipation of getting Sean inside his body is almost more than the smooth stud can handle. Sean can sense that Skyy is ready for his hearty meat and slips it inside Skyy's open hole. He pounds his client from behind as Skyy's hard cock bounces and flops with every thrust. Skyy wants to feel the giant cock deeper inside him and hops on for a ride. He bounces up and down taking the big dick balls deep as he jacks his own rod. Sean is ready to be in control one last time and flips Skyy over, plowing the tight hole and hitting all the right spots. Skyy hits his limit with the relentless pounding and can't hold back any longer. He sprays his cut abs with a torrent of jizz that leaves him a sticky, wet mess. When Sean sees the giant load, he gives himself the okay to pull out and walk up to Skyy's panting face. He gives his client a massive creamy facial and then kisses up his cum. If this is the reward for a good workout, there's no doubt more people would be hitting the gym every day!",
  "models": [
    {
      "name": "Sean Zevran",
      "person_id": 33509
    },
    {
      "name": "Skyy Knox",
      "person_id": 49409
    }
  ],
  "release_date": "2017-06-22",
  "scene_id": 125799,
  "series": "The Trainer: No Excuses",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder",
    "Ebony",
    "Interracial",
    "Kissing",
    "Masturbation"
  ],
  "title": "The Trainer: No Excuses, Scene #01"
}