{
  "collections": [
    "Club Inferno Dungeon"
  ],
  "description": "Muscle daddy D Arclyte grabs Nate Grimes by the neck and shoves his tongue down the hung jock's open throat. D is in an aggressive mood and today he wants Nate's fist shoved firmly up his ass. The pair makes out for a bit until D turns around and offers his hole for Nate to open up with his tongue. It's a nice long rimming session that leaves the leather daddy's asshole open, throbbing, and ready to be fed. Amid a torrent of dirty talk from both horny pigs, Nate puts on his rubber gloves and pulls out a giant bucket of lube. He dips his hands in the sticky goo and gets them good and slathered up before he sticks his fingers inside D's gaping butt. It barely takes a second before Nate's whole fist is swallowed up by D's hungry man cave. The horny jock is loving every second of pleasuring his daddy by alternating his hands in and out as strings of lube fall from D's cavernous asshole and Nate's strong arms. D is in complete ecstasy as his mouth gapes and his eyes roll back in his head with every plunge from the fit stud's fists. D needs it a little deeper and a lot more rough so he lies down on a bench with his legs in the air and lets Nate plunge his hole even harder. Nate gets wrists deep inside his daddy as he hurriedly switches hands and keeps up the intensity of the extreme fisting session. All the hole stretching and deep penetration gets D hard as a rock and ready to burst. D stands above Nate as the cum hungry hunk takes a massive load of D's creamy jizz in his eager mouth and on his smooth, tight chest.",
  "models": [
    {
      "name": "D Arclyte",
      "person_id": 48883
    },
    {
      "name": "Nate Grimes",
      "person_id": 49334
    }
  ],
  "release_date": "2017-06-29",
  "scene_id": 125792,
  "series": "Pig Alley",
  "tags": [
    "Anal Sex",
    "Cumshot",
    "Daddies",
    "Fisting",
    "Kissing",
    "Oral Sex",
    "Rimming",
    "Rubber",
    "Tattoos"
  ],
  "title": "Pig Alley"
}