{
  "collections": [
    "Active Duty"
  ],
  "description": "I hope you are ready for a Fourth of July celebration with Quentin, Ryan and Princeton. These three are the best veterans to date and they bring the sexy, pounding, sweaty, fun and cum galore with a great 3 way bang.   These three soldiers are really good friends and you can see it as they have fun laughing and enjoying each other to the fullest. We wanted to spice things up so we decided to have them play a quick game of twister to find out who will get loads of cum blasted on to their face. They've got their cowboys hats ready and they drop their drawers and the game begins. They get all twisted up and just can't stop laughing and before you know it Ryan falls on his ass and loses the game. Quentin and Princeton can't wait to bust their nuts on his face. They all gather up on the bed and begin to blow each other. It's a spin wheel type of look as they are all intertwined with each mouth filled with hard dick. They are all gagging and spitting while deep throating one another. What better way to celebrate our independence with these three hunks taking turns fucking their holes. It's an orgy of sorts as they keep switching off from one hole to the next having as much laughs and pleasure as possible. Their balls are built up to the max as each one has fucked the other but Ryan lost the game of twister so he lies on his back as Quentin and Princeton stroke their huge loads out all over Ryan's awaiting face. The cum drenches his face as Ryan continues to beat his hard dick until finally his nut explodes all over his chest.Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    },
    {
      "name": "Princeton Price",
      "person_id": 46796
    }
  ],
  "release_date": "2017-07-02",
  "scene_id": 125873,
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Facial",
    "Gay",
    "Muscular",
    "Rimming",
    "Smooth",
    "Tattoos",
    "Threesome",
    "White Butt"
  ],
  "title": "Quentin Gainz, Ryan Jordan & Princeton Price"
}