{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Handsome soldier Fane Roberts is assigned to his new post with fellow stud grunt Brandon Evans. After spending so much intimate time together, their attraction and feelings are undeniable. Unable to resist any longer, they secretly swap head in the barracks. Fane moans loudly as he shoots a creamy load down Brandon's virgin throat. Sergeant Zevran passes by nearly catching them in the act. Meanwhile, out in the hot desert sun, Ryan Rose and Tommy Regan are on a military patrol. There's no one around for as far as the eye can see so the Marines take off their protective gear to get more comfortable. Ryan takes it a step further and unbuckles his belt to pull his dick out of his fatigues. Tommy tries to ignore Ryan jacking off behind him and when Ryan asks Tommy to show his ass, Tommy refuses. Ryan is the commanding officer and orders Tommy to remove his pants. Tommy obeys the order and bends over to let his superior officer rim his cute, fit bubble butt. Tommy admits that the rim job feels good, and as it continues, it gets him in the mood for more action. Tommy turns around to offer up his growing erection. Ryan can't wait to get Tommy in his mouth and treats his subordinate to a nice long blowjob as he leans against a shelled-out cement wall. All the sucking gets Tommy in the mood to take a taste of Ryan's hard dick. He services the ripped stud on his knees until Ryan instructs Tommy to turn around. Ryan slips his big stiff rod inside Tommy's tight ass and has his way with him as the muscled up military jock bends over to take it deeper inside his body. Ryan keeps a steady pace and uses Tommy's perfectly fit form to get himself off. He pulls out and covers the military stud's groin and abs with a river of white and creamy satisfaction.",
  "models": [
    {
      "name": "Ryan Rose",
      "person_id": 27407
    },
    {
      "name": "Tommy Regan",
      "person_id": 49162
    },
    {
      "name": "Fane Roberts",
      "person_id": 49692
    },
    {
      "name": "Brandon Evans",
      "person_id": 49696
    }
  ],
  "release_date": "2017-06-30",
  "scene_id": 125970,
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Boots",
    "Cumshot",
    "Masturbation",
    "Military",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Code of Silence, Scene #01"
}