{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Alex Mecum is lifting weights at the gym with his buddy, Micah Brandt. Micah promises Alex a present if he can do 30 reps of bench pressing. Alex takes the challenge and the two studs continue their workout until the chemistry in the air is overbearing. The horny muscle jocks kiss on the floor of the gym as they rub their bulging shorts and help each other out of their tight shirts. Alex is the first to unleash his already dripping beast of a cock, and Micah instantly follows by peeling off the rest of his workout gear. The sight of Alex's big thick dick makes Micah's mouth water. He drops to his knees before he takes the big hardon down his throat. All the cock sucking makes Micah hard as a rock. The two muscle studs 69 on the gym equipment as they suck and gag and drool all over each other's engorged dicks. Alex has fucking on his mind and he knows that he needs to get Micah's bubble butt ready for the action. Micah turns around and sits on his Alex's face to let him tongue fuck his hole. After a nice long rim session, Alex can sense that Micah is open and ready for entry and invites Micah to sit down on his big throbbing cock. Micah wants maximum penetration into his loosened-up asshole and lies on his back on a gym mat so that Alex can fuck him even deeper. The horny studs go at it hard until Alex's more primal instincts kick in and he rolls Micah over on the mat. Alex wraps his big bulging biceps around Micah and dominates him as he fucks his hole into submission. Micah's eyes roll into the back of his head and he dumps his load of cum all over the gym floor as Alex keeps up the relentless pounding. Micah's ass feels amazing and the internal throbbing sensation of Micah cumming on the floor is all it takes for Alex to dump his load. He pulls out and covers Micah's smooth, muscular back with a massive, pent-up load of jizz.",
  "models": [
    {
      "name": "Alex Mecum",
      "person_id": 37766
    },
    {
      "name": "Micah Brandt",
      "person_id": 17903
    }
  ],
  "release_date": "2017-06-29",
  "scene_id": 125966,
  "series": "The Trainer: No Excuses",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder",
    "Hairy",
    "Interracial",
    "Kissing",
    "Latex",
    "Underwear"
  ],
  "title": "The Trainer: No Excuses, Scene #02"
}