{
  "collections": [
    "Next Door Originals"
  ],
  "description": "When Dante Martin discovers that boyfriend Ethan Slade has been cheating on him, he quickly realizes he has one of two options. He can either end it all immediately, or he can try to fix the problem between them. Dante settles for option 2, and figures the main reason Ethan is stepping out is because he's not satisfied with their sex life. So creeping his way back to bed, he begins to kiss on Ethan's neck, waking him up as his cock begins to poke Ethan in the back. Ethan stirs awake and rolls over, as Dante works his way down to Ethan's cock, taking it into his mouth and sucking him off. Ethan closes his eyes and enjoys the morning BJ before Dante swings his leg over Ethan and they begin to 69.  Now fully hard, Dante wags his dick in the air and Ethan mounts it, riding Dante reverse and grinding his ass against Dante's cock. Dante fucks him like that for a while before flipping him over and continuing to give Ethan some of his rock hard dick, but when Dante tells Ethan to switch it up, Ethan is confused. 'You never let me fuck you,' Ethan says, but with a look, Dante lets him know today is different, so eagerly, Ethan plunges his cock deep inside Dante, pounding him missionary as Dante strokes himself dry, spitting his massive load all over himself as Ethan pulls out and blasts him with his morning load. Falling back into bed as Ethan goes to shower up, Dante wonders if his efforts are enough to save his relationship. Only time will tell...Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Ethan Slade",
      "person_id": 47398
    }
  ],
  "release_date": "2017-07-21",
  "scene_id": 125989,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athlete",
    "Athletic",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Condom",
    "Gay Couple",
    "Gay Porn",
    "Jerking off",
    "Muscular",
    "Oral"
  ],
  "title": "Cheat the Cheater"
}