{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Tatted leather daddy Michael Roman and bearded muscle hunk Tex Davidson stick their big hard cocks through a double glory hole. They don't have to wait a second before Ryan Finch and Hoytt Walker come in and offer up their hungry mouths to suck them off. Hoytt takes on Michael, and Ryan gets Tex's massive curved cock. The horny studs both suck dick like it's the last one they'll ever see. They gag and spit as they get their faces fucked and their throats stretched. Hoytt walks over to give Ryan a helping hand with Tex's tasty meat. They take turns sucking him off and give him a double blowjob with a slobbery, wet mouth on each side of his big sweaty cock. Tex thrusts his pole between their mouths until Michael steps in to offer up a third mouth. Tex pounds Michael's mouth through the glory hole until the guys pair up again. Snagging Hoytt away to a bench, Michael sits down to let the bearded stud suck his cock one more time. Hoytt's big balls hit the floor as he bobs up and down on the tatted daddy's cock. Hoytt tickles Michael's big hairy sack with his tongue and begs for cum in his face. Michael lets go and slathers Hoytt's bushy beard and wide-open mouth with a massive load of jizz. Hoytt gobbles up every last drop and sucks what didn't land on his face off the tip of Michael's still throbbing cock. Michael returns the favor to the bearded stud. He sucks him off and tugs his nuts until Hoytt blasts his own load on Michael's face, beard, chest, and in his mouth. The studs rub beards and swap cum as they catch their breath from the eye watering, thirst quenching, cock sucking marathon.",
  "models": [
    {
      "name": "Hoytt Walker",
      "person_id": 49605
    },
    {
      "name": "Michael Roman",
      "person_id": 49303
    },
    {
      "name": "Ryan Finch",
      "person_id": 49651
    },
    {
      "name": "Tex Davidson",
      "person_id": 47226
    }
  ],
  "release_date": "2017-07-03",
  "scene_id": 125968,
  "series": "Beards, Bulges & Ballsacks!",
  "tags": [
    "Big Dick",
    "Boots",
    "Hairy",
    "Oral",
    "Tattoos",
    "cum shots"
  ],
  "title": "Beards, Bulges & Ballsacks!, Scene #04"
}