{
  "collections": [
    "Hot House"
  ],
  "description": "Austin Wolf is training Johnny V and Jeremy Spreadums at the gym. He has them doing all the regular things to stay in shape like climbing rope, doing chin-ups and lifting weights. Austin pats them on the ass with every good rep. All the physical contact and exposed muscles gets the threesome ready for fun and they peel off their shirts as they kiss and feel each other's boners through their gym shorts. Jeremy can't take the suspense of what the other cocks must taste like and he gets on his knees to suck off his two gym buddies. He takes turns slurping on each of their growing cocks and gets the guys ready for more action. Austin is horny as hell and wants to explore more of what Jeremy has to offer. Austin has Jeremy bend over, and like a true trainer, tells Jeremy what to do as he fingers and licks his client's fuzzy hole. Jeremy gets on the ground and spreads his legs wide open to let both Johnny and Austin rim his ass. Once the guys have Jeremy's hole nice and opened up with their tongues and fingers, Austin crams his thick cock inside Jeremy's back door. Johnny doesn't want to be left out of the fun and takes his turn with Jeremy when Austin steps aside to let him have a turn. The muscle studs tag team Jeremy's asshole as they pile drive the young jock. Johnny hops in the middle of the sandwich to fuck Jeremy as he gets his hole plunged from his trainer. The three horndogs form a chain with Johnny in the middle getting the best of both worlds until all three are ready to blow. Jeremy lies on the ground with the two other studs above him. Johnny lets loose and drains his balls all over his buddy, slathering his nipples with cum. The trainer is the next to go and lets loose all over Jeremy's face before Jeremy finally gives himself the go ahead to get the relief he needs all over his own muscled-up body. The three spent hunks writhe on the floor with their cocks dripping as they kiss and bask in the afterglow of the benefits of a healthy workout.",
  "models": [
    {
      "name": "Austin Wolf",
      "person_id": 37357
    },
    {
      "name": "Jeremy Spreadums",
      "person_id": 48583
    },
    {
      "name": "Johnny V",
      "person_id": 35558
    }
  ],
  "release_date": "2017-07-06",
  "scene_id": 126077,
  "series": "The Trainer: No Excuses",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder",
    "Group Sex",
    "Interracial",
    "Kissing",
    "Latino"
  ],
  "title": "The Trainer: No Excuses"
}