{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Tex Davidson and Ryan Finch don't fuck around when it comes to getting dirty. The hairy, rugged studs kiss and rub beards for a hot second before Ryan lies back with his legs in the air and offers up his fuzzy asshole. Tex gets in deep with his tongue and fingers to get the tight, pink hole dripping wet with spit. Tex loves sucking on a nice asshole and he takes his time, savoring every lick he can get from Ryan's ready hole. Ryan can't wait for Tex to stretch him out even more with his giant cock and hops on to ride the tatted stud's thick dick, taking it all the way down to Tex's big, tight balls. Ryan's wet, hairy dick and loose sack flop with every thrust from Tex. The hunky muscle studs grunt and groan as they fuck and work their way to the final round of hairy man love. The more Ryan gets his hole plunged, the harder his big cock gets. He jacks the throbbing shaft up and down and massages his lubed-up head before the guys change up the fun. Ryan submits and gets on his back for Tex to take charge and fuck his hole the way Tex likes it. The aggressive top pounds Ryan harder than he's ever been fucked before and keeps up the relentless reaming until he fucks the cum right out of Ryan's big pole. Ryan sprays his own hairy crotch and then begs for Tex to do the same. Tex pulls his giant slab of meat out of Ryan's stretched out asshole and slathers Ryan's spent balls with every last drop of cum he can muster. Ryan is a sticky mess of jizz, sweat, and spit by the time Tex is done having his way.",
  "models": [
    {
      "name": "Ryan Finch",
      "person_id": 49651
    },
    {
      "name": "Tex Davidson",
      "person_id": 47226
    }
  ],
  "release_date": "2017-07-07",
  "scene_id": 126078,
  "series": "Beards, Bulges & Ballsacks!",
  "tags": [
    "Anal",
    "Big Dick",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "rimming"
  ],
  "title": "Beards, Bulges & Ballsacks!, Scene #05"
}