{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Gay seller Daymin Voss is running a booth at the show when Tristan Jaxx shows up just as Daymin's stand is closing for the day. Tristan is looking to buy something for self-defense but doesn't know much about owning a piece. Daymin shows him how to hold it and when Tristan is holding the weapon up, Daymin comes up behind him. The touch of Daymin's big manly hand on his side makes Tristan get a stir in his pants and the two studs start to make out. Daymin gets the stranger out of his shirt before peeling off his own. The scent of Daymin's manhood is almost more than Tristan can handle and he goes in to worship Daymin's ripe sweaty pits. The session drives Tristan wild and he gets on his knees to take Daymin's big cock in his mouth. Daymin loves dick and can't wait to taste what Tristan has pressing against the fabric of his pants. Daymin removes Tristan's pants and gets dirty by sucking his cock. Daymin loves every inch of it in his mouth and tells his new friend that he's going to open his ass for him. Tristan is more than willing to honor the request and bends Daymin over the table to eat him out. Tristan takes his time with the fresh meat and gets as far inside Daymin's butt as he can get with his fingers and tongue. When Tristan is convinced that Daymin is good and opened up, he stands and slips his hard cock deep inside. He gives Daymin a pounding that the stud won't soon forget and stretches him even further with each thrust. Daymin begs for Tristan to go deeper and grunts harder the further in Tristan gets. Tristan's pelvis slaps against Daymin's bubble butt as skin hits skin. The two studs switch it up more than once and finally settle with the dealer on his back getting plowed. Tristan increases his intensity to get himself closer and plugs away as Daymin begs for him not to stop. Daymin yells out: 'Dude, you're so fucking deep!' as his cock explodes and varnishes his hairy body with a thick layer of cum. Tristan is happy to have given so much pleasure and pulls his cock out of Daymin's tight hole to blast his own load of cream. It's a real gusher, and it covers Daymin's bush and stomach with a seemingly never-ending barrage of squirts. Daymin can't believe his eyes and feels lucky to be covered in so much jizz!",
  "models": [
    {
      "name": "Daymin Voss",
      "person_id": 49577
    },
    {
      "name": "Tristan Jaxx",
      "person_id": 19791
    }
  ],
  "release_date": "2017-07-21",
  "scene_id": 126143,
  "series": "Gun Show",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Hairy",
    "Interracial",
    "Military",
    "Oral",
    "Tattoos",
    "masturbation",
    "rimming"
  ],
  "title": "Gun Show"
}