{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Michael Roman and Pierce Paris are right-wing Americans at the show. They run into Bruno Bernal who doesn't quite fit into Michael and Pierce's idea of what an American should look and act like. After chanting 'build the wall' to Bruno's protests, the two country boys take him to a back room and throw him to the ground as they unzip their pants and whip out their big thick cocks. Bruno loves the idea of getting the two hicks' dicks down his throat and he opens his mouth for Michael and Pierce to stuff his face. Bruno complies with every one of the demands from Pierce and Michael and even sucks on their hairy, sweaty assholes to make the guys think they're dominating everything he does. Bruno is having the last word by getting his face used like a hole for the two hot studs to double fuck his mouth at the same time. It's a tight squeeze fitting all that meat in his face at once, but Bruno manages to get the job done. The rednecks want to take their fun to the next level and shove Bruno into a utility closet. Michael needs Bruno's tight hole wrapped around his massive cock and he bends him over a table to stuff his asshole balls deep while Pierce takes control of the front to complete the spit roast. With all of Michael's raves about Bruno's tight ass, it's time for Pierce to get a feel and he slips his massive rod deep inside Bruno's well-worked butt. With all the big cock and ass fucking action, Michael wants to see what all the fuss is about and offers up his own ass for Pierce to destroy. Bruno sits on the man's face while Pierce works his buddy from behind. Michael moans out for Pierce to fuck him harder and Pierce takes the challenge. He pounds as hard as he can until his big stick finally puts Michael over the edge and he blows a massive load all over his own hairy abs. Once Pierce sees that he's done the job of getting his buddy off, he pulls out and dumps his own load all over to mix with Michael's pure white jizz. Bruno finishes off in Michael's mouth then grabs their clothes, flips them off, calls them 'fucking assholes' and leaves the two rednecks alone and naked to 'make America great again' on their own in the closet.",
  "models": [
    {
      "name": "Bruno Bernal",
      "person_id": 46900
    },
    {
      "name": "Michael Roman",
      "person_id": 49303
    },
    {
      "name": "Pierce Paris",
      "person_id": 49720
    }
  ],
  "release_date": "2017-07-14",
  "scene_id": 126142,
  "series": "Gun Show",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Hairy",
    "Military",
    "Oral",
    "Tattoos",
    "double oral penetration",
    "masturbation",
    "rimming"
  ],
  "title": "Gun Show"
}