{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Second Amendment activist Sean Duran is handing out right wing literature at the show and sets his sights on Rikk York. Sean tries explaining to Rikk that 'cry-baby liberals are gonna take away all our firearms!' Rikk likes what he sees in Sean and offers to talk about Sean's concerns in a more private setting. The minute they get alone, Rikk makes his moves on the tatted stud and goes in to give him a kiss. Sean protests at first, not understanding what the hell is going on. Rikk calms Sean's little conservative brain by telling him to relax and by reaching into his bulging camouflage pants to rub his growing chub. It only takes a second for Sean to whip out his dick and peel off his Ted Nugent vintage Tee. Rikk isn't quiet about sucking on Sean's hot rod and gags and spits as he slobbers all over it. The guys are within ear shot of the booth owner who keeps turning around to see if what he's hearing is real. He sneaks over to get a better listen as Rikk bends over and gets his asshole eaten out by Republican Sean and his not-so-conservative ass licking tongue. When Sean is sure he could fit the barrel of a Glock 17 firmly all the way up Rikk's butt, he splays the muscle jock over a container with his legs in the air and inserts his weapon of choice. It's a beautiful thing to see two horny studs fucking in front of a rack of firearms at a public show, and both hung dudes are getting off to the idea. All the weaponry surrounding them and the sensation of Rikk's tight ass enveloping his giant cock is all that Sean can handle. He pulls his meat out and dumps his load all over Rikk's hot ass. After all the action, Sean is thirsty and needs to taste what's inside Rikk's loaded dick. He gets under Rikk's big hairy dick and opens his mouth to get every drop that Rikk has in his emptied-out chamber.",
  "models": [
    {
      "name": "Rikk York",
      "person_id": 47778
    },
    {
      "name": "Sean Duran",
      "person_id": 36945
    }
  ],
  "release_date": "2017-07-28",
  "scene_id": 126144,
  "series": "Gun Show",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Hairy",
    "Interracial",
    "Military",
    "Oral",
    "Tattoos",
    "masturbation",
    "rimming"
  ],
  "title": "Gun Show"
}