{
  "collections": [
    "Next Door Raw"
  ],
  "description": "After settling into their vacation rental for the week, school friends Scotty Zee and Ian Greene realize they only have about fifteen minutes until their parents show up, and both of them are ready for a shower after a half day's travel. Luckily, as Ian points out, the shower has two heads. Scotty seems hesitant to partake in such an arrangement, but his desire to be clean outweighs his reluctance to share the bathroom. When he enters the shower, he finds Ian already halfway clean, and taking his place beside his friend, he commences to soaping off. Ian can't help but stare at Scotty's figure, noting his perfect ass and his nice cock. Ian reaches out to touch the perfect ass in front of him, and Scotty recoils at first, but almost immediately seems to consider Ian's silent offer. Relenting, he and Ian embrace and begin to kiss, and in an effort to seize the moment, Ian falls to his knees and begins to suck Scotty off. Scotty grows hard inside Ian's mouth and then experiences something entirely new when Ian bends him over to eat his ass. But that's nothing compared to the first time experience that happens next, as Ian plunges his raw cock deep inside Scotty's tight hole. Ian pounds Scotty from behind and Scotty takes every bareback inch willingly until Ian tells them to switch, and it's Scotty's turn to raw dog his friend, bouncing Ian on his cock as he runs his hands up and down Ian's back. Scotty is turned on by this, but quickly admits to Ian that he'd rather be the one getting fucked, so they switch again, and Ian plays Scotty out on the floor, fucking a massive load out of him missionary style before pulling out and wetting his friend down with his first gay load, just as the guys can hear their parents coming down the hall.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Ian Greene",
      "person_id": 48341
    },
    {
      "name": "Scotty Zee",
      "person_id": 46672
    }
  ],
  "release_date": "2017-07-26",
  "scene_id": 126168,
  "series": "NDR - 85 - Scotty Zee & Ian Greene",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Friendly Vacation"
}