{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Sergeant Sean Zevran comes up behind his subordinate, Brandon Evans, and grabs his ass. Brandon is taken off guard. 'I see everything in in this camp,' Sean says. 'I know you two have been sneaking out in the middle of the night to suck each other off.' Sean pulls Brandon's pants off and asks if he likes sucking dick. Brandon denies it once but after a berating from Sean, he finally admits that he does indeed like sucking dick. Sean pushes Brandon to his knees and slides his thick, uncut pole all the way down Brandon's throat. Brandon gets his face reamed and then takes a taste of Sean's big low hanging balls. Brandon loves every second of the impromptu action and takes every inch that Sean has to offer. Sean never waivers on his authority over Brandon and Brandon knows that he needs to do whatever Sean wants. Sean bends Brandon over a table and rims his fuzzy little hole. The sergeant works Brandon's ass and finally asks if he's ready for his dick. Brandon yells out 'Yes, Seargent!' before Sean slips his massive member deep inside. Sean is definitely the authority figure to the submissive Brandon, who just wants to please his superior officer. The sergeant isn't going to finish without having his way. He wants one more position to truly feel everything that Brandon has to offer. He gets Brandon on his back and enters the muscle stud to go as deep as he possibly can. The pounding makes Brandon blow his load all over his own hot and ripped torso. Sean won't be left out of the action and pulls out to drop his own load all over Brandon's well-worked and still heaving body.",
  "models": [
    {
      "name": "Sean Zevran",
      "person_id": 33509
    },
    {
      "name": "Brandon Evans",
      "person_id": 49696
    }
  ],
  "release_date": "2017-07-21",
  "scene_id": 126149,
  "tags": [
    "Anal Sex",
    "Bodybuilder",
    "Boots",
    "Cumshot",
    "Military",
    "Oral Sex",
    "Outdoor Sex",
    "Rimming",
    "Uniforms"
  ],
  "title": "Code of Silence, Scene #05"
}