{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Kyle McMillan has a camera and he's sneaking up on Pierce Paris in his tent on the military base to see what Pierce is up to. Kyle is in for a surprise when he finds his buddy fully immersed deep inside a FleshJack. Pierce pleads for privacy but Kyle insists that there's no such thing in the military. Kyle offers up some help and when Pierce has his eyes closed, he slips the FleshJack off of Pierce's stiff dick and starts using his hands and mouth. Pierce has no complaints and rolls with the new development. When Kyle sees that Pierce isn't going to put up a fight, he gets more into the work of pleasing the hung stud. Kyle's mouth and fist feel amazing enveloping the thick dick and Pierce takes off his shirt as the action gets more heated. Kyle comes up for some air and the two studs make out as Kyle gets out of his uniform. Pierce is so aroused that he's ready for anything. When he sees Kyle's uncut dick, he immediately opens wide and goes down to service the fit jock. Once he has his fill, he bends Kyle over and gets busy eating him out. His tongue goes deep and he loosens Kyle up for insertion. Pierce enters his toned friend and pumps away, even commenting on how tight Kyle feels. Pierce has Kyle lie back with his legs in the air for maximum penetration. The big dick goes as deep as possible while Kyle strokes his own rod to get himself close. Pierce says that he wants to make Kyle cum, and that's enough for Kyle to let loose and cover his own body with pleasure. Once Pierce has done his job, he's ready to finish up. His big dick explodes on Kyle's face as sweat runs down Pierce's muscled body. Kyle can't get enough of Piece's plump dick and continues to suck and taste the stud's cum in the extreme desert heat.",
  "models": [
    {
      "name": "Kyle McMillan",
      "person_id": 49713
    },
    {
      "name": "Pierce Paris",
      "person_id": 49714
    }
  ],
  "release_date": "2017-07-14",
  "scene_id": 126113,
  "series": "Code of Silence",
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Cumshot",
    "Masturbation",
    "Military",
    "Oral Sex",
    "Rimming",
    "Uniforms"
  ],
  "title": "Code of Silence, Scene #04"
}