{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With their girlfriends away on some kind of all day errand, Johnny Hill and Dalton Riley sun themselves by the pool, bored as all get out. Dalton makes the remark that the girls may as well be dating each other, which foreshadows the events to come, as Johnny gets a look that suggests that may not be the worst idea. Dalton says he's heard all about Johnny's prowess in the bedroom from his sister, Johnny's girlfriend, and Johnny says Dalton's sister has told him that it's Dalton who has that good dick, so curious, they take themselves inside to settle this bet once and for all. Seeing that both of them are well hung, Dalton slowly reaches out for Johnny's cock, taking it in his hand and softly stroking it as it gets more and more firm. Johnny insitinctually kisses Dalton, then immediately withdraws, apologizing for losing his head. Dalton tells him he enjoyed it, and both guys decide to give in to their urges as Dalton drops to his knees and sucks Johnny off. Johnny grows nice and hard, and Dalton begs him to fuck him, so Johnny bends Dalton over the back of the couch and slowly slips his hard cock deep inside. Johnny's raw cock fills Dalton's hole as he slams him from behind, but Dalton wants to be in control, so he mounts Johnny and gives him the ride of his life. Johnny's cock is rock hard as it penetrates Dalton's hole, and ready to cum, he flips Dalton over and fucks him missionary.  Dalton cums hard as Johnny continues to pound, pulling out and jizzing all over Dalton's hole before shoving his cock back inside and breeding his girlfriend's brother in what surely won't be the last hookup between them. Enjoy!",
  "models": [
    {
      "name": "Dalton Riley",
      "person_id": 48651
    },
    {
      "name": "Johnny Hill",
      "person_id": 49385
    }
  ],
  "release_date": "2017-08-02",
  "scene_id": 126188,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athlete",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Gay Porn",
    "Jerking off",
    "Muscular",
    "Oral"
  ],
  "title": "While the Girls are Away﻿"
}