{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Quentin Gainz and boyfriend Roman Todd are looking to hire some help around the house, and when they stumble across Tyler Carver's application, they are pretty sure they've found their man. All that remains is for them to conduct a face to face interview to make sure Tyler is a good fit for them.  Upon meeting him, their original assumptions prove true, as Tyler nails every part of the interview. Quentin and Roman are ready to offer him the job, but first there's one last qualification they need to check. Moving together to sit next to Tyler on the sofa, Quentin and Roman each place a hand on his thigh, sliding their hands up his pant leg to see what he's working with. Tyler is visibly nervous, and Roman asks him if he knows what a house boy does. Tyler says sure, and communicates to them that he's ok with this, and so Roman and Quentin commence to breaking in their new employee, as Quentin strips him out of his shorts and begins to suck him off as Roman fondles his upper body, also working his way out of his shorts.  Setting Tyler up between them, Quentin moves on to eating Tyler's ass while Roman feeds him his hard cock, and after moistening up his hole, Quentin plunges his raw cock deep into Tyler, pounding him bareback from behind while Roman continues to gag him with cock on the front end. Now good and hard, Roman wants to get a piece of Tyler's ass, so he has Tyler mount him, and proceeds to work Tyler's hole from beneath, before laying him out on his back. Quentin and Roman then take turns pounding Tyler's hole raw as he strokes himself hard, and satisfied that the arrangement will work out, they pull out and both blast him with a double facial as Tyler strokes his own load all over himself. Cum covered, Roman tells Tyler he's got the job, and that he can expect many more days like this one in the future.  Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    },
    {
      "name": "Roman Todd",
      "person_id": 46827
    },
    {
      "name": "Tyler Carver",
      "person_id": 49244
    }
  ],
  "release_date": "2017-07-28",
  "scene_id": 126167,
  "series": "NDO - 4790 - Quentin Gainz, Roman Todd & Tyler Carver",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Caucasian",
    "Facial",
    "Gay Porn",
    "Hairy",
    "Jerking off",
    "Muscular",
    "Oral",
    "Rimming",
    "Threesome"
  ],
  "title": "The House Boy"
}