{
  "collections": [
    "Hot House"
  ],
  "description": "Rex Cameron is giving a sports massage to Arad Winwin after a long, hard workout. Arad is oiled up on the table as Rex works his muscles with a deep tissue massage. All the work from Rex's strong hands is getting Arad worked up. It's hard for him to relax as Rex works his way down Arad's bulging body. Rex can see that Arad has popped a boner that's splayed out on the table like a tail between his legs. Rex doesn't want to waste the opportunity of having such a hot muscle stud horny on his table and gets Arad to roll over onto his back so he can really work the muscle that counts. Rex adds a bit more oil and rubs it into Arad's pecs without losing sight of the big hard cock that's throbbing just below his abs. As Rex goes down on his client, Arad enjoys every second of the royal treatment and flexes his muscles to get Rex even more horned up and ready for the next step. Rex peels off his gym clothes and gets on his knees to take Arad's stiff one even further down his throat. Arad face fucks his massage therapist and fills his mouth and throat with his hard cock. Ready to go a bit further, Arad bends Rex over the massage table to lick his smooth, tight ass.After a nice long rimming and fingering session, Arad declares that he's 'going to fuck that ass'. He stands up and shoves his meat deep inside Rex's tight hole and pumps away, stretching it out with every intrusion from his big cock. The studs go deep and hard on the table with Arad taking control and dominating Rex every turn of the way. Arad fucks Rex until he can't hold off cumming any longer. With Arad pumping his hole, Rex shoots a geyser of cum that covers ripped torso and even squirts up to his face. With his massage therapist covered in jizz, Arad needs to finish off. He pulls Rex down to the floor and beats his meat into Rex's wide open mouth. Even after cumming all over Rex's mouth and face, Arad continues to be the alpha male and flexes his muscles as Rex keeps worshiping his body and taking all of Arad's commands.",
  "models": [
    {
      "name": "Arad Winwin",
      "person_id": 49394
    },
    {
      "name": "Rex Cameron",
      "person_id": 46848
    }
  ],
  "release_date": "2020-05-04",
  "scene_id": 126214,
  "series": "The Trainer: No Excuses",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder"
  ],
  "title": "The Trainer: No Excuses"
}