{
  "collections": [
    "Club Inferno Dungeon"
  ],
  "description": "Nate Grimes is being interrogated for a code word and even with all the military intimidation, he won't give up the info. Whether or not he has what Ashley Ryder needs is something only Nate knows, but Ashley is going to try his best to get Nate's secret, even if he has to pull it out of his ass. Ashley's tactics are less than conventional and he starts by restraining Nate's hands and ripping off his clothes. 'You better think long and hard about that code word,' Ashley says, as he dips his gloved hands in a vat of grease and shoves his fists up Nate's gaping ass. Nate secretly likes getting his hole stretched and even if he knows the code, he's not going to give it up just yet. Ashley's hands feel amazing going wrist deep in and out of his asshole and Nate begs to be tortured for two more days. 'Open that hole. Make it gape,' Nate demands as if he's in the position to do so. The tables turn and suddenly Ashley is caving to all of Nate's desires. Ashley frees Nate of his restraints and lets the prisoner get on his back. Needing a deeper arm in his ass, Nate spreads his legs wide as Ashley alternates fists and plunges them deep inside Nate's protruding rose. Ashley is relentless in his fist pounding and wants Nate's cum. He sucks on the prisoner's huge cock as he plugs his hole with his closed fists. Nate finally gives Ashley what he really wants with a gusher of jizz that squirts from his big hairy cock and all over his muscled-up body. Like a true pig, Ashley cleans up Nate's cum with his tongue and gloves. Ashley may not have gotten the code word today, but he ultimately got what he really wanted by getting Nate naked with his fist up his ass.",
  "models": [
    {
      "name": "Ashley Ryder",
      "person_id": 49789
    },
    {
      "name": "Nate Grimes",
      "person_id": 49334
    }
  ],
  "release_date": "2017-09-07",
  "scene_id": 126334,
  "series": "Full Fist Interrogation",
  "tags": [
    "Anal Sex",
    "Big Cock",
    "Cumshot",
    "Fisting",
    "Military",
    "Oral Sex",
    "Rimming",
    "Tattoos",
    "Uniform Sex"
  ],
  "title": "Full Fist Interrogation, Scene #05"
}