{
  "collections": [
    "Club Inferno Dungeon"
  ],
  "description": "Hugh Hunter is never done disciplining soldiers for crimes against their own bodies. Matt Wylde is ready for his special one-on-one punishment from Hugh and starts out on his back with his legs in the air. Ashley Ryder is there for support and holds Matt's head and body down as Hugh slams his greased up fist deep into Matt's gaping hairy asshole. Hugh's tatted arm goes in wrist deep and he twists and turns inside the stud's hole to give it that added pleasure. Hugh yells: 'Get on your hands and knees, pig!' Matt doesn't want to piss Hugh off any more than he already is and promptly does as he's told. Ashley falls in line behind Hugh and gets down to lick his ass as Matt continues to get his asshole filled to the absolute limit with Hugh's big hands. Hugh wants to finish off Ashley's punishment and after Matt shows off his massive rosebud, Ashley assumes the position on the table. Matt wants to taste Hugh and gets down to suck on his big cock as Ashley rides his fist elbow deep. Ashley can't hold off another minute and screams out as his cock erupts with a creamy load. The sight of Hugh pulling his entire arm out of Ashley's asshole makes Matt drain his balls all over Ashley's tight, hard body. Hugh's punishment still isn't enough to get the soldiers off the hook. Hugh takes them each by the necks and brings them back to the brig naked, stretched out, and used up.",
  "models": [
    {
      "name": "Hugh Hunter",
      "person_id": 37839
    },
    {
      "name": "Matt Wylde",
      "person_id": 38050
    },
    {
      "name": "Ashley Ryder",
      "person_id": 49789
    }
  ],
  "release_date": "2017-08-24",
  "scene_id": 126333,
  "series": "Full Fist Interrogation",
  "tags": [
    "Anal Sex",
    "Ass Shot",
    "Big Cock",
    "Buttplay",
    "Cumshot",
    "Fisting",
    "Group Sex",
    "Kissing",
    "Male Masturbation",
    "Muscle Men",
    "Oral Sex",
    "Rimming",
    "Rosebud",
    "Tattoos"
  ],
  "title": "Full Fist Interrogation, Scene #04"
}