{
  "collections": [
    "Hot House"
  ],
  "description": "Michael Delray and Kurtis Wolfe are old college football buddies who married their college sweethearts. They get together once a week to watch the Buckeye game The Ready Bar. They're complaining about their wives no longer putting out when Michael sets down his drink and heads to the bathroom. Kurtis watches him leave then follows Michael's lead and heads off to join him. Kurtis can hear Michael beating off in the stall and after a slight hesitation, he pulls out his own big hairy cock and starts jacking off by the sinks. Kurtis peeks through the crack of the stall door and when he sees Kurtis with his dick in his hand, he decides to join his buddy. The two studs jack their thick poles and inch closer to each other the more they get into it. 'Id' kill for a warm mouth to fuck right now,' Michael says. Kurtis gives him a knowing smile and slowly falls to his knees in front of Michael. He grabs Michael's meaty balls and takes his throbbing cock in his mouth. Kurtis savors every second of this new experience and slowly works every inch of the big uncut dick with his mouth. Kurtis wants to take things to the next level and after a quick suck from Michael, Kurtis eats his hairy asshole. When it's nice and opened up, Kurtis slips his massive dick deep inside Michael's tight hole. He pumps away going as deep as he possibly can until Michael is ready to blow. Michael stands up and slathers Kurtis' face with thick white cum. The feel of Michael's load on his face makes Kurtis ready to bust and Micheal gets on his knees and opens his mouth wide. Every drop of Kurtis makes it safely onto Michael's hungry tongue and the two satisfied studs go back to watching their game.",
  "models": [
    {
      "name": "Kurtis Wolfe",
      "person_id": 50726
    },
    {
      "name": "Michael Delray",
      "person_id": 50207
    }
  ],
  "release_date": "2017-07-27",
  "scene_id": 126394,
  "series": "One Night At The Ready",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Masturbation"
  ],
  "title": "One Night At The Ready, Scene #01"
}