{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With his sister gone, Christian Bay lets himself into her house to do some cleaning for money. Assuming the house is empty, Christian gets a little freaked out when he hears sounds coming from upstairs, so cautiously, he decides to investigate. Making his way up the stairs and into the bedroom where the sounds are coming from, Christians fears turn to desire as he spies his sister's boyfriend taking a shower. Paul Canon certainly lives up to his name, and Christian can't help but sneak a few candid pics while he watches. As Paul exits the shower, Christian ducks behind the bedroom wall, but it's too late. Paul sees him and siezes his phone, catching Christian red handed.   Paul is mad but Christian stays cool, eyeing Paul's cock. Paul sees him and asks him if he's gay, and Christian nods yes. Paul asks him if his sister knows and Christian says she doesn't, and that she won't find out if Paul doesn't say anything.   Shocked at his candor, Paul is nonetheless intrigued by the look in Christian's eye, and since his sister won't let him breed her hole, Paul figures he may as well keep it in the family. With a look, he instructs Christian to get started, and Christian dutifully begins to suck him off. Paul throws him onto the bed and they 69 while Paul fingers Christian's asshole, before flipping him around onto his kness and plunging his rock hard cock deep into Christian. He fucks him raw from behind, grabbing his ass and pounding away, before letting Christian mount his cannon and take a ride. Christian spreads his legs wide and grinds away while Paul jacks him off, and as Christian is about to cum, Paul throws him onto his back and fucks him missionary, pulling out to coat Christian's hole before breeding it deeply, throwing Christian's legs open and fucking him until he loses his load all over his stomach. Staring at the mess on his bed, Paul realizes they're both going to have to take another shower.Enjoy!",
  "models": [
    {
      "name": "Paul Canon",
      "person_id": 36900
    },
    {
      "name": "Christian Bay",
      "person_id": 48481
    }
  ],
  "release_date": "2017-08-18",
  "scene_id": 126399,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass to mouth",
    "Athlete",
    "Bareback",
    "Big Dick",
    "Caucasian",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Freshly Bros, Scene #01"
}