{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As the sun rises over the ocean, not a creature was stirring inside the house except Dakota Young, who sneaks out of bed from boyfriend Connor Halsted, making his way to the other side of the vacation rental to where Mark Long lay in bed, morning wood on full display. Dakota quietly slides the door open and inches his way onto the bed, taking Mark's cock into his mouth delicately. He continues to lightly suck Mark, staring down at Dakota diligently pleasuring him. Mark asks where Connor is, and Dakota tells him he's still in bed, but little does he know that Connor has just awoken, and is making his way down the stairs as well. He catches a glimpse of them through the cracked door and decides to watch for just a moment as Dakota downs Mark's giant cock in one swallow, and as he tongues up and down the shaft, Connor decides to join in on the action, diving face first into Dakota's perched ass and tonguing at his hole before shoving his cock deep inside. Dakota keeps sucking on Mark's pole as Connor gives him the business from behind, and once Dakota is nice and opened up, he's ready to mount Mark's rock hard cock. He rides Mark, and even though he can barely take all of Mark's cock, he loves every minute of it before laying in between both guys as they cum all over him, causing him to lose his load in the process. As he lay there covered in a ton of jizz, Dakota smiles and says, 'Now that's what I call a vacation.'  Enjoy!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Dakota Young",
      "person_id": 48374
    },
    {
      "name": "Connor Halsted",
      "person_id": 49822
    }
  ],
  "release_date": "2017-08-16",
  "scene_id": 126402,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Vacation Rules"
}