{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With massage stud Markie More on his way over for a private session, Allen Lucas takes the time and effort to rig his room up with cameras. Allen figures he may as well capture this experience for posterity, and figures he'll have to be secretive about it, and begins to devise a scheme to seduce Markie, but as soon as he undresses and stretches out on Markie's table, he realizes that Markie is very open to extra curricular activity, and that he even is open to filming it. Allen asks Markie if he minds having his dick played with, and Markie goes a step further, shoving it in Allen's mouth and letting him suck him off. Allen obliges, and pretty soon Markie is hard as a rock. Allen asks him if he'll eat his ass, and Markie explains that service isn't usually included in the massage, but since Allen's ass is particularly nice, Markie decides to do it anyway. He moves around and tongue fucks Allen's hole, before sliding up and working his cock deep inside. Allen whips out his phone and asks Markie to film it, and Markie obliges, getting good shots of his cock pounding Allen's ass. Markie flips Allen over onto his back and continues to fuck him dry, as Allen spits his load all over himself before telling Markie to cum on his face. Markie pulls out and hoses Allen down, blasting his face with his load and covering him with cum before the two of them make their way to the shower, where, unfortunately, Allen neglected to set up more cameras. Maybe next time he'll rig the whole house.  Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Allen Lucas",
      "person_id": 47889
    }
  ],
  "release_date": "2017-08-08",
  "scene_id": 126403,
  "series": "NDO - 149 - Markie More & Allen Lucas",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Gay Porn",
    "Jerking off",
    "Massage",
    "Muscular",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Hiring My Hero"
}