{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Casey Everett is all set to dance tonight but he's not sure what to wear, so he's enlisted Jacen Zhu to come over and help him. After modeling a few outfits, they decide on one that's best for Casey and Jacen then asks to see his moves. Casey does a little shake that doesn't do much for Jacen. His disapproval is visible on his face and so Casey asks him to show him, so Jacen stands and helps Casey with his hip movement, gets him to relax, and pressing up against him with his big dick, reminds Casey what he's dancing for in the first place. Consider the message received, as Casey reaches into Jacen's pants and pulls out his meaty cock. Jacen throws Casey onto the couch and strips him out of his outfit, eating his ass as he strokes himself hard. Seeing his cock, Casey gets to work, standing Jacen up and sucking him off before throwing him on the couch and mounting his big dick. Casey takes it deep and hard as he bounces on Jacen's dick, and it's obvious to Jacen that Casey wants it harder, so he flips him over and goes to town from behind.  Fucking Casey hard, Jacen is ready to drop his load but first he flips Casey over and fucks the cum out of him. Casey spits his load all over his stomach before sitting Jacen down and sucking him until he's ready to nut. Jacen pulls out and nuts all down Casey's face and chest. Looking down at him, Jacen tells him this is Casey's best look yet.  Enjoy!",
  "models": [
    {
      "name": "Casey Everett",
      "person_id": 49817
    },
    {
      "name": "Jacen Zhu",
      "person_id": 49106
    }
  ],
  "release_date": "2017-08-01",
  "scene_id": 126443,
  "series": "NDE - 256 - Jacen Zhu & Casey Everett",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Black",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Helping Hand"
}