{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Just killing time on a lazy Saturday, Michael Del Ray and boyfriend Jackson Traynor stumble upon an open house showing at a gigantic house. With no real intention to buy, they show themselves around as the property manager tends to business in another room. Upon entering the kitchen, Michael gets a sneaky little idea in his head and convinces Jackson to go for it right there in the kitchen. Jackson checks over his shoulder and sees that she's far too preoccupied, so consents, and Michael quickly pulls off his pants and begins to suck his cock as he leans against the custom made granite countertops.   Michael remarks on the quality of the craftsmanship as he downs Jackson's cock, then he stands up and bends Jackson over, plunging his giant cock deep inside as he raw dogs his boyfriend against the floor to ceiling cupboards. Michael continues to pound, lifting Jackson's legs over his shoulders and holding him steady as he fucks him deep and hard. Then, just to test the sturdiness of the fixtures, Michael climbs on top of the counter and perches his ass up for Jackson to have a go. Jackson slaps his the head of his cock against Michael's hole and then shoves it in, giving Michael some nice bareback action as Michael strokes his cock and jizzes all over the dishwasher. He bends down just in time to catch all of Jackson's load, sucking him dry as Jackson's throbbing cock quivers inside his mouth, before cleaning themselves up to get dressed before the agent comes through again. Enjoy!",
  "models": [
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    },
    {
      "name": "Jackson Traynor",
      "person_id": 49107
    }
  ],
  "release_date": "2017-08-09",
  "scene_id": 126401,
  "series": "NDR - 87 - Michael Del Ray & Jackson Traynor",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Cum swallow",
    "Facial",
    "Gay Couple",
    "Gay Porn",
    "Jerking off",
    "Oral",
    "Uncut cock"
  ],
  "title": "Open House"
}