{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Bennett Anthony sits in the 'High n' Tight' barber's chair as Gage Unkut finishes his work. After touching up the back of Bennett's neck and running a comb through Bennett's bright red head of hair, Bennett stands up and fidgets uncomfortably with his slim wad of cash. He doesn't have enough for a tip, but he hopes he and Gage can 'work something out.' Bennett reaches for the bulge in Gage's pants: a good suggestion. As Bennett wraps his lips around Gage's uncut cock, Gage unbuttons his shirt, revealing his muscular torso completely covered in tattoos. Bennett whips out his cock and pushes down his pants. Kneeling on the barber's chair, he spreads his ass cheeks apart for Gage to dive in face first. As Gage pushes his tongue deep into Bennett's tight hole, Bennett encourages him with moans of erotic excitement. Standing up, Gage pushes his hard cock into Bennett's fuzzy ass and fucks him doggy style. Switching it up, Gage sits in the chair, and Bennett sits down on his cock. Using the powerful muscles in his thick legs, Bennett rises and sinks down on Gage's cock again and again. Bennett's meat bounces in the air as he rides Gage, and his six pack flexes. Gage stands up and positions himself over Bennett to fuck his face. With his hand gripping the back of Bennett's head, Gage thrusts his hard rod deep down Bennett's throat. He unleashes a massive load on Bennett's face that drips into Bennett's open mouth. Just after swallowing Gage's load, Bennett cums with a guttural roar, shooting his white load onto his thick ginger pubes.",
  "models": [
    {
      "name": "Bennett Anthony",
      "person_id": 49894
    },
    {
      "name": "Gage Unkut",
      "person_id": 49895
    }
  ],
  "release_date": "2017-08-09",
  "scene_id": 126593,
  "tags": [
    "Anal Sex",
    "Bodybuilder",
    "Cumshot",
    "Foreskin",
    "Hairy",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "High n' Tight, Scene #01"
}