{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Mike Stone called an ad for a massage, he assumed he was getting the standard rub down to ease his aching muscles, but when Christian Bay sneaks a lick of his balls, Mike does a double take and wonders what the hell is going on. Christian explains to Mike that he called an ad for a 'different' kind of massage, and unless Mike wants to forfeit Christian's entire fee, he may as well just lay back and enjoy it. Mike can't really argue with this logic, and besides, his cock is already rock hard from Christian's touch, so he does as Christian says and lets the 'masseuse' do his thing. On cue, Christian downs Mike's cock to the base, taking his full shaft in his throat. Christian earns his money as Mike's thick dick swells to full size in his mouth, and Christian remarks that usually his clients have cum by now. Mike tells him he'll need a little more than a blowjob to bust his nut, and Christian dutifully jumps on Mike's rock hard cock, sliding it in raw as he mounts the pole. Christian rides Mike like a champ, and now that he's got the hang of it, Mike embraces the act and flips Christian over onto his hands and knees, plunging his dick deep inside Christian's hole. He fucks Christian hard from behind before flipping him over and fucking the cum out of him. Christian spits his load all over himself as Mike continues to raw dog him, pulling out and busting his load all over Christian's hole before shoving it back inside to make sure he gets his money's worth.Enjoy!",
  "models": [
    {
      "name": "Christian Bay",
      "person_id": 48481
    },
    {
      "name": "Mike Stone",
      "person_id": 49428
    }
  ],
  "release_date": "2017-08-23",
  "scene_id": 126544,
  "series": "NDR - 89 - Mike Stone & Christian Bay",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Hands On Treatment"
}