{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Chad Piper's pervy ways are about to get him stuck in a tight place. After intruding into Alex Tanner's place, Chad finds himself hiding in the closet when Alex returns home, and as Alex undresses and falls onto the bed for a nap, the view is prime, even if the location is a little cramped. Tempted by Alex's perched ass, Chad emerges from the closet and moves closer, bending down to lightly touch Alex. Alex recoils and turns around, startling Chad, who thinks he's busted, but luckily, Alex's main concern is that Chad finish what he started or else, so without any other choice, Chad is forced to service Alex right there in his bedroom. He starts by falling to his knees and downing Alex's cock, sucking him off until Alex is nice and hard, before rocking Alex up onto his shoulders to get at Alex's ass. Tonguing it in anticipation of a nice hard fucking, Chad continues to stroke Alex's dick as he moistens Alex up. Good and ready, Alex tells Chad to go for it, so Chad whips out his cock and shoves it raw deep inside Alex's waiting hole. Chad pounds Alex from behind until Alex has had his fill, then he flips his intruder over and takes a ride on his dick, grinding up and down as his hard cock bounces around on Chad's stomach. Rock hard and ready to bust, Alex tells Chad to flip him over and fuck the cum out of him, and Chad does as he's instructed, fucking Alex missionary as Alex spits his load onto his stomach, telling Chad to cum on his face. Chad pulls out and blasts Alex with a facial as Alex laps up every last drop, telling Chad he may need to break in a little more regularly in the future. Enjoy!",
  "models": [
    {
      "name": "Alex Tanner",
      "person_id": 38001
    },
    {
      "name": "Chad Piper",
      "person_id": 49592
    }
  ],
  "release_date": "2017-08-25",
  "scene_id": 126521,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Deep throat",
    "Gay Porn",
    "Masturbation",
    "Oral",
    "Red Head",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Welcome Intruder"
}