{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Good ol' boy gun lovers Jaxton Wheeler and Sean Duran, pull up to the gun show and park in the parking lot. Sean is excited to head in to see all the automatic and semi-automatic weapons but Jaxton is a little reluctant saying he'll catch up with Sean later. Sean discovers that Jaxton has a boner and needs to take care of it before they can head into the show. Sean reveals that he's got a hard-on too, so to avoid getting arrested for beating off in the car, the two head into the building to find a private spot to rub one out. This 'Gun Show' has the studs so turned on that they enter a storage room and take to their own corners to jack their raging boners. Sean keeps edging closer to Jaxton, who protests with every step closer that Sean takes. Sean won't shut up and wants to finish as fast as possible so they can head in to see the gun demonstrations. 'Dude, you take too fucking long,'' Sean says as he gets on his knees to service his buddy. Jaxton is reluctant at first and responds with: 'What the fuck are you doing, ya faggot?'. But once he feels Sean's lips wrapped around his thick cock, Jaxton relents and lets the tatted hick take his cock down his throat. Jaxton fucks Sean's face as Sean jacks his own big hairy cock. After sucking Jaxton's dick for what seems like forever, he stands up and once again tells Jaxton that he's taking too long. 'It's your turn now,' Sean declares. After a bit of protest from Jaxton on account of not knowing how to suck a dick, Jaxton finally agrees to give it a try. It's a rocky start on Sean's pulsing shaft, but Jaxton gets the hang of it and is able to service his buddy without another hitch. It's almost as if Jaxton was born to suck cock. He doesn't miss and inch and even gets in to suck on Sean's big low hanging balls and fuzzy taint. When Sean is close, he pulls out and paints Jaxton's black hairy beard white. With all of Sean's sticky jizz clinging to his face, Jaxton returns the favor and sprays his muscled-up buddy with his own brand of relief. Once they're done, the party is over and they immediately search for a cum rag to wipe down and clean up before they head back out the door to join the masses of gun-loving patriots.",
  "models": [
    {
      "name": "Jaxton Wheeler",
      "person_id": 35631
    },
    {
      "name": "Sean Duran",
      "person_id": 36945
    }
  ],
  "release_date": "2017-07-31",
  "scene_id": 126525,
  "series": "Gun Show",
  "tags": [
    "Big Dick",
    "Bodybuilder",
    "Boots",
    "Hairy",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "masturbation"
  ],
  "title": "Gun Show, Scene #04"
}