{
  "collections": [
    "Falcon Studios"
  ],
  "description": "After several hours of driving Route 66, Fane Roberts and Dustin Holloway pull over at a rest stop so Dustin can take a piss. As Dustin stands at the rest stop urinal, he notices Derek Maxum head into the stall next to him and as Dustin is washing his hands, he sees Derek's big meaty dick slide through a hole in the wall. Dustin isn't sure if he should run or get on his knees but when he hears Derek's deep voice command him to 'suck it', Dustin does as he's told and takes the giant rod in his mouth. It grows thicker and harder with every slurp from Dustin, and as a pool of spit collects on the floor under the two hunks, Dustin peels off his shirt and unzips his pants for easy access to his own growing boner. Derek his ready to get a look at the eager stranger sucking his dick and comes out from inside the stall. He's ready to taste a dick as well and happily services Dustin's raging hard-on. All the sucking gets Derek in the mindset to take the random public encounter to another level and bends Dustin over the wall to eat his ass. As the two studs get completely naked, they go back to taking turns sucking each other off. With his dick worked to the max, and a hunky naked stranger in front of him, Derek lets go of any inhibitions he may have left and blasts his load all over Dustin's tight pecs and body. The thrill of the public sucking in the dirty bathroom combined with the feel of Derek's warm load running down his body is all it takes for Dustin to finish up. Dustin moans out and polishes the floor with his own creamy brand of liquid before the strangers part ways never to see each other again.",
  "models": [
    {
      "name": "Dustin Holloway",
      "person_id": 48041
    },
    {
      "name": "Derek Maxum",
      "person_id": 49887
    }
  ],
  "release_date": "2017-08-07",
  "scene_id": 126578,
  "series": "Route 69",
  "tags": [
    "Big Butt",
    "Bodybuilder",
    "Boots",
    "Cumshot",
    "Glory Hole",
    "Interracial",
    "Masturbation",
    "Oral Sex",
    "Rimming"
  ],
  "title": "Route 69, Scene #02"
}