{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Wearing nothing but threadbare rags tied around their waists, Jaxton Wheeler and Teddy Torres face off in a Roman gladiatorial wrestling match. After several sweaty rounds of combat, Jaxton succeeds in putting Teddy in a headlock and rips off his the rag encircling Teddy's waist, revealing Teddy's hairy bubble butt. Jaxton claims his prize by burying his bearded face deep into Teddy's furry crack. Knowing his place, Teddy kneels down on the floor to orally service Jaxson's massive cock. Jaxton's huge legs bulge as he thrusts his hips, face fucking Teddy's endless throat. With his cock hard as a rock, Jaxton bends Teddy over and starts giving him a rough, doggy style fuck. As Jaxton rams his meat into Teddy's hairy ass, Ace Era peeps on them from just outside the door to the chamber, enhancing the excitement of voyeurism by stroking his cock. Moving on from doggy style, Teddy lies on his back and lifts his leg over Jaxton's  shoulder. Jaxton delivers deep, powerful thrusts, pulling his cock all the way out and shoving it all the way in each time. The thick, dark fur covering Teddy's body is slick with sweat, spit, and lube. From across the room, Ace continues watching the action while working his thick shaft. Teddy punches Jaxton in the chest, urging him to fuck even faster and harder. The scorching hot action makes Ace shoot his wad, ejaculating a giant rope of white cum across his thigh. As Jaxton buries his tool inside Teddy, Teddy jerks his cock and shoots a huge jet of cum onto his hairy stomach. Jaxton pulls on and strokes out his hot, white load, which lands right on Teddy's hairy taint.",
  "models": [
    {
      "name": "Jaxton Wheeler",
      "person_id": 37469
    },
    {
      "name": "Teddy Torres",
      "person_id": 49892
    }
  ],
  "release_date": "2017-08-16",
  "scene_id": 126594,
  "series": "Erectus",
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Bodybuilder",
    "Cumshot",
    "Hairy",
    "Jockstrap",
    "Masturbation",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Erectus"
}