{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Fane and Dustin stop for the night at a roadside motel on Route 66. Fane is turned on by his buddy's hot body as Dustin gets out to the shower. And when Dustin talks about the hot gas station scenario, Fane gets totally horned up and makes up an excuse take a breather. He heads to the front desk to complain that the room doesn't have hot water. The slick and sexy hotel manager, JJ Knight, listens intently while he fucks Fane with his eyes. JJ can see some potential to get some action and slowly approaches Fane as he pours himself a drink and edges closer to the hot hunk. It's hard to miss the massive bulge in JJ's pants and when he pulls his extra-large member out from hiding, Fane is right there to suck it. JJ's dick is so big and thick that it's hard for Fane to fit the whole thing in his mouth. After getting JJ hard as a rock, Fane knows that the dick will fit much better in his tight ass. Fane bends over to offer himself up to the hung manager who gets him nice and open and lubed up with plenty of tongue and spitting action. When JJ is convinced that Fane is loose enough to take his massive pole, he stands up and slowly slides it deep inside his new guest. JJ goes slow and gentle at first and when he notices that Fane is used to the dick inside him, JJ picks up the pace and pumps Fane's ass harder and faster. Fane is ready to get stretched as much as possible and rolls over on his back to take the dick even deeper. The massive rod going in and out of him makes Fane explode with pleasure as he covers his stomach with sticky fun. JJ sees the mess and soon follows with a load of his own all over Fane's spent balls.",
  "models": [
    {
      "name": "Fane Roberts",
      "person_id": 49692
    },
    {
      "name": "JJ Knight",
      "person_id": 38220
    }
  ],
  "release_date": "2017-08-11",
  "scene_id": 126579,
  "series": "Route 69",
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Bodybuilder",
    "Boots",
    "Cumshot",
    "Hairy",
    "Masturbation",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Route 69, Scene #03"
}