{
  "collections": [
    "Hot House"
  ],
  "description": "Jack Vidra is the bartender at the Ready Bar and he's seen a lot of action come and go on his watch. He never gets to join in on the action and usually has to live vicariously through all the other patrons. When he has to kick Johnny V out at closing time, Johnny wants to give something special back to Jack for all his hard work. His surprise is Dakota Rivers, a hunky stud with a body full of muscles who's ready to please the bartender and his friend. Jack is riled up and ready for fun and can hardly peel off his apron fast enough as he and Johnny worship every inch of Dakota's bulging body. Jack is horny after watching everyone else get action all night and is the first to take a taste of Dakota's raging boner. Johnny doesn't like to be left out and takes turns with Jack sucking on the stud's hard cock. Jack needs a bit more to satisfy his cravings and bends Johnny over to lick his ass. As Johnny keeps sucking Dakota, Jack slips his cock inside Johnny and pounds away. Johnny gets spit roasted until Dakota decides he wants to have a go at Jack. Jack is happy to please the stud and hops on for the ride of his life. The threesome can't get enough different cocks and asses and they switch it up until they've all had a taste of each other. Johnny is the first to let loose when he sprays Jack's face with his massive load. The sight of Jack getting doused with jizz is all it takes for Dakota to go with the flow and give the lucky bartender a second load of fun. With his mouth full and his face dripping, Jack gives himself permission to unleash the day and sprays his own hairy body with his bartender's special blend.",
  "models": [
    {
      "name": "Dakota Rivers",
      "person_id": 11136
    },
    {
      "name": "Johnny V",
      "person_id": 35558
    },
    {
      "name": "Jack Vidra",
      "person_id": 50417
    }
  ],
  "release_date": "2017-08-17",
  "scene_id": 126639,
  "series": "One Night At The Ready",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder",
    "Group Sex",
    "Kissing"
  ],
  "title": "One Night At The Ready, Scene #04"
}