{
  "collections": [
    "Active Duty"
  ],
  "description": "Quentin introduces everybody and the games begin with an amazing 3 way cock blow fest with everyone's mouth stuffed with a hard cock. Damien has never done anything with men before but Quentin and Billie are breaking him in slowly. Lots of meat to go around with each one of these studs switching from cock to cock and there is never a mouth left behind. Billie has to show Damien how it's done so he lets Quentin fuck him first while he stuffs Damien's dick in his mouth. Quentin pounds away on Billie's eager hole and Damien is taking notes waiting for his turn as he fucks Billie's tight mouth. With a couple deep breaths Damien hunkers down and Quentin pushes his throbbing cock slowly into Damien's virgin ass. Damien surprisingly takes it great without any hesitation and soon enough Quentin's balls deep and they are slapping up against Damien's virgin ass. Billie now gets a turn on the virgin ass as Damien spreads his legs in doggy style position for Billie to push himself in. Billie mounts that tight fresh hole with no problem and fucks his boy toy slowly. Damien's moans are cute for a first timer having his ass spread open with two big dicks. They all stand near the bed and stroke their big dicks until one by one they unleash their hot cum loads all over the bed and Damien who is the last to nut wins the bet as he blasts his shooting load the farthest and with the most cum as well. Enjoy!",
  "models": [
    {
      "name": "Billie Starz",
      "person_id": 49142
    },
    {
      "name": "Damien Nichols",
      "person_id": 49705
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2017-08-20",
  "scene_id": 126642,
  "series": "AD - 226 - Billie Starz,Quentin Gainz & Damien Nichols",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "First Time",
    "Jerk Off",
    "Kissing",
    "Muscular",
    "Tattoos",
    "Threesome"
  ],
  "title": "Billie Starz, Quentin Gainz & Damien Nichols"
}