{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With his father's passing, Johnny Hill is in town to make necessary arrangements, and his heart is rather heavy when neighbor Dante Martin stops by to pay his condolences. Dante, a former friend of Johnny's dad, regales him with tales of his father, and stories about Johnny that his father shared. Johnny gets nervous and embarrassed at the possibilities and Dante tells him there was a time when Johnny's father thought he was gay, something about internet search history and gay porn. Johnny is stoic and Dante asks him why he's not wearing his wedding ring. Johnny looks at Dante and his eyes tell the whole story.   Moments later, they are locked in a kiss, moving towards the bedroom. Dante throws Johnny down and begins to kiss up and down his body. They rip off their clothing and Dante quickly takes Johnny into his mouth, sucking him down to the base of his shaft, working it with his tongue as Johnny closes his eyes and feasts in delight. Johnny returns the favor and then Dante sits on his face, smothering Johnny, who tongue fucks his hole.  Nice and moist, Dante is ready for Johnny's hungry cock, so he mounts Johnny raw and takes every inch, riding reverse as he looks over his shoulder back at Johnny. Having had his fill of being control, Dante flips over onto his hands and knees and Johnny plunges his rock hard dick deep into Dante, grabbing him by the waist and pulling him closer with every thrust. Dante is ready to spit his load, so Johnny flips him over and teases Dante, pulling out and sticking it back in over and over again, before giving it one last go as he fucks Dante and strokes him off at the same time. Dante shoots a huge load all over himself and the bed, and the sight of it makes Johnny so hot he can't contain himself, pulling out just in time to jizz all over Dante's hole. Sliding it back in, he asks Dante if he'd like to spend the night, and they can't help but laugh at the circumstances that brought them together. Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Johnny Hill",
      "person_id": 49385
    }
  ],
  "release_date": "2017-09-01",
  "scene_id": 126805,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "Jerking off",
    "Muscular",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Neighbor's Secret"
}