{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Dalton Riley finds himself smack dab in the middle of two first timers and he couldn't be more excited about his options. On his right, fresh faced Trevor Jones waits eagerly to show his stuff, while on his left, muscle bound stud Steve Rogers is ready to give everyone the business. With so many choices, Dalton decides to dive right in, as the three of them engage in a kiss before stripping out of their clothes. The chemistry is palpable as all three guys take turns blowing each other, but Steve is here to fuck and rather quickly asks who gets to take the dick first. Trevor volunteers and Steve goes right to work, plowing Trevor bareback from behind while Trevor eats Dalton's ass. Once Dalton's hole is nice and moist, he flips Trevor over and mounts him, as Steve continues to fuck Trevor missionary. Trevor proves he can give as good as he gets, but it's finally Dalton's turn to do the fucking, so they switch positions and Trevor mounts Dalton reverse, bouncing his ass up and down on Dalton's raw cock while Steve gags Dalton with his hard on. Dalton fucks Trevor hard and can't hold it any longer, so he pulls out just in time to jizz all over Trevor's suspended hole, just Steve drops his load in Dalton's mouth. All that's left is for Trevor to complete the trifecta, so he turns around and shoots another load onto Dalton's face, who is in happy as a clam with the way it all turned out. The feeling is certainly mutual. Enjoy!",
  "models": [
    {
      "name": "Dalton Riley",
      "person_id": 48651
    },
    {
      "name": "Steve Rogers",
      "person_id": 49929
    },
    {
      "name": "Trevor Jones",
      "person_id": 49930
    }
  ],
  "release_date": "2017-08-31",
  "scene_id": 126804,
  "series": "NDB - 4799 - Dalton Riley, Trevor Jones & Steve Rogers",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Deep throat",
    "Gay Porn",
    "Jerking off",
    "Muscular",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Dalton Riley, Trevor Jones & Steve Rogers' First Three Way"
}