{
  "collections": [
    "Next Door Taboo"
  ],
  "description": "Stuck at a vacation rental for the summer, Scotty happens by his step-brother's room and notices a rather prominent dildo sticking out of his travel bag. When he confronts him, Alex is nervous, pleading with Scotty not to tell his mom. Alex tells Scotty he'll do whatever he wants, and in a shocking plot twist, Scotty actually wants to see Alex use this massive thing. Better yet, he says he'd like to try it out on him. Alex agrees and moments later they are back in the bedroom giving it a go. Scotty slowly inches the dildo all the way inside Alex, fucking him with it slowly as he starts to jerk him off. Alex begins to pre-cum as Scotty starts sucking him off, still fucking him with the dildo. Alex tells him he'd like to give some head, and so he flips around on the bed and takes Scotty's cock deep into his mouth as he continues to finger his own hole. <br></br>Once Scotty is nice and hard, he asks Alex if he'd like the real thing. Alex nods and Scotty tells him to flip around. Alex rocks onto his back and spreads his legs wide as Scotty slides his dick deep into Alex, giving him some bareback brother cock as Alex continues to stroke himself off. He fucks Alex like that for a while until Alex is ready to ride him, mounting Scotty and giving his dick a nice grinding. Scotty grips Alex' ass and thrust as hard as he can into his step-brother, who seems ready to burst at any minute.<br></br>When Scotty flips Alex over onto his hands and knees, pounding his bubble butt doggy style, Alex can take more, and he shoots his massive load all over their bed as Scotty keeps pounding away. He continues to fuck Alex hard until he's ready to blow, seeding Alex' hole with his family seed and telling Alex to keep their secret if he wants to keep getting the real thing in the future.<br></br>Alex sees no problem with that arrangement.<br></br>Enjoy! ",
  "models": [
    {
      "name": "Alex Tanner",
      "person_id": 38001
    },
    {
      "name": "Scotty Zee",
      "person_id": 46672
    }
  ],
  "release_date": "2017-08-30",
  "scene_id": 126807,
  "series": "NDR - 90 - Scotty Zee & Alex Tanner",
  "tags": [],
  "title": "Busted Brother"
}