{
  "collections": [
    "Hot House"
  ],
  "description": "Sexual creation takes a new twist as Skyy Knox brings his fantasy hunk, Tyler Roberts, to reality from under a black blanket amid a scurry of smoke and fury. Skyy's new creation mimics everything he does in mirror image from waving to kissing to removing their masks. It soon becomes clear, though, that Skyy can't control the horny hunk when he shows that he has a mind of his own with satisfying his sexual urges. Skyy wants to push the boundaries for what Tyler can do for him so he pulls out his raging hard-on and slips it down Tyler's throat. The muscle hunk services his new master as he slurps and gags all over his throbbing cock.  Skyy wants to see what Tyler is sporting under his leather jock and unleashes his beast so he can have a turn at sucking. Skyy gets his face completely reamed before Tyler decides he wants a piece of Skyy's ass. Tyler wets his fingers and bends Skyy over before plunging almost his entire fist inside. 'Oh yeah, stretch my fucking hole!' Skyy begs. Tyler does as he's told and gets Skyy's asshole gaping wide with his fingers, spit, and tongue. When Tyler can see that Skyy is nice and open, he shoves his big thick cock deep inside his master's smooth hole. Skyy wants it as deep as possible and gets his ass smashed every way he can until he finally sits on Tyler's face. That does the trick for both hung studs and Skyy is the first to blow. He blasts his jizz all over Tyler's writhing body. The taste of Skyy's broken hole on his face and the feel of his warm cum dripping down his torso makes him blow his massive load. Skyy won't let a drop go to waste and he cleans Tyler's mess with his tongue before covering him back up and walking away to leave his fantasy man for a different time.",
  "models": [
    {
      "name": "Skyy Knox",
      "person_id": 49409
    },
    {
      "name": "Tyler Roberts",
      "person_id": 50414
    }
  ],
  "release_date": "2017-08-24",
  "scene_id": 127041,
  "series": "Dark Matter",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder",
    "Kissing",
    "Latex",
    "Leather"
  ],
  "title": "Dark Matter"
}