{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With pool boy Michael Del Ray on his way over, exhibitionist Scotty Zee has already set up his ironing board and his cameras, flaunting his naked ass while doing his ironing in front of the giant glass doorway that leads to the pool. Michael can't help but get an eyeful, and he definitely likes what he sees, so when Scotty opens the doors, Michael takes it as an invite and lets himself in, where he finds Scotty seated on the sofa masturbating. Scotty tells him not to be shy, and Michael immediately sets to sucking off his employer. Scotty's dick gets nice and hard in Michael's mouth, and when he returns the favor, he asks Michael if he minds filming it. Michael obliges him and Scotty sucks him off nice and slowly for the camera, taking every inch of Michael's mammoth cock down his throat, before perching himself on the sofa with ass in the air for Michael to have his way with him. Michael starts by filming himself eating Scotty out, then films himself plunging his massive cock deep into Scotty's hole. Michael pounds Scotty from behind as all the cameras roll. Scotty takes a pounding  before switching positions, mounting Michael reverse as he gives him a nice ride, making sure to spread wide for the camera. Michael's ready to cum so he turns Scotty over and goes for it, fucking Scotty missionary as Scotty strokes the cum out of himself, spitting a huge load all over himself as Michael continues to go hard, before pulling out and coating Scotty with his load. As the take a deep breath and exhale exasperated, Scotty asks Michael if he'll be back next week, and they both laugh.Enjoy!",
  "models": [
    {
      "name": "Scotty Zee",
      "person_id": 46672
    },
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    }
  ],
  "release_date": "2017-09-05",
  "scene_id": 127016,
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "Hardcore",
    "Masturbation",
    "Oral",
    "P.O.V.",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Watch Me Iron"
}