{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Xavier Huxx, Spencer Whitman and Hoytt Walker are in the middle of playing a fantasy board game when Ty Mitchell joins a little late. The game quickly turns sexual when all the talk of swords and conquering take a turn and Ty starts sucking on Spencer's giant rod. Xavier takes his cue and gets to work licking Ty's extra hairy hole. Hoytt sees all his buddies sucking cock and ass and scrapes the board game off the table to stand next to Spencer for Ty take turns on both of their raging hard-ons. The guys realize they need some fucking action and pair off when Hoytt mounts Xavier and Spencer rams his cock inside Ty's lean asshole. The studs go at it until Hoytt decides he wants his asshole stretched to the absolute human limits. He sits on Spencer's giant dick and just when he thinks he's completely filled up, Xavier opens him up even further by sliding his hard cock inside the stud to double penetrate his hole. Ty doesn't want to be left out of the action and sticks his hairy cock inside the only open hole that Hoytt has left. Hoytt happily accepts the third dick and gets face fucked as the other two studs continue relentlessly DP'ing his asshole. No cock, dick, or ass goes without attention as the guys continue to switch it up so that everyone can have a little bit of everything. In the end, Ty becomes the party favor when each of the guys takes turns filling his ass and face with dick. As Ty continues to get fucked, Xavier looks on with amazement and blasts his load all over Ty's tight body. As Ty continues to get plowed, he's the next to blow. It's a giant load and once they see all the jizz, Spencer and Hoytt follow along and leave Ty a giant sticky mess covered in the cum of four sweating, bulging studs.",
  "models": [
    {
      "name": "Hoytt Walker",
      "person_id": 49605
    },
    {
      "name": "Spencer Whitman",
      "person_id": 46992
    },
    {
      "name": "Ty Mitchell",
      "person_id": 50137
    },
    {
      "name": "Xavier Huxx",
      "person_id": 50136
    }
  ],
  "release_date": "2017-08-25",
  "scene_id": 127049,
  "series": "Gaymers",
  "tags": [
    "Anal",
    "Double Penetration",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "latinos",
    "rimming"
  ],
  "title": "Gaymers"
}