{
  "collections": [
    "Next Door Raw"
  ],
  "description": "After perusing online and selecting an intimate partner for private massage, all that's left for Aden Davinci is to answer the door and do the deed, but the problem is Aden's never done this before, and really doesn't know what he's supposed to do. Luckily for him, Johnny Riley is a pro and has seen it all, and sensing Aden's nervous apprehension, he takes the quiet stud by the hand and leads him back to the bedroom to show him the ropes. Aden proves to be a quick and versatile partner, as he and Johnny straddle each other in a 69, both of them deep throating each other until Aden is nice and hard. Johnny tells him to bend him over, and Aden obeys, plunging his raw cock deep inside the stranger bent over in front of him. He gives Johnny a nice hard pounding from behind until Johnny flips the table on him, telling him to mount his cock. Aden obliges this request and bounces on Johnny's meaty cock, taking the dick as he spreads his legs and grinds on Johnny's member. As he gets closer to cumming, Aden tells Johnny to fuck him on his back, and so Johnny abides by his wishes and lays Aden out, fucking the cum out of him as it spits all over Aden's ripped chest. Johnny's ready to bust his nut too, so he tells Aden to lay back, and he sits on Aden's cock while he strokes himself to completion all over Aden's stomach, falling on top of him and kissing as Aden realizes that was much easier than he thought, and every bit as fulfilling as he had hoped.Enjoy!",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 38266
    },
    {
      "name": "Aden Davinci",
      "person_id": 50158
    }
  ],
  "release_date": "2017-09-09",
  "scene_id": 127075,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Straight Escape"
}