{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Chris Blades comes home and finds his roomie Clark Campbell getting some tail in the living room, he's not surprised... that is, until he realizes that Clark's piece of ass has a dick. Flustered, he tells Clark to get rid of him and runs upstairs, but now that he's had some time to settle down, he's more intrigued than disgusted, and the more he finds out about Clark's closeted lifestyle, the more he comes to grips with his own desires. So when Clark confesses to wishing he just had a steady FWB situation, Chris perks up and asks Clark how that would even happen.  Clark sense Chris' interest and takes over from there, pouncing on him and pulling his dick out, sucking it hard as he removes Chris' pants. Chris is rock hard when he returns the favor, and now that Clark is ready to fuck, Chris wants to see how it feels, so he mounts Clark's cock and slowly pops his cherry, sliding his hole around Clark's bareback dick, and grinding on him hard. Chris' eyes bulge as he realizes the pleasure he's been denying himself, and he tells Clark to fuck him harder, so Clark bends him over the table and takes him from behind, pounding Chris' ass and fantasizing about seeding his hole. Chris flips over and Clark fucks him missionary as Chris jizzes all over himself, and just as he does, Clark pulls out just in time to nut all over Chris' freshly fucked ass, seeding him as Chris asks if this makes them 'FWB'.  Enjoy!",
  "models": [
    {
      "name": "Chris Blades",
      "person_id": 48683
    },
    {
      "name": "Clark Campbell",
      "person_id": 50192
    }
  ],
  "release_date": "2017-09-20",
  "scene_id": 127239,
  "series": "NDR - 96 - Clark Campbell & Chris Blades",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Roomie Benefits"
}