{
  "collections": [
    "Next Door Originals"
  ],
  "description": "When Damien Kyle comes through the front door, the last thing he expects to see is his roommate Zeus parading around the house naked, but there he is in all his naked glory. Damien can't help but feel awkward, but also, he defintely notices what a nice cock his roomie has, and to his credit, Zeus notices Damien noticing, so he makes his way up to Damien's room and tells him he knows Damien is interested. Damien doesn't object, and moments later, he's on his knees deep throating Zeus' hard dick. Zeus smiles, as everything is going according to plan, and as he strips Damien out of his clothes, he takes a first look at the ass he's been coveting since they moved in together. Laying Damien on his stomach, Zeus eats Damien's ass, tonguing his hole and getting it nice and wet for his cock. Once he's satisfied that Damien is ready, Zeus plunges his meatstick deep into Damien's hole, fucking him hard and raw, just like Damien likes it. He works up a nice sweat fucking Damien doggy-style, and as he gets closer to cumming, he decides he wants to look Damien in the eye while he fucks, so he flips him over and fucks him missionary, slowly at first, then building to a hard pounding as he pulls out and blasts Damien's hole with his nut. He tells Damien he wants to see him cum, and Damien tells him to eat his ass again as he strokes himself off, spitting his jizz all over his stomach as Zeus stands up and rubs his cock in the mess. As they kiss, Zeus and Damien agree to keep this between themselves, but also to make sure to do it again as soon as possible.Enjoy!",
  "models": [
    {
      "name": "Damien Kyle",
      "person_id": 50160
    },
    {
      "name": "Zeus",
      "person_id": 50267
    }
  ],
  "release_date": "2017-10-06",
  "scene_id": 127419,
  "series": "NDO - 4810 - Zeus & Damien Kyle",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Roomie with a View"
}