{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Lucas Vick lay asleep on his bed, John Joseph assumes he has tapped out from drinking, and takes the opportunity to sneak a feel of Lucas' manly body, as he runs his hand up and down Lucas' chest. Thinking he might just take a peek a Lucas' cock, he slowly removes his shorts and exposes Lucas' member, taking it delicately into his mouth and beginning to lightly tongue at it. Little does he know, Lucas is wide awake, and when he catches John in a compromised position, John apologizes, but Lucas lets him know the important thing now is that he finishes what he started, so John dives back into giving head, now with much more determination and enthusiasm. He sucks Lucas until he's nice and hard, and then Lucas returns the favor as John strokes his cock, keeping him hard for what comes next.  Lucas bends John over and gives slips his hard dick deep inside John's hole, bareback fucking him from behind. John realizes reality exceeds his fantasies as he takes every inch of Lucas' hard cock, before flipping over onto his back to finish. He strokes himself off as Lucas continues to fuck him hard, spitting his load onto his chest as Lucas looks on. Ready to drop his load, Lucas tells John to flip over one more time, and when he does, Lucas fucks John doggy style until he's ready to burst, pulling out just enough to blast John's freshly fucked hole with his nut, before shoving it back in and breeding his buddy nice and proper.Enjoy!",
  "models": [
    {
      "name": "John Joseph",
      "person_id": 50265
    },
    {
      "name": "Lucas Vick",
      "person_id": 50266
    }
  ],
  "release_date": "2017-10-05",
  "scene_id": 127418,
  "series": "NDB - 4809 - John Joseph & Lucas Vick",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Sleeping Bait"
}