{
  "collections": [
    "Next Door Originals"
  ],
  "description": "It's been a while since frat bros Lance Ford and Clark Campbell have initiated a hook up, but Clark is certainly ready. Lance is always down for some fun, and today, Clark has a surprise for him. Luis Parker is defintely apprehensive about the meet up, but Clark assures him it will be worth his while. Still, as they make their way up to Lance's room and he begins to suck Clark off, Luis is skeptical and stays in a corner of the room watching. Lance gets Clark nice and hard as he deep throats his cock, and seeing this, Luis begins to loosen up a bit, unzipping his pants as he starts to play with himself. Clark bends Lance over and plunges his raw cock deep inside Lance, and as he fucks him from behind, he encourages Luis to get over his hang-ups and let Lance suck his dick. Luis agrees, and moves around the bed to let Lance do his thing while Clark continues to fuck from behind. Lance takes Luis' hard cock into his mouth and begins to down his cock. Clark smiles at Luis in a 'told you so' kind of way as Lance proves he knows what he's doing. Flipping him over, Clark fucks Lance missionary as Luis gets closer and closer to losing his load, finally spitting it all over Lance's face as Clark fucks the cum out of Lance. Lance is cum covered but not finished yet, as Clark pulls out and seeds his hole with his nut, shoving it back in as the two of them poke fun at Luis for being so skittish about having a little frat fun.Enjoy!",
  "models": [
    {
      "name": "Lance Ford",
      "person_id": 47871
    },
    {
      "name": "Clark Campbell",
      "person_id": 50192
    },
    {
      "name": "Luis Parker",
      "person_id": 50263
    }
  ],
  "release_date": "2017-09-29",
  "scene_id": 127417,
  "series": "NDO - 4808 - Lance Ford & Clark Campbell & Luis Parker",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Hardcore",
    "Muscular",
    "Oral",
    "Smooth",
    "Threesome"
  ],
  "title": "Frat Bro Hook Up"
}