{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Markie More booked his beach rental, he was looking for a nice, relaxing get-away, and figured the sun and the sand would do the trick. What he didn't count on was that the rental agent's son, Grayson Lange, would be stalking his every move, but when he hears the sound of his door opening and closing, Markie has a pretty good idea who is breaking in. Catching Grayson spying in the hallway, Markie tells him he can either rat him out and get his money back, or that he can just fuck Grayson's little ass hard. Grayson smiles at choice B, and that's the one Markie decides to pursue, as they kiss hard in the hallway before Markie shoves Grayson's head down to his waist. Grayson takes the cue and does the rest, removing Markie's shorts and downing his cock in one gulp, deep throating him as he begins to play with his hole. Markie grows hungry to have at Grayson, so he pulls him up and spins around, pushing him up against a wall and dropping to his knees to get a close look at Grayson's ass, tonguing the intruder's hole as he continues to stroke himself hard. Ready to fuck, Markie stands up and lifts Grayson into his arms, setting him down on his hard cock and fucking him raw against the wall. He pounds Grayson in the hallway before the move to the bedroom, where Grayson mounts Markie and gives him a ride. Markie lets Grayson bounce on his cock to his heart's content, and when Grayson has had his fill, Markie flips him onto his back and fucks the cum out him. Grayson spits his load onto his stomach as Markie gets closer and closer to busting his nut. He fucks Grayson hard and cums deep inside him, pulling his dick out and letting the cum spill out of Grayson in a messy conclusion to an eventful day. Some vacation indeed! Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Grayson Lange",
      "person_id": 47158
    }
  ],
  "release_date": "2017-09-23",
  "scene_id": 127415,
  "tags": [
    "Amateur",
    "Anal Cream Pie",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Rental Crush"
}