{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Having to attend his father's wedding is strange enough for Paul Canon, but when he finds out his dad's wife-to-be has a hot son who is also staying at the house they've rented for the wedding weekend, he doesn't know what to make of the situation. On the other hand, Calvin Chambers knows all about Paul, having already heard all about him, including his recent break up. When Calvin over-hears Paul telling his friend on the phone that he thinks Calvin is cute, Calvin decides to initiate a little brotherly bonding. Cornering Paul in the sauna, Calvin's hard on is right in Paul's face, and he's forced to admit that it's been a while since he's gotten any. That's all the hint that Calvin needs, as he pulls Paul's towel off and begins to suck his dick. Deep throating him, Calvin takes all of Paul's cock to the base, gagging on the shaft as Paul gets rock hard in no time. He throws Calvin against the wall and returns the favor, as Calvin's muscles tighten as Paul sucks him long and deep, stroking himself all the while. Once Calvin is nice and hard, Paul suggests they make their way to the bedroom to finish each other off.There, he gets on all fours and tells Calvin to fuck him hard, and his brother to be does he's instructed, raw dogging Paul's hole and pounding him completely, fucking Paul's brains out before giving him control. Paul mounts Calvin and rides him reverse, bouncing on his cock with his bubble butt before grinding nice and slow on Calvin's long stroke thrusts. Paul is rock hard as he bounces up and down, and ready to burst, he tells Calvin he wants him to fuck him hard again, laying on his back as Calvin spreads his legs and fucks the cum out him. Paul spits a huge load all over himself and tells Calvin to do the same, so he pulls out and loses his load all over Paul's hole, sticking it back in as it throbs at the head, and looking Paul into the eye and asking, 'How was that, bro?'Enjoy!",
  "models": [
    {
      "name": "Calvin Chambers",
      "person_id": 50269
    },
    {
      "name": "Paul Canon",
      "person_id": 36900
    }
  ],
  "release_date": "2017-09-27",
  "scene_id": 127416,
  "series": "NDR - 98 - Paul Canon & Calvin Chambers",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Fresh Brotherhood Part 1"
}