{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As the three of them relax on the beach, Markie More catches a glimpse of a guy with a nice sized cock and asks his buddies Johnny Hill and Pheonix Fellington if they can see how big it is. Johnny is instantly impressed by what he sees, and remarks that Markie must be really horny to spot such a specimen from so far away. Pheonix is less impressed, and instantly draws skepticism from his two bros, who tell him his cock can't be as big as that. Markie, horny as ever, declares that there's only one way to solve this dilemma. With that, the three of them head back to their flat to have it out, and Pheonix and Johnny sit with legs spread, as Markie surveys the options in front of him. He quickly begins to service them both, and immediately he sees that both Pheonix and Johnny are packing some hefty weight inside their pants. Alternating between the two massive cocks in front of him, Markie gets them both nice and hard, deep throating Pheonix's python of a dick as Johnny plunges his meat stick deep into Markie's hole. Johnny fucks Markie bareback, getting him nice and ready for Pheonix, and once he's broken in, they flip around and Pheonix takes his ass for a ride, long dicking Markie's raw hole and filling him up. The two of them take turns abusing Markie's hole before Johnny spits his load all over Markie's chest. Markie rides Pheonix until he's ready to spit his load, letting it fall all over the floor as Pheonix pulls out and blasts Markie's hole with his massive nut, as the three of them fall into a giant cuddle puddle on the sofa. Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Johnny Hill",
      "person_id": 49385
    },
    {
      "name": "Pheonix Fellington",
      "person_id": 50087
    }
  ],
  "release_date": "2017-10-13",
  "scene_id": 127519,
  "series": "NDO - 4812 - Markie More, Johnny Hill & Pheonix Fellington",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Black",
    "Brunette",
    "Facial Hair",
    "Gay Porn",
    "Interracial",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Beach Bros"
}