{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As they arrive at their weekend resort, Dakota Young hopes the atmosphere will help boyfriend Scotty Zee to loosen up a little and have some fun, and when he sees fellow guest Michael Del Ray sunning himself right outside their door, Dakota begins to work a scheme to make it happen. Opening the blinds as Michael works on his tan, Dakota begins to suck Scotty off in bed, confident that Michael is spying through the door. Scotty mentions the guy in the window staring and Dakota tells him to lighten up, making his way over to the door to let Michael in. He joins them, cock already at half mast, and Scotty and Dakota proceed to service him, sucking him off and worshiping his straight boy body. Michael is hung like a boa constrictor, and Dakota is anxious to take him for a test drive, so he lay on his back and lets Michael have his way with him. Scotty doesn't want to feel left out so the two of them take turns fucking Dakota's raw hole, fucking the cum out of him as Scotty pulls out and coats him with his load. Michael tells Scotty he wants to do the same, so Scotty moves aside as Michael goes for the gusto, fucking Dakota hard before blasting him with yet another load, before sliding his throbbing cock back inside a freshly fucked Dakota, who is now drenched in cum, just as he planned in the first place.Enjoy!",
  "models": [
    {
      "name": "Scotty Zee",
      "person_id": 46672
    },
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    },
    {
      "name": "Dakota Young",
      "person_id": 48374
    }
  ],
  "release_date": "2017-09-30",
  "scene_id": 127515,
  "series": "NDR - 99 - Scotty Zee, Michael Del Ray  & Dakota Young",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Oral",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Double Load Resort"
}