{
  "collections": [
    "Falcon Studios"
  ],
  "description": "In an attempt to take care of business on his own, Tony (Beaux Banks) is following the blackmailer's instructions. He grabs a load of cash from their safety deposit box and heads off to the drop-off location. Tony pulls into a sleazy garage to meet the shady character, Don (Skyy Knox). Don is out to destroy Tony's husband, Alex, by getting him cut off from the family money. Tony arrives, and on top of the money he's demanding, Don decides he wants to ravage the thing dearest to Alex's heart -- Tony. Tony is reluctant to cooperate at first, but realizes that this could be the only way to save Austin's reputation. Don doesn't only want the money, he wants Tony to deliver the full husband experience to stick it to Alex ever worse. Don fucks Beaux's face as Tony drools and chokes on the rock-hard dick. Don is ready for some rough action and slams Tony over the hood of the car so he can eat his asshole. The stud plunges his tongue deep inside and gets Tony juiced up and ready for penetration. 'You're ready for my cock,' Don declares as he smashes his dick into Tony's sweet hole and grabs his face and mouth to exert his dominant control. Don decides to switch it up and rolls Tony over onto his back after spitting in his mouth and shoving his tongue down his throat. Don fucks the hairy muscle stud like a machine until he pumps the cum right out of Tony's thick curvy cock. Don wants his release too and throws Don onto the floor to jack a massive creamy load all over Tony's hungry face. After licking up his own load, Don takes his twisted revenge to another level by holding Tony captive and sending threatening selfies to Alex, while demanding even more cash.",
  "models": [
    {
      "name": "Beaux Banks",
      "person_id": 52529
    },
    {
      "name": "Skyy Knox",
      "person_id": 49409
    }
  ],
  "release_date": "2017-10-05",
  "scene_id": 127557,
  "series": "The Fixer",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Hairy",
    "Kissing",
    "Masturbation"
  ],
  "title": "The Fixer, Scene #03"
}