{
  "collections": [
    "Hot House"
  ],
  "description": "With the love of his life at home, trust-fund millionaire, Alex (Austin Wolf) runs off to share a fantasy with his favorite escort, Derek (Alex Mecum). The pair meets up in a seedy motel and from the start, they can barely keep their hands off each other. Alex pulls down his pants and Derek immediately attaches his mouth to his John's dick. Derek's hunger for cock keeps him sucking a steady pace to get Alex's girthy pole throbbing hard and ready for more. 'Show me that ass,' Alex whispers between gasps of air from his amazing blowjob. Derek does as he's told and hops on the bed to spread his cheeks wide. Alex likes what he sees and gets on his knees to rim the sweet, smooth hole in front of him. After getting it to pucker and open up by rubbing his face and beard all over it, Derek is ready to fuck. As a surprise, Derek pulls out a pair of handcuffs that Alex uses to gently cuff Derek's hands behind his back. He bends Derek over the bed, and rams his thick cock deep into Derek as they both groan from the sheer pleasure of it all. Alex pumps away, slamming Derek's fuck hole with one foot on his head and the other on the floor 'Use me!' Derek screams as Alex continues the relentless reaming. Alex senses that Derek is ready to blow and they both lie back on the bed to shoot their loads all over themselves. Out of breath and fully satisfied, Alex reluctantly leaves his hot and happy lover at the motel with a kiss and a promise to do the same thing next week. Derek agrees, but not everything is as innocent as it seems. Derek passes off a video of their encounter to a dubious character after Alex leaves.",
  "models": [
    {
      "name": "Austin Wolf",
      "person_id": 37357
    },
    {
      "name": "Alex Mecum",
      "person_id": 37766
    }
  ],
  "release_date": "2017-09-21",
  "scene_id": 127555,
  "series": "The Fixer",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder",
    "Hairy",
    "Kissing",
    "Masturbation"
  ],
  "title": "The Fixer, Scene #01"
}