{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As a VIP guest of the hotel, Johnny Riley is used to getting his way, so when he calls the hotel's ambassador, Dalton Riley, to his room, Johnny's intentions are immediately clear. With a call down to the front desk, Johnny lets the hotel know that Dalton will be indisposed for the next hour or so, and he turns to Dalton and lets him know he can help Dalton's professional aspirations if Dalton is willing to help him with his own ASSpirations. Dalton picks up what Johnny is putting down, and opens his robe and begins kissing down his naked body. Johnny is in great shape, and Dalton quickly finds himself turned on by the prospect, especially when Johnny sits him down and strips him out of his shirt and tie, sucking him off in the chair before leaning back on the sofa and spreading his legs for Dalton to get a good glimpse of his hole. Dalton fingers it delicately and spits on it to moisten it up, replacing his finger with his hard cock and fucking Johnny on the couch raw. He watches as Johnny takes every inch of his hard dick, sliding it in and out of Johnny slowly, then picking up the pace and fucking him harder and harder. Johnny flips him over and takes a seat on his cock, riding him reverse and jerking himself off as he spits his load onto the hotel carpet, as Dalton drains his cock deep inside Johnny's hole, seeding him with his but and then pulling out to watch it trickle and spill out onto the head of his cock, before shoving it back in. Johnny enjoys it all and tells Dalton he's going to run a fine hotel some day. Enjoy! ",
  "models": [
    {
      "name": "Dalton Riley",
      "person_id": 48651
    },
    {
      "name": "Johnny Riley",
      "person_id": 38266
    }
  ],
  "release_date": "2017-10-04",
  "scene_id": 127516,
  "series": "NDR - 100 - Dalton Riley & Johnny Riley",
  "tags": [
    "Amateur",
    "Anal Cream Pie",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Brunette",
    "Caucasian",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "Jerking off",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Private Ambassador"
}