{
  "collections": [
    "Hot House"
  ],
  "description": "The Fixer (Tyler Roberts), The Associate (Arad) and Alex (Austin Wolf) have their own plan, and they're in their SUV when the threatening and demanding text messages start to arrive. The Fixer, Wolf, has a plan. They arrive at the garage where Don (Skyy Knox) is holding Tony (Beaux Banks) in no time flat. The trio ambush Don and rough him up to teach him a lesson before ripping off his clothes and bending him over a table. Wolf is the first to whip out his cock and slam it into Don's asshole. Alex soon follows and face fucks the shifty stud as Wolf continues bringing up the rear. Each of the hunks wants a piece of Don, so they switch it up and Alex takes the asshole as The Fixer and The Associate take turns plugging his face with their big hard dicks. No one is left out of the action as one by one, everyone takes a turn with each of Don's used up holes. Don even gets punished with an extra-long session of double penetration as all three guys take turns shoving their cocks into his ass in pairs. None of the guys think that Don can ever be punished enough but after all the hardcore fucking, all three are ready to paint his face white. The Associate blows first and hits his mark in Don's wide-open mouth and extended tongue. The sight of all that cum dripping from Don's face and mouth puts the other two studs over the edge as they each unleash their loads in Don's begging mouth. Not everything is over when the cum stops flowing. Some punishments just aren't enough, and this time around Skyy may have bitten off more than he can chew, choosing the wrong guys to fuck over.",
  "models": [
    {
      "name": "Arad Winwin",
      "person_id": 49394
    },
    {
      "name": "Austin Wolf",
      "person_id": 37357
    },
    {
      "name": "Skyy Knox",
      "person_id": 49409
    },
    {
      "name": "Tyler Roberts",
      "person_id": 50414
    }
  ],
  "release_date": "2017-10-12",
  "scene_id": 127558,
  "series": "The Fixer",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bodybuilder",
    "Double Anal",
    "Gangbang",
    "Group Sex",
    "Hairy",
    "Masturbation"
  ],
  "title": "The Fixer, Scene #04"
}