{
  "collections": [
    "Fisting Central"
  ],
  "description": "Pierce Paris is Dr. FrankenFuck's latest creation. The Doctor (Hugh Hunter) needs to give his new monster a check-up and he has his assistant, Scotty Taylor, get Pierce onto the exam table. After checking all of Pierce's vital signs, the Doctor gives Pierce a few jolts of e-stim madness. The jolts make Pierce's monster dick grow even harder and when the Doctor turns around, Scotty can't help but take a taste of the creature. The Doctor hasn't given Scotty permission to suck the monster's cock, and as punishment has Scotty blow the Doctor. The Doctor wants more of his assistant and bends Scotty over to lick his ass as Scotty continues his sucking fixation on the creature's dick. Sensing that his assistant is ready to get his ass stretched, the Doctor slips his thick dick deep inside Scotty's hole, stretching him out and getting him ready for more. The monster wants in on the action and takes over for the Doctor, pounding Scotty's ass while the Doctor fucks his face. It's a dream come true for Scotty who gets both holes used and opened up for what's about to come. Without instruction and on pure instinct, the creature knows what to do next and greases up his gloved hand to slide into Scotty's gaping hole. He goes wrist deep inside Scotty with his fist and keeps a steady pace. The Doctor is so turned on by the sight of his creation fisting his assistant that he blows a massive load all over Scotty's face. Scotty is still enjoying the fist up his ass when the Doctor leaves the room and barks out the command to get the creature ready for his next treatment.",
  "models": [
    {
      "name": "Hugh Hunter",
      "person_id": 37891
    },
    {
      "name": "Pierce Paris",
      "person_id": 50409
    },
    {
      "name": "Scotty Taylor",
      "person_id": 50408
    }
  ],
  "release_date": "2017-10-12",
  "scene_id": 127671,
  "series": "Dr. FrankenFuck's Fist Lab",
  "tags": [],
  "title": "Dr. FrankenFuck's Fist Lab"
}