{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Tattooed warriors Bruno Bernal and Ian Greene sit and make out while stroking their hard cocks. From the doorway, Jaxton Wheeler observes them and strokes his own meat. So turned on, Jaxton lets his lust take over and joins them. Laying on his back, Jaxton gives head to Ian while Bruno rides Jaxton's cock. Jaxton's massive, muscular chest heaves as Ian fucks his face. Sweat reflects the golden light as it hits their tan, hairy bodies. Ian grabs Jaxton's muscular pec before resuming fucking Jaxton's face. Faster and faster, Jaxton pounds Bruno's ass by thrusting upward. Switching things up, Jaxton gives it to Bruno doggy style. Grabbing Bruno by the hair, Jaxton pulls him backwards, impaling him ever deeper on Jaxton's monster cock. Bruno takes a break and lets Ian have a turn riding Jaxton's tool. Ian's frantic moans rise as Jaxton delivers the full power of his incredible physique to Ian's ass. His thick cock slides in and out of Ian's tight hole, stretching the muscle ring more and more. Laying on his back again, Jaxton pummels Ian's hole from below as Bruno caresses Jaxton's hairy chest. Turning around, Bruno lowers his ass onto Jaxton's fearsome, bearded face, and Jaxton rims Bruno with intense vigor. For the grand finale, all three men stand together. Ian bends down to suck Jaxton's cock, and Bruno sucks on Jaxton's nipple. Pressing Ian's face into his crotch, Jaxton unleashes a massive load across Ian's cheek. Bruno strokes his uncut cock, dripping his hot, white load onto the floor. On his knees, Ian jerks out his thick, creamy load, then stands to exchange a slow, passionate, three-way kiss with Jaxton and Bruno",
  "models": [
    {
      "name": "Jaxton Wheeler",
      "person_id": 37469
    },
    {
      "name": "Bruno Bernal",
      "person_id": 38197
    },
    {
      "name": "Ian Greene",
      "person_id": 49134
    }
  ],
  "release_date": "2017-09-25",
  "scene_id": 127737,
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Bodybuilder",
    "Cumshot",
    "Group Sex",
    "Hairy",
    "Masturbation",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Erectus, Scene #03"
}