{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Leo Luckett agrees to let realtor Dalton Riley set up an open house, he does so putting aside their sordid past. Sure, Dalton and Leo had a bad falling out, but Leo really needs to sell his house, and Dalton claims to have a buyer. But after waiting around for the better part of an hour, Leo becomes suspicious and Dalton finally confesses that there never was a buyer. He set up the meeting as an excuse to see Leo. Leo is furious and lets Dalton know, and Dalton begins to storm out yet again. Leo gives chase, and for whatever reason, Dalton does an about-face, apologizing to Leo for everything that has happened. That's all Leo really needed to hear, and almost instantly, the two of them go from fighting to fucking. Dalton presses Leo against the stairwell as he reaches his hands deep down into Leo's pants, unzipping his own as Leo falls to his knees. Leo gives Dalton the head he's been missing since they broke up, and when Dalton returns the favor, Leo wonders why they ever split up in the first place. As Dalton slides his raw cock deep into Leo's waiting hole, he wonders the same, and as they fuck all over the stairs, the chemistry they share seems to have withstood the test of time, as Dalton plows Leo's hole before seeding it with his pent-up nut. He unleashes it all over Leo, breeding his hole as Leo jizzes from the penetration, and as the two of them lay there freshly reunited, the door opens and a would-be buyer gets an eyeful.Enjoy!",
  "models": [
    {
      "name": "Dalton Riley",
      "person_id": 48651
    },
    {
      "name": "Leo Luckett",
      "person_id": 50197
    }
  ],
  "release_date": "2017-10-21",
  "scene_id": 127973,
  "series": "NDR -105 - Dalton Riley & Leo Luckett",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Rental History"
}