{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Tegan is still with his captor, Colby Keller. After thanking Colby for taking such good care of him, Tegan gets on his knees between Colby's legs and starts servicing his giant cock. Is Tegan starting to really fall for his captor, or is it a classic case of Stockholm Syndrome? Perhaps Tegan has something else up his sleeve. Whatever the case, Colby is in for the time of his life with Tegan's tight muscled body. Wanting to provide the best service he can give, Tegan opens his mouth wide and takes Colby's massive junk all the way down his throat. Colby is hard as a rock and ready to explore Tegan from the inside. He spits on his hand and jams three fingers up Tegan's hairy ass to stretch it out and to make way for his big glistening cock. To prolong the fun for just a little bit longer, Colby pulls Tegan back to the bed and the studs 69 while Tegan keeps plugging away sucking Colby's big cock. Tegan is Colby's dream man, and he wants to please Tegan with a long and hole-widening rim job. Once Colby has succeeded in opening Tegan up as far as he'll go, he throws Tegan down on the bed to pile drive his prisoner. Colby pounds away as Tegan grunts with each plunge from Colby's big hard dick. Colby wants to be face to face with Tegan so he can kiss him and worship his hairy chest and pits. As the studs passionately make out and rub beards, Colby enters Tegan from behind and fucks him. The feel of a strong man holding him and fucking him from behind is enough for Tegan to blast his load. When Colby sees that his hostage has been satisfied, he pulls out and goes ass to mouth on Tegan's face. Colby blasts his thick sperm all over Tegan's big full lips and dark bushy beard. 'Thank you, Sir,' is all Tegan can muster to say after such a satisfying and unexpected experience.",
  "models": [
    {
      "name": "Colby Keller",
      "person_id": 19695
    },
    {
      "name": "Tegan Zayne",
      "person_id": 46884
    }
  ],
  "release_date": "2017-10-20",
  "scene_id": 127962,
  "series": "Trapped",
  "tags": [
    "Anal",
    "Feet",
    "Hairy",
    "Jocks / Athletic",
    "Oral",
    "butt play",
    "butts",
    "cum shots",
    "fetish",
    "rimming"
  ],
  "title": "Trapped, Scene #04"
}