{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Kurtis Wolfe is plowing Tegan Zayne's hairy hole on the couch for a nice long fuck session in the living room. Tegan loves every inch that Kurtis offers and spreads his legs wide to take as much of Kurtis as he can get. 'Pound that ass!' Tegan moans out as Kurtis picks up the pace to give Tegan what he needs. With a mix of gentle pleasure and rough pounding, Tegan and Kurtis kiss each before Tegan takes control and throws Kurtis down to ride his big hard cock. Tegan spreads his cheeks wide for maximum penetration. Kurtis loves the sensation of Tegan's tight butt and smiles as Tegan enjoys the plunging. Kurtis wants a taste of Tegan's hairy hole and bends him over with his ass in the air. Tegan can't get enough of Kurtis' tongue and fingers inside him as Kurtis takes care to cover every hairy bit from Tegan's throbbing ass, to his fuzzy taint and balls. Both studs are primed and ready to blow as they move into 69ing. Tegan is the first to start begging for a load and Kurtis doesn't disappoint as he blasts an extra thick and creamy load inside Tegan's mouth. Tegan holds it on his tongue to taste every salty sweet drop before he lets it roll out past his big, full lips and onto his thick, dark beard. With the taste of Kurtis still on his palate, Tegan lets loose and explodes all over Kurtis' face. In their after-sex glow, the two lovers hold each other and kiss as Kurtis proclaims that he wants to take the relationship to the next level. Not sure where his life is going, Tegan takes Kurtis up on his offer to think about it on a solitary trip to the woods. Tegan feels 'Trapped'. What will he ultimately decide and will Kurtis accept Tegan's decision?",
  "models": [
    {
      "name": "Tegan Zayne",
      "person_id": 46884
    },
    {
      "name": "Kurtis Wolfe",
      "person_id": 50440
    }
  ],
  "release_date": "2017-10-06",
  "scene_id": 127940,
  "tags": [
    "Anal",
    "Big Dick",
    "Hairy",
    "Oral",
    "butt play",
    "butts",
    "cum shots",
    "masturbation",
    "rimming",
    "sixty nine"
  ],
  "title": "Trapped, Scene #01"
}