{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Fresh off their newly minted brotherly hook up, but still waiting for their parents to officially tie the knot, Calvin Chambers and Paul Canon now find the annoying neighbor boy, Dakota Young knocking at their door. Paul and Calvin are quick to try and get rid of Dakota, when he suddenly asks if it's because the want to fuck again. Paul and Calvin look ghost white with embarrassment, and as Dakota holds up his phone, they realize he's suddenly holding all the cards. 'Fuck me,' Calvin exclaims, but Dakota tells him he actually had the opposite in mind, eyeballing Calvin's package through his shorts. Calvin and Paul instantly shift to punish mode, as they shove their cocks in Dakota's mouth, letting him take turns as they each choke him out with their dicks. Calvin wastes no time bending Dakota over and shoving his raw cock in Dakota's hole, fucking him as hard as he can while Paul continues to gag him with his cock. Dakota then mounts Paul as Calvin slaps Dakota with his dick. Dakota deep throats him while Paul long dicks him, and then they switch one more time as Calvin fucks the jizz out of Dakota just as Paul dumps his load on Dakota's face. Calvin follows suit and pulls out just in time to nut all over Dakota's hole, drenching him with a nice, thick batch. Seems like their little neighborhood fuck club just added a new member.Enjoy!",
  "models": [
    {
      "name": "Calvin Chambers",
      "person_id": 50269
    },
    {
      "name": "Dakota Young",
      "person_id": 48374
    },
    {
      "name": "Paul Canon",
      "person_id": 36900
    }
  ],
  "release_date": "2017-10-25",
  "scene_id": 127993,
  "series": "NDR - 106 - Paul Canon, Calvin Chambers & Dakota Young",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Fresh Brotherhood Part 2"
}