{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With step-brother Dante Martin waiting to pounce, Markie More brings class mate Clark Campbell to stay for the week while their parents are out of town. Clark needs a place to stay for a short while, so the arrangement couldn't be better in his mind. Dante and Markie feel the same, but for different reasons, as Dante knocks on Clark's door to see how he's settling in. As Markie makes his way down the hallway, he can hear familiar sounds coming from inside the room, and when he opens the door and finds Dante sucking Clark off, the plan is exposed for what it is, as a confused Clark slowly pieces together what these two are up to. Markie tells Clark that it's cool, they do it all the time, and Clark seems hesitant until Markie points out how hard Clark is from the blow job, and Clark concedes that it does feel good. With that, Markie joins them and shoves his cock into Clark's mouth as Dante continues what he was doing. Once Clark is nice and hard, he asks Clark if he wants to go a step further, and when Clark nods, Dante mounts Clark's raw straight boy dick and gives him the ride of his life.  Dante and Markie both take a nice dicking from Clark, and all three guys are getting close to cumming, but before they do, Dante asks Clark if he'd like to try taking some dick. Clark agrees and Dante spreads him out on his back, easing his cock into Clark's virgin hole and working him slowly at first as Markie sits on his face. Dante begins to fuck harder and harder as Markie strokes his load all over Clark's chest, emptying himself all over Clark as Dante continues to pound away. Clark busts his nut as Dante fucks him hard enough to make the bed shake and bang against the wall, and the sight of Clark all cum covered is hot enough to trigger Dante, who pulls out and blasts Clark's hole before breeding the cum drenched newbie. As the three of them lay there sweaty and satisfied, Markie says that Clark could be a keeper, and Dante whole-heartedly agrees.Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Clark Campbell",
      "person_id": 50192
    }
  ],
  "release_date": "2017-10-18",
  "scene_id": 127965,
  "series": "NDR -104 - Markie More, Dante Martin & Clark Campbell",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Rimming",
    "Smooth",
    "Threesome"
  ],
  "title": "Bros Who Fuck"
}