{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Alex Chandler has the object of desire and every time JJ Knight gets near him Alex uses his virtual powers to stop the muscle stud. JJ can't seem to get the upper hand and decides that to win the game, he's got to play dirty. When he corners Alex, JJ strips down and pulls out his massive dick. 'This is what you wanted, right?' JJ says as he offers up his own body for the sake of recovering the object. Alex immediately gives into his temptations and starts kissing the hung stud under the bright blue sky. Alex needs JJ inside him at all costs and gets on his knees to take the massive hard-on down his throat. Alex moans out as JJ thrusts into his hungry mouth. JJ wants to feel the inside of Alex from behind and bends the hottie over to rim his ass. JJ takes his time to get Alex nice and opened up and when the time is right, JJ stands up and inserts his extra-large manhood deep into the thin jock's hairy retreat. After a long session of getting his back door serviced, Alex decides to take control and hops on to ride JJ to the finish. Alex is hard as a rock as JJ's big dick pokes in and out of his ass. JJ hits just the right spot and Alex is happy to finally let loose and spill his cum into the beautiful natural setting around them. Alex is still hungry for more and gets down to take every last drop that JJ has to offer all over his tongue. Alex laps up what didn't land in his mouth and as the two studs come down from their heightened sexual senses, only one will be able to grab the trophy and win the game once and for all.",
  "models": [
    {
      "name": "JJ Knight",
      "person_id": 38220
    },
    {
      "name": "Alex Chandler",
      "person_id": 50518
    }
  ],
  "release_date": "2017-10-27",
  "scene_id": 128136,
  "series": "Head Play",
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Cumshot",
    "Foreskin",
    "Oral Sex",
    "Outdoor Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Head Play, Scene #04"
}