{
  "collections": [
    "Raging Stallion"
  ],
  "description": "The local sheriff and his deputy get a tip on where kidnapping victim, Tegan Zayne, is being held. After investigating, the lead detective lets Kurtis Wolfe know where his boyfriend is staying. Kurtis needs to see Tegan and shows up at the cabin in the woods. After Tegan expresses his concern that he can no longer choose who he loves, Kurtis suggests that they all love each other. To show that he means what he says, Kurtis gets on his knees and sucks Colby's big veiny cock. Tegan follows along and the two studs service Colby together, taking turns slurping on his big pole. Tegan wants to pleasure both of his men and opens wide to get both Colby and Kurtis in his drooling mouth at the same time. Colby is revved up and gets Tegan and Kurtis to lie back on the bed with their legs in the air. He eats both of their tight hairy assholes, making sure to give each one plenty of attention. He loosens them up as he fingers both asses, then slips his cock into Tegan and starts pounding a steady rhythm. Kurtis wants to feel Colby inside him and assumes the position to eat Tegan out while Colby opens his hole with his giant dick. Colby is good at what he does and he pounds the cum right out of Kurtis, who drops his load on Tegan's face. After getting a fresh batch of cum in his mouth, Tegan can't help but to give into his instincts and let his own cock explode on both Colby and Kurtis. Once Colby gets his own mouth sprayed he's ready to reward his two lovers with milky ropes of pure white jizz. Tegan and Colby lap up the juice and kiss away any remnants that remain. Can the kidnapper, the victim, and the former lover live together in harmony or will there be trouble in paradise?",
  "models": [
    {
      "name": "Colby Keller",
      "person_id": 19695
    },
    {
      "name": "Kurtis Wolfe",
      "person_id": 50440
    },
    {
      "name": "Tegan Zayne",
      "person_id": 46884
    }
  ],
  "release_date": "2017-11-03",
  "scene_id": 128157,
  "series": "Trapped",
  "tags": [
    "Anal",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "butt play",
    "butts",
    "cum shots",
    "jockstraps",
    "masturbation",
    "rimming"
  ],
  "title": "Trapped, Scene #06"
}