{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Rikk York has a dilemma. He's camping in the woods with Seth Santoro and Rikk York and he can't decide which one to fuck. Rather than make the decision himself, he lets the guys do their work to let the action play out naturally. Damien is hungry for dick and gets down on his knees in front of both Rick and Seth to suck their big hard cocks. Damien and Seth make out as they get their dicks serviced by the horny stud. Seth wants to play the cock sucking game too and soon joins Damien on his knees to share Rikk's throbbing dick. Each dude takes a side and opens his mouth wide to let Rikk take control and fuck their lips. All the attention feels amazing on Rikk's cock and he takes matters into his own hands. He bends Damien over a patio chair and slips his thick dick all the way into the tight ass in front of him. Seth cheers the guys on and jerks his own meat before getting down to lick Rikk's hairy ass. He gets the ass lubed up and then stands to slide his cock deep inside. Rikk takes the dick like a pro and sucks on Damien's pole as Seth pounds away. Rikk's asshole feels amazing enveloping his cock, and after a nice long fuck session, Seth pulls out and blows all over Rikk's fuzzy butt. Watching all the action around him is more than Damien can handle and he busts a load right into Rikk's open mouth. One taste of Damien's jizz is all it takes for Rikk to let loose and return the favor by blasting all over Damien's beard and in his mouth. After all the fun, Seth and Rick get lost on a hike and stumble across Tegan and Colby outside. Something doesn't sit right with Seth. Will he recognize Tegan and will he be able to help him before it's too late?",
  "models": [
    {
      "name": "Seth Santoro",
      "person_id": 37664
    },
    {
      "name": "Rikk York",
      "person_id": 47778
    },
    {
      "name": "Damian Taylor",
      "person_id": 50569
    }
  ],
  "release_date": "2017-10-27",
  "scene_id": 128156,
  "series": "Trapped",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "latinos",
    "rimming"
  ],
  "title": "Trapped, Scene #05"
}