{
  "collections": [
    "Club Inferno Dungeon"
  ],
  "description": "The big day is finally here, and the World Series of Fisting panel of judges with Tom Moore, Hugh Hunter, and Joey D, is ready to choose the best fisting bottom in the world. Representing France is Axel Abysse with his massive rosebud, and keeping the Irish proud is Sam Syron, with his gaping hole just ready to take on the competition. With the categories of best self fister, best rosebud, deepest penetration, best punch fistee, and widest gaping hole, these guys have their work cut out for them. The judges are experts and the contestants are hungry for success. Axel and Sam start out facing each other as Hugh and Joey grease up their fists. Both guys get their holes stretched to the limits as their rosebuds bloom bigger and harder with each punch of the fist. The competitors are eager to show off and move into self-fisting as each of them slams their own holes, alternating fists and groaning hard as they strive for the ultimate deep self-fisting penetration. After a satisfying round of self-appreciation, the guys go back into getting fisted by the judges with Hugh and Joey each going wrist deep into their respective fistees. The anticipation of hitting the finish line takes over and each of the judges pulls out their massive dicks and dumps a load. Joey is the first to let loose all over Sam's tight body. Hugh soon follows suit and leaves Axel's tank top drenched with jizz. After all of that, the competition isn't quite done. Who will walk away as the world champion of fisting?",
  "models": [
    {
      "name": "Hugh Hunter",
      "person_id": 37839
    },
    {
      "name": "Axel Abysse",
      "person_id": 38051
    },
    {
      "name": "Joey D",
      "person_id": 49163
    },
    {
      "name": "Sam Syron",
      "person_id": 50458
    }
  ],
  "release_date": "2017-11-30",
  "scene_id": 128263,
  "series": "World Series of Fisting",
  "tags": [
    "Anal Sex",
    "Big Cock",
    "Cumshot",
    "Fisting",
    "Jockstrap",
    "Rosebud",
    "Self-fisting",
    "Tattoos"
  ],
  "title": "World Series of Fisting, Scene #05"
}