{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Danny is at it again and he better be careful or Nick will come out and bust his ass. Danny loves to skateboard on his neighbor's driveway which pisses Nick off all the time. Usually Danny gets away with it but today he slams on the asphalt and takes a breather which is when his guard went down. Nick can hear the sounds of a skateboard outside and rushes out to see if it's Danny again. Yup sure enough Nick can see him and he pushes Danny over and grabs his board and heads off into his home. Danny chases after Nick and once inside Nick tells him there is only one way to get his board back and that is to get down on his knees and worship his huge cock. Danny can't believe he has to blow his neighbor again but he'll do anything to get his board back so he drops to his knees and begins servicing Nick's extremely thick dick. Nick face fucks Danny's throat deep and hard gagging him constantly. Today won't be just about cock worshiping but also he will be bent over. Nick grabs Danny and stands him up so that he can suck on his young skateboarder dick. Nick loves the skater cock as he gulps every inch of Danny's sexy throbbing dick. Nick is almost ready to fuck that tight skater ass and he has Danny bend over to spread his legs. Nick spreads his hole wide and starts to tongue fuck him deep. He fingers his tight hole and licks all over his ass plus spitting on his little hole. Danny's ass is dripping with spit and Nick's hard dick is throbbing so he pushes Danny over and slowly pushes his thick dick into Danny's small eager hole. The pleasure coming from Danny makes Nick go balls deep and once his hole relaxes Nick begins to fuck that skater ass pumping him and thrusting deep inside. They move to the chair where Nick sits down and Danny slowly lowers himself on every inch of that hard big dick. Once all the way in Danny rides Nick's shaft all the up and down continuously until he can fill his balls about to pop. Nick flips him on his back and fucks the cum right out of Danny's full balls. Nick sees all the skater cum and strokes his nut out all over Danny's awaiting smooth skater chest. Nick lets Danny grab his board but if he ever sees him again that ass will be his.  Enjoy!",
  "models": [
    {
      "name": "Danny Gunn",
      "person_id": 50556
    },
    {
      "name": "Nick Capra",
      "person_id": 37496
    }
  ],
  "release_date": "2017-10-30",
  "scene_id": 128207,
  "series": "DL - 55 - Danny Gunn & Nick Capra",
  "tags": [],
  "title": "Skateboarder"
}