{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "When Markie More finds out roomie Clark Campbell has been invited to an orgy later that night, he wonders if Clark is ready to have relations with a guy, should the situation arise. Clark says that he is ready, and mentions that he's had a past experience with a guy before. Markie's ears perk up when he hears this, and suddenly, he views his roommate in a new light, smacking him on the ass and giving him a look. Clark turns and sees the intent in Markie's eyes, and gives him no reason to stop, so Markie takes Clark up to the bedroom and throws him onto the bed, going down on him instantly. Clark enjoys it as Markie deep throats him, sucking him down the base of his cock and spitting on the head. Clark is rock hard by the time he returns the favor, and with Markie now rock hard as well, Clark suggests Markie take a turn at fucking him. Markie needs no further prompting as he positions Clark on his back and slides his bareback cock deep into his roommate. Clark takes every inch as Markie eases it in at first, picking up speed as they go along. Markie fucks Clark good and long before deciding that he wants a taste too, so they switch places as Markie mounts Clark's hard on, taking it for a ride as he strokes himself off. Markie moves to his hands as knees as Clark pounds him from behind, jizzing all over Markie's hole before turning him over and fucking the cum out of him. As they lay there in a cum-drenched puddle, Markie concludes that they're both ready for the orgy later, and Markie smiles and agrees.Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Clark Campbell",
      "person_id": 50192
    }
  ],
  "release_date": "2017-11-09",
  "scene_id": 128209,
  "series": "NDB - 4819 - Markie More & Clark Campbell",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Orgy Warm-Up"
}