{
  "collections": [
    "Club Inferno Dungeon"
  ],
  "description": "Joey D is the fisting coach for Colin Bryant and Axel Abysse and he's ready to have one last training session to make sure the boys are in shape for the World Series of Fisting. To start, Joey wants to feel the appreciation for all his hard work training the guys. He unzips his pants and whips out his big veiny cock for Colin and Axel to worship. Colin and Axel don't want to let their coach down and they get to work sucking his cock and ass. Once Joey feels like his athletes have paid enough homage to his big dick, he bends Colin over and slides his throbbing pole deep inside the blonde's blossoming ass. Joey pounds away making Colin moan out with every thrust from his hips. Not wanting to be left out, Axel joins the action by offering up his hole for the coach to stretch with his cock. Joey's cock feels great going in and out and Axel tops off the fun by snacking on Colin's used up hole. After a nice long fuck session, Joey thinks the guys are ready for his fists. Colin and Axel bend over and offer up their holes. Joey dips his gloved hands in a vat of grease and simultaneously slides each of his fists deep into his star fisting athletes. Joey wants to give the guys maximum pleasure and spins his fists inside their extra stretched asses as he continues to maintain a depth of wrist-deep. When the coach is convinced his guys are warmed up and stretched out from his training session, he sidles up behind Colin and jacks his cock until it explodes in the air and showers his proteges with a rewarding geyser of cum.",
  "models": [
    {
      "name": "Axel Abysse",
      "person_id": 38051
    },
    {
      "name": "Colin Bryant",
      "person_id": 49745
    },
    {
      "name": "Joey D",
      "person_id": 49163
    }
  ],
  "release_date": "2017-11-02",
  "scene_id": 128261,
  "series": "World Series of Fisting",
  "tags": [
    "Anal Sex",
    "Big Cock",
    "Cumshot",
    "Fisting",
    "Jockstrap",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "World Series of Fisting, Scene #03"
}