{
  "collections": [
    "Club Inferno Dungeon"
  ],
  "description": "Round two of final training has come for Axel Abysse and Colin Bryant on the night before the World Series of Fisting. Joey D is their trainer and he knows time is of the essence so gets to the point without wasting any time. Colin is the first to get his hole trained and he lies back with his legs in the air for Joey to stretch with his large, closed fist. Axel isn't left out of this round of training either as Colin eats his ass and takes Joey up to the forearm. Once Joey is convinced that Colin will do well in the competition, he calls for the guys to switch it up. Axel is excited to once again get the coach's fist up his butt and he eagerly gets on his back and spreads his legs wide. His excitement shows through as he gives a big smile and lets his rosebud bulge. The coach takes time to rub the bulging protrusion, making it even more exciting for Axel to get the fist. The coach doesn't hold back this round. He knows that the competition tomorrow will be fierce and he wants to make sure Axel and Colin are ready for anything that could come their way. Joey starts by sliding one open fist into Axel and works his way up to a two-handed frenzy. He alternates fists in and out as Axel closes his eyes and takes in all the sensations his lucky body is handing out. When Joey knows for certain that his men are worthy of the competition, he lets the guys lie back and reward themselves with a milking session that leaves the guys covered in their own thick layer of cream.",
  "models": [
    {
      "name": "Axel Abysse",
      "person_id": 38051
    },
    {
      "name": "Joey D",
      "person_id": 49163
    },
    {
      "name": "Colin Bryant",
      "person_id": 49745
    }
  ],
  "release_date": "2017-11-16",
  "scene_id": 128262,
  "series": "World Series of Fisting",
  "tags": [
    "Anal Sex",
    "Big Cock",
    "Fisting",
    "Rimming",
    "Rosebud",
    "Self-fisting",
    "Tattoos"
  ],
  "title": "World Series of Fisting, Scene #04"
}