{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Johnny Hill makes his way over to Jordan Boss' new place, he happens upon Jordan butt naked jacking off in front of a mirror. Having knocked on the front door, Johnny now watches as Jordan's chiseled muscles flex, and Johnny finds himself getting excited at the thought of joining Jordan. Just then he hits the door, and Jordan turns, just missing Johnny ducking around the corner to hightail it out of there. Jordan catches up with him around the other side of the house and the two of them play it off like nothing happened... until Jordan is showing Johnny around the new place and Johnny remarks how much he likes Jordan's new mirrors. Jordan laughs and tells him he already know how much Johnny likes them, and Johnny looks confused as Jordan inches closer to him, placing his hand on Johnny's thigh and cupping his hard dick. Jordan tells him he had no idea Johnny was into him, and Johnny, still perplexed, sits there with mouth agape as Jordan begins to suck him off.  Johnny's cock is rock hard inside Jordan's mouth, and Jordan is ready to take it for a spin, so he tells Johnny to fuck him hard. Johnny slides his raw cock deep into Jordan's waiting hole and proceeds to pound his bestie all over the bed, fucking him doggy, reverse cowboy, and finally, just spreading him wide open and fucking the cum out of him. Jordan spits his load as Johnny pulls out and blasts him. Cum covered, Jordan mentions that what a good buy the mirrors turned out to be, and Johnny nods and laughs in agreement.Enjoy!",
  "models": [
    {
      "name": "Jordan Boss",
      "person_id": 38179
    },
    {
      "name": "Johnny Hill",
      "person_id": 49385
    }
  ],
  "release_date": "2017-11-08",
  "scene_id": 128305,
  "series": "NDR -110 - Johnny Hill & Jordan Boss",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Visual Needs"
}