{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Bummed and broke, Michael Del Ray is moping around the house and Connor Halsted has taken notice. Asking Michael what his deal is, he learns that Michael is looking for a job and just about out of options. Michael asks Connor if his bar is hiring, and Connor tells him they're looking for a go-go dancer. Michael thinks he'd be good at that, but Connor is having a vision problem seeing it happen, so Michael convinces him to let him audition and if Connor likes what he sees, he promises to give him a recommendation. At first, Conor seems safe, as Michael doesn't really seem to have what it takes, but as soon as the music comes on, Michael's clothes come off and suddenly, with Michael's huge cock gyrating in his face, Connor can picture Michael doing very well. Having said that, Connor still wants to sample the wares, so he grabs Michael's cock through his underwear and pulls it out, taking it in his hand before downing it with his mouth. Michael stuffs his throat with his huge cock, before switching and showing Connor just how appreciative he can be. With Connor rock hard now, Michael puts his ass in Connor's face and tells him to get it ready, so Connor plunges face first into Michael's ass, until Michael is ready for some hard feedback. He mounts Connor's cock and gives him a ride, grinding his ass into Connor and showing off his bounce. Connor is impressed and ready for more, flipping him over and taking him from behind, before flipping him over one last time and fucking the cum out of Michael. As he spits his own load, he realizes work is gonna be a whole lot more fun with his new fellow employee on board. Enjoy!",
  "models": [
    {
      "name": "Connor Halsted",
      "person_id": 49822
    },
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    }
  ],
  "release_date": "2017-11-17",
  "scene_id": 128303,
  "series": "NDO - 4822 - Connor Halsted & Michael Del Ray",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Facial Hair",
    "Gay Porn",
    "Jerking off",
    "Kissing",
    "Oral",
    "Rimming"
  ],
  "title": "Show Me Your Moves"
}