{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Markie More is known to have an eye for talent, so when he heard that Allen Lucas had started bottoming, Markie's interest piqued. After checking out some of his vids, Markie decided he definitely wanted a piece for himself, so he threw he humbly requested a scene with Allen. For his part, Allen sure seems excited to be chosen, and can't wait to take Markie's famous cock for a test drive. Markie promises not to take it easy on him and Allen's cock swells in anticipation. Markie pulls out Allen's hard on and sucks him to the base, deep throating him as he strokes him softly. Allen's head spits a little pre-cum as Markie downs him again. They switch and Markie face fucks Allen before flipping him over and eating his ass while Allen strokes himself. Markie spits in his hole then plunges his cock deep inside, filling Allen up before pile driving him from above. Allen tells Markie to slow down or else he'll cum, and instead, Markie flips him over and hits it from the back, arching Allen's ass high up in the air so he can watch his meaty cock going in and out. It's evident that both guys are ready to spit their loads, so Allen mounts Markie's dick and rides him until he spits his huge load in a cathartic release. Allen's load drenches his stomach just as Markie pulls out and cums all over Allen's face. Feeding his throbbing cock to him, Markie helps Allen lick up every drop.Enjoy!",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 47889
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2017-11-23",
  "scene_id": 128433,
  "series": "NDB - 4823 - Markie More & Allen Lucas",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Markie's Special Request"
}