{
  "collections": [
    "Next Door Originals"
  ],
  "description": "When buddies Quentin Gainz and Eric Turner make their way over to their bros house to see what's happening, they can hardly believe what they see through the window: their boy Gunner half naked and sucking off fellow bro Zay Hardy in the dining room. Seeing that they are clearly unashamed, Quentin and Eric decide they might like to join them, so instead of knocking, they burst through the door and confront their bros with the proposition. Gunner and Zay both seem into it, and so Gunner resumes his position on the table while Zay and Eric take turns face fucking him. Quentin makes his way to Gunner to suck on his cock, and as Gunner deep throats Eric for the first time, Eric realizes what a great idea this was after all. Breaking down into pairs, Eric returns the favor to Gunner while cock hungry Quentin goes to work on Zay's big cock. Gunner pulls his cock out of Eric's mouth and suggests they all go upstairs to take it further. Once there, Quentin mounts Gunner's raw cock, slowly easing his way onto it and then riding him gently at first as Zay and Eric look on. Zay slaps his dick on Eric's face as Gunner starts pumping harder. Once he's had his fill of Quentin's ass, he calls for Eric, bending him over and taking him to pound town as Quentin continues to suck off Zay. Gunner fucks Eric hard and Zay is ready to burst his load, but Quentin isn't satisfied 'til he gets to do some fucking, so turns the tables on Gunner and lays him out, shoving his dick deep inside and going full throttle as Zay and Eric both stroke themselves dry. They spit their loads watching as Quentin fucks the cum out of Gunner. He shoots all over his tanned abs as Quentin pulls out and drains his cock all over Gunner's hole. Coated in jizz, they all decide this is something that should be more of a regular Saturday thing. Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    },
    {
      "name": "Gunner",
      "person_id": 50330
    },
    {
      "name": "Eric Turner",
      "person_id": 50583
    },
    {
      "name": "Zay Hardy",
      "person_id": 51117
    }
  ],
  "release_date": "2017-11-24",
  "scene_id": 128435,
  "series": "NDO - 4824 - Quentin Gainz, Eric Turner, Gunner & Zey Hardy",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Muscles",
    "Blowjob",
    "Brunette",
    "Facial Hair",
    "Gay Porn",
    "Jerking off",
    "Muscular",
    "Oral",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Bros Before Hoes"
}