{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When club bros Mikey and Gunner go out to try and score, they end up instead collapsing from exhaustion on the couch at the end of the evening. When he wakes the next morning, Mikey's still crazy horny, and the bulge in Gunner's pants seems to indicate that he's needing some sexual release as well. Mikey carefully unzips Gunner's pants and feasts his eyes on Gunner's cock, slowly handling it delicately as Gunner stirs awake and watches him out of the corner of his eye. Startling him, Gunner asks him if he wants to suck his cock now that he's re-energized. Mikey looks confused and Gunner tells Mikey all about the night before, when in a party mood he proclaimed himself to be horny enough to fuck his bro. Now with the offer right in front of him, Mikey cannot resist, downing Gunner's cock and licking it up and down. Gunner exhales a satisfied moan as Mikey deep throats his hard on, and he stands up to face fuck Mikey even deeper. Mikey proves he knows how to suck a dick, but he's surprised when Gunner offers to return the favor. Still, he jumps at the chance, and Gunner works his shaft before sucking on Mikey's head, working his way down to the balls and tonguing Mikey's hole before standing and telling Mikey to ride him. Mikey does as he's told, mounting Gunner and giving it his all. He takes every inch of Gunner's meat stick and grinds harder and harder, his own hard dick slapping against Gunner's rock hard abs. Gunner lets him ride for a bit before flipping Mikey over and arching his ass to pound him doggy style, pulling out and shoving it back in just to watch the tip of his bareback cock going in and out of such a sweet ass. Mikey and Gunner are both ready to cum, so Gunner flips Mikey over and fucks the cum out of him, he spits it all over his chest as Gunner pulls out blankets his hole with his load. Mikey lays there with the evidence all over him that both guys really need to do this more often.Enjoy!",
  "models": [
    {
      "name": "Mikey Junior",
      "person_id": 48340
    },
    {
      "name": "Gunner",
      "person_id": 50330
    }
  ],
  "release_date": "2017-11-11",
  "scene_id": 128547,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Sexually Frustrated"
}