{
  "collections": [
    "Next Door Raw"
  ],
  "description": "After talking about it with his buddy Jordan Boss, Calvin Chambers finds himself hooking up a different kind of online hookup. Christian Bay is ready, willing and down to fuck, but Calvin tells him he really just wants to watch Christian and Jordan go at it. Christian seems to be ok with it, and Jordan is definitely down with the program, so as Calvin sits in a corner and strokes himself off, Christian and Jordan go at it, stripping out of their clothes as Christian goes down on Jordan's cock, deep throating him as Calvin looks on. Jordan returns the favor as Calvin gets rock hard, and he decides to join in after all, standing and making his way over to Christian, shoving his cock in Christian's mouth as Jordan stands and readies himself to plow Christian's hole. Jordan plunges his raw cock deep inside Christian as Calvin continues to face fuck him. They pig roast Christian who proves to be quite the cock pig. Sweaty and loving it, Calvin tells Christian to sit on his dick and take a ride, and Christian obeys while Jordan looks on. Calvin fucks Christian to submission and then they switch one more time, positioning Christian on his back as Jordan takes one last crack at Christian's hole, pounding him missionary before pulling out and wetting Christian with his load just as Calvin pulls his dick out of Christian's mouth and gives him a nice facial. As Christian lay cum covered, he asks if he gets to cum, and both guys tell him he can do whatever he wants, as they leave him lying there, fucked and forgotten.Enjoy!",
  "models": [
    {
      "name": "Jordan Boss",
      "person_id": 38179
    },
    {
      "name": "Christian Bay",
      "person_id": 48481
    },
    {
      "name": "Calvin Chambers",
      "person_id": 50269
    }
  ],
  "release_date": "2017-11-25",
  "scene_id": 128555,
  "series": "NDR - 115 - Calvin Chambers, Jordan Boss & Christian Bay",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass to mouth",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "I Wanna Watch"
}