{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Chad Piper makes his way home, he doesn't realize that he's being watched, until neighbor Steve Rogers approaches him at his front door way. Steve cups his hand over Chad's mouth and tells him not to make a sound, explaining that he knows Chad has been watching him at night. Chad begins to protest but Steve tells him it's ok, that he enjoys the idea of Chad watching him, and Steve wonders if Chad is willing to act on his desires. Chad tells Steve he's still a virgin. Steve smiles, telling Chad he likes busting cherries, and they quickly make their way to Chad's room. Once there, Steve is all about business, telling Chad to suck him off. Chad does as he's told, taking Steve's massive cock into his mouth and downing it. Steve gets rock hard as Chad deep throats him, telling Chad to bend over. Chad pensively gets on his hands and knees as Steve pops his cherry, sliding his bareback cock deep into Chad's virgin hole. Chad surprises himself and Steve by taking every inch down to the base, so Steve proceeds to pound him, first from behind, then letting Chad mount him and take a spin. Chad bounces his virgin ass up and down on Steve's meatstick, and having had his fill, Steve flips Chad onto his back and fucks him one last hard time, pulling out and spitting his seed all over Chad's hole, before shoving his cock back in and fucking the cum out of Chad. As he bursts his first load all over himself, he smiles at the release, and Steve tells him he'll be back soon for round 2. Chad tells him he can't wait.Enjoy! ",
  "models": [
    {
      "name": "Chad Piper",
      "person_id": 49592
    },
    {
      "name": "Steve Rogers",
      "person_id": 49929
    }
  ],
  "release_date": "2017-11-18",
  "scene_id": 128552,
  "series": "NDR - 113 - Steve Rogers & Chad Piper",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": " I Like Cherries"
}