{
  "collections": [
    "Falcon Studios"
  ],
  "description": "There's a place in the desert where soldiers can go to get away from the everyday stress of military life. It's isolated and free from enemy control and today Brandon Evans and Fane Roberts find themselves alone in their spot together. Brandon is on his knees servicing Fane's big dick. He gets Fane throbbing hard and unable to think of anything but giving head. Fane wants a taste of his military buddy's big pole and pushes him back against a pillar to get what he wants. Brandon pulls his pants down around his ankles and peels off his shirt as Fane gets to work getting what he needs. The sensual licking drives Brandon wild and he offers up his hairy little ass and bends over to let Fane rim him. Fane's tongue goes deep as he readies Brandon for what's about to come. Brandon begs for Fane to fuck him and Fane isn't one to disappoint. He slides his dick inside his buddy's fuzzy little ass and pumps him as Brandon moans and grunts with each thrust. Brandon's dog tags dangle around his neck as he takes it from behind. Fane wants to get a little deeper inside Brandon and he flips the stud around to get as far in as he possibly can. The deep penetration hits just the right spot and it makes Brandon erupt with an explosion that covers his toned stomach and chest. Once Fane sees the pleasure he's given to his fellow Marine, he pulls out and makes an even bigger mess all over Brandon's writhing body. His thick semen rolls out of his tip and pools up with Brandon's juicy sweetness as the studs finish up an afternoon job well done.",
  "models": [
    {
      "name": "Brandon Evans",
      "person_id": 50717
    },
    {
      "name": "Fane Roberts",
      "person_id": 50718
    }
  ],
  "release_date": "2017-11-22",
  "scene_id": 128617,
  "series": "Code of Silence",
  "tags": [
    "Anal",
    "Boots",
    "Military",
    "Oral",
    "Tattoos",
    "Uniforms",
    "butt play",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "Code of Silence"
}