{
  "collections": [
    "Next Door Originals"
  ],
  "description": "After receiving a text from his buddy to come over, Johnny Hill is surprised when his younger brother, Grayson, greets him at the door. Johnny is further confused when Grayson tells him his brother isn't home, asking Johnny if he's sure he knows who sent the text, then smiling suspiciously. Johnny quickly figures out what's going on, as Grayson runs his finger down Johnny's chest to the seam in his waistline. Moments later, Johnny is throwing Grayson onto the bed and having his way with him, shoving his cock down Grayson's mouth and feeding it to him over and over again. Johnny tells Grayson to get ontop of him, and he proceeds to tongue Grayson's hole as Grayson sucks him off. Johnny's cock is rock hard and Grayson is good and ready for a pounding, so he mounts Johnny and rides him to his heart's content, stroking his cock in Johnny's face as Johnny plows him from below. Johnny is ready to take control, though, so he flips Grayson over and slides his bareback cock into Grayson from behind, fucking Grayson's brains out before flipping him over onto his back. Grayson is rock hard from all the pounding, and he tells Johnny to fuck the cum out of him, so Johnny picks up the pace and Grayson spits his load all over his stomach. A few more thrusts and Johnny's ready to drop his nut, so he pulls out and feeds it to Grayson, who sucks up every last drop, just as he planned. Enjoy!",
  "models": [
    {
      "name": "Grayson Lange",
      "person_id": 47158
    },
    {
      "name": "Johnny Hill",
      "person_id": 49385
    }
  ],
  "release_date": "2017-12-01",
  "scene_id": 128680,
  "series": "NDO - 4826 - Johnny Hill & Grayson Lange",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Deep throat",
    "Gay Porn",
    "Jock Strap",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Don't Tell My Brother"
}