{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Fane Roberts and Dustin Holloway have been riding on fumes, luckily the happen upon and lone gas station in the middle of the desert on Route 66. The smoking hot gas attendant equipped with his very own 70s handle bar mustache, Nate Stetson offers to fill them up, the pair eagerly agree. When Nate notices that the car is running a little hot, he has the guys pop the hood where he and the mechanic, Johnny V, take a look at what's wrong. After discovering that the dip stick is missing, Johnny drives the car into the garage where all the suggestive car talk gets Nate revved up. The two studs start making out and getting naked as Fane and Dustin look on in amazement. Nate is hard as a rock and can't wait to get some full service from Johnny's eager mouth. Johnny is hungry for what Nate has to offer and gets down on his knees to suck on the thick stick in front of him. Nate loves all the attention he's getting but doesn't want to be left out of the dick licking action. After sucking on the nice hard dick, Nate throws down the hood and bends Johnny over to give him a rim. When Nate senses that Johnny is ready to take him on, Nate shifts gears and pops his crank shaft deep inside Johnny's tight cylinder. It's a perfect fit and Johnny moans out in approval with every thrust that Nate doles out. After throttling Johnny over the car, Nate decides to go a little deeper inside Johnny's trunk and lays him out on the garage floor. Nate slips his dick deep inside and pumps away until Johnny blows a gasket and leaks a load all over his rock-hard body. That's all it takes for Nate to go with the flow as he pulls out and covers Johnny's ripped abs with a load of fresh, warm fluid.",
  "models": [
    {
      "name": "Johnny V",
      "person_id": 34806
    },
    {
      "name": "Nate Stetson",
      "person_id": 50747
    }
  ],
  "release_date": "2017-11-15",
  "scene_id": 128782,
  "series": "Route 69",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Oral",
    "Uniforms",
    "butts",
    "masturbation",
    "rimming"
  ],
  "title": "Route 69"
}