{
  "collections": [
    "Next Door Raw"
  ],
  "description": "After being confronted by him in the parking lot, the last thing Mark Long expected to come home and find was Scott Finn blowing his boyfriend, Trevor Jones, but it seems two can play at Mark's little game. Scott seems embarrassed to be caught, but Mark isn't mad. Instead, he tells Scott to finish what he started, and Scott looks down at the bulge in Mark's pants, then back over his shoulder at Trevor seated with his hard on in his hand. With a knowing look, Mark gestures for Scott to proceed, and he unzips his pants and unleashes his gigantic cock. Scott suddenly realizes what he's signed himself up for, as he goes down on Mark's rod while Trevor watches. Pulling Scott out of his clothes, he continues to suck Mark off as Trevor positions himself behind and begins to eat Scott's ass. Scott tongues Mark's balls as Mark strokes himself  hard, and once he's ready, he flips Scott around and plunges his raw cock deep inside Scott's hole, filling him up as Trevor shoves his cock in and out of Scott's mouth. They pig roast him on the chair in the living room before moving to the bedroom. There, Trevor has his turn with Scott's little hole, as Mark enters Trevor, the three of them fuck each other until Scott tells them he wants them both to cum on his face. They stand  up and douse him simultaneously as he ferociously beats himself off, cumming on himself in the process. As he lays there, he realizes the joys of sharing, and suddenly sees his own boyfriend's cheating in a new light.",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Trevor Jones",
      "person_id": 49930
    },
    {
      "name": "Scott Finn",
      "person_id": 50329
    }
  ],
  "release_date": "2017-12-06",
  "scene_id": 128866,
  "series": "NDR - 118 - Mark Long, Scott Finn & Trevor Jones",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Muscles",
    "Climax",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Open Relationships Part 2 - Learning to Play"
}