{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Leather daddy Michael Roman, pig Fernando Del Rio, and Daymin Voss are tatted muscle studs looking to get dirty in their jockstraps. Fernando bends over and offers up his hairy, sweaty hole for the other two muscle hunks to share. Michael and Daymin get Fernando's ass lubed and opened up with their prying tongues and lots of spit while they prime him for what's about to come. Fernando's big fuzzy sack dangles down between his legs as he gets his taint and balls worked along with his hole. Fernando bends over to get spit roasted with Michael stretching out his ass and Daymin reaming his throat with his thick, hairy, huge dick. Michael wants a turn on Fernando's tight hole and the sweaty studs switch positions with the leather daddy fucking Fernando's face as Daymin mans the helm from behind. Daymin pulls out of Fernando and lies down on the table to let Michael ram his big hard cock in his fuzzy crack. Daymin gets his butt hole pounded deep as he sucks on Fernando's hairy dick and rims his used-up ass. Pulling out Michael drops a load of jizz all over Daymin's tasty bubble butt. The sight of it all makes Fernando blast a geyser of his own as the cum shoots out of his throbbing, thick, uncut cock and onto the floor. Daymin is the last to go and moans out hard with his thick, creamy white semen rolling out of the tip of his cock. Nothing gets in the way of these studs living out their fantasies and getting all the hairy cock and ass they can get.",
  "models": [
    {
      "name": "Daymin Voss",
      "person_id": 50891
    },
    {
      "name": "Fernando Del Rio",
      "person_id": 50890
    },
    {
      "name": "Michael Roman",
      "person_id": 50777
    }
  ],
  "release_date": "2018-01-03",
  "scene_id": 129228,
  "series": "Beards, Bulges & Ballsacks!",
  "tags": [
    "Anal Sex",
    "Bodybuilder",
    "Ebony",
    "Foreskin",
    "Group Sex",
    "Hairy",
    "Interracial",
    "Jockstrap",
    "Latino",
    "Nipple Play"
  ],
  "title": "Beards, Bulges & Ballsacks!"
}