{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Now that Grayson Lange and his brother's friend, Johnny Hill, have hooked up, Johnny is back for more. This time Grayson is the hesitant one, as Johnny tries to initiate with him while he sits in the living room. Grayson is nervous because his step-brother, Chad Piper, is in the next room, but Johnny assures him Chad wouldn't care. In fact, Johnny thinks Chad might be into it. Grayson is skeptical so Johnny tells him to ask Chad himself, as Grayson turns and finds his step-brother standing there, cock in hand, ready for action. Grayson laughs and then shrugs, thinking why not. He quickly bends over and begins to suck Chad off, while Johnny tongues his hole and shoves a finger deep inside. Grayson shows his pure cock lust as he lets both Johnny and Chad face fuck him at the same time. Chad never knew that his brother was such a cock pig, but now that he realizes it, he decides to take full advantage, bending Grayson over and plunging his meaty cock bareback into Grayson's waiting hole. He pounds Grayson doggy style before giving Johnny a turn. Johnny mounts Grayson onto his cock, fucking him from beneath while Grayson bounces on his hard dick. After taking both of them separately, Grayson is still not satisfied, so he tells them both to fuck him at the same time. Johnny isn't even sure it's possible, but sure enough, he watches Grayson mount Chad's pole before sliding his in too. They double penetrate his hole as Grayson smiles and takes it willingly. Johnny feels his cock up against Chad's and the sensation causes him to pull out and blow his load. Chad follows suit, standing up and blasting Grayson's face with his jizz, as Grayson strokes himself off and lauches all over himself.",
  "models": [
    {
      "name": "Grayson Lange",
      "person_id": 47158
    },
    {
      "name": "Johnny Hill",
      "person_id": 49385
    },
    {
      "name": "Chad Piper",
      "person_id": 49592
    }
  ],
  "release_date": "2018-01-05",
  "scene_id": 129683,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Athletic",
    "Bareback",
    "Big Loads",
    "Cum swallow",
    "Deep throat",
    "Double Anal",
    "Double Penetration",
    "Facial",
    "Oral",
    "Threesome",
    "Twink"
  ],
  "title": "Don't Tell My Brother Part 2 - He Already Knows"
}