{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Tristan has been waiting for his groceries to arrive for quite some time now. He ordered them online and the delivery boy is really late. Tristan had time to shower and now he's in his towel checking his phone for the tracking number. He finally here's the delivery boy at the door and he heads over to answer it. Tristan invites Leo inside his home so he can check the bag to make sure all the food is in it. Tristan notices that he is missing his bananas and Leo becomes embarrassed but just before he heads to get them from his car Tristan drops his towel and reveals his huge big uncut cock. Leo drops to his knees once he sees the beauty of Tristan's thick dick. He grabs it with both hands feeling the girth and slowly puts every inch into his eager mouth moistening it with his tongue. He tries to take it all the way down but he can't so he strokes it and licks the shaft and at times still trying to deep throat it. Tristan loves the feel of a young man's mouth so eager to blow him. He moves Tristan up on to the counter and bends him over to reveal his sweet tender pink hole. He gets it nice and wet by spitting on it and tongue fucking it. Leo moans with excitement as this older man pleases his hole with his eager mouth. Tristan can hear all the moans with Leo and now his ass is dripping with spit. Tristan spreads Leo's tight hole and slowly pushes his thick long uncut cock into him. It's a tight fit but he squeezes right in as Leo gasps for air and relaxes his hole for Tristan. Leo has always wanted a Daddy type older man to fuck him and now today is his lucky day. Tristan treats his young hole with the utmost care fucking him deep and hard loosening it up as he becomes more comfortable with such a big cock buried balls deep. Tristan man handles Leo and moves him on to the chars on his back and continues to fuck him until Leo cums all over his smooth young chest. Tristan can't resist his build up any longer and he has Leo get down on his knees as Tristan unleashes his big load all over his face covering every inch of it. They embrace with a final cum filled kiss before he sends Leo on his way. Enjoy!",
  "models": [
    {
      "name": "Tristan Jaxx",
      "person_id": 28051
    },
    {
      "name": "Leo Luckett",
      "person_id": 50488
    }
  ],
  "release_date": "2017-12-25",
  "scene_id": 129713,
  "series": "DL - 59 - Tristan Jaxx & Leo Luckett",
  "tags": [],
  "title": "Home Delivery"
}