{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Scott Finn shows up at his older brother's apartment, he's greeted by his brother's roommates, Donte Thick and boyfriend Chad Piper. The two of them quickly realize that Scott is the spitting (or maybe the swallowing) image of his brother, so the guys can't help but wonder if he's as kinky and cock hungry as his brother, too. Scott quickly reveals that he is, and Donte gets a look in his eye that Chad understands all too well. In no time, the three of them are engaged on the bed, each sucking the other off in a dick sucking triangle of lust. Donte gets Scott nice and hard and then bends his little ass over, plunging his raw cock deep inside his roomie's brother. Scott takes the dick willingly, and Donte fucks him hard from behind while he chokes on Chad's thick pipe. Having had his fill, they switch, and dirty Donte positions himself in the middle as boyfriend Chad gives him his meat, pounding him while Scott gags him on the other end with his rock hard cock. Scott's about to burst, so they switch one last time, and Scott begins to plow Donte. He shows he's just as good at giving as he is receiving, pulling out and blasting Donte's bubble butt with his nut, coating Donte with a huge load. Chad follows suit, giving Donte a nice facial as Donte licks up every drop. Turning over onto his back, Donte jacks his load all over himself as Chad and Scott look on, and with Donte now thoroughly covered in cum, Chad, and Donte realize that good fucking runs in Scott's family. Enjoy!",
  "models": [
    {
      "name": "Chad Piper",
      "person_id": 49592
    },
    {
      "name": "Donte Thick",
      "person_id": 51050
    },
    {
      "name": "Scott Finn",
      "person_id": 50329
    }
  ],
  "release_date": "2018-01-20",
  "scene_id": 129855,
  "series": "NDR -130 - Donte Thick, Chad Piper & Scott Finn",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Facial Hair",
    "Family Roleplay",
    "Gay Porn",
    "Jerking off",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "We Fucked Your Brother"
}