{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When intern Chris Blades returns the reports he'd assigned him, Johnny Hill recognizes he has a real go getter on his team. Johnny commends him and Chris tells him it wasn't hard, asking Johnny if he's got anything else that needs his attention. Johnny tells him he does, but that this assignment is much, much harder. Chris smiles at the implication and moments later he's underneath Johnny's desk as the big boss man fills is hole with raw cock. Johnny pounds Chris under his desk and the two of them are really going at it when fellow employee Mark Long bursts into Johnny's office unannounced. Mark surveys the situation and quickly puts two and two together. He tells Johnny that he's gonna need quite the promotion to keep this a secret. Johnny agrees and Mark tells him there's one other thing he wants, looking down at Chris' pretty mouth.  Moments later, Chris has a face full of Mark's thick cock as Johnny continues to pound him from behind. The two of them take their turns trading in and out of Chris' hole, fucking him from behind before letting him mount Johnny's dick and take a ride. Johnny fucks the cum out of Chris as he pulls out and unleashes his own load, leaving just Mark, who immediately plunges his cock into Chris, fucking him from behind before pulling out and blasting his hole with one last load of jizz. Chris has surely earned his pay today, but tomorrow is a whole 'nother day.Enjoy!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Chris Blades",
      "person_id": 48683
    },
    {
      "name": "Johnny Hill",
      "person_id": 49385
    }
  ],
  "release_date": "2018-01-24",
  "scene_id": 130010,
  "series": "NDR -132 - Johnny Hill, Mark Long & Chris Blades",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "All Under the Table"
}