{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With boyfriend Dante not around, Chris Blades approaches new roomie Derek Wolf with a proposition to help him groom his hairy ass. Derek thinks it's kind of a weird request, but he obliges nonetheless. However, when he sees Chris getting hard as he shaves, Derek realizes the whole thing is just a set up, and that Derek's new roomie cock is what Chris is really after. To his credit, Derek has to admit that Chris knows what he's doing when it comes to handling a cock, and as Chris sucks Derek off, the two of them don't even notice Dante making his way through the door. Dante laughs and asks Derek if it's any good. Derek nods that Chris is great at sucking dick, and Dante decides to join them. Immediately, Derek bends Chris over and plows his raw cock deep inside Chris' waiting hole. He fucks Chris from behind while Dante watches, then the guys switch up, with Dante taking a turn at Chris' hole, and then giving up the ass himself to Derek. He rides Derek's cock before flipping over onto his back and letting Chris have the last laugh, as Derek loses his nut all over Dante's face while Chris fucks the cum out of Dante, following suit when he pulls out and jizzes all over Dante's messy stomach. As the three of them lay in a cuddle puddle, they realize this new roommate situation is gonna work out just fine. Enjoy!",
  "models": [
    {
      "name": "Chris Blades",
      "person_id": 48683
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Derek Wulf",
      "person_id": 51185
    }
  ],
  "release_date": "2018-02-03",
  "scene_id": 130180,
  "series": "NDR - 135 - Dante Martin, Derek Wolf & Chris Blades",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Beefy",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "Muscular",
    "Smooth",
    "Threesome"
  ],
  "title": "Grooming Roommates"
}