{
  "collections": [
    "Active Duty"
  ],
  "description": "Princeton calls the shots and he wraps his mouth around Ryan's hard shaft right after the introduction. Ryan kicks back and takes pleasure in his first blow job from a man. Princeton gives him the special treatment taking care of every inch on that throbbing shaft. He even lets the new recruit fuck his face giving him the illusion that he's calling shots. Ryan wants a taste of some hard dick and Princeton kicks back and let him go at it. Ryan slowly wraps his virgin mouth around Princeton's hard dick and begins to please his throbbing shaft. Princeton man handles Ryan and puts him in position so he can grab his ass while being blown. Princeton lays Ryan on the edge of the bed and spreads his legs wide as his hole gets stretched for the first time. Princeton tells him to breathe and let his hole open and soon enough it does which makes Princeton fuck him harder and deeper. The sweet moans from Ryan will make your cock twitch as he enjoys a dick inside of himself for the first time. Once Princeton has had his fill he bends his ass over the bed and lets Ryan shove his hard dick into him. Princeton loves to bottom and he lets Ryan fuck him hard and deep doing whatever he pleases with his tight hole. Princeton becomes louder and louder as Ryan is lost in the moment deep inside his first man. Finally Ryan pulls his cock out and shoots his creamy thick load all over Princeton covering his whole chest. Princeton strokes his nut with some of Ryan's cum and soon enough he blasts his own load all over the place.<br></br> Enjoy!",
  "models": [
    {
      "name": "Princeton Price",
      "person_id": 46796
    },
    {
      "name": "Ryan V",
      "person_id": 51163
    }
  ],
  "release_date": "2018-02-18",
  "scene_id": 130387,
  "series": "AD - 278 - Ryan V & Princeton Price",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Duo",
    "Gay",
    "Smooth",
    "Tattoos"
  ],
  "title": "Ryan V & Princeton Price"
}