{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Princeton Price wakes up and takes his morning piss, roomie Quentin Gainz is already in the shower. Princeton can't help but notice Quentin's ripped abs and tight body as he washes off, but as Quentin turns and sees Princeton looking on, they share an awkward glance that sends Princeton scrambling. Quentin finishes his shower and finds Princeton sitting on the bed wallowing in his embarrassment. Quentin quickly remedies that when he drops his towel and reveals his rock hard dick. With it sitting right there in his face, Princeton realizes he has free license to do whatever he wants, so he smiles and immediately begins to suck Quentin off, playing with the tip and working his tongue up and down the shaft. Quentin pushes him back onto the bed and the two of them service each other in a 69, with Quentin deep throating Princeton as Princeton eats his ass. WIth Quentin's hole nice and moist, he mounts Princeton's raw cock, riding him reverse as he jerks himself off. Princeton watches Quentin's perfect ass bouncing up and down on his cock, and the reality exceeds even his wildest fantasies, but Quentin has one more wrinkle up his sleeve.  Standing up, he turns the tables on Princeton, now working his cock into Princeton's hole and fucking him good like that until Princeton is ready to lose his load. Quentin fucks the cum out of Quentin and then pulls out to blast him, coating his hole with man juice and smiling at the thought of this new roomie discovery. Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    },
    {
      "name": "Princeton Price",
      "person_id": 51204
    }
  ],
  "release_date": "2018-02-14",
  "scene_id": 130335,
  "series": "NDR -138 - Quentin Gainz & Princeton Price",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Facial Hair",
    "Gay Porn",
    "Jerking off",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Rooming For Fun"
}