{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Archer Hart really needs this part, and casting director Mark Long is confident he's got the goods to deliver the performance Mark is looking for, but Archer seems nervous and in need of just loosening up. Mark enlists his assistant Jason Richards to look in on the audition, and Jason agrees with Mark that Archer really just needs to relax a little. Archer asks them if they can help him relax, and Mark smiles at Jason. Moments later, Archer finds himself kneeling on the floor with a cock in each hand, as he alternates between the two. Mark's giant cock is more than he can swallow but Archer proves his determination choking it down. Jason's long dick hits Archer in the back of his throat as Archer shows his ability to multi-task, but Mark wants to see Archer loosen up even more, so he plunges his rock hard cock raw into Archer's hole, fucking him from behind as Archer continues to suck Jason off.  <br> </br>They switch it up, and Jason takes his turn with Archer, giving him every inch of his bareback cock while Archer just eats up all the attention. Showing he can take direction, Archer alternates riding both of them, and finally, with all of them ready to cum, Archer sucks off Mark while Jason fucks him doggy style. Mark jizzes in Archer's face as Jason soaks his back, and Archer flips over and strokes himself off, launching his load all over his stomach. Cum covered and out of breath, Mark tells him he's earned the part, and Archer realizes he really did have it in him the whole time.<br> </br>Enjoy!",
  "models": [
    {
      "name": "Archer Hart",
      "person_id": 37489
    },
    {
      "name": "Jason Richards",
      "person_id": 51122
    },
    {
      "name": "Mark Long",
      "person_id": 18862
    }
  ],
  "release_date": "2018-02-16",
  "scene_id": 130333,
  "series": "NDO - 4848 - Mark Long, Jason Richards & Archer Hart",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Loose Up Audition"
}