{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With all the hot water in the house sitting in Sean Maygers bathtub, there's not much left over for Gunner to shower with. He quickly goes through what little Sean has left him, and freezing cold, decides to hop in the tub with Sean to warm up. Sean is a little uncomfortable with the arrangement and decides to get out, but Gunner's already got his sights on Sean's major laser. They play grab ass all the way to the bedroom and Sean realizes how Gunner gets down, so he quickly hops on board,  letting his cock slide all the way down Gunner's throat as he fingers Gunner's hole. Gunner feels tight to the touch, but that's nothing compared to when Sean tries to work his cock inside. He slowly inches it all the way in, as Gunner grips the bedsheet and takes it all in. Sean pounds Gunner from behind slowly but firmly, his hard on growing by the second inside Gunner's sweet ass. Gunner's cock gets hard as Sean continues to pound, and Sean tells him he'd like to switch, flipping Gunner over and mounting him. He rides Gunner's bareback dick like a pro as Gunner strokes him off. Sean spreads his legs and thrusts Gunner deeper and deeper inside of him, his rock hard cock about to blow. Before he does, he takes one last turn at Gunner's ass, pounding him missionary as Gunner spits his load all over himself. Sean pulls out and blasts Gunner before rubbing the head of his cock in the puddle of jizz, slipping it back inside Gunner and continuing to go at it for round 2. Looks like our shower boy got exactly what he was gunning for.",
  "models": [
    {
      "name": "Gunner",
      "person_id": 50330
    },
    {
      "name": "Sean Maygers",
      "person_id": 51212
    }
  ],
  "release_date": "2018-02-17",
  "scene_id": 130349,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Bareback",
    "Big Dick",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Deep In Hot Water"
}