{
  "collections": [
    "Active Duty"
  ],
  "description": "Quentin and Spencer introduce themselves and right after Quentin asks Spencer how his first man on man experience was with Ryan. Spencer tells us that he had an amazing time and didn't know it would be some much fun and pleasurable. Today Spencer will once again break some barriers that he didn't do last time which is kissing and sucking on some cock. Quentin warms up Spencer with some slow kissing which begins to turn him on. Quentin can see his cock twitch and so he wraps his mouth around Spencer's sexy hard cock and deep throats every inch of it. You can see the huge vein that runs down the middle of Spencer's fat dick and Quentin gets that dick nice and wet. Spencer is timid at first but soon enough he is trying to deep throat that dick. Spencer wants to make sure he's doing it right so when he comes up for air he makes sure to get Quentin's approval. Quentin loves to eat ass and Spencer has a beautiful bubble butt. He lays him out on the bed and pops that ass up and buries his face deep between those soft smooth cheeks. Spencer can't believe how great Quentin's tongue feels licking his tight hole. Spencer pushes slowly into Quentin and soon enough is balls deep and pounding away on our vet. Quentin loves the way this rookie is fucking him and he has Spencer fuck him all over the bedroom. Spencer is really beginning to love the feel of a tight ass and Quentin's ass is top of the line. Spencer fucks Quentin until he pulls his throbbing cock out and nuts all over Quentin covering him full of cum. Quentin than strokes his nut out all over himself.<br></br>Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Spencer Laval",
      "person_id": 50897
    }
  ],
  "release_date": "2018-03-25",
  "scene_id": 130659,
  "series": "AD - 288 - Spencer Laval & Quentin Gainz",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Kissing",
    "Muscular",
    "Rim",
    "Rimming",
    "Tattoos"
  ],
  "title": "Spencer Laval & Quentin Gainz"
}