{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With his step-brother, Leo Luckett, in a tough jam, Ty Thomas tries to help him come up with a way to find a place to stay. Ty tells Leo about an incident that took place when he was in college and ran up his credit card bills, relating a story about a guy who helped Ty out in exchange for a little personal attention. Leo seems slow to make the connection Ty is hinting at, so Ty just comes out with it, telling Leo he can stay with Ty if he sucks Ty's dick. Leo wonders if Ty is serious, but glancing over at the bulge in Ty's jeans gives him a definitive answer. He realizes he's caught between a rock and a hard-on, and opts for the lesser of two evils, falling to his knees as Ty whips out his cock. Ty has clearly been waiting for this for some time, as Leo can barely fit the girth of Ty's rock hard cock in his mouth. It chokes Leo as he tries to deep throat it, but he sucks Ty off with vim and vigor, working Ty's balls with his tongue as he inches up and down the shaft. Ty flips him over and returns the favor, downing Leo's dick before flipping his step-brother over and eating his ass. He tongues Leo's fresh hole, stroking himself all the while. Now that Leo's hole is primed and moist for the intrusion, he mounts his step-brother's raw cock, mounting Ty and riding him reverse cowboy as Ty bounces his perfect ass up and down. Ty has been waiting for this his whole life, and now that he has the opportunity, he seizes it completely, flipping Leo onto his hands and knees and plowing him from behind, fucking Leo bareback doggy style before flipping him onto his back and fucking the jizz out of him. Leo's load flings all over Ty's couch as Ty pulls out and blasts his step-brother with a brotherly load of spunk, and as Ty shoves his cock back inside Leo's cum-dripping hole, Leo realizes there will be at least one extra fringe benefit to his new living situation.Enjoy!",
  "models": [
    {
      "name": "Ty Thomas",
      "person_id": 47912
    },
    {
      "name": "Leo Luckett",
      "person_id": 50197
    }
  ],
  "release_date": "2018-02-23",
  "scene_id": 130640,
  "series": "NDO - 4850 - Ty Thomas & Leo Luckett",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Generous Tips"
}