{
  "collections": [
    "Next Door Raw"
  ],
  "description": "For Elye Black, casual internet hookups are a regular thing, just one way he gets his regular rocks off. But for closeted Gunner, secret meets with strangers is the only way he feels comfortable expressing his true desire. By day, he has to play the straight soldier with a girlfriend, but every now and again he lets himself indulge in in what he really wants, and today is Elye's lucky day.  He can't wait to get inside Gunner's perfect ass, and even though Gunner seems nervous, Elye knows that soon enough he'll forget all about his reservations. He has his way with Gunner, fingering his hole as he tongues it, before plunging his thick cock deep inside. He slowly works his giant dick in and out of Gunner's raw hole, before picking up the pace and pounding him as Gunner strokes his dick and watches Elye go in and out. Gunner is rock hard as Elye continues to fuck him. They flip over and Gunner rides Elye's meaty prick, leaning back as Elye fucks him and jerks him off at the same time. Once Gunner has had his fill, he flips onto his back and tells Elye to fuck the cum out of him. Elye obliges and begins to pound as Gunner strokes himself off, losing his load in a messy explosion as Elye pulls out and coats his hole with his own load. He plays with the the cum with the tip of his dick before shoving it back inside of Gunner, leaning down to kiss him before sending off this soldier back into duty.Enjoy!",
  "models": [
    {
      "name": "Elye Black",
      "person_id": 51047
    },
    {
      "name": "Gunner",
      "person_id": 50330
    }
  ],
  "release_date": "2018-02-24",
  "scene_id": 130604,
  "series": "NDR - 141 - Elye Black & Gunner",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Climax",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "GAY4DICK"
}