{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Connor Halsted finds himself on the wrong end of yet another break up, he decides to take a friend's advice and seek some counseling. Donte Thick isn't your typical therapist, preferring a more hands on approach with his clients, and when he meets Connor, he realizes this will be one of his most enjoyable cases yet. It seems Connor simply suffers from a lack of confidence, and Donte is sure he can show Connor all the ways to indulge in his carnal desires, as he takes control of Connor, kissing him hard and working his way down to his pants. He unzips Connor's fly and pulls out his dick, sucking him off sloppily as Connor's hard on stiffens in his mouth. Bending Connor over, Donte works his fingers inside Connor's hole, and quickly realizes his past boyfriends haven't been taking advantage of what Connor has to offer. To prove it, he shoves his giant cock inside Connor, quickly living up to his namesake as he fills Connor's raw hole with his thick meat. He pounds Connor on the sofa from behind until he's had his fill, then they move to the bedroom. Once there, Donte arches onto his shoulders with his legs in the air, telling Connor to pile drive him while he sucks his own dick. Connor can't believe anything is even possible but sure enough, as he plunges his bareback cock inside Donte's waiting hole, he curls up and begins to give himself head. Connor is so turned on he's not even sure who he is anymore, as he fucks Donte with reckless abandon, moving him up onto the bed and fucking the cum out of his therapist before pulling out and exploding all over him with a cathartic nut. As he looks down at Donte covered in cum, he feels he can look ahead to a more adventurous sex life. Donte is having the same vision.Enjoy!",
  "models": [
    {
      "name": "Connor Halsted",
      "person_id": 49822
    },
    {
      "name": "Donte Thick",
      "person_id": 51050
    }
  ],
  "release_date": "2018-02-28",
  "scene_id": 130662,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Rimming"
  ],
  "title": "Sex Therapy in the Raw"
}