{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Princeton Price thought he and roomie Ryan Jordan had an understanding to include each other in their sexual desires, but when Princeton stumbles upon Ryan in the bathroom using a Flashjack, he questions his roommate's loyalty to the plan. To his credit, Ryan didn't mean to exclude Princeton from the fun, he just thought his roomie was busy, but he's more than willing to let Princeton give him a hand now that he's here. Princeton wants to give Ryan more than a hand, so after jacking Ryan off for a second, he falls to his knees and gives Ryan a little oral pleasure, sucking him off as Ryan closes his eyes. Ryan gets rock hard and has to admit Princeton is way better than a sex toy. After returning the favor, he asks Princeton to eat his ass, and Princeton obliges, rimming his roomie's tight hole and getting it nice and ready. Once it is nice and moist, Princeton plunges his rock hard dick into Ryan's waiting hole, fucking him raw from behind as Ryan watches it all in the mirror's reflection. Princeton fucks Ryan hard against the vanity before laying him out on an ottoman and continuing the fuck fest. He pounds Ryan missionary before changing things up, mounting Ryan's dick and letting him have a go at it. Ryan fucks Princeton's bareback hole as Princeton strokes himself off, spitting his load onto Ryan's chest as Ryan pulls out and blasts his hole from underneath. With both of them covered in jizz, they decide on two things. One, to take a shower and get cleaned up, and two, to include each other the next time either one of them wants to get down and dirty. Enjoy!",
  "models": [
    {
      "name": "Princeton Price",
      "person_id": 51204
    },
    {
      "name": "Ryan Jordan",
      "person_id": 51208
    }
  ],
  "release_date": "2018-03-24",
  "scene_id": 130704,
  "series": "NDR -149 - Ryan Jordan & Princeton Price",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Facial Hair",
    "Gay Porn",
    "Jerking off",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Raw Is Best"
}