{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When handyman Jason Richards interrupts what he thinks is a scuffle between his employer and some random dude, the last thought on his mind is that he's cock blocking Chris Blades, but Chris quickly tells him the guy he was 'wrestling' with was a hook up, not a friend. Jason is confused, and Chris explains that he has a daughter with his ex but that he likes men, and that his ex prefers if he keeps his sexual life private so their daughter won't find out. Chris tells Jason that it's really hard to find a steady partner in a town this small. Smiling, Jason tells him that's not the only thing in this town that's hard, and he motions to his waist as Chris eyes the bulge in his pants. Unzipping his pants, he puts his cock in Chris' hands and tells him to have his way with it. Jason is hung, and Chris can't believe his luck, but he wastes no time indulging in the gift before him, taking it into his mouth as Jason puts his hand on the back of Chris' head and pushes him further down onto it. Jason face fucks Chris in his bedroom before throwing him up onto the bed and sliding his rock hard cock bareback into Chris' hole. He pounds Chris all over the bed, giving him the hard, raw dicking that he's been missing, and Jason can tell Chris is appreciative by the massive load he spits out. Seeing Chris lose his nut gets Jason all hot and bothered, and he follows suit, unleashing a massive load that covers Chris with jizz and leaves sated and sweaty. As he rubs the cum into his skin, Jason bends down and whispers that he's found his new man. Chris smiles at the thought of it. Enjoy!",
  "models": [
    {
      "name": "Chris Blades",
      "person_id": 48683
    },
    {
      "name": "Jason Richards",
      "person_id": 51122
    }
  ],
  "release_date": "2018-03-31",
  "scene_id": 131279,
  "series": "NDR151 - Jason Richards & Chris Blades",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Gay Porn",
    "Muscular",
    "Tattoo/Piercing"
  ],
  "title": "Big Things in Little Towns"
}