{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With only one big tv in the living room and two different shows, it sure seems like roomie's Derek Wulf and Jay Dymel are in need of a compromise. Derek isn't about to just let Jay take over the living room, but Jay is pretty intent on watching his program. Derek asks Jay what he's gonna do for him, and Jay hesitates, unsure if Derek is serious. Derek tells him it's been a while and asks him how he feels about servicing him in the meantime. Jay assumes Derek is full of shit, grabbing the remote from him as Derek pops up and wrestles with Jay to get it back. Jay plays keep away but Derek is more interested in something else, and when Jay looks up at him, Derek bends down and kisses him hard on the lips. Jay realizes Derek is serious about the whole blow job thing, and moments later both guys are half naked on the couch, Jay on his knees, with Derek's cock in his mouth. Derek gets rock hard as Jay deep throats him, bending him over the side of the couch and plunging his raw cock deep inside of Jay's waiting hole. Derek shows no mercy on his roommate, giving him a hard pounding from behind as he fucks Jay all over the couch in every position, finally fucking the cum out of his roomie as he pulls out and soaks him with his load. As Derek slowly works the tip back in, he tells Jay the tv is all his, but Jay seems to have found something better to pass the time. <br> </br>Enjoy!",
  "models": [
    {
      "name": "Derek Wulf",
      "person_id": 51185
    },
    {
      "name": "Jay Dymel",
      "person_id": 51409
    }
  ],
  "release_date": "2018-03-23",
  "scene_id": 131340,
  "series": "NDO - 4858 - Derek Wulf & Jay Dymel",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blonde",
    "Blowjob",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Remotely Turned On"
}