{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With the summer fast approaching, school buds Michael Del Ray and Luke Reed waste time at Luke's house and talk about their future. Both guys are considering different college paths, but the ultimate dream would be for both of them to head out to the islands to just surf the day away. Smiling at the thought, Michael tells Luke he actually has a pretty nasty injury from a run the other day and asks Luke for one of his famous massages. Luke agrees and begins to work on Michael's shoulder. As he leans back into it, Michael feels a protruding bulge in Luke's pants, and he laughs, asking Luke if he's hard. Luke is embarrassed and tries to play it off, but Michael is already reaching out to him and bringing his face in closer. They kiss on the sofa and quickly make their way to Luke's bedroom. Once there, Michael unleashes his giant cock as Luke takes it into his mouth hungrily. He gobbles up Michael's hard on and begs him to put it inside him. Michael obliges, piercing Luke's hole with his mammoth member, sliding it in and out of Luke's young hole. Picking up the pace, he begins to fuck Luke harder and harder, and Luke loves every minute of it. Michael flips Luke over onto his hands and knees and fucks Luke doggystyle as he gets close. With one last hard push, he's ready to nut, so he pulls out and blasts Luke's ass with his load, spraying his jizz all over Luke's back, then he flips Luke and begins to suck him off. Luke spits his nut all over Micheal's face, covering him with his load as the two of them laugh and agree this has to be part of the future plan.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Luke Reed",
      "person_id": 51438
    },
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    }
  ],
  "release_date": "2018-03-30",
  "scene_id": 131341,
  "series": "NDO - 4860 - Michael Del Ray & Luke Reed",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "More Than Friends"
}