{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With Valentine's Day fast approaching, Scott Finn wanted to get something special for secret boyfriend Michael Del Ray, so he brought a bouqet to his office. Michael appreciates the gesture, but since Scott is one of his students,  Michael feels a little awkward about the timing of it all. He tells Scott that they have to be careful about their relationship when they're at school, and Scott quickly shows the dejection on his face. Not wanting to disappoint Scott, Michael offers to give Scott a part of his Valentine's Day present now. Scott lights up, as Michael makes his way over to where Scott is sitting. Michael's personal attention is all that Scott really wants, and now he's got all of it, as Michael unzips his pants and unfurls his giant teacher dick. Scott takes it into his mouth and gives Michael some holiday head, making sure to gag on it nice and deep, just like Michael likes it. Michael is rock hard and ready to pound his beau, so he rocks Scott's legs high up in the air and begins to lick at his hole, tongue-fucking it and getting it nice and moist as Scott strokes his dick. Scott and Michael are both ready for what comes next, as Michael shoves his giant dick bareback into Scott's waiting hole. Michael proceeds to fuck Scott all over his office- on the chair, the desk etc- as Scott takes every inch willingly. Writhing in ecstacy, Scott can barely take it anymore, and as Michael pumps him full of hot hard dick, Scott is ready to lose is nut. He does so as Michael pulls out and jacks his load too, both of them cumming simultaneously all over Scott's quivering body. Cum drenched and exhausted, Scott smiles at Michael's present. It's just what he wanted. Enjoy!",
  "models": [
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    },
    {
      "name": "Scott Finn",
      "person_id": 50329
    }
  ],
  "release_date": "2018-03-17",
  "scene_id": 131314,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "College",
    "Deep throat",
    "Gay Porn",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Teacher's Pet"
}