{
  "collections": [
    "Next Door Taboo"
  ],
  "description": "With the last of his step-brother's stuff finally moved into his new place, Dalton Riley offers to help Elye Black unpack. Elye motions to a box, not realizing it's the box where he keeps a little purple dick shaped secret. When his brother finds the dildo in his belongings, Dalton questions Elye about its use, and Elye weakly tries to pass it off as an ex-girlfriend's, but Dalton knows all too well the Elye is harboring a secret lust for cock, and now that they are both away from the prodding eyes of their parents, Dalton makes it known to Elye that he's had his eye on him. Elye thinks it's weird at first, but Dalton quickly soothes his anxiety and tells him it's better with someone who knows him. Elye relents, and Dalton, with dildo in hand, tells him to lay back so that he can show him how to use this thing. Elye does as instructed and Dalton goes to work, first by sucking Elye off until he's nice and hard, and then plunging the purple dildo inside his step-brother's virgin hole. Elye whimpers a little as it goes in, and Dalton begins to stroke himself at the thought of piercing such a nice warm hole with his prick. Elye moans as Dalton works the dildo inside him, before standing and asking Elye if he wants the real thing. Elye begs for it, and Dalton slowly inches his raw cock deep inside Elye, finally working it all the way in to the base, and proceeding to fuck Elye thouroughly all over his new bed. Elye takes his first dick eagerly, his own dick rock hard as Dalton pounds him from behind, riding his brother's meat pole and stroking himself off. He loses his load onto his stomach but continues to grind and ride Dalton's cock until he's ready to pop. Dalton pulls out just in time to blast Elye's hole with his jizz, shoving his cock back inside and slowly continuing as Elye breathes heavily, happy that his secret is finally out.",
  "models": [
    {
      "name": "Dalton Riley",
      "person_id": 48651
    },
    {
      "name": "Elye Black",
      "person_id": 51047
    }
  ],
  "release_date": "2018-04-05",
  "scene_id": 131386,
  "series": "NDB - 4861 - Dalton Riley & Elye Black",
  "tags": [],
  "title": "Making Moves"
}