{
  "collections": [
    "Next Door Originals"
  ],
  "description": "After having lunch with a friend, Jackson Traynor watches him leave from the window. Roomie Ryan Jordan catches him and asks him if he has a crush, and Jackson sheepishly admits that he does. Ryan asks Jackson if he wants to fuck their friend, and Jackson is forced to admit this, too. Ryan asks Jackson if he'd like to fuck him, and Jackson doesn't answer. Ryan takes his silence as a yes and pulls him closer, and Jackson does not resist. They kiss for the first time since moving in together and Jackson reaches down to rub the bulge in Ryan's jeans. It grows hard inside Jackson's hand and he quickly unzips Ryan's pants, taking them down to reveal Ryan's giant hard on. Jackson smiles before taking it into his mouth, and he feasts on Ryan's mammoth sized dick, already fantasizing about being fucked by such a cock. Ryan throws him onto the bed and sucks him off, stroking himself in the process. He spits on Jackson's hole and then swabs the head of his cock with it, then begins to slide it into Jackson's hole. Jackson tells him to go slow and Ryan obliges, working it in gently. Jackson's never taken a cock so big, but once it's in, he can't get enough, and Ryan picks up the pace, spreading his legs holding them as he pounds into Jackson with passion before flipping him over onto his knees. He grabs Jackson's waist and fucks him from behind, getting his fill as Jackson strokes his cock. Ryan tells Jackson he wants him to fuck him and so Jackson flips over onto his back. Ryan mounts him, spreading his legs wide and stroking his cock as Jackson fucks him from beneath. He spits his load all over Jackson's chest and tells him he wants him to cum. Jackson pulls out and soaks Ryan's hole with his nut, making a mess of it as he slides his dick back inside for round 2.Enjoy!",
  "models": [
    {
      "name": "Jackson Traynor",
      "person_id": 49107
    },
    {
      "name": "Ryan Jordan",
      "person_id": 51208
    }
  ],
  "release_date": "2018-04-13",
  "scene_id": 131491,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Hot Enough to Fuck"
}