{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Walking through the parking garage on the way up to his apartment, Dante Martin thinks he sees what appears to be a man struggling in his car, perhaps having some kind of medical issue. As he approaches the car, it turns out that the guy inside is merely jacking himself off, but he stops suddenly when he turns and sees Dante. Dante frantically panics and runs off up to his building. The man exits his car and follows just a few moments behind. When Dante makes it to his apartment he thinks he's in the clear but a quick knock on the door lets him know he'll have to confront this. When he opens the door, David Strong apologizes and explains that his place is overcrowded and he never has any private time. Dante tells him it's no big deal and apologizes for intruding on him. Then, with his nerve steadied, Dante suggests that maybe David would like to come inside. David jumps at the chance and quickly he and Dante make their way back to the bedroom. Once there, Dante showers David with attention, undressing him and laying his sculpted body down on the bed. Dante then proceeds to give David the best head he's had in quite some time. David, already horny as hell, returns the favor before flipping Dante over. With Dante's hole staring up at him, David dives face first, tongue fucking him and getting him nice and moist for David's cock. He stands and plunges it deep into Dante's waiting hole, fucking him hard from behind as he grabs Dante by the waist. Dante grabs the bedspread and holds on as David picks up his pace, fucking rapidly as Dante backs his ass up against David's cock.David has his fill then gives Dante a chance to get his, laying down as Dante shoves his hard dick inside. Dante would've never figured that David liked to take it raw, but David eats it up, moaning in pleasure as Dante works and grinds on his hole. David strokes his cock like he was in his car as Dante fills him up with hot dick, and even though he's close, he wants one more crack at Dante's crack before he spits his load, so he stands Dante up and fucks him against the wall, perching Dante's ass high and giving him a few good thrusts before pulling out and blasting Dante's back with his warm jizz. He rubs his cock against Dante's ass as Dante strokes himself dry, spitting his load onto the floor as David pulls him in close. Dante tells him now he's at least got one place to fuck.Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "David Strong",
      "person_id": 51458
    }
  ],
  "release_date": "2018-04-07",
  "scene_id": 131461,
  "series": "NDR - 153 - Dante Martin & David Strong",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Muscular",
    "Oral",
    "Rimming",
    "Smooth"
  ],
  "title": "Places to Fuck"
}