{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "It's Spencer Laval's big day and best bud Jeremy Spreadums has been waiting for this his whole life. After throwing him a party, Jeremy has one last birthday surprise for Spencer, now that everyone has gone home. With the place to themselves and Spencer in a festive mood, Jeremy makes his move to give Spencer his present. Spencer is unsure at first, but Jeremy assures him he'll enjoy every minute of it, unzipping Spencer's pants and working the tip of his dick with his tongue. Spencer gets hard inside Jeremy's mouth, and instantly relaxes, deciding to just go with it. Once he senses Spencer's comfort, Jeremy gets to work, sucking the shaft and working the balls as Spencer closes his eyes and moans with pleasure. After returning the favor, Spencer strokes his dick as Jeremy sits down on it, slowly inching Spencer's bareback cock into his hole, then giving his best buddy the ride of his life. Jeremy grinds his ass on Spencer's dick, slamming up and down on it harder and harder before Spencer throws him face first onto the sofa and proceeds to pound him from behind. Jeremy takes the thrusting like a champ as Spencer continues to pound away, flipping Jeremy over and continuing to go at it. Jeremy strokes his dick as Spencer gets closer to losing his nut. He fucks Jeremy harder and harder and Jeremy spits his load all over his stomach as Spencer pulls out and blasts him with his birthday batch. Smiling, he tells Spencer he wouldn't mind if this became an annual tradition.Enjoy!",
  "models": [
    {
      "name": "Jeremy Spreadums",
      "person_id": 49349
    },
    {
      "name": "Spencer Laval",
      "person_id": 51479
    }
  ],
  "release_date": "2018-04-12",
  "scene_id": 131490,
  "series": "NDB - 4863 - Spencer Laval & Jeremy Spreadums",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Hardcore",
    "Interracial",
    "Latino",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Bangin' Birthday Buddies"
}