{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Quentin Gainz is in need of a little rest and relaxation after a little motorcycle accident has roughed him up a bit. Add to that the fact that he's knee deep in his studies and there's just no chance that he can join roomie Carter Woods out for a night on the town. Visibly swamped and in a little pain, Quentin tells him he'd like to go but just can't. Carter understands, and quickly moves to see if he can help take care of his buddy in another way. Quentin smiles slyly and Carter quickly understands how he can 'help', so he unzips his pants and Quentin takes a deep dive face first, taking Carter's dick deep into his mouth, all the way down his throat. Carter gets rock hard, noting how much better Quentin can suck a dick than his own girlfriend. He backs Quentin onto the bed and returns the favor, sucking his roomie off and getting him nice and hard while he fingers Quentin's hole with his spit. Once Quentin is nice and moist, Carter works his bareback cock into Quentin, sliding it deep into his hole and having his way with him, pounding him from behind before letting Quentin get on top. Quentin grinds on, stroking his cock as Carter gets closer to cumming. He flips Quentin over and blasts his hole with his load as Quentin strokes himself dry. As the lay there, cum covered and sweaty, Carter tells Quentin he's probably a lot better at riding cocks than he is motorcycles, and Quentin has to agree.  Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    },
    {
      "name": "Carter Woods",
      "person_id": 51510
    }
  ],
  "release_date": "2018-04-19",
  "scene_id": 131777,
  "series": "NDB - 4865 - Quentin Gainz & Carter Woods",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming"
  ],
  "title": "Perfect Score"
}