{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With his latest fuckbuddy set to come over later, Mark Long asks step-brother Roman Todd if he's interested in a little tag team action. Roman is always down but he asks Mark if his dude will be into it. Mark tells Roman to just wait until they start and then to join in, and that they'll figure out the logistics later. So when Roman hears the sounds of pounding ass going on upstairs, he takes that as his cue and creeps up the stairway. As he gets to the top, he sees Mark banging Ty Thomas from behind, with Ty's head buried in a cushion. Mark motions for Roman to come over and undress, and once he does, Mark silently directs him to switch places with him. Mark pulls out and Roman shoves his cock in, and Ty is none the wiser as both brothers take turns having their way with him. Mark watches Roman get all up in Ty's ass and decides to nudge up behind Roman, slipping his cock inside Roman's raw hole as Roman continues to fuck Ty. Soon enough, Ty discovers whose cock is pounding him, and though he's intially stunned and upset, he quickly agrees that whoever has been fucking him has been doing it right. So the three of them move over to the sofa where both brothers take a turn riding Ty's cock. Mark barely gets Ty's cock inside of him when Ty has to spit his load, so Mark decides to mount Roman, but Roman can't hold his nut either, losing it all over himself. Mark feels left out so both Ty and Roman sit him down on the couch and suck him off together. He's saved the best load for last, as he spits his massive batch all over himself, and the three of them fall back onto the couch together.Enjoy!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Roman Todd",
      "person_id": 46827
    },
    {
      "name": "Ty Thomas",
      "person_id": 47912
    }
  ],
  "release_date": "2018-04-14",
  "scene_id": 131778,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass to mouth",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Brothers Share"
}