{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Thanks to a hotel area and a sudden lack of available rooms in the area, tour bros Johnny Hill and Jacob Peterson have no other choice but to share a single bed. Neither one of them is particularly keen on the idea, but as they crash out, all seems well enough, until Johnny starts fingering Jacob's ass in his dreams. He sleepily tells Jacob to suck him off, so Jacob thinks about it for a second and decides to do it. Johnny instantly becomes hard in his mouth, but when he comes to, he wonders why Jacob is sucking his dick. Embarrassed, both guys turn away from each other as Johnny, now fully awake, actually considers what it would be like to fuck his bro. His dick gets hard just thinking about it, so he turns and initiates with Jacob again. Jacob is tentative but eager at the same time, and eventually he resumes sucking Johnny off. It turns out to be the best decision Johnny ever made, as he instantly realizes his friend can suck a mean dick. After returning the favor, he fingers Jacob's ass again with designs to fuck it raw. Jacob is game, and so Johnny enters from behind, slowly inching his rock hard cock bareback into Jacob's waiting hole. Jacob takes it with ease, and Johnny wonders how much secret dick his friend has been getting on the side, but nonetheless, he proceeds to pound Jacob all over the bed, fucking him doggy before letting Jacob take a ride on the Johnny Hill Express. Jacob strokes himself while he grinds his ass against Johnny, taking his cock deep inside him. He's ready to lose his load, so he tells Johnny to flip him onto his back and fuck him hard. Johnny does as he's told and Jacob spits a nice batch all over his stomach as Johnny pulls out and blasts his hole with a mammoth load. They smile and kiss, knowing it's gonna be one hell of a vacation from here on out.  Enjoy!",
  "models": [
    {
      "name": "Johnny Hill",
      "person_id": 49385
    },
    {
      "name": "Jacob Peterson",
      "person_id": 50893
    }
  ],
  "release_date": "2018-04-18",
  "scene_id": 131717,
  "series": "NDR -156 - Johnny Hill & Jacob Peterson",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Climax",
    "Facial Hair",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Bed Sharers"
}