{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With the pain of a recent break up still fresh in his mind, Colton Cain seeks solace from his buddy Dominic Green. He's not really looking to talk, and tells Dominic he just wants to do something to take his mind off the split. Dominic has a pretty good idea of what they can do together, and when he makes his move, a love torn Colton offers little resistance, so Dominic quickly seizes the opportunity to indulge in a fantasy he never thought would come to life. He goes down on Colton, who he's always had a crush on. As he undresses Colton, it becomes obvious why. Colton's body is chiseled and his muscles glimmer in the bedroom light, and when Dominic pulls off his jeans and starts sucking him off, Colton gets rock hard inside his mouth. Dominic works Colton's balls, tonguing at them before deep throating the shaft. Colton is rock hard and ready to fuck, so he bends Dominic over and begins to face fuck his hole, getting it nice and wet before plunging his meat stick deep inside his best friend. Dominic takes it raw as Colton pounds him from behind, and they fuck all over the bed as Dominic takes a ride before letting Colton have his way. Colton flips him onto his back and begins to fuck the pain away, taking all his frustrations out on Dominic's hole, before pulling out and blasting it with a massive load that coats Dominic. Dominic strokes himself off as Colton slides his messy cock back inside, launching his batch onto his stomach in a sweaty conclusion. As he slides his dick around in the cum, Colton realizes he's forgotten all about his ex.Enjoy!",
  "models": [
    {
      "name": "Dominic Green",
      "person_id": 50688
    },
    {
      "name": "Colton Cain",
      "person_id": 51355
    }
  ],
  "release_date": "2018-04-21",
  "scene_id": 131784,
  "series": "NDR -157 - Colton Cain & Dominic Green",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Forgetting Her"
}