{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With his frat bro still passed on the couch from the night before, Donte Thick decides a little hazing is in order. Ty Thomas is cloudy from the night before, but when he finally comes to, he wonders what the hell Donte is doing. Donte tells Ty he's been making bad decisions for a good 12 hour block, and shows Ty the pictures to prove it. Ty, immediately embarrassed, implores Donte to erase the embarrassing pictures, and Donte, like a good frat bro, is more than willing to protect his brother's reputation... provided, of course, that Ty does something for him. Ty instantly realizes he's caught between a rock and Donte's hard place, ultimately deciding that servicing one frat brother is better than explaining himself to all of them, so he relents, and Donte, with hunger in his eyes, sets to having his way with Ty's body. First he face fucks his frat bro, and when he's had his fill, he turns Ty around and proceeds to fuck Ty in every way he can imagine. Ty certainly seems like taking a dick is nothing new, as his rock hard dick bounces up and slaps his stomach with Donte's every thrust. Donte decides he'd like to take Ty's dick for a test drive, so he climbs and mounts Ty, grinding on his dick as Ty holds on for dear life. Once Donte has had his fill, he instructs Ty to lay back, and as he pumps him full of cock one last time, Ty begins to stroke himself off. Donte fucks the cum out of Ty who sprays his load all over his chest, and seeing this, Donte's cock swells up and he's ready to bust, so he pulls out and absolutely soaks his frat brother's hole with his batch. Ty is coated in cum, much like the night before, and Donte wonders why he even bothers trying to pretend he doesn't love this lifestyle. Enjoy!",
  "models": [
    {
      "name": "Ty Thomas",
      "person_id": 47912
    },
    {
      "name": "Donte Thick",
      "person_id": 51050
    }
  ],
  "release_date": "2018-05-02",
  "scene_id": 131966,
  "series": "NDR - 160 - Donte Thick & Ty Thomas",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Caucasian",
    "Deep throat",
    "Gay Porn",
    "Jerking off",
    "Kissing",
    "Oral",
    "Rimming"
  ],
  "title": "After Party"
}