{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As repairman Mark Long searches for a part to fix Jay Dymel's jacuzzi, he gets an eyefull of something else entirely. Jay's ready and waiting to get into the tub and when his towel slips off his ass, leaving him exposed, Mark tells him he likes what he sees. Jay asks if he's being serious and Mark nods, so Jay asks if he'd like to spend a little time together. Walking towards Mark, he already has his answer as Mark reaches out and grabs him, pulling him closer as they kiss. Mark throws Jay down onto the bed and proceeds to have his way with him, shoving his cock into Jay's mouth as Jay sucks him off. Mark is rock hard and ready to go, bending Jay over and pounding him from behind on the bed. Jay takes Mark's long dick in and out as he backs his ass up against it, reaching back and spreading his cheeks so Mark can watch his long snake moan in and out of Jay's hole. Jay likes taking Mark's dick but he'd like to have a crack at Mark's ass, so he has Mark mount him. Mark does so, mounting him reverse, he begins to bounce up and down on Jay's dick. Jay runs his hand up Mark's back and back down to his waist as he gets closer and closer to losing his nut. He wants Mark to fuck the cum out of him so they switch and Mark fucks Jay missionary. Jay is close but Mark is ready to bust so he pulls out and blasts Jay's hole with his jet stream, coating Jay in the process, before shoving his cock back inside. Mark's throbbing, messy cock triggers Jay and his cock swells up, ready to burst. He loses his nut all over himself as Mark continues to pound away, and all of a sudden, a quick dip in the jacuzzi seems quite necessary for both of them.Enjoy!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Jay Dymel",
      "person_id": 51409
    }
  ],
  "release_date": "2018-04-27",
  "scene_id": 131967,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Exposed Company"
}