{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Realizing buddy Elye Black has gone missing from the pool party for a little too long, Chris Blades decides to investigate and see what Elye is doing. When he approaches Elye's door, he can see through the crack that Elye is jacking off watching some gay porn. Chris had no idea his friend was into that, but as he watches Elye stroke himself on the bed, Chris can't help but get chubby in his pants, and as he watches from the door, he begins to play with himself, imagining Elye's dick working in and out of him. Chris decides to act on his fantasy, creeping up behind Elye and grabbing his cock, stroking it for him. Elye is shocked at first but quickly relents and lets Chris do what he wants, so Chris indulges his desires and downs Elye's cock in one big gulp, taking him all the way to the base and choking on his hard dick. He asks Elye if he's ever messed around with a guy before and Elye tells no. Knowing he'll be Elye's first, Chris slides his cock deep inside Elye, stuffing him from behind as Elye eases onto the dick and begins to ride him. He bounces his perfect little bubble butt up and down on Chris' bareback cock, spreading his cheeks so Chris can watch his dick slide in and out of Elye's tight virgin hole. The fuck like that until Chris has had his fill, and then he tells Elye to do the same to him. Elye jumps at the chance and quickly rolls Chris over, shoving his massive cock inside Chris' waiting hole. He fucks Chris missionary style, spreading his legs wide and pounding his ass as Chris strokes himself off. Elye fucks the cum out of Chris and then pulls out and blasts his hole with his first gay load, emptying himself all over Chris' freshly fucked ass. As they exhale, they realize that now they've both been gone for quite some time. Hopefully, no one is suspicious!",
  "models": [
    {
      "name": "Chris Blades",
      "person_id": 48683
    },
    {
      "name": "Elye Black",
      "person_id": 51047
    }
  ],
  "release_date": "2018-04-26",
  "scene_id": 131921,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Oral",
    "Twink"
  ],
  "title": "Experimental Buddies"
}