{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Tegan Zayne finds himself home alone and decides to hit the sex club. He's barely gets in the door when he runs into Woody Fox standing by the lockers with his uncut dick in his hand. The two exchange glances and soon Tegan is on his knees servicing the hung stud's big cock and balls. As Tegan continues sucking on Woody's dick, they can hear another couple having sex nearby. They decide to explore the club and come across Teddy Torres getting railed by Riley Mitchell. Woody and Tegan find a spot near the new couple and as Riley pounds away on Teddy's ass, Woody gets behind Tegan to fuck him deep. Teddy and Riley don't wait for an invitation to join the fun and soon Riley and Teddy have their dicks down Tegan's throat as Woody continues to fuck him. Tegan loves being the hole to be used by every other dick in the room as the guys all take turns on his face and asshole, pounding away to get their own satisfaction. All the hot action surrounding him makes Woody the first to blow. He dumps his load all over Tegan's face and as Riley laps it up; he's the next to go. Watching Tegan get his face doused in cum is all it takes for Teddy to let loose. He covers Tegan's hairy patch of pubes with creamy white ropes before Tegan is the last to blow. Tegan is left as a sloppy, sticky mess covered in the loads of four extra-hung studs.",
  "models": [
    {
      "name": "Beaux Banks",
      "person_id": 50362
    },
    {
      "name": "Riley Mitchel",
      "person_id": 51578
    },
    {
      "name": "Teddy Torres",
      "person_id": 49190
    },
    {
      "name": "Tegan Zayne",
      "person_id": 46884
    },
    {
      "name": "Woody Fox",
      "person_id": 26552
    }
  ],
  "release_date": "2018-05-04",
  "scene_id": 132064,
  "series": "Three Wishes",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "butt play",
    "butts",
    "cum shots",
    "rimming"
  ],
  "title": "Three Wishes, Scene #04"
}