{
  "collections": [
    "Next Door Raw"
  ],
  "description": "After knicking the back while trying to give himself a haircut, Princeton Price asks roomie Alex Grand to do some damage control, but instead, he catches Alex checking him out in the mirror. Princeton asks him if he's gawking and Alex denies it, but Princeton persists and Alex tells him he's at least thought about it. Princeton admits he's thought about it too, and suddenly, Princeton's hair is the furthest thing from both of their minds. Instead, Alex leads Princeton back to his room, deciding to let his hair down and follow his desires. They kiss hard and Princeton pushes Alex back onto the bed, falling to his knees as he begins to suck Alex off. Alex gets hard as Princeton proves he has indeed been thinking about this, and he unleashes his inhibitions as Alex pushes his head further down onto his hard on. After returning the favor, both guys are hard and ready for what comes next. Alex positions himself behind Princeton and slides his bareback cock deep inside Princeton's hole, working him slowly at first, then picking up the pace and beginning to fuck him harder. Princeton moans loudly as Alexs fucks him all over the bed, sliding behind him and pounding him from the side as Princeton strokes his cock. Princeton is ready to shoot as Alex pulls out and blasts his hole with his load, and as he does, Princeton simultaneously loses his load all over himself. Covered in cum, it looks like both guys are headed back to the restroom to clean up another mess.Enjoy!",
  "models": [
    {
      "name": "Alex Grand",
      "person_id": 51034
    },
    {
      "name": "Princeton Price",
      "person_id": 51204
    }
  ],
  "release_date": "2018-05-05",
  "scene_id": 132067,
  "series": "NDR - 161 - Alex Grand & Princeton Price",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Grooming Buddy"
}