{
  "collections": [
    "Next Door Originals"
  ],
  "description": "When Leo Luckett finds buddy Quentin Gainz in the kitchen, he asks why Quentin's been ignoring him. Quentin plays it off that he's been busy cooking for his girlfriend, forgetting that Leo can see the empty box in the trash. Leo gives Quentin a playful look and tells him that there's plenty of time to cook up something for real. Quentin smiles as Leo leads him back to the bedroom.  Once there, Leo undresses Quentin and feasts on his body, sucking him off as Quentin stands above him. Leo reclines on the bed as Quentin fucks his mouth, then pushing him back against the pillows, he works his way down Leo's body, downing his cock and sucking his balls, all the while readying himself for the main course. He stands and teases Leo's hole with the head of his dick, then slowly inches it deep inside. Leo moans as Quentin grabs him by the waist and fucks him from behind. Sweating, Quentin cedes control to Leo, letting him take a ride while Quentin rests for the final push. Leo spreads his legs and bounces on Quentin's cock, grinding it to his satisfaction, and when he's ready to cum, he arches back and perches his legs wide, telling Quentin to fuck the cum out of him. Quentin grabs his calves and begins to pound away as Leo loses his nut all over himself. Quentin keeps pounding and Leo tells him he wants his nut. Quentin pulls out and empties his load, using the tip of his dick to slide it around Leo's winking hole, just as the timer goes off in the kitchen. Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    },
    {
      "name": "Leo Luckett",
      "person_id": 50197
    }
  ],
  "release_date": "2018-05-18",
  "scene_id": 132176,
  "series": "NDO - 4874 - Quentin Gainz & Leo Luckett",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blonde",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Raw Concocktion"
}