{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As he starts his morning, Spencer Laval discovers that his hard on is already up and in need of attention. Spencer dutifully begins to rub one out, not knowing that curious roomie Scott Finn is peeking through the door and watching. Scott asks Spencer what he's doing, and Spencer tries to play it off. Scott persists, and Spencer asks him what he wants. Scott tells him he doesn't want anything, but there is something he needs, motioning towards Spencer's hard cock. Spencer smiles as Scott asks him if he'd like a hand, dropping to his knees. Before he can answer, Scott's mouth is wrapped around Spencer's cock, so he decides to just go along and let Scott have his fill. Scott and Spencer have messed around once before, and Scott has been dreaming of doing it again ever since then. No that he has his opportunity, he plans to seize the moment, so he strips out of his clothes and tells Spencer to pound him. Spencer obliges, sliding his warm cock deep inside Scott's naked hole. He grabs Scott's hands and pulls them back behind him, holding onto Scott as he plows him from behind. Scott moans loudly as Spencer fucks him hard, then they shift from doggystyle to missionary as Spencer continues the hard dicking, eventually sliding up next to Scott as he fucks him sideways from behind. Spencer's morning nut is ready to burst, so he pulls out and hoses Scott down with his load as Scott jerks himself off. Scott spits up his nut as Spencer shoves his cock back inside Scott's messy hole as the two of them agree they'll 'never' do this again.Enjoy!",
  "models": [
    {
      "name": "Scott Finn",
      "person_id": 50329
    },
    {
      "name": "Spencer Laval",
      "person_id": 51479
    }
  ],
  "release_date": "2018-05-17",
  "scene_id": 132103,
  "series": "NDB - 4873 - Spencer Laval & Scott Finn",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Helping Hands"
}