{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As he talks relentless shit online, Elye Black never seriously considers that authorities might be closing in on him, but when he is surprised by agents inside his home, he realizes his threats online will have real consequences. As far as agents Markie More and Nicholas Ryder are concerned, Elye is small time, and hardly worth the paperwork. But he is pretty cute, and judging by the porn they found on his laptop, he's also into some pretty kinky shit. Agent More asks Elye if he'll do what's necessary to make this all go away, and Elye seems to be game, even as both agents cuff him and unzip their pants. Whipping out their dicks, Elye suddenly realizes what he's gonna have to a lot of blowing before this all blows over, so he gets to work, downing Markie's cock as Nicholas strokes his in anticipation. They take turns face fucking him and then throw him down on the sofa. Each agent has their turn at Elye's hole, fucking him raw dog as Elye services the other with his mouth. Having each had his fill of Elye's hole, Markie tells him he wants Elye to fuck him. Nicholas smiles and says he wants to see this, as Elye plunges his bareback cock deep into Agent More's waiting hole. He fucks him hard from behind as Nicholas strokes himself, spitting his load onto his stomach as he watches Markie take the dick. Elye sees Nicholas' load and it takes him over the edge as he seeds Markie's hole right then and there. Markie flips over and strokes himself off as both guys watch, and when it's all over, Elye is not sure he's really learned any sort of lesson. If this is how the bad guys get treated, he may very well decide on a future life of crime.",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Elye Black",
      "person_id": 51047
    },
    {
      "name": "Nicholas Ryder",
      "person_id": 51623
    }
  ],
  "release_date": "2018-05-10",
  "scene_id": 132212,
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Muscles",
    "Climax",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "SWAT Bottom"
}