{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With roomie Mark Long taking a shower, Donte Thick decides now is the perfect time to make his move. Stealing his towel, Donte creeps around the corner and waits, as Mark comes out of the shower, bewildered, but naked and dripping wet. Donte confesses that he stole Mark's towel but tells him he had a reason. Mark asks him what is the reason is as he dries his face. Donte falls to his knees and quickly deep throats Mark's giant cock. Mark's eyes widen as he says 'Oh,' and Donte takes this as confirmation to keep going. He sucks Mark off until he's nice and hard, then is surprised when Mark throws him back up onto the bed and returns the favor. It seems Mark's been harboring the same urges for Donte, and as he plunges his rock hard cock deep into Donte's raw hole, he fulfill's a fantasy for both of them. He fucks Donte hard from behind, grabbing him by the waist and pulling him in closer as he thrusts his meaty cock deeper and deeper inside. Donte takes every push willingly, begging Mark to keep it up, but before Mark delivers on that promise, he wants to feel Donte inside of him, so he rolls Donte over and mounts him, sliding onto Donte's dick and riding it reverse as Donte watches Mark's ass bouncing up and down. Donte gives Mark a nice ride as Mark strokes himself off, and once he's had his fill, the dismounts and spreads Donte's legs wide open, slipping his dick inside and proceeds to pound Donte until he's ready to spit. He pulls out and coats the hole with his jizz as Donte strokes himself dry, shooting his load straight up and landing all over his stomach.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Donte Thick",
      "person_id": 51050
    },
    {
      "name": "Mark Long",
      "person_id": 18862
    }
  ],
  "release_date": "2018-05-16",
  "scene_id": 132282,
  "series": "NDR -164 - Mark Long & Donte Thick",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Shower Games"
}