{
  "collections": [
    "Active Duty"
  ],
  "description": "Quentin loves to start off sucking some new fresh recruit cock and he does just that. He wraps his eager mouth around Elye Black's very impressive hard cock and gives him a BJ to remember. Elye tests out Quentin's wet mouth by fucking deep into it to see how much he can take. All the spit and slobber comes dripping out of Quentin's mouth making Elye's throbbing cock get even harder. Elye couldn't believe how great his cock was sucked and now he wraps his wet young mouth around our elite's hard dick. He gets it nice and wet as he strokes that hard cock. Elye loves smooth balls and can't stop sucking on Quentin's. Elye uses every inch of that dick to satisfy his new recruit mouth. Quentin lays back and lets Elye slowly push his aching dick into his hole and once he gets in the feeling is almost over whelming as he begins to thrust deep into Quentin. The tightness and moans coming from Quentin show that this rookie just might have what it takes. We didn't think Elye was ready to take a cock deep in his ass but once again he surprised us and he lets Quentin open up his fresh soldier hole. The tightness almost makes Quentin nut right off the bat but soon enough he's deep in Elye fucking him nice and steady. Elye loves it so much that he begins to back up into Quentin's hard cock. The amazing conclusion arrives with Quentin fucking Elye on his back while stroking his dick until he blasts a nice load on to himself. Quentin is still stroking his cock and once he sees that cum he shoots his load all over Elye's nut. Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Elye Black",
      "person_id": 49220
    }
  ],
  "release_date": "2018-05-20",
  "scene_id": 132415,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Smooth",
    "Tattoos"
  ],
  "title": "Quentin Gainz & Elye Black"
}