{
  "collections": [
    "Active Duty"
  ],
  "description": "Owen is taking it to the next level and Spencer is the lucky man that gets to dive deep into his ass but first Owen needs to suck on that big dick of Spencer's. Owen wastes no time in getting his mouth full with hard throbbing dick. He takes every inch down his eager throat sucking it with such a great fluid motion. Spencer loves Owens oral skills as he looks down and sees Owen's smooth body and amazing bubble butt. That ass almost made Spencer cum in Owen's mouth so before they start some fucking Spencer gets his mouth wrapped around Owen's stiff cock. Spencer grabs with it a hand and begins to use his succulent young lips sucking and stroking. The boy's appetites are full and now Spencer bends Owens big smooth ass over the bed and slowly pushes his thick throbbing cock deep into Owen's tight hole. Owen moans with pleasure as Spencer thrusts deep into him making his balls slap. Spencer flips Owens eager ass over and lifts his legs up so he can slowly push into his sexy ass. Owen looks into his eyes and Spencer pushes deep into him thrusting every inch of his big dick into that ass. Owen continues to enjoy the pounding he is receiving from his battle mate. His balls are building up as he strokes his cock while Spencer's dick is deep inside his smooth hole. Owen can feel Spencer's cock swell up just as he pulls his dick out and strokes his warm jizz out onto Owens smooth inked up chest. Owen loves all that thick cum and strokes his dick until his balls are emptied out and his chest is covered in cum. Enjoy!",
  "models": [
    {
      "name": "Owen Steal",
      "person_id": 51523
    },
    {
      "name": "Spencer Laval",
      "person_id": 50897
    }
  ],
  "release_date": "2018-05-27",
  "scene_id": 132552,
  "series": "AD - 306 - Spencer Laval & Owen Steal",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Tattoos"
  ],
  "title": "Spencer Laval & Owen Steal"
}