{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Finding himself locked out of his car yet again, Lance Ford really doesn't know what to do. Luckily, Princeton Price just happens to be wandering by, and offers Lance some help. Making their way up to Princton's place, Princeton confesses that he can't find the shimmy he thought he had to unlock his car, but he tells Lance he's welcome to wait here while he figures out what to do. Lance wonders what the two of them could do in the meantime, but Princeton seems to be one step ahead of them, as he embraces Lance and pulls him in closer. Lance quickly catches on to Princeton's plan, and when Princeton pulls off his shirt to reveal his sculpted body and rock hard cock, Lance realizes that maybe his misfortune is actually a blessing in disguise. As Princeton fills his hole with his hard cock, Lance affirms his new position, and gives Princeton the fuck of his life, riding him while he strokes himself off. Princeton fucks Lance hard all over his sofa, in every position he desires before finally flipping Lance over onto his back and spreading his legs wide, fucking him as hard as he can before pulling out to blast Lance's hole with his load. Lance takes Princeton's nut as he strokes himself dry, launching a massive load all over his stomach. As the two of them clean up, Princeton tells him they can figure out Lance's car situation together, but Lance is content to let it sit a little longer.Enjoy!",
  "models": [
    {
      "name": "Lance Ford",
      "person_id": 47871
    },
    {
      "name": "Princeton Price",
      "person_id": 51204
    }
  ],
  "release_date": "2018-05-30",
  "scene_id": 132570,
  "series": "NDR - 168 - Princeton Price & Lance Ford",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Locked & Cocked"
}