{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Fresh from his test at the academy, Dalton Riley surprises boyfriend Michael Del Ray with the good news that he's passed. Seeing Dalton's badge, Michael tells him it's time for some celebrating, but when Dalton shows him his county issued handcuffs, Michael realizes their play is about to get a little more kinky than normal. Smiling, he tells Dalton how excited he is, and when Dalton chains him to the headboard and begins to go down on him, Michael realizes just how exciting it is to give up control. Dalton sucks him off until he's nice and hard, and then they switch, as Michael cuffs Dalton to the bed and tongue fucks his ass from behind, stroking his cock in anticipation. Once he's good to go, Michael stands up and plunges his massive cock deep inside Dalton's raw hole, having his way with Dalton, who has no choice but to close his eyes and enjoy every deep thrust Michael gives him. Having had his fill, Michael unchains Dalton and mounts him, slipping Dalton's dick deep inside and giving him a nice ride. Dalton fucks Michael hard and nasty, which is just how Michael likes it. He gets turned on as Dalton abuses his hole, finally flipping over onto his back as Dalton continues to plow away. Dalton fucks the cum out of Michael who then turns the tables, setting Dalton onto his back to suck him off. He deep throats Dalton's cock as it spits its load all over Michael's face, covering him in jizz as the two of them fall back onto the bed exhausted from their morning celebration. Looks like Dalton's new career is going to pay dividends at home, too.Enjoy!",
  "models": [
    {
      "name": "Michael Del Ray",
      "person_id": 47349
    },
    {
      "name": "Dalton Riley",
      "person_id": 48651
    }
  ],
  "release_date": "2018-06-06",
  "scene_id": 132572,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass to mouth",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Cumswapping",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Police Perks"
}