{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Markie More waits at the station, he can feel eyes watching him, and when he turns and finds that they belong to a handsome stranger beckoning him to follow, Markie decides to abandon his train schedule and follow the stranger whereever he leads. David Strong hurries to his room, leaving the door ajar for Markie to enter. When he does, they are both nervous, and David tells Markie he isn't sure what he's doing. Markie tells him he's never done this before either, before lunging towards David and kissing him hard, pushing him back onto the bed. Markie works his way up and down David's sculpted body before flipping Markie over and undressing him. He takes Markie's hard dick into his mouth and all his inhibitions disappear. He works the tip of Markie's cock with his lips then tongues his way down the shaft as Markie grips the back of his head and pushes him further down to the base. Markie flips David over and shows him how it's done, gagging on David's dick in one gulp and choking on it over and over again. David gets rock hard so Markie bends over and lets him slide it in. He takes David's bareback cock as the stranger pounds him from behind, and once David has had his fill, he pulls out and tells Markie to lay down. Markie does so and David climbs on top, shoving Markie's cock into his hole. He leans back and spreads his legs as Markie fucks him and jacks him off at the same time, then bends forward and grabs the headboard as Markie fucks him even harder. Markie is close to cumming, so he throws David onto his back and proceeds to fuck him raw until he's ready to shoot, pulling out and covering David's hole with his load as David jacks himself off, spitting his load onto his chest. As Markie bends down to kiss him, David tells him he's missed his train, but he can stay the night if he wants. Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "David Strong",
      "person_id": 51458
    }
  ],
  "release_date": "2018-06-07",
  "scene_id": 132678,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "Huge Dick",
    "Interracial",
    "Muscular",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Running a Train"
}