{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Connor Halsted gives Spencer Laval a foot rub, both of them begin to entertain similar thoughts. Spencer wonders if Connor's talents for touch apply to other parts of the body, and Connor wonders if it's true what they say about guys with big feet. If Spencer's half as big as Connor imagines, it will be worth the effort of making a pass. He reaches the bulge in Spencer's pants and rubs his package gently. Spencer doesn't jump back, which tells Connor everything he needs to know to go further. He tells Spencer to let him focus on the area that has the most tension, and Spencer decides Connor knows what he's doing, so he consents. Connor immediately shows Spencer what a wise choice it was, as he kisses his way down to Spencer's dick, pulling it out and downing it in one swallow. Spencer has never had his whole cock swallowed by any woman, much less had them go at it with the intensity that Connor sucks his cock. He gags on it like he needs it badly, so Spencer tells him to climb on top and give it a spin. Connor inches himself down on Spencer's massive hard dick, finally making his way down to the base, before Spencer grabs him by the waist and begins to fuck him harder. Pounding his hole repeatedly, Spencer watches Connor's ass bounce on his cock up and down, before deciding to flip him over onto his knees. Spencer bends him over and fucks his face into the side of the sofa, long dicking him from behind as Connor moans and begs for more. He's ready to cum, so he flips over onto his back and tells Spencer to fuck him harder, as he strokes his nut all over his stomach. Spencer sees him cum and leans into him ever faster, pulling out and hovering over Connor's face. He unloads a giant, sloppy facial that Connor happily swallows. Big feet, big dick, big load.Enjoy!",
  "models": [
    {
      "name": "Connor Halsted",
      "person_id": 49822
    },
    {
      "name": "Spencer Laval",
      "person_id": 51479
    }
  ],
  "release_date": "2018-06-09",
  "scene_id": 132680,
  "series": "NDR - 171 - Spencer Laval & Connor Halstead",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Kissing",
    "Oral",
    "Smooth"
  ],
  "title": "Big Feet"
}