{
  "collections": [
    "Next Door Raw"
  ],
  "description": "The progress Blaze Austin has made with trainer Charlie Pattinson has Charlie admitting a bittersweet truth to himself. On the down side, he realizes Blaze doesn't really need him as a trainer much longer. On the plus side, Charlie finally feels free to pursue Blaze in a way that isn't so professional. He tells Blaze the news and Blaze agrees that they should stop training and start fucking... immediately. Charlie smiles, eager to taste the fruit of his and Blaze's hard work in the gym. He pulls off his shorts as Blaze takes him into his mouth, promptly swallowing Charlie's cock whole, feeling him get hard between his lips as he plays with Charlie's balls. Charlie returns the favor, showing Blaze his technique as he works the tip before making his way down the shaft, playing with his hole before bending him over the sofa arm and sliding his raw cock deep inside. Blaze looks over his shoulder as Charlie works it back and forth, every thrust deeper than the last. He kisses Charlie before sitting him back and mounting him. Charlie grips his ass with both hands and bounces him on his cock. Blaze spreads his legs and Charlie begins to stroke him off. They are both at the edge, and ready to unload, so they flip over and Charlie gives it to him hard one last time before he pulls out. He sprays his load as Blaze shoots his onto his stomach, and just like that, their torrid affair is consummated in jizz.",
  "models": [
    {
      "name": "Blaze Austin",
      "person_id": 51761
    },
    {
      "name": "Charlie Pattinson",
      "person_id": 50959
    }
  ],
  "release_date": "2018-06-13",
  "scene_id": 132790,
  "series": "NDR - 172 - Charlie Pattinson & Blaze Austin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "Kissing",
    "Muscular",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Cocks & Crunches"
}