{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Leo has been sneaking into his neighbors backyard, Dolf Dietrich, and he doesn't like it one bit. Leo Luckett has been told multiple times not to jump the fence and kick it in his pool. Leo is back at it and is enjoying a hot spring day in the pool but what he doesn't know is that Dolf is hiding behind a wall in the backyard spying on him. Dolf has always wanted to get in this young bucks pants and today he has the leverage. Dolf continues to spy on Leo while rubbing his dick through his pants. Leo is clueless to the fact he is being spied on and he now makes his way to the lounge chair to catch some sun while he dries off. Dolf makes his way to Leo and catches him off guard. Leo is frightened and not sure what to do but talk back to Dolf. Dolf tells the young buck that if he lets him fuck him than he can use his pool any time he wants. Leo agrees instantly and Leo wraps his young mouth around Dolf's big fat cock. Leo doesn't mind sucking on this hard cock since he will be able to swim all summer long. Dolf face fucks him deep and hard until the young man can't take it no longer and then Dolf starts to service Leo's young eager cock. Once Leo's cock has been sucked on for some time Dolf turns him over to reveal his smooth tight hole and he starts to tongue fuck him making his ass nice and lubed up for his dick. Dolf pushes his huge hard dick into Leo's tight young ass making him squirm. Dolf fucks Leo hard and deep making sure this young guy feels his hole stretch nice and wide. Leo can barely take it and soon Dolf flips him on his back and pulls his cock out and blast a hot load all over the young man. Leo sees all the jizz and strokes his dick until he shoots his load all over himself. Enjoy!",
  "models": [
    {
      "name": "Dolf Dietrich",
      "person_id": 38159
    },
    {
      "name": "Leo Luckett",
      "person_id": 50488
    }
  ],
  "release_date": "2018-05-28",
  "scene_id": 132793,
  "series": "DL - 70 - Dolf Dietrich & Leo Luckett",
  "tags": [],
  "title": "Unwanted Pool Guest"
}