{
  "collections": [
    "Next Door Originals"
  ],
  "description": "When Carter Woods sits Nathan Styles on the couch, Nathan suspects some sort of sleight of hand is in the works, but to Carter, the only trick is Nathan, and he has every intention of getting what he wants. Whipping off Nathan's pants, Carter exposes Nathan's cock and begins to work his way down. Nathan is surprised at Carter's forward assertiveness, but does nothing to discourage Carter from his plans, so Carter has his way with Nathan, sucking him off as he runs his hands up Nathan's chest. Nathan gets rock hard as Carter looks up at him while downing his cock, and as he tongues Nathan's balls, Nathan reaches down and begins to stroke himself. With his dick hard enough to cut diamonds, Nathan is definitely down for whatever comes next, and after returning the favor to Carter, he grabs the stair case by the rail and perches his ass high in the air for Carter to abuse. Carter plunges his bareback cock deep inside Nathan, and proceeds to fuck his virgin hole as Nathan willingly takes the pounding. Carter fucks him hard against the rail as Nathan moans with pleasure, then the two of them make their way over to the sofa where Nathan mounts Carter's dick and takes a nice ride. Carter squeezes his ass as he bounces Nathan up and down on his cock. Nathan is ready to lose his load, so he Carter flips him onto his back and proceeds to fuck him harder than ever as Nathan strokes himself dry, launching his load all over his stomach as Carter pulls out and blasts him. Enjoy!",
  "models": [
    {
      "name": "Carter Woods",
      "person_id": 51510
    },
    {
      "name": "Nathan Styles",
      "person_id": 51783
    }
  ],
  "release_date": "2018-06-15",
  "scene_id": 132883,
  "series": "NDO - 4882 - Carter Woods & Nathan Styles",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "First Time Trick"
}