{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Blake Hunter showers himself off, he doesn't realize his front door has blown open from the wind. Nosy neighbor Julian Grey sees the open door and thinks something might be wrong, so he takes it upon himself to check on Blake. When he finds him naked in the shower, Blake is shocked and covers himself up, telling Julian that everything is fine. But as Julian moves closer and closer, Blake realizes Julian didn't just drop by to check up on him. Julian reaches out and kisses Blake, pulling him in closer, as Blake slips his hand inside Julian's waistline, running his fingers over the bulge in Julian's pants. They make their way to Blake's bedroom and Julian kisses his way down Blake's body, wrapping his lips around Blake's cock as he lay on his stomach and spreads his legs. Blake runs his fingers down Julian's crack as his dick gets hard inside Julian's mouth, and after returning the favor and getting Julian rock and hard, Julian tongues Blake's hole before standing up and sliding his dick deep inside his neighbor's hole. He fucks Blake raw from behind as Blake reaches back and strokes himself simultaneously. Blake decides one good turn deserves another, so once Blake tires a bit, they switch places and Blake positions himself behind Julian's perfect bubble butt. He's fantasized about fucking his neighbor so many times, and now that it's finally happening, Blake seizes the opportunity, pounding Julian all over the bed, until he's ready to burst. He pulls out just in time to coat Julian's cock with his load, which makes Julian lose his nut just as suddenly. Coated in jizz, Julian asks Blake if he'd like to head back to the shower.Enjoy!",
  "models": [
    {
      "name": "Julian Grey",
      "person_id": 49825
    },
    {
      "name": "Blake Hunter",
      "person_id": 50830
    }
  ],
  "release_date": "2018-06-20",
  "scene_id": 133083,
  "series": "NDR - 174 - Blake Hunter & Julian Grey",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Cum Showers"
}