{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "When Dax Carter checks on buddy Jackson Cooper, he finds him struggling to move his bed. Jackson's been upstairs all afternoon, and Dax is a little surprised to find that he hasn't made any progress. He asks Jackson if he wants some help and the two of them tag team the move, but as soon as they start, Jackson tweaks a muscle in his back. Ever the good friend, Dax tells him to take off his shirt and begins to rub Jackson's aching back. Jackson notices that Dax gets a little chubby in his pants and asks Dax if he wants to take off his shirt too. Dax does so, and Jackson runs his hands all over Dax' swole chest. The bulge in his shorts grows harder as Dax lays Jackson's half-naked body down on the bed, removing his shorts. Jackson doesn't stop him, so Dax proceeds to help himself to Jackson's cock, taking it in his mouth before downing it in one gulp. Jackson moans from the sensation as Dax gives him some sloppy good head, and when Dax asks him to return the favor, Jackson is more than willing. Once Dax is nice and hard inside Jackson's mouth, he tells Jackson to bend over and then slides his raw cock deep inside his roomie's hole. Jackson takes the pounding willingly, as Dax has his way with him. Dax enjoys fucking his roomie but wants to see if Jackson gives as good as he takes it, so they switch up and Jackson positions himself behind Dax, sliding up beside him as he enters from the rear. Dax spreads his legs wide as Jackson has his way with him, fucking him hard from behind until Dax is ready to nut. Dax is close, but Jackson is still a ways off, so he asks Dax to fuck him hard one more time. Dax stands and spreads Jackson's legs as wide as they'll go, then proceeds too long dick Jackson in missionary as Jackson strokes his rock hard cock. He spits his load all over himself as Dax pulls out and empties himself into Jackson's hole. Cum filled and tired from a day of heavy moving, Jackson asks Dax if he thinks the bed is fine where it is. Dax smiles and says it seems to be doing a good job.Enjoy!",
  "models": [
    {
      "name": "Dax Carter",
      "person_id": 51831
    },
    {
      "name": "Jackson Cooper",
      "person_id": 38267
    }
  ],
  "release_date": "2018-06-28",
  "scene_id": 133087,
  "series": "NDB - 4885 - Dax Carter & Jackson Cooper",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Masturbation",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Bed Buddies"
}