{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As he exits his ride, passenger Gunner is reminded by his driver, Princeton Price, that this isn't their first encounter. Princeton reminds Gunner that he gave him a ride just a few weeks ago to the club. Gunner vaguely remembers Princeton, but his interest piques when Princeton reveals that he also hangs out at the same gay bar. Suddenly, Gunner is intrigued by the prospect, and asks Princeton if this is some sort of missed connection thing. Princeton says he thinks it may be, and instantly, Gunner realizes this ride isn't over yet. Making their way up to Gunner's apartment, the two of them make out on the sofa before undressing. Gunner goes straight to work on Princeton's cock, taking it down his throat as he gags on Princeton's hard dick. Princeton returns the favor, all the while fantasizing about Gunner's sweet ass. Once Gunner is good and ready, Princeton flips him over and begins to eat his ass, quickly replacing his tongue with his cock as he stands and slides it into Gunner's tanned and toned ass. He slowly begins to work Gunner's ass raw from behind, picking up the pace as Gunner begins to stroke himself. Princeton fucks Gunner doggystyle as Gunner takes it willingly, then he sits on the couch and gives Gunner a different sort of ride. Gunner bounces on Princeton's cock and Princeton loves every second of it, but he's feeling a bit left out of the fuckfest, so he instructs Gunner to dismount and for them to switch. Gunner obliges as Princeton reclines onto his back. Gunner inches his bareback cock deep inside of Princeton, who spreads his legs and strokes himself as Gunner pounds away. Gunner barely gets his fuck on when Princeton is ready to lose his nut, so Gunner picks up the pace as Princeton spews his load all over himself. Gunner sees this and pulls out, blasting Princeton's hole with his nut before sliding it back inside for round 2. Enjoy!",
  "models": [
    {
      "name": "Gunner",
      "person_id": 50330
    },
    {
      "name": "Princeton Price",
      "person_id": 51204
    }
  ],
  "release_date": "2018-06-23",
  "scene_id": 133085,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "Muscular",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Strange Ride"
}