{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Kurtis Wolfe and Pheonix Fellington start getting dirty in the back seat of Austin Wolf's, 'Rideshare'. Kurtis goes down on Pheonix as Austin drives and watches them in the rear-view mirror. Pheonix wants to return the favor, and sucks Kurtis' thick hard-on. Austin wants in on the action and takes the guys to his garage where he unbuckles his belt and offers up his thick dick. That makes Pheonix hungry for more cock so he gets to work servicing both hung studs, alternating cocks down his throat. Kurtis is so turned on that he needs a dick in his ass. He bends over to let Austin penetrate him as he sucks on Pheonix' giant cock. After getting throbbing hard, it's time for Pheonix to have his turn using Kurtis' hole. He switches spots with Austin and takes his place behind Kurtis, stretching him like he's never been stretched before. Pheonix wants it all and soon he's riding Austin's big dick as Kurtis sits on the driver's face. The three studs switch it up one last time to give Kurtis some ass time as he slips inside Pheonix to pound his hole hard. Pheonix' tight ass works Kurtis to a frenzy and the hairy stud pulls out to shoot his load all over Pheonix' smooth back. When Pheonix feels the warm cum on his skin, he turns around and feeds Kurtis a load, who opens wide to catch it on his beard and tongue. When Austin sees all of the cum flying, he pumps the jizz from his dick as his hunky passengers lick his body and help him finish up.",
  "models": [
    {
      "name": "Austin Wolf",
      "person_id": 37736
    },
    {
      "name": "Pheonix Fellington",
      "person_id": 50363
    },
    {
      "name": "Kurtis Wolfe",
      "person_id": 50440
    }
  ],
  "release_date": "2018-07-20",
  "scene_id": 133293,
  "series": "Rideshare",
  "tags": [
    "Bodybuilder",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Oral",
    "Tattoos",
    "african american",
    "cum shots",
    "rimming"
  ],
  "title": "Rideshare, Scene #05"
}