{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With the sun already out and the waves waiting, Ricky Ridges tries to motivate Jackson Reed to wake up so they can hit the beach, but Jackson isn't quite ready to get out of bed. He begs for just a few more minutes, and Ricky decides a few more minutes in bed wouldn't be the worst way to start the day, so he straddles Jackson and bends down to kiss him. Feeling Ricky's morning wood brushing up against him is much more of the kind of wake up call Jackson was hoping for, so when Ricky begins to kiss down his body, Jackson springs alive, throwing Ricky onto his back and working his way down to Ricky's cock. Taking it into his mouth, he feels it waking up inside his mouth, as Ricky gets rock hard on the tip of Jackson's tongue. Once he's at full mast, he invites Jackson to ride a different kind of wave, as he bounces Jackson's bubble butt on his perfect dick, pounding Jackson from behind as he holds him by his hips. Jackson strokes his cock as he grinds up and down, and Ricky loves every second of it, but he's more the type to be in control, so he flips Jackson over and pushes his face into the covers as he slides his dick in from behind, proceeding to pound Jackson doggy style and then on his back in missionary as Jackson strokes himself clean, spitting his load as Ricky continues his thrusting. Ricky pounds Jackson for a moment or two longer, barely able to contain his eruption as he pulls out and shoots his wad all over Jackson's hole. As he lay there covered in morning jizz, Ricky tells Jackson to hurry up and shower so the two of them can hit the surf.Enjoy!",
  "models": [
    {
      "name": "Ricky Ridges",
      "person_id": 51645
    },
    {
      "name": "Jackson Reed",
      "person_id": 51877
    }
  ],
  "release_date": "2018-07-05",
  "scene_id": 133221,
  "series": "NDB - 4887 - Rickey Ridges & Jackson Reed",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Step Surfers"
}