{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Scott Finn's home life is pretty much a jail cell. Between overly strict parents and his lustful forbidden urges, young Scott is trapped in a routine that has him looking for answers, so when home owner Carter Woods finds Scott sneaking a smoke in his backyard, he doesn't run him off. Instead, he invites him in for a beer and a talk, and as they converse, Carter finds out Scott doesn't have a girlfriend and may not really want one. When Scott excuses himself to pee, Carter decides maybe all Scott needs is a little adult mentoring... someone to show him the ropes, so Carter follows Scott into the head. Once there, he can tell Scott is nervous, but when he sees what Scott is packing, he realizes it would be a waste to let such and opportunity pass him by, so he makes his move on Scott, telling him he'll make a man out of him in not time. Scott seems excited at the prospect, and as Carter boldly reaches down and begins to stroke Scott's dick, Scott's excitement becomes physical, and his rock hard cock tells Carter everything he needs to know about moving forward. Carter has his way with Scott, coaching him as he sucks his first dick, then showing him how it's done as he sits him down and returns the favor. Scott is already pushing past his limits when Carter bends him over and slides his raw cock deep inside Scott's virgin ass. He works it in slowly at first, gradually working him faster and faster, until he's pounding Scott all over the restroom. Moving to the bedroom, Carter lays Scott out on his back and proceeds to fuck the cum out of him. Scott lets his load fly as Carter keeps pounding away, and he pulls out just enough to blast Scott's fuckhole with his jizz, before shoving it back inside for another go round.Enjoy!",
  "models": [
    {
      "name": "Scott Finn",
      "person_id": 50329
    },
    {
      "name": "Carter Woods",
      "person_id": 51510
    }
  ],
  "release_date": "2018-06-29",
  "scene_id": 133219,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Hiding From The Parents"
}