{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Jason Richards wakes up to find Ty Thomas standing in his living room, his first thought is that Ty is there to rob him. Ty tells him that he came over to borrow some nails, and that he found the door open, but Jason is doubtful, and asks Ty to prove it. Ty can't prove his claims, and Jason asks him what he's willing to do to keep Jason from calling the cops. Ty wonders what he could possibly do to satisfy Jason, and his mind comes up blank, but Jason, already moving closer, has a pretty good idea. Face to face with Ty, his eyes communicate his intentions, and Ty, shady neighbor extrordinaire, rolls right with the punches, lowering himself down onto the couch to service Jason as he lay back down on the sofa. Ty takes Jason's long, thick cock into his mouth as Jason gets hard. Ty works his balls and Jason realizes this may have been the best possible surprise he could've asked for, and when Ty climbs aboard and begins to ride him, it's confirmed. Ty gives Jason a sweaty ride, working his cock from above as Jason gives him the full length of his business, Ty's dick bouncing on his chest throughout. They fuck all over the sofa until Ty ends up on his back with his dick rock hard and Jason pumping him full of hot, hard meat. Ty loses his load, shooting it all over himself as Jason continues to pound away. He pulls out and wets Ty down with his batch, coating Ty in an afternoon load satisfies Jason's curiosity enough to ask Ty if he still needs those nails. Ty smiles. Enjoy!",
  "models": [
    {
      "name": "Ty Thomas",
      "person_id": 47912
    },
    {
      "name": "Jason Richards",
      "person_id": 51122
    }
  ],
  "release_date": "2018-07-04",
  "scene_id": 133220,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral"
  ],
  "title": "Naughty Neighbor"
}