{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Quentin Gainz and new boy toy Trevor Laster are stripped down to nothing but their denim as they explore each others bodies. Quentin takes his time to appreciate Trevor's stunning body, admitting that Trevor can fill out a pair of jeans like no one's business. But if you know Quentin at all, you know he thinks Trevor's pants would look much better crumpled up on the floor, so he peels his handsome stud out of his britches and has his way with him, as they 69 each other. Trevor downs Quentin's cock while Quentin alternates between Trevor's balls and his hole, finally laying him back against a pillow and tongue fucking Trevor before sitting  up to plunge his raw cock deep inside. Trevor takes it willingly as Quentin eases it in, slowly prodding Trevor with a steady motion. Trevor moans with pleasure and Quentin picks up the pace, fucking Trevor harder and harder until Quentin is close to losing his load. He slows down, then pulls out, telling Trevor he wants to give him a chance. He mounts Trevor and slides himself down onto Trevor's pole, taking it all the the way to the base and then spreading his legs. He rides Trevor's dick as his dick bounces up and down against Trevor's stomach. He grabs it and begins to stroke himself while he rides and he feels Trevor's dick get even harder inside him. He can tell Trevor is close so he dismounts, and Trevor lays on his back so Quentin can fuck the cum out of him. They both spit their loads almost instantly, Quentin blasting Trevor's hole with his seed as Trevor spits his all over his stomach. Enjoy!",
  "models": [
    {
      "name": "Trevor Laster",
      "person_id": 22460
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2018-07-12",
  "scene_id": 133551,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Blue Jean Buddies"
}