{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Chad Piper sees roomie Nathan Styles reading alone in his room, he figures Nathan is just doing some nerd shit to kill the time, but when Nathan rolls over and reveals his rock hard dick bulging in his jeans, Chad realizes Nathan is in here reading some hot and heavy material. Chad asks him if he wants the real thing and Nathan tells him he wants to see what he's packing. Chad unzips his pants and shows Nathan all he needs to see to get on board with the idea. They trade sloppy blow jobs before Chad bends Nathan over and begins to eat his ass. He tongues Nathan's hole until it's ready for more, and then Chad stands up fulfills Nathan's literary desires, inching his raw cock as deep as it will go. Nathan lets out a gasp as he realizes just how much pipe Chad is laying, and Chad begins to fuck him harder. He pounds from behind as Nathan strokes his dick feverishly as Chad begins to ease up. Slowing down, they decide to switch up, and Nathan climbs on top of Chad, lowering himself onto Chad's pole, then sliding all the way down as he parts his cheeks. He takes the cock balls deep and gives Chad the ride of his life. Both guys are close to cumming, but Nathan wants to try his hand at laying the pipe. Chad is game, but almost as soon as Nathan can get his cock inside the hole, Chad clenches and tightens up around the head of Nathan's dick, causing him to erupt all over Chad's stomach. Chad realizes it's now or never, and busts his load as Nathan exhales, and they both laugh, wondering what the next chapter will bring.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Chad Piper",
      "person_id": 49592
    },
    {
      "name": "Nathan Styles",
      "person_id": 51783
    }
  ],
  "release_date": "2018-06-30",
  "scene_id": 133544,
  "series": "NDR - 177 - Chad Piper & Nathan Styles",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Book Worm"
}