{
  "collections": [
    "Active Duty"
  ],
  "description": "Donte doesn't waste any time and right off the bat he has Mathias's big dick deep in his mouth sucking every inch of it. Donte is really horned up and once he's done blowing Mathias he offers up his cock to him and Mathias begins to suck on that cock passionately. Donte loves the BJ he is receiving and he starts to finger himself as Mathias sucks on his huge dick. As Mathias is blowing Donte he notices the clock and tells Claude that he has to bounce because of a job interview and so he does leaving Mathias all alone with a hard dick. Once Donte leaves Blaine who was supposed to drive Donte home after the scene notices that he ran out of the building and so he comes up to the shoot room and offers his services to Mathias which he is down for. Mathias lets Blaine finish sucking his big hard dick and soon enough Blaine is fucking Mathias tight little ass. Mathias has a sweet fresh tight ass since he's not even had a handful of guys fuck him but Blaine pushes deep into him and bangs him out amazingly. Blaine blasts a huge load of cum all over Mathias pubes leaving him in a sticky warm mess. Mathias can hear Donte coming back up to the room and Blaine gets nervous and hides. Donte comes back and the job interview stressed him out and he tells Mathias he needs to be fucked hard and deep. Mathias bends Donte over and he starts to fuck his eager tight ass. Donte is enjoying every inch pushing into his little hole as he moans with pleasure and Mathias manhandles him pushing his face into the bed as he thrusts deep and hard into him. Mathias pulls his hard dick out and cums between Donte's ass cheeks leaving all the cum on his ass and dripping onto his used hole.",
  "models": [
    {
      "name": "Blaine Jameson",
      "person_id": 51862
    },
    {
      "name": "Donte Thick",
      "person_id": 51483
    },
    {
      "name": "Mathias",
      "person_id": 49149
    }
  ],
  "release_date": "2018-07-08",
  "scene_id": 133543,
  "series": "AD - 318 - Mathias, Blaine Jameson & Donte Thick",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Tattoos"
  ],
  "title": "Mathias, Blaine Jameson & Donte Thick"
}