{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Fresh off their workout, roommates Charlie Pattinson and Dante Colle are both feeling the burn, but Charlie's back is causing him some problems. He entertains the idea of calling a masseuse but Dante immediately tells him not to waste his money, grabbing his oil and telling Charlie to lay on the bed. Charlie does as instructed, and Dante begins to rub his aching muscles. Charlie quickly realizes Dante is way better than any professional he could've called, and the bulge in his pants lets Dante know just how much Charlie is enjoying himself. Taking a chance, Dante reaches into Charlie's pants and begins to massage his cock, and as it gets harder and harder, Dante throws all pretenses out the window and takes Charlie's cock into his mouth. Charlie moans his approval as Dante continues, stripping Charlie out of his shorts as he does the same. With both of them naked and rock hard, Charlie volunteers to give Dante a different sort of internal massage, slowly inching his bareback cock deep into Dante's waiting hole. He fills Dante up with his meatstick, gradually increasing his speed until he's fucking Dante fast and hard. Dante grips the bed sheets as Charlie continues to pound, moaning with every thrust of Charlie's prick. Charlie fucks Dante all over the bed in every position, his back pain now a distant memory. Flipping Dante over onto his back, he grabs Dante's legs and pulls him in closer, giving him one last hard push as Dante loses his load all over his stomach. Charlie continues until he's ready to nut, pulling out and blasting Dante's hole with his load, then shoving his cock back inside to go again. Enjoy!",
  "models": [
    {
      "name": "Charlie Pattinson",
      "person_id": 50959
    },
    {
      "name": "Dante Colle",
      "person_id": 51897
    }
  ],
  "release_date": "2018-07-06",
  "scene_id": 133545,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Gay Porn",
    "Jerking off",
    "Kissing",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Roomie Rub Down"
}