{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Dante Martin seems pretty stressed out about the school project that's due on Monday. Project partner and roommate Miles Matthews doesn't seem bothered at all, but that's likely because he forgot it was due and Dante's doing all the work. Nonetheless, when he sees Dante stressing he tells him to take a break, rubbing his tense shoulders and giving him a small peck on the cheek. Dante smiles and looks up at Miles, suddenly realizing exactly what kind of break Miles is talking about. Standing, he faces Miles, and they kiss as they both disrobe. Miles falls to his knees and takes Dante's hard dick into his mouth. Dante shoves his head down further onto his cock as Miles chokes on it. He quickly returns the favor, downing Miles' cock to the base, but Miles is so horny he wastes no time in standing Dante back up and bending him over the desk. Now that he's got Dante where he wants him, he slides his big dick into Dante's waiting hole, spreading his cheeks wide so he can watch his cock going in and out. Dante closes his eyes and moans with every thrust, before Miles picks up the pace and begins to pound him. Dante tells Miles to get on the desk, where he mounts him and begins to grind on Miles, before setting his hands on Miles' chest and riding him hard and proper. Miles is ready to cum so he flips Dante back onto his back and gives him one last good round of hard pounding before pulling out blasting Dante's perfect ass with his load. Dante feels it blast against his balls as he shoots a massive load onto his chest. Cum covered but much more relaxed, he tells Miles they need to work together more often. Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Miles Matthews",
      "person_id": 51474
    }
  ],
  "release_date": "2018-07-14",
  "scene_id": 133638,
  "series": "NDR - 181 - Miles Matthews & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bald",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Climax",
    "Gay Porn",
    "Kissing",
    "Muscular",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "School Projects"
}