{
  "collections": [
    "Active Duty"
  ],
  "description": "Johnny is the first to get his mouth full of cock as he intimately gives Ryan a slow deep blow job utilizing his wet tongue to the fullest extent. Ryan's dick grows harder each time Johnny deep throats his throbbing cock. He takes his time with Ryan's dick giving him the utmost pleasure. Once Johnny's mouth was satisfied the tables turned and Ryan gets his chance at stuffing his mouth full of dick. His method his more fast paced and he loves to be gagged as he moans and drools all over Johnny's big dick. Ryan sometimes gets carried away when he's sucking cock and will take every inch too far down his throat making him gag really hard but Ryan is elite for a reason and it dives right back on it sucking down every inch Johnny has to offer. Johnny is too horned up and he tells Ryan to fuck him. Ryan slowly pushes deep into his smooth tight ass spreading it wide with his hard thick cock. Once he is in balls deep he thrusts up and in making Johnny squirm with pleasure. Ryan bends him over and pounds that ass hard and deep making his balls slap loudly. Johnny can barely take the pounding as Ryan flips him over onto his back so he can see his face while he fucks him. The moans Johnny is making become louder as Ryan starts to stroke his cock while fucking his tight hole deep. Johnny's legs are spread wide and his hole is open for Ryan as he enjoys every inch of that big raw dick. Ryan continues to fuck that tight ass while Johnny strokes his dick and before you know it he shoots a load all over himself while Ryan's cock is inside of him. Ryan can feel that ass tightening up around his thick dick and he pulls out to shoot his load all over Johnny's smooth chest.",
  "models": [
    {
      "name": "Ryan Jordan",
      "person_id": 46639
    },
    {
      "name": "Johnny B II",
      "person_id": 50714
    }
  ],
  "release_date": "2018-07-15",
  "scene_id": 133645,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Kissing",
    "Muscular",
    "Smooth",
    "Tattoos",
    "White Butt"
  ],
  "title": "Ryan Jordan & Johnny B"
}