{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Roman Todd has a curious feeling about the new neighbor, Zak Bishop. Zak thinks Roman is hot but he's had his share of curious straight guys before, and it's always left him unsatisfied. 'They want you to suck them off and they won't kiss,' he tells Roman, 'then they never call you back.'Roman kisses Zak and tells him he'll call him back. Zak isn't that convinced, so Roman kisses his way down Zak's body and begins to suck his dick, slowly working the shaft with his tongue before downing it to the base. Zak has to admit that Roman sure seems to be able to suck a good cock for a guy who is only 'curious' but when Roman flips him over and begins to eat his ass, Zak becomes more and more convinced that Roman is a lot more than curious. He goes with as Roman tongues his hole, telling Roman to fuck him hard. Roman slides his dick into Zak's ass and long dicks him slowly, watching his cock go in and out of Zak's hole. Zak asks him if his girlfriend lets Roman fuck her in the ass and Roman laughs, picking up the pace and fucking Zak harder. Zak moans his approval before flipping Roman over and climbing aboard. He lets Roman fuck him all over the bed, before Roman moves him over to the window. Zak shoots his load as Roman fucks him in the window, spraying it all over himself as Roman pulls out and does the same, blasting Zak's body with his first gay load in front of the whole city. Zak smiles and thinks, 'That's some cumming out'.Enjoy!",
  "models": [
    {
      "name": "Zak Bishop",
      "person_id": 47446
    },
    {
      "name": "Roman Todd",
      "person_id": 46827
    }
  ],
  "release_date": "2018-07-25",
  "scene_id": 133794,
  "series": "NDR - 184 - Roman Todd & Zak Bishop",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Curious Neighbor"
}