{
  "collections": [
    "Active Duty"
  ],
  "description": "These two elites jump right at it with some deep passionate kissing. They have a great time together and are fully into the moment. They warm up each other's bodies by letting their hands explore every inch while their mouths are locked together. Princeton makes his way down Quentin's ripped body and pulls his hard cock out and begins taking every inch down his throat. Princeton is very skillful with a hard cock in his mouth as Quentin kicks back in enjoyment. Princeton moves to Quentin's smooth ass as he flips him over and spreads his cheeks wide revealing his tight hole. Princeton uses his tongue to fuck that little ass as he grips those cheeks with his hands. Quentin can barely take it and doesn't want to cum just yet so he has Princeton lay on his back and begins to suck on his hard dick giving him the same pleasure he received. Quentin blows that hard dick and makes his way down towards Princeton's smooth ass and he rims him deep and sensually making his tight hole dripping wet. Princeton is ready for that ass so he bends Quentin over and starts to fuck him deep and hard with his raw throbbing cock. Quentin moans with enjoyment as he feels every inch of that hard cock spreading his tight ass open. Quentin bends him over and pushes his dick into this tight ass fucking him passionately. He flips him onto his back and spreads his legs out wide and pushes his throbbing cock balls deep while sucking on Princeton's toes which make him go wild. Quentin keeps fucking him hard until Princeton's load explodes showing himself with cum. He's amazed by how much he nutted and while rubbing his own cum Quentin is masturbating until he covers Princeton with his warm cum.Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Princeton Price",
      "person_id": 46796
    }
  ],
  "release_date": "2018-07-29",
  "scene_id": 133802,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Rim",
    "Smooth",
    "Tattoos"
  ],
  "title": "Quentin Gainz & Princeton Price"
}