{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Locked in an escape room, Nathan Styles and his boyfriend Gunner are faced with the task of following the clues to find their way out, but instead, they decide they'd rather stay locked in the room for a little while together. When the proprietor of the business, Dax Carter, checks on them, he finds Gunner laying on the bed naked with his dick in Nathan's mouth. Dax asks what the hell is going on and Nathan takes the dick out of his mouth long enough to tell him to join. Dax considers it for a second before deciding to take off his clothes and see what he's missing, and Nathan immediately begins sucking him off as Gunner positions himself behind Nathan, plunging his raw cock deep into Nathan's waiting hole. Dax watches as Gunner pounds Nathan from behind, before finally getting his chance when Nathan mounts him for a ride. Gunner shoves his cock in Nathan's mouth as Dax grabs his waist and thrusts into him from below. They switch one more time and Gunner spreads Nathan's legs and gives him one last fuck. Nathan strokes himself as Gunner works his magic, and Nathan spits his load all over his stomach just as Dax unloads all over his chest. Gunner sees Nathan covered in cum and pulls out, jizzing all over his boyfriend's hole. Dax admits this was a much more fun way to spend the hour, and the three of them laugh.Enjoy!",
  "models": [
    {
      "name": "Dax Carter",
      "person_id": 51831
    },
    {
      "name": "Gunner",
      "person_id": 50330
    },
    {
      "name": "Nathan Styles",
      "person_id": 51783
    }
  ],
  "release_date": "2018-08-01",
  "scene_id": 133942,
  "series": "NDR - 186 - Dax Carter, Gunner & Nathan Styles",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Sexscape"
}