{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Photographer Blaze Austin has been nervous for his shoot with celebrity Mathias for at least a week, and when Mathias has him shooting half nudes, Blaze just figures that Mathias is looking to update his head shots. But when Mathias tells him he actually has interest in filming a sex tape, Blaze is surprised, and when Mathias tells him he wants Blaze to be in it, well... Blaze tells Mathias he had no idea he was gay, and Mathias tells him his agent won't let him make his sexuality public, but maybe the two of them could go behind his agent's back. Blaze, suddenly fantasizing of Mathias going behind his back, agrees and the two of them kiss as they fall back onto the sofa. Blaze unwraps Mathias celebrity cock and gives it a taste, sucking Mathias off as he strips him piece by piece. Once they are both naked, Mathias returns the favor, downing Blaze's dick and working the head until Blaze is rock hard. Seeing that Blaze is hot and horny for his dick, Mathias plunges his raw cock in Blaze's hole, easing it in slowly before picking up the pace and pounding Blaze. He fucks Blaze doggy style before flipping him over and giving him a ride. Blaze grinds his ass on Mathias' dick as he strokes himself off, and Mathias flips him over onto his back and fucks the cum out of him before feeding his load in a messy facial. Blaze swallows it up and tells Mathias he loves the taste of his famous cum.<br> </br>Enjoy!",
  "models": [
    {
      "name": "Blaze Austin",
      "person_id": 51761
    },
    {
      "name": "Mathias",
      "person_id": 51232
    }
  ],
  "release_date": "2018-07-27",
  "scene_id": 133940,
  "series": "NDO - 4894 - Mathias & Blaze Austin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Kissing"
  ],
  "title": "Shoot Secrets"
}