{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Finding a sleeping Ryan Jordan on the sofa, Scott Finn tries to wake  up his roomie so he can help him study. Scott flips his cards at Ryan's face and when he doesn't wake up, Scott decides to can the idea and just pick up his cards. But when he does, he gets a handful of Ryan's hard dick and quickly forgets about his cards. Ryan wakes up to find Scott massaging his cock but doesn't stop him, so Scott unzips his pants and pulls it out. Ryan's cock is massive and already hard thanks to Scott's coercive fondling. Scott takes Ryan's dick into his mouth and can barely fit half of it down his throat, so Ryan helps him out, choking him with his python before standing Scott up and returning the favor. Ryan's rock hard and ready to get a piece of Scott's perfect little ass, so he has Scott mount him reverse, his cock standing straight up in anticipation of Scott's hole. Scott lowers himself down slowly, and the size of Ryan's cock takes his breath away. He cautiously works his way up and down Ryan's pole, wary of how big it is. Ryan isn't having any of it, though, and he bends Scott over and begins to pound him. Scott moans with every thrust as Ryan gives it to him relentlessly, flipping him over as Scott begins to stroke himself off, and fucking the cum out of Scott as he pulls out and blasts him with jizz, coating Scott in cum as he rolls around sticking to the flash cards all over the sofa. That's some study sesh! Enjoy!",
  "models": [
    {
      "name": "Scott Finn",
      "person_id": 50329
    },
    {
      "name": "Ryan Jordan",
      "person_id": 51208
    }
  ],
  "release_date": "2018-08-11",
  "scene_id": 133996,
  "series": "NDR - 189 - Ryan Jordan & Scott Finn",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Climax",
    "Gay Porn",
    "Oral",
    "Slim",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Flash Card Fuck"
}