{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When acting coach Dalton Riley meets Trevor Laster face to face, he's impressed by Trevor's look, but when they begin their improv exercises, it becomes clear that Trevor's acting chops are in need of some refinement. Dalton sees that Trevor just needs to loosen up and get out of his mind, more into his body, and he's got just the exercise method to achieve that. As he gently puts his arms around Trevor and rubs his shoulders, he tells Trevor to react in character, not as himself. Trevor embraces the role and grabs Dalton, pulling him closer. As they kiss, Dalton smiles.   'That's improv?' Trevor asks.  'No, this is,' Dalton replies, suddenly grabbing Trevor's waistband and exposing his rock hard cock. Dalton takes it into his mouth as Trevor lets out an audible moan. He feels Trevor throbbing in his mouth before bending him over to eat his ass. Tonguing his hole, he strokes himself hard before plunging his cock deep into Trevor. Trevor gasps as Dalton works it in, and before he knows it, Trevor's cherry is popped, and Dalton is 8 inches deep inside him. Dalton shows him how it's done, easing his dick in and out before picking up the pace. He lets Trevor take a ride as he squeezes his perfect ass. Trevor proves his natural talent, but Dalton wants to see his versatility, so he flips onto his back and tells Trevor to fuck the cum out of him. Trevor, now on top, slides his cock into Dalton and spreads his legs, fucking him hard as Dalton strokes himself off. Watching Dalton jizz all over himself triggers Trevor to want to nut, so he pulls out and feeds Dalton his load, spraying all over his face as Dalton tries to lap it all up. As Trevor bends down and kisses his cum drenched lips, Dalton smiles and tells him he's a natural actor. Trevor tells him he wasn't really acting. Enjoy!",
  "models": [
    {
      "name": "Trevor Laster",
      "person_id": 22460
    },
    {
      "name": "Dalton Riley",
      "person_id": 48651
    }
  ],
  "release_date": "2018-08-18",
  "scene_id": 134079,
  "series": "NDR - 191 - Trevor Laster & Dalton Riley",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Intimate Improv"
}