{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Seeing his secret boyfriend is sans parents for the moment, Jackson Cooper steals his way into Alex Tanner's house and surprises him in the kitchen, telling him they should get busy while the getting is good. Alex is hesitant at first, but Jackson is very convincing as he kisses his way down Alex's neck, quickly stripping him before sucking him off on the kitchen island. As he does, their mutual friend, Quin Quire, makes his way to the front door, but ceases to knock when he sees his two buddies naked and sucking each other off. He surprises them, and caught red handed, Alex and Jackson admit that they've been seeing each other in secret for quite some time. Quin asks if maybe he can share in their secret, fondling his package through his jeans. Alex sees the outline of Quin's cock and quickly decides that they can share. Before Quin knows what's happened, he's gone from fantasizing at the doorway to being right in the middle of it. One moment he's got both of them sucking him off, the next moment he's got both of their cocks in his mouth. He throws Alex back on top of the island and eats Alex's ass, moistening it up before sliding his raw cock into Alex's waiting hole. Alex takes it full to the base as Quin fucks him slowly at first, then faster and faster as Alex intermittently moans and sucks Jackson off. They take turns fucking Alex every which way. Jackson pounds his hole before pulling out and feeding Alex his load. Alex swallows as Quin spins him around and fucks himself to the edge. He pulls out and unloads on Alex's face. Cum covered, Alex shoots his load as the two of them watch, and it sprays all over his body. The three of them laugh as a way of bonding over their newly shared secret. Enjoy!",
  "models": [
    {
      "name": "Alex Tanner",
      "person_id": 38001
    },
    {
      "name": "Jackson Cooper",
      "person_id": 38267
    },
    {
      "name": "Quin Quire",
      "person_id": 52165
    }
  ],
  "release_date": "2018-09-06",
  "scene_id": 134162,
  "series": "NDB - 4905 - Quin Quire, Jackson Cooper & Alex Tanner",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Cum swallow",
    "Deep throat",
    "Gay Porn",
    "Muscular",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Caught in Love - Part 1"
}