{
  "collections": [
    "Active Duty"
  ],
  "description": "Randon Rave is taking a shower while Dirk interviews Quentin in the bedroom. Quentin Gainz is excited about the new look and feel of how this scene is being introduced. Dirk gives Quentin a quick back story on Randon so that he can break him in easily and when the time is right bring up the questions to him to see if he will be down to go all the way. Randon finishes his shower and the two have a quick introduction. Randon is already naked and jumps on the bed next to Quentin. They both start stroking their cocks and Quentin starts to undress. Both of their cocks are out and Quentin suggests that they should stroke each other's dicks. Randon doesn't mind at all and for the first time he is stroking another man's hard throbbing cock. Quentin goes step by step making sure Randon is comfortable with what he's doing. Quentin gets a little closer and soon enough has his eager mouth wrapped around that hard dick. Randon starts to embrace Quentin's watery mouth and soon enough he's asking Quentin if he can suck on his dick. Quentin lets the rookie blow him balls deep and it's only a warm up cause soon after Quentin tells Randon that he should fuck his tight ass raw. Quentin gasps as his hole opens up for Randon's thick dick and soon enough Randon is pumping deep into that ass. Randon loves the feeling of Quentin's ass and now that he is completely comfortable they switch up the positon and Quentin starts to ride that hard thick dick deep grinding it hard until Quentin blows a hot warm load all over Randon's face. Randon continues to stroke his dick as Quentin worships his body and then he shoots his own load all over himself.",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Randon Rave",
      "person_id": 52057
    }
  ],
  "release_date": "2018-08-12",
  "scene_id": 134128,
  "series": "AD - 328 - Randon Rave & Quentin Gainz",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Jerk Off",
    "Produced & Directed by Dirk Yates",
    "Shower",
    "Tattoos"
  ],
  "title": "Randon Rave & Quentin Gainz"
}