{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Out among the trees of his father's avocado grove, Ian Greene happens upon one of the workers on break engaging in a little 'me time'. Donte Thick has found a nice private spot set up, and as Ian watches on, Donte strokes his massive cock. Even from a distance, Ian can see that Donte is packing quite the package in his overalls, and beginning to fondle himself, he fantasizes about sucking him off. To his surprise, Donte wags his dick at him and invites him over. Ian wastes no time making his way over to Donte's spot, and without words, he falls to his knees and makes his fantasy a reality, as he downs Donte's hog of a cock to the base. Donte gags him with his dick as Ian chokes on the head. Donte comes out of his overalls and tells Ian to stand up. When he does, Donte delivers a messy blowjob, spitting all over Ian's cock and then gagging himself on it repeatedly. He lays Ian on his back and tongues his hole before sitting up and sliding his bareback cock into Ian. Ian looks up at Donte as he thrusts over and over again. He reaches up and runs his hands along Donte's chest as Donte pounds him with his cock. Donte flips him over and perches Ian's ass high in the air, before fucking him from behind as he reaches around and chokes Ian a little. When he finally lets Ian have a ride, they are both on the edge of cumming, and Ian is rock hard and ready to shoot his load. He strokes himself as he rides and lauches his messy jizz all over Donte's blanket as Donte continues to fuck him raw. A few more pumps and Donte is ready to cum, so he Ian dismounts and Donte feeds him his load, spraying it all over Ian's face. Cum covered, Ian realizes maybe his father is right when he says he should spend more time in the grove. Enjoy!",
  "models": [
    {
      "name": "Ian Greene",
      "person_id": 48341
    },
    {
      "name": "Donte Thick",
      "person_id": 51050
    }
  ],
  "release_date": "2018-09-07",
  "scene_id": 134334,
  "series": " NDO - 4906 - Ian Greene & Donte Thick",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blonde",
    "Brunette",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Latino",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Tattoo/Piercing",
    "Workers"
  ],
  "title": "Voyeur Fantasies"
}