{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Making his last delivery for the day, Vince Michaels realizes he recognizes customer Nathan Styles, and not just because Nathan used to date one of Vince's friends. No, Vince recognizes Nathan from his on screen work in the adult industry, and when Nathan realizes this, he becomes a little nervous. Vince assures him he's cool with it, and in fact, begins to pick Nathan's brain on how to get started. Offering a bribe of beer to go with the delivery, he finds himself hanging with Nathan and asking him questions about the biz. Nathan answers Vince's questions patiently, slowly piecing it together that Vince has never been with a guy, but really secretly wants to. When he asks Vince directly, Vince makes a move for Nathan's shorts, quickly pulling them down and immediately sucking Nathan's cock. Nathan smiles but doesn't stop him, so Vince continues. To Nathan's surprise, he turns out to be really good at sucking cock for someone who's never tried it before, and Nathan finds himself genuinely turned on. He returns the favor to Vince, sucking him off as he plays with his balls, and once Vince is nice and hard, he bends over and tells Vince to fuck him. An hour ago, Vince was delivering food to a stranger, and now he finds himself cock deep in his fantasy of fantasies, as he pounds Nathan all over the sofa. He squeezes Nathan's sweet ass as he watches his cock stretching Nathan's hole from behind, finally turning Nathan over and fucking him missionary until Vince is ready to shoot. He empties himself all over Nathan's hole as Nathan shoots his load all over his stomach. As they kiss, Nathan tells Vince he definitely has what it takes to make a career switch.Enjoy! ",
  "models": [
    {
      "name": "Nathan Styles",
      "person_id": 51783
    },
    {
      "name": "Vince Michaels",
      "person_id": 52160
    }
  ],
  "release_date": "2018-09-05",
  "scene_id": 134333,
  "series": "NDR - 196 - Vance Michaels & Nathan Styles",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Blonde",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "A Mouth Full"
}