{
  "collections": [
    "Active Duty"
  ],
  "description": "Once introductions are over the two slowly take their pants off to reveal their cocks. They both begin to stroke their cocks until they are nice and hard. Quentin Gainz keeps staring at Kevin Texas's thick dick and eventually asks him if he would like him to suck it. Kevin tells him sure go for it and Quentin goes down on him. This is Kevin's first experience having a man wrap his mouth around his hard dick. Quentin loves that Kevin's dick is pierced and he uses his tongue to play with it. Kevin has Quentin worship his hard dick in a few different positions until Quentin asks him for a make out session. Kevin is reluctant at first but gives into Quentin's smooth talking. They begin to kiss intimately and deeply while nibbling on one another's lips. He pushes his legs up in the air and back and buries his face into that hole licking and sucking it. Kevin moans with pleasure as this is his first experience in having a rim job. He almost can't keep still has Quentin enjoys his tight sexy hole. He asks Kevin if he can fuck him but Kevin isn't too sure about it and he might want to do it next time around. Quentin is a little bummed but then asks if he can rub his raw hard dick on his wet hole and Kevin agrees to tit. Quentin pushes his throbbing raw dick up against his eager hole while rubbing it all around making Kevin ease into the possibilities he could enjoy to the fullest. Kevin is stroking his hard cock while Quentin is still eating him out and all of a sudden Kevin blasts his load all over his smooth chest. We think Kevin really really liked his ate being eaten. Quentin sees all the glory and he gets back on the bed and lies next to Kevin as he begins to beat his hard dick until he explodes on his ripped chest and Kevin is amazed by Quentin's cum load. Enjoy!",
  "models": [
    {
      "name": "Kevin Texas",
      "person_id": 52182
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2018-09-23",
  "scene_id": 134635,
  "series": "AD - 340 - Kevin Texas & Quentin Gainz",
  "tags": [
    "Blowjob",
    "Brunette",
    "Duo",
    "Jerk Off",
    "Kissing",
    "Rimming",
    "Tattoos"
  ],
  "title": "Kevin Texas & Quentin Gainz"
}