{
  "collections": [
    "Active Duty"
  ],
  "description": "Dirk has them all come into the room and without many words they get straight to the point and begin to take their clothes off which leads them all into one nice 69. Dirk looks on we get a great eagle eye view from above with all three of these sexy men intertwined sucking cocks and feeling each other's sexy bodies. They move from a 69 into a great rimming position with Gunner filling his mouth with Cole's hard cock while Laith Inkley buries his face deep into Gunner's smooth beautiful hole licking and sucking on it making him moan with that throbbing dick balls deep in his wet mouth. Cole looks on in amazement as he kicks back enjoying his great BJ. Gunner is first up as he bends over and lets Cole push his hard dick into his smooth tight ass until his balls touch and you can see how amazing Gunner's bubble ass looks. Cole Weston loves the tightness and while he fucks Gunner Laith Inkly is stuffing his hard dick down his throat making sure his moans are stifled. Gunner and Cole both fuck Laith's tight tanned ass making him squirm all over the bed. The action becomes hot and sweaty as they get closer to shooting their hot loads out and with a few more pumps from Cole he blasts his sweet warm load all over Laith's chest as well as Gunner. Laith continues to stroke his cock with his cum drenched chest until he finally releases his nut all over his own chest as well.  Enjoy!",
  "models": [
    {
      "name": "Laith Inkley",
      "person_id": 51106
    },
    {
      "name": "Cole Weston",
      "person_id": 52146
    },
    {
      "name": "Gunner",
      "person_id": 52264
    }
  ],
  "release_date": "2018-09-30",
  "scene_id": 134714,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Gay",
    "Muscular",
    "Produced & Directed by Dirk Yates",
    "Smooth",
    "Tattoos",
    "Threesome"
  ],
  "title": "Cole Weston, Laith Inkly & Gunner"
}