{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Question: What should do two fugitives do when their captive won't stop begging for his life? Answer: Spit roast the guy raw! Riley Mitchell and Johnny Ryder are on the run from the law. But right now, their biggest problem is scruffy, pretty-boy Kurtis Wolfe. They only needed Kurtis for a getaway car, but now he won't stop begging for his release. Riley's ready to pull the trigger - literally! - just so he can have a moment's peace. That's when a terrified Kurtis says they can't kill him yet, Johnny wants to fuck him in the ass and he still hasn't had the chance! One look at his partner and Riley realizes, yep! Johnny wants to fuck Kurtis in the ass. Hard. Riley explodes - how can Johnny be thinking about sex at a time like this? Johnny answers by spreading the cheeks of their captive's mouthwatering, hair-dusted ass. Riley can see his point. Both men hit their knees for a taste of Kurtis's delicious crack as they trade long passionate kisses. The tension of being on the run explodes into a three way of unstoppable fuck heat that sees each man taking raw dick long and hard, including reluctant tough guy Riley, who ends up flat on his back, begging for his captive's cock and load. Second question: What should two fugitives never do if they want to evade some highly trained bounty hunters? Answer: Stop to fuck their captive. As soon as the men finish tasting each other's hot loads, they discover they have some very unwanted visitors. Visitors with guns.",
  "models": [
    {
      "name": "Johnny Ryder",
      "person_id": 28996
    },
    {
      "name": "Kurtis Wolfe",
      "person_id": 50440
    },
    {
      "name": "Riley Mitchel",
      "person_id": 51578
    }
  ],
  "release_date": "2018-10-12",
  "scene_id": 134733,
  "series": "Bounty Hunters",
  "tags": [
    "Anal",
    "Boots",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "rimming",
    "spitting"
  ],
  "title": "Bounty Hunters"
}