{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Pool party alert as Roman Todd, Spencer Laval and Justin Matthews waste away a perfectly good summer afternoon in the water. As the sun begins to set, Roman gets out to use the bathroom and order a pizza, and as soon as he turns his back, Spener and Justin decide to take their own little time out break, as the make their way over to the shaded seating, already working each other out of their swim suits. Justin wastes no time going down on Spencer, filling up his mouth with hard dick as Spencer moans his approval. Roman comes back to find his two buds have already started without him, but no matter. He simply strips off his shorts and joins them, turning Justin's attention to his cock. Justin gladly switches as Spencer deep dives on him, flipping Justin around so that Spencer can eat his ass. He tongues Justin's hole before standing up and sliding his raw cock into him. Spencer pounds Justin's from behind while Roman watches with envy. He pulls his dick out of Justin's mouth and tells him he wants to get fucked too, so Justin lets him climb aboard. Roman rides Justin's cock nice and slowly, jerking Spencer off as he lay back and watches. Ready to bust, Roman tells just Justin to switch positions, and lays on his back as Justin teases his hole with his cock. Spencer stands up and shoves his cock down Roman's throat as Justin begins to fuck him harder and harder. Roman strokes himself off as Justin gets close to climax, spitting his load all over his stomach as Justin pulls out and hoses him down. Spencer sees all of this and nuts all over Roman's face, covering him with jizz. Cum covered and hungrier than ever, the three of them have just enough time to wash off in the pool before their delivery arrives.Enjoy!",
  "models": [
    {
      "name": "Justin Matthews",
      "person_id": 52245
    },
    {
      "name": "Roman Todd",
      "person_id": 46827
    },
    {
      "name": "Spencer Laval",
      "person_id": 51479
    }
  ],
  "release_date": "2018-10-10",
  "scene_id": 134762,
  "series": "NDR - 206 - Roman Todd, Spencer Laval & Justin Matthews",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass to mouth",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "In the Head"
}