{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Desperate, sweaty and on the run, tattooed fugitive Riley Mitchell makes it home just in time to hide from the determined men on his tail. Hollywood handsome bounty hunters Eddy Ceetee and Alex Mecum burst into Riley's bedroom, guns drawn, just as Riley slides out of sight. A distraught Eddy is convinced they've lost Riley for now. But he's sure their target will return home at some point and they should lie in wait. That means he and Alex have some time to kill. And when your partner's as hot as an social media thirst trap, what better way to kill time than deep throating his cock? At least that's what Eddy thinks. The dark-haired stud hits his knees, gazing up at Alex with passion-filled, bedroom eyes as he swallows every inch of the man's gorgeous cock, leaving Alex breathless. Alex shows his appreciation for Eddy's perfect pecs by sliding his epic cock and low hanging balls between them. Then he feasts on his on his partner's muscle ass, snapping the bands of Eddy's jockstrap as he nibbles, sucks, licks and tastes. Meanwhile, Riley, trapped in his closet, is getting too horned up by the action he's seeing to plot his escape. He strips down, lubes his palm with spit and gives his full attention to the unbridled lust of the bounty hunters who have him trapped. Outside the closet, Eddy slides his raw length inside Alex, turning his fellow bounty hunter into a wild-eyed, teeth-gritting bottom beast.  'I want you to fuck me,' Eddy growls after plowing Alex to the brink. Alex is happy to oblige, and soon Eddy's thrusting his flawless ass back onto Alex's raw inches. When Eddy flips Alex onto his back and gets on for a ride, Riley loses all control. At the loud crash from the closet, both buck-naked bounty hunters grab their guns and leap to their feet, cocks swinging. As soon as they throw their naked and humiliated target to his knees, he hits them with a shocking request. 'You guys gotta fuck me raw before you take me in,' Riley pleads. Caught up in their debauched and reckless passion, the bounty hunters oblige. Alex rails the hardened criminal long, deep and raw before launching a gushing load across his flushed, sweaty ass cheeks. Eddy visits the same sticky fate on Riley's scruffy face.  Marking your territory as you get your man - it's all just another day's work for Raging Stallion's 'Bounty Hunters'.",
  "models": [
    {
      "name": "Alex Mecum",
      "person_id": 46654
    },
    {
      "name": "Eddy Ceetee",
      "person_id": 49888
    },
    {
      "name": "Riley Mitchel",
      "person_id": 51578
    }
  ],
  "release_date": "2018-10-19",
  "scene_id": 134734,
  "tags": [
    "Anal",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Tattoos",
    "Uniforms",
    "cum shots",
    "jockstraps",
    "masturbation",
    "rimming"
  ],
  "title": "Bounty Hunters, Scene #05"
}