{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Opposites attract. Especially in jail. That's what tattooed drug runner Riley Mitchell and wide-eyed innocent Jay Austin learn after they're thrown in a cell together. Jay's only crime is a night of hard partying. As for Riley? Well, he might have snuck some molly over the border. Whatever the case, Riley's got no patience for his Chatty Cathy cellmate, but his plan to shut Jay up reveals the scruffy, wide-eyed innocent has way more experience than he's letting on -- with cock! After Riley zeroes in on Jay's ass, his expert rim job turns Jay's chit-chat into hungry moans, and within seconds, eager young Jay is bucking his ass back onto Riley's expert, non-stop tongue fuck. When it's Jay's turn to return the favor, the kid eagerly hits all fours like a hungry puppy, happily choking himself on Riley's thick, throbbing cock. It's a blowjob so good, Riley must hold onto the cell's bars to stay upright. Since they've let their guard down, tough guy Riley decides to offer up his hard muscle ass to his eager young cellmate. Jay's more than happy to accept. He takes the tatted-up criminal's hungry hole long and deep in a raw, spit-lubed fuck punctuated by Jay's eager cries of, 'Good boy!' In return, Riley flips Jay's ass skyward, pile-driving the him bareback as both men grip the bars for support. Jay's eyes roll back into his head as he begs for more and more of Riley's raw dick. It's the kind of sweaty, hungry fuck that only two men locked alone in a cell together can give each other. It ends with Jay drenching his own beard with his thick cum and Riley slathering Jay's twitching hole with his load before driving it inside on the head of his bare, lube-slick cock. Just then, Riley's buddy Johnny Ryder shows up with a key-ring he swiped off the sleeping deputy. In his rush to escape, Riley leaves poor, freshly plowed Jay behind, proving that while jail might be a great place to fuck, it's not the best place to make friends.",
  "models": [
    {
      "name": "Jay Austin",
      "person_id": 51868
    },
    {
      "name": "Riley Mitchel",
      "person_id": 51578
    }
  ],
  "release_date": "2018-09-28",
  "scene_id": 134730,
  "series": "Bounty Hunters",
  "tags": [
    "Anal",
    "Hairy",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "masturbation",
    "prisons",
    "rimming",
    "spitting"
  ],
  "title": "Bounty Hunters"
}