{
  "collections": [
    "Raging Stallion"
  ],
  "description": "When you're on the run from the law, sometimes the line between captor and captive gets a little blurry. Fugitives Johnny Ryder and Riley Mitchell are racing through the open desert on foot. They're in need of a getaway car, and fast. Along comes a white van driven by studly movie star look-alike Kurtis Wolfe. Guns drawn, flex cuffs out, the two fugitives tear Kurtis from the driver's seat. Riley slides behind the wheel while Johnny drags their terrified captive into the van's cargo bay. But the tape over Kurtis's mouth isn't enough to keep him quiet so Riley suggests another tactic -- Johnny should fill Kurtis's mouth with his enormous cock. Eager to shut Kurtis up, Johnny complies. But Kurtis likes his new gag way more than the tape. He quickly turns into a slobbering bobblehead on Johnny's gargantuan rod. Who knew their random kidnapping victim would turn out to be such a hungry cocksucker? Johnny can't get enough of the fact that Kurtis can't seem to get enough of his dick. What choice does he have to but to drive Kurtis's handsome face into his sweaty ass crack? When Johnny finally releases Kurtis's cock, he finds his rough treatment has left his captive throbbing and rock hard. While Riley's stuck driving at breakneck speeds through the open desert, Johnny sucks their captive's cock with such passion, it's not clear who's violating who. One thing is clear. When Kurtis finally explodes, Johnny can't resist slurping up his pretty boy captive's thick, creamy load. Kurtis is more than happy to return the favor when Johnny straddles his chest. Who knew a last-minute kidnapping could involve this much hot cum?",
  "models": [
    {
      "name": "Johnny Ryder",
      "person_id": 28996
    },
    {
      "name": "Kurtis Wolfe",
      "person_id": 50440
    }
  ],
  "release_date": "2018-10-08",
  "scene_id": 134732,
  "series": "Bounty Hunters",
  "tags": [
    "Boots",
    "Hairy",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "rimming",
    "spitting"
  ],
  "title": "Bounty Hunters"
}