{
  "collections": [
    "Active Duty"
  ],
  "description": "Richard Buldger walks into the room and brings his friends in and they all jump on the bed and take their clothes off. Dirk has set some porn on as they begin to stroke each other's cocks making them rock hard. Once their dicks are hard Richard and Billie start sucking dick while Ian Rush kicks back and watches them. Since Ian doesn't have a cock in his mouth and he's getting blown they move slightly and fall into an amazing sexy 69 position and now every one's mouth is full of hard solid soldier cock. The moans and sounds of dick sucking can be heard throughout the room as these fine soldiers please each other. Billie Starz is becoming eager and wants to be fucked hard by someone so Richard agrees and he slowly inserts his thick throbbing dick into Billie's tight hairy hole pushing his dick in until balls deep. Ian strokes Billie's throbbing dick as he continues to get his cock blown from Billy while he's getting plowed by Richard. Richard and he slowly pushes his cock into him which pushes him deeper into Billy. Now all three men are connected and Billie as well as Richard moans with pleasure as the sensation becomes stronger and stronger. The pleasure has become too intense for Billy as he is the first to blow his load while being fucked leaving all his cum on his chest. Richard who was being plowed from behind shoots his load on to Billy's cum soaked chest and Ian continues to fuck Richard hoping to blow a load all over his back but he decides that he wants them to worship his cock while he masturbates. Billie and Richard look in awe at his hard dick as he strokes it until he blows a hot load right in front of their faces and they lick up all his sweet man juice. Enjoy!",
  "models": [
    {
      "name": "Richard Buldger",
      "person_id": 49059
    },
    {
      "name": "Billie Starz",
      "person_id": 49142
    },
    {
      "name": "Ian Rush",
      "person_id": 52607
    }
  ],
  "release_date": "2018-10-14",
  "scene_id": 134975,
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Jerk Off",
    "Muscular",
    "Produced & Directed by Dirk Yates",
    "Sandwich Fuck",
    "Shower",
    "Smooth",
    "Tattoos",
    "Threesome"
  ],
  "title": "Ian Rush, Billie Starz & Richard Buldger"
}