{
  "collections": [
    "Active Duty"
  ],
  "description": "Luke Johnson lies down on the bed and Donte Thick walks over to him and begins to suck on his cock. This is Luke's first time doing anything with another man. Donte pulls out his big hard cock right in front of Luke's face and he takes every inch down his throat. It doesn't look like his first time sucking cock but is most defiantly is. Donte gets up on the bed and pushes look down onto his chest so he can spread his legs and begin to play with his tight hairy hole. Donte loves what he sees and starts licking and fingering his ass making it nice and wet with his spit. Luke loves it as he moans with pleasure getting finger banged in his tight eager hole. Donte can't wait any longer as he watches this sexy soldier boy wiggle his ass in front of him. Donte slowly pushes his big hard dick into Luke's tight little hole. Once Donte is balls deep he starts fucking him slowly easing him into the battle that is far from over. Donte strokes Luke's cock which is hard as a rock as he is being fucked for the very first time. Donte fucks Luke in several positions before he lets the rookie get a turn on his ass. Luke pushes his hard dick into Donte fucking him hard and smacking him. Donte fucks Luke harder this time around making him sweat with pleasure as he gets fucked in a few new positions Eventually they end up on the bed tangled up together making out and stroking their cocks until Luke's nut releases up and into Donte's mouth and all over his chest. Donte's hot creamy load ends up splashed on both of them. The battle is over and Dirk sends the soldiers into the showers. Enjoy!",
  "models": [
    {
      "name": "Donte Thick",
      "person_id": 51483
    },
    {
      "name": "Luke Johnson",
      "person_id": 52238
    }
  ],
  "release_date": "2018-10-21",
  "scene_id": 135143,
  "series": "AD - 348 - Luke Johnson & Donte Thick",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Hairy",
    "Produced & Directed by Dirk Yates",
    "Rimming",
    "Tattoos"
  ],
  "title": "Luke Johnson & Donte Thick"
}