{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Plagued with self doubt, Dante Colle stands at his neighbor's door, attempting to summon the courage to knock and confront both his feelings and his crush publicly. At the last moment, he chickens out and turns to leave, turning right into the chest of none other than his neighbor, Johnny Hill, who has been watching this unfold for several moments. Now that they are face to face, Johnny smiles, but says nothing, as he unlocks the door and leads Dante inside. Leading him to the bedroom, Dante realizes Johnny has been secretly eyeing him from across the building as well, and as he strips Dante out of his clothes and begins to suck him off, Dante's hesitation turns to unbridled passion. He pushes Johnny further down onto his cock before flipping him over and returning the favor. Johnny dick gets rock hard and he tells Dante he wants to fuck him, but Dante has his own ideas, and tells Johnny he wants to fuck him first. Johnny is unsure but agrees, so Dante slowly works his cock into Johnny's tight hole. Johnny is so tight Dante can barely get it in, but once he manages, Johnny looks over his shoulder and moans his approval, so Dante picks up the pace, fucking Johnny hard before pulling out and nutting all over Johnny's back. Johnny smiles and says, 'My turn'. Dante shakes from his orgasm and climbs on top of Johnny, mounting his cock and giving it a ride. He grinds against hard on Johnny's rod, taking it all the way to the base as he strokes his dick while Johnny watches. Johnny tells Dante how nice his hole feels, flipping him over and spreading is legs as he fucks Dante harder. Dante strokes himself off, spitting a second load all over his stomach as Johnny's dick swells up ready to spit. He pulls out and soaks Dante with his batch as Dante moans in delight.Enjoy!",
  "models": [
    {
      "name": "Dante Colle",
      "person_id": 51897
    },
    {
      "name": "Johnny Hill",
      "person_id": 49385
    }
  ],
  "release_date": "2018-11-09",
  "scene_id": 135294,
  "series": "NDO - 4924 - Johnny Hill & Dante Colle ",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Kissing",
    "Tattoo/Piercing"
  ],
  "title": "Hard To Resist"
}