{
  "collections": [
    "Active Duty"
  ],
  "description": "Elye Black is rock hard and ready to roll so he decides to help out Cole Weston by sucking his cock and moments later Cole's cock is reaching up for the sky. Elye buries his face in Cole's hairy balls sucking them while Cole strokes his hard cock. Elye goes back and forth from sucking his dick to licking his balls. Cole is in amazement as he is being pleasured beyond belief. Cole repays the favor by sucking on Elye's cock for a bit but Cole isn't here to worship his cock he is here to fuck Elye's tight little ass. Elye bends his smooth tight ass over for Cole and he slowly pushes his big dick into him and once he's all the way in he starts pounding away on Elye's tight hole. They both banter back and forth about how great it feels and Elye wants to be fucked harder and harder. Cole is balls deep taking no prisoners as he builds up his balls. Cole mixes it up and lies Elye down on his back on the edge of the bed and spreads his legs wide open as he goes back inside him. Now he can see Elye's face as he fucks him deep and hard. Cole wraps his muscular hands around Elye's small neck and starts to choke him while he pounds his smooth shaven hole and Elye loves every minute of it. These soldiers are not scared of any battle as this war rages on between two sexy soldiers. Cole has had all the control up until now as Elye mounts him and slowly eases down his throbbing cock until all you can see are Cole's balls. Elye begins to use every inch of Cole's cock and slides up and down his long shaft grinding and enjoying his dick to the fullest. Cole can't take it anymore and his balls nee to release as he pulls his cock out and cums all over Elye's fucked hole and just after he is finished Elye lets loose his built up load all over Cole. Enjoy!",
  "models": [
    {
      "name": "Elye Black",
      "person_id": 49220
    },
    {
      "name": "Cole Weston",
      "person_id": 52146
    }
  ],
  "release_date": "2018-10-28",
  "scene_id": 135301,
  "series": "AD - 350 - Cole Weston & Elye Black",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Deep Throat",
    "Duo",
    "Gay",
    "Muscular",
    "Produced & Directed by Dirk Yates",
    "Rimming",
    "Smooth",
    "Tattoos",
    "White Butt"
  ],
  "title": "Cole Weston & Elye Black"
}