{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "The fall season has arrived and for Justin Matthews and Spencer Laval, that means yet another boring get together for the holidays. Tired of all the glad handing and catching up, the two of them sneak off to a private spot in the woods to share a little private time with each other, but what they don't realize is that Markie More has spied them and followed to get in on the action. As Markie watches from behind some trees, he sees Spencer and Justin trade blow jobs, and he strokes himself hard as he watches. When Spencer tells Justin to fuck him, Justin can't believe Spencer is ready to finally take a dick, but just as he slides it into Spencer's hole, Spencer notices Markie watching from the woods. Markie makes his way over and asks if he can join, and Spencer nods at the thought of taking two dicks his first time. Without hesitation, Markie slides Justin over and assumes the position behind Spencer, slowly sliding his bareback cock deep into Spencer's virgin hole. Spencer moans as it enters and Markie begins to pick up the pace. In no time, Spencer is taking the dick like a champ as Markie and Justin take turns fucking him hard and raw. Spencer takes turn mounting both of them, just as Justin is ready to cum. He launches his load all over Spencer's ass as Spencer switches over to Markie. Markie fucks Spencer so hard he cums immediately, spraying his load as Markie continues to pound him from behind. Almost immediately Markie pulls out and blasts Spencer with the final nut of this holiday season, and the three of them laugh at their secret, but hurriedly get dressed to make it back in time for dessert.Enjoy!",
  "models": [
    {
      "name": "Justin Matthews",
      "person_id": 52245
    },
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Spencer Laval",
      "person_id": 51479
    }
  ],
  "release_date": "2018-11-22",
  "scene_id": 143840,
  "series": "NDB - 4927 - Justin Matthews, Markie More & Spencer Laval",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Muscles",
    "Climax",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Thankful Stuffing"
}