{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Fresh off a break up, Spencer Laval is looking to rent a room in his house to cover the sudden spike in cost, and even though he's not too keen on having a stranger live with him, he needs the money more than he needs the privacy. Enter Dante Martin. After looking the property over, Dante is confident he can not only rent the place, but he thinks he can make Spencer some money throwing a few parties on the grounds. But Dante is only in if Spencer is part of the deal. Spencer seems tempted, but confused, until Dante moves closer and grabs him by the hand. He tells him to relax, and Spencer suddenly realizes Dante's intentions. By then, Dante has already worked Spencer's dick into a semi-chub inside his pants, and he's working him out of his jeans to suck him off. Spencer's dick hasn't had much attention since his break up, and now it is showing out at the chance, as Dante downs it to the base. Spencer suddenly sees what a fortuitous predicament he's in, and as Dante climbs aboard and mounts his cock, Spencer realizes Dante's stipulation is actually and added benefit. Going with it, he fucks Dante whole-heartedly, pounding him from beneath as Dante rides to his contentment. By the time Dante tells him to bend over, Spencer is all in, and takes Dante's cock willingly, moaning as Dante fucks the cum out of him, and sealing the deal when Dante pulls out and soaks him with the biggest load he's every seen. Covered in cum and hopeful for the new partnership, the two of them laugh to future endeavors. Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Spencer Laval",
      "person_id": 51479
    }
  ],
  "release_date": "2018-12-08",
  "scene_id": 143942,
  "series": "NDR - 223 - Spencer Laval & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Deep throat",
    "Gay Porn",
    "Jerking off",
    "Muscular",
    "Oral",
    "Rimming"
  ],
  "title": "Rental Favors"
}