{
  "collections": [
    "Next Door Raw"
  ],
  "description": "With a few hours to kill until his date later that evening, Carter Woods and roomie Jackson Cooper chill on the couch. Jackson fixes Carter's collar and tells him he looks great. Carter is nervous and Jackson can tell, so he makes a move on Carter who backs away. Jackson tells him to relax and just enjoy it, as he makes his way down Carter's chest to his pants, unbuttoning them as he begins to work Carter's cock with his mouth. Carter's anxiety gives way to pleasure as Jackson shows his skill, gagging on Carter's rock hard cock as he strokes himself hard. They switch places and Carter proves he's no slouch either, but the real payoff for Jackson is when Carter plunges his raw cock deep inside Jackson's hole. Carter fucks him from behind as Jackson enjoys every moment. Carter's cock feels even better than Jackson fantasized, and Carter blows his mind when, midway through, he tells Jackson to try fucking him. He mounts Jackson's dick and gives him the kind of ride that suggests this isn't his first time with a guy. Jackson is sweating as Carter gets closer to cumming. They switch one more time and Carter is back to fucking Jackson again, who lay on his back with his legs spread as Carter fills him up and fucks the cum out of him. When Carter spills his load as well, the two of them are covered in jizz and sweat, and Jackson tells Carter he needs to get ready again for his date. 'What date?' Carter asks, kissing Jackson once again.Enjoy!",
  "models": [
    {
      "name": "Carter Woods",
      "person_id": 51510
    },
    {
      "name": "Jackson Cooper",
      "person_id": 38267
    }
  ],
  "release_date": "2018-12-19",
  "scene_id": 144052,
  "series": "NDR - 226 - Carter Woods & Jackson Cooper",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Date Mate"
}