{
  "collections": [
    "Active Duty"
  ],
  "description": "Once the introduction is over they are all in bed sprawled out stroking their cocks. As each one becomes harder Princeton Price decides it's time to begin the deep throating. He strokes his hard dick while sucking Kevin's throbbing cock. Kevin Texas has his mouth full with Laith Inkley's dick deep down his throat. Laith has it easy right now as he kicks back and gets serviced. Princeton is ready for more and since he is the leading vet in this room he wants to fuck Laith's ass first. Princeton pushes his thick dick deep into Laith's tight hairy ass making him squirm with delight. As Princeton thrusts deep into him it pushes him towards Kevin's cock and it slips right into Laith's wet mouth. He gets fucked deep and hard while gagging on hard dick. Kevin gets a turn at Laith before the next shift takes and he is more gentle at first than Princeton but soon enough he is pounding away at Laith's eager tight ass. Princeton wants to get his ass fucked so he takes places with Laith and now Kevin is fucking him fast and hard while his mouth is stuffed full of hard dick. Laith and Kevin both take turns on his ass, fucking him deep and hard making him moan with pleasure and a little pain. Finally, Laith pulls his dick out and blasts a huge warm load all over Princeton's back. Princeton can feel the warm cum and strokes his own cock until he shoots his load all over the sheets drenching them in warmness. Last but not least Kevin leaves his thick creamy load all over Princeton's back as well.",
  "models": [
    {
      "name": "Princeton Price",
      "person_id": 46796
    },
    {
      "name": "Laith Inkley",
      "person_id": 51106
    },
    {
      "name": "Kevin Texas",
      "person_id": 52182
    }
  ],
  "release_date": "2018-12-02",
  "scene_id": 144033,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Jerk Off",
    "Muscular",
    "Rough",
    "Smooth",
    "Tattoos",
    "Threesome"
  ],
  "title": "Laith Inkley, Kevin Texas & Princeton Price"
}