{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Alexander Kristov is cleaning up glassware in the green room at closing time when Drake Masters makes his move and starts rubbing down Alexander's tatted, hairy body in front of a group of guys. DJ Cristian Sam joins the mix and the onlookers slowly disband to let the three studs have their fun. When the room is cleared, Cristian drops to his knees to service both Drake and Alexander at the same time. Drake takes over the cock sucking duties and gets both hung muscle hunks hard before he bends Alexander over and shoves his dick deep into Alexander's ass. Drake pumps away as Alexander sucks Cristian's hard cock to get him ready for his turn inside. Cristian takes his cue and enters Alexander's stretched hole to have his way. He pounds relentlessly as Drake fucks Alexander's face from the front. Drake gets between the two studs to offer up his hole to be fucked. Cristian happily gives Drake what he wants and slips his meat deep into the horny stud's ass. All this fucking gets the three hunks ready to erupt at the same time. In the end, Alexander is hungry for cum and gets on the floor between Cristian and Drake. Cristian is the first to nut and covers Alexander's beard with cum. When Drake sees the mess that Cristian has made, he lets himself go and adds to the cum in Alexander's beard and mouth. With his taste for jizz satisfied, Alexander drops his load on the floor and stands up where all three studs share a cum-filled kiss.",
  "models": [
    {
      "name": "Drake Masters",
      "person_id": 52025
    },
    {
      "name": "Cristian Sam",
      "person_id": 57640
    },
    {
      "name": "Alexander Kristov",
      "person_id": 57641
    }
  ],
  "release_date": "2019-01-04",
  "scene_id": 144486,
  "series": "Hit It Then Quit It",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Tattoos",
    "butt play",
    "jockstraps",
    "rimming"
  ],
  "title": "Hit It Then Quit It, Scene #04"
}