{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Ryan Jordan comes home and finds a stranger in his home hallway cleaning, he has two competing reactions. The first is 'What the fuck is a stranger doing in my house?' The second is 'Why does this stranger have such a nice ass?'. Luckily for Ryan, Scott Finn notices Ryan checking him out, so after clarifying that Ryan's parents hired him to clean the house, Scott asks Ryan if he'd like a piece of what he was just staring at. Ryan tries to act coy, but Scott has his number, and Ryan is pegged. Moments later, he's carrying Scott into his bedroom to get a first hand taste of Scott's delicious ass. But when Ryan whips out his dick, Scott realizes he may have bitten off more than he can swallow. Ryan smiles as he gags Scott with his giant cock, and when he bends Scott over and inches it deep inside Scott's tight little hole, he hears Scott whimper and moan. Ryan fucks him hard from behind before flipping him over and spreading his legs wide. His cock stretches Scott's hole open as Scott strokes himself with every thrust. Having had his fill, Ryan tells Scott to fuck the cum out of him, and climbs on top of Scott's dick, sliding it inside as he leans back and gives it a ride. Ryan's dick his huge in Scott's hands as Scott gives him everything he's got. Ryan spits his load as Scott pulls out and flips him over, emptying himself all over Ryan's ass. Looks like there's a whole new mess for Scott to clean now. Enjoy!",
  "models": [
    {
      "name": "Scott Finn",
      "person_id": 50329
    },
    {
      "name": "Ryan Jordan",
      "person_id": 51208
    }
  ],
  "release_date": "2019-01-16",
  "scene_id": 144625,
  "series": "NDR - 234 - Ryan Jordan & Scott Finn",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Gay Porn",
    "Jerking off",
    "Kissing",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Clean Stalkin"
}