{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Sean Duran makes a revelation that will alter the course of Riley Mitchel's life forever in a dark, intense orgy featuring Riley, Sean, Dante Colle, and Riley's priest, Woody Fox. After a mysterious ritual, Riley bends over to accept his fate. Dante slips his cock inside the horny stud as Riley takes Woody in his mouth. Dante can't get enough of Riley's tight hole and keeps plugging away until the priest wants in. Woody takes over stretching Riley's ass as Dante moves on to let Sean suck his cock. All that dick in his mouth makes Sean ready to get fucked and he lies back to let Woody plug his hole. Woody pounds away on Sean's hole that leaves him begging for all the cock he can get in each one of his holes. Every stud is hard and ready to blow and the sight of Sean getting stuffed with dick is enough to push them all over the edge. With Woody still pumping in and out of Sean, Dante is the first to succumb. He dumps his creamy white load all over Sean's sweaty, muscled-up body. As he's finishing up, Woody fucks to the point of no return and pulls out to spray Sean's tight sack with his load. Sean needs fresh cream in his mouth and opens wide for Riley to deliver it right from the tap. Riley spills into Sean's mouth completing the circle, which gives Sean permission to blast onto his own ripped abs. The ritual is complete, and the outcome of 'The Night Riders' is revealed in this stunning conclusion.",
  "models": [
    {
      "name": "Dante Colle",
      "person_id": 51641
    },
    {
      "name": "Riley Mitchel",
      "person_id": 51578
    },
    {
      "name": "Sean Duran",
      "person_id": 36945
    },
    {
      "name": "Woody Fox",
      "person_id": 26552
    }
  ],
  "release_date": "2019-02-08",
  "scene_id": 144958,
  "series": "The Night Riders",
  "tags": [
    "Anal",
    "BD&SM",
    "Bodybuilder",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Tattoos",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "The Night Riders"
}