{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Ripped and tatted mechanic, Riley Mitchel, gets held up at gunpoint by robbers, Jason Vario and Colby Tucker. When Riley reveals there's no money in the shop, Colby pulls down Riley's pants and discovers that Riley really likes the thrill of being robbed. Colby's mouth begins to water, and he quickly gets on his knees to service Riley's thick curved cock as Jason pulls down his pants to get in on the action. Colby takes his cue and services both hung studs, choking and gagging as he takes both big members down his throat. When Riley can no longer take the anticipation of tasting what the burglars have to offer, he takes his turn on the floor sucking all the cock he can fit in his mouth. Riley wants more from the thugs and offers up his succulent hole for Colby to stuff with his big, raging hard-on. Colby pumps Riley from behind as Riley continues to satisfy his cravings for cock by slurping Jason's uncut meat down all the way to his full sack. After pounding Riley's ass, Colby wants to feel Riley's thick meat deep in him and lies on the floor with his legs spread wide. Riley pumps hard, getting himself to the brink before Jason steps up to take his turn. Riley wants his hole stretched by Jason's big cock too, so he lies back to take it. Jason fucks the cum out of Riley before he pulls out and finishes off at the same time as Colby shoots all over Riley's hungry face. Did Riley successfully avert a robbery or did he just create a whole new set of problems?",
  "models": [
    {
      "name": "Colby Tucker",
      "person_id": 57639
    },
    {
      "name": "Jason Vario",
      "person_id": 48591
    },
    {
      "name": "Riley Mitchel",
      "person_id": 51578
    }
  ],
  "release_date": "2019-01-18",
  "scene_id": 144954,
  "series": "The Night Riders",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Oral",
    "Tattoos",
    "masturbation"
  ],
  "title": "The Night Riders, Scene #01"
}