{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As he makes his way up the stairs to his apartment, Elye Black senses someone is following him. Hiding in a shaft, he pounces out on the guy following to confront his stalker, but he's quickly taken aback by the handsome stud in front of him. Turns out, Quentin Gainz has been following Elye since the gym, and was just too shy to say anything til now. Elye smiles and tells Quentin his apartment is upstairs, and that Quentin can just follow him all the way up. They smile and quickly make their way to Elye's bedroom, where shy Quentin comes out of his shell and suddenly takes control, telling Elye how he likes it as Elye sucks him off. He tells Elye to climb aboard and he spreads Elye's hole open before him, tonguing at it as Elye continues to suck him off. Rock hard and ready to fuck, he flips Elye around and lets him take a ride on Quentin's bareback cock. Elye grinds on Quentin as his cock smacks Quentin's stomach. He tells Quentin he wants a piece, and Quentin pulls out and bends over, clutching the bed rail as Elye slides his dick deep inside. He pounds Quentin from behind as Quentin takes every inch from the handsome stranger. Elye is ready to nut but he wants Quentin's nice cock inside him one more time before he does, so he rocks onto his back and spreads his legs wide for Quentin who gives him one last hard push as Elye loses his load all over himself. Quentin pulls out and empties his load, and Elye tells his new gym buddy that he sure is glad he followed him.Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    },
    {
      "name": "Elye Black",
      "person_id": 51047
    }
  ],
  "release_date": "2019-02-01",
  "scene_id": 144971,
  "series": " NDO - 4948 - Quentin Gainz & Elye Black",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Gym Stalker: On the Move"
}