{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Time has a way of changing things, and that's certainly the case for Justin Matthews, who finds himself in a pickle with his auto mechanic. Justin appears to be quite a bit short for the necessary work, but as fate would have it, the shop is run by none other than old high school classmate Carter Woods. Carter and Justin have some history, as Justin used to have a crush on Carter and he knew it. But now, as Carter's eyes what Justin has become, suddenly the tables are turned, and it's Carter who might want a taste. He asks Justin how open he is to creative financing, and Justin looks puzzled, but when Carter unzips his coveralls, Justin understands. He looks over at Carter's assistant, Steve Rickz, and the three of them agree this is the best solution, so Justin gets down on his knees and gives them a full-service lube job with his mouth, before bending over and letting Carter dip his stick deep inside his hole. Carter pounds Justin like a piston as Steve gags him from the other end. When Carter has had his fill, they rotate and assistant Steve gets his turn to ride the Justin express. Carter eyes Justin as he fills Steve with his rod, and decides before he nuts, he's gonna fulfill an old fantasy of his. He bends over and tells Justin to fuck the cum out of him. Justin, surprised, wastes no time. He plunges his cock deep inside his old high school crush and proceeds to pound him as Carter jizzes all over the pavement below. Justin's throbbing head swells as he gets closer and closer, finally pulling out and blasting Carter with his load, before shoving aside to let Steve finish off the job. Steve steps in and gives Carter one last load for good measure. The three of them laugh and Carter tells Justin to stop by and make another 'payment' next week.Enjoy!",
  "models": [
    {
      "name": "Carter Woods",
      "person_id": 51510
    },
    {
      "name": "Justin Matthews",
      "person_id": 52245
    },
    {
      "name": "Steve Rickz",
      "person_id": 57799
    }
  ],
  "release_date": "2019-02-02",
  "scene_id": 144972,
  "series": "NDR - 239 - Justin Matthews, Steve Rickz & Carter Woods",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Deep throat",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Greasy Tune Up"
}