{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Home visiting for a couple of days, Dante Martin is very intrigued by the young hire his father has brought on to take care of the house. Hoss Kado seems trustable, but it's not like Dante's father to bring someone in like this without really knowing him. But what really intrigues him about Hoss is the fact that he's giving off a serious flirty vibe to Dante, and so when Dante finds out Hoss hasn't befriended anyone in town, he asks if he wants to hang. Hoss accepts, and exactly one movie later, the two of them are in Dante's room getting to know each other a lot more in depth. Dante takes control, making his way down Hoss' body and taking his cock into his mouth. Hoss gasps as he does it, spreading his legs wide for Dante, who takes it in his mouth and gags on it to the base. He slides up and kisses Hoss, flipping over as the 69 each other before Dante climbs on top and mounts Hoss, riding him reverse as he leans back and spreads his legs. Hoss fills him up with his hard cock as Dante strokes himself rock hard. Having had his fill, he slides off and spreads Hoss' legs, inching his meaty dick inside Hoss' hole and proceeding to give him the pounding he's been missing. Hoss moans as Dante pile drives him before flipping him over onto his stomach. He thrusts his cock deep inside Hoss and fucks him even harder from behind as Hoss gushes his load onto the floor. Dante pulls out and blasts Hoss' hole with a huge splash of warm cum, and the two of them exhale in a sweaty mess as they head to the showers for round 2. Enjoy!  ",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Hoss Kado",
      "person_id": 57745
    }
  ],
  "release_date": "2019-02-09",
  "scene_id": 145044,
  "series": "NDR - 241 - Hoss Kado & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Deep throat",
    "Gay Porn",
    "Hardcore",
    "Kissing",
    "Oral"
  ],
  "title": "Privileged Pounding"
}