{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As they spy on their neighbor, Jaydon Jensen, Markie More and roomie Zachary Country launch a plan for little get together. Jaydon seems apprehensive at first, but Markie and Zachary quickly show him just how welcoming a neighborhood this can be, and Jaydon soon feels relaxed enough to take his hosts up on their hospitality. That's all the invite that they need, and Markie and Zachary quickly work Jaydon out of his clothes as they take turns sucking him off. Jaydon closes his eyes and inhales as Markie tongues at his balls while Zachary works the shaft, and once he's feeling more comfortable, Jaydon returns the favor, taking both of them in his mouth at the same time. Markie is first up to test drive the new neighbor's equipment, as Jaydon bends him over and plunges his cock deep into Markie's hole. He fucks him from behind while Zachary looks on longingly with envy. That envy quickly consumes him, and Zachary tells Markie he wants a taste, so Jaydon lets Zachary ride him for a while. Jaydon has his fill of Zachary's ass and then passes him off to Markie, who fucks the cum out of him while Jaydon shoots his load into Zachary's face. Markie pulls out and blasts Zachary's ass with is load and with that, this neighborhood cum party comes to a close. But there's always tomorrow...",
  "models": [
    {
      "name": "Jaydon Jensen",
      "person_id": 57928
    },
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Zachary Country",
      "person_id": 57927
    }
  ],
  "release_date": "2019-02-21",
  "scene_id": 145352,
  "series": "NDB - 4953 - Jaydon Jensen, Markie More & Zachary Country",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bald",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Muscular",
    "Smooth",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Good Neighbors"
}