{
  "collections": [
    "Falcon Studios"
  ],
  "description": "On the night of the Final hazing ceremony at the fraternity, 'The Pledge' has been made. Whoever gets through the ceremony will be initiated into the brotherhood. The ceremony starts after Devin Franco reveals the ultimate betrayal from one of the brothers that puts Trevor Miller into a submissive position. The rest of the fraternity goes along with the turn of events, and soon the group is naked and going wild with blowjobs shared all around the room. As the initiation continues, the cock sucking quickly turns into rimming and bareback fucking. Devin is the first to make his move and rams his dick deep into Trevor's ass. The entire brotherhood lines up to teach Trevor a well-deserved lesson and every single dick in the room ends up in one of Trevor's holes. After Devin has his way, Colton gets to have his turn on Trevor's hole as Zak Bishop jumps in to suck more cock. Brandon Wilde is up next and jumps in to get his dick wet before surrendering to Nic Sahara's desires to be the next in line. After all five frat studs have their way inside Trevor's tight body, the guys are ready to finish the hazing. Colton is the first to blow his load all over Trevor's face and chest. One-by-one, each of the guys cover Trevor with jizz as Devin keeps pounding a raw rhythm to his ass. After all the guys blow their loads, Devin pulls out to deliver the last shot, leaving Trevor dripping with cum. After the humiliating power play by Devin, will Trevor be allowed to stay in the fraternity, or will the renewed bonding of a frat orgy be enough to save his position in the brotherhood?",
  "models": [
    {
      "name": "Colton Reece",
      "person_id": 58015
    },
    {
      "name": "Devin Franco",
      "person_id": 52211
    },
    {
      "name": "Nic Sahara",
      "person_id": 57867
    },
    {
      "name": "Trevor Miller",
      "person_id": 58016
    },
    {
      "name": "Zak Bishop",
      "person_id": 58014
    }
  ],
  "release_date": "2019-04-05",
  "scene_id": 145572,
  "series": "The Pledge",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Double Oral",
    "Foreskin",
    "Group Sex",
    "Kissing"
  ],
  "title": "The Pledge"
}