{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Ricky Larkin and Jaxx Thanatos are out on a construction site with new hunk, Kurtis Wolfe. Ricky and Jaxx like what they see and surround Kurtis to properly welcome him to the work site. Jaxx gets Kurtis down on the workbench as Ricky pulls down his pants and shoves his hard cock into Kurtis' face. Kurtis is hesitant at first, but soon warms up and realizes he loves getting his body used by his two hunky co-workers. Jaxx wants in on the action and peels off his clothes to get behind Kurtis. Jaxx opens Kurtis' cheeks and plants his tongue as Kurtis keeps sucking Ricky's hard cock. After Jaxx gets Kurtis opened up, Ricky decides to take the next step and shove his raw dick into Kurtis' hairy ass. Jaxx and Ricky switch sides with Jaxx up front as the studs spit-roast Kurtis. Seeing Kurtis getting plowed from behind makes Jaxx eager for cock himself and bends over to let Kurtis fuck his hole. Kurtis isn't done getting fucked yet, though. He still wants Ricky inside of him and the three form a fuck-chain with Kurtis in the middle. Kurtis can't get enough dick and lies back on the bench to let his new co-workers take turns tag-teaming his hole. Kurtis loves the feeling of the studs plowing in and out of his ass and cums hard as Ricky blows his load in deep Kurtis' ass. The sight of Ricky's jizz leaking out of Kurtis makes Jaxx ready to blow and he sticks his dick into the gooey mess to finish himself off leaving Kurtis filled with two massive loads of cum.",
  "models": [
    {
      "name": "Jaxx Thanatos",
      "person_id": 57975
    },
    {
      "name": "Kurtis Wolfe",
      "person_id": 50440
    },
    {
      "name": "Ricky Larkin",
      "person_id": 20748
    }
  ],
  "release_date": "2019-02-15",
  "scene_id": 145500,
  "series": "Raw Construction",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Tattoos",
    "Uniforms",
    "jockstraps",
    "rimming"
  ],
  "title": "Raw Construction"
}