{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When Dalton Riley is confronted with the guy his boyfriend has been cheating with, he's not exactly heartbroken. In fact, he can almost understand why his boyfriend would jump at the chance to sack such a hot prospect. Now that he's met Quin, he likes what he sees from head to toe, and seeing as how he's got a little payback coming to him, he hopes to see a lot more of Quin in the immediate future. Quin is DTF and ready to oblige, so Dalton leads him inside. Once there, Dalton tells Quin he wants to see what the big deal is, so Quin unfurls his meaty cock and gives him a closer look. Dalton approves and takes it in his mouth, devouring it hungrily as he works Quin's balls with his tongue. He strokes himself as he sucks Quin off, then flips him around and feeds him his cock, gagging Quin with his dick as he chokes him and slaps his chest. Quin is rock hard and ready to fuck, so  Dalton climbs onto the bed and gets on all fours as Quin tongue fucks his hole. Dalton squirms as Quin gets his hole nice and wet, then he slides his raw cock into Dalton. Dalton moans as Quin works up a sweat, pounding Dalton from behind. But Dalton isn't letting him get off that easy, so midway through, he tells Quin to mount him. Quin hops on and takes Dalton's cock for a bareback ride, his hard dick slapping him in the stomach as Dalton thrusts deep inside of him. Dalton is close to cumming but he wants Quin to work for it, so they switch one more time and Quin fucks Dalton hard and fast as Dalton spits his load onto his chest. Quin pulls out and douses him with jizz, rubbing the head of his cock in the puddles on Dalton's stomach as the two of them agree that maybe it was all for the best after all.Enjoy!",
  "models": [
    {
      "name": "Dalton Riley",
      "person_id": 48651
    },
    {
      "name": "Quin Quire",
      "person_id": 52165
    }
  ],
  "release_date": "2019-03-23",
  "scene_id": 145986,
  "tags": [
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "Feet",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Cheating Hard"
}