{
  "collections": [
    "Falcon Studios"
  ],
  "description": "When the airlines abruptly cancel Pierce Paris and Jay Dymel's flights, the two are asked to share a hotel room together for the night. After they get settled, Pierce goes thru Jay's bag seeking body wash when a massive manrammer falls out. Pierce quickly wraps the toy back up and hops in the shower before Jay notices. Pierce comes out of the shower and sees Jay rubbing lotion on his hard body in the mirror. Jay asks Pierce to rub some lotion on his back, and Pierce nervously agrees. When Jay is all moisturized, he turns to Pierce and says 'my turn', and grabs a handful of Pierce's meat. The two lock lips and Jay quickly sinks to his knees to gulp down his new roommates swollen cock. Pierce is relentless with his rod and grabs the back of Jay's head to push it to the base. Continuing to assert his dominance, Pierce yanks Jay from the floor, throws him onto the bed and rips his underwear off. With Jay's inviting hole in his face, Pierce dives in and works his tongue in and out of Jay's warm crack. Now that Jay is wet and slicked up, Pierce slides his massive, 9-inch dick into Jay and pounds him deep. Unforgiving with each thrust, Jay can't get enough of Pierce slamming his ass bareback. Pierce wants one more go at Jay's mouth and face fucks the blond stud one more time, but Jay really wants Pierce inside his ass again. Pierce gives Jay a series of powerful pumps and pulls out to coat the studs hole with a fresh load. To finish Jay off, Pierce shoves his bare cock back in and fucks the hunk while Jay beats thick ropes of jizz out of his own swollen cock and onto his abs.  ",
  "models": [
    {
      "name": "Jay Dymel",
      "person_id": 58302
    },
    {
      "name": "Pierce Paris",
      "person_id": 49714
    }
  ],
  "release_date": "2019-04-12",
  "scene_id": 146348,
  "series": "Room 106",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Bodybuilder",
    "Foreskin",
    "Underwear"
  ],
  "title": "Room 106"
}