{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Roman Todd and Nic Sahara are getting back late to their room after a long day working. Exhausted and drained, Roman decides to hop in the shower to recharge, tossing his underwear to the other side of the room. Nic quickly snatches them up to inhale Roman's all-day man-scent. In middle of the night, Nic takes out Roman's dirty underwear and begins to rub his hard cock while deeply inhaling Roman's scent. Roman wakes up and catches Nic beating off. Sensing that he can get Nic to help him with his own cum-filled balls, Roman tells Nic a story of how he let a guy suck his dick. Interested and sheets tented, Roman invites Nic to his bed to swallow his cock. Nic's loving every inch of the initiation and takes Roman's thick dick down his throat and to the balls. After Nic is done deepthroating Roman's cock, he feeds his meat to Roman's face. Making sure he doesn't miss out, Roman slurps down Nic's uncut cock. For a hot 69, Nic gets on top of Roman, and sucks Roman's dick again while Roman rims Nic. It's not long before Nic's hole is ready, and he's bending over the bed to take his co-workers thick, bareback cock. Roman eases into Nic and quickly starts pounding the stud doggy-style. After Nic has had his ass slammed by Roman, they go for an intense flip-fuck, with Nic plowing into Roman and drilling the tatted hunk with his uncut, bare rod. They switch it up one last time with Roman pounding Nic to finish him off. Seeing Nic stroke a load out onto his abs sends Roman over the edge, so he pulls out and adds his own load to the mix, leaving Nic a wet, sticky mess. Roman slides his spent cock back into Nic's hole one last time and says, 'you need to give me my underwear back.'",
  "models": [
    {
      "name": "Nic Sahara",
      "person_id": 57867
    },
    {
      "name": "Roman Todd",
      "person_id": 49820
    }
  ],
  "release_date": "2019-04-19",
  "scene_id": 146350,
  "series": "Room 106",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Bodybuilder",
    "Kissing",
    "Masturbation",
    "Underwear",
    "Uniforms"
  ],
  "title": "Room 106, Scene #03"
}