{
  "collections": [
    "Active Duty"
  ],
  "description": "They both kick back on the bed and slowly take their clothes off. They slowly stroke their cocks until Princeton sees that Leeroy Jones is rock hard and soon enough he has his mouth wrapped around that big hard cock sucking every inch Leeroy has to offer. Leeroy is loving the feel of a Man's warm mouth wrapped around his throbbing dick. Princeton Price doesn't stop there as he pulls Leeroy to the edge of the bed and spreads his legs wide revealing his hairy hole. Princeton Price goes deep with his tongue licking and kissing his tasty ass. Leeroy can barely take the sensation as he squirms with delight amid the enjoyment of his ass being rimmed. Leeroy has had enough and is ready to fuck Princeton in his sexy ass. He bends him over and slowly pushes his big dick into him until his balls rest up against him. He starts to thrust slowly pushing every inch back into Princeton making him moan with pain and pleasure. Leeroy begins to fuck harder and faster as that ass slowly relaxes and opens up for him. Leeroy flips him onto his back pushing even deeper into him and slowly fucking him so he can feel his hard cock throb inside of him. Princeton continues to stroke his cock while he's being fucked until Leeroy pulls out his raw cock and strokes his nut out all over Princeton's cock. Princeton who is beating off furiously feels the warm cum land on his cock and then he begins spraying his warm load all over the place. Princeton Price is one cum soaked soldier and loving every second of it.",
  "models": [
    {
      "name": "LeeRoy Jones",
      "person_id": 57444
    },
    {
      "name": "Princeton Price",
      "person_id": 46796
    }
  ],
  "release_date": "2019-04-21",
  "scene_id": 146643,
  "series": "AD - 400 - Leeroy Jones & Princeton Price",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Jerk Off",
    "Rimming",
    "Tattoos"
  ],
  "title": "Leeroy Jones & Princeton Price"
}