{
  "collections": [
    "Raging Stallion"
  ],
  "description": "When Ricky Larkin faces death, he has a vision of an old friend, Dillon Diaz. Dillon isn't in the realm of the living anymore and now Ricky has a chance to fuck him one last time. 'Get up!' Dillon keeps coaxing to the living Ricky, but ethereal Ricky wants Dillon to himself. Dillon knows that time is tight so he cuts to the chase and sucks Ricky's hard cock. Dillon can sense that Ricky is ready to fuck and hops on the detective's dick to ride it. As Dillon is getting fucked by Ricky, Logan Moore appears to Dillon and shoves him off Ricky to take his rightful place on Ricky's giant cock. There's a tension between Dillon and Logan but the studs work through it to get all the pleasure they can. Logan bends over to take Ricky's dick up his ass as he sucks Dillon's cock. Logan loves the feeling of all the dick he can get and rolls over onto his back to take Ricky even deeper. As Dillon tries to get Ricky to wake up to the land of the living, he relents and bends over to let Ricky fuck his tight hole one last time. With Ricky pounding his ass, Dillon lets loose and dumps his load. The sight of Dillon's jizz is all it takes for Logan to give himself permission to do the same. Ricky is the center of attention now!  As he jacks his massive cock, he's torn between kissing Logan and Dillon. Will kissing Logan keep him from living? If he chooses Dillon is he choosing life? Just as he's ready to cum, Ricky faces a tough decision. Will he stay with Dillon and Logan for eternal bliss in death, or will he live and wrap up the case that could haunt him even on the other side of life?",
  "models": [
    {
      "name": "Dillon Diaz",
      "person_id": 57786
    },
    {
      "name": "Logan Moore",
      "person_id": 37048
    },
    {
      "name": "Ricky Larkin",
      "person_id": 20748
    }
  ],
  "release_date": "2019-05-24",
  "scene_id": 146862,
  "series": "At Large",
  "tags": [
    "Anal",
    "Boots",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Oral",
    "african american",
    "cum shots",
    "jockstraps"
  ],
  "title": "At Large"
}