{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Alessio Vega has come to the Doctors to get examined as he has some personal concerns. He tells Dr. Aaron Trainer that he recently went to an orgy and got fucked by several guys, but he seems to not have the same feeling as he once did in his ass. He also tells the Dr. that prior to the orgy he had sex with a guy with a huge cock and he was able to feel that just fine. Dr. Trainer starts out the exam with the normal listening of the heart and lungs. He then asks Alessio to remove his pants and he performs a Hernia test and testicle exam. Noting nothing unusual, he has Alessio bend over for a Prostate exam and he inserts his gloved finger up into Alessio's ass. After some probing it is apparent that Dr. Trainer is getting aroused as his engorged cock, still inside his pants, brushes up against Alessio's leg and thigh during the exam. Alessio notices it and looks back and asks the Dr. what is going on. He turns around and is excited to see that Dr. Trainer has a huge cock in his pants which he gladly pulls out and allows Alessio to suck. Alessio takes not time in taking all of Dr. Trainer's massive cock down his throat. He is then bent over the exam table and Dr. Trainer rims his ass deep with his tongue before lubbing it up and inserting his massive cock deep inside Alessio's eager ass. With each thrust it is apparent that Alessio is feeling every inch of Dr. Trainer. As the Dr. pulls his cock all the way out, Alessio's ass acts like a snake devouring pray as he uses his sphincter muscle to take in every inch of Dr. Trainer's cock. He then flips on his back and Dr. Trainer continues to fuck him deeper and harder until Alessio's cock starts oozing cum and then shoots all over his chest and abdomen. Dr. Trainer pulls out and sucks Alessio's spent cock until he shoots his load all over Alessio's ass and then shoves it deep back inside.",
  "models": [
    {
      "name": "Aaron Trainer",
      "person_id": 57981
    },
    {
      "name": "Alessio Vega",
      "person_id": 58307
    }
  ],
  "release_date": "2019-05-30",
  "scene_id": 147188,
  "series": "EBD - 684 - Alessio Vega & Aaron Trainor",
  "tags": [],
  "title": "How's My Prostate Doc?"
}