{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Roman Todd gives buddy/secret crush Ryan Jordan a much needed massage, he looks for any sign that Ryan might be into more than just a simple rub down. Sure enough, Ryan's dick responds to Roman's caresses, and when he flips over, it's bursting out of his underwear. Ryan's never responded to a guy's touch like this, but Roman tells to just go with it. He does, and before he knows it, Roman is swallowing his cock whole, fulfilling his fantasy and opening Ryan up to a whole new world of his own. Ryan returns the favor and Roman is rock hard instantly, but he's got his mind on more than Ryan's mouth. He tongues Ryan's hole before bending him over and inching his cock deep inside Ryan's hole. Ryan takes it in slowly at first, as Roman inches it in. He looks over his shoulder and tells Roman to fuck him harder, and Roman smiles from ear to ear. He sinks his dick even deeper into Ryan and begins to pound. Ryan's dick gets hard and Roman decides he can't hold out any longer. He's been waiting so long to see what Ryan's big meaty dick would do to him, and he finally has his chance. He tells Ryan to sit up and then he mounts Ryan's hard on, grinding it as Ryan fills up his hole. Ryan realizes he could really get into this, and he flips Roman onto his back, fucking him harder until Roman spits his load all over his stomach. Ryan inches closer and closer to cumming himself, pulling out and blasting Roman's with his seed... a first load between bros, but hopefully not the last.Enjoy!",
  "models": [
    {
      "name": "Roman Todd",
      "person_id": 46827
    },
    {
      "name": "Ryan Jordan",
      "person_id": 51208
    }
  ],
  "release_date": "2019-06-06",
  "scene_id": 147335,
  "series": "NDB - 4983 - Roman Todd & Ryan Jordan",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Blonde",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Rising Signs"
}