{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Fellow mechanics Drake Masters and Manuel Scalco are outside on a break as Manuel goes down on Drake's big cock. He continues sucking the monster until Jacen Zhu pulls up in his car for a repair. The mechanics quickly scramble to put their dicks away and zip up as they go to check out what fixes need to be done. Jacen has a debt from the last repair and offers to work it off as he reaches down to cop a feel of Drake's giant bulge. Drake and Manuel happily agree to the debt repayment plan and get Jacen naked next to his car. Both blue-collar studs get down on their knees to service their customer, and the three hung hunks switch it up until everyone gets their fill of all the dick they can swallow. Manuel and Drake do such a good job that soon Jacen is ready to stuff his dick into whatever hole is closest. Drake is busy sucking Manuel with his ass in the air and Jacen steps up to fill it with cock. He pounds Drake hard until Manuel wants a go, and the two studs change places with Jacen getting serviced from the front and Manuel fucking from behind. When Jacen sees how talented Manuel is with his dick, he wants a turn and hops on to ride Manuel in his car. As he bounces up and down, Drake lets loose and drains his balls all over the two studs fucking in front of him. Jacen traces right behind Drake and covers Manuel with jizz before Manuel pulls out of Jace's ass and slathers himself with a load of his own.",
  "models": [
    {
      "name": "Drake Masters",
      "person_id": 52025
    },
    {
      "name": "Jacen Zhu",
      "person_id": 58543
    },
    {
      "name": "Manuel Scalco",
      "person_id": 58544
    }
  ],
  "release_date": "2019-06-07",
  "scene_id": 147447,
  "series": "Haulin' Ass",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Oral",
    "Outdoor Sex",
    "butt play",
    "jockstraps"
  ],
  "title": "Haulin' Ass, Scene #02"
}