{
  "collections": [
    "Falcon Studios"
  ],
  "description": "College pledge Brandon Wilde sits down for his initial fraternity interview with Trevor Miller and Tyson Rush. Trevor makes it clear that joining means always helping a fellow brother out no matter what. To make his point, Trevor instructs Tyson to pull out his dick before ordering Brandon to prove his worth by helping his future frat brother with a blowjob. Brandon wants to show that he's loyal and opens his mouth wide to take Tyson thick meat down his throat. As Brandon gags on Tyson's throbbing cock, Trevor gets naked and commands Brandon over to suck his cock as well. The pledge is eager to please, so Brandon gets between Trevor's legs and does as he's told. After getting his future brothers hard and ready to fuck, Brandon bends over for Tyson to enter his ass. Tyson doesn't waste any time and shoves his long, raw cock deep into the pledge's hole. He pumps away at Brandon's ass until Trevor takes his place behind the college freshman to do the same. Brandon's ass feels amazing and soon Trevor's cock is ready to explode. Trevor pulls out and blasts his load all over Brandon's freshly fucked hole before getting down and eating his cum from Brandon's ass. Seeing Trevor eating his own load is all it takes for Tyson to erupt with his own thick ropes of cum into Brandon's mouth. Loaded up in both holes, Brandon lets loose on the floor as Trevor and Tyson leave to decide Brandon's fate. Did the pledge prove his worth to the fraternity?",
  "models": [
    {
      "name": "Brandon Wilde",
      "person_id": 58575
    },
    {
      "name": "Trevor Miller",
      "person_id": 58580
    },
    {
      "name": "Tyson Rush",
      "person_id": 58577
    }
  ],
  "release_date": "2019-06-05",
  "scene_id": 147512,
  "series": "The Pledge",
  "tags": [
    "Anal",
    "Bareback",
    "Big Dick",
    "GroupSex / Orgies",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "The Pledge"
}