{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Nico Santino and Taye Scott take turns sucking on Zario Travezz' nice plump cock. Neither stud can get enough dick in their faces, and they don't stop until Zario is ready for more. Zario wants to eat ass and bends Nico over to get his fill. Nico is more than willing and takes Taye's massive meat down his throat as Zario continues rimming the ass in front of him. Nico is practically begging for a raw dick up his hole and Zario is happy to help the stud out. Zario stands up and slowly slides his dick deep into the eager stud, going balls deep and bareback until Nico has what he wants. Nico takes Zario in his ass as Taye continues fucking Nico's face from the front. Now Nico wants a turn fucking and rolls Taye onto his back for a good look at the stud he's about to destroy. Nico slams his dick into Taye's hole and pumps away as Zario hops on to shove his cock and ass in Taye's hungry face. Now it's Nico's turn for a final bit of action as he hops on top of Taye with his ass in the air. Zario brings up the rear and alternates slamming both studs with his massive raw cock until he blasts his load all over Taye's used up hole. When Nico sees Zario let loose, he dumps his load all over Taye's face. With both holes filled with jizz, Taye is the last to blast and oozes a massive load all over his cock. The three studs kiss and moan as they bask in the aftermath of an amazing jizz-filled threesome.",
  "models": [
    {
      "name": "Nico Santino",
      "person_id": 58722
    },
    {
      "name": "Taye Scott",
      "person_id": 58723
    },
    {
      "name": "Zario Travezz",
      "person_id": 58399
    }
  ],
  "release_date": "2019-07-31",
  "scene_id": 148014,
  "series": "Hot, Raw and Ready!",
  "tags": [
    "Anal",
    "Foreskin",
    "GroupSex / Orgies",
    "Interracial",
    "Oral",
    "Tattoos",
    "african american",
    "butt play",
    "latinos",
    "rimming"
  ],
  "title": "Hot, Raw and Ready!, Scene #06"
}