{
  "collections": [
    "Men Over 30"
  ],
  "description": "Jaxx Thanatos is in the backroom and he is ready for some much needed alpha male fucking. Wearing only his jock strap both Cesar Rossi and Julian Torres arrive and both are equally revved up for some man-on-man hot sex. After sizing each other up, Cesar goes right for Jaxx's amazing big ass and starts rimming him. Jaxx takes in Julian's man scent and then starts sucking his cock while getting his ass worked over by Cesar's tongue. Jaxx then turns around and starts sucking Cesar while Julian rims his ass. Jaxx then tuns back around and Cesar drives his hard uncut cock deep in Jaxx's muscled ass. As Cesar fucks him deep and hard, Jaxx continues to suck Julian's cock.  Julian then wants a turn and Jaxx gives his ass to him and Julian fucks him deep and hard while Jaxx sucks Cesar's cock.  Cesar then wants to have some action on his ass and he climbs on the fucks bench where Jaxx rims his ass while Cesar sucks Julian.  Jaxx then fucks Cesar deep and hard while Cesar eagerly sucks Julian. Julian then takes his turn on Cesar's ass and he fucks him deeper and harder. Julian then lies on his back and Jaxx rims his hairy ass as he sucks Cesar's cock.  Jaxx then fucks Julian's hairy hole deep and hard. Cesar then takes the final turn and fucks Julian until he cannot hold back any longer and Julian shoots his load all over his hairy stomach. Cesar pulls out and shoots a huge load all over Julian's hairy torso and then Jaxx shoots his load onto Julian's hairy chest. Julian then sucks the last drops out of Jaxx's cock and all three are spent from an amazing flip-fucking alpha male session.",
  "models": [
    {
      "name": "Cesar Rossi",
      "person_id": 48499
    },
    {
      "name": "Jaxx Thanatos",
      "person_id": 53233
    },
    {
      "name": "Julian Torres",
      "person_id": 58182
    }
  ],
  "release_date": "2019-07-19",
  "scene_id": 148386,
  "series": "MOT - 696 - Cesar Rossi, Jaxx Thanatos & Julian Torres",
  "tags": [],
  "title": "Fucking Alpha Style"
}