{
  "collections": [
    "Falcon Studios"
  ],
  "description": "As the doctor leaves for the day, he sternly instructs his assistants Adam Bryant and Jacob Peterson to clean up the examination rooms and get the office ready for tomorrow. When the door closes behind the doctor, Adam and Jacob look at each other mischievously. They know they'll be reprimanded if they don't do their job, but the temptation of the empty office is too much to resist. Without a word, they make their decision: screw work! They want to fuck! Slamming their faces together, they kiss passionately while stripping off their scrubs. Jacob inhales Adam's fat cock all the way down to the base. Adam slaps Jacob's ass and shoves his tongue deep into Jacob's crack. With his boner throbbing, Adam gets Jacob spit-lubed and ready for an internal examination. Sliding his dick into Jacob's tight hole, Adam commences an intense doggy style pounding. Bracing himself against the wall, Jacob savors every second that Adam's cock is inside him, stretching out his hole and massaging his prostate. Adam lies flat on the exam table and Jacob jumps up to go on a ride. Grinding his hips, Jacob uses his ass to milk Adam's cock while jerking himself off. Jacob's hot, white load gushes from his uncut cock while Adam is still inside him. Dismounting from Adam's cock, Jacob sucks on Adam's balls, watching intently as Adam's cock swells and throbs. With giant spurts, Adam shoots his load onto his chest, and Jacob laps it up, savoring the taste on his tongue. Damn the consequences; it was worth it!",
  "models": [
    {
      "name": "Adam Bryant",
      "person_id": 37897
    },
    {
      "name": "Jacob Peterson",
      "person_id": 37703
    }
  ],
  "release_date": "2019-07-29",
  "scene_id": 148786,
  "series": "Internal Specialists",
  "tags": [
    "Anal",
    "Big Dick",
    "Bodybuilder",
    "Foreskin",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "Internal Specialists"
}