{
  "collections": [
    "Club Inferno Dungeon"
  ],
  "description": "Officer Brian Bonds brings in Josh Mikael for masturbating in the park and indecent exposure. Brian asks his sarge, Dale Savage what they should do with the habitual offender. They agree to 'handle it', and the cop's strip down to get their cocks sucked by Josh. Cuffed and on his knees, Josh does as his told and gags on both of the officers' thick members. Brian wants a taste of cock himself and joins Josh on his knees to gulp down Dale's fat cock. Now Dale wants some meat down his throat so he sinks down to devour Brian's cock down to the balls. Brian sits back on the desk to let Josh bend over to suck his cock while he takes Dale's fist from behind. Dale alternates each fist in and out of Josh's hairy hole while he keeps his mouth full with Brian's rod. Dale and Brian switch spots and now Brian is doing everything he can to stretch Josh's ass to its absolute limits. With Dale's cock down his throat, and Brian's hand up his ass, Josh enjoys being spit-roasted by the cops. Taking it up a few notches, Brian and Dale get behind Josh to take turns alternating their fists into his ass. The cops test Josh's limits when they each work one of their fists into his ass together, before punching him out vigorously. Josh switches on his back to continue letting his hole take a brutal beating from the fists. Josh grabs ahold of his cock and stokes it while Brian keeps his hand planted firmly in his hole until he shoots his jizz all over himself. ",
  "models": [
    {
      "name": "Brian Bonds",
      "person_id": 18505
    },
    {
      "name": "Dale Savage",
      "person_id": 58368
    },
    {
      "name": "Josh Mikael",
      "person_id": 58785
    }
  ],
  "release_date": "2019-09-05",
  "scene_id": 148804,
  "series": "FFPD - Fist Fuck Police Department",
  "tags": [
    "Big Cock",
    "Buttplay",
    "Cumshot",
    "Fisting",
    "Group Sex",
    "Hairy",
    "Kissing",
    "Male Masturbation",
    "Oral Sex",
    "Tattoos"
  ],
  "title": "FFPD - Fist Fuck Police Department"
}