{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Devin Franco gets lost sightseeing in London when he meets the gaze of a friendly Priest named Jonathan Miranda. Devin nervously asks for directions and Jonathan leads him inside the church. Jonathan guides him up the old stone stairs to the roof where Devin bends over the ledge to check out the sights. Enticed by what he sees in front of him, Jonathan starts rubbing his growing cock through his black robes. Devin continues admiring the sights, oblivious to the Priest's subtle advances. Jonathan wants attention turned to him and whips out his hard cock to start jacking it out in the open. Devin finally notices the horny Priest and drops to his knees to profess his sins. Devin works Jonathan's holy pole in and out of his mouth until Jonathan leads them to another room where they can have some privacy and take it to the next level. Jonathan moves quickly and bends Devin over a table to slide his throbbing cock deep into the begging tourist. Jonathan's hips slowly grind at Devin's ass as Jonathan works his way deeper into Devin's hole doggie style. Jonathan keeps up the relentless pounding on Devin's tight ass until Devin flips the script and gets the priest on his knees to take some dick up his ass. Delivering a spiritual flip-flop moment, Devin drills Jonathan doggie. The Priest is in sexual heaven, but he isn't done with Devin yet. As any good priest would do, Jonathan, goes for missionary position, sliding his dick back in Devin's ass one last time until he pushes Devin over the edge. Devin let's out a gusher and Jonathan takes himself to the point of no return, pulling out and shooting his holy seed all over Devin's spent and panting body",
  "models": [
    {
      "name": "Devin Franco",
      "person_id": 52211
    },
    {
      "name": "Jonathan Miranda",
      "person_id": 58900
    }
  ],
  "release_date": "2019-08-09",
  "scene_id": 149277,
  "series": "London Calling",
  "tags": [
    "Anal Sex",
    "Kissing",
    "Outdoor Sex",
    "Uniforms"
  ],
  "title": "London Calling, Scene #03"
}