{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Bat boy, Sharok, is cleaning up the locker room when players Ricky Larkin and Wade Wolfgar enter from the showers after losing a game. They pick on Sharok for being their bat boy but Sharok knows that they really need to blow off some steam after their loss. Sharok gets on his knees and opens his mouth wide for Ricky and Wade to take turns fucking his eager face. Sharok gets the guys rock hard and bends over to let them get a taste of his hairy hole. Wade is the first to suck on Sharok's hairy crack and gets him nice and opened up for his buddy, Ricky, to fill up with his big raw bat. Ricky slides inside and pounds away as Wade fills Sharok's face with his thick cock. Wade wants his bareback turn now inside Sharok's dugout and takes up the rear with his fat bat. It's almost too big to fit in Sharok's hole but Sharok is determined to take it balls deep and rolls onto his back with his legs in the air. Wade stretches the hole in front of him as Ricky fucks Sharok's face. The guys take turns railing both of Sharok's holes from each end until Wade wants his turn as the catcher. As a last-minute pinch-hitter, Wade goes from pitcher to catcher and lies back to let Ricky pound his ass. Ricky plunges Wade's open hole until he pulls out and sprays Wade's hairy balls with thick jizz. Next up, Sharok steps off deck and up to the plate to fuck Wade until both spent studs blast all over Wade's furry body.",
  "models": [
    {
      "name": "Ricky Larkin",
      "person_id": 20748
    },
    {
      "name": "Sharok",
      "person_id": 57974
    },
    {
      "name": "Wade Wolfgar",
      "person_id": 61373
    }
  ],
  "release_date": "2019-09-06",
  "scene_id": 166367,
  "series": "Outta The Park!",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Jocks / Athletic",
    "Oral",
    "international",
    "jockstraps"
  ],
  "title": "Outta The Park!"
}