{
  "collections": [
    "Raging Stallion"
  ],
  "description": "During the Stallions game Anthoni Hardie slips into the locker room to sniff the team's dirty jocks. He hits the mother lode when he finds a laundry bin stuffed to the brim with old smelly jocks. Ball players Nigel March and Donnie Argento catch the culprit in the act. When Anthoni asks for a couple to take home, Nigel offers up his own sweaty sack for Anthoni to sniff. Anthoni gets on his knees between the two hung baseball players and goes back and forth sucking each of their musky dicks. Donnie wants in on the ball action and moves past first base to get Nigel's thick cock down his throat. The hunks form a rim train with Anthoni in the middle, both sucking ass and getting eaten out. All the ass eating gets Donnie in the mood to fuck bareback and he moves to the scoring position with his ass in the air. Nigel steps up to the plate and drills Donnie hard, sinking his cock deep into his teammate's open, raw ass. Anthoni feels left out and bends over under Donnie to give Nigel all-access to two tight holes. Nigel plugs both studs hard alternating holes until Anthoni flips over to watch his aggressor fuck him deep. Nigel hits just the right spot and makes Anthoni cum while he's getting fucked. When Nigel sees Anthoni's mess, he pulls out and blasts a load all over Anthoni's thick, black pubes. Nigel finishes and goes directly in for a double play when he slides his cock back into Donnie and fucks his buddy until Donnie slathers himself with his creamy white cum.   ",
  "models": [
    {
      "name": "Anthoni Hardie",
      "person_id": 61376
    },
    {
      "name": "Donnie Argento",
      "person_id": 61374
    },
    {
      "name": "Nigel March",
      "person_id": 53250
    }
  ],
  "release_date": "2019-10-04",
  "scene_id": 166372,
  "series": "Outta The Park!",
  "tags": [
    "Anal",
    "Bodybuilder",
    "GroupSex / Orgies",
    "Hairy",
    "Jocks / Athletic",
    "Oral",
    "Tattoos",
    "cum shots",
    "jockstraps",
    "rimming"
  ],
  "title": "Outta The Park!"
}