{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Down in the cruising grounds, Brian Bonds and Logan Stevens slide their hard cocks thru a glory hole, prompting Drake Masters to get down on his knees and begin servicing the two swollen dicks. After Drake has had his fill of cock in his mouth, Logan and Brian join him face to face to return the favor. Brian takes the front, feed Drake his cock, while Logan takes the back end, tongue-fucking Drake's hairy hole. After rimming Drake's crack, Logan stands up to mount Drake raw from behind. It's a musky spit-roast and Drake can't get enough. Logan alternates between plunging his bare cock in and out of Drake's ass and kneeling down to lick Drake's sweaty fuck-hole. Brian and Logan trade places and Drake offers his sore hole up to Brian's tongue and his mouth to Logan's uncut pole. When Brian slides it in, Drake lets out a deep moan with Logan's cock down his throat. Drake wants to be in charge now, so Logan bends over to swallow Brian's cock while Drake fucks his hole from the other side. Logan takes each raw pump from their cocks with a smile on his face, opting to receive both of their rods in his hole. Drake spreads apart Logan's ass while Brian keeps hammering Logan's prostate. When Drake goes in to fuck Logan again, Brian gets into position and mounts Drake while he's still inside Logan. The fuck-train continues until Logan gets on his back to take some more pounding from Brian's cock. Brian keeps drilling Logan before emptying his balls onto Logan's and shoving his cummy cock back inside. Logan takes that as his cue to stroke his own load out onto his scruffy abs which Brian licks up and shares with both Drake and Logan. ",
  "models": [
    {
      "name": "Brian Bonds",
      "person_id": 22695
    },
    {
      "name": "Drake Masters",
      "person_id": 52025
    },
    {
      "name": "Logan Stevens",
      "person_id": 20683
    }
  ],
  "release_date": "2019-10-11",
  "scene_id": 167022,
  "series": "Manscent",
  "tags": [
    "Anal",
    "Boots",
    "Foreskin",
    "GroupSex / Orgies",
    "Oral",
    "Tattoos",
    "butt play",
    "glory holes",
    "jockstraps",
    "rimming"
  ],
  "title": "Manscent"
}