{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Mason Lear is stroking behind bars and Donnie Argento is masked and locked in a steel cell. Ricky Larking discovers the guys ready to fuck and slides his cock thru the bars on Mason's end. Donnie watches from the other end of the room as Mason fits his head between to bars to get to Ricky's meat. Not wanting to leave Donnie out, Ricky unlocks his cage and attaches a metal leash to Donnie and leads him on top of a table on all fours. Teasing and taunting the masked stud, Ricky sacks and sniffs Donnie's fuzzy hole as Mason watches with his cock in his hand. Donnie submits to every sniff, lick and probe Ricky is throwing his way. He rolls Donnie around onto his back and shoves his raw cock in and Mason tries to fight his urges from behind the bars. Mason has had all the waiting around he can take and joins Ricky and Donnie, feeding Donnie his thick rod while Ricky keeps fucking his ass. When Donnie wants a break from getting spit-roasted, Mason takes his place to let Donnie fuck his bare ass while sucking down Ricky's member. Donnie and Ricky take turns plugging Mason's ass before Donnie becomes the bareback bottom again, getting pile-drived by Ricky. Mason wants one more stretching and lays back to receive Donnie's cock in his hole. He keeps pounding until both Donnie and Ricky paint Mason's hairy hole with their warm loads. Making sure not to forget about Mason, Donnie shoves his cock back inside him as Ricky rims Donnie's hole. Mason strokes his cock until it lets out his creamy load. ",
  "models": [
    {
      "name": "Donnie Argento",
      "person_id": 61374
    },
    {
      "name": "Mason Lear",
      "person_id": 57396
    },
    {
      "name": "Ricky Larkin",
      "person_id": 20748
    }
  ],
  "release_date": "2019-11-08",
  "scene_id": 167027,
  "series": "Manscent",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "GroupSex / Orgies",
    "Leather",
    "Oral",
    "butt play",
    "butts",
    "cum shots",
    "jockstraps"
  ],
  "title": "Manscent"
}