{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Devin Franco is on the couch inside watching porn and getting hard. With his cock in his hand, Devin notices Arad Winwin outside trimming the hedges. Arad loses his shirt while working under the sweltering sun, and Devin immediately invites Arad inside to join him. Arad steps inside and gets busy sucking the hunky homeowner's thick cock. Arad works his mouth up and down Devin's cock, taking the shaft down his throat until his lips meet Devin's balls. Making his way from his cock down to his hole, Arad pushes Devin's legs back and circles his hole with his tongue. Devin submits and lets the horny yard worker eat him out. When Arad has had his fill of Devin's hole in his mouth, he puts Devin on his knees and feeds him his massive rod. Devin takes every powerful thrust from Arad's cock as it hits the back of his throat. Wanting even more, Devin bends over and Arad slides his cock into Devin's willing ass. Switching positions, Devin gets on his back to take a deep, bareback pounding from Arad. When Devin wants to be in control, he climbs on top of Arad and bounces his bubbly muscle ass on Arad's thick meat. Devin riding his pole sends Arad over the edge, and he shoots his warm cum all over Devin's stretched out hole. With Arad's load covering his hole, Devin rides Arad's dick one last time, while Arad helps Devin out by stroking his rock-hard cock until Devin shoots a thick load all over Arad's sweaty abs. When it's all over, Devin hops off Arad's cock and licks up his own load from Arad's sweaty torso.",
  "models": [
    {
      "name": "Arad Winwin",
      "person_id": 49394
    },
    {
      "name": "Devin Franco",
      "person_id": 52211
    }
  ],
  "release_date": "2019-11-22",
  "scene_id": 167330,
  "series": "Afternoon Affairs",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Butt",
    "Bodybuilder",
    "International",
    "Interracial",
    "Kissing"
  ],
  "title": "Afternoon Affairs"
}