{
  "collections": [
    "Falcon Studios"
  ],
  "description": "When Cade Maddox comes down the stairs and notices his sexy pool boy, Kuper, cleaning up, he steps outside and gets in a lounge chair. Turned on by Küper, Cade starts rubbing his cock that's already bulging thru his speedo. When Küper notices the throbbing meat, Cade signals him inside to the couch. Without hesitation, Küper heads straight for Cade's thick cock with his lips. Cade feeds the willing pool boy his meat, making Küper gag on his thick pole. To show his appreciation, Cade puts the Küper's cock in his mouth while continuing to stroke his dick. Küper gets on all fours on the couch to give Cade total access to his hairless hole. Cade spreads Küper's cheeks and gets to work with his fingers and tongue, opening up the pool boy's ass. When Cade has Küper's hole nice and prepped for what's to come, he picks the stud up and carries him to the bedroom. Once on the bed, Cade takes a few more licks on Küper's hole before sliding his bare cock into the willing stud. On his back with his legs in the air, Küper grabs ahold of his cock and strokes it while Cade works the hole over with his cock. Switching positions, Küper rolls over and takes Cade's meat doggy-style. Cade continues the bareback pounding of the horny stud until Küper gets on top and rides Cade's cock. After Küper's ride, Cade throws Küper back on his backside and thrusts his full weight on top of Küper. While Cade is stretching out his hole, Küper lays back and works his load out of throbbing cock onto his abs. Seeing Küper bust his nut makes Cade let loose and shoot a thick load on Küper's ass. After swirling the load around with his cock, Cade slides back into Küper one last time.  ",
  "models": [
    {
      "name": "Cade Maddox",
      "person_id": 51854
    },
    {
      "name": "Kuper",
      "person_id": 61727
    }
  ],
  "release_date": "2019-11-01",
  "scene_id": 167327,
  "series": "Afternoon Affairs",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Butt",
    "Foreskin",
    "Kissing",
    "Swimwear"
  ],
  "title": "Afternoon Affairs"
}