{
  "collections": [
    "Raging Stallion"
  ],
  "description": "'Yeah, baby... Grab my balls and pull 'em down!' growls muscle-bear Drew Sebastian in his low sexy bass voice, legs dangling in the swimming pool while his world-famous, 10-inch tube steak gets slurped on by fuzzy blond brick shithouse, Cain Marko. Basking on his furry belly with a mouthful of giant daddy dong, he pleads, 'I want it,' as he comes up for air. 'Yeah, suck my dick, man,' Drew replies as his big cock gets even harder and Cain slips into the pool to try to deep throat the one-eyed beast. Inside, hung young-buck Edji Da Silva is waiting and ready for a raw three way on the living room floor. While Drew sits spread-eagle enjoying the view and stroking his dick, Cain and Edji put on a private bareback flip-flop fuck show for him, taking turns drilling each other's hairy bubble butt. As the ass pounding continues, Drew and Edji spit roast Cain, his throat and hole both stuffed to the limit. Drew expertly slides into Edji's hungry hole, making him the lucky meat in the sandwich as Edji ride's Drew with no abandon and deep-dicks Cain. Finally, Drew sets the pace for the grand finale: a slow power-fuck double team as he breeds Cain and floods his ass, then Edji tags in to use Drew's jizz as lube and adds his own seed to the mix. Cain 'hops on pop,' --  'Yeah, my dick's in your sloppy hole!' -- and cranks out a load. 'Good Job, Men! Fuck Yes!' says Daddy Drew. ",
  "models": [
    {
      "name": "Cain Marko",
      "person_id": 62027
    },
    {
      "name": "Drew Sebastian",
      "person_id": 61838
    },
    {
      "name": "Edji Da Silva",
      "person_id": 62029
    }
  ],
  "release_date": "2019-12-20",
  "scene_id": 168436,
  "series": "Loaded: Give It To Me Raw!",
  "tags": [
    "Anal",
    "Bodybuilder",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "international",
    "masturbation"
  ],
  "title": "Loaded: Give It To Me Raw!"
}