{
  "collections": [
    "NakedSword Originals"
  ],
  "description": "Hairy muscle-daddy Ricky Larkin is stroking his huge cock on the couch, motioning to hot boy Dakota Payne to join him. Without any hesitation, Dakota pulls down Ricky's shorts and gets to work sucking his thick cock. Wanting a taste of his top's forbidden hole, Dakota throw's daddy's legs in the air.Ricky likes it rough, so Dakota grips Ricky's balls firmly and gives them a few hard slaps. Taking control, Ricky bends Dakota over so he can eat his ass and suck his cock. Dakota submits and lets Ricky orally explore and prepare him for an intense bareback fuck. Lubed with spit, Ricky slides his big dickup Dakota's ass and quickly starts pounding the willing stud. Ricky keeps driving his meat into Dakota and alternates with quick rim jobs to satisfy the tatted hunk. Ricky makes sure to pay close attention to Dakota's feet, sniffing and licking all around them. Back on the couch, Ricky lays back to get his cock sucked and balls pressed some more before bending Dakota over the couch once more and drilling his raw hole. The boy's hole is so good that Ricky can't help himself and blows his load just in time for Dakota to turn around and swallow it down. Daddy wanting more, he shoves his cum-drenched cock back Dakota's ass until Dakota strokes his cock so hard his load shoots out and hits Ricky in the face. Still in a post-orgasmic daze, Ricky and Dakota continue to smell and lick each other's sweat drenched bodies until daddy is satisfied and tells the cum-soaked boy to go take a shower.",
  "models": [
    {
      "name": "Dakota Payne",
      "person_id": 61303
    },
    {
      "name": "Ricky Larkin",
      "person_id": 13267
    }
  ],
  "release_date": "2020-11-18",
  "scene_id": 181055,
  "series": "BARE: Hookups And Fuck Downs",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Butt",
    "Bodybuilder",
    "Daddy",
    "Feet",
    "Hairy",
    "Kissing"
  ],
  "title": "BARE: Hookups And Fuck Downs"
}