{
  "collections": [
    "NakedSword Originals"
  ],
  "description": "Realtor-to-the-stars Josh Moore takes newlywed house hunters Calvin Banks and Dante Colle to see one of his most impressive listings, a mansion in Amityville with an unusually low price tag. When the newlyweds question the condition of the home, Josh tells them the urban legend that the mansion was once a gay whore house and is haunted by the sex-crazed Amityville Whore. The couple accepts the offer and Josh tells them that his unorthodox commission is 1% for each inch of his meat, a substantial 9.5'. The couple discusses their options briefly and all three of them rush upstairs to the bedroom. Dante and Calvin make sure their agent is happy when they unbutton his pants and take turns wrapping their lips around his massive, uncut cock. Dante struggles to get all the way down to the base but Calvin is quick to show them both how to deepthroat Josh's cock. All three take turns sucking cock until Calvin is fed both cocks from above. Josh lays down on the bed so Calvin can get on top to let Dante work his mouth and tongue around their stacked holes and cocks. With Calvin's hole slick with his husbands spit, Dante slides his raw cock into Calvin's ass while Josh feeds Calvin his uncut meat. Dante and Josh keep spit-roasting Calvin until the studs lay back to let Calvin bounce back and forth bareback between cocks, riding them deep. They take turns pounding Calvin in multiple positions until all three studs unload at the same time all over Calvin's body before Dante and Josh shove their throbbing cocks back in his used hole. In the end, Josh scored a hot sex session and earned his commission.",
  "models": [
    {
      "name": "Calvin Banks",
      "person_id": 51992
    },
    {
      "name": "Dante Colle",
      "person_id": 50834
    },
    {
      "name": "Josh Moore",
      "person_id": 51369
    }
  ],
  "release_date": "2020-12-23",
  "scene_id": 182357,
  "series": "Scared Stiff #02",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Butt",
    "Foreskin",
    "Kissing"
  ],
  "title": "Scared Stiff #02"
}