{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Chris stone is exercising in the living room when Matt Gunther and Lon Flexx enter.  Matt takes one look at Chris's washboard abs and smooth muscular legs and decides that he is going to have Chris's ass.  Matt teases Chris with the big bulge packed into his briefs and finally lets Chris have it.  Matt slams his dick into Chris's open mouth and Chris easily swallows the thick tool.  Lon gets hotter and hotter watching these two go at it and soon pulls his long hard prick out and taunts Chris with his hard meat.  Chris lunges at the dick and swallows the big rod.  As Chrhis continues to serves these two super studs, Luuc Francois walks in on the action.  'Join in or get out!' orders Matt.  Luc obliges and falls to his knees, beginning to work Lon's cock as Chris moves back to service Matt's.  In no time Lon and Matt are having their holes probed by the wet tongues of their pals.  Luc and Chris work the studs into exhiliration and are soon ordered to sit on the big pricks.  They work their open asses onto the fat cocks, heating up as they fuck the thick tools.  Matt and Lon turn these cock-starved jocks onto their backs and plow them, ramming their ass cheeks harder and faster.  Chris and Luc are so turned on that they beg to get the ass-packing of a lifetime.  Matt and Lon throw the two begging and squirming men to the floor and repeatedly thrust their ass-busting cocks into the muscular mounds of ass flesh.  When all four are driven to a state of hyper-sexuality, they pump out their loads and Chris and Luc bathe in a pool of combined cum.",
  "models": [
    {
      "name": "Lon Flexx",
      "person_id": 11810
    },
    {
      "name": "Chris Stone",
      "person_id": 11873
    },
    {
      "name": "Matt Gunther",
      "person_id": 12214
    },
    {
      "name": "Luc Francois",
      "person_id": 12246
    }
  ],
  "release_date": "2006-03-01",
  "scene_id": 21239,
  "tags": [
    "Anal Sex",
    "Bodybuilder",
    "Boots",
    "Double Oral",
    "Fetish",
    "Group Sex",
    "Masturbation",
    "Nipple Play",
    "Oral Sex",
    "Rimming"
  ],
  "title": "Big Bang, Scene #05"
}