{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Jimmy McGuire encounters and intense scene of orgiastic abandon-looking in on a room filled with tight, muscled hard-bodies surrendering to the primal call of masculine desire.  In varying stages of undress, fifteen studs work eagerly to satiate themselves and their fellow men.  Lips merge and separate; eager hands grope, stroke, and probe; throbbing cocks strain against thermal fabric or thrust deeply into hungry, demanding throats.  Jimmy can't resist the urge to join in-his own desire for the smoldering mountain of sculpted and inked male flesh is too great.  Soon he's been stripped of his trappings and is greedily engaged in fervent phallic worship:  sucking, stroking, probing, licking, and submitting to the fury of unleashed libido which swirls through the room like the blizzard overpowering the surrounding peaks.  Chad Hunt buries his enormous tool deep inside Michel Mattel, signaling the advent of an unbridled and hedonistic fuck-session.  An amoebic configuration of evolving couplings, threesomes and foursomes decorate the furnishings-each man intent on transporting the team into rapturous ecstasy.  Finally the gathering erupts into a flurry of streaming white satisfaction...each participant encouraging his fellows to blow as he strokes his own rampant cock.  Every free hand strokes the nape of a neck or spreads slick male essence across rippled abs and chiseled pecs.",
  "models": [
    {
      "name": "Anthony Shaw",
      "person_id": 11082
    },
    {
      "name": "Braden Lynx",
      "person_id": 11175
    },
    {
      "name": "Brett Wilde",
      "person_id": 11279
    },
    {
      "name": "Chad Hunt",
      "person_id": 10830
    },
    {
      "name": "Jackson Price",
      "person_id": 11305
    },
    {
      "name": "Jimmy McGuire",
      "person_id": 11066
    },
    {
      "name": "Lindon Hawk",
      "person_id": 11130
    },
    {
      "name": "Matt Majors",
      "person_id": 11258
    },
    {
      "name": "Michel Mattel",
      "person_id": 10928
    },
    {
      "name": "Vince Ditonno",
      "person_id": 11282
    }
  ],
  "release_date": "2010-07-01",
  "scene_id": 21578,
  "series": "The Other Side Of Aspen V",
  "tags": [
    "Anal Sex",
    "Cumshot",
    "Double Oral",
    "Group Sex",
    "Oral Sex"
  ],
  "title": "The Other Side Of Aspen V, Scene #03"
}