{
  "collections": [
    "Falcon Studios"
  ],
  "description": "When Tristan Paris, Jackson Price and Marc Nemeth submit to Pledgemaster Blake Harper's demand that in order to gain entry into their community, they cannot resist and must comply with all his instructions, little do they know what they're in for. This is a hazing the three young pledges will never forget, but if this is what they have to do to get into the coolest, sexiest, fraternity of sex-driven stud muffins - including frat boys Matt Majors, Brett Clark, Tony Lazzari, Andre Rivera and Ryan Zane - then so be it.Blindfolded at first, the three young men willingly obey Blake's commands and in no time they take to the hazing like ducks to water. There are little acts of humiliation, questionable things to drink, things to swallow, that the eager trio accept Â­ crazy antics that keep the frat boys entertained and all hot and bothered.Soon the hazing turns into a sexual free-for-all where everyone takes part for the pure pleasure of it all. There are cocks to suck Â­ big, thick, long, uncut, meaty poles of manflesh to taste and sample. There are assholes to sniff and savor Â­ deep warm holes to explore and tongue fuck; and then just fuck the daylights out of.",
  "models": [
    {
      "name": "Marc Nemeth",
      "person_id": 11155
    },
    {
      "name": "Brett Clark",
      "person_id": 11403
    },
    {
      "name": "Ryan Zane",
      "person_id": 11558
    },
    {
      "name": "Matt Majors",
      "person_id": 11258
    },
    {
      "name": "Blake Harper",
      "person_id": 11470
    },
    {
      "name": "Tristan Paris",
      "person_id": 11302
    },
    {
      "name": "Tony Lazzari",
      "person_id": 11512
    },
    {
      "name": "Jackson Price",
      "person_id": 11305
    },
    {
      "name": "Andre Rivera",
      "person_id": 11556
    }
  ],
  "release_date": "2004-11-01",
  "scene_id": 22111,
  "series": "Hazed",
  "tags": [
    "Cumshot",
    "Fetish",
    "Group Sex",
    "Masturbation",
    "Nipple Play",
    "Oral Sex",
    "Sixty-Nine"
  ],
  "title": "Hazed, Scene #01"
}