{
  "collections": [
    "Hot House"
  ],
  "description": "Meanwhile, further west, it seems that farms were meant for sex. Farmhands Nino Bacci and Dan Brewer both take turns servicing the cock of Marcelo Reeves, who is only too happy to be serviced. Bacci rims Reeves as Brewer continues to feast on Reeves' tool, then sticks his tongue up inside Brewer's sweaty hole. The rimfest continues, with Bacci greedily cleaning out both studs' holes. There's more kissing and sucking, then Bacci gets bent over a large barrel while Reeves fucks him from behind. 'Fuck that hole harder!' Brewer shouts out, stroking himself while Reeves does just that, pummeling Bacci with all his might. That's when Gibbs arrives on the scene, looking for his father's lover but finding the threesome instead. 'Come on over,' Brewer shouts, and Gibbs is quick to do so. While Reeves continues to fuck Bacci, Brewer takes care of Gibbs' cock, sucking on it for a spell before offering it to Bacci to feast on as well. Reeves then fucks Brewer while Gibbs takes a turn plowing Bacci. There's plenty of grunting and groaning here, as these four fuckstuds continue their afternoon sweatfest. Both Bacci and Brewer prove to be hardcore power bottoms, taking everything that Gibbs and Reeves have to give. The scenes comes to a juicy finish when Gibbs, Reeves and Brewer all three shoot their loads onto Bacci, who follows quickly behind with a load of his own. Later, Gibbs finds the man he is looking for-his 'uncle,' who welcomes him with open arms, and Gibbs-more of a man than before-realizes that he has finally made his way home.",
  "models": [
    {
      "name": "Dan Brewer",
      "person_id": 11438
    },
    {
      "name": "Marcelo Reeves",
      "person_id": 11347
    },
    {
      "name": "Nino Bacci",
      "person_id": 10945
    },
    {
      "name": "Todd Gibbs",
      "person_id": 11531
    }
  ],
  "release_date": "2007-01-01",
  "scene_id": 29079,
  "series": "The Road Home",
  "tags": [
    "Anal Sex",
    "Group Sex",
    "Outdoor Sex"
  ],
  "title": "The Road Home"
}