{
  "collections": [
    "Hot House"
  ],
  "description": "After running through the streets to his inevitable end, Aiden Shaw 'awakens' to find himself trapped between reality and fantasy--somewhere between Heaven and Hell. Tied to a chair, he receives a haircut from rugged tattooed hottie Zak Andrews while Chris Rock and Todd Gibbs sit bound and gagged in the background. Following the buzzcut, Shaw then begins his 'descent,' as he is initiated into his new surroundings. Everyone is untied, and as Gibbs gives Andrews a blowjob, Shaw receives one of his own from Rock, who does his best to accommodate Shaw's extra-thick tool. Meanwhile, Gibbs climbs on top of Andrews' cock and begins to ride the beefy barber. Andrews then flips Gibbs over and fucks him from behind, Gibbs looking back with a look of total contentment on his face. Before long, however, Andrews decides he wants to get plowed as well, and sits down on top of Gibbs' cock before flipping over to take it from behind. Soon Gibbs blows his load on Andrews' ass, while in the foreground, Shaw slides his own prick up inside Rock's smooth hole. Rock rides Shaw for all he's worth, his cries echoing out around them as he bounces up and down. Changing positions, he finds himself bent over, then on all fours, as Shaw pummels his from behind, forcing his monster cock in and out of Rock's hole as the sweat glistens on their bodies. Shaw pulls out, then shoots a beautiful load onto his boy's back. The descent has begun...",
  "models": [
    {
      "name": "Aiden Shaw",
      "person_id": 10868
    },
    {
      "name": "Chris Rock",
      "person_id": 11141
    },
    {
      "name": "Todd Gibbs",
      "person_id": 11531
    },
    {
      "name": "Zak Anders",
      "person_id": 52479
    }
  ],
  "release_date": "2007-01-01",
  "scene_id": 29189,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Bondage",
    "Gangbang",
    "Group Sex",
    "Hairy",
    "Kissing",
    "Masturbation",
    "Shaving",
    "Underwear"
  ],
  "title": "Descent, Scene #01"
}