{
  "collections": [
    "Hot House"
  ],
  "description": "It's an epic, stunning threeway when Iron finds himself in bed with Blake Harper and Jason Branch. First Branch takes turns sucking both Iron and Harper, before he ends up on his back with Iron in between his legs, sucking on Branch's cock while Harper teases his ass from behind. Harper and Branch then get into a 69 position and Iron fingers Harper's hole. The scene then flips to show Harper on his back, taking Branch's cock up his ass while Iron hungrily kisses his mouth. This goes on for some time, with Branch thrusting in and out while Harper moans out in ecstasy. The versatile Harper then climbs in behind Iron, who fucks himself back and forth on Blake's dick before they move into a position where Branch takes Harper's cock up his ass while he fucks Iron. Yowzers! The men flip around so that Harper is then standing while Iron works on his cock in front and Branch rims him from behind. Then both men share Harper's cock between them, licking, slurping and sucking until Blake pumps a load out as Iron fingers his hole. Then the boys flip around once again so that they can work each other's cocks over with their mouths, sucking in a variety of positions until Branch ends up sitting on Iron's face to get rimmed while he jerks his load onto Marcus' chest. There's even more maneuvering, as Harper fucks Branch from behind while Iron rims and fingers Blake's hole. After some more kissing, Branch moves around so that he can fuck Iron while Harper lies on his back jerking off while enjoying the view. The scene comes to a sensational finish with Iron and Branch stroking themselves over Harper until Iron shoots a great load onto Harper's dick.",
  "models": [
    {
      "name": "Marcus Iron",
      "person_id": 11180
    },
    {
      "name": "Jason Branch",
      "person_id": 11314
    },
    {
      "name": "Blake Harper",
      "person_id": 11470
    }
  ],
  "release_date": "2007-01-01",
  "scene_id": 29191,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Group Sex",
    "Hairy",
    "Kissing"
  ],
  "title": "Descent, Scene #03"
}