{
  "collections": [
    "Hot House"
  ],
  "description": "Owen Hawk has been locked in a prison cell awaiting punishment for an unknown crime. Supersized Thom Barron and Jason Kingsley storm into the cell, drag the criminal out of the cell, push him to his knees, and begin to assault the depths of his throat with their huge cocks. Owen gags reflexively from the punishing thrusts but finds that he can't help but open his mouth wider and take it. Next they tape up his mouth and Thom begins to tease his cock with his mouth. While he's bent over sucking Owen, Jason moves around back and begins to suck Thom's enormous white butt, burying his face in the mounds of muscle and jacking Thom's horse cock from underneath. Thom stands and moves behind Owen to screw him from behind while Jason sits on the ground blowing Owen from the front. Jason enters a nearby cell, pulls out a trash can, and drags out Piss Pig (Marcos Pirelli) who begs to relieve the men of their precious yellow fluid. The three men let fly a torrent of steamy hot gold which rains down across his face and chest and down past the fine brown downy hair of his thighs. Next Jason and Thom bend the two perps over a bench face to face and mount them from behind. Owen and Marcos suck face while they get their asses slapped and their holes pounded by the huge brutes. The men use their greasy, splayed buttholes to suck them off until the spray of hot loads starts, covering Piss Pig from top to bottom with the milky white jizz.",
  "models": [
    {
      "name": "Owen Hawk",
      "person_id": 10985
    },
    {
      "name": "Jason Kingsley",
      "person_id": 11053
    },
    {
      "name": "Thom Barron",
      "person_id": 11133
    },
    {
      "name": "Marcos Pirelli",
      "person_id": 11566
    }
  ],
  "release_date": "2007-01-01",
  "scene_id": 29332,
  "series": "Skuff 3: Downright Wrong",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Group Sex",
    "Kissing",
    "Leather",
    "Pissing",
    "Sex Toys"
  ],
  "title": "Skuff 3: Downright Wrong, Scene #06"
}