{
  "collections": [
    "Club Inferno Dungeon"
  ],
  "description": "Steve Winston can't seem to find his favorite dildo--that is, until he goes looking in boyfriend Jarred Wright's hole. Of course, that's exactly where his 12-inch rubber toy is and, since he's already there, Winston decides to use it on Wright. He works the big black dong in and out of Wright's gaping socket, pushing it all the way up inside and ripping it back out over and over again. It's not long until Winston climbs on top of his partner and starts fucking him from behind, plowing his cock in and out as the bed bounces beneath them. But Winston knows that Wright's hole needs more than just cock in it, so he lubes up his hand and slides it up there as well. As Wright pushes back onto his lover's arm, he gets both hand and cock, grunting out in absolute pleasure as both repeatedly and simultaneously invade his hole. Wright then climbs on top of Winston's hand and rides it like a pro, sitting down on it and propelling himself off of it. Winston moves him into a handstand position, pushing his hand down into Wright's ass as he supports himself on the floor with his arms. Right in the middle of things, the boys get a visit from San Francisco Power Company employee Mack Kurtis, who decides to join in on the action. He straps on a massive power-dong and relentlessly fucks Winston with it, pushing the monstrous cock in and out with a sly grin on his face. Sensing an opportunity for even more fun, Kurtis then gets on his phone and calls co-workers Frank Sylvano and Chris Ward to head over to the house to provide backup.",
  "models": [
    {
      "name": "Jarred Wright",
      "person_id": 15619
    },
    {
      "name": "Mack Kurtis",
      "person_id": 15926
    },
    {
      "name": "Steve Winston",
      "person_id": 16417
    }
  ],
  "release_date": "2007-11-05",
  "scene_id": 29871,
  "series": "Powerfist",
  "tags": [
    "Anal Sex",
    "Big Cock",
    "Fisting",
    "Hairy",
    "Jock",
    "Male Masturbation",
    "Sex Toys",
    "Tattoos"
  ],
  "title": "Powerfist"
}