{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Let me introduce our favorite guys Denny, Fox, Tommy, Trent and Phoenix.<BR/><BR/>All the guys were together not too long ago and wanted to make a special scene, one that would go in the history books and be people's favorites for years to come.<BR/><BR/>They all were just sitting around, lounging on a warm sunny day, when Fox stands up and takes off his shirt. When you hang out with young porn stars all the time, this isn't something surprising or new, but when Denny immediately followed suit by yanking off his shirt AND also dropping his drawers, we knew something was up. Luckily we had the cameras rolling.<BR/><BR/> Before you know it, all the guys are naked and passing the lube bottle around, getting their cocks nice and slick. From Tommy, to Phoenix, to Trent, over to Denny and Fox, this is one room that is full of dick. The unmistakable sound of a male masturbating echoes off the walls, almost sounding like tropical rain coming down in a lush Colombian jungle (you'll hear what I mean).<BR/><BR/>To make things even more interesting, the guys all choose to shoot their loads into a single wine glass and at the end, one of them does something that will blow you away (and turn you on)...but you'll just have to watch and see.<BR/><BR/>Enjoy this five guy circle jerk! ",
  "models": [
    {
      "name": "Denny",
      "person_id": 4102
    },
    {
      "name": "Fox",
      "person_id": 4101
    },
    {
      "name": "Phoenix",
      "person_id": 4110
    },
    {
      "name": "Tommy D",
      "person_id": 2359
    },
    {
      "name": "Trent",
      "person_id": 4109
    }
  ],
  "release_date": "2007-03-07",
  "scene_id": 3020,
  "series": "4084 Next Door Buddies",
  "tags": [
    "Amateur",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Cum swallow",
    "Dark Hair",
    "Fraternity",
    "Masturbation",
    "Orgy",
    "Softcore",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Five Guy Circle Jerk"
}