{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Heath Jordan and Colby Keller have been together for several years ? and what a pair they make! Both have striking faces, fine butts, huge cocks, and stunning bodies. Life in Aspen suits them well ? kind of like two young , lanky lumberjacks who really like to fuck. Heath has been out shoveling snow. When he comes in from the cold, he needs some quality time with his boyfriend to warm him up. Colby's smirk tells us that he is horny as hell, so it doesn't take much to get this fire burning! Heath loves cock, and Colby has one of the best dicks of all time. First off, it's long. It's also nice and thick and the whole shaft is covered with some impressive veins. It's not only nice to look at, it's nice to suck. The temptation is too much, and before you know it Heath is on his knees, gagging like a maniac.Colby also likes to suck his boyfriend's cock. One of the best things about Colby is his fine face?it's about as handsome as it gets and it really looks remarkable when his lips are wrapped around a cock. This is a blow job to remember!OK.....lets get to the fucking! Colby has the bigger dick, so he gets to do the topping in this amazing scene. We watch as two positions unfold and then a dramatic reverse cowboy?that is where the top lies on the floor with his giant cock pointing towards the sky. The bottom, facing the camera, then rides furiously up and down. It's a great position?one that GayVN Hall of Fame director Chris Ward fully exploits throughout the entire movie. You are going to blow your load as you watch Heath ride up and down, penetrated by Colby's massive cock. Watch as Heath blows a giant load while being impaled and fucked! How can one man have so much cum? Then Colby comes all over Heath's face and no one seems too upset by cum going in Heath's eager mouth.",
  "models": [
    {
      "name": "Colby Keller",
      "person_id": 13164
    },
    {
      "name": "Heath Jordan",
      "person_id": 14044
    }
  ],
  "release_date": "2011-05-27",
  "scene_id": 30234,
  "series": "The Other Side Of Aspen VI",
  "tags": [
    "Anal Sex",
    "Cumshot",
    "Oral Sex"
  ],
  "title": "The Other Side Of Aspen VI, Scene #04"
}