{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Tucked away in their private quarters, Felix Barca and Race Cooper eagerly get down to business. The two studs hungrily smother each other with deep kisses, undo each other's trousers to fish out cock and then really get down and dirty. Felix is happy to drown in chocolate love as he nibbles on Race's tits and sucks on his long thick cock. Race leans back, spiraling into ecstasy with every slurp while holding onto the back of Felix's head to help guide him up and down. Felix can't get his fill of his buddy's big beautiful cock and continues to suck away like the hungry little pig he is. The men finally change it up so Race can get his turn to feed on Felix's uncut prick. He presses his face up tight against his partner's fuzzy abs as he deepthroats his dick, causing Felix to spasm uncontrollably as he almost loses his load. Then spreading Race's round buttcheeks apart, Felix jabs his tongue deep down his manhole. He reaches between Race's legs, pulls his still engorged cock back and sucks it hard. Race's clenched sphincter twitches with each tongue poke and lick as Felix works hard to pleasure him. Race shivers with excitement, screaming quietly, moaning yet wishing for more. Now feeling it's time, Felix slams his cock up Race's ass and fucks him hard. He slaps the ebony cheeks of Race's bubblebutt making him whimper and cry out for more. The guys switch it up again, this time with Race screwing Felix fast and furious. Felix's face reddens with the ass assault and grows more excited as he pumps his own cock. He grimaces with pained pleasure as he shoots his load. Race fucks him some more and finally pulls out, grunting hard as he adds his own spurts of cum onto Felix's stomach. Grateful for the sexual congress, the two friendly foes reward each other with a battery of more loving kisses.",
  "models": [
    {
      "name": "Felix Barca",
      "person_id": 16722
    },
    {
      "name": "Race Cooper",
      "person_id": 13166
    }
  ],
  "release_date": "2011-06-01",
  "scene_id": 30359,
  "series": "Get Me Off!",
  "tags": [
    "Anal Sex",
    "Athletes",
    "Cumshot",
    "Interracial",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Get Me Off!, Scene #01"
}