{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Jock Hudson is focused on pumping iron but stops immediately as soon as hunky Morgan Black walks in. The horny studs find themselves keen on working on a different set of muscles and after sucking face for awhile, Morgan pulls Jock's big juicy cock out and falls open-mouthed onto it. Jock sits back grinning like a lucky fool while enjoying his buddy's oral expertise. Morgan's mouth is chock full of cock but he wouldn't want it any other way; the salty sweetness of the sweat generated by Jock's workout makes it tastes so good. He feasts some more, but after awhile, Morgan stands up buck naked and beautiful, an impressive tower of manliness with a fine coat of hair covering his muscled pecs and torso and a long slender cock looming erect and curving upward for Jock to jaw on. Jock works hard slurping his pal's pole up, coating it with his spit. Jock then leans over, exposing his tight ass and wrinkled asshole to his hungry cohort who can't wait to rim it. Morgan's tongue reaches far inside as he stretches Jocks buttcheeks apart; he's priming it for the intense fucking he's so eager to deliver. Now ready to proceed, he stands behind Jock who is folded over the workbench, and begins to plug him hard. Morgan pumps his hips to and fro, jamming his pole deep inside Jock's hole, building up speed with every thrust, going faster and faster, without taking a break. As they move into a more missionary position, Jock grits his teeth as he hold his thighs up and apart, pleading for Morgan to fuck him even harder. Morgan's brawny body glistens with sweat as he continues pounding Jock's ass, exciting the taller man to clutch his dick and jerk himself to climax. Jock strains with the exertion, then composes himself and leans back, happily anticipating Morgan's thick load all over him. Now spent and exhausted, the two jocks relax in each others arms.",
  "models": [
    {
      "name": "Morgan Black",
      "person_id": 16721
    },
    {
      "name": "Jock Hudson",
      "person_id": 16724
    }
  ],
  "release_date": "2011-05-18",
  "scene_id": 30361,
  "series": "Get Me Off!",
  "tags": [
    "Anal Sex",
    "Athletes",
    "Cumshot",
    "Hairy",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Get Me Off!, Scene #03"
}