{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Tommy Defendi has Heath Jordan locked in his arms, holding his muscled, hairy torso close and tight against him. The two men kiss passionately as they rub and stroke each other, letting their hands glide up and down the other's finely muscled body. Tommy runs his tongue and lips down Heath's furry chest, biting and tongueing his nipples gently, before traveling down along his belly until he reaches his crotch. He pulls Heath's snug briefs down and immediately gets busy swallowing down his big cock. Tommy's lips are clamped tight around his partner's hefty tool, sliding back and forth over the entire length and all around the mushroom tip. Heath coos and sighs as he surrenders to the thrilling sensations of having his stiff staff stuffed down Tommy's throat. Now it's time to pay the piper and Heath takes his turn to get his friend off. He opens wide to envelop Tommy's tantalizing tool, grabbing onto the fuzzy nutsac as his head bobs up and down the length of the dickshaft. With the two of them worked up into a lather and anxious for more, Heath climbs aboard Tommy and skewers himself down onto his dick. His pinched asshole stretches wide to consume the hefty salami. Tommy's balls bounce as Heath bucks up and down from above, his dick swinging all around. Both men moan as Tommy continues plowing Heath's backside; the nonstop slapping of flesh against flesh reddens his buttcheeks. Then with the hirsute fireplug of a stud now flat on his back, Tommy fucks him even harder. Heath jerks himself off, pumping his cock until his load blasts out in thick spurts. Tommy is quick to answer with his own smattering of cum, matting Heath's chest hair even more.",
  "models": [
    {
      "name": "Heath Jordan",
      "person_id": 14044
    },
    {
      "name": "Tommy Defendi",
      "person_id": 13279
    }
  ],
  "release_date": "2011-05-04",
  "scene_id": 30360,
  "series": "Get Me Off!",
  "tags": [
    "Anal Sex",
    "Cumshot",
    "Hairy",
    "Oral Sex"
  ],
  "title": "Get Me Off!, Scene #02"
}