{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Parking their Jeep on a cliff overlooking a valley, D.O. and Erik Rhodes need a quick stop for a sip of water. Shirtless, sculpted D.O. wants more than a quick break for water, the surrounding nature has turned him on and he starts to make out with Erik. D.O. wants a taste of Erik's thick hard dick. Engulfing Erik's cock with his mouth, D.O. works the big man over allowing him to fuck his face. The Jeep is the perfect playground for these stunning men, and D.O. opens the rear so he can stand up in the back end and give Erik a perfect view of his immense and gorgeous cock. Looking up at the ripped abs of D.O., Erik takes his time to pay tribute to the man and his meat lapping at it, licking it and gulping it down repeatedly, and then giving his mouth to D.O. to use at his will. It's not too long before Erik is doing the same with his meaty, round ass bending over the roll bar of the jeep so D.O. can tongue, rim and finger his taught manhole. D.O. is an expert in preparing Erik's hole for a good fucking, and that's exactly his intent. Erik holds on tight to the roll bar as D.O. begins an all-out fucking on the big man's ass, sliding it in and pulling it out, and then going back for more rhythmic strokes. Watching the smaller ripped D.O. find every way to deliver his stiff staff to Erik's eager hole is worth the price of admission. Putting Erik on his back on the hood of the Jeep, D.O. props Erik's legs in the air to really deliver the goods, and spread his cheeks so wide that he can deliver every last thick inch of his tool. He pounds Erik with a fervor inspiring a huge load which Erik is in position to receive on his face and in his mouth. After catching D.O.'s load, Erik jerks out a huge one himself.",
  "models": [
    {
      "name": "Erik Rhodes",
      "person_id": 11271
    },
    {
      "name": "D.O.",
      "person_id": 16812
    }
  ],
  "release_date": "2011-09-16",
  "scene_id": 31810,
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Bodybuilder",
    "Buttplay",
    "Cumshot",
    "Oral Sex",
    "Outdoor Sex",
    "Public Sex",
    "Rimming",
    "Underwear"
  ],
  "title": "Roughin' It 2, Scene #02"
}