{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "We exist together in a world of uncertainty, doubt, restlessness, regret, stress, and worry.  Many seek answers and solutions from traditional religion, ancient philosophy, and far east thinkers. But too often true enlightenment remains elusive. The essence of total freedom is still merely a whisper in the wind, always dancing just out of reach. When other roads have lead to dead ends, when the straight path becomes too gnarled to follow, when the guiding light becomes obscured, the Rectodus Society is there. If your soul needs nourishment, we'll let you drink, come. If you feel a lacking, we'll fill your hole with dictations from our well equipped counselors.The Rectodus Society is an organization founded upon principles of encouragement, brotherhood, and acceptance.  With a passion for guiding men by coming together we are a beacon for those struggling to walk the straight path. The Rectodus motto is 'turning you gay so she doesn't have to.' In this video captured from an actual Rectodus Seminar and Retreat, you'll witness nine men learning, sharing, and bonding together by participating in a carefully structured activity session. The basic agenda for each attending member includes 1) KISSING another man, 2) JERKING OFF another man, 3) RIMMING (optional, but strongly recommended), and 5) FUCKING (positions negotiable). Watch the amazing symbiosis as these nine sincere men come together to transition into new awareness of themselves, and harness their rightfully deserved destinies. Feel the intensity as Parker London takes two cocks in his ass at one time in a Rectodus technique called 'double penetration.' See Adam Wirthmore's gentle guidance as a Rectodus counselor as he deepthroats Jay Cloud's long, hard boner. You'll get goosebumps watching Brec Boyd experience Dylan Hauser's tight asshole as both men expand their consciousnesses. As James Jamesson is counseled by Wirthmore through intensive fuck therapy, Tyler Torro bangs the international ass of Marko Lebeau, a Rectodus attendee from beautiful Montreal. And when you experience the breakthrough made by the once bashful Vance Crawford as he joins his new brothers in blowing hot, built-up loads all over Counselor Wirthmore's face, you'll realize your own potential. Don't hesitate another minute, stumbling in the dark. Let the Rectodus Society become an important part of your life TODAY!  Enjoy!",
  "models": [
    {
      "name": "Cody Cummings",
      "person_id": 6195
    },
    {
      "name": "Adam Wirthmore",
      "person_id": 9827
    },
    {
      "name": "Vance Crawford",
      "person_id": 13933
    },
    {
      "name": "Brec Boyd",
      "person_id": 8649
    },
    {
      "name": "Jay Cloud",
      "person_id": 10696
    },
    {
      "name": "Dylan Hauser",
      "person_id": 14217
    },
    {
      "name": "Parker London",
      "person_id": 9444
    },
    {
      "name": "Marko Lebeau",
      "person_id": 13548
    },
    {
      "name": "James Jamesson",
      "person_id": 9526
    },
    {
      "name": "Tyler Torro",
      "person_id": 13869
    }
  ],
  "release_date": "2011-09-29",
  "scene_id": 32190,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Blonde",
    "Brunette",
    "Colored hair",
    "Condom",
    "Dark Hair",
    "Deep throat",
    "Double Anal",
    "Facial",
    "Fraternity",
    "Hardcore",
    "Oral",
    "Orgy",
    "Red Head"
  ],
  "title": "The Rectodus Society"
}