{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Tanned and stunning, Cody Cummings in all his ripped glory is standing by the hot tub handling his cock, begging for it to be taken by someone else. Cody, a beefy and sculpted stud, is shining under the sun and his rugged, handsome good looks attract Anthony Romero's hot lips. Anthony, fully naked and hard at the sight of Cody, approaches and immediately wraps his mouth around Cody's tool. He works it well as Cody enjoys the attention, but this twosome has caught the eye of another onlooker, Johnny Torque, who can't resist joining in. He's takes his cue to go down on Anthony while Anthony works Cody over. Johnny is gulping down Anthony's cock repeatedly as Cody fucks Anthony's mouth. Rising up, Johnny helps Anthony please Cody by taking turns on the big man's massive meat. Back and forth they take Cody's cock the other licking his balls and feeling his tightly muscled body. Cody is loving the attention as he pulls each hot stud's head onto his cock moaning in appreciation of the service they're giving him. Paul Wagner takes notice of what's going on outside and emerges from his room to join in the cocksucking festival. As he throats Cody, Anthony and Johnny take turns going down on Paul's thick meat. Not to be left out, Marcus Mojo has joined in on this oral orgy with each mouth taking Cody's tool deeper than the next. Paul massages Cody's thighs and chest as Marcus sucks and then takes the dick again in his mouth when Marcus lets it slip out of his. With Paul sucking, Marcus licks on Cody's balls and takes them both in his mouth to please the stud. Paul and Marcus make out and work Cody's cock between kisses. If four of the hottest men on Cody's cock wasn't enough, Landon Conrad joins the mix, taking a little solo time with Cody. While Landon slurps at the huge pole, streams of saliva drop down. Rod Daily wants part of the action too, and he joins Landon. They both take turns working Cody's meat, and Anthony returns to suck on both studs who are servicing Cody. The grunts and groans louden, calling Marcus and Johnny back to the scene. Now six studs are all working Cody's pole and each other's. This gang of seven feverishly tend to each other with raw sexual energy. Finally the frenzy builds to a crescendo as all six guys shoot one after the other, leaving only Cody to blast one huge final load.",
  "models": [
    {
      "name": "Anthony Romero ",
      "person_id": 17718
    },
    {
      "name": "Cody Cummings",
      "person_id": 17716
    },
    {
      "name": "Johnny Torque",
      "person_id": 17717
    },
    {
      "name": "Landon Conrad",
      "person_id": 13270
    },
    {
      "name": "Marcus Mojo",
      "person_id": 16814
    },
    {
      "name": "Paul Wagner",
      "person_id": 14024
    },
    {
      "name": "Rod Daily",
      "person_id": 12856
    }
  ],
  "release_date": "2011-11-02",
  "scene_id": 32334,
  "series": "The Guys Next Door, Part 1",
  "tags": [
    "Athletes",
    "Cumshot",
    "Group Sex",
    "Masturbation",
    "Oral Sex",
    "Outdoor Sex",
    "Tattoos"
  ],
  "title": "The Guys Next Door, Part 1, Scene #02"
}