{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Johnny Torque is sitting on the steps stroking himself, pulling his cock out of the leg hole of his board shorts. Johnny is pawing his long thick meat to full staff. It's not long before Andrew Jakk chances by and wants a taste. Andrew, a slim hot blond is quickly on his knees licking and sucking on Johnny, who gets out of his clothes and removes Andrew's tank. Johnny pulls Andrew's head down on his rock-hard cock, spreading his legs to give a view of his hole. After Johnny comes up to kiss Andrew, he goes down on his knees and pulls down Andrew's shorts so he can return the cock sucking favor, loading Andrew's cock up with spit, and sliding down the pole. They kiss again, and then Andrew puts himself in position to take Johnny's cock in his tight hole. Standing behind Andrew, Johnny grabs onto his shoulders and starts to pound away at the hot blond who lets out moans and grunts of approval with each stroke. Johnny doesn't stop, he's got insane stamina and pounds away like a jackhammer filling Andrew's hole with a unrelenting serving of cock. Johnny wants more of this ass and places Andrew on his back, legs in the air, getting leverage and commencing with the rhythmic delivery again. Johnny jerks Andrews cock in time with his continuous probing, then pulls his cock out and reinserts it repeatedly to see Andrew's stretched hole. After Andrew shoots his load, Johnny gets so excited that he blasts a load well over Andrew's head, in what could be the furthest shot of cum to blast out of a man on film ever.",
  "models": [
    {
      "name": "Andrew Jakk",
      "person_id": 17013
    },
    {
      "name": "Johnny Torque",
      "person_id": 17717
    }
  ],
  "release_date": "2011-10-28",
  "scene_id": 32336,
  "series": "The Guys Next Door, Part 1",
  "tags": [
    "Anal Sex",
    "Athletes",
    "Cumshot",
    "Masturbation",
    "Oral Sex",
    "Outdoor Sex",
    "Swimwear",
    "Tattoos"
  ],
  "title": "The Guys Next Door, Part 1, Scene #04"
}