{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Samuel O'Toole emerges from a swim in the pool, naked. His muscled body shining with a coat of water until he towels off in the sunlight before returning inside to find Paul Wagner on his bed stroking his meat. Samuel takes his cue and immediately goes down on Paul's thick nicely veined pole. Paul's a ruggedly handsome beefy man with a light dusting of hair that projects 100% masculinity. Paired with Samuel's macho sexiness, this duo is one anyone would like to get in the middle of. Samuel really knows how to suck cock and also enjoys letting Paul fuck his mouth. Paul let's out the sexiest manly grunts and groans as Samuel services him, but Paul likes a hot cock too and quickly has his amazing lips wrapped around Samuel's tool ? an equally thick dick that Paul slurps up with gusto as he stokes his meat. Paul is really working Samuel over, but Samuel hasn't had his fill of Paul's piece yet. He lays on his side and sets one of the hottest 69's ever filmed into motion ? two of the hottest men on the planet simultaneously swallowing each other's cocks until they come up to kiss feverishly. Now it's time: Paul is ready to take that huge tool of Samuel's up his ass. Laying on his back with one leg in the air, Paul gives Samuel a perfect target for massive meat, and Samuel aims and drives it in deep his pelvis writhing and sending jolts or pleasure through Paul's entire body. On his back and spread wide to take every inch, Paul fully gives himself over to Samuel's cock, and Samuel takes the opportunity to pound every last inch deep into Paul. Samuel's round ass flexes with every thrust producing hot moans from Paul. The action is so intense that both studs shine with sweat until the heat of the moment sends Samuel over the top. He pulls his meat out and shoots a load onto Paul's stomach.",
  "models": [
    {
      "name": "Paul Wagner",
      "person_id": 14024
    },
    {
      "name": "Samuel O'Toole",
      "person_id": 14039
    }
  ],
  "release_date": "2011-10-21",
  "scene_id": 32333,
  "series": "The Guys Next Door, Part 1",
  "tags": [
    "Anal Sex",
    "Athletes",
    "Cumshot",
    "Masturbation",
    "Oral Sex",
    "Sixty-Nine",
    "Tattoos"
  ],
  "title": "The Guys Next Door, Part 1, Scene #01"
}