{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Johnny Torque and Anthony Romero are both visions in a pool of sparkling water on a hot day. They are taking an afternoon swim which leads to some heavy making out under a stream of water that feeds the pool. Their ferocious kissing gets the water boiling hot and Anthony wraps his legs around Johnny's waist. After their make out swim, they lay out in the sun for a bit, but soon they're both naked getting ready to continue where they left off in the pool. Both have striking looks, great asses and huge cocks. Tugging on Anthony's balls, Johnny swallows Anthony again and again, gulping away. Now it's Johnny's turn to get oral service. His cock is pumped up to full hardness, and Anthony can't get enough of the hot rod attached to Johnny. Swallowing the perfectly shaped shaft to its base, Anthony allows Johnny to guide his head down the pole again and again. With Anthony in the tub, Johnny sits on the ledge and spreads his legs allowing a perfect view of his tight eager hole, which Anthony tends to along with Johnny's balls. After some serious rimming, Anthony wants his hole services and he bends over the edge of the hot tub offering his round Latin bubble butt to Johnny, and Johnny doesn't disappoint, getting to business immediately slamming his huge cock deep into Anthony over and over with the sunlight beaming down on the duo. Anthony's face tells the whole story as he smiles while Johnny slams into him relentlessly, then he lays on his back while Johnny delivers his Torque, the power behind each pound sending moans out of Romero, who is now jerking his cock almost as fast as Johnny delivers cock into the hot hole. This is a long fucking session that culminates with Johnny and Anthony jerking off side by side with an upward view as they both shoot huge loads.",
  "models": [
    {
      "name": "Anthony Romero ",
      "person_id": 17718
    },
    {
      "name": "Johnny Torque",
      "person_id": 17717
    }
  ],
  "release_date": "2011-10-14",
  "scene_id": 32335,
  "series": "The Guys Next Door, Part 1",
  "tags": [
    "Anal Sex",
    "Athletes",
    "Cumshot",
    "Masturbation",
    "Oral Sex",
    "Outdoor Sex",
    "Swimwear",
    "Tattoos"
  ],
  "title": "The Guys Next Door, Part 1"
}