{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "You'll laugh, you'll laugh some more, then you'll stroke your cock!  These three hilarious buddies are goofing around together in the billiard room, clowning each other bad!  And you know when James Jamesson is in the house, everyone's fair game.  But watch out for big Brandon Lewis, 'cause he's firing back at James with a silly headlock and a good slap on the butt cheek!  Brandon and James are also having fun giving Next Door's newest exclusive, Brody Wilder, a hard time.  Hey, everyone has to pay their dues!<br/><br/>But Brody is a great sport.  And to show he can hang with the big dogs, he's joining James while Brandon sucks both fat, hard dicks at the same time.  James brought his video camera to capture the hot action for his archives.  Don't worry, you'll get to peek behind the lens to and check out his footage.  Brody's even going a bit further to show he ain't no scrub; he's letting James fuck his extra tight hole with that thick, rock hard Jamesson cock.  While Brody gets pumped full of James's man meat, Brandon enjoys Brody's soft mouth, vigorously slurping his swollen member.  Then it's Brandon's turn to take a stiffie in the ass.  James is switching spots to give Brandon a pounding everyone will remember.  Watch this trio blow their 'Three Spooges' while cranking up the heat for this sexy, fun-filled experience.<br/><br/>Enjoy!<br/><br/>",
  "models": [
    {
      "name": "Brandon Lewis",
      "person_id": 10277
    },
    {
      "name": "Brody Wilder",
      "person_id": 17757
    },
    {
      "name": "James Jamesson",
      "person_id": 9526
    }
  ],
  "release_date": "2011-11-03",
  "scene_id": 33009,
  "series": "NDB - 4365 - Brandon Lewis, James Jamesson & Brody Wilder",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Blonde",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Red Head",
    "Slim",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "The Three Spooges"
}