{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Do NOT proceed without understanding a few things:<br/><br/>1.  This scene is EXTREMELY hot.  In the annals of Twinkdom, this intense, three-way encounter will stand alone.  It is NOT to be taken lightly.  Anthony Romero, Jay Cloud, and Rick McCoy are handpicked hotties.  The chemistry is, in fact, explosive.<br/><br/>2.  Viewing this action may induce swelling of the penis, increased blood flow, and heavy breathing.  We advise that you are prepared for passion beyond what you may expect.<br/><br/>3.  When Anthony enjoys Jay's and Rick's hard cocks at the same time, you may feel an increase in blood pressure.  While Anthony and Rick lock lips and Jay slurps on Anthony's gorgeous dick, you'll probably feel a sudden head rush.  Know that this is normal.<br/><br/>4.  As Jay sticks his massive erection into Rick's tight hole, you may experience the need to jerk your own erection.  Please proceed.<br/><br/>5.  When you see Rick in the middle of a steamy-hot fuck train, with Anthony on the bottom and Jay pounding on the top, you'll probably experience a rush of adrenaline through your body.  Please stay as calm as possible.<br/><br/>  We can only give you these warnings in advance for your own good.  Be also advised that viewing these moving images will certainly make you want to blow a giant cumload, along with the three gorgeous gentlemen seen here.<br/><br/>Enjoy!<br/><br/>",
  "models": [
    {
      "name": "Anthony Romero",
      "person_id": 16627
    },
    {
      "name": "Jay Cloud",
      "person_id": 10696
    },
    {
      "name": "Rick McCoy",
      "person_id": 17883
    }
  ],
  "release_date": "2011-12-27",
  "scene_id": 33753,
  "series": "NDT - 8108 - Anthony Romero, Jay Cloud & Ryan McCoy",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Brunette",
    "Climax",
    "Fraternity",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Fair Warning"
}