{
  "collections": [
    "Trystan Bull"
  ],
  "description": "Rylan Shaw has recently been hired as a team assistant for a private soccer club. His job is to mostly clean up after the team, but general player assistance is also part of his job. The hours are sometimes long and unappreciated, and the pay is shit, but for Rylan tries to look on the positive side and make the best of it. For instance, rather than fret about the fact that he has to pick up the sweaty locker room jocks of the team players, Rylan looks at it like he GETS to pick up all the sweaty locker room jocks after the hot players sweat their balls off in them... now might be a good time to mention that Rylan has a sweaty jock fetish.Another fringe benefit falls under the category of ?player assistance?, and this is really where Rylan excels. For instance, Trystan Bull, the team captain, wanders into the locker room after practice one day, his muscles obviously sore from a tough workout. Rylan wastes no time in getting right to a relaxing massage, and before he knows what's up, Trystan is sprouting a full fledged boner. Now this is why Rylan took the job in the first place! Hopping into action, Rylan puts Trystan's hard cock in his mouth and Trystan doesn't seem to mind. In fact, it appears that this is just what Trystan had in mind. He bends over and lets Rylan lick his taint and eat his ass, then he lays Rylan on a locker room bench and fucks his face til he comes all over Rylan, the locker room, a sweaty jock, etc. Looks like Rylan has some cleaning to do.Enjoy.",
  "models": [
    {
      "name": "Trystan Bull",
      "person_id": 6196
    },
    {
      "name": "Rylan Shaw",
      "person_id": 18435
    }
  ],
  "release_date": "2012-02-05",
  "scene_id": 34552,
  "series": "T105 - Trystan Bull & Rylan Shaw",
  "tags": [
    "Amateur",
    "Ass Play",
    "Ass to mouth",
    "Athletic",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Rimming"
  ],
  "title": "HEAD JANITOR"
}