{
  "collections": [
    "Samuel O'Toole"
  ],
  "description": "Parker London should know that if you leave Samuel O'Toole alone for too long, eventually his thoughts are going to turn to his cock. You could say he's got a one track mind for that sort of thing. So it should come as no surprise to Parker when he comes out of the shower after a half hour and finds Sammy laid out on the bed with half a chubby. And Parker, being prudent, is not one to waste such a fine specimen of manhood when it is presented before him. So he dutifully kneels down and begins to take Sammy into his mouth. Relaxing his jaw and swallowing Sammy balls deep without gagging. Sammy may have a one track mind, but he also happens to have a stunt double for his cock, so as Parker kneels forward to suck Sammy off, Sammy inserts his own Samuel O'Toole dildo into Parker's surprised ass. Now Parker has Sammy inside him from both ends, and as good as Sammy's dick feels in his mouth, the dildo in his ass feels even better. But it's not the same as the real thing, so Parker begs Sammy to pull out of his mouth and fuck him properly, which Sammy gladly obliges. Bending him over at first, Sammy shows no mercy and Parker writhes in ecstasy as Sammy's cock pulsates in and out of him. Riding him now, Parker is about to burst, and so he leans back and explodes in a hot mess all over Sammy's stomach, before Sammy pulls out and does the same as they both fall out of breath. Looks like Sammy needs to go to the showers now. But don't leave him alone in there for too long, or it'll just start the whole routine all over again. Enjoy! ",
  "models": [
    {
      "name": "Parker London",
      "person_id": 9444
    },
    {
      "name": "Samuel O'Toole",
      "person_id": 10367
    }
  ],
  "release_date": "2012-03-03",
  "scene_id": 34987,
  "series": "S102 - Samuel O'Toole & Parker London",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Ass to mouth",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Smooth"
  ],
  "title": "TWICE THE TOOLE"
}