{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "A lot of people think Brody Wilder is just another meat head.  They see him in the gym, with the muscles and they hear the grunts and growls, and think he's just another badass with a fuck-you attitude.  Well he's not.Brody is actually a sensitive guy who likes making new friends, especially at the gym.  Because of the whole general perception of him, he has trouble finding like-minded dudes to lift with him and spot him for certain weight drills.  When Trent Diesel and Sebastian Young show up in the gym, Brody's stoked because they seem like chill guys who like to power lift and really get a juicy sweat happening.  Brody wants to talk to them, but he gets nervous approaching guys at the gym for some reason.  While trying to work up the nerve, he discovers Trent and Sebastian came to the gym not only to work out, but to suck each other's dicks as well.  Perfect for Brody!  He loves getting his dick sucked.  Sticking his cock in Trent's face is a great opener.  And Brody and Sebastian are becoming fast pals while sharing Trent's luscious mouth.  Soon Sebastian is slurping Trent while Trent continues to enjoy Brody's fully pumped dong.  Brody's glad these boys know how to crank up a nice suck sesh, but when Trent saddles in for a solid ass pounding on the weight bench, Brody knows he's found a couple of great workout buddies.  Watch him slam Trent's tight hole, just before Sebastian takes a turn, ramming his thick cock into Trent for a while before they all max out with a triple-effort load blast. Enjoy!",
  "models": [
    {
      "name": "Brody Wilder",
      "person_id": 17757
    },
    {
      "name": "Sebastian Young",
      "person_id": 18350
    },
    {
      "name": "Trent Diesel",
      "person_id": 18351
    }
  ],
  "release_date": "2012-03-15",
  "scene_id": 35123,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Smooth",
    "Threesome"
  ],
  "title": "The Buddy System"
}