{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Dr. Campbell Stevens runs a quiet, slow-paced medical practice in a secluded, seedy part of a medium-sized college town.  He's a young doctor, young enough for some med school instructors to have called him 'brilliant.' But it isn't Dr. Campbell's beautiful mind young Anthony Romero has come seeking.  It's his rumored affinity for collegiate cock!A couple of guys with whom Anthony plays rugby said this Dr. Campbell will jerk a patient's cock if he lets him.  Anthony was intrigued and decided to investigate for himself.  He's made an appointment under the guise of needing a routine checkup at the start of the rugby season.  After a few pleasantries, Dr. Campbell puts gloves on in order to give Anthony an unwarranted prostate exam.  First it's a measurement of asshole temperature, then a nice finger to feel around for anything usual.  What turns out unusual in the doctor's opinion is the pleasure Anthony takes in having a finger in his tight hole.  From there it's some light cock stroking...nothing to extreme to start with; in some cases that jars the system.  Anthony takes well to having his hardening boner stroked.  That's a good sign to move into some nice dick sucking.  This is Dr. Campbell's specialty and he even encourages patients like Anthony to try it themselves.  Anthony definitely has been salivating over this delicious, hard treat and enjoys 69ing with Dr. Campbell.  But before this good doctor can send this one off with a clean bill of health, he need to implement one final method of administering his own brand of patient care.  He's fucking Anthony's warm ass until they both blow explosive, hot loads all over the examination table.  Visiting the doctor was never this rewarding! Enjoy!",
  "models": [
    {
      "name": "Anthony Romero",
      "person_id": 16627
    },
    {
      "name": "Campbell Stevens",
      "person_id": 18736
    }
  ],
  "release_date": "2012-03-29",
  "scene_id": 35766,
  "series": "NDB - 4386 - Anthony Romero & Campbell Stevens",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass to mouth",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Rimming",
    "Smooth",
    "Uniform"
  ],
  "title": "Private Practice"
}