{
  "collections": [
    "Falcon Studios"
  ],
  "description": "Landon Conrad, Spencer Fox, Dylan Hauser, Jimmy Durano and Connor Maguire are all anxious to get down and party hearty before their service buddy, Chris Tyler, heads out on another deployment. With all the macho bravado and testosterone bouncing off the walls, no one, not even the pizza delivery man, is safe. Dylan is the first to sample the choice slabs of meat from the buffed-up buffet as he begins sucking on Jimmy's horsedick and Chris follows suit guzzling down Spencer's cock. And Landon and Parker London (the pizza guy) get busy quick as they trade off sucking down each other's big salamis. The man action rages on non-stop especially when Dylan adds Connor's cock to his happy meal.  There's a lot more man-on-man action for all the guys to gobble up from their self-made smorgasbord. It's bottoms up for Parker London and Chris Tyler as they yield their assholes to Spencer Fox and Connor Maguire respectively, while Dylan Hauser does double duty getting fucked by Jimmy Durano in his hole and Landon Conrad down his gullet. All the debauched sensations the men are experiencing can be measured by all their moaning and groaning.  The louder it gets, the more pleasurable it is. There's no limit to their shared hedonism and things get real crazy when first Dylan and then Chris get gangbanged. And to make sure Chris gets the send-off he deserves, all his friends salute him with shots of cum.",
  "models": [
    {
      "name": "Landon Conrad",
      "person_id": 13270
    },
    {
      "name": "Spencer Fox",
      "person_id": 18165
    },
    {
      "name": "Parker London",
      "person_id": 13456
    },
    {
      "name": "Chris Tyler",
      "person_id": 18661
    },
    {
      "name": "Connor Maguire",
      "person_id": 17809
    },
    {
      "name": "Dylan Hauser",
      "person_id": 18771
    },
    {
      "name": "Jimmy Durano",
      "person_id": 17864
    }
  ],
  "release_date": "2012-04-13",
  "scene_id": 35822,
  "series": "Hungover",
  "tags": [
    "Anal Sex",
    "Big Butt",
    "Cumshot",
    "Gangbang",
    "Group Sex",
    "Masturbation",
    "Oral Sex",
    "Spitting",
    "Tattoos"
  ],
  "title": "Hungover, Scene #01"
}