{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Sebastian Young is very popular among the ladies around town.  It's no wonder why.  His body is a tight, toned masterwork.  His good friend Brody Wilder and he enjoy cruising the main drag, looking for sweet tail.  They hit the clubs hard and party together like true buddies.  They look out for one another and always have each other's back.  But lately Brody's been CHECKING OUT Sebastian's back...backSIDE that is!Sebastian has known for some time that his good pal Brody sometimes hooks up with dudes.  Brody's actually pretty well known for his cock-sucking abilities.  Sebastian, on the other hand, doesn't have any reputation of the sort.  But the truth is that Sebastian has in FACT sucked on a few nice, hard dicks when the moment's been right, but Brody's never known.  As Sebastian showers, Brody gussies himself up in front of the mirror.  The water and suds really make Sebastian's chiseled features look luscious in Brody's opinion.  He decides to proposition Sebastian.  And with very minimal prodding, he allows Brody to take his hardening cock in his mouth.  Brody works the dick slowly as Sebastian grows harder.  Sebastian maintains a slight reluctance, but Brody's passion persists.  And when the moment becomes just right, Sebastian accepts Brody's cock into his own mouth, then sucks and slurps with delight.  Losing himself in the intensity, Sebastian bends Brody over the counter and inserts his erection into Brody's tight ass.  Watch him pound his pal's hole hard while savoring every intense sensation.  And when Sebastian confesses the truth, that he has indeed indulged in sensuousness with guys before, you'll find out if Brody is even the least bit surprised!   Enjoy!",
  "models": [
    {
      "name": "Brody Wilder",
      "person_id": 17757
    },
    {
      "name": "Sebastian Young",
      "person_id": 18350
    }
  ],
  "release_date": "2012-05-17",
  "scene_id": 35947,
  "tags": [
    "Amateur",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Sex, Lies, and Two Hot Guys"
}