{
  "collections": [
    "Cody Cummings"
  ],
  "description": "Cody Cummings has been a cable technician for some time now. For the most part, the job is pretty mundane. Not too much excitement, nothing really to speak of. But every now and again, he will get sent to a call that gets a little weird.<br><br>Such is the case when he visits Connor Maguire and Darcy Tyler, presumably under the notion that their cable is messed up. Cody immediately sizes up the situation when he comes over and discovers the 'issue' is merely that something has come unplugged. Ever quick on his feet, Cody surmises that something is not on the level, and so he sends Connor to check on the breaker box. As soon as Connor leaves, Darcy enters, and from the start she is giving Cody the 'fuck me' vibe. So much so that Cody unzips his pants and begins to stroke his cock right there in front of her. She doesn't seem the least bit surprised or put off, so Cody continues, forgetting that Connor was just outside. When Cody hears the door open and Connor quickly enters he realizes that he is busted, but rather than react with any sort of malice or outrage, Connor instead seems completely at ease, walking over to Darcy and kissing her full on the lips.<br><br>It is only then that Cody truly understands what he has gotten himself into. Rolling with the punches, he joins them by starting at Darcy's legs and working his way up. They collapse onto the bed, where Connor begins to give Cody head while Darcy puts his dick in her mouth. They switch up, and Cody titty-fucks Darcy while Connor rubs his dick against Darcy and Cody's ass, finally entering her as she simultaneously starts sucking the tip of Cody's cock. Taking him throat deep now, Cody swells to maximum proportion, ready to burst as he explodes all over her while Connor continues to fuck her. Connor pulls out and adds to the sperm cocktail with a massive cumshot that he clearly had been saving for a while.<br><br>Cody plugs in the cable box, and this job is done.<br><br>Enjoy!",
  "models": [
    {
      "name": "Cody Cummings",
      "person_id": 6195
    },
    {
      "name": "Connor Maguire",
      "person_id": 26412
    },
    {
      "name": "Darcy Tyler",
      "person_id": 14697
    }
  ],
  "release_date": "2012-04-11",
  "scene_id": 35988,
  "series": "CC - 6253 - Cody Cummings, Connor Maguire & Darcy Tyler",
  "tags": [
    "Amateur",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Cable Interference"
}