{
  "collections": [
    "Next Door Twink"
  ],
  "description": "'SNAP!' Jay Cloud's foot hit the bag as he fired off a sound-splitting roundhouse kick.  Morgan Shades had signed up for Jay's kickboxing class in hopes of learning a few techniques in case some shit ever went down on a late night in town.  Morgan was scrappy, but he'd learned the hard way that eye gouges and nut punches aren't enough protection every time.  Another young man by the name of Anthony Price was also taking the class.  Anthony was lean and quick.  He seemed to have some prior understanding of the moves Jay was teaching them.Morgan liked the way Jay's body moved.  He was deliberate and calculated.  Morgan knew he was in good hands.  He listened to Jay closely, trying to mimic everything he could.  When Anthony stood up and displayed a few of his own kicks, Morgan was impressed also by him.  These two guys seemed to have an ability to clearly and concisely express the most important principles behind harnessing these deadly skills.  When Jay pulled Morgan and Anthony beside him and told them get on their knees, both gentleman followed orders swiftly.  And when Jay explained that the two must suck his incredibly large cock, Morgan asked no questions.  Anthony seemed excited at the idea.  By the looks of it, Morgan figured Anthony was an expert at this drill.  Soon the three of them were all on the floor, Morgan with Jay's hard, strong dick in his mouth, while Anthony worked on Morgan's throbbing piece.  Then Jay bent Anthony over on all fours, instructing Morgan to lubricate Anthony's ass with his mouth.  When Anthony's tight hole was ready, Jay jammed in his bulging dick, thrusting it hard back and forth.  Morgan stroked his cock and enjoyed the moment.  Then the time came for Morgan himself to sit on Jay's behemoth erection.  Morgan knew this was a lesson he'd never forget.  Enjoy!",
  "models": [
    {
      "name": "Anthony Price",
      "person_id": 18346
    },
    {
      "name": "Jay Cloud",
      "person_id": 10696
    },
    {
      "name": "Morgan Shades",
      "person_id": 18461
    }
  ],
  "release_date": "2012-04-24",
  "scene_id": 35998,
  "series": "NDT - 8125 - Jay Cloud, Morgan Shades & Anthony Price",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass to mouth",
    "Big Loads",
    "Brunette",
    "Condom",
    "Cum swallow",
    "Facial",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "Ground and Pound"
}