{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Marko LeBeau has made an epic mistake; dressing in the Varsity locker room when one is not a member of the Varsity squad is strictly prohibited and the punishment is simple. Not a member, then you get the Member(s). Tyler Torro and Brec Boyd are well versed on the rules. Having come up in the system, they have made the same mistake and been made to serve the requisite punishment, so they have little compassion for Marko as he pleads his case of innocence. Instead Tyler shoves Marko's face into his sweaty crotch, then makes him repeat the same thing on Brec. Whipping their cocks out, Tyler and Brec take turns fucking Marko's mouth and there is nothing he can do about it. Moving along, Tyler bends Marco over a bench, and while Brec shoves his cock in and out Marko's mouth, Tyler does the same with Marko's ass, instantly realizing when Marko shrieks with pleasure that he enjoys it, and that this is maybe not so much punishment after all. So Tyler puts the pedal to the metal and really tries to fuck Marko extra hard, but the harder he tries, the more Marko seems to love it, as he reaches down and begins stroking his own dick. Marko figures if you can't join them, beat them (off), so he pulls on their cocks longingly until they both cum all over him, whereupon he is so turned on that he cums as well. As he does, Marko thinks to himself, ?This is a mistake I'll have to make again very soon.?Enjoy!",
  "models": [
    {
      "name": "Brec Boyd",
      "person_id": 8649
    },
    {
      "name": "Marko Lebeau",
      "person_id": 13548
    },
    {
      "name": "Tyler Torro",
      "person_id": 13869
    }
  ],
  "release_date": "2012-05-10",
  "scene_id": 36032,
  "series": "NDB - 4392 - Tyler Torro, Brec Boyd & Marko LeBeau",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "WRONG PLACE, RIGHT TIME"
}