{
  "collections": [
    "Cody Cummings"
  ],
  "description": "Today we join the our Next Door Stallion as he performs a few off-camera duties.  Cody Cummings happily welcomes many up-and-coming stars to appear on his website regularly, but you may wonder how these talents become final selections.  This time you'll see one Cassandra Cruz drop by Mr. Cummings's office for a bit of an unorthodox interview.It's the Code man's style to videotape important encounters, especially when their nature may become intimate.  Cassandra's not expecting much, maybe show Mr. Cummings her tits and ass.  But she soon finds out there's more to a Cody Cummings interview than just showing a little skin.  After promising her the video will NOT end up posted on his website, Cody proceeds to question the young woman.  After some talk, she's instructed to lift up her shirt, at which point Mr. Cummings feels her breasts over her bra.  Then she's told to turn around, which she does, and is instructed further to lift up her skirt so Cody may have a look at her ass.  But as the two drift closer and closer, the heat rises.  As Cody gently kisses her neck, Cassandra loses track of her surroundings and finds herself with this interviewer's enormous cock in her mouth!  She can scarcely believe the inappropriate nature of this meeting.  And when Cody pushes his bulging erection inside her and proceeds to fuck like a wild animal, oozing sensuality, Cassandra decides that a little intensity during a job interview must be a good thing.Enjoy!",
  "models": [
    {
      "name": "Cassandra Cruz",
      "person_id": 4430
    },
    {
      "name": "Cody Cummings",
      "person_id": 6195
    }
  ],
  "release_date": "2012-05-09",
  "scene_id": 36178,
  "series": "CC - 6257 - Cody Cummings & Cassandra Cruz",
  "tags": [
    "Amateur",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Cruz Control"
}