{
  "collections": [
    "Trystan Bull"
  ],
  "description": "Justin Beal is either brilliantly conniving or he has terribly fortunate luck. Either way, when he gets together with Trystan Bull and Tyler Torro, no matter what they decide to do, he never seems to come out ahead. Like today, when the guys decide to draw lots, Justin pulls the short one and doesn't even seem phased by it. Of course, it could be that with these guys, getting the shaft means actually getting the shaft. Two of them, in fact. Totally used the drill, Justin assumes the position and in no time Tyler and Trystan both have their dicks out. Pressing them together, Justin takes them into his mouth as their heads rub against each other in his mouth. Getting ready to go for the gusto, Trystan bends Justin over as Tyler fucks his face. Justin has been here before and he willingly gives his ass over to Trystan as Trystan pounds him into submission. Tyler decides to get a little bit for himself and they switch, flipping Justin over as Trystan sits on his face while Tyler fucks him missionary and he jacks himself off, cumming as he sucks on Trystan's sweet hole. With the spooge party already started, Trystan and Tyler both turn around and spray Justin down with their meat hoses, covering him in a sticky sweaty mess. As he rubs it into his skin, one gets a feeling that in Justin's mind, this is the kind of ?shaft? he'd gladly take again and again.Enjoy!",
  "models": [
    {
      "name": "Trystan Bull",
      "person_id": 6196
    },
    {
      "name": "Tyler Torro",
      "person_id": 13869
    },
    {
      "name": "Justin Beal",
      "person_id": 19070
    }
  ],
  "release_date": "2012-04-29",
  "scene_id": 36989,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass to mouth",
    "Big Loads",
    "Brunette",
    "Condom",
    "Dark Hair",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "SHORT SHAFTED"
}