{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Brayden White is chilling out with his new friend from school, Kyler Benz.  They each have a quirky, silly sense of humor and have become pretty good friends this semester.  Brayden brought his homework over to finish.  When he hits a wall of writers block while working on an essay, Kyler convinces Brayden to take a study break and snap some digital photos with Kyler's camera phone.  Brayden can't keep a straight face while Kyler goofs around with the camera!  Kyler's antics always give Brayden a case of the giggles.  Brayden suggests Kyler pull down his pants for some crazy underwear shots.  While Brayden poses next to Kyler's crotch, Kyler unexpectedly pulls down his underwear, totally cracking up Brayden!  Even though he's laughing hard on the outside, Brayden liked having his face so close to Kyler's exposed dick.  They switch it up and Kyler takes a few pic's of his own face next to Brayden's cock.  Then out of the blue, Kyler wraps his lips around it!  Brayden is so shocked at first!  But he quickly succumbs to the amazing feeling of that mouth slurping his swelling, Twink boner.  Once Brayden loosens up a little the boys switch to 69ing, pleasuring each other at the same time.  Then it's time for Brayden to take Kyler's large erection in his tight asshole.  You'll see this tender Twink get pounded by his classmate properly.  Then it's the old switcheroo  as Brayden takes a turn fucking Kyler.  This is an after-school special you'll be daydreaming about!Enjoy!",
  "models": [
    {
      "name": "Kyler Benz",
      "person_id": 19210
    },
    {
      "name": "Brayden White",
      "person_id": 19211
    }
  ],
  "release_date": "2012-05-08",
  "scene_id": 37071,
  "series": "NDT - 8127 - Kyler Benz & Brayden White",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Brunette",
    "Caucasian",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Smooth",
    "Twink"
  ],
  "title": "Dick Pics"
}