{
  "collections": [
    "Falcon Studios"
  ],
  "description": "An American in Paris ? French stud and Raging Stallion Studios top model Fran?ois Sagat performs in an extended scene (over 30 minutes long) with Kyle Lewis, one of the most inviting men in the world! Kyle, who has made a name for himself in other top-shelf productions, serves as the perfect switch-hitting partner to Fran?ois. Francois is at his physical peak ? reaching a muscular apex that represents the high point of his career. Not since his debut performance with Huessein in Arabesque has he looked better. This scene is a fitting crown on his spectacular career!The setting is a stunning living room at a luxurious country estate. The surroundings fade quickly from mind as these two proud gay men enjoy each other right before your eyes. Kyle eagerly sucks Fran?ois's thick, uncut cock as his hands follow each and every curve of the Frenchman's hairy, muscled chest. Fran?ois then returns the favor, taking Kyle's cock to the root, his bearded jaw looking great as he tries to take it all! Suddenly, both men cum streams of hot jizz onto each other. Kyle licks his own cum off Fran?ois's chest.Kyle eats Fran?ois's hole ? licking, munching, and grinning from ear to ear. Hard cocks tell us how much these guys are into each other! Kyle, unable to resist the urge to hit third base, shoves his cock up Fran?ois's hole, fucking him fervently in a mesmerizing performance! Kyle quickly offers Fran?ois his ass and spreads his hole wide! Fran?ois needs no convincing as he steps up to the plate and fucks Kyle's begging hole. This is the first major Fran?ois topping scene we have ever filmed. The under shot of his cock sliding in and out of Kyle's chute, both sets of balls hanging in the air, swinging in exact rhythm with each pounding thrust, is something for the ?best of? record book.After getting a real manfuck, Kyle switches back into top mode and throws a real French kiss up Fran?ois's muscled hole. They fuck until it's over, a second full set of roping cum shots leaping thru the air, falling onto each other. They kiss. Fade to white.",
  "models": [
    {
      "name": "Kyle Lewis",
      "person_id": 11060
    },
    {
      "name": "Francois Sagat",
      "person_id": 13184
    }
  ],
  "release_date": "2012-04-25",
  "scene_id": 37121,
  "series": "Member Exclusive",
  "tags": [
    "Big Butt",
    "Cumshot",
    "Foreskin",
    "Hairy",
    "Masturbation",
    "Oral Sex",
    "Rimming",
    "Tattoos"
  ],
  "title": "Francois Sagat and Kyle Lewis "
}