{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Today is a special day, and there is more than one reason to celebrate. Not only is it Cinco de Mayo, but it happens to coincide with Blake Carnage's birthday. So Joey Hard has come up with a way to combine the two: a birthday pi?ata filled with Blake's favorite trinkets. As Joey blindfolds Blake and spins him, Blake takes the stick in his hand and begins to swing. Thinking he'd rather be swinging another kind of stick, he makes contact with the pi?ata and sends its contents spilling onto the floor. Out pours a bunch of dildos, condoms and lube, and upon seeing this, Blake realizes that Joey's ?head? is in the same place. So Blake begins to thank Joey for the birthday gift the best way he can think of: by pulling Joey's pants down and sucking his dick. Joey obliges by face fucking Blake for a while before dropping to his knees and returning the favor. Moving to the sofa, the two of them decide that a 69 is twice the party, so Joey straddles Blake's face while choking down his cock at the same time.Working each other into a horny frenzy, it is obvious where this is heading, and in no time, Joey is bent over for Blake to penetrate his hole. Blake works his cock in and Joey lets out a sigh of sweet pleasure. Blake fucks him hard against the couch and decides he'd like a little dick of his own, so the two of them switch and Blake mounts Joey and rides him like a pro. Stroking his dick as he rides, Blake is ready for climax, and Joey is not far behind, so Blake lets fly with his birthday load, cumming all over himself and the sofa as Joey pulls out just in time and spills his load as well. Looks like the pi?ata isn't the only spilled mess that needs cleaning.Enjoy!",
  "models": [
    {
      "name": "Blake Carnage",
      "person_id": 18843
    },
    {
      "name": "Joey Hard",
      "person_id": 16699
    }
  ],
  "release_date": "2012-05-15",
  "scene_id": 37282,
  "series": "NDT - 8128 - Joey Hard & Blake Carnage",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass to mouth",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Twinko de Mayo"
}