{
  "collections": [
    "Rod Daily"
  ],
  "description": "Justin Chase has been invited over by a mysterious man named Rod Daily.  He met Rod on the bus this morning and was drawn to Rod's cold stare.  He was simply told to wear something light and be prepared for some 'dark fun.'Just didn't quite know what to expect.  Upon arriving at Rod's house, he found a note taped to the front door. 'Come down to my basement,' it said frankly.  Justin stumbled his way through a couple poorly lit rooms and discovered a door that opened to a staircase.  A red glow met him and he went down the stairs in its direction.  There he laid his tender eyes on Rod and his fat cock.  Rod was stroking by himself, sitting in the reddish room.  Justin was surprised but couldn't get any words out.  When Rod turned to shoot him a steely gaze, Justin felt shivers run through his taint, all the way to the head of his fattening dick.  He slowly moved closer to Rod, cautiously.  The idea that Rod had an otherworldly quality to him kept racing through his mind.  When Justin was close enough, Rod reached up and grabbed his head, pulling it close.  Justin licked Rod's muscular, tattooed arm.  Then Justin's face was pushed into Rod's crotch.  Soon, he was sucking Rod's large, throbbing boner.  It was scary to imagine who or WHAT this Rod Daily really was.  But Justin couldn't stop sucking.  He found himself tonguing Rod's tight, sweet asshole.  And then moments later Rod was licking his.  Then Rod began slapping his dick on Justin's ass.  Justin had a hunch on the bus that Rod wanted to fuck.  Now it was happening.  This incredibly hot and wickedly mysterious stranger was pounding Justin like a wild animal.  Suddenly Justin realized he hadn't told anyone where he was going.  Fear rushed through his veins like ice.  But Rod's fat cock felt too good to do anything about it.  See Rod take advantage of this curious fellow in his cold, dark sex chamber.  Enjoy!",
  "models": [
    {
      "name": "Rod Daily",
      "person_id": 9574
    },
    {
      "name": "Justin Chase",
      "person_id": 19198
    }
  ],
  "release_date": "2012-06-08",
  "scene_id": 37327,
  "series": "R121 - Rod Daily & Justin Chase",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass to mouth",
    "Bald",
    "Big Muscles",
    "Blonde",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Fear and Boning in Rod's Basement"
}