{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Making your way in the world today takes everything you've got.  James Huntsman knows firsthand how true this modern adage rings.  He works his ass off every night, always dreaming of a big, bright future.  Tonight he's cleaning up the club after the partying crowds have left.  He's working with an acquaintance by the name of Cody Allen.  James and Cody have worked around each other at the club for a few months now, but they've never had the chance to sit down alone together and have a drink.  As their duties for the evening near completion, James pours himself and Cody a drink to cap off the night.  James has had a long, hard shift and is looking forward to relaxing a bit with Cody before locking up.  What James doesn't know is that Cody's had a crush on him since they met!  When Cody asks him if he wants to fool around to blow off some 'stress,' James is reluctant, but decides a nice blowjob wouldn't hurt.  Before wrapping his mouth around James's giant dick, Cody promises not to tell anyone.  Soon James is positioned over Cody, face fucking him with explosive intensity.  Then when Cody asks James to slide his fat, throbbing cock into his ass, James comes clean.  He tells Cody he's 'never fucked a dude before.' Telling him isn't easy but afterwards James feels a sense of relief, followed by excitement in anticipation of getting to pound a guy's asshole for the first time EVER.  Get ready to witness this incredibly sexy Next Door Exclusive like no one has seen him.  He's a long time bartender who's worked hard enough, especially tonight, to reward himself by finally pulling from the top shelf.       Enjoy!",
  "models": [
    {
      "name": "Cody Allen",
      "person_id": 18559
    },
    {
      "name": "James Huntsman",
      "person_id": 16691
    }
  ],
  "release_date": "2012-06-21",
  "scene_id": 37466,
  "series": "NDB - 4398 - James Huntsman & Cody Allen",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Top Shelf"
}