{
  "collections": [
    "Marcus Mojo"
  ],
  "description": "Marcus Mojo has aspired to become a professional personal trainer for some time now.  He has a passion for refining the male physique and wants to put his skills to good use.  Now he's paying Dr. Adam Hardy a visit to have his final physical assessment before becoming certified.  Dr. Hardy is happy to examine Marcus closely.Dr. Hardy is a consummate professional, never taking shortcuts or half-assing any task.  That's why he's performing every test on Marcus he knows.  That includes a prostate check and an anal thermometer.  For Marcus, these particular tests have produced a firm erection.  Although embarassed a little, Marcus turns over so the doctor can continue with the exam.  But the next procedure seems a bit unusual to Marcus.  Dr. Hardy seems to be paying a bit too much attention to Marcus's cock area.  Marcus is surprised, but excited.  He tells Dr. Hardy he isn't uncomfortable with the touching of the dick at all.  Dr. Hardy is pleased to hear this and wonders if Marcus would be agreeable to letting him suck his hard cock.  He takes a risk and it pays off!  Marcus is the type of patient who's willing to accept a nice, strong suck job from a hot, muscular doctor like Hardy.  And he's willing to reciprocate as well!  Marcus is returning the favor and having a taste of Dr. Hardy's very large, swollen dick.  Then it's time to double check that prostate.  But this time the doctor's using a different tool.Enjoy!",
  "models": [
    {
      "name": "Adam Hardy",
      "person_id": 19182
    },
    {
      "name": "Marcus Mojo",
      "person_id": 6171
    }
  ],
  "release_date": "2012-06-01",
  "scene_id": 37481,
  "series": "M119 - Marcus Mojo & Adam Hardy",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Muscles",
    "Blonde",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Doctor's Orders"
}