{
  "collections": [
    "Raging Stallion"
  ],
  "description": "True to its title, <b>Stoked</b> cranks up the heat from the first framewhere we see Raging Stallion's latest and possibly greatest exclusive,the unbelievably hot Latin superstar Miguel Leonn, whose mammothuncut cock, perfectly ripped body and movie star face roll over youlike a landslide. Wrapped in his strong and sensual embrace we findanother studio exclusive, Raging Stallion's perfect bad boyheartbreaker Shane Rollins. The important thing right now is thatthey're naked and their dicks are as hard as the concrete and brickthat surrounds them. The only question is who's gonna dive for thedong first. Miguel dips down while pulling Shane's snow-white hipsand throbbing rod straight to his full dark lips, gorging on the entirerigid schlong like a starving man.Then it comes time for Shane to show us just how a world-classcocksucker handles a heroic sized slab of fat uncut meat. Truly, at thisjuncture I recommend that you hit pause and take a moment to reallydrink in the true scope of this mammoth manhood. You'll find it helpfulin understanding what is about to happen. At this moment let me waxpoetic upon the thing of perfection and wonder that is Shane's ass.Like two precisely symmetrical gravity defying alabaster orbs, his buttrises up to Miguel's turgid sword and beckons him to penetrate hisdeepest recesses. Now, making sure your favorite lubricant is handy,hit play and you will see a fuck scene that will so etch itself upon yourlibido that its vision will appear whenever your eyes are closed.Miguel is a man with a mission and he plows and plunders thegrowling and writhing stud turned to beast in heat. When the turbocharged cumhots hit we highly recommend that you be seated or thenext thing you will be brushing off of your shoulder will be the floor.",
  "models": [
    {
      "name": "Miguel Leonn",
      "person_id": 19528
    },
    {
      "name": "Shane Rollins",
      "person_id": 19521
    }
  ],
  "release_date": "2004-04-01",
  "scene_id": 37525,
  "series": "Stoked Part 1",
  "tags": [
    "Anal",
    "Boots",
    "Foreskin",
    "Hairy",
    "Interracial",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "latinos"
  ],
  "title": "Stoked Part 1"
}