{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Brendan walks into the gallery as the heart-thumping music of JDSlater steals the show. He spies five hot men admiring the erotic workof San Francisco artist Paul Jermann. Collages and paintings providea backdrop for a 6-man orgy that is the showstopper finale toGayDreams 2. Director Chris Ward introduces 3 new stars for yourviewing pleasure: Ryven (a 24 year old, smooth blond with a massivecock), Robert Marx (a beautiful Hawaiian muscle stud), and AbramRodriguez (a 22 year old filthy pig boy who is gonna make it big in theporn industry!). This is the first movie for all of these guys, and theirenergetic performances reveal the excitement of being in front of thecamera for the first time. This youthful crowd is joined by ourprotagonist Brendan, Andy Dill, and Sean Storm. Shot as only RagingStallion can, this group gang bang is one of the year's pornhighpoints. Peppered with oral cum shots and hard cock fucking, noone is left standing by the end of the scene. And what an end it is.Imagine this: Sean Storm laying on a large marble box with five guysaround him. Ten hands and five cocks help him arrive at the climax ofa lifetime! His ass is pointed towards the camera, his cock standing atattention, with his face contorting as every muscle of his pig boyframe strains to ejaculate! Then it comes, ropes of silky cum shot highout of his rigid cock. Then all the guys around him take his own cumas lube and finger his still quivering asshole--and the camera is rightup there in the midst of it all. You feel that you are right there yourself,watching as the cum drips from his pink hole....",
  "models": [
    {
      "name": "Abram Rodriguez",
      "person_id": 19548
    },
    {
      "name": "Ryven",
      "person_id": 19554
    },
    {
      "name": "Andy Dill",
      "person_id": 19549
    },
    {
      "name": "Sean Storm",
      "person_id": 19555
    },
    {
      "name": "Brendan Austen",
      "person_id": 19550
    },
    {
      "name": "Robert Marx",
      "person_id": 19553
    }
  ],
  "release_date": "2004-10-01",
  "scene_id": 37549,
  "series": "Gay Dreams 2",
  "tags": [
    "Anal",
    "Gang Bangs",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "butt play",
    "cum shots",
    "masturbation",
    "public sex"
  ],
  "title": "Gay Dreams 2, Scene #04"
}