{
  "collections": [
    "Raging Stallion"
  ],
  "description": "GayVN Performer of the Year Nominee Rafael Alencar has one of thebiggest dicks in porn and Francois Sagat (another GayVN Performerof the Year Nominee) loves big dicks. Scene four begins with Rafaelpiercing Francois's lips with his massive cock. Francois drools all overthe monster cock while he bangs it against his lips and chokes on it.Francois's ripped body, covered in soft hair, flexes and bulges in allthe right ways as he swallows Rafael's massive rod. Soon Francoishas released his own dick and pumps away, bringing his foreskin backand forth. The pleasure overwhelms both men and they shoot loadsbefore they even begin to fuck. Cum drips off Francois's beard and allover his muscled chest. The scene continues with Francois bent overand displaying his asshole for Rafael to ravage. Francois has aperfect asshole and its beauty is only enhanced with Rafael's wettongue. Warmed up and ready, the fucking begins. Rafael's dick isboth fat and long and he tears Francois's ass open with an aggressivefuck. We hear no complaints as Francois's guts are filled. With anextra hand, Francois spreads his ass even further, allowing deeperand deeper plunges. Francois flips and allows Rafael to penetrate himwhile they face each other. In this position, both men's bodies arerevealed. Francois's amazing torso ripples with muscles as Rafael'smeat pushes its way in and out of his ass. With a black rope tiedaround his balls, Francois pulls at his sack, further revealing theincredible cock splitting his hole. While Rafael pounds his willing butt,Francois shoots a sweet white load all over his chest, followed byRafael spraying cum all over his asscheeks.",
  "models": [
    {
      "name": "Francois Sagat",
      "person_id": 19576
    },
    {
      "name": "Rafael Alencar",
      "person_id": 19582
    }
  ],
  "release_date": "2007-02-03",
  "scene_id": 37577,
  "series": "Instinct",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "Hairy",
    "Oral",
    "Tattoos",
    "butt play",
    "jockstraps",
    "rimming"
  ],
  "title": "Instinct"
}