{
  "collections": [
    "Raging Stallion"
  ],
  "description": "In a harsh red light, Manuel Torres stands waiting for the attention hedeserves, his dick already hard in his pants. Manuel whips out his bigbrown dick and invites Brett Mathews with a nod to give him somehead. Manuel's huge hard-on is the perfect afternoon snack for Brett,who sucks feverishly. Next Manuel bends Brett over and eats his pinkasshole, shoving his tongue in and out. Then he shoves his face asfar into Brett's ass as he can go, eating him voraciously. Manuel'stongue is replaced with his cock and these two men fuck away. Bretthas a sweet white ass that loves dick. Manuel pounds away, shovinghis long cock in and out. Soon Brett wants to take more control andlays Manuel out so he can ride every inch of his fat cock . Brett'smuscular arms flex with tension as he squats up and down ontoManuel's hard-on. Then Brett is on his back, taking Manuel's cockand begging for more. Fred Faurtin appears out of the backgroundwith a fat erection. When Fred takes his turn inside of Brett's ass,Manuel gets some head and shoots all over the two fuckers. NowFred has his chance at Brett's ass without the distraction of Manuel'shot body. Fred fucks Brett, stretching Brett's hole wider and wider withhis fat cock. Brett stands up to take it from behind and Fred is quick toappease him. Fred shoves his dick in again, this time fucking withmore and more energy. Brett strokes his dick as he gets fucked andshoots a stream of cum all over the floor. Fred keeps fucking until hepulls out to cum on Brett's stretched ass.",
  "models": [
    {
      "name": "Manuel Torres",
      "person_id": 19529
    },
    {
      "name": "Brett Matthews",
      "person_id": 19572
    },
    {
      "name": "Fred Faurtin",
      "person_id": 19575
    }
  ],
  "release_date": "2007-02-03",
  "scene_id": 37581,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Oral",
    "Tattoos",
    "jockstraps",
    "rimming"
  ],
  "title": "Instinct, Scene #08"
}