{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Episode V - Homage to COLT  - Chris and Ben loveshooting Huessein. He is perhaps the top performer in the worldtoday--he walks onto a set and he gets an immediate hard-on that willnot go down no matter what! For a porn director, this is a dream! Andwhat is even better, Huessein is so hot that whoever you pair him withis also gonna be rock hard for the duration! We paired Huessein withnewcomer Justin Christopher. And what a stroke of luck! Justin has acock the size of a telephone pole. It really is huge- this guy has gotmany happy years of sex ahead of him! Justin and Huessein areopposites - Huessein is the massive, hairy, cut Arabian, and Justin isthe gym-toned smooth, light guy. Both are prime examples of theirbody types - a kind of Colt meets Bel Ami! It is a feast for every eye,and you will watch this scene over and over again. Ben Leon'svideography is never better than during the opening muscle worshipscene, where Justin enjoys Huessein's physique from top to bottom.The images caught in the camera go beyond porn into pure art. Yourrewind button will be worn out halfway thru the scene. And we allknow how well Huessein fucks! Chris Ward's favorite moment waswhen Justin was laying down on his back, Huessein fucking away,and Justin's huge hard cock was laying down on his stomach--wellpast his belly button and all the way up to his tits! This scene is amust for all fans of huge cock! We were so impressed withJustin that as soon as the scene was finished we signed him to ayear-long exclusive contract! You will see why when you watch hisperformance!",
  "models": [
    {
      "name": "Huessein",
      "person_id": 19560
    },
    {
      "name": "Justin Christopher",
      "person_id": 19594
    }
  ],
  "release_date": "2006-01-01",
  "scene_id": 37611,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Hairy",
    "Oral",
    "Uniforms",
    "cum shots",
    "jockstraps",
    "masturbation"
  ],
  "title": "Manifesto, Scene #05"
}