{
  "collections": [
    "Raging Stallion"
  ],
  "description": "This triumphant three-way is a compound scene of switch-hitting thatends part one of Lords of the Jungle. It is a long scene shot on twoseparate locations and features three distinct setups.The location is the rocky ground by a volcanic beach--huge blackstones cut apart by rivers of sea, waves smashing high into the airwith the sounds of swaying palms blowing in the background. It isparadise. Collin, Jay, and Matt have little interest in the island scenery.They are focused on each other. As the scene begins, they are drawntogether into an oral interlude in the world's most stunning spot. Theblue sky, the green sea, the white waves and the black rocks allcombine to offer an impressionist's picture of pure beauty. The men,muscles writhing, cocks engorged, asses open...well, you get theidea!After some shocking oral sex, the three men move to a tree and MattCole begins to fuck Jay Black. Matt's cock, hard as a rock, find's Jay'shole an easy target. As he goes in for the bull's-eye, Collin pumps hisown big dick down Jay's throat. The fucking is amazing, with greatphotography as only Raging Stallion can deliver! Long stroke afterlong stroke, the guys change locations, finding an old stumpsurrounded by coconut trees. Here Matt Cole takes a pounding fromboth Collin and Jay! The fucking causes enough friction to start a fire!Finally, after repeated positions (all carefully selected so that you, theviewer can see EVERYTHING) each of our castaways shoots a huge,heavy, globby load of white hot cum.",
  "models": [
    {
      "name": "Jay Black",
      "person_id": 19552
    },
    {
      "name": "Matt Cole",
      "person_id": 19580
    },
    {
      "name": "Collin O'Neal",
      "person_id": 19623
    }
  ],
  "release_date": "2007-02-19",
  "scene_id": 37632,
  "series": "Lords Of The Jungle",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Oral",
    "Outdoor Sex",
    "butt play",
    "tit play"
  ],
  "title": "Lords Of The Jungle, Scene #05"
}