{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Matthieu Paris is plunging his own ass with a large black dildo whileRicky Sinz smokes and watches. As Ricky encourages, Matthieupumps the dildo in harder and harder but then fills his other hole withRicky's dick. Matthieu sucks Ricky off while Ricky spits and thenreaches over for a taste of Matthieu's cock. Ricky spends some timeon Matthieu's balls and then on the massive uncut dick. Ricky andMatthieu exchange tons of spit as they suck each other. WhenMatthieu's hole is ready, Ricky puts a condom on and begins a longhard fuck. Ricky gets aggressive right off the bat and Matthieuresponds by hitting Ricky's chest as he pounds away. They fuck inmultiple positions and end up in doggy style. Antonio Biaggi entersthe scene with his huge cock ready for some attention. As Rickycontinues to pound, Matthieu swallows the new massive dick to thebase, giving Ricky a show. With so much stimulation, Matthieu shootsa load and is followed by Ricky, who covers Matthieu's tattoo with cumand then licks it off. Ricky leaves and lets Matthieu and Antonio havesome time alone. Matthieu's attention goes from Antonio's cock to hisballs, which he ties up with a shoestring and pulls. Antonio loves hisballs being pulled and it makes his dick grow even bigger. He suits upand Matthieu sits on the huge member, riding it. Antonio and Matthieufuck aggressively, Antonio's huge dick tearing up Matthieu's hole.Matthieu shoots a second time with Antonio fucking him. Antonio getsMatthieu to stand on his balls and he shoots a massive load.",
  "models": [
    {
      "name": "Antonio Biaggi",
      "person_id": 19618
    },
    {
      "name": "Matthieu Paris",
      "person_id": 19581
    },
    {
      "name": "Ricky Sinz",
      "person_id": 19617
    }
  ],
  "release_date": "2008-02-19",
  "scene_id": 37633,
  "series": "Savage",
  "tags": [
    "Anal",
    "Boots",
    "Foreskin",
    "Leather",
    "Oral",
    "Tattoos",
    "butt play",
    "jockstraps",
    "rimming",
    "spitting"
  ],
  "title": "Savage"
}