{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Buffed and tattooed Jessie Colter, clad in a jock, armbands and boots, is all by himself in the sex club. He feels himself up and tugs on his cock until Jimmy Durano comes over to join him. Jessie licks around the harness and down his torso until he pulls open the jock to expose Jimmy's throbbing thick meat, working it with his mouth. Jimmy wraps his hot mouth round Jessie's large erection. These hot studs attract Drake Jaden, who quickly joins in and offers up his thick piece, which Jimmy gulps it up. Trey Turner joins the mix, sucking one stiff cock and stroking the other two, allowing his throat to be abused. Mathew Mason in his American porn debut makes it five, and he and Trey go down the line to sample each cock. Finally, Derek Parker arrives and all the studs want a piece of him. They huddle around him in a cock worshipping circle, stroking and jerking each other as they watch Derek getting groped and having his stiff staff sucked by all the guys. He is pierced, ripped, tattooed, bearded and hairy: just what all the guys were looking for. His long perfect cock deserves the attention, and they all give it to him.Three pairs of studs are lined up fucking. Derek Parker is on all fours taking Trey Turners cock in his stunning round ass. Drake Jaden is lying back letting Mathew Mason bury his treasure deep inside him. Jimmy Durano is pushing his cock deep into Jessie Colter's man hole. Each pair looks over at the next turned on by all the action and the hot partner they're fucking with. Watching Mathew's thick cock pound away, gives Trey the idea to flip Derek on his back and slam his meat in further. Jimmy slams loud moans and groans out of Jessie, and they all continue fucking until they're edging. Trey and Jessie want a cum shower. They get the rest of the jerking guys huddled around them anxiously awaiting each load. One after one, they all unload and Trey and Jessie have wads of cum covering them.",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 19634
    },
    {
      "name": "Jessie Colter",
      "person_id": 19636
    },
    {
      "name": "Jimmy Durano",
      "person_id": 19633
    },
    {
      "name": "Mathew Mason",
      "person_id": 19637
    },
    {
      "name": "Trey Turner",
      "person_id": 19635
    }
  ],
  "release_date": "2012-04-06",
  "scene_id": 37642,
  "series": "Fucked Up",
  "tags": [
    "Anal",
    "GroupSex / Orgies",
    "Hairy",
    "Leather",
    "Oral",
    "Tattoos",
    "butt play",
    "jockstraps",
    "masturbation",
    "spitting"
  ],
  "title": "Fucked Up"
}