{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Kieron Ryan, a lean, muscled, edgy man in camouflage pants,harness and yellow jock is horny and cruising the alley. Ben Brown,the beefy, tattooed and bearded hunk passes by, and notices rawsexual energy radiating from Kieron. He stops and gives Kieron asteely glare and a quick nod, urging Kieron to join him in somescorching alley action. Quickly getting down to business, Kieron getson his knees and starts to lick on the bulge in Ben's leather pants.The smell of leather further excites Kieron, who opens Ben's fly with asimple order from Ben to suck his dick. Kieron works Ben's largemember covered with foreskin, gulping it and working the extra skin inevery way. Ben sees Kieron's massive, pierced meat and he wants toswallow it. He gets down on his knees and takes every thick inch tothe base, choking and gagging on it. Kieron pulls Ben up off hisknees and props him up on all fours so he can get a glimpse of Ben'shairy hole. Kieron grabs onto both muscles cheeks of Ben's ass andstarts to plow through the furry hole with his agile pierced tongue.Unable to resist any longer, Kieron drives his cock into Ben, drillingthe fine ass with his massive tool. Urging him on, Ben asks for moreand Kieron grabs onto his hips and dives deeper and deeper intoBen, until Kieron pulls out and shoots two huge loads of cum ontoBen's back and then eats all of it off Ben. Kieron wants to satisfy Bennow and flips him over to suck on the uncut cock some more until Bentakes over and squeezes a load out.",
  "models": [
    {
      "name": "Kieron Ryan",
      "person_id": 19725
    },
    {
      "name": "Ben Brown",
      "person_id": 19727
    }
  ],
  "release_date": "2011-12-09",
  "scene_id": 37769,
  "series": "Alley Cats",
  "tags": [
    "Anal",
    "Hairy",
    "Leather",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "jockstraps",
    "masturbation",
    "rimming"
  ],
  "title": "Alley Cats, Scene #02"
}