{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Enter into the hustle and bustle of a marketplace where a dozen hotArabian men, hairy, built, and beautiful, conduct the business of life--buying and selling goods, gossiping about the village... eyeing eachother and perhaps wondering about unthinkable thoughts... Slowlythe scene thins out as men go back to their houses, some carryingnew guns from the arms merchant, others with carpets, some withfood. Finally five remain--the hottest men of all, each thirsting forsomething more than the cool water of the market fountain...As thecrowds meander through the vibrant marketplace, Huessein, Sarib,Colin West, Joey Russo, and JC stack themselves into a pyramid - ahuman sculpture writhing with cock and ass. What were once furtiveglances become eyes wide with lust! In a beautifully erotic scene,these men enjoy each other with rampant desire, sweat dripping fromevery brow under the hot, broiling sun. This may be one of the bestoral scenes of the year, but it is only the setup for some of the mostamazing fucking we have ever set to film!Indoors we find Huessein - the hottest, hairiest hunk since Bruno ofthe 1970s -fucking Colin West. Huessein comes from Istanbul and isthe real-deal as far as stunning Middle Eastern men go. Colin West, aPlaygirl model with some very sexy tattoos, takes Huessein inposition after position, his white ass always at the ready, open andwide. Huessein, a power-top of tremendous strength, takes fulladvantage of Colin's pink pucker, diving in until cum shots fly fromboth men.",
  "models": [
    {
      "name": "Huessein",
      "person_id": 19560
    },
    {
      "name": "JC",
      "person_id": 19736
    },
    {
      "name": "Sarib",
      "person_id": 19595
    },
    {
      "name": "Joey Russo",
      "person_id": 19660
    },
    {
      "name": "Colin West",
      "person_id": 19734
    }
  ],
  "release_date": "2006-01-01",
  "scene_id": 37778,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "butt play",
    "international",
    "rimming"
  ],
  "title": "Arabesque, Scene #01"
}