{
  "collections": [
    "Raging Stallion"
  ],
  "description": "The azure skies of night dapple a Turkish bath with indigo intensity,and the moon shines brightly against the Saharan sands. Amidststeaming pots of hot water, Huessein and Francois Sagat douse overeach other in a sensual bath meant both to remove the dirt and grit oftheir filthy world and arouse the flesh. The lavishness of the sceneevokes our imagination as porn merges into art. As they bathe eachother and caress, they become more intense, a bond growing by themoment. Framed in a huge archway with massively thick walls, thesemen explore each other's bodies even as we explore with them. Thisis male beauty for the eye of the beholder.Francois Sagat ranks as one of the most stunning men on earth.This Raging Stallion exclusive has become our top draw with hisstaggering performances. He is porn as porn was meant to be. Bornin France and living in Paris, Francois is another one of those menwith mixed heritage that in part has origins in the Middle East. As atribute to his heritage, he tattooed a star and crescent on his back,beautifully framed by his bulging shoulder muscles.Both he and Huessein were very much into each other, practicallychomping at the bit to have sex together. The passion shows in thefinal scene, which plays out in extended form. The oral sex is simplyastounding and the fucking--three wonderful positions in all-- is filmedin top-quality Raging Stallion style. Because of this scene, directorChris Ward decided to dedicate Arabesque to Kristen Bjornand Jean Daniel Cadinot, and the styles of both of these legendaryartists can be seen in this scene. Ward commented that this may bethe single best scene he has ever directed.",
  "models": [
    {
      "name": "Huessein",
      "person_id": 19560
    },
    {
      "name": "Francois Sagat",
      "person_id": 19576
    }
  ],
  "release_date": "2006-01-01",
  "scene_id": 37788,
  "series": "Arabesque",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "international",
    "rimming"
  ],
  "title": "Arabesque, Scene #07"
}