{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Down a long dark hallway Roman Ragazzi is being followed by LoganMcCree. A chase ensues, ending with a confrontation. Roman slamsLogan against the wall and as they rough each other up all thetension melts away. These two stunning men kiss and the chemistrybuilds. The kiss leads to undressing and soon Logan is on his kneesmouthing at Roman's large erection through his Calvin Kleins. Loganpeels back the underwear and reveals Roman's hard dick. As soon asLogan gets a taste Roman stands up to get his hands onto Logan'sbelt and quickly strips him. Roman goes down with his mouth openand fills it with Logan's large, tattooed cock. With pants around theirankles, both men's massive hard-ons rub against each other as theykiss aggressively. Logan flips Roman around for a chance at his ass.With Roman's cheeks spread he reaches in with his tongue andteases Roman's asshole. But Roman wants more cock and returns tohis knees to swallow as much of Logan as he can manage. Thesetwo men with raging erections take the action upstairs where theyreturn to body worship, kissing and touching, and more cock sucking.But the main event is still to come. Roman bends over and allows alittle more ass- eating before Logan suits up and starts to fuck him.When Roman's ass is full of dick Logan really starts to pound away,splitting his hairy ass with his long dick. Once these two start fuckingthe energy builds. As the camera follows Logan's tattooed andmuscular body down his chest to his dick, we find Roman's ass full ofit. Roman's massive chest and arms flex and bend while Logan tearsapart his butt cheeks. In the end Roman and Logan lay down watcheach other jerk off and shoot.",
  "models": [
    {
      "name": "Roman Ragazzi",
      "person_id": 19619
    },
    {
      "name": "Logan McCree",
      "person_id": 19752
    }
  ],
  "release_date": "2008-04-23",
  "scene_id": 37816,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Hairy",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "The 4th Floor, Scene #01"
}