{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "It was an otherwise uneventful afternoon when James Jamesson, Cody Allen, and Julian Smile came together to discuss a simple business proposition.  Cody and Julian found James at a time in their lives when nothing seemed to be working out right.  Neither had any money or prospects for the future.  They needed a quick solution or they would've become destitute.  James offered a quick fix.The deal was easy to understand.  The three of them would meet at a discreet home, high in the hills, and jerk off in front of a video camera for the pleasure of a high-paying, anonymous voyeur.  It sounded like fast, painless money so they agreed.  Everything was going as could have been expected, until James suggested they play with each other's cocks.  Both Julian and Cody were not accustomed to touching other dudes in this manner.  But James explained they would be paid extra for this.  Julian wondered if he could get even more money for sucking Cody's erect dick.  James assured him this would significantly increase the payout, so Julian took the hard boner in his mouth and slurped it sensuously.  James could tell he was enjoying it.  This loosened up Cody enough to have a taste of James's fat cock.  Julian went in for more as Cody bobbed on the stiff member.  Soon Cody was spreading his ass to receive a nice, profitable plowing from James.  The idea of being fucked, right there and then excited Julian.  He offered his own asshole next, but to Cody.  It was a tight hole for such a huge dick, but Cody managed to slide it in.  It was an afternoon of unexpected new experiences.  But how trustworthy is this Jamesson?  A sinking feeling fell over Cody when he heard they wouldn't be paid that day.  And James shot a wink and a wry smile into the camera.  Enjoy!",
  "models": [
    {
      "name": "James Jamesson",
      "person_id": 9526
    },
    {
      "name": "Julian Smiles",
      "person_id": 17772
    },
    {
      "name": "Cody Allen",
      "person_id": 18559
    }
  ],
  "release_date": "2012-06-07",
  "scene_id": 37864,
  "series": "NDB - 4396 - James Jamesson, Julian Smile & Cody Allen",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Red Head",
    "Slim",
    "Smooth",
    "Threesome"
  ],
  "title": "Three for the Money"
}