{
  "collections": [
    "Raging Stallion"
  ],
  "description": "After frolicking in the river, Logan McCree and Vinnie D'Angelo(nonsexualrole) shuck their wet underwear and sunbathe 'Free BodyCulture' style, the German back-to-nature movement. Vinnie soonfinds out that Logan is gay and hides his exposed genitals by turningon to his stomach. Logan describes his first sexual experience in aGerman sex club.Walking through a dark hallway being groped by anonymous hands,Logan makes his way to a sex room. In the center of the room is asling with two men having sex. Raging Stallion Exclusive BoMatthews lies in a sling being rimmed by newcomer Scott Alexander.Scott tongues Bo's hole deeply as a mohawked Logan looks on withheated lust. Scott continues to eat Bo's ass as Bo moans withpleasure. Scott then gets up and gives Bo his massive Black member.Bo sucks it wildly, choking on it. Logan moves over for a better look asScott moves into fucking position. Scott inserts his long, hard cockinto Bo's begging hole. Scott pounds his hole then turns him overdoggy style, until he pulls out and cums all over Bo's ass. He leavesBo there for the next guy. Logan then steps up and feeds Bo his fat,uncut, tattooed cock and Bo sucks it with vigor. Logan bends Bo overa set of old tires and fucks his waiting ass. Logan proves to be anatural power top as he pounds Bo till he explodes. Logan pulls outand erupts on Bo's cum stained body.The story of Logan's sexual escapade has Vinnie worked up. He can'tget off his towel because of his raging hard-on. Logan jokes withhim... maybe you're not 100% straight, which Vinnie reacts to in angerand storms off to the car. On the ride back both men are silent.Returning home, Logan heads out for a walk on his own. Vinnie isfrustrated and confused.",
  "models": [
    {
      "name": "Logan McCree",
      "person_id": 19752
    },
    {
      "name": "Bo Matthews",
      "person_id": 19776
    },
    {
      "name": "Scott Alexander",
      "person_id": 19779
    },
    {
      "name": "Vinnie D'Angelo",
      "person_id": 19780
    }
  ],
  "release_date": "2008-09-24",
  "scene_id": 37883,
  "tags": [
    "Anal",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Leather",
    "Oral",
    "Tattoos",
    "african american",
    "butt play",
    "rimming"
  ],
  "title": "The Drifter, Scene #05"
}