{
  "collections": [
    "Raging Stallion"
  ],
  "description": "In the sewers of San Francisco, The Devil's minions are at work, oneach other. Logan McCree, Tober Brandt, and Dak Ramsey arewaiting for their orders, so while they wait, they play. Logan is on hisknees sucking the cocks of Tober and Dak. Logan's cocksucking ispure animal. Logan goes back and forth between the two,worshipping Dak and Tober's power. Tober is soon returning the favor,while Dak continues enjoying Logan's wet mouth. Logan stands up toget his cock sucked by Dak and gets rimmed by Tober. Dak is the firstto enter Logan's hot hole. Dak is an incredible fuck, going all the wayin and out, making sure Logan feels every inch. Logan can't seem toget enough of Dak's hot tool. While Logan is on his back taking Dak'scock, Tober sucks Logan's dick, making him feel good all over. Dakrolls Logan over, showcasing Logan's incredible tattooed body. Loganis soon sitting down on Dak's hot cock, riding it for all it's worth. Dakshoots over Logan's ass, and then Tober gets a chance at theworked-over hole. Tober's fat cock pumps Logan's hole perfectly,making Logan shoot a hot load. Tober soon follows with cum all hisown.The Devil calls, and it is time for the fun to begin. The three maketheir entrance from a manhole and trail Steve Cruz, waiting to pounceon their prey. They catch Steve and lay a royal beating, leaving Stevein the gutter crying for help. Help arrives, but it is not the kind hewants. 'The Cop' Ricky Sinz needs to take Steve back to get hispayment...",
  "models": [
    {
      "name": "Dak Ramsey",
      "person_id": 19798
    },
    {
      "name": "Logan McCree",
      "person_id": 19752
    },
    {
      "name": "Tober Brandt",
      "person_id": 19799
    }
  ],
  "release_date": "2008-08-04",
  "scene_id": 37911,
  "series": "Hotter Than Hell Part 2",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "butt play",
    "tit play",
    "underwear"
  ],
  "title": "Hotter Than Hell Part 2, Scene #01"
}