{
  "collections": [
    "Raging Stallion"
  ],
  "description": "The gang is all here as the Hell Orgy continues! Devil Ricky Sinz is fucking Tober Brandt on the throne, Steve Cruz is getting hishole explored by Logan McCree, and Dak Ramsey is opening up Alexy Tyler. Cocks and eager holes are all around. The HellOrgy is in full swing!! Logan is getting Steve's furry hole ready. Steve is enjoying this way too much, little does he know what isin store...Placing him on the alter, Steve's hole is about to be put to good use. Dak starts the initiation. Pounding Steve's hole while theothers feel his hot hairy body, Dak holds nothing back on the ass fucking. Logan is next, making Steve crave cock even more.Tober follows, stretching Steve's hole even wider. Then it is the main man's turn... Ricky wants his payment in full. Ricky's hardcock works over Steve's furry hole. The others hold Steve down making him stay put. Dak shoots his load first, followed byLogan, then Alexy adds his cum to the mix, then Tober unleashes his load. Ricky shoots his, making Steve a hairy cum mess.Steve is allowed to shoot, and then his ecstasy becomes his horror as the others start to chant...?one of us, one of us, one of us?.Steve Cruz realizes he will have to endure this for all time.",
  "models": [
    {
      "name": "Steve Cruz",
      "person_id": 19615
    },
    {
      "name": "Dak Ramsey",
      "person_id": 19798
    },
    {
      "name": "Ricky Sinz",
      "person_id": 19617
    },
    {
      "name": "Tober Brandt",
      "person_id": 19799
    },
    {
      "name": "Logan McCree",
      "person_id": 19752
    },
    {
      "name": "Alexy Tyler",
      "person_id": 19797
    }
  ],
  "release_date": "2008-08-04",
  "scene_id": 37921,
  "series": "Hotter Than Hell Part 2",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "Gang Bangs",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "butt play",
    "rimming"
  ],
  "title": "Hotter Than Hell Part 2, Scene #06"
}