{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Throbbing to the drum and bass rhythm, hot muscle studs, and newRaging Stallion exclusives, Latin heartthrob Angelo Marconi andstunning California hunk David Taylor kiss and grope to the drivingrhythm of the beat. Their beautiful, thick lips intertwine as they kissdeep and hard, their tongues searching for the moist, warm recessesof each other's mouths. Angelo sucks on David's neck, finding his'spot' as he massages David hardening member beneath his tightjeans. These two are a stunning pair. They massage each other'shard bodies, and David goes down and works Angelo's nipple, biting,licking, and sucking. Angelo returns the favor, working David'smassive chest on his way down David's happy trail to unleash David'shard man-member. Angelo takes David's beautiful cock eagerly intohis mouth, working it up and down till it's wet from his salivatingmouth. David watches in awe as Angelo devours his manpole to thebase, swallowing and massaging the head with his tonsils. Angelocan't seem to get enough of this hunk's hard member in his mouthor his ass. On all fours atop backstage scaffolding, Angeloarches his back as David mounts him from behind. Angelo backs upinto David, his greedy ass wanting more. David grabs his jock andslowly fucks Angelo's sweet, smooth ass, watching his cock disappearinside the hot, tight hole. Angelo then sits on his top's massive legsand cock and rides David, opening his hole even more. With Angeloon his back, David gets a better angle at pounding his hole. HoldingAngelo by the boots, David thrusts his prick deep inside, increasinghis rhythm till Angelo explodes his white manjuice all over hissmoothed, tanned stomach. David pulls out and pumps his cock till heexplodes all over Angelo's body, their loads intertwining into a pool ofcum.",
  "models": [
    {
      "name": "Angelo Marconi",
      "person_id": 19678
    },
    {
      "name": "David Taylor",
      "person_id": 19813
    }
  ],
  "release_date": "2009-04-16",
  "scene_id": 37975,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "Interracial",
    "Oral",
    "Tattoos",
    "jockstraps",
    "latinos",
    "tit play"
  ],
  "title": "Menace, Scene #03"
}