{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Hot, hairy Raging Stallion Exclusive RJ Danvers is worked up andready to drop to his knees for hot, hairy, Latin Pistol Pete. Pete has abeautifully smooth yet lightly hairy body and RJ takes every inch ofthe Latin stud's savory cock into his mouth making it rock hard. Peteenjoys having his cock sucked as he leans back and lets this youngstud worship his manpole. Pete fucks his throat then turns RJ over toget access to his hairy hole. Pete works RJ's hole, getting it open andwet for his big, uncut, pleasure pole. Pete rims RJ's ass, grabbinghold with his hands and spreading those hairy cheeks so he can gethis tongue deep inside. Pete grinds his dick up against the moist holetill RJ begs to be fucked. Pete fills RJ with his hard meat stick andsoon RJ is pushing back and grinding to get more of this stud's hardfat cock inside. The harder Pistol Pete fucks, the more RJ wants thisstud's manhood deep up inside him. There's no end to RJ's insatiabledesire to be fucked hard and long. A switch of positions and RJ isriding Pete's cock, working the thrusting to his own satisfaction. Pete'scock goes deeper inside RJ's aching manhole. Pete enjoys this rideand he thrusts his hips up to meet RJ's desire. RJ can't get enoughso Pete flips him on to his back so he can stand and power fuck thisinsatiable bottom. Pete grabs hold of RJ's hips and gives him the rideof his life. Pete pounds deeper and harder into the hairy hole and RJopens it wider with his hands so Pete can fit in every last inch. Petepicks up the pace till he pounds RJ to his white, creamy climax. Petepulls out and shoots his load all over RJ's already cream-filled chest.The two collapse under the hot stage lights in a pool of their ownsweat and cum.",
  "models": [
    {
      "name": "RJ Danvers",
      "person_id": 19778
    },
    {
      "name": "Pistol Pete",
      "person_id": 19814
    }
  ],
  "release_date": "2009-04-16",
  "scene_id": 37974,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Interracial",
    "Oral",
    "Tattoos",
    "butt play",
    "jockstraps",
    "rimming"
  ],
  "title": "Menace, Scene #02"
}