{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Real life boyfriends and Raging Stallion Exclusives Steve Cruz andBruno Bond swap spit on top of a stack of stereo speakers that pumpout a deep drum and bass track as they have sex for the first time, onfilm or off. Their deep kisses turn quickly to Steve trailing his spit intoBruno's mouth before he dives in for another passionate kiss. Brunoplays with Steve's ass as Steve savors Bruno's armpit, inhaling hismusky man-scent. Steve grinds his ass into Bruno's crotch, wantingmore. Bruno wants more too as he reaches to get Steve's hard cockinto his mouth. Steve arches forward, filling Bruno's eager mouth withhis manhood. Steve fucks Bruno's face, thrusting his hips into hisrough, bearded, stubbly face. Bruno sucks Steve's cock with gusto,slurping every inch. It's not long before Steve is straddling Bruno'sface so Bruno can get full access to Steve's hot hairy ass and holewith his tongue. Bruno devours Steve's hole as Steve sucks Bruno'shard, stiff cock, the two engrossed in each other as they form a horny,hairy yin/yang. Steve gets Bruno all worked up with spit before heimpales himself on Bruno's throbbing cock. Steve rides Bruno, takinghim deep inside his warm hole. Slowly, Steve's grinding motion picksup to a thumping and bumping pace as he rides Bruno's cock hardand deep. These two are so into each other it's as if we are peekinginto the private lives of the new power duo. Bruno then stands andfucks Steve's hole; the hairs of Steve's ass caress Bruno's cock as itpounds in and out. The pace increases and, in a quick move, Brunoclimbs on top and sits down on Steve's throbbing cock. This powertop instantly turns into a power bottom as he rides Steve's hard cockwith determination. After riding for a while, without breaking stride,Bruno climbs back down and resumes fucking Steve. The two switchback and forth with ease before Steve pounds Bruno to a feveredclimax, spilling his sperm all over his hairy stomach. Bruno gets to hisknees and takes Steve's load all over his hairy, powerful chest. If thisis the couple's first time at sex, you can image them have amazingsex for years to come.",
  "models": [
    {
      "name": "Steve Cruz",
      "person_id": 19615
    },
    {
      "name": "Bruno Bond",
      "person_id": 19812
    }
  ],
  "release_date": "2009-04-16",
  "scene_id": 37973,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Hairy",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "jockstraps",
    "rimming",
    "sixty nine"
  ],
  "title": "Menace, Scene #01"
}