{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Super sexy Pistol Pete and cover Exclusive Bruno Bond enjoy a hotbackstage sex romp. Their two masculine bodies combine in deep,beard-rubbing kisses. They suck each other's mouths, then Peteworks his way down, licking and biting Bruno's hairy chest, nipples,and abs. Bruno grabs Pete from behind, pinching his nipples, kissinghis neck, and grinding his crotch into Pete's backside. Pete grindsback in eager anticipation. Bruno flips Pete around so he can kiss himdeeper, and Pete drops to his knees to bite Bruno's hard cock throughhis jeans. Pete unleashes Bruno's hard cock and wastes no timesucking his engorged member. Pete works the head then plunges histhroat down on Bruno's member. Bruno feels ultimate pleasure as hiscock hits the back of Pete's throat. Lying back on a quilted, blackleather sofa, Bruno shows off his oral talent as he takes Pete's hot,Latin cock deep in his wet mouth. Bruno gets a mouthful and Peteslowly thrusts and fucks Bruno's mouth. Pete sits on Bruno's face asBruno's hot tongue darts in and out of Pete's hot, hairy manhole.Bruno grabs Pete's ass cheeks, opening the hole even further toinsert his tongue deep inside. Soon Pete is grinding his ass back ontoBruno's hard dick. This power top from a previous scene is now theinsatiable bottom, grinding back, wanting more and more. Brunopounds his ass, pulling out slowly to see Pete's gaping hole open andready. Bruno picks up the pace and power-fucks this beautiful Latin'shot hole. Pete looks back in roughneck ecstasy; pushing back,wanting more of this stud's cock. Pete spreads his ass cheeks withhis own hands to open even wider, allowing Bruno to drive his cock indeeper. Pete then straddles Bruno's cock and rides the hard stud tillhis own dick is bouncing in ecstasy. Pete gyrates his hips, sucking inBruno's cock, and he rides it long and hard. Bruno then flips Peteover, holding onto his knee-high riding boots for better access, andjackhammer fucks Pete till they both explode their man juices all overPete's smooth stomach. They collapse in a sweaty man kiss.",
  "models": [
    {
      "name": "Bruno Bond",
      "person_id": 19812
    },
    {
      "name": "Pistol Pete",
      "person_id": 19814
    }
  ],
  "release_date": "2009-04-16",
  "scene_id": 37976,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "Hairy",
    "Interracial",
    "Oral",
    "butt play",
    "jockstraps",
    "tit play"
  ],
  "title": "Menace, Scene #04"
}