{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Double Indemnity - Setting: A high-priced condo in downtownSan Francisco. Open on a balcony with Matt Cole and AnthonyMartinez in silhouette, the afternoon sunlight brightly lighting theskyscrapers of the city. Matt Cole looks like a young Mel Gibson--hemay be one of the best looking men alive! Anthony Martinez is just ashot, but he also has a huge, uncut, massively thick tool between hislegs.Matt and Anthony continue with lots of foreplay featuring kissing andtouching. If you watch their eyes you can see their energy quicklybuilding. Next you expect to see the oral part of the scene, but no.Skip all that and jump straight to rimming. Anthony really eats outMatt's prefect hole--watch it wink aggressively every time Anthonypulls off--almost like it is talking to him, saying 'don't stop!' But moreintrusive things are on the menu, so the rimming does eventuallystop, replaced by....Matt Cole fucking Anthony! But wait a minute! Wethought Matt was our bottom boy! Well, after you see him fuck with hisrock hard rod you will never ask that question again! It's a great fuck,lots of energy and stunning vistas of Matt's beautiful body. Suddenly,just like in the first scene between François and Kyle, Matt is thrownto the bottom position as Anthony drills his thick cock into Matt's hole!Matt goes crazy and the fucking really takes off. This is one of themost energetic scenes ever filmed, and the fucking is over the top!You will not believe it when you see Matt's hole hang open asAnthony's thick tool draws out! The fucking gets faster, even violent,as these two muscle studs lose control. Soon it is all about the cumshot - and Anthony gives us a huge one, leaving Matt, cock still hard,lying on the bed. As Anthony retreats from the room, Matt collapseson the bed, exhausted. He falls to sleep.",
  "models": [
    {
      "name": "Matt Cole",
      "person_id": 19580
    },
    {
      "name": "Anthony Martinez",
      "person_id": 19830
    }
  ],
  "release_date": "2006-09-27",
  "scene_id": 38007,
  "tags": [
    "Anal",
    "butt play",
    "cum shots",
    "rimming",
    "spitting"
  ],
  "title": "Bedroom Eyes, Scene #02"
}