{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Cat on a Hot Tin Roof - A massively endowed three-way isour next scene, featuring ever popular Rafael Alencar, RSS exclusiveMarcos Pirelli, and RSS discovery Alex Corsi. Alex, a man's man fromMilan, Italy towers as a monument to masculinity. His broad, hairychest is irresistible, and his voluptuous ass is a magnet for any top formiles around!The austerity of the surroundings showcases the beauty of the threeperformers. Chris Ward has long wanted to shoot a scene on white.When offered an all white set he jumped at the chance. Add to this agreat jazz track from JD Slater and the scene is set - top notch AGaysfucking away in their natural environment! The results arespectacular.The action starts with Alex gagging on Rafael's giant, 10+ inch cock.He then works on Marcos's dick before taking both in his throat at thesame time! It is too much and all three guys blow their first load! Thenthe fucking begins! Rafael starts off, plowing the way we like it here atRaging Stallion. That means a big, long cock, fucking from tip to root,in and out, non-stop with no end in sight! Alex loves it--he can takeanything! Marcos fucks him in the face at the same time, a doubleended,overwhelming example of full body manipulation. WhenMarcos takes his turn on Alex's rear, Rafael shoves his tool deep intoAlex's face. Rafael really does have one of the best dicks on earth--you can't take your eyes off of it! We let the camera show it off bigtime--if you are a lover of beautiful cock, this scene is designed foryou! After fucking Alex's holes for what seems like hours, Rafael pullsout and drops a load of cum right next to and around Alex's hole--really playing with danger on this one! Alex goes crazy as both he andMarcos shoot their loads.",
  "models": [
    {
      "name": "Rafael Alencar",
      "person_id": 19582
    },
    {
      "name": "Marcos Pirelli",
      "person_id": 19661
    },
    {
      "name": "Alex Corsi",
      "person_id": 19829
    }
  ],
  "release_date": "2006-09-27",
  "scene_id": 38009,
  "series": "Bedroom Eyes",
  "tags": [
    "Anal",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "butt play",
    "cum shots",
    "double oral penetration",
    "masturbation",
    "romance"
  ],
  "title": "Bedroom Eyes, Scene #04"
}