{
  "collections": [
    "Raging Stallion"
  ],
  "description": "An American in Paris - French stud and Raging StallionStudios top model Fran?ois Sagat performs in an extended scene(over 30 minutes long) with Kyle Lewis, one of the most inviting menin the world! Kyle, who has made a name for himself in other top-shelfproductions, serves as the perfect switch-hitting partner to Fran?ois.Fran?ois is at his physical peak - reaching a muscular apex thatrepresents the high point of his career. Not since his debutperformance with Huessein in Arabesque has helooked better. This scene is a fitting crown on his spectacular career!The setting is a stunning living room at a luxurious country estate.The surroundings fade quickly from mind as these two proud gaymen enjoy each other right before your eyes. Kyle eagerly sucksFran?ois's thick, uncut cock as his hands follow each and everycurve of the Frenchman's hairy, muscled chest. Fran?ois thenreturns the favor, taking Kyle's cock to the root, his bearded jawlooking great as he tries to take it all! Suddenly, both men cumstreams of hot jizz onto each other. Kyle licks his own cum offFran?ois's chest.Kyle eats Fran?ois's hole - licking, munching, and grinning from earto ear. Hard cocks tell us how much these guys are into each other!Kyle, unable to resist the urge to hit third base, shoves his cock upFran?ois's hole, fucking him fervently in a mesmerizingperformance! Kyle quickly offers Fran?ois his ass and spreads hishole wide! Fran?ois needs no convincing as he steps up to the plateand fucks Kyle's begging hole. This is the first major Fran?oistopping scene we have ever filmed. The under shot of his cock slidingin and out of Kyle's chute, both sets of balls hanging in the air,swinging in exact rhythm with each pounding thrust, is something forthe 'best of' record book.After getting a real manfuck, Kyle switches back into top mode andthrows a real French kiss up Fran?ois's muscled hole. They fuckuntil it's over, a second full set of roping cum shots leaping thru theair, falling onto each other. They kiss. Fade to white.",
  "models": [
    {
      "name": "Francois Sagat",
      "person_id": 19576
    },
    {
      "name": "Kyle Lewis",
      "person_id": 19827
    }
  ],
  "release_date": "2006-09-27",
  "scene_id": 38006,
  "tags": [
    "Anal",
    "Hairy",
    "Oral",
    "Tattoos",
    "cum shots",
    "rimming",
    "romance",
    "spitting"
  ],
  "title": "Bedroom Eyes, Scene #01"
}