{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Brendan Austen, Martin Mazza, Dean Monroe, and Derrick Hansonare hanging out on a sunlit deck in Wine Country. The sky is deepblue and the vineyards and countryside offer vistas that go for miles.As they drink and talk, their inhibitions become relaxed. Hands areextended, feeling each other up and down, the sexual chemistryblatantly displayed. Soon the guys pair up, Dean and Derrick remainon the deck while Brendan and Martin retire to a floor below.Dean Monroe is a bottom, a real bottom. This is his first RSSappearance and he really went all out to impress us! Derrick Hansonhas worked with us before, but this scene is his crowningachievement. It may be the high point of his fine career! Derrick's dicknever goes soft--it is long and hard, just the way Dean likes it. Deangives a great blowjob--what an image we get of his great face takingin a huge piece of meat! This should be a postcard! He sucks like theexpert he is, showing off his greatest talent! Derrick lifts him up andfucks his ass, delivering powerful thrusts that never seem to stop!This is some very well-filmed fucking and the connection between theguys will leap right out at you! We have our first set of cum shots, andthen we move on.Brendan and Martin are on a set ofwooden steps and in the full light of day they wear sunglasses.Director Chris Ward and cameraman Ben Leon begin this scene byphotographing the action in the reflections in the sunglasses!Brendan lays Martin on his back - offering great views of Martin'sexcellent torso! The fucking is picture perfect--perhaps some of thebest penetration of the entire movie! It really is as good as it gets.Brendan, who took two years off from making movies, comes back tothe biz looking better than ever with a confidence that is the mark of atrue top. He dominates his bottom and loves every minute of it.Brendan's cum shot is spectacular!After cumming, all fourguys get back together and Derrick takes his turn pounding Martin'sass. Off in the distance is Tamas Eszterhazy, watching from thegarden. As these four guys fuck away, Tamas gets more and moreexcited, dropping his pants and beating his beautiful meat. If the guyssee him watching, they don't let on - preoccupied with plowing MartinMazza's insatiable hole! Tamas cums in the distance...then Derrick,then Dean, then Brendan again, and finally Martin shoots his pent-upload!Derrick, Dean, Martin and Brendan now have time tocheck out Tamas and they head over to see what's up. Four-way nowturns to five-way. This scene - directed by Ben Leon -- starts off inthird gear and quickly shifts to overdrive! It is a frenzy and one of thebest-filmed group efforts of all time. Tamas bottoms while the otherguys gang bang him into oblivion. This is a long scene and when thefinal cum shots blow, you will be completely drained in everyimaginable way!",
  "models": [
    {
      "name": "Brendan Austen",
      "person_id": 19550
    },
    {
      "name": "Martin Mazza",
      "person_id": 19828
    },
    {
      "name": "Dean Monroe",
      "person_id": 19574
    },
    {
      "name": "Tamas Eszterhazy",
      "person_id": 19583
    },
    {
      "name": "Derrick Hanson",
      "person_id": 19596
    }
  ],
  "release_date": "2006-09-27",
  "scene_id": 38013,
  "series": "Bedroom Eyes",
  "tags": [
    "Anal",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "butt play",
    "masturbation",
    "rimming",
    "spitting"
  ],
  "title": "Bedroom Eyes, Scene #07"
}