{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Heading back to the Castro, Epoc (Logan McCree in a non-sexualrole) watches the throngs of people walking the street. He seeks thevibrations of pure love. Epoc watches two lovers, David Taylor andLucky Daniels, on the street as they kiss with a soulful connection.They hurry back to their apartment to continue their heartfelt reunion.Epoc perches above and observes. The men move their lovemakingover to the bed and Epoc transports them to his lab for closer study.David kisses down Lucky's body and takes his boyfriend's growingcock into his mouth, getting it all wet. David continues sucking thengoes back up to Lucky's mouth to give him a taste. Lucky enjoysDavid's beautiful, tattooed body and works his way down to David'scock. Lucky loves his boyfriend's big, hard cock in his mouth but hesoon climbs on atop David's hard cock and rides it in pleasure, all thewhile Epoc monitors their lovemaking. David turns Lucky over to getat his beautifully formed round ass. David rubs the length of his cockbetween the cheeks of Lucky's smooth ass. He points his fleshtorpedo at Lucky's hole and slowly pushes it in. David pumps his cockin and out of Lucky's tight hole. Lucky loves the feel of his lover'shard cock deep inside his ass. Lucky turns over so he can seeDavid's face as he is getting pounded. David looks into the pleasureof his boyfriend's eyes as he pounds him to climax. David pulls out hiscock and dumps his love stream all over Lucky. Exhausted, theycollapse on top of one another, and Epoc's desire grows deeper.",
  "models": [
    {
      "name": "Logan McCree",
      "person_id": 19752
    },
    {
      "name": "David Taylor",
      "person_id": 19813
    },
    {
      "name": "Lucky Daniels",
      "person_id": 19933
    }
  ],
  "release_date": "2009-07-09",
  "scene_id": 38248,
  "series": "The Visitor",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Hairy",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "tit play",
    "underwear"
  ],
  "title": "The Visitor, Scene #04"
}