{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Seeking out vibrations, Epoc (Logan McCree in a non-sexual role)combs the streets of the city, invisible to humans. He is pulled to theSan Francisco's Castro. As day turns to night, Epoc comes upon twoguys outside a local bar. The two muscled men are heavily makingout and as their lust builds, they decide to take it a step further in aside alley. The two hot studs, Angelo Marconi and Junior Stellano,enter the alley unnoticed...or so they think. They kiss passionately astheir hormones rage, with Epoc studying their every move. Shirtscome off revealing Angelo's large, smooth chest and Junior's hairy,Italian body. Their kissing evolves and soon Angelo is on his kneessucking Junior's fat cock...insatiable for Junior's man meat. Angelosucks this stud's cock, sending heat waves up Junior's entire body.Junior moans in ecstasy, enjoying the sensation, but that's notenough. Junior pushes Angelo to the wall in this tight alley andunleashes Angelo's uncut beauty. Junior works Angelo's cock, theheat building with no sign of subsiding. Angelo becomes theaggressor and pushes Junior back to the other side of the narrowalley, fucking Junior's mouth. Junior continues to suck Angelo's meatthen turns him over for what he's really after...Angelo's hot smoothass. Junior buries his face between Angelo's ass cheeks and devourshis hole, getting it worked up and ready for his engorged cock. Juniorgets up and rubs his hard and ready cock against Angelo's hot ass.Angelo grinds back in eager anticipation. Junior fumbles with acondom from his pocket, rolls it over his tool and, in no time, is deepinside the Latin stud's tight hole. Angelo moans in pleasure as Juniorfucks him against the brick wall. Junior fucks him deep and hard, fastand slow, and Angelo begs for more. Junior bends Angelo over agarbage can and continues his banging. Angelo takes it and onlywants more. Junior turns Angelo onto his back and, with his legslifted, enters him deeper. Junior picks up the pace and fucks Angelotill he cums all over his own sweaty, smooth stomach. Junior pulls outand releases his white spunk all over the Latin stud. Epoc, standinginches away, feels the intense vibration, almost cumming himself. Thetwo men dress and hurry out. Angelo turns to look back at the alley.He sensed that he was being watched but no one was there...",
  "models": [
    {
      "name": "Angelo Marconi",
      "person_id": 19678
    },
    {
      "name": "Junior Stellano",
      "person_id": 19932
    },
    {
      "name": "Logan McCree",
      "person_id": 19752
    }
  ],
  "release_date": "2009-07-09",
  "scene_id": 38244,
  "series": "The Visitor",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Interracial",
    "Oral",
    "Outdoor Sex",
    "butt play",
    "rimming",
    "tit play"
  ],
  "title": "The Visitor, Scene #01"
}