{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Back in his laboratory, Epoc (Logan McCree) remembers hisjourneys. He's seen many types of mansex, from the causal to thedeep connection of lovers. He's felt what it feels like to touch humanskin but the sex-only vibration of the SM scene was not what he waslooking for. Epoc yearns to feel the connection and higher vibration ofthe lovers' lovemaking. He then remembers the one who could seehis vibration. The mysterious figure from the club! He travels back toEarth to find this mysterious being. Going back to the club, Epocdiscovers him and they connect in an instant. The stranger, DamianRios, steals Epoc away to his apartment. They kiss deeply, joiningtheir energies. Epoc sucks on Damian's cock and savors the taste ashe works his way up and down his shaft. Damian then works Epoc'scock; Epoc allows the pleasure to seep through his veins. The twobodies entwine and Epoc allows Damian to put his dick inside him.Epoc feels instant waves of pleasure spread through his body. Thetwo feed off of each other's vibrations. Epoc then takes his cock andenters Damian's body. Epoc works Damian's hole as he pulsates inand out of him. Epoc, wanting more, moves onto his back andDamian again enters Epoc's body. Damian thrusts his cock deeperinside, increasing his pace. Epoc strokes his engorged memberfeverishly. Damian thrusts harder now, fucking Epoc into ecstasy;Epoc lets out a loud groan as he spews large gobs of cum all overhimself. Damian pulls out and cums all over Epoc. The two mencollapse, intertwined into a glowing mass of energies.",
  "models": [
    {
      "name": "Logan McCree",
      "person_id": 19752
    },
    {
      "name": "Damian Rios",
      "person_id": 19781
    }
  ],
  "release_date": "2009-07-09",
  "scene_id": 38249,
  "series": "The Visitor",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "jockstraps",
    "rimming"
  ],
  "title": "The Visitor, Scene #05"
}