{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Ripped muscular Spencer Reed commands his men - Austin Wildeand Tristan Jaxx - to service his large cock. Tristan and Austin taketurns sucking Spencer's prick until he is rock hard. Tristan is orderedto suck Austin's large cock and is just getting busy when the alarmrings. A red light flashes, warning the men that there is an intruder.Austin and Tristan are ordered to capture the intruder. A hood isquickly thrown over the intruder's head and his hands are shackled asall three masked men examine his body. Finally Master Spencer asksif the intruder would like his cock sucked and commands Austin downon his knees to give the intruder some expert head. Next Tristan goesdown to see how the intruders cock tastes. Ready for more Spencerdecides he wants to see who the intruder is. 'Let's see who this finepiece of meat is.' The hood is removed revealing Junior Stellano tothe three masked men. As they unshackle him, he too wants to seethe faces of these fine bodies and rips Tristan and Austin's masks off.Spencer, angry that Junior has tried to spoil their anonymous gamethen reveals himself. Junior gets a rambunctious hard fuck from eachstud. First Austin, then Tristan, and finally Spencer all filling Junior'shole with their giant cocks. Junior takes it like a champ being that thisis the first time he is getting fucked. Spencer's cock plunges in andout of Junior showing us his gaping hole until all the men blowincredibly thick, far flying loads all over Junior's body.",
  "models": [
    {
      "name": "Spencer Reed",
      "person_id": 19639
    },
    {
      "name": "Tristan Jaxx",
      "person_id": 19791
    },
    {
      "name": "Austin Wilde",
      "person_id": 19930
    },
    {
      "name": "Junior Stellano",
      "person_id": 19932
    }
  ],
  "release_date": "2009-09-10",
  "scene_id": 38277,
  "tags": [
    "Anal",
    "Boots",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Tattoos",
    "butt play",
    "rimming",
    "spitting"
  ],
  "title": "The Trap, Scene #05"
}