{
  "collections": [
    "Next Door Twink"
  ],
  "description": "When you think you hear giggling coming from the campus weight room after school, they're there.  When you realize three students are missing from home room, they're there.  When you get that magic feeling like summer is almost here and boys' imaginations are running wild, they're there, and now's your chance to cum along!Sneak out of class with Lucas Knight, Chance Wylder & Kyler Ash as they convene a secret Twink society inside the old weight training shed.  It's the only place on campus where they know they can let loose and blow off some sexual frustration.  They've been practicing this ritual for a couple months now, and keep getting better at pleasing on another.  They're helping each other mature in their sexual tastes and enjoying the process.  Kyler is a natural-born dick lover and can't get enough of Chance's fat, throbbing member.  And while Kyler slurps hard on it, Lucas gets a mouthful of Kyler's own chubby piece.  Then its Lucas's turn as both Kyler and Chance team up on his bulging cock.  You won't believe the scorching hot action while they kiss and slobber together on his boner.  And things really get wild when Lucas decides to bend Kyler over the exercise ball and drill his tight hole while Kyler takes a face fucking from Chance.  But it's soon Lucas's turn to experience a rock hard pounding.  Before they do though, the three try out something they've had on the meeting's roster for a while now, a triple blowjob formation.  Kyler drew up a diagram of it in Algebra last week and the boys all seemed to agree it was a good idea.  Then Lucas gets what his ass was craving, a nice stiffy, courtesy of his pal, Chance.  If you didn't come out to play sexy, don't go where the wild twinks are!      Enjoy!",
  "models": [
    {
      "name": "Kyler Ash",
      "person_id": 19870
    },
    {
      "name": "Chance Wylder",
      "person_id": 19956
    },
    {
      "name": "Lucas Knight",
      "person_id": 19957
    }
  ],
  "release_date": "2012-06-19",
  "scene_id": 38294,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Facial",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Threesome",
    "Twink"
  ],
  "title": "Where the Wild Twinks Are"
}