{
  "collections": [
    "Raging Stallion"
  ],
  "description": "On his first shore leave in months, David V walks the docks, past ashadowed street vagrant who entices him in a game of chance.Picking cards from a deck, Davidplays the fool - losing to themysterious stranger. Standing up to claim his prize, casting off hisheavy shroud, the illustrated Logan McCree reveals himself. Davidallows Logan to taste his sea-salty skin, his tongue working overDavid's chiseled torso, lingering on his brown nipples. David releasesLogan's hard cock from his flannel pants and Logan drops to hisknees to swallow David's engorged member, giving it a good workingover, slicking it with saliva, teasing David's cum-swollen balls whichhaven't felt release in weeks. Giving as good as he got, David greedilysucks Logan's smooth, fat cock, rubbing and tickling it against hisslightly bearded cheeks. Logan grabs David's hair and gives him theface fucking he so clearly needs, and uses David's tongue for a rimjob that only a desperate sailor can give. He wets Logan's hole andrubs his thick cock against it. David slowly presses his dick inside,increasing his rhythm until he's slamming away at Logan's tight hole.Logan decides that he wants David's smooth ass too and turns thetables. Logan slips right in, showing no mercy, and gives this sailorthe ride of his life. But before letting David shoot his imminent load,Logan aggressively climbs aboard David to furiously fuck himself untilhe unloads gobs of white semen over David's ripped abs. The visionof Logan finally getting his reward sends David over the edge and heblows his wad all over Logan's tattooed chest. David takes a chancewith this vagrant and he wins in spades!",
  "models": [
    {
      "name": "David V",
      "person_id": 19965
    },
    {
      "name": "Logan McCree",
      "person_id": 19752
    }
  ],
  "release_date": "2009-06-11",
  "scene_id": 38313,
  "series": "Port Of Entry",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "Hairy",
    "Oral",
    "Uniforms",
    "butt play",
    "international",
    "tit play"
  ],
  "title": "Port Of Entry"
}