{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Laboring long hours on the docks can get frustrating, especially if youare horny all day long. On a break, dockworker Pistol Pete whittlesaway his time on a piece of wood, watching Tristan Jaxx as he loadscrates. Bored and horny, he decides what he'd like to get back towork--but this time on Tristan! Pete signals Tristan by rubbing his cockthrough his pants and soon Tristan signals back with a rub of his own.Pete approaches Tristan and unzips his co-worker's pants, pull out hislarge uncut cock and places deep down his throat. He licks and sucksTristan's beautiful meaty cock, getting it all wet. Tristan loves his cockbeing worshipped. He holds the back of Pete's head and slowly fuckshis face. Pete takes a step back and unleashes his own tool. Tristandrops to his knees to honor the trade and works on Pete's flesh tool.Pete fucks Tristan's hungry mouth. Tristan can't wait much longer. Hebends Pete over the loading dock and fucks him with his meat stick.Pete loves the feeling of this big hard cock up is ass, the pleasure andpain tearing him apart. Tristan pounds away using Pete as his manslut, working over Pete's tight hole. Tristan flips Pete on to his backand fucks him some more. His large cock seems to get longer andfatter as Pete's tight hole grips his engorged cock. Tristan picks up hisrhythmic fuck pace until Pete can't take it anymore and releases histhick load all over. Tristan pulls out and showers Pete with his semen.They both collapse in exhaustion after their long, hard day.",
  "models": [
    {
      "name": "Tristan Jaxx",
      "person_id": 19791
    },
    {
      "name": "Pistol Pete",
      "person_id": 19814
    }
  ],
  "release_date": "2009-06-11",
  "scene_id": 38315,
  "series": "Port Of Entry",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "Hairy",
    "Interracial",
    "Oral",
    "Tattoos",
    "Uniforms",
    "jockstraps"
  ],
  "title": "Port Of Entry, Scene #03"
}