{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Longshoreman Tristan Phoenix is out cruising the docks for somefresh air. A flash of light in the dark - the glow of a cigarette - revealsthe presence of the rough trade biker Zack Jamison. Liking what hesees, Tristan lets Zack get an eyeful, approaching the leather man onthe pier. Zack exhales the dark smoke from his lungs and stares atTristan, the meaning clear in his eyes. He knows what this sailor isthere for and Zack is more than ready to deliver. Rubbing his fat cockbeneath his tight Levis is all the signal Tristan needs, and in secondsthe service man is gives the kind of service he gives best. He sucksthis hot man's tool, taking it all the way down to the base. Tristansucks Zack's meat for some time before Zack pulls Tristan up for adeep kiss then chows down on his cock. Zack bends Tristan over acrate, spits on his cock and thrusts it deep inside. Tristan moans inpleasure but takes it like a man. Zack just pounds away satisfyingTristan's tight hole. Zack grabs Tristan's hips and drives his hard fatcock deeper and deeper. Zack pulls out, moves Tristan aside andassumes the position with his beefy ass up in the air. Now he wantscock up his ass! Tristan works Zack's manhole with his hardcock. This rough trade stud loves to get fucked. Tristan fucks himdoggie style, bent over the edge of the dock holding on for dear life.Zack wants Tristan's hole again and flips Tristan on his back and givehim his man meat once again, pounding away. Tristan loves thisbiker's fat cock up his ass and moans in ecstasy as he pounds hishole mercilessly until he explodes all over himself. Zack pulls out andunloads his pent up load all over Tristan's sweat-soaked body.",
  "models": [
    {
      "name": "Tristan Phoenix",
      "person_id": 19810
    },
    {
      "name": "Zack Jamison",
      "person_id": 19966
    }
  ],
  "release_date": "2009-06-11",
  "scene_id": 38314,
  "series": "Port Of Entry",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Hairy",
    "Oral",
    "Tattoos",
    "Uniforms",
    "butts",
    "cum shots",
    "jockstraps"
  ],
  "title": "Port Of Entry, Scene #02"
}