{
  "collections": [
    "Raging Stallion"
  ],
  "description": "In a small dank dusty office, rugged wharf boss Bruno Bond goesover the day's receipts when in walks disgruntled longshoremanDavid Taylor. Six four with massive shoulders, David's tattooedmuscles contrast his striking good looks. He is a man who demandsattention and when Bruno doesn't deliver, David takes the situationinto his own hands - sweeping the desk clean, grabbing his boss byhis tie, demanding that Bruno takes notice. Shaken but resolute,Bruno keeps a cool even stare, waiting to see if David will pound himor kiss him. Pushing Bruno to his knees, David wordlessly decides totake what Bruno wouldn't give. He wants to stop working on the dockand start working on some cock. Bruno sucks voraciously with Davidpulling the back of Bruno's head, making a tight lip lock and beforelong, David's balls demand Bruno's attention as well. This muscleman came in for some good head and gets it. No longer discontented,David pulls Bruno up for a passionate kiss, then pushes him downinto his chair for a chance at Bruno's dick. This isn't a disgruntledemployee situation anymore; it's a torrid office affair. They've come toa give-and-take compromise - with Bruno taking it first. Ditching thelast of his suit, he works up David prick. David complies with hisboss's desire and bends him over the desk and giving his all toBruno's hairy hole. David grabs Bruno's hips and rides his boss,pounding him hard and long. David then lies across the desk so thatBruno can sit on top of his big hard cock. Bruno rides his worker stud,then flips on his back until he unleashes his cum all over his hairystomach. Then it's David's turn to unleash his pent up load all over hiskneeling boss's chin and chest - an explosive, tension-releasingending to a week of hard labor at the Port of Entry.",
  "models": [
    {
      "name": "Bruno Bond",
      "person_id": 19812
    },
    {
      "name": "David Taylor",
      "person_id": 19813
    }
  ],
  "release_date": "2009-06-11",
  "scene_id": 38316,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Hairy",
    "Oral",
    "Tattoos",
    "Uniforms",
    "cum shots",
    "fetish",
    "underwear"
  ],
  "title": "Port Of Entry, Scene #04"
}