{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Under the Crescent Moon - In 2005 Chris Ward filmed one ofthe greatest scenes in the history of porn, a two way pairing betweenFrancois Sagat and Huessein. The scene was shot under astunning stone arch. Ward and Team Raging Stallion retuned to thesame location to film another scene between Francesco D'Macho andWilfried Knight--two of the industry's biggest superstars! This longawaitedpairing is the culmination of years of planning.Francesco has never looked better--his stature as an example of theperfect male grows with each passing year and now, he has finallyreached his pinnacle. Wilfried Knight, another hairy stud with the fineand refined contours form of an Arabian stallion, is the idealcomplement to Francesco's awe-inspiring physique.The blue moonlight streams across the terra-cotta tile, bathing thewhitewashed stone in cool colors that contrast sharply with the ragingfire in the fireplace. The desert can become cold at night - fire andpassion being the only tools to keep men warm!Wilfried worships Francesco's cock, taking it deep into his chest as hegags on its length. Francesco then forces Wilfried to rim his ass,showing our cameras his perfect puckered hole. Wilfried needs only alittle persuasion as he chows down on the most famous ass in theworld!Finally, Francesco gets to the point and fucks Wilfred in twospectacular positions. This scene, like the one shot years before, willbe an instant classic and is one of the porn high points of all time!",
  "models": [
    {
      "name": "Wilfried Knight",
      "person_id": 19773
    },
    {
      "name": "Francesco D'Macho",
      "person_id": 19981
    }
  ],
  "release_date": "2010-05-25",
  "scene_id": 38356,
  "series": "Tales Of The Arabian Nights, Part 1",
  "tags": [
    "Anal",
    "Foreskin",
    "Hairy",
    "Oral",
    "Tattoos",
    "cum shots",
    "rimming",
    "spitting"
  ],
  "title": "Tales Of The Arabian Nights, Part 1, Scene #03"
}