{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Arabian Orgy - The grand finale of Tales of the ArabianNights is an hour long five man scene that is actually is an entiremovie unto itself! The setting is an Arab marketplace. The scenebuilds slowly, starting with a single stud - David Dirdam - stroking hisuncut cock while sitting on a pile of oriental carpets. As the cameracaresses Dirdam's beautiful body, in walks 11-inch fuck stud AntonioBiaggi. Dirdham cannot resist Biaggi's dark Moroccan meat and heattempts to suck it down. Before a winner can be determined, incomes Angelo Marconi. The two way becomes a three way as alleyes focus on Marconi's stunning body - a sculpted study of the maleform. It does not get any better than this--unless, of course you havethree such men intertwined in a rhapsody of writhing flesh. Threebecomes four when Tony Aziz joins the fray, and four becomes sixwith the addition of RJ Danvers and Austin Wilde. All six men engagein an amazing display of cock sucking. Then we start the fucking -with RJ Danvers and Angelo Marconi taking it up the ass full throttle,balls to the walls. This is deep, relentless pounding by three angryArab tops! Finally, after multiple positions and angles, cum shotsspray all over RJ's hairy chest.",
  "models": [
    {
      "name": "Angelo Marconi",
      "person_id": 19678
    },
    {
      "name": "Antonio Biaggi",
      "person_id": 19618
    },
    {
      "name": "Austin Wilde",
      "person_id": 19930
    },
    {
      "name": "David Dirdam",
      "person_id": 19982
    },
    {
      "name": "RJ Danvers",
      "person_id": 19778
    },
    {
      "name": "Tony Aziz",
      "person_id": 19979
    }
  ],
  "release_date": "2010-05-25",
  "scene_id": 38362,
  "series": "Tales Of The Arabian Nights, Part 2",
  "tags": [
    "Anal",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "masturbation",
    "rimming",
    "spitting"
  ],
  "title": "Tales Of The Arabian Nights, Part 2, Scene #04"
}