{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Adam Killian is a colossal performer, dark handsome features, hisinked body is perfection for fans of dark and hairy men. Golden boyScott Tanner is in the shadows watching and waiting until he gets thesignal to approach- and then sparks ignite! It is clear from thebeginning these men mean business and energy never wanes. A trulyversatile scene these two are evenly matched and give as good asthey get. Devouring cock with equal intensity, first Scott Tanner takesAdam's thick meat and devours it with fervor driving Adam intomoaning ecstasy. Then its Scott's turn to push Adam down on hisknees. Adam slurps and spits and chokes on Scott Tanner's big fatcock until his throat finally submits. This is no holds barred when itcomes to fuckin'! Adam is first to flip Scott Tanner and make a piggysqueal! All the while slapping it, commanding it and leaving Tannerwailing bent over a suspended St Andrews Cross-- but he takes it likea champ and begs for more! When Scott takes over he's perhaps alittle more kind, rimming that sweet tight brown ass and openingAdam Killian up to receive the loins share. A rare treat for fans ofrimming. Once open and ready he rams his big white cock all the waydeep inside Adam and gives him such an intense pounding that werealize the rimming may have been more selfish on Scott's part. Atrue ass jockey he does not hold back, fucking Adams tight hole andblowing his load all over his meaty thighs. Adam returns the gestureby pushing Tanner down on all fours and giving him a huge loadedmilky facial.",
  "models": [
    {
      "name": "Scott Tanner",
      "person_id": 19758
    },
    {
      "name": "Adam Killian",
      "person_id": 19997
    }
  ],
  "release_date": "2010-05-27",
  "scene_id": 38380,
  "series": "Muscle And Ink",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Oral",
    "Tattoos",
    "butts",
    "cum shots",
    "rimming"
  ],
  "title": "Muscle And Ink, Scene #04"
}