{
  "collections": [
    "Raging Stallion"
  ],
  "description": "In the arid desert, Tony Aziz and Aybars relax, taking refuge from thesun and discussing current events over afternoon tea. Tony asksman-servant Dominic Pacifico to give him a massage. Pacificoobediently obliges. Dominic massages Tony's feet, moving up his leg,massaging the muscles along the way. Tony pulls back his robe toreveal another muscle that needs attention. Dominic looks at Tonyand knows what he's after, intuitively reaching for his thick stiff cock.Speaking in Arabic, Tony tells him 'how good it feels', as Aybarswatches from across the room, stroking his own swelling prick.Dominic begins to suck on Tony's throbbing cock, getting it all wet.Aybars decides to join in, and walks over and facing Tony, presentshis stiff swollen mast to be serviced. Soon, they are wildly suckingeach other. Aybars proves to be a great cocksucker, when he takesboth cocks in his mouth at the same time. A switch of positions, andDominic is on his back, with one cock in his mouth, and one in hisass. Dominic reclines in ecstasy, as Aybars fucks him with his bigthick cock. They take turns swapping positions on the manservant,both getting a chance to penetrate his ass. Tony pounds his cock intoDominic's ass, while Aybars wildly fucks his throat. Positions areswapped once again, and this time it's Tony who is getting poundedby Dominic. Aybars moves in and gobbles Tony's cock while he'sgetting pounded. Dominic proves that he can give as good as he gets,fucking relentlessly until Tony shoots his thick load all over his ownchest. Dominic pulls out and cums all over Tony. This explosion worksAybars up, until more hot white cum is flying, covering Tony in Aybars'and Dominic's hot glaze.",
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 19669
    },
    {
      "name": "Aybars",
      "person_id": 19698
    },
    {
      "name": "Tony Aziz",
      "person_id": 19979
    }
  ],
  "release_date": "2010-06-23",
  "scene_id": 38395,
  "series": "Arab Heat",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "international",
    "rimming"
  ],
  "title": "Arab Heat, Scene #01"
}