{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Trying to remain cool in the heat of the midday sun, Adam Killianrests under a stone arch, wrapped in a tunic. Dipping the ladle intothe urn, he douses his body and the cloth that covers him. He slowlystrokes his hard cock. Unwrapping the fabric, he reveals his beautifulass, coated with the refreshing liquid. Francesco D'Macho enters, anduses the water to cool himself off, but it provides little relief from theconstant heat of his groin. Francesco can't resist Adam's watercovered ass, so he goes in to suck the water droplets from his hole.Francesco rims Adam with blood-thirsty abandon, as Adam poursmore water on them, keeping both cool in the rising heat. Adam andFrancesco suck each others rigid hot cocks, as liquid continues topour and drip from their bodies. Adam then bends Francesco over alarge clay pot, and shoves his fat cock up Francesco's willing hole.Adam rides Francesco's ass, opening it up for harder slamming; whileFrancesco pushes back with greedy pleasure. Francesco lustful greedincreases, and hoists Adam up on the ledge. Slowly fucking Adamfrom behind, he pounds him good and hard. The lust is infectious, asAdam once again has his shot at Francesco's ass, fucking him on hisback. Fucking Francesco hard and long, Francesco moans in purepleasure, as he strokes his hard fat dick. Adam picks up speed, andpounds him harder, repeating the loud slapping of skin, andincreasing their moans of ecstasy. Francesco jerks his cock wildly, ashe shoots a load of his Arabian seed all over his hairy torso. Adampulls out and adds more to the pool of cum, melting over Francesco.Covered in sweat, water and cum, Adam kisses Francescopassionately, finally able to quench the heat between them.",
  "models": [
    {
      "name": "Francesco D'Macho",
      "person_id": 19981
    },
    {
      "name": "Adam Killian",
      "person_id": 19997
    }
  ],
  "release_date": "2010-06-23",
  "scene_id": 38396,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Oral",
    "Tattoos",
    "butt play",
    "international",
    "masturbation",
    "rimming"
  ],
  "title": "Arab Heat, Scene #02"
}