{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Sheltered from the burning sun, Damien Crosse lays back and enjoyshis hookah. He draws smoke into his lungs, exhaling slowly, savoringthe sensation. Bruno Bond joins Damien, sitting at his feet as Damienpasses him the hookah hose. Bruno stares intently into Damien'seyes, as he draws deeply from the pipe. While groping Damien'scock, it becomes obvious he wants more than the hookah to suck on.Bruno proceeds to alternate between Damien's cock and the hookah,blowing smoke from his nostrils, as he inhales Damien's hose. Brunogets Damien's cock all wet, sucking slowly and deeply. He then liftsDamien's legs, and stabs his tongue deep inside the hairy hole,making him moan for more. After Damien has been serviced, hetakes charge by mounting Bruno from behind, and sticking his thickcock, deep inside Bruno's hairy ass. Bruno's face shows a mixture ofpain with immense pleasure, as Damien rides his ass wildly. The twofuck hard and long, building up beads of sweat, soon coating theirbodies. Bruno then lies back onto the Persian carpet and pillows, asDamien fills his hole with his tool. Showing no mercy, he slides histhick member into Bruno's tight pink hole. Bruno can't get enough.Soon, he's riding the thick pony, monitoring Damien's own increasedpleasure as he rides. The pace becomes accelerated, as the rhythmriding the stallion cock makes Bruno erupt, showering Damien withhis cum. Bruno dismounts and laps up his hairy sweaty balls, asDamien jerks his pleasure stick, until he also explodes all over hisbody. They melt together into the heat and air, becoming one.",
  "models": [
    {
      "name": "Damien Crosse",
      "person_id": 19793
    },
    {
      "name": "Bruno Bond",
      "person_id": 19812
    }
  ],
  "release_date": "2010-06-23",
  "scene_id": 38398,
  "series": "Arab Heat",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "international",
    "rimming"
  ],
  "title": "Arab Heat, Scene #04"
}