{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Cool water drips over Antonio Biaggi's lean torso, dripping down to hisfat uncut cock, Alessio Romero sucks the water from Antonio's cock,satisfying his thirst, but increasing his hunger for cock. Alessio sucks,spits and gags on Antonio's prick as he shoves deep into Alessio'sthroat. Soon, they are drenched in water, spit, and sweat. Antonioflips Alessio over on to all fours, so he can get at Alessio's hot hairycrack. As an ass man, he can't help but suck on Alessio's yearningcrevice. He pours water down Alessio's rear and laps up the liquidflowing down the crack, tasting the refreshing sweetness of sweat andwater mixed together. Antonio then takes his monster member, andinserts it swiftly into Alessio's eager ass. Antonio grabs hold ofAlessio's hips, and rides him wildly; the two exuding unbridled lust.The heat of the sun and their pulses build, as Antonio dousesRomeo's ass with water from a pitcher, and fucks him some more.Alessio straddles Antonio and impales himself on the horse cock, hisass swallowing it whole. Alessio braces himself against the back ofAntonio's neck, and riding the horse hung cock, like a bitch in heat.He choke-holds Antonio, as he is mercilessly filled with the hugeappendage, and shivers are sent throughout Alessio's body. Antoniofinishes Alessio on his back, and plows his cock home, causingAlessio's to blast ribbons of white cum all over his hairy and sweatsoaked torso. Antonio then jerks his cock, releasing his thick load allover them both, as they collapse in the hot sun, drenched, exhausted,fulfilled.",
  "models": [
    {
      "name": "Antonio Biaggi",
      "person_id": 19618
    },
    {
      "name": "Alessio Romero",
      "person_id": 20004
    }
  ],
  "release_date": "2010-06-23",
  "scene_id": 38397,
  "series": "Arab Heat",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "butt play",
    "international",
    "rimming",
    "tit play"
  ],
  "title": "Arab Heat, Scene #03"
}