{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Cooling down in an outdoor shower David Dirdam allows the water tocaress his muscular form. The water cascades over his hairy cheeks,and chiseled abs, down to the water-soaked body wrap. His erectcock pushes up against the cloth, as he massages his growing cockthrough the light garb. David's hands roam over his body, caressinghis muscles on his torso, and his ass. Releasing his beautiful, uncutcock, from the confines of the cloth, David slowly strokes it, and let'sthe water fill his ample foreskin. Out from the distance comes TonyAziz, he approaches David and joins him under the refreshing water.The two stare intently at each other, before engaging in a passionatekiss. Tony caresses down David's body with his lips, licking down tothe water flowing off his cock. Tony swallows his member, and sucksthe water from his skin. They take turns sucking each other's cocks,and kissing under the cooling spray. Tony sucks David's juicy cock,and then turns him around to eat his hot ass, trying to quench hishunger. Tony then fucks David under the water, pounding his cock inhis ass as the water rains all over David's back. Tony thrusts hard anddeep, making David moan to be pounded harder. Tony thenpenetrates David, perched on the lid of an urn. Tony slides his cock inan out with ease, as David's beautiful ass welcomes the long strokes.Tony pounds him harder, deeper until the hard pounding makes Davidreleases a load of cum all over his soaked torso. Tony now yearningto be fucked by David's sill hard uncut cock, stands with his back toDavid and pushes his rear back to impale himself, on the thick pieceof manhood. David pounds Tony wildly, lifting him up intermittently, todeep kiss the dark stud. David move his ass back down, and rideshim hard again. David fucks him deep, burying his meat in the juicyass, until Tony jerks his cock and ejaculates all over the stone floor.The desert heat can be oppressive, but the unbridled Arab sex isscorching.",
  "models": [
    {
      "name": "David Dirdam",
      "person_id": 19982
    },
    {
      "name": "Tony Aziz",
      "person_id": 19979
    }
  ],
  "release_date": "2010-06-23",
  "scene_id": 38399,
  "series": "Arab Heat",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "butt play",
    "international",
    "rimming"
  ],
  "title": "Arab Heat"
}