{
  "collections": [
    "Raging Stallion"
  ],
  "description": "<b>Dark Room</b> - Christian Wilde and Paul Wagner begin theirbondage leather play in the confines of a private darkened room. Paullies face-down, spread-eagle on the fuck-bench, suspended bychains, while Christian Wilde works his plump hairy ass with a dildo.Paul's hands are tied, and he moans as Christian pushes the dildodeeper, taking full control of Paul's pleasure, willing him to open upmore. Unable to contain his hard-on, Christian begins to stroke hiscock as he twists and hammers the dildo even further. Paul's ass isstretched out, and Christian watches as Wagner's hole twitches,waiting for the real deal. Christian rubs his thick cock against Paul'shairy blonde crack and makes Wagner beg for it. Penetrating deepinto the round ass, Christian rides his boy, asking him if he likes it.Paul emphatically answers, 'Yes, sir!' Grabbing hold of Paul'sharness, Christian picks up speed, his cock getting thicker and harderwith every thrust. A change of position, with wrists untied, and Paul isriding on top, with Christian now lying on the bench. Christian grabsPaul's furry butt as it bounces and grinds against his pelvis. Needingto fuck his boy as deep as possible, Christian lies Paul back on thebench, and stands, pulling the chains and his boy towards the base ofhis cock. Head cocked back and taking his sir fucking him, it's all Paulcan do but lean back and take it, as he strokes his thick meat. Paulloses all control as Christian pounds deep, spraying cum all over hissweaty hairy chest. Now satisfied that his boy has been well-used,Christian pulls out and releases his own load, mixing more cum intoPaul's soaking wet furry torso.",
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 19970
    },
    {
      "name": "Paul Wagner",
      "person_id": 19700
    }
  ],
  "release_date": "2011-01-14",
  "scene_id": 38438,
  "series": "When Men Fuck",
  "tags": [
    "Anal",
    "Boots",
    "Hairy",
    "Leather",
    "Tattoos",
    "bondage",
    "butt play",
    "butts",
    "cum shots",
    "jockstraps"
  ],
  "title": "When Men Fuck"
}