{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "On a little trip up to the wine country to visit his buddy Chad Logan, Austin Merrick finds himself diving headfirst into Summer's first heat wave.The two have been friends for years, meeting as they both worked as camp counselors during a prior season of scorch.  Austin's always admired Chad's work ethic.  Chad's always diligent and persistent, never procrastinating with a task before him.  They've driven up to Chad's uncle's ranch to hang out and enjoy the mellow breezes atop the hill.  When Chad tells Austin there's a bit of hay they need to move, Austin's happy to help.  But when he sees the workload, Austin has second thoughts.  Chad reassures him and pulls out a couple beers for them to enjoy before getting started.  Chad soon notices a 'chub' forming in Austin's jeans.  Chad figures a quick jerk session may be just in order to rally Austin's spirits.  As they sit in the jeep, stroking their own cocks, Chad makes a grab for Austin's large boner.  Austin reciprocates and not long after is slurping Chad's fat, swollen dong.  A little cramped, they decide to step out and shed all their clothes.  Chad goes in for a taste of Austin's meaty pole and gets quite a mouthful.  Austin has wanted to feel Chad inside him since they first met years back.  While watching Chad enjoy his hard cock, he decides to offer his tight asshole for a nice pounding.  Chad lays down a blanket for his buddy and inserts his throbber.  Don't miss this hot, summer fun as these two gorgeous guys kick off a summer they'll never forget.Enjoy!",
  "models": [
    {
      "name": "Chad Logan",
      "person_id": 17896
    },
    {
      "name": "Austin Merrick",
      "person_id": 20192
    }
  ],
  "release_date": "2012-07-12",
  "scene_id": 38854,
  "series": "NDB - 4401 - Chad Logan & Austin Merrick",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Smooth"
  ],
  "title": "A Roll in the Hay"
}