{
  "collections": [
    "Rod Daily"
  ],
  "description": "Rod Daily is a cop who's seen his share of robberies, nappings, and violent crimes.  Today he's been called to the scene of a possible break in.  Officer Daily's heard rumors about the goings on up at the big house on the hill.  They say wild, strange things happen up there.  A neighbor reported seeing an intruder push his way in through a back door.  When Officer Daily arrives, the scene is quiet, with nobody in sight.  But as he looks closer, signs of forced entry become evident.  The door was clearly kicked open.  Chairs were knocked over, and lamps lay discombobulated on the floor.  But once piece of evidence has piqued Rod's interest.  A pair of freshly worn underwear sat in the middle of the bed.  Rod most keen sense is his olfactory.  He takes several deep whiffs, filling his lungs with musky odor from the underwear.  He sits down in order to be in a more comfortable position to make a determination on where this clue will lead.  Rod knows he needs to get inside the perpetrator's head.  Pulling his cock out, he lets his imagination run wild.  From the smell, whoever wore the undies last has a huge member.  Rod knows the essence of girth, something he learned at the academy.  He strokes his now raging boner, thinking about how bad he wants to catch his man this time.  To simulate this thick dicked mystery assailant, Officer Daily pushes his large, metal flashlight into his ass, enjoying the cold, hard object inside him.  He continues to jerk his cock, working himself up to a breakthrough in the investigation.  And when this cop shoots a massive load onto his own face and into his mouth, you'll see why the precinct has nominated him for 'Best Field Work' 3 years in a row.   Enjoy!",
  "models": [
    {
      "name": "Rod Daily",
      "person_id": 9574
    }
  ],
  "release_date": "2012-08-03",
  "scene_id": 38885,
  "tags": [
    "Amateur",
    "Bald",
    "Big Loads",
    "Big Muscles",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Smooth",
    "Softcore",
    "Solo",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Hard Beat"
}