{
  "collections": [
    "Pistol Media"
  ],
  "description": "Meeting seaside after working out, Kaine Richards, Josh Stewart andRemy Delaine get together for a water-soaked three-way. No smalltalkfor these mates -- it's everybody into the hot tub. The threemodels kiss and grope to the sound of water dripping from their armsand chests. While kissing Remy, blond and rail-thin Josh floats to thesurface of the hot tub, erect prick first. This twink's packing at leasteight inches and Kaine doesn't hesitate to stuff his mouth. He hasenough inches of cock to share, and Kaine invites Remy down for ataste.Turns out that Josh isn't the only one packing prick. Remy rises fromthe pool, proudly showing off his own healthy piece. He loves gettinghead, but seems to like getting his asshole worshipped even more.The three end up in a fevered rim-chain. As the tub party progresses,everyone gets a taste of ass and some cock to lick before the seriousfucking gets underway. Josh, the host, is the first to get rear-ended.After topping buddy Josh, Kaine is eager to demonstrate how good ofa bottom he is, too, and motions to Josh to switch. Remy doesn'tseem to mind as long as someone is blowing him while all this goeson, his hairy thighs catching sunlight. The intensity level gets turnedup six notches when Remy puts it to Kaine, who in turn is putting it toa delighted Josh. Josh needs to hold the edge of the tub with thefurious rocking back and forth. Remy and Kaine use Josh's chest fora cum-rag as Josh pounds it out on the patio concrete.",
  "models": [
    {
      "name": "Josh Stewart",
      "person_id": 20390
    },
    {
      "name": "Kaine Richards",
      "person_id": 20391
    },
    {
      "name": "Remy Delaine",
      "person_id": 19593
    }
  ],
  "release_date": "2002-07-01",
  "scene_id": 39305,
  "series": "Young Bucks",
  "tags": [
    "Anal",
    "Foreskin",
    "GroupSex / Orgies",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "butt play",
    "on the beach",
    "rimming",
    "tit play"
  ],
  "title": "Young Bucks, Scene #01"
}