{
  "collections": [
    "Pistol Media"
  ],
  "description": "Remy Delaine has an outdoor romp with studlet Aiden O'Brien. Thedudes kayak down a lazy Australian backwater, and then dive in thestream before getting down to serious business. Both Aiden andRemy are wearing the briefest of Speedos, and the tiny bits of fabricare stretched teasingly, because both of these guys are very wellhung and immediately hard. Remy's cock has the definite advantage,because it is thick as his wrist in addition to being long and meaty.Remy makes a meal out of Aiden, and Remy's dicksucking lips havenever looked better than here, wrapped around his buddy's meat.Aiden gives Remy's dick a go, too, and he does a pretty admirable jobwith a cock that is obviously a deep-throating challenge. AlthoughAiden's hairless, pink hole looks completely edible, Remy attacks itwith jaw-dropping voracity, planting his nose firmly at the base ofAiden's balls and giving his hole the kind of rimjob that ensures Aidenwon't complain when the time comes for Remy to plant his dick insideit. In fact, when that time does arrive, Remy's foreplay has put Aideninto an almost trance-like state (Remy's tongue and Valium, twinsseparated at birth) that is only broken when Remy's cock breaksthrough Aiden's dripping wet pucker. Insistentprobing, stroking his partner's rock-hard erection, and letting hisnipples be tweaked all the while, Remy is a sexual master. All this atsuch a tender young age; what will this stud be capable of by the timehe's 40? Aiden squeezes out a drenching load with Remy's cock stilldeep inside his ass, and then Remy blasts out a load that lands onAiden's smooth pecs. Remy's handsome face is contorted withpleasure at the end, one of the hottest sights to witness.",
  "models": [
    {
      "name": "Aiden O'Brien",
      "person_id": 20473
    },
    {
      "name": "Remy Delaine",
      "person_id": 19593
    }
  ],
  "release_date": "2002-10-24",
  "scene_id": 39441,
  "series": "Hold Everything",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Jocks / Athletic",
    "Oral",
    "Outdoor Sex",
    "Swimwear",
    "butt play",
    "rimming",
    "tit play"
  ],
  "title": "Hold Everything"
}