{
  "collections": [
    "Pistol Media"
  ],
  "description": "Remy DeLaine and Kurt Johnson, is an amazing match-up of two astonishingly macho Aussies. Kurt is working on his farm in a scenic valley trying to repair a water pump. The sun beats down as Kurt's statuesque body sweats, every muscle gleaming in the sunlight. Remy comes walking over a nearby hill with a dog. The dog is soon forgotten as Remy takes in Kurt's hairy physique. They kiss and touch under a gigantic tree, Kurt groping Remy's crotch, getting his first understanding of the enormous penis within. He drops to his knees, unzips Remy's jeans, Kurt's jaw drops, and he then goes to town sucking what appears to be one of the biggest dicks he's ever seen. Kurt, undaunted, shoves it in his mouth and down his throat for an oral workout that has to be seen to be believed. Remy returns the favor, chowing down on Kurt's slender pecker, but Kurt, understandably, returns to sucking Remy time and time again throughout the scene. They trade eager rims, Kurt burying his face deep in Remy's bubble-butt. But Remy really spreads Kurt's fluffy cheeks apart and stares in awe at the hairy buttcrack briefly before shoving his face in, it's as if he is marveling at what he is about to conquer. And conquer it he does, sliding that crazy-beautiful cock of his all the way in as Kurt grunts and mutters encouragement. Remy rides Kurt's ass but good, eventually flipping him over to dump his spunk on his hairy belly, Kurt brings himself off last, Remy wipes the sweat from his brow, they kiss, and one delightful afternoon in Australia comes to a most satisfying end.",
  "models": [
    {
      "name": "Kurt Johnson",
      "person_id": 20383
    },
    {
      "name": "Remy Delaine",
      "person_id": 19593
    }
  ],
  "release_date": "2004-01-01",
  "scene_id": 39450,
  "series": "Escape From Sydney",
  "tags": [
    "Anal",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "butts",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "Escape From Sydney"
}