{
  "collections": [
    "Austin Wilde"
  ],
  "description": "Anthony Romero and Silas O'Hara are taking a world sex course at the community college.  They figured it would be a good way to delve into some more exotic techniques.  While preparing for a presentation to the class, they discover the ancient practice of Kama Sutra is more complicated than they thought.  None of the formations in their study material are beginner level.  But when third study-group member, Austin Wilde, shows up with a book called 'The Joy of Gay Sex,' the creative juices start flowing!  Austin instructs Silas and Anthony to jump into a fun, easy position for starters.  Austin suggests it might be a little easier to try this stuff without clothes, and the guys disrobe.  Austin's never a wet blanket, so his clothes hit the floor too.  Once the guys are in formation, Austin makes a grab for Silas's already hard cock.  If they're going to be presenting this in front of a classroom full of students, they better know what the fuck they're talking about.  Only acting out the sexual techniques the way they were intended will truly prepare the three.  Silas slides his nice thick boner into Anthony's mouth, just like in the diagram.  Austin joins, giving Anthony a second meaty dick to enjoy.  Soon Silas is balls deep in Anthony's asshole while Austin continues enjoying a sloppy blowjob from Anthony, sometimes leaning down for some passionate smooches.  Then Austin gets a in position for a pounding from Silas and Anthony shoves his dick into Austin's mouth.  But Anthony's ass has been on Austin's mind all semester and he's not letting this study session end without getting a piece.  As the afternoon unfolds the boys learn and have fun in the process.  But the most valuable lesson is that absorbing new information can always be a good fucking time!    Enjoy!",
  "models": [
    {
      "name": "Austin Wilde",
      "person_id": 7497
    },
    {
      "name": "Anthony Romero",
      "person_id": 16627
    },
    {
      "name": "Silas O'Hara",
      "person_id": 17728
    }
  ],
  "release_date": "2012-06-30",
  "scene_id": 39480,
  "series": "A118 - Austin Wilde, Anthony Romero & Silas O\\'Hara",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bald",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Climax",
    "Condom",
    "Dark Hair",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Good Kama"
}