{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Connoisseurs of big cock are going to blow their wads over this hotpairing. Jesse Santana is on his knees before a very well hungValentin Petrov. You have to love something to truly do it well, by thelook on Jesse's face he's in 'hog' heaven. And he knows how tohandle every throbbing inch of Valentin's uncut Russian meat as itdisappears down his throat. Valentin returns the favor with the sameexpert skill. Jesse's equally girthy on the dick department. Even whenJesse flips Valentin to rim him he just can't seem to get enough ofthat uncut prize... he's sucking the balls and cock between his legswith Valentin's ass in the air. DAMN! Just when you think the actioncouldn't get any hotter, the fucking drives into high gear. First withValentin riding Jesse like a bronco, you see right up in there withevery pump and thrust, even though Valentin's throbbing monster isbouncing all over the place with much weight. Jesse takes over andthrust from underneath showing he's the man in control hittingValentin right in the spot! Sweating, grunting and pumping... Jesseflips Valentin on his back as they stay fixated, mesmerized by oneanother until Jesse can't take it any more and blows a white milkyload all over Valentin. But Valentin's not finished yet, he climbs up onJesse and straddles his chest with his legs blowing his load onJesse's face. Jesse reaches up and squeezes out the load, milkinghis foreskin until he gets to the very last drop. The chemistry neverfades even at the end they are smiling and kissing! That's a wrap...but already I'm reaching for the replay button!!",
  "models": [
    {
      "name": "Jesse Santana",
      "person_id": 19662
    },
    {
      "name": "Valentin Petrov",
      "person_id": 20547
    }
  ],
  "release_date": "2011-09-30",
  "scene_id": 39732,
  "series": "Get Some",
  "tags": [
    "Anal",
    "Foreskin",
    "Hairy",
    "Oral",
    "Tattoos",
    "cum shots",
    "masturbation",
    "rimming",
    "spitting"
  ],
  "title": "Get Some"
}