{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Young, urban man--Jason Dean, needs a bathroom fix. This is one ofhis first films, and he will be a major star. His face is beautiful, and hehas a body to match. He is in the toilet for a reason, and it ain't to takea crap! Moments after he arrives, in comes Erik Campbell, a majornew black star who exudes sex with every move. And he has a huge,black, silky-smooth cock to satisfy any waiting hole. A blow job soonturns to an all-anal plowing that practically splits Dean's ass in two.How do these bottoms take such gigantic cocks? Brandon and Wardsure know how to find their men!The volume gets turned up as the movie heads past the two hourpoint and shifts into high gear. Tag is back and joins Jason and Erik tostart off the grand finale of this shocking film. Alternating between Tagand Dean, Erik fucks the snot out of both voracious bottoms,delivering the kind of pounding that you can only find in a MonsterBang movie! They go at it full tilt, getting almost to the cumming pointwhen Michael Brandon comes in to finish off the night. When Brandonenters a room, even the tops become bottoms, and top dog ErikCampbell becomes Brandon's first man-bitch as he opens up Erik'svirgin hole with his world famous cock. It's an initiation that Erik willnever forget! And guess what? He likes it!Move over Erik, and step up Jason Dean! Jason is a bit hesitant--hehas just seen Erik's ass hole pounded to shreds and wonders withboth titillation and trepidation about what is going to happen to him.His hole rises to the occasion and he takes an even greater fuck thanErik! The shots of Jason's open hole are amazing and represent pornat its filthy best. This is a fuck that both Jason and you will rememberforever!Finally Brandon moves over to Tag Adams, who gets the fucking ofhis life while laying in a filthy urinal tub. With both Jason and Erikholding him down, Tag gives us the best performance of his illustriouscareer and allows Brandon to throw a fuck the likes of which you mayhave never ever witnessed before. It is a grand finale that finishes upwith Jason and Erik cumming on Tag's hairy young chest. But thefinal shot is the one for the history books--Michael Brandon aims hisrock hard bazooka directly at Tag, who is kneeling before him,covered in 'straight' man cum with his mouth open and waiting--evenbegging for Brandon's load. As Brandon's rigid tool throbs and shootsthe biggest load of the film, Tag opens wide and Brandon shoves hiscum covered cock all the way down Tag's open throat. At thatmoment, Tag, overwhelmed by this naughty act, shoots his own loadacross the bathroom floor.",
  "models": [
    {
      "name": "Michael Brandon",
      "person_id": 19509
    },
    {
      "name": "Tag Adams",
      "person_id": 19530
    },
    {
      "name": "Jason Dean",
      "person_id": 19857
    },
    {
      "name": "Erik Campbell",
      "person_id": 20705
    }
  ],
  "release_date": "2003-12-01",
  "scene_id": 39785,
  "tags": [
    "Anal",
    "Boots",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Oral",
    "Tattoos",
    "bathroom sex",
    "butt play",
    "western"
  ],
  "title": "Pokin' In The Boys Room, Scene #05"
}