{
  "collections": [
    "Monster Bang"
  ],
  "description": "Nestled the campfire, Michael Brandon and Mike Power are harderthan ever, stroking their glistening rods to red-hot hardness. It's Mike'sturn to tell a story, and he tells it well with his filthy Cockney accent!Mike tells of two farm punks - both covered in tats and really shouldbe fucking in an urban back alley. But they are redneck to the core soyou can only find them out under the Sierra sky. Once the scenebegins we see a familiar face - it's Raging Stallion regular Nick Piston,that streetwise punk who knows how to take a cock up his ass like aman. Nick last appeared in The Red and The Black, and hegave a great performance in Downright Dangerous. We loveNick at Raging Stallion and we are very pleased to present this scene- without a doubt it is the best performance of his career. His partneris Chuck DiRocco (aka Chuck Scott). Chuck is a macho man - amajor piece of tattooed man-meat with a cock the size of a bloatedcucumber. The oral sex is fantastic, with both guys taking load afterload down their throats!Chuck takes Nick and throws him over a horse feeder out on thebackside of the ranch. It becomes a perfect fuck platform for two menin heat. It is a frenzy fuck. It is passionate. It is controversial (theyeventually did get the condoms on), and it will make you reconsiderwhat is your favorite outdoor scene. The best position of this pairing iswhen Chuck lies down and Nick squats on his firm cock, leaning backrevealing two hard cocks, one bouncing wildly as the other drivesdeeper with each thrust! Cum shots like you have never seen end oneof the hottest pairings ever filmed.The story is so good, that Michael blows his load back at thecampfire. But even orgasmic relief is not enough to soften his cock!He keeps on stroking while Mike looks on in amazement.",
  "models": [
    {
      "name": "Michael Brandon",
      "person_id": 19509
    },
    {
      "name": "Nick Piston",
      "person_id": 19515
    },
    {
      "name": "Chuck Di'Rocco",
      "person_id": 19866
    }
  ],
  "release_date": "2005-11-02",
  "scene_id": 39800,
  "series": "Hard As Wood",
  "tags": [
    "Anal",
    "Boots",
    "Hairy",
    "Leather",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "rimming",
    "spitting",
    "underwear"
  ],
  "title": "Hard As Wood, Scene #02"
}