{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Working those long, hard hours can be stressful if it weren't for thelittle helpers to get you though the day. Dominic Pacifico descends tothe basement to check on Diesel Washington and give him a helpinghand. Dominic massages Diesel's big, broad shoulders, distractingDiesel's concentration on the job at hand. Diesel spins around andlocks lips with the hot young stud. Dominic falls to his knees andtakes Diesel's big, hard cock into his waiting mouth. After a goodworking over, Diesel can't wait to get to Dominic's flesh tool. Diesellifts Dominic and places him on the table to get better access to hisbig, uncut dick. Diesel moans as he sucks on Dominic's engorgedmember. After some good sucking, Diesel lifts Dominic's legs so hecan gain access to Dominic's sweet hole. Diesel eats out Dominic'shole till he's squirming and practically begging for Diesel's big cock.Diesel mounts Dominic's hole and pumps him slowly, Dominicenjoying each thrust. Diesel picks up the pace and rams Dominic'shole. He kisses Dominic then picks him up in his big strong arms andfucks him while standing. Back on the table, Diesel continues to giveDominic what he came for. Diesel turns him over and fucks himdoggie style. Dominic can't seem to get enough. Dominic then sits ontop of Diesel and rides his thick cock. Dominic's hard cock flops upand down in syncopation. Dominic jerks his cock until he unloads hisman seed. Diesel gets to his feet and unloads his cumload ontoDominic's chest. Diesel proceeds to lick all of his own cum fromDominic's chest. With all this going on behind the scenes, it's nowonder why Raging Stallion puts out the hottest films.",
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 19669
    },
    {
      "name": "Diesel Washington",
      "person_id": 19986
    }
  ],
  "release_date": "2009-01-14",
  "scene_id": 39841,
  "tags": [
    "Anal",
    "Barely Legal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "Interracial",
    "Oral",
    "butt play",
    "tit play",
    "underwear"
  ],
  "title": "Rear Deliveries, Scene #05"
}