{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Hassan is a quiet boy.  He's enrolled in a military boot camp to develop traits that will make him more assertive and strong willed.  He's been placed under the authority of Sergeant Nubius and Lieutenant Scorpio, two tough, no-bullshit motherfuckers.  Hassan's never lived with any strict rules or standards.  But Nubius and Scorpio don't let any little thing slide.  They mean business and they demand scrupulousness.  When they find Hassan sleeping in, with his belongings scattered about, and his shabby looking bed, they decide to dole out some consequences.  First Scorpio rips off Hassan's underwear, which are definitely NOT military issue.  From the looks of it, Hassan has a pretty sweet ass.  That's good news, considering the type of repercussion for which these two personnel are known.  First Hassan takes a long, thick cock in his mouth from Sergeant Nubius while Lieutenant Scorpio gives Hassan's ass a tonguing and fingering.  After face fucking this fresh recruit, the guys switch so Nubius can shove his firm dick into Hassan's mouth.  Scorpio works his fingers in and around Hassan's tight asshole all the while.  Then Nubius repositions this piece of fresh military meat, and slides his pulsating cock into that moist hole for a proper pounding.  And it's not over until Scorpio levies a reaming as well.  Check out this boot camp banging where this hot, new guy learns a hard lesson from the staff.",
  "models": [
    {
      "name": "Hassan",
      "person_id": 21262
    },
    {
      "name": "Nubius",
      "person_id": 21196
    },
    {
      "name": "Scorpio",
      "person_id": 21195
    }
  ],
  "release_date": "2012-10-25",
  "scene_id": 39916,
  "series": "Nubius, Scorpio & Hassan",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Loads",
    "Big Muscles",
    "Black",
    "Dark Hair",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Military",
    "Oral",
    "Slim",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Standard Fucking Issue"
}