{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Draven Torres is a hard working guy.  He doesn't often slack, but when he does take a break, he makes it count.  Draven's been hired on to assist with an apartment remodel, high in what will be a luxurious penthouse suite.  When his coworker, Luc Bonay, suggests the two take a break to taste each other's cocks, of course Draven is excited.  He's wanted to hook up with hot Luc since they both showed up at the site.  He's finally getting to enjoy what he knew would be a nice meaty dick.    But soon after Luc slides his erection between Draven's eager lips, the job manager, Aron Ridge, returns to the apartment!  And even worse, he's brought an interested buyer, a man going simply by the name Nubius.  Aron catches them in the act and is quite pissed off.  That is until Nubius expresses that if he and Aron can join in, the chance he'll make a solid offer would greatly increase!  Aron is a shrewd business man, so he makes the decision to go 'balls out!' They pull out their already hardening cocks for Luc and Draven to suck.  They're happy to get their mouths around these fatty boners, especially if it means they won't be in trouble.  But that's not all Nubius wants for the bargain.  He's aching to fuck Draven's tight hole.  And Aron's game to pound Luc's ass at the same time.  You won't believe the power these guys deliver when this remodel turns into a high-rise fuck party, Next Door Ebony style!",
  "models": [
    {
      "name": "Nubius",
      "person_id": 21196
    },
    {
      "name": "Luc Bonay",
      "person_id": 21303
    },
    {
      "name": "Draven Torres",
      "person_id": 21304
    },
    {
      "name": "Aron Ridge",
      "person_id": 21305
    }
  ],
  "release_date": "2013-01-03",
  "scene_id": 39926,
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Black",
    "Condom",
    "Dark Hair",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Latino",
    "Oral",
    "Orgy",
    "Tattoo/Piercing"
  ],
  "title": "Deelux Apartment"
}