{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Race Cooper (in a non-sexual role) is training two up and comingfighters, Trent Diesel and Hugo Milano. Race coaches them through afew moves and they kick, punch and grapple on the mat. Race staresat them as their hard sweaty bodies press against each other. Race'smind begins to wonder... he envisions Trent's ass grinding on Hugo'scrotch. In his fantasy, Trent kisses Hugo deeply plunging his tongueinto the Latin studs mouth. He kisses down his body pulls down hisshorts and envelopes his thick hard cock between his wet lips. Trentsucks up and down Hugo's thick shaft tasting his salty sweaty mustyman cock. Hugo moans in pleasure as his buddy sucks him hard anddeep. Hugo grabs Trent hair and fucks him in the mouth. After gettingHugo's cock all wet Trent gets' up and shoves his cock into Hugo'smouth. Hugo sucks and tongues his cock till its drenched in spit. Trentcan't wait to get at Hugo's hot hairy ass, so he bends over in a 69,and eats out his hot Latin buddy's hole. Hugo follows suit and soonthey are rimming each other ass. Hugo wants more than just a rim jobhe pushes Trent down on all fours and shoves his cock up Trent's wethole. Hugo pounds Trent's ass from behind. Trent loves the feel of thisfat Latin cock moving in and out of his quivering hole. But now Trentwants his turn, he flips Hugo over in one quick move and, like that,he's on top! Trent takes his hard cock and slides it up Hugo's wideopen hole, pounding him deep and hard. It's a struggle fordominance-- Hugo flips Trent back onto his once again taking controlpounding deeper until Trent can't take it longer... he shoots a big loadthat flies though the air hitting him in the mouth. Hugo pulls out andjerks his cock until he erupts all over Trent's cum stained torso. Hugocomes down hard on top of Trent and it's reality again as Hugo pinsTrent to the mat. Race is a good trainer, but his imagination is evenbetter a workout.",
  "models": [
    {
      "name": "Hugo Milano",
      "person_id": 20574
    },
    {
      "name": "Trent Diesel",
      "person_id": 20014
    }
  ],
  "release_date": "2010-11-24",
  "scene_id": 40036,
  "series": "Brutal, Part 2",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Foreskin",
    "Jocks / Athletic",
    "Oral",
    "Tattoos",
    "butt play",
    "jockstraps",
    "rimming",
    "sixty nine"
  ],
  "title": "Brutal, Part 2, Scene #01"
}