{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Rusty Stevens is poised to win this year's MMA title against AngeloMarconi, Rusty trains hard but he also has a dark side. Rusty likesrough sex and he looks in many unsavory places to find it. Rustydrives the streets with his pent up lust. He pulls into a local rest stopand popular cruising ground. He enters the empty bathroom knowingthat in a short amount of time he will find his prey. He pulls out hiscock and waits. Rough-trade truck driver Tommy Defendi enters withone desperate need that is to draining his piss-engorged cock.Tommy pulls out his thick member and unleashes a hot hard streamof piss. Rusty can't help but notice. The men lock eyes and Rustyknows he can proceed. He reaches over and shakes out the last dropof piss from Tommy's cock before sinking to his knees and taking hisgrowing cock into his mouth. Tommy grabs the back of Rusty's headforcing his cock down Rusty's throat. Rusty lures Tommy back to thedark dungeon bedroom. Tommy squirms in pleasure as Rusty workshis hole until it's sufficiently wet and open. Rusty flips Tommy over sohe can feed on his fat cock. Rusty chows down on his thick salivacoated tubesteak. He works Tommy up then he goes up and feed himhis throbbing cock. Tommy sucks Rusty cock greedily. Rusty thenpulls Tommy's ass up in the air and switches between sucking hiscock, his ass and fingering his hole. He gets Tommy hole open andready then he stand up and burries his cock deep into Tommy's hole.He rides him trusting his cock down deep into Tommy. He then turnsTommy over and fucks him from behind while Tommy holds ontohanging restraints. Rusty pounds him hard for a while before theyswitch poison and Tommy takes his turn and fuck Rusty on his back.Tommy's thick cock plows in and out of Rusty tight hole. Tommy picksup the pace of his pounding sending Rusty over the edge. Rusty jerkshis cock hard and the pounding increases. Rusty's cock eruptssending clumps of hot white seamen splashing down all over Rustyhairy stomach. Tommy pulls out his cock and spews his load all overRusty's cum filled body. The itch may have been starched if only for amoment.",
  "models": [
    {
      "name": "Tommy Defendi",
      "person_id": 19774
    },
    {
      "name": "Rusty Stevens",
      "person_id": 20013
    }
  ],
  "release_date": "2010-11-24",
  "scene_id": 40039,
  "series": "Brutal, Part 2",
  "tags": [
    "Anal",
    "Bodybuilder",
    "Hairy",
    "Jocks / Athletic",
    "Oral",
    "Tattoos",
    "butt play",
    "fetish",
    "jockstraps",
    "rimming"
  ],
  "title": "Brutal, Part 2, Scene #04"
}