{
  "collections": [
    "Raging Stallion"
  ],
  "description": "After a hard work out Race Cooper (in a non-sexual role) comes intothe looker room and begins to roughhouse Angelo Marconi, this setsAngelo off, he snaps and yells at Race, obviously hitting a nerve. Inhis mind, Angelo is transported back to a painful memory from backin his college days when he was taken advantage of in the shower. On that day itwas his teammates Phenix Saint and Brandon Bangs that came intoshower all pissed off and jealous of Angelo, the team's star player.'Some people think their shit don't stink.' Phenix has had enough andpushes the Angelo up against the wall, he yells at Brandon to holdhim down. Phenix tells Angelo he going to get what he deserves.That's when he shoves his hard cock into Angelo's ass. Angelo criesout in pain as his teammates ravage his hole. Phenix fucks Angelohard and fast fucking as if trying to fuck some sense into histeammate. Phenix pounds his hole then switches off so his buddy cantake his turn. Brandon jumps in and pounds Angelo's smooth ass.'Look he likes it, he's hard!' Phenix yells to his buddy. Phenix grabsAngelo's cock and strokes it. While Brandon pounds Angelo's assPhenix pumps his teammate Angelo's cock until he spews cum allover himself. After Angelo cums Phenix has no mercy, he switchesplaces with his buddy and rams his hard cock back into Angelo'stightened hole-- Angelo's screams echo in the tiled room. Phenixfucks with aggressive furor taking out his frustration on Angelo's hole.Phenix explodes an angst-ridded load all over Angelo's back. He thenpushes Angelo to his knees as his buddy Brandon shoots all overAngelo's face. Brandon has one last lesson to teach his teammateand that is his fist across his jaw. Brandon clocks Angelo square inthe mouth sending him smack down on the cold wet tile. Angelo spitsblood as his teammates step over him.",
  "models": [
    {
      "name": "Angelo Marconi",
      "person_id": 19678
    },
    {
      "name": "Brandon Bangs",
      "person_id": 20572
    },
    {
      "name": "Phenix Saint",
      "person_id": 20575
    }
  ],
  "release_date": "2010-11-24",
  "scene_id": 40038,
  "series": "Brutal, Part 2",
  "tags": [
    "Anal",
    "Bodybuilder",
    "GroupSex / Orgies",
    "Jocks / Athletic",
    "Tattoos",
    "bathroom sex",
    "butts",
    "controversial",
    "cum shots"
  ],
  "title": "Brutal, Part 2"
}