{
  "collections": [
    "Marcus Mojo"
  ],
  "description": "Marcus Mojo is on set for a photo shoot for what should be a day like any other. Only today, the photographer, Bradley Rose, seems a little distracted once on set. Maybe it's the way Marcus' ripped physique looks in those jeans and cowboy hat, or maybe it's just how this guy likes to work, but for whatever reason, Bradley is clearly taken back by this assignment. Awed at Marcus' abs and massive arms, Bradley can't help but get a little handsy. And as Marcus undresses for the photos, it becomes obvious that Bradley is particularly enamored with the blue eyed model. Finally he just boldly puts Marcus' cock in his mouth and snaps off a few pics. Feeling Marcus swell inside his mouth, Bradley decides to put down the camera and focus on something more pressing. Running his hands up Marcus' chest, he peels off his own clothes and now stands naked before Marcus. No slouch himself, Marcus is impressed with Bradley's body and grabs his firm cock before lowering himself to suck Bradley off. Bradley grows as big as he's ever been, so Marcus leans up against a rail and Bradley enters from behind. Marcus lets how a groan of pleasure at Bradley's cock slides in, and the two of them fuck against the rail before moving to the floor. Bradley kisses Marcus as he pumps him missionary and Marcus jacks off with his legs spread, erupting as Bradley's dick pounds his asshole. The site of this is too much for Bradley to contain, so he pulls out and cums all over Marcus' stomach, as the sun beats down and makes its way westward. Enjoy!",
  "models": [
    {
      "name": "Bradley Rose",
      "person_id": 20164
    },
    {
      "name": "Marcus Mojo",
      "person_id": 6171
    }
  ],
  "release_date": "2012-07-27",
  "scene_id": 40163,
  "series": "M127 - Marcus Mojo & Bradley Rose",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Muscles",
    "Blonde",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "All Hands on Dick"
}