{
  "collections": [
    "Marcus Mojo"
  ],
  "description": "Back in the locker room, just after Marcus Mojo assisted Campbell Stevens in scoring the game winning goal for the Spittle County Warblers, there's a special kind of quiet.  Campbell is first in and takes a few moments to enjoy to silence.  He reflects on the game: the slow motion feel of that final shot, the crowd's jubilation, and the way it all came together for him and his friend Marcus.  Their friendship is old and beautiful.  Campbell just wishes he had the guts to tell Marcus how hard his dick gets whenever Marcus is around.  After congratulating each other with the usual smiles and 'knucks,' Marcus heads into the shower.  Campbell notices Marcus's jock is left behind, resting on the changing bench.  He decides to have a sniff.  The smell conjures images of what Campbell imagines it would be like to take Marcus's stiff cock in his mouth.  Campbell grows a boner and pulls it out for some tugging.  When Marcus catches him, Campbell is quite startled!  But to his chagrin, Marcus offers his pal a taste of the real thing.  Scarcely believing he isn't dreaming, Campbell wraps his soft lips around the erect member and slurps fervently.  Then it's Marcus's turn as he goes down to pleasure Campbell.  And before these boys put their street clothes back on, Marcus wants a fat, hard dong in his tight hole.  Campbell is VERY glad to accommodate!  Watch these hockey rink studs indulge their wildest post-game fantasy as they both work up to popping off a couple more shots!Enjoy!",
  "models": [
    {
      "name": "Campbell Stevens",
      "person_id": 18736
    },
    {
      "name": "Marcus Mojo",
      "person_id": 6171
    }
  ],
  "release_date": "2012-08-10",
  "scene_id": 40876,
  "series": "M129 - Marcus Mojo & Campbell Stevens",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock Strap",
    "Masturbation",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Goalie Shots"
}