{
  "collections": [
    "Cody Cummings"
  ],
  "description": "Cody Cummings is, for the most part, a regular guy.  What most would find unusual is the fact that he does indeed make a living as a porn star.  Despite many potentially lucrative offers to engage in private, one-on-one encounters with fans, Cody remains fairly stand-offish in his personal life.  On this rare occasion, however, he's stepping beyond his usual boundaries to the delight of a very passionate fan, a man by the name of Donny Wright.The morning after a relaxing but fun night out at a popular club, Cody receives a call from his trusted friend Paul.  Paul explains that Donny, another friend of Paul's, noticed Cody at the club.  Paul continues to explain that Donny is, in fact, a devout fan and member of Cody's site.  As Paul talks, Cody reflects, vaguely remembering the gentleman.  He recalls Donny as being strikingly handsome, but only had the chance to observe him for a moment.  Paul tells Cody that Donny has inquired about receiving a private massage from Cody.  Paul assures Cody that the limits have been explicitly communicated.  Donny agreed that should this private massage take place, it would be a simple rub down with nothing else involved.  But Donny did request that Cody be nude.  Upon Paul's solid endorsement for Donny, Cody agrees to perform the service.  After getting the news, Donny promptly arrives at Cody's designated location.  Cody sits down for a moment to explain the boundaries.  Donny cordially agrees to stay within them, and the two strip down.  As Cody oils up his hands, Donny catches a glimpse of his incredibly sexy, totally nude masseur.  Cody works on Donny's back first, taking his time, finding the knots and working them out.  For seconds that seemed to Donny like blissful eternities, Cody's fat dick brushes against Donny's hand.  When Cody has Donny flip over, the massive erection that's been growing shows itself.  Cody works around it, trying to focus on giving a nice, regular old massage.  He inadvertently brushes it several times though.  After a bit of this, Donny can't hold out any longer.  He tactfully asks Cody to stroke it.  Cody agrees, reiterating that there be no touching coming from Donny.  You'll observe as Cody begins by gently taking Donny's pulsating cock in his hand.  Watch him go from stroking firmly but with care, to using both hands to jerk hard on the behemoth boner.  It's Cody fulfilling the fantasy of a true fan by giving him the most sensual rub ending you can imagine.      Enjoy!",
  "models": [
    {
      "name": "Cody Cummings",
      "person_id": 6195
    },
    {
      "name": "Donny Wright",
      "person_id": 14218
    }
  ],
  "release_date": "2012-08-08",
  "scene_id": 40888,
  "series": "CC - 6270 - Cody Cummings & Donny Wright",
  "tags": [
    "Amateur",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Smooth",
    "Softcore",
    "Tattoo/Piercing"
  ],
  "title": "Master Masseur"
}