{
  "collections": [
    "Raging Stallion"
  ],
  "description": "As the sun sets over the city Leandro Fernandez and Ezequiel Solare kissing on the balcony of beautiful old building. As the city headsinto night these two find each others bodies more than engaging.Leandro is first on his knees undressing young Ezequiel slowly andworking his cock from soft to rock hard. Ezequiel has a smooth youngman's body with natural pecs and arms and a smile that broadens asLeandro sucks his cock. When the boys move from the balcony to thecouch we get a chance to study Leandro's muscular body and his bigcock. They work each other up into sixty nine position before Leandrotakes the lead and shoves his dick up into Ezequiel's lightly hairy butt.Leandro fucks aggressively before giving up his own ass to Ezequiel.Leandro's ass squeezes a load out of Ezequiel who then kisses andLeandro until he spills his own load. Alejandro and Erik Hassan arekissing in the living room and discovering each other's bodies. Theyare already stripped to the waist allowing us to see the beautifulmuscles on their chests and hiding their erections. Alejandro is bigand broad while Erik is younger and slimmer but equally defined. Erikis quick to get Alejandro's big dick in his mouth and he works it deepinto his throat as Antonio Biaggi arrives and joins this steamy team.Antonio is tall and muscular and between his legs lives a huge 11'uncut dick. Antonio gets on his knees and takes turns swallowingAlejandro's massive cock as Erik watches. These three men switcharound again and again so everyone gets a taste before Erik offers uphis hole for play. Antonio dives in tongue first before they lay Erik outon the table to pound him from both ends. Alejandro feeds Erik dickwhile Antonio feeds his asshole. These two men take turns tearing upErik's butt, switching off again and again giving Erik tons of pleasureand tons of dick. As Antonio pounds away Alejandro stands up andblows his load all over Erik followed by Erik covering his own chestwith his spooge. Antonio pulls out and adds the cum puddle on Erik'schest.",
  "models": [
    {
      "name": "Ezequiel Sol",
      "person_id": 20905
    },
    {
      "name": "Leandro Fernandez",
      "person_id": 19978
    }
  ],
  "release_date": "2010-01-01",
  "scene_id": 40926,
  "series": "Anoche",
  "tags": [
    "Anal",
    "Oral",
    "cum shots",
    "masturbation",
    "rimming",
    "romance",
    "sixty nine"
  ],
  "title": "Anoche, Scene #02"
}