{
  "collections": [
    "Raging Stallion"
  ],
  "description": "The grand finale of Passport is a two-way that becomes a three-way that becomes a four way and finally climaxes as a full-on five-way! Each of these, however, is a full scene. We start with Manuel Torres, a RSS exclusive who has been one of Raging Stallion's best-kept secrets! Raging Stallion is actively expanding its New York model base, and Manuel is one of our east coast Latin heartthrobs. This man has sex appeal! Combine that with Panama-born Mario Cruz and the fireworks can't be stopped! These guys suck and fuck and you know they are proud Latin gay studs--fucking for your enjoyment (and for ours!!!). After many wonderfully-filmed positions, enter Enrico Vega--another New Yorker long associated with Raging Stallion (remember him in Stick it In!). The fucking gets really good as Enrico revs up his engine, but he saves the best for Pete Ross, who now enters the fray, propping his sweet ass up in the air for a Latin gang bang. Cum shots start to fly, but before they all finish, in comes Miguel Leonn for the final pairing of the film--a romantic revisit between himself and Pete Ross. Their orgasms are like a symphony finale, the entire orchestra driving home the final note in Passport to Paradise. A stunning crescendo and a dramatic entry into the library of Gay Adult Erotica.",
  "models": [
    {
      "name": "Enrico Vega",
      "person_id": 19865
    },
    {
      "name": "Manuel Torres",
      "person_id": 19529
    },
    {
      "name": "Mario Cruz",
      "person_id": 19625
    },
    {
      "name": "Miguel Leonn",
      "person_id": 19528
    },
    {
      "name": "Pete Ross",
      "person_id": 19856
    }
  ],
  "release_date": "2004-11-01",
  "scene_id": 41190,
  "series": "Passport To Paradise",
  "tags": [
    "Anal",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Oral",
    "Tattoos",
    "cum shots",
    "latinos",
    "masturbation",
    "rimming"
  ],
  "title": "Passport To Paradise"
}