{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Rick McCoy is on the wrestling team but struggling to achieve success. He asks Varsity member Tyler Torro for some pointers one day after regular practice. Tyler agrees soon enough he's putting Rick through different paces and structuring some drills to increase Rick's stamina. Rick and Tyler both begin sweating from the extra work and the close quarters. During one takedown, Rick notices Tyler's cock is thick and hard under his wrestling tights. Somewhat inadvertently, he rubs the shaft and to his surprise, Tyler responds with a moan of satisfaction that tells Rick not to stop. So he doesn't, ripping Tyler's tights off and exposing his trimmed physique, Tyler's cock pops out in Rick's face, and Rick wastes no time gagging it down his throat in a slobbery throbbing mess. Tyler grows hotter and harder by the minute, and since no one is around, he turns Rick over and plunges his cock into Rick's ass as he braces Rick's chest with one solid arm bar. Pushing Rick's face into the mat as he pounds away at his ass, Tyler is tingling, and Rick can feel a similar sensation throughout his body every time Tyler thrusts into him. Ready to burst, Tyler turns Rick over and Rick strokes his dick and blasts himself with cum as Tyler just keeps on fucking, before finally pulling out and dropping a jizz bomb all over Rick, the tights, the mat, and half the gym. Now Rick knows why Tyler is Varsity, huh? Enjoy!",
  "models": [
    {
      "name": "Tyler Torro",
      "person_id": 13869
    },
    {
      "name": "Rick McCoy",
      "person_id": 17883
    }
  ],
  "release_date": "2012-08-09",
  "scene_id": 41193,
  "series": "NDB - 4405 - Tyler Torro & Rick McCoy",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Condom",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Perfect Practice"
}