{
  "collections": [
    "Rod Daily"
  ],
  "description": "Rod Daily thought he had committed the perfect crime. Absconding with Andrew Stark's bag, Rod suspects that he's made a clean getaway until Andrew and cop friend Officer Tyler Torro roll up and discover him walking the side of the road. Caught red-handed, Rod is at the mercy of Officer Torro, who is clearly prepared to handle things in a somewhat unorthodox manner. Rather than taking him downtown, Tyler has decided on a little bit of payback- so he shoves Rod into his trunk and transports him back to his private garage. Once there, Tyler lays out the rundown for a confused Rod and Andrew. Rod can either take his punishment here in the garage or he can take his chances downtown. Rod chooses the former, and so Andrew shoves his dick down Rod's throat as Tyler undresses and strokes his cock. Bending Rod over, Andrew first wets his hole with a little ass eating, then plunges his cock deep into Rod's waiting ass as Tyler chokes Rod with his dick. Sucking Tyler off as Andrew pounds him from behind, Rod's own dick is growing rock hard. Moving down to the floor, Rod rides Tyler's night stick as he sucks on Andrew, jacking his dick and spraying a load in the process. The whole sight is too much for Tyler to take, and almost immediately he rips off his condom and explodes as well, which is shortly followed by Andrew showering Rod with his own load. Guess it's just like they say: A couple loads to the face beats some jail time any day. Enjoy!",
  "models": [
    {
      "name": "Andrew Stark",
      "person_id": 21264
    },
    {
      "name": "Rod Daily",
      "person_id": 9574
    },
    {
      "name": "Tyler Torro",
      "person_id": 13869
    }
  ],
  "release_date": "2012-08-17",
  "scene_id": 41199,
  "series": "R131 - Rod Daily, Tyler Torro & Andrew Stark",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bald",
    "Big Dick",
    "Big Muscles",
    "Climax",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome",
    "Uniform"
  ],
  "title": "The Long Cock of the Law"
}