{
  "collections": [
    "Raging Stallion"
  ],
  "description": "J.C. Carter is pumping his magnificent cock in some deserved alonetime. Bo Knight returns to suck on J.C. and both do great work oneach other's cocks again. Dillon Press arrives and mock-fucks J.C.with an intensity we know will lead to some harsh real pounding.Steve Parker arrives in time for a few cocks to poke through a curtainfor some sucking. There might not be a prettier moment in this entirefilm than watching Steve, Dillon, J.C. and Bo hunker down for somefirst-class sucking of four very lucky cocks through the curtain. Bomay trump them all a bit, but they all do beautiful work. Bo sucks thecum right out of the dick he's sucking, licks it clean and then goesback to sucking it! Once that cum is spilled, it's time for some spiritedfucking and Bo is the lucky bottom boy. First he gets it from TonySerrano, who makes a case for being the hottest top in a flickcrammed full of them. He's powerful and strong, and ultra sexy. J.C.gets Bo next, and the result is just as good as it was in the previousscene when that massive dick fit just so in Bo's ass. Big Dillon getshis say afterward, thumping hard thrusts at Bo while Bo blows Tony.Steve is the last top, and he simply never tires. However, Bo's ass isinspiring, so of course he does a great job! Everyone gets to saygoodbye with a cum-shot and all of them have impressive ones.",
  "models": [
    {
      "name": "Tony Serrano",
      "person_id": 19843
    },
    {
      "name": "JC Carter",
      "person_id": 21723
    },
    {
      "name": "Steve Parker",
      "person_id": 21720
    },
    {
      "name": "Dillon Press",
      "person_id": 21721
    },
    {
      "name": "Bo Knight",
      "person_id": 21722
    }
  ],
  "release_date": "2008-02-20",
  "scene_id": 42102,
  "series": "Hunter Hunted",
  "tags": [
    "Anal",
    "GroupSex / Orgies",
    "Interracial",
    "Oral",
    "Tattoos",
    "african american",
    "butt play",
    "glory holes",
    "jockstraps",
    "rimming"
  ],
  "title": "Hunter Hunted, Scene #04"
}