{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Inked Ricky Sinz and muscular and tatted Dak Ramsey starts off hardand heavy, Ricky punching away (at a punching bag, not Dak, notyet), looking unbelievably hot in black-and-white C-IN2 briefs, boxinggloves, his tough-guy attitude, tatts and a sheen of sweat. This provesto be an irresistible combination for Dak, who immediately servicesRicky's rock-hard cock on his knees, the cherry-red Everlast boxinggloves quickly tossed off, and the skin-tight undies pulled down. Dakis a skilled and greedy cocksucker, bobbing and weaving about theboxer's cock with pugilistic determination, but the funny thing is Rickyain't fighting back, he just sits back and lets Dak do his thing on histhing. The effort quickly shifts to Dak pile-driving Ricky's ringed withhair, tight muscle hole. I mean, deep thrusting, whole-body-weight-inthe-ass fucking, Dak pumping Ricky's perfect muscle-butt full of thickman's man cock. It's an astonishing, and unexpected, segue. Dakthen lowers that sweet ass down a bit for some also thrustingmissionary fucking, Ricky egging him on to fuck harder and moreurgently, and then mounts the cock for a straddle-fuck, his ass facingDak, his hole filled with Dak's cock as he rides to glory and ecstasy --sweat, lube and butt hair grinding and swirling in harmony. Dak reallyfucks this man like you won't believe. His ass sufficiently fucked, heturns the tables and doggy-fucks Dak's hairy ass, and Dak takes aswell as he gave. On his knees, ass pushed up and ready, Ricky'sstout boner slides in, slides out, over and over, much to Dak's delightit seems. Dak shifts, his belly now closer to the mat, and Ricky reallydigs in for some harsher fucking in this more prone position beforesuper-macho Dak mounts cock in the manner in which super-machoRicky had earlier for a sit-fuck that leads to missionary. Ricky fucksthe cum out of Dak and then frantically jerks out his load, Rickysquirting his spunk all over Dak's hairy balls.",
  "models": [
    {
      "name": "Ricky Sinz",
      "person_id": 19617
    },
    {
      "name": "Dak Ramsey",
      "person_id": 19798
    }
  ],
  "release_date": "2008-11-07",
  "scene_id": 42116,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Boots",
    "Foreskin",
    "Hairy",
    "Jocks / Athletic",
    "Oral",
    "Tattoos",
    "jockstraps",
    "underwear"
  ],
  "title": "Monument, Scene #01"
}