{
  "collections": [
    "Falcon Bareback"
  ],
  "description": "In the darkness of the night, tight and toned motorcycle men meet up at their private club to work their cocks and blow off steam. Chad Douglas stands before a lattice while a smooth and hungry Jack Lofton kneels before Chad - deepthroating his cock while Ryan Stone jacks his cock and enjoys the view. Ripped musclestud Race Jensen drops to his knees before Ryan, sucking his cock deep and hard whileRyan enjoys Race's hard form. Soon Chad has his cock buried deep in Jack's ass....fucking him hard as Jack tongues Race's tight hole. Inspired by lust, the men change partners and positions...anything to get more hard cock into a tight grip. Chad Pumps Race hard from behind as Jack savors the taste of Ryan's cock deep in his throat.More men merge into the scene. Race slams leatherboy SeanLawrence's ass and Eric Manchester shows up for a good suck and fuck...and ever-hungry Jack Lofton is eager to take it. Chad and Race jerk off over a mirrored table and Tony Marinos joins them...a trio of hot horny men working their cocks and pumping out their thick loads one by one. Dildos come out and the men lose themselves in the desire for a fat cock and a full fill. Jim Bentley, Chris Williams andCasey Jordan finally arrive as the orgy is deep in session. Jack tells them to strip and sit down...the boys prove their oral skills by taking on the club members before surrendering their assess to Chad, Tony and Eric's cocks. As the evening winds to a clothes all nine hard and horny studs circle around gagged Chris Williams while Eric works afat dildo in and out of Chris's ass. One by one the men unload over Chris and the room resounds with their gasps and moans of satisfaction.",
  "models": [
    {
      "name": "Casey Jordan",
      "person_id": 21781
    },
    {
      "name": "Chad Douglas",
      "person_id": 21806
    },
    {
      "name": "Chris Williams",
      "person_id": 21874
    },
    {
      "name": "Eric Manchester",
      "person_id": 21875
    },
    {
      "name": "Jack Lofton",
      "person_id": 21871
    },
    {
      "name": "Jim Bentley",
      "person_id": 21848
    },
    {
      "name": "Race Jensen",
      "person_id": 21791
    },
    {
      "name": "Ryan Stone B",
      "person_id": 21880
    },
    {
      "name": "Tony Marino",
      "person_id": 21847
    }
  ],
  "release_date": "2000-01-01",
  "scene_id": 42140,
  "series": "Falcon Bareback - Fuck Me Raw",
  "tags": [
    "Anal",
    "Gang Bangs",
    "GroupSex / Orgies",
    "Hairy",
    "Leather",
    "Oral",
    "butt play",
    "masturbation",
    "pre condom",
    "rimming"
  ],
  "title": "Falcon Bareback - Fuck Me Raw, Scene #04"
}