{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Cory Monroe has always wanted Uncle Chad. Riding home, he can'thelp but notice his hunky uncle rubbing his bulging crotch as theydrive. Inside the house, Chad plays with himself under a glass-toptable. 'A good looking guy like you must have lots of girl friends,' hisuncle asks Cory. 'No, I just don't have the time what with school andeverything.' The question makes Cory nervous, yet aroused. 'I justspend most of my time with the guys hanging out.' Cory notices hisuncle's cock getting larger and larger. Deep down inside the feeling isoverwhelming as he wishes his uncle would just take command. 'Ibet I could teach you a few things you haven't learned in school.'Moving towards the den, Uncle Chad pushes Cory to his knees withhis massive cock resting near Cory's mouth. Cory opens upautomatically and his uncle thrusts into Cory's waiting throat. Cory isreally getting off on his butch uncle teaching him to take his hugecock and heavy balls. 'Kid, you're a real fast learner,' Chad says,giving him all eleven inches now. Cory struggles to take the entirelength, licking and slurping, trying to handle it all. 'Now you've got megood and hard, and I want to fuck your cute little ass and teach youhow to have some real fun.' Chad fucks Cory but good, a long hardscrewing, pulling out slow and ramming it full-length over and overuntil Cory moans louder and loouder and gasps 'Uncle Chad, pleaselet me come, please.' Chad withdraws in one quick motion and thetwo pounding studs explod all over each other. 'I don't think you'vehad enough,' Chad says, reaching for a butt plug and shoving ing upCory's ass. 'That'll hold you until I get you to my buddy's playroomwhere we can really give you a hot lesson...'",
  "models": [
    {
      "name": "Cory Monroe",
      "person_id": 21805
    },
    {
      "name": "Chad Douglas",
      "person_id": 21806
    }
  ],
  "release_date": "2001-04-01",
  "scene_id": 42164,
  "tags": [
    "Anal",
    "Bareback",
    "Big Dick",
    "Hairy",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "masturbation",
    "rimming"
  ],
  "title": "Falcon Bareback - Do It For Daddy, Scene #03"
}