{
  "collections": [
    "Raging Stallion"
  ],
  "description": "We find Jeff Allen shackled up next to bald, sex-dripping Rik Jammer.Wearing nothing but jocks and their game faces, they glisten with the sweat of jaunty movement, and then a sweet little whip appears from the side of the screen and starts to do its work. Naturally, it doesn't take long for sugar to turn to salt and pleasure to turn to pain. Theflogging suddenly lurches forward in power as Jeff contorts to the slaps and Rik growls out like the continuing echoing shout at the end of a movie fade out. There is no pussyfooting around here -- this is not for the weak of stomach. The intensity here isn't derived from mere chemistry, but from a very real beating inflicted on Jeff and Rik. However, that never takes away from the sheer sexiness of these two guys. Watch Rik's abs counter the whip smacks by remaining rigid and taut, like the brick wall taking on the car in a crash test. Or watch Jeff twist so that he can stare into Rik's eyes as both of them get ravaged by the lashes. Just when it's all getting to be too much to bear, or so an amateur might think, hairless sexbomb Robert Black enters. He immediately softens the scene to a degree, replacing the torturing of the whip withhis hard cock. Jeff and Rik, hands parked behind their backs, fight for the dick, with the latter absolutely driven mad for the piece. But, niceties are teases in the world of 'Flogd & Fukt.' After a sublime tease with the head, Robert thrusts his dick deep inside Rik's ass andintensity regains its footing. Throughout the rest of the scene, it's Rik's almost scary fervor that keeps it all in shape so beautifully, but Robert's fuck is damn good. He has no problem taking over the butt, sliding in and out gingerly, providing a solid footing for Jeff and Rik tobray and roar over. Robert may be the quietest of the trio, but he darts in and out so quickly, and with so much slapping, that you can't help but be thankful for his presence as well. In the middle of the fuck, Rik jumps up and pins Jeff to the floor with his tasty ass. After Jeff is lulled into complacency by rimming, Robert takes it as a sign to fuck him just as economically. With Rik playinggenial hospitality expert (by lovingly kissing and massagingeveryone), Robert gives Jeff the exact same pound he gave Rik, as if to even things out. He carefully makes sure not to upstage anyone's energy, but again, none of it would be possible without his skill. Rik and Jeff take turns riding on Robert's cock, the one not being fucked pulling the one being fucked up and down for maximum effect. Actually, this position ends up working surprisingly well, given thatcontrol (thankfully) has not been a mark of this scene. For the final triumphant position, Rik is tossed on his head so Robert can fuck merely squatting over his ass. This is Robert's moment to shine. Jeff can't do much but watch in amazement and Rik isn't in any position to fight for now, so Robert, with a noticeable smile, does his finest workyet here. Jeff ends things by standing over Robert to dot his chest with cum before Rik copies him and finally Robert takes up Rik's on the- head position to dump his full load right onto his own tongue.",
  "models": [
    {
      "name": "Jeff Allen",
      "person_id": 19819
    },
    {
      "name": "Rik Jammer",
      "person_id": 19841
    },
    {
      "name": "Robert Black",
      "person_id": 21710
    }
  ],
  "release_date": "2005-01-01",
  "scene_id": 42301,
  "tags": [
    "Anal",
    "Bodybuilder",
    "Hairy",
    "Oral",
    "bondage",
    "cum shots",
    "fetish",
    "jockstraps",
    "masturbation",
    "rimming"
  ],
  "title": "Flogd And Fukt And Painful Endurance, Scene #02"
}