{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Simon Cox and co-director Chris Ward. Guys don't get more intensethan these two. Chris is hairy and tattooed, every bit the leatherdaddy, with his cock tied up and pierced. Simon nearly defiesdescription, with piercings in places I don't know others would eventhink could be used. However, all of the bodywork on Simon speaksto his pain threshold, which doesn't seem to have a boundary. Nomatter how hard Chris flogs him, Simon takes it without wincing. Infact, his stone face seems to goad Chris on to harsher punishment,but nothing breaks the concentration on this musclestud. I guessChris takes it as tacit approval of what he's doing, so he continues tosmack at every part of Simon's body. The ass is done, the laced-upcodpiece is used, the exquisite back, and most importantly the chest.In the background of this action, five hairy harness-clad guysmaneuver around each other, given the camera's noticing mainlyduring a very good double-blowjob on two cocks with Prince Alberts.Now that Chris has beaten the shit out of Simon, what more couldthere be to the scene? Well, Chris answers that by grabbing ontoSimon's balls and blowing the heck out of him. It's not as sweet as itsounds, believe me, but it's a knowing deep-throat expertly deliveredand accepted. And before the scene quickly ends, there is a whole lotof urination. Chris swing a bucket from his trussed genitals whileSimon and then one of the others fills it up with piss. Chris writhes ashe watches all of it bog down his balls and it sure seems as if thesetwo guys held it for a long time.",
  "models": [
    {
      "name": "Chris Ward",
      "person_id": 21701
    },
    {
      "name": "Eli Horst",
      "person_id": 21702
    },
    {
      "name": "Harley Mancuso",
      "person_id": 21703
    },
    {
      "name": "Matt McGrath",
      "person_id": 21704
    },
    {
      "name": "Simon Cox",
      "person_id": 19823
    }
  ],
  "release_date": "2003-12-30",
  "scene_id": 42303,
  "series": "Punishment Chamber",
  "tags": [
    "Bodybuilder",
    "Boots",
    "GroupSex / Orgies",
    "Hairy",
    "Interracial",
    "Leather",
    "Oral",
    "Tattoos",
    "african american",
    "tit play"
  ],
  "title": "Punishment Chamber"
}