{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Simon Cox and co-director Chris Ward. Guys don't get more intense than these two. Chris is hairy and tattooed, every bit the leather daddy, with his cock tied up and pierced. Simon nearly defies description, with piercings in places I don't know others would even think could be used. However, all of the bodywork on Simon speaks to his pain threshold, which doesn't seem to have a boundary. No matter how hard Chris flogs him, Simon takes it without wincing. In fact, his stone face seems to goad Chris on to harsher punishment,but nothing breaks the concentration on this muscle stud. I guess Chris takes it as tacit approval of what he's doing, so he continues to smack at every part of Simon's body. The ass is done, the laced-up codpiece is used, the exquisite back, and most importantly the chest. In the background of this action, five hairy harness-clad guys maneuver around each other, given the camera's noticing mainly during a very good double-blowjob on two cocks with Prince Alberts.Now that Chris has beaten the shit out of Simon, what more could there be to the scene? Well, Chris answers that by grabbing onto Simon's balls and blowing the heck out of him. It's not as sweet as it sounds, believe me, but it's a knowing deep-throat expertly delivered and accepted. And before the scene quickly ends, there is a whole lot of urination. Chris swing a bucket from his trussed genitals while Simon and then one of the others fills it up with piss. Chris writhes as he watches all of it bog down his balls and it sure seems as if these two guys held it for a long time.",
  "models": [
    {
      "name": "Simon Cox",
      "person_id": 19823
    },
    {
      "name": "Chris Ward",
      "person_id": 21701
    }
  ],
  "release_date": "2005-01-01",
  "scene_id": 42300,
  "series": "Flogd And Fukt And Painful Endurance",
  "tags": [
    "BD&SM",
    "Leather",
    "Oral",
    "Tattoos",
    "african american",
    "bondage",
    "cum shots",
    "fetish",
    "masturbation",
    "tit play"
  ],
  "title": "Flogd And Fukt And Painful Endurance, Scene #01"
}