{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Lost in a mysterious, otherworldly passageway, three men, James Huntsman, Brandon Lewis, and Donny Wright, move through tunnels running through the crossroads of dimensions.  For eternity before, they've each existed simultaneously, but apart, in other alternate universes.  Somehow the fates have brought them together, through the magic of the hallways that exist on the outskirts of what we understand to be reality.  As they tread slowly, appearing and reappearing from one place to another, through the strange rules of quantum physics their own minds bring the three men together all at the same time.  Each of them feels as if he's been lost in this translation of time and matter for eons.  Their need to touch and taste bare skin has been unsatisfied for a long, undetermined length of time.  Brandon feels his craving for hard cock in his mouth, so he takes James's hard member and suck hard, with passion.  He then takes Donny's and enjoys the firm boner in his mouth.  Then Donny indulges his yearning to taste man meat.  Then Brandon positions himself on a table to have his ass eaten by Donny while he sucks James.  Soon it's time for James to pound Brandon's tight, eager hole.  You won't believe the intense passion in this unusual scene that will test your own perception of reality.  Enjoy!",
  "models": [
    {
      "name": "Brandon Lewis",
      "person_id": 10277
    },
    {
      "name": "Donny Wright",
      "person_id": 14218
    },
    {
      "name": "James Huntsman",
      "person_id": 16691
    }
  ],
  "release_date": "2012-08-30",
  "scene_id": 42650,
  "series": "NDB - 4408 - James Huntsman, Brandon Lewis & Donny Wright",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Dimensional Entry"
}