{
  "collections": [
    "Cody Cummings"
  ],
  "description": "Cody Cummings is up in the club, making it rain like a fuckin' baller. With all this hot skin and sexual tension in the room, it's only a matter of time before the heat turns up. Darcy Tyler and Allie Jordan see high rollers all the time, but there's something about Cody that is different. So when he starts throwing money around and helping himself to a drink or three, they can sense that this night is going to end a little crazier than usual. While Darcy dances onstage, Cody and Allie get friendly on the couch. Wanting to get in on the action, Darcy peels of her see through mini skirt and spreads her legs as Cody slips his fingers between her legs. Turning moist, she doesn't stop him. Instead she and Allie make a move for Cody's pants and unzip them to let his cock join the party. Two steps ahead of them, Cody's cock is already standing in full salute, and so they take turns sucking on the tip of his head and then slamming his shaft down the back of each other's throats. Cody is living the dream as he bends Darcy over and enters her from behind, all the while Allie fingers Cody's taint and pushes him deeper. Flipping the positions, Allie assumes the position and Cody penetrates her as she moans from the pleasure of his thick cock pounding her insides. The three of them are dripping wet from the sweaty three way as Cody is on the verge of letting loose, so they bend down and he soaks both of their faces with a sticky load as they suck on his head and milk him for every last drop. Enjoy!",
  "models": [
    {
      "name": "Allie Jordan",
      "person_id": 10793
    },
    {
      "name": "Cody Cummings",
      "person_id": 6195
    },
    {
      "name": "Darcy Tyler",
      "person_id": 14697
    }
  ],
  "release_date": "2012-08-29",
  "scene_id": 43010,
  "series": "CC - 6273 - Cody Cummings, Darcy Tyler & Allie Jordan",
  "tags": [
    "Ass to mouth",
    "Big Dick",
    "Big Muscles",
    "Big Tits",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Hardcore",
    "Lesbian",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Three for the Money"
}