{
  "collections": [
    "Cody Cummings"
  ],
  "description": "In the high-stakes world of adult modeling, Cody Cummings is kind of a big deal.  Not only is he an icon in front of the camera, but he exerts significant influence behind the scenes as well.  Cody knows that to run an efficient outfit, he need to stay on top of performers, especially fresh faces.  He's called for young Jasper Robinson to pay a visit to his office.  Jasper arrives just as Cody is chipping golf balls around the office.  Cody's modus operandi is to deal frankly yet gently with young talent.  He's warm but firm.  He informs Jasper in no uncertain terms that some other models and staff has expressed opinions to Cody and among themselves that Jasper may not be a good fit for the production assisting tasks studio heads have recently been assigning him.  Jasper had asked to pick up a little extra work for himself around the sets, in between modeling.  Light jobs, like moving production lights, carrying equipment, and cleaning up a bit.  A photographer, a few models, and the behind-the-scenes guy had complained that Jasper lacked motivation in doing this work, and recommended Cody let him go from the position.  But when Cody senses Jasper's willingness to 'fight' for his production job, he puts Jasper to the test to see exactly how far he'll go.  After telling Jasper to take his shirt off, Cody pops out his large, swelling cock for Jasper to have a good look.  Jasper knows what he needs to do, but before performing this bit of side work, Cody has Jasper promise not to divulge details to anyone.  Jasper agrees and fills his mouth with Cody's fat meat.  He slurps as his superior's dick grows hard.  Cody has Jasper turn around and spread his ass open while they both continue stroking their erections.  You won't believe to what lengths this ambitious young star will go to make sure his job is secure. Enjoy!",
  "models": [
    {
      "name": "Cody Cummings",
      "person_id": 6195
    },
    {
      "name": "Jasper Robinson",
      "person_id": 21432
    }
  ],
  "release_date": "2012-09-05",
  "scene_id": 43239,
  "tags": [
    "Amateur",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Softcore",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Risky Business "
}