{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Cambell Stevens and Ray Diaz are stuck working on the weekend. Well it's all that bad. After all, they are just doing a little pool cleaning, and the owner of the house isn't even home. After finishing their task, they begin their clean up when Campbell gets a great idea. No one's home, might as well enjoy a break. So he grabs one of the super soakers and wets Ray when he's not looking. Ray immediately reacts by grabbing another super soaker, and long story short, both guys end up in the pool, wrestling and splashing, their pants falling off their asses amidst the rough housing. Swimming to the pool's steps, Ray notices Campbell's hard on through his underwear, and since no one is around, he fondles the shaft and plays with Campbell's balls, pulling his waistline down and swiping Campbell's cock with his tongue. Plunging his mouth deep around the head of Cambell's dick, Ray slides his hand into his own shorts as Campbell lets out an exuberant moan while rubbing his hands through Ray's wet tussled hair. Campbell stretches Ray out on a raft and pulls his shorts down, exposing Ray's cock as it glistens in the sunlight. Campbell goes all the way down on Ray's dick sucking him up until he's good and worked up, then the two of them decide to move to dry land. Leaning back in a chair, Ray mounts Campbell's cock and spreads his legs as he rides reverse, his cock bouncing up and down with every thrust. Shimmering in the sun as Campbell pounds away, Ray jacks his dick at a fever pitch and cums as Campbell continues to fuck him harder and harder, until Campbell cannot hold off anymore. Lying in a puddly mess of jizz and sweat, the two guys hop into the pool for a quick clean up and then it's on to the next job.Enjoy!",
  "models": [
    {
      "name": "Campbell Stevens",
      "person_id": 18736
    },
    {
      "name": "Ray Diaz",
      "person_id": 22474
    }
  ],
  "release_date": "2012-09-06",
  "scene_id": 43241,
  "series": "NDB - 4409 - Campbell Stevens & Ray Diaz",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Smooth"
  ],
  "title": "Weekend Warriors"
}