{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Vinny and Caleb are tossing the old rawhide around one afternoon, just passing time and shooting the shit. Caleb asks Vinny about his new girlfriend, and Vinny responds that she's alright, except for the fact that she doesn't give blow jobs. Caleb can't believe it. Is this girl mad? Has she seen Vinny's gigantic cock in the light and if she has, how did she not want to swallow it immediately? All these questions circling around in Caleb's mind as the two of them return inside to cool off. Caleb decides to let it go, but Vinny brings up the whole ?no blow job? thing again, so Caleb begins to wonder if maybe Vinny is fishing a little bit. Calling his bluff, Caleb offers to take care of him, and Vinny doesn't seem afraid, so Caleb advances and slides his hand up Vinny's short pant leg as Vinny reclines on a chaise lounge. Unzipping his fly, Caleb exposes Vinny's waiting cock, and by the eager way it is already semi hard, it becomes apparent to Caleb that it has been a while since Vinny got blown. Wasting no time, Caleb deep throats Vinny's dick and strokes the shaft, playing with Vinny's balls with his other hand. Bobbing back and forth, up and down, Caleb slobbers all over Vinny as he thrusts back and forth with his hips, pushing his dick down Caleb's throat and pulling out to cum on his face in no time. Not satisfied, Vinny shoves his dick right back into Caleb's cum covered face and continues to face fuck him. Laying him down on his back with his head hanging off the side of the couch, Vinny shows Caleb no mercy and really thrusts harder and harder, and the gagging sensation causes Caleb to bust his nut all over the place. Smothering Caleb's face, Vinny pumps one or two more times and then pulls out to explode for a second time. So Caleb may not be the best at baseball, but he definitely knows how to turn two.Enjoy!",
  "models": [
    {
      "name": "Vinny Castillo",
      "person_id": 17793
    },
    {
      "name": "Caleb Colton",
      "person_id": 22028
    }
  ],
  "release_date": "2012-09-20",
  "scene_id": 43396,
  "tags": [
    "Amateur",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Dark Hair",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Masturbation",
    "Oral",
    "Softcore",
    "Straight Men"
  ],
  "title": "Double Header"
}