{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Kyler Ash has been in trouble a lot lately. The bad seed, it seems like his step-brother is always getting the better of him. Take last Sunday, when all he wanted to do was sleep in, but Joey came bursting in with his damn car. Kyler snapped, and busted up the car with a bat, and just like that, Joey had him by the short hairs. Now Joey hard doesn't give a shit about his remote control car but he does want to get his dick sucked. See the genius in this plan? When Kyler busts up the car, Joey threatens to tell, and offers a compromise. Slowly inching his shorts down his hips, Kyler can guess who will be compromised. But he can't afford any more trouble, so he opens his mouth and slides Joey's hard cock down his throat. Showing no mercy face fucking Kyler, Joey then flips around and sits on Kyler's face, rubbing his balls on Kyler's mouth, before turning Kyler around and lubing up his asshole for Joey's waiting cock.Joey plunges his dick deep inside Kyler, who begs Joey to take it easy, but Joey does not oblige, pounding away with Kyler's legs thrown back over his own shoulders. Kyler strokes his cock as Joey pumps away, and by the size of the load he spits, it is hard to believe this is any form of punishment at all. Joey watches Kyler burst and then follows suit, pulling out and then blasting Kyler with a hot load of jizz that coats young Kyler's chest and will serve as a reminder to be on his best behavior from here on out.Enjoy!",
  "models": [
    {
      "name": "Joey Hard",
      "person_id": 16699
    },
    {
      "name": "Kyler Ash",
      "person_id": 19870
    }
  ],
  "release_date": "2012-09-11",
  "scene_id": 43457,
  "series": "NDT - 8145 - Joey Hard & Kyler Ash",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Don't Tell"
}