{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "On the first floor of a moderately priced hotel, one of a chain, a business man by the name of Kevin Crows talks on the phone to his secretary, who sits at her desk in an office miles from where he is now.  Another man enters, toting a fold-up massage table.  Before he can set up, the business man hangs up his cell phone and introduces himself.  The masseur, Kyle Quinn, does the same, shaking Kevin's outstretched hand.  Kevin explains to him in no uncertain terms that a massage will not be taking place during this in-room service call.  No, instead Kyle will be performing a 'dick sucking,' as Kevin describes.  'But what about the massage,' Kyle asks, a bit confused.  It's not what this Mr. Crows had in mind, and he doesn't want to waste time.  You see, for many business men, away from their families while travelling, the massage is simply a formality.  It's a means to an end.  And that end is a slobbery suck job to satisfy their appetite for hot, young guys.  But Kevin is more to-the-point.  He's having Kyle lick and bob on his fat, rock hard cock, and that's just the beginning.  He's having a taste of Kyle's thick boner as well.  Then Kyle's letting this Mr. Crows slide that massive, bulging erection into his tight, eager ass.  Be sure to have your assistant clear an adequate chunk of time in your schedule to enjoy these incredible hotties turn up the heat in Room 69.Enjoy!",
  "models": [
    {
      "name": "Kevin Crows",
      "person_id": 13866
    },
    {
      "name": "Kyle Quinn",
      "person_id": 14206
    }
  ],
  "release_date": "2012-10-18",
  "scene_id": 44351,
  "series": "NDB - 4415 - Kevin Crows & Kyle Quinn",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Condom",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Room 69"
}