{
  "collections": [
    "Fisting Central"
  ],
  "description": "The sun beats down on a parched vineyard in wine country.  Overheated, Damien Crosse takes a break from plowing to unleash his swollen bladder.  Working nearby, Chris Porter is more than willing to be Damien's receptacle.  Chris drops eagerly to his knees, anticipating Damien's steady stream from his thick rock-hard cock.  Damien soaks Chris' face and clothes, giving Porter liquid relief from the dry heat.  Chris thirstily sucks the last drops from Damien's thick man-pipe, and continues to suck the cock as Damien spits in his face.  Now well lubricated, Crosse begins fucking Porter's throat.  Letting loose a full torrent coating Chris' throat.  With Chris now ready to return the favor, the pigs exchange kneeling and standing positions.  Chris covers Damien's face and mouth, dripping down to soak his hairy chiseled chest.  Damien proceeds to chow down on Porter's cock.  The two trade off, taking turns with each other until Damien takes charge and bends the work boy over a table.  Spitting on his crack, Damien shoves his thick man-meat mercilessly into Porter's hole.  Porter takes it, a mixture of pain and pleasure are reviled on his face, as he gets the fuck he's been waiting for.  Damien picks up speed, and begins to power fuck the smaller stud.  With an unrelenting stroke, Damien's tool digs deep on Chris' hole, as he pounds it harder and harder.  Crosse then flips Porter over to fuck him missionary, but not before he unloads another round of wet pleasure, soaking Chris' body fully.  Chris joins in, and releases his own river, soaking himself, now already glistening under the sunlight.  Damien shoves his cock in yet again, and pounds Chris to orgasm.  Still building to finish, Damien continues to fuck Chris suddenly pulling out his fuck tool, to shoot his thick white load over Chris' cum and stained shirt.",
  "models": [
    {
      "name": "Chris Porter",
      "person_id": 23191
    },
    {
      "name": "Damien Crosse",
      "person_id": 23219
    }
  ],
  "release_date": "2010-09-12",
  "scene_id": 45394,
  "tags": [],
  "title": "Drenched In Piss County, Scene #01"
}