{
  "collections": [
    "Fetish Force"
  ],
  "description": "Damien Cross sits underneath a tall oak tree enjoying a snack.  He grabs a ripe peach and cuts it with his sharp pocketknife.  Kennedy Carter enters the scene just as the juice of the peach drips off on Damien.  Kennedy licks at the stream of nectar then devours the peach, while Damien sips red wine.  The two begin sharing the wine, by passing it between their lips, giving into the attraction between them.  Damien leans back against the tree and pulls out his thick uncut cock.  Pointing it straight up towards the sky, he starts soaking himself, his work pants and torso.  Kennedy bends down and takes the arching stream into his mouth, submerging his tongue in the hot liquid.  After Damien's water fountain goes dry, Carter's thirst seems unquenched, and sucks his buddy's thick slab of beef hoping for more.  Kennedy works his way up and down the shaft, getting Damien's cock lubricated with his saliva.  Kennedy then licks Damien's torso and carves a path up to his mouth for a deep wet kiss.  Crosse feeling even more thirst from the rich wine, bends over to take Kennedy's thick cock into his mouth.  Damien sucks his buddy's cock, while Kennedy drinks from the jug once more carelessly spilling wine covering his torso and cock.  Damien sucks the wine droplets from Kennedy's body, quickly returning to service his buddy's member.  The two swap back and forth, sucking cock, and chugging from the jug.  Each of them enjoying fully the pleasure of their vices.  Kennedy gets up and lets out a stream that drenches Damien. Damien opens his mouth wide, and takes the seemingly endless stream in his mouth.  Cross spits back at Kennedy as Kennedy keeps going.  With Kennedy leaning against a wooden ladder, Damien plunges his cock up Kennedy's tight white ass.  Damien has no mercy when it comes to fucking.  He plows Kennedy's asshole deep, hard and fast as if rushing to finish the fields before the sun sets.  He power fucks Carter's ass then pulls out to unleash another stream of glory that covers Kennedy's back and posterior.  Damien remounts Kennedy and rides him some more sending shards of ecstasy up Carter's spine.  Damien has the stamina of a well bread stallion, keeping a steady rhythm in his fucking.  He pulls out occasionally to douse Kennedy with more of himself but quickly shoves his cock back in.  He increases the velocity of his pounding until Kennedy can't take it anymore and shoots a huge cum-load all over his upper body.  Excite by Kennedy's orgasm Damien fucks harder, then pulls out and shoots his man juice all over Kennedy's cum soaked belly.  The two collapse in exhaustion after a long hard day in the fields, and the consumption of fruit and wine.",
  "models": [
    {
      "name": "Race Cooper",
      "person_id": 23174
    },
    {
      "name": "Kennedy Carter",
      "person_id": 23193
    }
  ],
  "release_date": "2010-09-12",
  "scene_id": 45396,
  "series": "Drenched In Piss County",
  "tags": [],
  "title": "Drenched In Piss County, Scene #03"
}