{
  "collections": [
    "Fetish Force"
  ],
  "description": "Race Cooper cools off in a pool as vineyard worker Kennedy Carter finishes up his chores.  Race comes out of the pool, with drops of water, streaming down his ripped abs.  Kennedy needing some refreshment comes right up to Race and is ready to take the drink that Race offers.  Kennedy goes down and begins to deep-throat Race's thick black cock, sucking up all that he can.  Carter sucks wildly, as Race leans back and enjoys the vigorous blow job.  Kennedy then flips Race over, so he can eat this rich full man ass.  Ramming his tongue into Race's hole, Kennedy chews on Cooper's dark star.  Standing up, he then releases his large pink uncut cock from his work pants; and proceeds to soak Race's muscular back and ass.  Carter then shoves his cock into Race's drenched cheeks, plowing deeply, as his cock disappears into Race's hungry hole.  Kennedy fucks Race steadily for a while, pounding his hole, until he needs to unleash again.  Race crouches down, and takes Kennedy's stream all over his face and body.  Soon focusing on sucking Kennedy's cock dry, Cooper hungrily tries to get every last drop.  Race sucks it down fast, but his thirst seems unquenchable as he lifts Kennedy up, to squat on his face and begins to eat out his pink hole.  Race shows he loves to rim, sending jolts of pleasure to Kennedy's hole, with ever lick and tongue thrust.  Unable to contain himself anymore, Race needs to fuck that sweet hole.  Race slides his thick black cock into the wet and open pinkness.  Kennedy bent over now, takes it like a man, pushing back to receive more.  Race fucks him for a while, but soon needs relief from the geyser pushing up from within.  Race pulls out and releases a powerful fountain, flowing fully.  Soaking Kennedy's back as well as into his mouth, Race drinks it all in.  Kennedy comes to sit on Race's cock and rides it hard, making Kennedy's cock smack repeatedly against his belly.  Kennedy fucks himself with Race's thick fuck pole, as he gyrates and grinds the black studs cock, deeper and deeper into his ass.  Kennedy impales himself to orgasm, with Race then pulling out his cock and cumming all over Kennedy's chest.  Not fully spent, Race shoots out one more stream to wash Kennedy's cum soaked torso.",
  "models": [
    {
      "name": "Kennedy Carter",
      "person_id": 23193
    },
    {
      "name": "Race Cooper",
      "person_id": 23174
    }
  ],
  "release_date": "2010-09-12",
  "scene_id": 45395,
  "series": "Drenched In Piss County",
  "tags": [],
  "title": "Drenched In Piss County, Scene #02"
}