{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Paul Poleman is new this semester at school and has a hard time fitting in.  He has an exotic accent and some of the mean boys have made fun of it.  But Jake Jonas has always been somewhat friendly to Paul.  They live right across from each other in the dorm.  On a Saturday night, Paul sits on his skateboard alone in the bathroom, bored with nothing to do.  When Jake walks in, Paul perks up a bit.  As Jake pees, Paul asks him what his plans are for the evening.  Jake tells Paul that he's going to a party.  As Jake talks about the party, Paul watches through a hole in the stall wall.  He can see Jake holding his dick, waiting for the pee to flow.  Paul asks if he can come along to the party.  Jake answers by telling him in a snide tone that he certainly doesn't want to hang out with him.  Paul is instantly crushed.  But Jake recants, saying he's just kidding and wouldn't mind if Paul joined.  As he's telling Paul this, he quickly switches the topic of conversation to the mysterious hole in the wall.  Jake sticks his hand and forearm through, asking Paul what might be the purpose of the hole.  Jokingly, Jake then sticks his penis through.  Paul quickly grabs it and pulls hard.  Jake yells at him to stop.  Only loosening his grasp a bit, Paul wraps his Twink mouth around it softly.  He proceeds to suck as the dick fattens.  Jake sighs and tells Paul that it does feel quite good.  Jake decides to exit the stall and give Paul easier access to his now raging hard on.  After Paul enjoys more of Jake's cock, he turns him around to have a taste of Jake's ass.  Then Jake has Paul lay down on a changing bench so he may have some nice, fat dick in his own mouth.  Paul knows this type of activity is exactly the key to building a good reputation at a new school.  And what he lets Jake do next might make him the most popular boy on campus!  Watch Jake ram his stiff meat into Paul's tight hole as these two finally consummate their new friendship. Enjoy!",
  "models": [
    {
      "name": "Paul Poleman",
      "person_id": 23135
    },
    {
      "name": "Jake Jonas",
      "person_id": 23148
    }
  ],
  "release_date": "2012-12-04",
  "scene_id": 45490,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Climax",
    "Condom",
    "Dark Hair",
    "Glory Hole",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Toys",
    "Twink"
  ],
  "title": "The In Crowd"
}