{
  "collections": [
    "Fisting Central"
  ],
  "description": "Back in the gym, creamy red head Tim Rusty pumps away at thepreacher curl while Joey O'Bryan works his leg lifts. Brandon Aguilarhas a different kind of workout in mind when he enters the gym. Hebreaks open his bag and shows off his toy collection. Quickly pealingoff his tight green shorts and sliding down on a long black dildo,Brandon gives Tim and Joey an unexpected eyeful as he rides in fullview. Tim and Rusty can't continue their workouts. Brandon's show isjust too tempting. Joey strips down first and spots Brandon, feedingthe long dildo into his eager ass eventually working it fast and rough.Rusty soon joins in, finding the perennial porn favorite BAM rubberdong in Brandon's bag. Nothing is more beautiful than the sight ofthat big, fat, brown, veined dong splitting Tim Rusty's beautiful,creamy, peach fuzzed ass. Tim soon joins in the toy ride fest and thethree treat us to a butt splitting bounce fest. These are all Pro toyriders to be sure!Tim takes the center, giving his demanding hole over to Joey's experthands while he sucks down Brandon's cock. The more hard cocksides down one end, the more Joey's arm slides down the other.Brandon laps his tongue over Tim's extended butt hole while he ridesJoey's wrist. Tim is clearly in hog heaven! Soon Brandon gets down inall fours beside Tim and the two each ride Joey's hands, side by side.No hole goes unfilled as Joey rides a big red horn toy while he workstwo holes at once. In a ball-busting climax, Tim hangs wide openfrom the gym leg lift equipment, legs out stretched, quivering asssplayed wide. Joey fists that inviting hole while stroking his own hardcock. The sight of Tim's beautifully worked hole makes bust his nut inspectacular admiration.",
  "models": [
    {
      "name": "Joey O'Bryan",
      "person_id": 26356
    },
    {
      "name": "Brandon Aguilar",
      "person_id": 26359
    },
    {
      "name": "Tim Rusty",
      "person_id": 26360
    }
  ],
  "release_date": "2006-03-31",
  "scene_id": 45899,
  "tags": [],
  "title": "Fistpack 9 - Stretch, Scene #03"
}