{
  "collections": [
    "Fisting Central"
  ],
  "description": "Sexy Rican ANTONIO BIAGGI is all set up to do some bench presses but his workout buddy COLIN STEELE has other ideas. COLIN can't keep his hands off that gigantic snake creeping down ANTIONIO's singlet leg. And even when COLIN gets in position over ANTONIO to spot him, he can't resist turning around and feeding his own beautiful muscled ass to ANTONIO's eager mouth. The view from down at ANTONIO's spread legs, crotch-side, is inspiring to be sure. ANTONIO reaches up and gobbles COLIN's beautiful ass, which makes ANTONIO's own cock-serpent grow impossibly longer and longer. COLIN finally frees his own impressive meat from the tight confines of his blue jockstrap and ANTONIO obliges by dining on COLIN's cock with gusto. COLIN is happy to return the service; his eyes bulge wide as ANTONIO releases his famous pinga in front of COLIN's waiting mouth. ANTONIO's giant, heavy balls swing pendulously as he slides his cock in and out of COLIN's straining maw. ANTONIO's fingers twitch in anticipation - much like COLIN's own hole, which he's eager to show to ANTONIO, throwing back his legs to reveal the tempting view. ANTONIO dives in with his tongue and fingers and finally his greased up cock. Soon, any extremity ANTONIO has handy is sliding up COLIN's sphincter, spreading him open more and more. The grease flies fast and furious as ANTIONIO gets more and more of his long, meaty hand into COLIN's upturned ass. COLIN's beautiful bearded face shows every wave of pulsing pleasure as ANTONIO's paw slides homeward. Soon it is pulsing, pushing, piston action in and out of COLIN's hungry hole. ANTONIO's own widening grin and pre-cum dripping cock are testament to the heat of this scene. Having worked COLIN's hole to a frenzy, ANTONIO flips him over, drives his gigantic cock deep inside COLIN's ass, and rides him for all he is worth. ANTONIO pulls out his cock and streams of cream spray from his fat cock head.",
  "models": [
    {
      "name": "Colin Steele",
      "person_id": 23208
    },
    {
      "name": "Antonio Biaggi",
      "person_id": 26299
    }
  ],
  "release_date": "2007-12-18",
  "scene_id": 45954,
  "tags": [],
  "title": "Fistpack 20 - First My Butt, Scene #01"
}