{
  "collections": [
    "Fisting Central"
  ],
  "description": "On a trough fit for a pig, Junior Stellano slowly works over the body of newcomer and Raging Stallion Exclusive Ryan Patrick. Stellano surveys the large hunk with translucent white skin and red hair. Stellano grips Patrick's thick slab of cock and strokes it, working it up. The hot, tattooed, and rock-solid Stellano works this fine man laid out before him. Stellano eases up the stud's legs and works Patrick's hole through his grey underwear. Stellano slowly tears the underwear apart, gaining access to the sweet pink hole of this hungry man stud. Stellano lubes up the stud's hole while simultaneously sucking Ryan's thick prick. He opens the hole wider and wider using both hands, inserting his fingers and stretching Patrick's anus. Patrick is eager and wants more: he pulls his leg to his chest giving Stellano full permission to enter. Stellano works his fist in as Patrick barks commands at his hairy top to shove his fist deep inside. Patrick begs, 'Come on! Keep going.' He wants his hole to be filled and he wants it filled now! Stellano takes his time, teasing Ryan. Deep inside Patrick's sweet hole Stellano twists his fist. Stellano's greased arm slides gently in and out of Patrick's hot white ass. Stellano works in both hands alternating each in a hypnotic rhythm, Patrick's massive meat seemingly getting thicker with pleasure. Patrick's hole opens wide under Stellano's skilled touch, but his pink ass wants more. Stellano works him into a frenzy. Patrick, being a hungry pig bottom, wants more and shows Stellano how much by taking his own fist up his unflinching ass. Stellano's dick is rock hard as he watches Ryan fist himself. Stellano stretches the stud's hole with his bare fist, sinking it deeper and deeper. Stellano turns the junkyard dog over and both men stroke their raging, throbbing cocks. Patrick grips his cock tight as he jerks his dick hard until he explodes his load all over his sweat-soaked body. Stellano, with beads of sweat covering his hard muscled body, also pumps his hard cock and spews his load all over Patrick's white skin.",
  "models": [
    {
      "name": "Junior Stellano",
      "person_id": 26301
    },
    {
      "name": "Ryan Patrick",
      "person_id": 26314
    }
  ],
  "release_date": "2009-11-08",
  "scene_id": 45973,
  "series": "Fistpack 25 - Junkyard Fist Dogs",
  "tags": [],
  "title": "Fistpack 25 - Junkyard Fist Dogs, Scene #03"
}