{
  "collections": [
    "Fisting Central"
  ],
  "description": "Taurus Dean, Raging Stallion's exclusive fisting top, takes charge in the first scene. Chris Neal, a Raging Stallion Regular and one of our most popular bottom studs, finds himself on a sawhorse watching Taurus lube up his talented hands. Taurus really loves ass, and it shows in every one of his amazing scenes (remember that Simon Cox scene in the Toolbox Trilogy???). Taurus knows how to handle a good ass, and Chris Neal has one of the best butts to be had! After a careful warm-up, Taurus shifts into high gear, delivering one of the most amazing fistings we have ever filmed. Repeated punching, great depth play, and beautiful shots of Neal's open hole will drive you mad! And in a Chris Ward Signature shot, Neal is on his back, his ass exposed, and his huge, enormous, rock-hard cock stands at attention as he looks down at the action across his torso! This is fisting at its best--great skill, scorching hot men, and action filmed as only Raging Stallion can!The second scene of this fantastic film pits RSS Exclusive Huessein against RSS Exclusive Sean Harris. Sean was introduced back in Construction Zone #1 (he is the guy on the cover!). Sean has taken the fisting world by storm, delivering scene after scene of excellent, first-rate fisting. His hungry ass has become an icon of the fisting community! He is, simply put, one of the finest fisting stars of all time! Huessein, another butt fanatic, can't get enough of Sean's eager hole. You have got to see how his hairy, muscular forearms slide in and out of Sean's perfect hole. This is another winning pairing that will certainly make it to the top ten list of the best fisting scenes of all time.",
  "models": [
    {
      "name": "Chris Neal",
      "person_id": 26286
    },
    {
      "name": "Taurus",
      "person_id": 26289
    }
  ],
  "release_date": "2005-02-05",
  "scene_id": 46026,
  "tags": [],
  "title": "Construction Zone 3 - Working Class Ass, Scene #02"
}