{
  "collections": [
    "Fisting Central"
  ],
  "description": "Quite simply one of the greatest fisting moments of all time, ChrisWard himself calls this the hottest handball scene he has ever filmed.Starring all three sexy boxcover supermodel superstars - ShaneRollins, Victor Rios and Jerek - this long, extended, uncut piece oferotica will wear you out not once, not twice, but over and over andover again. We simply cannot say enough good things about thisscene. Shane Rollins, Raging Stallion's reigning superstud joins withPuerto Rican Heart Throb Victor Rios (both were the stars of oursmash-hit Gay Dreams) to deliver almost an hour of unstoppablebackhand love to Jerek. Not since Jackson Price has their been sucha talented bottom; not since Jarred Wright has there been such anopen hole; not since Mark Evrett has their been such a dramaticrosebud; not since Corey Jay has there been such a fine fellow.Obviously we here at Raging Stallion think very highly of Jerek, andall of us are madly in love with him. Butt, we are also madly in lovewith Victor Rios' uncut cock and his shimmering furry chest. Some ofyou may recall that this exact same grouping made up the final threeway in our Movie Of The Year-- A Porn Star Is Born. Indeed, after thatshoot, these guys were so into each other that we brought them backto film this ALL FISTING version of their earlier scene. No footagefrom A Porn Star Is Born is repeated--this is all new original fistfuckingvideography. We have never done this before, but these guyswere so hot that none of us could resist filming them one more time!As Chris Ward said, 'What is so cool about this scene is that here wehave three, young, virile, stunning, beautiful men doing fisting! To lookat them you would never in your wildest dreams imagine that they areall butt-hole addicts. Butt when they start to play their nasty littlesecrets begin to show. I had no idea that I was about to film one ofthe finest scenes of my directing career until Shane's fist enteredJerek's ass. After that I was in heaven!'",
  "models": [
    {
      "name": "Jerek",
      "person_id": 26273
    },
    {
      "name": "Shane Rollins",
      "person_id": 26343
    },
    {
      "name": "Victor Rios",
      "person_id": 26351
    }
  ],
  "release_date": "2003-07-01",
  "scene_id": 46045,
  "series": "Probe",
  "tags": [],
  "title": "Probe"
}