{
  "collections": [
    "Fisting Central"
  ],
  "description": "The first scene, starring Raging Stallion Man of the Year ShaneRollins and brand new Chris Ward discovery Wilhelm Dragon, setsthe tone for the entire film. The scene begins with Shane reachinghigh towards the stars, fisting Dragon's hairy butt that shimmers likethe moon many feet above his head. That's right--Dragon haspositioned himself high above the floor with Shane below, thechiseled blond hunk delivering a major punch fisting right at eye level.This action is so hot that it may very well be the most amazing punchfisting ever filmed! After nearly 20 minutes of this unstoppable action,Shane leads Dragon over to a fuck table and delivers another, major,astounding fisting that leaves his Cory Jay look-alike bottom quiveringwith delight. Watch Dragon's ripped, hairy, abs shudder with eachpunching blow; listen to his filthy mouth begging for more! These menare so hot together that one wonders if any more fisting movies everneed to be made. But then, just when you think you have witnessedthe finest scene ever filmed for an uncensored hardcore motionpicture, Shane and Dragon take things to the next, mind-bogglinglevel! Dragon reaches around his hot, tattooed torso and grabs aspeculum. Deftly, he inserts the stainless steel spreader into hisgaping hole, all the while opening the device wider and wider untileveryone can see deep into his talented cavern. Shane, hard as aten-inch rock, straddles Dragon and throws one of the best fucks of alltime into the iron hole beneath him. Wait until you see how well thisaction was filmed--porn has NEVER been this good! Shane pulls outright before shooting his pent-up load, and as the streams of whiteman-jiz run down his huge cock, Dragon deep throats his top forevery last delicious drop. This pairing is a tour de force and is ashowcase study in the art of the highest quality of handball action.Most of you will not make it past the scene on the first viewing.",
  "models": [
    {
      "name": "Shane Rollins",
      "person_id": 26343
    },
    {
      "name": "Wilhelm Dragon",
      "person_id": 26344
    }
  ],
  "release_date": "2004-02-01",
  "scene_id": 46054,
  "tags": [],
  "title": "Toolbox 1 - Drilled, Scene #01"
}