{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Jimmy Clay's parents are letting him use their sweet cabin during his Winter break.  He's invited his friend Cameron Foster to come along on the trip.  They have several fun things planned, but for now they're taking advantage of the pool table.  Cameron's not a very experienced player, but Jimmy's been knocking the balls around for years.  Both dudes are into body building, and Cameron's noticed Jimmy really exploding recently.  Jimmy's most proud of his chiseled abs, and likes showing them off.  While taking a close look, Cameron feels emboldened enough to touch them, feeling the muscular ripples for himself.  He notices that Jimmy's shorts are sagging extremely low, enough so that Jimmy's cock is partially exposed.  Jimmy apologizes, but before he can pull up the shorts, Cameron is encouraging him to pull them down!  Jimmy quickly realizes what Cameron has in mind, and in no time Cameron's mouth is slurping upon Jimmy's fat dong!  This is exactly the type of vacation Jimmy had in mind AND why he invited this hot buddy.  Jimmy gets a taste of Cameron's hard dick too.  Then Cameron hops onto the pool table to allow Jimmy to slide his massive boner into Cameron's waiting pocket.  Watch Cameron take a solid fucking from his pal before they flip-flop so Jimmy can get banged.  It's all building up to probably the most INSANE cumshot you've ever seen!  You do not wanna miss what Jimmy has in store!Enjoy!",
  "models": [
    {
      "name": "Cameron Foster",
      "person_id": 16727
    },
    {
      "name": "Jimmy Clay",
      "person_id": 9918
    }
  ],
  "release_date": "2012-12-20",
  "scene_id": 46069,
  "series": "NDB - 4424 - Jimmy Clay & Cameron Foster",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Switching Pockets"
}