{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Deep in the recesses of the Next Door shoot house, there's a party going on. With 9 hot guys getting loose in the basement, something is about to go down. James Huntsman is serving up the drinks to fellow Next Door studs Tyler Torro, Connor Maguire, Brody Wilder, Johnny Torque, Campbell Stevens, Donny Wright, James Jamesson and Cameron Foster, and as the libations pour, the action heats up. With their drink already properly on, the guys look to satisfy their other urges, as steely glances give way to a den of flesh. Before long, the bodies begin to converge and the clothes come flying off. Tyler Torro and Johnny Torque takes turns with Cameron Foster's sweet ass, while James Jamesson & Brody WIlder trade off fucking Donny Wright's mouth. Getting in on the action, bartender James Huntsman takes turns with Connor Maguire as Campbell Stevens swordfights the two hunks in his mouth, before James flips Connor over and begins pumping him from behind. Tyler and Johnny switch up and Cameron Foster lets out a shriek as Johnny enters, the whole room turning into a skanky sweaty mess of musky men and funk as the guys line up and, one by one, shoot their loads like a firing squad. This is one party you'll be glad to crash!Enjoy!",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "James Huntsman",
      "person_id": 16691
    },
    {
      "name": "Connor Maguire",
      "person_id": 26412
    },
    {
      "name": "James Jamesson",
      "person_id": 9526
    },
    {
      "name": "Cameron Foster",
      "person_id": 16727
    },
    {
      "name": "Tyler Torro",
      "person_id": 13869
    },
    {
      "name": "Brody Wilder",
      "person_id": 17757
    },
    {
      "name": "Donny Wright",
      "person_id": 14218
    },
    {
      "name": "Campbell Stevens",
      "person_id": 18736
    }
  ],
  "release_date": "2012-12-27",
  "scene_id": 46126,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Condom",
    "Dark Hair",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Orgy",
    "Red Head",
    "Tattoo/Piercing"
  ],
  "title": "The Dungeon Club"
}