{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Race Cooper is a high-profile young man.  He lives in a fast city with fast people, and scarcely has time to do housework or make food and drinks.  That's partially why he hired a man-servant.  And it's a huge reason why Kiern Duecan has paid a visit this evening.As they chat about the activities of the week, getting comfortable out on the rooftop patio, Kiern asks Race for a drink.  Race summons Rob Lee, or 'Jay' as he's affectionately called by his master.  Rob sashays out with two screwdrivers on a platter, the kind Race always has served to his guests.  Rob wears only a white apron around his waist.  Kiern admires Rob's full, jiggling ass cheeks as he walks away.  'He full service?' Kiern asks.  'Whatever you want,' Race replies.  A few moments later, after being summoned again, Rob is sucking Kiern's swelling cock.  Race moves close to the action, leaning in and kissing Kiern.  Then the trio moves to the living room to continue the servicing.  Rob is switching between the two fat dicks in his face, taking each deep, one at a time.  Then he finds himself fulfilling his master's next command, having his hole licked and toyed with while Race himself face fucks him hard.  Then he's being treated when Kiern decides he wants a taste of the servant's boner.  Race takes advantage of the situation and fucks his lucky guest, firmly and relentlessly.  This is the type of upscale get-together that's possible when one has the opportunity to reap the fringe benefits of owning a man-servant. Enjoy!",
  "models": [
    {
      "name": "Kiern Duecan",
      "person_id": 21278
    },
    {
      "name": "Race Cooper",
      "person_id": 21216
    },
    {
      "name": "Rob Lee",
      "person_id": 26395
    }
  ],
  "release_date": "2013-01-18",
  "scene_id": 48343,
  "series": "NDE - E091 - Kiern Duecan, Race Cooper & Rob Lee",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Asian",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Black",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Oral",
    "Outdoor",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Full Service"
}