{
  "collections": [
    "Next Door Twink"
  ],
  "description": "After a nice workout, Joey, Jayden and Max are changing in the locker room and discussing plans for the evening. Max notices that Joey and Jayden have the same taste in undergarment support, and so he insists on getting a pic of the guys in their jocks. Pressing asses up together makes for a good fun shot, but as they pull away, Joey notices that Jayden has taken it a little more seriously than the rest, judging from his hard on growing out of his jock. Jayden, indignant, challenges Joey and Joey admits that he's never really been with a guy. So Jayden grabs his cock and pulls him closer, falling to his knees to convince Joey of what he's been missing. Max, still shooting pictures, decides to join in on the fun, pulling out of his clothes and kissing Joey's neck from behind. Joey quickly warms up to the idea and grows into of his role. Jayden keeps sucking on Joey, who has now gotten in on the act and has Max's dick in his mouth, slobbering all over it as Max looks down with his golden curls falling in his face. Ready to really test the waters, Joey dives into Jayden's ass and rims him in preparation for his cock, and once Jayden's hole is nice and moist, Joey shoves his cock inside and begins pounding away as Jayden strokes his cock and Max face fucks him. Joey is having a great time, but not as much as Jayden, who cums so quickly while Joey pounds away at him. And having seen one of his friends jizz from his meat stick, Joey decides he wants to fuck Max too. So Max bends over and Joey fucks him from behind until both guys are ready to burst, which they do, all over Jayden's cum covered mouth. As Jayden sucks every last drop out of Joey's quivering cock, Joey is forced to admit he was wrong in the first place, but that being wrong never felt so good.Enjoy!",
  "models": [
    {
      "name": "Joey Hard",
      "person_id": 16699
    },
    {
      "name": "Max Flint",
      "person_id": 26397
    },
    {
      "name": "Jayden Ellis",
      "person_id": 26436
    }
  ],
  "release_date": "2013-01-01",
  "scene_id": 48597,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Brunette",
    "Condom",
    "Cum swallow",
    "Dark Hair",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "Hard Intro"
}