{
  "collections": [
    "Next Door Twink"
  ],
  "description": "It's a drizzly afternoon while Christian Collins visits Max Flint for a round of the classic game, Twister.  Before they start, of course shirts and pants are removed to allow for better movement and flexibility.  Max is a shy boy, and it's his first semester at a new school.  He's glad to have made a friend like Christian.  As he balances himself in a funny position on the mat after taking his turn first, Christian stoops down and contorts himself in a way that doesn't allow much stability for long.  The two crash together on the floor, giggling and tossing back their heads without care, feeling comfortable with one another.  Max decides to go in for a kiss.  To his chagrin, Christian reciprocates.  Their tongues flick each other back and forth, up and down.  Max kisses Christian's body, moving his way down.  He pulls out Christian's healthy boner and wraps his wet lips around it, sucking while he looks into his friend's eyes.  After a bit of this, Max stands up so Christian can taste him.  He can tell Christian has sucked a dick before.  He likes the way Christian uses his tongue around the head.  Then Max lays Christian down on the bed and begins licking around his puckered hole.  Max loves the sensation it sends up his entire body.  But Max wants to go even further.  He rubs his hard cock on the hole, then slips it in.  Christian moans with delight as Max pounds his tight, sweet ass hard.  But Max also wants a nice stiffie in his own hole.  See these luscious boys turn a game of Twister into a wild and sexy afternoon romp!   Enjoy!",
  "models": [
    {
      "name": "Max Flint",
      "person_id": 26397
    },
    {
      "name": "Christian Collins",
      "person_id": 26426
    }
  ],
  "release_date": "2013-01-08",
  "scene_id": 48694,
  "series": "NDT - 8162 - Christian Collins & Max Flint",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Twister Twinks"
}