{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Donny Wright has contracted Cameron Foster to redesign his club. Cameron is a great designer, and he's always happy for the work, but he has taken this job with an ulterior motive. Knowing that Donny's club is a gay club, Cameron puts two and two together and figures he may be able to indulge in a secret fantasy of his. Donny senses his excitement and makes a move on Cameron's thigh, unsure whether or not Cameron will be receptive. Cameron is a bit nervous at first, but something about Donny's touch just feels right. And when Donny grabs his package and Cameron's shaft swells with a rush of energy, he decides to go with his instincts and let Donny have his way with him. And Donny is up to the challenge, falling to his knees and sucking Cameron off until he's good and hard. Cameron tries his hand at it, and not to Donny's surprise, he's a natural at it, taking Donny balls deep and smacking Donny's head against his tongue and lips. Donny asks Cameron if he'd like to get fucked and Cameron is ready, willing and able, so Donny eases it in at first, but as he sees Cameron getting more and more turned on with every thrust, he begins to pound more energetically, until he is fucking Cameron's ass with every ounce of energy he has. Cameron strokes his cock as Donny fucks him from the side, shooting his load messily all over his legs, and then Donny lets loose with such a massive load that Cameron thinks it's all over twice, only to be blasted by even more cum.Enjoy!",
  "models": [
    {
      "name": "Donny Wright",
      "person_id": 14218
    },
    {
      "name": "Cameron Foster",
      "person_id": 16727
    }
  ],
  "release_date": "2013-01-24",
  "scene_id": 48979,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Condom",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Oral",
    "Uncut cock"
  ],
  "title": "Attention to Detail"
}