{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "The three guys are sitting around, bored as hell one afternoon. Adam Hardy and Brody Wilder are passing the time with a friendly game of air hockey when Adam Wirthmore ups the stakes by offering the next goal scorer a free bj. All of a sudden, the competition level rises and the game gets a little more heated. As Brody slips the puck passed Adam, Wirthmore has already got his hand on Brody's fly and is unzipping it to get at his cock, sliding it into his mouth as Hardy comes over to ?at least watch?. But Wirthmore is nothing if not a cock pig, so he immediately has Hardy pull out his dick and has a swordfight in his mouth, as Hardy realizes today there will be no losers. Brody is worked up enough to get in on the act, so he trades places with Wirthmore and the two Adams take turns fucking his mouth. But Wirthmore has not had enough cock, and he begs to get fucked, so after Brody moistens up his asshole a little, he slides on top of Hardy and rides him while Brody fingers Hardy's taint and balls, before flipping Wirthmore over onto his back so the two of them can pig roast him properly. As the fuck him from opposite ends, all three guys are ready to burst, so first Wirthmore strokes himself off as Brody takes a turn in his ass, then Hardy blasts him with supersized load and finally Brody completes the trifecta when he shoots his sticky mess all over Wirthmore's hairy cum covered chest.Enjoy!",
  "models": [
    {
      "name": "Adam Wirthmore",
      "person_id": 9827
    },
    {
      "name": "Brody Wilder",
      "person_id": 17757
    },
    {
      "name": "Adam Hardy",
      "person_id": 19182
    }
  ],
  "release_date": "2013-02-14",
  "scene_id": 48978,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Loads",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Facial Hair",
    "Fraternity",
    "Hairy",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Hat Trick"
}