{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men presents Bottoms Up! Starring Joe Parker and Alex Adams.  Joe and Alex had an instant connection when they met and and because of this mutual attraction, Joe asked us if Alex could be the 1st person to fuck him on camera.  Fans have been waiting and waiting to see Joe Parker bottom and the wait is finally over.  Joe and Alex begin by kissing each other deep, passionate and hard.  Soon Joe is on his knees pulling out Alex's thick 8' cock and sucking it long and deep.  Alex then pulls out Joe's 9' cock and does his best to deep throat it to the hilt.  Soon Alex is on all fours as Joe burrows his tongue deep inside Alex's ass.  Joe eats his ass with gusto and then sits on the couch as Alex lowers himself down on his cock.  Alex rides Joe like a cowboy at the rodeo as Joe matches his thrusts pushing his cock deeper and deeper inside Alex's eager hole.  Joe then puts Alex on his back and continues fucking him long and deep and Alex is loving every inch of Joe's massive cock.  Alex then bends Joe over as he buries he tongue and face deep into Joe's ass.  Joe moans with sheer joy at the feeling of Alex's tongue and then begs Alex to fuck him.  Alex starts out slow as he plunges his full thick cock up Joe's super tight ass.  Once Joe is comfortable, Alex intensifies his thrusts until he is fucking Joe hard and deep.  Joe then sits down on Alex's cock and is loving every minute of it as evidenced by his own rock hard cock that is throbbing with every thrust of Alex's cock up his ass.  Alex grabs Joe's cock and starts stroking it and Joe cannot hold back any longer and he shoots a nice load of cum all over with Alex's cock deep inside him.  Alex then pulls out and shoots a thick creamy load of cum all over Joe's chest.  The two finish with a passionate kiss.  Enjoy!",
  "models": [
    {
      "name": "Joe Parker",
      "person_id": 28044
    },
    {
      "name": "Alex Adams",
      "person_id": 28090
    }
  ],
  "release_date": "2013-02-05",
  "scene_id": 49188,
  "tags": [],
  "title": "Bottoms Up!"
}