{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Anderson Lovell and Colton Fox are horsing around in the empty gym one afternoon. Colton gives Anderson some instruction on the finer points of a takedown, demonstrating his technique with a sweeping leg motion that has both guys face down on the mat. Colton can feel his midsection pushed up against Anderson's ass, silky and smooth through his wrestling gear. Unable to resist temptation, Colton runs his hand down the crack of Anderson's ass, and Anderson is both a bit surprised and a bit turned on. As Colton continues, it becomes clear that both guys would rather move onto a different sort of contact sport. Colton brings Anderson's face up to his and the two guys kiss before Colton strips Anderson down to his jock strap, rubbing and nibbling on his cock. Anderson is receptive and much more naturally gifted in this arena than he is at wrestling, running his hands through Colton's hair and pushing his mouth deeper and deeper onto his waiting dick. Anderson fingers Colton's hole and lubes up his cock, and in no time, he is on top of Colton and pumping him full and hard on down on the mat. Colton emits a whimper of pleasure as Anderson continues to thrust, Colton now on top of Anderson and riding his dick into a frenzy. Both guys are dripping sweat and almost out of breath when Anderson pulls out just in time to blast Colton's backside with a hot pool of jizz, and they lay there and enjoy the moment for just a second, before one of the guys here's someone entering and they have to flee.Enjoy!",
  "models": [
    {
      "name": "Anderson Lovell",
      "person_id": 26648
    },
    {
      "name": "Colton Fox",
      "person_id": 26649
    }
  ],
  "release_date": "2013-01-29",
  "scene_id": 49231,
  "series": "NDT - 8165 - Anderson Lovell & Colton Fox",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Condom",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Twink",
    "Uniform"
  ],
  "title": "Sneak Technique"
}