{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "James Huntsman reclines on a sofa seat running his fingers up and down is chiseled physique, eyeing himself in a mirror and getting hard at the thought of some satisfaction. Wishing for some companionship, James is about to get more than he asked for, as six  of the hottest guys in the house file into the room one by one. Cameron Foster and Samuel O'Toole are first to emerge, and Cameron immediately falls to his knees and begins to suck James off while Samuel gropes and kisses at his neck. Connor Maguire soon takes Samuel's attention away from James and moves him over to the bed, while Johnny Torque and James Jamesson to fill in. Johnny joins James and Cameron and Jamesson gets up on the bed and shoves his cock into Samuel's mouth. Lastly, Vinnie Castillo arrives on scene, and as Johnny moves over to accomodate his massive cock into the mix, Vinnie shoves his cock into Johnny's mouth as James Jamesson watches lustfully from across the room. Next Cameron and Conner each bend over, allowing anyone that wants a piece to get a piece. James Jamesson pounds Connor missionary as Conner sucks O'Toole's giant cock, and James Huntsman fucks Cameron as Johnny teases Cameron's mouth with the tip of his cock, before gathering around Conner and Cameron and blasting them with one hot shot of cum after another.Enjoy!",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Cameron Foster",
      "person_id": 16727
    },
    {
      "name": "James Jamesson",
      "person_id": 9526
    },
    {
      "name": "Vinny Castillo",
      "person_id": 17793
    },
    {
      "name": "Samuel O'Toole",
      "person_id": 10367
    },
    {
      "name": "Connor Maguire",
      "person_id": 26412
    },
    {
      "name": "James Huntsman",
      "person_id": 16691
    }
  ],
  "release_date": "2013-03-21",
  "scene_id": 49762,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Condom",
    "Dark Hair",
    "Fraternity",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Orgy",
    "Red Head",
    "Tattoo/Piercing"
  ],
  "title": "Multiple Options"
}