{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men is pleased to present Diesel Washington and Sean Duran in WHITE DREAM BLACK CREAM.  Sean Duran is relaxing as Diesel spends a significant amount of time busying himself as he waits for Sean to rise from his slumber.  Feeling horny and ready for action, Diesel tickles Sean a little bit on his feet to wake him up.  Sean wakes with a big smile and the two embrace in a deep long impassioned kiss.  Diesel works his way down Seans body and soon has Sean's hard cock pulled as he eagerly deep throats it with gusto.  From cock to kissing and back again and again these two cannot keep their hands off each other.  Soon Sean has Diesel's massive cock all the way down his throat as Diesel moans in ecstasy.  Diesel then rolls Sean over on the bed and goes to town eating his beautiful hole readying it for the long sensual fuck that Sean was dreaming about.  As Diesel works all 10' of his massive cock inside Sean's ass you can see the delight on Sean's face.  Over the next several minutes these two position themselves into so many configurations it is hard to count how many positions they can do.  Soon Sean is begging Diesel to fuck him hard and long as he shoots a massive load of cum all over his belly.  Diesel pulls out to ready himself to shoot, but before he does he tastes Sean's cum and sucks the remaining drops out of his hard cock.  So tuned on he strokes his cock and shoots a huge load all over Sean's face and mouth before bending down and lapping up all his remaining cum off Sean's face and then cum-swapping as the two kiss like only two men totally into each other can!  ENJOY!",
  "models": [
    {
      "name": "Diesel Washington",
      "person_id": 28049
    },
    {
      "name": "Sean Duran",
      "person_id": 28079
    }
  ],
  "release_date": "2013-02-19",
  "scene_id": 49819,
  "series": "Diesel Washington And Sean Duran",
  "tags": [],
  "title": "White Dream Black Cream"
}