{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Hunter Page is very excited about a costume party he'll be attending this weekend.  But he doesn't have any idea what to wear! His friend from school, Max Payne, has invited Hunter over to peek around his closet for an outfit.  Hunter's heard rumors about Max around school and he's a little nervous to possibly encounter what he's heard is a 'monster cock.'After a bit of scrounging, Hunter comes across a wrestling uniform that'll be perfect for the party.  He tries it on in front of Max.  While Hunter checks himself out in the mirror, he notices Max rubbing his crotch.  He deciphers the outline of Max's dick.  And before Hunter can say anything, Max pulls out his incredible cock, hard as steel.  Hunter can't believe the size.  Max calls Hunter over, telling him to suck it good.  Without hesitation, as if being drawn by an unseen force, Hunter walks over and sucks Max's monster cock.  After some enjoyment, Max flips over and tells Hunter to lick his asshole.  Hunter does with delight, also continuing to slurp Max's dong from behind.  Then it happened.  It was exactly how Hunter had imagined while staring at Max's crotch in Geometry class.  Max laid on his back and positioned Hunter over his hard dick.  Hunter sat on it, feeling the long, warm meat go into him.  He liked it.  After a little of this, Max repositioned, fucking Hunter from behind this time.  At first he started slow, but soon worked into a wild frenzy of ass slamming.  smack! smack! smack!  Hunter couldn't believe how much power Max could exert.  He had Hunter's head in a full-nelson while banging him with all his might.  Hunter also couldn't believe how good it felt.Enjoy!",
  "models": [
    {
      "name": "Hunter Page",
      "person_id": 26669
    },
    {
      "name": "Max Payne A",
      "person_id": 27034
    }
  ],
  "release_date": "2013-02-26",
  "scene_id": 50092,
  "series": "NDT - 8169 - Max Payne & Hunter Page",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Condom",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink",
    "Uniform"
  ],
  "title": "Dress-up Games"
}