{
  "collections": [
    "Next Door Twink"
  ],
  "description": "What do you get when you take 3 hot Twinks, a room full of balloons, and permission to go nuts?? It's a popping party!!!  So strip down to your undies and jump in with Axel Wolf, Jay Cloud, and the insatiable Andrew Markus. They're having a heck of a wild time, frolicking and wrestling while pastel balloons drift, sail, and pop all over the place.  As Andrew tries a playful wrestling maneuver on Axel, he winds up getting a face full of Axel's sweet ass!  Jay notices Andrew's reaction and decides to suggest the boys shift gears to some sexy, but equally as fun activity.  The guys come together first for a three-way makeout!  Then it's off with the underwear for a little more risqu? playing.  Watch Andrew and Axel share Jay's massive cock.  They can't get enough of his swollen erection.  Then Axel joins Jay while they feed dick hungry Andrew both fat dongs at the same time.  But Jay wants a taste too, so the boys get into a triple suck train.  Jay's been itching to slide his cock into Andrew's ass and Axel loves the feeling of a warm mouth bobbing while the other end gets fucked.  Check out Axel and Jay high five while they form an 'Eiffel Tower' over sweet Andrew.  But it ain't over until Axel pounds that tight hole too.  It's a wild balloon romp where anything goes and everyone's having a hot, sticky good time!  Enjoy!",
  "models": [
    {
      "name": "Andrew Markus",
      "person_id": 27051
    },
    {
      "name": "Axel Wolf",
      "person_id": 27124
    },
    {
      "name": "Jay Cloud",
      "person_id": 10696
    }
  ],
  "release_date": "2013-03-26",
  "scene_id": 50236,
  "series": "NDT - 8173 - Axel Wolf, Jay Cloud & Andrew Markus",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Loads",
    "Climax",
    "Condom",
    "Dark Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "Popping Party"
}