{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Most every guy has that one Summer fling he'll never forget. For Connor Maguire, it's happening right now. A couple months ago, he met a guy named Johnny Torque at a friend's party. It was a night neither would forget. They had instant chemistry. Laughing, drinking, exchanging sexually tense glances, they both knew exactly what they wanted.  But after exchanging numbers that first night, Johnny started a new job and Connor was busy with school. Their schedules only allowed them to see each other once, sometimes twice a week. When they did spend time together, they made the most of it. They would steal away to the back of crowded bars to make out for a few minutes. Once Johnny gave Connor a handjob in a dark corner of a downtown parking garage.  And now Summer was ending, which meant Johnny would be moving back home, across the country, probably for good. As Connor lay in bed, touching himself, he receives a text from Johnny. Johnny's willing to take a long lunch from work to come see Connor one last time. When he arrives, Connor greets him with big smile and a hard cock. They don't waste any time locking lips passionately. Connor lays Johnny back on the bed and takes his cock deep down his throat. Even though they had been anticipating this for a long time, it felt better than either could have imagined.  They switch to a 69 position so Connor can lick Johnny's sweet hole while Johnny sucks Connor's swollen dick. Then Connor mounts himself on top of Johnny and rides him hard.  It may be the last time they'll see each other, but the afternoon, the Summer would always be a memory.Enjoy!",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 26412
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    }
  ],
  "release_date": "2013-04-04",
  "scene_id": 52148,
  "series": "NDB - 4439 - Johnny Torque & Connor Maguire",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Muscles",
    "Condom",
    "Dark Hair",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Red Head",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Summer Fling"
}