{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Alex Christian has popped into a little countryside massage parlor for a rub down on his way home from the office.  He's seen the small storefront for years and always wondered about the place. Well after a long day of board meetings, he's finally checking it out. A young man by the name of Josh Long is providing service on this particular late afternoon. When Alex enters, he greets Josh with a 'hello,' but receives no salutation in return. Wearing nothing but a blue pair of tightly fitting underwear, Josh simply motions for Alex to remove his clothing and lay down on the massage table. Alex does and the rubbing begins. Josh kneads and manipulates slowly and carefully.  Alex melts under his touch. Then Josh moves the focus of the rubbing a bit further south, squeezing Alex's butt cheeks. Alex is slightly alarmed at first, but can't believe how good it feels. Josh pulls Alex's shoulder back, suggesting he flip over. Alex does and Josh pulls down Alex's underpants. Alex can't believe what's happening.  Josh takes Alex's cock in his hand first, then in his warm, salivating mouth. He sucks with tenderness and passion while Alex enjoys. Then Alex accepts Josh's hard dick in his own mouth. It's quite large, but fits perfectly between his lips. They move to a bed with fresh linens and Alex has a taste of Josh's sweet asshole. Then comes time for what makes this massage clinic famous: Deep Therapy. See Josh slide his throbbing boner into Alex's tight hole and pound it firmly. You'll know why customers keep cumming! Enjoy!",
  "models": [
    {
      "name": "Josh Long",
      "person_id": 27264
    },
    {
      "name": "Alex Christian",
      "person_id": 27283
    }
  ],
  "release_date": "2013-04-18",
  "scene_id": 52149,
  "series": "NDB - 4441 - Josh Long & Alex Christian",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Condom",
    "Dark Hair",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "The Deep Therapy Clinic"
}