{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men presents SUPER SHOOTER with the 2013 XBIZ Gay Performer Of The Year, Trenton Ducati and our exclusive CJ Parker.  The chemistry between these two was powerful the moment they met and even before our cameras were rolling, they couldn't keep their hands off each other.  They were so hot for each other that they asked if they could just start the scene without any clothes and get right to it.  Almost before we could get our cameras rolling, they were naked, hard and kissing each other on the bed.  What followed was one of the most passionate, intense and erotic scenes we have filmed to date.  Trenton goes down on CJ first and as he is sucking his cock CJ begins fingering Trenton's ass to the delight of Trenton who tells him to finger his hole deep.  Trenton takes charge and orders CJ to suck his cock and CJ waists no time taking all 8' down his eager throat.  Trenton then begins to finger CJ's ass while his cock is buried deep down his throat.  First one finger, then two and three while he uses his spit to get CJ's ass opened up for his cock.  CJ climbs on Trenton's cock and rides him long and deep before Trenton bends CJ over the bed and fucks him hard and deep while CJ howls for him to fuck him harder!  CJ ends up on his back and before Trenton fucks him some more he inserts four fingers up CJ's ass as CJ begs for his cock inside him.  Trenton then pounds CJ's ass so deep that CJ cannot hold back any longer and shoots the biggest load of cum we have seen in a long time.  The first shot hits CJ in his own face and he just keeps cumming and cumming.  Trenton pulls out and shoots a nice thick load all over CJ's hairy chest and CJ laps up the last drop of cum out of the tip of Trenton's cock and the two share the load in a deep passionate sweaty kiss.  Enjoy!",
  "models": [
    {
      "name": "CJ Parker",
      "person_id": 31291
    },
    {
      "name": "Trenton Ducati",
      "person_id": 32299
    }
  ],
  "release_date": "2013-03-26",
  "scene_id": 52155,
  "tags": [],
  "title": "SUPER SHOOTER"
}