{
  "collections": [
    "High Performance Men"
  ],
  "description": "NEOPOLITAN. These three men represent three different decades along with three distinct 'flavors' with Allen being the 'Vanilla,' Will being the 'Chocolate' and Christopher being the 'Strawberry' in this tasty three way. The sex they share with each other is a true celebration of gay male sexuality. At 51 years of age, Allen Silver is in his sexual prime and along with his life partner Will Swagger (44) they pair up with the hunky Christopher Daniels (33) for some hot action. They start out in the pool naked where they are all embraced in a deep kiss. Will soon has Christopher's hard cock deep down his throat as Christopher sucks on Allen's cock. The sucking in the pool goes back in forth for a bit before all three move inside to continue things on their bed. Will and Christopher continue with the sucking as Allen urges them both into a hot 69 session. Christopher then finds his face buried deep in Will's ass while Allen deep throats Christopher's cock to the hilt. While Christopher is rimming Will, Allen begins rimming Christopher and the three switch back and forth eating each other's asses. Soon, Will slides his ass down on Christopher's long cock and rides him hard and deep as Allen sits on Christopher's face. The two switch positions and Christopher continues to fuck long and deep. Allen then bends Will over the side of the bed and begins fucking him as Christoper inserts his big cock into Allen's ass. All three grind and fuck in a hot train position before climbing back on the bed. Will continues to ride Christopher's cock until he cannot hold back any longer and shoots a nice big load of cum all over his stomach and chest. Allen feeds the cum to both Will and Christopher which turns Christopher on so much that he shoots a big load of cum all over Will's face and mouth. All three swap Christopher's cum for a bit before Allen tells Will to show him his ass as he blows a nice load all over Will's bubble butt. Exhausted, all three embrace in a deep kiss spent from all the hot action. Enjoy!",
  "models": [
    {
      "name": "Allen Silver",
      "person_id": 27408
    },
    {
      "name": "Will Swagger",
      "person_id": 27409
    },
    {
      "name": "Christopher Daniels",
      "person_id": 32932
    }
  ],
  "release_date": "2013-04-16",
  "scene_id": 52910,
  "series": "Allen Silver, Christopher Daniels And Will Swagger",
  "tags": [],
  "title": "NEOPOLITAN"
}