{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Brayden Michaels is a boy scout with determination. His troop, Troop 9, has engaged door-to-door cookie sale to raise money for things like new compasses, night crawlers, and clay for pottery hour. With a box of this season's finest, Brayden sets out to earn a top badge in fundraising!  Brayden's a little nervous. He's heard stories from other scouts about men who live in the neighborhood. Some of the stories are fun, but some are scary. When Jake Farren answers the door at a big house on the hill, Brayden is hopeful. Jake seems nice and looks like a guy that enjoys a good cookie. When he invites Brayden inside, Brayden figures this might be a guaranteed sale! As he shows Jake the varieties of cookies, Jake takes his pants off and stands before Brayden in only his undies. 'What are you doing?!' Brayden asks him. Jake sits on the bed close to Brayden and puts his hand near Jake's penis. 'I have to go!' Brayden says, but it's too late. Jake has taken down his underwear and somehow Brayden's hand has wound up on Jake's pulsating erection! What's a scout to do?! Brayden figures he needs a sale if he's ever gonna get that fundraising badge. He bends down and puts his mouth around Jake's cock, licking and sucking. Brayden likes how it tastes; sweet, kinda like cookies. Then Jake sucks on Brayden's dick. Brayden enjoys the warm sensation. Then, after Jake sticks his tongue in and all round Brayden's sweet, tender hole, he lays him down and shoves his giant dong inside the eager scout. Watch this cookie sale turn very hot as this scout gets more than he bargained for!Enjoy!",
  "models": [
    {
      "name": "Brayden Michaels",
      "person_id": 27538
    },
    {
      "name": "Jake Farren",
      "person_id": 19116
    }
  ],
  "release_date": "2013-05-14",
  "scene_id": 52995,
  "series": "NDT - 8180 - Jake Farren & Brayden Michaels",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Dark Hair",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink",
    "Uniform"
  ],
  "title": "Taste My Cookies"
}