{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Andrew Fitch is making his way over to the gym to get in his workout, same as he does 5 days a week. Jack Patrick is up early and has already worked out, now standing in front of his locker undressing to shower. As he does, he looks around, and realizes he's alone. Taking the private moment to indulge somewhat, he sneaks into Andrew's locker and sees Andrew's jock hanging up. Thinking of Andrew's body filling out the garment gets Jack all hot and bothered, and as he sniffs the jock and inhales Andrew's scent, the fantasy becomes that much  more tangible to him. It's right about that time that Andrew walks up, sees Jack invading his privacy, and gets mad about the intrusion. Storming into the locker room, he confronts Jack, who is both speechless and without remorse. Seems the only way to teach him a lesson is to give him what he wants, so Andrew pushes Jack down onto his knees and shoves his crotch into Jack's face. With his fantasy so close Jack does not pretend or protest, instead he lets Andrew use him any way he sees fit. Andrew feels Jack's mouth on his cock and realizes almost immediately that what started out as punishment will actually end up as reward, as he plunges his rock hard cock down Jack's throat before bending him over the bench and then slamming him from behind up against the lockers, Finally unleashing his pent up load all over Jack's chest, Andrew decides he's not only doled out enough punishment, but also that he's had his workout for the day. Enjoy!",
  "models": [
    {
      "name": "Andrew Fitch",
      "person_id": 27504
    },
    {
      "name": "Jack Patrick",
      "person_id": 27684
    }
  ],
  "release_date": "2013-05-30",
  "scene_id": 53385,
  "series": "NDB - 4447 Andrew Fitch & Jack Patrick",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Dark Hair",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Jock Invasion"
}