{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Master Aron Ridge has ordered his minion, Nubius, to fetch him a fresh piece of meat. Nubius has returned with a submissive fellow named Luc Bonay. As Master Aron surveys the tender Bonay, his wicked sidekick, Draven Torres snickers and salivates. He can't wait for instruction from the Master to pull his cock out and shove it down Bonay's throat. Once the rules have explicitly been explained, Master Aron bestows the name 'Slut Whore' upon Bonay. Then it's a nightmarish series of sexual endurances for the poor young lad. Nubius is sliding his big, fat dick right into Luc's mouth. And the Master himself is slapping the sense out of him. Watch Draven enjoy Luc's warm mouth too as he grins from underneath his evil-sidekick mask. It's more than sweet Luc could have ever imagined when Nubius, Master Aron's go-to henchman, bends him over and slams his hard boner into his tight ass. The black leather outfit they made him wear is becoming very hot and uncomfortable.  While he's being fucked hard, Master Aron dips his cock into Luc's open, upside down mouth. It's difficult for Luc not to gag. But once the Master has finally finished ravaging Luc's soft butthole, and Draven is through face fucking the mouth hole again, it's safe to say this slut whore will have been properly broken in...for today, anyway!    Enjoy!",
  "models": [
    {
      "name": "Aron Ridge",
      "person_id": 21305
    },
    {
      "name": "Draven Torres",
      "person_id": 21304
    },
    {
      "name": "Luc Bonay",
      "person_id": 21303
    },
    {
      "name": "Nubius",
      "person_id": 21196
    }
  ],
  "release_date": "2013-05-24",
  "scene_id": 53406,
  "series": "NDE - E109 - Nubius, Luc Bonay, Aron Ridge & Draven Torres",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Black",
    "Dark Hair",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Latino",
    "Masturbation",
    "Oral",
    "Orgy",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Lesson for a Slut Whore"
}