{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Alexander Gustavo has hurt his shoulder, over extending it training for his triathlon. Lucky for him, Chip Tanner is one of the best in the business, for more than one reason. As Alexander lays down on Chip's massage table, he is able to relax almost immediately as Chip begins to relieve his muscles with a soothing touch and apt pressure. Alexander momentarily forgets where he is as Chip runs his oiled hands along Alexander's back and down his legs. Slipping his underwear off, Chip gives into his temptation to take a nice lick of Alexander's crack. Alexander loves the feeling, reaching his hand back and reassuring Chip that he's made the right choice by pulling his face even tighter. Chip licks down to Alexander's feet and then all the way back up to the shoulder, turning him over and continuing his oral examination on Alexander's cock. Alexander feels amazing all of the sudden, so good that he flips Chip over and tells him to spread his legs for a return favor. Flexible Chip spreads his legs almost 180 degrees, and Alexander plunges his tongue deep inside of Chip, slurping on his cock and moistening up his exposed hole for insertion. As he is penetrated, Chip spreads even wider, and Alexander fucks him good as Chip succumbs to his every notion. On his back, on his side, on his stomach- it doesn't matter- as long as Alexander's cock is inside him, Chip is a happy camper, until Alexander pulls out and blasts his load all over Chip's luscious ass, and both guys agree that, regardless of injury, Alexander will have to come back again.</br></br>Enjoy!",
  "models": [
    {
      "name": "Alexander Gustavo",
      "person_id": 27416
    },
    {
      "name": "Chip Tanner",
      "person_id": 27619
    }
  ],
  "release_date": "2013-06-13",
  "scene_id": 53405,
  "series": "NDB - 4449 - Alexander Gustavo & Chip Tanner",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Dark Hair",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Muscle Movement"
}