{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men is pleased to present Matt Stevens & Drake Jaden in DIRTY SEXY JOCKS. This is Matt's first time appearing at HPM and the pairing of these two came to fruition when Drake introduced us to Matt in hopes he could shoot with him. Both have a fetish for locker rooms and jock straps, so it was a no brainer to pair them up. The two begin with a deep passionate kiss that is aggressive and soft all at once. Soon their clothes come off to reveal both of their beautiful asses framed by their jock straps. Matt is soon on his knees taking Drake's massive cock all the way down his throat. His sucking skills are impressive and by the sounds Drake makes, he approves. Drake then returns the favor and deep throats Matt's cock before turning him around and sticking his tongue deep into Matt's ass. Matt grinds his ass on Drake's face and love every moment of the rim job. Matt then puts Drake on his back and buries his face deep into Drake's ass. He rolls him up as he tongues his ass deep and as he does so, Drake is sucking the end of his own cock for some hot auto-fellatio action as he tastes his own pre-cum. Matt then drives his cock deep and hard into Drake's ass and fucks him hard. Drake then put's Matt up against the lockers as he drives his huge cock deep inside Matt's beautiful ass. Matt loves every moment of Drake's cock in his ass and then lies on his stomach as Drake pile drives his ass even deeper. Unable to hold back any longer, Drake pulls out and Matt flips over to take Drake's load all over this muscled hairy chest. Drake then grabs a glass dildo out of the locker and drives it deep into Matt's ass while Matt strokes his cock and sucks the remaining cum out of Drake's cock. He tells Drake to suck his cock some more and he unloads a massive load of cum inside Drake's mouth. Drake let's the cum ooze out of his mouth down Matt's cock before sharing the remaining cum in a deep tongue swapping kiss with Matt.",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Matt Stevens",
      "person_id": 31203
    }
  ],
  "release_date": "2013-05-14",
  "scene_id": 53455,
  "series": "Drake Jaden And Matt Stevens",
  "tags": [],
  "title": "DIRTY SEXY JOCKS"
}