{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Kiern Duecan and boyfriend Jordano Santoro are on the hunt for a place to call home, and their search has taken to them to a high rise flat overlooking the city. The place, though under renovation, seems to have all the amenities the couple are looking for. Their agent, Pharrell, who has shown them a few places, feels pretty solid about the chances that this will be the one. Kiern & Jordano are not so sure, until they spend a little quality time in the bedroom, that is. Dropping to his knees, an insatiable Jordano grabs Kiern's cock and immediately starts gagging on it. Kiern throws his head back moans, and outside, Pharrell wonders what's going on inside the room. Interrupting, he sees them mid-coitus, and, hoping to seal the deal with them, decides that maybe joining is the best course of action. Jordano and Kiern are more than willing, of course, and before he knows it, Pharrell finds his pants around his ankles and swordfighting with Kiern inside Jordano's mouth, before they take turns fucking him from behind on an ottoman. Jordano loves the attention and the feeling of Kiern's dick inside of him, as he rolls over onto his back and lets the guys switch, taking Kiern's dick inside of his mouth as Pharrell begins to pump while Jordano strokes himself off, all of them dousing Jordano with a thick load of milky white jizz. Once they regain their breath, both Jordano and Kiern agree this is a place they could get used to.Enjoy!",
  "models": [
    {
      "name": "Jordano Santoro",
      "person_id": 21259
    },
    {
      "name": "Kiern Duecan",
      "person_id": 21278
    },
    {
      "name": "Pharrell",
      "person_id": 27722
    }
  ],
  "release_date": "2013-05-31",
  "scene_id": 53459,
  "series": "NDE - E110 - Kiern Duecan, Jordano Santoro & Pharrell",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Black",
    "Dark Hair",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Latino",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Tenant Behavior"
}