{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Jaxon Colt loves to party.  But last night he took a 'party pill' from a friend that's made him extremely nauseous this morning. He feels so bad, in fact, he dialed an emergency response service to have someone come to his house to check him out. That's what brought over responder Slate Steele.Slate's seen his share of post-party overdoses, and he can tell Jaxon's gonna be ok.  As Slate checks Jaxon's vitals, Jaxon does some checking of his own.  As Jaxon's hand runs up Slate's shirt, Slate tells him that he too likes to party, but his advances are completely inappropriate.  After only very little reassurance from Jaxon, Slate's shirt is off and Jaxon is licking his incredible chest and stomach.  This is the type of house call Slate enjoys most.  Jaxon takes the liberty of pulling out Slate's hard, fat dick and giving it a taste.  Slate can't believe how well Jaxon works a dick.  Slate wants Jaxon's dick in his mouth next.  Watch him slurp deeply while Jaxon's toes curl with delight.  Then Slate's pulling out a tool from his bag of emergency tools.  It's a nice, large dildo that he slides into Jaxon's hole for a nice, hard banging.  After Jaxon spends some time tonguing Slate's hole, Slate bends Jaxon over to give him the real thing.  Check out these two incredible, tattooed hotties get to know each other when Slate pounds Jaxon like his life depends on it.  Enjoy!",
  "models": [
    {
      "name": "Jaxon Colt",
      "person_id": 27717
    },
    {
      "name": "Slate Steele",
      "person_id": 27718
    }
  ],
  "release_date": "2013-06-06",
  "scene_id": 53458,
  "series": "NDB - 4448 - Jaxon Colt & Slate Steele",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Condom",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Toys",
    "Uniform"
  ],
  "title": "Rescue and Revive"
}