{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Donning fine men's garments is an experience every gentleman should enjoy. James Huntsman has found himself in a position to have a renown tailor visit him at his home. Luke Milan has an expert's eye for fashion. He can analyze individual male forms and arrange a custom outfit to suit any occasion. Luke is more than happy to analyze James's form. Luke suggests James strip down to his underwear to try on some of the options. Once James disrobes, the thought occurs to Luke that he may very well be able to trick James into taking off his undies, thereby become completely nude. Luke would certainly like to see how James is hung, just for his own naughty enjoyment. From there, there could be an opportunity to seduce the young man. Luke concocts a story about a matching pair of underwear James should try. Without any coaxing, James is wearing his birthday suit. Luke finds an excuse to bend down near the enormous dick, and takes it in his mouth. James can't believe his tailor is sucking his fat cock. But he's certainly not stopping him! Luke is a true dick fiend, made evident by the manner in which he ravenously slurps James. Watch him take good care of the whole package as Luke jerks his own meat too. Then see Luke lay back so his client can fuck his sweet ass nice and hard. James isn't the usual customer, with his very well built physique. His strong muscles work hard to ram Luke's tender hole. Then Luke is climbing on top for a nice, intense ride. You'll love seeing these two hot guys work on finding the perfect fit! Enjoy!",
  "models": [
    {
      "name": "James Huntsman",
      "person_id": 16691
    },
    {
      "name": "Luke Milan",
      "person_id": 27174
    }
  ],
  "release_date": "2013-05-16",
  "scene_id": 53463,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Climax",
    "Condom",
    "Dark Hair",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Tailored Fit"
}