{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brok and Mark were introduced to us last week when they decided that seeing each other do a sexy show was just the ticket to keep the spark in a relationship that started after meeting in a gym a decade ago. Was it Mark's square-jawed handsomeness that first attracted Brok? Did Mark see that nine inch cock in the locker room and decide he needed to get to know more about the man attached to it? That we do not know, but you will see that watching each other perform for the cameras was like unlocking a door that had never been opened in a house they have lived in for ten years. Suddenly, everything is fresh and new all over again as they rediscover each other's individual sexuality, despite the fact they have been sharing a bed for many moons now. It was just the beginning of an adventure that spilled over to this week.  They could not wait to return. Holding off the usual bedroom activities for a few days, they returned to the studio almost immediately, unleashing a pent up need that erupted in a display as passionate as it was primalBrok and Mark almost lunge at each other and the tight grasp, closed eyes and undiluted pleasure of their lips meeting carry the excitement of a first kiss, which quickly blends into all of the advantages of being with a partner who knows every pleasure zone you have. Rock hard cocks disappear into mouths, then into a sixty-nine before Mark's jock visibly throbs as he lick's Brok's sack with those inches swaying above, dripping the promise of the joy to come down Mark's hungry face.  As a tongue and then a finger move to Mark's eager hole, it's clear the promise of being filled is about to be fulfilled with some overdue rear entry.Resting on his elbows with his ass spread wide, we can see just how long and fat Brok's cock really is with that swollen helmet on top of nine twitching inches, standing poised and ready at Mark's hungry hole.  He slowly eases it in, inch after inch as Mark purrs like a well fed lion that is still very, very hungry. Over a steady chorus of deep moans and dirty talk, Mark slams back until Brok's balls are rubbing Mark's cheeks before Mark gets up and rides that pole like a jockey coming into the home stretch of the derby. Mark rips a nut all over his stomach while Brok unloads right into his hungry lover's mouth. This honeymoon isn't over...it's just beginning.",
  "models": [
    {
      "name": "Brok Phiffer",
      "person_id": 27806
    },
    {
      "name": "Mark Sven",
      "person_id": 27807
    }
  ],
  "release_date": "2005-09-29",
  "scene_id": 53574,
  "tags": [],
  "title": "Brok and Mark The Movie, Scene #02"
}