{
  "collections": [
    "Men Over 30"
  ],
  "description": "Rayme described himself as a ?geek,? but at 5'11 and 190 pounds of muscle, the ?Greek? is as about as close as this fine specimen of a man comes to anything remotely geeky. With pecs that are down right expansive, a set of glutes that are worthy of an epic poem, a smile that literally lights up a room and a thick, hard slab of cock, Rayme was too big to fit into our suitcase home from Vegas, so we preserved the fine form of that prime physique in the ultimate Sin City souvenir.  He wasted no time in making himself comfortable and the only thing that could improve upon the million dollar bathroom of a Vegas suite was a man this fine, this horny, and this ready to get naked.Stripping down to his black briefs, we finally get to appreciate how well-formed every muscle in his body is, from those broad shoulders to those defined obliques to those Sequoia-like hamstrings.  With a smile of sheer joy at not just getting naked, but showing off for the camera, he shimmies down his briefs revealing a dark triangle-shaped bush, his thick, cut chub already showing signs of life. He luxuriates under the water, his body glistening and his dick rising to full mast as soon as his hands found the center of his ass and, borrowing a trick from the prisoners of cell block six by way of David Copperfield, he first drops the soap, and then makes it disappear!Coming out of the shower, Rayme straddles the bathtub, rubbing himself all over the porcelain and fingering his hole while he works his cock like a man possessed. That anal invasion makes his cock visibly throb.  He moves to the bed, grabs a skin mag to find some female flesh, and that is all it takes for him to begin stroking with a speed that approached aerobic levels. Grunting and curling his toes, he leaves a little memento that is one of the few things that actually will stay in Vegas!",
  "models": [
    {
      "name": "Rayme",
      "person_id": 27808
    }
  ],
  "release_date": "2005-10-06",
  "scene_id": 53576,
  "series": "Rayme The Movie",
  "tags": [],
  "title": "Rayme The Movie, Scene #02"
}