{
  "collections": [
    "Men Over 30"
  ],
  "description": "Those baby blue eyes on that square-jawed, handsome face crowning the body of a soap opera hunk give us all hope as Troy Halston, one of our favorite men on camera and off, embody the truth about some MenOver30 who put in the effort and get hotter and sexier with each year of experience. Though happily married, we know Troy can fill a man's ass like the uber-stud he is. We kicked off the summer where Troy demonstrated, in the bright sunlight reflected from the pool, and with the help of a shiny silver vibrator, that his own hole is also a source of pleasure. It had been five years since he had last been on the business end of not a toy, but a real cock, and who better to explore his backfield than our baseball player, Tyler. With his shirt already off before we even loaded the cameras, Troy was definitely ready to reacquaint himself with his inner bottom. The look on his face as Tyler reached over and pressed his lips to Troy's was one of nervous excitement; even for the man that has done it all, this was Troy's first ever on screen kiss, but we have a feeling that perhaps it's not his last.Tyler is the first to go down, sucking Troy off while still fully dressed, as if he could not refrain from tasting that beautiful 8?, rock hard cock even long enough to open his own jeans. The clothing is soon history as they stand on the bed, face to face, sliding and rubbing their cocks against each other until Troy lays Tyler down and returns the favor, swallowing Tyler's bone to the root. Moving into prime 69 position, with Tyler tongue fucking Troy's hole as the spit literally drips out of Troy's mouth, he orally vacuums the cock he knows is about to ?re-de-virginize? his hole!As if he cannot wait another second, Troy takes command of his own destiny, hopping on Tyler's meat and giving him, judging by those low, deep moans, the ride of his life. Moving Troy onto all fours, it is Troy's turn to moan as Tyler rams in deep, hitting just the right spot that has been untouched for too long. Commanding him to fuck that ass, Tyler can do nothing but answer the command by pounding harder and faster. But in true porn star style, Troy begins to bounce his ass backwards, letting Tyler know he can keep up. We soon have an explosive and impressive load from Troy while still being fucked by Tyler in missionary style. With the top needing some extra attention, Troy rolls him over to his back, helping him out until he is done. With both of our guys reaching the same conclusion we did, sometimes it is just as good to give as it to receive, but not always!",
  "models": [
    {
      "name": "Tyler Olaf",
      "person_id": 27770
    },
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2005-10-13",
  "scene_id": 53578,
  "tags": [],
  "title": "Tyler & Troy The Movie, Scene #02"
}