{
  "collections": [
    "Men Over 30"
  ],
  "description": "Last week, with a visual reminder that produced bucket-fuls of sperm as the ultimate confirmation, Miguel showed us that boys from Brazil grow into strappingly handsome, incredibly sexy men. Portuguese is fast becoming a favorite language here, and this week, it was time for the advanced course with yet another fine example of Brazilian heat from the teacher, Diego. It has been a year plus since Diego first graced the page of MenOver30.com and like his work out buddy Miguel, he seems to have spent a good portion of it in the gym. Those abs are etched to perfection, his arms massive, his chest expansive and that uncut bonanza of Brazilian beef is more mouth-watering then ever. Perhaps it is the freedom of years spent at Carnivals in Rio, or the overabundance of testosterone that flows through his vascular body like a rushing stream over a waterfall, but whatever the factors are, as we saw the day Diego and Miguel moved their workout from the gym to the bedroom, Brazilian men exude a fearless sexuality that demands gratification by any means necessary. And while today is a party of one for our man Diego, he invited us all along to observe the festivities.As Diego peels off his shirt, it is like opening night at the Muscle Olympics as he bares a torso, with perfect symmetry framing exquisite planes of muscle that have been honed into the epitome of the masculine ideal. As Diego lets his pants slide seductively down one hip, presenting the tender flesh underneath like an appetizer for the gourmet meal that is to follow, he does so with a quiet confidence and an easy grace that you would expect from a man this built. But sexy is as sexy does, and as that leather jock underneath with a zipper dividing a pouch packed with a cock demanding attention come into view, Diego's inner sexual athlete becomes unleashed. And like his cock head that is already spilling over the top, that Genie is could not fit back in the bottle if he wanted it to.Less than three strokes is all that is required before all eight inches are sticking out the side of the strap, and with a quick adjustment, soon looming over top the waistband revealing a commanding cock that is as perfect as the rest of him. The head is slick with pre, and he squeezes that thick veiny shaft. But it is when he turns around and exposes those tan line free, granite orbs of an ass, that a new view emerges that will forever be locked in the fantasy file of every tops' wet dreams. Moving to the ottoman, he concentrates his efforts on fisting his cock while staring directly into the camera with a heavy lidded gaze dripping with desire. But it those perfect planes of his abs that are soon dripping in thick white load.",
  "models": [
    {
      "name": "Diego",
      "person_id": 29656
    }
  ],
  "release_date": "2005-12-08",
  "scene_id": 53591,
  "series": "Diego The Movie",
  "tags": [],
  "title": "Diego The Movie, Scene #01"
}