{
  "collections": [
    "Men Over 30"
  ],
  "description": "Troy got so horny, he took both Steve's and John's considerable cockheads right in his own hole; Steve had hungry holes to fill as far as the eye can see and smolder, sexy John Chase lives up to his name, have the cock he was chasing and oh yes, he left them both catch it as much as they wanted, wherever they wanted! We wanted to put together something special to inaugurate the holiday season and what we would up with is the longest, hottest episode ever with the kind of chemistry and the perfect mix of passion and raw sexuality that fantasies are made of.With little to no time being wasted...the three begin to strip each other down and start with an oral session. With cockage swinging from right to left...no particular roles are defined amongst the three. But we see John Chase is sure of which role he wants as he begins grinding his dick on Steve's ass. As Steve begins to straddle Troy's face, John begins fucking Troy is a most appreciative gesture of thanks for cumming...but not yet! Usually this starts off slow however John just slams his dick right into Troy's ass, sensing the hunger in the hole of begging blonde man and Troy was definitely in the mood to be ma-handled as his cock was leaking a steady stream and his nuts were so red and tight, the pleasure of the build up was almost too much for him, but he wanted-correction, he need to prolong the joy and turned both his holes into the Energizer bunny.Twisting him like a pretzel, Troy is bend himself into positions even the star acrobat of the Cirque de Soleil wouldn't not attempt, depurate to get both Steve's and John's very accommodating cocks. With Troy begging for more, mind you he has inhaled both and have been slapped around by them at this point, Steve slides in behind for a little DP action riding the both of these cocks in great condition that sent Troy to brink of a sexual nirvana he had never reached before and we all got to tag along for the ride. John is the first to pop onto Steve's heaving chest & while fingering Steve's hole, Troy is the second to finally unleash an avalanche of jizz with Steve not too far behind. So often it is our job to guide the action along, making a suggestion here, some direction there but not this time. The natural vibe of the room took over and all we did was not get in the way! From John, Steve, Troy and all of us at MenOver30.com, Happy Thanksgiving!",
  "models": [
    {
      "name": "Steve",
      "person_id": 27753
    },
    {
      "name": "Troy",
      "person_id": 27788
    },
    {
      "name": "John",
      "person_id": 30245
    }
  ],
  "release_date": "2006-03-09",
  "scene_id": 53616,
  "tags": [],
  "title": "Trio1 The Movie, Scene #02"
}