{
  "collections": [
    "Men Over 30"
  ],
  "description": "It might not receive approval from the Major League commissioner, but we invited Cupid to Rookie Season and began spring training a little early this year. I guess this is the one thing gay men can show up early for; a Fuck-Fest in time for Valentine's Day. And while the gloves were on, all bets, and soon their clothes, were off! The Vet, Mr. Troy Halston, the Rookie, Mr. Alexander. I wouldn't check their baseball cards to see who is the pitcher and who is the receiver; this is one exhibition game we know you will watch to until the end.We know from his first appearance that Troy enjoys the receiving end of a good dildo pounding from the Mrs. so he knows a thing or two about the fine point of handling oversized equipment. With eight inches of rock hard cock on the hall of fame body, it was no little league bat he brought to the playground. We thought he would be the perfect coach for giving Alexander his first on camera fucking. Alexander's Latin blood began to boil as he savored every tasty morsel of Troy's flawless physique ? especially those hard eight inches in the middle.  As Alexander's own cock began to grow, we knew it would not be long before Troy was ready to explore a very eager backfield.Coach Troy had Alexander warm up by spreading his ass and having the rookie suck his cock and eat that hole at same time before giving Alexander's aching bone a good licking too, all the way to his balls, before flipping on all fours and turning Alexander's quivering ass in the visitor's locker room for a very horny major leaguer!  Slowly but steadily, Troy expertly slid in inch after inch until soon the echo of those heavy nuts banging against Alexander's cheeks were only drowned out by Alex's moans and pleas to fuck harder. His ankles on Troy's shoulders, Alexander covers his stomach with a massive load when Troy pulls out his cock, which was swollen to almost epic proportions, and soon empties his balls all over Alexander's still leaking dick.  They say there's no crying in baseball, but never anything about begging for more!  Happy Valentine's Day from MenOver30.com",
  "models": [
    {
      "name": "Troy Halston",
      "person_id": 27796
    },
    {
      "name": "Alexander",
      "person_id": 27803
    }
  ],
  "release_date": "2006-06-01",
  "scene_id": 53639,
  "tags": [],
  "title": "Troy & Alexander The Movie, Scene #01"
}