{
  "collections": [
    "Men Over 30"
  ],
  "description": "Like those metro-sexy vampires from an Anne Rice novel, Brad appeared with his milky white, almost translucent skin as the perfect canvas for those piercing blue eyes. Brad is 100% heterosexual and 100% and exhibitionist. Despite having a couple of guys in the room, Brad is packing more then just a decent size pole, even before he was at full mast, the swollen head of his heavy hanging shaft was sticking the bottom hem of his shorts. the size of the bulge in those black briefs as he unzipped made it clear he got over being another male seeing his boner in record time. Being more a ?show-er? in the meat department, we're willing to bet Brad enjoyed the stares he dick must have gotten in the gym and dorm showers a lot more then he was willing to admit.As he shorts came down, his legs went up...and stayed there, revealing an oversized set of nuts you could just tell by looking at them were packed with a load he was overdo to shoot. And for a guy who made such a point about being straight, he clearly had some girls bend him in this position before as his does more then just as causal flyover of that hidden hole and more then once. He even reaches back and spreads those cheeks offering a close up of a set of lips that would have welcomed at the very least a tongue.  Props to a breeder man who has learned his hole is more the just decorative, but a source of pleasure.Those good vibrations worked their charm as, big as his cock looked before, it was down right massive now...not just long, a solid cylinder of fat, throbbing dick meat like a grain solo with w leaking head in a field of trimmed wheat.  His whole body ripples from he sensations coming from his cock. By this point, he was lost into the pleasure zone, working that meat from every angle and lubing the shat with his own pre.  One look at those balls, so heavy hanging before were now coiled like a couple of peach colored walnuts...you could just sense the pressure by looking at them and soon after, the volcano explored all over his stomach.",
  "models": [
    {
      "name": "Brad 2",
      "person_id": 2
    }
  ],
  "release_date": "2006-05-11",
  "scene_id": 53633,
  "series": "Brad The Movie",
  "tags": [],
  "title": "Brad The Movie, Scene #01"
}