{
  "collections": [
    "Men Over 30"
  ],
  "description": "I was at the gym, changing after a workout when this well built Italian looking muscle man struts by in a towel and woofs at me while going into the dry sauna and I had to follow. There was just us two in the sauna and I struck up a conversation about something or other, didn't matter much what, I just wanted an opening.  Well to my delight this hot stud with a rough exterior was very approachable with a voice of an angel on the inside. 'Great body you have, you must work very hard at it' I started. 'Thanks, what do you do for a living' He asks, and that was the opening I was waiting for. 'I'm a photographer'  I replied.  'What kind of photographer?' has shot back. 'Mostly I shoot nude men' hoping that he would want me to shoot him....and of course he did.  'I've always wanting to get pictures of me while I had this physique going for me' he replied.  The rest is history.When he came to my studio for our session this guy was so sweet, even asking my camera man for permission to get undressed, but boy did we find out what a horny little devil he really was.  Informing us that he hasn't cum for some time...who are we to stop him from garnering pleasure from touching his own creamy body thats worth licking all over, rubbing his fuzzy  chest...and admiring at his own tattoos. Scott's thick cut meat was begging him to treat it like his lil dirty whore who needs a whipping lesson. All of his moaning and groaning sounded like there was more than one person in the scene. Notice how his balls with every bounce let you know how long it's been since he has busted a nut as they are filled full of hot milky cum.Then he grapples his balls and begins massaging his hole and stroking his rock hard cock.Licking his thumb, he starts to massage the head of his cock. His cock is now shining...glowing... as he pumps it fiercely. That nut sack is throbbing with goo. It is almost time!Scott grabs his balls to fight off the feeling, but it is too late...as his dick begins to shoot out that hot load, he has no choice but to grabs his dick to finish the job...stroking with ohhh's and ahhh's fully letiing it go onto his thigh...and what a nut it is.....giving us show like nonother we have seen. Just goes to show you that with a little effort and conversation you too can meet an absolute angel and bring home a horny devil.",
  "models": [
    {
      "name": "Scott Vitale",
      "person_id": 27798
    }
  ],
  "release_date": "2006-04-27",
  "scene_id": 53630,
  "series": "Macho Muscle",
  "tags": [],
  "title": "Macho Muscle, Scene #02"
}