{
  "collections": [
    "Men Over 30"
  ],
  "description": "We first met Alex a few years ago when he was a CircleJerkBoy and frankly, the knock on the door be on MenOver30.com surprised us, especially since it was just two days before he turned the big 30 and one more stint in front of our cameras is how he chose to end that decade, All we could say was ?Welcome to Club? especially when we saw that twinkle in his eye...you could see need to get off, you could just sense he must have enjoyed his premier experience at getting in touch with his inner porn star so much he planned his return. When a model is so hard that you can see his bulge visibly throb as he is filling out his paperwork before the shoot even starts, we know its going to be a good show and that is exactly what Alex delivered and then some!A little bit of a Long Island accent could still he heard as he said ?Hi Guys? with that toothpaste commercial white smile and wasted no time in opening his shirt and his jeans and squeezing mound in his crotch, enjoying teasing himself as much as he got off on teasing us. Alex didn't just maintain eye contact, he looked longingly into the camera as if it was an illusive love he wished to render into complete seduction.His is a man confident of his body and unlike most guys, he wanted to let his cock go soft so the complete flaccid to fully erect could be enjoyed by you. Its a beautiful site as that pole goes from zero to sixty under that nest of dark blonde pubes.  Turning around, we get a good view of the ink of his back we only got a glimpse of before.   Age does bring knowledge and confidence and Alex is living proof. Alex didn't just flash his ass, this time he showed it off as he humped the mattress, stuck it out, spread it open and even let a finger brush in the center after he rubbed out his third load of the day.",
  "models": [
    {
      "name": "Alex Edwards",
      "person_id": 27971
    }
  ],
  "release_date": "2006-05-04",
  "scene_id": 53632,
  "series": "Welcome to the Club",
  "tags": [],
  "title": "Welcome to the Club, Scene #02"
}