{
  "collections": [
    "Men Over 30"
  ],
  "description": "You can forget catching this bull by the horns.  With a schlong as oversized as the throbbing tower of manhood that Roger calls a cock, you can grab this baby from across the room, and this is one you will never want to let go.  Roger was not just boned up by the time he unzipped his jeans; he was so rock hard from the sheer excitement of letting his exhibitionist desires boil over into reality that his balls had already tightened like a man who had not shot in 3 months, rather than the three days he mentioned. He also told us when someone first sees his bone, they call it everything from ?big? to ?huge? and after taking one glance from the outline, even through his jeans, we know that's no bull either. Roger's face is classically handsome, like a 1930's movie star, complete with a deep sexy voice, fur covered arms and a patch of hair right in the center of those sexy rounded pecs.  He seemed almost lost in the joy of giving us a guided tour of that magnificent penis, not just long, but bone straight, impossibly thick and crowned with a deep rose colored helmet.  The look on his face was of unmistakable delight with the sensations his own handiwork was producing - like he was riding the crest of a great orgasmic odyssey and he was more than just a little happy to have us as a witness to his journey.Roger's glance stays locked on his cock and indeed, it is difficult to take your eyes off a dick that long, that fat and that perfect. Once his eyes were closed, we only wished we could see what he was picturing in his mind as his ball sack, already swollen from the word go, was now bloated to the breaking point. When he could resist it no longer, the first rocket of jism landed directly below his brow, giving the term bull's eye a meaning you will never forget! Ol? Roger, Ol?!",
  "models": [
    {
      "name": "Roger",
      "person_id": 29671
    }
  ],
  "release_date": "2006-05-18",
  "scene_id": 53635,
  "series": "Roger The Movie",
  "tags": [],
  "title": "Roger The Movie, Scene #01"
}