{
  "collections": [
    "Men Over 30"
  ],
  "description": "Slater was an early favorite on MenOver30. There is just something so seductive about a chest hairy enough to grab handfuls of hair from over a body so lean so you still see a six pack underneath. Then of course there is that handsome face, that always hard and ready to go beauty of a cock and that set of creamy white buns we felt had gone untouched on camera far too long. Enter the partner in crime:  Tony the Tiger. Like Slater, Tony has a very lean, sexy body, a mop of blonde hair, a sexy ass but its that 8 ?? up front, that has never made a close encounter inside the male kind, we had our sights on today. With a piece of meat so impressive even a porn star like Slater wanted to drop the soap for, we wondered if Tony was up to playing Mr. Clean. We didn't have to wonder for long!Tony's a dirty boy who simply could not be kept out of the sand box one more second. He went for Slater like a lion who has been caged for too long and finally has a chance to get loose. He pounced on top Slater but rather a quick flip over and a hurried slam bam, he nuzzled Slater's ear, rubbed a chest much hairier then he is used to and actually went for Slater's zipper with a look that said ?feeding time.? It was Slater who hauled out Tony's dick first and even an experienced cock-smith, that big pole took some maneuvering but soon completed its disappearing act.  When Tony swung his down to take a turn on Slater's hard cock in a sixty-nine; the slapping and spreading of Slater's hole was good indication of where things were headed next.Opening Slater cheeks with both hands, Tony starts with one tentative lick then is soon deep drilling that hole with his tongue in a way that has Slater grinding back on Tony's face for more and he reaches down to survey the big slab of meet that is about to get to know his insides very very well. He muscles his tight glutes down, slowly but steadily until he takes every inch.  Flipping him on his stomach, Tony pounds away until Slater's balls are so bloated and high, they look just like a brain and clearly, this is the brain he was doing his thinking with as soon he and Tony cover each with a well deserved pelting of twin loads.",
  "models": [
    {
      "name": "Slater Reed",
      "person_id": 27762
    },
    {
      "name": "Tony",
      "person_id": 29322
    }
  ],
  "release_date": "2006-06-08",
  "scene_id": 53641,
  "series": "Slater and Tony The Movie",
  "tags": [],
  "title": "Slater and Tony The Movie, Scene #01"
}