{
  "collections": [
    "Men Over 30"
  ],
  "description": "At MenOver30.com, we have presented the debut, and sometimes the only stint, for hot men who wanted to live out their secret desire to be in adult production just once. Today we are more than proud, but privileged to present the reverse: a bona fide porn star in his own right who is adding MenOver30.com to his resume along with some other names like Colt, Mustang & Catalina: Mr. Todd Maxwell. Tall, muscled, beefy, hairy and handsome; much too fit to be called a ?bear,? a bit too mature to be a ?cub,? Todd is more like the uber sexy mountain man that effortlessly oozes testosterone, sexuality and charisma in a way that grabs your balls and renders you helpless to do anything but submit. It does not matter whether you are submitting to him or he to you; this versatile man among men defines what masculinity should really be about, but rarely measures up. Todd measures up in every way possible; his frame, his body, his cock, his sexual appetite and underneath it all is a man smart, witty, caring, open and intelligent. In short, Todd Maxwell has everything - including the desire to share whatever you need from a man whom you will need it all from.Sitting on the bed in his tank top and shorts, muscles bulging, hair swirling out the neckline, you can't help but be aroused by the site of Todd even fully dressed. As if intoxicated by his own scent, smelling and sniffing his armpits, he shows off every muscle before lifting his shirt and exposing those flat abs, the cuts visible right through the fur, with a sexy outtie navel in the center. He teases his own nips until they are rock hard; and from the digging his does deep in his shorts, something else got hard all on its own and by now, it is your cock as well as Todd's.Once the pants come off...there is not one tan-line to be seen...as he shows off his ass, which happens to be one of his greatest assets. Climbing to the top of the headboard, he begins working up his dick, stroking his meat like a man who knows how to pleasure himself as much as commands the power to use that magnificent cock for your total bliss. He moves down to the center of the bed on his knees, stroking his dick, loving the feel, pinching his nipples and totally lost in the waves of sensations you can almost feel just by the expressions on his face. As he lies back down on the bed, his balls bounce looking filled to the brim! Getting to that final moment, Todd clenches his legs, squeezes his butt and strokes in a back handed style, popping his nut all over his thigh!",
  "models": [
    {
      "name": "Todd",
      "person_id": 27816
    }
  ],
  "release_date": "2006-07-20",
  "scene_id": 53653,
  "series": "Look Who I Found",
  "tags": [],
  "title": "Look Who I Found, Scene #01"
}