{
  "collections": [
    "Men Over 30"
  ],
  "description": "Very few models have ever inspired the response that the MenOver30.com of Todd Maxwell did a couple of weeks ago. Then again, there are very few men in the universe like Todd. Hairy as he is muscled, handsome as he is charming, sexy as he is intelligent, Todd is wrapped into a slice of masculinity that is impossible to resist for just about anyone on the planet with a pulse. His big studio films and countless photo layouts must have inspired the shooting of more loads than every cubicle in a sperm bank combined. Todd is back with us today and in a scene taken right out of the bedrooms of many of his fans, 23 year old Eli is rubbing his bulge while looking at a magazine with our Todd in the cover. Suddenly Todd appears, tossing the magazine aside, and kisses Eli softly and tenderly, and what follows is beyond any fantasy Eli had ever imagined.Todd takes the lead, undressing Eli, the younger man clearly relishing the attention the older, hairier man is showering on him before licking Todd's nipples and then following that sexy happy trail down Todd's solid abs, rubbing Todd's crotch and his own bulge as if they were Christmas presents he couldn't wait to open. Todd makes sure the hungry tent in Ely's pants receives some attention as well before opening his own pants, hauling out his hard meat before it is swallowed in one breathe by Ely's hungry mouth. After a few minutes of sucking, Todd grabs Eli's face, brings it to his own and forcefully replaces his tongue where his cock had just been as he lowers Eli to the bed, removes his pants and performs more oral gymnastics on Ely's cock. It's not long before Todd's hand begins to explore Eli's quivering hole, setting the stage for the anal acrobatics that are soon to follow.Be it Gorillas in the Mist or Babes in Toyland, whatever your fantasy may be, the chemistry between Todd and Eli sizzles out of every pore and comes right through the scene. Laying Eli on his back, Todd begins to fuck his mouth. Then the 69 ensues when Todd's head moves further south and begins to lick Eli's ass so deep that his beard tickles his ass cheeks. Todd asks Eli, ?You wanna be fucked, baby?? and before Eli could finish uttering ?Yeah,? Todd slides his dick in while in missionary position. Moving over to the chair for some standing room, Todd pounds him in a standing doggie position before Eli takes a final ride in a final stroke off, their tongues planted down each other throats, and with chemical reactions such as they have, dual eruptions soon follow! We cannot wait to have Todd back and see what happens when the roles are reversed!",
  "models": [],
  "release_date": "2006-08-03",
  "scene_id": 53657,
  "tags": [],
  "title": "Fantasies Do Come True, Scene #01"
}