{
  "collections": [
    "Men Over 30"
  ],
  "description": "Rock is not the first man to make MenOver30.com one of his first stops on a latter day porn career, and with those classic leading man looks, we are thrilled to be able to feature him again. That chiseled face, handsome profile and just a brush of silver at his temples brings a sort of James Bond suaveness to him, only this time he drops the towel just for us - and what a site to see there is! He has a tight, smooth and lean body that men half his age would kill to have and a body so symmetrically muscled to its full potential, his physique approaches that of an amateur body builder, but with the kind of restraint of a man who does this not for a medal, but for his and most definitely our pleasure. That tan body, gleaming in those tight white briefs is definitely prize-worthy, and from the size of the tent in front, it is easily one of the possible sources for which his nickname ?Rock? may have come from.Giving us a classic double bicep pose, he turns around and, lowering his briefs, does more than just flash us an ass that is almost as white as the fabric that just moments before covered it, but flexes those glutes and juts out that ass like a prized specimen for admiration. This is a whole new side to Rock, literally. Last time, he was not much of a performer and never even offered a glimpse of that magnificence we now know to be his backside. We also felt a prayer had been answered seeing he had let his bush grow in. After crawling on is belly across the bed, he grabbed the baby oil and began to shine that pole like the prize it is.Rising to his knees, Rock is rock hard, and what a thick, perfectly straight serving of man meat it is. With a flaring, shiny helmet of a head, the shaft below is so engorged with blood that the veiny skin seems as though it will almost give way from being stretched so far. Rock even bends over, putting that sculpted meat ass on display as he fists that hanging cock before rolling over and covering the flat, tan skin between his navel and dark pubes with a thick, white man-sized load.",
  "models": [
    {
      "name": "Rock",
      "person_id": 27797
    }
  ],
  "release_date": "2006-07-27",
  "scene_id": 53655,
  "tags": [],
  "title": "Mature Muscle, Scene #01"
}