{
  "collections": [
    "Men Over 30"
  ],
  "description": "The muscles, the ink, the fur, the pierced nips, the handsome face, the cock...it's no wonder Adam Faust's star rose so quickly...we are only sorry it took us so long to lure him over here to MenOver.com! As you could see from his debut here a few weeks ago, he was certainly worth waiting for. Best known for his decidedly rougher edge as the best fisting top in the business, Adam shared with us he has been eager to show a more gentle side than his roles thus far had allowed and that is where we came in, or rather, Carlos came in. This hung, smooth, sexy 19 year old Latin cutie had a thing for older hairy guys and offered Adam just the kind of opening he had been looking for!In the ultimate case of opposites attract, these two could hardly be more different from each other: Hairy vs. Smooth, Twink vs. Muscle. Tattooed vs. Unmarked but it all seems to work as Carlos makes the most of the opportunity to be upfront and on the bottom of Adam Faust. Adam takes the lead, leaning over and kissing Carlos and there is a definite tenderness as they undress each other as if they were unwrapping presents. Things quickly heat up as the pants soon follow and Carlos nibbles his way down Adam's hairy trail, and across that tiger tat on his side. Adam gets on his knees and feeds Carlos his now throbbing cock to the base while reaching over and exploring his younger partner's now very hungry hole.Carlos proves to be both a champion cock sucker and ass eater, which sent Adam's pole right into battle position, slowly but steadily feeding Carlos every inch of meat even on the first, slow deliberate press into his ass. Adam is the image of control as he flexes every muscle, steadily pounding Carlos's ass until they are both covered in sweat; and soon, Carlos is covered in a thick healthy white load. Just as quickly, Adam changes gears, becoming a sweet, attentive lover, giving Carlos the deep kissing and gentle caressing he needs to get his nut. Adam Faust is a star in any galaxy and after a show like this, it's easy to see why!",
  "models": [
    {
      "name": "Adam Faust",
      "person_id": 30453
    },
    {
      "name": "Carlos",
      "person_id": 30015
    }
  ],
  "release_date": "2006-08-24",
  "scene_id": 53663,
  "series": "How Do You Want It",
  "tags": [],
  "title": "How Do You Want It, Scene #01"
}