{
  "collections": [
    "Men Over 30"
  ],
  "description": "His tall frame extending to all four corners of the bed, his arm out, as if holding the place for a man he needs beside him, with his cargo shorts and strawberry colored t-shirt, Jorge looks like a Cuban Sean Connery on his day off. There is a slight mysterious quality to his eyes, sexiness to those scattered flecks of grey in his goatee and a soft smattering of hair across that tanned chest and stomach that draws your eye towards the prize waiting just below. The folds of the fabric radiate from his crotch like sun flares and it must be morning since something is rising inside his shorts that look to be big and heavy. While guessing how big the piece is inside is half the fun, we can give you a hint; in the case, our secret agent's name should be ?009.?He swirls around that big piece inside at first, as if he is smuggling a helicopter in his pants. But opening the fly and revealing a trimmed brown bush over a thick, meaty slab of flesh that still soft, almost reaches his navel before coming to rest well down a good portion of the inside of his thigh. He rubs his cock softly, purposefully concentrating on enjoying every sensation rather than in any hurry. Rising to his knees, his cock is almost hard and well on its way to the full nine inches, the head extending beyond the edge of his hip. He just lets it hang there, keeping his away and allows us to enjoying the heavy pole totally unobstructed, swaying in the breeze like a mighty tree branch.Standing over the camera, we look up to see him wrap both fists around that cock, with a good handful plus still sticking out the top. Rock hard and throbbing, the head now playing peek-a-boo with the folds of skin, as he raises his dick up, we finally get a glimpse of those balls, oversized as you would expect, but starting to tighten in anticipation of the explosion soon to follow. Rubbing down his stomach to that meat, and rising to his feet once again, he stands as if he is ready to mount his imaginary lover, then flexing his abs and pounding his cock furiously, four solid jets of cum rain down from that cock as his body spasms behind in unbridled delight.",
  "models": [
    {
      "name": "Jorge",
      "person_id": 30319
    }
  ],
  "release_date": "2006-08-10",
  "scene_id": 53660,
  "tags": [],
  "title": "Tanned Delight, Scene #02"
}