{
  "collections": [
    "Men Over 30"
  ],
  "description": "He has an auburn beard, carefully trimmed to show off the square jaw underneath and handsome face above his fur covered body. A body that presents sexiness, addition to a superb example of prime muscular symmetry, some of the fiercest ink we have ever seen. That is just the start of the charms of what Adam Faust brings to MenOver30.com! In the time of his career that included four major studio productions, Adam went from a new face to the number one ?fisting top? in the business. Adam is a man of many faces, desires, and talents; what he offers to us is a decidedly gentler side than he has shown in his movies so far. All the charisma, masculinity and sex appeal has men across the globe more than happy to receive whatever he wants to give.The swirls of hair curling out of the top of his army green tank soon come into full view as he strips it off and takes center stage - the clear vivid ink of a jumping tiger that we can only see half way at this point with his shorts still hiding the best part of both the man and tattoo. He unbuttons to get a little more comfortable before showing us his wide flared back with another incredible sprawling tattoo, this one going from shoulder blade to shoulder blade. Like the one on his side, one is also large, crisp, imposing and totally devoid of color, just the solid outline which keeps it from being distracting or overpowering. Just like Adam Faust himself; he is clearly a man of distinction.Muscular enough to be clearly defined even underneath all of that hair, rubbing that packed bulge in the center of his white briefs is something to behold. We were more than ready for him to get naked and see that beautiful cock come to life. Only the most confident of tops will put their ass on display, bends over, and lets the camera explore ever inch of those glorious glutes. With a body that even just lying there is a feast for the eyes, Adam stands, sits, spreads and stretches, allowing us to appreciate every well worked inch. Especially those inches in the center as he kneels on the bed and squeezes out a thick white load as the moans of delight escape from his whiskered lips. Hot as he is alone, we have a feeling it will be magic when he has a partner dying to sample all of Adam's charms: stay tuned for that visual in just a few weeks!",
  "models": [
    {
      "name": "Adam Faust",
      "person_id": 30453
    }
  ],
  "release_date": "2006-08-17",
  "scene_id": 53661,
  "series": "Big Things/Small Package",
  "tags": [],
  "title": "Big Things/Small Package, Scene #01"
}