{
  "collections": [
    "Men Over 30"
  ],
  "description": "?My girl is out of town...? are the first words we hear from our sexy P.R. Papi de jour! P.R. stands for Puerto Rican and the ?power? comes from that steel pole in this Papi's pants. While it may not generate electricity, anything this long and hard and fat is going to make you feel the heat!  Those dark brooding eyes give off an intensity set off by his tan skin with a demeanor that is a little scary. You are afraid to be caught starring at that bulge and unable to take your eyes away from it, especially since he's massaging the big boner right through his shorts during the whole interview until it looks like there is a flashlight in there. But when he yanked open the fly and hauled out that thick, lead pipe fat, throbbing uncut nine inch pole from his boxers, he showed he was clearly a man packing an epic pole with the skills to use it as he sees fit.He tells us he doesn't have to jack off much as he has plenty of lady friends begging for booty calls and who can blame them?  Just the way he strokes his cock, you can see in his mind he's feeding to a hot hungry mouth and you're only jealous that it isn't yours. As he swings that meat back and forth, the ?thwap, thwap? of all that heavy flesh as it hits his thighs makes you hungry for more. He grips that shaft until the skin peels back to reveal a perfect helmet, appropriately oversized for the pole it takes command over. With his buzz cut and homemade tats, PR Power gives off this vibe like he just got out of lock up, especially with him getting off to the pussy magazine off to the side of him.He was happy to demonstrate his fucking technique, completely oblivious to the spectacular view it gave us of his white, round ass with just a smattering of dark fur in the center. His cock is thick and veiny and uncut. When he skins it back, we can see he has streamlined head, like an olive, that looks like it was designed to slice open any hole he chooses and not leave it until he is good and ready. The more he strokes, the bigger it gets until P.R.'s mighty tower measures in at 9 inches and looks like he could use it to scratch his nipples while he still sitting down. He grabs the magazine again, gets on his knees, and grunts like the wild man he is, spraying a thick load down over his pretend girlfriend of the moment. Hope she knows how lucky she is.",
  "models": [
    {
      "name": "P.R. Power",
      "person_id": 27825
    }
  ],
  "release_date": "2006-08-31",
  "scene_id": 53666,
  "tags": [],
  "title": "Rican Havoc, Scene #02"
}