{
  "collections": [
    "Men Over 30"
  ],
  "description": "We first meet Beau fresh from work in shirt and tie and quickly learned just how wrong it is to judge a book by its cover. Sure, that strong jaw line framing his handsome face and what had to be a very fit and worked out body under his baggy business attire was evident even at a mile away. But once those clothes came off, he proved to be not just fit, but ripped to perfection. Perhaps the biggest surprise of all was that under page from the ?Dress for Success? handbook, Beau's incredible upper body is covered by a gallery of the most incredible ink we have ever seen. Running from one wrist to another, down to his waistband, and across his shoulder blades as well is a story this Chi-town charmer wanted to tell and used his body to do it. We have had our share of ink covered dads before; and often, the tats almost seem like they are wearing the person underneath. Beau is just the opposite; the ink is a visible expression of who he is. From the way that wife beater was gripping his frame, to the bulge that was growing by the second in his pants, we could not wait to see more.Sprawled back on the bed, the white of his shirt contrasts those pumped arms with ink just a few shades darker than his skin, so that it almost appears like a big spider web clinging to every inch of that body. The heavy silver belt buckle is cast aside with a big thud, his big paw adjusts the growing content in his pants. First rising to his knees to play with his nipples, he begins to move seductively, showing off that football player's body with the grace of a dancer and the seductive self confidence you would expect from a man who does not look at art on the walls, but uses his own body as a canvas.Once he is completely undressed, he lays on the bed to spread his legs as if crossing them across continents, rubbing his body up and down, showing off another amazing sight, that ass! Talk about a bubble butt, with football playing thighs that you want to lick up and down not wasting one bit of saliva. His body is a true sight to be admired. Moving over to another chair, dick still hard, he makes it dance for you, bouncing with every pump and begging for both your tongue, and release, at the same time. As the camera pans up and down, Beau wets those succulent lips, and with every muscle gleaming under a layer of sweat, maintaining total composure, he slowly oozes a steady avalanche of extremely thick white cum that oozes down the length of that still throbbing shaft, down his thighs, and forms a puddle right under his ass cheeks as a fitting addition to a body very well decorated indeed.",
  "models": [
    {
      "name": "Beau",
      "person_id": 27830
    }
  ],
  "release_date": "2006-09-07",
  "scene_id": 53667,
  "tags": [],
  "title": "Private Dancer, Scene #01"
}