{
  "collections": [
    "Men Over 30"
  ],
  "description": "First time around, Bryce was your clean cut weekend jock and a fan favorite right from the start that as too often happens when a country guy comes to the city, he seemed to disappear all together. We were thrilled when he called up out of the blue, saying not only was he back in town, but he wanted to get back in front of the cameras as well. This time it seems like he has been living the hard knock life that sometimes happens when you are a man over 30 but from the moment he walked back through the door, even in his baggy red shorts, nothing has tarnished the glow of that apple shaped butt and the heavy bulge on the flip side.There is a definite maturity to his face we did not see before, but that chest is just as baby smooth as ever. Bryce works the package inside his shorts, wanting to make sure he was awake above and below the waist. Once he is completely nude, his smooth body rolls over to his stomach, grinding his dick to the mattress, beginning to finger and massage his tight hole from behind! It seems that someone has gotten in touch with his nether regions since his last visit or at the very least, learned that a man's hole is not decorative after all, but functional and in the case, an ignition to an erection that is now rock hard and visibly throbbing as he rolls over onto his back.His balls look like two plums trying to race up a rope. As he stands, his cock is so hard it sticks almost straight up in the air with no help required. He bounces it back and forth as if slapping you with it across your face, then plays cat's cradles with the strands of precum oozing out of the head. Oh yes, now this is the Bryce we all wanted to see again; bloated balls, bloated cock and a huge load he was enjoying holding back as long as he could muster the self control. Bryce works his way over to the floor for his bust a nut position and staring longingly into the camera, as if he is beckoning for your help to get him over the edge. He becomes a geyser, letting it land all over his torso in the best possible way to say ?it's good to be back!?",
  "models": [
    {
      "name": "Bryce",
      "person_id": 27776
    }
  ],
  "release_date": "2006-09-14",
  "scene_id": 53670,
  "tags": [],
  "title": "Full Moon Over Miami, Scene #02"
}