{
  "collections": [
    "Men Over 30"
  ],
  "description": "Dominican muscles with long, coal-black Samson hair, Anthony is dripping in that laid back Latin machismo that oozes with the quiet confidence of a man who is packing plenty of heat south of the border.  Slipping off his red wifebeater, a gold medallion finding a perfect nest in a small briar patch of hair between his wide pecs and over his flat stomach, he flexes his arms for us, showing pumped, rounded biceps built from hard labor, not just pumping iron.  Opening his jeans and flashing a dazzling white smile, the round lump in the center of his shorts was definitely flexed as well, and ready for some hard pumping of its own.The more naked he became, the more at ease he seemed.  Anthony is a man who was more than ready to put on a show, and having the camera aimed right at his crotch was a powerful turn-on for him.  He shimmies down the waistband, giving us the first glimpse of a cock that lived up to its promise and more. . .a heavy, thick salami of a cock that was a good 6 inches long and still not hard.  His balls are tight and smooth and visibly full.  A few tugs and that 7 ?? was standing at full mast and begging for more attention, and from the way he swung it back and forth while standing over the camera, our attention he definitely had.He moved to the bed, lay down on his stomach, and it was difficult to know where to look first.  Between the those rock glutes and his throbbing cock pushed back between his legs, he was like a man buffet and we definitely wanted an all you can eat gift certificate.  Rolling over, he pulled out the rubber bands, his hair hanging down to his shoulders and his cock so rock-hard, it curved from being that engorged.  Sitting on the headboard, he releases a load with a moan so intense it is almost primal as he covers the bed spread and the pussy mag on the mattress with a special blend of Pina Colada mix that will make you want to get lost in the rain!",
  "models": [
    {
      "name": "Antonio Lopez",
      "person_id": 27826
    }
  ],
  "release_date": "2006-10-12",
  "scene_id": 53678,
  "series": "Macho Caliente",
  "tags": [],
  "title": "Macho Caliente, Scene #02"
}