{
  "collections": [
    "Men Over 30"
  ],
  "description": "Cross Ancient Egypt and Historic Havana and you have Clyve, a devilishly handsome caballero who reminded us of Arnold Vosloo's title character in ?The Mummy,? but happily for all of us, when our Arabian Knight was unwrapped, he did not shrivel up then get angry, he got harder and sexy and very eager to please. Clyve's shaved head keeps the focus on those ultra-hypnotizing eyes that draw you in and keep you there. They take in a strong, square jawed masculine face that dazzles with a brilliant white smile that shows just a touch of a bad boy who has waited a long time to put his goods on display and is more than ready to make the most of this opportunity. With his twitching leg as the only hint of a first timer's jitters, he strips off his shirt and quickly his jeans shortly thereafter, revealing a lean body with only a layer of buzzed hair between our lens and an inner freak about to be set free.The bulge of his tight black boxer briefs are stretched to their breaking point as he rubs his body like the chassis of a fine racing machine. He flashes us again those pearly whites, clearly happy to be on display and now firmly in control of what he is going to show...and when. The camera drinks in the profile of that packed pouch before Clyve gets on his knees, reaches deep inside to a private rearranging before the final unveiling, and settles back, kicking off those shorts. He spreads wide so we can see his coiled uncut meat under a dark line of hair and a pair of massive balls that keeps those thighs spread apart. Standing up, his cock, while still soft, is already party sized but it is those bloated balls that hang down from the black ring like a pair of punching bags. They transfix your eyes until he lays back and you follow his cock getting bigger and bigger with every stroke while that iconic face looks down from above. It is a challenge which head to look at when they are both in view so we moved the camera down so you would not have to decide. We followed him over to the chair as he works a nipple with one hand and his now throbbing meat with the other, his ball sack now looking like the eggs are about to break though the smooth, stretched skin. Standing up, his cock juts out over his nuts in a perfect profile of what a hard man on the verge of release should look like. As Clyve swings it back and forth, that meat like a mighty branch swaying in the breeze, he is so hard at this point, it almost seems like he will come right through the screen and let you suck it. But he moves to the bed and with a firm grip, blasts off a load onto that thick bush in the ultimate unwrapping.",
  "models": [],
  "release_date": "2006-10-19",
  "scene_id": 53679,
  "tags": [],
  "title": "Arabian Knight, Scene #01"
}