{
  "collections": [
    "Men Over 30"
  ],
  "description": "Handsome exec on the outside, an inked bad boy underneath with a body worthy of both the cover of a fitness monthly as well as the centerfold of a porn mag. The uniquely sexy, mysterious but open, dangerous but friendly mix that is Beau produced an avalanche of emails wanting to see more of him. One of those emails came from a model we worked with named Skyler from our brother site, ExtraBigDicks.com. We sent Skyler's picture over to Beau and with Skyler's handsome face, penetrating eyes, slim tight body and fat 8? cock, we were not surprised when Beau said ?Bring it on,? and the result is one the most sensual encounters featured on MenOver30.com to date!Slow kisses begin this interlude with big strong Beau moving Skyler around like a blow-up love doll, putting him exactly where he wanted him. Skyler licks and kisses all over Beau's incredible inked canvas of golden brown skin. Pinching one nipple while sucking on the other, Skyler loves his job! Beau is enjoying every touch by the gyrations of his lower body and rolls over and stands up on the bed giving Skyler better access to the rear entry. But Beau doesn't make it that easy as he teases Skyler with his ass, finally shoving it back onto Skyler's ample tongue.The tat on Beau's ass says ?Your Name? which I'm sure Skyler is spelling his over and over in that dark chewy center of that tootsie roll pop! Beau lays Skyler on his back and climbs over his face, shoving his dick into his warm, wet mouth. With them getting more comfortable on the floor, Skyler goes back to eating Beau's ass with pleasure; flipping him around to inhale his cock once again. Beau enjoys beating his dick on Skyler's face. Beau finishes the job by stroking himself off to completion, then helping Skyler out with some dirty talk and nipple play until critical mass is reached.",
  "models": [
    {
      "name": "Beau",
      "person_id": 27830
    },
    {
      "name": "Skyler",
      "person_id": 27857
    }
  ],
  "release_date": "2006-10-05",
  "scene_id": 53676,
  "tags": [],
  "title": "TBD, Scene #02"
}