{
  "collections": [
    "Men Over 30"
  ],
  "description": "Chad was in the opening lineup of MenOver30.com and one look at those dimples flanking the matinee idol cleft in his chin, complete with just a left out touch of Southern Twang, he has remained a favorite ever since. When he was paired with sexy Steve, seeing Chad's flawless body and always hard seven inch piece of meat disappearing in and out Steve's holes, he obtained his own cult following. It took more than a year but we are grateful he has returned! Making 40 look ever so good, Chad is back and this time alone. Aging perfectly, if not flawlessly, like a fine rare vintage from a very superior crop of grapes, Chad's kissed by the sun skin lean body, meaty legs and that horny as ever cock make this man the personification of perfection right down to his toes.When Chad rolled over and gently humped the mattress, the word perfection was instantly redefined. As good as he looks from the front, and you already know by this point, he looks DAMN good, from the back, the graceful curve of that sleek, muscled back melds into a cocoa brown vista of an ass that defies the written word to capture all of the splendor and glory this is his backside. It took every ounce of professionalism to keep both hands on the camera but as we moved to catch the longing looks from those sexy eyes, we are glad we managed to pull ourselves together to keep the camera rolling.With the detachment of a man brimming with confidence, yet totally devoid of conceit, he enjoys inviting us along on the journey as he slowly strokes his cock then in the bat of an eye, he goes from zero to sixty and damn, that fat cat is up, throbbing, glistening and ready for some serious pounding. On the bed, on the floor, then bent over, his cock, ass, balls and hole all showing and daring your eyes to take it all in, he settles back and pumps out a special load he had been saving for three days just for us. Wonder what would happen if he held back for a week? We can not wait to find out!",
  "models": [
    {
      "name": "Chad",
      "person_id": 29924
    }
  ],
  "release_date": "2006-09-28",
  "scene_id": 53673,
  "series": "Vanilla Latte",
  "tags": [],
  "title": "Vanilla Latte"
}