{
  "collections": [
    "Men Over 30"
  ],
  "description": "Between that leading man face and tropical shirt, seems our Patrick Swayze look-alike traded in dirty dancing for the hula. In this incarnation, the starring role is played by Ed, our latest featured male in MenOver30.com. As soon as you see that beautiful eight-inch slab of meat on a guy this handsome and with a body so perfect, you would have to be either dead, or a lesbian, not to want to get up close and personal with Ed's Wood. But we are getting ahead of ourselves here. Undressing the package is always half the fun and from the solid form of those forearms extending from his sleeves we knew instantly we were looking at a man who is no stranger to the gym. But as his shirt came off and he revealed a wife beater stretched by doorway-wide shoulders and flaring, pumped pecs, we did not even need to look down at those baseball-sized biceps to know that Ed is the proverbial ?brick shithouse? live and in person. Could it possibly get any better then this for a man who has yet to even unbuckle his belt? Oh yes, my friends, the ?best is yet to cum? has seldom been quite so prophetic.He pulls that shirt back over his head, revealing a midsection that could double as either a washboard for your dirtiest towels, or a three-dimensional anatomy chart of what perfectly developed abs can look like. Smooth as glass, with only the tattoos of a scorpion and a hammerhead shark adorning a flawless surface, Ed rubs his chest, opens his jeans and reveals a pair of boxer briefs so stretched already that the sharp ride of his flaring cockhead can be seen from across the room. Teasing from the top of his briefs a flash of dark pubes, from the side you can see how heavy hanging the prize inside is, and from the bottom the outline of his heavy hanging balls. And with a final tug, the perfect cock comes into view providing a vision you will never want to leave your mind.Trying to take in all of the scenery so far, we almost forget we have yet to see the flip side of this Hawaiian hunk, until he does an about face and shows off a rear view as perfect as the front. He bends over far enough that his mighty meat comes into view once again, before laying back and inviting the camera in for a closer look. With one hand behind his head, his arms totally flexed, we now see that his carved chest is dotted in the center with a spray of light brown hair that almost invisibly trails from his pits, across the pecs and down his abs in a line that puts the ?happy? back into ?happy trails.? The strong and silent type, there is a deep concentration and almost primal, guttural moan as his toes curl, his legs twitch and soon the jizz drips down his abs onto the couch below like the eruption of white-hot Mauna Loa volcano. Aloha!",
  "models": [
    {
      "name": "Ed",
      "person_id": 27828
    }
  ],
  "release_date": "2006-10-26",
  "scene_id": 53682,
  "tags": [],
  "title": "Daddy Long Legs, Scene #02"
}