{
  "collections": [
    "Men Over 30"
  ],
  "description": "We thought Clyve resembled the actor from the movie ?The Mummy,? and when you saw the triple threat of that handsome face, lean body and thick hard cock, you all agreed and could not wait for ?The Mummy Returns,? so we were happy to oblige. Even better, this time Clyve brought a friend, none other then MenOver30.com's Slater Reed. In a sexually charged visual reminding us that sometimes opposites produce the most intense attraction, blonde, hairy Slater could not wait to unwrap the smooth, bald Clyve to find out if that thick hard cock is as penetrating as those deep brown eyes.While he squeezes Clyve's solid, smooth chest, Slater wastes no time in sucking Clyve's tongue into his mouth. Clyve gets Slater down to his briefs just as quickly just to get a better view of the target for his growing bulge. Standing up, Slater drops almost thankfully to his knees and eyes his prize: that tube steak of Clyve's that looks like it will burst open the fabric of his pants. Licking up Clyve's thighs and tasting the crotch of those packed white boxer briefs, Clyve snakes his fingers down the back of Slater's jockeys to tease that hole you can just tell in quivering inside. Pulling Slater up, Clyve licks down his neck and zeros in for a passionate lip lock. The passion is undeniable and it seems like they have forgotten we are there at all, but simply voyeurs invited back to follow a pick up that went very well and spilled into one of those match ups of sexual chemistry that seems to infer a history, yet filled with first time expectations all at the same time.Going at each other's cocks in a super charged sixty-nine on a mission, Clyve sucks Slater's meat and spread his legs, exploring that hole before rolling Slater over so they are on top of one another. He feeds his cock to Slater while tasting Slater's hole until Slater is writhing on top of Clyve's stomach with a need to be filled that seems almost primal in its ferocity. Slater's cock is rock hard as he squats down on Clyve's meat and rides deep, fast and purposeful. The bed is rocking, both men are moaning and Clyve's cock is now swollen to what seems to be a good inch plus larger then we have ever seen it before. He covers himself with a heavy load and that cock never goes soft, even as Slater swoops in for a good bye kiss.",
  "models": [
    {
      "name": "Slater Reed",
      "person_id": 27762
    },
    {
      "name": "Clyve",
      "person_id": 27827
    }
  ],
  "release_date": "2006-11-02",
  "scene_id": 53683,
  "series": "Mummy and Daddy",
  "tags": [],
  "title": "Mummy and Daddy, Scene #01"
}