{
  "collections": [
    "Men Over 30"
  ],
  "description": "Dressed ready for war games at Camp Freak, A.J. is a 33-year-old Army Guy who does not need to be asked to start talking. In fact, the only thing dirtier than his mind is his mouth. A.J. is the kind of guy who only needs a stiff breeze to produce a stiff dick and that is quite evident from the reconnaissance he performed with the bulge in his uniform pants from the second the camera started to roll. From the dream-like look in his eyes to the moans from those soft pouty lips and the way his chest undulates under his shirt, it seems his entire being is wired to the slab of flesh between his legs. This is one soldier on a mission and nothing is going to get in his way.He tears off his shirt and his hands disappear into the deep terrain of his white boxers. Kicking off his boots as his pants fall to the ground, A.J. turns his back to reveal a milky white set of buns. He spreads those cheeks wide, showing off a target with a precision that lets us know this is not his first time in battle. All that action in the back has sent a war cry to the flipside; and soon, A.J. is working his pole. Laying down for some hand-to-hand combat, we survey the ink on his shoulder, that sweaty, clipped chest and those low hanging balls under his trimmed bush. With a deep moan escaping from his lips, he spreads his legs wide and his cock throbs as his fingers come from behind and explore the inside of his hole in a clear sign things are about to escalate into a new phase of battle.Rising to the occasion, literally and figuratively, A.J. decides to call in reinforcements in the form of a shiny white vibrator. One steady push is all it takes until the vibrator disappears from view. It makes a return visit as A.J. first fucks himself, then clenches his cheeks, holds it inside where he wants it, and then returns to the couch with that souvenir solidly held in place. Saving the heavy artillery for just this critical moment, A.J. flicks the switch to on and the steady whir of the vibrator is only drowned out by the moans of pleasure escaping his lips. Lost in his own joy, A.J.'s cock soon responds, polluting his chest with round after round of sperm as he waves the white flag in his own special way.",
  "models": [
    {
      "name": "AJ",
      "person_id": 30048
    }
  ],
  "release_date": "2006-11-23",
  "scene_id": 53688,
  "series": "Army Brat",
  "tags": [],
  "title": "Army Brat, Scene #02"
}