{
  "collections": [
    "Men Over 30"
  ],
  "description": "Packing this muscle on a 5'8? frame, Teddy proves to be very aptly named, as those bulging arms, thick legs and smooth ebony skin wrap him in the delicious package of a chocolate teddy bear--- with luscious tootsie roll lips to boot! A quick flash of a brilliant white smile catches your eye. As he shucks his belt and lifts his shirt, our brown bear quickly shows that he is of the hairless variety, as well as built solid with no excess almost anywhere. But my Teddy, what big hands you have, and the bulge below looms even larger. We stand corrected, there is one thing he does appear to have excess of, and IT is stretching the limits of those grey briefs to their breaking point.Standing up, the big dark head of his cock doesn't as much slip out of the hem of his shorts as fall out under its own weight. Tossing the rest of his clothes, Teddy sprawls back and invites the camera in close enough to see the ebony tats not immediately visible on his dark skin, as well as an enviably lean, defined stomach that ripples below. Rolling over, he exposes the twin globes of his tight round ass as he pulls his cock around to jack it with one hand, while the fingers of the other do more than just casually brush along the hidden crevice between those cheeks. With all that blood in his crotch, it seems amazing there is any left to go around. Yet when he rolls over, his arms are massive, and that powerful chest has swelled to two masses of pectoral mountains with a valley in the middle leading right down to heaven. He keeps one hand firmly on the root of his shaft, as if by the sheer strength of his stroking he might pull it right off. With an intensity that leaves him covered in sweat, he does not so much moan as actually growl like a bear in mating season as he covers his hand in a thick white load--- proving that the fudge-cicle in his picnic basket is of the cream-filled variety. Bon Appetit!",
  "models": [
    {
      "name": "Teddy",
      "person_id": 27842
    }
  ],
  "release_date": "2006-11-09",
  "scene_id": 53685,
  "tags": [],
  "title": "Coco Dreams, Scene #01"
}