{
  "collections": [
    "Men Over 30"
  ],
  "description": "At 6'1? and with 175 tanned-pounds of strapping California prime beef, Reid is a man who says he responded to our ad on a whim, but as soon as his office tie and jacket came off, it was clear he was about to do something he had been fantasizing about for all of his 30 years, and he could not hold it back one more day. That natural exhibitionist quality is something so rare and alluring, it makes for the perfect mixture of a fresh face with a prime libido. This is a quality that some of our favorite men on MenOver30.com possess, and Reid immediately joins that special list. He casts aside his jitters along with his shirt and instantly went from newbie to porn star with all of the confidence in the world that he had something we wanted to see. From the size of the lump in his pants and the pleasure on his very handsome face, he was rubbing it, and we were as eager to see what was inside as he was to show it to us.With one hand inside his pants and the other rubbing that meat through them, Reid is as comfortable as if he was doing this at home alone on his couch in front of his favorite porn and relishing the opportunity of being the star this time for us to watch. The belt opens, the zipper goes down, his bush comes into view, and soon a thick, half-hard shaft starts to swell along with his balls. No underwear for this guy; knowing that Reid free-balls all day at the office under his suit just adds to the allure of this very good-looking and disarmingly sexy man before us. His pants around his thighs, his shirt hanging off one shoulder, he lays back on the couch looking like any doctor, lawyer or executive...anyone in a suit you ever wanted to get behind closed doors in their office...he embodies every fantasy you've ever had about a professional man. With but two or three strokes, his cock becomes rock hard and throbbing, signaling that it is time do some serious business.Already breathing heavy, Reid is now moaning, eyes closed tightly as his mind enters a private realm of sexual pleasure as he sits up and spits down on his cock and starts stroking even faster. Rolling back onto the couch, he humps away at the red leather, showing off his ass and then raising up to show off the perfect trifecta of visual delight: his hole, balls and face all in a shot that will be freeze-framed and captured in your mind forever. One thing that cannot wait for forever is that load, and with the sound of his moans and speed of his stroking, we can just feel how urgent Reid's need-to-seed is. The torment of the battle between prolonging the sensation and giving into the pressure in his balls can be felt just by looking at his quivering lips, and immediately the travel plans for that load are realized as Reid seals the deal with a handshake to his libido.",
  "models": [
    {
      "name": "Reid",
      "person_id": 27841
    }
  ],
  "release_date": "2006-12-07",
  "scene_id": 53692,
  "series": "The Secret To My Boner",
  "tags": [],
  "title": "The Secret To My Boner, Scene #02"
}