{
  "collections": [
    "Men Over 30"
  ],
  "description": "As with the case of oh-so-sexy Reid whom we debuted last week here on MenOver30.com, Matias is another man who waited until he was in his thirties, then could not stifle his desire one more day to be on camera. Those are just the kind of guys who make some of our favorite models. Matias also brought his wife to the shoot. She stood in the studio with us, stripped naked, and put on a show, playing with herself off camera while Matias played with himself for our camera. Not a fluffer in the traditional sense of the word, and far more exciting than just watching a porn DVD for inspiration, Matias and his wife were mirroring each as they masturbated. Was it strange filming a husband stroking, watching his wife masturbate live just behind us? Hell yes it was. But there was also something uniquely hot about sharing this fantasy and piercing the veil of the privacy of the bedroom, everyone not only knowing this was all for you, but turned on by the idea.Matias has classic Latin good looks with flawless olive skin, dark hair, and deep eyes. He tears off his shirt over his very broad shoulders, shows his naturally smooth chest, and immediately gets down to the business of working that bulge in his jeans with a purposefully tight grip. He is not just rubbing his crotch, he is yanking on his meat right through his jeans, biting his lip, well on the way to a pleasure zone most guys only reach when they are ready to shoot. Doing what can only be described as a sexual samba as he kneels on the bed, he then lays down and slowly shimmies out of his jeans as he humps away on the mattress down below, putting a mataistiful set of alpine white ass cheeks on display. As he flips over, his cock is rock hard and ready for the second act. Furiously stroking away, he stands up, grabs the headboard and proceeds to bend over and start stroking again before moving to the floor and spreading his thighs wide in what we thought sure looked like an initiation... and that thinking proved to be more than correct.'Matias, party of one, your hole is waiting,' was the theme of act three and his finger snaked in from between his legs and quickly disappeared right up his ass. If you begin to wonder what he is staring at off camera, remember his wife is in the room, fingering herself as he fingers himself in a relationship that Dr. Freud would have as much a field day with as our horny hubby was having with his own hole. One finger eventually becomes two as he explores the center of his ass cheeks while on all fours. Then, returning to his back, the power of the anal stimulation has his sperm coming in for a landing all over his hand. Guess it's true what they say about holiday time...it sure can bring out unexpected surprises!",
  "models": [
    {
      "name": "Matias",
      "person_id": 29993
    }
  ],
  "release_date": "2006-12-14",
  "scene_id": 53693,
  "series": "Papi Dulce",
  "tags": [],
  "title": "Papi Dulce"
}