{
  "collections": [
    "Men Over 30"
  ],
  "description": "Clyve, our own Arnold Vosloo look-alike with those penetrating eyes, strong face, shiny pate, hot body and always hard cock is a powerful, sexually-charged elixir that has captivated the imagination, and more than one dirty fantasy, from his first appearance with us. Similarly, Alexander, our Eric Estrada look-alike, made his very first video for us and went on to discover that the only thing he liked better than being alone on camera was being on camera with a partner. Alexander was with our resident stud Troy Halston and returned to reprise the position with John in two very memorable encounters. Clyve also could not wait to return with a partner and he did so with porn star Slater Reed to show the newbie the ropes. After the shoot he let us know he was ready to do it again, and in fact, had a partner all picked out: Alexander.  We set it up and wondered what would happen when ?the Mummy? met ?Ponch?, and as you will see, fireworks exploded instantly...along with two huge loads!Though we do our best to put together guys who will be as compatible as possible, chemistry is something that is there or it's not; it cannot be arbitrarily cast or scripted no matter how hard anyone tries.  But the electric attraction between these two was evident from the moment Alexander could not wait to plant a kiss on Clyve and the way Clyve responded by almost inhaling the tongue right out of Alexander's mouth. They were both rock-hard from the initial contact of each other's flesh and literally tore one another's clothing off. Within the first ninety seconds, Alexander is feasting on Clyve's cock, and as for Alexander's own meat, be sure to check out that it is not just hard, but already throbbing, even before he takes that first lick.Though we have barely started, Clyve was ready for more and starts reaching for lube. He tears open a condom wrapper with his teeth as Alexander continues his oral magic. Moving Alexander onto his back, Clyve gets a taste of the hole he is getting ready to invade, then kisses Alexander deeply as his fingers start to mark the trail that his cock is soon to follow.Following some more oral exploration, heightening the anticipation of Alexander even further, they move to the bed where Clyve mounts his target to a chorus of hungry, grateful moans from Alexander who is finally getting the riding he craved from the minute he first laid eyes on his partner.  A few loud slaps and the doggie mount moves to Clyve on his back and Alexander getting on top and riding the pole with force and need. Moving into a sixty-nine position, the guys jack to a frenzy. As Clyve stares at Alexander's cock like he wants to bite it off and have it with him forever, Alexander gives him a mega facial, splattering a thick white load all over Clyve's face. Clyve then flexes, moans and covers his stomach with a load of his own.",
  "models": [
    {
      "name": "Alexander",
      "person_id": 27803
    },
    {
      "name": "Clyve",
      "person_id": 27827
    }
  ],
  "release_date": "2006-12-21",
  "scene_id": 53696,
  "series": "Moans In Wonderland",
  "tags": [],
  "title": "Moans In Wonderland, Scene #02"
}