{
  "collections": [
    "Men Over 30"
  ],
  "description": "Lee is the kind of guy you had a secret crush on in college: lean-bodied, effortlessly handsome and exuding the quiet, but omnipresent sexuality he was seemingly unaware of but you could not deny. Having recently added just enough rings to the tree, without seemingly an inch to his waist, to be a candidate for MenOver30.com, Lee is no longer that frat boy that makes you swoon; he is just the kind of sexy, handsome, confident man you lust after. Looking right into the camera, Lee does more than seemingly transport himself right through the lens and into the room with you. With his flesh so tempting and so life-like, it appears as though he has shattered the fourth wall between camera and subject.From the first time he turns his back to us, can we say BOOTY! He will definitely be showing off those fine assets later but as good as it looks in his jeans, just wait; like everything about Lee, it just gets better and better. Stripping down to boxer briefs that cling to every alluring curve, Lee begins massaging his meat. As that staff comes to life, he is quick to turn around and tease the camera with that butt of gold. Removing his boxers with a slow bend, his tan line shows off his rear, making it impossible to look anywhere else. Lying back, Lee begins to stroke while staring dead into the camera, relishing in being watched almost as much as we appreciate the view we are being allowed to share.Without missing a beat, he crawls onto the bed to show off his ass even more. Once he is on his back, the camera catches his eyes one more time as they roll to the back of his head in ecstasy. To give us a better view of his show, Lee stands on the bed, continuing to jack himself off! Walking straight up to the camera, we get a get a view of his dick up close and personal as if he knew just what we needed. He then sprawls down and against the carpet, spreads that fine body like manscape in search of explorers, but from the moans and expressions of undiluted pleasure, like any man, Lee knows the sensations of his body and how to produce them with the mastery of a conductor in front of an orchestra. Rubbing that body, working that pole, his sack contracts, his toes curl, his eyes roll back and a crescendo of jizz erupts all over that heaving belly. We will get him back and we're trying to find a playmate for him---so stay tuned guys!!!",
  "models": [
    {
      "name": "Lee Covington",
      "person_id": 27836
    }
  ],
  "release_date": "2006-12-28",
  "scene_id": 53697,
  "series": "Sweet Lullaby",
  "tags": [],
  "title": "Sweet Lullaby, Scene #01"
}