{
  "collections": [
    "Men Over 30"
  ],
  "description": "One glance at Loren's face and it is easy to picture him as the teacher's pet in elementary school, the most popular guy in high school and the President of his fraternity in college. He just has the golden-child turned into a sexy man look to him with that still perfect mane of hair, deep-brown eyes and square leading-man jaw. It is that smile though, a grin that is as boyishly mischievous as it is confidently sexual and brimming with contagious lust that seals the deal. Loren is one MenOver30.com guest we knew had an inner-porn star that just needed the right opportunity to blossom into a field of sexual dreams for all parties concerned. He starts by getting out of his shoes and socks, flicking them off with the barely-restrained defiance of a rebel forced to have a holiday meal back at home. Loren tugs the neck of his shirt down far enough to expose a hard pink nipple below a luxuriously thick mane of sable-brown fur that goes up to his Adam's apple, fans out across his pecs, and then funnels into a solid line right into his waistband. Digging one hand deep inside his shorts, then doing another exploratory pass, entering from the bottom of the legs then finally playing hide-and-seek with that now very prominent bulge, Loren's entire body from head-to-toe screams out one message: Game On!Sprawling back on the bed in a way that just invites you to come join him, he flashes a solid shot of that hairy pit while lowering the waistband of his boxers with the other hand. Loren shows the top of that thick bush and even thicker base of what promises to be a slab of beef just as fine as the man himself. Moving onto all fours, he drops the back of his shorts with the showmanship of someone unveiling the latest best-in-class roadster at a European auto show. Rubbing his cock with his shorts, Loren does not want to show himself at half mast, and in the process of going to full arousal, he milks the pleasure with every inch of skin. The real estate between his legs is clearly one big, hair-covered erogenous zone and this is one man who knows his own turf very very well. Moving to the shaft, gently shaking it back and forth, things are definitely growing. But it is when he holds his legs up over his head with one hand and rubs the head of his cock on his own hole with the other, critical mass is achieved and Loren goes instantly from porn star wanna-be to a master jacker more-than-worthy of being captured at work. Grasping it at the base with a vise-like grip, Loren's cock is now a fat, cut, throbbing tower of pleasure that has become the center of his universe. Coming in closer, we see his dick is incredibly thick, perfectly straight and topped by a flaring mushroom shaped head. The head is as high as it is wide with a gentle flare to the top and is genetically engineered to ease into an orifice lucky enough to be invaded by something so perfect. With but a two-finger hold now, the cum spurts out of that cock like a dam that has sprung a leak and, rather than reach for a towel, Loren rubs the load all over his chest and up to his neck with one hand while giving his hole a once over in the ultimate example of just how beneficial multi-taking can be.",
  "models": [
    {
      "name": "Loren",
      "person_id": 27840
    }
  ],
  "release_date": "2006-11-30",
  "scene_id": 53690,
  "series": "Loch Ness Hairy Monster",
  "tags": [],
  "title": "Loch Ness Hairy Monster, Scene #02"
}