{
  "collections": [
    "Men Over 30"
  ],
  "description": "It has been about a year since we first introduced Brad, and if you thought he was one horny show off then, you ain't seen nothing yet. His body is still the smooth, lean drink of water you remember, the attitude is just as open and friendly as before, the 7.5? cock as hard as ever. In fact, the only thing missing this go round was the very last morsel of inhibition he might have been hanging on to. From the moment he says ?hello,? the bulge in Brad's pants indicates he is so obviously hard and raring to go, we are surprised he does not hump the front door like a horny basset hound. But we manage to actually get him into the studio, just barely. By the time we join him, his shirt is unbuttoned, his belt undone, his zipper down, and one hand is already at work rubbing that pole. We do many things at MenOver30.com, but getting between a man and his erection is not one of them...unless of course, our camera is as loaded as their balls. And in this case, all parts on man and machine are cocked, loaded and ready for action.Once the camera is rolling, Brad does an about face as he so enjoys having an audience. He slows a bit so he can enjoy every moment. He begins by working his hand into his pants with an almost exploratory slowness and precision, as if he wants to invite us along on the journey of rediscovering the wondrous sensations that his own body can produce. When it looks as though those jeans will burst, he digs through the fly, under the boxers, and plays a quick game of peek-a-boo with that very hard shaft before pulling it right out of the fly and giving it the breathing room that it needed. Just by looking at his cock, you can almost feel the heat emanating from it. Needing more room and unfettered access, Brad stands up, steps out of his pants and shorts, with that throbbing, fat and leaking bone leading the way, gets ready to get off big time.His cock is one fat jaw breaker no matter how you look at it, but looking up at it as we were, against his very lean frame, that meat seems impossibly thick. The head is blunt, mushroom-shaped and the shaft itself decorated by a very prominent cum tube on the bottom and a ribbon of veins on the side. Reaching in from the back, Brad uses his balls like a puppeteer's handle to make his dick dance for us before lying back on the couch and moving into the double-fist mode his hungry cock is demanding. With one hand wrapped tightly on his balls, as if to keep them from flying across the room, Brad strokes so furiously fast with the other, he actually makes the wooden frame of the couch creak right through the heavy upholstery. That creaking is soon replaced by heavy breathing and that sweat on his abs is soon joined by a puddle of cum?a souvenir of time, as well as a set of balls, well spent!",
  "models": [
    {
      "name": "Brad 2",
      "person_id": 2
    }
  ],
  "release_date": "2007-02-01",
  "scene_id": 53708,
  "series": "I Dream Of Cumming",
  "tags": [],
  "title": "I Dream Of Cumming, Scene #02"
}