{
  "collections": [
    "Men Over 30"
  ],
  "description": "Looking like the Scandinavian cousin of Atlas or Zeus, Devon arrived at MenOver30.com with as much muscle as we have ever seen packed onto the human body in a nearly perfect example of symmetry, proportion and definition. With his square jaw, deep eyes, and a statue-like profile, that shade of sandy brown hair speaks of someone who was a tow-headed blonde as a child?serving as the only reminder Devon was ever a boy. He is a 100% grown man. Before we can even finish the introduction, he is already on his feet and starting the show. You can't keep a good man down; and with a man like this, it is a joy to see he is as eager to get on with the show as we are. He hesitates just for one moment, allowing us to follow the silhouette of his body through his t-shirt before turning around and giving us the equally impressive back view. As he raises his shirt up from the bottom, it is like he's raising a garage door to reveal not a compact model car inside?but a tank. With flaring lats and densely-packed shoulders, the sheer width of his back, especially as it tapers into that narrow waist is almost unbelievable. When he faces forward, the vista becomes even better.From his traps to his pecs, triceps to his obliques, all the way down to his quads, Devon has spent time developing every single muscle and shows off each one with appropriate reverence. To be this built and this lean is quite a feat?from the ridges in his abs, it is a feat accomplished for this guy. His attentions, and ours, now move to his shorts. ?Walking down? his waistband inch-by-inch, side-to-side, revealing lower abs as tight as the real estate above it and a bulge below it that is definitely showing signs of life. A quick glimpse of the white marble ass cheeks, Devon drops the shorts and takes to the bed.  He stretches that incredible body, all eyes riveted to the black lycra briefs molded to his form like a second skin.Devon rises again, and his cock rises right along. He begins to display the one muscle we have not seen yet: his cock. Devon's cock is just like the man himself: thick and very well-formed with a blunt, cut head over a pair of tight, smooth balls that are already showing signs of needing to unload as they contract tight in that sack. With one arm behind his head, his pierced, pumped pecs glistening, his stomach like a series of well-defined ridges, he begins a slow, steady, well-practiced stroke of his cock. Moving one hand to the base, adding more lube, he is in total control of every fiber and, as if by a silent command, with a vise-like grip he milks out a thick white protein shake to end his morning work out.",
  "models": [
    {
      "name": "Devon",
      "person_id": 29206
    }
  ],
  "release_date": "2007-01-04",
  "scene_id": 53700,
  "tags": [],
  "title": "Pardon My Hardon, Scene #02"
}