{
  "collections": [
    "Men Over 30"
  ],
  "description": "Wide shoulders, a tight tank top, and nice arms are often a hallmark of just the kind of men that MenOver30.com was created to honor. There is a confidence that comes from a solid mind, a solid body, and a solid idea of what to do with it? 33-year-old Kamrun has all of that and more. That more includes a spot of ink, a carefully-trimmed soul patch and just a touch of a faux-hawk to let us know that, while he is definitely about work, he still makes sure he gets in some play time. As he lifts his shirt and rubs his belly and nips in a silent invitation to join in, it's the look in his eyes and the growing bulge in his pants that make it seem as through we are right on the couch next to him.The whisper of hair above his navel looks like the top of an exclamation mark, but it is the wings of his tattoo just below, flanking the top of his waistband like gates, that welcome us inside. With leather cuffs flanking each wrist, he opens his fly and grabs the now very-stiff bulge inside like the prize salami it is; showing off its weight and thickness before opening the casing and exposing the mouth-watering meat inside. He tugs his shorts over those muscular thighs and lays back, spreading wide. His balls peeking out of one side and the head of that cock about to poke up through the top, Kamrun can't hold back any longer than those briefs can.That extra long tongue darts from the side of his mouth as he stands up and flogs that now fully-hard cock, the glistening head appearing from the dark folds of skin as he works that very thick, heavy-hanging shaft back and forth like the ultimate pleasure toy he knows it to be. Taking a bird's-eye view down on this fine specimen, we can see that his shaft is actually at its most narrow at the base and flares out steadily until it meets that plum-sized head. He bends over, allowing us to take in the dark beauty of that cockhead, shaft, balls and hole in a single view before settling back to answer the call of nature. He moans deep, low and hungry, mimicking the fervor in which he fists that meat double-time until those dark abs are covered by white-hot jizz.",
  "models": [
    {
      "name": "Kamrun",
      "person_id": 27835
    }
  ],
  "release_date": "2007-01-11",
  "scene_id": 53701,
  "tags": [],
  "title": "That Old Black Magic, Scene #01"
}