{
  "collections": [
    "Men Over 30"
  ],
  "description": "When we first met Lee a few weeks ago, with a disarming smile on his handsome face, that smooth, welcoming body and oh yes, that beckoning booty that wet dreams are made of, we instantly knew he was one of those very rare specimens of manhood that is the perfect candidate for every bedroom fantasy you've ever had, as well as being a man you could bring home to meet the folks. Judging from the amount of steamy emails we've received with the name ?Lee? in the subject line, our infatuation with Lee is contagious. But there was one man who already had the fever for the flavor for this fine man: Bailey. Like Lee, 31-year-old Bailey has a mega-watt smile that makes you feel the electricity just by looking at him. But it's how he and Lee look at each other from the first moment, with a tormented passionate hunger that foreshadows the essay on passion that is to follow.We almost felt guilty in requesting that they stop kissing long enough for us to make the introduction at the beginning. As soon as we get the words out, their lips smack together again and their tongues invade each other's mouths. This is not a casual, perfunctory porn peck; the energy that drips with every caress of their mouths acts as a precursor of the powerful desire that is impossible to contain. They peel each other's shirts off and continue to kiss as they rub their smooth chests and throbbing bulges together. They can barely stop tasting each other and only stop long enough to rid each other of the rest of their clothing. Bailey inhales Lee's cock, and with Lee looking like a cross between Christian Slater and Stiffler, his eyebrows give away exactly how he feels with Bailey's hot mouth around his cock!What gives away that same sense of pleasure when it's Bailey's turn for that oral fun is how he licks his lips as Lee slides his mouth up and down while jerking himself off. Lee leads Bailey over to the bed, commanding him to eat his ass. Not only does Bailey comply, but he jiggles those big cheeks in his face while doing the task! Lee returns the favor, licking Bailey's hairless ass! 69-ing ensues, with them jerking off to a competition of a White Chocolate vs. Butter Mocha oral fest extravaganza. We definitely know we have a recipe for chemistry here that does not occur very often on camera or off. Will Lee and Bailey get together outside of the studio? We can't say for sure, but we've already booked them to return and pick up where this leaves off! Stock up on the Kleenex and we'll see you then!",
  "models": [
    {
      "name": "Lee Covington",
      "person_id": 27836
    },
    {
      "name": "Bailey",
      "person_id": 29349
    }
  ],
  "release_date": "2007-01-18",
  "scene_id": 53703,
  "series": "We Came Together",
  "tags": [],
  "title": "We Came Together, Scene #01"
}