{
  "collections": [
    "Men Over 30"
  ],
  "description": "?Mike? may be a common name, but in the case of MenOver.com's Mike, his name is about the only thing that is usual about this fine specimen of man. Tanned skin, shaved head, hypnotizing brown eyes, and a trail of dark hair that starts at his collar and ends on his toes give Mike a patina of sedate virility that is impossble to resist. He is that sexy guy in accounting, or that stud from the gym who has the stain of his girlfriend's lipstick still on his neck, or perhaps he is the embodiment of the civics professor you still harbor a crush over. Mike is that friendly, likeable guy we all know from some point in our lives. The other thing we know about guys like this, behind the oxford shirt or waiting patiently under those jeans, is a sexual pot boiler just begging for the taking...or perhaps even better, begging to be taking you!Mike shows up still in his suit and tie. He quickly changes into a pair of jeans that show off a great tight butt, and a bulge in the front packed with promise. He lies down and opens his crisp white shirt, letting the camera survey that hunky, hairy body underneath. Standing up, he drops his shirt and turns his back to show off that this no nonsense man has a touch of rebel with a big tat on his shoulder. His jeans are riding low, and we can see the white globes of the top of his ass cheeks in sharp contrast to his deep tan. While he immediately gives the cock in his pants the attention it's craving, a case of last minute shyness causes him to turn his back as he steps out of his jeans. We get a flash of his balls as he lies down on the bed and begins to grind away. That toned, golden-brown torso and gleaming white butt is an essay of poetry in motion as he undulates on the bed before setting back, turning over and beginning to stroke that now leaking cock.Rising to his knees on the bed, we follow down every hairy inch of his chest. Down those furry abs, across a trimmed bush, down to a cock that is so hard, it bobs and weaves through the air by itself. Mike gives that meat a propeller spin, then moves to the bed for some more stroking, allowing us to get a flyover across that furry hole. Whether it's the porn he was watching, or perhaps the fact he knows people will be watching him, that cock seems to grow another inch as he strokes faster. Spitting on his fingers and lubing up that meat for the final assault, he pops his nut all over his furry abs.",
  "models": [
    {
      "name": "Mike",
      "person_id": 29801
    }
  ],
  "release_date": "2007-01-25",
  "scene_id": 53706,
  "series": "Sex Becomes Him",
  "tags": [],
  "title": "Sex Becomes Him, Scene #02"
}