{
  "collections": [
    "Men Over 30"
  ],
  "description": "In order to keep bringing you the sexy, confident studs in their prime each and every week, we are always on the lookout for fresh talent. Since we are now three years old, it is not unusual for interested men to email us for information about modeling. Every so often, we are fortunate enough to feature a bona-fide porn star like sexy Todd Maxwell, Adam Faust and Troy Halston. As a special Valentine that was as much a present to us as it will be to you, we add another stellar figure to the MenOver30.com's Walk of Fame; the daddy's daddy, Mick Powers! Fresh from a starring role in Centurion Muscle 2, and featured in SWAT, Muscle Bear Motel and Trapped 2, just to name a few, Mick walked in wearing a shirt that says it all??I Do Things You're Afraid to Fantasize About.? Fantasizing about Mick, however, will not be a problem at all, though to stop thinking of a man this handsome, sexy and charming may become an issue. At 5'11? and 206 pounds of lean beef, Mick is a strapping portion of man and cuts quite a formidable figure wherever he goes. But despite the dark beard and well-trimmed, luscious crop of body hair, that smile says it all. This big bear definitely has a dose of Gentle Ben to him. But we have a feeling he can be as tough, or as tender, as you desire and most likely, plenty of both!Mick strips off his shirt to reveal that powerful, well-worked, muscled chest with its crop of dark fur and pec covering ink. Licking his fingers, he pinches both nipples and lets out just the kind of low, sexy growl you would expect from a man like this. Watch the muscles in his arms ripple as he tugs those nips again and again, until one hand follows the trail of hair down the center of abs and into his pants. As he is tugging down the waistband to reveal the top of that dark, thick bush, he looks right in the lens and says ?Oh yeah, I have fur going ALL the way down, boys!? The sexual promise of total fulfillment from what is to follow will have you doing some tugging of your own.He flips around to show off that fine, solid, rounded, hairy beefy behind and flashes the hole as if daring you to even think about it. When he faces us, rubbing that now rock hard cock with his shorts, you can almost smell his scent and the aroma is intoxicating. He works every inch of that cock, telling you explicitly what he needs you to do as if he feels you right there with him. Moving to the bed, his attitude becomes more serious, he strokes more urgent and the steady stream of sexy talk is replaced with a chorus of deep primal moans of a man who can hold back no more. Mick fires off his load, his body tenses and coils as he gives up his nut. Rather than grab for a towel immediately, Mick scoops up his load and wipes it on the inside of his thighs and his crotch, proving that cologne is indeed the perfect Valentine's Day gift for a man after all.",
  "models": [
    {
      "name": "Mick Powers",
      "person_id": 27849
    }
  ],
  "release_date": "2007-02-08",
  "scene_id": 53709,
  "tags": [],
  "title": "What Daddy Wants, Scene #01"
}