{
  "collections": [
    "Men Over 30"
  ],
  "description": "From the expressions of unbridled delight as Loren explored that hair-covered fantasy land, also known as his body, when he made his MenOver30.com debut a few weeks ago, to the accolade-filled emails from you wanting to see more of this sexual savant, we were all on the same page: as worked up as he made himself exploring his own hole, how hot does Loren get when he has someone else to do the prospecting in that golden cavern between his hairy cheeks? To help us find out, we enlisted the aid of 6'2?, 200-pound serving of man named Sloane. As smooth as Loren is hairy, Sloane still has the irresistibly mischievous attitude of a guy who left the frat house but the frat house has not quite left the guy. At eight-and-one-half-plus inches, Sloane is sporting one beauty of a cock. Loren takes one look at the size of that bulge and his crotch immediately starts to balloon. When we can tell both guys are rock hard and raring to go while still fully dressed, we know we are in for some fireworks. And let us just say the typical explosions in the sky on 4th of July pale in comparison.Sloane rips the clothes off Loren like a present he has been eyeing with his name on it and could not wait one more second until he could tear it open and get inside. Loren immediately lays on his back and spreads his legs, his cock already throbbing on his belly. Sloane climbs into position and lets his own cock fall on top of Loren's, then reaches down to rub them both together like one super-sized serving of meat. Sloane moves up to straddle Loren's face, and Loren enjoys every devouring moment of being force-fed that large cock so much that his cock stiffens to the point where it arcs up off his abs. Not to miss out on the fun, Sloane leans down for a 69 session before standing up and managing to keep that big cock shoved down Loren's throat the entire time.Loren greedily covers every over-sized inch of Sloane's cock and balls with his tongue until Sloane's cock is shiny with spit and definitely ready for its next mission. He pulls Loren up to his feet, rubs their cocks together again before flipping him around, and makes an immediate assault on the ground zero of Loren's hole.  The gamut of sensations that a good solid ass fucking and massive cock can cause resonate on Loren's face as Sloane bangs away like a sex-starved convict granted his first conjugal visit in a decade. Sliding to the floor to offer Sloane even deeper access, watch his hairy ass bounce up and down right before they get ready for blast off with a final move to the bed before launching their white liquid rockets in a joint display of bliss!",
  "models": [
    {
      "name": "Loren",
      "person_id": 27840
    },
    {
      "name": "Sloane",
      "person_id": 27846
    }
  ],
  "release_date": "2007-02-22",
  "scene_id": 53713,
  "tags": [],
  "title": "When Straight Cocks Go Gay, Scene #01"
}