{
  "collections": [
    "Men Over 30"
  ],
  "description": "In the short year that 43-year-old Brett Anderson has been appearing in videos, he has become the ?Go Daddy.? He has appeared for Titan in such hardcore hits as ?ManPlay25? and ?The Arcade on Route 9.? We know he will fit in just as fine here at MenOver30.com, as we definitely support the belief that ?Father Knows Best.? While being very active onscreen, Brett's own personal life has undergone a renaissance of its own, as he now hangs ?His and His? towels in his master suite. It seems that, along with his new partner, this formerly strict top has recently learned to add the joys of being on the receiving end to his resume for the very first time. The joys of doing so while being deeply in love brings a happiness to his performance, as it does for us as well. One of the best parts of being over 30 is knowing what you really want. And for Brett, this is one man in his prime who is having the time of his life.Brett wastes no time in ripping out of his clothing to give us an up close and personal tour of his very well taken care of physique His flat abs showcase the fruit of his daily labor on the treadmill with a single tribal band tat adding definition to his well-worked arms. His body is dusted with a fine spray of light-brown hair. All it takes is one tweak of his nipple, and that seven-inch cock is fully engorged, pointing straight up at the ceiling and visibly throbbing, bobbing, and weaving back and forth, all on its own considerably-sexy accord. A deep, low moan escapes his lips as he continues a one hand stroke on that beautiful cock, which seems to grow another inch right before our eyes.Brett stands up, turns around and shows off that white ass, even spreading his cheeks to let us take a peek of that hole which, as we know, is no longer strictly just decorative. There is intensity in his face as he strokes with more purpose. This is not a man in a hurry; this is a man who knows how to work every inch of that sexy body to elicit the maximum pleasure from every touch. As he lies back, the moans get louder as he is lost in his own joy. One finger seems to disappear in the newly repurposed hole as he strokes away. Not missing a beat, Brett moves to the chair for some double-time stroking that leaves his balls high, tight, and ready to pop. And pop he does, all over his hairy abs. As the sperm continues to leak down his fist, his load peters out before his moans do. When it comes to men like Brett, experience is definitely the best teacher, and the curriculum definitely includes advanced masturbation!",
  "models": [
    {
      "name": "Brett",
      "person_id": 27844
    }
  ],
  "release_date": "2007-03-08",
  "scene_id": 53717,
  "tags": [],
  "title": "Crash Into You, Scene #01"
}