{
  "collections": [
    "Men Over 30"
  ],
  "description": "Still in his preppy office garb, there is something in those brown eyes of Saber's that tells us this is one book worm that is not to be judged by its cover. As he begins to tug off his tie, it seems like Clark Kent is about to reveal a side of himself that no one has ever seen before, and that he wanted that unveiling to be on camera. Despite the rakish sounding name, Saber has that friendly, non-threatening air you would associate with the guy in accounting from the third floor, or the happy newlywed from across the street. But Saber is here, in the bedroom, and he is glad not be alone - as if he has been anticipating this moment for all thirty-one years of his life. Looking at the hint of crimson in his auburn hair, you can almost picture him as an impish red head who is shocked that he ever grew up. But judging by the way he is tugging at that lump in his trousers, grow up he did. Popular theory is ?red on the roof, fire in the hole,? so would we find flame-colored pubes down below? We did not have to wait long for our answer.As he unbuttons his cuffs, takes off his watch, and tosses his regulation HanesT-shirt off, there's almost a swagger to the way be disrobes, like he is a warrior divesting himself of his armor and preparing for battle. Saber rips open his pants and lays back, massing the front of his snappy, striped boxers that you just know his wife had laid out for him last night. A small round tat on his arm is another visible sign of his repressed wild side, as is the leer he gives to the camera, dripping in the promise that he is just warming up. Reaching deep inside his shorts, his head tossed back as if every unmet primal need is fighting to come to the surface, he shucks his shorts and begins to hump the bed. He grinds away, his milk-white ass gleaming, as if he was performing his duties as a husband, only this time, the Mrs. is not at home and the Mr. definitely has other things on his mind...and in his hand!Saber humps to the head of the bed where he rolls over. As he reaches underneath to rub that spot right below his bloated sack, we see the red fuzz at the base of that now hard and leaking cock. As he sits up, we see there is yet another spot on his other arm, a few red hairs in the center of his chest, and one very hard cock in his hand. He stands and strokes from behind, showing off his cock and ass at the same time in just such a way that you can tell he has done this in the mirror before and cannot quite believe he finally has the chance to do it for a real audience. Sitting down and spreading wide, the flame-colored pubes of his bush cover his balls, casting a red glow that matches the shade of crimson that his face is turning as he rips off a load that blasts over his torso and lands on the floor beside him. For our friend Saber, seems like the sword really does cut both ways after all.",
  "models": [
    {
      "name": "Saber",
      "person_id": 27847
    }
  ],
  "release_date": "2007-03-01",
  "scene_id": 53716,
  "series": "Pale Knight",
  "tags": [],
  "title": "Pale Knight, Scene #02"
}