{
  "collections": [
    "Men Over 30"
  ],
  "description": "Having just turned the big 'three-o', Dane possesses a sexiness beyond his years and is a definite welcome addition to the brotherhood of sexy studs in their prime here at MenOver30.com. There is something very powerful when a man is so totally at ease and comfortable in his own skin as Dane is. The fact that the flesh is left au natural and covered in a sexy pelt of sable-brown fur is a more than welcome respite from the 'wax it smooth' trend. Dane came to the studio following a trip to the gym after work, still wearing the V neck he had on under his business shirt during the day. But the shiny gold ring hanging off his nipple let us know that Dane is as comfortable in the bedroom as he is in the board room-and the bedroom is right where we wanted him.Dane wastes no time in revealing his bare chest, or considering the amount of dark hair fanning down from his collar bone and going all the way to his waistband, let's make that his 'bear chest,' before tugging off his shorts. The sexiness of his solid body in just a pair of white boxers clinging to him like a second skin clearly showing the outline of a cock on the rise made us want to rip his boxers off and explore every inch of what he had to offer, especially since there were more inches appearing at a very rapid clip. A moan escapes his lips as he begins to stroke that meat, getting the maximum pleasure from every touch. He has a slow easy pace and seems to be in no hurry; however, the contracting of those balls speaks of the growing need to seed on his part...as well as ours.Dane turns around to reveal a well-muscled, V-shaped back with a sexy large tat right in the center. And directly above an ass that is perfectly rounded and creamy white before he sprawls back on the bed, switching gears from casual country walking to big city stroking and double speed. His eyes glaze over in a state of sexual Zen, and the way he stares directly into the camera, it is as if he wants to take us along with him. Hanging on to his balls, his head back as he moans in a primal ecstasy of a man on the crest, his cock seems to suddenly grow another two inches as he fires a load all over those hairy abs. To this Great Dane, what else could we possibly say but, 'WOOF'!",
  "models": [
    {
      "name": "Dane Hyde",
      "person_id": 27919
    }
  ],
  "release_date": "2007-02-15",
  "scene_id": 53712,
  "series": "Unwrapped Gift",
  "tags": [],
  "title": "Unwrapped Gift"
}