{
  "collections": [
    "Men Over 30"
  ],
  "description": "Lee may have just become the king of MenOver30.com from the very instant he first appeared. His natural charisma, that rare combination of boyish good looks infused the pallor of experience, his hunky, smooth body, every inch of that hard cock and the sheer joy he exhibits by putting himself out there in the most intimate way possible lead to one unanimous verdict: he's the guy we wall want to find. Some men you want to fuck, some you want to marry, but with Lee you want it all. Of course, we all cannot be as lucky to have a Lee in our world, but when he and Bailey got together a few weeks ago, they both seemed to have that sexual chemistry jack-pot, with the kind of passion that is very rarely seen on screen or off. Their oral extravaganza quickly became one of the top requested videos on the entire site, even though it has been up for a relatively short period of time, and yet we knew there was another chapter to the Lee and Bailey story, and we were not sure who was more anxious to see it played out: you or us. The answer, it turns out, is Lee and Bailey themselves. They pounce in the door like a virgin bride and groom about to finally enter the honeymoon suite after a decade-long engagement. Once again, we almost need the Jaws of Life to separate their lips long enough to simply give the introduction, but it is clear that the only introduction they are really interested in is the one that involves the business end of Bailey's cock making nice with Lee's hole. Just watching them kiss is to observe an erotic odyssey of not just true, unbridled desire, but a hunger to inhale the sheer essence of each other in order to keep a part of the other with them forever. Bailey moves his luscious lips to Lee's nipple and sucks like he is a dick-starved soldier on his first shore leave after a two-year tour of duty, before heading south to that throbbing pole of Lee's. With his own legs hoisted in the air, Lee gives Bailey a visual of where he wants him next, and Bailey's tongue makes a slow journey across Lee's cock head, down the shaft, over the balls and just as it get to Lee's hole, Bailey moves so Lee's tongue can get reacquainted with Bailey's cock; but that cock does not stay in Lee's mouth for long.Lee soon finds the best seat in the house; the one on Bailey's cock. He lowers himself in a quick, insistent, hungry push on that pole and quickly begins to ride up and down like a galloping pony coming around the home stretch with Bailey lifting his hips up off the bed to meet every thrust. Flipping Lee on his back without ever leaving his hole, Bailey uses Lee's ankles like handles to guide that hole deeper on his cock as he pounds away even faster. Lee now moves to his stomach and Bailey climbs aboard and begins to pummel away like the Energizer Bunny on steroids until they are both dripping in sweat and Lee's throbbing cock is leaking precum almost as furiously, until the sheer sensations Bailey is producing usher up a massive load. The contractions of Lee's hole as he shoots was all it took to push Bailey over the edge and after pushing Lee down on his back, he covered Lee's front with one of the most gargantuan loads we have ever seen. Lee and Bailey sitting in a tree... f-u-c-k-i-n-g!",
  "models": [
    {
      "name": "Bailey",
      "person_id": 29349
    },
    {
      "name": "Lee Covington",
      "person_id": 27836
    }
  ],
  "release_date": "2007-03-22",
  "scene_id": 53722,
  "series": "Made 2 Fuck U",
  "tags": [],
  "title": "Made 2 Fuck U, Scene #02"
}