{
  "collections": [
    "Men Over 30"
  ],
  "description": "Having just added candle number 30 to his last birthday cake, Jay Armstrong is a new member of the round table. Jay started out life as a good 'ole country boy and traces of that back-home-twang still resonate in the big helping of this all-grown-up southern gent. Jay has crammed his three decades with a wide variety of stops along the way, including stints in the navy, on stage as a dancer, a handful of porn films, and a brand new entry to his resume?that of a boyfriend. Though generally on the receiving end, Jay's new role as a partner included a role as a top as well, and he said it was his hubby's heiney that he fantasized about when he shot his load. Speaking of loads, the nuclear-injected sperm bomb he shot well over his head and closer to the ceiling then the floor lays testament to the fine form that man's ass must take, but we are getting a little ahead of ourselves here because how Jay got to critical mass is half the fun.Quickly tossing off his army cap, we see the serpents inked into his forearm dance as Jay lifts his shirt up slowly from the bottom, unveiling a set of lean abs and very smooth pecs, but a dark brown and surprisingly dense crop of fur under each arm. As he shows his back to the camera, with his shaved pate, marked arms and the word ?Blessed? inked in big letters from shoulder blade to shoulder blade, it is easy to picture him as if he still is a jar head, under the showers as his boat charters off to its next port. His khakis do not stay on long, and soon we are greeted by the waistband of his boxers barely clinging to those well-worked obliques and featuring a bulge in front that is definitely stirring with signs of life. As he gets on the bed and lowers his shorts to expose his ass, we are greeted by a round, tight, white, and perfectly-formed pair of glutes that beckon with an invitation to the paradise within. With an ass this perfect, it is no wonder Jay states he is mostly a bottom, as anything that beautiful going unfilled would be paradise lost indeed.Starting from the toes on his solid, hairy legs, we journey up inch by inch until Jay unveils seven thick, spongy inches. Jay has just the kind of cock that hangs heavy even when he is soft. We can just picture that big meat flopping around inside his white, official issue boxers when he was on ship. But we like him even better on our bed, with that meat in his hands. Knowing now that when he turns over and gets on all fours, he is imagining himself giving the new hubby a much anticipated welcome-home fuck, and knowing that hubby also sees what we see, namely that dark, tight hole opening up as Jay pulls back, we are sure that not long after, it is bottoms up times two. Back at ?Ground Zero,? it is not long before Jay reaches his own meltdown down below and fires off the epic load that spews off far above.",
  "models": [
    {
      "name": "Jay Baight",
      "person_id": 27843
    }
  ],
  "release_date": "2007-04-19",
  "scene_id": 53729,
  "tags": [],
  "title": "Parting Gifts, Scene #01"
}