{
  "collections": [
    "Men Over 30"
  ],
  "description": "Every so often, the Man Deities smile down upon us at MenOver30.com and send us a specimen of the male form so perfect, it takes our breath away. Today was one of those rare days and Scott Tanner is one of those men. 31-year-old Scott's 183-pounds are distributed with precision on his 5'11? frame. Starting from the top of those natural sandy blonde locks, across that mask of a Golden Boy that has matured into a face of unparalled handsomeness, over a solid, well-cared for physique that features, in all of its thick, eight-inch glory, one perfect slab of man flesh that sets the bar in which all would-be perfect penises aspire to be: long, thick, perennially hard and posses endless stamina and allure. As perfect as that cock is, it has to fight with the many many charms that Scott possesses; to say that he is a total package is a travesty of an understatement: tantric perfection is more like it. Sprawled back on the bed like a Nordic hero awaiting the spoils the victory, Scott quickly sheds his shirt and immediately starts rubbing that impressive tent of promise stretching out the crotch of his jeans. As he unbuttons the fly, the mighty cock below proves to be too big for the black shorts underneath, its sheer length and girth forcing the tender flesh below to peek through the leg as it begins it journey to come out and play. With a final tug of the waistband, that rock-hard cock and bloated ball sack immediately point toward the ceiling as all eight thick inches throb in the heavy silver ring. Like a obelisk that pierces the horizon, an object of awe and desire for all to see, Scott's cock, with that flaring head atop that very thick, perfectly straight shaft, seems to be like the sex toy of your dreams brought to life and attached to a man destined to star in your fantasies forever.Our eyes travel down the dusting of light brown fur on his chest to the gleaming metal band at the base of his shaft.  As he slaps that shaft forcefully in his hand, the echo across the room seems to be a combination call to worship, as well as, the trumpets of going into battle. When he stands up on the bed and turns around, under the sprawl of ink on his lower back lies a set of tight, round, white, muscular glutes that offer a vista worth the price of admission alone. Lying on the bed, sitting with his legs spread wide in a chair, hunkered down on the floor, Scott works that meat with an increasing fury before mounting the mattress, falling back and forcing out a massive load as his body trembles and shakes in an earthquake of undeniable pleasure. As to who enjoyed it more, him or us...that remains to be seen.",
  "models": [
    {
      "name": "Scott Tanner",
      "person_id": 27871
    }
  ],
  "release_date": "2007-04-05",
  "scene_id": 53726,
  "tags": [],
  "title": "Unclothed Mind, Scene #02"
}