{
  "collections": [
    "Men Over 30"
  ],
  "description": "Dean is a 39-year-old Colombian boat mechanic who was in town for the International Boat Show in Florida. It is easy to picture him in a pair of blue coveralls, a thick mat of chestnut-brown chest hair spilling out of the open zipper at the top, the blue fabric clinging to the round curves of that meaty, round ass in the back, and in the front, a heavy lump of flesh snaking down the leg. Though he says he is happily single with a couple of girls for regular ?relief,? there is a sexual edge to his gaze that made us feel he might be more open to answering booty calls from a wider variety of would-be partners than he initially let on.This may be Dean's first foray under the camera, but the leering smile says it all without uttering a word; he cannot wait to get on with the show of getting off. He peels off his shirt as one hand slides inside his well-packed jeans. On his other hand, we notice for the first time a gleaming band of gold. Seems Dean has not told us his whole story, but once again, actions speak louder than words as he quickly turns his back, lowers his jeans, and is almost instantaneously at full mast. As he turns to the side, the camera pans down every fur-covered inch of his chest, past that thick bush and across the base of his now throbbing cock. Again, no words are necessary. The strands of precum clinging to his fingertips as he pulls his hand away speak for themselves.Sprawled back in his chair, his sack drawn up tight between his hairy thighs, his cock up and throbbing against the fur-covered terrain of his stomach, Dean is the blue collar wet dream beckoning you to try and give him as much pleasure as he is giving himself. Grabbing those nuts like a handle to display the slightly curved shaft to the ultimate advantage, he holds it out like an invitation by moving to the floor and furiously jacking away until he delivers his own white R.S.V.P.",
  "models": [
    {
      "name": "Dean",
      "person_id": 27792
    }
  ],
  "release_date": "2007-04-12",
  "scene_id": 53727,
  "tags": [],
  "title": "1 Groom and No Bride, Scene #01"
}