{
  "collections": [
    "Men Over 30"
  ],
  "description": "Charlie comes to MenOver30.com after having been born in South Africa, raised in Spain and to college in Buenos Aires. This international, ultra-prime serving of muscle and charm has an appeal so universal that he would be a figure of ultimate desire even on Mars. From the moment he opens his mouth, you can hear the dulcet tones of an accent so sexy, it practically lowers your zippers in anticipation of what you are going to need to do next. Charlie is the kind of man that does not make you hard, he makes your dick throb long before you have even seen his, as just the way his fills out a t-shirt and a pair of jeans redefines what a naturally sexy man truly should be, but so rarely is. Charlie tells us he runs 3 to 4 times a week, as well as hits the weights even more than that. The results speak for themselves, but do not speak for Charlie; as far from cocky as they come, he simply exudes the effortless confidence of man blissfully comfortable in his own skin. And seeing more of that skin is exactly what we have in mind.Getting a close up of that bulge already protruding with the promise of bigger and better things to come, Charlie removes his belt. He then ascends the bed as if it is a stage, lifts his shirt up behind his head and begins to run his hand down the flawlessly smooth, enviably lean torso as his body gently moves from side to side in a silent dance of powerful seduction. His waist is as narrow as his shoulders are broad, those abs sharply defined, his pecs perfectly formed, and his arms swollen with baseball-sized biceps and shark's head-like triceps. As he turns around, the back view is just as impressive with flaring lats that melt into the curves of a round, tight ass that, just from looking at it, you know is as rock hard as the rest of him. As he turns around and faces us again, the swelling in the front of those sexy black briefs indicates that everything on Charlie below the waist is rock hard and getting harder all the time.With one hand now inside rearranging the prize, it looks like someone slipped a Speedo on a statue of a Greek god, only this time the statue and the tantalizing flesh under the fig leaf has come to life. There is a new intensity filling the room as Charlie goes from passive to aggressive: he knows how badly we need to see him in all of his glory, but things will definitely be on his terms. He lowers the waist band in back to properly display the white globes of his ass and begins to grind away, keeping his hips high enough to let that magnificent object of our affection dangle in between those meaty thighs. They are like prime real estate that you get but a passing glimpse of though the carefully-manicured hedges as they blow in the breeze. When he turns around, that mouth-watering cock is at full attention, the head glistening with precum and the sack below bloated. He stands over us, his dick sticking straight ahead with no need for a hand to keep it at attention, both daring us to taste it and begging for it at the same time. Sprawled on the floor, his sperm having an agenda of their own, he moans deeply, and with a longing gaze directly into the camera telling us \\'this is for you,\\' he ushers forth a thick steady stream as the ultimate good-bye.",
  "models": [
    {
      "name": "Charlie Xavier",
      "person_id": 27898
    }
  ],
  "release_date": "2007-03-15",
  "scene_id": 53720,
  "tags": [],
  "title": "Power Play, Scene #02"
}