{
  "collections": [
    "Men Over 30"
  ],
  "description": "Tall, dark and handsome. When all three apply, they make for a trifecta of masculinity. More often than not, men have two out of the three. Then there is the exceptional serving of manhood who embodies all three to perfection.  Gemini is just such a man. He has the build of a football player, a butt like two basketballs, fully pumped pecs and a covering of dark hair that just begs for your fingers to run through it. As for that manhood of his, this man has an exceptional serving of 8 ?? of dark meat as thick and juicy as the man sporting it.The shiny pate, the mustache, the brooding eyes, the black wifebeater with tufts of chest hair swirling over the top and the packed camouflage pants are not just window dressing; Gemini just oozes that ?all man? appeal from every pore.  He makes quick history of the shirt, the tat on his arm rippling along with his bicep as he rubs his crotch. Following the trail of hair down his belly to the waistband of his briefs, his hands disappear as he prepares a two-fist-full piece of meat for its debut, but first he gets on his knees and exposes a plump, round, dark, curved set of glutes that seem like two perfect orbs honed from the midnight sky.Facing forward finally, not quite fully hard and already 7? plus and with a sinister arc, an impossibly thick shaft under the sexy dark bush presiding over heavy hanging balls swings into view with a shiny flared head like a very ripe plum. That towering meat swings back and forth like a great pendulum until it reaches a solid 8 ?? that on a good day seems like it could grow even bigger. Panning down his body, like a vista of all things virile, we move over the muscle, over the hair and down the expanse of the cock until, with barely a sound or a flinch, that pent up load makes its final escape.",
  "models": [
    {
      "name": "Gemini",
      "person_id": 27823
    }
  ],
  "release_date": "2007-03-29",
  "scene_id": 53724,
  "series": "Masculine Melody",
  "tags": [],
  "title": "Masculine Melody, Scene #02"
}