{
  "collections": [
    "Men Over 30"
  ],
  "description": "From the moment we first served up Scott, the response to his universal appeal was compelling to just about everyone. His golden good looks, hard toned body, sexy ink and the heavy, thick beauty of a cock that never goes completely soft has become the grail many man lovers have been searching for ever since we first discovered what it is that makes our dicks gets hard: namely, a sexy stud like Scott. As good as Scott looked in his MenOver30.com debut, seeing his body cradled by the water and that beautiful cock illuminated from the warm glow of the candles in last week's encore upped the ante of just how hot he really is. We were thinking the same thing you are: if he is this scorching by himself, he must be nuclear with someone else! We set about finding just the right catalyst to make sure he, we, and of course you, reach the critical mass and subsequent total meltdown down below. For this uber top, we needed an uber bottom, and MJ was just the ticket. This 21 year old has a world class ass and loves nothing more than having it filled. On paper, this was a perfect match up, but the real test was getting them together in the studio. When we did, the fireworks started at hello, and what transpired between hello and good bye is some of the hottest footage we have ever filmed.From the very beginning, Scott and MJ did not appear like freshly introduced co-stars but a pair of boy friends that were very comfortable with each other and the closeness that had been developed over time. That passion is infused with the freshness of discovery as they taste each other's lips for the first time. They waste no time in getting each other out of their shirts, MJ exploring every inch of the terrain of Scott's chest while the growing bulges down below make the best thermometer of just how hot they are for each other. No one packs a pair of tighty whiteys like Scott does, and for MJ, that was a like a present he would not wait to unwrap.  Hauling that huge throbbing cock out of the leg opening of Scott's briefs, MJ started at the top and did not stop until the head of Scott's shaft tickled the back of MJ's throat as the bottom of MJ's chin tickled Scott's now very bloated balls. With Scott's heavy silver cock ring acting like a handle to paradise, MJ continues an expert oral examination until Scott flips him over on his back, spits on his index finger, and begins to explore the territory where they both need his cock to go next.Scott's tongue soon replaces his finger as MJ's hole visibly trembles in both anticipation of what is coming next. Straddling Scott's hips, MJ slowly lowers himself in one long, insistent steady push until every inch of the considerable real estate comprising Scott's cock are buried in their new home. Scott bucks up as MJ presses down, their union complete in perfect rhythm each other. MJ keeps Scott's cock deep inside as he pivots around and continues riding him from the front until it's Scott's turn to flip MJ over on his stomach, enter him from behind, and give that hungry hole the righteous riding it is begging for. When Scott finally pulls out and begins to fist his shaft, his cock is longer and thicker than we have ever seen it before; and, although he has had some of the loudest and most powerful orgasms on the site, today's explosion was one for the record books. The load that soon followed from MJ indicated he enjoyed the ride as much as Scott did. Don't worry guys, we will be sure to get Scott back again and have him fly the friendly skies - only this time, we'll see what happens when he has a co-pilot instead of a trainee. See you then!",
  "models": [
    {
      "name": "Mj",
      "person_id": 27850
    }
  ],
  "release_date": "2007-05-03",
  "scene_id": 53734,
  "series": "Riding Mr. Horny",
  "tags": [],
  "title": "Riding Mr. Horny, Scene #02"
}