{
  "collections": [
    "Men Over 30"
  ],
  "description": "Born on one continent, raised in another and now living in a third, Charlie is a true international man with an appeal so universal his handsome face, incredible body, superb bubble butt and extra-fine cock would be on demand anywhere he went. Though he commands the physical charms en masse, his manner is just as charming as well, and while we were not surprised how popular he quickly became after his MenOver30.com debut a few weeks ago, like you, we couldn't wait to have him back in front of the camera. It is a rare and cherished pleasure to work with a man like Charlie. Between that face, that dick, that butt, and that bod, is he a turn on just to be around. Of course, the real magic is that Charlie also loves to be in front of the camera. He romances the lens with the nuanced touch of a tactile lover, yet does so without an once of conceit or pretense or self-consciousness. He is simply a man in his element, and capturing him in the art of being himself is nothing short of erotic joy at its finest.Sprawled back on the bed, the sheer size of his arms stretch his t-shirt sleeves to the breaking point as the lump in his jeans is causing the area under the fly to do some growing of its own. A quick flex and Charlie loses his shirt, allowing the glorious real estate of that perfect, naturally-hairless torso to be on display. His midsection is looking even leaner than before, and the waistband slides so seductively on his trim hips that the ridges of his obliques offer your eye a sinewy path to paradise below. The way Charlie fills out a pair of jeans, it is impossible to check out the way that fabric clings to every sexy curve without desperately praying the fabric will self-destruct so you can get at the real prize inside. Charlie knows how to put on a show, and before he displays what is behind Curtain Number One, we are treated to a view of those gloriously round and tight, milky white ass cheeks.  As he bends over, we can see the tight pucker between those hairless cheeks. As your mouth starts to water, Charlie lets his now hard cock hang down; and suddenly, as much as you want to use your mouth, it is almost impossible to pick where to begin.The view of those sculpted legs, that round and tight sack, the untouched hole and perfectly-shaped, seven-inches of dick all in one glance is like being on hand to observe a masterpiece of nature that is as mesmerizing as it is enthralling. Before you even realize how powerful the image is, you find you are pulling on your cock just as Charlie works on his. As Charlie moves to the bed and his hips begin to undulate back and forth, you can almost feel yourself under him, wishing to trade places with the mattress and feel him grinding on top of you. As he rolls back over and spreads wide, his sack is now swollen as he strokes away on that perfect cock, giving you a glance that is so longing it seems like he is holding that cock as an open invitation for you to come take over. His dick seems to have suddenly gotten thicker and added an inch in length as he begins to moan and empties a thick white load all over his sweat-covered abs. We are not sure where Charlie is off to next, we just really hope he cums back soon!",
  "models": [
    {
      "name": "Charlie Xavier",
      "person_id": 27898
    }
  ],
  "release_date": "2007-05-10",
  "scene_id": 53736,
  "series": "Same Place, Same Time",
  "tags": [],
  "title": "Same Place, Same Time"
}