{
  "collections": [
    "Men Over 30"
  ],
  "description": "Scott revealed in his MenOver30.com debut that he is ?single and happy,? and the rest of us are very happy he is single, too. Though this uber sexy, ultra horny, thick-dicked stud packs as much between his ears as he does between his legs, we are just beginning to scratch the surface on a laundry list of delights this charmer brings openly to the table. Scott's appeal is almost universal: if you like men at all, you like Scott... whether on paper he is your ?type? or not. Between that easy manner, the effortless sexuality, a prime body, and if that were not enough, a long, fat hungry cock, what is not to like? We film our interviews here after the model has already shot his load and it was no different with Scott. The difference was, even after his orgasm, which was so powerful his entire body trembled for several minutes, his cock was just a thick and long as before. The journey to that great release proved to be an odyssey we are forever grateful to have preserved on film.First his belt, then his shirt, Scott does not as much undress that fine body as much as he unwraps the present you have waited so long to open. Few men fill out their jeans as seductively as he does: the fabric clings to those strong legs and well-packed crotch like a road map to the pleasure zone. Tugging at his crotch, his bush peeks over the waistband as a reminder of where this journey is going. As the buttons spring open and the bulging white briefs come into view, that thick cock head does as well, hungrily sticking out of the leg hole, desperate for some breathing room. He begins to slide down his shorts, revealing the thick bush, the heavy cock ring, and the even heavier dick. The bloated condition of his balls lets us know what he really wants to do next, but he decides to take a detour into the bathtub and invites us to join the party.Bathed in the soft candlelight dancing off the reflection of the water, Scott's cock looks bigger and fatter than we have ever seen it before, making a loud splash and he snaps it back against his belly. From the top of that flaring head down to his balls, his entire cock and sack is scarlet red. As he moves to and takes a seat on the counter, the camera becomes the perfect instrument to catch not just the man, but that perfect reflection as well in the mirror behind him. As he moves back to the bed with his back to us, behind becomes the operative word: we are so taken with his front view we have almost forgotten just how beautiful that ass is. As he bends over further, we are treated to the best of both worlds as that perfect butt and world class cock are both on display, begging to be worshipped. But it is Scott who falls to his knees on the floor. With a three minute symphony of the deepest moans of satisfaction, he spills his load with such force that his entire body trembles. We immediately wonder the same thing you are: if his orgasm is this powerful when he is alone, what are they like when he has a partner? That question will be answered next week, so make sure you return and set an extra place, as this time Scott is having company.",
  "models": [
    {
      "name": "Scott Tanner",
      "person_id": 27871
    }
  ],
  "release_date": "2007-04-26",
  "scene_id": 53732,
  "series": "Lover's Touch",
  "tags": [],
  "title": "Lover's Touch, Scene #02"
}