{
  "collections": [
    "Men Over 30"
  ],
  "description": "Only the discipline to build on what your genetics gave you - and to build up what they did not - provide the unique combination of factors that can produce one of our favorite facts here at MenOver30.com. Some men are indeed like a fine wine that improves with age. At 37-years-young with the tight, smooth, muscular body that would give due credit to a man a decade his junior, a face that gets more handsome with each birthday, and a cock that gets perpetually harder and hungrier, Troy Halston exemplifies just the kind of confident, sexy man that we would all like to grow up to be.  Of course, the reward of taking such good care of yourself is that it fosters many opportunities to find those that wish to take good care of you as well; and Lee, like Alexander and Tyler  before him, found that few things in life are as fun as tending to Troy.We start out with Lee alone on the bed. Never one to be shackled to clothing when not absolutely necessary, Lee quickly gets down to doing what we like him to do best: showing off that sexy, smooth chest, rubbing that oh-so-inviting bulge, and casting that ?I want you to fuck me? look from those deep, compelling eyes. His jeans are soon down, his cock already up, and as he lowers the back of his boxers over arguably one of the world's most perfect bubble butts, that ?I need to be filled and soon? manner was not just pretense for the camera, but an invitation in search of an R.S.V.P. With the precum of anticipation already causing the head of cock to glisten, Lee spreads wide and strokes away until he spies something across the room that just might be the ticket to the slot he is seeking to fill. Lee takes one look at the size of the of the sex toy and decides that while his eyes might be bigger than his stomach, even an ass as hungry as his was not big enough for that dildo. Fortunately for Lee, Troy picked that exact moment to make his entrance; and, fortunately for us, they let us watch what happens next.Troy raises his shirt with one hand while he strokes Lee's throbber with the other. Lee lets his fingers do the walking over Troy's hard, smooth chest, over his six pack, and right to the zipper to get immediate access to Troy's cock, which was rock-hard and ready for action. Lee quickly gives that cock a very thorough taste test and keeps Troy's cock in his mouth as they together move over to the chair to continue the oral examination as Troy's finger snakes its way down Lee's back to the awaiting hole. One teasing finger on his ass lips was all it took to move the guys to bed where, almost immediately, Troy's cock is buried to the hilt inside Lee's ass in a body cavity search-and-rescue mission that they both hope will not end anytime soon. Lee is arching his back and pressing back to meet every one of Troy's thrusts, working Troy's cock in as deep as possible. Troy must have found Lee's magic button, as Lee's cock is rock hard and leaking totally hands-free. With but three or four strokes, he fires off a massive load that is soon joined by a white monsoon of Troy's in a puddle of combined sperm that makes for one tasty, and deep, gene pool!",
  "models": [
    {
      "name": "Lee Covington",
      "person_id": 27836
    },
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2007-05-31",
  "scene_id": 53741,
  "series": "Forget Me Not",
  "tags": [],
  "title": "Forget Me Not, Scene #01"
}