{
  "collections": [
    "Men Over 30"
  ],
  "description": "It is not just the preppy button-down shirt, dimpled chin and messed up spiky hair that makes it so easy to picture thirty-year-old Donovan a decade earlier as a beer-guzzling, skirt-chasing frat rat gone wild. This cocky Casanova still has the demeanor of a college guy who hit the x-rated book store much more often than the library, and is just as ready to hump anything that moves as he ever was. The phrase ?if it feels good, do it? might not have been coined by Donovan, but it surely is personified by him. We learn in short order one thing that feels good to him is riding his own finger, whether he is jacking off or eating pussy, and he also knows what it is like to be on the receiving end of something decidedly bigger than one of his own digits. Both as a top and as a bottom, Donovan is no stranger to all-male backdoor action either, though it is the eight thick inches he has in front that he loves best. And, in short order, as soon as we see that thick throbber, we immediately understand why.Licking his lips and rubbing his crotch, Donovan begins an impromptu rendition of ?Sexual Animal House? by getting rid of his shirt, peeling off his grey wifebeater, and revealing a hair-covered chest that is just as manly as that grin is boyish. As Donovan rubs the nips in the center of that furry manscape, it is clear that as much as he loves that big fat dick of his during his daily stroke sessions, he does not just masturbate with his cock, but uses his whole body as a pleasure extension to the magic wand in his pants. A loud moan escapes his lips as he opens his jeans and that packed bulge in his shorts escapes out of the fly. As he turns around and his jeans slide down his strong, meaty legs, the dark ink of a tat in the center is a life-sized drawing of the back bone underneath. But when he turns around, it's his fully exposed man-bone that steals the focus, leaving an image just as indelible.His moans are deep and loud as we follow the dark trail of hair over his pecs, across his stomach, and to that lush chestnut-colored garden atop that tree trunk of a hard cock below.  Rock hard, tender pink, crisscrossed with veins, and sporting a flaring helmet head, his cock rises out from his body like an obelisk of masculinity that is clearly the center of that man's universe. His fingers more than once explore the tender flesh of his hole, but he moans the loudest when he rubs his cock head against those hungry ass lips. That is his magic button as the brief sensation alone pushes him over the edge. Grabbing his balls with one hand and his shaft with the other, he fires off a deliciously thick load onto his stomach. Like the college kid trapped in a man's body that he is, our Sexual Peter Pan rubs the jizz into his hairy stomach, proving you can take the guy out of the frat house, but you can't take all of the frat house out of the guy.",
  "models": [
    {
      "name": "Donovan",
      "person_id": 27853
    }
  ],
  "release_date": "2007-06-21",
  "scene_id": 53748,
  "tags": [],
  "title": "Cumming To Terms, Scene #02"
}