{
  "collections": [
    "Men Over 30"
  ],
  "description": "Miguel embodies many of the lessons we have learned about the models for MenOver30.com; they can come from anywhere on the globe, speak almost any language, and have appetites that run from uber-straight, strictly gay, and sometimes in between. With his dark hair, hairy chest, olive skin, expansive muscles, seductive accent and, oh yes, seven fat inches of uncut cock, Miguel grabbed your attention from his first appearance.  Miguel first came to our attention as a referral from another Brazilian stud who has graced our pages, Diego. Miguel and Diego are workout buddies from their gym and together boast of their divide-and-conquer strategy on the ladies of South Beach. The rules must be different before sunset, as this afternoon we have both of them in the studio; and, while there are no ladies around, that does not stop Diego and Miguel from playing a game of hide-and-seek with each other's very ready-to-party cocks. It has actually been almost two years since we first met Miguel, and time has treated him well-he is more built, leaner and even more anxious to strut to his stuff.That smile on his face reads like a young man in a candy shop. When anyone is this happy to be back in front of the camera, we know we are in for a great show, and this time that proved to be an understatement. Removing his shirt ceremoniously, like unveiling a statue that has spent years under a sculptor's chisel, the dark swirls of hair since in the middle of a chest that is more pumped than before and over a set of rock hard, fat free abs. As his jeans slide down those solid thighs, Miguel digs into his briefs and gives his cock the attention it is demanding. He does not have to reach down too far. That bad boy was almost at full-mast from the time he walked in the door, and with just a few tugs, that cock is granite hard and ready to go. As he slides his briefs down over his cheeks, which have been likewise transformed by his time in the gym into a pair of muscled orbs that have never looked so good, he even bends forward and shows off something he has never given any air time to: that dark furry hole in the center. When he turns around, all seven inches spring out from his body like a steel pole that was more than ready to fly the flag.Standing on the bed, those massive arms rippling as he furiously works his shaft, he looks like a Greek statute that has finally been granted the gift of movement and set about making up for the lost time away from the art of self pleasure. His heavy hanging balls dance in their sack as his two-fisted grip pulls back the skin to reveal a swollen, pink knob, already glistening in anticipation under a cloud of thick, dark pubes. The shaft, etched with veins, has never seemed so long, so thick and so hard, completing the image of almost perfect masculinity with an enamel of testosterone that grabs your own cock and renders you powerless to do anything but stroke along, hoping you can prolong your own climax to coincide with his and match that thick puddle of sperm on his abs with a deep pool of your own.",
  "models": [
    {
      "name": "Miguel",
      "person_id": 27783
    }
  ],
  "release_date": "2007-06-07",
  "scene_id": 53743,
  "series": "Fallen Angel",
  "tags": [],
  "title": "Fallen Angel"
}