{
  "collections": [
    "Men Over 30"
  ],
  "description": "Laird says he needs to jack off at least twice a day because of his Italian hormones, and while he does find fault with his family tree for the disappearing act of his hair, he is grateful for the gene pool that has bestowed him with a thick, 8-inch cock that is hard and ready for action as a man one third his age. What he lacks on his head in terms of hair, he definitely makes up for on his chest. Laird is the proud possessor of one of the thickest, sexiest carpets of fur we have ever seen, all the more beckoning because despite how hirsute he is, his body is so well taken care of, his fine muscular form is clearly visible even under a hair blanket this lush. Between Laird's buff body and chrome dome, he might bear a resemblance to Mr. Clean, but make no mistake, Laird looks even better when he starts being ?Mr. Down and Dirty.?Laird is golden brown from the sun, and his arms are bulging out of his tank top to keep that tent in his shorts company. In one smooth move, he lowers the waistband until the spread of his dark bush comes into view. We can tell just by the peek of tender pink flesh at the base of his cock that is visible almost from the start, he was not exaggerating when it came to his claims of packing a party-sized piece. He quickly removes the rest of clothes, that hairy, carved torso in full view, as well as his cock which is hanging down a good six inches soft. Maybe it's the supreme control he exerts over every inch of his body, or perhaps the dusting of grey in the center of his chest. Or maybe it is simply the confidence that only experience can produce. But even naked, Laird reeks of the ?professional, accomplished? man you see during the day in the executive club at the airport, or having a power lunch at a five-star eatery and you finally have him at night just the way you want him: naked, hard, hung and ready to deliver exactly what you need.Laird works himself, and us, into a frenzy until the precum is pouring in a steady stream that trails on the floor as he moves to the couch and begins stroking what has now become a two-fisted rocket on the launch pad, ready for countdown. As he turns around, showing off that hairy hole, we can see his sack has begun to make its migration upwards while his cock continues to expand in both width and length. His abs tightly curled, his breathing heavy, he concentrates on the task at hand and soon that hand, and a good portion of his forearm for that matter, is covered with a heavy does of sperm.",
  "models": [
    {
      "name": "Laird",
      "person_id": 27854
    }
  ],
  "release_date": "2007-05-24",
  "scene_id": 53740,
  "series": "Daddy Dearest",
  "tags": [],
  "title": "Daddy Dearest, Scene #02"
}