{
  "collections": [
    "Men Over 30"
  ],
  "description": "We began MenOver30.com to showcase those extraordinary specimens of men who get not just better with time, but so much sexier as well.  Like a vintage wine, these men need to be savored and cherished as well as tasted. Today marks the 139th installment in our weekly quest to share the glory with one of the early favorites. In fact, Jesse was one of our original dozen that we opened the site with. The only thing that has changed physically is that the hair on his head is a little shorter, but that luxurious mane of fur that covers everything from his neck on down still begs for your touch as the thick, eight-inch pole longs for your tongue. ?Bisexuality sure has opened my eyes,? Jesse shared with us, revealing that the biggest change he has undergone is a sexual renaissance that has made his thirties his hottest years yet.While he surely has augmented his sexual resume in some surprising ways over the past couple of years, Jesse's anticipation of being back in front of the camera reached a level of downright joy. As he sheds his shirt, opens his belt, pulls down his jeans, and immediately starts playing with the lump in his shorts, he causes the waistband to ride low and expose a dark thick forest of hair in a display that makes us want to yank down his boxers with our teeth. There are few things as sexy as a body with a midsection so lean, the cuts of his abs can be seen even through a dense layer of fur - but that is exactly the view Jesse offers. We pan down the furry terrain of his body, and then he flings off those shorts, spreads his legs wide, and presents an invitation to return to the paradise that we have waited two years to accept.With but 165 pounds on his six foot frame, we are sure two-thirds of his weight must be in hair and the final third is in that heavy, hungry cock that now seems like the center of his universe.  His balls are impossibly tight, you can feel the pressure in his sack just by looking at it. But Jesse is as determined to milk every moment back under the camera as we know he soon will be to milk out every drop of sperm boiling in that bloated sack. Looking over those fur-covered cheeks, it is difficult to hold back the urge to dive into the now open for business backside. But as he turns around, it seems like his cock has grown a full inch - and we know holding back is something Jesse will be powerless to do much longer. With a load that explodes all over his abs and continues to drizzle out and soak his hands for a good bit after the first blast, Jesse once again reminds us just how sexy a man over thirty truly is.",
  "models": [
    {
      "name": "Jessie Rivero",
      "person_id": 27763
    }
  ],
  "release_date": "2007-07-19",
  "scene_id": 53755,
  "series": "Short Notice",
  "tags": [],
  "title": "Short Notice, Scene #01"
}