{
  "collections": [
    "Men Over 30"
  ],
  "description": "With biceps that stretch the sleeves of his shirt, a cock that that spills out of the pouch of his briefs, and charm that just drips out of every pore, it is no wonder Charlie, who has lived and broken hearts all over the world, became an instant favorite right here on MenOver30.com from the time he first appeared. As gentle as he is imposing and as smart as he is sexy, Charlie also shares his exhibitionist streak, as we saw when he bent over and opened his perfect ass cheeks while working that dripping cock during his second shoot with such joy and generosity that it seemed positively liberating for him. Seeing that sculpted six-pack, the etched legs, the wide shoulders and massive arms, it is clear that Charlie spends a lot of time at the gym. And we could only imagine what he looks like in the shower after a work out?until today. ?I heard you want to see me wet,? Charlie says with a laugh. He heard right. We knew that the reality of seeing the cool water drenching that perfect body would look hot, but we had no idea that filming him doing so would make him so hot, he ends up shooting a load that easily had more juice than both of his considerable loads in his first two appearances here combined.Unwrapping the package is half the fun, and the anticipation is especially torturous when the package, both in total and that uncut beauty between his legs, is as hot as Charlie's. He quickly tosses aside his shirt and offers up a display on just the kind of perfectly worked, V-shaped body that fills a wife-beater out like it never has before. His abs, even more etched than before, soon come into view. And with a crack of his belt as he removes his jeans, the packed pouch of his underwear also gets the air time it demands. After teasing us with the glorious curves of one of the world's most edible asses, we follow those buns as he walks to the bathroom. As the water comes down, his dick comes up, and Charlie is soon playing peek-a-boo, skinning back the shaft so his already swollen cock head makes its much anticipated return visit. Moving to have a seat on the throne, his cock snaps back loudly on his flat belly and he pulls it forward a few times before smacking it into his open palm, giving the sexual crackle bouncing off the tiles in the room an audible authenticity that reverberates right down to our balls. Even in the soft glow of the candles, the change of scenery brings Charlie's natural showmanship to an erotic zenith that we have never seen before. The lens clings to his ass cheeks as he marches back into the bedroom and stands on top of the ottoman like a general about to send his troops into war. In reality, of course, the only battle being waged is a war within to hold back his load as long as possible. But when it finally surrenders, he fires off eight rounds of jizz that cover the top of the table with still enough left over to drip down and leave a heavy white trail all over his fingers. We wanted to see him wet, and this is one time when the reality lived up to our wet dreams?and then some.",
  "models": [
    {
      "name": "Charlie Xavier",
      "person_id": 27898
    }
  ],
  "release_date": "2007-07-26",
  "scene_id": 53758,
  "series": "The Milk Run",
  "tags": [],
  "title": "The Milk Run, Scene #02"
}