{
  "collections": [
    "Men Over 30"
  ],
  "description": "Buzz cut hair, a close-cropped goatee, stove pipe jeans and thick leather boots, Duke Rivers looks every inch the classic Dad. But this one-of-a-kind serving of seasoned beef is unabashedly original and as comfortable in his well-honed skin as you are just looking at it. The nipples on his well-honed pecs peek out of the armhole of this tank top like headlights that could illuminate the darkest night. And that bulge in his pants acts like a beacon of exactly what is on his mind. The initial veneer of gentility vanishes before your eyes as a level of sheer sexuality erupts from every pore. Though he may be called ?Duke,? with a family tree of lovers that could repopulate the Amazonian rain forest, Duke is actually the reigning king of free gay love, endowed with just the right royal scepter that makes him uniquely qualified for the position.A rivulet of dark hair in the valley at the center of his expansive pecs acts like a crown over a towering set of lean abs and is framed by a set of arms last seen on Popeye. Prying his hand inside his jeans to move that cock into a position where it will not be strangulated by fabric threatening to burst at the seams, Duke gives his nips a tug before turning and revealing his flaring lats that taper into a trim, narrow waist. Below that, a seemingly hungry manhole that responds to his slaps by sending lightning bolts to his crown jewels on the flip side. Laying back on the bed, his armor shed and the pouch of his jock stretched like a cod piece, Duke unleashes the beast: a rock-hard, ringed dick staff ready for the battle royal.Bloated crimson in its black leash, Duke works his cock like a captain's wheel that is navigating the rest of his body along on an epic sexual odyssey for the first time, even though we know this is one monarch that reigns over every inch of territory with a well practiced iron fist. The loud slaps of his cock against his abs are soon drowned out by the moans he produces as his fingers find the center hole. That puckered realm proves to be the real gates to Duke's kingdom as he grabs both the lube and an oversized sex toy that, until now, had been strictly decorative. Planting it on the chair, Duke's ass welcomes the dildo with a reception befitting the return of a conquering hero that will never be allowed to leave again. With a vise-like grip from his cheeks, the plug in his ass simultaneously uncorks the sperm tap in the front as Duke exiles a load of sperm that shoots past the lens and knighted the camera man by coming in for a landing on his shoulder.",
  "models": [
    {
      "name": "Duke Rivers",
      "person_id": 27932
    }
  ],
  "release_date": "2007-07-12",
  "scene_id": 53754,
  "series": "The Big Fix",
  "tags": [],
  "title": "The Big Fix, Scene #02"
}