{
  "collections": [
    "Men Over 30"
  ],
  "description": "July 4th celebrates our independence from the motherland, but we are doing things a little differently here at MenOver30.com this year. We are utilizing international relations - namely, a trio of big-cocked, uber-muscled and ultra-handsome Brazilian beauties: Miguel, Diego and Magnus. To ensure you will get to observe the day by granting independence to a mother load of sperm, we are serving up a pool side spread of massive muscles and almost two feet of some of the thickest, hardest and juiciest dick steaks we have ever seen. When Miguel returned after a year honing his body to perfection a few weeks ago, it was not a surprise to learn that Diego's canvas of the masculine ideal had been undergoing some homo improvements of their own, since they are after all buddies from the gym. We also knew, from one of the steamiest afternoons ever in the studio, they sometimes have sweated together in the bedroom. The tallest and most hung of them all, Magnus, with nine uncut inches that never fail to inspire, also caused Miguel to perspire when Magnus and Miguel redefined what a post work out rub down is  on our brother site, ExtraBigDicks.com. While individually and together, Miguel, Diego and Magnus have enjoyed themselves and each other, they have never been naked, hard and ready for action all together...until today!Their bathing suits clinging like second skin as they stand together in the sun, the rays gleam off the symmetrical perfection of Diego's body, stream down on Miguel's hair-covered masculine attributes, and finally shower down on Magnus' vascular tower of meaty flesh. Starting with a race to see who is king of the pool, as they leave the water to dry off after, it is clearly the hugely-hung Magnus who is King Dong as their bathing suits get smaller as their dicks get bigger. Seems when you are a Brazilian and packing the kind of oversized, thick meat like these guys are, you are immune to any shrinkage affecting most mere-mortal males. Magnus ascends onto the massage table like a king taking the throne and the only speed eclipsed by that of his trunks going down is the rate at which dicks goes right up into Miguel's thick lips. Miguel and Diego are used to sharing big heavy things, and Magnus' dick is no exception. Before long, that heavy tube steak does some dental excavation on Diego before the guys, and the action, move back to the pool.Miguel is rubbing Magnus' pecs as Diego's head bobs up and down on Magnus' cock while the heavy balls float on the water right behind. Standing up, Miguel resumes the sucking duties on Magnus as he squats on the deck of the pool, allowing him the room to stroke his own equally-hard cock and Diego beats his own meat watching Magnus and Miguel go at it. Magnus soon takes the voyeur slot as Miguel and Diego turn their attention back to each other in a rotating pool side sixty-nine. The triumvirate moves one final time behind the massage table and, like a well-practiced synchronized artillery salute, they fire off their big guns one by one until three huge white loads decorate the blue towel and three faces flushed red in erotic exhaustion cap off our celebration in a patriotic display of red, white, and blue worth celebrating.",
  "models": [
    {
      "name": "Miguel",
      "person_id": 27783
    },
    {
      "name": "Magnus",
      "person_id": 27851
    },
    {
      "name": "Diego",
      "person_id": 29656
    }
  ],
  "release_date": "2007-07-05",
  "scene_id": 53751,
  "tags": [],
  "title": "3 For The Money, Scene #01"
}