{
  "collections": [
    "Men Over 30"
  ],
  "description": "Tony Dancer is 100% hair, 200% ham and 300% sexy in an explosive cocktail of masculinity of which only a fraction could be captured by the lens. ?Give me somebody to dance with, give me somebody to show? may be a catch phrase from one of the Gay White Way's longest running shows, but it also came to be the theme of the day here at MenOver30.com, where we have someone for you to dance with?and boy, does he ever put on a show. When we asked Tony what makes his rhythm section start shaking, in a heartbeat he told us ?pleasing my man in front of whomever wants to watch?and the more that watch, the more turned on I get.? Such a self-declaration of unbridled exhibitionism sets the stage for another discovery, as long as someone is watching, even pleasing himself becomes an uncensored ballet of sexual self-expression that leaps right into the camera and into your loins.His beefy arms rippling as he tips the brim of his hat and then lays down to survey the territory of his manly physique, Tony gets on his knees; and, with a wicked smile flashing from that handsome, bearded face, works his solid glutes right through his pants. Seems a slipped slap and tickle to the backside are one of his triggers, as when he stands up, the straining bulge in his jeans is gasping for air. First lifting his shirt to reveal a hairy belly and expansive chest, Tony unsnaps his jeans; and, true to form, uncovers his assets in an homage to the burlesque. First one cheek, then the other, then flashing the sprawl of ink on the small of his back before grabbing his hat, then playing peek-a-boo with his cock and then flipping over once again, then this time playing hide and seek with his hole and his finger - that is all it takes to get him ready for the real game we want to see?namely one-on-one with hard, dripping dick!Settling back on the chair, the camera comes in close to survey the luscious hair starting at his neck, traveling down the deep valley between his pecs, over his belly, and down into the thick bush. The forest of fur over his cock forms a perfect outline of wings, and beneath it, his cock is rock hard and ready to take flight. Tapering from a thick base into a spear-shaped tower of delight, Tony works his pecs and dick at the same time. Then, turning around, he does double-duty once again, showing off that prime hole and drizzling dick. On his back, his eyes closed in pleasure, his toes curled in anticipation, the final act of his primal mating dance is splattering a massive load all over his stomach. Despite that ?Swan Lake? puddled on his belly, Tony's dick stays at full mast, ready for someone new to dance with.",
  "models": [
    {
      "name": "Tony Dancer",
      "person_id": 27852
    }
  ],
  "release_date": "2007-06-28",
  "scene_id": 53750,
  "tags": [],
  "title": "One Way Ticket, Scene #02"
}