{
  "collections": [
    "Men Over 30"
  ],
  "description": "?Everything old is new again? has sort of been a summertime theme here at MenOver30.com. And it goes without saying that we do not consider 30 anything but the beginning of the time where men are their sexiest, horniest, and definitely in their prime. Scott personifies all of that and more. Scott Tanner  is a smoldering blond stunner with a rock-solid body covered in a dusting of golden fur, a face that magazine covers are made of, and an always-hard, extra-thick, eight-inch slab of dick that is in the running for the world's most perfectly formed penis. Though relatively new to our stud farm, Scott has become a huge favorite already, and today is joined by one of the ?original dirty dozen? featured in our opening line up when the site initially launched a couple of years ago; Chad. Chad is a tall, handsome, hard-bodied & perpetually-horny drink of water with a heaping helping of Southern charm that he works into a seduction machine that is as powerful as it is instant. Scott is thirty-one, Chad is forty-one, and from the moment these studs set eyes on each other, the attraction was so magnetic that the only number that mattered was that they were clearly the right one for each other.Their lips meet as if it is a kiss they have been holding back for as long as possible and cannot quell their urges for even one more second. The shirts go flying, pants go down, the underwear is tossed, and as for their dicks, those have been hard from the instant they met. Pretty soon, both those rock hard throbbers are buried down each other throats. Nothing turns Scott on like sucking on a pretty piece of meat, and cocks do not get much prettier than Chad's long, straight, thick and meaty slab. Scott's cock responds by getting hard as steel and soon finds its way into Chad's lucky mouth as Scott's fingers find their way into a new target: Chad's very smooth, very tight, and very hungry hole. Pulling his knees up to his chest, Chad makes sure that his fingers are soon replaced by Scott's tongue before turning the tables and giving Scott the ass eating of his life. Scott and Chad definitely understand how ?give and take\\' turns ordinary sex into an art form, and with a masterpiece of a butt like Chad's and a world-class cock like Scott's, Chad is as ready to give up his ass as Scott is ready to take it.From the moment Scott begins his anal assault, Chad's cock fills with blood and stays rock hard for the duration. With long, slow, masterful strokes, Scott fills Chad's ass until Chad could feel the warmth from Scott's balls, then slowly pulling back until just the tip is still buried, he makes Chad's hole begged to be filled again. Moving to the floor, the rhythm is now so perfectly in sync, Chad pushes back and Scott pushes forward like a well-practiced fuck machine set to the maximum pleasure setting. With Chad standing on the mattress and Scott climbing on and re-entering from behind, the noise of the head board banging against the wall sounds like rapid gunfire. The real battle is to see just how long Scott can keep it up before needing to surrender the pressure in his balls. The pressure of that perfect pounding causes Chad to go first, and he unloads a huge nut all over his abs as Scott pulls out, aims his cock right at that white mess, and adds a massive load of his own that continues to ooze out of his dick until even after the camera stops rolling. When the chemistry is this hot, the sex never gets old, does it guys? See you next week.",
  "models": [
    {
      "name": "Chad",
      "person_id": 29924
    },
    {
      "name": "Scott Tanner",
      "person_id": 27871
    }
  ],
  "release_date": "2007-08-02",
  "scene_id": 53760,
  "series": "Man On The Inside",
  "tags": [],
  "title": "Man On The Inside, Scene #02"
}