{
  "collections": [
    "Men Over 30"
  ],
  "description": "Puberty is a generally the engine that brings a boy to manhood. And when some men reach their 30's, they can embark on another journey into the primetime of their lives that can last indefinitely. Jesus is one of those very men. Jesus' own sexual renaissance did not begin until after his conventional marriage had ended when he was in his late 20's. We first met Jesus two years ago, and his artistic sensibility combined with his cunning command of his Cubano-infused sexuality immediately set some hearts aflutter and everyone's cock stirring with that strikingly handsome face, hunky body, and heavy, uncut club of a dick. The sprawling ink on his arm, which was just an outline last time, has been filled in until it now resembles his cock: thick and heavy!Jesus has come to the studio directly from his day job. And as handsome as he looks in his tie and jacket, it is his birthday suit that we want to see again. From the lump in his pants, we know that wish will be granted sooner rather than later. There is just something about a man when he is feeling exceptionally randy: from the tent in his trousers and the look in his eye, to the way his long tongue kept darting out of his mouth, Jesus is way past being horny on his way to being in heat. Popping his shirt open, he begins pulling on his nips, then rips out his belt. Under his conservative tan pants proves to be another clue of just how hot Jesus is feeling: there is nothing between Jesus and our lens but a cock ring and a bloated ball sack. Giving us a view from behind before settling down to work his nips again, he plays a quick game of hole-in-one with his hole and then sets his sights on the same thing we are staring at: that drooling, uncut seven inches that looks ready to do battle.Before going back to furiously yanking on his cock, Jesus yanks off his tie which seems to complete a sexual metamorphosis from a working stiff into a sexual animal with a primal need for release that cannot be silenced for one nanosecond longer. Jesus pounces on his stomach down on the mattress, jacking from the front while using the air to tickle his hole from the back. Rolling over one last time, his hands work his entire body in an essay of self-exploration that extracts the maximum amount of pleasure that his body is capable of producing. As for how much sperm a man is capable of producing, the load that Jesus squeezes from those balls shoots well up over the top of the lens at first, then continues to drain all over the bed and the floor like an orphaned fire hose spiraling out of control.  We are not sure what revved up Jesus' engine this morning, but we sure approve of the way he has decorated the Winner's Circle.",
  "models": [
    {
      "name": "Jesus",
      "person_id": 27787
    }
  ],
  "release_date": "2007-08-16",
  "scene_id": 53763,
  "series": "Dirty Business",
  "tags": [],
  "title": "Dirty Business, Scene #01"
}