{
  "collections": [
    "Men Over 30"
  ],
  "description": "Green Eyes has just turned thirty, is built like he is twenty, and from the size of the load he shoots, he must have hormones to match. Puerto Rican-born Green Eyes has a solid body that is naturally muscled, naturally smooth, and far sexier than he seemingly has any knowledge of at all. Green Eyes is that classic Latin man of few words, but since he waited three decades to drop trou on camera, we know that the term ?actions scream louder than words? is about to take on a whole new meaning. Though he has been with his girlfriend for going on five years now, he reveals his ultimate fantasy is a no-holes-barred three-way with a couple where he gets head from the man while the lady taps the sucker's ass with a strap on. Though hearing what bones up Green Eyes will leave you blue-balled, what he does next will make sure that the sexual pressure is soon relieved for all parties concerned.The irony of a having an actual cock on his shirt sets just the right tone as soon as that shirt is off and the cock in his pants is soon to follow. There is a look of toughness in his eyes that says ?yeah, I am doing it...so what,? which is his sexually-brooding way of covering up those last minute jitters of wondering if something he has dreamt about doing for so long will live up to the fantasy he has played out in his head a million times before. A little bit East L.A., combined with a touch of prison yard giving him a dangerous edge, Green Eyes is like the guy you are scared of if you met him in a dark alley, but at the same time you know he is just the kind of man you want to man-handle you in a dark bedroom. But as he takes off his shorts, pulls the waistband of his boxers down over his butt, and gives that creamy-white cheek a loud, defiant slap, we begin to wonder if ?handling? for Mr. Green Eyes might be a bit more bi-directional that he has led us to believe. As for his handle in the front, that is definitely responding to rear stimulation as well and is about to take center stage.His cock is sticking out between his legs, and he is grinding away on the mattress. Those white globes of his ass, in sharp contrast to the deep tan of his back, are undulating like both the machinery of pleasure, as well as a long-ignored target for future, secretly-desired maneuvers. The look on his face as he presses back and forth with such need and passion is as much ?I'm gonna fuck you 'till you can't walk? as it is a plea to do the same thing to him. With the briefest rub of his hole from his fingertips, his cock is rock hard and beginning to drip. In fact, the more he touches his ass, the more turned on his gets. And when he his jacking with one hand and showing his hole with the other, that soon opens up the flood gates. Quickly laying on his back, every muscle from head to toe seems flexed to help his balls in carrying out their mission to empty their cargo. And that is exactly what happens next, all over his stomach, the blanket underneath him and on the top of the bed beside him.",
  "models": [
    {
      "name": "Green Eyes",
      "person_id": 27865
    }
  ],
  "release_date": "2007-08-09",
  "scene_id": 53761,
  "tags": [],
  "title": "For My Debt, Scene #01"
}