{
  "collections": [
    "Men Over 30"
  ],
  "description": "Carter was a grunge band singer and guitar player in the 90's and a decade later, with his scraggly mop of blonde hair, smooth, tight body and a thick, 7.5? cut cock that still resonates as the center of his universe, he still looks a decade younger than his 36 years. Everyone lusts after the boys in the band, and we have no doubt that Carter overindulged in the delights of his female groupies like a starving man at a buffet. However, recently he has acquired a taste for beef as well as fish. ?We were on the dance floor last weekend,? he told us. ?Couple of girls, another guy ? and we all wound up naked in someone's backyard having sex on a picnic table under the rain.?  As much as Carter still loves to share his music in front of a live audience, there is one instrument he has yet to play in public: his cock. Strutting his stuff on camera has always been a private fantasy for our man Carter, and today that becomes a reality.Carter can barely let go of the bulge in the jeans long enough to raise his shirt and show off that marble-smooth, tanned and toned chest before his hand is pulled back into his pants as if his cock is radiating some sort of sexual tractor beam that he has been able to resist. His sandy-hued beard stubble is the same color as the first trace of his pubes we see as they peer over the waistband of his boxers?not often that you see a man in his mid-thirties who is a natural blonde, but Carter is definitely a bloke walking to the beat of his own drum. Carter says the favorite part of his body is his dick and, from that massive outline it makes inside his white shorts, we cannot wait for that headliner to take the stage. Pulling the hem on the leg of his shorts up inch by inch, first a downright massive set of smooth balls appear like the warm-up act, soon to be followed by a fat slab of man meat that looks both hungry and delicious. Turning to the side to step out of his shorts, Carter's cock is pointing directly at the ceiling and swollen to a diameter that rivals a bassoon. As he falls back and spreads his legs wide, the symphony of skin continues to unfold as precum starts to drip from one head as a chorus of low moans escape from the other. Standing up and bending over, his meat sways heavy between his thighs and as he spreads his legs wider, we even get a close-up of the orchestra pit in the center. Moving to the couch, he fists that throbbing baton so furiously it is a rapid blur of kinetic flesh, until he hits the crescendo and a few splats of heavy cream then hit his abs.",
  "models": [
    {
      "name": "Carter",
      "person_id": 27935
    }
  ],
  "release_date": "2007-09-06",
  "scene_id": 53769,
  "series": "One More Lap",
  "tags": [],
  "title": "One More Lap, Scene #01"
}