{
  "collections": [
    "Men Over 30"
  ],
  "description": "Blonde, handsome, hard bodied, and possessing one of the most beautiful cocks on the planet, Scott Tanner is one of those rare specimens of man that redefines masculinity in its prime, and he personifies what the cornerstone of MenOver30.com is all about. When Scott was worshipped by 21 year old M.J. and later reverently serviced by Chad, that served as the ultimate visual that the appeal of Scott's charm, the desire for the pleasure of his ringed, thick, always stiff dick can bring, is as universal as it is impossible to deny. While the lust and longing for Scott is well established fact, we always wondered what kind of man Scott would long for: and today, we have the answer: Damien Rios. In contrast to Scott's All-American good looks, Damien is the dark haired, dark eyed Latin stunner with perfect ass & flawless body who has one more thing we all want: Scott's ring on his finger. Just shy of six months together, making their first appearance together as a ?couple,? Scott and Damien share the lust and passion for each other in one of the most sizzling displays of lust and passion ever captured on film.As their lips meet, it seems to unlock an alchemist's blend of unfolding passion and unbridled lust in a fusion of desire that is both breathtaking and inspiring. Scott removes Damien's shirt, revealing the angel wings inked on his back, which run from his neck to his waist, before Damien gets down to the heavenly business of sucking Scott's cock right down to the base. Scott's silver ring can barely encircle his over filled balls and the base of his cock that has never looked as long and thick before. Damien licks every inch of that throbbing shaft with all of the hunger of a first time mixed with the mastery of lust-fueled familiarity. Moving behind Damien, Scott works his tongue deep into the center of Damien's ass as Damien's eyes roll back in his head in a tidal wave of pleasure. Standing up and spreading his cheeks wider, Damien pushes his hole back on Scott's probing mouth, getting the glistening opening prepared for the ultimate expression of complete fulfillment soon to follow.With a slow, well practiced motion that delivers the ultimate pleasure with each successive inch, Scott fills Damien's awaiting hole with deliberate, deep strokes that cause Damien's own cock to respond immediately by leaking a steady stream that ultimately puddles on the floor before them. As they move to the chair, both of their sacks are tight and straining as Damien lowers his hole on Scott's cock, pressing down as Scott thrusts forward. Sliding down to the floor, Damien's mouth is filled with Scott's tongue while his ass is filled with Scott's cock. With their hips moving in unison, like the pistons on a finely tuned engine, Damien's hole vacuums a huge load from Scott's cock. Scott visibly trembles as he covers Damien's cock with a massive load of sperm which is soon joined by an equally impressive white avalanche from Damien himself. For anyone who has ever wondered what the difference is between plain sex and making love, gentlemen, you have just seen it. We are not sure how they will be spending their one year anniversary, but we are doing our best to make sure we are along for the ride.",
  "models": [
    {
      "name": "Damien Rios",
      "person_id": 27934
    },
    {
      "name": "Scott Tanner",
      "person_id": 27871
    }
  ],
  "release_date": "2007-08-30",
  "scene_id": 53768,
  "series": "Friends & Lovers",
  "tags": [],
  "title": "Friends & Lovers, Scene #02"
}