{
  "collections": [
    "Men Over 30"
  ],
  "description": "Many straight guys insightfully look back on their time on the gridiron in high school as their glory days, and for most, they never looked that good again. Then there are those very rare exceptions when the dozen years that follow witness the progression of a young, athletic physique into a powerful, muscle-packed, disciplined body of the masculine ideal. Shay is one of those exceptions, and he makes for an exceptional day today at MenOver30.com. He still has the face of the campus golden boy, but he has packed 195 pounds of pure muscle on his 5'7? frame. And from the hurry he is in to get out of his clothes, the only thing he likes better than working on his body is showing it off. As you will soon see, he is very, very good at both things indeed. ?The more people that watch, the more turned on I get? Shay tells us. When we tell him we have a male audience, he does not miss a beat, but rather, cannot wait to start beating it. ?It might have freaked me out 10 years ago, but now I take it for what it is, a major compliment.? Less than a minute later, his pants are down and his cock is in the same state as ours: rock hard.His big guns flared out, stretching the sleeves of his shirt to the breaking point. Shay just stands there, letting the camera drink in every inch of that perfect flesh before moving to the bench, lowering his shorts in back, and showing off a set of glutes that are just as round, just as tight, and just as meaty as the rest of him. Having a seat, he grabs a fistful of lube and soon has a fistful of dick, spreading wide enough to show off that hole in a display of confidence that is both brooding and inviting at the same time. Standing on top of the bench, the sheer expanse of the breadth of his shoulders in contrast to the narrowness of his waist draws your attention again to what a remarkable specimen of man he his. As he rests his weight against one hand resting on the wall, it is like we are voyeurs in the locker room, catching the All-Star sneaking in a quick stroke when he thinks he has the showers to himself. As Shay slowly turns around, he makes his cock, rock-hard and pointing hands-free at the ceiling, dance back and forth as he focuses right into the camera with a look that says ?you ain't seen nothin' yet.? With ink flanking both of his shoulders, those tats undulate in his tanned skin as Shay tucks both of his arms behind his back, flexing those biceps, and letting his cock drip a steady stream of pre that leaves puddles all over the studio.  Standing on the bed, his cock is once again jutting straight out. And by the way it is continuing to leak, it is like he is jacking it off from the inside, using not his hand but his thoughts. For us, standing here seeing this hunk of a man, this is a skill we can only wish we were as adept at. But the ?look ma, no hands!? act is cancelled, and as he pulls his fingertip away from the head, he makes the longest cum string we have ever seen. Lying back on the bed, his nuts have all but totally disappeared into his body. As he lifts his hips up, he moves his hand down in a perfect sequence of motion that elevates fist fucking into an art form and soon produces a heavy white load that slides down his abs and comes in for a landing in the end zone of his brown bush.",
  "models": [
    {
      "name": "Shay",
      "person_id": 27860
    }
  ],
  "release_date": "2007-08-23",
  "scene_id": 53765,
  "series": "Boner's Keeper",
  "tags": [],
  "title": "Boner's Keeper, Scene #01"
}