{
  "collections": [
    "Men Over 30"
  ],
  "description": "In his native Spanish, Green Eyes' name is ?ojos verdes,? but from the first time we see him, with his brooding demeanor tinged with just a touch of danger, and his solid, naturally-smooth body, it is clear that in any language, the man is just plain caliente. Closing in on almost a handful of years with his girlfriend has not closed his mind?he shares that his biggest fantasy is to have a three-way with a heterosexual couple, with a twist: he wants to get head from the guy while that guy is being fucked by a strap on. To make the latter a reality is for him to do on his own, but as far as getting a blow job from a man?well, that we can make happen. And we know the perfect accomplice, Trey. We had just filmed Trey's audition yesterday and thought that since he's farther along in his journey of exploration of both sides of the sexual buffet table than Green Eyes, Trey would be just the kind of masculine ?hetero-flexible? partner that would be perfect to coax Green Eyes to take his first step out of the closet by getting his cock into another man's mouth. Whoever said ?watch out for the first step?it's a doozy? must have known what was going to happen next.Trey gets Green Eyes out of shirt and quickly gets his hand on the bulge in Green Eyes' pants. The mound in the middle is visibly throbbing under Trey's skilled fingers, who only stops rubbing that meat long enough to remove his own shirt, making history of Green Eyes' pants and moving his mouth down to Green Eyes' briefs for a taste test of things yet to cum. Like the dust cloud in a cartoon where the action happens so fast that you see nothing but a blur, they are both soon naked, and Green Eyes cock finds a new home in Trey's mouth. Trey may have been holding out on us?the way he sucks that cock, he is far from an amateur at the cock-sucking event during this man-to-man rodeo. Just by watching him, you can almost feel the joy of every nuanced lick as if he is sucking your dick. The result of his talents are far from lost on our friend Green Eyes who, when he can actually take a break from the unbridled sensations to open his eyes, has an incredulous look on his face that says, ?I can't fucking believe how good this feels,? mixed with, ?why the hell did I wait so long to try this!? Trey is not just full of Green Eyes' cock, he is also full of surprises. What he does next, well, we still cannot believe Green Eyes let him get away with it.Trey rolls Green Eyes onto his stomach, spreads open those perfectly round, arctic white ass cheeks and commences with an oral excavation of Green Eyes' hole that has Green Eyes grasping the cheeks to push his ass back further while uttering the moans that can only be heard that very instant when a man discovers that his hole is not strictly decorative after all. When Trey finally comes up for air, we look down to see his cock has come to life as well. And what a beauty it is too: eight inches of thick, white, throbbing meat. Laying back and stroking side by side, they both get on their knees on either side of a leather pillow, facing each other, and race to the finish. They cross the line within a few seconds of each other, and by the time they are done, that formerly solid black cushion is now sporting a zebra pattern made from thick ropes of white.",
  "models": [
    {
      "name": "Green Eyes",
      "person_id": 27865
    },
    {
      "name": "Trey",
      "person_id": 29288
    }
  ],
  "release_date": "2007-09-27",
  "scene_id": 53774,
  "tags": [],
  "title": "First Time For Now, Scene #02"
}