{
  "collections": [
    "Men Over 30"
  ],
  "description": "Dark blonde hair, close-cropped beard, and 200 pounds of muscle packed onto his 5'11' frame, Eric York is your fantasy Viking come to life. Though he was married at one time, our lusty warrior learned he prefers salted beef to beverage wenches and has never looked back since. The 40-year-old Eric has just a touch of an accent, a smattering of ink, and confident nonchalance that makes you want to curl up in his big arms and nest there for the winter. After he saw the movie 300, Eric had a wet dream. After he saw Daniel Craig in his Speedos in the new Bond flick, he went home and rubbed off a load. And by the time we finished the interview after the shoot, Eric had already slipped back on his cock ring and was working his way up to another raging erection which brought us full circle: he walked in the room with his hand rubbing his cock too. Wearing a black V-neck that cradles that magnificent torso like a second skin, Eric immediately works the hem halfway up his chest as his finger rubs his nips, showing off a sexy, solid core covered with brown fur in the process. Grasping his cock right through his jeans, the outline is so clearly pronounced that even through the thick fabric, a blind man half a continent away could tell he is not just excited, he is throbbing hard. Giving us a solid flex, his biceps swell to the size of baseballs before he turns around, shows off more ink in the middle of his back, and then the magnificent, stark-white flesh of his glutes. His fingers disappear as he reaches between his cheeks before they are called back to nipple duty for a few more tugs. Offering one final view of one of the sexiest sites ever, a big solid hunk of a man in a pair of tight black briefs, Eric kicks them off shortly thereafter to show off something that looks ever hotter.Under a thick, manly bush the same color as the locks on his head, Eric lays back and strokes that leaking cock before getting on the couch seated with his back to us, spreading his knees out wide, and putting that glorious ass on display while reaching down and continuing to fist that meat. Between that furry crack, those muscled glutes, his round tight balls and that dripping dick, it is one of the finest rear shots ever seen on any man. Sliding his finger inside his hole, then moving that hand to his nipples in a trademark move you will want to commit to memory, Eric finally settles back, closes his eyes, clenches his teeth, and begins to fist away with an intensity of a warrior on a mission. He looks every inch like a Viking warrior caught below deck, pounding away at his cock in a desire for one last load before the next battle. And in this case, we have never been so glad to see the white flag flying. ",
  "models": [
    {
      "name": "Eric York",
      "person_id": 27864
    }
  ],
  "release_date": "2007-09-20",
  "scene_id": 53772,
  "series": "Wake Up Lover",
  "tags": [],
  "title": "Wake Up Lover"
}