{
  "collections": [
    "Men Over 30"
  ],
  "description": "Proving you do not need to light a cigarette to be smoking hot, MenOver30.com's favorite Marlboro Man, Parker Williams, shares his fine form with us again today after almost a two year absence since he first electrified our pages. Handsome, hairy, horny and hung, forty-two year old Parker exemplifies what explosive combination charisma, confidence, good looks, and a whole lot of cock can be. Just sprawled out the bed, the fur coiling out of the top of tank and a bone about to rip through his shorts, Parker does what few men can do: he almost makes us forget hot looks on the outside because of how hot he is in the inside. Fret not, gents, almost is the operative word here; the outside is where we are starting.Inspecting the lush coating of hair on his abs follicle by follicle before moving up to his chest, Parker then puts both arms behind his head, giving us a moment to absorb this view of the masculine ideal: rounded biceps, inked arms, a forest in each pit and an untrimmed magic carpet starting with his beard and heading south. His rugged face is crimson from the rays of the sun, but it is the solar flare he is grabbing in the center of his khakis that rivets our attention. Parker puts the waistband down low enough to the short and curlies of his thick bush come into view before he shucks the rest of his clothes and offers himself the way we wanted him all along: buck ass naked, throbbing hard and the need to seed on his face.A bullet of spit escapes from those handsome lips and lands squarely in the center of his shaft sticking out below.  The camera moves up and down his body, exploring every hair-covered inch of the terrain underneath before zooming on the twitching seven inches between his meaty legs. Standing up and turning around, Parker flexes his glutes, bends over, and lets his balls hang low and that cock hang lower before jumping to bed, spreading his legs wide and ratcheting up the motions to the 'uber stroker' setting.  His lips arched, his toes curled and his eyes shut tightly, his balls contract, sack preparing making its journey up, preparing to the sperm within to make their own journey. Spilling all over his fist before dripping down to his heaving abs, Parker licks his finger, then uses his tongue to clean every drop off of his fist, proving us indeed correct in our assessment: he is just as good inside as he is outside.",
  "models": [
    {
      "name": "Parker Williams",
      "person_id": 27870
    }
  ],
  "release_date": "2007-10-11",
  "scene_id": 53777,
  "series": "What You Wanted",
  "tags": [],
  "title": "What You Wanted"
}