{
  "collections": [
    "Men Over 30"
  ],
  "description": "His last name, ?Gunz? is a reference to those impressive, baseball-sized mounds of steel that, on mere mortals, are called biceps. As far as his first name?Shay?well, take away the ?a? and you may have ?shy? but fortunately, Shay does not have a shy bone in that magnificent body. Freshly in his 30's, but still talking like he is in his 20's, Shay has the seemingly endless lust for all things sexual that is as strong now as when he first lost his cherry at 13. ?I like to fuck a girl, then stand over her and have her open her mouth while I look down and see my cum splattering all over her face? is how Shay describes his ultimate way to shoot his load. This dirty blonde specimen of beefcake has elicited a steady stream of email since we first had the fortune of capturing this veteran of 150+ straight hardcore films in his first ever solo here at MenOver30.com a month or so ago. If there ever was a man worthy of a second look, it's Shay. He personifies the kind of special man whose magnetism and sex appeal increases with each birthday candle.Snapping his gum to keep his oral fixation in check, Shay lifts his shirt to show off his tanned, sculpted abs as his meaty hand dives immediately into his jeans. His pecs ripple like the desert sand under the summer sun as he tosses away his shirt, opens his pants, and begins to explore the awaiting prize in his snowy-white boxers. Moving to the bed, his body looks like an anatomy chart of a muscular male in his prime as he continues to work up his shaft, pulling the waistband of his briefs down low enough so his full, dark blonde bush comes into view. Standing up on the bed, he steps out of his shorts, and the perfection that is his ass steals the focus with no tan lines to get in the way. A fine dusting of fur covers those meaty glutes, and as he bends over, we even get a look at the ?no-deliveries in the rear? zone of his hole before he turns around and shows us what we really want to see again: that hard, throbbing cock at full mast and ready to play.Shay brings his finger tips down to his cock and works the precum into the head until it is glistening like a shiny orb. We watch those globes of his ass as he walks across the room and steps on top of the ottoman like a star athlete ascending the podium. If being almost too sexy for his own good was an Olympic sport, Shay would win the gold as sure as he has won our hearts. Lying down on the floor and slowly but steadily stroking, he looks like a Goliath at the precipice of release with each perfectly-formed plane of muscle pumping in perfect unison like a well-crafted engine for the singular purpose of reaching the finish line. Cross the line he does, and rather than wave the white flag, he does one better; he shoots it all over his abs. Since we noticed he has no tan lines, he must like to be out in nature au natural?sounds like a queue for an afternoon at the pool...stay tuned!",
  "models": [
    {
      "name": "Shay",
      "person_id": 27860
    }
  ],
  "release_date": "2007-10-04",
  "scene_id": 53775,
  "tags": [],
  "title": "Employee Of The Month, Scene #01"
}