{
  "collections": [
    "Men Over 30"
  ],
  "description": "Rye held onto his cherry until he was 17 ? and has spent the last 13 years making up for lost time. Glint in his eye, bling in his ear and the fur spilling out of his shirt, from his cousin's about to be ex-wife, to clients in his pool cleaning business, to best girl friends he meets in clubs, no hole is off limits to horny guy, and that sometimes controls his own. ?She ate my ass for the first time and now I introduce all of new girlfriends to it,? he said without an ounce of shame. Rye starts his day by jacking off and usually ends it by having sex. In the course of giving us his oral sexual history, he untucked, unzipped and unbuttoned. Rye is an uncomplicated guy who has a one track mind that revolves around getting off in every place possible and his about to add MenOver30.com to that list. Licking his lips then blowing a kiss into the camera, he immediately peels off his shirt, giving us a glimpse of his bush as it peeks though his open zipper. The combination of that hunky, manly, fur covered body with a big boyish grin on top proved to be almost as intoxicating as the way he managed to show off his low hanging sack and his beloved hole as he turned taking off his pants into an art form of seduction.  Pouring the lube onto his cock as if he was drizzling icing on a freshly baked ?clair, he spreads his legs wide, holds the fat shaft at the base and uses his other hand to knead the blood into that dick that hardens to seven inches with just a few well practiced tugs. Some guys jack off without making a sound while others breathe heavy as they reach critical mass Rye started moaning from the moment his pants came off and from the condition of that throbbing, leaking shaft, we things were about to get louder and oh yes, we are all ears.Rye fists his shaft with such a tight grip, it is not long before he needed more lube. Freshly greased, he stand over us, his cock waving over our heads like a prize just out of reach, before pushes that pole back between his legs, bends over and reaches around to continue his mission, that hairy rosebud shining between his surprisingly smooth cheeks.We move right under him, his chest forming a night sky of dark fur as his dick hangs down and steady dripped while he balls as his balls seems to swell right in front of our eyes. Oiling up one more time, his moans get louder as the pink head turns a shade of purple and those hairy abs are soon covered in a thick blanket of white. Rye runs his fingers down to the valley of cum, scoops up heavy dollop, proudly shows it to the camera then licks that finger clean. While we are not sure exactly what it tastes like, we do know it sure is not cherry flavored. BONE appetite!",
  "models": [
    {
      "name": "Rye",
      "person_id": 27861
    }
  ],
  "release_date": "2007-11-08",
  "scene_id": 53786,
  "series": "Stroking Blues",
  "tags": [],
  "title": "Stroking Blues, Scene #02"
}