{
  "collections": [
    "Men Over 30"
  ],
  "description": "This may be the one time a year that take out goes out the window and you sit down to a full meal. So we are doing ?Turkey Day? right here at MenOver30.com with a three course man buffet with sexy, tall, inked Tyler as an appetizer, followed by the unusual mix of Irish and Puerto Rican in Joshua, and rounding out with muscled and manly Shay for dessert in a special poolside penis party worthy of giving thanks for!Last time we say our 6'4? cuddly hunk Tyler, our giant was anything but gentle as he fucked Troy Halston's uber hole into another universe. It has been a year plus since Tyler was in town, and he is looking better, tanner and blonder, than ever.  Tyler must have missed us, because he was naked in record time, that strapping body covered in the same golden fur that we remember and that cock as hard as ever.  He races to the bed where he can sprawl out his massive frame before moving to the chair, ratcheting up the stroking to ?gotta nut? speed, and then in a ?look, no hands? moment that will not soon be forgotten, lets his cock stand tall and spews out a thick load of cream that oozes out for a good minute and half until his hand, shaft, and the floor underneath are covered in cum.Next up, we have a change of pace as pint sized Joshua, a 5'6?, 145 pound exotic mix of the luck of the Irish and the sizzle of Puerto Rico seems to take a clue from Tyler and gets out of his shirt as fast as possible.  With his impossibly fat free waist, and his pants hanging so low, the sable brown curls showing above the waistband let us know not only is he going commando, he can not wait to go gonzo on his cock. Those pants leave his body just as quickly as his shirt, and almost as fast. His cock is not just at full mast, but so swollen, it takes on a shade of crimson like his cock is on fire. His sack is so hard, it has almost disappeared up into his body. Of course, that means something else is about to appear, and indeed it does, drop by drop all over his stomach.We know you saved room for dessert when that final course is none other then Shay. When this thirty year-old strips down outside at the pool, we could feel the temperature climb 10 degrees. Getting ready for a body building competition, Shay is shaved from head to toe. As much as we usually prefer our guys to leave their hair alone, Shay's marble smooth body, glistening under the Sun's rays and magnified by the spray of water from the outdoor shower is a sight to commit to memory forever. After a dip in the pool, Shay moves to the bedroom to do what he does best ? use that fine body as an instrument of pleasure.  Shay serves us a special topping for your pumpkin pie that is packing a lot more protein than Cool Whip.  From Tyler, Joshua, Shay and all of us at MenOver30.com, Happy Thanksgiving!",
  "models": [
    {
      "name": "Joshua",
      "person_id": 30518
    },
    {
      "name": "Shay",
      "person_id": 27860
    },
    {
      "name": "Tyler Olaf",
      "person_id": 27770
    }
  ],
  "release_date": "2007-11-15",
  "scene_id": 53788,
  "series": "Code 3",
  "tags": [],
  "title": "Code 3, Scene #02"
}