{
  "collections": [
    "Men Over 30"
  ],
  "description": "Thanksgiving is time for second helpings, and if there were ever a couple of horny, studly, men in their prime who were worthy of a second serving, it would be Lee and Tyler.  In last week's trilogy of hunks, Code3, we got our first look at blonde, tall, hairy Tyler, with his stubbled face, inked body and always hard cock after being gone from MenOver30.com for almost a year. Lee, everyone's favorite college buddy who grew up into an even hotter and sexier man with each passing year, was away even longer than Tyler.  We were only too glad when he called up, back in town and ready for our cameras. Lee is one of those rare guys who is just about perfect from any angle, front or back. Between those brooding eyes, handsome face, smooth body, and always hard cock on the front, and his ass on the back that is arguably one of the finest backsides to ever grace the male form, we will take as much of Lee as we can get. One look at Lee's ass in his jeans was all it took for Tyler to have the same notion. We have seen Lee and Tyler alone and with others, but never together...until today.Their hands immediately start stroking each other's thighs as their lips do not just meet, but collide in what seems like an effort to suck each tongues right out of their mouths. Sucking was the operative word here, and in a flurry of flying shirts and opening zippers, Tyler and Lee ripped each other's clothes off in a mad dash for the bone that left Lee standing on the bed, with Tyler on his knees - the back of his throat being the new home for the head of Lee's cock. Tyler inhaled Lee's cock like a dick-starved sailor just back from a year-long tour of duty.  Newly single, and even hornier than ever, Lee returned the favor...his long cock making the journey over every inch of Tyler's throbbing bone. With such tactical precision to taste every inch, you can practically feel the tip of Lee's cock running up and down your own dick. As Lee continues to work Tyler's dick, Lee's knees spread out inch by inch, until his hole is throbbing right in front of his eyes and his own cock hangs low and heavy and begins to drip with anticipation. Tyler grabs Lee's head, putting Lee's mouth exactly where he needs it. Lee is only too eager too please, as they both know where theirs cocks are going next.Tyler bends Lee over the chair, holds him in the perfect position by his shoulders, and like a heat-seeking missile on a mission, plunges his cockhead into the warm lips of Lee's hot hole. Tyler keeps feeding his cock until his balls are rubbing against Lee's ass cheeks, the dark ink of his tats gleaming with sweat.  Tyler barely gets on the mattress before Lee moves over, and in one fast, carefully-aimed move, squats down and inhales Tyler's cock to the hilt again, quickly picking up speed, proceeding to give Tyler the ride of his life. No one takes a cock like Lee does, and when he needs it even harder, he rolls onto his back for the kind of deep stuffing only a 6'4? hunk of a man like Tyler can give. You can hear the slap of flesh against flesh as Tyler gives Lee the pounding he needs before they both reach the point of no return. Tyler fires off first. His cum is always some of the thickest we have ever seen. The only thing different today is that while it is as viscous as ever, Lee's ass has milked out a load from Tyler bigger than any he has ever produced before, as it continued to dribble out of his cock even after Lee's had fired off his own load.  Not sure about the rest of you guys, but on this Thanksgiving anyway, we sure know what Tyler was thankful for. Happy Turkey day from all of us at MenOver30.com.",
  "models": [
    {
      "name": "Tyler Olaf",
      "person_id": 27770
    },
    {
      "name": "Lee Covington",
      "person_id": 27836
    }
  ],
  "release_date": "2007-11-22",
  "scene_id": 53789,
  "series": "Team Work",
  "tags": [],
  "title": "Team Work, Scene #01"
}