{
  "collections": [
    "Men Over 30"
  ],
  "description": "We embrace men over 30 so much, we built this site devoted just to them. But we forget for some guys, turning the big three-o is not always something that they embrace as publicly as we do. Ian is a prime example. When we asked him how old he was, he first said 28 ? but we had just looked at his passport, so we knew the truth. ?I don't think I have ever told anyone my real age since my birthday,? he told us in his sexy Venezuelan accent, ?how silly ? eh?? Silly indeed! When you look as hot as Ian does: beautiful skin, naturally hairless body, handsome face, and a hard, hungry seven inch cock, it proves what we knew all along ? men like Ian get better and batter with each year. Ian's first experience was with a female; but before he had his driver's license, he had also learned that sex with men gets his motor running as well. In fact, as we were talking after the shoot, he was telling us his favorite experience of all time was with a couple where all three did each other in every possible combination, he got rock hard all over again, despite the fact he had just squeezed off a sizeable load a few moments before ? then again, he told his he was horny the minute he walked in the door.Sitting in the chair, Ian's hands were glued to his crotch like a runner's feet are in the block, waiting for the starting gun to be fired. Within 45 seconds, he had peeled off his shirt, stepped out of his jeans, and was standing there with just a pair of packed white briefs. Ian has a solid, thick frame, where his muscular thighs balance off his wide pecs. The beckoning arcs of his plump ass stretch the fabric in the back of his underwear the same way his expectant cock and heavy hanging sack do to the cotton in the front. Climbing onto the bed, the waistband begins its journey down, showing off the tight crack in the center of those meaty glutes before he pulls them off, spreads his legs wide, and lets his fingers do the walking down his back until the middle one disappears right into his hole. As he rolls over, Ian's cock is mad hard, and that finger in his ass now has company.Many Latin guys will admit to getting off with another hombre on the down low, but just like Ian's cock, nothing about this guy is down. He shows off his ass without a self conscious moment, owning the fact he is master of how much pleasure can be derived from that area. As he stands up on the bed and leans against the wall, his lubed fingers show another delivery in the rear, along with a huge serving of sperm, is imminent. Stroking from the front with one hand and reaching around the back and exploring his hole again with the other, Ian rubs, fingers and works his own body like a well choreographed ballet of extended personal foreplay that most men hurriedly skip over in their need to seed. Of course, man does not live by foreplay alone, and neither does Ian, who soon finds both his hands busy once again ? this time working out a thick white load that lands largely on his abs, save for the first warning shot that comes down mid chest.",
  "models": [
    {
      "name": "Ian",
      "person_id": 27862
    }
  ],
  "release_date": "2007-10-18",
  "scene_id": 53780,
  "series": "Back To 1",
  "tags": [],
  "title": "Back To 1, Scene #02"
}