{
  "collections": [
    "Men Over 30"
  ],
  "description": "Simply put, 42 year old Parker Williams is a walking wet dream come to life. His face is ruggedly handsome, his body rippling in muscles, his torso covered in fur and his dick is fat, thick, blunt, cut, long and always waiting for the next opportunity to be good use, be it in his own capable hands ? or for those with extreme good fortune, in the care of others. 18, blonde, smooth and beautifully sexy, Luke is the one with the luck today as he is joining Parker. After Parker took one look at his co-star, he was more than pleased with the hand he was dealt. Parker knew immediately that he wanted inside that tender young winner's circle. To say the feeling was mutual is an understatement. We know Luke loves built, good looking men in their prime and making room for this daddy was right up his alley ? and soon, right up somewhere else. We knew we had the making of a great scene. What we did not know at the time was that the result would be more than just a hot pairing; it would be one of MenOver30.com's finest ? and hottest ? hours ever!Even through Luke's probing fingers, the bulge in Parker's shorts looked like he was unsuccessfully trying to smuggle a flashlight in his pocket. With an 18 year old like Luke so warm for your form, who could blame him? Grabbing Luke in his strong arms, Parker inhaled Luke's tongue in his mouth with the kind of slow, passionate kisses usually reserved for a lover. Luke loved the feeling of Parker's hairy chest on his own smooth one, but loved the taste of Parker's cock even more. After covering every throbbing inch of Parker's cock with his tongue, Parker lifted up Luke, made history of his clothes, pulled his head back, and licked Luke's neck as he ground his pole against Luke's cheeks. Meanwhile, Luke's cock throbbed in the air and he ground back against the formidable man behind him. Parker moved Luke to the chair, swallowed his cock, tasted his hole before they got on the floor for a 69, offering Parker the perfect vantage point to probe Luke's hole with his fingers and his tongue in preparation for full scale anal invasion they both had been dying for since the moment they first laid eyes on each other.After slapping his cock against Luke's cheeks as he loosened the nearby opening with his thumb, Parker aimed the knob of his cock at the entrance to Luke's ass. Like a battle plan executed with the utmost precision, Parker invaded Luke's insides with a steady push as Luke moaned in what can only be described as a symphony of unbridled joy. With his tall strong legs straddling over Luke, he steadily lowered himself in and out of Luke's hole as Luke's own throbbing cock began to leak a steady stream of pre. The passion turns to lust as Parker responded to Luke's plea to ?fuck me, fuck me? by ramming harder and faster, the collision of flesh against flesh echoing across the room. Sliding Luke on his back, Parker piston fucked the hungry hole until Luke spilled a massive load that covered his chest which mirrored the white monsoon Parker soon added. As Parker licked some of jizz off his hand, we noticed his cock was already hard again proving that 42 can indeed go into 18 a lot more than the calculator would have you believe.",
  "models": [
    {
      "name": "Luke Riley",
      "person_id": 27859
    },
    {
      "name": "Parker Williams",
      "person_id": 27870
    }
  ],
  "release_date": "2007-10-25",
  "scene_id": 53781,
  "tags": [],
  "title": "In The Company of a MAN, Scene #01"
}