{
  "collections": [
    "Men Over 30"
  ],
  "description": "Mack showed up to the MenOver30.com fresh from work, in long sleeve shirt and tie, very quiet, very serious, and very sexy. With his close cropped beard, low voice, and calm demeanor, we had a feeling he was a wolf in sheep's clothing. It is always the compact, silent types that surprise us once their clothes begin to come off, and in Mack's case, the first bombshell fell along with his shirt. Lurking beneath the conservative oxford cloth of his button down was an arm full of ink that starts on his shoulder blades and runs all the way to his wrist. The tats tell the tale of 'see no evil, speak no evil, and hear no evil', which is a good thing, as despite the innocent look in his eye, we were peering into the mind of a devil. And it did not take coaxing to get ole Lucifer, or his pitch fork, to come out and play.Mack immediately loses his shirt, exposing his naturally smooth, lean chest with twin bite sized salmon colored nipples. He turns his back and showcases the ink he loves so much. Slowly turning around, we come in closer and see there are light crop circles of hair around those nipples which, like the bulge in his jeans, indicate the state of the contents they hold - hard and ready. The ridges of his abs come into view as he rubs his way down his belly and opens his pants. His boxers ride low and a few dark tendrils of his bush peek over the top. Standing up on the bed, he lowers his shorts so the lily white, perfectly curved bubble butt steals the focus. He slowly turns around, his cock leading the way, and presents a perfectly formed, tasty, pole that is as hard as steel and ready for some serious pounding.Using his balls like a handle, he slowly brings his fist up and down his shaft, milking that beautiful pole until the head turns purple. His eyes are shut tightly and low moans escape his lips. He continues to work his shaft with a grip so steady and purposeful, you can almost feel the sensations dancing up and down your own cock just by watching him work his. Mack completely surrenders to the feelings electrifying his body, his shaft getting thicker and thicker until the vein on the underside sticks out so far, it looks like his shaft is sporting a second boner right underneath. His hands now forming a living cock ring, his balls bloated and glowing red in his grip as his moans increase right along with his rhythm, resulting in a heavy thick load that frosts his cockhead like the first snow fall of the season and yes, it sticks. Ever after he shoots, his cock never softens. It is true - you really can not keep a good man down.",
  "models": [
    {
      "name": "Mack",
      "person_id": 27863
    }
  ],
  "release_date": "2007-11-01",
  "scene_id": 53784,
  "series": "Mack's Mark",
  "tags": [],
  "title": "Mack's Mark"
}