{
  "collections": [
    "Men Over 30"
  ],
  "description": "During the holidays we make time to get together with those we like the most. Ever since he first appeared here on MenOver30.com a few months ago, Mack joined the upper ranks of everyone's favorites, as the writing down of all the things to like about this guy would amass a list that rivals Santa's.  Starting with his face that has a handsomeness all its own, a lean smooth body that serves as a canvas for a display of ink that approaches the level of a masterpiece, and of course, a thick, cut cock as perpetually hard as a man's half his age wrapped in an attitude that is one of the finest examples of ?straight but not narrow? ever to walk the planet. ?I can just see a beautiful car drive by and get a hard on? Mack told us with a grin reeking of laid back masculinity, ?I just got a new one and have whacked off and made love in it already.?  Perhaps his appreciation for the beauty of a well run machine is how Mack learned to not just rub off a load, but use every part of his finely tuned body like a unified precision instrument carefully calibrated for the singular purpose of the ultimate release. Like he could not wait to see the red recording light appear on the camera, at the first flash of crimson, Mack had his hand down his pants.  The journey he is taking us on so willingly becomes apparent immediately. Mack is up to much more than some sophomoric dick grabbing. He seems to be riding his own fist, eeking out every sensation a man possibly can from his own crotch in a way that makes you forget he is still fully dressed ? but not for long.  He manages to release his arm just long enough to remove his shirt and open his belt and jeans before laying down on the bed, resuming his south of the border exploration while his gaze seems to peer right through the lens and look right back at you.  It is not long before he is saying a final good bye to his jeans, crawling right out of his shorts and reacquainting himself with that beautiful cock.Rubbing with an open palm from just under the trimmed bush down to the leaking head, you can see Mack's cock literally get thicker and longer with each well practiced, highly focused pass as his other hand makes its own magic for the captive audience of his right nip.  His smooth sack is bloated, contracting yet still hanging low. He works hand over hand on his throbbing cock, twisting his fists in unison as the sensations they produce make Mack shudder - and you jealous - unless you are stroking along and experiencing the same rare joy he is.  In something he deprived us of last time, Mack rolls over onto all fours, gives us unfettered access to his creamy white, perfectly rounded ass cheeks, and in a move that means we all must have been very good boys this year, lets us keep filming as his fingers do the walking right up and down the furry no-man's land of his hole.  At this point, we are not sure who was moaning louder, us or Mack, but that butt cheek once over was all it took for everyone's balls to move to battle stations as Mack soon ushers out a thick white load that continued to ooze out of his cock even after the camera stopped rolling.",
  "models": [
    {
      "name": "Mack",
      "person_id": 27863
    }
  ],
  "release_date": "2007-12-13",
  "scene_id": 53796,
  "tags": [],
  "title": "Mid-day Stroke, Scene #02"
}