{
  "collections": [
    "Men Over 30"
  ],
  "description": "Like a favorite holiday decoration that you cannot wait to unwrap and see again, and something so pleasing to the eye, you long for it when it is no longer there, there is no man better to spice up the season than MenOver30.com's Head of Dicks, Parker Williams. He wears his 42 years as handsomely as a tree wears its leaves. His face is a postcard of chiseled masculinity, and when that is followed by a fur-covered landscape of muscle, fur with eight, thick throbbing reasons why he is glad to see you, simply put, there may be men that are hotter than Parker, we just have never seen one.?I always cum at least twice a day? Parker told us, ?But I when I am working, it can be a couple more times than that.?  For some men, that would be boasting, but with a man like Parker, it is a statement of fact. After all, we have seen Parker working the business end of that big dick into Luke's lucky hole with such precision, passion and intensity that it left Luke trembling, Parker breathless and the rest of us begging for more.   More is always something Parker has plenty of, but not all men have the same willingness to share.If you can not keep a good man ?down,? Parker Williams must be the best man of the planet, as that big dick of his is always ready to go.  With the ink peeking out of his sleeves and his pants bulging with the promise of the main event soon to follow, Parker lays on the bed like a vista ready to be explored.  Lifting the hem of his shirt, he shows off that hairy covered, solid stomach. Then, licking his thumbs like a cock he was jonesing to taste, Parker sucks on this thumb for a bit, gathering spit to use as his attention moves to his equally hard nipples.  Licking the well rounded curve of his bicep, Parker unbuttons his pants, gets on his knees, and just beams as the base of his cock trembles visibly under that dark brown bush while the magic head remains still hidden behind door number one.  Standing up, Parker lets those pants fall to his ankles. With that eight inch dick now out and proud and immediately overhead, all you will want to do is fall to your knees.The loud ?thwap? as his he shakes his hips back and forth, causing his cock to hit one hip, then the other, has become our favorite theme song. A few slaps later, Parker's head is leaking the pre he will soon be using for his own natural lube.  Taking a seat and spreading those strong thighs wide apart, Parker grips the base with one hand and tugs on the head with the other, demonstrating why he is such a fine fuck:  his dick is not just big and thick, it does not just get instantly rock hard and stay that way, but Parker's dick at full erection stays just pliable enough to be worked into whatever nook and cranny he chooses.  Moving to the ottoman, he turns his back to us, sticks out his fine, round, furry butt, and lets his cock hang down as he shows off that manhole in the back while working that big pipe in the front.  Letting the bullet of spit hit his cock, adding the precum he has been using as grease, Parker falls back on the bed  and uses his entire body as the instrument of pleasure that it is, moaning like a bear as he covers that heaving belly with a heavy layer of hot, white cum.  Using his fingers to scoop up his own jizz, he wipes his abs clean, brings his fingers to his mouth and samples his own special holiday recipe. I guess this time as well as ?thanks for cumming,? we need to add ?bone appetite.?",
  "models": [
    {
      "name": "Parker Williams",
      "person_id": 27870
    }
  ],
  "release_date": "2007-12-06",
  "scene_id": 53793,
  "series": "In A World Of His Own",
  "tags": [],
  "title": "In A World Of His Own, Scene #01"
}