{
  "collections": [
    "Men Over 30"
  ],
  "description": "Ten years as a professional body builder have packed 240 pounds of muscle on Aaron's 6'2? frame. Hence, the last name of ?Giant? is far from honorary, and as you will see, it aptly describes all of his muscles. Aaron's English is infused by a strong German accent. Despite the imposing strength of his build; there is a disarmingly charming boyish twinkle in his 37 year old eyes. Aaron played it straight for the first two decades of his life, finally making the pilgrimage to man land when he was 24. Luckily for us, and even more so for his partner of five years now, he has never looked back.  A born exhibitionist, Aaron loves to be looked at. The less he is wearing, the more he likes it. While that explains how he naturally came to choose a sport with a uniform of skimpy posing trunks, it does little to prepare you for just how hot he looks out of them!At MenOver30.com, we always believe unwrapping the package is half the fun. Apparently, Aaron is similarly inclined as he showed up in jeans, a dress shirt and a tie. The more to take off, the more fun he has, and he is only too glad to have us along for the journey. He first loosens his tie, and then opens his shirt, allowing the tan, sculpted muscles underneath to get the airtime they deserve. First, he grabs a big handful of his right pec, then palms the meat in his jeans. Aaron undoes his belt as if he's undoing the ribbon off a gift and indeed, the bulge that explodes out of his fly is something on everyone's holiday list for sure. Running through his poses to show off every muscle to the ultimate advantage, we get a glimpse of the heavy bratwurst in front before he turns and bares a rock solid, gleaming white set of glutes one cheek at a time. Stepping out of his boxers, Aaron bends over, flashing us a preview shot of his hole, while cock and balls hang underneath. But not to worry guys, they will not be hanging for long. Practically extending from one end of the bed to the other, Aaron holds his shaft with his thumb and forefinger, slowly moving it up and down, squeezing more blood into it with each motion. Hanging heavy even soft, Aaron's cock slowly fills up, but his extra long skin means the head is never totally exposed ? until Aaron pulls it back with one hand, scoops the precum from the head with the other, and takes a good long taste.  Every guy has their own special trick, and taking a lick must have been Aaron's, because instantly he is at full mast, bending over, and showing off not just that hole once more, but his now throbbing cock as well. His shaft continues to throb as he reaches back and spreads his cheeks, letting us get up close and personal with his hole ? and he makes it wink back at you. Just like on that mainstream dating site's TV commercials, oh yes...it's ok to look. Aaron is one of those men we do not see often that does not get a full blown erection until just before he is going to shoot, but when we saw those extra two inches of his shaft, it was definitely worth waiting for. Looking right into the camera and saying ?this is just for you,? his face contorted in the ecstasy of release, Aaron's first shot arcs high the air, the second blasts forward, almost hitting the lens, and the rest continues to pour out of his cock and puddle down his shaft in one of the biggest loads we have seen all year. Auf Weidersain, Herron!",
  "models": [
    {
      "name": "Aaron Giant",
      "person_id": 27858
    }
  ],
  "release_date": "2007-11-29",
  "scene_id": 53791,
  "series": "Model Behavior",
  "tags": [],
  "title": "Model Behavior, Scene #01"
}