{
  "collections": [
    "Men Over 30"
  ],
  "description": "If there was a ?Mr. MenOver30.com? for 2007, one of the top contenders would have to be our very own golden heart throb, Scott Tanner. He has arguably one of the prettiest cocks ever bestowed on a man, with a face that is just as hot. His body is lean, hard and inked. His sex drive is somewhere in the stratosphere. And if his physical charms were not enough, he is smart, funny, friendly, and get this ? he even cooks, giving the phrase ?Top Chef? a whole new meaning.  Of course his devoted fans here are well aware of his talents in the bedroom, but his prowess in the kitchen was shared by someone who can say something we all wish we could. He gets filled by Scott's cock every night; Scott's boyfriend, Damien Rios.  As much as we hated to see Scott become unavailable, one look at how well matched he and Damien are and the energy they have a couple, and all was forgiven. It was six months ago that Scott and Damien first invited our cameras to record them together in what can only be described as the passionate, primal, scorching hot encounter that can only happen between lovers.  Half a year later, as they prepare to celebrate their first holidays together as a couple, they are giving us all a reason to celebrate the season as they once again celebrate each other.Scott and Damien have such passion that even their first kiss catapults the chemistry in the room from just sex to making love with all of the emotion, desire, and primal longing that only being with the one you love can inspire. Scott's legendary cock is immediately rock hard and soon engulfed in Damien's magic mouth while he removes his clothes and strips Damien ? while his cock never leaves his lover's throat. As Damien kneels on the bed, we follow the angel wings inked on his back down to his magnificent ass ? which is being munched into heaven and back by Scott. Scott presses forward, and Damien pushes back before Scott moves up and over him, sliding his cock up and down the trembling ass lips of Damien's lonely hole...but do not worry guys...it's the holidays and oh yes, company is cumming.Lavishing his own considerable oral attention on Damien's hole from both behind and then in front, Scotts gloves up, greases up, and plunges his cock all the way inside Damien, sealing the moment where they are both doing and feeling the kind of fireworks that truly being with the one you love can bring.  As Scott moves to the bench, Damien rides that pole while working his own cock before Scott stands up, fills Damien completely, and holding that ass as deeply on his cock as possible, stands up and walks them both over so Damien can hold onto the chair to brace himself for the royal pounding that is soon to follow. After ramming away with the perfect fit of a piston in a engine, they are both covered in sweat, dripping in desire, and fuck their way back onto the bed where Damien covers his abs with a load that redefines massive before getting pelted with an even bigger nut from Scott.  If this is the blizzard of 07, all we can say is ?let it snow!?",
  "models": [
    {
      "name": "Scott Tanner",
      "person_id": 27871
    },
    {
      "name": "Damien Rios",
      "person_id": 27934
    }
  ],
  "release_date": "2007-12-20",
  "scene_id": 53798,
  "series": "Stupid Cupid",
  "tags": [],
  "title": "Stupid Cupid, Scene #02"
}