{
  "collections": [
    "Men Over 30"
  ],
  "description": "Baby New Year looks nothing like this: rugged, handsome, manly, and wearing a dark suit that clings to one very well worked body. Demetri is a forty-one year old mix of Cuban, Spanish and Greek in a very muscled, lightly haired landscape of muscle and masculinity that wreaks of just the kind of confidence any man over thirty would have when they started building their body at 16 with no signs of stopping anytime soon. It was as he was learning how to lift weights and getting his driver's license that Demetri also learned how to lift his legs, or those of other men, when his first experience was a three-way with two older body builders in a locker room. 'We all fucked each other, we all sucked each other. It still is the best sex I have ever had,' he told us. And even though he had just shot an epic load a few moments before, just reliving that experience caused his cock to harden again even as the sperm dripped down his stomach and into his balls.As soon as he unbuttons his jacket, even through the loose dress shirt, the size and quality of the physique underneath is immediately apparent right along with a bulge in his suit pants that is clearly clamoring for attention.  The stark white of the briefs flash out from the opening as he unzips his dark suit pants then, opens his shirt to reveal the strong, hard, tanned masterpiece underneath. Both his massive shoulders are covered in a tapestry of ink and become the perfect bookends for those massively rounded pecs in the middle. With a smile creeping across those sweet full, oh-so-kissable lips, Demetri flashes us one hard as marble ass cheek in the back, a hint of bush in the front, before stepping out of his briefs and giving them a good sniff, moving to the bed, and spreading his legs wide. As he reaches one massive arm back behind his head, he is making room for you to join him: after all, it is New Year's, and as we heard already, we have already supplied you with a noise maker.With those lips like pillows of desire and that hard cock a tower of desire, Demetri begins to work that slimy shaft with one hand as he tugs on those already contracting balls with the other. He lets that big, thick pole throb along his thigh as he rubs his body, before rolling over and showing off those glutes. Straddling the bench, he is a sight to behold as that masterpiece of a body is flexed to perfection as he stokes away at a shaft that continues to stretch, developing an ass stretching hook just under the swollen helmet head. His hand never again leaves that cock as he works his pole in the chair, on the floor, standing up until he finally moves to the bed, starts to moan so low it is barely audible, and then unleashes some of thickest, white jizz we have ever seen in a load that covers him from side to side until it looks like he lost a tug of war with a milk carton. He said he had been saving it up for four days and the result is enough sperm to last you all through 2008!  Happy New Year, Guys, from Demetri and all of us at MenOver30.com",
  "models": [
    {
      "name": "Demetri",
      "person_id": 27866
    }
  ],
  "release_date": "2007-12-27",
  "scene_id": 53799,
  "series": "Performance Review",
  "tags": [],
  "title": "Performance Review"
}