{
  "collections": [
    "Men Over 30"
  ],
  "description": "Hailing from Hollywood, FL, our home grown Michael Buck grins as he assures us he's ?made up for lost time!? when asked why he held onto his cherry so long. Apparently good things come to those who wait, and Michael ended up losing his in Ft. Lauderdale to five horny Colombian girls at the age of 17. Sounds like the coming of age that every horny Spring Breaker dreams about. Fortunately, that experience set the bar for the self-professed heart breaker, and he still loves the group scene whenever possible! If only those girls back then knew just how hot that lean local would turn out. At 30, this 6' Adonis now tips the scale at almost 260 pounds of rock solid muscle. His proportions are well defined. A couple tat\\ts and some scars and a pearl piercing he sheepishly admits he got while ?away? are a reminder that this nice guy has a definite bad boy edge. If you've ever been at the gym and wondered what those hot buff boys look like ?buck? naked and stroking ...well, stick around ?you're about to get your wish!Not one to waste time, Michael stands up and begins to undo his belt. His t-shirt hugs his massive pecs as he begins teasing us with slight views of his abs, before turning around to showcase his muscular ass. He peels off his t-shirt, and you can fully appreciate all the work he's put into his body. Huge biceps and broad shoulders, adorned with a tribal tat centered across them, taper to meet his muscular waist. Lying back, he gives us a better idea of his assets, flexing his biceps slowly. As you gaze across his chiseled body, you are greeted by his tempting nips atop his defined chest. His muscles ripple just beneath the surface, and his hairless pits look inviting. He has an air about him that brings to mind an era long gone. Throw this muscular stud in a tight, black square cut trunk, some hair gel, and a black and white photo session later??50's Beefcake, anyone!??Michael lies back he begins to grope his stirring cock. Fortunately, his blue boxers won't be on for long, as he stands to give us a better view as he unveils the sculpted art before us. His ass looks like two perfectly formed orbs, and just when you want more, he turns around and begins stroking his swelling cock. No matter where you look, you won't be disappointed. Except for a short cropped patch of crotch fur, he's virtually hairless. Just think of what you could do with all that lickable real estate! Need a minute? The next thing we see is Michael sprawled out in all his glory. He works his cock between those massive thighs, thumping it against his taught abs giving us quite the show. His fist works his cock like a well-oiled piston. As his speed intensifies, so does his breathing. He moans his approval, and the closer he gets to the inevitable, the more he does it! He thrusts his hips into the air, groaning as he erupts, sending his load splattering on his smooth navel below! After that show, we here at MenOver30 hope that the ?buck? won't stop here! ...but, we have a feeling he'll be back!",
  "models": [
    {
      "name": "Michael Buck",
      "person_id": 27868
    }
  ],
  "release_date": "2008-01-17",
  "scene_id": 53805,
  "series": "Cocks-A-Who-Little",
  "tags": [],
  "title": "Cocks-A-Who-Little, Scene #01"
}