{
  "collections": [
    "Men Over 30"
  ],
  "description": "Mack, that delicious flavor from Florida, proves once again that not only do good things CUM from small packages, but that small packages sometimes have big...bows! Mack's been on MenOver30 a time or two, and his sexy face, inked bod and big ?cock? as he prefers to call it, have made him a fan favorite! He's been with the same girl for about a year now. He grins as he boasts that she's finally beginning to experiment with other girls. Mack hopes that someday, soon they can explore having a threesome together. His ultimate fantasy would be to have his 19 year-old girlfriend on a deserted island, where every day different girls are dropped off so that they could have their way with them. Sounds like a reality show any straight boy would kill for! Well, we here at MenOver30.com don't claim to be the experts on what straight boys want; but, we do know what we want ?more Mack! Look out, Ol' Mackie's back!!Getting right to business, Mack peels off his t-shirt, revealing his smooth, defined chest and abs. Your eyes are immediately drawn to ink that starts just behind his left shoulder, with cherubs heralding a tag tat and leading into an amalgamation of intricate images that run completely down his right arm, ending in a wrist tat of blue flames. There's a definite bad boy edge to this local lover! His baggy jeans are next, as we get our first glimpse of his growing member as he tugs away at it through his boxers. Feeling a little dirty, Mack decides to take a shower to better showcase his ?ass?-ets. He slowly slides off his boxers. When he bends over, you can fully appreciate the rear view. His smooth bubble ass encased between his tan lines looks amazing. Once in the shower, he gives us a visual feast; slowly soaping up, showing us every inch of man he has to offer. The water dances off his lean, muscular body, showcasing his defined frame. ...Time to take care of business!Mack begins to give his growing cock the attention it deserves, and in no time, his thick cock is at full mast! Having more than the average bear; Mack has nothing to be ashamed of in the cock department. His cock, damn near 8? is the kind of thick cock you'll need both hands for! ? so Focus! He strokes his cock with one leg up on the couch, giving us a spectacular view. His cock throbs while it gets the hand-over-fist attention it needs. His smooth, low-hangers dangle between his muscular thighs. No matter the angle, his look is unmistakably masculine and incredibly erotic. Bent over, standing up, or sitting back to get better access at his equipment, Mack doesn't have a bad angle! All his stroking pays off as he moves to the floor to finish. His legs spread apart, he leans back against the couch and works his cock. Balls in one hand, knob in the other, Mack's moans and groans signal the inevitable. In no time, his cock spills over, coating the floor below. Clean up on Aisle 8!",
  "models": [
    {
      "name": "Mack",
      "person_id": 27863
    }
  ],
  "release_date": "2008-01-24",
  "scene_id": 53807,
  "series": "Clean Finish",
  "tags": [],
  "title": "Clean Finish, Scene #01"
}