{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back for more action this week are two of the hottest studs from MenOver30.com's archives! Larger than life Parker Williams is back! At 6'1?, Parker's massive frame and hairy assets made him an instant fan favorite here on MenOver30. If that wasn't enough, there's always the 8? of man meat he's packing! This time, we paired him with Matthew, one of our original dirty dozen, who helped us successfully launch the site three years ago. Both of these studs have plenty of experience under their belts doing what they do best. Matthew, 5'10? and deliciously smooth, has worked mainly on the net; while Parker has broadened his horizons, showing off his talents not just in front of the camera ...but behind it as well! Hmmm! We just might need to have him direct as a special guest here on MenOver30 to see if his talents behind the cam are as delicious as his talents behind a deserving ass! Regardless of what they have under their belts 'professionally'...it's what lies in their pants that make these studs the kind of men we welcome back ...again and again! With two hot studs like these going at it ?you just can't go wrong!Parker and Matthew waste no time as they immediately begin exploring each other. Matthew's atop Parker as they begin with a sensual make out session. The chemistry is explosive as their tongues intertwine in a lust filled dance that soon spills over on to their necks and nips. Then Matthew, taking the lead, dances his tongue South to Parker's bulge that by now is aching for release! Fortunately for Matthew, Parker's shown up commando, so there's nothing keeping him from tasting all Parker has to offer! Parker moans and groans as Matthew hungrily takes his meat, working it ball deep and stripping him in the process! Then it's Matthew's turn to get some help, and Parker's more than ready to meet the challenge. Within seconds, Matthew, too, is at full mast thanks to Parker's expert oral attention. Watching these two hot, hung studs swap blowjobs is intense. Just as you begin to appreciate the oral panorama?Matthew straddles Parker. As you watch him begin his descent, guiding Parker's gloved cock inside?you know he's in for the ride of a lifetime!Parker gets a taste of Matthew's talents as he feels Matt's ass tighten, gripping his cock as he slides down on his swollen shaft. Parker grunts and moans as he begins eagerly bouncing Matthew on his meat, giving Matthew his fill. Parker can't seem to get enough of that ass and goes in for a closer inspection ...tongue first! After rimming his sweet ass, Parker suits up and gently pushes inside for more. The view is incredible as these two go at it. Parker's balls slap Matthew's ass gently one minute, then piston-like as he's moved into position with Parker pile driving it home! This is what Man-to-Man sex is all about! Parker grunts as he takes Matt on all fours. No matter what the position, the sex and the sounds are intense! Matthew then lies back on Parker's chest as they both stroke off to an explosive finish! Talk about a visual buffet! Parker moans as his fat cock explodes, sending his thick nut all over his furry chest and stomach. Seconds later, Matthew blasts his own rocket?launching jet after jet splashing onto his smooth abs ? and coating Parker's arm as well! With talents like these, it's no wonder these two have the fan following they've acquired! We here at MenOver30 like to think we are among those fans who won't be getting tired of seeing these two making deliveries in the rear any time soon!",
  "models": [
    {
      "name": "Matthew",
      "person_id": 29217
    },
    {
      "name": "Parker Williams",
      "person_id": 27870
    }
  ],
  "release_date": "2008-01-10",
  "scene_id": 53804,
  "series": "Playing Tight",
  "tags": [],
  "title": "Playing Tight, Scene #02"
}