{
  "collections": [
    "Men Over 30"
  ],
  "description": "Chase comes to us wearing a t-shirt that reads: ?I'm not a Model I just look like one? and well, there isn't an ounce of false advertising anywhere to be found on this smoldering hunk. Dark features, light eyes, boyish charm and a chiseled face make you wonder just what kind of trouble this 30 yr old bad boy gets himself into. Chase has the kind of jock looks that you can't help but stare at, even if it might get you in trouble. Chase flashes his perfect smile and his eyes glimmer as he confesses he loves to be watched while he has sex. The thought of getting caught only heightens his excitement. One of his most memorable forays was being watched by 15 people while having sex in the backseat of a car at the beach ...little did they know! Chase is soft spoken and personable, yet there's an honest and raw sexuality about him. ?Butts are for spanking!?, says the self professed butt man. Chase loves round asses and is only more than willing to jump all over anal sex should a girl he meet give him the go ahead. Chase laughs as he confesses to jackin' off as often as girls play with themselves ? an awful lot! With Chase jackin' off from a couple to several times a day ? it makes you wish you were a fly on his wall!Seated on a bench, Chase slowly peels off his green tee, revealing a lean slice of Ireland. Light fuzz and tattoos adorn this jock as he begins doing reps for us. First he takes turns with alternating bicep curls. His biceps contract and expand, dancing beneath his intricate ink. The overhead tricep press is next, and you can't help but stare at his ripped torso complete with a ?Bad Boy? tattoo just above his waistband ? as if we ever had a doubt! He's a wonderland: pierced nips, sculpted chest, contracting abs, and a set of pits that scream ?Lick me!?. Once he puts the weight down, he gets right to business, slowly peeling down his pants to reveal white boxers, an already aching cock, and even more tats. He begins to tease his cock through his underwear, shifting it from side to side, reaching in to play with his growing manhood until he finally allows you a peek at his prize as it snakes out his boxers along his thigh. A quick tug, and the boxers are lowered enough to give you a view of all he has to offer. He begins to stroke his cock, working his knob and massaging his low hangers as you hear his breathing begin to labor. He watches his meat intensely as he slowly works it; almost as if he, himself, can't get enough of the view. One more tug of the boxers, and they slide past his muscular thighs and drop completely revealing the words ?Irish? and ?Pride? tattooed across his thighs. We couldn't agree more!Chase then stands to give you a full view, and you can see just how well-defined this inked Irish hottie is. He stands working his meat using both over-hand and under-hand techniques that perfectly showcase his glistening bone. He then turns his attention to his low hangers, gently pulling and massaging them with his hand. His naturally chiseled face is intensely focused, and it's easy to see how focused he is on the task at hand. Turning around, he puts one leg up on the bench, giving us a great view of his smooth bubble butt. He bends over while stroking his cock to give you a view of his perfect ass and rock hard cock as he continues milking his meat. He stands back up and, facing the camera, begins to jack his cock. As he jacks it, he begins to thrust his hips back and forth, making you wonder what it would be like to be in its humping line of fire. To finish off, Chase sits back down, spreading his muscular thighs and continues working his swollen cock. It isn't long before you hear his breathing deepen, moaning as he tenses, sending volley after volley of load against his thigh. After watching Chase, you might just have your own rock hard Blarney Stone in need of rubbing!",
  "models": [
    {
      "name": "Chase",
      "person_id": 27867
    }
  ],
  "release_date": "2008-01-03",
  "scene_id": 53802,
  "series": "Defining Moment",
  "tags": [],
  "title": "Defining Moment, Scene #02"
}