{
  "collections": [
    "Men Over 30"
  ],
  "description": "Born in the Ukraine & raised in neighboring Hungary, 30 yr. old Mikael now calls America home. He finds we are more laid back; but he still misses his foods, his culture & his girlfriend! The one he left behind 6 years ago. Long distance relationships aren't easy; but Mikael is a trooper! He's been willing to engage in phone sex, cam sex & has even fucked other women (thinking of her, of course!) to make things work! MmHmm. Phone & cam sex allow them to explore things they wouldn't normally try if they were together. They get each other to do things on cam ...although the last thing his girlfriend asked him to do involved a dildo & he wouldn't go there! So the dildo got a 'No!' but he has a definite wild side. He loves to be scratched & have his hair pulled & loves when a girl has a fight in her 'thinking? she will take charge. He loves 69 & lots of foreplay & loves a woman that can last for hours. One of his hottest memories from back home is fucking & having great sex in a public park in Budapest, Hungary. ?We were out of jail the same day. It was worth it!? The crowd watching & knowing they wouldn't be leaving on their own made it intense! ?NOW?, the long distance thing makes sense!?She's a freakSitting on the couch in a white tee, jeans & new sneaks, Mikael's model looks would be hard to miss. The broad shoulders, nice arms & the strong facial features on this 6'1 comrade would make anyone sneak a second peek. If that wasn't enough to grab your attention, the next thing that comes into view would?His fat cock! Pants undone & holding his massive brief-clad cock by its base, you get an idea of just how thick the barrel is on Mikael's weapon of choice. His jeans come off as he gives us a strip tease to show us his smooth ass. This import's ass isn't the only thing smooth; Mikael keeps everything smooth! Aside his nipples and a happy trail the razor fortunately spares; a large tattoo of a black panther on his chest is the only other thing accentuating a breath-taking, naturally smooth landscape. Oh, the lick-abilities are endless! Sitting back he finally pulls his briefs to one side & hauls out his aching 7?? cock giving us a preview as he works it over using both hands. All Hands on Deck! ?errrr, We mean DICK!Next, Mikael makes one unsuspecting cushion very happy! He begins to slowly hump away in, then out, of his boxer briefs, giving us an idea of what he looks like atop one of his conquests. His ass rises & falls as his muscular waist gyrates around & around like a seasoned salsa dancer. From soft & slow to fast & deep, he knows exactly what he's doing on top & in total control! With erotic shows like these, it's no wonder the cam sex has worked for so long! Standing with cock in hand, he continues to pleasure himself, slapping his thick meat against his palm for effect. He knows exactly what he's working with! His shaved balls grow tighter than before as he gets closer to unloading his sex pistol! He sits down as he jacks himself to completion. His soft moans & groans signal the impending & as he begins to climax he innately slides 3 of his long fingers into his mouth & sucks on them while he creams! We're not sure what that was about?but that was HOT! Mikael's a definite lover & the perfect choice for a day like today ?Valentine's!",
  "models": [
    {
      "name": "Mikael",
      "person_id": 27869
    }
  ],
  "release_date": "2008-02-14",
  "scene_id": 53813,
  "tags": [],
  "title": "Str8 With A Twist, Scene #01"
}