{
  "collections": [
    "Men Over 30"
  ],
  "description": "After a few months' hiatus, Miguel is back! Last time we saw Miguel was back around the 4th of July & we were pleased to find that Sexy Miguel is looking hotter than ever! This 35 yr. old Brazilian Bonbon can be summed up in one word ??GUSTOSO!? (i.e. delicious!) His defined chest is lightly dusted with man fur that centers between his chiseled pecs & north of his sexy nipples. His small cinnamon nips are hairless & so is everything south as the view ripples over his sun-kissed frame. The next patch of hair is at the base of his uncut cock. He says he's been trying to behave since we last saw him; but admits to having a rather wild time on his birthday while vacationing in the Bahamas. Seems a friend invited him to a party & when they arrived there were 25-30 people...all naked! Seems like it turned out to be an impromptu ?Surprise Birthday Party? that required no planning on their part. Just show up in your birthday suit & Enjoy! He definitely did that, Miguel is an equal opportunity type of lover & says no matter who you wanted they were open to it. What better than an all you can eat surf & turf smorgasbord on your special day!The camera begins to roll & Miguel is already rubbing his growing bone. He sits up & peels of his shirt revealing the new & improved Miguel! As he slowly takes his shirt off you can clearly see the abs, the lats & the sexy pits you just want to bury your face in. He teases you posing & flexing proud of the body he's been working on since we last saw him. The belt comes off & the pants fly open as he slides them off to reveal a sexy pair of tight fitting bikini briefs. He turns around & begins sliding them down over his muscular ass & as he bends over to slide them off completely you get a Full Moon over Rio de Janeiro. His ass & massive muscular thighs are amazing! When he turns back to face us he shows us the rest of the package...7 think uncut inches of Brazilian Beef!He lies back as he begins caressing his muscular inner thighs & abs as his cock continues to harden. In no time he has a raging 'pique dura' or major boner for those of us north of the equator! He bends over as he pushes his cock back to give us the rear view. His body is muscular & defined; his energy is raw & extremely sexual as he continues teasing us with his fat uncut cock that by now is throbbing for attention. He lays back and starts working his bone, first with one hand then the other, overhand then underhand, his cock requires a lot of special ?handling?. The closer he gets to climax the fatter his cock seems to get. His smooth balls get attention as well as he nears release. He begins to moan & at first grunt his Cock explodes sending its creamy content spilling over onto his rock hard lower abs. Whew! That's a heapin' helping of ?Sabor? ?served up Brazilian style!",
  "models": [
    {
      "name": "Miguel",
      "person_id": 27783
    }
  ],
  "release_date": "2008-02-28",
  "scene_id": 53818,
  "series": "Those Who Can't...Jerk!",
  "tags": [],
  "title": "Those Who Can't...Jerk!, Scene #02"
}