{
  "collections": [
    "Men Over 30"
  ],
  "description": "A couple weeks ago, we brought you a slice of home-grown beefcake, Mr. Michael Buck. Last time he was here, he confessed he loves a good group session whenever possible! So, we decided to get him into a 'select' group session...one with no females! We asked our recurring Florida favorite, Lee, to help us out with Michael's christening. Newly single and lookin' damn good?Lee was more than willing to oblige! This was Michael's first time on the ?Wild Side?, and in hind sight, his parting advice for any str8 boys on the fence about doing more was...?Don't knock it; 'til you've tried it!? Hmmm. Michael prides himself on being passionate and was surprised to find himself in good company. The look on his face as he grins, ear to ear, and points at Lee and says, ?He kisses good!? is classic! Lee's ultimate fuck would be a shot at Colin Ferrell, and Michael threw us for a loop when he said Beyonc? and Matthew McConaughey ?at the same time! Among Lee's sexual list of To-Do's is breaking in his backyard pool. Michael Buck smiles as he admits that his now include getting the chance to explore more of Lee's backyard, period! We like where this is going!Lee gets behind Michael on the couch and begins to break the ice by giving him a shoulder massage. His hands roam over his shoulders, his bulging biceps, and down his massive pecs as Michael just grins' his approval. By the time Lee is tugging at his shirt, Michael's doing some roaming of his own. As they both begin exploring each others tight bodies, they kneel shirtless, face to face, and continue their grope session as Lee begins licking Michael's nips. Michael fumbles for his belt, and as soon as his cock comes into view, Lee dives for it! Michael gasps as he gets his first taste of Lee's mouth! I guess it's true?Boys just do it better! He slowly feeds Lee his cock, and it isn't long before he gets curious enough and wants to return the favor! Lee lies back on the couch with Michael between his legs. His thick 7.5? cock is at Michael's lips, and he doesn't hesitate to take the plunge. He sucks Lees cock as Lee's eyes roll back in ecstasy. First time, huh? Hmmm.A scorching 69 is next on the menu as Michael takes top bunk. The view of his muscular ass and lumber jack thighs makes you wish you were the one beneath him. Gulp! Lee's nose buried in nothing but sack. For a first timer, Michael took to it like a Pro, swallowing all of Lee's cock down to the hilt! Next, Lee goes face down as Michael explores his backdoor. Slowly licking his fingers before sliding them in deep, Michael is in awe of the new toy he's uncovered. Something about watching a straight guy finger ass for the first time! Woof! The hot action continues with more oral as Michael gets on his knees to have more of Lee's meat. The look on Lee's face says it all as he writhes around moaning?loving every minute of it. Then, it's Lee's turn to take the ?buck? as they move to the bathroom doorway. Michael holds Lee's head as he bobs it up and down on his aching cock. The two then lay side by side as they stroke off to an explosive climax. Lee groans and grunts as he explodes, sending jizz everywhere! An appropriate finale for a scorching scene! We can't wait to see more from these two! Maybe give Michael an all-u-can-eat session in Lee's very own ?backyard?! Bon Appetit.",
  "models": [
    {
      "name": "Lee Covington",
      "person_id": 27836
    },
    {
      "name": "Michael Buck",
      "person_id": 27868
    }
  ],
  "release_date": "2008-01-31",
  "scene_id": 53810,
  "series": "Was It Good For You?",
  "tags": [],
  "title": "Was It Good For You?, Scene #02"
}