{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back this week for a refresher is our old friend Charlie! We couldn't think of a better bloke to christen in our new place. Smooth & muscular, this 31 year old South African native currently works as a personal trainer. He's lived abroad & is well traveled & in the spirit of trying different things to keep it exciting he's currently involved with his first Asian girl. She seems to be doing all the right moves so far. The only complaint we got was that even though she's OK with his love for giving her facials; she wont let him anywhere near her backdoor. What is she thinking!? Charlie's work keeps him in the gym a lot and it seems the more he works out & the bigger he becomes ...and the hornier he gets! He claims it's the all-natural supplements he takes to help him increase his muscle mass that rev up his sex drive. One look at 6' Charlie, 200 chiseled pounds of muscle with a thick uncut throbbing cock to boot, would rev up anybody's sex drive!Dressed in tight jeans and a form fitting tee, Charlie's already tuggin' on his cock before he even begins. He slowly peels off his shirt and shows off the merits of his profession. His massive pecs & bulging biceps would make anyone take a second look. He slowly undresses, all the while caressing his smooth, muscular 6' frame. He stands on the couch & as his jeans slide off you can clearly see the huge bulge growing in his sexy briefs. Charlie's cock is throbbing & in need of attention. He takes the show to the bathroom where he sits down & sits back to jack his bone. His thick uncut cock is aching for release as he strokes paying special attention to his glistening knob. From the throne to down on his knees, Charlie doesn't skip a beat. His foreskin dances over the spit shined knob as he teases, pulling it forward before jackin' it back! The look on his face is intense as he sighs & moans, thoroughly enjoying the attention he's giving his jock cock.Charlie then moves back to the couch where he decides to sit up on the back of it affording us a spectacular view from below. His cock is deliciously thick from the base to the tip & his smooth balls dance in sync with his every stroke. You can see the muscular ass just below them as he spreads wide for a better look. Fortunately, you don't need to strain for long as he gets up & places one knee on the couch & leans forward. There couldn't be a better position to showcase his muscular ass & thighs. Well, maybe a couple, but he's straight & well...you know! The view from behind is amazing! It's as if you were behind him at the gym while he showing a client how to properly execute a bent-over row ?except he's buck ass nekid! His cock is ready for release & he moves into position to do just that. Sitting on the floor, legs spread wide, Charlie jacks his cock & tugs on his heavy balls. His heavy breathing gives you an idea of what's cumming; and with a grunt?he does!! His creamy load erupts like Mount Kilimanjaro, spilling over, forming a thick pool of hot man lava below.",
  "models": [
    {
      "name": "Charlie Xavier",
      "person_id": 27898
    }
  ],
  "release_date": "2008-02-07",
  "scene_id": 53811,
  "tags": [],
  "title": "An Old Friend, Scene #01"
}