{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we brought back two local fan favorites to see what kind of fireworks would ensue if left alone in a room. Lee, 31 has been on MenOver30 in both solo & scorching duos & has always been popular with our viewers. He works in the service industry down here & admits though no one has yet to place his face; he gets the old ?I know you from somewhere? a lot; laughing as he dismisses them by saying he just goes out a lot! We bet! Chad, one of our original dirty dozen is also a South Florida native. This time we thought to ask our studs what little known fact about them would we be shocked to discover? Chad, seemingly the epitome of ?Prep?, laughs when he admits he actually loves leather! Lee grins as he confesses that even though he can cook ?he pretends he doesn't! Sly Dawg! ...Oh yeah, He also loves the leather scene! Well, leather bars might be the only thing these two have in common; since Lee loves dark twisted movies & Chad loves old Black & white cinema. Even their ideal settings for their fantasy ?sexcapades? are opposites. Lee wants to have a hot sex session out in the desert or in a canyon; where Chad prefers to have a sex session near or on the water! Well, if it works on a plate, it will work in a room! ...Surf & Turf anyone??The chemistry is apparent as these two waste little time in getting to it. They make out passionately as they begin to undress each other. These two are naked in no time & begin exploring each other orally. Chad starts off sucking Lees aching cock as you hear Lee moaning in appreciation & it isn't long before Lee has Chad sit back so that he can return the favor. Chad lies down on the couch as Lee kneels, straddling his chest as he feeds him more of his thick cock. Chad laps at his nuts & swallows his shaft to the hilt with ease. They go back & forth swapping blowjobs getting to know each a LOT better! They are both lean & defined & the hours in the gym has paid off well for these two. Chad stands in front of Lee as he lowers his throbbing cock into Lee's expert mouth. He swallows his cock with ease & it doesn't take long before his expert tongue finds hotter pastures just south of Chad's smooth balls. Lee buries his face deep into Chad's smooth ass sending Chad into a frenzy. The look on Chad's face says it all as Lee rims his sweet ass. Fortunately for Lee, Chad believes its always better to give than to receive! This is gonna be good!!Bent over on all four, Chad buries his cock into Lee's waiting ass. His balls slapping Lee's perfect bubble butt as it takes him ball deep. Lee moans as he enjoys every thick inch of Chad's bone. The fun is just beginning. Its Lee's turn to pitch as Chad bends over to give it up. Lee slides his aching cock into Chad's ass as he pounds him doggie style. The chemistry between these two is perfect & it's obvious they are totally into each other. Lee sits back on the couch & watches as Chad sits on his thick cock. Chad jerks off as he rides Lee's throbbing cock which seems to be hitting him in ALL the right spots. Chad grinds down on Lees cock as he moans & erupts, sending volley after volley of cum exploding everywhere! Whew! That was a nice load! Chad, then goes to work on Lee's nuts as Lee strokes off another huge load that erupts, cascading down all over his cock, balls ...and Chad's face & chest! Well, we wanted to find out what kind of fireworks would ensue & that's exactly what we got! Fireworks?with an explosive finale!",
  "models": [
    {
      "name": "Lee Covington",
      "person_id": 27836
    },
    {
      "name": "Chad",
      "person_id": 29924
    }
  ],
  "release_date": "2008-02-21",
  "scene_id": 53815,
  "series": "Versatility",
  "tags": [],
  "title": "Versatility, Scene #01"
}