{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week, after popular demand, we brought back beefy Michael Buck. This is Michael's second foray into the world of Man-to-Man sex. After his first solo, Michael agreed to experiment with another guy, which led to his first time with another native Floridian, Lee a couple weeks later. It was an unforgettable experience that left Michael wanting more. At 30 years of age, standing 6' tall with a solid muscular build, his rugged exterior by no means defines him. Michael is, however, getting better acquainted with what the other side is willing to offer. We are more than happy to help out. One woman just isn't enough for Mr. Buck, even though he's back with his ex and living in Ft. Lauderdale. We're glad he's decided to 'share the horny wealth' with us. Sean, who was first featured on our brother site ExtraBigDicks, is 20 years old and a native New Yorker. He is now living in Ft. Lauderdale as well. He's a lean 165 pounds on a 6'3 boyish frame with a thick man-sized cock to boot. He recently had some of the best sex he's had in ages when he reunited with an ex as well! Seems like neither of these boys have trouble going back for seconds when the gettin' is good. Fortunately for us, while the ex's are away ?these two intend to stray! Play on, Playahs!Sitting side by side on the couch, Michael's already tuggin at his dick before they've even begun. Michael flexes his big gun for Sean, who reaches over for a quick feel and seizes the opportunity to go in for a kiss. Michael, caught off guard, recovers in seconds as he begins to passionately kiss him back. Sean tongues Michael's muscular neck and shoulder as they lose what inhibitions they may have had. Michael's shirt comes off as Sean goes crazy licking the muscular wonderland that lay before him. His nipples, his pits, even his huge biceps are among the new toys to be savored and explored. Michael just grins as he allows young Sean to have his way with him. Michael then straddles young Sean to continue flexing for him while Sean looks up in awe of what years of dedication and discipline have earned Mr. Buck. Michael then begins to kiss Sean's neck, gradually sliding down to the floor as he kisses and licks his way to Sean's swelling cock. Michael, now on all fours, wastes no time as he hauls out Sean's thick cock and swallows it!Sean's cock is rock hard in seconds as he bobs Michael's head up and down on his throbbing 8? fuck pole. The look on Sean's face says it all as he lies back to enjoy all of Michael's efforts. He needs a better position as he lays Michael down and straddles his face giving him a slow sensual face fuck. Michael just licks and laps at Sean's meat. Sean slaps Michaels face and moans as he slides every inch into Michael's novice throat. Michael is loving every second of it as young Sean fucks his spit-shined face. Even after gagging on it a few times, Michael isn't deterred. He knows what he wants! Sean patiently continues feeding him dick and regularly ordering the straight boy to suck his cock! Feeling left out, Sean pulls out, moves behind him as he slides his cock back into Michael's hungry mouth, and leans forward for some of Michael's! Michael moans his approval with his mouth stuffed full of Sean's cock. Locked in a 69 position, these two won't last much longer! They break up their 69 and sit back to get their aching cocks off. Sean, sitting behind Michael, is the first to explode. He groans and unloads as his jizz coats Michael's right shoulder, cascading down his hard pecs! The feel of Sean's hot load coating his shoulder and pecs is too much, sending him over the edge as he too busts his thick nut! From the looks of things, we have a feeling we'll be seeing a lot more of Mr. Buck. And a lot more of hung Sean wouldn't be bad either!",
  "models": [
    {
      "name": "Michael Buck",
      "person_id": 27868
    },
    {
      "name": "Sean",
      "person_id": 27941
    }
  ],
  "release_date": "2008-03-13",
  "scene_id": 53822,
  "series": "My Kinda Guy",
  "tags": [],
  "title": "My Kinda Guy, Scene #02"
}