{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week, we bring you Brandon Fox. At 6' tall, weighing a solid 190 lbs., this steel blue-eyed stud is a recent addition to the MenOver30 club, having just turned 30 a few months back. He lives in San Diego now; but, originally this corn-fed hottie is from Chicago. He loves the West coast, because Surfing isn't all that easy to do in Lake Michigan. He is soft spoken and well mannered, and his smile could brighten any room. He laughs recounting how he met his last sexual experience. It was with a girl he met a while back while dancing at a bachelorette party. Brandon's a stripper who apparently delivers. It seems this girl fed him so many cocktails that he had to spend the night. Everything was going according to her plans until Brandon couldn't hold his liquor. ?Clean up on Aisle 7!? After she cleaned up his mess, she asked ?I cleaned up all that and you're not even going to fuck me?? Well, she got what she wanted, and ended up giving him more money the following morning! I guess it paid off for her too; because he's been getting together with her for a while now. Some girls have ALL the luck! Brandon is extremely charming and his dancing's been a side gig to help him through school. Now interning at a law firm, after graduating with a double major in Criminal Justice and Communications, he's not your average go-go boy! We can assure you there isn't anything ?average? about him.Wearing distressed blue jeans and an athletic zip down muscle shirt, Brandon is ready to give us what we want. He slowly peels down the zipper as more and more of his defined chest and abs come into view. He runs his hand along his abs as he makes his way to his pants. He undoes his belt and unbuttons the doors that house his swelling cock. Reaching in to offer assistance to his cock, Brandon sighs as his hands first touch his shaft. His jeans have to go, and he loses them in seconds. He is left in his tight bikini cut briefs that are straining to hold his thick cock. Brandon pulls his aching cock out as he tugs his underwear to one side. His cock is more than a handful?or mouthful for that matter. His 7? cock is incredibly thick from the base to the crowning knob. This boy isn't just packing one hell of a fuck stick?it's a torpedo! He strokes it for us, teasing us before standing up to give us a better view. His briefs come off as he goes at it. His crotch is kept hairless, like every other lickable inch of his defined body. Oh the possibilities!He turns around and gives us our first view of his jaw-dropping ass. Kneeling on the chair, he bends over giving us a spectacular view of his ass as he strokes his cock and teases his smooth hole with his fingers. This stud knows just how to make you want more of him. Cocktails anyone? He moans and groans as he jerks his cock, which only heightens the sexual tension. He then flips over on his back to continue fisting his swollen cock. An overhead view shows off his body. The definition in his broad shoulders, the defined pecs that sit atop his muscular abdominals is breath-taking. His facial expressions are insanely erotic as his eyebrows furl with pleasure. He bites his lips as he caresses his navel. He won't hold it much longer as he begins to intensify his jacking. He is panting by now and moaning as we here the words we've been waiting for, ?Oh yeah, I'm gonna cum!? ?and does he ever! His torpedo unloads firing jet after thick jet of breeder batter, splattering up towards his chest. The first three hit his pecs, the rest that follow coat his upper abs. Whew! We're feeling light headed for him!",
  "models": [
    {
      "name": "Brandon Fox",
      "person_id": 27885
    }
  ],
  "release_date": "2008-03-20",
  "scene_id": 53824,
  "tags": [],
  "title": "Fox Hunt, Scene #02"
}