{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brian Green, a solid 225 pounds of inked muscle, is our discovery this week. He works out 5-6 days a week and can now eat whatever he wants. He has come a long way and the results really show! This Florida native has been working on his massive body since he was about 15. Junior High was an especially busy period in his life. He got his first tattoo then, which led to more, and his first piece of ass...which also led to more! He lost it to a girl who was bout the same age. ?For the whole 20 seconds, I kept on fuckin'!? he laughs. Once he got a taste ?he was hooked! Brian is a sex freak and needs it several times a day. Working out doesn't help matters any. He's always horny. He smiles when he says he doesn't have any fantasies he hasn't realized. He's had a lot of sex. We bet! He even got his ex-girlfriend to take his cock in the Kmart dressing room. Attention Kmart Shoppers! One of the hottest experiences he's had to date though was banging a stripper up in Daytona. She let him do a bunch of things his ex-girlfriend never let him do. He got his first taste of anal and pulled out and pumped a huge nut all over her face. His ex never let him do either. Whew! From pumping iron in the gym to pumping stripper's faces full of jizz, Mr. Green is ready 24/7 ...So it's bout time he pumps a load out for us.Wearing a tight fitting tee, Brian begins to show off his huge guns. They're massive and inked. He flexes for us, first his left, then his right, allowing us to get a good view of the hard work he's put in at the gym. His shirt comes off, and he's left in a tank to continue his show. His latts are amazing, and in no time, his pants are on their way to the floor as well. In his boxers, he gives a quick flex of his massive quads and a sneak peak at the muscular ass you could....well, never mind. He sits back and starts to grope his cock; his smooth nuts and short cropped bush popping in and out of view. He sits back and kicks off his boxers and begins stroking his meat. Brian's buff body is remarkably defined and smooth - the only fur being the small triangular patch at the base of his swollen cock. He bites his lip as he strokes off. His facial features are unmistakably masculine. His green eyes and sexy goatee which further accents his square jaw line and cleft chin are mesmerizing as he looks right at you. This big boy means business!Lying back against the chair, his pecs look amazing in profile. His massive arms and forearms ripple as the muscles they contain move in tune with his jacking. He stands up to give us a better view, and the view is amazing. His large frame V's into a small waist before flaring back out from the top of his massive thighs, followed by calves that are as pumped. His ass, two perfectly round orbs, living in harmony. Why can't we all get along that well? His smooth nuts are pulled closer to his cock now, and the inevitable is near. Brian lays down to finish jerking off. He moans slightly, and you know he's getting close to show time! He grunts, and seconds later his first huge jet of jizm splatters up along his side, dripping south as it coats his smooth skin. The reinforcements that follow land on his defined abs and navel. Now we know just what that stripper got?without needing any goggles. Here's hoping in between workouts, Mr. Green remembers he's always welcome to come back and give us a little more ...of just what we're lookin for!",
  "models": [
    {
      "name": "Brian Green",
      "person_id": 27875
    }
  ],
  "release_date": "2008-03-27",
  "scene_id": 53825,
  "series": "Romancing Mr. Green",
  "tags": [],
  "title": "Romancing Mr. Green, Scene #01"
}