{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week, we have two of our fan favorites in for one steamy session. Scott Tanner, the 31 yr old Pennsylvania native, has made himself quite the following. It's hard to get enough of this Daddy's masculine sexuality, the piercing blue eyes, the impressive defined body or that rugged look that just screams ?MAN!? ...No questions asked. We've been fortunate enough to have had Scott come back several times in both solo and hardcore action to keep our viewers and us happy. This week, we're pairing him with another heart-breaker that too has his share of cocks throbbin', Mr. Tony Michaels. This is the first time on MenOver30 for Tony who was originally featured on our brother site CircleJerkBoys and has been causing quite the commotion ever since. This angel-faced playah is the perfect combination of street with an added touch of sweet?but don't let the look fool you! Originally from Georgia, Tony likes things big. ?Let it be Big? is his mantra and we try our best to accommodate that any chance we get.Not wasting any time, these two go at it, locking lips and freeing their hands to roam about, exploring the other's bodies. Tony zeroes in on Scott's growing cock as he gropes his swelling member. They kiss softly as they begin to undress. The jeans come off, and is isn't long before Tony releases Scott's aching cock to have his first taste. He drops to his knees and swallows Scott's meat to the hilt. Scott moans his appreciation as Tony works his cock. Scott stands, feeding more of his dick to Tony and giving him better access to his heavy nuts. Scott loves the attention he's getting, but he wants some cock too. He sits Tony down on the chair and goes down on him, returning the favor as Tony now gasps in awe. The chemistry is unmistakable as these two explore the other. This is sure to be one explosive scene. Next, Tony stands on the chair and lowers his sweet ass onto Scott's awaiting tongue. Tony moans as he feels Scott's expert tongue dart inside, hitting all the right spots. From riding his face to bent over in ecstasy, Scott can't get enough of Tony's perfect ass! Scott's had all he can take before needing to bury his bone. He gloves up and slowly pushes his fat 8? cock into Tony's hungry ass. Tony grimaces as his tight ass gets spread wide by its assailant. It's been a while since Tony had some, and Scott's loving the tight ass now wrapped around his aching cock. The looks on Tony's face says it all! It's pleasure and pain all wrapped into one delicious look. ?it hurts SOOOO Good!? They start off doggy as Tony slowly bucks back onto Scott's hard cock. Bent over the couch, pushed up against the wall, you name it, Tony takes it. The look of rapture on Scott's face tells its own tale as he continues to bury his bone. The next position is amazing, as Tony straddles Scott's cock and goes bouncy bounce. He can't seem to get enough, and soon they move to a horizontal position where Scott can really pound Tony's sweet ass. Scott drives his cock deep as they both writhe and moan. By the look on their faces, you know all good things must cum to an ?end? and when it does it's explosive. Tony lies back and explodes all over his navel and Scott kneels to bust his huge nut all over.",
  "models": [
    {
      "name": "Scott Tanner",
      "person_id": 27871
    },
    {
      "name": "Tony Michaels",
      "person_id": 27902
    }
  ],
  "release_date": "2008-04-03",
  "scene_id": 53827,
  "series": "May The Best Man Win",
  "tags": [],
  "title": "May The Best Man Win, Scene #01"
}