{
  "collections": [
    "Men Over 30"
  ],
  "description": "Alek would be the disarmingly cute tech that might go unnoticed ...until he flashed that sexy smile making any room a brighter place! He lost his virginity at the not-so-early age of 19 to a guy he couldn't resist & well...this bachelor's been making up for lost time ever since! An all out orgy with 7 men in a hot tub was his latest adventures & even though an orgy's the ultimate fantasy for many, Alek is holding out for a steamy tryst with a set of identical twins! Fortunately for us, Alek isn't shy about much. He loves to experiment & is willing to try anything sexual 'at least' once! ?I've never tried a sling; but I wouldn't mind trying that ...or a gang-bang maybe!? Need we say more? Needless to say, we love the way he thinks!Slowly teasing, Alek lifts up his shirt to reveal his firm abs as he begins exploring his abs & chest. Biting his lower lip as he caresses his chest & nips; he teasers his navel before running his fingers down his abs deviously diving into his shorts. Alek has clearly done this before. Teasing is an art for him & he works the camera like a pro! He peels off his tee kissing one of his muscular ?guns? as he does. The shorts are next, leaving him in a tight fitting pair of boxer briefs. Those are short lived as he strips bare & goes down on his knees to continue the floor show. Stroking his cock as he starts sucking his fingers in what is becoming an increasingly erotic bare-all! The chair is his next venue as he climbs aboard & spreads wide. His perfectly smooth bubble butt is amazing & what he does to it next takes everything to a hotter level. Slowly teasing his hole he slowly begins to explore h is backfield. First teasing it lightly then slipping his fingers into his manhole! He bucks back onto his digits as he continue finger fucking himself. The look on his face says it all. He licks & sucks his finger & sends it back for more! WOOF! That's what we all want right about now...MORE!!On his back now, Alek begins giving his cock the attention its been asking for since his hands first invaded its cotton clad confines. He tugs on his heavy, smooth nuts as he jacks off. Over hand, underhand,, switching hands ...you name it?he does it! Using spit to lube his meat he strokes his cock vigorously as it gets harder & harder. Alek never forgets to pay attention to his low hangers that are now aching for release. He stares attentively at his fuck stick as his hand becomes a blur jackin in high speed. Alek's face begins to transform into one of imminent release. His spare hand release his nuts as it pins down his swollen cock at the base making his cock swell even more. His cock is at full throttle & seconds form exploding as you hear Alek begin to whimper & moan signaling the finale we've been waiting for has arrived. . Alek is a moaner! Mmmmm A grunt, a groan?& a gush of goo splatters across his sexy navel as his cock continues to throb! Whew!. Alek may be the birthday boy; but he just gave us one hell of a birthday show! We guess it's true, ?It is better to give than to receive!? ...Who knew?",
  "models": [
    {
      "name": "Alek",
      "person_id": 27799
    }
  ],
  "release_date": "2008-03-06",
  "scene_id": 53820,
  "series": "Who Knew?",
  "tags": [],
  "title": "Who Knew?, Scene #02"
}