{
  "collections": [
    "Men Over 30"
  ],
  "description": "Jon was a shy late bloomer, having his first sexual experience when he was in college. He met an older woman who taught him the ropes. He laughs as he remembers how he went at her ?porn style?, which ended up repulsing her. She was able to get him to slow his roll and teach him the proper way to get his groove on. Now 35, Jon's made up for lost time, and loves to pursue what he wants. He doesn't take himself or anything too seriously. He likes to just be himself, and feels that's the key to picking up women. There are so many pretentious jerks out there that have no clue on what a woman likes. With a body like Jon's, we're sure there are a lot of things women might want. His arms and thighs are massive, as are the shoulders that anchor his defined chest. Everything about Jon screams ?BIG?; including the big smile that lights up his face. He loves women who are big too. Big tits, big ass, big nipples and hips: ?I like her if she is dressed to look vulgar!? he gleams. He has a nipple fetish, and loves a woman that isn't afraid to explore her backdoor. His ultimate fantasy would be to be with two big breasted babes who were into each other, as well as into him. Well, looking at Jon, we're sure we could all come up with some fantasies of our own. So let's take care of one of those fantasies right now...Dressed in tight jeans and a form-fitting muscle tee, Jon shows us the fruits of his labor. He goes through a rep of curls as his muscles writhe just below his skin. His chest muscles, as well as his biceps and triceps, all work in tandem as he continues his routine. He is incredibly lean, and as he oils up, it is easy to appreciate his muscular form. His chiseled features are an evident compliment to his strong body. His workout has him hornier than usual, as he pulls down his jockstrap to reveal a raging bone. He oils it up as well and begins jackin it. The sounds of the oil-slicked cock mingle with his moans and sighs to create quite the soundtrack to this workout session. His cock is rock hard as he continues stroking. The camera has endless angles with which to capture all that Jon has to offer. His physique is incredible. His large eyebrows arch expressively as he works his meat. He turns around and bends over, giving us a view of his forbidden zone. His taught muscular ass is amazing as he bends over to give us better access.Jon stands back up, and the camera goes above for an aerial shot of our muscled god in action. There isn't a bad angle on this stud. A close up of his throbbing cock reveals just how hard and in need of release it is. Precum pools and ebbs on the tip of his cock as he strokes his aching cock. He leans back against the lockers as he gets closer and closer to releasing his load. He begins stroking faster and faster, twirling his well lubed hand in circles around his knob, and that does the trick. He begins to moan aloud as his pace quickens. The first of his load oozes out into his own hand which is still set to rapid fire and as it does, it further lubes his pistoning cock. His cock is now swimming in his own juices as he suddenly grunts out and braces for his orgasm. Sure enough, his cock spews forth a rope, followed by another of thick muscle boy jizz. He is still moaning as a few more shots are milked out, leaving our muscular stud spent and glistening. Whew! Where is there a towel boy when you need one?",
  "models": [
    {
      "name": "John King",
      "person_id": 27876
    }
  ],
  "release_date": "2008-04-10",
  "scene_id": 53829,
  "tags": [],
  "title": "Pre-Workout, Scene #01"
}