{
  "collections": [
    "Men Over 30"
  ],
  "description": "Park Wiley is back again this week and we brought along a friend for him to meet. Park, along with his newfound friend Gary, is going to give us a better idea of his many talents at work. Gary is a straight boy who loves to surf the shore and hot, crazy chicks. He loves girls who are into kinky things, like letting him finger and lick their asses. Some girls are weirded out by it; but the one's that aren't ?are always a lot more fun. He loves anal, and today he has decided to see what it feels like when he pulls a backside on a babe with his fat surfer cock. This way, next time he's with a girl that's scared of anal, he can tell em with his big grin ?Listen, I've done it ...it'll be fine!? WHOA. We're pretty sure once those pearls of wisdom fall out of his mouth; she might have second thoughts of her own. Then again he does like the freaky ones so... that might just be a turn on. Park, the consummate professional, is gonna get to play a different starting position as pitcher vs. his usual spot 'behind bat' as catcher. This should be a fun exhibition game of sorts, featuring two hot players in brand new positions. ?Batter up! (no pun intended)Side by side in bed, Park and Gary waste little time getting acquainted. Their shirts come off as they intertwine tongues in a series of passionate kisses. This straight boy sure can kiss. Gary undoes his jeans and Park immediately goes for it, sucking his thick cock to the hilt. Gary loves the attention he's getting, but soon enough, his own curiosity piques, and wants to try some of that as well. They get into a steamy 69 position, where Gary gets to try his hand at sucking dick. He licks his cock and laps at Park's nuts while Park is more into swallowing Gary's surfer cock. From there, Park lies back and lets Gary show him just how he loves to eat ass. This is clearly familiar territory for surfer boy! Park goes crazy as Gary's tongue darts expertly around his ass. Park gets the rimming of his life, and it only makes him hornier and hornier. Soon, he wants more than oral, as he puts Gary on all four and gets into position. Park's gonna be the first to break this straight boy in!?First time, brah, take it easy.? are his last words as Park begins pushing his thick cock inside. In no time, he's pounding away at Gary's ass while Gary winces trying to accommodate his first cock. Park is nailing Gary and loving every minute of it in this position. Missionary is next, as Park slides his cock in deep. ?Whoa ?I can feel that in my stomach!? Gary protests as he gets his cherry split. ?Take it like a man!? Park orders as he continues fucking him harder. It isn't long before he relaxes enough to take it deep and Park goes to town on his sweet hole. He pounds his ass missionary, then up in a pile driver position as you watch his nuts bouncing on Gary's smooth ass. Gary's loving it, as he holds his legs up in the air giving Park better access. Park then goes back to doggie and fucks the hell out of his ass. Soon, Gary's taunting Park for his load, wanting it all over his back. The dirty talk is enough to send Mr. Wiley over the edge as he pulls out and explodes all over Gary's fresh-fucked hole. Gary flips around and gets his bat off with a little help from Park, sending his own load flying in the air. We have a feeling our straight surfer boy would agree, this scene was totally sick, Brah! Surfs up.",
  "models": [
    {
      "name": "Park Wiley",
      "person_id": 27892
    },
    {
      "name": "Gary",
      "person_id": 27942
    }
  ],
  "release_date": "2008-05-15",
  "scene_id": 53839,
  "tags": [],
  "title": "White Heat, Scene #01"
}