{
  "collections": [
    "Men Over 30"
  ],
  "description": "Park Wiley is 32 and has quite the following in the adult industry. His name is recognized in the industry since he's done a lot of work and has even been nominated for awards. He is laid back and personable and not an ounce of attitude to him. He has a rugged look to him with his hair cropped short. His light eyes would catch any one's attention. He is currently single but sorta dating someone and slowly working towards something steady. He met him out at a local bar in L.A. and what started out as palling around while he was trying to pick up a cute 20 something twink led to them hooking up instead. He told him he did porn the next morning so he would know up front. Fortunately, the new beau didn't mind at all. He gets to play versatile in his private life as opposed to being primarily a bottom on cam. Park is very sexual and even prefers straight porn to gay porn to get his rocks off. Something about watching a guy dominate a female totally does it for him. We're sure he's not the only one attracted to watching straight boys in action. Straight boys aside, Park is gonna show us what he does when he needs to handle his business on his own.Straight porn rolling, Park starts to peel off his clothes. He loses his shirt and jeans and lies back in a tight fitting pair of black bikini briefs. He starts groping his growing cock through his underwear, teasing us as he plays with his cock that's beginning to come to life. He takes off his underwear and begins working his cock. He tugs on his heavy nuts as he lubes up and starts stroking his growing bone. He holds his nuts in one hand as his cock throbs to full mast. Paying attention to his balls as well as working his nips are the hot buttons that get him raring to go. His muscular frame ripples as he jacks his fat cock. His abs flex and the muscular definition in his chest and shoulders are easily visible. He works hard to keep his body in peak shape and it shows. He gets up on the chair and gives us a view of his infamous ass. His smooth ass is amazing as he teases it, bent over the chair. Now we can see why he's an award nominated porn star?it's that ass!He lies back in the chair and continues stroking his cock. He works his nipples as he focuses on the straight flick in front of him. His face clearly shows his intent as he strokes faster and faster. His cock is throbbing and by now aching for release. His once heavy nut sack is pulled up tight and ready to blow a huge nut. He focuses on the head of his cock as he starts jerkin faster. He moans as he gets closer and closer to busting his nut. His muscular body is tensing up and there's no mistaking what's to come. He lets out a loud grunt and seconds later?he explodes! He shoots his nut straight up n the air landing on the chair and his thigh and sending the rest to form a thick puddle in his crotch. Yeah, this boy knows exactly what to do. We need to get Park back here to show us just what kind of bottom fun has him nominated. We have a pretty good idea he wouldn't mind coming back one bit!",
  "models": [
    {
      "name": "Park Wiley",
      "person_id": 27892
    }
  ],
  "release_date": "2008-05-08",
  "scene_id": 53838,
  "series": "Round 1",
  "tags": [],
  "title": "Round 1, Scene #02"
}