{
  "collections": [
    "Men Over 30"
  ],
  "description": "From the moment Parker Williams first appeared on the pages of MenOver30.com, he was virtually canonized as the Patriot Saint of ?Real Men in their Prime?. He had a universal following that included fellow experienced studs like Matthew, the young and tender Luke Riley, and - judging from the avalanche of fan mail he receives, everyone in between. This is far from a case of much ado about nothing, as when you are talking about Parker Williams, this is the man with everything: a handsome face, rock solid body, fur covered chest, an always hungry hard cock, a beautiful ass and oh yes, if that was not enough, a personality that had us all doodling his name next to ours from the word ?hello.? Macho, in charge, and always in control. A funny thing happened today in the studio: we brought in Matthew Ford, a new-ish Daddy who has been making the rounds for the past year or so, and something clicked. The always unflappable Parker was almost giddy to the point that, after a session that even had the camera needing a cigarette when we were done filming, he took over the ?Man Talk? segment and needed to go back for more- but before we ?cum? to the end, let us tell you what ignited the spark in the first place.When we saw Matthew sitting on the floor with Parker's arms wrapped around him, we'll admit to a pang of jealously. When we had to break their gaze just to introduce them to you, we felt like a third wheel for a moment. But the chemistry is just right like it is with this sexy twosome. Not even the lights and cameras could take this train off the track to orgasm land. Parker leans down and does not as much as kiss Matthew as he tries to suck his tongue right out of that mouth while he scrambles to get Matthew's shirt off ? and somehow manages to do so without breaking their lip lock. Not to be left entirely to fend for himself, Matthew manages to undo both his pants and Parker's to free those throbbing, rock hard cocks as they head for bathroom to take a shower ? but never quite make it there. Their passion stopping them at the doorway, they resume their game of hide and seek with each other's tongues while grinding those oozing cocks together in a fertility dance as tribal as it is primal.  They never did quite make it to the shower, as Matthew took one look at Parker's leaking dick and immediately felt...thirsty.He own hand free-cock at 90 degrees, Matthew devours Parker's meat right to his short and curlies. Parker fucks his face and reaches down to slap Matthew's inked, round ass cheeks. Matthew looks up in a gaze both purposeful and loving as Parker decided this dirty man needs a cleaning up in the shower after all. Somewhere along the short two foot walk to the bathroom, Parker rediscovers his inner cock-sucker. If the groans coming from Matthew are any indication, it was none too soon. Moving back to the couch, Parker gets Matthew on all fours, kneels behinds him, and gives that dick a reverse suck that carries his tongue up and into Matthew's hole. That was enough to send them both to the point of no return, which in this case has Matthew on his back and Parker standing over him. The soft brown hair on Matthew's stomach is soon covered in massive white load of his own spunk, and then his cheeks and lips receive some special attention as Parker covers them with a protein facial. If experience is the best teacher, all we can say is, where do we sign up for this class?",
  "models": [
    {
      "name": "Parker Williams",
      "person_id": 27870
    },
    {
      "name": "Matthew Ford",
      "person_id": 27874
    }
  ],
  "release_date": "2008-04-24",
  "scene_id": 53833,
  "series": "Oral Dawgs",
  "tags": [],
  "title": "Oral Dawgs, Scene #01"
}