{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brian is back! Thirty year old Brian is originally from Fort Lauderdale, FL. He was first featured on MenOver30 a couple months ago and the 225 lbs of solid, inked muscle was a huge hit! Brian is a horny one always lookin' to get his nut. From K-mart dressing rooms to a friend's bachelor party where he banged the stripper in the shower while his drunken friends listened in, nothing is off-limits. His hottest experience is still that stripper in Daytona Beach that gave him his first taste of anal. ?It felt good?real tight!? he beams. Backdoor Boning instantly became Brian's favorite. He loves a girl with a nice ass and even though he loves to do all sorts of things with a girl's backdoor; he adamantly admits his sweet ass is strictly an exit and won't let any girl near it though many have tried. Damn Shame. Brian doesn't have any sexual fantasies he hasn't already realized so this adventure-seeking stud has quite the track record. His celebrity fantasy would have to be Jessica Simpson because she has a sweet ass. He loves 3-somes with other girls and if they're bisexual even better. Mr. ?Horndog? Green is back to show off his muscular body, ink and a little more of what we all wanted...more Brian!Brian starts off by peeling off his polo & flexes his huge guns for us showing off his ink and hard work at the gym. His back, and shoulders, his defined chest is on display as he poses. His jeans come off next as he begins working his growing cock through his boxers. He slowly makes his way to the bathroom where he drops his boxers and gives us a preview of that perfect bubble butt. A bubble bath awaits and Brian quickly slips into the warm water. His ass is glistening as the soapy water washes over it as he humps into the water. He turns over and soaps up his massive chest. He washes his abs, his pits and his cock. He can scrub all he wants?it still won't wash the ?dirty' off him. No Sir. He gets out of the bath and dries himself off before returning to the room to take care of business. Leaning up against the door frame, Brian starts to tug at his cock which is hard in no time. His massive bod looks amazing as he starts jerking off up against the wall.He moves to the chair where he sits back and continues his stroke session. His cock is throbbing by now and the view of his hairless body is intoxicating. His massive thighs and tight navel provide the backdrop for the stroking session. He pins his cock down at the base with one hand while stroking his knob with the other. Spit-shines and aching, his cock is straining for release. He stands up to give us a better view of all he has to offer and strokes a bit before returning to the couch where he can lie back and give his cock the attention it deserves. From lying down to sitting down there are no bad angles when you watch Mr. Green stroke his meat. His smooth nut sack is pulled up tight and Brian begins to tense up seconds before moaning and releasing his load. He sprays all over the couch as he sends jet after jet of seed onto the couch below. That was quite a workout and here's hoping we get to see more ...and soon!",
  "models": [
    {
      "name": "Brian Green",
      "person_id": 27875
    }
  ],
  "release_date": "2008-05-01",
  "scene_id": 53836,
  "tags": [],
  "title": "You Just Wait & See, Scene #02"
}