{
  "collections": [
    "Men Over 30"
  ],
  "description": "Matthew Ford is this week's MenOver30 morsel. Originally from Kentucky, Matthew just got into the industry on a fluke this year, and it's working out really well. ?I like sex, what can I say?? Knowing there will be thousands watching him once he's done is enough to get him rock hard and ready. See, Matthew's a bit of an exhibitionist. It totally turns him on being filmed either in an action scene or even during his first solo ever ...which he's about to do for us. He's 42 and a big Southern boy! He has broad shoulders, flanked by large biceps that frame his wide furry chest. His look is very masculine, down to the throw back handle-bar 'stache. His face is masculine with a squared jaw and a sexy cleft in his chin. He is energetic, and his face lights up when he flashes his down-home southern smile. We can't wait to see what this slice of Kentucky has to offer. Besides, we could all use a lil KY now and then.Matthew starts fondling his swelling cock through his jeans, tugging at it and shaking it to get it rock hard. He tweaks his hard nips, working them both at the same time to get the juices flowing. He spits on them and flicks them as he slowly takes off his t-shirt. He stands and undoes his jeans as he continues working his tits. He mutters under his breath about how much he loves having his tits worked, clamped down on, and bitten. He grunts as he squeezes one hard, as he pulls down his jeans far enough to send his rock hard cock springing free. He strokes his hard cock and squeezes out some precum to sample. Mr. Ford's a dirty, dirty boy! He tugs on his low hanging nuts and drops his pants. He turns around to show us his smooth ass. He has a big tatt of a seal that reads USDA PRIME?a fitting tattoo for the beefcake southerner. He bends over and gives us a show of his backdoor. Then Matthew sits back to show us more, as he begin to play with his cock and slowly explore his asshole. He grunts and groans as he pleasures himself.He shoves fingers up his ass as he strokes and he is loving every minute of it. His cock is rock hard as he teases his hole and works his nipples which are now just as hard as his cock. He spreads his legs wide and goes to town on his furry hole. The more he rubs his hole, the louder he moans as his legs slowly head North. Hmmm. Nothing's left out as he jerks his meat. His hot ass, throbbing cock, low hanging nuts, his erect nips?you name it ...He works it! And Matthew's not the quiet type. He's extremely verbal, which only adds to the visual before you. All this stroking and tweaking and fingering have Matthew too close to stop, and his climax is seconds away. He goes back to work on his cock and readily shoves a finger deep inside to trigger his explosion. Trigger it it does, as he groans aloud blasting his nut on his furry navel. There really ain't nothing quite like a lil Southern Hospitality now is there? We have a feeling we'll be seeing more of Mr. Ford, and soon!",
  "models": [
    {
      "name": "Matthew Ford",
      "person_id": 27874
    }
  ],
  "release_date": "2008-04-17",
  "scene_id": 53831,
  "series": "Common Interest",
  "tags": [],
  "title": "Common Interest, Scene #01"
}