{
  "collections": [
    "Men Over 30"
  ],
  "description": "Robbie Ireland is a lean defined slice of Irish hotness. Originally from Las Vegas, Robbie was in the area vacationing with friends when he decided ?Hey, I should do some porn for extra money!? Just another example of how tourism plays a vital role in keeping the economy going. He's currently single but has been getting to know a girl he met through friends for a few weeks now. Her job, she's a dominatrix, caught his attention and they've been getting better acquainted ever since. She wants to fuck him ...literally! Robbie is still considering it and even though he's let her play around back there; he's not completely sold on the idea ...yet. That kind of curiosity could lead to more than he could ever imagine. Well, by now we're sure he's already imagined all those scenarios; he's dating a Dominatrix for Pete's sake. He had a 3 some once with another guy and a girl but he was drunk, so he doesn't remember most of it. He does remember they took turns on her and there were an awful lot of high-fives involved. When asked if he'd consider doing something on cam with another guy, Robbie smiles and says maybe if the money was right?but I'd have to think about it. Robbie's got a lot on his mind these days. Alas there's hope for those of us wanting to see him doing a lot more than drunken madness. He confesses that he's ?heard? that gay guys give a lot better head so that would be worth looking into. It's only a matter of time, Mr. Ireland ...only a matter of time.  Slowly peeling off his tee, Robbie begins to explore his smooth torso. His abs are well defined as are his pecs. He is naturally smooth and one wonders how much fun it would be to run your tongue all over his?whoa! Sorry bout that. Where were we? Oh yeah, He undoes his jeans as they drop around his calves. He begins to grope his growing meat as it strains against his briefs. He leans back against the shower and continues pulling on his meat until it finds its way out of its cotton-clad confines. He pulls his briefs down showing off his hard cock and smooth balls. He's throbbing and giving us quite the show. He then turns around to show us the very ass his girlfriend id aching to tap. She has good reason to; his ass is hot. Perfectly smooth and round his compact ass is on display for us as he bends over and spreads 'em. He teases his pink hole with his fingers as he moans in ecstacy. He's done this before and we can tell he loves the attention he's giving himself out back. It won't be long before he'll want more than his finger tips grazing the surface. When he turns back around for us his cock is rock hard. He turns on the shower and lets the water run down his rippled frame. He moans aloud as he starts jerking off. His meat is at full mast and his smooth nuts are dripping as he stands underneath the cascade. Robbie's a moaner! Hell yeah he is. He loves it as he continues fisting his meat. He leans back against the shower stall as his cock throbs pointing towards the sky. His face contorts with pleasure as he continues jerking his rod. ?Feels so fuckin good? he moans as he strokes. From standing he drops to a crouch as he continues beating his meat. He looks hot as hell as he moans and groans. He then goes forward into a kneeling position all the while under the running water and keeps at it. Close ups of his knob as he works the end of his meat show just how swollen his meat has gotten. From there he lies down on the shower floor and prepares for his much anticipated climax. He goes to town on his wet cock. ?Oh yeah, I'm gonna fuckin bust a nut!? he repeats a few times as he signals the impending. His smooth nuts tighten and he grunts as his cock explodes sending his Irish cream all over his lower abs. This kind of Irish Cr?me is best served piping hot. Enjoy.",
  "models": [
    {
      "name": "Robbie Ireland",
      "person_id": 27882
    }
  ],
  "release_date": "2008-06-12",
  "scene_id": 53848,
  "series": "Irish Cream",
  "tags": [],
  "title": "Irish Cream, Scene #02"
}