{
  "collections": [
    "Men Over 30"
  ],
  "description": "Scott is back! Mr. Scott Tanner, the irresistible 31 year old Pennsylvanian, is back to give us a refresher on all that is ?Scott?. We have had the pleasure of working with Scott now for a while, and we couldn't ask for more when it comes to our ideal Man Over 30. He's charming, easy-going, sexy, has an amazing physique topped off by steel-blue eyes and a thick dick that just won't quit. Can we get an ?AMEN!?? Someone was first in line at the complete package window. Fortunately for Scott, he has the perfect companion that appreciates every inch he has to offer?all 8 of them actually. Scott met his match, oddly enough, on location in L.A. when they were both cast for a shoot. His better-half (if you can imagine that) is none other than Damien Rios. Scott and Damien were featured on our site last year, and the chemistry between these two is sizzling. Scott's happy to report that they've been together a year now and have a lot to look forward to together including possibly relocating. It's a symbiotic relationship that works perfectly right down to their roles at home: Scott = Top; Damien = Bottom / Scott = Cooks; Damien = Cleans. Perfect balance, yin and yang, critical mass, no matter what you call it, it takes its fair share of compromise and communication. Judging from these two, they seem to have everything covered. Speaking of ?everything covered?, we really wanna watch Scott here get completely un-covered so enough chit-chat ...and let's do this!Sitting on the couch in jeans and a tight fitting tee, Scott flashes us that bright smile that's made us weak from day one. He begins tugging at his crotch, slowly rousing the beast within. His tee comes off, and we get our first glimpse of that sexy chest with its light dusting of hair that covers his pecs and then meets in the middle, forming a happy highway, leading straight down to where it pools at the base of his monster cock. He loses his jeans in an instant and begins working his cock, which is ready to go. Kneeling on the couch, Scott gives us quite the show as he lubes up and begins jacking that thick meat of his. He takes it form the couch to the doorway as he leans back and continues working it. Close ups of his masculine face gives us a better appreciation of his attributes. His strong nose and angular features are amazing, and his short cropped hair and beard frame his face well. Mr. Tanner is unmistakably ALL MAN! ?A Man's Man? as the old adage would say. (pun definitely intended) He licks his palms to use his hot spit to lube up his now throbbing cock. His arms are glistening with his blond body hair, and his muscles flex as he strokes and pleasures himself.He's done with standing up and returns to the chair to continue his show. He sits back and spreads his thick muscular thighs wide as he takes hold of his massive cock again. Pinning it at the base with one hand, he goes to town on it with the other. He's broken a sweat, and the look on his face is one of complete focus with furled brow as he gets into his jerk off session. His smooth, heavy nuts hang below as he plays with his meat. No angle is a bad angle as we get different views of Scott whacking off. Watchin' him work his thick meat, it's easy to see why Damien's staying put! Scott's getting closer and closer to busting a nut, and his breathing is a dead give away. He gets off the chair and kneels on the hardwood floor below. Kneeling and bracing himself with one hand on the floor, he continues fisting his rock hard cock as he leans forward and picks up the pace. He looks amazing as his body writhes, and his breathing gets deeper and deeper. You know any minute this boy's gonna blow, and in no time, he lets out a series of moans, grunts and groans that would make anyone explode just hearing him. His body begins to quiver as he gets his first intense wave. His thick cock explodes, jetting stream after thick stream of cream splattering all over the floor below. Just when you think he's done, he gives you more moaning aloud the entire time. No wonder he's a recurring fan favorite. Whew I could use a cigarette?oh wait ...I don't even smoke!",
  "models": [
    {
      "name": "Scott Tanner",
      "person_id": 27871
    }
  ],
  "release_date": "2008-05-29",
  "scene_id": 53843,
  "series": "Rebel For A Cause",
  "tags": [],
  "title": "Rebel For A Cause, Scene #01"
}