{
  "collections": [
    "Men Over 30"
  ],
  "description": "Something's always cookin'' here at MenOver30. How else would we manage to keep things as hot as we do? So, today we brought in a sexy, imported chef to make our kitchen even hotter. Our old friend Charlie was in town so we decided to have him come in and give us a bit of a culinary presentation and show us just how well he can handle a thick cut of meat in our kitchen. For those of you who may not have met or seen Charlie before, he's 31 years of age and originally from South Africa and currently works as a personal trainer here in South Florida. Charlie became an instant favorite and has been featured here at MenOver30 several times. He has lived abroad and is well traveled so who better to show us the ropes? If nothing else we'll get to see this fine piece of man in his sexy apron whipping up more than breakfast. We're pretty sure he'll be working on a special sauce recipe that's sure to please the most discerning palette. Charlie's work keeps him in the gym a lot and we're sure he's mastered the art of the protein shake so maybe that's what we'll have him whip up for us?a thick protein shake with an extra boost of mad hot! One look at 6' Charlie, 200 chiseled pounds of muscle with a thick uncut throbbing cock to boot, would make anyone want some of that. ...and then some!Charlie is in the kitchen and we apparently missed the main dish; but that leaves us room for dessert. Dressed in a white apron, Charlie begins his clean up but finds himself a bit distracted by what he has packing beneath the apron. He leans back against the wall and begins to grope his cock which becomes visibly larger by the second. He turns around to show us just what he's got underneath his apron?nothing! His spectacular ass comes into full view. His ass is muscular and the view atop his thick thighs just show cases his dedication at the gym. He needs to sit back so he jumps up on the counter to keep working his cock. His cock is swollen as he pounds his cock. Its thick and his foreskin is silky as it glides the length of his shaft. Charlie is loving the attention he's giving himself. Bathed in sunlight, his muscular frame looks amazing. His massive pecs and biceps flex and twitch as he strokes his cock, working up a batter for us. His heavy balls hang below, dancing in tune to the beat of his cock.Charlie has to release his cock from time to time not wanting to release his batch too soon, everything has to be perfect for the creamy sauce he's preparing. His smooth body is delicious and it makes you wonder how that same body must drive the ladies crazy. Charlie's mouth is slightly parted as he begins to focus on the final stages of his masterpiece. His hands begin whipping the batter faster and faster and you know it won't be too long before he's ready to ?plate? his dish (pun completely intended). He moves the ingredients from the counter to the floor. The cool tile floor helps to keep the creamy sauce from over cooking apparently. Soon enough he's ready to go and won't be able to hold back much longer. He gets up on his knees and places the ?dish? (see pun above) in front of him. His massive cock hovers over the black plate below as Charlie continues pumping it furiously. He's moaning and groaning as his sauce thickens to a boil. He grunts and begins moaning aloud as his fat cock begins to unload thick splatters of piping hot cream all over the dish. His load is massive and coats the plate and floor around it. Voil?! his signature dish ?Cr?me de la Banane?. Some desserts are best served hot so, Gentlemen?Dessert is now served!",
  "models": [
    {
      "name": "Charlie Xavier",
      "person_id": 27898
    }
  ],
  "release_date": "2008-05-21",
  "scene_id": 53842,
  "tags": [],
  "title": "Occupational Hazard, Scene #02"
}