{
  "collections": [
    "Men Over 30"
  ],
  "description": "Matthew Ford is back for more fun. Matthew was last here a couple months ago and gave us an erotic solo that left many of you wanting more of his solid physique and hairy chest. Matthew is 38 and lives in Vegas. He got his start in the adult industry several months ago and has quickly made a name for himself. His solid build and adventurous personality have taken him places and afforded him a bevy of new experiences he would've never imagined a year ago. We're just glad he loves what he does and more than happy to have him back for more. This time Matthew will have help. Speedy is 22 and originally from South Florida. He's a hot little latin boy with a furry ass and a sex drive that won't quit. Speedy has been featured on our brother site CircleJerkBoys where his sexual curiosities have been put to good use. See, Speedy is straight but has discovered the erotic nature of ass play?and then some. ?Gay 4 Pay? is how he describes himself which works for us. Who are we to judge...right? Mathew is bisexual and says, even though he has no preference on whether they are straight or gay, he knows one thing's for sure?Straight boys don't kiss. ?That's the difference? he says as Speedy nods in agreement. I guess ?kissing is too intimate? for more than just Ms. Roberts. Hmm Who knew? Well, that's the last of our worries because we have much more on today's menu. So sit back, relax, grab your cock and enjoy. This is gonna be one hot, furry set! Sitting side by side Matthew and Speedy slowly start watchin porn as they begin breaking the ice. You can't always rush these straight boys. Wait! ?we're thinking of someone else. Speedy takes off his shirt then has Matt remove his shoes sox & shorts & in no time this straight boy's buck ass nekid. I guess we know why they call him ?speedy? Matt drops his lants to catch up as they sit side by side making small talk til Matt asks Speedy if he's straight. ?I think guys do it best...? he grins and that's all the permission Matthew needed. He goes down on Speedy's uncut cock and begins to service his growing cock. Speedy's loving it as he tells Matthew to suck his dick. ?I wanna fuck that mouth!? Speedy orders as Matt positions himself to have Speedy face fuck him. Speedy works his uncut cock inches from Matt's face as Matt works his hairy nuts. Speedy's bent over pile driving his cock deep into Matt's throat giving Matt access to his furry hole. Matt begins to explore Speedy's tight ass sending Speedy into a frenzy. Matt pursues that angle as he puts Speedy on all 4 and starts rimming his furry hole. Speedy's loving it as he bucks back onto Matt's skilled tongue. This kind of attention on our hot latin straight boy's ass is only gonna lead to one thing?DICK! ...and plenty of it. An overhead shot of Matthew slowly fucking Speedy's tight ass is all the confirmation you need to know that tongue wouldn't suffice. Matt grins ear to ear knowing he's taggin str8 boy ass. Speedy's in heaven getting his backdoor filled with Matthew's fat cock. Matthew holds Speedy's small waist as he begins fucking him harder. Speedy is taking it all like a champ. Speedy needs more control and decides to ride it. He straddles Matthew before impaling himself back on Matt's cock. He glides up and down with ease as he bounces up and down on Matt's rock hard cock. Matt can only moan and groan as Speedy rides him hard! As hot as riding a big fat cock can be, it has one major drawback. It hits your prostate in all the right places. Though that can be wonderful it can make you bust a nut a lot sooner than you'd like to. Well, Speedy rode himself into an early frenzy and in no time was ready to shoot his latin load having Matthews cock rammed up his ass. He groans and starts to shoot his load all over the place still riding Matt. His face is writhing in ecstasy as he nuts. Matthew's not too far behind and jacks off his own massive explosion leaving him exhausted and out of breath. Whew. Told you these two would be a hot set. WOOF!",
  "models": [
    {
      "name": "Speedy",
      "person_id": 27873
    },
    {
      "name": "Matthew Ford",
      "person_id": 27874
    }
  ],
  "release_date": "2008-06-19",
  "scene_id": 53850,
  "tags": [],
  "title": "Taking It All, Scene #02"
}