{
  "collections": [
    "Men Over 30"
  ],
  "description": "John King, our late bloomer that lost his virginity to an older woman in college, is back this week to give us another dose of all he has to offer. John was first here a few months back when he stripped off his clothes to reveal the amazing physique he hides. His bright smile hasn't wavered and since he was last here he has a new exciting story for us. Jon has a porn star girlfriend (Go figure!) and he recently filmed his first on cam scene with her. Apparently, it woke up the inner exhibitionist in him because he says he loved it. It was actually her idea he get into all this and we really appreciate having him show us everything she gets nightly. He's a horny one and needs to beat off at least 2 times a day. He's a personal trainer and we're sure that pumping all those weights and being surrounded by all the beautiful women in So. California give him plenty of wack-off material. He's so horny that one time in college his stripper girlfriend went down on him for a quickie and in the throws of his climax neither noticed til they were seated at dinner a few minutes later and had a ?Something About Mary? moment when one of her friends asked is ??What's that in your hair?? Now we know why Jon prefers to do the deed at home in the bedroom. MmHmm.Wearing a tight fighting, short sleeve button down shirt that hugs every muscular curve on his torso, John begins by flexing his huge guns for us. His biceps are massive. The dedication he has for the gym has really paid off. He removes his shirt and we see that massive chest flanked by his massive lats. He is smooth all over and as he pulls down his jeans just far enough to give his growing cock some room we see more definition. His chest is defined and the abs below take that definition way below the belt. He bends over as he pulls off his jeans. His muscular ass is now on display. What a spectacular ass it is too. His muscular ass is made up of two firm sculpted orbs living side by side in perfect harmony. Why can't we all get along? He stands back up and shows off his rock hard cock as he slowly begins to stroke it for us. His nuts are pulled up just below his aching rod as he strokes his meat as it gets thicker.He sits down to give us a better shot of his tool. He flexes his abs as his dick dances in time to the abs contractions...talented even below the belt. Mmmm. His massive thighs look delicious as he sits legs spread wide to jack that cock. He moves the floor show to the bed as he sits on the headboard and lubes up his meaty shaft; his hands gliding faster and faster over his slicked cock. The views on this stud are amazing. He turns around for us one more time to show us that as he knows we want a piece of. His nuts dangle below as he strokes his meat underhand. He's been stroking for a while and that cock won't be able to take much more. He lies back on the bed as he picks up the pace. It's time to give that aching cock the release it craves. He moans and groans as he signals the impending and with a short series of moans and groans he shoots. Spurt after spurt volley up and cascade back down over his fist and shaft pooling in a thick puddle of cream nestling into his short cropped pubes. One down, he'll need to work on his 2nd daily one later! Someone throw him a towel.",
  "models": [
    {
      "name": "John King",
      "person_id": 27876
    }
  ],
  "release_date": "2008-07-10",
  "scene_id": 53856,
  "tags": [],
  "title": "Round Two, Scene #02"
}