{
  "collections": [
    "Men Over 30"
  ],
  "description": "Rolling up in his sweet, skull-clad Suzuki Motorcycle, we have our returning bad boy, Brian Green. For those of you who haven't seen Mr. Green, he's 225 solid pounds of muscled ink. He's a rarity in these parts. We call them Florida natives. On occasion, it's nice to meet a stud that's actually from here! He's still as horny as ever, and still needs sex several times a day. Riding his motorcycle helps him attract ladies, since it's an obvious turn-on which just fuels his bad boy image. Brian is a new member of the MenOver30 club, and he smiles when he says he now feels old. Even though we assure him the older you get, the more self-assured you become, he blushes and says ?...maybe not for me.? Awww. Are you kidding? Just look-at-cha! The world is his oyster, this one. We asked Mr. Green what three things he would like to accomplish before he reaches 40. Buy a house, become a millionaire, and get married, was his reply. When asked what kind of girl would it take to get him to commit, he answered in true Brian Green fashion: ?She'd have to be normal, no Psychos?I've had plenty of those. She'd have to have a job, look like Jessica Simpson, and basically let me do anything I wanted in the bedroom!? He may need booze and a ton of singles on that hunt. But, at least he's sticking to small, attainable goals.Once inside our studio, Brian makes himself at home. He begins undoing his jeans. As he drops them, he begins showing us his merits. His massive quads are flexed individually for us to wonder at. He's massive, and the discipline he executes to keep himself in tip-top shape is more than evident. Turning around, he lifts his boxers and playfully grabs his meaty ass as he grins. His ass just makes you wanna...never mind.  He goes face down on the couch and begins slowly dry humping into it. His heavy nut sack rising and falling as his ass thrusts into the leather below. He then gets up to start working his cock. He loses his tank and stands near the bathroom doorway as his swollen cock is now getting the attention it needs. His smooth balls, nestled between his massive thighs, bounce as he strokes off. He then lies back down to give us different views. An overhead shot gives us a closer look at his ink, as well as his massive frame. His cock is throbbing as he continues working it.Brian then sits back against the wall and smiles for us as he continues his teasing session. He is a big boy with a big bone in need of release. He moves over to the couch and kneels on it to keep working his cock. He strokes his dick hand over hand, underhand, and any number of combinations, all working up a huge nut he will soon need to release. He bites his lower lip as he focuses on his aching cock. His muscles dance and contract beneath his inked skin as he jerks off. He looks adamant as he begins to stroke his cock faster and faster. It won't be long now. Sure enough, his breathing begins to deepen, and just as he lets out a hard sigh, he blows. His cock shoots load after load, all over the leather below where it pools in creamy puddles. Whew. What a workout! Guess it's time to hit the showers, Mr. Green.",
  "models": [
    {
      "name": "Brian Green",
      "person_id": 27875
    }
  ],
  "release_date": "2008-06-26",
  "scene_id": 53852,
  "tags": [],
  "title": "Now You See Me..., Scene #02"
}