{
  "collections": [
    "Men Over 30"
  ],
  "description": "Charlie Rose and Brandon Fox did their first ever all male dual solo on cam this week. Charlie is back. For those of you who don't know Charlie, Charlie is 32 and was born in South Africa but has lived all over including Europe and South America. This time he came back with a friend who is no stranger to MenOver30, Mr. Brandon Fox. Brandon is a little more domestic. He's from the Windy City and this sexy slice of the Midwest now calls San Diego home. Brandon has done countless straight flix while Charlie's done a few. Brandon admits the secret to doing that is making a connection with the girls. ?I've had really great sex with some ugly girls?, he laughs. We bet. When it comes to women, Brandon loves latin girls, dark curly hair and big asses. Charlie is an equal opportunity stud and doesn't have a type he prefers. When we asked Brandon about his wildest recent episode he said ?I was gang-banged by 4 girls!? Those Bachelorette parties are out of control. When we asked Charlie the same question ?he was still trying to wrap his mind around Brandon's answer! ...and now a word from our sponsors.  Both of them stand side by side as they begin to tease us. Slowly groping their cocks as they feel up on their developed chests they both begin to tent their pants. They each peel off their tees nd show off their muscular torsos. Brandon's well defined and his chest is chiseled as are his abs. Charlie has a bigger build and beefy biceps. They compare triceps as they stand there still groping themselves. Charlie's the first one to drop his pants and is left in a tight red boxer cut that shows off his growing cock. Brandon follows suit and as he pulls his pants down he's left in a bikini brief that hugs his small waist and bubble butt. They both stand side by side and slowly begin to pull down their underwear as they tease us. Their asses look amazing ?Does anyone have change for a $20? DAMN! They then kneel on the couch showing us more of their spectacular rumps. They begin to jack their cocks as they bend over the couch. They are hard in no time as they continue the show standing on their feet. Brandon's chiseled features are incredibly seductive as his brows furl totally getting into jerking his thick corn-fed cock. Charlie isn't far behind working his uncut tool til it throbs. An overhead shot of Brandon gives you an amazing shot of his definition and thick cock as he looks up at you with those grey-blue eyes of his. There isn't an inch on him you don't wanna lick?again and again. Charlie's uncut cock is glistening by now and his meaty ass just below his heavy hangers is hard to miss. They lay back to continue working up their nut. Brandon on the floor and Charlie on a couch nearby; these two look like sexual servants at a royal orgy as they prepare for the upcoming festivities! Where are the grapes!? Their cocks are at full mast and it wont be long before they need to blow. Charlie kneels on the couch as Brandon sits next to him as they get ready to climax. Charlie is the first to nut groaning as he shoots his nut all over the couch and floor below. Brandon isn't far behind as he picks up the pace. He begins to moan and groan and within seconds his fat cock erupts shooting his Midwestern wad in the air splattering all over his smooth thighs and navel moans in ecstasy all the while. No matter how you like it, Foreign or Domestic, these two got you covered.",
  "models": [
    {
      "name": "Brandon Fox",
      "person_id": 27885
    },
    {
      "name": "Charlie Xavier",
      "person_id": 27898
    }
  ],
  "release_date": "2008-07-03",
  "scene_id": 53854,
  "tags": [],
  "title": "What Are Friends For?, Scene #02"
}