{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brandon Fox is the complete package. He's tall, muscular, defined, has sexy steel blue eyes with a childlike gleam and flashes a smile that would make any with a pulse melt on the spot. He's self-assured and his confidence exudes a humble air of ownership that few men ever attain. He knows exactly who he is and needs no excuses. He began his career as a stripper in San Diego after having moved West from Chicago where he got the bases for his genuine mid-westerner attitude. Once he got into stripping, he found he really enjoyed getting naked in front of people and that eventually led him to an agency that got him into adult films. ?It was nerve wrecking!' he reflects on his first film '...there were like 50 people on the set: producers, directors and extras.? He's currently single and knows that right now his heart isn't looking to settle down. Once he is, he'll be open to settling down with the right person. He's incredibly frank and open about what he likes and even admits that as far as sexuality goes he believes one should pursue whatever the burning desire you may have is, regardless. He admits he's open sexually and wouldn't be opposed to having sex with someone if that's what he truly desired?male or female. Take us to your leader, Roger! We definitely need more men like this one. Sitting on the couch in tight jeans made tighter by a growing crotch, Brandon is slowly rubbing his boner as he starts his session. His lean frame is draped by a loose fitting shirt that hugs his lean frame. He undoes his pants and slowly peels them down exposing his tight black briefs that showcase his beautiful ass. As he takes his pants off we can see more of the things that make him so irresistible. He has thick muscular thighs that bulge out with his muscular quads and they lead up to his ass. The ass. His ass is smooth and as he bends over to peel them off you get a spectacular view of his backdoor. Makes one wish this scene was filmed in Lick-o-rama! Mmmmm  He knows his ass makes many crazy as he bends over and kneads his smooth cheeks and spreads them wide to show off his smooth hole. He then stands up and undoes his button down and pushes his shirt back some so that the fabric cascades on either side of his chiseled pecs. His smooth chest, with those sweet cinnamon nips, beckons you to wanna taste him. He knows exactly what he's doing as he teases you flaunting every inch of his lean, frame. Brandon has one more piece to reveal and as he lays back and spreads those muscular legs wide we catch our first glimpse of his thick cock. He's packing a billy club. His mid-western meat is as thick at the base as it is at the head where its capped off by a blunt knob that makes his cock look like a torpedo! Anyone up for a game of ?Submarine?? Ok, ok ?put your hands down! He lies back and as he jacks his cock we get a great view of his thick cock, smooth balls and hairless ass. He stands up and continues jackin as he fists his meat over handed while humping into it as he gyrates his sexy hips. He strokes over hand, under hand, around his thighs, under his thigh?the boy's got mad skillz! He takes his show to the couch where he sits back and starts stroking his now rock hard cock. His facial expressions are amazing as he loses himself in the moment. His eyebrows furl and that sexy mouth gape as we hear his breathing begin to labor. His heavy nuts are getting tighter and tighter as he jacks it paying close attention to the knob of his fuck pole. Watching him jacking and enjoying his own body is amazing as he constantly touches himself inconspicuously with his free hand, groping his balls or inner thighs. It won't be long before his torpedo's gonna need to explode and sure enough we hear him breathing harder and as his eyebrows meet in a look of ecstasy, he grunts ?Ohh, I'm gonna cum!? His first blast jets past his nipple splashing atop his chest and the rest of his boys coat his sexy torso and abs. Whew. Looks, charm, a big dick and a huge load ...some guys have all the luck.",
  "models": [
    {
      "name": "Brandon Fox",
      "person_id": 27885
    }
  ],
  "release_date": "2008-07-17",
  "scene_id": 53858,
  "series": "Stroker's Creed",
  "tags": [],
  "title": "Stroker's Creed, Scene #02"
}