{
  "collections": [
    "Men Over 30"
  ],
  "description": "Dominic Portland is from the West Coast. This thick slice of heaven started early in school, a girl got a hold of him, , took him back to her place, and had her way with him. They did everything. 'It was great, I still remember it and it's been a long time', he grins. He loves to go to Vegas, where he's had some of his most memorable experiences. He loves to pick up ladies and be the meat in their sandwich. One sitting on his face, the other on his dick, and then they switch or work him together. He loves 3 ways, but he admits his ultimate fantasy would involve another girl. 'Two is better than one, and three is better than two. Anything more than 3 would be too much' As pick up lines go, Dominic doesn't use any. Eye contact is his secret weapon. He finds once you make that visual connection it will dictate the rest. He's an ass man and loves a big round booty. He loves finding girls that let him tap their ass. Since he's on the thick side, many girls can't take him for very long; but the ones who do are amazing. We've said it before and we'll say it again: 'You can't have a girl do a man's job!' Sitting at his laptop, Dominic begins to undress as he gropes his massive chest. His smooth pecs are well-defined, and are adorned by small cinnamon nips. His large biceps flank his pecs, and he has an intricate armband tattooed on his left arm. As he gropes his growing cock with his hand buried in his briefs, we get an amazing view of his large chest and the definition he's attained. His square chest, his traps, his lats, it's all one smooth, sun-kissed landscape of lickable acreage. He turns around as he pulls down his pants and shows off his ass that looks delicious in his tight black boxer briefs. Once he's out of his pants, he sits back on the bed and continues playing with his meat. It's not long before he realizes he's overdressed and checks em. His fat cock is half hard as he resumes his game of tug of war. It's a win/win game of sorts. Now free to grow, his fat cock expands to new proportions as he continues stroking it. His bedroom brown eyes, thick nose, and full lips are just a few of the seductive tools in his arsenal. Those are the first battalion which stuns the girls enough to stop them in their tracks. The rest of his prowess comes from what's underneath that sexy face, and the thick battering ram he hides below. His cock is at full mast as he kneels on the bed to continue his session. He bites his lower lip as he concentrates on the task 'at hand'. A shot from below gives us an amazing view of just how defined his pecs are as they tower over his smooth, taught abs. He then goes on all four to show us that ass we won't get a chance to sample (...for now). His massive, muscular thighs and calves come into the forefront as he tugs on his cock. He playfully looks at the camera in-between his legs as he jerks it. He wants to make sure we're paying attention. His muscular ass is spread wide for our pleasure. If only we could go where no man has gone before. Well, for now we can appreciate what lies before us and fantasize about what may very well lie ahead. His large nuts that once hung low are now pulled tight as he strokes underhand in this position. Dominic flips over and lies back and starts jackin' faster. His face says it all as he squints and grimaces before pumping out a thick dose of Portland Porridge. His thick cream coats and puddles on his muscular thigh. Whew. He sighs in relief and flashes us with that big smile of his. Here's hoping we get to see more of Mr. Portland in the very near future.",
  "models": [
    {
      "name": "Dominic Portland",
      "person_id": 27893
    }
  ],
  "release_date": "2008-08-21",
  "scene_id": 53867,
  "series": "Lonely Guy",
  "tags": [],
  "title": "Lonely Guy"
}