{
  "collections": [
    "Men Over 30"
  ],
  "description": "Menover30.com featured a double does of studliness this week, with two new members of the club with impressive members themselves: Hairy, hunky Cyprian and his stateside home town counterpart, Anthony. Anthony is part Latin, part Indian, part Black, and all man. A self-proclaimed ass man, Anthony has dark brooding eyes that hooked his first sex partner while he was in junior high, and he has not stopped fucking since. He and his girlfriend of two years have had sex in a dressing room and a glass elevator. In addition to the obligatory aspirations to join the ?Mile High Club,? Anthony's biggest dream is to be with a bunch of naked, horny people, and everyone doing what they want. We here there is a lot of that going around! But first up is Prague born Cyprian, who returns to the scene of the crime: the crime being when he visited the USA during a high school trip, met a girl on a bus, and she stole his virginity as well as a full twenty-four hours of his premier American journey. It was a few years later when he discovered the camera liked his hairy, hunky body, and his costar was another guy. ?It was for money,? he told us, ?But I really liked it.? That marked a fork in his road where his biggest sexual fantasy now would be an orgy with ten guys. Let the games begin!His square jaw staring into the camera, Cyprian quickly removes his shirt and unveils just the kind of solid, hair-covered torso we love here at MenOver30. That is just the start of a long list of all things manly he offers up. Rubbing a packed bulge with anticipation and reverence that mirrors our own, he soon hoists out a fat, uncut hose from his black briefs before turning to display a set of glutes round, high, tight, and meaty.  Kneeling on the bed, his cock hangs low and heavy. Then, with but two strokes, it sticks straight out, pointing toward the ceiling and spewing a river of pre that puddles on the bedspread below. Not just 8? in length, but a fist buster in width as well, his cock glides effortlessly back across in his hand as the other works the planes of muscle from his pecs down to his glutes and back. That world class ass comes back into view as he climbs across the bed to prepare for landing ? and what a landing it is, as heavy ropes of jizz foam the runway of his lower abs. While his exploits in the dressing room and the elevator with his girl mean Anthony is a full scale exhibitionist, this is his first time on camera. While the nervousness showed at first in his eyes, the lump in his pants spoke volumes as well. With one inked arm behind his head, his other hand was coaxing that shy cock out of hiding. In an instant, it was rock hard and ready for action, with a glistening spear-shaped head. Like Cyprian, Anthony also sports a long, fat hose that looked like poetry in motion as it danced back and forth as he fisted that meaty shaft. He had no problem letting the lens take in every follicle of his hairy ass before strapping himself into the pilot seat and letting those balls jettison their cargo: a thick load that covered his abs, the floor and continued to ooze well into the second part of interview. Game: Match: Score!",
  "models": [
    {
      "name": "Anthony Ortiz",
      "person_id": 27879
    },
    {
      "name": "Cyprian Connors",
      "person_id": 27880
    }
  ],
  "release_date": "2008-08-07",
  "scene_id": 53864,
  "tags": [],
  "title": "Hot Import, Scene #02"
}