{
  "collections": [
    "Men Over 30"
  ],
  "description": "It was another beautiful Florida day at the MenOver30.com studio when Hank Real rang the bell. Silhouetted in the intense rays of the noon day sun, it looked like Mr. Clean had ?cum a calling? and man, did he ever knock on the right door. With his 180 pounds distributed in all of the right places ? as you will soon see, we do mean ALL - this versatile star of a trio of DVD's from some of the biggest names in gay erotica was as charming as he was hot. He has that perfect mix of man-next-door charm, laced with a simmer sexuality that tugged at our cocks long before he got around to tugging on his. Hank spent the last decade as a personal trainer and running a gym before he ditched his boyfriend and his old life. His inner beast led him to a California sex party with 200 guys, in a salute to hedonism that gave him the fever for the flavor of what he had been missing ? flagrant exhibitionism in a sexual renaissance that changed his world forever. ?It's not that I really have any more sex than I used to? he told us. ?It's just that I enjoy it a lot more.? Despite the gleaming chrome dome on top of a most manly physique, Hank still has a boyish twinkle in his eye and a smile ready for a toothpaste commercial. ?I am here to entertain you boys? he declares directly into the camera, his hands perched just above the camel toe of heavy balls visible even through the thick denim of his shorts. Reaching inside his shirt to flick his nips, he tosses it quickly aside, exposing his heavy, tanned expansive frame worthy of a man who spent every working day of the last decade inside a gym without talking it too seriously. He is solid to the point of perfection, resisting the urge to be 'roid zombie? in a show of self-confidence that is almost as sexy and the result of his labor. Looking a little more like Star Trek's Captain Picard than Mr. Clean, all of a sudden, his deep space exploration was centered on the newly exposed territory creating by unzipping his shorts and showing a cargo bay that looked like it was ready to burst.He first hoisted a baseball sized ball sack out of his fly before going back and producing the bat... a thick, spongy model with a spear shaped helmet head and a good six and half inches soft. Giggling his meat, rubbing it, stroking it, and putting every mouth-watering angle of that shaft on display, that meat is soon a thick eight incher that he bends down and rubs across his own hole. A primal moan escapes from his lips, and the first drops of pre escape from that throbbing head. As Hank smashed his balls against his thigh, his hole once again came into view as he found something more fun to sit on then the floor ? a thick dildo as big as his own cock, but even thicker. As he moved to the couch, that toy stayed deep in his hole as he fucked himself against it while working his lubed cock with both hands. Grabbing the base of the dildo, he worked it like a corkscrew, grinding it from side to side to hit every magical pleasure spot inside before it produced a mammoth load of cum that shot all over the back of the couch, finally finding a final resting place on his abs. Well, maybe not so final after all ? Hank reached down, wiped it up and sucked his fingers dry ? maybe he really does qualify to be ?Mr. Clean? after all!",
  "models": [
    {
      "name": "Hank Real",
      "person_id": 27878
    }
  ],
  "release_date": "2008-07-31",
  "scene_id": 53861,
  "tags": [],
  "title": "Mr. Shine, Scene #01"
}