{
  "collections": [
    "Men Over 30"
  ],
  "description": "Park Wiley and Robbie Ireland are up to no good this week, as they are left to their own devices. Having been on our sites recently in steamy solo shoots, we decided to pair up these two lean power houses for a little action. For those of you w ho missed out on the fun, Park Wiley is 32 and has already made himself quite a name in the industry. He hasn't done much since we last saw him and he's still 'getting to know' the same guy he mentioned a few weeks back. The guy he's getting to know thinks of Park as his boyfriend; but Park is sill in denial about having one. Go Figure! Regardless, he, his new beau and his porn career are all getting along famously. What more could you ask for? Robbie Ireland is a delicious slice of Sin City. At 30 this teal eyed Las Vegas boy is quite the charmer. He too is currently dating a girl he's 'getting to know'. He met her through friends and she turned out to be a dominatrix. Kinky! She opened his mind to ass play and he admits he's been curious bout doing more. She's been itchin to fuck him and he's been warming up to the idea. Sadly, Robbie's girlfriend may not be the first to fuck him after all. He admitted he's heard that guys give much better head so he might be open to the 'possibility'...if the money was right. <Queue the music> Robbie Ireland, Come on Down! You're our next contestant on 'The Price was Right!' Sitting comfortably on the couch, the chemistry between these two is easy to see. As soon as we roll they are all over each other. Their tongues intertwine in a passionate lip lock. Park gets to work on Robbie's defined chest and nips while Robbie groans his approval. They grope at each other's cocks as they begin to undress the other. In no time these two are in their birthday suits. Park wastes NO time before swallowing Robbie's Fat cock to the hilt. Robbie's mouth gapes open as he experiences his first male hummer. 'Take it!' he coos as he put his cock down Park's willing throat. Its time to switch up as Robbie kneels and works on Park's meat. He bobs up and down on the length of the meaty shaft while he fingers Parks tight ass. Park returns the favor as he fingers Robbie while he gets head. Fortunately Robbie's girl has him used to the anal action. Next Robbie straddles parks chest as he feeds his cock to the hungry Park. 'Swallow it, Yeah, Swallow that fuckin dick!' he orders as Park's eyes bulge with Robbie's cock buried deep. Robbie wants more cock as he twists backwards-dick still buried in Park's throat-to get at Park's meat. Do not try this at home, Folks. This is not your Father's 69! 'Fuck that ass!' is what we hear next as we see Robbie taking his first cock. Park is going to make sure he never forgets this one as he plows into his sweet ass. Robbie is loving it as Park's tight nuts slap at his hole. Robbie's face says it all as he gets the living daylights fucked out of him. They are going at it like animals in heat. We couldn't have paired them up any better. Park's maiden ride is driving them both into a frenzy and after a few Robbie wants to get some himself. 'Feel that dick!? Yeah Feel it?' grunts Robbie as he impales Park with his fat Irish shaft. Park is taking it as rough as he gave it as Robbie pounds his manhole hard and deep. He talks dirty to him as he takes him, spitting on his cock as it slides into Park with ease. Robbie's a dominant and aggressive top as he continues using Park's sweet ass. From there he lays him over the arm of the couch as he slides back in for more of that sweet ass. Robbie's balls bounce on Park's ass as he takes every inch. Park begins to grunt and groan aloud as Robbie fucks the cum out of him sending it shooting all over himself. Robbie pulls out and straddles Park's face and unleashes a huge load all over Park's face and chest. Daaaamn! ...Cigarette anyone?",
  "models": [
    {
      "name": "Park Wiley",
      "person_id": 27892
    },
    {
      "name": "Robbie Ireland",
      "person_id": 27882
    }
  ],
  "release_date": "2008-08-14",
  "scene_id": 53865,
  "series": "Lunch Break",
  "tags": [],
  "title": "Lunch Break"
}