{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have our West coast str8 boy back in the house. Originally from Colorado, the delicious Dominic Portland is here to expand his horizons and we are here to help him do just that. For those of you who aren't familiar with Dominic, He's 30, sexually adventurous and loves picking up lesbians and watching them go at his cock together. He says his eyes are his secret weapon and one glance at those bedroom brown eyes will confirm that those eyes locked on any target would render them putty in his bed. This ass man is in his prime and knows it. His confidence only adds to his charm. Since we last saw him he's been bartending, working out and getting out and enjoying the weather. Zack Cook is a fresh-faced hottie from Boise, Idaho. This 20yr. old Midwestern Masterpiece has the jock looks and physique you'd expect to find in an A&F catalog, He has been taking time off to travel and visit friends around the country. He recently was involved in his first gang bang on some chick he didn't even know while at a party. ?'Running the Train' they call it? he laughs as his eyes light up. Unlike Dominic who needs to beat off 3-5 times a day; Zack saves his up and maybe jerks off twice a week. Today these two will go where no men have gone before...well, that's not true. They will boldly go where they've never gone before. ?I heard gay guys like to watch str8 guys go at it? laughs Zack. Well, we can assure Zack ?he heard right! The camera has yet to roll and these two str8 boys have already gone somewhere?their pants. Each has his hand buried down his pants, stroking their growing meat. Zack looks over and decides Dominic needs help as he undoes his thick belt and pants before going back to undoing his own. As Zack feels his chest, his tee rides up giving us our first glimpse of his defined abs. In no time they are laying side by side in their underwear. Zack's body is chiseled and his dedication to it has really paid off. Dominic is stroking and as he lays back his massive pecs and arms bulge. Zack is ready and willing to go as he bends over and tastes Dominic's growing meat for the first time. Dominic lays back and lets him have at it as his meat instantly stands at attention. Zack moves his hands and mouth all over Dominic's thick meat as he jacks his own huge cock. Zack seems in awe of Dominic's cock as he loses himself in the act. Staring at it before going right back down on it. Dominic, the consummate straight boy, does nothing but sit back and enjoy the head he's getting. ...Fuckin' HOT!From there Zack moves to the bed, where he lies his head near the edge so that Dominic can feed him more dick. Hands on his waist and watching a good flick, Dominic stands pleased by the attention he's getting from his str8 buddy, Zack. Zack can't get enough of Dominic's thick pole. Dominic doesn't seem to mind one bit. Zack jacks it and licks up at the hefty piece as he jacks his own throbbing cock. Then he has Dominic get on all four as he jerks him off underhand like he was milking a bull. Even this proves too tempting for our model boy as he crawls under Dominic to keep suckling on his throbbing boner. Zack then lies back on the bed and starts pleasing his own meat while jackin Dominic's cock. Zack with that pretty boy face, full lips and Marilyn-Monroe like beauty mark is stunning to watch. He jacks as his eyes dart between the porn and the thick cock he's just had buried in his throat. They both are getting close as they lay side by side and beat off. Dominic's the first to blow shooting all over his abs. Zack picks up his pace and beats off faster and in no time he explodes. His first load sprays up all over his face, the second his upper chest and the rest on his tightened abs. ?Why the fuck did I hit my face?' he laughs nervously 'that's never happened til today!? Seems our str8 boy got a bit hotter than usual! Aaah, Out of the mouth of Babes.",
  "models": [
    {
      "name": "Zack Cook",
      "person_id": 27884
    },
    {
      "name": "Dominic Portland",
      "person_id": 27893
    }
  ],
  "release_date": "2008-09-11",
  "scene_id": 53874,
  "series": "Warm Spot",
  "tags": [],
  "title": "Warm Spot, Scene #02"
}