{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back for more insanely hot sex this week is 33 yr old, blue-eyed, Enrique Currero. For those of you who don't know Mr. Currero, Enrique was originally a fan favorite on our brother site ExtraBigDicks ?for obvious reasons! He's packing a thick 8?? uncut monster cock that our viewers can't seem to get enough of; which is why after several requests we had him come over to do some work for us. Part of what makes this stud so hot is his versatility. ?Very good top ...and also a hot ass bottom? he admits. Enrique is up for anything. Those piercing blue eyes set against his sun-kissed skin just complement an already enticing package. We also decided to bring back another versatile hottie who can take it as well as he can give it, Mr. Park Wiley. Park is 32 and needs no introduction. He has already amassed quite the following in the adult industry having done countless adult films. He's currently dating (...sorta) and everything seems to be on the up and up these days. See, Park's new beau thinks of him as his boyfriend; but Park's not really sure what he is. None the less, Park is one hottie in the horizontal department and plays both pitcher and catcher quite well and is by no means a ?short? stop. Both of these hung boys can get rough and verbal as we've seen them in action separately in the past. This combination should make for some explosive dynamics ...of the sexual kind.   These two waste no time before stripping their clothes off and going for it. As Enrique's kicking off his jeans Park's already licking and tasting his chest. Once they're in their birthday suits, Park slides down in front of Enrique's growing uncut cock and swallows it whole. He begins sucking on Enrique's growing bone which immediately comes to life. They then get into a steamy 69 so they can each suck a meaty cock. Enrique nurses on Park's cock as Park bobs up and down on his shaft. The chemistry between these two is unmistakable as they devour each other unable to get enough. The steamy 69 flips over with Enrique on top and once that happens, Park's tongue finds a new target?Enrique's sweet ass. He dives deep into his hole sending Enrique into a frenzy as he gets his ass rimmed. Park moans his delight as his face is buried in Enrique's bubble butt. Enrique jacks his huge cock while Park continues to lap and suck at his ass prying open his cheeks to get his tongue in as deep as possible. Enrique's moaning says it all as he moves his ass up and down back onto Park's probing tongue. Next thing we see is Park straddling Enrique and riding his uncut cock like a champ. He bounces up and down easily taking every thick inch of dick that's being shoved deep. He's riding reverse saddle as Enrique holds him by the waist and bounces him up and down on his meaty cock. While he's getting pounded he goes forward and ends up with his hands on the floor and still bouncing up and down on Enrique. He then sits back upright on it only to grab Enrique's hands and pull him down with him to the floor as they turn it into a doggie-style ass pounding session. ?Oh fuck yeah! Fuckin' pound my ass ...gimme a fuckin rug burn!? Park grunts as Enrique buries his dick deeper and deeper really pounding him and in total control. Park's grunting and moaning as he gets plowed deep. They then go to the couch where Enrique slams back inside missionary style. In this position, Enrique's uncut monster is hitting Park in all the right places and in no time he's about to cum. He lets out a loud grunt-like cry as he explodes with Enrique still buried deep. Enrique pulls out and follows suit coating Park with his thick load. These two never disappoint and together they were hotter than expected.",
  "models": [
    {
      "name": "Enrique Currero",
      "person_id": 27886
    },
    {
      "name": "Park Wiley",
      "person_id": 27892
    }
  ],
  "release_date": "2008-09-25",
  "scene_id": 53878,
  "tags": [],
  "title": "Midday Restlessness, Scene #02"
}