{
  "collections": [
    "Men Over 30"
  ],
  "description": "They say that lightening rarely strikes twice in the same place. Here at MenOver30 we know for a fact that if you're lucky enough, Mother Nature will bless you with the recurrence of her handy work. Back yet again to show us all he's been blessed with is the Midwest's very own, Brandon Fox. For those of you who aren't familiar with this slate blue-eyed hunk, Brandon hails from the Windy City and currently lives in San Diego. He has made countless movies in the straight world and today he even brought one of his own movies to jack off to. He flashes that smile of his as he admits he loves to watch his own work. ?I find there's something intimate about it', he says, 'sometimes I have a better time jerking off to the video than I did making it.? The movie he brought today is his all-time favorite called ?Dick Hunters?. Who knew when he started out stripping all those years ago he'd end up making quite the name for himself in the adult industry. Admittedly he loves being naked in front of the camera. Brandon has nothing to be shy about, at 30 he's in peak physical shape, adventurous, open-minded and more than easy on the eyes. Brandon's ultimate fantasy scene on film would be an all out huge orgy, one small island with tons of sex, straight sex, gay sex, one big uninhibited free for all. It would have no cuts just one long shoot without interruptions. ?on that note... Slowly groping his crotch, Brandon begins his stroke off as he watches himself on screen with two hot girls. He loves watching himself in action and it isn't long before his pants begin to tent. He peels off his shirt exposing those delicious abs and slowly undoes his pants. As he opens his fly, his bright orange jock comes into view as it strains to contain Brandon's thick cock. He strokes and tugs at it while looking right at you with a devilish grin. He knows what you want and knows just how to tease you with it. He stands up and turns around as he begins to push his tight jeans down over his sculpted ass. The jock strap he's wearing frames his ass wonderfully even though it doesn't stay on for long. He drops it to the floor as he turns around and begins working his throbbing cock. As he stands there stroking, the camera pans back and you can better appreciate his physique. The light dancing on his definition: His smooth chest, his solid abs, his muscular legs. He then goes to the bathroom and as he does we get more shots of that ass of his. He makes it to the sink where he turns back to continue stroking his meaty shaft.Looking for a little more comfort, Mr. Fox takes it back to the couch where he kneels on it and starts to really work his cock. His breathing begins to labor as he jerks faster. He caresses his smooth torso and navel with his free hand as he focuses on his now pulsing cock. His huge nuts, once hanging, are now pulled tight beneath his cock as he continues to stroke. He works his cock faster and concentrates more attention towards his knob as his breathing continues to deepen. His muscles dance just beneath his perfectly smooth skin as he jerks off. His forearm, his biceps as well as his shoulder muscles and pecs all dance in tune to his pulse-pounding rhythm. (...literally) His facial expressions say it all as he loses himself and gives in to the rapture he is feeling. He begins to moan softly and groan as he gets closer and closer to climax. It won't be long before he erupts. A quick close up of his throbbing boner as he jerks it faster and the camera pans back as you hear our stud moan, ?Oh fuck, I'm gonna cum!? He follows that with a series of ?Oh God?s and ?Oh fuck? seconds before he blasts a huge nut. His first two blasts clear the couch altogether landing on the wooden floors below while the rest coat the couch. Whew. Guess there must be something to jackin to your favorite porn after all!",
  "models": [
    {
      "name": "Brandon Fox",
      "person_id": 27885
    }
  ],
  "release_date": "2008-09-18",
  "scene_id": 53875,
  "tags": [],
  "title": "Shh...I Won't Tell, Scene #01"
}