{
  "collections": [
    "Men Over 30"
  ],
  "description": "More Ireland! Just a couple weeks ago we put a little slice of Irish with just a hint of sinful by the name of Robbie Ireland together with All-American boy Park Wiley in is first ever all-male scene. Since Robbie had been flirting with the anal ?phenom?, at the hands of his hot dominatrix girlfriend, he'd been curious to do the deed. Well, that scene was such a hit watching Robbie, not only take it but give it just as well, that we felt we needed to bring him back for an encore! To help us out with our Irish stud we enlisted one of the hottest twink bottoms around, Mr. Kirk Cummings. Kirk has been featured on our brother site ExtraBigDicks showin' off that thick 8? tool of his and driving us all crazy with that baby face and hot ass. Twenty one year old Kirk loves older guys. ?The older the better' he says 'they don't have much life left!? Ouch. This cute smart ass actually loves older men because they are more mature and more experienced and not into the game playing like other boys his age. Robbie who was recently bi-curious has expanded his menu and is up for anything from twinks to older guys, corn-fed to Middle-eastern. This boy went from curious to ?what closet?? in a matter of weeks. We can all appreciate having a hottie like him playing on our team. Speaking of playing ...Let the games begin! These two start kissing softly as Robbie rubs his growing crotch. The tee shirts are the first to go as they get back to more kissing and licking, exploring each other's necks and pits as they go. It isn't long before Kirk is fumbling for Robbie's belt buckle to get at what he has to offer. Once his rock hard cock is freed it trades its cotton confines for a much warmer one once Kirk wraps his talented mouth around it. Robbie moans as he gets his cock worked over by an eager Mr. Cummings. ?Yeah, suck that dick!? he coos as he eggs Kirk on. Kirk can't get enough of his cock as he swallows his meat to the base. They then strip off their clothes and once they do Kirk goes back down for more Robbie. Robbie's smooth balls are pulled up tight and look like they're packing one hell of a load. Robbie's smooth, lean frame looks delicious as you see his muscles writhe just beneath his smooth skin as Kirk continues sucking his cock. After more oral worship, Robbie decides he wants some of Kirk. He puts Kirk on all four and shoves his tongue up his sweet ass. Kirk is in heaven as Robbie pile drives his hot tongue home. Hmmm. One hot tongue ass deep can only lead to one thing?COCK! Robbie suits up seconds before Kirk straddles his throbbing cock. He eases down on his shaft til he can feel Robbie's smooth balls hit his ass. Kirk immediately begins riding his cock like a champ. Robbie grips Kirk's small waist as Kirk takes total control. He writhes back and forth on Robbie while Robbie lays back and enjoys the ride. From there Robbie wants more control so he bends gets him back on all fours. He slams his cock back inside as Kirk begins to moan and talk dirty. ?You got such a big cock ...fuck me!? he grunts as Robbie fucks him harder. Robbie's smooth balls are slapping Kirks sweet ass as the two continue egging each other on. They switch positions and lay down with Robbie fucking Kirk as he lays behind him. His cock easily glides in and out of Kirks ass and as they continue roll into a missionary position. Robbie's cock is hitting Kirk in all the right spots and he begins to moan and beg for cock as he gets closer to exploding. ?Fuck me!? he orders as he is sent over the edge. Robbie readily complies pounding him deeper as Kirks load begins to shoot all over his lower abs. Robbie than pulls out sits back and watches as Kirk goes to work on his throbbing cock. In no time Kirk is giving himself a hot facial with Robbie's thick cream as he jacks Robbie off all over his own face.",
  "models": [
    {
      "name": "Robbie Ireland",
      "person_id": 27882
    },
    {
      "name": "Kirk Cummings",
      "person_id": 30504
    }
  ],
  "release_date": "2008-08-28",
  "scene_id": 53870,
  "series": "He Won't Know",
  "tags": [],
  "title": "He Won't Know, Scene #02"
}