{
  "collections": [
    "Men Over 30"
  ],
  "description": "It's been almost a year since we've had a certain seasoned local by the name of Bailey Blanks. Bailey has visited us before, and we definitely remember the steamy scene he had with hottie Lee Covington. When we ask ol' Bailey to tell us his name and where he's from, he smirks and says ?Thirty something...Fort Lauderdale, Florida.? Mmhmmm. Well this thirty something stud has been busy working and hitting the gym since we last saw him, and he says he can't complain. He also admits he loves what he does. I guess if what you did involved getting paid for having sex on camera with hot men, you wouldn't complain either. Bailey is usually into older guys, but today the stars aligned just so that he had the opportunity to sample a tender taste of Colombia. Alexander Ojiste is bright eyed and hungry-tailed. This sexy 18 year old is originally from Colombia, but has been living here in South Florida since he was 11. Like Bailey, he too prefers older men. Alexander had his first sexual experience on a trip back home when he lost his virginity to an older guy when he was only 13. He knew then that he preferred the experience that came with having an older lover. That preference still holds true today, and Alexander is happy to be exploring his sexual interests on cam. ?It's something that's brand new for me, but it's pretty cool!? Well, we're all for him exploring...and we're more than happy to watch. Sitting side by side on the couch, they begin slowly kissing as they start to explore each other's bodies. As they make out, they end up on top of each other as they slowly lick and suck at each other, peeling away layers of clothes. They stand on the couch as they drop their drawers and continue making out. The next thing we see is Bailey as he lays back and gets his cock worked by an eager Alexander. He easily takes Bailey's bone to the hilt while driving Bailey wild. Alexander swallows him deep and holds it in his throat before coming up off it and going right back down on it. He's loving it and so is Bailey. Alexander licks his hard boner, and his tongue roams north. As it does, so does Alexander. He straddles Bailey's chest and feeds him his young cock. Alexander's brows furl in ecstasy as he looks down and watches Bailey swallow his meat. Alexander looks hot as fuck as he face fucks Bailey, who is trying as best he can to keep up with the young stud's unrelenting meat. The oral is getting Bailey ready for more, and in no time he's aching for some ass. Bent over the armchair, Alexander cringes as he gets his ass invaded by Bailey's thick meat. His ass was hungry, because Bailey's fucking him smooth and steady in no time. The look on Alexander's face says it all as he gets caught up in the rapture of his desire. Bailey slaps at his ass while fucking him deep, and Alexander takes it like a champ. Bailey then sits back in the chair and holds on while Alexander impales himself on his cock. He moans and groans as he bounces up and down on Bailey's cock. Bailey's lubed balls bounce up into Alexander's ass as he rides hard. This is working for Alexander, but Bailey wants to retake control, and in no time repositions the young stud into a missionary position. Here, Bailey begins to bury his cock at will and gets it as deep as he wants it. Alexander's head rolls side to side as he gets fucked silly. He's stroking his hard cock as Bailey pounds him deeper and deeper. Holding on to each knee, bailey pumps faster and faster as they both get closer to climax. Alexander is the first to go as he moans aloud and begins shooting his load all over his smooth torso. Bailey has already pulled out, and in no time follows suit, dumping even more jizz all over our newcomer. Well this sure has been one hell of an initiation for Alexander. Here's hoping he'll be back to show us even more!",
  "models": [
    {
      "name": "Alexander Ojiste",
      "person_id": 27943
    },
    {
      "name": "Bailey",
      "person_id": 29349
    }
  ],
  "release_date": "2008-10-09",
  "scene_id": 53882,
  "series": "Broken In",
  "tags": [],
  "title": "Broken In, Scene #02"
}