{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have yet another New Yorker that now calls the sunny beaches of Florida home. Strangely enough Damian bears an uncanny resemblance to a celebrity New Yorker ...but we wont go there. ?No more hints for you!? Damian Rogers is 38 and admits he loves the weather down here and it also helps him keep his all-over tan. Someone must be a regular at Haulover Beach. Nude beaches are also a great place for Damian to meet people and possibly other ?swingers?. Damian is a Swinger in the Lifestyle. He loves group and public sex. He's been a swinger for the last 12 years and knew at an early age he was into the group scene. When he was a young teen he'd be fucking his girlfriends while fantasizing others were there fucking her too. From there he evolved into a group sex machine. He prefers groups of 10-12. His ideal scenario would be 4 or 5 girls and the rest would be guys. He loves to watch a female be dominated and Gang banged. For the hardcore swinger, if you're among friends or people you're familiar with it can be ?anything goes?. Guys will often time mess around with other guys if the level of comfort is there. The energy in a room with 25-20 people fucking and sucking, moaning and groaning does take its toll on a boner with no conscience. At times people will end up doing things, 'sperm of the moment' they wouldn't usually do in a one-on?one scenario. We've all been there 'so-to-speak'. Did I do thaaat!? Damian has no ultimate fantasy. He's done them all. We have no doubt he has. Lucky Dawg! Laying back on the couch, Damian begins by feeling himself up. His broad chest, and huge arms, becomes a playground for his hands to roam free. Free they roam as they make their way into Damian's shorts. There just isn't enough room in there so he quickly loses them. Once he does he moves over to the chair where he begins working his growing cock. He has one arm behind his head as he closes his eyes to relish the moment. His smooth nuts hang below his throbbing bone as it throbs in a lubed finish. Damian is naturally smooth all over and once he pulls off his tee we can better appreciate his massive frame. His chest and abs are defined and there is minimal to no body hair on him. He keep his pubes shaved so he's one continuous sun-kiss'd, tan-line free canvas. As he lays back we get a shot from below that showcases his meaty thighs and smooth ass. He gently strokes his cock with one hand while he fondles himself with the other. This boy's done this before. He sits up and slowly rappels a wad of spit onto his cock. Now re-lubed, he begins working his shaft with both hands. He strokes with one while twirling his fist with the other. Nothing like a little over stimulation in the cock department...cuz honestly ?it's never enough! He then moves back to the chaise where he bends over to give us a view of his meaty ass. We do get a better view of the only areas the sun doesn't get to tan. He beds over as he continues stroking his cock as he pushes it back towards his ass to give us a better peak. He has a large tattoo that covers most of his back in text. We're not sure what that about; but before you're able to figure it out he's on his back double-fisting his cock again. He lies back with his legs spread wide as he continues to jerk on his cock. H lubes up and jerks his cock almost as if he was wringing out the laundry. We shit you nit! Both hands are twisting simultaneously along the shaft as he picks up the pace. The faster he strokes the more his facial expressions change. Whatever he's doing he should patent it because it apparently works. Within a few minutes of that ?special? treatment his balls are pulled tight and ready to unload. His cock swells even larger as he mumbles ?I'm gonna cum!? under his breath. His cock throbs as it sends its first volley splattering up across his abs and chest. Damian's mouth gapes open as he moans and groans as he empties out the rest of his thick cargo. Looks like Damian had a bit backed up in his pipes judging from that huge nut. Sometimes ya feel like a nut...",
  "models": [
    {
      "name": "Damian Rogers",
      "person_id": 27888
    }
  ],
  "release_date": "2008-10-16",
  "scene_id": 53884,
  "series": "Gets Better With Age",
  "tags": [],
  "title": "Gets Better With Age, Scene #02"
}