{
  "collections": [
    "Men Over 30"
  ],
  "description": "Park Wiley is back in the house for some more action, Wiley-Style! For those of you who don't know Mr. Wiley, Park is one of MenOver30's fan favorites. He was last here with Robbie Ireland, rubbing a lot more than his Blarney Stone. Park, now 33, has already made himself quite a name in the industry, starring in dozens of films. Last we heard, Park's still seeing the beau he met while they were both chasing the same twink at a local bar. We aren't sure whether Park's calling him his ?boyfriend? yet. It seems he has an issue with the word since his beau's been calling Park that for months now. lol What's a hot guy without his issues? (Don't answer that one?it was a rhetorical question) Regardless, we're always glad to have Park with us. He's down to earth and always good no matter where he 'ends up'. He can take it just as well as he can give it. We also have Finn Danniels this week. Finn is also from the West Coast. He's a beefy stud who loves his ink. He's also 33 and admits he has a thing for tats. He has an intricate arm band with One-Eyed Willy from ?Goonies?. Among the others are: an Evil Dead 2 skull on his pec, a pirate scene from Pirates of the Caribbean on his left bicep, and a large Sleepy Hollow tat with the Headless Horseman on his shoulder blade to name a few. Finn describes himself as ?curious?; but we'll get a better idea just how curious in a minute. Let's get this show on the road... These two waste no time as they begin making out passionately, sucking on each other's lips as they stray to find other pastures. Park kisses Finn's neck and chest as he makes his way to his growing cock. In no time, Park has Finn's meat buried in his throat. Finn's head rolls back in ecstasy as Park does his thing. Park's finger instantly finds Finn's hole as he expertly works his meat. Finn, who's already naked at this point, now helps Park get out of his jeans and commences to return the favor. Park lays back, slowly bucking up into Finn's novice mouth as he does his best to please him. Park's cock is rock hard in no time, and it throbs in its new spit shine finish. Park is hungry for more and eager to show Finn the ropes. He bends Finn over the couch and begins to explore his backdoor. Park runs his tongue along Finn's crack before diving inside. Finn just moans and writhes in pleasure as he gets a royal rimming from Park. Park is prepping his sweet ass for the fuck that's to follow. He fingers Finn and slaps his ass before going back down to eat it some more. This kind of ass play's gonna get Finn's ass more than ready for a fuckin'. Park gets up on the couch behind Finn and takes his ass doggie style. Finn's prepped ass gives little resistance as Park buried his cock deep. Finn moans and groans as Park continues his anal assault. His heavy nuts slap Finn's smooth ass as Park leans forward to wrap his arms around Finn's broad chest. He keeps driving his cock deep in every position. Park looks amazing as he dominates Finn, pushing him down to get his ass higher for better access. Finn takes every thick inch like a man and reaches back wanting more as he pulls Park deeper inside. Park then switches things up and sits back and has Finn straddle his cock for a ride. Finn grunts with pleasure as he steadies himself and rides Park's dick. Park holds his ass as he helps bounce him up and down. Park then begins to slam his cock faster and harder up into Finn's hole as he gets closer and closer. He needs more control, and missionary's the best way to get it. He puts Finn on his back, grabs his legs, and buries his cock in him. He dicks him faster and harder, causing Finn to lose it?blasting his load all over. Park just keeps fucking it all out. Park is right behind him as he pulls out and coats Finn's chest and face with his jizz. Damn.",
  "models": [
    {
      "name": "Finn Daniels",
      "person_id": 27891
    },
    {
      "name": "Park Wiley",
      "person_id": 27892
    }
  ],
  "release_date": "2008-10-30",
  "scene_id": 53887,
  "series": "Wife's Out",
  "tags": [],
  "title": "Wife's Out, Scene #01"
}