{
  "collections": [
    "Men Over 30"
  ],
  "description": "There are two types of Breakfasts every guy hopes for. The first is the breakfast made for you by a hottie in your kitchen, wearing nothing but an apron and that ?I know what you did last night? grin. Then there's the other kind of breakfast. You know the one, the breakfast you roll over into, and an hour later you collapse in a sweaty mess having just had the best ?breakfast? ever! There's nothing like ?Breakfast in Bed? to get your juices flowing. (Don't go there) There is no better way to start a day. This week, we have Nicholas Hunter, who will be cooking up some action in the kitchen for us. From Kentucky, 35 yr old Nicholas now lives in Ft. Lauderdale. He's been partnered for 6 years. They met at a strip club chasing the same stripper. This is his first gay (and open) relationship. Nicholas was a late bloomer, and he's now making up for all the sex he missed out on in his 20s. He likes men who take care of themselves. Now, Jav Genero is the kind of breakfast you want available whenever the mood strikes. He's from El Salvador. He travels back and forth a lot, though he now calls Miami, FL home. He's 30, currently single, and admits he loves the freedom it affords. He admits he finds it hard to commit when there's so much to explore. He tends to go after girls who are a bit edgy (i.e. bitches) ?Sweet's nice, but it won't keep me from cheating' he grins 'if she can control me in the bedroom, I'd have to think twice before doing anything outside(the relationship).? Well, DAMN! Dressed in a fitted tee and jeans, Jav immediately undoes his belt and goes for gold as he gropes his growing cock. He loses his jeans while groping his cock through his sexy boxer briefs. Javier takes off his tee, and we get our first glimpse at his defined chest and abs. He has light hair on his pecs and a faint a happy trail that leads south to his now throbbing cock. He strips off his clothes as he moves to the bench to start jacking his cock. His low hangers dangle between his muscular thighs as he jacks his meat. Jav keeps his body hair trimmed short, so there's nothing to distract you from the main event. He jacks his cock overhand then underhand as he rubs his cock with just some spit for lube. He kneels on the floor and continues humping into his fist. Jav is one sexy Latino: bedroom brown eyes, a boyish grin, and a dick to be reckoned with. No wonder this guy can't keep his dick in his pants. The self proclaimed High School ?nerd? has come a looong way since then. He's got plenty of game at 30. As he lays back and strokes faster, we get a better appreciation of his physique. He plays with his nuts as he gets closer to climax. Stimulating the sweet spot just below his heavy nuts is all it takes to send our Jav over the edge. His abs contract as he lets loose jet after jet of thick cum all over his toned abs. whew. Breakfast is now served...piping hot!Nicholas is in his kitchen finest, in nothing but an apron. As he stands, he slowly raises his apron to show us what's in his pantry. Wearing a black leather jock strap, he's ready to begin cookin'. He slowly massages his ass and chest while giving us a show. He undoes his apron as he gets comfortable. He crawls onto the chaise to give us a better view of his ?ass?-ets. His jock strap is tenting, and it comes off to give his cock some needed room. Nicholas starts to work up a special batch for us as he beats his cock. He stands to give us a different angle of his fine ingredients, aged 35 years. He shows off his ass as he continues stroking his meat. He goes back to the couch where he can get more comfortable. As he does, his climax gets closer and closer. He starts jacking faster and faster, and you know it won't be long before he busts a nut. Sure enough, he moans as he shoots his first load...yeah, his first. He continues jacking off after having his first orgasm, only to have a second larger one a couple minutes later. Awwww, He brought enough for the whole class. ?Sweet!",
  "models": [
    {
      "name": "Jay Genero",
      "person_id": 27889
    },
    {
      "name": "Nicholas Hunter",
      "person_id": 27890
    }
  ],
  "release_date": "2008-10-23",
  "scene_id": 53885,
  "tags": [],
  "title": "After Breakfast, Scene #01"
}