{
  "collections": [
    "Men Over 30"
  ],
  "description": "Nick Forte is one sexy stud. At 38, this hairy morsel spends his fair share of time in the gym keeping his bod in excellent shape. He's down-to-earth and well spoken. His no?nonsense sense of being also carries over to what he looks for in a partner. He loves guys to be very low maintenance, naturally hairy, no deodorant, right out of the box and rough around the edges. I think we can all appreciate finding wash & wear kinda guys as opposed to the one's that need an hour in ?production? before leaving the house. You know who you are! He's very active and loves outdoor activities: Biking, running, Beach Yoga, Pilates, etc. He lost his virginity in the 8th grade with his girlfriend at the time. All they did was 69. She was Catholic so she wouldn't do more. Fortunately for Nick, it was the quantity not the quality. He would have his first gay experience his senior year in High school while in San Diego checking out colleges. A trip to a local nude beach led to a hot jerk off session with a hottie that hit on him. The hottest sex he's had was with is first boyfriend who was in the Navy. They would go to the base to spend their vacations and he ended up having a 3-some with one of his boyfriend's Navy buddies on-base. ?It was really hot.? he grins. ...We bet. As far as fantasies go, he admits he's always been too ?conservative? to try the anonymous sex thing; but lives vicariously through his friends. He oftentimes jacks off fantasizing about random anonymous encounters at the gym or beach with hot guys he would have sex with...if he only had the nerve! Dressed in worn jeans and a sleeveless flannel shirt, Nick begins groping his crotch. His shirt doesn't stay on for long as he loses it revealing his furry chest and defined abs. The jeans are constraining his growing cock and he wastes little time in giving his growing bone more room. He lies back as he pulls his pants down toward his work boots. As he does, the clear delineation in his briefs is unmistakable. His cock is throbbing and all thick 8? are ready to go. He pulls the front of his briefs down just below his smooth balls as he gives his bone some much needed air. His cock is thick from base to head and as he looks up at us we can better appreciate the masculine ?man-scape? he has to offer. It's quite impressive. His furry, defined torso and that rock hard cock are mesmerizing and just when you think you've seen it all?it gets better! He flips over as he pulls his briefs down over his amazing ass. WOOF! He takes off his boots and jeans and gives us a better appreciation of his sweet ass as he straddles the couch and jacks his meat underhand. As he's bent over with everything spread wide, he plays with is cock and manhole making sure to leave us wanting more...a lot more! More we want and more we get as he flips over on his back and lifts his legs in the air. With those massive thighs spread-eagled he continues to show off his 'ass'-ets. This guy knows just how to tease. He turns the attention back to his cock which by now is throbbing for attention. He plays with his nuts as he strokes his cock. His fingers dart down to caress his ass. Nick loves that sweet ass worked and makes sure to give every single inch of his delicious frame the attention it deserves. As he lies back with his thighs spread wide he starts to double fist his meat. His face is one of ecstasy as he continues exploring his body. His cock is aching for release and he's trying to not get too close as he eases off his bone from time to time. He can't hold back much longer and he starts jacking off slowly with a tighter grip. He slowly works his cock focusing on his sensitive knob almost as if he was fucking a tight ass. This technique does the trick as we see him begin to writhe in pleasure. His abs rise and fall with every thrust into his hand and in no time he starts to moan. As his breathing deepens his mouth gapes open as his cock explodes. His cock pumps out volley after volley of thick man cream. His furry navel is coated with his seed as he continues stroking out as much cum as he can. Whew Now that was a workout!",
  "models": [
    {
      "name": "Nick Forte",
      "person_id": 27887
    }
  ],
  "release_date": "2008-10-02",
  "scene_id": 53880,
  "tags": [],
  "title": "Unwrapped Gift, Scene #02"
}