{
  "collections": [
    "Men Over 30"
  ],
  "description": "Dominic Portland is back! This thick slice of heaven has figured out that since he jacks his thick dick 3 times a day on average; he may as well come here and make some green as well. Dominic's jumped on the wagon and is apparently going ?green?! lol For those of you who haven't met Dominic, Dominic started early at 13 by a High School girl that got him drunk and high, took him back to her place and then had her way with him. Brilliant! ?It was great. I still remember it? he grins. Since he was last here a few weeks ago, he says the hottest sex he's had was ?alley sex??wait for it...in broad daylight! He met a girl at a bar in the middle of the day and things started jiving and the next thing he knew she offered to suck his cock outside. He was ?all in? (NO shit?) ?She didn't just suck my cock. I ended up fuckin her in the alley, in the day...that was new?, he blushes. As far as fantasies, nothing's changed: ?Two is better than one and three is better than two? Like every horny str8 guy his fantasy would involve girls and more girls. He would have them al to himself! Dominic doesn't use pick up lines to get women. Eye contact is his secret weapon. He finds if you make visual contact and show you're interested, they come around eventually. We bet. In a sleeveless muscle shirt, Dominic begins to show his defined pecs and guns some appreciation. He slowly feels his massive pecs and biceps with both hands as they explore every muscular curve on them. He's over-dressed and in no time the tee comes off giving us a much better view of his assets. His broad chest is defined and there isn't much body fat on this stud. His bicep adorned with an intricate tattoo flexes as he strokes his growing meat inside his crimson briefs. He quickly loses those as well and lays back to better ?appreciate? his love joy. Just go with it! His fat cock is coming to life as Dominic jacks it dry. He gets up and continues to stroke his growing meat giving us better angles as the cam pans up and down. His massive chest vees into a small muscular waist and his muscular frame curves back out once it hits his massive thighs and quads. Dominic is no stranger to the gym. We're sure those sexy eyes for eye contact and a body like that playing offense would make most women succumb to his delicious plans. He turns around and bends over for us showing us his sweet firm ass. As he bends over he continues stroking g his massive meat. There just aren't any bad angles on this delicious hottie. You can look; but you just can't touch. He then gets comfortable on sits back to focus on his engorged rod. The cam goes south and as it focuses north over his meaty frame you can really appreciate his definition. His heavy balls are pulling tighter to his cock's base as they prepare for fireworks. His thick features are captivating. His full lips and deep set eyes framed by those sexy brows. Dominic's slowly feeling his smooth skin as he jacks and in no time he readjusts to get more comfortable. He lays back and settles into his routine. He focuses on the flick ahead and loses himself in the moment. He's focused and by now his cock is aching for release. He looks over from time to time to make sure we're paying attention as he feels the tingling beginning in his balls. His massive chest begins to tense and as it does the rest of his abdominals begin to contract. His breathing is becoming labored and it won't be long now before he's ready to unload. Quietly and without much fuss, Dominic mumbles ?I'm cummin'...? under his breath. In seconds his cock begins to spooge. Thick cream begins to jet out all over his smooth abs. The first batch hits his lower abs and his obliques as the thick load immediately runs down his hip. As it does, more is being catapulted all over his navel and happy trail. Dominic collapses exhausted from his intense session. Whew. ?Welcome Back, Dominic!",
  "models": [
    {
      "name": "Dominic Portland",
      "person_id": 27893
    }
  ],
  "release_date": "2008-11-06",
  "scene_id": 53889,
  "series": "Back For Seconds",
  "tags": [],
  "title": "Back For Seconds, Scene #01"
}