{
  "collections": [
    "Men Over 30"
  ],
  "description": "Two new faces for our viewers this week, and they're as nice a contrast as they are opposites. The first face is an imported one with swarthy dark features and olive skin. This face with the piercing eyes belongs to Giovanni Sabato and comes to us from Romania in Eastern Europe. He's 27 years old. This Italian Greek fusion is not only new to the US, having only been here for 2 months, but also new to the adult industry. This is Giovanni's ?first time?. We don't get to use that line often these days. Though we're sure some of you use it quite often ...you know who you are. Giovanni is excited to be doing films, since he loves sex and can't seem to get enough cock. He loves to bottom, and his ultimate fantasy would involve a room full of tops for him to enjoy. He is happiest with a dick in his ass. Hearing that confession, Giovanni's playmate for this afternoon lights up as he smiles ear to ear. This huge smile belongs to a homegrown California boy by the name of Johnny Donovan. Originally from Cali, this Seal Beach native is an extra thick slice of Americana. He's a West coast beach stud, right down to the puka shell necklace. At 32, he's tan and hairy, and has tussled ?surfer dude? hair; which he admits he loves to do whenever he get the chance. Johnny is a sex-a-holic. So, with one horny All-American stud and one insatiable and willing Euro import, we have all the groundwork in place for some really hot foreign ?relations?! (pun intended)...Giovanni wastes no time before going down for some California luvin'. Johnny's rock hard cock is getting quite the working from Giovanni, who swallows his thick 8? cock with ease. ?Suck those fuckin' balls, huh?? Johnny moans, but it's obvious, Giovanni needs little direction as he devours our home grown boy. Giovanni glides up and down as he works Johnny's meat with his tongue, his throat and apparently no hands. That's skill, baby! Johnny is in heaven as he gets his meat worshipped European style. As Johnny removes his jock strap, Gio begins to explore other parts of his furry landscape with his talented tongue. It isn't long, however, before he finds his way back to his favorite part?Donovan's dick. He sucks his cock with ease as he begins to tease our top boy's smooth ass. This only drives Johnny wild as he writhes in ecstasy; with a hot mouth on his bone and a slicked finger working his sensitive hole. This pushes our top boy over the edge, and he's tired of lying back. He wants in on this game, and he's not taking no for an answer. He wrestles Giovanni face down in the bed as he gets behind him, seconds before ripping open his underwear. Johnny's tongue immediately dives in, getting a taste of his prize. He slaps at his ass as he rims him deep. Giovanni can only moan in ecstasy as his ass gets slapped, spit on, licked and prodded. Johnny can't seem to get enough himself as he goes all out, eating his smooth ass out.?That's a tight fuckin asshole...? is his battle cry, as Johnny sinks his fat cock deep into Giovanni's spit-lubed hole. He rides him, holding onto what's left of his underwear as he bounces him back onto his cock. He holds still as he pulls Giovanni's smooth ass back and forth on his dick. He holds the torn underwear with both hands as if they were his reigns as he says ?Giddy up!? and ?Yeehaw? all the while impaling our Euro counterpart. Albeit, not the 'finest' diplomatic American moment; but an altruistic nod to the Classic American Western. (...just go with it) Johnny's a talker, and he loves to ask Giovanni if he likes his fat cock in him. Giovanni's first language is cock, so they communicate perfectly as Giovanni grinds up and down on his meat as he rides our stud like a quarter-horse. Johnny just looks up in awe as he gets his cock milked by Giovanni. Johnny wants more control, and he again flips Giovanni over onto his back as he remounts him missionary. He piledrives his thick surfer cock deep inside as it disappears into Eastern European territory. Giovanni's taking a pounding it and loving every inch of it. He's pulling his thick meat almost all the way out before ramming it back in. Johnny is fucking him harder and faster and gets more verbal with every thrust. ?You're gonna make my fuckin dick cum right now...? he grunts as he nears climax. He pulls out and orders Giovanni to take his hot cum all over him before spraying him down with his thick load. Spurt after spurt coat our Romanian as he lays back, relishing every hot blast that lands on him. Giovanni then jacks out his own load all over Johnny's. Why can't we all get along this well? lol ...Sex for thought.",
  "models": [
    {
      "name": "Giovanni Sabato",
      "person_id": 27894
    },
    {
      "name": "Johnny Donovan",
      "person_id": 27895
    }
  ],
  "release_date": "2008-11-20",
  "scene_id": 53894,
  "tags": [],
  "title": "Warm & Wet, Scene #02"
}