{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a local fan favorite by the name of Lee Covington back for more fun. Lee is 32 now and he gets better and better every time we see him. Lee was last here in a hot 4 way scene where he joined 2 other studs to top a willing cutie. Lee mostly bottoms on camera; but he's actually versatile in his personal life. Lee is good no matter where he ends up and his charms worked wonders on his costar. Originally from Atlanta, Mr. Justin Wells is here to have his debut scene on MenOver30. Justin is 29 and holding and if nothing else he will be a MenOver30 by injection in no time. Justin has been featured on our brother site CircleJerkBoys where he had a hot session topping a more than willing MJ Cash. Justin agreed to bottom for Lee today and it will be the first time in over a year since he's had any dick in his backyard. Lee's in for a wild ride with this one. Justin laughs as he admits he prefers to top in general. He's not very versatile in his personal life but being the consummate professional he is, he does what duty calls. Well, we're glad he picked up the phone when duty did call cuz we're gonna get to see his re-initiation into the bottom world on our camera for all to enjoy. We have a feeling that we'll be seeing Mr. Justin Wells a lot more after this. He was a huge hit over at CJB and we know our members will be just as appreciative. Maybe we can get these two to come back and switch roles. Justin would get to top and Lee would get even more of this Southern Charm.The chemistry between these two was evident even before the camera began to roll. Once it did, they began to kiss passionately slowly exploring each other. First they groped at each other through their clothes but quickly began to remove them. Justin's eyes closed tight as his mouth opened a bit at the sensation of Lee's hot tongue tasting his nips and smooth chest. They continue teasing the other as they strip down to their briefs. They make out softly before Lee decides to get a bit more comfortable. He lies back on the chaise as Justin goes down on his swelling meat. Lee's in heaven as his cock reaches full mast in a warm mouth. Lee slowly guides Justin's head up and down on his cock as he moans his appreciation. Justin is making love to his cock and balls with his mouth and broad tongue. Justin wants some too, so he stands on the chaise, drops his briefs and gives Lee a face-full of dick. Lee wastes little time before engulfing his growing meat. ,Lee then has Justin sit back on the couch so he can get a better angle on his meat. Justin's in awe as his thick meat disappears down Lee's expert throat. The sex is hot and passionate. Lee can't get enough of Justin's cock and as he dips south to lap at his heavy nuts; his tongue darts further and hits the jackpot. Justin reacts immediately to the wet sensation on his sweet ass and that's all the permission Lee needs. He flips him over and dives tongue first into Justin's hot, smooth ass. That does the trick and Justin is writhing in ecstasy as he bucks back onto Lee's probing tongue. He then flips around and sits on Lee's face while he goes South in an insane 69 where Justin is having the all the meat you can eat special and Lee is having the tossed salad. There's nothing like a good lunch to help you power through even more fun.The next thing we see is Justin straddling Lee as he sits on the chair. His ass is on the end of Lee's gloved and lubed cock. He slowly impales himself on Lee. Lee steadies him allowing him to take his time getting used to his hard cock. In no time Justin is moving up and down on his meat as he steadies himself on Lee's pecs. Lee's nuts are softly meeting Justin's ass as he begins to ride his cock faster and faster. Lee is feeling Justin up all over as he leans back and gets his cock ridden. Lee wants more control as he gets up and bends Justin over the chaise. He enters his sweet ass doggie style and as Justin moans in pleasure, begins fucking him. Lee's getting in deeper and deeper. Justin is having to breathe and grimace to accommodate the intruding meat. His groans and grunts sound guttural and his face is awash with a mix of pleasure and pain. A shot from below and we clearly see Lee's thick dick slamming in and out of Justin's smooth hole while his own rock hard member dangles below. Now there's a picture! Next Justin gets put on his back while Lee holds his legs up in the air and goes back in for more. This is the best position for them to nut as Lee begins fucking deeper and faster. The stimulation on Justin's prostate proves way too much and in no time he grunts and groans nearing climax. ?I'm about to cum? he warns as his abs contract and goes over the edge. Lee fucks him harder as Justin explodes all over himself. Lee isn't far behind and the cum-drenched visual at the end of his cock is enough to send his boys swimming. He pulls out and sprays Justin with volley after volley of cum. Justin's face lights up as he watches the fireworks that now coat his abs and cock, Yeah, we definitely think we need to get these two back here for more of the same...or similar.",
  "models": [
    {
      "name": "Justin Wells",
      "person_id": 27944
    },
    {
      "name": "Lee Covington",
      "person_id": 27836
    }
  ],
  "release_date": "2008-11-27",
  "scene_id": 53896,
  "series": "Southern Comfort",
  "tags": [],
  "title": "Southern Comfort, Scene #02"
}