{
  "collections": [
    "Men Over 30"
  ],
  "description": "We've taken in poolside on the West coast this week with 2 new faces for our members. Corbin Michaels is a compact hottie. He's a tight, defined and ripped and has a baby face to boot. He has done mostly web work and this is his first for video work. He's not seeing much of a future for himself in the industry so he more than likely won't be doing much more. He's 25 and is pursuing a career in finance. He figures it's time he focused on school and his future and maybe get a real job. Ouch. lol Well, we better get as much of him before he disappears on us. Steven Waye is 30 and he, on the other hand, has done several films and is hoping to make it big. He has no plans of stopping anytime soon and wants 'Steven Waye' to become a household name. We're not sure what kind of households he's thinking of...but whatever works for him. He's tall and has a naturally defined build. He's outgoing and talkative and loves to have a good time. In his personal life, Steven admits he's a bit of a freak. He loves toys and can get into a few fetishes. Steven loves rough sex and likes to rough up in bed or get roughed up. He likes them both. Corbin smiles as he admits he doesn't mind rough sex but it has a place and time and it's not always what he's looking for. Steven is looking forward to having some hot fuckin in the hot tub. He loves the fact they're doing it outdoors. It gives him a rush. We have a feeling these two are going to do great. The chemistry between them is obvious. Enough talk. Let's get these two a'fuckin!Steven is laying out getting some rays poolside in a small black bikini. As he sunbathes, we see a muscular Corbin dive into the pool on the opposite end and swims over to taunt Steven. He splashes him and tells him to get in. Steven declines at first but after another splash from Corbin he dives in to teach him a lesson. They wrestle in the water and in no time Steven is definitely teaching Corbin something. How to get head properly standing by the pool. Corbin just moans as Steven swallows his thick 8? meat. Corbin's ass just pumps in and out of his mouth as Steven strokes his own cock. Corbin holds Steven's head as he forcefully bobs him up and down on h is fuck stick. Corbin wants some too so he gets in the Jacuzzi and has Steven get up on the deck so he can return the favor. Corbin's slurping fills the pool area as Steven just watches in amazement as his dick gets swallowed. Corbin laps at his meaty dick and balls as Steven just steadies his meat for him. Corbin then has Steven stand up against the rock ledge around the Jacuzzi as he bends him over it. He dives into his sweet ass tongue-first, sending Steven into a frenzy. ?Yeah, you like that?? Corbin taunts as Steven moans and assures him he loves it. Steven spreads his smooth cheeks apart giving Corbin deeper access into his sensitive hole. Corbin obliges eating licking and fingering his sweet ass. He playfully slaps at his ass while Steven bent over plays with Corbin's nips. A good rim job always leads to fucking. Note to self.Next thing we hear is Corbin grunting and the sight of Steven's cock being rammed up his tight ass. Steven's going for broke as he pounds Corbin deep. ?Aww, fuck yeah that feels good? grunts Corbin as he gets plowed. The sound of Stevens cock and balls slapping against Corbin's ass as he rams him can be heard as his pounding rhythm echoes through the surrounding nature. A close up of the action and we get to see Steven's gloved cock ramming mercilessly inside Corbin's hole. Steven is in his element and knows how to fuck rough. Luckily, today seems to be one of those days where Corbin is open to it. He takes the pounding in stride and bucks back onto Steven's cock trying to get every inch of it inside him. Where Steven's chatty when he's not having sex; he's a moaner in the sack. Corbin who's more reserved is completely the opposite in the throws of passion. Its fuckin hot to watch him get pounded and hear him ask Steven repeatedly ?Yeah, you like that?? knowing very well he has Steven by the balls (literally and figuratively) he's putty in his han?well, ass really. These two are going at it like a couple of horny dogs and it's insanely hot to watch them go at it. Steven, who's much taller, just holds Corbin in place while he slams repeatedly into his bubble butt. He grabs his waist and his shoulders to pull him back and impale him deeper as they make out. From there, Corbin lies on his back and Steven mounts him missionary. His meaty shaft slides in and out with ease as Corbin writhes in ecstasy. It won't be long before Corbin gets sent over the edge in this position. Sure enough, Corbin begins to moan and groan and in no time he nuts. ?Aww fuck? he grunts as his thick meat empties his thick load all over his happy trail. The visual sends Steven over as well as he pulls out and unloads all over our wet Corbin. Ok, that was a hot session. These two might need another dip in the pool to cool themselves off.",
  "models": [
    {
      "name": "Steven Waye",
      "person_id": 27896
    },
    {
      "name": "Corbin Michaels",
      "person_id": 29302
    }
  ],
  "release_date": "2008-12-04",
  "scene_id": 53897,
  "tags": [],
  "title": "Splash, Scene #01"
}