{
  "collections": [
    "Men Over 30"
  ],
  "description": "International man of Intrigue, Charlie Xavier is back with us this week. This week Charlie makes MenOver30 history by being ?the first? stud to be brought back for a 6th appearance. His fans can't get enough of this South African native. Born in South Africa and raised in Argentina and Brazil, Charlie is well traveled and well rounded. He has traveled extensively all over and admits that he has lived many places and visited even more for work and pleasure but right now he loves calling Miami home. He loves the weather and the energy our Magic city brings to the table. This muscular 32 yr old is charming and well spoken. He has no problems with the ladies and its easy to see why. He is comfortable here for now but admits he would like to check out a few other cities he has yet to. Hawaii is one on his list as well as the West coast because even though they have similar climates to Miami. They actually have more than one season. We here have 2 seasons: Hot and Hurricane. That's about it for us; but hey it beats shoveling snow. Of all the places he's been to he can't say which place has the hottest women. Each country has its own flavor and their women are no different. Apparently the son of a diplomat, Charlie's choosing to remain neutral on that one. Sometimes it is best to speak less and take a back seat to better observe. Besides, ?real? gentlemen don't kiss and tell. In the last 6 months since we've seen him, he's been exploring new careers paths, looking into going back to school and seeing where and how he can advance his career. He also obviously still has the same dedication to his body. He is wholly into natural work outs and a healthy diet. He doesn't believe in taking anything to enhance his physique; since most of them have side effects that by far out weigh the benefits. (I.e. age quickly, Bulk up disproportionately, your balls shrivel up and fall off) What!??it could happen. Regardless, we need less chat and more Charlie. ...let's do this.Charlie begins by attempting a sexy strip tease that starts off with him unbuttoning his shirt and giving us a peek at that massive chest before turning around to tease us as he undoes his pants and shakes his derriere. Work it like you own it! He laughs as he turns around and continues his show. He bends over slowly as he pulls his pants down and we see his massive quads tighten and his glutes contract showcasing his muscular ass as he bends forward. He then begins to play with his growing cock through his cotton briefs as they begin to tent up. He turns away from us again, teasing as he looks over at us over his shoulders and pulls his briefs just below his squeezable ass. This boy would've sold more Charmin than Mr. Whipple ( not that that didn't just date anyone, err....) Where was I ... Oh yeah, his perfectly round ass peeks out from beneath his shirt tail but in no time the shirt comes off and we can better appreciate the view. Charlie is toying with us and hiding the goods. A close up of Charlie's face as the camera slowly pans over him and as it pans out we see his full muscular frame laying on the chaise as he slowly strokes his uncut cock. Seems everything about Charlie is as nature intended. We're definitely not complaining. As he strokes his cock, his foreskin glides up and over his head and it gets thicker with every stroke as his smooth nuts dangle between his massive thighs. He stands to give us a better view and by now his cock is at a full throb. He spits on his cock as he leans forward to aim before delivering natural lube to his spit shined fuck stick. He leans back and begins to jack his cock in stride. His meat is as thick at the base as it is at the end and we're sure makes the ladies scream and beg for more. ( ok, you know who you are!) lol Seriously, everything on Charlie is thick. And with a frame as big and lean as his; it's amazing to think of just how many places one could explore. Well, go ahead...think about it!Charlie lies back on the couch this time and continues to work his thick meat. The camera pans overhead as we get an aerial view of all this import has to offer. His chest and abs are well defined as are his massive arms. His shoulders are relaxed as his right bicep and forearm are engaged in a continuous set of fist raises.  His cock is now stiff as a board and long gone is the flexibility it had when he started out. He is rock hard and just south of his engorged shaft we can see his once heavy nut sack is now completely pulled tight up against his groin. It's activated the launch sequence and it won't be long before Charlie needs to unload his massive load. His balls pulled up tight and his heavy cock getting the attention it deserves is giving Charlie an overload of stimulation as he gropes his abs and chest with his free hand. AS he lets go of his cock his thick foreskin pulls up over his knob but within seconds Charlie's back at it stroking his meat faster and faster. Charlie's face has grown focused as he concentrates on the many things now giving him pleasure. He tries to hold off as long as possible not wanting the sensation to end but it can't last forever. He fists his meat harder adding a series of short rapid bursts between and that does the trick. With a guttural grunt, he moans ?Aww, I'm gonna cum ?Oh Fuck? He repositions his hand and milks his thick dick using only his thumb and forefinger as it begins to spew thick cream. Globs of Elmer's glue-like cum splatter all over his smooth firm navel as batch after batch land and pool just shy of his belly button which was spared the thick white-washing. Charlie must have been backed up because his load is as thick as icing. Mmmm. Vanilla icing. Ok that's a wrap.",
  "models": [
    {
      "name": "Charlie Xavier",
      "person_id": 27898
    }
  ],
  "release_date": "2008-12-11",
  "scene_id": 53899,
  "tags": [],
  "title": "Overdue Visit, Scene #01"
}