{
  "collections": [
    "Men Over 30"
  ],
  "description": "If ?Two is company and three is a crowd? then what's four? Here at MenOver30 Four is SO much more! No lines, no waiting. 4 hard cocks, 4 sucking mouths and 4 willing asses (well, that's never really true but...just go with it) Today we're bringing you a smorgasbord of men on men with lots of sauce on the side. Let's meet our contestants shall we? First up is Luke Riley. Luke, is a daddy-loving hottie, now 19, and made quite the impression last summer in an hot duo with Parker Williams. If you didn't know who Luke was before then?you definitely knew who he was after. We've now had Luke solo, with another, then with two and now with three. Luke's is definite team player. Next on the line up is Lee Covington. Lee, is a local flavor and always well received here on our site. He's never one to disappoint when let loose with another stud. ?I'm no longer single!? he beams. They haven't had sex and been dating a week. ?That's a long time for me.? He blushes. Break out the Cryst?l! The next stud needs no introduction. After a 2 year hiatus, Mr. Halston is back with us. Troy, has been doing gay porn for well over a decade. He now launched his own venture partnered with buxom babe Holly Halston, his wife of 15 years, who has a following of her own. They're doing bi, gay and str8 films and we wish them all the best. Last, but not least, is Bailey Blanks. Bailey, is tried and true. Last month he broke in a hot little piece of Colombia aged 18 years. Three horny men today get one very willing boy. Christmas is cummin' early for our boy Luke! Seated together on the couches they pair off immediately and begin exploring each other. Lee reaches down to kiss Luke who's sitting in front of him as Troy and bailey begin to kiss. It isn't long before they all get up to get more comfortable. Troy, taking advantage of the distraction, kneels in front of the prize as he takes Luke's boy cock in his mouth to get first dibs. Once naked, they all assemble on the chaise. They are all on each other as Luke gets his first taste of Troy's legendary cock. That doesn't last very long before the three decide to sit back on the couch and give Luke an all you can eat cock fest. It's Thursday and ?All you can eat? is definitely on the menu. Luke starts from the far end as he sucks Lee's throbbing cock. As he does Troy and bailey make out and stroke each others cock, patiently waiting their turn. Once he's had his fill of Lee, he slowly crawls over him to get at Troy's meat. As he does, his sweet ass is on display for Lee to explore. Lee begins to finger his smooth ass as he sucks Troy's cock. The three make out with each other and Luke eventually makes it to the other end to taste Bailey's boner. Troy and Lee are now playing with his sweet ass and getting ideas of their own. Any ideas what?  Troy's cock is the first to squeeze into Luke's smooth ass steadily pushing inside until it gives way. In no time Troy is fucking our boy Luke as he jerks his fat cock for him. Luke writhes in pleasure a he holds up his legs to give Troy better access. ?Your ass feels tight on my cock? he moans as he continues slamming into him. The other two feeling a bit left out see some holes in need of attention and make their move. Lee straddles Luke and starts fucking his mouth; while Bailey stands on the couch to give Troy something else to work on. Luke then gets bent over and Lee gets not-so-sloppy seconds. He shoves his hard cock in and out of Luke while Troy is feeding him more cock on the other end. Bailey is up and sits back against the couch and tilts his head back so Lee and Troy can feed him more cock. Luke braces himself with one hand on the floor as he arches his back and rides Bailey hard. His free arm swaying up in the air as he bucks back and forth; lookin' like a bronco rider dead set on getting a lot more than his 8 seconds. Bailey then puts him on his back and slides back in for more. This position proves to be too much for our stud and in no time grunts as he busts his thick nut, exploding all over his abs. That spark ignites a chain reaction as one by one they all shower Luke with their cum. Blast after glorious blast until every last one of them is spent and Luke is drenched. ?Luke's like we got a real winner!",
  "models": [
    {
      "name": "Troy Halston",
      "person_id": 27796
    },
    {
      "name": "Lee Covington",
      "person_id": 27836
    },
    {
      "name": "Luke Riley",
      "person_id": 27859
    },
    {
      "name": "Bailey",
      "person_id": 29349
    }
  ],
  "release_date": "2008-11-13",
  "scene_id": 53891,
  "tags": [],
  "title": "The Four Horsemen, Scene #01"
}