{
  "collections": [
    "Men Over 30"
  ],
  "description": "Two new faces this week on MenOver30.com. Michael Milles and Leed Scott. Michal Milles is a compact piece of heaven. He's tone and defined and has a smile that could light up any room. He has a tattoo on his right bicep and the rest of him is smooth and incredibly easy on the eyes. Michael is from the west coast and he loves the weather and the lifestyle. He spends his free time at the gym or catchin rays. we bet he turns more than heads when he lays out with a body like his. This is Michael's debut with us and he's hoping it goes well. He is definitely one to watch and we think once we see him out of those clothes; we're gonna wanna see him a lot more often. <evil grin> Mr. Milles' costar, Leed Scott, is new to our site as well but recently made his debut on our brother site, ExtraBigDicks.com. Leed and his thick 8'+ dick were featured this week in a hot session with a hot little Latin number. We figured as hot as Leed was we needed more of him for our site. Leed was more than happy to oblige us. Leed is originally from San Diego, CA; he now calls Los Angeles home. He is a definite head-turner himself with dark features, piercing brown eyes, a model physique and a classic look on his 6' frame. To make matters more interesting he's a hairy stud that isn't afraid to go natural in spite of the hairless trends. He's every inch a man and we're about to show you each delicious inch of them too. The contrast between these two should be fun to watch: tall and furry with compact and smooth. we have a feeling Mr. Milles is in for one wild ride!They begin kissing on the couch and as they break the ice, Michael goes down to explore Leed's sexy chest. Leed's hands waste no time as he begins slipping his fingers inside Michael's sexy briefs. His fingers explore Michael's bubble but as Michael licks all over his chest. Michael then lays back to give Leed full access as Leed begins to explore every inch of him. he teases his cock through his briefs and as his cock begins to harden it pops out of his briefs. Leed immediately responds by sucking on his growing bone. Michael is packing some serious meat of his own and Leed has plenty to work on. Michael's cock is as thick at the base as it is at the head. Leed expertly swallows his cock to the hilt; pulling off it occasionally to spit on its head. Michael looks down in awe as Leed works his magic. Michael has Leed's own briefs that have since sprung a tent close enough to his face that he too begins to return the favor. These two studs end up in a hot 69, each still in their underwear with their cocks buried deep in the other's warm throat. Michael sucks Leeds cock to the hilt as he plays with his massive balls. Leed, laying on his back is swallowing Michaels cock and also beginning to explore hi sweet ass. Michael has a hot ass, small and compact and perfectly hairless. Leed gets him on all four before bending over him to spread his ass wide open and go to work. Leed loves to eat a nice ass before fucking it and this time's no exception. Michael grunts as Leed pulls his briefs to one side and tongue fucks his hole. Leed isn't the only one that loves to eat out; so Leed too gets bent over and has his furry ass spread and orally re-mastered. 'Spit in it!' he orders as Michael grants his wish. Leed groans at the feel of Michael's hot spit hitting his hole. Leed's getting hornier by the minute...Leed can't take any more and needs to bury his dick. He has Michael get on all four and slides his meat deep into Michael's wet hole. His balls slapping his ass and grazing Michael's underwear, which are pulled down just below his ass, just enough to give him access to that sweet ass. In no time, Leed is plowing his cock deep into Michael's sweet ass. Michael closes his eyes and moans with every thrust. Leed slaps his ass as he takes his ass. They then switch to a missionary position after losing their underwear. Michael is on his back and Leed holds both his feet straight up as he glides in and out of his ass. Leed's body looks amazing as he fucks away at Michael's ass. At one point lead leans forward and starts sucking on Michael's thick meat while still buried inside him. Michael goes wild at the sensation of his mouth on his dick with an ass full of his meat as well. 'You like that cock?' Leed taunts as Michael's head writhes back and forth as he fucks him deep. Michael want to get off with Leed's meat in him so he has Leed lay back and straddles him. Michael begins riding Leed's meat hard and in no time all that bouncing on his thick cock hits just the right spot. Sensing he's getting close, Leed sticks out his tongue asking for his load. That does the trick and sends him over the edge. Michael comes off Leed's rod seconds before blasting his load all over Leed's face and open mouth. Leed laps it up and once Michael's done he wants to return the favor. Michael lays back for him and opens his mouth wide as Leed strokes out his thick load all over Michael's sexy face and mouth. Once he's spent, he leans down and kisses Michael's cum covered lips. He then stands back up before sliding his cock back into Michael's mouth as Michael happily cleans off the last drops of Baby Gravy. YUM! This was wicked hot...but so 'durty' we might actually need to shower after watching it. <evil grin> ",
  "models": [
    {
      "name": "Leed Scott",
      "person_id": 27899
    },
    {
      "name": "Michael Milles",
      "person_id": 27900
    }
  ],
  "release_date": "2008-12-18",
  "scene_id": 53902,
  "series": "Behind The Bush",
  "tags": [],
  "title": "Behind The Bush"
}