{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back for a rematch this week are Lee Covington and Justin Wells. These boys were featured a few weeks back and we got to see Lee taking Justin's sweet ass for a ride. The chemistry between these two was explosive from the start even though these two have had history via mutual friends. This was a change of pace for both these boys, Justin who was first featured on our brother site, CircleJerkBoys is usually a top on camera. Today they will set the record straight as Justin gets to tap Lee's ass. They both admit that for the most part they play similar roles sexually at home in their private lives. Lee admits he has picked up a few things on set that he may have never been open to and has incorporated it into his repertoire off screen. Lee says he's tried everything. We believe him! lol Lee and Justin both have what attracts them to their potential partners, Lee has a wide range of what turns him on where Justin prefers to look for a guy that can be fun and intellectually challenging. Justin confessed that it has happened where the chemistry on set has led to more off set. He ended up dating a guy he met on a shoot and they dated for 3 years until Justin chose to move across the country. When we posed the same question about chemistry to Lee; he gave us a blank look and a resounding ...Nope! Awwwww.Like two lovers back for another session of afternoon delight, these two quickly get reacquainted. Lee begins to kiss Lee and as they do they waste little time in losing their clothes. They fondle each other as they playfully pull off their clothes piece by piece. Once they are in the buff, Justin lays back and lets Lee go to town on his throbbing cock. Lee bobs up and down expertly on his fat piece as Justin moans his appreciation. He guides Lee's head up and down on his dick as he face fucks him. Lee then stands and jumps up on the couch to give Justin something to work on for a change. Justin sucks Lee's boner as best he can as Lee pumps his face. Justin is playing with his rigid boner as he services Lee. He knows it won't be long before he's burying it deep into Lee's ass. Justin can't contain himself and puts Lee on all four so he can get a taste of the ass he will soon be fucking. Lee moans and groans as Justin's tongue makes its way inside him. The rimming is gonna get Lee even hornier for dick and Justin knows exactly what he's doing. Lee is standing and straddling Justin, sitting back on his face as Justin eats his ass. Once he's ready for more Justin grabs Lee's waist and slowly guides him due south until his throbbing knob is pressed up into Lee's hungry hole. ...Now what? Lee grunts as his ass begins to give way to Justin's thick meat. All the oral action has Lee ready for it and in no time he's bouncing up and down on Justin's thick meat. Justin lies back and watches his cock disappear into Lee's tight ass. Lee is in heaven as he braces himself on the chaise and continues bouncing on Justin's cock. Justin bites his lip and grabs Lee's waist with both hands as Lee begins grinding his tight ass all the way to the base of his fuck pole. Justin then gets up and wants to fuck Lee deeper and as he bends him over into the wall he quickly slides back inside him. His tight balls are pulling tighter as he pounds away at Lee's tight ass. They are both grunting and moaning as they fuck. Lee's own massive cock is at attention and swinging like a pendulum with every deep thrust he gets. Justin's getting closer and decides to take it home with Lee on his back so he can look at his face when he fucks him silly. Lee writhes in pleasure as Justin buries his cock deep, pounding away as his breathing gets deeper and louder. They can't hold back anymore and Lee lays back and busts a huge nut all over himself. Justin watching the fireworks also feels his balls begin to blow. He suddenly kneels down over Lee's spent face and gives him an unexpected facial. ...Payback's a Bitch!",
  "models": [
    {
      "name": "Lee Covington",
      "person_id": 27836
    },
    {
      "name": "Justin Wells",
      "person_id": 27944
    }
  ],
  "release_date": "2009-01-01",
  "scene_id": 53905,
  "series": "Vice Versa",
  "tags": [],
  "title": "Vice Versa, Scene #01"
}