{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a special stud here at MenOver30.com. With a face that's easily recognized in the industry, Doug Jeffries has more than made a name for himself in the industry. At 42, Doug is a prime cut of beef. He's been in the industry for 11 years now and has made well over 300 films. He laughs as he admits he's lost count. He started later than most starring in his first film in 1996. He's had many memorable films and many factors make them stand out: great co-stars, location, circumstances, etc. One of his fondest was a shoot set dancing at an actual bar in D.C. where they danced and later had sex in front of all the patrons who were lucky enough to be there that night. ?I can't believe I did that', he blushes, '?but I did!? He was in his 30s when he started and has no regrets about starting when he did. His maturity helped him stay focused and not get caught up in many of the pitfalls that starting out in the adult industry in your late teens and early 20s can lead to. He is happily partnered going on 3 years now and he says that his better half keeps him grounded. ?It's nice to have someone always there for you, who cares about you. It gives you a sense of safety and security.? We're sure he's lucky to have a partner that accepts him and the industry he is in without judgment. That being said and this being a season of giving and celebrating the present, we give you our gift to you this Holiday week, Mr. Doug Jeffries. Do nothing. He will unwrap himself!  Sitting in board shorts and a sleeveless muscle tee, Doug begins caressing his broad chest and lets his hands roam south over his thick thighs and growing crotch. He is a sight to behold. He teases his nips as his cock responds in kind. It isn't long before both hands end up in the same place rubbing his growing meat. His tee comes off and we get our first glimpse of his smooth pecs and those cinnamon nips that are the only thing afloat on a lean see of muscular definition. He shucks his board shorts and his muscular bubble butt pops into view framed by sexy tan lines to its north and south. Doug may swim in board shorts but he likes to lay out in bikinis and his sexy tan lines are the reward. He sits back and begins jacking his growing cock and in no time it's at full mast. His smooth nut sack bounces in tune to his wrist's methodical strokes. He gets up and turns around and shows off his smooth, white cheeks as he playfully fingers his ass. He knows how to show off what he's been given and today's no different. Doug is obviously one dedicated to his body and at 42 shows off an impressively, lean tone frame many would kill for at 30. Doug isn't done teasing us so he takes his show back to the couch to get comfortable.He lays back and spreads his massive legs wide as he begins to jack his thick pole. His smooth ass just below his heavy danglers looks inviting as he writhes in ecstasy with every stroke. After jacking his cock for a while, Doug gets back up and continues working his now throbbing cock. He teases it by rubbing his open hand underneath it as it throbs and dances at his every touch. His knob looks huge and ready to explode any minute as he caresses it and bounces it on his palm. Lying back against the wall on the floor, standing, sitting, bent over: it doesn't matter how Doug chooses to stroke his cock for us; he looks delicious from every angle. His cock is loving the attention it is getting and it won't be long before it needs to unload its cargo. He sits back on the chaise and begins to go for gold. He lays back completely as he jacks his cock faster and harder. As he does his left hand finds it diving below his balls and slipping a finger or two inside his beefy ass. This more than does the trick and in no time, his asshole clenches tightly around his digits as volley after volley of cum shoot out all over his smooth abs and chest. Doug grunts loudly as he explodes thrashes around as he gives in to his animal instincts! Well ...all we can say to that is??WOOF!?",
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 27928
    }
  ],
  "release_date": "2008-12-25",
  "scene_id": 53904,
  "series": "Aged To Perfection",
  "tags": [],
  "title": "Aged To Perfection, Scene #02"
}