{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brock Russell is painting his way into our pants this week as our hired hand takes matters into his own. Brock makes his debut with us here, and we couldn't be happier to have him. Bald head, boyish grin with a thick dick; this brown eyed cutie is every inch a keeper. He's in excellent physical shape, with abs many would kill for, and at 35, he's comfortable in his own skin and knows exactly what he likes and wants. There are few things hotter than a self-assured man. He attributes his physique to good genes, eating right, working out and lots of cardio (...and by cardio he means?sex!) ...but, of course. He's highly sexual, and says that on a scale from 1 to 10 ?he would be a 13?! He's so horny, he needs to jack off a couple times a day. Sexually, he is into big guys with big chests and big dicks. Cut, uncut, hairy or smooth, it doesn't really matter as long as he has something nice to play with. There's nothing like a boy who likes his meals SUPER-sized. You know who you are. Mmhmm. He may have a certain basic physical attraction, but he admits a lot of it depends on who the man behind the body is as well. He likes a man to be witty and intelligent, able to converse and make him laugh, and yet have an air of romance about him. A well rounded man is always a good find. We have a hunch that with looks like Brock's and that heart-melting smile, he won't have any trouble finding Mr. Right when the time cums. Speaking of which, It's about time Brock did the same...                        Left alone to paint the room, Brock stumbles onto some porn mags. It wasn't hard, they were right behind a paint can. Go Figure! Apparently on a Union break, Brock decides to have a look. As he does, he gets comfortable and loses his overalls. He unbuttons them, and as he looks at all the hot dick before him, he reaches back and rips open his overalls to free his horny ass. He begins to finger the sweet ass that comes into view. He has a jock strap on that frames his beautiful ass perfectly. There's no doubt this stud loves his ass played with and then some. He fingers himself as he gets hotter and harder. He loses his jack strap all together, and we finally see him in all his defined glory. He has a tight smooth body that is well defined, and has an arm band tat as well as a tat on his pec of what looks like a royal lion. He begins pulling at his chubby as it gets thicker and harder. His pubes are kept cropped, and the only fur we can see is the underarm hair that peeks out from beneath his muscular shoulders and biceps. As he lies back, we get a better view of his smooth balls and sweet, hairless ass. Brock is getting into it as he licks his bicep and loses himself in his own ecstasy. His cock is getting the work out it needs as Brock lies back against the wall and slowly strokes it up and down while fondling his balls with his free hand.Brock is definitely hot to watch as he plays with his thick dick. He's smooth all over, and the look on his face is one of pleasure and restraint trying not to go too fast and find a happy medium. His sexy full lips that contrast against his goatee look incredibly kissable as they part slightly while Brock continues to work his thick shaft. He plays with his balls as well and holds his thick cock at the base as he begins to jack his thick dick a bit faster. His legs are spread wide so that he has full access to his once heavy balls. His nut sack has pulled tight and is preparing to launch its cargo in a few. Brock begins to pick up the pace. As he does, his thighs part ever so slightly as he sinks down preparing to brace for climax. His eyebrows furl as his sexy lips part in anticipation. He begins to whimper as his hand begins to jerk his thick knob in short, calculated strokes. These strokes do the trick as Brock moans aloud. His body tenses and jerks with every blast of his thick cock as it sends load after load of cum splattering all over his smooth abs. Brock is writhing in pleasure with every wave of his orgasm. He's hot to watch as he jacks his load off. We can only imagine how much hotter he would look having that load fucked out of him by a masculine stud instead. We have a feeling that that might be in the cards for our Brock in the very near future. You'll just have to stay tuned and find out for yourselves. :)",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    }
  ],
  "release_date": "2009-01-08",
  "scene_id": 53907,
  "tags": [],
  "title": "Handling My Own, Scene #01"
}