{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a tasty morsel from South America. At 39, Jessie Balboa is about as hot a Peruvian import as we have had here on MenOver30. He's been here for the past 4 years and he bursts out laughing when he admits the best part of living in Miami is the men. This muscular compact hottie has a sun-kissed, muscular frame; deep-set bedroom eyes and a larger-than-life smile that would easily light up many a room. He has the brooding gaze and chiseled features you would expect to find on a Spanish ?telenovela? (soap) along with a bevy of other swarthy Latinos. (...& the infamous ?silicon? Latinas) Unlike those telenovela stars, Jessie is humble and says the perfect man would be a man?just like him! ?EGO, Party of 2?. He only kids (or does he? lol); but says he likes his men like him, 'Well done'. Age isn't an issue; he's not ordering a steak. 'Well done' is a literal translation from the Spanish 'bien hecho'. He just likes a guy that's put together right; someone that has his shit together. Jessie started fooling around at the tender age of 14. His first experience was with a 'man', the second with a girl. It only took 2 girls to confirm he would soon be canceling that membership. Always horny, Jessie jacks off several times a day. This horn dog even beat off while driving coming home from the beach once. The hottest place he's fucked was on the terrace at his parent's apartment. We just love the bad boys. His all-time sexual fantasy would be to rape Tom Cruise and totally having his way with him. Now that's a new one. We're not sure raping Mr. Cruise is anywhere on the ?Scientological? menu. We're also not sure Scientological's a real word! Hmmm...but get in line, Se?or!      Jessie lifts up his tank and immediately shows us his goods. His tanned upper body complete with abs and a chiseled chest are first to appear. He caresses his chest while making a b-line to his pants. He stands and unbuttons them, freeing his ever-ready boner that showed up ?commando? this afternoon. Underwear is overrated. No muss; no fuss. He moves his thick dick about as he shows off the beer can of a dick he's packin. He then turns around and gives us a better view of his beefy ass. He bends over and spreads wide as we see his smooth ass and his heavy nuts and cock being stroked below. Jessie has a thick cock that's as thick at the base as it is at the end. He sits on the floor and spreads his legs wide as he continues jackin his meat. He keeps his crotch hair free to match the rest of him and the smooth landscape is quite impressive. The dedication in the gym is really showing and he's in great shape. His smooth balls are lubed as well and held in place by his thick chrome cock ring. There isn't a bad angle on this Latin stud. He stands and continues showing off his assets. He's a playful charmer and even winks at you before blowing a kiss. Tease! This is definitely one you could have fun exploring for a long time.Jessie sits on the couch back and continues pleasuring his swollen dick. He takes his time to make sure he's giving it the attention it deserves. Beneath his greased cock we see his smooth ass and that crack that peeks out from underneath. With this much lickable acreage one could make a meal out of Mr. Balboa. His dick responds to every stroke as it flexes and throbs underneath his touch. He strokes his massive meat in different ways to change it up a beat while he works up a load in his heavy nuts. He needs to get a bit more comfortable so he lies down on the couch and settles in to give himself the release he needs. He plays with and pinches his nips as he strokes his fat cock faster. The sounds of his lubed cock stroking fill the room as he begins to pant and sigh as his cock gets closer and closer to climax. Watching this muscular stud stroke his cock as he nears the fireworks is incredibly erotic. His abs and chest muscles all contract as his body curls forward in a crunch; his face says it all as his lips and eyebrows furl in ecstasy; his balls pull tighter and his cock seems to get even thicker; each nip is getting tweaked harder and harder the faster he strokes then?climax! Jessie's back arches and his head tilts back a bit as he grunts signaling the inevitable. His fatty then spews load after load of leche all over his sweat glistened abs and navel as Jessie continues to groan and grunt with pleasure. Whew. Jessie lies back, spent, as he slowly catches his breath. Peru never looked this sexy before!",
  "models": [
    {
      "name": "Jessie Balboa",
      "person_id": 27930
    }
  ],
  "release_date": "2009-02-05",
  "scene_id": 53915,
  "series": "Rocky's Little Bro",
  "tags": [],
  "title": "Rocky's Little Bro, Scene #01"
}