{
  "collections": [
    "Men Over 30"
  ],
  "description": "It's February and Love is in the air as Valentine's Day is just around the bend. To celebrate this year we decided to bring you the next best thing. Not only a wonderful state of penile euphoria, this state of erotic confusion is often times confused for the real deal. Yes, this week at MenOver30 we're bringing you a healthy dose of 'Lust'. Not just any Lust?Latin Lust! Let's face it, they call Latinos ?caliente? for a reason. Last week we introduced you to Peruvian Papi, Jessie Balboa. Well we couldn't wait to bring him back and this being such a passionate week, we decided to bring Jessie right back. Jessie was extremely pleased that we brought him back and paired him up with this week's debut hottie, Mr. John Stone. John is 22 and not only new to the scene; but new to the ?gay? thing altogether. He's a newbie, Boys! Like Jessie, John lost his cherry in his teens. He also experimented with women for a while. Jessie had sex with 2 before realizing it wasn't for him; but Jessie laughs as he admits he just made that decision this year. He was dating a girl not too long ago. ?It's been great with men this year...that's why I think I'm completely (leaning) toward the dark side.? He blushes. ?It's not the dark side?it's the right side!? chimes in Jessie, as they affectionately sit holding each other in the afterglow. We couldn't have picked a hotter duo and the chemistry between these two was obvious from the start. Jessie brings experience to the table that this new cock cadet can appreciate. Jessie being 100% versatile and John, more of a top, is able and willing to switch hit. We believe there's bound to be a rematch in the works. That rematch would definitely ?muy caliente?. J      The cameras haven't even started and these two are already all over each other. Jessie slowly kisses John as he lets his hands roam, exploring the solid abs just beneath his white polo. John catches on quick as he helps Jessie strip his jeans off of him. Jessie immediately moves in for a closer look. He gropes is sexy briefs as they begin to tent. He pulls them down a bit enough to free John's growing bone. John closes his eyes as Jessie's warm mouth engulfs his meat. Jessie's giving him the royal treatment and that includes equal access to his Peruvian pole. He strips naked and as John lies back on the couch, Jessie feeds him his fat cock. John slowly nurses on his thick dick as it gets harder and harder in his talented mouth. Jessie loves the head he's getting and when he's had his fill he sits down on the floor and has john feed him more of his hard cock. John readily obliges as he kneels on the couch with one knee and lowers his fat dick into Jessie's mouth. In no time, John is face fucking our Peruvian stud. Jessie is in heaven as he sucks and nurses on the thick piece of steak, aged some 22 yrs. These guys are both extremely oral and they are working each other over in ways most would envy. There's nothing hotter than having two guys that are as into the other in bed. Taking turns and each one trying to out do the other as they pleasure and tease themselves into a frenzy. Wait for it?it's about to get a lot hotter in here! The next thing we see is Jessie's face as his eyebrows furl with delight. As the camera pans out we see John's face buried deep inside Jessie's ass, Jessie writhes and wiggles his ass as he sits back onto John's sweet tongue. John steadily works his thick tongue into Jessie who is loveing every minute of it. It isn't long before Jessie wants to return the favor. John lays face down on the couch and we get an amazing shot of his beautiful ass. Well, we see his ass?Jessie sees lunch?and it's an All-u-can-eat 'Ass-travaganza'?. We might need to copy-write that one. lol Jessie slowly moves in as he parts his meaty cheeks before diving inside. With one hand firmly grabbing at his ass cheeks, Jessie buries his face deep inside, using his h ands to impale John onto his tongue over and over. John is going crazy and Jessie kicks it up by alternating sliding his fingers into John's spit-lubed ass with even more tongue. A lethal combination if not applied properly. From there these two maneuver into a steamy 69 sucking and fingering each other as they get closer and closer to climax. Once on the verge, they lie back side by side and stroke off. John is the first to blow sending his thick cream all over his tanned chest and abs as Jessie tweaks his nip. Jessie isn't far behind and explodes as John chews on his. Now that's 'caliente', muchachos! Happy Valentine's Day",
  "models": [
    {
      "name": "Jessie Balboa",
      "person_id": 27930
    },
    {
      "name": "John Stone",
      "person_id": 27917
    }
  ],
  "release_date": "2009-02-12",
  "scene_id": 53917,
  "series": "Lick Him Clean",
  "tags": [],
  "title": "Lick Him Clean, Scene #01"
}