{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week, we have two familiar faces back with us in the studio. The first is a fan favorite that goes by the name of Lee Covington. He is one of those boys that our fans can't seem to get enough of. Lee was last here taking a pounding from Atlanta's own Justin Wells. That turned out to be a hot scene where Justin got a chance to ?return the favor?, if you will, after having had the chance to bottom for our fan favorite. Lee is sexually adventurous and has admitted in the past that there are few things he hasn't tried. He loves masculine men that know how to take charge, and working in the industry has afforded him the opportunity to learn new things on-set, which he later can integrate into his own private repertoire. He has been in the business for a while now and admits he is flattered when people recognize him in public. They stare and say. 'I know you from somewhere,hHave we met?'? he laughs, admitting many times they never quite make the connection. He figures that's not always a bad thing. His accomplice today is Dane Hyde. Dane is 31 years old now. We last saw him in early 2007, when he melted many a heart with his furry chest just before Valentines Day. Who could forget the blue-eyed heart throb that walked onto our set? Dane hasn't been up to much since we saw him other than living the good life. He admits it's about time he gets back in the gym. He's known Lee for a while, but had yet to work with him. They've worked on other projects, just none that involved nudity. We say we need to change that. ...Shall we, Gentlemen? J     Lee and Dane begin kissing as they grope each other. They end up on the chaise as Lee grinds into Dane as they continue to kiss passionately. They are overdressed, and soon it is being addressed as Lee pulls off Dane's tee to get at his hairy pecs. They both begin to lick and suck on each others' chests while slowly taking their time and not rushing anything. Their pants come off, and these two square off in their briefs as they continue to lick and kiss the other. Dane makes his move as he begins to grope Lee's tenting briefs. He quickly pulls them off and kneels to get a better angle. Lee can only moan as he watches his rock hard cock disappear into Dane's goatee-framed mouth. Lee playfully slaps his dick on Dane's tongue while Dane looks up at him loving every minute of it. The chemistry is undeniable as these two passionately continue their tryst. It's Dane's turn as he pulls Lee up, drops his briefs, then lowers Lee right back down again so he could have a go at his own thick dick. Dane needs that wet mouth on his cock, and he has Lee sit on the chaise before he hops up on it and straddles Lee's face, feeding him his fat dick all the way to its hilt. He proceeds to face fuck Lee, who is moaning as he jacks his own meat and easily deep throats Dane's fuck pole. Dane's meaty ass is all Lee can hold onto as he gets his face fucked by our hyper-masculine fuck stud. Both of these manly men love oral, and Dane is nowhere done with Lee. The best is yet to come...Lee is bent over, swallowing Dane's meaty 7?+ dick while having his ass rimmed deep by Dane, who is on the bottom of an insanely hot 69. Dane's masculine arms steady Lee's ass as he spreads his cheeks even wider, wanting to get as deep into Lee's sweet ass as he possibly can. Lee groans his approval; deep throating Dane's cock. Watching these two hairy boys go at it is a sight to behold, and it makes you wonder how much hotter it will be when we actually get these two back in our studios to do a lot more than just oral. Dane groans aloud. Yet as he groans his delight, his thick tongue never stops licking Lee's spit soaked ass. Each stud is driving the other buck-wild on the end of each other's skilled tongue. It won't be long before these two are going to need to blow their loads all over the place. Sensing the coming fireworks, they reposition themselves with Dane still on the couch and Lee kneeling over him. They both begin to jack off faster and faster, as they do their grunts and groans escalate and then?The Money Shot! Lee is the first to nut, sending wave after wave of cum splattering atop Dane's furry chest. The sensation of Lee's load pelting his skin is enough to send our Dane over the edge as he too readies himself for his explosion. ?Aaww. I'm gonna fuckin' cum!? he growls as his thick load joins Lee's as it mingles and saturates his fur. Yeah, we need to bring these two back for a LOT more.",
  "models": [
    {
      "name": "Lee Covington",
      "person_id": 27836
    },
    {
      "name": "Dane Hyde",
      "person_id": 27919
    }
  ],
  "release_date": "2009-01-29",
  "scene_id": 53914,
  "tags": [],
  "title": "The Lil Cub Club , Scene #02"
}