{
  "collections": [
    "Men Over 30"
  ],
  "description": "Germany is well known for its compact imports. They handle well and everyone loves to get inside them. Well, according to our latest discovery, he is no different. Born in Germany in the late 70s, Parker Johnson delivers quite a package. This sexy, once military brat is a Libra and says he's very much the typical Libra always wanting balance and harmony in his life and his immediate surroundings. He loves to make everyone happy. (Remember that) Now 30, Parker had his first sexual experience when he was a wee German lad of some 14 years. When asked if he was old enough to know what he was doing; the Cheshire cat grin that emerges quickly extinguishes any lingering traces of doubt. ?Oh, I wanted it!? he beams. His first experience with an older guy turned out to be a hot one and he remembers it fondly. On and off cam, our stud prefers to bottom. He is currently dating and things are great. He's the typical guy he's attracted to: Masculine, hairy and a total top. That covers the physical attributes of his ideal mate but we wondered what was it about ?this? guy that kept him coming back. ?He's intelligent and masculine and he has the perfect dick!? he grins. Well, now WHO could argue with science? Not us?Nope. Not us. We're practically Perfect Dick Connoisseurs. Parker has explored his sexuality and among his hottest experiences is an orgy with a cast numbering in the double digits. His eyes gloss over as he vaguely remembers that. LOL Poor Parker and all those masculine tops and?(you DO know where this is going, right?)?that need of his to make ?everyone? happy.  Yeah, Good times. Parker still has one he hasn't fulfilled yet; but he's only a pair of handcuffs and a patrol car away from actualizing that one. We have a feeling this stud won't have any trouble making that happen.      Parker begins groping his cock through his tight jeans and in no time takes his show to the floor as he slides off the couch into a kneeling position on the hard wood floor below. He caresses his navel and as he moves to his chest he takes off his tee revealing his chest with a sexy patch of fur nestled between his pecs. He is gonna tease us as he takes his time, peeling off his clothes piece by piece. He moves to the couch where he undoes his jeans and gives his growing cock some breathing room. His dick is ready for more and soon Parker loses his pants to oblige. He lies back on the edge of the couch and dives in to give his dick some skin on skin contact. He pulls out the head of his boner along the side of his briefs as he teases us with what's to come. His knob is pulsing as his throbbing cock wants to come out and play. Parker stands and in one slow motion pulls down his underwear. His furry legs meet his tan line and his cock finally springs free. Parker sits back down and starts to play with his now rock hard cock. His eyes close as he revels in the pleasure he's giving himself. He knows exactly what he's doing on his shaft and we can only imagine what he's capable of on other shafts that come his way. Hmmm.Parker holds his furry nut sack at the base of his dick with one hand while stroking with the other. His cock is lubed up and dances to his every touch. Its been a few days since he's been able to give his dick a work out so we know he's overdue for some release. He goes right back to the floor as he kneels again spreading his legs ever so ro give him plenty of access to his throbbing member. His compact furry frame tenses as his abs and forearm flex beneath his skin. He is working his cock closer and closer to climax and as he does he gets more focused on the task 'at hand'. His cock is swelling even larger now as he slows his pace to a more calculated, deeper stroke. He applies more pressure on his up stroke and slowly goes back over his knob on the return, Whatever he's doing, its doing the trick as Parker's breathing begins to labor, As his breathing and moaning intensify his dick looks bone hard and it can only be a few more seconds before he unloads. Sure enough, without much warning, he grunts quietly as his first load rockets across the floor. Three solid blasts of jizz spray the floor feet in front of him while the rest of the troops splatter closer to the canon. Yeah, parker was a bit behind in the relief area. We might need to send that new beau of his a memo. Unless any of you wanna volunteer?",
  "models": [
    {
      "name": "Parker Johnson",
      "person_id": 27901
    }
  ],
  "release_date": "2009-01-22",
  "scene_id": 53912,
  "tags": [],
  "title": "Single Touch, Scene #02"
}