{
  "collections": [
    "Men Over 30"
  ],
  "description": "We know he was only here last week, but we just had to bring back Brock Russell. Sexy Brock confessed he loved his meals Super-sized which got us thinking. Who could we pair this sexy 35yo with? Brock, with that chiseled physique and baby face, could make many a heart melt. He loves men that have big things: Big chests, Big Dicks and who could blame him? He loves a man that can be rough on the outside but a puppy on the inside. He wants to know he can fuck like a man but still cuddle afterwards. Awwww. There's nothing wrong with a little romance. It dawned on us shortly after Brock left last week that we actually had the perfect candidate for him. A renaissance man with a big chest, thick dick and an even bigger repertoire of films under his belt, Doug Jeffries came to mind. Doug was our Christmas find this past Christmas. At 42, Doug is in his prime and has been in the business for 11 years now. Brock is pretty versatile off camera and beams when he says he can give it plenty hard as well. Today he is here shooting his third film to date with a seasoned veteran to show him the ropes. (...at least one thick 8? rope in particular.) Doug is going to fuck Brock for his first ever on cam fucking. Judging from the instant chemistry between these two it's going to be hot. We may need to bring these two back and give Brock a chance to drive and see how well Doug can take it. Either way it's a win/win situation.These two hotties begin making out as their hands begin to explore the other. Doug is eager to unwrap his buddy and as he pulls him to his feet, he pulls off his tee and undoes his belt as his shorts fall to the floor. In a sexy jock, Brock stands still while Doug slowly kisses his cotton clad meat. Brock wants to give as well so he too undresses his hot daddy as he slowly begins to tease his growing cock through his jock as well. Brock then stands over Doug as he feeds him his dick. It isn't long before Brock goes down on all four over Doug into a hot 69 to get a taste of his Daddy dick. Doug is sucking on Brock's dick and balls and finds his way to his sweet smooth ass. Brock's eyes light up a soon as his hot tongue makes contact. Doug's discovered a hot spot. Brock stands and bends over in front of an eager Doug who buries his face deep inside his ass sucking his ass like there's oxygen in it. Brock's eyes cross as his ass gets the rimming that is only making him hornier and hornier. Doug has him by the waist as he dives his tongue deeper and deeper. They then go into another hot 69 where Brock's suckin' dick and has his sweet fuck hole on display for Doug to explore. Doug gladly licks, laps and fingers the ass he will soon impale. The anticipation! ...it's making us wait! ?can you stand it??Brock's sweet ass lines up with Doug's throbbing cock as Brock lowers himself onto his thick meat. Slowly Doug's dick makes its way inside as Brock begins to slowly ride his cock til Doug's balls are hitting Brock's ass with every thrust. Doug holds our stud initially as he helps bounce him on his dick before putting his hands behind his head and just watching the fireworks. Brock, caught up in the moment, rides Doug with ease as he looks down enjoying the muscular scenery. Brock wants to get it deeper and he repositions Doug so that he can sit back down on it and really ride him. Luckily, this is not an ?8-second ride??and this Bronco ain't buckin' him off either. Brock bounces on Doug's dick as he gyrates and shoves it in deeper. ?Fuck yeah, ride it, Boy!? Doug urges as he watches Brock ride his cock like a seasoned Rodeo Pro. The look on Brock's face says it all as he gets the rough fucking he's been needing. Doug then pulls him off his dick before bending him over and entering him doggy style. Doug has the control now and he's going to use it slamming his cock deep and really pounding Brock. Who's your daddy, Boy!? Don't answer that. (It was a rhetorical question) Brock is grunting in pleasure and pain as Doug fucks the hell out of him as he slaps his ass. Doug's heavy nuts slap Brock's smooth ass with every rough thrust. Missionary follows and proves to be the position that hits all the right buttons for these two and in not time Brock explodes his thick nut moaning aloud as he writhes in pleasure. Doug isn't far behind as he grunts each massive volley out of his balls all over cum covered Brock. Whew. Damn Daddy! Now that's the way to start the day.",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "Doug Jeffries",
      "person_id": 27928
    }
  ],
  "release_date": "2009-01-15",
  "scene_id": 53910,
  "series": "Simple Chemistry",
  "tags": [],
  "title": "Simple Chemistry, Scene #02"
}