{
  "collections": [
    "Men Over 30"
  ],
  "description": "The body is gloriously lean, the face inevitably handsome, that 8? inch slab of meat perpetually hard, the vision of an ass perennially lickable and that sexual appetite unquestionably unquenchable. We could only be talking out one of MenOver30.com's reigning Kings: Mr. Troy Halston. From Troy's first appearance, we learned that though married, he still loves to be in front of the camera.  His Valentine's display with Alexander taught us that matrimony has not diminished his occasional taste for the feel of a male backside gripping that thick dick of his. Today he salutes Memorial Day, where Troy's showmanship could not be corralled so we had to take him outside by the pool where his fun in the sun quickly turned to sin the shade.His wifebeater and jeans are soon history as the rays bathe his body with light like a great canvas with a thirst for paint.  He emerges from the crystal blue pool, beads of water clinging to every ripple of his lean, muscled body.  Face down on the raft, he spreads his cheeks offering a peek of the treasure within before rolling over and presenting his heavy heaving meat like an offering to the sun. A quick rinse under the shower did anything but cool him down as he lays back and works that meat to full mast, reaching down with probing fingers in search of a place to land. It seems Troy found being naked and hard outdoors to be a major turn-on and just a simple one handed stroke was not going to be enough to get him off. He started jacking off from the back, giving us a view of that hot, so-tempting ass with that fat cock sticking straight down between those hard muscled thighs. Bending over, a shining silver vibrator, gleaming like a rocket in the hot Florida sun, was on a collision course with his tight hole, those lips visibly throbbing in anticipation.  Working it one third in, he turns and sits on it, riding like a jockey, before laying back, spreading wide and reaming the hell out of his ass with the vibrator in one hand and his leaking cock in the other.  When the tip reaches the critical mass of his prostate, his balls explode and spew forth a load that rivals the explosive finale of a firework's display in the perfect way for us to say to you, ?Happy Memorial Day? from Troy and all of us at MenOver30.com.",
  "models": [
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2009-03-19",
  "scene_id": 53927,
  "tags": [],
  "title": "A Pool of Sperm, Scene #01"
}