{
  "collections": [
    "Men Over 30"
  ],
  "description": "We all know, at MenOver30, that two is company?and three is a party! So, this week we invited back two recent hotties whose chemistry steamed up more than a few monitors a couple months back. Yes, Jessie Balboa and John Stone are back in the studio and we decided to add our own bit of resident spice. A spicy little addition by the name of Tony Michaels. Everything's better with a dash of 23yo Tony we've found and we'll see just how much better in a few. John Stone is 22 and still relatively new to both the adult scene as well as the gay scene. He has limited experience sexually and last year at this time he was dating a girl. He's been out for only a month. This sexy latin with the killer smile not only came out a month ago, but obviously catapulted out of his closet and onto a porn set. No complaints here. He's definitely making up for lost time. Now that he's free to explore, he wants to experience a girl and a guy at the same time. Tony is adventurous and he smiles and admits that can be hot since he once shared his man with a girl and loved it. Jessie, the worldly 39yo says he's not yet had the best sex of his life and each experience just gets better and better. Spoken like a true politician?or ?playah?! lol ...Let the games begin!  Lying on the couch, John becomes the object of affection as Tony and Jessie begin to kiss and lick him all over. He kisses both of his suitors as they all begin to undress each other. Kneeling in their jeans their tongues combine into a steamy open mouth French session. Oooh-La-La. As they continue to strip off their layers Tony is the first one bare assed and assuming the position as Jessie revels in the sight. He spreads Tony's beefy ass wide as he admires his puckered hole. Jessie's merely a mortal and cannot resist Tony's lure as he dives in tongue first. Tony moans with a mouthful of John's dick buried in his throat. Jessie then has these two studs stacked on top of the other so his tongue can explore all the ass he can eat. There's so much to explore that they look like 3 kids loose in a carnal candy store as they greedily lick and grope each other. Jessie makes out with John as Tony swallows his meat then the tables quickly turn as John is sucking on Jessie and Tony's feeding Jessie his thick meat. No matter what position these studs maneuver into there is plenty of meat to go around. Tony is sucking on Jessie's thick dick as John makes out with him. In no time flat, its John that's swallowing Jessie's meat as Tony first makes out with Jessie and then stands on the couch to slip in more than his tongue as Jessie starts sucking his cock. Jessie soon has more on his mind as he's getting head from John, he begins to finger Tony's ass. His meat's gonna need a lot more than a mouth in a minute. The next thing we see is Jessie burying his thick dick ball deep into Mr. Michaels. As he slowly plunges his thick cock inside, John's doing some plunging of his own as he eats Jessie's ass. Jessie has one stud on his meat and the other either rimming or kissing him. What else could a man want? John then straddles Tony and feeds him some dick as Tony gets both holes filled at the same time. The next part is John's initiation. He slides his meat into Tony missionary and once inside, Jessie kneels behind him and takes his ass doggie. Jessie is playing for keeps and we're guessing he's making up for not getting any their last session. John grunts and groans as he tries his best to take the pounding Jessie is giving him. Tony kisses him as he holds him in place for Jessie who is forcefully taking his ass while he fucks him deeper into Tony. This looks like a Cell Block Bingo and a certain movie with ?You got a purty mouth, Boy!? comes to mind. Hmmm. The deeper he pounds the louder poor John grunts. Once Jessie has had his fill they get up on their knees and start to jack themselves off. Tony's the first to blow as he explodes all over John's abs and cock while they make out. John's next as he shoots his nut all over Tony's chest leaving Jessie for last as he gets two mouths roaming his chest and lips sending him over the edge and emptying out his own hot cargo. Need a minute?",
  "models": [
    {
      "name": "Tony Michaels",
      "person_id": 27902
    },
    {
      "name": "John Stone",
      "person_id": 27917
    },
    {
      "name": "Jessie Balboa",
      "person_id": 27930
    }
  ],
  "release_date": "2009-03-12",
  "scene_id": 53925,
  "tags": [],
  "title": "Cum On, Cum All, Scene #01"
}