{
  "collections": [
    "Men Over 30"
  ],
  "description": "Chiseled, baby-faced Brock Russell is back to give us some alone time this week. Brock was last here a couple months ago when he got a chance to sample some prime meat and see just how good it can get with a man wiser and more experienced. Boston lad, Brock admits he typically prefers younger guys. He doesn't have a set ?type? but he knows what he likes when he sees it. He does know he likes his men like he likes his meals?super sized: big chests, big guns, big dicks. Who doesn't? Brock discovered his dick at about 13 and even though he messed around in high school he didn't have ?full on? sex 'til he was in college. His first kiss was with a boy that would become his first major crush while the two were on a waterbed during a sleep over...ahh, waterbeds?a blast from the 80's past. From copping a sleepy feel to an impromptu kiss which initially terrified him seconds after having done it; to being able to take a rewarding sigh of relief when the boy returned the favor. In his personal life, he's primarily versatile and it all depends on who he's with. He admits it took him a while before considering taking his natural exhibitionistic tendencies and turning them into a career in the adult industry. Well, we can all definitely agree we are certainly glad he did. It was a slow and gradual progression which started with public sex in cars or the beach knowing others might be watching to sex at parties. When asked what the best sexual experience he's ever had, he admits it's probably not what most would expect. It doesn't even involve fucking. He instead remembers his first boyfriend and the amazing head he was first introduced to; and sadly realizing, after the fact, that no one else would ever compare or be able to suck his dick off to completion. Settle down!?we're not accepting applications.Brock begins by stripping off his tank and giving us a spectacular view of his chiseled chest with the sexy tat on his pec and the inked armband to match. He undoes his shorts and turns as he slowly slides then off, teasing us as his sweet bubble butt comes into view. His ass looks amazing in his tight blue briefs and he pulls them down a bit to give us a peak at the crack of his before lying face down on the couch. He then begins to mock hump the couch as his half clad ass rises and falls with every delicious thrust the couch is getting. It isn't long before he strips them off altogether and begins to play with his meat. Next thing we see is his defined frame and spectacular ass covered in suds and glistening as the water dances off every delicious inch of him. He massages the soup all over and makes sure to pay attention to this sensitive hole. If there was ever a time to want to be a bar of soap?this would be it.  We digress, Out of the shower wrapped in a towel, Brock makes his way back to the chaise where he lies back and begins to tease his growing cock beneath the damp towel. After a few minutes, Brock opens his towel and his growing cock makes its long awaited debut. His thick dick is growing by the second and Brock slowly begins to give it the attention it deserves.Brock lubes up and strokes his meat as it expands to full mast. His smooth heavy hangers contracting and expanding as Brock continues to tease his meat. He sits on the edge of the chaise and spreads wide to give his dick more room. A shot from below gives us a great view of what he's working with and just when you think it can't get any better?it does! Brock on his back, his thick legs up in the air, his elbows holding them in place as he strokes his cock with one hand?and fingers his sweet ass with the other. WOOF! There should've been some kind of warning for the faint of heart.  The only thing missing is a bib. Oops, TMI. He moans as he lies back with his legs in the air and gives himself 'the finger'...or two. His dick is throbbing as his ass is being stimulated and when he feels that familiar tickle in his balls he gets up and moves over to the couch where he lies on the floor, rests his feet on the couch and begins to jack his lubed dick. His hands explore his tone chest and abs and it only helps to heighten the sensory overload. His wrist swirls on his knob and it gets him even closer to climax. Once there, his tight body contracts and Brock groans as his abs tighten and his cock expels its cargo. His smooth chest is quickly coated with his load after several volleys of thick cum pelt his skin. Brock moans and groans with every violent convulsion his body endures as his load continues to erupt. Once he's done, Brock tries to relax as his body gives up the last few twitches as his massive orgasm subsides. The look on Brock's face says it all.",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    }
  ],
  "release_date": "2009-03-05",
  "scene_id": 53923,
  "tags": [],
  "title": "On The Clock, Scene #01"
}