{
  "collections": [
    "Men Over 30"
  ],
  "description": "Last month we brought you a blast from the past with Lee Covington and Dane Hyde in what turned out to be a hot oral scene. These two, who had previously worked together off camera, got a chance to actually 'work' together. Apparently naked really worked well for these two, so we figured we'd bring these two horny workers back to do a 'little' more this time. Neither of them objected?so here we are. Both of them have been in the industry for a while and they both agree it hasn't really affected them directly. Often times Lee might get recognized and Dane as well has had his fair share of sightings. They usually aren't a bad experience but often times it can be a tad awkward when they happen at inopportune times. Lee was on a date with a guy he had met recently when one of his date's friends told him he'd had Lee in his hotel room earlier that afternoon. Lee hadn't had a chance to tell his new beau he in fact did porn. Oops! They both understand that doing what they do will always leave them vulnerable to the scrutiny of others and where Lee is more reserved in when to share his 'hobby' with guys he meets, Dane tells them upfront even before a first date so he can get that out of the way. As long as they can get past the 'persona' it works out. Like in the movies some people can't seem to distinguish that who you see on camera isn't always exactly what or who you get off camera. 'Some people will always see me as a cop or a Janitor', Dane laughs, recounting some of his past movie roles. Well, whatever the pitfalls and slight the random sightings may be; we are glad men like these two come in and do what they do. It gives the rest of us an awful lot of fodder to stroke to.Lee and Dane waste little time before getting themselves reacquainted. They begin making out as their hands begin to explore each other, pulling off their clothes as they do. Dane leans back as Lee begins to lick his furry chest, working his nips and savoring his furry pecs. Dane loves the attention he's getting and moans softly as Lee continues his oral exploratory. The oral attention only gets deeper as Dane loses his jeans and goes face down into the chaise. Lee, too, goes face down?into Dane's sweet ass. Lee can't get enough as he spreads those smooth cheeks apart to bury his tongue deeper and deeper inside Dane's furry hole. Dane can only grunt and writhe in ecstasy as Lee tongue-fucks him silly. Dane wants some as well and they maneuver into a hot 69 with Dane sitting back onto Lee's face as he goes down and swallows Lee's throbbing cock. You'd think these two were competing to see which of them could pleasure the other more as they both go all out to please the other. Lee is tongue-fucking Dane's sweet ass and has his face literally buried deep inside his cheeks as Dane bobs up and down, swallowing the length of Lee's meaty dick with ease. Each fueled on by the sensation the other is giving him. This much oral foreplay can only lead to some intense fucking?and those games are about to begin.      Lee is bent over the chaise as Dane slams his cock deep inside him. 'You like that don't cha?' he grunts as he rides Lee's ass hard and deep. Dane loves Lee's ass and he isn't making any apologies as he fucks away pounding Lee's hard. Lee grunts and groans but takes it like a man as he gets his sweet ass stretched by our hairy stud. They talk dirty to each other as Lee also asks Dane how he likes his ass. It's hot watching these two masculine studs just go at it fucking each other senseless. Next thing we see are Lee's smooth balls bouncing up into Dane's hairy ass as Dane rides Lee. The tables are turned and it's Lee now calling the shots and fucking some serious ass. Lee latches onto Danes shoulders as he impales him harder and deeper onto his throbbing cock. Both of these studs wanted more and they're both getting exactly what they wanted. Dane continues to grunt and groan as he grinds his sweet ass back onto Lee's meat. They are both caught up in the moment as they become one hot fucking mass of lust and lube. Lee wants more control so he gets Dane off his dick and puts him back on his stomach. Within seconds he buries his cock back into the hole he'd just been tasting. Lee piles his cock deep into Dane as he rides him harder and harder. Dane loves it and gives it up readily. From there Dane gets on all four as Lee continues his assault Doggie style and then finishes his fuck session in a hot missionary position. Watching his thick dick disappear into Dane's ass is enough to do the trick and Dane explodes all over his furry navel in no time. Lee isn't far behind as he jacks his own load all over Dane's sexy pelt. Whew. The Old 'Flip-flop' ?Man Sex at its Finest.",
  "models": [
    {
      "name": "Dane Hyde",
      "person_id": 27919
    },
    {
      "name": "Lee Covington",
      "person_id": 27836
    }
  ],
  "release_date": "2009-02-26",
  "scene_id": 53921,
  "series": "Flip Flop Lovin",
  "tags": [],
  "title": "Flip Flop Lovin, Scene #01"
}