{
  "collections": [
    "Men Over 30"
  ],
  "description": "?Semper Fi?Do or Die.? Is the creed of this week's former soldier on MenOver30. Nick Johnston is 33yo and a former New Yorker. He stumbled into Miami while in the Marines?and never left. Queens, NY might have been home but it's not the tropical playground we have here. He's currently seeing someone and he's been seeing her for about 9 months. She is typical of the girls he likes. She's petite with cute little titties and a really nice ass. Well, He's definitely in the right hemisphere for nice asses. The Latinas keep him plenty busy. He lost his cherry at the tender age of 12 with his sister's best friend. They trekked out into the woods for their first time and unknowingly ended up a few yards away from a campground. There's nothing like stumbling to get into your first hole with an audience. After that he couldn't get enough. He did all his sister's friends, a few girls in school then found that sex with older women really opened his eyes to new things. After coming to Miami, he explored his wilder side. He had threesomes and groups, tried sex with a fellow marine on a dare from two girls they were fucking. They apparently fell for the ?Well, if we're doing it for you, you have to do it for us!? routine. America needs more marines like these. That was his first taste of dick?but not his last. ?Sex is sex, right?? he muses as his sexy grin puts a twinkle in his eyes.Nick begins to undress slowly as he takes off his button down. He rubs his lean abs and inked chest as he asks, ?Do I have a nice body?? Tease! His heads kept shaved down and his sexy goatee frames one brilliant smile. He drops his jeans and bends over on the couch as he shows us just a peek of his ass. He slaps it and grins knowing you'd want a piece of that marine tail if you had the chance. He drops his boxers and finally begins to give his growing cock the attention it deserves. As his cock gets harder, Nick begins to sigh and moan, obviously enjoying the stroking he's getting. He stands as he continues to jack his dick. At one point he bends as far forward as he can while pulling his boner up to see if he can lick his dick, Wishful thinking, Soldier! Not that we, str8 or gay, haven't tried that once or twice growing up. (Don't even! You know who you are!) So close ...but yet so far away really. Nick aborts Operation ?Yeah Riiiight ?and continues with the matter at ?hand?. He decides, to better asses this task, he should regroup to a different setting, perhaps a horizontal one?Once on the floor, Nick lies back and starts working his dick faster as he works up a load. His thighs are spread wide as he jacks his thick dick. He gazes down past his smooth abs to see his glory all lubed up and throbbing. His fingers reach below and begin to play with his heavy balls. It isn't long before those same fingers take a detour and find warmer pastures as he fingers his sweet ass while still jerking his bone. Nick's really getting into his jerk off session and as we get a view from above, we see Old Nick giving us some of his hottest sex faces. Impressive. He then gets up off the floor and kneels on the bench. He doesn't feel his ass has gotten its full 15 minutes so he leans forward and begins to give his ass a proper fingering while beating his meat underhand. He pushes his hard cock back under his ass as he darts his digit inside. His face says it all as he plays with his asshole. This is why str8 men don't like you playing with their assholes. They know that once you get a taste...you never know. One thing we do know is Nick definitely loves that tail played with and this soldier has no qualms showin' it. All that ass play can only spell curtains for the load Nick's been brewing and as he feels his balls begin to tingle, he lies back down to get in place for the fireworks. As he jacks his dick faster his face signals the inevitable and as that sexy mouth gasps opens in anticipation of his release, his cock begins to spew load. He pumps out his first batch of boys all over his smooth navel as the rest puddles atop his short-cropped bush.",
  "models": [
    {
      "name": "Nick Johnston",
      "person_id": 27938
    }
  ],
  "release_date": "2009-02-19",
  "scene_id": 53920,
  "series": "Not My Last Time",
  "tags": [],
  "title": "Not My Last Time, Scene #02"
}