{
  "collections": [
    "Men Over 30"
  ],
  "description": "If you've ever wondered what there is to do while in Peru-well, have we got the perfect idea for you. Aged 39 delicious years and answering to the name Mr. Balboa, Peruvian 'Papi' Jessie is back with us this week and undoubtedly making another lucky guy ...well, 'lucky'. For those of you unfamiliar with Jessie, this compact muscular Latino has a smile that could brighten any room, soft spoken, dark bedroom eyes and packs a thick dick to boot. What else could you ask for on this Latin lover? Lucky for us Jessie is back and giving us front row seats to another one of his amazing shows? So far we've seen him stroking, an oral scene and a hot 3 way where he got to bury his meat. This afternoon's gonna be a little different and it will be Jessie's delicious ass getting plowed. Long overdue if you ask us! lol The honors have been bestowed on Tyler Saint. Tyler, 44, lives in L.A. and has an extensive repertoire on DVD with a huge fan base. Tyler is 'married'. (Sorry Boys!) The 21st couple in W. Hollywood to wed, these love birds are now in legal limbo. (Thanks to Prop8!) His partner isn't in the industry, although Tyler's been trying to convince him to do a scene...just once! Porn-the gateway remedy? lol Tyler admits he doesn't even watch porn to get in the mood. Jessie grins ear to ear admitting he loves porn and jacks off all the time. Lucky us.Jessie wastes no time before leaning in for a kiss, as Tyler follows his lead. These two are all over each other in seconds as they grope and kiss each other. The passion and chemistry is undeniable as these two go at it. Fumbling for each other's belts and buttons, the jeans come off both Tyler and Jess are left wearing sexy black jock straps. Tyler cant resist Jessie's charms as he kneels before him to taste his growing meat. Jessie bites his lower lip in awe, eyes clenched, as Tyler swirls his mouth all over his meat. Jessie looks down as Tyler worships his meat and suddenly feels left out. He pulls Tyler to his feet as they both strip and Tyler gets sat down on the couch. It's Jessie's turn. Tyler moans and gasps as Jessie devours his dick. He swallows every think inch of dick with ease as he bobs his head up and down on Tyler's spit-shined rod. No matter the angle, these two are amazing as they go about their carnal feast as if we weren't even there. They can't seem to get enough of each other and in no time maneuver into a hot 69 on the rug. Jessie's on his back as he nurses on Tyler's throbbing bone as Tyler is bobbing his hot mouth on Jessie's aching meat. It's always nice to see two men go at it that appreciate the wonders of 'Foreplay'. Oh, Foreplay....some of you might need to look that up. Under 'E' for 'Extinct'. Just when you think they've had enough oral, they turn their talented tongues onto each other's asses as they lick, suck and eat each other's holes quickly driving them into a frenzy which can only lead to one thing -some body's getting fucked!                                                        Tyler begins fingering Jessie's amazing ass as he readies it for what's to come (literally). Pun intended. As Tyler begins to slide his extra thick dick inside, stretching him open, Jessie maintains his composure. Once Tyler starts giving him the fuck he's had coming, poor Jessie can only grunt and groan as he scrambles to accommodate the massive anal invader. It can't be easy taking all of Tyler's thick meat shoved into you and he's too horny to stop or even slow down, Jessie's face says it all as his brows furl and his teeth clench. His grunts are coupled with Tyler's sighs of ecstasy as his thick dick finds the tight hole it's needed. Jessie then straddles Tyler as he sits on his dick giving him a bit more control of the plowing. Jessie has already gotten used to the battering ram and he doesn't hesitate to ride him hard. As hot as it looks, Jessie gives Tyler the impression he's not fucking him hard enough. Tyler moves Jessie to the floor where he picks up his legs and shoves his dick back in him. He can bury his meat as hard and as deep as he wants now-and there's little Jessie can do except make 'OZ' worthy grunts. (and we're not talking Kansas, either) Tyler takes his ass hard and it sends them both over the edge as they stroke off their massive loads lying side by side. -DAMN! J",
  "models": [
    {
      "name": "Jessie Balboa",
      "person_id": 27930
    },
    {
      "name": "Tyler Saint",
      "person_id": 27904
    }
  ],
  "release_date": "2009-03-26",
  "scene_id": 53930,
  "series": "Oh When The Saint...",
  "tags": [],
  "title": "Oh When The Saint..."
}