{
  "collections": [
    "Men Over 30"
  ],
  "description": "Sometimes when the planets align just so, we come across the perfect combination of age and youth. A hot older Daddy in his prime getting his carnal needs met by a younger stud that appreciates all a man in his prime has to offer. This week we have a sexy, tall 'Daddy' that goes by the name of Ken Mack. Ken is 41 and originally from Phoenix, AZ. His classic features and well developed 6' frame make many do a double take as he strides into a room. It's that air of mature confidence that many find irresistible. That having been said, we decided to pair up Ken with a little bit of East Coast admiration. At a compact 5'5, 23yo Colton Steele is as defined and deliciously furry as Floridians come. His dark features coupled with the pale skin and permanent five o'clock shadow only a few in his arsenal of traits designed to weaken even the most seasoned veterans. Once these two get together, the chemistry will more than do the rest as they awake and take care of the age old dilemma?morning wood. Nothing quite like having someone there in the morning to help you take care of what can often be a ?hard? thing to handle. After that, the only thing left to start the day right is that morning 'cup o' Joe'; though they may need some fresh cream ...for their coffee. (of course) Ken is in the kitchen in his sexy briefs pouring him self a cup-o'-jo. Fresh out of the shower is Colton wrapped in a towel. Ken turns and after saying their hellos they embrace. The morning kiss leads to a lot more as Colton's towel hits the floor. Ken's hands are all over his compact ass as he spreads those furry cheeks wide feeling that sweet ass of his. Colton has more than a kiss in mind as he drops to his knees and fixes himself some sausage for breakfast. Ken is hard in seconds as Colton slowly and steadily works his thick cock with his mouth and tongue. Colton shoves Ken's cock deep down his throat struggling to take every inch as Ken moans his appreciation. 'Aww yeah, Suck that cock' he coos as he puts Colton up against the wall to make it easier to feed him his now throbbing cock. His dick is huge and has a natural curve to the south which only helps Colton take it down his throat. He then puts Colton up on the bar as he returns the favor licking and sucking all over Colton's furry chest and abs before swallowing his meat with ease. Colton moans in awe as Ken sucks his cock and without warning picks up his legs and shoves his tongue up inside his tight ass. Colton can't help but mutter in tongues as Ken does his own communicating via tongue as he French kisses his furry hole. Ken can't get enough of his ass as he repeatedly buries his face and tongue deep inside his small ass getting it ready for a lot more than a rim job. 'Fuck that feels good' grunts Colton as Ken slaps his ass. 'You ready for more?' asks Ken seconds before we see Colton's tight ass expanding to accommodate Ken's thick rod up inside him. It doesn't take long for this spit fire to get used to the anal invader and he's riding Ken hard in no time. He bounces his tight ass up and down on Ken whose hands are exploring Colton's defined bod. Colton turns his head back to get to kiss Ken as he gets his ass plowed deep. Ken then puts our boy on all four as he slides his massive meat back in for more. 'You like that!?' he grunts only to have Colton assure him how amazing it feels. They are grunting and groaning as their animal instincts take over. Ken falls forward onto Colton to continue kissing him still buried deep inside his hungry hole. Watching Ken's ass rise and fall into Colton as he fucks his ass missionary is incredible. The dirty talk escalates the hotter they get as Ken tells Colton just how deep he is inside him. This position is hitting all the right spots and it isn't long before the grunts and dirty talk do the trick. Ken Pounds away harder & deeper literally fucking Colton's load right out of him. Ken is next as he too adds his own batch of cream to an already cum coated but very happy trail.",
  "models": [
    {
      "name": "Colton Steele",
      "person_id": 27909
    },
    {
      "name": "Ken Mack",
      "person_id": 27910
    }
  ],
  "release_date": "2009-04-23",
  "scene_id": 53938,
  "series": "Cream In His Coffee",
  "tags": [],
  "title": "Cream In His Coffee, Scene #02"
}