{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have two sexy studs making their debuts here on MenOver30. The first is tall and sexy with a sweet hairy body he takes great pride in. He's also spending a very special day with us?his birthday. Mr. Joe Kent turns 42 today and he is as delicious as they come. His body is chiseled and has a sexy coat of hair that accentuates every curve and muscular definition. He has classic features and has a permanent 5 o'clock shadow that makes him that much sexier. His smile is an added bonus. Fortunately for his birthday, Joe got to have some sweet ass. The sweet ass belongs to one smooth, muscular hottie names Jason Crew. Jason is 26 and has an All-American Jock look to him with brooding features and a smooth, chiseled frame. He's every inch a poster boy of the Horny and curious Frat boy of many a fantasy. He has a boyish grin with a personality to match with subtle dimples. So for his birthday Joe gets to have sex with a hot younger stud; or maybe it's Jason who is getting the present on Joe's birthday and gets to experience sex with a more experienced, older man in his prime. It's all about Perspective really. Regardless, the chemistry between these two is explosive and we have front row seats to the wet-n-wild sex-travaganza. Meeting in the shower stall at the local gym these two waste little time before kissing and feeling each other up. They slowly undress each other as their lips lock. Their tees come off as do their jeans as Jason is the firs to go down. As they strip off the rest of their clothes, we get to see both of these studs' lean and defined bods. They turn on the shower as they drench each other in the warm water. The water runs down Jason's back and Joe's fingers find and begin to finger Jason's smooth ass. It isn't long before he wants a better look and kneels to taste that sweet ass for himself. Joe spreads Jason's ass wide, burying his tongue deep. 'Awww yeah, eat my ass!' moans Jason as he gets his hole rimmed. They then dry off and take their session to the bench. 'Does that taste good?' asks Joe as he watches Jason choke down on his meat. He bobs his head up and down on Joe's thick 7' cock; gagging when he takes too much down his throat. Joe just lets him do his thing as he watches the young jock scramble to please him. He holds his dick at the base and slaps his meat on Jason's tongue before feeding him more of his meat as Jason gags & chokes on it. 'Suck it!' orders Jason as he finally gets a mouth on his meat. Joe easily swallows every thick inch as Jason talks dirty to him as he taunts and teases him for a change. This is getting good... The oral is getting these two worked up and after suckin' dick for a bit, Joe bends Jason over again to get more of his sweet ass. He starts eating Jason's smooth ass, burying his tongue as deep as he can getting Jason horny for more. 'You wanna fuck me with that cock?' Jason teases as Joe's tongue fucking him. Careful what you wish for cuz you just might take it all. Joe is ramming his ass within minutes as Jason groans and moans begging him for more. He loves that thick dick ramming inside him as he braces himself on the wooden bench. 'Ram it to me' he orders as Joe gives it to him hard and deep. Jason can't get enough as Jo pounds his tight ass as he holds on to his small waist. A shot from below gives us a great view of Jason's hungry ass as it takes a pounding from Joe. Jason is loving it and can't stop talking as he begs for more amid his grunts and groans as he takes a hard dicking. Joe isn't saying a work as he continues his anal assault. He then puts Jason on his back and slams back into him missionary. Joe is hitting Jason's prostate in t his position and Joe, sensing Jason's climax, begins slowly burying his dick deep causing Jason to explode all over himself. Joe isn't far behind as he pulls out and covers Jason with even more seed. Whew. Looks like more than birthday candles were blown this afternoon. :)",
  "models": [
    {
      "name": "Jason Crew",
      "person_id": 27905
    },
    {
      "name": "Joe Kent",
      "person_id": 27906
    }
  ],
  "release_date": "2009-04-02",
  "scene_id": 53932,
  "tags": [],
  "title": "Getting Dirty Cleaning Up, Scene #02"
}