{
  "collections": [
    "Men Over 30"
  ],
  "description": "A couple of fresh faces this week on MenOver30. The first of our new studs is Chris Stevens. Chris is from Ohio (Round on the ends and HI in the middle!) and at 39 he's a new comer to the adult scene. This will be his 4th production to date and he loves it. It's even made him a better lover at home. He now finds himself making sure the lighting is just right and is now a lot more verbal and tends to direct at home. ?I guess it was always in me' he laughs 'cause I'm getting good at it.? The one thing he's learned since he's started doing films is how mush work actually goes on behind the scenes. The second of our debut batch is a sexy, lean hard body named Chad Brock. Chad is 35 and is from Los Angeles. This is Chad's first time. (How often do you get to use that line?) Well, first time on camera anyway. He's been debating whether to do it or not for a long time. Regardless of any reservations or anxieties he may have had, he more than ?rose? to the occasion. Fortunately for these two, the chemistry between them was amazing. It isn't always the case but when the planets align the results speak for themselves. Chris admits he hasn't had this kind of chemistry with a co-star to date and Chad was equally surprised to have that chemistry making it easy for both of them to get lost in the moment.  Chad makes the first move as he crawls onto the futon where Chris is laying back. They immediately begin to kiss, exploring each other's mouths and bodies with their tongues. Soft and passionate caressing sets the pace as they slowly begin to undress. Chad licks Chris' nips and smooth defined chest, chewing on his nipple ring, as he moans his approval. Chad then slides off Chris' jeans and continues kissing him before going down for a long awaited taste test. His cock responds immediately as Chad swallows every growing inch as he tugs on his smooth nuts. Chris' eyes roll back as he gets his dick worked slowly fucking Chris' mouth. Whatever Chad's doing on Chris' dick it's working as Chris writhes in ecstasy. Then it's Chris' turn as he begins to work Chad's cock through his sexy briefs. Chad's abs and chest are chiseled and flex at Chris' touch. Soon his tongue is dancing all over Chad's cock as he sits back and watches the show. Chris bobs up and down on Chad's meat as Chad holds his head down on his dick. Now it's Chad who's moaning as his cock disappears down Chris' hungry throat. These two can't get enough of each other and the fun is just beginning. Next Chris puts our California boy on all four as he spreads his cheeks wide and dives in tongue first. Chad moans aloud at the sensation of Chris' hot probing intruder. If he thinks this feels good?he's in for a thick surprise. Chris continues to lap at his smooth ass, eating away and working Chad into a horny frenzy. Soon his fingers replace his tongue and right when Chad's ass is open and receptive?it's time. Chad's eyes squint as he eases his spit lubed ass down on Chris' cock. He's riding Chris' dick as he gets used to its girth but Chris isn't a patient one. ?Fuck you have a tight ass!? Chris groans before standing up to get his cock in deeper. Chad moans and begs for more as Chris holds his small waist and repeatedly impales him. Chris is fucking him hard and Chad's loving it. He then puts him over the edge of the futon and we get a great view of his thick dick sliding in and out of Chad's ass as Chris heavy nuts slap away at Chad's scrotum. The sounds of his balls slapping his ass; coupled with their heavy moans only heightens the experience as they fuck themselves senseless. Missionary is next for Chris who throw's Chad's legs in the air before burying his meat back in for more. This position does the trick as Chad explodes all over himself while Chris fucks every last drop out of him. The visual alone sends our buck Eye over the edge as he pulls out and gives Chad's abs a second coat of whitewash. Well?DAMN!",
  "models": [
    {
      "name": "Chris Stevens",
      "person_id": 27908
    },
    {
      "name": "Chad Brock",
      "person_id": 27925
    }
  ],
  "release_date": "2009-04-16",
  "scene_id": 53936,
  "tags": [],
  "title": "Beginner's Luck, Scene #02"
}