{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have sexy Bo Gio back in the house. It's been a while since we've seen the str8, 32yo New Yorker; and we're glad to have him back in town. He's been working out; staying busy; keeping in shape and watching his diet. Busy Boy! He's still single and doesn't have a 'steady' girlfriend, per say. We're sure this smooth, defined piece of the Big Apple is having way too much fun being single to want to settle down. Who could blame him looking like that? Also making his debut with us this week is a thick piece of Midwestern Maverick. Currently living in Seattle, this sexy cleft-chinned morsel goes by the name of Dean Tucker. Dean is 31 and is originally from Montana. He has a sexy hairy body that he keeps au natural and has fur in all the right places. He is currently dating in an 'open' relationship and everything's going well. He was upfront about what he does when they met and his boyfriend is ok with his work in the adult industry. 'If they're the right one; they will be ok with what you do', Dean professes. Aww. Today Dean is going to be ?THE? lucky guy that gets to give Bo his first 'Hummer'. Bo's always been open-minded and secure with his sexuality. That being said, we definitely feel we should be the first to expand his sexual horizons and ask sexy Bo: ?Is a mouth really a mouth?? ...stay tuned. Sitting back on the couch, Bo lets Dean do his thing while he allows Dean to take off his jeans. Dean isn't taking any prisoners and he's on a mission. dean slides Bo's tee up as he begins to lick and suck all over Bo's defined chest and abs. Bo just lays back and tries to get used to the new sensation as well as the new visual of a guy working his nips and kissing his chest and happy trail. The look on his face speaks volumes as Dean goes to town on the first timer. Bo, eyes closed, turns his head to the side (probably visualizing Beyonc?) as Dean continues licking and sucking. Penny for your thoughts, Bo? Hmmm. Dean doesn't let up, working every exposed inch of skin as he crawls right up between Bo's open legs continuing his oral assault on our str8 boy's who shifts around awkwardly at first. Not knowing what to make of Bo's reaction, Dean decides it's time to take this str8 boy to a whole ...other ...level. For real! He lets his tongue slide further south to the waistband of his boxers distracting him as he slowly pulls them off. Bo's thick, flaccid cock is molded over his massive balls as they come into view. Bo tenses a bit, closing his eyes again as Dean buries his face and tongue just below his heavy nut sack. He licks all over his cum-filled balls and starts to lick up and down Bo's growing member. By the time Dean decides to take Bo's uncut knob in his mouth, Bo' almost at full mast and humping up into Dean's face. Dean finally wraps his full lips around Bo's cock. Bo's in heaven as Dean swirls his tongue all over his meat, swallowing it to the hilt. His rock hard cock is being worshipped by another guy for the first time and doesn't seem to mind the 'guy' part one bit. Wanting a bit more control, Bo puts Dean on his back and straddles his chest so he can fuck his face. Dean looks up at him; swallowing and slurping on his dick. Bo strokes it, inches from his face, before slapping Dean's face with it, teasing his cock sucker a bit before sliding back in for more. 'Yeah, feed me that dick!' Dean begs as Bo obliges. The fun's just begun and getting his dick sucked isn't going to be the 'only' first for old Bo. He stands up and lies face down on the chaise as he orders Dean to get behind him. Dean, a quick study, has his tongue up Bo's ass in record time. Bo's eyes close in rapture at the sensation of Dean's tongue on his hole. Dean kneads and spreads his cheeks wide as he French-kisses his sweet ass. The rimming does the trick and Bo won't last much more. He flips over and feeds Dean his meat as he face fucks him guiding his head up and down with his hand. Dean laps and sucks on his knob as he Bo strokes approaches his climax. Dean's rewarded as Bo sprays his load all over. Dean then lies back beside our breeder boy to bust his own massive nut landing atop his sexy fur. ...Mission Accomplished, Agent Tucker.",
  "models": [
    {
      "name": "Bo Gio",
      "person_id": 27907
    },
    {
      "name": "Dean Tucker",
      "person_id": 27923
    }
  ],
  "release_date": "2009-04-09",
  "scene_id": 53933,
  "series": "First Time For Everything",
  "tags": [],
  "title": "First Time For Everything, Scene #01"
}