{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have two new faces here on MenOver30. The first one is a New Yorker native, Manny Torres, who can't get enough of Miami's weather. That's' the story he's sticking to anyway, He's 30 and a swarthy Latin mix of Venezuelan, Colombian and Dominican. With a mix like that; we may not want to get him angry. Latin tempers can be quite hot; but it only makes the sex even hotter! <evil grin> Beefy chest, shoulders and guns, Manny is no stranger to the gym. He's as nice as he is hot and it's always nice to meet a man secure enough in himself to just 'be' without the ego. It was his charm that attracted his costar who is more than just his 'costar' on set this afternoon. Vin Costes, also 30, met Manny in NY; after having met online on a muscle site. (That's all we're saying) After all, it's not like we've ever heard a story like that story before. Turns out they had a lot of mutual friends between them; which is what ended up making their meeting actually happen. Vin is quite the sexy import and we can all thank the French Riviera for it's contribution in the form of this smooth, defined, uncut French man with a gentle nature and a weakness for Beefy 'macho' types. 'Mais oui', the French can not live on bread alone. Here, in their second ever on cam sexcapade, are Manny & Vin; and to them we gaily (it's a French thing) say: 'Encore, un fois!'.Hell-bent on making their own amateur porn, Manny picks up the camera and begins to film Vin as Vin slowly teases the camera. He undoes his shorts and begins to work his growing cock. It isn't long before he's in his boxers and his meaty uncut cock is being worked for all to see. As he strokes his thickening cock, his foreskin slowly slides over his knob and he gets into it as Manny slowly gives him direction on his work. He pulls his skin forward and then after teasing it, slides it all the way back showing us his now raging bone. Manny is getting worked up filming his better half and it isn't long before he's stroking his growing meat through his jeans. The view of Vin's rock hard cock and that sexy ass peeking from beneath his heavy nuts isn't something he'll be able to resist for much longer. He gets up and joins in on the fun, kissing Vin before immediately going down on him. He bypasses his cock, burying his tongue in that sweet ass that was calling his name. Vin grunts as Manny's tongue finds it's intended target. From there Manny begins to suck his uncut cock further sending the Frenchman into a lust induced frenzy. Manny then decides to get some for himself as he strips and gives Vin his own thick Latin cock. Vin takes to it and expertly begins to worship his thick Latin meat.A hot 69 follows with Vin sitting on Manny's tongue while sucking on more of Manny's thick meat. These boys love their oral prep and Manny puts Vin on all four so he can once again have access to his 'ass'-ets. He once again buries his tongue inside Vin, eating his hole out hard as Vin loses himself in the moment. Now that Vin's ass is spit lubed and hungry for dick there's only one thing left to do-fuck! Manny easily slides in the well prepped ass as Vin's ass accommodates every thick inch. Spreading his hot ass open, Vin gets Manny's cock deeper inside s Manny begins to fuck his sweet ass. After a bit, Manny lies back on the couch as Vin straddles and begins to ride his dick. In no time he's bouncing up and down on his cock as Manny steadies his ass with his hands. Vin is riding him reverse cowgirl and Manny has an amazing view of Vin's ass just consuming his dark, latin dick. He then puts Vin on his side, and slides back in, pumping in and out of his warm hole in quicker thrusts. Manny's own muscular ass is on display as he fucks his smooth, Parisian playmate. Vin then goes back to riding Manny and it's the position that sends him over the edge as Manny, sensing his impending climax, fucks the cum out of him. Manny then jacks his own load all over his furry navel as Vin licks his hairy balls.",
  "models": [
    {
      "name": "Manny Torres",
      "person_id": 30704
    },
    {
      "name": "Vin Costes",
      "person_id": 27946
    }
  ],
  "release_date": "2009-05-21",
  "scene_id": 53945,
  "series": "On The Other Side",
  "tags": [],
  "title": "On The Other Side"
}