{
  "collections": [
    "Men Over 30"
  ],
  "description": "Finally, after a highly anticipated arrival, we finally have Dak Ramsey in our studios. This beefy, inked slice of California, aged some 31 years, is here to show us just what he's packin'. Broad shoulders, a defined chest flanked by inked guns definitely sets this sexy stud apart from the rest of them. He considers himself Bisexual and is currently with a special someone who is ok with what he does. She's one lucky lady. She is open-minded so to speak and has no problem watching his Men-on Men work; but doesn't really care to watch his str8 stuff. There's no threat to watching Dak with a guy. He watches them with her but admits he isn't comfortable watching himself on cam. He watched his stuff before with an X who would critique his stuff with him to get him to do better work. It was more of a critique than anything else since his x-boyfriend wasn't all that into watching him on cam either. I guess given the option, they'd rather have him 'on them' rather than on cam. When it comes to guys, Dak isn't attracted to a particular type; but attitude is everything. 'If someone has a bad attitude it's just a turn off for me' he says. Well, we can all agree there. Fortunately, this sexy Bi boy, who dreams of Bisexual orgies at night, is even nicer in person...Go Figure. Sitting on the couch wrapped in a towel, Dak is headed to the bathroom to get ready for the day. He lathers up his face and shaves revealing a clean-faced hottie underneath. He then returns to the couch to handle some other business that needs taking care of. As he throws open his towel he takes his soft meat in his hands and begins to wake it. He grabs his knob with one hand while stroking just his shaft with the other. It seems to so the trick as his meaty cock begins to thicken. He continues with more of the same, isolating his head with one hand while jerking just below it as his shaft gets even thicker. He finally releases it and his thick 8' meat stands proudly in the air. He leans back and begins to work his nips, jacking his now swollen cock, His heavy balls bounce in time with his stroking and Dak's breathing begins to deepen as he gets more and more into his session. He then lies back on the couch, spreads those thick thighs apart and shows us everything on the menu. His muscular frame is a testament to the dedication he's put into his physique. His broad shoulders and chest taper into his small waist and then your eyes are met by those massive quads and that thick dick of course. It's a visual smorgasbord. Just when you think you've seen it all, Dak gets up, kneels on the couch to show us his hairy ass. He reaches back, kneading his bubble butt before bending over to give us a better view of the backfield. His hairy ass is on display as Dak continues to stroke his thick meat. After a few minutes, Dak sits back on the couch and goes back to working hit now enraged cock. His dick is as thick at the base as it is at the knob and we're sure this bad boy has made many grunt out of joy?and pain. He works his dick with both hands and sitting back we get a great view of his tattoos on both his arms as well as on his abs. This muscular stud with the dark features and the bedroom eyes is working himself into a frenzy and it won't be long before that pays off. A view from below shows his heavy balls that are now pulling closer to the bas e of his thick dick which is being stroked by first the right hand then the left. Dak looks down at his meat. His eyes are glued to his fuck stick as he continues to pleasure himself. His hands roam as he feels his furry thighs and navel, occasionally tweaking his nips all making him even harder as he prepares for the inevitable. He then lies back on the couch and strokes his meat as he feels his balls tighten and begin to unload. Dak groans loudly as his thick cock unloads blast after thick blast, coating his navel and furry crotch below.",
  "models": [
    {
      "name": "Dak Ramsey",
      "person_id": 27912
    }
  ],
  "release_date": "2009-05-07",
  "scene_id": 53942,
  "tags": [],
  "title": "Dakking Off, Scene #02"
}