{
  "collections": [
    "Men Over 30"
  ],
  "description": "Making his debut this week is one of those men that are not afraid to go against the grain. Fortunately he paid no mind to all of those naysayers who told him he'd never get anywhere unless he shaved his chest. We here at MenOver30 don't have any problems admitting we are hairy men aficionados. Originally from Chicago and making his third ever appearance on cam is 37yo, Ray Daniels. Short cropped hair with a sexy 5 O'clock shadow framing a smile to light any room, Ray is currently single. He is open to finding more were he to find someone who could accept him as he is. Apparently, Ray has a dry, quirk sense of humor that takes some getting used to. Ray is adventurous and his best sex to date was when he was 19, speeding through Virginia at 3 am and getting pulled over by a cop. Ray did everything to get out of that ticket. He lived to tell the tale and got to play with the lights after! Today we brought back Chris Stevens who only has a few films up on Ray. Chris is 40 and single. He says he'd be open to more should he find someone who is incredibly patient. He's a lot to handle and all over the place; but judging from the sparks that flew between these two?he may not be single for long.They're all smiles as they sit side by side. Chris is eager to explore Ray's hairy body. We all want what we don't have it seems. Chris' tongue explores Ray's chest, licking his nips before kissing him some more. The chemistry between the two is obvious and there is no need to break the ice. They strip down and as Ray gets naked, Chris can't help but admire his furry body. Ray then decides to take a shower and we get to see him soaping up his built in sweater. His fur covers his chest and runs down his abs coming together in the middle to form a furry happy trail as it runs south where it meets his thick dick. Chris can't help but un-wrap the towel keeping him from Ray. He takes to his cock in seconds; savoring every hardening inch. Ray wants some as well as he strips Chris' pants off as the rest of Chris' smooth frame comes into view. Chris' dick is hard in seconds as Ray works his magic. ?Yeah, suck my dick? he orders, pushing Ray's head down on it. Ray obliges as he works his cock before ultimately putting Chris on all fours and shoving his talented tongue up his ass. Chris is moaning aloud ordering Ray to tongue-fuck him. HOT! Chris then flips things and gets Ray on his back as he sucks his cock some more and slowly begins to finger his hairy ass. Ray's legs can't help but levitate with anticipation. ?Ooh that's a nice ass? Chris grunts as he's steadily fucking that hairy ass he'd been prepping for a pounding. Ray is looking up at him as he too is caught up in the moment. Chris' heavy nuts bounce on Ray's ass as he fucks him faster. Next, Ray gets bent over the couch for some more lovin'. Chris fucks his ass hard, pounding that furry pie like it's the last piece of ass he'll ever get. Ray is grunting and begging for more duck as he takes the pounding. ?You like that hairy ass?? he moans as Chris bends down to kiss the nape of his neck. Chris methodically rises and falls into Ray's hole, gripping Ray's waist with both hands. It seems the hornier this Ohio boy gets; the harder he fucks ass. Next is doggy as Ray gets pulled down on all fours for some more bonin'. He tries to steady himself and jerk his meat as Chris relentlessly fucks away at his ass. He's fucking Ray harder and faster and the look on his face tells you he's a man on a hairy mission. That sweet ass does the trick as he pulls out and unloads all over Ray's smooth back. The sensation on his skin sends Ray reeling as he rears back and jacks his own healthy batch of boys all over his furry navel. Whew. Imagine if these two were actually into each other! Pfff! LOL Yeah, we need to get this hairy boy naked again...and soon.",
  "models": [
    {
      "name": "Chris Stevens",
      "person_id": 27908
    },
    {
      "name": "Ray Daniels",
      "person_id": 27945
    }
  ],
  "release_date": "2009-05-14",
  "scene_id": 53944,
  "series": "Hairy Potter",
  "tags": [],
  "title": "Hairy Potter, Scene #02"
}