{
  "collections": [
    "Men Over 30"
  ],
  "description": "Dak is back! This week we have inked, hottie Dak Ramsey back on the set. We got to see 32yo, Santa Rosa native Dak last month as he stripped off his clothes, flexed his inked guns and unloaded his main cannon. Our members are still talkin bout that scene. This week we decided to bring him someone special to play with. Dak told us he is really big on attitude and that the wrong attitude on a guy?no matter how hot?was a total buzz kill for him. We couldn't agree more so we enlisted the help of one very genuine guy who also just happens to be incredibly hot. Those props are for none other than newcomer Brock Russell. Brock heated up the Ides of March giving us one sizzling solo set. He has more than a few tricks in his arsenal including that disarming smile. Both are well traveled and both have a few places they've yet to visit. Dak wants to visit Ireland and Brock wants to visit Berlin. Their fantasy film roles are equally as diverse. Dak's ultimate fantasy role would be to star in a full-on bi sexual film where all involved are bisexual. Brock grins as he listens to Dak's fantasy film role before he unloads his: ?I want LOVE to be the bottom in a gang bang scene? Taking in the huge grin plastered on his face, what on earth would you follow that up with? They begin kissing as their hands begin to explore. The chemistry is evident from the start between these two. As they layers peel off piece by piece, more skin is revealed affording Brock even more places to lick and suck on. It isn't long before these two are better acquainted as Brock uses Dak's beefy chest and abs as a buffet table, licking and sampling everything it has to offer. Dak's definitely not complaining and soon both of them are left in their sexy boxer briefs. Dak kicks his off and as he slides Brock's down his all the way to his ankles, Brock's boner bounces free and bobs inches from Dak's mouth. Dak immediately goes to work on Brock's meaty shaft as Brock moans his soft spoken appreciation. Brock's cock is hard as a rock and it isn't long before he's gonna want to suck some dick too. Dak's eyes roll back into his head as Brock shoves every inch of his dick down his throat. He expertly bobs and works his mouth and hand on Dak's dick. Dak can't get enough as he leads Brock over to the chair where he sits down, spreads em wide and directs Brock back down between his legs for more of that oral attention he's getting. As Brock bobs on Dak's cock we get our first view of his spectacular ass as he kneels between Dak's strong thighs. Once he's had his fill of dick (as if); Brock gets up and stands on the chair with his ass to Dak as he bends over and offers that sweet ass for sampling. Dak buries his tongue deep and it sends Brock into a moaning frenzy. Daks' face is buried up in that beefy, smooth ass and he's not coming up for air anytime soon. The tongue gets Brock horny for more as he gets on all four on the couch where Dak begins fingering his spit-lubed hole. Now you're talkin as Brock's hole easily swallows every finger he's prodded with. The anal attention is driving him nuts and soon he has Dak sitting back on the couch while he climbs up and straddles his cock, sliding his tight ass all the way to the base of that hefty fuck stick. He rides Dak hard, telling him just how good his fat cock feels in him. The verbal's adding to the madness and soon Dak flips him on his back and buries his meat again pounding away at his hungry hole. Brock's legs on his shoulder's and his dick buried deep, we're sure Dak's view is even hotter than our own. Dak's furry thighs and hot ass slap away against Brock's as he continues taking that ass. Dak's eyebrows furl in rapture as he pounds away missionary only to then fuck Brock in a doggie position that does the trick for both of them. They sit back side by side as they empty their loads all over themselves, grunting and groaning as they do. Fuckin HOT!",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "Dak Ramsey",
      "person_id": 27912
    }
  ],
  "release_date": "2009-05-28",
  "scene_id": 53948,
  "tags": [],
  "title": "Brock It To Me, Scene #02"
}