{
  "collections": [
    "Men Over 30"
  ],
  "description": "Troy Halston is back this week and we've enlisted his help in breaking in one of our latest discoveries. For those of you who don't know Troy, he's a regular fan favorite here on MenOver30 and last time he was here he showed us his flip side when he actually bottomed for hot newcomer, Dallas Reeves. Troy has been in the industry for well over 15 years started out in the gay adult industry and then began doing bi films where he met his wife, Holly. Holly's not just any girl either; the Halstons are well-known in the industry, have their own website and then there are the reality TV show rumors as well. So, who better than a seasoned Pro to help welcome 21yo Ridge Michaels? Ridge is a Florida boy who recently broke up with his girlfriend and says he is now gay. 'Screw girls!' he giggles as we clue him into the fact his co-star is in fact married to a (real) girl. Ridge is from Siesta Key and his strawberry blond hair, jock looks and amazing smile are hard to pass up?not to mention his thick 8? cock. He's just beginning to explore the industry, by comparison, but this bright eyed native loves to explore new adventures. One of the hottest adventures he's had was fucking a girl he was dating on the roof of his house during a rain storm. We're sure this stud looks even better soaking wet. Troy takes charge and begins kissing Ridge to help put him at ease. He lifts his tee and as he does, Ridge's washboard abs come into view. This island boy is working with a hot defined bod. As Troy continues to explore, he discovers Ridge's thick 8' cock that pops free of his jeans. Troy works his mouth on Ridge's rod and our young stud can't help but moan his appreciation. Troy then gets up to free his own cock before letting Ridge have a go at his own dick. Troy intends to give Ridge a complete work out as he goes from getting his cock sucked to fucking Ridge's hot face. Ridge has a lot to offer and Troy isn't about ot miss out on any of it. He steps down off the couch, pulls Ridge to the edge and lifts his muscular legs in the air. Ridge's smooth ass is on display and only a tongue away. Troy buries his tongue deep into his hairless hole as Ridge writhes in ecstasy. He eats that sweet ass for a few before lowering his legs and getting back on Ridge's rock hard cock. Ridge loves the attention he's getting and after getting a workout on his cock, Troy stands up and gives Ridge more of his dick to work. Ridge is quick to return the favor, getting Troy rock hard for what's yet to cum.'Oh, we're definitely gonna do this' Troy taunts as he rubs his fingers right on Ridge's puckered hole. Ridge's ass is insanely hot, perfectly smooth, round ass that you just wanna take a bite out of. Ridge is bucking back against Troy's fingers as they tease his sweet ass. 'Bend over and show me that pretty ass' Troy continues as Ridge obeys every order. Troy begins to finger his ass before standing up and lining his hard cock right up to his ass. He then slides his cock inside inch by inch and once inside he begins to give Ridge a proper fucking. Troy's heavy balls slap at Ridge's ass as we get a shot from below. 'That's a tight little butt hole you got' he moans as he fills Ridge's ass with his daddy dick. Troy lies back on the couch and lets Ridge fuck himself as he gyrates his tight hole, sitting on Troy's cock. Troy grabs him by the waist and slams his dick up into him, burying his balls up Ridge's sweet ass. The shot from below as Ridge spreads his smooth cheeks apart for more of Troy's meat is too hot for words. From there, Troy puts the Florida boy on his back and goes back to fucking him 'missionary'. This position does the trick and soon enough Ridge is dumping his thick load all over himself as Troy fucks the rest of it out of him. Troy isn't far behind, pulling out and emitting low guttural grunts (what's that about?) with every batch of cum he splatters on the Ridge below.",
  "models": [
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    },
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2009-06-04",
  "scene_id": 53950,
  "series": "A Ridge To Somewhere",
  "tags": [],
  "title": "A Ridge To Somewhere, Scene #02"
}