{
  "collections": [
    "Men Over 30"
  ],
  "description": "?WOLF!...WOLF!? the boy cried aloud, seemingly out of breath. No, this is not a reenactment of the classic Aesop's fable of old; it was this week's last sexual conquest. Originally from New York, 35yo Wolf Pax has called Florida home for the last 12 years. He started having sex with girls at an early age and 5 years later discovered he could have as much fun with a guy. He believes that a hole is a hole but it all depends on the mouth and what that mouth can do. Boys generally give better head?but not always. He is an equal opportunity lover and enjoys sex equally with both. He loves to stick his dick in the female body but with a guy he likes to be on the receiving end. Now, with those piercing blue eyes, amazing smile, ripped body and an ass to match WHO would deny this surfer type stud a proper fucking. ?How can you really know how to have sex with a girl; unless you've been fucked like a girl?. He makes perfect sense and he willingly admits size does matter and anyone who tells you different?is lying. We love this guy! Fortunately, Wolf is here to show us that cock that loves to fuck pussy and that ass that can't get enough cock. True bi guys always wanna do with boys what they can't do with girls...Duh!As Wolf slowly peels off his tee, we get our first glimpse of this stud's defined chest. His dedication to the gym is beyond evident and we ain't mad at him one bit. Out from his waist band we see his rock hard abs have been tagged with a tattoo that reads ?Gladiator?. Looking at the physique and the man it's etched on there isn't an ounce of false advertising here. His ice blue eyes and devilish grin only add to this ripped, summer blonde's charms; and it's not like he's lacking in that department. He strips and slowly begins to stroke his rock hard cock. His bod is smooth and hairless except for a small tuft of fur he keeps at the base of his cock. His hands caress his defined frame as he continues stroking his swollen meat. He turns around for us and gives us a shot of those buns of steel. He kneads them and spreads them wide giving us a peek of the tight hole it hides. The cam moves in on a tight close up of this stud as he looks right at you, eyes filled with longing as he whispers, ?Don't you wanna fuck me?? WOL?err we mean WOOF! Damn, this stud knows how to get exactly what he wants.Wolf begins to massage his cock and hairless ass as the camera pans down and gives us a view from below. He spreads his smooth buns apart, showing off his puckered prize. There isn't an inch on this stud that isn't sun-kissed and fat-free. He's definitely the healthier choice on the sexual menu. Wolf now turns up the heat as he gets on all four before giving us an anal show. His ass is in the air and it looks like 2 muscular globes that are glistening in the light and begging for attention. Fortunately, Wolf is giving it what it needs as he first runs his fingers on his hungry ass before slipping in a finger. First one finger then switches to the second finger as they take turns barely entering his tight ass that clenches tight with every attempt. He strokes his cock underhanded all the while as he works his ass. Wolf then gets up on the bench and goes back to working his throbbing meat. He strokes slowly at first, hamming it up for the camera as it looms overhead and then he gets to the task at hand. He stands up and jerks faster and as he approaches his climax he lies back on the bench and goes for gold. The light dances on every ripple as his sweat and oil slicked chest and abs contract as they prepare for blast off. Wolf grunts as he finally unloads his cargo as he sprays his abs and the bench below.",
  "models": [
    {
      "name": "Wolf Pax",
      "person_id": 27915
    }
  ],
  "release_date": "2009-06-11",
  "scene_id": 53951,
  "series": "Locker Jock",
  "tags": [],
  "title": "Locker Jock, Scene #01"
}