{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back to show us just what he can do is last week's discovery Brenn Wyson. For those of you who mistook his accent for Southern, Brenn is originally from Boston and now calls Florida home. Though we mentioned he was more of a lover last week we thought we'd tell you that he's also quite the fighter. Brenn loves to fight and be in the ring. Brenn's a boxer and he's been boxing for years. ?I love to fight? he smiles. Brenn is into both guys and girls and is a sexual person. The wildest dirtiest sex to date for Brenn involved a mass orgy. ?I'm a dirty boy? he beams. Back for more fun (and by ?fun? we mean dick) is a sexy 21yo who made his debut on ExtraBigDicks that answers to the name of Feliz Andrews. Feliz which oddly enough means ?happy? in Spanish, specializes in handling rather large equipment. After his debut with the likes of Josh West, we figured he would definitely be up to the challenge of going a few rounds with our Prize Stud. Feliz is originally from Ft. Myers, FL and admits he's totally into older men. ?Most of them have their shit together; and that's attractive? Our little boy has finally come home to MenOver30. Feliz isn't bi, he knows what he likes and we have a feeling so do we. Feliz is going to be in for a hot bout. Ding, ding.They start to make out as they pull each other's shirts off. The energy between them is apparent. Brenn slides onto his knees between Feliz' legs as he pulls off his jeans. Feliz' thick cock springs out as his pants as he loses his drawers. Brenn goes down on his thick dick immediately. Brenn works his cock like a pro and Feliz isn't complaining. Brenn then gets up and Feliz gets his chance to sample the wares as he sucks Brenn's cock as he slides off his sexy briefs. 'Aww yeah, suck my dick', Brenn moans as Feliz sucks his dick and sucks his heavy balls into his mouth one by one. Brenn is going into overdrive as he gets back on Feliz' cock. Who knew this bad boy would've been this crazy for oral. The oral isn't anywhere near over as they maneuver into a hot 69 position. Brenn laps at Feliz' cock and balls while burying his own Boston bone deep into his throat. From there the oral gets even hotter as Feliz kneels and lifts Brenn's legs up in the air before diving tongue first into his smooth ass. ?Aww fuck yeah, eat my fuckin ass' Brenn groans as Feliz gives him a royal rimming. But there's more tongue to be had today.Brenn then goes to work on Feliz' smooth hole as he laps at that sweet ass he will soon have for the taking. He moves up into position and starts rubbing his bare cock on Feliz' spit soaked hole. It drives him mad as the Boxer's cock taunts his tight ass. After some more rimming Feliz is ready for dick as he straddles Brenn's meat and slowly impales himself onto it. It isn't long before Brenn is bouncing his sweet ass up and down on his rock hard cock. 'Feels so good' Brenn grunts between breaths as they continue their session. Brenn then gets Feliz into a doggie position and really starts giving it to him. He pounds away at his hole like it's the last round of a grudge match. They say boxers all have a rage in them and today Brenn's fucking that rage into Feliz. Feliz is in heaven as he gets his ass torn up. The look on his face as Brenn pile drives his meat deeper and deeper speaks volumes. Brenn then moves him into a missionary position where he now starts fucking him nice and slow giving Feliz a chance to recoup. After a few he bends our Happy Hottie over the couch and gets right back to work fucking his sweet hole. This position does the trick as Brenn explodes and coats Feliz' back with a massive load. Feliz then shoots his wad all over Brenn's chest and abs. ?and there's the final bell.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Feliz Andrews",
      "person_id": 27962
    }
  ],
  "release_date": "2009-07-02",
  "scene_id": 53957,
  "series": "Independence Daze",
  "tags": [],
  "title": "Independence Daze, Scene #01"
}