{
  "collections": [
    "Men Over 30"
  ],
  "description": "The boy cried ?WOLF!? and everybody came?literally. We couldn't get enough of Wolf Pax last week so we had to have him back this week to see him in action. Wolf is 35 and currently lives in Ft. Lauderdale, FL; though with that twang in his voice you'd think this transplanted New Yorker had 'actual' Southern roots. The boy who cried 'Wolf' over and over this afternoon is Alexander Garrett. Alexander is South American and confesses he finds American men hot. All-American looking Wolf with the ice blue eyes, ripped, surfer body couldn't have been a better match. His biggest weakness is Brazilian men. They are sexy, their skin color, they're hung and the Portuguese dirty talk makes them even hotter. Wolf on the other hand likes everything. ?Boys, girls, both at the same top, bottom, top: I just like to fuck? he laughs. If he could run to your house in less than 2 hours growing up he would've talked you into playing doctor. This MD of love began interning at the age of 9. Damn! After a few years fucking all the neighborhood girls; he realized he could have the same kind of fun with boys, too. Go Figure. By 15 he was fucking anyone that would hold still long enuff for him to mount. ?WOOF!Wolf wastes no time in getting his needs met. He stands up and undoes his jeans as Alexander kneels before him. Alexander is in for one hell of a fuck with one very horny Wolf. They peel each other's clothes off and once they're naked, Alexander takes his place again on his knees before the ripped stud that slowly begins to fuck his face with his hardening member. Alexander is drooling as he works Wolf's meat. He holds Wolf's cock with his hand and aims it at his mouth as Wolf begins to hump into his mouth. The sexy tat that reads ?Gladiator? is the visual that Alexander sees before him as Wolf's defined abs and navel continue to fuck his face. Wolf, wanting fun from both ends of the table sets Alexander down and goes to work on his uncut meat stick. It doesn't take long for Wolf to get Alexander's cock rock hard as he jerks his own. From there they move into a hot 69 with Wolf on top. He works Alexander's cock and also has access to that sweet ass he will soon be fucking. He bends Alex over his knee as he buries his fingers in his spit-lubed hole. Alexander just moans for more as Wolf gets that Latin ass ready for a fucking. Wolf is over due and Alexander's about to have more than his hands full withthis stud.Bent over in a 'wolfie position?, Alexander is taking every thick inch Wolf is giving him. He's holding him by the waist as he continues to ram his meat deeper and deeper inside Alexander's hole. Wolf is fucking him rough and it's turning Alexander on. He then puts the Latin lover on his back, picks up his legs and shoves his meat in for more fucking. The sounds of Wolf's balls slapping away at Alexander's ass fill the air coupled with the sounds of Alexander grunting as he tries his best to accommodate the pounding he's being given. Alexander wanted a fucking and that's exactly what he's getting. Next, Alexander sits on Wolf's cock as he rides him for more cock. Wolf lies back and lets Alexander do the work for a bit while he looks up and enjoys the swarthy view. Alexander is leaning back and literally bouncing and grinding his hot ass onto Wolf's throbbing cock. It won't be long before these two prepare to nut. ?You like that baby?? wolf whispers as Alexander rides him. Next, Wolf puts Alexander face down and rams him hard and fast using his receptive ass to milk his load out. This does the trick and Alex is the first to nut jacking his load all over his smooth abs. Wolf follows suit coating Alexander's smooth chest with his own batch of protein.",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Wolf Pax",
      "person_id": 27915
    }
  ],
  "release_date": "2009-06-18",
  "scene_id": 53954,
  "series": "Partners In Crime",
  "tags": [],
  "title": "Partners In Crime, Scene #02"
}