{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have a bit of New England in the house this week. If you're thinking Clam Chowder you're definitely on the wrong site. We got something better than Chowder and when used as directed he's a lot more 'filling'. <Foreshadowing...hint, hint>. We digress. Brenn Wyson is 37yo and once you hear the accent on this chiseled hottie you'll be able to pin point exactly where in New England he's from. He now lives in Florida and the tan accents the intricate ink he has on his naturally smooth bod. He's a man of few words but his face will tell you everything you need to know. He's always been sexual even as a teen. 'The first time I masturbated-I knew I was in love!' he laughs. At 12 he knew he loved it but he felt 'dirty'. Hmmm.-AS IF! <Omit Catholic guilt reference> He fantasized about both while growing up but didn't have his first male experience until he was 20. He just loves sex and is an equal opportunity kind of guy. He's outgoing and isn't afraid to go after whomever strikes his fancy. There isn't anything he hasn't fantasized about that he hasn't already experienced and it's not hard to see why. This smooth, muscular cutie is compact and has the look of a well-toned knuckle brawler; but our stud claims he's a bigger lover than he is a fighter. ...We like.In a sexy wife beater, Brenn warns us he's gonna get naked and beat off. (I guess inquiring minds need to know?) He pulls off his tank and begins to grope at his crotch as he undresses. 'touchin' it, ...rubbin' it' he says as he rubs his cotton clad boner. Ooh, we got ourselves a verbal one. Nice! He reaches into his briefs and begins jackin his cock which by now is over its environment and wants to cum out and play and not in that order. He pulls his briefs down under his smooth nut sack as he revels in the jacking session he's giving his thick meat. He loses his briefs and lies back on the riding bench to continue working his boner. He plays with his precum that is now pooling at the end of his knob. He looks down intently at his throbbing baby maker as he moans and groans. He then lifts his legs in the air showing us out first glimpse of his muscular ass and hole. He's naturally hairless and what nature did give him he's removed. No need to stop to play 'Find the Pubie' with this stud. No sir. He stands up and keeps working his swollen cock. 'Suck my fuckin dick' he mutters under his breath as he strokes his meat. He loves to get what he wants and isn't afraid to tell you what you need to do to get it.'Put that big fuck'n dick in yo' mouth!' he orders as his verbal parade continues only made hotter by that damn accent. He goes on telling you to suck his dick and how bad he wants your ass on his meat as he slowly air humps with that sexy bod. The view from below is nothing short of spectacular and he knows it. He's feeling 'dirty' again so we suggest a shower. He lathers up that smooth body of his and is twice as delicious glistening wet. He soaps up his bod while blowing kisses at the camera, jerking his sud-covered meat. Yes, he's still giving you scenarios that all involve you-or any number of your parts-literally 'ON' his dick. We're ok with that. He gets out of the shower and gets on all four and works his tight bung hole for us as he strokes his cock & digitally masters his ass. Brenn is feeling that familiar tickle brewing in his balls (pronounced 'Bwallz' in 'Brenn') lol He lies back on the bench again and strokes his cock for gold. His abs and chest begin to tighten up you know it won't be long at all before he-'Im gonna fuck'n cum ...I'm gonna fuck'n cum ...I'm gonna-Uugh. His dick explodes sending massive jets of thick chowder soaring all over his smooth chest and abs. Its intense watching his 5th (out of 9 thick shots) be the one to soar past his shoulder. Not sure if he's a lover or fighter; but after a load like that we're sure of one thing...Soups on. <evil grin>",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    }
  ],
  "release_date": "2009-06-25",
  "scene_id": 53955,
  "series": "The Lover",
  "tags": [],
  "title": "The Lover"
}