{
  "collections": [
    "Men Over 30"
  ],
  "description": "Two sexy furry daddies are back this week to have a go at some sweaty man fun. The first is Latin Papi, Jessie Balboa. Jessie became an instant fan favorite after his very first appearance. The sexy Latin lover with the Colgate smile and the Latin soap star look smoldered his way into many hearts?and even more pants. The 39 year old is incredibly grounded and loves it all. He takes it as good as he gives it and when it comes to sex, he is always open to exploring new things. We'll just say where he may appreciate ?vanilla? in his shake, it's not found anywhere near his bed.  Jessie is au natural this time and so is his sexy co star Dane Hyde. Dane is a blast from our past and graced us years ago and has only improved with time. He recently lost 25lbs and is looking hotter than ever. Both of these boys call Florida home and Dane is partnered and admits that his hubby's hairy chest was one of the things that initially drew him to him. Jessie, on the other hand is single. When asked if he too has fallen in love, Jessie laughs and admits, ?Yeah, a couple of times? Mmhmmm. Fortunately, we're only aiming for ?lust? this?so these two are overqualified.Slowly they start to explore each other as they begin to undress each other. Once their tee shirts come off we get our first view of these furry studs. Jessie immediately gets to work on Dane's sensitive nips launching him into orbit. Dane readily returns the favor as they continue undressing the other. Finally the pants come off these two and it's Dane who makes the first move. He greedily goes down on Jessie's thick cock as he slowly engulfs it into his expert mouth. Jessie is bucking up into his face in no time as he revels in the oral work over he's getting from Mr. Hyde. Soon enough, Jessie is the one on his knees between Dane's beefy and hairy thighs as he bobs up and down on Dane's dick like an oil rigger goin' for gold?white gold, that is! LOL Ok, that was SO wrong. Jessie isn't done sampling Dane's ?wares? so he puts Dane on all four as he begins to eat Dane's sweet ass which makes Dane's eyes roll back. If the tongue lodged in his ass wasn't enough; Jessie then further explores it digitally. And by ?digitally? we mean one ?digit? at a time. Dane's grunting with delight as Jessie prods and fingers his hungry hole.Already in position, Jessie removes his fingers and replaced them with his throbbing cock. Dane lets out a low guttural grunt as Jessie invades his ass. Jessie means business and is soon ramming his fat cock deep into Dane. Dane grunts repeatedly as he moans with a mixture of pleasure and pain that just heightens the experience. Jessie holds Dane's ass still as he begins to pound his cock harder and harder inside him. All Dane can do is grunt and take it as Jessie owns his ass. The look on Jessie's face says it all as he bites his lower lip and continues to bury his meat. ?Oh yeah, buddy!? groans Dane as he continues to get his hole pounded. Jessie then flips him over onto his back before slamming his dick back inside. Dane tweaks Jessie's nips as he looks up and watches Jessie's face as he continues to give it to him. A shot from behind gives us a great view of Jessie's cock as it plunges in and out of Dane's ass. Jessie's balls bounce repeatedly on Dane's ass as the fucking continues. The chemistry between these two couldn't be any hotter. Dane then sits on Jessie's dick and rides him a bit; just long enough to jack out his load. Dane unloads all over Jessie's furry navel who then adds his own batch to the mix, leaving a thick milky trail.",
  "models": [
    {
      "name": "Dane Hyde",
      "person_id": 27919
    },
    {
      "name": "Jessie Balboa",
      "person_id": 27930
    }
  ],
  "release_date": "2009-07-09",
  "scene_id": 53959,
  "series": "Hyde & Seek",
  "tags": [],
  "title": "Hyde & Seek, Scene #01"
}