{
  "collections": [
    "Men Over 30"
  ],
  "description": "Some more of the Brits have we this week with one broodish Jack Sparrow. Jack is from Plymouth which is near Devin. He's Gay and says it without an ounce of hesitation. He has a boyfriend who knows what he does and he admits he gets lots of sex. He is swarthy with dark features and bedroom eyes. He lost his virginity late in the game at 19. He admits even though he got a late start he's made up for lost time and even had sex out in the moors. He's 32 now and is a curious Aquarius. He has a personable demeanor and likes guys that are 'ginger', slim and in shape. He doesn't like boys that are overdone or overly muscular. For those of you unfamiliar with the term 'ginger', it means Ol' Jack here is a fan of the Fire Crotch. Red heads do have a certain appeal it seems. He confesses he is into things that are 'dirty'. He is into feet and likes guys that aren't afraid to try new things. He also gets into all sorts of things that many may not explore. Anything that involves licking works for him. There isn't anything that someone would tell him to try that he wouldn't try at least once. He's also into speedos and admits he prefers that to the whole leather type scene. He finds that all kinda scary. Hmmm. Interesting. Jack begins as he gropes his crotch through his jeans. He is already sporting wood and in no time he's fumbling for his belt as he undoes his jeans. He opens them and pulls them off. He's left in a pair of sexy tighty-whiteys that are struggling to contain his rock hard cock. His thick dick snakes up the side of his crotch as the clear impression of his cock and big balls are prominently in view. He teases his meat as he rubs his hands along the length of it and it reacts as it throbs to his e very touch. Jack then gets up on his knees and turns away from us so he can give us our first glimpse of that sweet 'arse' of his. Why they call it an 'arse' is still a mystery. lol We digress, he lens over a bit and as he does he lowers his underwear and shows us those hairy orbs that are filling out his briefs quite nicely. His hands dive inside his briefs as he feels his ass and explores even further as his fingers do a bit of cave diving. He then gets up and pulls off his briefs altogether and we finally see his thick uncut cock as it stands at attention. It's in need of some TLC and Jacks more than ready for some too.He lies back on the couch as he strokes his thick meat. His body is naturally smooth from the waist up and has hairy legs. His ass which currently has a finger teasing it is also hairy and is seems to be making our sparrow rather excited as he squirms at the attention. His thick cock is at full mast as he continues to stroke it. He tugs on his smooth balls from time to time and he knows exactly what triggers to pull and when. His lean body is flexing in a symphony conducted by his hands as he caresses, tweaks, gropes and tugs on his balls, ass and cock. He definitely knows how to get his cock to respond to his touch and at this rate it won't be long before he's making a lot more than beautiful music. His breathing is already noticeably labored as he kneels and jacks his British beef faster and faster. His frame looks incredible as he kneels and his pecs are tight and flexed as the wave of erotic energy moves through out his body. He feels that familiar tingle in his balls and lays back to work his magic. He spreads his legs wide and beats his cock faster as his finger gets reacquainted with this hot ass. That does the trick as Jack sends his thick lather airborne. He grunts loudly with every batch he sends up and soon enough his meat is covered in thick milk. Well, we now have plenty of warm milk. ?Biscuits anyone?",
  "models": [
    {
      "name": "Jack Sparrow",
      "person_id": 27918
    }
  ],
  "release_date": "2009-07-30",
  "scene_id": 53966,
  "tags": [],
  "title": "British Beef, Scene #02"
}