{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today is couples day at MenOver30 and we have a special treat. The couple this week is none other than Dane Hyde and his beefy beau, Brock Hart. We've seen Dane with that charming smile, and other assets, recently; but his beau, Brock was a definite blast from our not-so-recent past. They have been together for a while and Dane admits, 'It was love at first really crappy pick up line'. Apparently they were standing in line at the bookstore (NO, not an adult bookstore) when Brock told Dane, 'Nice scar'. Dane had recently had an accident and had a scar on his elbow that was bandaged up and...that was it. When asked if that was the first they'd ever met, Dane swears he had met him before; but Brock, on tape, shrugged and said that that was the first time he'd ever met Dane. <ouch> Moving along, they first got involved in the industry when a mutual friend asked them to come in for a photo shoot. That led to more work and they never said no. Eventually that led to video work and since they needed the extra money for grad school it definitely helped with the bills. They rarely get cast together in scenes though often times they are cast in the same movies. Both being in the industry they understand the way it works and can use each other as sounding boards and then get to reconnect in an intimate way that is reserved for them 'off' camera.These two have no ice to break as they start to share their most intimate moments with us. They begin kissing and Dane slides Brock's shirt up revealing his furry chest as he licks and teases his nipple. Brock, standing at 6'5', has an impressive frame and his chest is no different. Dane is next as Brock returns the favor and samples his own furry chest. From there, the foreplay leads to more oral as Dane slides off Brock's pants revealing a sexy tan line and a big cock. He engulfs it immediately, swirling his tongue around the growing shaft and it isn't long before Brock's meat is at attention. Brock moans softly showing his appreciation. Brock then wants to return the favor as he slides onto his knees and goes down on Dane. Dane's cock is rock hard and glistening as Brock sucks it to the hilt. The attention is driving Dane wild and it gets better as Brock puts him on all four and starts to lick that furry hole of his. Dane's sweet ass is on display as Brock shoves his massive tongue up inside that ass he knows belongs to him. His skilled mouth works Danes cock and ass getting Dane that much hornier for dick. It won't be long before he gets his wish as Brock jockeys into position...Brock gets up and puts his knob at Dane's back door. Dane's ass is spit-lubed and ready for more as Brock easily slides inside. Dane grunts slowly as his ass begins to take all the meat Brock's got for him. 'Oh yeah, Baby' coos Dane as Brock begins to slowly fuck his ass. From bent over the chair, they move to the couch as Dane goes face down and Brock mounts him from behind. He lies down on him as he impales Dane's ass for more fucking. Dane is moaning as he grinds his ass back up onto Brock's thick cock. They fuck in this position for a few before Brock puts Dane on his back and enters that ass missionary. In this position, Brock can look at his lover's sweet face as he buries his cock inside him even deeper. He slowly buries his meat inside and it isn't long before we hear Dane say, 'Oh Baby, I think you're gonna make me cum'. His cock explodes all over his furry chest while Brock is still burying his rock hard dick deep inside him. Brock is next as he pulls out his fuck stick and sends his own batch of boys all over Dane's thigh and spent, cum-covered cock.",
  "models": [
    {
      "name": "Bobby Hart",
      "person_id": 31830
    },
    {
      "name": "Dane Hyde",
      "person_id": 27919
    }
  ],
  "release_date": "2009-08-06",
  "scene_id": 53968,
  "series": "Heart to Hart",
  "tags": [],
  "title": "Heart to Hart"
}