{
  "collections": [
    "Men Over 30"
  ],
  "description": "Bringing back two alumni this week, we decided to pair up two fan favorites and sit back and watch the fireworks. The first is a Seattle boy by the name of Dean Tucker. Dean is 32 and has more than 30 titles under his belt. He's currently dating but it's open and they each do their thing and his beau lives in another city. He loves his job and admits the worst part of his ?job? is meeting so many kewl guys and not being able to hang out with them because they live in different cities. The best part of the job is that they live in different cities. (there aren't any witnesses!) The second hottie in the mix is sexy Boca boy John Stone. John is 22 and loves older men. He's currently single and isn't looking to change that anytime soon. He's happy being single. If he were to settle down he'd need to have soccer legs, a 6 pack, big pecs and pretty feet. John's into feet. He loves to suck on toes while fucking missionary. We have ourselves a ?shrimper?. That's hot! Unlike Dean, John's only been in a handful of productions and like Dean enjoys what he's doing. He loves the fact that he gets to meet lots of new people in the most intimate of ways. The down side has been that it's actually harder than it looks.Dean immediately goes to kiss John as they begin t make out and take each others clothes off. Dean's sexy furry chest in contrast to John's naturally smooth one gives each of them something different to play with. Dean is first at bat as he sucks on John's growing cock. After a bit, he stands and begins to feed John his own growing boner, face-fucking the native Floridian with his throbbing meat. These boys are into oral and soon Dean is back on John's rock hard cock for more action as he sucks and swallows every delicious inch of it as John lays back and enjoys the head he's getting. He then stands up and begins to give Dean some of what he was getting earlier. He steadily lumps Dean's mouth with his meaty cock. His balls slapping away at Dean's chin as he gets his dick swallowed. Dean is in heaven and continues to expertly work Johns' cock. It won't be long before John's dick is gonna be needing more than just a hot mouth wrapped around it and Dean knows that all too well. He figures the harder and hornier he gets our tall, dark and handsome hottie the better the fucking he's gonna get.When he's ready, Dean assumes the position on all four as he looks back at John who is suiting up to take the plunge. John's cock slides into Dean's ass with ease and begins to fuck him deep. Dean can only moan and beg for more as John begins to fuck him with a steady pace. John holds Dean by the waist as he bounces him back onto his throbbing cock as he continues to impale him with his dick. Dean's face says it all as he grimaces trying his best to accommodate every thick inch. This is just the kind of fuck Dean was due and soon enough he's even ordering John to slap his tight ass as he pounds away at his hungry hole. John is more than happy to oblige as he smacks his ass and looks down to watch his meat disappearing into Dean's hairy hole. John definitely knows how to top a hot ass and Dean loves every minute of it. They then switch positions as Dean straddles John's cock and begins to ride that cock. Dean's going to town and riding there at a full gallop. John's in ecstasy as his cock is being milked by Dean's sweet ass. Sitting on John's cock is hitting Dean in all the right spots and before you know it he's ready to bust a nut. He kneels beside John's chest as he unloads all over his chest and abs. John isn't far behind as he too unloads all over his sexy self. ?Whew.",
  "models": [
    {
      "name": "Dean Tucker",
      "person_id": 27923
    },
    {
      "name": "John Stone",
      "person_id": 27917
    }
  ],
  "release_date": "2009-07-23",
  "scene_id": 53963,
  "series": "Fur Sure",
  "tags": [],
  "title": "Fur Sure, Scene #01"
}