{
  "collections": [
    "Men Over 30"
  ],
  "description": "Mr. Tony Robo is this week's discovery. He's a definite morsel of masculine goodness. He just recently turned 30 and is new to the MenOver30 Club. He's originally from Brooklyn, NY. (not that his accent would've given him away) He's been living in South Florida for a year and a half. The biggest difference between NY and his new home is the constant sunshine factor. For anyone that grew up in the frigid North you would understand the appeal. He's currently single and accepting applications. He wants a girl he can take home to momma but can be a total whore in his sheets. He lost his cherry at 14 with a younger girl. Hmmm, A Freshman Player?literally. His ideal girl would have a nice curvy ass, big tits with nice dime size nips. His favorite thing to do to a girl is eat her out and his favorite thing is to have her suck his cock. He's fucked girls in the ass before and admits if he's given the chance he'd do it again in a heart beat. 'It's all good in my hood' he grins which he confessed even includes eating his ass if that's what she wants to do. His hottest sexual encounter was fucking some actor's daughter on the street at 2 am while she bent over and held on to the curb while he drilled her from the back. 'Give me death' she kept moaning. Hmm. Descendent of Sir Patrick Henry, perhaps? After all, it was New York! Anything can happen in New York.Tony begins groping his meat through his jeans as he slowly teases the camera. This is his first shoot ever and we suspect he's been practicing at home. He pulls his tee back over his head and we get our first glimpse of his defined pecs and abs. He has a broken hear tattoo over his left pec. He sits down as he buries his hand inside his jeans, groping his growing cock. His crotch is beginning to tent and he readjusts to give it more room. He opens his fly and starts teasing his cock which is now straining to get out of his sexy green briefs. He wasn't successful at giving that horny tramp 'death'?but liberty he can do. He frees his thickening cock as he loses his briefs and jeans. He shows us that smooth breeder ass of his the likes of which has been between many supple thighs. He leans back on the couch and his cock is rock hard and begging for attention. He strokes it and releases it as it makes a hard slapping thud when it ricochets back against his firm abs. Tony takes care of that beefy frame of his and his efforts have paid off. He continues to stroke his now glistening cock as he softly moans and groans to his own touch. He looks directly at you, licking his lips as he focuses his attention on his swollen rod.Tony then stands at attention (pun intended) as he continues lubing that fuck stick up. The camera moves in for a close up as we get a view from below. His smooth balls bounce with every pump of his fist as they slowly begin to pull tighter and tighter. As your eye pans north of that beating fist we see his pecs and sexy nips that are now flexing as he works his cock harder and faster. His masculine face and bedroom eyes gaze at you with a lust-filled look that would get him anything he wanted once he had you in his bed. Everything about this stud is larger than life, from those sexy rugby player thighs all the way to that home grown smile. Tony then turns back around and bends over giving us all a look at that sweet bubble but we'll never get to touch. We all agree looking is enough sometimes...NOT! He continues to stroke his dick underhand as his breathing becomes more sporadic and his moans more apparent. He sits back on the couch as he spreads those thick thighs wide and beats his thick meat even faster. His pecs are flexed as his body braces for release. 'gonna cum' he mutters, giving his thick meat the last strokes. Who woould have known this fucker was packin a Roman Candle?!  Tony's meat explodes sending blast after thick blast of jizz rocketing (literally) through the air. We've seen less impressive firework displays. DAMN?someone was a tad backed up.",
  "models": [
    {
      "name": "Tony Robo",
      "person_id": 27921
    }
  ],
  "release_date": "2009-08-13",
  "scene_id": 53969,
  "series": "First Time Spitter",
  "tags": [],
  "title": "First Time Spitter, Scene #01"
}