{
  "collections": [
    "Men Over 30"
  ],
  "description": "Troy Halston, the veteran of porn both Bi and Gay is back this week to give us even more of his 'mojo'. Troy has graced us with all sorts of action from solos, duos and then some. Troy is married to his porn star sweetheart that goes by the name of Holly. Holly has her own repertoire of films and they actually met on set. Troy is 39 and rapidly approaching the big 4-0. He is ready for it and says he plans to be in the best shape of his life. He's hired a trainer and is going to tackle, the gym, endurance training, you name it. He will definitely be one to watch as he works towards his Iron man ideal. With Troy this week, we have the adorable and insanely sexy, Kain Warn. Kain's listening intently as Troy boasts about his goals and hopes he can be around to test his ?endurance?. LOL Kain did his very first shoot with us. He actually took Josh West which is no small anything. He has since gone off to play the lead in a Lucas Production as well as sign a contract with Raging Stallion. Looking at Kain you can see why so many are after his hot little ass and he's well on his way to ?Porndom?. Troy has lost count of how many films he's been in starting way back in 1991. So this afternoon, the rising star will get some ?pointers? (One in particular) from the seasoned pro. ?Role 'em!There's no mistaking the chemistry between these two and lucky for Troy, the 25yo new comer is a quick study. They begin licking and sucking each other as they slowly take each other's clothes off. They kiss and grope as they slowly undress. Troy gets on his knees between Kain's legs; pulls his cock out the side of his sexy briefs and swallows it in one gulp. Kain's thick dick begins to grow as Troy bobs up and down on his meat. Kain is loving the head he's getting from this porn veteran and in no time it will be his turn to show Troy his own skills. Troy stands and pulls Kain into his cock as Kain begins to suck on his cock. Kain has Troy cooing and moaning in minutes as he works his mouth all over Troy's now throbbing cock. His spit shined pole looks like it's aching to burst as Kain swallows it deep over and over. His cock is going to need a lot more than Kain's hungry throat in a few and Kain's gonna be in for one good fuck. Troy lets Kain work his cock and then puts our intern on all four before going to work on that ass he will soon have wrapped around his dick. Kain's eyebrows furl and his mouth gapes open as he gets Troy's tongue shoved deep inside.Troy wants more of Kain's mouth as he gets Kain to suck his cock again. He then puts Kain onhis back before squatting over his face so he can pile drive his boner in and out of his mouth getting it ready for the fucking Kain's in for. Once he's ready he bends Kain over and slides his rock hard cock deep inside him. Kain moans and groans as Troy takes his ass. Troy's cock slides into Kain's spit soaked hole with ease and Kain can only grunt and bear it as his ass gets the fucking it's due. 'Awww yeah' is all Kain can say over and over as Troy continues to mount his assault. Troy then decides to change it up and has our stud sit on his cock so he can ride it. Troy spreads Kain's ass cheeks apart so he can jam his cock up into him repeatedly. His balls are slapping Kain's ass in a blur as he jack-rabbits his dick up into him. Kain reaches around and grabs Troy's cum-filled balls, tugging on them as he continues to ride Troy's meat. Then Troy puts him on his back before sliding his cock back inside Kain's tight boy ass. Kain holds his legs up for Troy who is slowly pounding his hole. 'Gonna blow your nut for me, Boy!?' Troy orders as Kain begins to jack his cock faster. Kain explodes as Troy fucks his load right out of him. Troy is next as he drenches Kain's abs with his own.",
  "models": [
    {
      "name": "Kain Warn",
      "person_id": 27924
    },
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2009-07-16",
  "scene_id": 53961,
  "series": "Ford Tough",
  "tags": [],
  "title": "Ford Tough, Scene #01"
}