{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have another one of our ?lover special? in a series we are exploring here on MenOver30. Kain Warn is back this week and he's brought along his partner. Kain has graced us several times in the last few months and we can't seem to get enough of him. He's the exception and not the rule having met his partner without getting online or meeting at a bar or being introduced through friends. Kain met his lover Chad Brock, a blast from a not so distant past, when they were both scheduled to do a shoot together. After their first meeting and when all was said and ?done?; they both knew there was more than lube between them. ?I was really shy at first', Smiles Kain, 'I kept coming up with excuses to go over and talk to him.? Kain is attracted to older guys so it doesn't surprise us that he'd be drawn to the sexy 36yo. Chad doesn't really have a ?type? but he's glad that Kain was the one that finally got to tie him down (...or up). They are still working out the details where they will spend their first anniversary; but we're sure wherever they are the sex will be amazing. They already live together (they 'U-Hauled' it) and have a Shitzu named Charlie. When we asked if they plan on having kids in the near future, Chad grins as he grabs Kain and says ?One's enough!? ?ouch!It's business as usual for these two as they start to kiss as if we're not even here. Their tongues intertwine as they begin to grope and undress. Kain slides off the couch into position on his knees as he starts to suck on Chad's cock. Chad just watches as his lover services his growing cock. Kain slides off his briefs and when they're both naked continues to explore Chad's smooth frame. He likes his chest and sucks his cock a bit before he gets pulled up into another sexy lip-lock. The chemistry between these two is authentic and intimate. It's a treat to have them share their private love making with all of us. They move into a steamy 69 with Chad on top bunk. He slowly sucks Kain's cock as he licks his knob and dances his tongue around the Prince Albert piercing Kain wore. On the other side of heaven is Kain nursing on his man's meat as he spreads his ass cheeks apart. Kain then goes back on his knees unable to get enough of Chad's beefy dick. Kain then turns his talents on Chad's ass which is only getting him harder for that ass.Chad then returns the favor as he sucks Kain's pierced dick and from there he lifts up Kain's legs and slides his beef inside. He starts fucking Kain slowly as he builds momentum. Kain is rock hard the entire time he has Chad inside him. Chad holds Kain's legs as he fucks him as he watches his dick disappear inside that hot ass. Kain then moves over to the chair and bends over awaiting more of that dick he loves. He isn't waiting for very long as Chad takes that ass again. His smooth balls slowly bounce on Kain's ass as he makes love to that hairy hole. Kain then decides to take control as he straddles his man's cock and impales himself on it. He rides Chad's cock as Chad begins to fuck up into his hungry hole. Kain is still rock hard and throbbing and you know with this much stimulation he won't be able to hold out for much longer. Sure enough Kain's cock explodes sending his load up onto Chad's chin and chest. Chad smears his load all over his chest and even samples some of his boy's cream. Kain then helps Chad get his nut, playing with his ass, as Chad beats himself off.",
  "models": [
    {
      "name": "Chad Brock",
      "person_id": 27925
    },
    {
      "name": "Kain Warn",
      "person_id": 27924
    }
  ],
  "release_date": "2009-08-27",
  "scene_id": 53974,
  "series": "The Man I'm Gonna Marry",
  "tags": [],
  "title": "The Man I'm Gonna Marry, Scene #02"
}