{
  "collections": [
    "Men Over 30"
  ],
  "description": "Hailing from the West Coast, we have hunky Iron Man. ?Iron Man? which is what we'll be calling him  is out on the east coast for some R and R on the DL. He is 33 and this L.A. native admits he was an early bloomer and all the girls always told him he was big for his age. ?I guess I just ate my Wheaties? he grins. He's an unabashed booty man and loves a girl with a nice ass. So we can imagine the Latinas here in Miami must keep him very busy. He first fucked a girl in the ass at 15 only 2 years after losing his cherry. Iron Man's a big boy and packing a thick 8? cock keeps him plenty horny. He admits he's a bit of a freak and doesn't mind relieving himself wherever the mood strikes. He's jerked off on rooftops, movie theaters and even on a bus. It's the thrill of getting caught that turns him on. We're sure if anyone were to notice this morsel playing with that thick cock no one would complain. When we asked what the best sex he'd ever had, Iron Man tells us of a girl he met in a local bar down on South Beach. The chemistry was so hot that he ended up picking her up, carrying her, holding her up against the boardwalk while he fucked her over and over in broad daylight with an audience of passersby to boot.Fresh from the gym, Iron Man is here to relieve some ?tension?. He dances around a bit showing off his sparring moves before slowly flexing his big guns for us. His biceps are well defined and rock hard. He slowly shows off the rest, his quads, shoulders, traps, as he flexes in different poses to show off his dedication at the gym. His pecs and abs are defined as we admire the rest wanting more with each pose he gives us. He's teasing us and knows we want more. He lowers his shorts giving us a peak of that muscular ass of his a few times before dropping his shorts altogether. He's left in a sexy jock strap that showcases his spectacular ass even though we just get a glimpse before he sits back on the couch. He starts playing with his cock through his jock before his thick cock grows too large to be contained. His thick dick flops out the side as he strokes it and eventually loses the jock to properly service his meaty shaft. His smooth balls dangle below as he jacks off. He keeps his bush contained but natural which complements the body hair he does have on his sexy frame. Iron Man is working his meaty 8? cock with both hands as he jerks off hand over fist. This can only get better as he stands to give us a betterview.As he stands and jacks his impressive member, we get a great view from below as his body tenses and his muscles writhe just below his skin as he jacks his cock with his wrapped fists. Wonder how many rounds it would take to get this fighter down? We're not sure but we do know you'll need both hands to handle every delicious inch of him. He gets on his knees and continues to jack his fat cock that is by now rock hard and aching for release. His muscular thighs look amazing as he methodically jacks his baby maker. The look on his face is one of focus as he continues to work up a hot load. His thick cock responds to his every touch as he jacks his meat dry. His chest flexes and his shoulders and biceps flex as he begins to jerk faster. He is on target and knows he's approaching pay dirt. He is in control of his every move and muscle with one in particular. His breathing begins to labor as his cock gets even harder seconds before his load erupts. He grunts softly as he unloads his thick cream all over his work out towel below. He strokes it all out making sure not to miss a drop, flicking off any left on his hand once he's done. Whew. Now that's the kind of work out we could all use.",
  "models": [
    {
      "name": "Ironman",
      "person_id": 27926
    }
  ],
  "release_date": "2009-09-03",
  "scene_id": 53976,
  "series": "Str8 From The Gym",
  "tags": [],
  "title": "Str8 From The Gym, Scene #02"
}