{
  "collections": [
    "Men Over 30"
  ],
  "description": "Troy Halston is back with us again and we've decided to pair him up with a local hottie that we think can more than take the pounding that Troy likes to give. Though he's not a regular on our site, his face has made more than a few fans on our brother site ExtraBigDicks.com. That fan favorite is none other than sexy Trey Turner. Trey is 21 and from Miami, FL and has had his fair share of playing with the ?big? boys. We know that ass would be ok with getting a good pounding. Trey is recently coupled and after pulling a 'U-Haul' and moving in with his beau overnight they've now been together for 3 months. Everything is going well so far and he loves that his new man is a gr8 listener and also happens to have a huge cock. Hmm. Troy is also happily coupled but his ?partner? has an even bigger dick than Trey's! Troy's partner goes by the name of Holly?a.k.a. Mrs. Holly Halston. Holly is the second half of a power couple in the adult industry and she keeps our Troy very happy at home. We decided to ask Troy to give our new starlet some advice. 'Keep work, work and home, home. It's that simple.? Troy says. You have to be able to keep the two separate if you want to have a healthy relationship at home. That advice would work for most of us these days. Troy's getting ready for the shoot when he hears the shower running. He goes to investigate and finds Trey Turner showerin' up after shooting his own scene. He decides to help himself to some of that ass as he begins to grope and finger Trey's willing ass. Trey decides he's not done as he follows Troy back into the bedroom. They begin to make out and begin to undress each other. Trey goes down on his knees as he undoes Troy's pants. He begins to kiss and lick at Troy's cock which is now straining to be released. Trey pulls down his briefs and goes to work on his meat. Troy moans as Trey licks and sucks on his balls and shaft. Trey is going to work as he bobs up and down on Troy's thick meat. He licks all over driving Troy crazy and it isn't long before Troy wants some as well. He sits Trey back on the chair and undoes his towel. Trey's cock is rock hard and ready for release as Troy goes to work on his meat. Troy sucks on Trey's cock as he bobs up and down on his meat. Trey's cock is bone hard as it finally gets the attention it's been waiting for. Troy admires his cock as he strokes it, holding it by its thick base before going right back down on it until it disappears down his throat. Troy's had enough foreplay and he needs more on his cock. 'Come over here so I can fuck you' he says as he gets Trey on all four. 'You want that ass?' teases Trey as he looks back and spreads those sexy cheeks. Dinner IS served as Troy slides inside his ass and begins to fuck Trey's ass leaving Trey moaning and begging for more. Troy is fucking that ass deep and hard in no time as he holds Trey down and pile drives his dick deeper and deeper. 'I'm gonna destroy that ass' he grunts as he looks down and watches his thick dick pummeling Trey's hole. He falls forward onto Trey and power fucks Trey as Trey moans like a horny bitch. Did we just go there? lol Trey is in for even more as Troy sits him on his cock and has him ride it. Troy slams his dick up into Trey as Trey does his best to handle the fucking he's getting. Watching Troy's balls bounce on Trey's ass looks amazing as his cock repeatedly buries itself inside that hungry hole. This was just the hole he needed to fuck and just when Trey thought things were coming in for a landing, Troy puts him on the floor with his head on the floor and his ass in the air. Troy slides his dick into him and fucks his sweet hole bouncing his cock in and out of him until he can't hold his load any longer. Troy pulls out and unloads his nut all over Trey's sexy ass. Trey then jacks his own meat off all over his smooth chest as Troy fingers that sore hole. ?DAMN!",
  "models": [
    {
      "name": "Troy Halston",
      "person_id": 27796
    },
    {
      "name": "Trey Turner",
      "person_id": 27927
    }
  ],
  "release_date": "2009-09-10",
  "scene_id": 53977,
  "tags": [],
  "title": "T-N-T, Scene #01"
}