{
  "collections": [
    "Men Over 30"
  ],
  "description": "Well, with Valentines Day behind us (no pun intended) there remains a mix of love and lust in the air. We decided we should help our members out with a hot dose of the latter. The former is way too hard to capture in a webisode. As a special treat, we bring you the hunky daddy with ink and pecs for days, Nick Moretti. Nick made quite the debut on our brother site and we knew our members would love him. Nick is a rugged man's man and he's gonna have his hands full with his co-star today Tristan Jaxx. Tristan is 28 and easily gives Rice-a-roni a run for its money as the San Francisco treat. WOOF! Tristan spent his recent holidays visiting Fort Lauderdale just hangin' around while Nick had similar holidays just enjoying the quiet R&R in Ft Lauderdale which is where Nick calls home. We asked these two what turns them on and makes their dicks hard. Tristan is an unabashed ass man. He loves a nice big round ass and a nice smile-a cute face doesn't hurt either. For Nick, it's all about kissing and having that connection. Those two definitely go hand in hand. A bad kisser is definitely a deal breaker. Well, we're about to find out what kind of connection(s) these two will get themselves into...Tristan is relaxing on the couch when Nick comes in bearing roses. Momma always said, 'Better late than never'-so what the hell. Throwing all caution to the wind, these two begin to make out. Their shirts come off revealing their hairy chests. Nick's dick is pulled free as Tristan goes to work on his fat cock. Nick doesn't mind one bit as he gets on his feet to give Tristan easier access to his thick 8' cock. At 46, Nick's body is in peak condition and Tristan is appreciating every bit of it as he continues to nurse on his meat. Nick then wants to return the favor as he gets down and strips Tristan's pants off. 'It's big' he gasps as he sees Tristan's 9.5' cock come out. He starts to suck it but hauls Tristan to his feet to have a better angle at getting all that meat down his throat. Nick hungrily swallows as much of Tristan's massive cock. His own rock hard cock is pulsing on its own as Nick holds Tristan's beefy thighs and uses them to fuck his own face. From there these two cock titans maneuver into a hot 69 where they can get all the cock they want. Nick takes top bunk as he repeatedly plunges down on Tristan's meat, intent at taking every thick inch. Nick will take every inch of that thick meat soon enough. Tristan's tongue then turns its sights on Nick's ass and dives into his muscular ass. Nick who usually ends up on top once his partners see his fat cock is getting something special-he's getting fucked! Tristan slides his thick python deep into Nick's hole and is soon slapping that ass with his low hangers. Nick takes that dick like a pro as Tristan pounds away at that smooth ass. Tristan then pulls out and sits back letting Nick work for it as he impales himself on his big dick. Nick grunts as he rides that thick cock and Tristan is helping him out soon enough as he holds Nick's waist and bobs him up and down to get his cock in even deeper. Nick can't seem to get enough as he leans back giving us an amazing view of Tristan's cock slowly stretching his ass wide and deep. Tristan's eyebrows furl as his face tells us just how good that ass feels on his cock. This will be a fuck session for the books as he puts Daddy Nick on his back and slides his huge cock in for more. Nick's ass is taking his cock easily as Tristan picks up the pace. Tristan's big dick is hitting all the right spots and Nick won't last long before his cock explodes. Once they're about to shoot they sit back and jack their huge cocks to completion busting their payloads all over themselves.",
  "models": [
    {
      "name": "Nick Moretti",
      "person_id": 27959
    },
    {
      "name": "Tristan Jaxx",
      "person_id": 28051
    }
  ],
  "release_date": "2012-02-23",
  "scene_id": 53972,
  "tags": [],
  "title": "Jaxxx of all Trades, Scene #02"
}