{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have David Chase back in the house and looking better than ever. David's in for a real treat this week as he gets to christen a smoking hottie from right here in the 305. Jimmy Fanz makes his debut today and one look at this swarthy 20 year old with the furry chest and that killer smile and you just know he's all sorts of trouble. Line forms to the left, boys. David, for those of you unfamiliar with him, is now 31 and from Jacksonville, FL where he admits he's lived his whole life and he'll never escape the place. We wondered how handy these two studs were around the house so we asked what the last Do it yourself project around the house. David created a nice Spring Garden of vegetables, herbs and flowers to surprise his girlfriend. Jimmy grins and admits the last DIY project he did was doing the dishes a couple days ago. (Hot and a smart ass!?) We then wrapped it up by asking what the last thing they fantasized about while jacking off. Jimmy says he bust his nut thinking about Ana, a girl he knows that may or may not know she's working overtime in his lurid fantasies. For David, being sentimental, he hardly watches porn and likes to think of his girlfriend when he beats off. Mmhm, Check please!David is at Jimmy's installing a smoke detector. He's on the ladder and as he reaches for the unit his hand lands on Jimmy's head that is conveniently at cock level. Jimmy's head makes more sense as David chucks the smoke detector and pulls Jimmy's face into his crotch. Jimmy isn't objecting as he hauls out David's cock and goes to work on it. David's hard in no time as he starts to fuck Jimmy's face. Jimmy swallows every inch of David's thick cock as David moans and starts to slam his cock down his throat til he gags on it. Jimmy savors that dick as he runs his tongue along the shaft before signing up for some more throat fucking. David can't get enough of that mouth but soon he wants to see what else Jimmy's good for. He gets down off the ladder and puts Jimmy against the wall as he pulls down his jeans to check out his furry ass. He dives right in eating that hole while Jimmy moans his appreciation. David flips around so Jimmy can sit on his face as he gets tongue fucked by the repairman. Jimmy then turns around and slides his cock into that hungry mouth. David shoves that dick deep taking every delicious inch of it. 'Smack it on my lips' he orders as Jimmy obliges.They then get down and get into a hot 69 so they can each have all the dick they want. Jimmy's on top as he bobs that mouth on David's rock hard cock. David is nursing on Jimmy's meat that's hanging in his face and his finger starts to explore Jimmy's tight hole. Jimmy slides a rubber onto David's thick cock and straddles it. He grunts as that sweet ass gives in. He slowly takes it all before bouncing up and down on it like a pro. Jimmy arches back and rides that cock giving David a view of that sweet ass taking his fat meat. David then holds Jimmy still as he starts to ram his dick up into that tight ass making Jimmy moan for more. Jimmy then twirls around while still sitting on that dick and leans back onto David's chest as David starts to take that ass deep. He pounds away at that hot hole as Jimmy strokes his hard cock. David then wants Jimmy's dick inside him as he bends over and gives it up. Jimmy rams his meat into him doggy style as he slaps that ass and mounts him. Jimmy fucks him for a while before getting him on his back for more dick missionary style. Jimmy's cock hits David's sweet spot and in no time David's cum is airborne. Jimmy then pulls out and follows suit busting his own nut all over David.",
  "models": [
    {
      "name": "David Chase",
      "person_id": 27963
    },
    {
      "name": "Jimmy Fanz",
      "person_id": 28056
    }
  ],
  "release_date": "2012-04-19",
  "scene_id": 53984,
  "series": "The Erector Detector",
  "tags": [],
  "title": "The Erector Detector, Scene #02"
}