{
  "collections": [
    "Men Over 30"
  ],
  "description": "Straight off the beach we bring you Kevin Miles. Kevin is 32 and originally from Detroit via California. He's single and now calls Miami home. He loves the weather and the local ladies. He's into petite women with beauty and brains. He loves women that have visual appeal but that can hold an intelligent conversation. Hmmm. He was 12 when he lost his cherry. He had no idea what he was doing but fortunately the older girl did. He started up again at about 17 and has been honing his craft ever since. Apparently it took a few years before he found a girl that made him want to go there again. Most men don't stop once they get a taste; but Kevin is a true gentleman. Who knew? He is into foreplay and loves girls that get into touching and if he had to pin down his ultimate fantasy it would be to have 2 women at the same time. One of the things he'd like to do again is to make love in the rain. He's definitely one for details and appreciates a woman and how she's feeling. We're sure that Mr. Miles is getting the opportunity to spread his kind of passion and romance with all the bounty of beauties that visit our friendly shores. He's come a long way from the Motor City. lolKevin slowly begins his strip tease as he begins to caress his thick frame. His chest and abs are smooth and as he takes his tee off we get a better view at his sun-kissed landscape. He rubs his chest and nips as he allows himself the permission to adore all that he is. His fingers find his nips and slowly circle them sending shivers through his spine. His hands run through his full head of wavy hair and as he does, we get our first peak at those hairy pits. His eyes are hazel green, has sexy full lips and a jaw line a Kennedy would envy. Kevin definitely has more than a few weapons in his arsenal. He continues to run his hands over his smooth bod before they land on his waist band. He undoes his shorts and opens them to reveal a growing bulge in his bright orange briefs. He massages his meat as it begins to fill out his crotch. Kevin's tan line is prominently peeking out from above his underwear and it's obvious this sun-lover takes advantage of living near the sea. Once he's ready he sits back on the couch, lies back and buries his hand inside his briefs seconds before hauling out his hard cock?at long last.Kevin continues to jack his dick which he keeps au natural as he drops his underwear altogether. His thick meat finally has the breathing room its needed. As he strokes his manhood, his naturally smooth balls dangle below in tune to the rhythm upstairs. As Kevin jerks off he spreads his thick thighs wide showing us his beefy ass. As Kevin pleasures his cock he gets into it, rolling his fingers along his chest into his mouth where he licks them as his eyes remain closed caught up in the rapture.?Ok, that may have been a bit much. But he's totally into it! lol As he lays back we get a great side view of him spread out and stroking, His cock, his muscular torso that meets his smooth chest, the sexy face and that mane of hair all combine to produce one intoxicating vision. Kevin continues to tease his meat and us as he looks into the cam with a certain ?You know you want some? look that is irresistible. He starts to pick up the pace and as he does his meat gets even harder, aching for more. His fist becomes a blur over his natural bush and as his breathing begins to labor we know it won't be long. He gives us one final treat before the fireworks as he gets on his knees on the couch and spreads them wide. His beefy ass is a sight to behold but its just a teaser cuz Kevin's too close to stop. He lies back on the couch and jacks his load. He explodes all over himself in what looks like a meteor shower of seed repeatedly spraying himself and the couch. DAMN!!",
  "models": [
    {
      "name": "Kevin Miles",
      "person_id": 27948
    }
  ],
  "release_date": "2009-10-15",
  "scene_id": 53987,
  "tags": [],
  "title": "Surfin' For Porn, Scene #01"
}