{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a tasty slice of the Big Apple for you. Dark hair, bedroom eyes and a sexy, furry chest are all wrapped up in an irresistible package that answers to the name of Brandon Monroe. Brandon is 31 and from New York City. He is currently single and judging from the way his face lit up, we're guessing he's ok with that. He admits he's willing to accept applications. We asked Brandon what would a guy have to have to make him want to settle down. We hadn't finished asking the question before be blurted out 'Huge balls!' Apparently Brandon has a heavy hanger fetish. Having started exploring his sexuality at 17, Brandon admits he's incredibly oral. Kissing, sucking dick, working on those huge balls he loves are all high on his 'To Do' list. He also loves receiving so if a guy likes to suck cock and eat his ass he wouldn't be mad at him. Once he got his first taste of man-to-man sex at 17 he never looked back and never stopped either. He's incredibly sexual and even if he gets some on a regular basis he still finds time to beat off and keep the pipes clean. 'It helps me relax better...' he grins. Well, we can relate to that. Well, seeing as he's so good at jackin his meat...we should let him get started.Brandon showed up in some sexy loose shorts and a tight tee that accentuates his firm pecs. He starts rubbing his crotch and his free hand finds its way beneath his tee. As his hand explores we get our first glimpse at his furry chest and abs as he pulls his shirt off. His shorts aren't gonna be around much longer as he pulls them off as well. Brandon's cock is already rock hard by the time he gets comfortable. Once he does he decides to give us an idea of what he moves like on the horizontal. He gets in push up position and slides his meaty cock atop a cushion and begins to dry hump it. His smooth ass rises and falls into the couch as he mounts away. He looks right at the camera knowing you're loving the show he's giving you. He then sits back, spreads his hairy thighs wide and begins to jack his meat. As he does his balls make loud slapping noises as they slap his ass below. Thunder clap alert! His cock is rock solid as he strokes it dry and after a few minutes of his hand he gets on his knees and starts to fuck that cushion again. That cushion's having a better day than most of us are as Brandon's thick cock repeatedly rams it up against the couch. Brandon then stands to give us a better view of his meat. As he stands and jerks his meat we continue to hear his low hanging nut sack slapping at his ass below. How does he do that? lol Brandon works his meat with both hands as he rapidly jerks his cock. From this angle we get to admire Brandon's hairy body as his muscles tense and flex beneath his body fur. Brandon is moaning and his breathing is getting heavier as he works his boner faster and faster. He pins his heavy meat at the base with one hand while he tugs on his balls with the other. He tugs on them pulling them as far down as he can. Once they are dangling as low as possible he stares into the camera and grins as he begins to bounce them with his fingers. The look of wonder in his eyes is as classic a look as a kid in a candy store. This one's up to no good and we love it. He slaps his hard cock against his palm and continues jackin his dick. He then sits back and goes back to stroking that cock of his faster. His heavy nut sack is slapping away as we watch him pleasuring his dick. Brandon grins as he puts his arm behind his head showing off his sexy pit. His body begins to tense and the look on his face tells us all we need to know as he grunts and braces for his load. He jacks furiously, balls ablaze, as he unloads their cargo all over his furry navel below. ",
  "models": [
    {
      "name": "Brandon Monroe",
      "person_id": 27929
    }
  ],
  "release_date": "2009-09-24",
  "scene_id": 53982,
  "series": "Hairy Up",
  "tags": [],
  "title": "Hairy Up"
}