{
  "collections": [
    "Men Over 30"
  ],
  "description": "'Getting Stoned' is the title of this week's episode. The one getting 'Stoned' will be fan favorite Doug Jeffries. Doug has graced our site before, and he's amassed quite the following. With looks and a build like that, Doug is quite the 'Daddy' fantasy. As genuine as he is hot, Doug is 43 and from Los Angeles, CA. He is always a pleasure to work with and we decided to show our appreciation by pairing him up with a steamy Latin costar. Getting 'Stoned' never looked so good. We're of course speaking of sexy John Stone. John is 22 and a Florida native. This Colombian mix Papi has also been on our site a time or two; but neither the twain had met. Well, fortunately we know someone who works here and were able to make it happen. Fortunately, we just put them in a room together?the chemistry did the rest. Doug has quite the repertoire in the industry and has been making films for about 13 years now. He laughs when he remembers doing videos, almost 2 a day, back when he started. Now, of course, it's mostly internet work. John smiles as he admits he's only done one video but they did put him on the box cover he beams. Times have definitely changed and in a few these two will change their pace; as they get to know each other a lot better. Any objections?Doug helps John relax by slowly massaging his broad shoulders and neck. John moans and groans as Doug works out the knots in his shoulders before he peels off his polo. His hands then roam to his chiseled chest before getting John to lie face down, so he can have better access to his muscular back and shoulders. At least, that's what 'we' thought. It isn't long before Doug reaches under john, undoes his jeans, and pulls them off. John's beefy ass comes into view and what a spectacular view it is. Doug wastes little time before continuing his 'massage' only this time he sends in his tongue for reinforcement. Doug dives into John's smooth ass tongue first as John coos his appreciation. John's ass has Doug intoxicated as he spreads apart his beefy cheeks exposing his tight hole before fingering it a bit. John then flips over and gives Doug access to the only muscle he has yet to work. No worry, Doug has that covered as he slides John's hard cock right down his throat. John watches as Doug sucks on his cock and can't help but pull out and playfully slap his cock on Doug's tongue and face. He then stands to properly face fuck Doug. Mmmm. What's for dinner, Mr. Jeffries?Now it's Doug's turn as he stands and gives John's mouth something to work on. John eagerly sucks on Doug's cock, getting his cock rock hard for the fun to follow. John laps at Doug's smooth balls which get him rock hard and ready for more. Doug suits up and moves into place behind John, seconds before sliding his rock hard cock home. John's ass gives way to its intruder, and Doug is fucking his ass deep in no time. 'Fucking that ass good?' Doug grunts as John groans in delight. Doug continues to pummel his thick meat in and out of John's smooth ass and from where Doug's kneeling, the view is insane. Doug then pulls out and flips John on his back. He lifts those meaty thighs up and glides his thick cock right back inside that ass. John strokes his own cock as his ass continues to take a pounding a few inches below. Doug's picks up the pace shoving his dick in faster and deeper as his ass rises and falls into John's hot ass. 'You close?' he asks before immediately pulling out to jack his heavy load off next to John. John is the first to blow as he explodes all over his smooth chest and abs. Doug isn't far behind as he too explodes shooting blast after blast all over the couch and rug below. Whew. Imagine if these two had actually been attracted to each other!",
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 27928
    },
    {
      "name": "John Stone",
      "person_id": 27917
    }
  ],
  "release_date": "2009-09-17",
  "scene_id": 53980,
  "series": "Getting Stoned",
  "tags": [],
  "title": "Getting Stoned, Scene #02"
}