{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have Brandon Monroe back in the house and he's here to show us just how well Brandon functions on the horizontal. Brandon is 31, has a sweet hairy chest and is originally from the Big Apple. He left many of our members wanting more when he was last here to give us an up close and personal on all that is Brandon. Along for the 'ride' this afternoon is bad boy extraordinaire, James Hamilton. James has appeared on our brother site and has quite the reputation. Many can't get enough of his brooding looks or that thick meat. He's definitely not in Kansas anymore. James is 25 and he is quite a mystery. He never gives up more information than he needs to which only keeps us wanting more. He loves to be in charge. He first had sex with a guy at about 20 but he is an equal opportunity pounder. 'It depends what I'm in the mood for' he grins. Both of these boys are horny and avid strokers. Brandon even confessed that his hottest sex ever was getting gang-banged by 8 Latinos (on video no less). DAMN. Well, this afternoon Brandon will be the one tapping ass as James takes one for the team. We have a feeling that this will be one very explosive episode. Buckle up!Brandon doesn't waste any time as he pulls James' jeans off exposing his thick commando cock. Who needs underwear? We don't! He immediately goes down on his meat which bones up in seconds. James moans his approval as his thick meat gets a good spit shine. James loves getting his knob sucked, so he isn't complaining. Brandon then gets up and strips as he offers James his own mouthful. James obliges as he twirls his head and fist up and down on Brandon's meat. Both of these boys love oral and to accommodate the hunger they maneuver into a hot 69 so that everyone has something to work on. They both worship the meat before them as the sounds of muffled groans fill the room. James then stands up and forces Brandon down on his meat as he starts to face fuck his willing accomplice. Brandon at one point throws James' legs on his shoulder while his dick is buried deep in his throat. James then falls back on the couch with Brandon in tow still worshipping every delicious inch of that bone. James' thick dick is rock hard and aching for more and soon that's just what he's gonna get.Brandon goes back down on James but this time his fingers start to explore that ass he will soon claim. James groans as his backdoor begins to concede to Brandon's advances. Brandon continues to work James cock getting him as horny as possible before he sits back and has James sit on his thick dick. James grimaces as his ass opens up for Brandon's throbbing cock. He begins to ride his dick as he gets used to it and as he's getting used to the feel, Brandon begins to fuck up into his tight ass. James grunts and does his best to take the fucking Brandon is giving him. Brandon holds him in place as he continues to bury his horny cock up into him. Everything turns once James gets used to it and begins to grind his sweet ass down on Brandon's cock. Brandon then puts him on his back and slams his cock back in him, fucking him missionary. He fucks him fast and deep and in this position he's hitting James right where he should and it isn't long before he's moaning 'I'm close' Brandon fucks him faster and deeper sending James over the edge. James jacks his dick and explodes all over hitting his own face and neck repeatedly with his eruptions. Brandon then pulls out and jacks off spraying seed all over his furry abs. ...whew..",
  "models": [
    {
      "name": "Brandon Monroe",
      "person_id": 27929
    },
    {
      "name": "James Hamilton",
      "person_id": 27947
    }
  ],
  "release_date": "2009-10-08",
  "scene_id": 53985,
  "tags": [],
  "title": "Speed Mating, Scene #01"
}