{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have two fan favorites back this week, and we are enjoying the sparks that the get-together ignited. The first of these two agents is Doug Jeffries. Doug, originally from Los Angeles, CA, recently celebrated his 43rd birthday and is back with us looking sexier than ever. It's been over a year since we've seen this blue-eyed hunk. To celebrate his return, we've put him together with a Daddy-loving stud that goes by the name of Trey Turner. Trey has appeared on our brother site, ExtraBigDicks.com, and until today has usually been under a well hung stud. This afternoon, the 21 year-old Fort Lauderdale boy is gonna be the one calling the shots and showing us just how many times 21 can go into 43. Things worked out well since Doug hand-picked Trey out to be his costar. When off cam, Doug goes home to his partner of 3 years. He's not in the industry, but he knows exactly what he does and all that that entails. When we asked Doug how long he's been in the business he answers ?Since '96.? Trey's eyes light up in sheer amazement as his jaw drops. Doug's had partners that have been both in and out of the industry, and it helps when they know what actually goes on. Trey himself is partnered with a sexy cub he met recently, and they've already been cohabiting now for about three months. Such lesbians! So far so good, and that's the way we like it.They begin to kiss as Doug takes the lead. He kisses Trey as he lies on top of him and begins to explore his chest and abs with his tongue. Soon, both of these studs are shirtless, licking and teasing each other. Doug then flips Trey over and pulls off his shorts, giving us our first glimpse of that spectacular ass. Doug can't help but get right to work as he licks his ass before entering it with his finger. Trey's beefy ass is intoxicating as Doug gets right back in there to taste what will soon be his to plunder. He spreads his cheeks apart before shoving his face back in for more. His expert tongue is driving Trey crazy as he moans his approval. Doug then kneels and starts to get that hole ready by fingering it and teasing it a bit. He then pulls Trey's hard cock back and gets his first taste of Trey's thick meat. Trey rocks back and forth into Doug's hungry mouth. It isn't long before Trey wants some too. Doug slowly fucks Trey's mouth as Trey lies back on the bed. Doug slips his meat into Trey's mouth, bouncing in and out of it. After a bit, he leans forward as they continue the oral fun in a hot 69. These two cannot get enough of each other, and it's about to get a lot better.Doug sits back on the chair and watches as Trey sits on his dick. Trey slowly impales himself on Doug's thick cock as his own meat begins to ooze. His ass slowly gives way to the intrusion, and Trey is soon riding that dick at a full gallop. Doug just sits back, hands behind his head, and watches in amazement as Trey goes to town on his meat. Trey bounces and grinds his sweet ass all the way down on Doug's dick, and it's only making him want more of that ass. Doug gets Trey on all fours and slams his dick back in for more. ?Oh, fuck that ass? moans Trey as Doug pounds his ass deep. He slaps that ass as he buries his bone. FLIP! Now its Trey's turn as Doug gives it up to his young stud. Trey slides his thick meat inside Doug and begins to fuck him missionary. This is enough to send Doug, who's already horned up, over the edge. Doug jacks his cock with both hands as he explodes all over his chest. Watching Doug explode sends Trey's own load blasting all over Doug as well. Doug gets even more cum shot all over his massive chest, shoulders and abs. What a cum bath. Clean up on Aisle 6, 7 and 8! lol",
  "models": [
    {
      "name": "Trey Turner",
      "person_id": 27927
    },
    {
      "name": "Doug Jeffries",
      "person_id": 27928
    }
  ],
  "release_date": "2009-10-22",
  "scene_id": 53989,
  "tags": [],
  "title": "In The Pink, Scene #01"
}