{
  "collections": [
    "Men Over 30"
  ],
  "description": "Braxton Bond is this weeks morsel. Braxton is a sexy Scorpio, and admits he's not the typical Scorpio. He's not as ?intense? as they make all the Scorpios out to be. He claims to be sexual, but more relaxed and chill. We can neither concur nor deny that claim.  Braxton is a ?Maniac??no, not a typo, He's originally from Maine. He currently lives in Los Angeles, which explains the tan. Warmer climates seem to better suit our blond 30 year old stud. Braxton is naturally smooth, and has ink on his shoulder and bicep. He loves his ink, admits he might get more, but he doesn't want to go over board either. Braxton is attracted to guys who are kind, who treat people the way he wants to be treated, and are free of attitude and hang ups. Physically, Braxton is into big guys. He likes them manly and at 5'11, that's a tall order. He likes it when a guy can throw him around sometimes. There's something to be said for that Lumber Jack scene. Wonder if Paul Bunyan would be free to wax his onion? Now there's a visual. As far as unfulfilled sexual fantasies, Braxton dreams of a huge gang bang where everyone's taking turns on him. Hmm. Well, let's hope Paul isn't the jealous type. lolBraxton sits back on the couch and slowly begins to feel himself up. He flexes his biceps as he kisses his ornate dragon tattoo. He pulls his tank over his head and shows us his smooth chest before taking his tank off altogether. Next, Braxton starts slapping that cute bubble but of his through his jeans. Unbuckling them, he continues his strip tease. Soon, his swollen meat comes to view as it struggles to free itself from its cotton confines. Once he's left in his briefs, he starts teasing his cock and showing us more of that ass. He pulls his briefs down, so we get a view of that smooth ass of his as he teases his sweet ass while crouched over onto the couch. This boy knows all about the art of seduction. With an ass like that, it would be foolish to resist. His ass is naturally smooth, and Braxton knows how to work it as he spreads his cheeks wide before fondling his ass and running his fingers on that hungry hole of his. He then loses his briefs and turns around to continue his strip tease, covering his cock with a cushion. TEASE!Finally, the cushion is pushed aside as he starts to stroke his cock. He holds his growing meat by the base with one hand, stroking it with the other as it slowly grows to full length. He then stands and teases his thick dick. As he strokes his cock, we get to see his naturally defined body flex, as his muscles writhe just beneath his sun-kissed skin. Seeing all Braxton has to offer, we don't think finding a roomful of hot men willing to tag team that ass would be all that hard to achieve. Braxton then sits down on a chair; spreads his thighs wide and continues jacking off as he works both his balls and shaft. He strokes his cock both overhand and underhand, switching things up to bring heightened sensation to his dick. He playfully slaps his cock in his palm and we can hear him softly moaning as he pleasures himself. Braxton's not gonna be able to last much longer with all the attention he's giving his thick dick. As he feels that familiar tickle, he lies down on the couch to take it home. He strokes his cock and he's on a mission. As he jerks off faster, his breathing begins to labor. With a simple ?I'm cumming?, he does just that. Stream after stream of jizz splatter across his abs and navel as Braxton blows his load. Whew. ...Well there you have it, Braxton, the Maine Attraction.",
  "models": [
    {
      "name": "Braxton Bond",
      "person_id": 27950
    }
  ],
  "release_date": "2009-11-05",
  "scene_id": 53991,
  "series": "Blonde Ambition",
  "tags": [],
  "title": "Blonde Ambition, Scene #01"
}