{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today's shoot is special for several reasons. This week, we bring you none other than Matthew Rush. Matthew has agreed to do his first ever web-episode with us here at MenOver30. As well as it being his first time doing web work, it's his 37th time he's had candles before him and awaiting a wish or two. Fort Lauderdale's own is 37 today, and we couldn't imagine a hotter time for Matthew than to spend it in (pun intended) a hot piece of west coast realty that goes by the name of Braxton Bond. Braxton is 30 and from Los Angeles. For those of you who missed it, we got an up close and personal with this hung blond just last week. The response was amazing, so we knew we had to have him back. Both of these hung boys are into outdoor activities. When we asked Matthew if there were any misconceptions about him, he told us that unlike popular opinion, he's just an average guy and considers himself a geek. Braxton on the other hand comes across as a polished prep school boy; but, given the right circumstances, he's anything but the innocent boy next door. Lucky for us, they are both single and they both want kind guys who don't take themselves all that seriously. All somewhat serious applications considered.Braxton has his hands full?literally?as he begins to kiss Matthew while feeling up his massive pecs and guns. He pulls off Matthew's tee as he gets better acquainted with his ink as well. Neither can keep his hands off the other as they continue to kiss and explore their inked bods. Matthew lays back as Braxton goes to work on his chest and abs, slowly making his way down Happy Trail Way in search of a bigger sense of adventure. 'Seek and ye shall suck' they say?or something like that?as Braxton gets his mouth around Matt's growing cock. 'Fuck, that feels good' Matt groans, as he starts face-fucking Braxton. Braxton works his cock all the way to the hilt as he takes every inch of Matt's extra thick meat. Matt can only grunt his approval as he takes his head and helps Braxton bury his meat even deeper. Braxton has this one covered as he continues to slam Matt's cock deep into his throat. Braxton then comes up for air as Matt undoes his jeans and kneels to give Braxton some of what he was given. Matt holds Braxton steady as he starts to suck his cock deep. He slowly pumps Braxton's cock down his throat before he decides he wants more attention on his own dick instead. HmmmMatt is horny and now wants some ass, so he shoves his cock back into Braxton's throat so he can get his cock ready for a good fucking. Braxton is soon bent over as Matthew starts to shove his fat cock deep inside. 'You like that cock', Matt grunts 'give me that fuckin' sweet hole!' Matt is taking Braxton's ass hard as he pounds into him. Braxton, who confessed he loves a guy who can toss him around, is getting just what he wants. These two fuck like animals as they grunt and groan, grinding against each other. Braxton's humping back just as hard as Matt's thrusting forward. From doggie they switch it up. Matthew sits back and has Braxton turn around and sit on his cock. He shoves every thick inch up into him as Braxton continues grinding his hot ass all the way down to the hilt. The chemistry between these two is explosive to say the least as they continue to thrust themselves against each other. Matt finally puts Braxton on his back and gets that cock back in him Missionary. He easily slams that cock in and out of Braxton's battered hole, hitting Braxton in all the right places. It isn't long before Matt's pounding cock pushes Braxton over the edge, causing him to explode all over his smooth abs. Once Braxton is done cummin', Matt pulls out and pumps his own thick load all over Braxton's cum-covered balls. Well it may be Matt's birthday; but it looks like Braxton got the better present!",
  "models": [
    {
      "name": "Braxton Bond",
      "person_id": 27950
    },
    {
      "name": "Matthew Rush",
      "person_id": 27951
    }
  ],
  "release_date": "2009-11-12",
  "scene_id": 53994,
  "series": "Gold Rush",
  "tags": [],
  "title": "Gold Rush, Scene #02"
}