{
  "collections": [
    "Men Over 30"
  ],
  "description": "Iron Man, he recently dropped his boxing shorts to show us what he's packing in those pussy-loving briefs. Iron man had just started a job at a gym when he was last here over the summer, and we are pleased to see the benefits of working at a gym have made him a bigger person?literally. He's much buffer than before, and we definitely ain't mad at him. He admits working out at the gym can sometimes have an adverse effect on his boner and often times he has to struggle to keep that muscle from not derailing the other muscles he's trying to work out. He likes to take care of that problem in the gym, and often times in the Jacuzzi. His testosterone is high from all the working out, and admits he even had a chick that he ended up fucking on a dance floor with a crowd watching. He loves sex, and his ultimate fantasy would be to have three guys in bed with a girl and give her as much dick as they possibly could. He especially wants to have his dick in a pussy that has another dick stuffed up in it at the same time. It's DP for Iron Man. We're sure there are plenty of boys willing to sign up to fulfill that fantasy...but he said 'pussy', boys?so save yourselves!Iron Man starts off by showing off his progress. He stands and flexes his huge biceps for us before settling down to bandage his fists before slipping them into his boxing gloves. He then starts to spar to give us an idea of his moves. I'm not sure these are the kind of moves we're interested in seeing?but we're going with it. His tank comes off as he shows us his massive chest. His broad shoulders frame his pecs nicely, and he's not shy about showing us the fruits of his labor. Relax! We'll get to his 'fruits' later. He slips off his shorts and goes face down onto the couch where he begins to dry hump the couch. His beefy ass looks spectacular in his jock strap, and he slowly gropes and fondles that ass giving us a better view of that unattainable real estate. He continues to show us that delicious ass, and even spreads his furry cheeks to give us a view of his...you know. Iron Man then flips over and pulls his jock to the side, finally freeing his hard on. His cock is rock hard and jumps to attention at the feel of his hands. He stands, losing the jock as he starts to stroke his throbbing meat.He continues teasing his cock, and us, as he swings his fuck stick side to side. His knob is glistening and throbbing as he continues to give it the attention it needs. His heavy balls are now closer and pulling up tighter to the base of his shaft. He strokes his cock, giving close attention to his knob. As the camera heads down, we get a view from below and get a better appreciation of his cock nestled between his massive thighs. His dedication in the gym is really paying off, and it isn't hard to tell. Iron Man then sits back in a chair to get comfortable. He continues to stroke his thick cock as he just watches his meat being serviced. He gently bites his lip as his eyes roll back in his head. He loves the attention he's giving his fat cock, and knows it won't be long before it all pays off. He then sits back on the couch, spreads those massive thighs, and goes to work on that cock that by now is aching for release. He quietly jacks that dick faster and faster. As he lets out a soft sigh, his cock unloads its cargo. He pumps volley after volley of cum all over his toned abs and happy trail.",
  "models": [
    {
      "name": "Ironman",
      "person_id": 27926
    }
  ],
  "release_date": "2009-12-03",
  "scene_id": 53999,
  "series": "Below The Belt",
  "tags": [],
  "title": "Below The Belt, Scene #01"
}