{
  "collections": [
    "Men Over 30"
  ],
  "description": "Halston is in the house. Troy Halston is back with us, much to our delight. Troy is now 39 and calls Miami home. Troy for those of you who haven't had the pleasure, has had a long career in the industry and together with his real life wife, Holly Halston, really enjoys what he does. We know Troy never fails to entertain, and we keep him coming back to keep his fans happy. Next to Troy is a fresh face that belongs to a 32 year-old from Los Angeles that answers to the name Ari Silvio. Ari is a sexy man with dark features and a brilliant smile. When we asked Ari if there was anything he had left to do before the New Year, he answers ?I would like to do a gang bang...and yourself Troy?? Ok, with that kind of delivery, Ari belongs in the Newsplex. (and now?back to you, Troy) lol Troy, after giving it some thought, wants to try something interracial. Never too late to try something new they say. Both of these horny guys knew they were into different 'stimuli' since they were both experimenting with their asses way before they knew hair would soon sprout in odd places. From plungers to back scrubbers: a horny imagination is a terrible thing to waste. Today, we all know what belongs where, so sit back, grab hold, and let's not be tardy for the party!The chemistry is obvious as these two begin kissing and exploring each other. Troy goes to work on Ari's nips between sucking face. He undoes Ari's shorts and starts to tease his cock through his jock strap. Troy gets up and undoes his jeans. The next thing we see is Ari with a mouthful of Troy. ?Yeah, see I knew you could suck dick? he grunts as he feeds Ari his cock. Ari is intoxicated by Troy's meat and can't get enough. Troy sees the opportunity as he pushes Ari back a bit and turns around and spreads his ass wide. Ari doesn't miss a beat as he dives in tongue first. He sucks on Troy's smooth ass and pulls Troy's cock back to keep sucking it as well. Troy can't complain as he gets both his pole and his hole serviced. Troy then returns the favor as he goes down on Ari. Ari is moaning as Troy goes to work on his meat. He bobs his mouth up and down on Ari's cock while he plays with his heavy balls. Our West coast stud is getting the royal treatment, and it's about to get better.Bent over the couch, Ari braces as Troy suits up and moves into position. Ari hasn't felt it yet, but the look of anticipation on his face is classic. Troy slides his meat inside that hot hole slowly. As he does, Ari's face contorts with a mixture of pleasure and pain. Once it's buried deep, Troy mumbles ?You did say you could take the whole thing so...? and with that begins to slam his cock deep. Ari just begs for more as he gets the hell fucked outta him. He takes the pounding Troy's giving him like a champ; soon enough, Troy's lying back as Ari sits and spins on his cock. Ari is a horny one, and grinds his hot tight body deep onto Troy's hole. ?That's it boy, make my cock feel good? orders Troy as he watches his cock disappear into Ari's tight ass. He holds Ari's sweet ass wide open as he guides him up and down on his throbbing meat. The visual is insane as he repeatedly impales that hungry ass. Then Troy moves the fun to the rug as he holds Ari's legs up and begins to piston fuck him some more. He squats and bounces his dick into Ari. This position is going to do the trick. Troy goes for it and fucks Ari faster and faster. Ari can't hold back and is soon getting his hot load fucked out of him as Troy buries it deeper and deeper. Troy then pulls out and makes his own heftly contribution to the ?Soak the New Guy? Campaign, blasting his load all over Ari.",
  "models": [
    {
      "name": "Ari Silvio",
      "person_id": 27952
    },
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2009-11-19",
  "scene_id": 53996,
  "series": "Argentinian Meat",
  "tags": [],
  "title": "Argentinian Meat, Scene #02"
}