{
  "collections": [
    "Men Over 30"
  ],
  "description": "The real life 'Dynamic Duo' of Dane Hyde and Brock Hart is back, and we couldn't be happier to see these two sexy studs. Brock Hart is 39 and originally from Miami. His other half of 6 years, Dane Hyde is 32, and they live together in South Florida. They have two kids and they're happy that their four-legged kids can't talk back. They are happily married, or as least as married as they could be without the legality of it. 'It would be fair if everyone had the opportunity to have that right. That would really be meaningful', says Brock of the recent hot topic of legalizing Gay Marriage. After six years, they both admit that keeping the spark alive takes work. It's an every day commitment. They're extremely comfortable with each other and in their own skins. At home, they both practice safe sex and do so out of respect for each other since they are both in the industry and performing with multiple partners. 'Once we're no longer doing this, then we can have that discussion'. They laugh as they admit that working together and living together, sometimes it gets confusing as to which name to call out in bed. We're sure these two, who could finish each other's sentences, have answered to more than one name in bed before.Back from an office party, these two come home and begin to make themselves comfortable. As they begin to undress, things get interesting as Brock comes over and starts to kiss his beau. They kiss as they slowly begin to undress. The chemistry between these two is natural, and it's great to watch these two real life lovers as they share an intimate moment with us. It isn't long before they are back on the couch as Dane makes his way down Brock's furry chest. Brock returns the favor, which leads to him between Dane's legs as he sucks on his hard cock. Dane just sits back and watches as Brock services his throbbing cock. Brock expertly takes every inch deep as Dane moans his approval. From there, Brock kicks it up a notch as he slowly takes Dane's leg and begins to suck on his toes. Dane is in heaven as he stands to give Brock better access to his dick. Brock looks up at Dane as he slowly takes his meat. Then it's Brock's turn, as Dane kneels before his massive frame. He readily goes to work on his cock as he bobs his head up and down on Brock's bone. Dane glides his hot mouth all the way down on Brock's cock, making him hard as a rock and wanting more.Brock wants more alright, and he knows just how to get it. He bends his lover over before sliding a finger inside that sweet ass. His tongue follows suit, as he begins to eat his hairy hole out. Dane is going crazy as he gets his ass rimmed. He's gonna need a lot more than a tongue in a few. Sure enough, Dane stands before Brock as he sits down on his cock. His ass slowly gives way, and in no time, Dane is riding Brock's cock with ease. Brock holds him tight as he bounces him on his meat. Brock then gets Dane up and bent over on the couch, where he slides his fat cock back inside. Brock fucks Dane deep. They both grunt away as Brock continues filling Dane's hot ass with as much dick as he can handle. Brock then sits back on the couch and has Dane straddle him and ride him, only facing him this time. Brock just watches Dane's face as he rides his thick cock. The view proves to be too much for Brock, who quickly puts Dane on his back so he can slide back inside him missionary. This is gonna do the trick as he pounds away at Dane, wanting to fuck the cum out of him. 'Oh Baby, You're gonna make me cum!' Dane grunts, seconds before shooting all over his hairy chest and abs. Brock follows suit as he too dumps his load all over one cum-coated Dane.",
  "models": [
    {
      "name": "Dane Hyde",
      "person_id": 27919
    },
    {
      "name": "Brock Hart",
      "person_id": 27920
    }
  ],
  "release_date": "2009-11-26",
  "scene_id": 53997,
  "series": "Full Of Hart",
  "tags": [],
  "title": "Full Of Hart, Scene #01"
}