{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week, we have a new face on MenOver30. Even though he's not a member, 24 year-old Ethen Pose is the first to admit he's always liked older men. Well, we have quite the hottie for this tall Puerto Rican export. Ethen will have the pleasure of working with one of our finest, Mr. Brock Russell. Brock seems to get better and hotter every time we see him. We're not sure what he's doing to look so hot; but we definitely ain't mad at him for it. Brock is now 36 and he lives in Provincetown, MA. Brock got his start in porn by chance when one of his buddies was in a spot while filming on set and needed talent at the last minute He called Brock up to see if he might want to give it a try. He'd had other offers before; but that day he decided he had nothing to lose. It snowballed from there, and he has no regrets. ?It's a lot of fun actually.? Ethen found himself on 'Porn Place' by similar means. He was living in Orlando at the time and came down to Miami and met a friend who eventually introduced him into the adult industry. We deem these two have questionable friends. Brock is now a seasoned pro where Ethen still gets uncomfortable in front of the camera. ?If we could only do something about that damn camera. lolBrock starts off by giving his new buddy a back rub. This helps relax Ethen as they start to kiss. They continue kissing as their hands begin to roam. Brock pulls off Ethen's shorts, leaving him in a pair of loose fitting boxers which can only mean one thing?easy access! Brock hauls out Ethen's growing cock and takes every inch of it into his mouth. Ethen's bone responds instantly as Brock works his magic. Both of these studs are naturally smooth and incredibly lickable. Brock then kneels on the couch and holds still while Ethen pulls down his briefs just far enough to get at that ass of his. Brock is moaning and looking back over his shoulder as Ethen starts to slap and finger that sweet ass of his. Brock then stands in front of Ethen so that he can return the favor. Brock's cock is inches from Ethen's mouth, which is soon wrapped around it. Brock holds Ethen's head steady as he bobs him up and down on his now throbbing cock. Ethen's pierced tongue gets real familiar with Brock's beefy dick. It isn't long before they are lying in a hot 69 position, each with a mouthful of dick. ?You know what would feel better?' Brock asks, 'your dick up my ass? WOOF!Ethen isn't about to let Brock down as he bends him over and pushes his cock deep inside. Brock grins and bares it as Ethen starts to give him the cock he needs. Ethen holds on to Brock as he pummels away at his ass. Brock loves it as he gets his ass stretched by that thick Puerto Rican Pinga. Ethen then sits on the chair and holds still while Brock straddles the chair and lowers himself onto Ethen's aching cock. Brock starts to ride that dick hard, bouncing like there's a derby at stake and he's nearing the home stretch. Ethen just sits back while Brock does all the work, fucking himself silly with that Latin bone. Then Ethen gets Brock on his back before sliding back inside for more. ?Yeah, Fuck my ass? moans Brock, as he gets his ass plowed. Ethen's hot ass rises and falls as he taps that ass. They continue fucking missionary as they make out. Ethen's picking up the pace as he fucks harder and faster. It won't be long before he's ready to explode. He jack rabbits his dick into Brock for a few more before pulling out and unloading all over Brock. Brock follows suit as his own thick cock explodes, sending more cum on his already drenched abs and cock. Whew. That's a rap.",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    }
  ],
  "release_date": "2009-12-10",
  "scene_id": 54001,
  "series": "Afternoon Delight",
  "tags": [],
  "title": "Afternoon Delight, Scene #01"
}