{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week ,we have a powerful Holiday episode. And no one would know that better than new comer Drake Jaden. Drake lives on the west coast of Florida, and we don't think he had any idea what was in store for him when we matched him up with one hot power top by the name of Brenn Wyson. Brenn  is the kind of top that separates the men from the boys. Nice cock?if you can take it! You'll all understand soon enough. Brenn is a 38 year-old Jamaican and always eager to tap some ass. It being the holidays, we asked what they liked for holiday dinner. Brenn wants a traditional Turkey dinner, while Drake wants some nuts and sausage. Mmhmm. We asked them what their favorite body part they like licked is. Brenn says he loves his ass licked, but he also loves getting his cock sucked so he wants it all. Drake takes it up a notch by saying he'd love them both licked at the same time. There's a smart ass in every crowd. lol. Well, without ado, we give you Brenn giving his Christmas cock to eager Drake's holiday hole. He's gonna fuck that ass like a Ho, Ho, HO?Did we just go there? Yuuuup. Happy Holidays.Brenn walks in on Drake who's discovered a Flesh jack. ?You like your new toy?? Brenn asks Drake who is caught off guard. Before he knows what to say Brenn takes control. ?I'm gonna make you my bitch today. Is that ok?? We're pretty sure that was a rhetorical question, but none-the-less one Drake won't have time to respond to. Brenn is tweaking his nips and pulls his shorts off, almost ripping his tee. In no time, Brenn has him naked and on his back?perfect. He goes down on Drake's meat as it comes to life. He comes back up to softly tongue kiss Drake before going back to roughly shove his finger up his ass. Joy and pain is his motto but we don't think Drake will be one to complain. Brenn then bends him over and starts to eat that sweet ass out. He switches between his hot tongue and his index finger, which are driving Drake crazy. Brenn then gets his cock wet as he shoves his meat down Drake's throat. Drake swallows as much as he can while Brenn face fucks his hot mouth. Brenn wants some ass, but he knows that ass isn't ready just yet so he goes back down to get it ready with his probing tongue.Once his ass is lubed and ready, Brenn has Drake go back on his dick to get it extra hard before claiming that ass. Drake sucks his cock, then explores that sweet ass, making Brenn even hornier to bury his pole. He forces his dick deep in his throat in anticipation. Brenn then has Drake get on all fours before he starts to take that ass. He finds his target and slides in without hesitation. As Drake groans, wincing in pain Brenn taunts him ?Take it', he teases, 'you're gonna have to, Boy?. Drake does his best to accommodate Brenn's extra thick cock as his ass gets a pummeling. Brenn fucks his ass deep and hard, and then puts Drake on his back for more. ?Just put those legs up? Brenn mumbles as he slides inside. ?You're my fucking bitch right now? Drake is groaning as his ass gets the fucking he's needed. Brenn then puts him back on all fours to continue slamming his cock deep inside him. He fucks him hard and he's nowhere near done. He then sits back and has Drake sit on his cock. Drake impales himself on that meat for more as Brenn bounces his tight ass up and down on his thick dick. Brenn then stands up picking up Drake as he literally bounces him, jack-rabbiting into his ass. Brenn then goes back to rough fucking that man hole til he can't hold back any longer. He beats them both off as they both explode all over Drake's chest and abs. DAMN! Now that's the ultimate all you can eat Christmas course. Whew. Disco nap, anyone?",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Drake Jaden",
      "person_id": 27955
    }
  ],
  "release_date": "2009-12-24",
  "scene_id": 54005,
  "tags": [],
  "title": "Papa Knows Best, Scene #01"
}