{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week, we are saying farewell to 2009 with two familiar faces, Chad Brock and Rocky Charles. Chad is originally from Los Angeles, CA. This 36 year-old quickly became a fan favorite here on MenOver30. We are pleased to have a sexy 23 year-old from Baltimore, MD named Rocky Charles to help him ring in the New Year. Rocky is down to earth. Even though he prefers the female form, he's willing to dabble with the boys if it'll keep his dick happy?gotta love that. We asked these guys what, if any, resolutions they were planning on making or breaking for 2010? Chad wants to be better at working on relationships, especially friendships, since those often end as collateral damage to work and the other day to day. Rocky doesn't make resolutions, since he hates to make promises he knows he may not be able to keep. Smart man. We then asked these two in hindsight what was their finest sexual moment in 2009. Chad's finest was a water sports scene that led to fucking and was incredibly hot. Rocky is laughing as he shares his story. Rocky's hottest was a scene he filmed fucking some guy in a sling while flicking ashes all over him from a cigarette he was smoking. Well, with stories like these for 2009, we can't wait to see what they do in 2010.These two have chemistry. They sit relaxed and at ease. They slowly start by kissing and undressing each other. Rocky is the first left in his briefs before he goes to work on Chad. He doesn't get very far before Chad is hauling Rocky's cock out of his boxer briefs and into his mouth. Rocky starts to face fuck Chad for a bit as his dick comes to life. He then wants some of what he's getting, so he gets Chad's cock wet as well. He greedily goes to work on Chad's meat as it rises to meet the challenge. Rocky loves to suck cock, and Chad is more than happy to oblige him. Rocky eagerly swallows every inch of Mr. Brock's bone, working it with both his hand and mouth. Once he's had his fill, he pops up and sits back on the couch, waving his rock hard meat and proclaiming 'Come here Daddy, get this bone'. Chad doesn't waste any time before going down on Rocky's dick. He swirls his tongue around his boner as Rocky helps bob his head up and down on it. While Chad is sucking on Rocky, Rocky starts to explore Chad's hot ass. He starts to finger that hairy ass while Chad moans through a mouthful of dick. Rocky then gets a closer perspective as he tongue-fucks Chad's hungry ass.Once Chad's ass is wet and ready for more, Rocky slides his hard cock deep into Chad's daddy hole. Chad braces as Rocky's meat slides inside. Rocky immediately starts to fuck his ass as he watches his meat disappear into Chad's muscular ass. He fucks him doggy style for a bit before putting Chad on his back for more. Chad loves the pounding Rocky's giving him. Once Rocky bends him over a chair for more ass pounding, Chad can't help but beg him for more and tell him he's being a good boy. Rocky's definitely being a good boy, giving his Daddy the boning he deserves. Rocky gets into it repeatedly calling Chad 'Daddy' as his balls continue to slap away at that hungry hole. Rocky then sits back on the couch and has Chad straddle him reverse cowgirl and watches as Chad impales himself for more dick. Chad starts to ride Rocky's dick hard. The harder he fucks himself, the harder he grinds down onto Rocky's jock meat. In this position, Rocky's bone is hitting Chad in all the right spots. In no time, Chad is grunting as he's sent over the edge, sending his massive load all over the couch and the floor below. Rocky then jacks off, exploding all over his furry navel. How's that for some early fireworks?Happy New Years!",
  "models": [
    {
      "name": "Chad Brock",
      "person_id": 27925
    },
    {
      "name": "Rocky Charles",
      "person_id": 27956
    }
  ],
  "release_date": "2009-12-31",
  "scene_id": 54007,
  "tags": [],
  "title": "The New Years' Ball, Scene #01"
}