{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a special duo here to share their passion. We say that because the two making their debut are boyfriends.  Their romance is one of epic modern day proportions (brought to you by Grindr) Jason Sparks and Connor Patricks are enjoying the weather down here in Miami, though they're both southern boys. Jason is 35 and originally from Atlanta. His beau to the left is 25 years young and from Charlotte, NC. These crazy kids met while Connor was on vacation in Charleston, SC and got on Grindr and met Jason. They are meant for each other since they both admit they are incredibly silly. They love the same about the other and get to drive everyone else crazy running around doing really silly shit like two silly boys. Pffffff, that's just silly!! When it clicks it clicks. When it comes to physical characteristics Connor loves Jason from the ass down. He loves his ass and thick legs. For Jason he loves everything about Connor. -Awww. Connor blushes as Jason brags about his man, telling us Connor's a tri-athlete and due to that he has the 'perfect' lean, swimmers build. Hmmm...Discuss amongst yourselves.Jason and Connor aren't new to having people watch them being intimate with each other. They actually have a cam site where many get to peek in on what these silly kids are up to. Today they decided it was time to take their act to a new venue and we were more than happy to help. They start to make out as they embark on their first webisode as Jason starts to grope on Connor's growing crotch. He licks his nips and smooth chest as they take turns teasing the other. Jason finally gets to his feet as Connor peels off his briefs to get at his growing cock. He takes his cock in his warm mouth and starts to nurse on his meat. Jason gasps as he gets his cock serviced by his young lover. Jason's hands start exploring Connor's sweet ass and soon he's hungry for some dick himself. He hauls Connor to his feet and goes to work on his hard cock. Connor's dick is rock hard as Jason bobs his head on it. He laps at his smooth balls and shaft as he strokes his own cock. 'Let me see that ass', Jason orders as he turns his boy around. He dives in tongue first as he eats that sweet hole sending Connor into orbit. Connor sits on his face for more before going head first into a hot 69 where they both get what they want, more cock and ass!Once Jason's ass is nice and wet he gets on all four and gives it up to Connor who is more than happy to slide his hard cock inside. He is fucking that ass with ease as he pounds Jason's hole. He looks down and watches as his cock disappears into that smooth ass before him. He picks up the pace and fucks Jason deeper as he coos his appreciation. They then switch it up as Jason suits up and sits back and has Connor sit on his cock. He loves that tight ass on his dick as Connor bounces on his meat. Connor's hard cock bounces up and down as he impales himself repeatedly on that hard cock. This boy must've learned some rodeo tricks back home in North Carolina 'cause he sure knows how to ride some dick. He is grinding on Jason's dick hard and wants every inch of it inside him. Missionary is next as Jason gets Connor on his back. He lifts those thick thighs and slides his meat back into that beefy ass. Jason delivers the goods while Connor strokes his hard cock. Missionary does the trick as Connor blows his wad all over his smooth chest. Jason isn't far behind as he pulls out and empties his nuts all over his cum-drenched partner.",
  "models": [
    {
      "name": "Connor Patricks",
      "person_id": 28062
    },
    {
      "name": "Jason Sparks",
      "person_id": 28061
    }
  ],
  "release_date": "2012-05-31",
  "scene_id": 54004,
  "series": "Spark it in the Rear",
  "tags": [],
  "title": "Jason Sparks & Connor Patricks Interview"
}