{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have two new faces this week, and boy do we have a daddy for you. Originally from New York, Nick Moretti is in his prime. Nick's 46 and looking mighty fine. He's been living in Florida for over 20 years. To his right is one fine Denver native by the name of Sebastian Keys. Sebastian is now a man over 30?by injection. This sexy 19 year old now calls Cincinnati home. Sebastian is mild mannered and, you wouldn't know it from looking at him, has been into Martial Arts since he was young and holds several black belts. Let's not make this one angry. Nick is an artist in his own right. He loves to create paintings or any other type of art. Nick considers himself a Gay Erotic personality and admits had he the chance to do it all over again he wouldn't be as shy and be a lot more confident. Sebastian isn't as seasoned a performer. Had you told him he'd be doing gay porn two years ago, he would've told you you were insane. He's flourished amazingly well in the man to man scene as well as in front of the cameras. We're just glad he came over to play on our side of the fence and decided to stay. He smiles as he proudly affirms he loves what he does and has no problem with what he does. Can we get a witness!Nick is in the shower washing off after a workout at the gym. Little does he know he has unexpected company. Sebastian has arrived early and is helping himself to quite the peep show through the open bathroom door until Nick catches him. Sebastian high tails it back to the couch; grabs a magazine, and acts all innocent. He's confronted soon enough by Nick, wearing only a towel and a grin. 'I saw you peeping.' Sebastian tries to deny it, until Nick gives him something better than a magazine to look at. The towel comes off as Sebastian's hands start to explore Nick's muscular bod. This daddy must live at the gym. Sebastian is more than happy to show his appreciation. Nick's cock is soon in warmer waters as Sebastian's mouth gets a hold of it. He slurps and gags on Nick's massive meat as he tries to get as much of it in his mouth. Nick starts to strip his young friend while still feeding him dick. Nick is loving the attention as he fucks Sebastian's throat while holding his head in place. Nick then wants to return the favor as he puts Sebastian on the couch and goes down on his own aching cock. Sebastian lies back and watches for a while before his urge for more ?Moretti Meat? takes over him. He gets Nick on a chair and gets his hungry lips all over that thick cock. He's got it bad! We can't blame him. Sebastian slurps and swallows as much dick as he can, getting Nick hornier for a lot more than oral. ?He had it coming!n'Let me see your ass!' Nick orders as he bends Sebastian over onto the chair. Nick gets behind that smooth, white ass and goes to work. He starts tongue-fucking Sebastian, driving him crazy as he gets that ass ready for dick. He then moves Sebastian over onto the couch where he teases that ass a bit before slowly sliding his thick cock inside. Sebastian winces as his ass starts to give in. Soon, his ass is stretched wide by Nick's fat cock. Nick's not one to wait for what he wants, and is soon pounding that ass with reckless abandon. Sebastian takes every deep plunge with ease. 'Aww that feels good' he coos, as Nick continues to fuck away at his hole. The sound of Nick's balls slapping away fill the room as Sebastian can only beg for more. Nick's furry abs look amazing in contrast to the perfectly smooth ass below that's taking his meat balls deep. Nick then has Sebastian do the work as he sits back and lets Sebastian straddle his cock and ride it. Sebastian gladly impales himself on that extra thick dick. Once he's tired, Nick gladly takes over fucking his dick up into him for more. Nick then gets Sebastian on his back; lifts those smooth legs, and slides back inside the hairless hole that will soon claim his load. Sebastian takes that thick cock to the hilt as Nick pounds him harder and harder. Nick's monster cock is hitting him in just the right spot, and Sebastian is soon busting his nut all over his contracting abs. Nick is next as he pulls out and blows his thick load all over Sebastian's chest and cum-coated abs.",
  "models": [
    {
      "name": "Nick Moretti",
      "person_id": 27959
    },
    {
      "name": "Sebastian Keys",
      "person_id": 27966
    }
  ],
  "release_date": "2010-01-21",
  "scene_id": 54013,
  "tags": [],
  "title": "All Choked Up, Scene #01"
}