{
  "collections": [
    "Men Over 30"
  ],
  "description": "After doing his very first web episode with us on his birthday, 37 year-old Matthew Rush is back with us this week, and we couldn't be happier to give our members more Matthew. What a ?rush??riiight? Well, it will be when you get to see Mr. Rush playing a role he doesn't play very often on camera. (more on that in a minute.) Christmas this year couldn't have been any hotter thanks to the dynamic Drake Jaden, who boldly took a pounding by power top Brenn Weisman. Gotta be careful what you wish for. Even though he left walking a tad funny, 25 year-old Drake didn't complain one bit. Both of these studs have quite the r?sum?, so we asked them had they the opportunity to write their memoirs, what would it be called? Matt thinks for a few seconds, then says ?Naked Beneath My Clothes? then burst out laughing. Comedian Rita Rudner just got her book's title stolen. Drake's book would be titled ?I can't believe I took the whole thing?. You can all draw you own conclusions on that one; but one thing you won't need to draw conclusions on is who will be taking the ?whole thing?. Drake's hot ass is taking the day off, and his thick 8? cock will be boldly rushing up Matthew's ass for a much needed change. After all, isn't that what most of us vote for?Kissing is on the menu as these two get better acquainted. Their hands roam all over the other as they begin to strip off their shirts before fumbling to undo their pants. Matt's cock is the first one out as Drake seizes the opportunity to get a better taste. He wraps his lips around Matt's thick shaft and begins to bob his head on his cock, taking it all the way down. ?Oh that feels so fucking good? Matt grunts, as he hauls Drake up so that he can kneel and get in on the oral fun. Drake's rock hard, and Matthew easily engulfs every delicious inch of his 8? fuck tool. Drake holds Matt's head as he bobs him up and down on his meat. Matt loves the dick Drake's giving him, so Drake stands up to fuck Matt's face and stroke it as Matt works his balls. Drake has a tight body with a semi furry chest and several sweet tattoos. His smaller frame will soon dominate that of Matt, who's in for quite a ride. Drake then preps that thick ass for a proper pounding by shoving his tongue up inside it, which only drives Matt nuts. Matt's smooth ass is soon glistening in a custom spit-shine and ready for one thing?DICK!Drake sits on the couch and suits up as Matthew straddles him and begins to sit on that rock hard cock. Drake's meat easily slides inside Matt's hungry ass. Matt begins to fuck himself as he grinds and bounces on Drake's dick like he's on a bouncy ball. Matt's cock is rock hard and thumping against Drake's furry chest with every bounce, and soon Drake wants more control. He puts Matt on all fours and slides his cock in for more. Matt is cock crazed and begging for more, and Drake's more than happy to oblige. The harder Drake pounds that ass, the more Matt begs for it. They're both lost in an animalistic grunt fest as they fuck each other's brains out. The view from above as Drake just fucks Matt's ass is insane, and Matt's loving every inch of it. Drake then sits back on the couch and has Matt ride him, only this time in reverse. Matthew sits on Drake's dick again, and Drake starts to pile drive his rock hard cock up into Matt's ass as he strokes Matt's hard cock. ?OH, Fuck my ass!?, Matt grunts, as he slams his ass harder and harder back onto Drake's dick. It won't be long before these two explode. As they feel that familiar tickle, they sit back, side by side on the couch to jack themselves off into a rather messy explosion. So why is it that some people are so resistant to change?",
  "models": [
    {
      "name": "Matthew Rush",
      "person_id": 27951
    },
    {
      "name": "Drake Jaden",
      "person_id": 27955
    }
  ],
  "release_date": "2010-01-28",
  "scene_id": 54015,
  "tags": [],
  "title": "Bum Rush, Scene #01"
}