{
  "collections": [
    "Men Over 30"
  ],
  "description": "ailing from Philadelphia, PA is this week's furry morsel. Standing at 5'11 with a longstanding career in the business, Tim Kelly is still looking amazing at 48. He's known for his ?Daddy? sex appeal. He wears that image well and admits he's the same off camera as well as on. Tim likes to play the Daddy role at home just as much as he does on set. Art imitates life imitating art. (Something like that) Tim is happy with is life choices and has no qualms about his career in the adult industry. He does however wish he'd paid better attention in school and maybe taken a few more political science courses just to help him stay current with the goings on. We were pleased to discover that this will be Tim's first ever solo and we're happy to be the ones to bring that to our members. We're sure there have been plenty of men stroking off to his hairy hotness. When it comes to what Tim strokes off to, we asked him what type of scene or men puts the sail on his mast. Tim is attracted to guys shorter than him, built, and 40 or younger. Hmmm, that gives us an idea of what?or whom?we can throw together when we get this Daddy Delight to come back and see us. You heard it here first: ?He'll be back!?In an orange muscle tank, Tim slowly begins his strip tease. He hoists up his guns as he flexes them for us. Tim's dedication at the gym has really paid off and has kept his hairy frame in amazing shape. He loses the tank and continues to pose for us, showing off his hairy pits and chest and the happy highway that leads to his growing cock. He pulls off his shorts and is left in a sexy pair of underwear that soon isn't able to contain his growing cock. He hauls his meat out of his underwear, giving it a few tugs before losing them altogether as well. He sits back on the couch and starts to give his cock the attention it needs. As he strokes that daddy dick, Tim realizes he has options and that maybe his hand could use the day off. He leans over and grabs a Fleshjack on the side table and quickly puts it to good use. He slides his hard dick deep inside and starts jacking off into it. His cock responds as it throbs to the new sensation enveloping it. He switches off from one hand to the other as he pumps the fleshjack onto his aching cock. This Fleshjack is in for one hell of a ride.Tim stands and continues fucking into the Fleshjack adjusting the suction on it before going back to mounting it. The sloppy sounds of his cock pounding that hole fill the room as his balls bounce up to meet it with every double fisted thrust he gives it. He slowly pulls the jack off his cock til h is cock is almost free, before slowly sliding his meat inside until he's ball deep in it again, rinse, repeat. Tim can't get enough as he strokes his meat with his fist for a bit alternating with more of the jack. Tim's balls are slowly beginning to pull up closer and closer to the base of his meaty cock. You know it won't be long before they're ready to launch their boys into orbit, or in this case, the rug below. Hey, Momma said there'd be days like these! lol Tim picks up the pace as he pounds away at his pole with the jack and uses both hands to impale it on his cock faster and faster. Tim's defined chest rises and falls as his breathing begins to labor. Tim then puts the jack into the couch and mounts it like a steed burying his meat deep into its warm embrace. His muscular ass is on display as he pumps the jack full of dick. That does the trick as Tim spins around, lays back and busts his nut all over his furry abs and navel. Damn, Daddy! ...do it again.",
  "models": [
    {
      "name": "Tim Kelly",
      "person_id": 27957
    }
  ],
  "release_date": "2010-01-07",
  "scene_id": 54010,
  "tags": [],
  "title": "Daddy Daycare, Scene #02"
}