{
  "collections": [
    "Men Over 30"
  ],
  "description": "Mark Twain was once quoted as saying the principle of give and take is the principle of diplomacy. That being said, we wanted to ensure that 2010 would be greeted with diplomacy?and lots of sex.  So today we're having our episode all about give and take. There will be no fighting over the remote or having to flip a coin. This afternoon, Brock Russell and jock stud Dayton O'Connor have equal dibs on getting some and giving some. Aaah, the possibilities. Brock is 36 and originally from P. Town. Brock is in for a surprise today since we normally have him with other guys in the MenOver30 club. Today, Brock's going to be getting better acquainted with 24 year old Dayton, who became an instant fan favorite on our brother site when he steamed up our cameras with his real life beau, Tory. Dayton is from ?Middle-of-nowhere?, PA as he calls it, though his jock look and ripped abs have definitely put him on the map. We asked these two what movie they could watch over and over. Brock chimed in with 'Shawshank Redemption' a definite classic; while Dayton likes more 'Gladiator' type films. Then to spice it up, we asked them how they felt about semen. They didn't see that one cummin'. (pun intended) Turns out they both love cum (foreshadowing) and don't mind getting the stuff all over them.  Well, what the $#%@! are we waiting for?The chemistry is as hot as we thought as these two studs begin to explore the other. Dayton's tongue roams freely on Brock's smooth chest as he peels off his tank. Dayton's shirt comes off as well, as Brock begins to work his nips while groping his growing crotch. Brock then drops his jeans before kneeling before Dayton as Dayton pushes down his jeans to reveal his throbbing cock hiding in his camouflage briefs. Let's face it, there isn't enough to cover that thick 8? cock, so it is at Brock's mercy in seconds. Brock swallows Dayton's cock to the hilt, and Dayton moans his appreciation. ?That's a big dick?, Brock mumbles, before going right back down on it for more. Dayton's cock is rock hard and throbbing at Brock's command. Dayton wants in on the fun as he stands Brock up and takes his turn. Brock is more than happy to oblige as he watches his cock disappear into Dayton's hungry mouth. Dayton gives him a spit shine. Once he's had his fill, he bends Brock over to eat that ass. Brock's ass is spread wide and on display as Dayton goes to work tonguing it. Brock's beefy ass is getting prepped for delivery, and he can hardly wait. We can't say we blame him either.Dayton gets up and aims his rock hard cock at that ass and slides inside. Brock grunts as his ass gets invaded and fucked. Dayton wastes little time before taking that ass like he owns it. ?Fucking take that cock!? he orders, as he slams his dick deeper and deeper. Brock grunts and takes it in stride. Dayton then switches it up by sitting back on a chair and has Brock sit on his dick. Brock kisses Dayton as he bounces up and down on his jock cock. He can't get enough as he maneuvers into different ways to take that dick. Horny and creative?who knew!? Brock grinds his ass deep and takes every inch of Dayton he can get, making Dayton crazy as he watches Brock loving his dick in him. Then it's time to give back as Brock tells Dayton to sit on his dick. They switch as they move over to the couch. Brock sits back as Dayton straddles and impales himself on his rock hard cock for some fucking of his own. They make out as Brock fucks his cock up into Dayton's hot ass. Brock then puts Dayton on his back and starts to pound that ass missionary. ?Get in there? Day begs, as Brock picks up the pace. Dayton jacks his cock harder and faster as Brock keeps fucking him deep. That's enough to send Dayton over the edge as he explodes his thick load all over his smooth chest and abs. Brock then pulls out and jacks even more cum ALL over Dayton.What!??didn't know that was coming!",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "Dayton O'Connor",
      "person_id": 27958
    }
  ],
  "release_date": "2010-01-14",
  "scene_id": 54012,
  "tags": [],
  "title": "Give & Take, Scene #02"
}