{
  "collections": [
    "Men Over 30"
  ],
  "description": "Manny Forte is this week's good fella. Manny is 36 and originally from Newark, NJ. He's been living in Miami for the last 12 years. He may have spent a long time in Jersey, but his roots are all Puerto Rican. He misses the food from Puerto Rico, though in Miami, he's about as close to being home with all the different cultures that abound. His favorite meal is ?Arroz con Gandules y Lechon? (Pigeon peas and rice with pork); while his favorite American fare is the classic cheeseburger. Manny enjoys Soccer and Football. He loves to watch it as well as play it. Manny like to watch a lot of things, in fact. Manny admits he loves jacking off more than anything. He loves to jerk off so much, he'd rather do that then have sex. He would rather watch and stroke his uncut cock himself. Manny has had his dick pimped, and sports what he calls a ?rocket?. A rocket is a sub dermal addition, a pearl is often used and it helps provide extra stimulation while fucking. It's located at the top of the cock near the base of the shaft to stimulate the clit?both real and imagined?during the art of making love. (...and by ?making love? we mean senseless fucking) He admits he does get people asking him about it from time to time. We bet the gym's showers are now a buzz because of it. ?Excuse me is that a 'rocket' and if so?may I have a ride, Papi??Manny playfully peels off his shirt and undershirt as he shows off his massive pecs. Manny is no stranger to the gym, and his efforts have paid off. His pecs are well-defined and covered with just the right amount of fur. He has tattoos on each arm, as well as one on his pec. He starts to grope his chest as his free hand takes a drive down the happy trail into bush land. There, he finds his cock that's slowly coming to life. Those nipples are hot wired to that meat of his, and it's gonna need a lot more attention than a mere nipple rub in a minute. Manny then drops his jeans and gives us our first view of his hairy ass as it's framed in an orange jock strap. He gets on the couch on all fours and starts to play with it, so that we can get a better view of the goods. His ass is covered in hair. He shows off his hole for us while massaging his muscular ass. Manny licks his lips as he looks directly into the camera. He is loving the fact that he's being watched. The hunter is now the hunted, and he loves it. Manny is at full mast by now and has stroked his cock so that it stands at attention. Manny realizes he is still a bit overdressed and slowly loses his orange jock strap. Now that those have hit the floor, the real fun begins.Manny lies back, spreading his thick thighs wide apart as he gets comfortable. He can now give that big dick of his a proper stroking. He slowly worships his meat, which is now aching for attention. His smooth balls are pulled up tight beneath his thick shaft as Manny continues to stroke his massive cock. We can tell Manny gets into stroking because he doesn't rush anything. He's methodical, slowly appreciating his cock. It glistens as his hand swirls over it, under hand, over hand. He shakes his club around as well before going back to fist fucking with it. Fortunately, one of Manny's favorite all time favorite sessions involved a 3 way with a girl and another guy. We might be able to see just what this fuck pole can do when it's unleashed since Manny said he'd be open to us finding him a male costar in the near future. Manny's cock is throbbing by now. All that specialized attention is paying off. As his nuts begin to tighten, Manny slowly picks up his pace. Without much pomp or circumstance, he nuts. His cock unloads, sending a glazed cascade spilling over his fist, falling onto his furry floor below.",
  "models": [
    {
      "name": "Manny Forte",
      "person_id": 27960
    }
  ],
  "release_date": "2010-02-04",
  "scene_id": 54017,
  "tags": [],
  "title": "Grin & Bear It, Scene #01"
}