{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a new face on MenOver30. Tucker Forrest makes a premature entrance by injection into the MenOver30 Club. Tucker has become a familiar face on our brother sites, including ExtraBigDicks, where he has had a chance to show off his skills as a python wrangler and a skilled top as well. We figured to welcome him into the fold, we should pair him up with a site favorite more than qualified to do the deed. We brought in none other than Chad Brock to initiate our 27 year-old boy from Michigan. Chad is 36 and hasn't lost his taste for younger flesh, so he was more than happy to oblige. Tucker likes hot men regardless of their age. Tucker says his ideal Saturday night could entail anything from going out clubbing with friends to staying home watching movies with a glass of wine. Chad admits his ideal Saturday night would be having a romantic, candlelit dinner at home, then curling up with that special someone on the couch to watch movies. Hmm, seems these two have similar likes in that department. Well, we're pretty sure these two are going to have a lot more in common in a few minutes besides being naked. Judging from the chemistry between them, we have a feeling there's gonna be a lot of giving and receiving. ?Oh, goooody!These two have no trouble getting to it as they kiss and start to strip each other down. Tucker's tongue makes its way across Chad's tanned chest as his hands move south in search of more to play with. Chad pulls off Tucker's tee as they continue to get acquainted. Chad gives Tucker's head a nudge south as Tucker catches on and peels off Chad's jeans. Chad's cock is hard in anticipation. Soon enough, Tucker's tongue is working along its length, coating the underwear that still strains to contain it. Chad groans in ecstasy as Tucker's skilled tongue drives his cock crazy. Tucker then goes in for gold as he starts to swallow every inch of Chad's meat. He swirls his head up and down, making Chad's cock throb. Chad just watches as Tucker goes to work on his rock hard cock. As he does, Chad's hand begins to explore Tucker's jeans as he gets curious about that sweet ass he'll soon have. Tuckers jeans come off next as Chad decides he should return the favor. Chad licks along Tucker's smooth chest before going to work on Tuck's thick 8' cock. Guess big things really do come in small packages. Chad isn't letting any of that go to waste as he swallows every inch to the hilt.After worshipping Tucker's fat cock, Chad turns him around and starts prepping that smooth hole by shoving his tongue deep inside it. Tucker moans as he gets used to the new sensation on his tight hole. He is ready for that cock. As Chad fingers it some, Tucker's face lights up in anticipation. Chad then slides his meat in doggie style as Tucker's ass slowly gives way. Chad is soon fucking Tucker like a champ as his balls slap away at our Midwestern hottie. Chad fucks Tucker at a steady pace for a bit as that sweet ass starts to work on his meat. Chad loves that ass, and pulls his meat almost all the way out before slamming it back in to drive Tucker crazy. Tucker then takes control as Chad sits back and gets that cock ridden. Tucker sits back and starts to ride Chad's dick in a Reverse Cowgirl position that gets Chad's cock even deeper inside his hungry ass. They slow it down as Chad starts to grind his meat deep into that hole. Tucker doesn't want to be left out of the fucking department, as he suits up and gets ready to give his older counterpart a good pounding in return. Chad sits down on Tucker's ass stretcher and is soon bobbing up and down on it, taking every thick inch deep. It isn't long at all before Tucker's cock makes him shoot all over the place. He didn't stand a chance with that fat meat pounding his prostate. Tucker then pulls out and busts his load all over Chad's face and chest as he kneels between his legs. Whew.",
  "models": [
    {
      "name": "Chad Brock",
      "person_id": 27925
    },
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    }
  ],
  "release_date": "2010-03-04",
  "scene_id": 54027,
  "series": "Tuckered Out",
  "tags": [],
  "title": "Tuckered Out, Scene #01"
}