{
  "collections": [
    "Men Over 30"
  ],
  "description": "After popular demand we just had to bring back David Chase. (That and we have some unfinished business from last week's episode). David  is a recent member of the MenOver30 club. After recently celebrating his 30th, he decided to made his grand debut with us last week. At 6'3 David brings a lot to the table. He's a native Floridian from Jacksonville and has an infectious personality. The shaved head and the beard give him an edgier look but don't be fooled he's a teddy bear.  We have a playmate from the Windy city that goes by the name of Eddie Kordova for David. Eddie made his debut with us last week on our brother site ExtraBigDicks. We're sure our members will enjoy Eddie and his 8?? Chicago-style hot dog. YUM. Eddie is 34 and has a lot in common with David. Given the option, they both would want to go to Europe for a cruise. While David prefers Seafood, Eddie wants them both so it's Surf and Turf for Mr. Chicago. They also both would rather eat outside as well as fuck outside. Great minds think alike. David has been doing this for a while. He says that the biggest thing he's learned is that the more he allows himself to experience, the more comfortable he is with his sexuality - then the sky is the limit. Those are words of wisdom for Eddie, who is just starting out in the biz but definitely wants to stick around.There's a knock on the door. David, who just finished beating off in anticipation, opens the door to Eddie, who wonders why he's not ready yet. ?You have no idea how ready I am? David says as he pulls him inside and starts to undress him. Eddie is stripped in seconds as David goes to work on his meaty uncut cock. David sucks and gags on that thick meat as he gets it rock hard. Eddie stands to give David easier access to all the cock he can take as David goes to town on his thick meat. Eddie stands and watches as David takes every inch of his throbbing cock down to the hilt. Eddie then hoists David to his feet before shoving him down on the couch and going in for some cock himself. David's cock is rock hard as a rock as Eddie begins to return the favor. Eddie licks at his smooth balls as he continues to swallow David's fat cock. Eddie goes to kiss David who immediately nods his head no and pushes his head right back down on his dick?HOT! ?I want you up here; I wanna suck on your ass? David says as he gets his tongue deep into Eddie's smooth hole. David rams his face deep inside Eddie's cheeks as he buries his tongue up that sweet ass. Eddie then returns the favor. Eddie spreads David's beefy ass and gives his smooth ass a soaking, getting it ready for the fucking to follow.?What else do you wanna do with that?? David coyly asks as Eddie continues to eat his ass. ?You wanna get fucker?? David grimaces as he lubes up & starts to slide his thick dick deep inside David's hungry ass. David groans as he starts taking Eddie's thick cock. It doesn't take long for David's ass to welcome its new invader as Eddie starts to pick up the pace as he fucks away at David's hot ass. ?Aww, that's such a good dick? David moans as David keeps fucking his ass doggy style. An overhead shot shows us all the action as Eddie pounds away and buries his thick cock all the way inside David's ass. David then switches it up as he puts David on his back and slams his dick back into that ass for more fucking. David is going nuts as Eddie expertly fucks his insatiable hole. Eddie is rock hard and easily pummeling away at that ass. He leans back as he slides his thick dick in and out almost all the way out before slamming it back in. David then gets to ride that dick as Eddie sits on the chair and lets him do all the work. David greedily rides his cock for all its worth as he impales himself onto that cock repeatedly. Eddie's balls are tingling, and David won't last much longer. They both dismount to stroke off their cocks side by side. They make out as they each reach explosive climaxes coating their cocks and navels with their seed. Whew.",
  "models": [
    {
      "name": "David Chase",
      "person_id": 27963
    },
    {
      "name": "Eddie Kordova",
      "person_id": 27964
    }
  ],
  "release_date": "2010-02-25",
  "scene_id": 54025,
  "tags": [],
  "title": "Date Night, Scene #01"
}