{
  "collections": [
    "Men Over 30"
  ],
  "description": "Feliz Andrews, who is now living in Vegas, is back to give us an update. It had been a while since we saw Feliz who has amassed quite the fan following on several of our sites with that sweet bod and sexy face. Well, what happens in Vegas may stay in Vegas; but this afternoon, Feliz is in South Beach and what happens in South Beach...well see for yourselves.  Celebrating the return of the prodigal floridian we have a special, larger-than-life surprise in the form of one 6'7', deep-voiced MAN named Colin Steele. Colin hails from Lancaster, PA which is just outside of Philadelphia. At 45, Colin is a stunning example of a masculine man in his prime. We asked these two to pick three adjectives they could use to describe themselves. Feliz went with funny, compassionate and sexy. The Man of Steele offered up reserved, completely impractical and a dreamer. Hmm, those sound like perfect porn star qualities. We then asked them what their favorite cocktail, food & color is because...we can. lol Feliz went with: Kettle and Soda, anything Italian and green. Colin, the completely impractical one, decides to answer in reverse order: Turquoise, Ice cream and he remembers liking gin (when he used to drink). Enough said lol Ok?enough chit-chat lets get them nekid!Feliz is on the couch doodling away wondering who is going to be his Valentine this year and just as he finishes his 3rd heart the door opens and in walks Colin Steele. Barely making it through the door the tall stud walks in with a bouquet of roses for our boy in romantic distress. He sits next to Feliz and they immediately start to kiss . We love when everything comes together. Colin starts to undress Feliz as the roses hit the deck and all hands are on dick. They grope and explore each other as they slowly undress. Feliz is rock hard in seconds and Colin's hands are wrapped around his meat. Colin kneels before his Valentine as he strips off his tee and undoes his jeans. Feliz' underwear are stripped off as Colin's tongue treats itself to an all-u-can lick buffet. He licks at Feliz' cock and balls as he gets a better taste of all that Feliz has to offer. Feliz then sits up and has his turn at Colin's thick dick as he shoves as much as he can down his hungry throat. Feliz steadily works his cock with his hands and fist before Colin starts to force feed him more. 'That's it, take it all!' he grunts while face fucking Feliz. Feliz doesn't seem to mind and he's up for any kind of fucking Colin might have in mind. Luckily, Colin has more in store for Feliz. 'Here's your fucking Valentine' Colin teases as he shoves more meat down Feliz' throat. ?Mmm, yummy lol'Give me a taste of that ass' Colin groans before putting Feliz on the couch and spreading his cheeks wide. Colin's tongue starts to lap away at Feliz' hungry hole and it drives him wild. Colin is soon fingering the sweet ass he'll be fucking soon enough and a shot from behind gives us a view of the tall studs own back door as he gets lost in the moment lubing that tight ass with his tongue. From there they switch into a hot 69 unable to get enough of each other's dicks. Colin starts to finger Feliz' ass while he sucks his dick getting it ready for a proper fucking. Feliz gets up and sits right down on Colin's rock hard cock as he begins to ride him side saddle! He then rearranges himself so he can ride it while making out with his tall stud. Feliz spreads his hot ass open as wide as he can; burying Colin deep inside him. Colin is in awe as Feliz works his hot ass deeper on his pole. Feliz is in for a good pounding as Colin picks him up and starts to shove his cock hard up into him. Colin then puts Feliz on all four before slamming back inside ordering him to take his fucking dick. Feliz gets his hungry ass pounded as Colin gets his dick taken care of. Colin grabs Feliz by the shoulder as he bounces him back hard onto his thick dick. 'Fuck me' Feliz begs as Colin follows orders. Colin then puts Feliz on his back and fucks that hole missionary. Feliz can't take it anymore as his cock explodes sending a massive meteor shower of load way past his head and splattering on his chest. Colin follows up with another impressive load that white washes Feliz' cum drenched chest. Happy Valentine's Day indeed from MenOver30.com",
  "models": [
    {
      "name": "Colin Steele",
      "person_id": 27961
    },
    {
      "name": "Feliz Andrews",
      "person_id": 27962
    }
  ],
  "release_date": "2010-02-11",
  "scene_id": 54020,
  "series": "Man O' Steele",
  "tags": [],
  "title": "Man O' Steele, Scene #02"
}