{
  "collections": [
    "Men Over 30"
  ],
  "description": "A fresh face graces us this week. At 33, this New York native has a lot to show off. Brenden Cage is a character to say the least. He has an outgoing personality. Since he goes both ways, he can share his special sense of humor. Brenden is your average New Yorker and loves to brag about the Big Apple, even recommending his favorite pizza back home. Ray's Pizza apparently has a place in his heart. Brenden got into the industry because he was always jerking off and trying to get laid everywhere, so he figured he might be able to get paid for it. His favorite orgasm to date was going home with a girl that picked him up. She wanted him to fuck her while her husband watched. While he was fucking her, her husband started eating his ass. That sent him over the edge and gave him a mind blowing orgasm. He still loves getting his ass eaten while fucking. He's a firm believer that less is not more?more IS more. ?I'm into multiple partners' he admits '...and I'm not that picky either? This exhibitionist loves to show off his beefy frame, and who are we to judge? This slice of Pepperoni goodness is more than welcome to haul out his extra topping for us anytime he wants. That's definitely good eats.Brenden is sitting on the couch and can't wait to get started. There's no mistaking a true exhibitionist that feeds off the knowing that you're hanging on his every move. He starts caressing his pecs before peeling off his tank. Once he gets his shirt off, he continues to explore his broad chest and arms. The entire time, Brenden is making love to to the camera like a true professional. He slides his shorts off slowly as they hit the floor. Once he gets his shoes and socks off, he slowly starts to work his growing cock inside his sexy briefs. Brenden works out, and his dedication pays off. His thighs are beefy and muscular. As he stands to tease us with the last layer of his vestment, they add to the amazing view that is unfolding before our eyes. Brenden has a spectacular ass. It's no wonder that that little tramp's husband dove right in tongue first just watching him fuck her. He's only human. Brenden's ass is nothing shy of amazing. Brenden knows exactly what he's working with. He bends over on the couch and gives us a stellar performance as he spreads that beefy, muscular ass wide open and plays with his hole for us. This fucker's working it!Brenden stands and holds a pillow over his swollen cock, giving us his last layer before we get the goods. Brenden loves the whole chase sequence and likes to make you work for it before he shows you just what you've been wanting. He finally drops the pillow and stands above the camera as he slowly strokes and lubes his cock for you. He slowly twists and twirls his fist all over his engorged bone. (Feel free to open up and say ?Aaah!?) Brenden then sits back on a chaise to jack his swollen meat. He jacks his cock deliberately, wanting to make you savor every second. Soon he is lost in his own private paradise. Brenden admits he likes to think about himself jacking off while he jacks off. Kinda odd, but for this industry...that's actually kinda tame. His cock is rock hard, and we can hear his breath labor as he jacks his cock faster and faster. Brenden is in his own world and apparently forgot about his sensual session. He's a man on a mission, and he's not gonna last much longer at the fevered pace he's working. His eyes are sealed shut, and his fist is now a blur. He grimaces as he readies for the final fireworks. His body tenses, and he grunts a final warning. He's cumming, and he's doing it all over his sexy abs and cock. Whew. Our poor little New Yorker is spent?literally. Time for a nap.",
  "models": [
    {
      "name": "Brenden Cage",
      "person_id": 27967
    }
  ],
  "release_date": "2010-03-11",
  "scene_id": 54029,
  "tags": [],
  "title": "Home Alone, Scene #01"
}