{
  "collections": [
    "Men Over 30"
  ],
  "description": "David Chase is this week's sexy stud. He is a recent inductee to the MenOver30 club, as he recently had his 30th birthday. This stereotypical Scorpio is addicted to sex. He loves having sex and immediately feels better connected when he does have sex with someone he's into. He grew up a total Momma's boy. He still talks to his Mom at least once a day. David is a hard working man. We asked him, if he had 6 months off, what would he do with the time? David is captivated by Italian, Spanish and French cultures. Movies like ?La Dolce Vita? have given him a whole new appreciation of that region. So, if he had time to explore them he would love to spend them abroad exploring Europe. David doesn't consider himself anything in particular. He's neither gay nor str8. He considers himself more Bisexual. He goes with the flow whichever way the flow may ebb on that day. ?I don't associate with any name, I just do what's hot to me and that's my sexuality? We couldn't agree more. He's attracted to people who can express themselves genuinely from the heart and who aren't all useless chatter. Those qualities can be found on either side of the fence. David has been in the industry for a while, but he's chosen to have limited exposure His experiences have given him the opportunity to really know what he likes, with the self-assuredness to explore that without any regrets.David is on the phone making plans for his hot date. He figures he has about an hour, so he does some calisthenics to get his muscles pumped up. He takes off his tee and starts with stretches. He does dips off the chair, working his triceps and shoulders. He loses his pants as his beefy frame comes into view. He's wearing a tight gray jock strap that accentuates his ass in the most amazing way. He gets on the couch and starts doing leg stretches. As he points his legs back, he shows off that hot ass of his. His hand starts to roam as he caresses his ass. He refocuses as he hits the floor to do a set of push ups. He grunts a bit as he does his last set. His muscles are pumped. When he finishes, he turns his attention to his jock strap. The strap is having trouble containing his ?other? muscle, which in now throbbing and needing a work out, too. David grins as he grabs his thick cock and frees it from its holster. He starts to stroke his meat. His face lights up with relief as he starts to give his dick the attention it needs.David sits on the chair and starts to work that dick. He lubes it up and swirls his fist over his knob and swollen shaft. He works it hard as he moans and sighs. We have a feeling that David's date better arrive sooner than later or he's gonna miss out on...well, you know. David stands to give us a better view. As the camera gives us a view from below, we can admire his heavy low hangers, rock hard cock, and those furry pecs that are flexing as he continues to jack that rock hard cock. David then lies back on the couch to continue massaging his balls and stroking that cock. His 6'3 frame looks amazing as his muscles writhe beneath his skin. David's cock is throbbing. He keeps working the end of his shaft and knob which are making his balls start to pull up tight around his shaft. David then decides to give us a better view of that ass as he goes face first into the couch and spreads that beefy ass wide. He continues stroking that cock underhand as his balls and thick 8? cock are pulled back and stroked. David is getting close so he lies back on the couch again to take care of business. He strokes his dick as his right hand pins his thick meat at the base. He starts to stroke and swirl quicker. That does the trick. His thick cock gives up its load all over David's furry chest and abs. Whew. As he lies there, covered in cum and reveling in the after glow....a knock on the door.",
  "models": [
    {
      "name": "David Chase",
      "person_id": 27963
    }
  ],
  "release_date": "2010-02-18",
  "scene_id": 54021,
  "series": "The Thrill Of Chase",
  "tags": [],
  "title": "The Thrill Of Chase, Scene #01"
}