{
  "collections": [
    "Men Over 30"
  ],
  "description": "Since once is rarely enough, we just had to have more of sexy Brenden Cage this week. Maybe we'll get a better idea of all he can do by pairing him up with an equally sexy partner in crime. Brenden  made quite the impression last week. We're glad this newcomer was so well received. Even though this week, Brenden's playing coy on where he's from (claiming he's a ?wanderer?) this 33 year-old New Yorker likes to keep you on your toes. We figured we could return the favor and called in a past ?papi? more than capable of keeping him on his. Alexander Garrett is back this week. It's nice to have this 33 year-old Colombian back for more fun. Even though we haven't seen Alexander  since last Summer, he's looking as good as ever. We asked these studs what hobbies or outside interests if any they have when they aren't doing porn. ?I like to jerk off? says Brenden. So he always has sex on the brain. Alexander who answered in the 3rd person (creepy) said Alexander like the porn but he prefers to swim. They're both horny and lost their cherry in High School. Brenden lost it to an older girl that had her way with him. Alexander tops that by smiling and admitting his first time was a threesome at the tender age of 15 with both a boy and a girl. We'd like to see the brochure for that school.The chemistry is off the charts as these two break the ice, kissing passionately. Slowly, they undress each other as their tongue-fest continues. Brenden's hand is exploring Alexander's crotch. It isn't long before he's on his knees pulling down Alexander's shorts and underwear as his thick, uncut cock springs into view. Brenden's eyes light up, and he's on it in seconds. Alexander's thick 8? meat is getting a rather inspiring welcome, and he's rock hard as Brenden sucks on it. Alexander then wants some as well, as they strip completely. He takes his turn on Brenden's bone. Alexander expertly works Brenden's cock as Brenden gets antsy for more of Alexander's. After pulling him up for another brief make out session, Brenden is back on his knees and sucking on Alexander's meat like an oil rigger. DAMN! He swirls his fist and mouth on his swollen meat. It's making them both hornier for more than just those skilled tongues.Brenden isn't done sampling yet. As he stands up, he grabs Alexander by the hand and pulls him toward the couch, where he gets him on all fours. His smooth ass is exposed. Brenden takes advantage of that by slipping his hot tongue deep inside that ass. He laps and sucks away as Alexander writhes in ecstasy. Brenden then sits on the couch, spreads his legs wide, and waits for Alexander to get on. It isn't long before Alexander has his cock buried ball deep in that ?culo caliente? and Brenden is doing his part to make sure that 'Hot ass' is being taken care of. Alexander keeps riding that cock til Brenden decides he wants more control and bends him over the chair. He slides his cock back in that ass for more, starting to pound away at that sweet hole. Alexander can't get enough as Brenden drills his ass as hard as he can. Then they move the fun to the floor as Brenden takes Alexander Missionary. He fucks away at his Latin lover as Alexander begs for more. All this fucking gets them both close as they reconvene on the couch and jack themselves off, shooting their hot loads all over themselves.?Muy Caliente!",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Brenden Cage",
      "person_id": 27967
    }
  ],
  "release_date": "2010-03-18",
  "scene_id": 54024,
  "series": "Cage Match",
  "tags": [],
  "title": "Cage Match, Scene #02"
}