{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back in the house for an explosive episode is Troy Halston. Troy  who has been in our stable of studs for about 5 years is looking better than ever. The bod, the charm, the cock (and even the ?wife?) have all come together into a rather impressive package. Impressed is a good word to describe his costar that has a rather impressive fan following all his own, Mr. Drake Jaden. Inked, muscular and hung hot, Drake has more than shown us he can run with the big boys. He can even take one if need to on our brother site, ExtraBigDicks.com. Always reminding us that big things come in small packages, Drake came through for us today. He was more than happy to take on Troy Halston. They're both from Florida and keep themselves in tip top shape. In the spirit of the recent Olympics, we asked both of these studs if they could have any World class Athletic powers what would they be? Troy immediately said ?Triathlon? (or was it Troy-athlon?). Drake was pondering his options when Gymnastics was suggested. His eyes lit up. He agreed, saying he's already pretty flexible. ?Can you do a split?? Troy asks him. ?When I was younger? he pouts. Troy (being Troy) immediately goes to the floor and right into a full spread eagle split. WTF! Younger? Pffffff?we're off to a grrrrr8 start!The chemistry is apparent as these two get right to it. Drake's looking hot as always as Troy lifts up his tee. We get our first peek at those chiseled, furry abs. They make out as Troy gets Drake's growing cock free. He goes down on that dick and gives it a proper hello. Troy goes to work on Drake's rock hard meat. In no time, he has him gasping as he deep throats his 8?? cock. Drake then slides onto his knees as Troy stands and drops his jeans. ?C'mon boy, suck that cock? Troy orders as he starts to aggressively fuck Drake's face. Drake grabs his smooth nuts and tugs on them while he deep throats Troy's meat. He's getting that dick as hard as he can cuz he knows where that thing ids going next. Drake spits on that dick before going right back down on it. He's driving Troy crazy as he expertly works that dick. Troy then gets Drake bent over the couch as his hot ass is put on display. Troy starts tonguing that tight hole sending Drake into orbit. The tongue starts the session. It is soon joined by a finger or two that are soon getting that tight ass hungry for more than a swabbing...or simple digits.?Come have a seat? Troy teases as he suits up and sits back. Drake turns around and sits down on that rock hard cock. He starts bouncing on that dick while his own cock is rock hard. His thick dick looks like a trampoline as he bounces on that cock. He then holds still while troy fucks up into that horny hole. No matter what Troy orders Drake to do he not only does it but addresses him as ?Sir?. HOT! Drake then gets on all four on the couch as Troy slides his cock in for more. Drake is grunting as Troy continues to pound away at that ass. Drake is loving every minute of it as Troy takes that ass. Troy drives that cock in so deep that Drake groans in pain as he tries to wriggle free. Troy then pulls out of his ass, takes off his rubber and orders Drake to suck his cock. Drake swallows it entirely as he works and sucks that cock only getting it extra hard to go back in for more. Troy then suits up and startsfucking Drake on his back. Troy pounds away at that ass missionary, hitting Drake in all the right spots. Soon Drake is groaning that he's gonna cum which makes Troy fuck him harder. ?Gimme that nut, Boy? he orders as Drake unloads all over his navel. Troy isn't far behind as he sprays his load all over Drake's cum soaked abs and chest.",
  "models": [
    {
      "name": "Troy Halston",
      "person_id": 27796
    },
    {
      "name": "Drake Jaden",
      "person_id": 27955
    }
  ],
  "release_date": "2010-04-08",
  "scene_id": 54036,
  "tags": [],
  "title": "The Facts Of Life, Scene #02"
}