{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have a hot newcomer this week that comes from Orlando, Fl that is sure to make many a man drool. Clay Towers is 34. We're pleased to have this tall, sexy stud with us. We're sure his partner in crime, Chad Brock is even happier than we are. It seems these two met several weeks ago while working together on set. The chemistry was so exciting that Chad decided he needed to have more of this stud's time and so he offered him a place to crash since he was heading out of town and all. Well, Clay took him up on his offer and never left. It seems they pulled a ?U-Haul? and are happily living together (like lesbians). Now this isn't the first time the 41year-old hopeless romantic from Los Angeles has jumped right into the fire. Last August Chad was introduced to our members via his recent then live-in lover and MenOver30 alum, sexy Kain Warn. They also had met on-set and subsequently shacked up. Hmmm. Some guys have all the luck. Well it looks like these two who are still giddy around each other have been living together for about 6 weeks. We wish them the best. This afternoon we'll get to see just what these two do behind closed doors. The only difference being that we'll have front row seats.They begin to kiss softly as they do what comes naturally to them. Chad helps Clay out of his shirt before losing his as they continue to make out. Their pants are next as they tease each other. Clay stands as Chad unzips his jeans and starts to stroke and tease his cock still growing in his briefs. Chad pulls down Clay's briefs and goes to work on that thick cock. Clay gasps as his beau begins to work on his bone. Clay then wants to return the favor. He gets on his knees in order to do things properly. Chad just lies back as he watches Clay swallow every inch of his cock to the hilt. Clay licks and teases Chad as he looks up at him while running his tongue all along the length of Chad's spit-shined meat. Clay then takes his turn on the couch and lets Chad do the sucking for a while. Chad goes to work on his cock while Clay tells him just how good it feels and groans his approval. Chad must be doing something right since Clay has a permanent grin on that sexy face the whole time he's watching Chad go up and down on his thick dick. But wait?there's more. Chad then bends Clay over and gets his tongue deep inside that hot ass he has dibs on. He eats Clay's ass while working his dick and balls as well.Once Chad's had his fill of that tasty ass of Clay's, Clay sits back and suits up. He gives Chad a look that says it all as he puts his rubber on. Chad turns around as Clay lubes his ass. He helps his man sit down on his throbbing bone. Chad impales himself on that thick dick til his ass is wrapped around Clay's meat. Clay starts to fuck his ass as he slowly gives it to him. Clay then wants a bit more control as he slides off the chair and fucks Chad doggie style. Chad strokes his own bone while giving his ass up to Clay. Clay is rock hard. He can't get enough of Chad's hole. Clay then switches it up after fucking Chad on all four and puts him on his back. He lifts Chad's legs up and slides his cock back in for more. Clay starts fucking that ass faster and deeper as Chad starts to piston his dick in time to the fucking he's getting. These two won't last long at this rate. Soon enough, all that good dick makes Chad explode. Clay isn't far behind as he pulls out and unloads rope after rope of thick cum all over Chad's cum soaked frame. Whew.",
  "models": [
    {
      "name": "Chad Brock",
      "person_id": 27925
    },
    {
      "name": "Clay Towers",
      "person_id": 27968
    }
  ],
  "release_date": "2010-04-01",
  "scene_id": 54033,
  "series": "CockBuster Night",
  "tags": [],
  "title": "CockBuster Night, Scene #01"
}