{
  "collections": [
    "Men Over 30"
  ],
  "description": "The return of Iron Man! Yes, he's back?again. For those of you unfamiliar with Iron Man, he dropped his boxing shorts to show us what he is packing in those shorts of his last fall and we've had so many responses to his shoots that we're bringing him back yet again. Iron man is back and looking better than ever. At 36 he's still working at the gym as a personal trainer and when he's not working or working out, he loves to go to the movies, the beach, the clubs and nice restaurants. He likes to try new things and is open to new experiences. We asked him if there was any experience he could relive what would it be. He thought about it for a few before admitting there was this 3-way he had when he was 21. 'One in the pink, one in the st?well, you know the rest. He's getting more and more defined and admits that the new changes get him a lot more attention. Sometimes after a workout while in the showers he notices he gets checked out a lot. 'Sometimes it's exciting; sometimes it's flattering and other times it bothers me ...depending on who's looking.' Well, you can't blame a guy for trying to get some of that. Fortunately all you have to do is sit back and watch all you want. Lucky bastards!Iron man starts setting up the set for his shoot as he sets up the camera and the tripod. He starts to ham for the camera waiting for the guys to show up and decides he's gonna do his own private video while we watch. He pulls off his tee and starts to flex his strong biceps and chest. He drops and starts doing push ups which make his arms and pecs bulge. He then gets up and flexes his pecs individually (show off!) lol. He's definitely looking good. He undoes his pants and once in his briefs he lies back on the couch to get the party started. His cock is already semi-hard and sticking out of his briefs. He starts to work on it as he pulls and strokes on his cock which is slowly coming to life. He pulls his briefs to one side and starts jacking his dick. As he jacks off we get a better appreciation for his form and physique. His pecs are solid and those guns get bigger every time we see him. Iron Man then stands up and drops his underwear to get better access to that thick dick. He strokes that meat and the camera gives us a shot from below that really showcases his smooth anatomy.He then gets on his knees facing the couch and bends over the couch. He caresses that muscular ass and shows us that hot ass he has no plans of giving up. He spreads those cheeks apart and makes sure we get an eye full. His ass is firm and tight. We're sure many would wanna bounce more than a quarter off that thing. Iron man then sits back in the chair and gets back to stroking his thick latin cock. He's rock hard and his cock is aching for release. He licks his fingertip before teasing his knob as he works that dick. He then takes the show back to the couch where it all started and starts jacking that dick for all it's worth, He's been teasing that dick and working up a thick batch that will soon be sent splattering all over his fine self. He's totally focused as his fist becomes a blur. His pecs and biceps tense up as he nears his climax. His balls pull up tight around the base of his sweet cock and quietly without much ado, he shoots. His cock unloads a healthy, heaping batch of protein that now coats his cock and balls. Iron man grins and loves the scene he just master minded. ...and so do we.",
  "models": [
    {
      "name": "Ironman",
      "person_id": 27926
    }
  ],
  "release_date": "2010-03-25",
  "scene_id": 54031,
  "tags": [],
  "title": "Ironman Cam, Scene #01"
}