{
  "collections": [
    "Men Over 30"
  ],
  "description": "We can never get enough 'Wyson'. Brenn Wyson is back with us on MenOver30, giving yet another eager buddy the signature Wyson pounding. Brenn is one of a kind. He brings 'it' like only Brenn can. With an accent that screams New England, he's decided he's from Mississippi this afternoon. A far cry from Jamaica but at least he keeps us on our toes. That's also something that can be said about the boys that end up on the other end of that dick of his. This afternoon, it will be 29 year old Steven Ponce. Steven can definitely hold his own with the big boys. This spicy slice of ginger is looking better than ever. We asked these two studs if they could be Kings of any country which country would you want to be crowned King of? Brenn laughs as he answers Miami Beach. If you've ever been to South Florida and have experienced the unique salad bowl of cultures here, we're sure you'd agree at times this does feel like a separate country. Steven rolls his eyes before answering Finland as his choice. 'You never hear about them on the news; so if there's a war anywhere you know you'd be safe in Finland.' Well, Steven's about to have his borders invaded so he better start worrying about his 'ass'-ets a lot closer to home.They start kissing as Brenn starts rubbing his cock as it stiffens in his jeans. Steven's hands begin to roam as he pulls off Brenn's tee before getting stripped down himself. These two aren't wasting any time. Once their clothes come off, they go to work on each other. Brenn is in the mood for some Puerto Rican cuisine as he savors every inch of Steven's rock hard cock. Brenn spit-shines and gets Steven rock hard before standing up so that Steven can return the favor. Brenn holds his head as he starts to fuck his throat. He knows what he likes on his cock, and he's gonna get it. Steven keeps working on Brenn's massive meat as best he can as Brenn starts trying to get a better idea of what's in store. He paws at Steven's smooth ass as he fingers and tries to explore as best he can with Steven still latched on to his throbbing cock. Steven knows just what to do to reign in Brenn's focus as he starts to throat fuck himself with Brenn's cock. Brenn lies back in awe as he watches the hot Hispanic tongue fest he's receiving. Don't try this at home folks?Steven's an oral professional! Brenn then decides he wants some more of Steven as Steven gladly returns the favor fucking Brenn's throat and giving him some of the same.Brenn kneels before Steven as Steven orders him to suck his cock and balls. Soon, Brenn's tongue is exploring more than his pole. Brenn then gets back on the couch as Steven goes back to work on his stiff dick. Once its rock hard, Brenn suits up and has Steven straddle him. Steven's ass gives way as Brenn's cock starts fucking away. Steven gyrates his hips as his hot ass drives Brenn wild. Steven grips Brenn's pecs as he bounces on that cock fucking himself as he rides Brenn's cock like a seasoned jockey in the final stretch. Brenn then stands him up and fucks him some more. He grabs on to Steven as he starts to batter that thick dick back in that ass. Steven's hungry hole is taking a pounding, and he's nowhere near done. Brenn holds his ass open as his balls slap away faster and harder inside that tight ass. Steven then goes to the floor as his legs go up and around Brenn's muscular waist. Missionary is closing up this fuck fest as Brenn fucks the hell out of Steven. They are both moaning as they get caught up in the moment. 'Shoot that dick' Brenn orders as he fucks Steven faster and deeper. Sure enough Steven explodes all over himself hitting his abs, chest and face. Brenn pulls out and blasts an enormous load all over Steven's cum-soaked bod. Damn, boys!",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Steven Ponce",
      "person_id": 27969
    }
  ],
  "release_date": "2010-04-15",
  "scene_id": 54037,
  "tags": [],
  "title": "Brenn Pounces Ponce, Scene #01"
}