{
  "collections": [
    "Men Over 30"
  ],
  "description": "Visions of Moorish turrets, sand dunes and swarthy manliness come to mind when you first lay eyes on this week's exotic delicacy, Alex Slater. Alex has those dark bedroom eyes with a furry chest to boot. This sexy stud is 30 years old and originally from Queens, New York. His background is French Lebanese which is what gives him that sexy, Mediterranean charm. He's into the beach and loves all kinds of water sports (get your minds out of the gutter). He also loves to be adventurous. ?I've always wanted to jump off the side of a building? he grins with those sexy full lips. He first had sex at 16 with his best friend. She bet him his cock was bigger than her boyfriends. She ended up getting his cock and poor Alex walked away thinking ?he? won the bet?sucker! It's all good with Alex, who has a major sex drive. He needs to get that cock off constantly or he can't sleep. He's even had to jack one off in the stock room where he works. This is Alex's second scene on camera and we have a feeling he'll be back sooner than later. His fantasy scene partner would be Matthew Rush. Hmmm. I think we just might be able to make that happen. We're good like that.nAlex starts off on the couch in jeans and a tee. He licks those luscious lips as his hands start to roam over his muscled frame. He lifts his arm up and shows off his hairy pits. He teases his nips as he continues to feel his naturally sun kissed frame. He drops his jeans and we get even more fur as his hairy thighs come into view. He sits back down and starts to tease his cock through his sexy briefs. His cock is growing by the second and it isn't long before he's poppin a tent in them there briefs. He doesn't keep it waiting as he strips off those briefs and starts working that thick cock. He jacks that dick quickly as he lifts his other arm behind his head. Once there, he indulges himself as his tongue starts to taste as much of his furry pit as he can. HOT! Alex's cock is throbbing by now and Alex is jacking it as he spit lubes his boner. His balls are a naturally smooth oasis surrounded by nothing but sexy body hair. Alex then decides to give us a view of the rest of his sexy self. He kneels on the couch and leans forward as he shows off that hairy ass.That hairy hole is winking at you as he strokes that cock underhanded taking his time so that you get a good view at that muscular ass you'd rather be inside of. He then starts to tease that hole which makes his cock that much harder. He rubs and teases that sweet ass as he continues tugging on his pole. Alex then lies back on the couch and goes to work on that sexy cock and gives it the attention it deserves. He knows that cock of his wants more than just a tug or two so he starts working that meat to get that sweet load out. His sexy lips part as he loses himself in rapture. His hand finds that sweet ass of his as he starts finger fucking that hole and wacks that cock faster and faster. He moans and groans as he gets himself closer and closer to climax with every thrust of his finger and every stroke of his fist. Soon enough you know Alex won't be able to hold back for long as his body starts to tense and react to his own touch. ?Aww, I'm getting close? he mutters under his breath a few seconds before he starts to cum. His cock throbs as it unloads sending his sweet cream all over his furry abs and navel. Now we need to clean this hot boy up?any takers?",
  "models": [
    {
      "name": "Alex Slater",
      "person_id": 27970
    }
  ],
  "release_date": "2010-04-22",
  "scene_id": 54039,
  "tags": [],
  "title": "Arabian Nights, Scene #01"
}