{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back for our fourth personal training session is MenOver30's very own IronMan. For those of you unfamiliar with this delicious Latin trainer, IronMan is 36 years old and a Miami native. This week, we see Iron Man with a little more than usual. It seems he's decided to stop shaving, so we finally see some of his chest hair come into view. We couldn't be happier here at MenOver30, since we always appreciate a man au natural. To say that Iron Man has been gracious with his newfound celebrity would be an understatement. He does seem un-phased by the fact that he has so many men admiring his impressive form and fantasizing about his str8 cock and beefy ass.  He admits he does get hit on a lot at the gym; but he keeps it professional since he's usually there training a client. Once he gets out of the gym, he can take care of that itch to get off he gets from pumping iron. IronMan admits he loves to fantasize about orgies.  If he could have his way, that would be at least a 12 person party. We might need to talk this trainer into having a female-free orgy for two and see if we can't introduce this open-minded stud to what's going on at the other end of the buffet table.We open with IronMan reading his reviews and comments from you our readers.  He is flattered by some and disagrees with others. The ones he finds confusing are the ones that say he'd look that much hotter if he didn't trim. Well, he showed us! IronMan stands up in a valiant show of rebellion and pulls off his tank. As soon as the tank comes off we see the beginning of his hairy chest emerging as he starts to grope his untrimmed chest. His pecs are massive. As he takes his trimmer to his defined frame, he slowly ?air-trims? over his body, pubes and underarms. He then grins and holds up the trimmer and grabs a pair of scissors and cuts the chord. Good thing we'd disconnected the damn thing?or this would've been a very different shoot. He then plays with his pubes.  As he stares into the cam, he coyly asks, ?Is this what you want?? He then gets on his body glider and hauls out his cock. He lies back and strokes his growing meat, and is throbbing in no time.  After getting his cock rock hard, he gets up, drops the jock strap, and continues to stroke that meat, giving us a better view of it.He slaps his thick dick in the palm of his hands before lubing it up and sitting back to enjoy a proper wank. As he strokes, we get to see all the dedication he's put into that defined frame of his. We have to admit he gets better and better every time we see him. He jacks off, sitting back, then gets up and kneels partly on the couch as he continues to work up his daily batch of ?leche?. Milk does a body good. IronMan then goes back to the glide Master and lies face down so we can get a better view of that hot ass he's not willing to give up?yet.  He pulls his beefy cheeks apart and shows off his tight ass. He kneads his beefy cheeks, making sure to give you plenty of time to admire his delicious frame. Then he gets back to business and starts jacking that cock off. He sits back and strokes that delicious dick.  As a final act of symbolic protest, he gets up and walks over to where the now defunct trimmer lies. He jacks his load off all over his useless trimmer. Guess that's the last we'll see of his trimmer. Maybe next time we see this hot stud, he'll be covered in his natural fur? Stick around; stranger things have happened here on MenOver30. It's what keeps you guys coming back!",
  "models": [
    {
      "name": "Ironman",
      "person_id": 27926
    }
  ],
  "release_date": "2010-05-20",
  "scene_id": 54041,
  "tags": [],
  "title": "Clip This, Scene #01"
}