{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have a new face for our members this week that will be sure to please those of our members who appreciate a tall, furry drink of water. Hailing from right here in the Magic City, 22 year old Brent Biscayne is with us to show us what Miami flavor is all about. Taller than the average bear, Brent measures in at 6'6. We're sure 32 year old Chicago native Eddie Kordova will be more than pleased to take on this much Miami Real estate. Fortunately for Eddie, Brent's height/weight/length proportionate. It's been a while since we've seen Eddie, and we've noticed a few changes. Eddie's gotten more definition and a LOT more ink. He now has a tribal tattoo that covers most of his left pec, shoulder, and arm. He says he's nowhere near done with it. We look forward to seeing the end result. Brent told us that he knew he was into boys as early as 9 years of age. The porn thing is more recent, but we're all glad he's here. When we asked Eddie when he knew the adult industry was for him, he attributed it to his friends. ?It had a lot to do with my friends who kept pushing me to do it because I have the body and the looks and the talent...so I decided to do it.? Well damn! J-Lo better watch out. We seem to have another triple threat on the horizon. The scene starts with Brent, who is getting better acquainted with himself as he strips down and starts to pleasure himself. Brent is sexy as hell, with one hell of a happy trail that leads from a thick patch on his chest all the way down to his thick 8?? cock. As he's groping his cock in his pants, Eddie comes out of the bathroom and catches him watching porn. Eddie gets turned on and starts to stroke his cock. Brent sees him and invites him over. He takes Eddie's cock in his mouth and starts to suck on his boner. Brent licks and sucks on his cock while Eddie holds his head and helps bob it on his meat. Brent can't get enough as he deep throats that dick. Soon, Eddie's curiosity lands him on his knees between Brent's legs. As his jeans come off, his hard cock comes to view, but not for long. Eddie goes to work as he starts to nurse on Brent's extra thick cock. Brent lies back and watches as Eddie engulfs his meat to the hilt, savoring every delicious inch he has to offer, Eddie tastes every inch of his cock and works his smooth balls as well. From there, they maneuver into a steamy 69 on the floor, giving each a chance to get more of that dick they want. Brent then decides he's done with the formalities as he gets Eddie on all fours. He plays with that smooth ass a bit, fingering it before getting in position behind it. He flips Eddie over onto his back and starts to push that thick dick inside. Eddie's ass gives it up as Brent slides deep inside and starts to fuck him missionary. Eddie is rock hard as Brent pounds away at that ass. Brent then gets Eddie in a hot doggy as he continues to take that ass. Eddie can only moan and groan as Brent lays cable all up in that ass. He can't get enough as he sinks in and out of that ass. After railing that ass deep, Brent takes the fun back to the couch where he sits back and watches as Eddie rides him reverse cowgirl. He holds Eddie's legs up in the air as he pumps that dick up into his hungry ass. Eddie's in sensory overload as he jacks his cock while getting that ass stuffed. He won't last much longer as he bounces on that think Miami meat. As they get close, they end up jacking their loads all over Eddie, who's more than happy to be receiving the extra creamy milk bath package.",
  "models": [
    {
      "name": "Eddie Kordova",
      "person_id": 27964
    },
    {
      "name": "Brent Biscayne",
      "person_id": 27975
    }
  ],
  "release_date": "2010-05-13",
  "scene_id": 54049,
  "tags": [],
  "title": "The Courtship of Eddie's Culo, Scene #01"
}