{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back this week to have his fantasy fulfilled is Alex Slater. Last week, Alex made his debut on MenOver30. This recent addition to the MenOver30 fold made such an impression with is sexy French-Lebanese mix that we just had to have him back. For those of you who missed Alex he told us that his fantasy scene partner would be Matthew Rush. So Matthew who made his first webisode with us, was more than happy to help us out. Though Alex is just starting out in this industry and is excited to unknown adventures, Matthew admits he's on the opposite end of the adult spectrum and looking forward to doing other things sooner than later. ?The Gay running video personality retirement home? is his response as to what's next. Well, we're sure there are still many fans with hopes to the contrary. Both of these guys are horny and both admit to jackin off frequently. Alex likes jackin off to porn though he likes to stray to the less vanilla and gets his exotic rocks off to more kinky videos. Matthew doesn't remember the last time he jacked off to porn. ?It's hard for me to jack off to porn since I know most everyone in them?. Yeah, we can see where that might be a problem. nThey break the ice by kissing on the couch as they start exploring each other. Their shirts come off, followed by their shorts. Soon, they are standing in their briefs. Both briefs are poppin' tents. Alex doesn't wait for long before getting on his knees to taste his fantasy lover. He engulfs Matthew's cock as Matthew grunts and orders him to suck his cock. ?Awww fuck yeah? he groans, as he forcefully bobs Alex' head on his rock hard cock. Alex is stroking his own boner as he services Matthew's. He stands to kiss Matthew some more before Matthew goes down to taste some exotic wood for himself. Matthew greedily devours that cock to the hilt. Alex couldn't be happier. ?Suck my fuckin' dick!? he moans, as he watches Matthew swallow that cock to the hilt. Matthew takes it like a champ as Alex returns the favor and fucks his face. Alex then wants some of that ass he's been fantasizing about, so he goes to work on it and uses his tongue to drive Matt crazy. Matt moans and groans as Alex eats that beefy ass out. Alex licks and fingers that hole as Matt whimpers and groans for more.?Spit in my hole? Matt grunts, while Alex works his hole with that tongue. Matthew is going crazy as he gets that hole rimmed. Alex then goes back to sucking on Matthew's cock as Matthew watches his cock get worked. Matt's rock hard as Alex continues to suck and nurse on his fat cock. Then they switch while Alex lies back and spreads his furry legs. Matthew kneels between them again and goes back to working that hot cock again. Alex has exactly what he wants - Matt Rush suckin his thick cock - and it can't get any better than this. Matthew works that cock, licking his shaft and working his smooth balls. It won't be long before these two are ready to blow with all the cock sucking going on. Matthew is the first to nut, with an impressive grunting display which culminates in a thick batch of wad all over his smooth navel. Alex follows suit as his thick load jets out and lands on his furry abs, where it mats in several creamy streaks. These two guys are so done?and so is our work here. Alex Slater, your wish was our command.",
  "models": [
    {
      "name": "Matthew Rush",
      "person_id": 27951
    },
    {
      "name": "Alex Slater",
      "person_id": 27970
    }
  ],
  "release_date": "2010-04-29",
  "scene_id": 54044,
  "series": "Fantasy Guyland",
  "tags": [],
  "title": "Fantasy Guyland, Scene #02"
}