{
  "collections": [
    "Men Over 30"
  ],
  "description": "Dave Stone is a strapping, furry mountain of muscle brimming with confidence, dripping in testosterone, and radiating just the kind of palpable virility that would make even twink lovers ready to make room for daddy. Though this slab of beefcake is downright smoldering hot at any age, the fact that he is forty-five makes him all the more remarkable - and just the kind of man we love at MenOver30.com. ?I am more popular now than I was 20 years ago,? Dave tells us. ?I wish there was two of me so I could keep up with the demand? he went on to say. With a seemingly endless supply of everything sexy on a man and a shirt that looks like it is going to shred trying to cover the expansive muscular terrain underneath, Dave cannot wait to get comfortable, which to him means getting naked. As for us, well, we cannot wait to ?get Stoned? and bring you all along for the ride.Dave Stone's arms are the size of footballs, covered in ink, and soon covered with his tongue as he licks them while flexing them for us. Lifting his shirt, we see the ink continues on his sides as a blanket of hair pokes out the collar and fans out across those massive pumped pecs. As he twists his nips, they swell to the size of pencil erasers as the lump in his pants responds with a swelling of its own. The fly of his jeans unsnaps from the sheer pressure of that growing cock, causing his pants to fall low on his impossibly narrow hips. Taking the waistband of his shorts along for the ride, Dave exposes the top of his shaft and the triangle of dark, thick bush. With his jeans at his ankles and his briefs packed to capacity, Dave finally liberates that slab of beef, exposing exactly what you need on a man like this, but do not often get: his cock is just as thick, just as hairy and just as meaty as the man who commands it.He takes a seat on the chair, the cushion and back completely disappearing behind the sheer outline of his body, pulls one huge arm back behind his head, and fists that mouth-watering cock with the other. Moving to the bed, he allows the camera to take a long, slow, loving pass from head to toe before rolling over and sharing the glory of a set of glutes that look like fur-covered marble mounds of pure thrusting machinery. As he continues to flex, the veins in his arms mirror the veins in his cock: they pop out like a road map leading to the ultimate destination: those twin pots of white gold in a shaved smooth sack. Like the mating call of the horniest bear in the forest, a steady chorus of low, deep moans escapes from his whiskered mouth as a thick load escapes from his meaty shaft.",
  "models": [
    {
      "name": "Dave Stone",
      "person_id": 27936
    }
  ],
  "release_date": "2007-09-06",
  "scene_id": 54048,
  "series": "Dawg Days",
  "tags": [],
  "title": "Dawg Days, Scene #02"
}