{
  "collections": [
    "Men Over 30"
  ],
  "description": "There are few things sexier than a tall, laid back stud with a Southern drawl. That having been said, we are excited to have Brandon Lewis back this week. Brandon is 26 years old. This Atlanta native caused quite the uproar when he made his debut on our brother site, ExtraBigDicks. Brandon's a sexy country thing . Heloves spending money on his clothes. Having seen every delicious inch on him?we're all for him not wearing a stitch. He also loves his gadgets. He then flashes us that smile of his that would make any deer awestruck and tells us he loves to spend money on his foiler. 'Fo-iler' (f&#333;-eelah) of course is 'Four wheeler' in Drawl. lol This bi stud beams as he tells us about his latest acquisition, a Polaris 400 which happens to be a kick ass ATV. Speakin of kick ass, we also have a new face that's getting one peachy introduction this afternoon on MenOver30, Mr. Tucker Scott. Tucker is 30 years old and a Florida discovery. He sure didn't mind his scene partner. We're sure he'll have more than Georgia on his mind every time he sits down for a while. Tucker likes to spend his coins traveling. He wants to save up and start his own business. Lucky for Tucker, Brandon is about to bring that hot ass of his plenty of business. ...Shall we? They are sitting on opposite couches when the camera starts to roll. Tucker wastes no time before inviting Brandon over. They start making out as Brandon starts to explore Tucker's defined frame. His tongue traces over his ripped abs and pecs as they continue to strip each other. Tucker starts to grope Brandon's cock as his tongue has a go at the smooth chest and nips. Tucker then gets up and drops his jeans, which affords Brandon the opportunity for a closer look at that growing cock. Brandon quickly moves in and starts to suck on his meat as Tucker coos his approval. Brandon gets Tucker to sit back so he can really work that cock as he bobs his head on it. Brandon's rock hard by now. Tucker is more than willing to help him out with that as he hauls out his fat cock. Brandon's cock is rock hard. His large hairless balls are proudly waiting for the attention they deserve. ?Fuck yeah, suck that dick? Brandon moans, as Tucker swallows as much of his thick cock as he can. Tucker loses himself in the moment as he worships the thick cock Brandon will soon be burying in him. Brandon holds Tucker's head as he shoves his dick deeper down his throat. He's only just begun... Brandon sits back and strokes his throbbing cock as Tucker teases him by showing off his hot hole. Brandon moves in for a closer inspection as he starts to finger that hungry hole. He teases that ass with his finger, then suits up and slowly pushes his meat inside. ?Take that big dick? he whispers under his breath, as he slides all the way in. Brandon then starts to fuck Tucker deep and hard, slapping him with his leather belt. Tucker loves it as Brandon pounds his hole and gives him the dicking he's been needing.  Brandon's cock is plowing away at that hot ass that is more than accommodating. The harder he pounds, the more Tucker begs for it. The chemistry between these two is insane as they fuck away like mad men. Brandon then puts Tucker on his back before slamming that beautiful cock back in for more. Tucker grunts and groans as he does his best to take every deep thrust he's given. Braondon is just pummeling away at that ass. The sound of his balls slappin' that ass fill the room. Brandon then sits back and has Tucker ride him as Tucker impales himself on it and rides that cock like he's in the final stretch of the Kentucky Derby. Brandon's thick cock hits him just right. Soon, he explodes all over himself still sitting on Brandon's cock. Brandon then beats his own load out all over his sexy navel.",
  "models": [
    {
      "name": "Brandon Lewis",
      "person_id": 27916
    },
    {
      "name": "Tucker Scott",
      "person_id": 27974
    }
  ],
  "release_date": "2010-05-06",
  "scene_id": 54045,
  "tags": [],
  "title": "The Belt Way, Scene #01"
}