{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brenn Wyson is back for more ass pounding action this week.  Our neighbors have all been warned. Brenn is back to put that signature ass fucking to use, while trying not to set off any Seismometers in the area. For those of you who aren't familiar with the character that is Brenn, Brenn is originally from Boston and is 38 years young. Today Brenn is very pleased with the costar we lined up for him. Originally from Orlando, 27 year old David Scott makes his debut.  Brenn just wants to take him home and keep him all to himself. Well, that won't work for us; we'd definitely want to have David back for more. The chemistry between these two was magic from the go. They can't agree on their favorite food, Brenn loves Italian while David's not picky but is into sushi these days. If they were to open a restaurant David would want to make it a fusion bistro while Brenn's convinced it would just be 'confusion' bistro for him. David got into porn while staying at a friends place that had rented out his house for a shoot. David assumed it was for commercial work...he was wrong.  That led to contacts that later landed him in front of the camera. Brenn was actually approached to do porn.  Once he did it the first time, he was hooked. We're just glad they found their way in front of ours.Kissing is the first on the list as these two get better acquainted. As their clothes come off, their hands are free to roam as they grope their mutual boners through their jeans. These two are working themselves up for one hell of an afternoon. Brenn stands David up as he undoes his jeans and frees David's cock. Brenn wastes little time before sucking on that cock. David just gasps as he sits back and watches the sexy boxer go to work on his meat. Brenn bobs his head up and down on his new buddy's meat. Soon Brenn needs some attention of his own. ?Suck my dick? he orders as he hauls out his own bone. David starts to taste that cock.  He does his best to deep throat that throbbing cock. He makes sure to take care of Brenn's nuts as he sucks them into his hot mouth one by one. Brenn is enjoying the attention as he starts to fuck the native newbie. David looks up at Brenn with puppy eyes as he shows his appreciation for the cock he's about to receive.Brenn then gets David bent over so he can prep that ass. He buries his tongue deep inside David's ass. David squirms as he gets that ass rimmed. Once his ass is spit-shined and ready to fuck, Brenn moves into position. Brenn sits back and watches as David slides that rock hard cock inside. David slowly impales himself as he slides down on that hard cock til Brenn's balls meat his ass. After he rides it for a bit, he gets bent over as Brenn starts to give him a proper fucking. Brenn means business as he fucks David silly. The sound of Brenn's balls slapping away fill the room as David does his best to accommodate the fucking he's getting. Brenn pounds David hard and deep while David bravely asks for more. He begs for more cock and he begs to get it harder. Music to Brenn's ears, as he is more than happy to plow away at that ass in every imaginable position. He gets David on his back on the couch and pile drives his ass harder and harder as David whimpers and grunts his appreciation. This position sends them both over the edge as Brenn pulls out and unloads a massive milk bath all over David. Coated in cum, David follows suit and adds his own batch to the mix.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "David Scott",
      "person_id": 27976
    }
  ],
  "release_date": "2010-06-03",
  "scene_id": 54053,
  "series": "Great Scott!",
  "tags": [],
  "title": "Great Scott!, Scene #01"
}