{
  "collections": [
    "Men Over 30"
  ],
  "description": "Alex Slater made quite the impression when he made his debut here this April. Those bedroom eyes & French Lebanese features had many of our members begging us for more of this exotic looking New Yorker so we decided to bring back the newly inducted member of the MenOver30 club. New on this site, Ricky Martinez, is one of Chicago's finest. Tall, dark and handsome, Ricky will be Slater's playmate this afternoon. We asked these two given the option, if money was no object, where would they spend their vacation? Ricky definitely wants to go to the Caribbean and explore something more tropical. Alex has his sights set on Espa?a. Spain is definitely a lot of fun. Given the option to do their 20s over what would they do differently? Alex would've gotten into porn sooner while 33 year old Ricky admits he would probably have made better decisions in a few relationships he had over the past decade. We wondered how these two got into porn.  It turns out Alex heard about it through the grapevine and started asking around, met a few people and ...Voila! Ricky did cam work for a while and he had several customers that egged him on to just get into porn. Eventually, he took his admirers' advice.  We should all thank our lucky Midwestern stars.They start making out as they slowly begin to explore each other. Their tongues and lips get better acquainted as their clothes begin to find their way onto the floor. Alex then stands up as Ricky pulls down his jeans. As Ricky pulls them down; Alex's boner pops up inches from his face. Ricky can't resist the temptation as he goes down on that juicy cock. ?You suck some good dick? Alex grins as he watches Ricky swallow his cock deep. After getting that cock worked, it's Alex's turn as Ricky sits back and gives Alex a chance to get a better view of his meat. Alex goes down on Ricky's cock and starts to suck on his growing meat. It's short lived as Ricky slowly gets Alex back on the couch so he can continue sucking that cock of his.  Alex lets him have his fun but eventually he wants to taste that sweet ass he's about to plow. He bends over Ricky and starts getting to know that spectacular ass. Ricky is in heaven as Alex uses a combination of stimulants to get our horny boy ready for cock. Alex alternates between his expert tongue and fingers making Ricky even hornier for the fucking he's about to get.?Come sit on my dick? Alex orders, as Ricky backs up and sits down on Alex's bone. Alex is buried deep in that tight ass as he starts slamming that cock up into Ricky who just moans while he begs for more. Ricky rides that cock hard driving Alex crazy. Alex then gets Ricky up off his cock before bending him over into a hot doggy position. He slides his throbbing cock back inside Ricky's tight ass that is milking his cock. He fucks Ricky hard as he orders him to take that dick. He is preaching to a very willing choir. From h ere Alex puts Ricky on his side before sliding that cock back inside that hole. Ricky has one leg up as Alex fucks him silly. He pounds him hard and deep as they make out and get each other closer and closer to a growing climax. Alex is slamming that dick as deep inside that ass as he can.  Ricky is loving every inch of it. At the pace these two are going it won't be long before their balls explode. Once they get that familiar tickle in their cum-filled balls they dismount, sit back and jack themselves off. One by one they shoot their thick loads all over themselves. Whew.",
  "models": [
    {
      "name": "Ricky Martinez",
      "person_id": 27780
    },
    {
      "name": "Alex Slater",
      "person_id": 27970
    }
  ],
  "release_date": "2010-05-27",
  "scene_id": 54052,
  "series": "La Vida Loca",
  "tags": [],
  "title": "La Vida Loca, Scene #02"
}