{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week, we have a fresh face that comes to us from Orlando, FL, Mr. Jakob Pierce. Jakob is 33 years old.  This afternoon, he's here to meet his porn idol. Well, it would be more appropriate to say his porn idol is here to meat him. Fan-favorite and always a welcome sight, Matthew Rush joins us this week. Matthew is in his ?later thirties? and holding...and holding. lol. Matthew is originally from Pennsylvania; but now calls Ft. Lauderdale home. We asked these two if they were to open a business what would it be. Matthew wants to open a funeral home because that is guaranteed job security. Matthew is always a hard act to follow so after that response, Jakob takes the high road and goes conventional with a Dance Studio. We then asked these two what is the one thing that really gets them going. We asked Jakob first (just in case) and he confessed he loves guys that are touchy feely and like to kiss and caress all over, which gets him really horny for more. Matthew takes the classic response and chalks it up to being in his kiss. Kissing is that most intimate thing that really gets his blood pumping. Yeah, a bad kisser is definitely hard thing to recover from. Well, with two guys that both get into kissing and passionate detail we're in for a treat.Jakob is on the phone when he happens upon Matthew Rush. He quickly hangs up as he stammers to talk to his porn idol. One thing leads to another, and flattery leads to fondling. Boy meets boy, boy fondles boy...you get the picture. They start to make out as their clothes come off. Jakob wastes little time before hauling out Matthew's hard cock and going to work on it. He engulfs it as Matthew groans his approval. Sometimes it's good to give your biggest fans a taste test.  Jakob can't get enough of Matt's thick cock as he spit shines that dick. Matthew then gets on his knees and helps Jakob out of his jeans before giving him some head in return. Jakob is elated as he watches his idol suck his rock hard cock. Fantasy made reality as he slowly fucks Matthew's face. Jakob soon wants more of that dick he's been stroking to.  He gets back on his knees so he can continue nursing on that thick cock.  Matthew watches as Jakob services his dick looking up at him with those pretty eyes knowing he'll stop at nothing to get that cock of his where he wants it. Don't play coy, you know where he wants it. (u so silly) Matthew then lies back and has Jakob squat on the couch so that Matthew can eat that smooth ass out. This launches Jakob into overdrive as Matt's tongue gets him ripe for a dicking.                                         Matthew then suits up, sits back, and watches as his number one fan sit down on his fat cock. Jakob grunts as his ass gives in and opens up. Jakob soon has that cock deep in his ass and starts to ride it. He braces his feet on Matt's massive quads as he bounces himself up and down on that hard cock. Matt loves that tight ass wrapped around his cock, and moans as Jakob has his way with it. Matt then bends Jakob over and continues fucking that hot ass doggy style. Jakob backs that ass up for more as Matthew fucks away. Jakob grunts as Matthew buries his cock deeper and deeper. Careful what you wish for, Mr. Pierce...cuz you just might take it all. Caught up in the moment as Matt fucks him, Jakob begs Matt to fuck him on the floor. They segway to a hot missionary position which only lets Matthew bury that cock even deeper. Jakob is grunting and moaning like a bitch as Matt pounds that ass stretcher deep inside. As the cam moves behind the action we get an awesome view of Matthew's beefy ass as he continues to bury that dick inside Jakob's ass. Jakob is taking a pounding.  Soon, they dismount to explode their loads all over themselves. Whew. Fuck Fantasy #12,384 ?Fulfilled. ...NEXT!",
  "models": [
    {
      "name": "Matthew Rush",
      "person_id": 27951
    },
    {
      "name": "Jakob Pierce",
      "person_id": 27977
    }
  ],
  "release_date": "2010-06-10",
  "scene_id": 54056,
  "tags": [],
  "title": "Star Struck, Scene #02"
}