{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week, we have a blast from the past as we welcome back Jason Talon. Though he may be a blast from the past to us in general, Jason is a new face to MenOver30. Originally from Minnesota, Jason made his debut on CircleJerkBoys a few years ago but is now old enough to join the ranks of the MenOver30 Stable. We're glad to have him back.  He's looking damn good. To his side is yet another Atlanta find, Mr. Billy Bleu. Billy is a smooth, lean slice of hot with ink, an edgy look and a huge cock. We have big plans for these two. We asked these two if they could have 2 dream residences where would those residences be. Jason would stay in Minnesota (?Reeeally!?) and he'd have a second home in Australia. Billy comes up with a more Cosmopolitan answer with a swanky loft in New York City and a second flat in London. 'I love the accent, I love Brits', he confesses. We then asked these two what their sexual acts topped their must have list. Jason chimes in with rimming while Billy loves to have sex in the shower. As for the best knee buckling sexual experience for Jason, it would be out hunting with a bud and being in the middle of nowhere.  Their isolation turned creative and led to a hot back-woods fuck session. Billy was poolside at 3 am when his then boyfriend and he went down to the pool & ended up fucking out in the open. Billy's a ballsy boy; and by ballsy we mean he's a keeper.They don't waste any time as Jason starts to explore Billy's smooth pecs. He licks and sucks at his nips as they continue undressing. Jason strips Billy down to his boxer briefs before sitting back and watching Billy return the favor. Billy slides off Jason's boxers to reveal his thick cock ready for action. Billy sucks on that Minnesota meat like a pro as Jason's cock throbs to his touch. Billy knows just what he's doing as he caresses Jason's smooth nut sack while deep throating his dick. Billy won't have to wait for long to get attention on his thick dick as Jason starts to return the favor. Billy's meat is rock hard and more than ready for attention. As the cam pans over Billy's shoulder we see Jason on his knees doing his best to service Billy's massive meat. 'You like it?' Billy teases. (We're assuming that was a purely rhetorical question) Jason takes his time as he savors that dick. Billy's smooth balls are pulled tight below the base of his cock. The view is impressive as Jason continues to work that cock. Jason then stands up and as they make out they size up, stroking their cocks together.Today Jason is in for a real treat as Billy kneels on the chair and presents Jason with that sweet ass that few get to tap. Jason slowly starts to slide his cock inside as Billy moans. Soon enough, Jason is buried all the way inside that ass. 'You like that cock in my ass?' Billy groans as Jason starts to pick up the pace. Jason's balls slap away at that sweet ass.  When Jason's ready for a new twist, he moves Billy over to the couch where he can continue his delivery Missionary style. He slides his cock back in that hot ass for more as Billy just eggs him on. Billy may be a top most of the time but he definitely knows how to appreciate a good fucking when he gets one. He takes that dickin' like a pro. Jason then gets up and has Billy sit on his dick in a reverse cowgirl position. Billy straddles that meat and eases back down on it for more. He takes that dick all the way inside before riding it like Paul Revere. On a mission and with that thick meat hitting his sweet spot, Billy can't hold it anymore as his thick cock explodes. He shoots his thick load all over the rug as he continues to grind that ass on Jason's cock. Jason then lies back and jacks himself off all over his smooth navel and abs.",
  "models": [
    {
      "name": "Billy Bleu",
      "person_id": 27979
    },
    {
      "name": "Jason Talon",
      "person_id": 27978
    }
  ],
  "release_date": "2010-06-17",
  "scene_id": 54057,
  "series": "Bleu Balled",
  "tags": [],
  "title": "Bleu Balled, Scene #01"
}