{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have an interesting match up today that can only lead to some intense sex as we pair up one of the South's finest men Brandon Lewis up with MenOver30's ultimate 'Man of Intrigue', Mr. Brenn Wyson. These two have quite the fan following.  Brandon, the 26 year old with that Southern charm, amazing smile, and thick ol dick, and Brenn, the 38 year old with that defined bod, larger than life personality and the ability to register tremors on seismometers whenever he pounds ass. It just can't get any better than this. They have a lot in common, both loving music from the 90's and liking to go out and dance too. In recent developments, we are pleased to announce that Brenn has actually explored the art of receiving. ?It's an every now and then hobby but it hurts; but if you're gonna do it, you gotta do it right? Hmmm. Who knows we may just get to see that for ourselves.  Line forms to the left, fellas. Brandon had a huge grin from the time he walked in the door so we figure he's wanted to meet Brenn for a while now so we can't ask for a better scenario for some old fashion fuckin. Shall we...They start play fighting which leads into a groping session, one that involves kissing and cock fondling. We like. Greco Roman wrestling (with a feel up twist). Hands as well as tongues are all over the place. ?Wanna suck my fuckin dick?? Brenn grunts as Brandon goes to his knees. He's soon groping that cock through his jock before taking it into his mouth. Brenn grabs his head and starts to bob his head on his rock hard cock. Brandon keeps up well, as he services that Boston bone. As Brandon sucks his cock, Brenn reaches for his dick wanting to get some too. They play fight some more as Brandon plays keep away from Brenn which leads to more of Brenn's cock in his mouth. The overhead shot of Brandon looking up at Brenn begging for that dick with those submissive puppy eyes is insane. Brenn fucks Brandon's throat til he gags. (mission accomplished) Brenn then goes down on Brandon who is all about an eye for an eye and a gag for a gag. He grabs Brenn's head and dribbles it on his thick cock. Brenn gags soon enough as Brandon orders him back on it. Daddy likes. They then get into a sweet 69 position so they can suck cock to their hearts content. Brenn then bends over and fingers that smooth ass of his. Didn't see this comin' did ya? Brandon gets his fingers in on the action too as he finger fucks that tight ass. That sweet ass puckers for more attention. Brandon is more than happy to oblige. With Brenn already in position, Brandon kneels and slides his thick cock inside. Aren't you glad you crossed your fingers? Brenn moans and groans as he get that ass pounded deep. Brandon gives him every inch as hard as he can making Brenn beg him for more. ?Take that fuckin' dick!? Brandon grunts as he slaps away at that hot ass. Brenn's finally come over to the dark side as he begs for more dick. Music to Brandon's ears as Brandon orders him to sit on his cock. Brenn immediately squats on that country cock and goes to town riding that cock hard. Watching Brenn in a new role is totally mind blowing as he totally gets into having Brandon's cock deep in his ass. He braces himself on Brandon's broad shoulders as he starts to ride Brandon's cock like a jockey on a thoroughbred. DAMN! Brandon then puts him on his back and fucks him missionary. ?Is that all you got, you fuck?? taunts Brenn, as he eggs Brandon to fuck him harder. Brandon pounds his hole as rough as he can which only makes Brenn hornier. Brandon then finds his sweet spot as he fucks Brenn over the edge making him cum a huge load all over his own chest and face. Brandon then pulls out and unloads all over one cum covered, official cock lover.",
  "models": [
    {
      "name": "Brandon Lewis",
      "person_id": 27916
    },
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    }
  ],
  "release_date": "2010-06-24",
  "scene_id": 54059,
  "series": "Hard Times",
  "tags": [],
  "title": "Hard Times, Scene #01"
}