{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back by popular demand, Matthew Rush is with us and he's brought along a friend. Tucker Vaughn is 19 and a newbie in the industry by comparison. He does this and goes to school, so he's juggling the two. He admits he loves being able to do both and meets great people on and off camera. Matthew, on the other hand, has been doing this a while and he's grown throughout his career. He started out a young and lean. Now he's grown up and not only doubled in size but also added some ink. He admits some people prefer his cleaner cut look but it's inevitable that one grows and evolves. Say what they might, at the end of the day Matt's completely comfortable in his skin. That alone is a wonderful thing to be. Tucker has a long career ahead of him so we look forward to seeing a lot more of this smooth hottie with the big smile and that hot ass. He definitely is going to make a great impression on our members so we're sure you'll wanna see more of him in the future here as well as on our brother sites. Let's let these two get better ?acquainted?.They start off reading in the same room when Matt catches Tucker sneaking glances. He calls his bluff and invites him to join him on the couch. Tucker is star struck as he blushes and joins Matt. It isn't long before these two are making out. They quickly undress and Tucker's lips are soon wrapped around Matthew's cock. He jerks and sucks on Matthew's hard cock as he kneels between those massive thighs. This has got to be better than any book Tucker was pretending to read. Tucker can't get enough of that thick cock as he shoves as much as he can of that cock into his throat. Matthew then gets up and has Tucker lie back on the couch so he can return the favor. Tucker lies back as he watches his very favorite porn star suck his cock. Matt takes Tuckers cock all the way to the hilt as he drives Tucker wild. Tucker's cock is throbbing in Matthew's mouth and he's more than ready for anything. Matt then gets Tucker back on his knees so he can fuck his hot mouth some more. Tucker gets back to work sucking that dick and lapping at those smooth balls. Matt holds his head to get that thick dick of his even deeper.Matthew then puts Tucker near the edge of the couch as he spreads those legs wide and starts to eat that smooth ass. Tucker is in heaven as he gets that hot ass primed to fuck. Matthew expertly tongues at that ass launching Tucker into orbit. After eating that ass for a good while, Matt then suits up and starts to slide his fat cock deep into Tucker's hot ass. That ass is more than ready and concedes willingly. Matt is soon fucking Tucker's ass hard as he grunts and groans. Tucker just lies back as Matthew takes his ass deep. Matt then gets Tucker up; turns him around and bends him over for more. With one leg up on the chaise, Tucker holds on as Matt repeatedly slams his cock inside that hungry ass. Tucker doesn't care how he gets that dick so long as he gets it. Matthew has no problem helping out anyway he can. They then take the party over to the chair where Matt sits back and watches as Tucker sits on his cock in a reverse cowgirl position. Once on that meat, Tucker rides that dick like a pogo stick. That hot ass is milking Matt's dick and with this much grinding it won't be long before these two explode. As they get close they sit back side by side and shoot their loads all over themselves.",
  "models": [
    {
      "name": "Matthew Rush",
      "person_id": 27951
    },
    {
      "name": "Tucker Vaughn",
      "person_id": 27982
    }
  ],
  "release_date": "2010-07-08",
  "scene_id": 54063,
  "series": "Oh, Mr.Rush!",
  "tags": [],
  "title": "Oh, Mr.Rush!, Scene #01"
}