{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a special treat for you, Jersey Shore's very own, Rob Romoni. Having grown up in New Jersey, it's great that 40 year old Rob has managed to make many friends coast to coast over the past 8 years working in the adult industry. The industry brought him to the West Coast and he now resides in Los Angeles, CA. Rob says his best attributes are that he's funny and humble; yet admits he has work to do. He's extremely impatient and also is a huge procrastinator. So let's get this str8, he has ZERO patience for some things; but then has all the time in the world to not do other things. Hmmm. Yeah, that's a whole other episode right there. lol We asked Rob if he were to happen upon $1000, what he would do with the money. Rob didn't have to think about that one and said he'd love to travel.  Puerto Rico for the weekend maybe and if money wasn't an option he's always wanted to go to Australia and New Zealand and maybe even Europe. He definitely has a few places to add to his bucket list. We're sure this hot Daddy would be welcome no matter where he ended up.Rob is working late and after all the work's been done he decides to release some stress. He undoes his shirt and tie as we get our first glimpse at his broad chest. He's naturally smooth and his fingers tweak his cinnamon nips as his free hand works his growing crotch. An over the shoulder shot gives us a better view of what he's working with as his defined abs trailing down from his broad chest and shoulders to his growing cock below. He drops his pants and leans up against the desk to keep working his thick dick. His cock is rock hard and finally getting the attention it needs. He pulls his sweaty underwear to his face as he inhales his scent in deep. He's throbbing by now and decides to show off his beefy ass. He puts his knee on the desk and leans forward spreading those cheeks wide as he shows off his back door. His fingers make their way to that hungry hole as he teases his ass a bit. He knows how to show off what he's got and we're not about to ask him to stop anytime soon. Rob hops up onto the desk and spreads those thick thighs apart as he strokes that dick. In this position he has that hot ass at his whim. He teases that ass a bit before slamming his fingers in and out making him even hornier. He slaps his thick cock against his palm as he strokes and tugs on his meat. Rob's body is beefy and defined. He has three tattoos on him, each one symbolizing a different relationship. After the third one didn't work out he decided to stop having them?tattoos, not relationships. Rob sits down in his office chair and props his thick legs up on his desk and shows off more of that meat and ass. He fondles his massive pecs as his nipples seem to be hot-wired to his dick. He strokes that cock over hand and under hand making it throb with every caress and tug he gives it. Rob's balls are pulling up tighter around the base of that cock and it won't be long before he gets the relief he's needed. He lets out a grunt and a moan as his thick cock starts to spew. He unloads all over his smooth navel, leaving him with one cum covered mess to clean up.",
  "models": [
    {
      "name": "Rob Romoni",
      "person_id": 27981
    }
  ],
  "release_date": "2010-07-01",
  "scene_id": 54061,
  "tags": [],
  "title": "Roman Holiday, Scene #01"
}