{
  "collections": [
    "Men Over 30"
  ],
  "description": "?Hoosier Daddy?? a 32 year old hot Daddy from South Bend Indiana,?that's who! This week we have a sexy stud that's gonna leave many of our members chompin' at the bit. Diego Vena makes his debut with us this week. Diego is 32 years old and the naturally smooth slice of Midwestern decadence brought along a special someone. Having met at the Winter Party, right here in Miami, Diego had no idea who his new beau was. Well he may not have known who the adorable 23 year old from Idaho was?but we did. Tory Mason is back and he's showin' off his new beau. Tory usually dates out of the industry and even though he's here with his new boyfriend, they aren't technically ?in? the biz since they only work together. Tory admits he's always had an attraction to older men but it took Diego to make him jump at the chance of getting into the Daddy's club. Diego grins when he confesses that Tory is the type of guy he's always wanted. Ahhh, young love?full of promise, full of hope. These two are adorable together and it's great to see these two have found each other. Now we just gotta get these two naked and see another side of their budding relationship. It's time for the Horizontal Mambo!They start to make out as they do what comes naturally. Their tees come off; and as Tory helps his new beau get those pants off, he's affectionately kissing at his growing bulge. They stand and kiss some more before Diego returns the favor and helps Tory out of his pants as well. Diego kisses at Tory's growing cock for a few before taking it out and giving it a proper hello. Tory moans as he gets that thick cock sucked. Diego worships that dick as he runs his tongue along the shaft and balls before going right back down on it. Tory then moves over to the couch where he gets more comfortable and props his leg up on the couch giving Diego better access. Tory fucks that sexy face as Diego continues to pleasure his man. Tory then bends Diego and puts his tongue to good use. He spreads Diego's smooth cheeks apart and slides his hot tongue up inside. Diego's eye's roll into the back of his head as he gets his sweet ass rimmed. Diego is on all four on the couch while his beau continues to suck, lick and rim that hot ass. Tory isn't one to rush; besides he knows that a hot rimming is only going to make his Daddy want that cock buried deep inside him.  lolTory then gets into position and slides his throbbing cock into Diego's spit lubed ass. His ass concedes easily and Tory starts to fuck his boyfriend deep. ?You want me to fuck you hard??, he coos as Diego assures him that that's exactly how he wants it. Tory holds on to Diego's muscular frame as he pounds that hole. He looks down to watch his thick cock disappearing into that hungry hole that only he gets dibs on. Some guys have all the luck. They then switch it up as Tory sits back and Diego rides his dick. Diego straddles that thick dick again and impales himself on it. He immediately goes back to driving Tory crazy as he rides that dick grinding his hot ass all the way to the hilt. The chemistry between these two is sizzling. Tory then gets Diego on his back and gets that cock back inside him. His abs look amazing as he holds Diego's legs apart and fucks his ass. Tory picks up the pace as he tells Diego just how good that ass feels wrapped around his cock. It won't be long before Tory has to blow that wad and as soon as he feels that familiar tingle he pulls out. He immediately moves that hard dick inches away from Diego's face. A few strokes later, Tory blasts his massive load all over Diego's face and tongue. The huge cum bath causes Diego to unload his own batch all over himself. Whew.",
  "models": [
    {
      "name": "Diego Vena",
      "person_id": 27984
    },
    {
      "name": "Tory Mason",
      "person_id": 30491
    }
  ],
  "release_date": "2010-07-22",
  "scene_id": 54068,
  "tags": [],
  "title": "Shafting Dad, Scene #02"
}