{
  "collections": [
    "Men Over 30"
  ],
  "description": "Casey Cole makes his debut with us this week. Not only is Casey new to this site but he's also new to the club?the MenOver30's club. Casey is from the Tampa Bay area. This stud isn't all that excited about being 30 years old now; but we're sure he'll come around and realize your thirties are a smooth ride compared to those tumultuous twenties. Casey has a bad boy look to him and has a smooth body with some sweet ink. That smile of his seals the deal and this 'mostly' str8 boy more than likely gets what he wants when he wants it. Helping Casey out today is another fresh face on our site, Mr. Brett Blizard. Brett isn't old enough to be 'IN' the club but by the end of this shoot he'll be an honorary member by injection. Brett is 25 years old and is originally from Colorado. Brett is smooth and defined and has abs you could wash your clothes on. They come from different places and where they want to retire when the time comes is just as opposite.  Casey would want someplace warm like Los Angeles and Brett wants to retire to Anchorage. Casey is mostly str8 and started experimenting in college. Brett on the other hand came out to his parents at 14, who assured him he 'wasn't'. Mmhmm. Eventually the reality sank in. Speaking of 'sinking in', we better let these two get started. Casey sits back as Brett asks about his ink. He lifts Casey's leg to admire the tattoo he has wrapped around his lower right leg. Brett admires the detail that took 16 hours to perfect. He moves his attention north once Casey shows him another one on his bicep. Brett begins to lick the sexy str8 boy as he shows him more tattoos. Soon Casey is hard and tattoos are no longer what he wants Brett's focus on. Brett pulls off Casey's shorts and goes to work on that cock his tongue awoke. Casey holds Brett's head as he softly bobs his head on his swollen meat. ?Suck that dick? he groans as Brett eagerly obliges. Brett then stands and undoes his shorts and pulls out a whopper of his own. It's Casey's turn at bat as he kneels to return the favor.  Brett rubs Casey's shoulders as he gets that thick dick sucked on. Not bad for a str8 boy as Casey takes every inch deep. Casey takes his time on Brett's meat as Brett strips completely. Brett's hot ass comes into view and we're sure that hot ass will be next on Casey's ?To Do? List.  .rCasey then gets Brett on the chair so he can continue worshipping that thick meat. Brett's not about to complain as he watches the hot pretty boy put his mouth to good use. Once Casey's ready for more, Brett assumes the position as Casey suits up and slides his cock inside. Casey takes that hot ass doggy style as he holds on to Brett's waist. Bent over, Brett grimaces as he gets used to that hard cock inside him. Casey then moves the action to the couch as he gets Brett on his back so he can pound him missionary. That ass welcomes him back in as he starts to slowly bury that cock deep. Brett strokes his cock as he watches Casey fuck his hot ass. From missionary, Casey sits back on the couch and has Brett sit on his dick. Brett impales himself back on that breeder meat in a reverse cowgirl position. He making sure he gets every inch inside him. In this position, Brett has all the leverage he needs to grind that sweet dick as deep and as fast as he wants. It hits all the right spots as he jacks himself off with Casey buried deep inside him.  Brett explodes as Casey tugs at his balls. Once Brett cums, Casey takes care of his own aching meat that unloads all over his inked frame.",
  "models": [
    {
      "name": "Casey Cole",
      "person_id": 27986
    },
    {
      "name": "Brett Blizard",
      "person_id": 27987
    }
  ],
  "release_date": "2010-07-29",
  "scene_id": 54069,
  "series": "Plowing Blizzard",
  "tags": [],
  "title": "Plowing Blizzard, Scene #01"
}