{
  "collections": [
    "Men Over 30"
  ],
  "description": "After making his debut with us last week, we just had to have Trace Michaels back this week for more. The response we got over this furry slice of muscled daddy cake was phenomenal. So, we decided we needed to see this bad boy in action. For those of you who aren't familiar with Trace, Trace is 36 years old and from Central Florida. We brought back a recent find to join Trace; and since these two both came here from Central Florida we figured 27 year old David Scott would be a perfect fit. David Scott was last scene face down taking an ass pounding from Brenn Wyson?but that's another story entirely. We asked these two what they like to do on their spare time to relax. Trace likes to get some sun, get to the beach and work out. David likes to spend time with family and relax and hangout with them. He also likes sex as well. (Duh) We then asked these two horny studs what the jack off fantasies that occur the most for them when they end up whackin' the willy. Trace admits he likes thinking about younger guys taking his ass. Hmm, sound the Bottom Daddy alarm. David likes jacking off to fantasies of older daddies that take care of their bodies. If these daddies just so happen to be in leather ...then David cums that much faster. David's sitting on the couch when Trace, the repair guy, reports everything is in working order. He then asks if there's anything else that needs fixing. David looks up at the hairy daddy before him and says, 'Well, there is one thing...'  Bow-Chicka-Wow-Wow. He stands and lets his fingers do the walking all over the repair guy as he undoes his coveralls. Trace is game and starts to kiss David who is soon on his knees with a mouthful of thick cock to work on. David braces himself on Trace's meaty thighs as he shoves that dick down his throat over and over. Trace looks down and watches as he gets his cock swallowed to the hilt. Then its Trace's turn as David sits back and watches Trace get to work. On his knees, Trace starts to work David's growing cock. He laps at his smooth balls as his dick gets harder. Soon he's deep throating David's meat. David gasps as he watches his dick disappear into Trace's skilled mouth. They then get up and start making out while Trace cups David's smooth bubble butt. David then bends over to give Trace and that tongue of his better access. Trace rims that ass deep and soon David's ready for more...you know. Trace stands up and gets into position as he slides his thick dick deep into David's hungry hole. Once he buries that dick deep he starts to fuck away at that hot ass. He slaps that ass while he bounces David on his meat. He holds David by his shoulders as he locks him into place so he can fuck him deep. David loves the dick he's getting and the two look hot as they fuck away doggy-style on the couch. Trace then switches things up and sits back and has David ride him. David sits back on that cock and once he's got every inch of it inside him, he starts to ride that dick like a pogo stick. His own cock is rock hard and swinging side to side as he gets that ass pounded from beneath. Trace can't get enough of that smooth ass and he starts to ram his meat up into David's worn hole. The sound of Trace's balls slapping that ass as well as David's grunts fill the room. Soon these two are ready to explode. David moves in for a closer view as Trace pumps his cock to completion. He unloads all over David's face as well as his own furry navel. David then sits back and jacks himself off as Trace works his nips. Once David blows his load all over his smooth frame, Trace moves down and samples some off his chest, abs then a quick mouthful to clean off what was left. Whew.",
  "models": [
    {
      "name": "David Scott",
      "person_id": 27976
    },
    {
      "name": "Trace Michaels",
      "person_id": 27988
    }
  ],
  "release_date": "2010-08-12",
  "scene_id": 54074,
  "series": "Tool Box",
  "tags": [],
  "title": "Tool Box, Scene #02"
}