{
  "collections": [
    "Men Over 30"
  ],
  "description": "Making his debut on MenOver30 this week is Adam Rogue. Adam is 38 years old and originally from Chicago. Adam is relatively new to the adult industry. He befriended a hottie that was into doing porn. It was as easy as that. That's how he ended up in front of the camera. He got invited to do one and he jumped at the chance. Better late than never, right? Adam doesn't watch a lot of porn so this is all a new experience for him. He enjoys the beach, the nude beach in particular. He likes to spend his time watching movies either by renting them or going to the movies. If he had the opportunity to direct a movie he would want it to be an action movie. Not a shoot em up kind of movie; more like an intrigue and action movie like True Lies. We asked him if there was any fantasy costar he had in mind. He couldn't remember the guys name but we're guessing he likes them big and muscular. One of the biggest perks to being in the adult business is that he gets to indulge one of his favorite things to do?show off! Adam is a natural exhibitionist so this type of work is right up his alley. On that note, let's let Adam do what he does best...Adam comes in after a long day and plops down on the couch with a handful of bills. Needing a distraction, Adam finds something else that he needs to tend to?releasing some stress. He starts to feel himself up. His hands roam over his huge biceps then head south as he tugs up his shirt revealing his hairy navel. He pulls his polo up over his head and we get our first glimpse at his massive frame. His chest is built solid and as his hands end up behind his head, we get a better idea of just how broad his chest and shoulders really are. He then peels off his shirt giving himself more room to explore. He flexes as he shows off his guns and massive chest. He knows how to show off all he has to offer. His chest and abs are covered in fur and if you like your men big, muscular and hairy then Adam's the rogue for you. Adam then decides he should show you even more. He turns around and flexes his back. Let's just say Adam's definitely got 'back'. The pants he has on definitely complement his beefy and muscular ass and we're about to see a whole lot more.  He pulls down his pants and shows off his bubble butt.His sexy black briefs contain that beefy ass just so. He starts to grope his cheeks and teases us as he slowly but surely shows more and more of it. Once he's ready, he kneels on the chair and shows it all off. His hairy ass is as furry as the rest of him. Adam pulls his cheeks apart, showing off that hungry ass of his. He then licks his finger as he goes in for more. He slowly fingers that manhole groaning all the while. He slaps his beefy ass continuing his strip tease. His quads are massive and everything about Adam screams 'BIG'. Adam then decides it's time to give his cock the attention it deserves. He sits back and starts to jerk off. He spreads his hairy thighs wide open as he jerks faster and faster. He gets up to wave his meat around and continue to give us an eyeful of all that is Adam. It isn't long before he's back in the chair stroking off. His moans and groans quicken in time with his stroking. Adam won't be able to keep from coming for much longer so he picks up the pace. His fist becomes a blur as he jacks his load onto his furry navel.",
  "models": [
    {
      "name": "Adam Rogue",
      "person_id": 27991
    }
  ],
  "release_date": "2010-08-26",
  "scene_id": 54078,
  "series": "Bear Necessities",
  "tags": [],
  "title": "Bear Necessities, Scene #02"
}