{
  "collections": [
    "Men Over 30"
  ],
  "description": "Unbuckle those pants fellas, cuz have we got a hot daddy for you. Originally from Fort Lauderdale, 36 year old Trace Michaels makes his debut with us. Trace is a hot daddy indeed. Standing 6' tall, Trace is one tall, dark and hairy hottie. He has classic handsome features, a chiseled frame that's deliciously covered in man fur. Every once in a while we're blessed with a man that loves himself 'au natural'.  Wanting to get to know this manly man a bit better, we asked Trace if he could go back to being 21 what would he do differently. 'Plan your marriages carefully' he advises, 'mine were wonderful - but too early'. Mmm-Kay. Well youth IS wasted on the young. We then asked Trace where he sees himself in 10 years. Trace wants to be more financially sound by the time that marker rolls around. Trace got into the adult industry because it was one of those things on his 'to do' list. Naturally charming and photogenic, Trace has many qualities that will keep him working in this industry for a long time to cum. We look forward to seeing a lot more of him in the future. The End. Next on 'our' To Do list - Get this dude NAKED!!!Trace starts by slowly giving us a better view of his huge chest. He peels off his tee shirt and once he's down to his black tank he starts to pose and flex for us. His dedication in the gym is obvious and he has the guns to back that up. He slowly licks his massive biceps as his hand starts to roam south over his broad chest and abs. He stands as he slips his hand inside his tank. As he lifts his tank a bit feeling up his chest we get our first glimpse of his hairy abs. Trace doesn't have a happy trail; this stud has a happy highway. His thick chest hair completely covers his bulging peeks and ripples over the defined abs that disappear into his shorts. He slowly turns around and takes off his tank. His back has a large tribal tattoo that covers his upper back from shoulder blade to shoulder blade. Trace sits back and continues to tease us by groping and licking his chest and biceps. Trace then turns his attention to his nips that he tugs on and tweaks which does the trick. His shorts are popping a tent and Trace finally goes in to give his throbbing cock some much needed attention. He drops his shorts and is left in a tight pair of boxer briefs. Now the fun can begin.Trace bends over as he pulls down his briefs. His hot ass is on display and as he bends over he pulls his ass cheeks apart. He kneads his ass cheeks while we get a view of that hot hole. He stands and finally frees his cock. He strokes this as we get a close up view of his cock and balls. He sits back on the chair and lubes his meat up. Trace takes his time as he massages his hard cock. His muscles are glistening and flexed as he services his meat. His massive thighs are spread wide and no matter what the angle on this hung stud, there's plenty to lust over. The look on his face is one of focus as he hones in on that cock that has his body at its command. Trace needs to relieve the tension in those balls and it won't be long before he explodes. His smooth balls are pulling tighter around the base of his glistening cock as he nears his climax. He lies with his nipple with his free hand as his body starts to pump up into his fist. He grunts and is soon coating his furry navel with his load. ",
  "models": [
    {
      "name": "Trace Michaels",
      "person_id": 27988
    }
  ],
  "release_date": "2010-08-05",
  "scene_id": 54071,
  "series": "Sin & Bear It",
  "tags": [],
  "title": "Sin & Bear It"
}