{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today we bring two titans together and watch the epic sparks fly. Back after an entirely too long absence is fantasy daddy Doug Jeffries. Doug is 44 now and is originally from New York. Brenn Wyson is the second half of this action-packed ensemble. Brenn is originally from Boston and this hot hung stud is an unpredictable one. It's never a dull moment when Brenn is in the house. Today we'll see a different side of the boxer from Boston. We asked these two if they could go back in time and pick a different career to pursue what would that be? Neither of them would have done anything different. They both love what they do. Brenn loves the fact he gets to beat people up for a living as well as meet all sorts of people. Doug likes the opportunities to travel that this business affords him. He also enjoys working with all the different people he'd never had the opportunity to otherwise. These two are hot and horny and no matter how much sex they get on set and off they both admit they love to jack off. Well we've wanted to see these two together for some time now; so let's get this party started... As we start to roll, Brenn already has Doug groping his crotch. He pulls off his shirt as Doug starts to explore Brenn's smooth, defined chest and abs. He undoes his jeans and as he pulls them down he discovers Brenn's come commando. No waiting at all as Doug takes that thick cock in his mouth. Brenn moans as he gets that cock worked. Doug then sits back as Brenn returns the favor. Doug is built big and solid. He has a smooth frame with large pecs and thick throughout. Brenn gets to work on his cock as it gets rock hard in his mouth. Doug holds his head as he starts to fuck Brenn's face. Brenn does his best to accommodate Doug's meat but can't help but gag on it a few times. Doug then kneels to get more of Brenn as he buries his dick deep. 'Aww you suck such good dick' Brenn coos as Doug nurses on his meat. Doug takes his time as he slowly savors every inch. Brenn can't get enough of that hot mouth on his dick as he continues to feed Doug his thick cock. Brenn then pulls Doug to his feet so he can have more of Doug's cock. Brenn starts nursing on his thick dick and it isn't long before his tongue finds Doug's smooth hole. He goes to work on that hole as he tongue fucks Doug.Doug goes nuts as Brenn buries his tongue deeper and deeper. Doug is grinding his ass back onto Brenn's face and begging for more. Once Brenn has had his fill he gets up and turns around. He bends over and serves up that muscular ass for Doug to take. Doug slides that thick cock deep into his ass as Brenn tells him how good it feels. 'Oh yeah, fuck that hole' he orders as Doug picks up the pace. Doug takes that ass deep and hard as he grabs Brenn by the waist and proceeds to bounce him on his dick. Brenn is cock crazy and Doug uses it to his advantage. 'Fuck yourself!' he orders as he stands still. Brenn starts to fuck back onto that dick as he greedily bucks back wanting more dick inside him. This stud can take it as rough as he gives it as he begs Doug to fuck him harder. Doug gets him on his back and continues to stretch that ass open. Brenn is rock hard as he gets that ass stuffed full of man meat. He pounds away at that hot ass and just when you think you've seen everything?cut! Brenn is the one on top as he slides his thick cock deep into Doug. Doug grunts as he's made to take that cock. 'Aww FUCK' he groans as Brenn gives his dick like only Brenn can. He pounds away at that hole until Doug is ready to explode. They sit back side by side and each unload all over their sweaty bods. Damn, Daddy.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Doug Jeffries",
      "person_id": 27928
    }
  ],
  "release_date": "2010-09-16",
  "scene_id": 54083,
  "tags": [],
  "title": "Daddy-O 'Gasm, Scene #01"
}