{
  "collections": [
    "Men Over 30"
  ],
  "description": "One of the most recognized faces in the industry is back to show us what he can do?and why it's kept him doing what he does. Troy Halston started off as a gay porn star in his late teens. He can't even remember how many productions he's been in and is still making adult films; both in front of and behind the camera. His costar today isn't as well known but none-the-less has amassed quite the impressive resum?. Award nominated, Dallas Reeves is a tall drink of sunshine. At 6'3, this blond hair blue eyed stud isn't one to go unnoticed. Having all the right equipment helps as well. We asked our seasoned veteran if he could offer any words of advice for our up and coming star; to which he replied as follows: ?Be Yourself; Stay away from Bullshit; Got to work and then come home, keeping them separate.? Not remembering to keep the two separate can lead to a rude awakening in no time. It's important to have a life ?off set?. Troy knows all about that being married to his favorite co-star, Mrs. Halston. They met after he'd been doing primarily gay porn and still calls his finest hour as an actor when he and Holly did their first movie together, ?The Bi-High Club?. It was her first movie ever and she handled the shoot like a pro. Dallas just sits there with a dumb-founded look on his face hanging on Troy's every detail of his finest hour shooting the now infamous Bi flick. ?I can't top that? he blushes. We're not really worried about him topping Troy's story. Little does Troy know, soon young Dallas will be topping?his sweet ass! They begin softly kissing as they break the ice. The chemistry between them is evident as they begin to undress each other. Dallas slides onto his knees between Troy's legs as they continue making out. In no time, they're both naked and boned as Troy samples the newcomer's wares. Dallas is rock hard as Troy swallows his meat, stroking it to a spit-shine. Dallas is in awe of Troy's mouth and just when he's getting used to the royal treatment, Troy stands up and backs his ass right onto his face. ?Eat that ass!? he commands as he writhes all over Dallas' eager tongue. You have to give to get in this industry and within minutes it's Dallas who is gasping with pleasure as Troy holds his legs in the air while diving deep into his sweet ass. Tosses Salad is always a great way to start a day. Troy chows down on his ass as Dallas gets lost in the sensation. Troy then switches things up by giving Dallas something to work?his dick. Troy steadily fucks Dallas' face as he does his best to keep up. After he's had his fill of Dallas on his dick, Troy turns around and gets more of Dallas' hot tongue on his ass. After all, that backdoor's gonna need a lot of lube anytime now.The rodeo is off and running as Troy readily impales himself on Dallas' fat cock. His ass glides up and down on Dallas' meat as Dallas just sits back and enjoys the ride. As much fun as it is to get ridden, Dallas needs to show Troy who's in control and he does without much hesitation. He bends Troy over and quickly rams his thick dick back inside. Troy takes it like a man as Dallas, balls slapping, uses his veteran ass. From there Troy goes down on his back where Dallas mounts him again. He holds Troy by the waist as he repeatedly impales him onto his meat. Dallas isn't kidding around and he's out to pleasure his dick. After a bit, Troy wants to ride his meat again so Dallas obliges. He lays back and looks down as his meat gets swallowed by Troy's hungry ass. Dallas holds him steady as he begins to thrust up to meet Troy on his way down. This position feels great but a prostate can only take so much pleasure before he ruins the party. Sure enough, Troy erupts sending his cream all over Dallas' smooth chest. Dallas then straddles Troy and gives him a hot soaking of his own. Well, it looks like Dallas did finally top Troy and his story. He smiles as he admits that this shoot has definitely got to be his finest hour.",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    },
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2009-03-23",
  "scene_id": 54088,
  "series": "Didn't See This Cumming",
  "tags": [],
  "title": "Didn't See This Cumming, Scene #02"
}