{
  "collections": [
    "Men Over 30"
  ],
  "description": "?Gostoso! Alexsander Freitas is finally here. We've been waiting to get this sexy slice of Brazil with us and today's the day. Alexsander is 35 and originally from Rio de Janeiro from the beautiful shores of Copa Cabana Beach; adjacent to the better known Ipanema. Dark and tan and inked and lovely, the boy from Copa Cabana goes walking; and when he passes, each one he passes goes ?DAMN!? Alexsander just oozes sex. His beard, furry power house frame and tattoos just add to his charms. Back to help welcome Alexsander is David Scott. David is 27 and from Orlando, FL. We asked these two if they could take a vacation all expenses paid anywhere in the world where would they go. Alexsander would want to go to Fernando de Noronha, Brazil. Fernando de Noronha is an archipelago of 21 islands off Brazil's coast and one of the most beautiful places as well as ecologically preserved in Brazil. David looks over at his co-star before answering and says, ?Well, if they all look like him, I'd wanna go to Rio.? Not a bad move at all. Alexsander likes Asian men with smooth skin and no hair. Makes sense since opposites attract. David likes older men which is why he loves us here at MenOver30. In a few you'll get to see why...A photo shoot is the scenario as David snaps picks of hot Alexsander. Alexsander starts posing and showing off his hot body and is soon playing footsy with David's cock. He starts to grope his growing 'pica dura' (boner) and it doesn't take David long to figure out he's needed in front of the camera. They start to make out as Alexsander strips off David's clothes. Alexsander takes off his shirt and we get a better view at his intricate ink. David gets a better view too...of Alexsander's uncut cock. ?Suck that cock? he orders as David hauls it out and goes to work. Alexsander starts to hump away at that hot mouth finally getting some relief on that aching cock. He pistons it in and out of David's mouth as he watches his dick disappear. David savors that cock as he takes his time making sure to drive Alexsander wild. Alexsander's smooth balls slap away at David's chin as he starts to fuck his face again. Alexsander crams his thick meat down David's throat making him take it. Alexsander has a tattoo on his hand that says ?Power Fuck? and it's not just for show. Alexsander then moves David over to the couch and starts to explore his smooth ass.He fingers that ass and licks it getting it ready for a good fucking. He suits up and then starts to slide inside. David's hole eases a bit as Alexsander starts to fuck him. David's tight ass needs more lube and Alexsander sends some spit south to help his cock get inside. Once that ass has the right amount of lube Alexsander starts to fuck. David can only moan and hold on as Alexsander starts to pound away at his hole. He holds on to David's shoulders, holding him in place as he slams his cock deep inside. David winces with every thrust and hearing him whimper just makes Alexsander harder for more. The sound of fucking fills the room as Alexsander takes David, impaling him at the end of his Brazilian bone. He pulls out to admire that smooth hole he's fucking, spits on it and then slams his thick cock back in. He can't get enough. He then lies back on the couch and has David ride him. David sits on that cock and then holds himself up as Alexsander fucks up into him. He piston-fucks that hungry hole harder and harder as David takes every thrust. Alexsander then gets David on his side on the floor where he gets behind him for more. No matter the position Alexsander is fucking David silly. David can't hold it anymore and they move to jack on the couch. David cums within seconds and as Alexsander get ready to bust, he gets up in front of David. He blows his wad ALL over David's face leaving him spent and dripping. ?Muito obrigado!",
  "models": [
    {
      "name": "Alexsander Freitas",
      "person_id": 27993
    },
    {
      "name": "David Scott",
      "person_id": 27976
    }
  ],
  "release_date": "2013-06-20",
  "scene_id": 54085,
  "series": "Muscle Milk",
  "tags": [],
  "title": "Muscle Milk, Scene #01"
}