{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week, we have two hotties we've been trying to get together for a while now. East coast meets West as we finally have Los Angeles based Doug Jeffries back in Florida. Looking as hot as ever, 44 year old Daddy daydream Doug is back. Joining Doug this week is a local hottie that some of you may have heard of. Well if Matthew Rush rings a bell, then you're in for a treat. These two are going to be a lot of fun. Doug has been taking good care of himself since we've seen him last. He's still toned and buff and has been actually doing more things behind the camera than in front of it. Doug has gone more into the directing side to the industry and has no regrets. ?It makes me a better model because I'm more aware of where the cameras are at all times.? Matt agrees since he's also had a chance to direct a few films. Working with so many actors, we asked these two if they can ever jack off to guys they've already done scenes with. ?Absolutely not!? is Matthew's response. Once he's been with them they are on another level and it weirds him out to want to fantasize about them. Doug says he doesn't have that problem since he's directed his friends in scenes and has found himself aroused while doing it. That being said, Lets knock 1 more Daddy out of Matt's list of ?strokabilities?.They start off wondering what a scene between these two would look like when they decide to make it happen instead. They start to kiss as Matthew nervously goes in for his first kiss. They stand and take their shirts off as Doug explores Matthew's rock solid chest. He pounds on his pecs as Matt grunts his approval. Their hands are all over each other as they try to contain their excitement. Matt slides his hand inside Doug's underwear as they come off. His finger darts inside that beefy ass to get an idea of what that ass is like. They pull out each others cocks that by now have been aching to be set free. They stroke each other's cocks a bit before Doug drops to his knees. He takes Matt's cock in his mouth, sending him into orbit. He sucks on Matt's fat cock as Matt starts to fuck his face. ?You like that dick?? Matt grunts as he shoves his dick so deep it makes Doug gag a few times. Do not try this at home, Doug is a trained professional. Matt then gets on his knees to taste that Daddy dick he's beat off thinking about. He sucks down Doug's cock like a champ as Doug orders him to finger his ass. Matt is getting that ass ready for more as he fingers and then eats that sweet, smooth hole.Doug's smooth hole is getting fucked by Matt's strong tongue and soon he's just begging for it. Just when you think you know what's coming ,we see Doug sliding his Daddy dick inside Matt's ass. Matt groans as he gets that hole stretched. ?Fuck me? he rants as he begs Doug to tear his ass up. Oh the pressure! Matt loves that dick in his ass, and Doug just pounds away at that hole. Matt then sits back on the couch as Doug straddles him and slowly sits on that thick cock. Once he's ball deep, Matt starts to pound at that ass. Payback's a bitch, Doug. Doug groans as Matt bounces him on his meat, determined to pound that ass. From there, Matt puts Doug on his back as he slams that cock in missionary.   He holds Doug's legs up in the air as he goes right back to fucking that ass. Doug is jacking his hard cock faster and faster as Matt picks up the pace. Soon Doug is double-fisting his rod as Matt repeatedly buries his cock in his hole. That does the trick as Doug announces he's coming. ?Shoot your load, Daddy? Matt orders as he fucks him even harder. Matt fucks the cum out of our west coast daddy. He leans back and releases his own load all over his rock hard cock and balls.  Whew. That was as intense as we'd hoped for.",
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 27928
    },
    {
      "name": "Matthew Rush",
      "person_id": 27951
    }
  ],
  "release_date": "2010-09-02",
  "scene_id": 54080,
  "series": "My Two Dads",
  "tags": [],
  "title": "My Two Dads, Scene #02"
}