{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a familiar face back with us and this stud's always a welcome sight. David Chase is back and looking better than ever. David is a prime example of a man over 30. David is 6'3 and originally from Florida. Today he has a hot little 24 year old from Denver named Darin Silver to play with. We asked these two should they each play the lottery and win $1K what would they spend their winnings on. Darin would blow it on alcohol. That's a lot of cosmos. David would work on getting his passport so he could travel overseas. We also wanted to know if they had more time to pursue something they don't have time to now what would that be. Darin wants more time to devote to sex. (Sex and alcohol? Really?oh to be 24 again.) David would love to get more time to enjoy nature. Living in Florida there's so much of it around you kinda forget it's even there. We asked them, recalling their first sexual experiences if they had a chance to redo them would they. They both said they wouldn't change a thing. Turns out they were both sloppy drunk and had a great time doing it. To wrap things up we asked them if we were to ask their former lovers what they were best at what that would be. David said giving head for sure; while Darin said he is honestly just good at everything. David's reading when he gets a knock on the door. It's Darin who is done with the chores David has hired him to do. Dave gives him his money then asks if he'd like to stay and cool off. It's hot outside and Darin agrees to. David then offers him a pair of shorts to change into. Just as Darin is about to put on the shorts, David tugs on them and it doesn't take long for Darin to realize this isn't about his shorts. David then peels down his underwear and goes to work on his growing cock. Darin figures he might as well get comfortable so he sits back on the chair giving David better access. David kneels between Darin's smooth thighs and starts to worship that meat. David sucks that dick like an oil rigger. ?I've wanted to do this for weeks? he groans before going back on it for more. David then stands up to get some relief of his own as Darin returns the favor. David slaps his thick cock on Darin's tongue as he gets his fat 8? cock sucked as well. Darin strokes his rock hard cock while servicing David's.Darin then bends over and gives David access to that hot ass of his. David buries his face inside as he eats that tight ass. Darin moans as David tongue fucks his hole. ?I've got something for ya? David teases as he starts to slide his thick cock inside. He starts to take Darin's hot ass doggy style as that ass concedes. Darin's tight ass is driving David crazy as he continues his assault. David fucks that hot ass at a fast pace unable to get enough of that ass. They then move the fun over to the couch where David sits back and has Darin sit on his cock. Darin sits on his thick dick in a reverse cowgirl position. He starts riding that dick while David holds his waist and helps bounce him on his meat. Darin's hot ass is taking every thick inch David has to offer and these two aren't done yet. David gets Darin on his back and goes back in for more only this time in a hot missionary position. David fucks Darin's ass while he jacks Darin's throbbing cock as well. All this stimulation is leading to one sensory overload for Darin who is soon ready to cum. He blows his wad all over his smooth abs and chest while David gets his tongue in the action for a taste test. Got Milk?  David then unloads his own batch that explodes all over our newest addition.",
  "models": [
    {
      "name": "Darin Silvers",
      "person_id": 27992
    },
    {
      "name": "David Chase",
      "person_id": 27963
    }
  ],
  "release_date": "2010-09-09",
  "scene_id": 54081,
  "series": "Splendor In The Ass",
  "tags": [],
  "title": "Splendor In The Ass, Scene #01"
}