{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a familiar face back with us all the way from South Bend, Indiana. Diego Vena is looking as sexy as ever and our members can't get enough of this stud. Originally from Poland, our newest addition now lives in Los Angeles. He is 31 years old and goes by the name of Lucas Knowles. We asked these two avid travelers where they think one would find the hottest men. Diego immediately says Brazil. Well he's on to something there. Lucas says the hottest men would be here in the United States but the biggest dicks would be in the Netherlands. They may grow 'em big in Texas; but look out boys cuz the Netherlands come taller than most. They both admit to watching porn from time to time. Lucas likes amateur porn and thinks that's the direction the industry should be headed. Where IS that suggestion box of ours? Hmm. Diego likes Twink on Muscular porn. Well, now we know what he has on his wish list come Dec. 24th.  Well, here's hoping he's extra naughty this afternoon to ensure him something nice in the near future. Let's get these two better acquainted shall we?They come back after a workout as Lucas asks Diego for tips on stretching. Diego tells him to remember to stretch certain muscle groups and as he does, Lucas' hands are roaming all over Diego's pumped chest. They start to make out as they fall onto the couch. They kiss as their clothes start to come off. They move over to the chair where Diego slides Lucas' pants off. Diego grabs Lucas' cock that is already hard and ready to go and gets to work. This was the one muscle he didn't get to help Lucas work out and he's making up for that. He swallows his meat as he kneels on the floor. Lucas can't get enough of his hot mouth as he stands to continue fucking that sexy face. Lucas' balls slap away at Diego's chin as his throbbing cock gets the attention it demands. Diego then moves to the couch and puts that amazing ass of his up for Lucas to enjoy. Lucas gets to work as he dives in tongue first. He licks and sucks on his tight ass as Diego squirms in anticipation. That ass loves a good rimming but he knows there's more in store.Lucas suits up as Diego lubes his cock up. Once he's ready to go, Diego straddles Lucas and aims that thick cock at his ass. He slowly slides Lucas' thick cock inside. He winces in pain as that cock stretches his ass wide open. It takes him a few minutes before he's able to relax enough to enjoy it. Once there, Diego starts to slowly ride that cock. Lucas' cock disappears in and out of that hot ass as they continue making out. Diego holds still for a bit as Lucas starts to slam his dick up inside him. Lucas then switches it up and bends Diego over. He slides his thick cock back inside Diego's perfectly smooth ass as he continues to fuck his ass. Soon he's pumping away at that ass as Diego takes over and impales himself on that cock. He bucks back wanting all of that dick in him as their fucking intensifies. Lucas then gets Diego on his back on the chair where he lifts his legs and fucks him missionary. This position's gonna make Diego cum faster than he wants to but Diego jacks his cock while he watches Lucas fuck him. It isn't long before Lucas' cock makes Diego explode. As soon as Diego nuts, Lucas pulls out and unleashes a geyser of thick cum that seems to keep cumming and cumming. Damn! Diego is left drenched in cum. ...Got Milk?  lol",
  "models": [
    {
      "name": "Diego Vena",
      "person_id": 27984
    },
    {
      "name": "Lucas Knowles",
      "person_id": 27994
    }
  ],
  "release_date": "2013-06-13",
  "scene_id": 54090,
  "series": "Pole in One",
  "tags": [],
  "title": "Pole in One, Scene #02"
}