{
  "collections": [
    "Men Over 30"
  ],
  "description": "Halloween is in our midst and with it comes folklore of ghouls and monsters, evil witches and Prince Charmings. Well, not everyone wants to be a Marine; so Halloween is the time to dress up and live out your fantasies. Well, we're going to be doing things a little different. We'll be undressing ours.  Trace Michaels is back in the house and together with newcomer Spencer Pierce, they're going to be making your fantasies come true. Trace is 36 and from Tampa, FL. Spencer is finally 30; from Orlando and new to the MO30 club. We're happy to have him.  We asked these two what their favorite Halloween costumes in the past had been. Spencer went as a flasher one year and had a riot. Trace went as an Indian chief wearing?picture this?a skimpy loin cloth and a few feathers. lol Being new to the industry, we asked Spencer how he felt about people watching him to get off. ?It's the hottest thing ever? he beams. Spencer had no hesitation getting into porn. He was approached and he said hell yeah. Trace is a seasoned performer but still claims to be afraid of the camera. We have a hard time believing this bad boy's afraid of anything. Lol Well, let's get these treats naked.The guys come back from a costume party still wearing their masks. They talk about the fun time they had that soon leads to more fun. Trace starts to undress Spencer as his hands roam his smooth chest and abs. He sits Spencer back in the chair as he strips his shirt off. Spencer undoes his pants and pulls them off to get at that cock and hot ass. He gropes at Trace's defined frame before slipping between Trace's legs to work on that rock hard cock. He looks up at Trace as he sucks his cock which only gets Trace hornier. ?Take it all? Trace coos before getting up to sit down on the chaise. Spencer follows and stands in front of Trace who immediately goes for his throbbing cock. Spencer moans softly as Trace nurses on his thick dick. Trace savors his cock before turning him around and bending him over. Trace has other things in mind as his tongue tastes Spencer's hot ass. Spencer is naturally smooth and his muscular ass is irresistible. Trace tongue fucks that sweet hole getting it ready for a hot fucking.                          Trace then stands and gets into position as he starts to slide his cock deep inside Spencer's hole. Trace loves that ass and climbs up on the couch so he can jack hammer that cock inside. Spencer is moaning as he takes that dick. Trace then sits back on the chair and orders Spencer to ride his dick. Spencer sits on his cock in a reverse cowgirl position so that Trace can watch his cock disappear into his hot hole. Spencer loves that cock deep in him and his cock is rock hard the entire time he's getting boned. Trace then switches it up a bit and puts Spencer on his side before sliding his dick back in. He starts fucking that ass slowly as he teases Spencer. That feels amazing which makes Trace's cock want more. He slams deeper into Spencer's ass at a faster pace making Spencer's eyes roll back. Trace then moves Spencer into missionary and rails that hot ass he's been pounding. Missionary does the trick for both of them. They dismount and jack off side by side sending their thick loads all over themselves. Shame you can't fit that into your goody bag...damn shame.  Happy Halloween from all of us at MenOver30.com.",
  "models": [
    {
      "name": "Trace Michaels",
      "person_id": 27988
    },
    {
      "name": "Spencer Pierce",
      "person_id": 27998
    }
  ],
  "release_date": "2010-10-28",
  "scene_id": 54097,
  "series": "Fright Night",
  "tags": [],
  "title": "Fright Night, Scene #01"
}