{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a little razzle to dazzle you this week as Ryan Raz makes his debut here on MenOver30. Ryan is a familiar sight on our brother sites and we're sure you will come to love this hot, blue-eyed hottie just as much. Ryan is now 26 and living in the Big Apple. Back for more mayhem is inked daddy, Nick Moretti. Nick is originally from New York and now calls Florida home. Nick just turned 47 and looking hotter than ever. They are both avid travelers so we asked them what their biggest pet peeves are while traveling. Ryan hates stupid people. There's a bumper sticker in the making. It's those people that can't seem to follow simple instructions that can make getting through security a pain in the ass. On that note, Nick's pet peeve is TSA in general since he travels a lot to do BDSM (Bondage/Discipline Sado Masochism) shoots. He travels with whips and chains and rather large toys so they always go through his luggage and rearrange his luggage leaving all the dildos on top.  We then asked them if they could live/work anywhere they've visited where would that be. Nick is torn between Florence and San Francisco. Ryan is sticking with New York. ?When I land it feels like home; there's no place else I'd rather be.? Well we know of at least one place he might wanna be?under Nick.  Nick limps in assisted by Ryan. ?I don't know how I tripped on that rock? Nick moans. Ryan starts to massage his sprained ankle and removes the bandage to give it more attention. He starts to lick Nick's toes as the ?attention? becomes specialized. He sucks and licks on Nick's toes turning him on. Ryan then helps Nick out of his tank top as he feels his hairy chest. Ryan then strips and watches Nick pay specialized attention to his cock. Nick pulls down Ryan's underwear and starts to suck on his rock hard cock. Ryan groans in ecstasy as Nick swallows his cock deep. Ryan strokes Nick's boner as Nick continues to nurse on his. Ryan then strips Nick's jock strap off so he can readily return the favor. He kneels and goes to work on that cock. He slurps and savors Nick's thick 8? cock shoving it so deep down his throat it makes him gag. Ryan takes his time worshipping that cock as Nick helps bob his hot mouth up and down on his throbbing cock. ?How's that feel, Baby?? Ryan coos. Nick then gets back on Ryan's cock for more as he sucks on his cock and getting Ryan hornier for more.Nick's tongue then finds its way to Ryan's smooth ass. ?I wanna see what your ass tastes like?, Nick teases. Ryan assumes the position with that beautiful ass up in the air. Nick fingers that ass and shoves his tongue deep inside it. Ryan moans and groans as he gets that ass rimmed. Nick then moves into position as he slides his cock deep inside. Ryan braces himself as Nick starts to pound away at that ass. Nick is hard as a rock as he impales Ryan. He holds him by the waist as he rails into his insatiable hole. He fucks him doggy getting that ass used to his meat. ?Wanna sit on my dick now?? Nick grins. Ryan straddles him and grinds that hot ass on Nick's pole. Nick then holds him still as he fucks up into his hole. Ryan's own boner springs up and down like a trampoline as he rides Nick's cock. From the couch they move over to the chaise where Nick buries his meat missionary. He slams into Ryan hitting him in all the right spots making him lose his load sooner than he wanted to. Nick jacks Ryan's cock while he's still buried deep inside him making him cum all over himself. Nick then stands and jacks his swollen cock all over Ryan as he drenches him with his load.",
  "models": [
    {
      "name": "Nick Moretti",
      "person_id": 27959
    },
    {
      "name": "Ryan Raz",
      "person_id": 27995
    }
  ],
  "release_date": "2010-10-07",
  "scene_id": 54092,
  "tags": [],
  "title": "Dr.Dad, Scene #02"
}