{
  "collections": [
    "Men Over 30"
  ],
  "description": "Where the boys at? We're not sure but they ain't here. We got all the hot MEN in the house. Brenn Wyson is back and it's his birthday. Making 39 look effortless, Brenn is in for a special treat as Phenix Saint makes his triumphant return. Gone are the surfer locks and boyish body, Phenix has re-emerged very much a man. Short hair, abs and 20lbs + of lean muscles in all the right places-we are loving the new look. These two spell trouble together and it's gonna be a crazy set.  We asked them if they are just as wild at home as they are on set. They both break out in hysterics as they confess they're 10X worse at home. Gotta love 'em. They are both exactly where they want to be in life and appreciate who they've become. Neither of them would change a thing. If these two wrote tell all diaries we couldn't find a bookshelf able to hold them without catchin' fire. We asked where was the craziest place they'd gotten it on. Phenix did it in a packed movie theater while Brenn is a proud member of the Mile High Club. 'I called my Dad and said, 'Dad, I joined the Mile High Club' and he answered, 'Welcome fellow member!' Brenn laughs. The apple doesn't fall too far, does it?</br></br>They don't waste much time with formalities as Brenn pulls Phenix up into a steamy kiss. Phenix slowly explores Brenn's chest as he licks and kisses down Brenn's taught torso. As he moves south he undoes the jeans and licks Brenn's boner as it strains against its cloth confines. Brenn is rock hard as Phenix gropes his cock for a few before freeing it. He goes down on Brenn's throbbing cock as Brenn helps bob his head on his dick. Phenix gets comfortable on his knees as he starts to worship that rock hard cock. He licks Brenn's knob as he looks up with a glimmer in his eye. Phenix then sits back on the chair and watches as Brenn kneels between his legs and goes to work returning the favor. Brenn piston fucks his own throat using Phenix's thick meat. He pays special attention to his Prince Albert piercing. Phenix moans in ecstasy as Brenn swallows his dick, taking it so deep it makes him gag. Brenn looks up at Phenix as he slowly teases his cock with his tongue. Phenix is in heaven as he watches Brenn blow out his 'birthday candle'. Make a wish, yet? 'Why don't you stand up, I wanna fuck you' -Damn, that wish came true quick!</br></br>Phenix suits up as Brenn bends over and offers up that tight hole. Phenix slides his thick dick inside and goes to work. He grabs Brenn by the waist as he starts to slam that thick dick deep inside. Brenn moans and groans as he gets that ass fucked. Brenn jacks his cock as he gets that ass pounded by Phenix. Phenix's smooth balls slap away at that ass as he continues pounding that hole. Phenix can't get enough of that ass, grunting and groaning as he buries his meat. They then move the party over to the couch where Phenix slides that cock back inside that hot ass missionary. Brenn, who is usually the one making the room rock, is now on his back getting his hole stretched wide. Phenix knows exactly what he's doing as he throws his hot cock into Brenn. Brenn is unbridled as he gets Phenix on the floor and straddles him. He starts to ride that thick dick like a jockey. As he rides him, Phenix matches his stride and starts to slam his thick meat up into him. It feels so good that Phenix literally fucks the cum out of him. 'Happy Birthday' Phenix coos, before laying back and jacking his own massive load all over his cum soaked chest. Wish all birthdays were this much fun. (evil grin)",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Phenix Saint",
      "person_id": 27996
    }
  ],
  "release_date": "2010-10-14",
  "scene_id": 54093,
  "series": "Hole Therapy",
  "tags": [],
  "title": "Hole Therapy"
}