{
  "collections": [
    "Men Over 30"
  ],
  "description": "Finally old enough to bring over to the dark side, Dominic Pacifico makes his MenOver30 debut. We've waited a long time to have this hung hottie on our site. He's made many fans on our brother sites so we're the lucky ones this time around. Dominic is 30 (duh) and from New Mexico. He's here and helping us welcome Luke Milan. Luke is 25 years old and from Ohio. We're sure Luke is enjoying our warm and humid winters here compared to the frigid winters back home. The holidays are also rapidly approaching and we wondered what these studs were hoping for this Christmas. Luke wants a new boyfriend while Dominic wants a new car. Each having a different path that brought them where they are today, we asked them when they began to feel comfortable in their own skins as gay men. Luke came out at 23 and was fortunate to have the love and support he needed to make that transition. Dominic decided it best to remove himself from his immediate surroundings; and moved clear across the country to a tiny little place called Key West. He was 16 at the time. We're sure we can leave the rest of that torrid coming out story to your own lurid imaginations. After all it was the 90's! Luke is chillin' on the couch catching up on the latest MenOver30.com webisode on his phone when Dominic walks in. When Luke tells him what he's doing, Dominic grins and says ?Well, you have one right here.? Now there's an invitation you don't hear every day. Luke starts to feel Dominic's smooth abs as they begin to kiss. They slowly undress each other as they make out and Dominic soon stands to give Luke better access at that cock. Luke pulls down Dominic's briefs and then starts to suck on his rock hard cock. Dominic moans as he gets that cock worshipped. Luke savors that meat taking it deep into his throat. Dominic then kneels to return the favor as he strips Luke's jeans off. Luke's thick cock is throbbing in anticipation. Dominic laps at his thick cock before shoving it home. He nurses on that thick dick and playfully slaps his face with it. Luke holds his meaty dick at the base while Dominic goes up and down on his dick like he's bobbing for apples. Luke isn't done with Dominic's cock so he goes back down on it for a bit before Dominic bends him over to get some of that ass. He slides his tongue deep inside that hole as Luke writhes in ecstasy.Dominic then suits up and starts teasing that hole until it gives way. His thick cock slides into Luke's smooth ass as Dominic starts to fuck him. Dominic then puts Luke on his back; holding those legs in the air as he slides back in for more. In this position we get a great shot of that thick cock ramming deep into Luke's ass. Luke strokes his cock as he watches Dominic fucking him. Dominic then sits back on the chair as Luke straddles him and impales himself on that dick. He starts to ride him in a reverse cowgirl as Dominic holds him by the waist and helps bounce him on his dick. ?Awww yeah? Dominic groans as Luke grinds that hot ass down on his meat. At this rate it won't be long before these two need to unload. Luke's riding that cock faster and it sends them both over the edge. They dismount and sit side by side to jack themselves off. Dominic is the first to cum as he drenches his abs and chest. Luke follows suit as he too explodes all over himself. RSS FEED TEXTFinally old enough to [[feature on our site|bring over to the dark side|shine a spotlight on|put on the marquee]], Dominic Pacifico makes his MenOver30 debut. We've waited [[quite a while|for what seems like ages|a long time|a dog's age]] to have this hung hottie on our site. He's made many fans on our brother sites so we're the [[fortunate|favored|blessed|lucky]] ones this time around. Dominic [[is now three decades old|is 30|is the big 3-0]] (duh) and from New Mexico. He's here and helping us welcome Luke Milan. Luke is 25 years old and [[hails|comes to us|ventured here|is originally]] from Ohio. We're sure Luke is enjoying our warm and [[wet|moist|humid]] winters here compared to the frigid winters back home. The holidays are also [[upon us|rapidly approaching|bearing down on us|almost here]] and we wondered what these studs were hoping for this Christmas. Luke wants a new boyfriend while Dominic wants a new [[ride|vehicle|car]]. Each having a [[unique|different|particular|separate]] path that brought them where they are today, we asked them when they began to feel comfortable in their own skins as gay men. Luke came out at 23 and was [[fortunate|favored|blessed|lucky]] to have the love and support he needed to make that transition. Dominic decided it best to [[remove himself from his immediate surroundings|get outta Dodge|hit the high road|seek arrangements elsewhere]]; and moved clear across the country to a tiny little place called Key West. He was 16 at the time. We're sure we can leave the rest of that [[torrid|fiery|intense|powerful]] coming out story to your own lurid imaginations. After all it was the 90's!",
  "models": [
    {
      "name": "Dominic  Pacifico",
      "person_id": 27999
    },
    {
      "name": "Luke Milan",
      "person_id": 28000
    }
  ],
  "release_date": "2010-11-03",
  "scene_id": 54099,
  "series": "Pacifico Rim",
  "tags": [],
  "title": "Pacifico Rim, Scene #01"
}