{
  "collections": [
    "Men Over 30"
  ],
  "description": "You never want to rush a good thing. We certainly know all about that as we entertain Matthew Rush this week. Looking hot as ever the Lauderdale Hunk is back in the house to show us a good time. This week Matt's gonna help us welcome a new face to the MenOver30 fold. This one will be a MenOver30 by injection by the time we're done with sexy Roman Rivers. Roman is 23 and every bit a man. This stud is from Swansea, MA but we're definitely glad he migrated south. We asked Roman to give Matt a suggestion on a good book to read were he to need one on a long journey. ?Read the Art of War ', Roman grins 'because you can use it in any aspect of your life.? Interesting. We asked Matthew the same question and he recommended Roman read ?Excuse Me, Your Life is Waiting?. We then decided to ask Matthew a question we had yet to query: What kinds of men attract your eye? He likes big guys because he's a physical guy. Big chests, big arms and a nice bubble butt are all good lures to land this catch. Roman is new to the man to man table and only a year ago was exclusively sleeping with women. He is glad he discovered there are more things on the horizontal than many other str8 boys will. Well, Roman's about to discover a lot more this afternoon and we're sure he'll get a gr8 rush from it.Getting acquainted is gonna get these two in trouble as Matt puts Roman's hand on his pec and encourages him to explore his curiosity. That leads to kissing as they both start to explore the other. Roman then sits down as Matt stands before him and hauls out his thick cock. Roman's a quick study as he takes it and strokes it. He licks at that swollen knob before going down on it. He looks up at Matt with those bedroom brown eyes as he worships his meat. ?Fuck yeah, suck my cock!? coos Matt as he fucks his mouth. Matt then sits down and slides Roman's shorts off. His cock is rock hard and ready for action. Matt takes that hard cock in his mouth sending Roman into orbit as his throbbing cock finally gets the attention it's needed. Roman is naturally smooth and well defined. Matt takes his time as he licks and savors that cock. Roman soon finds himself on all four as Matt's tongue explores that sweet ass of his. He spreads those beefy cheeks apart as he tongue fucks that hole. The sensation of Matt's skilled tongue rimming that muscular ass is only making Roman want more. Fortunately for him, Matt's got that covered.Matt suits up and sits back and watches as Roman sits on his dick. Roman takes that thick cock deep inside that ass and his own cock is rock hard the entire time. Matt is groaning as that tight ass wraps around his rock hard cock. He bends Roman over and goes right back to tappin' that ass. His cock glides in and out of that hungry ass with ease as Roman takes it deep. Matt's cock is driving Roman crazy as he gets fucked silly. Matt's muscles are writhing as he holds Roman by that tight waste and repeatedly impales him back onto his thick meat. They then go missionary as Matt holds those soccer legs in the air before zeroing in on that ass he wants more of. He shoves his cock back inside and picks up where he left off. Roman is moaning as Matt continues to use that tight ass to milk his load. Matt fucks away at that ass amazed at how good that tight ass feels. At this pace it won't be long before these two cream. Roman's jerking his cock off as Matt fucks him harder. That does the trick as they dismount and jack off side by side sending their thick loads flying all over themselves.",
  "models": [
    {
      "name": "Matthew Rush",
      "person_id": 27951
    },
    {
      "name": "Roman Rivers",
      "person_id": 27997
    }
  ],
  "release_date": "2010-10-21",
  "scene_id": 54096,
  "tags": [],
  "title": "Roman HOLE-iday, Scene #02"
}