{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today we have a newbie hailing from Orlando, FL Max Sinclair is making his first episode today. We're fortunate to be the very first to introduce this muscular, Puerto Rican hottie to the rest of the world; and in such vivid detail. Max is a refined soul and enjoys relaxing at home with a good book. His favorite author at the moment is Nelson DeMille and of his works his favorite would have to be ?Cathedral?. Max used to write but hasn't in a while. We asked if he was to write his own autobiography what the title would be. ?Let's See What Happens Next? would be the title; and if they made it into a major motion picture he'd want to play the lead role himself. In that autobiography he may mention how he lost his cherry at the tender age of 17. It wasn't a great experience since a car is never an accommodating place for that. Max gets plenty of attention from gay men and at 36 he's secure enough in his sexuality to take it as a complement. Max is pretty open and admits the wildest sex he's ever had has been with a wild girl that had a strap on and used it on him. He admits that he kinda enjoyed it and tried it a few more times. Hark! Could this be a bit of shameless foreshadowing?? ...Stay tuned.Max starts off slowly as he looks right into the camera and gives us a coy wink. Oh, this is gonna be good. He slowly stretches as he slowly feels his massive chest and arms. When he's ready, Max takes off his shirt. His dedication at the gym has really paid off and his broad shoulders and back vee into a small, muscular waist. Adding to Max' sex appeal is the fact that his deliciously defined frame is coated in fur that he keeps closely trimmed. Some of us here at MenOver30 appreciate our men au natural. As he drops his jeans we get to see his firm muscular ass atop his well developed quads. He slowly pulls down his boxer briefs showing us that ass of his a bit at a time. We have to admit we totally understand why a couple women would want to play with that hot ass (let alone what we might wanna do with it!) He pulls his briefs back up and then sits back down to stroke his cock inside his briefs a bit before hauling out his thick cock. His briefs finally hit the floor as he begins to give his dick the attention it deserves.He spreads his muscular thighs as his smooth balls settle into place. He lubes his cock up as it grows in his hand. Max' eyes close and his full lips part as he loses himself in the rapture he's feeling. He stands to give us an even better view of his defined frame and we get an amazing view as the camera pans up over his sexy, furry frame. ?I'm so fucking horny' he teases with those sexy eyes, ?...I wanna cum all over you!?  Line forms to the right, Gentlemen. (...Single-file please) Max bends over and shows off that spectacular ass as he slowly writhes for our enjoyment. His hot ass has is mostly smooth with just the right amount of hair as you move closer to pay dirt. As the camera moves overhead, Max looks back over his muscular shoulder and gives us a devilish grin. This guy knows exactly what he's doing. We have a feeling he loves getting attention as much as gay boys love giving it to him. Max then flips over and gets to work on his now throbbing cock. His cock is ready to go as his balls pull up closer to his shaft. He groans in ecstasy as his cum splatters atop his happy, hairy trail. We definitely hope we see a lot more of Max and if there's a compromising position in his future ...we're all for that, too!",
  "models": [
    {
      "name": "Max Sinclair",
      "person_id": 28003
    }
  ],
  "release_date": "2010-12-02",
  "scene_id": 54108,
  "series": "Max Exposure",
  "tags": [],
  "title": "Max Exposure, Scene #02"
}