{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we get to appease all the requests we've gotten for more of David Chase as we welcome him back to our studio. It's hard to get enough of this 6'3 stud so we're always glad when he's around. Joining David is a recent discovery we first met on our brother site ExtraBigDicks.com when Ethan Ayers found himself in the midst of a steamy threesome. Ethan is originally from Austin, TX and we know he'll be just as well received here. Though we assure you it will be Ethan that will be doing the receiving.  We asked these studs if they were to inherit $10K and had to keep half and give the second half away, who would they donate the $5K to and what would they spend their $5K on? David would donate the money towards a charity that helps homeless children, a noble cause indeed. The second half he would use to buy himself a boat so that he could go fishing...a lot! Ethan has his $5K earmarked for St. Jude to help out with pediatric cancer research, another amazing organization. As far as his half, he would invest some of it to make more money; and probably take a nice vacation to somewhere like Greece perhaps. Sounds great and we all know they could use the money. Well all 'grease' aside, we need these two to get naked, grease up and get their ?Greek? on!David walks in all sweaty after a hard workout as he strips off his clothes. David's been hitting the gym and it shows. While he's rinsing off, Ethan finds and starts to sniff David's sweaty jock strap which gets his cock hard. David catches him in the act which leads to a lot more than just sniffing his jock. They start to kiss as their tongues start to roam. Ethan's 8? cock is throbbing by the time David hauls it out of his briefs and goes down on it. David works that sweaty cock for a while before sitting back and letting Ethan return the favor. Ethan goes down on his dick as he strokes it and lets his tongue roam south to lap at David's balls. David moans as Ethan looks up at him with those bedroom eyes. David loves the attention he's getting on his dick; but he's not done with Ethan just yet. He slips onto the floor, tosses his head back and orders Ethan to sit on his face. Ethan straddles him as he gets that hot hole tongue fucked. He moans as David eats that ass out getting it ready for more. ?You ready to get fucked?? David teases as he moved into position. He suits up before sliding his thick cock inside that ass. Ethan's ass gives way as David starts to fuck him deep. Ethan grabs David's sweaty jock again and buries his face into it as he gets his ass fucked silly. David grinds into him and after a bit decides he wants some of that thick dick too. Ethan is more than happy to oblige as he sits back on the couch. David straddles his thick cock and sits right down on it. Ethan's thick cock fills that ass up as he starts to slam up into David. David grinds away on that cock, riding that dick like a hell-bent jockey. Ethan then gets David on his back before sliding his thick dick back inside for more. David's jacking his dick faster and faster as Ethan buries his thick dick over and over. The sensation sends David over the edge as he unloads as Ethan pounds away. Ethan then pulls out and unloads all over David as well leaving him spent and cum covered.",
  "models": [
    {
      "name": "David Chase",
      "person_id": 27963
    },
    {
      "name": "Ethan Ayers",
      "person_id": 28002
    }
  ],
  "release_date": "2010-11-24",
  "scene_id": 54103,
  "series": "Sexual Aroma",
  "tags": [],
  "title": "Sexual Aroma, Scene #01"
}