{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have 2 blasts from the past this week as we welcome back local hottie Dallas Reeves and Chicago based, Chad Brock. It's been a while since we've seen these two but judging from the look of them, they've been keeping themselves in tip-top shape. The holidays are upon us and at Thanksgiving we often wonder what boys like these actually eat; while the rest of us are discretely unbuttoning our pants after dinner. Chad admits that stuffing is top on his list when it comes to Thanksgiving dinner. Dallas concurs and agrees that stuffing is tops for him as well. Speaking of tops, Dallas prefers to top on set and only bottoms for his partner back home. Chad mostly bottoms on cam but says in his personal life he's a bit more versatile. They're both partnered in their real lives and at times it gets tricky to keep those two worlds from colliding. On occasion jealousy will rear its head and it needs to be addressed since they do what they do as a job not a recreational past time. We then wondered what makes them both go nuts in bed. Dallas' neck and ears will get him rock hard in seconds while Chad loves is nuts worked. Giving you all the inside scoops on what to do when you land porn stars?one more thing to be thankful for today. ...Gobble, gobble, bitches.Discussing Thanksgiving plans, Chad and Dallas start reliving last year's festivities. Festivities which involved whipped cream. Hmm. Dallas just happens to have a can handy. (GO Figure!) He moves over to Chad and feeds him some as well as playfully licking some off his hairy chest. Chad is hard in seconds as Dallas helps him out of his jeans. They make out as Dallas jacks Chad's cock. Dallas then strips and slides to his knees so he can get better access to that cock he wants. He starts to nurse on Chad's dick as Chad sits back and watches his cock disappear. Dallas then stands as he offers Chad something to eat as well. Chad pulls off Dallas' boxers and opens wide. Dallas' cock is rock hard as Chad starts sucking on it. Chad then gets up to make out with Dallas as their cocks grind and slap against each other. ?En guard!? Before a fencing match breaks out, Dallas sits back and watches as Chad kneels to worship his thick cock. Dallas bites his lower lip as the sensation on his cock makes him shiver. But wait?there's more. Chad then gets our top boy on the couch and slides his tongue deep inside that smooth ass. Such a tease. He can eat it...but he can't have it. lolChad gets up and slaps his cock on that ass getting way ahead of himself as Dallas gets up and cools that idea. Chad is soon the one bent over and waiting for his hungry ass to get the dick it needs. Dallas is more than happy to oblige as he shoves his cock deep inside.  He starts fucking that ass with ease as Chad takes every inch of cock Dallas can thrust his way. Chad then gets put on his back as Dallas gets back to business fucking him missionary. He holds on to Chad's knees as he bounces Chad back onto his meat repeatedly. That ass feels great wrapped around his thick cock. Dallas isn't done with this ass yet as he switches things up and has Chad straddle his dick and sit on it. Chad bounces up and down on that thick cock and it proves too much to handle. He jacks that dick while Dallas cock is making out with his prostate. He erupts sending his load flying. Dallas isn't far behind as he shoots his own load all over Chad's face and chest. It's finger licking Thanksgiving for Chad this year. Here's hoping yours at home is just as wonderful. Happy Thanksgiving from everyone at MenOver30",
  "models": [
    {
      "name": "Chad Brock",
      "person_id": 27925
    },
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    }
  ],
  "release_date": "2010-11-18",
  "scene_id": 54106,
  "series": "Brock & Roll",
  "tags": [],
  "title": "Brock & Roll, Scene #02"
}