{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have Matthew Rush back in the house and he's here to help us welcome a new hottie to the club, Mr. Nikko Alexander. Nikko is 25 years old and originally from Houston.  Nikko is a smooth hottie with washboard abs and a bad boy look.  We asked these studs about their take on recent events. Bullying is a topic that resonates with both of them. ?...Nobody should be committing suicide for being bullied. Nobody should be bullied period? says Matthew who finds the current situation heart breaking. Nikko agrees and feels if you choose to live your life you should be allowed to without being harassed. Matthew wasn't the scrawny geek he was back in high school by the time he came out. Once he hit the gym and bulked up he found his self confidence. That made it a lot easier to come out without fear of being bullied. When it comes to men and who these studs find irresistible, Matthew admits some of the hottest men he's ever met have been from South Africa. Nikko, the self professed bisexual, admits he doesn't really have a type. Whatever's clever for this stud. When it comes to turn-ons they both agree that they'd rather watch people fuck than be watched. Well don'tcha just love the irony in that? Wrapping up a tour of the house, Nikko tries to sway Matthew into putting in an offer. Matt isn't convinced if it's right for him. Nikko assures him it is and then sweetens the offer by adding a personal touch. He kisses Matt's neck as he starts to undress him. Soon Nikko is on his knees and pulling off Matt's briefs as his thick cock springs free. Nikko opens wide as he takes Matt's thick cock deep in his mouth. He works the shaft getting as much of it a he can. He sucks on his smooth nuts making Matt's cock even harder. Nikko then stands as Matt helps him out of his underwear. Nikko's uncut cock is rock hard and his massive balls are backed up and in need of release. Nikko goes back down on Matt's cock as Matt moans his approval. As Nikko sucks off Matt we get a spectacular view of his tight muscular ass. Nikko looks up at Matt as he continues to service his thick dick. ?Play with your hole while you're sucking my cock? Matt orders as Nikko obliges. Matt then gets Nikko on the couch and finally returns the favor as he wraps his lips around Nikko's cock.Nikko's moaning as Matt worships his thick cock and heavy balls. ?I think you should eat my ass? grins Nikko as Matt bends him over on the couch. He dives into Nikko's hot hole tongue first as Nikko quivers at the sensation. Matt then suits up and watches Nikko sit on his cock. Once he gets that thick dick inside he slowly starts to take that dick. Matt starts to push more and more of his dick inside as Nikko does his best to accommodate him. Nikko lays back onto Matt who continues burying dick up into him. Matt then gets Nikko on his back and slides that dick back in for more. Nikko's ass is so tight Matt's having trouble getting his thick cock all the way in. Matt picks up the pace and starts to slam that dick all the way to the hilt. Nikko is loving it as he gets that hot ass stretched wide. Matt then bends Nikko over and takes that ass doggy. Nikko can't get enough as he bucks back onto Matt's cock. Matt pounds him faster and faster and soon pulls out as he explodes all over Nikko's hot ass. Nikko then flips over and jacks his thick load all over his delicious abs. ?How's that for a down payment?? lol",
  "models": [
    {
      "name": "Matthew Rush",
      "person_id": 27951
    },
    {
      "name": "Nikko Alexander",
      "person_id": 28001
    }
  ],
  "release_date": "2010-11-11",
  "scene_id": 54102,
  "series": "Real ASState",
  "tags": [],
  "title": "Real ASState, Scene #02"
}