{
  "collections": [
    "Men Over 30"
  ],
  "description": "The Holidays are finally coming to an end and with that goes all the stress brought on by the Holiday rush. Fortunately we have the perfect solution for all your woes. We've decided to fight the rush with more Rush. Matthew Rush is in the house and who better than Matthew to send off 2010? Matthew was born in Pennsylvania and acquired a degree in Exercise Physiology along with quite a stellar career in front of the camera. Matthew is looking better than ever and he's gonna help welcome back Sebastian Keys who wanted to be a part of our last shoot for the outgoing year. Sebastian is 20 now and enjoying the break from Boston temps while down in Miami. Looking towards the next year we wondered what these two were excited about. ?Turning 21 this spring? beams Sebastian who has Las Vegas plans. Matt's just excited to get a chance to start over in the coming year. We asked what the highlight of 2010 was for these two. ?Working with MenOver30? grins Matt. Hmmm. Smooth operator this one. Lol Sebastian really enjoyed all the traveling working in the industry afforded him. We then asked these two if porn stars actually jerk off. ?Gay erotic video personalities? retorts Matthew with a disapproving raised brow. Well! ?what were WE thinking? Sebastian jacks off to anything and everything as many times as he can during the day while Matt gets his once a day in. On that note, let's give you something to jerk to at home... Toasting to the New Year, Matt and Sebastian talk about how much craziness and drama there is surrounding the New Year but never enough sex. Well say no more because that's easily remedied as they decide to stay home and do something about it. They start to make out as layer after layer of clothing meets the rug. They're left in their briefs as they grope each other. Matt wants more as he pulls off Sebastian's briefs and goes for it. ?That feels so good? coos Sebastian as he watches Matthew swallow his cock. He works Sebastian's thick dick to the hilt a bit before Sebastian wants to return the favor. Sebastian kneels between Matt's massive quads and gets to work worshipping his thick dick. Matt grunts and groans as he watches his dick disappear into Sebastian's throat. ?I love your big cock in my mouth? coos Sebastian before getting right back on that dick. Matt then stands to have better access to that hot mouth. He fucks Sebastian's face as Sebastian greedily takes every inch of dick he's given. They then get into a hot 69 on the couch getting even hotter as they prepare for more ?festivities.?Sebastian moves over to the couch and gets into position while Matt suits up and gets that cock ready for some ass. Sebastian holds still as Matt takes that ass. Matt is soon fucking away at that ass with ease as Sebastian begs him for more. That hot ass needs some dick and Matt's ready to take care of that situation. Sebastian grunts in pleasure as Matt pounds his hole. Matt then gets Sebastian to get on the floor and flip his legs up over his head so he can have perfect access to that ass. He slides his meat back in as he starts to pile drive that meat. He points that dick south as he starts to ride.  Matt is doing squats into Sebastian's hungry hole that can't seem to get enough. Matt then moves Sebastian back to the couch where he gets him on his back. He lifts those legs up and fucks that hot ass missionary. Matt pounds away at that ass as Sebastian starts to jack his throbbing cock off.  Matt pushes that dick as deep as he can while Sebastian gets closer to climax. That thick dick does the trick as Sebastian goes over the edge. He explodes shooting his considerable load all over his sweaty chest and abs. Matt isn't too far behind as he pulls out and shoots all over one cum drenched Sebastian. Fuck 2010 we're off to bigger and better things and just in time too. 3, 2, 1...Happy New Year from all of us at MenOver30.com!",
  "models": [
    {
      "name": "Matthew Rush",
      "person_id": 27951
    },
    {
      "name": "Sebastian Keys",
      "person_id": 27966
    }
  ],
  "release_date": "2010-12-30",
  "scene_id": 54115,
  "tags": [],
  "title": "New Year's Sleaze, Scene #01"
}