{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brock Russell is back on set and we're happy to see him. Down from his home base of Cape Cod, our Wisconsin born, 37 year old Brock is in Miami getting some winter relief. Helping things heat up for Brock is 20 year old AJ Banks. Nobody does heat better than a Florida native and Daytona boy AJ knows all about that. We were curious where these guys like to take a date. Brock likes small intimate bistros that lend themselves to creating a romantic experience. AJ is more of a sushi and sake guy. As for the male body, we wondered what part they liked best. Brock loves eyes and that's his first draw. AJ likes thicker girls; so he likes more cushion for the pushin'; but he also likes eyes and they have to have nice teeth. A busted grill is a deal breaker.  As for sex we wondered what makes their dick the hardest. Brock likes fucking ?Everything else is foreplay.? Brock is truly versatile so he likes it all. AJ loves face fucking to get his cock hard. AJ has learned a lot about his sexuality. ?You learn a lot about yourself doing gay porn because other people will tend to judge you by what you do rather than who you are.? Wise beyond his years we might need to turn AJ on to some classic Gloria Gaynor who summed up that very sentiment with ?I Am What I Am? On that note, we are what we are?horny to see some fucking!  ROLL EM!Brock gets back from the gym and tells AJ about his workout and the hot guy he saw in the locker room. ?I didn't know you were into guys? blushes AJ. ?I can show you just how much I'm into guys? Brock says as he moves in for a kiss. They make out as they let their hands roam. Brock stands up and drops his shorts to give AJ better access. AJ gropes his cock a bit before hauling it out of is underwear. Brock is rock hard and AJ gets to work sucking on that cock for him. Brock wants to get in on the action as well and sample some of that str8 meat. He pulls AJ up so he can get down on his cock. AJ moans as Brock starts to nurse on his fuck stick. ?Suck the head like that? groans AJ before face fucking Brock. Brock swallows every inch he's given as AJ slaps his face with his dick before slamming in for more. They stand and make out a bit before Brock puts AJ's mouth to better use. AJ loves that dick so much that Brock wants to show him something else?his hot ass. He bends over and shows off his hot hole.AJ is in awe of that hot ass and he suits up and sits back. Brock can't resist that rock hard cock as he sits on it and starts to fuck himself with it. He rides AJ taking that dick all the way to the hilt. ?You like that cock?? AJ grunts as he gets his dick serviced. He grabs Brock by the waist as he helps bounce him on his cock. They move the party south to the floor where Brock gets on all four so that AJ can take him from behind. AJ slams in deep and starts to pound that hot hole. He slaps that hungry ass as he claims what's his. Brock loves that dick owning his hole and he can't get enough of it. An over the shoulder shot gives us a great view of just what AJ is looking at as his cock disappears inside Brock. AJ then gets Brock back on the couch where he lifts his legs and gets back inside him. He fucks that ass harder as he plows into Brock. He picks up the pace fucking Brock like he does his girl?on her back with her legs in the air. That hot ass brings him over the edge as he lies back and shoots a massive load all over himself. He sprays his nut all over his sweaty chest and abs. Brock cums seconds later as he shoots his thick load on his smooth abs. Whew. This is definitely the season to be jolly.Happy Holidays from MenOver30.com!",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "AJ Banks",
      "person_id": 28005
    }
  ],
  "release_date": "2010-12-23",
  "scene_id": 54113,
  "tags": [],
  "title": "HOLE-iday Cheer, Scene #01"
}