{
  "collections": [
    "Men Over 30"
  ],
  "description": "Just when you thought it was safe to look under your tree; you'll never guess who popped out from under ours. Illiois born Troy Halston is back and looking hotter than ever - in fact, 41 has never looked so hot! It's been a while since we've seen this industry veteran. He's been keeping busy as well as staying fit. We also have another surprise that's delicious regardless of the season, 26 year old, New Yorker Ryan Raz. We asked these two kids what their favorite Holiday memories were. Ryan beams and confesses getting his Cabbage Patch doll. We're guessing he was 24 at the time. For Troy, it would be watching the little ones unwrap their presents alongside the Mrs. Halston.  Looking forward to New Years we wondered who they would love to spend New Years Eve with. Ryan is already spending his New Year's with the person he wants to spend it with but he's remaining tight lipped on the details. Troy, who's about to be single after 16 years of marriage, isn't sure what he'll be kissing this New Years Eve. We're pretty sure this Godfather of Bi porn will be just fine. To wrap up our chat we asked Ryan to think back over the years and tell us what his hottest on cam memory was to date. ?I think it would have to be getting fisted a few years ago...that was pretty good.? How do you follow that? ...And now, the weather. :)Troy is playing with a snow globe when Ryan walks up and gives him something better to play with. They start making out as they undress each other. Ryan gropes at Troy's cock as he undoes his pants. Troy strips giving Ryan an all access pass to his thick cock. ?How's that cock taste?? coos Troy as Ryan sucks his cock deep. Ryan swirls his tongue around Troy's throbbing shaft as Troy watches in amazement. Troy then wants to return the favor. It's been a while since he's had some male to male action. Ryan's thick cock is ready for the attention as Troy starts to worship his meat. Ryan loves the attention he's getting but he wants more of Troy's bone. He gets on his knees so that Troy can fuck his face. He teases Troy as he sucks his cock, lapping at his smooth shaft and balls. Troy can't get enough as he holds Ryan by the back of his head so he can fuck his throat deeper. Ryan doesn't skip a beat as he easily deep throats every inch he's given. Troy then gets on his knees and starts to eat that ass he'll be sliding into next. ?You like that, Boy?? Troy teases. We're sure that was a completely rhetorical question.Troy suits up and starts to tease that smooth hole with his hard cock before slamming inside. Ryan groans aloud as he gets his ass stretched wide. ?I can tell you've never really been fucked by a man? Troy grunts. (Shhh...we're just gonna let that one slide) lol He holds on to Ryan's shoulder as he bucks that cock deeper into that hungry hole. He then gets Ryan on the floor with his legs in the air. He aims his rock hard cock south as he buries it in for more. He fucks away at that smooth ass as he repeatedly squats into that hot hole. Ryan loves the fucking he's getting and the attention it's giving his prostate is making him ramble in tongues. He can't get enough dick as they switch it up and he climbs back onto Troy's cock for more. He impales himself back on that cock in a reverse cowgirl position as he rides that dick like a pogo stick. He grinds that hot ass down on that dick wanting to get all of it in him. That does the trick as he arches back and explodes all over himself. His asshole tightens around Troy's cock which just makes him wanna blow too. He bends Ryan over and creams all over his back. Eggnog, anyone? ...Ok?that was just wrong! lol",
  "models": [
    {
      "name": "Ryan Raz",
      "person_id": 27995
    },
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2010-12-16",
  "scene_id": 54111,
  "series": "Troy Story",
  "tags": [],
  "title": "Troy Story, Scene #01"
}