{
  "collections": [
    "Men Over 30"
  ],
  "description": "Starting off the New Year is crucial and we didn't want to start off on the wrong foot. So we enlisted one of the hottest in the biz to ?ring? in the New Year, Brenn Wyson. Who better than our Boxer from Boston to knock out our first week and help welcome our latest find, Al Carter? Al is 28 years old and we can thank New York for this fine specimen.  We asked these studs how they felt about it being 2011 and what they expected we'd have by now. Brenn thought there'd be more robots running around by now. Al wishes we had flying cars by now, so he can have a book bag with a rocket on it like Elroy Jetson. As for modern technology we wondered what their favorite item they couldn't live without was. Brenn loves his ?compyutah? while Al loves his cell phone. We then asked what they liked to use to spice up their sex lives off camera. Brenn likes a little leather, some rope. Al loves the Gladiator thing. He likes to dress up and knock each other around in theme costumes. We wondered what gets them off the hardest and for Brenn it's the passion. Just knowing they're so into him it makes him cum. Al as well loves when a guy is just drooling and ready to go down on him. Well, we're ready for a lot more than talk...The chemistry is apparent between them as their hands start to roam. They kiss as they begin to peel layer after layer of clothing off. Brenn unzips his pants giving Al access to his throbbing cock. Al playfully nibbles on that cock through his briefs before hauling it out and going for it. Brenn gasps as Al swallows his cock to the hilt. He nurses on that thick cock with ease as Brenn starts to fuck his face. Brenn is rock hard as Al worships his thick meat. Then it's Brenn's turn as he kneels before Al to give him some in return. He opens wide and rams his cock down his throat. ?Yeah choke on that dick? Al grunts as Brenn gags on his meat. Brenn spits on his cock making it sloppy and wet as he continues to suck on that hard cock. Brenn then sits back and lets Al have more of his cock. Al gets down and strokes that dick double fisted before wrapping his lips around it some more. That hot mouth is driving Brenn wild as Brenn groans and slaps Al's face and mouth. Brenn's cock is rock hard and it's gonna need a lot more than Al's mouth in a minute.?Lemme see that fucking hole? orders Brenn as he teases Al's smooth ass running his finger along Al's hole telling him how bad he wants to fuck him. Al straddles his meat and sits on it. Brenn moans as he starts to slam his cock up into Al's hot ass. Brenn's hard cock is getting a work out until they flip. Brenn gets bent over the couch as Al suits up and slams inside. ?Aww fuck me, fuck me...? Brenn chants as he begs Al for more. Brenn can take it as well as he can give it as he gets that hot ass stuffed. He can't get enough of Al's dick and every time Al slows down Brenn orders him to keep fucking his ass. Al watches as his rock hard cock disappears into Brenn's muscular ass. Al then sits back and has Brenn ride his cock. Brenn sits on the dick in a reverse cowgirl position and starts to ride that meat. Brenn is bouncing on that thick dick like he's on a bouncy ball ramming that dick deep into his ass. Al's cock is hitting him in all the right spots and Brenn can't help but explode with Al still buried inside him. Al strokes Brenn's cum covered cock as he goes right back to slamming his cock into Brenn's ass. Al's not done and Brenn's ass is gonna have to step up. Brenn gets his ass plowed until Al is ready to unload and shoots his load all over Brenn's smooth abs. Whew.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Al Carter",
      "person_id": 28006
    }
  ],
  "release_date": "2011-01-06",
  "scene_id": 54118,
  "series": "Daddy Gaycare",
  "tags": [],
  "title": "Daddy Gaycare, Scene #02"
}