{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back for more this week is Max Sinclair. Yes, our hot beefy str8 boy from Orlando, FL is here to see what it would feel like if it wasn't a strap on in that hot ass. C'mon, he should have known that letting girls use a strap-on on that outrageous ass of his would only peak his curiosity for the real thing.  We're peaking in all sorts of places already just thinking about it. Helping out this week is a sexy newcomer, Steven Daigle. Steven is 37. He's originally from San Diego, CA.  Steven may look familiar and he gets recognized since his appearance on Big Brother. He doesn't mind at all. He wasn't on there for long; but admits he was his ?happy? self while he was there. Had he been there longer he might've had to show a different, more conniving side, of Steven. Being on camera 24/7 however, gave him a whole new perspective on being comfortable around them. It has come in great in the adult industry since he can perform without inhibitions. Speaking on ?perspective?, Max walks away with a new one in regards to the fun you can have on the other side of the sexual fence. Steven left the kind of impression we all hope to, as a completely satisfied Max grins and admits that even though this was his first cock ever...it won't be his last. Steven clearly wins Immunity!  lol?Have you ever been 'pegged' by a girl?? asks Steven as Max gives him a confused look. ?Pegging? is when a girl uses a toy or a dildo on your ass. Max grins and concedes that he has, in fact, been pegged. Steven grins and tells him that if he likes the pegging as much as he says, he'll definitely like the real thing. Steven praises Max on his defined frame making him more at ease. Steven plays to his strengths as he asks Max to show off for him. Max obliges as he start to flex and pose. Steven can't help but want to feel that for himself. He gropes at Max' crotch and abs as Max starts to bone up. Steven drops to his knees and frees Max' cock that is already throbbing for attention. Str8 dick is what's for lunch as Steven greedily gobbles it up. Max just watches as he gets his first blow job from another guy.  Steven knows exactly what he's doing as his fingers start to flirt with Max' back door. Steven then stands and frees his own raging cock giving Max something to play with. Max dives right in as he takes Steven's thick cock deep inside his hot mouth. Steven just groans as Max does his best to return the favor.Steven has him where he wants him and to seal the deal he gets Max bent over on the couch. He spreads his muscular cheeks apart before going in tongue first. Max just groans as he gets his ass rimmed. He holds his cheeks apart so that Steven can get that hot tongue deeper inside him. Steven then gets into position and starts to slide his big cock home. Max just grunts as he gets what he's needed all along?a real cock in that tight ass of his. Steven slowly picks up the pace and is soon fucking Max. Max' tight ass grips Steven's cock making him moan and groan at the sensation. Steven breaks that ass in doggy style before reconvening on the floor. Max squats on that cock and begins to ride it. He braces himself on the chair's edge and does dips repeatedly onto Steven's meat, fucking himself silly. Steven then gets him on his back and slides back inside for more. He pounds away at that ass missionary deeper and harder as they both near climax. Steven can't hold back any longer and pulls out before unloading a cum-drenching all over Max' hairy chest and abs. Max then strokes off his own rock hard cock as he adds even more load to the mix. Welcome to the club, Max; Steven's just earned himself a toaster oven.",
  "models": [
    {
      "name": "Max Sinclair",
      "person_id": 28003
    },
    {
      "name": "Steven Daigle",
      "person_id": 28004
    }
  ],
  "release_date": "2010-12-09",
  "scene_id": 54110,
  "tags": [],
  "title": "Daigle-ing Modifier, Scene #02"
}