{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a familiar face on MenOver30 as we welcome back Diego Vena. For those of you unfamiliar with the 32 year old from South Bend,Indiana, he's amassed quite the fan following and today brought along his #1 fan, Brody Alexander. Brody is a baby faced 24 year old that recently moved to Miami from Chicago. Well they can thank GRINDR for their newfound relationship. Who knew!?  Lol Diego was drawn to that beautiful face and that Brody really cares about him and shows it. Brody also likes that Diego goes out of his way for him as well and as for the physical aspects he can't narrow it down to just one. Awww. They've been together 5 months now so it's gotten complicated thinking about doing other scenes with other actors. As for fantasy shoots, Diego would want to have a scene with his beau in a locker room or after a work out somewhere while Brody wants to become a Mile High Club member. That would make for some tight camera work in those roomy bathrooms. Lol Well today these two lovers are gonna give us a birds eye view of what they get plenty of at home. Fasten your seat belts, Boys. They start making out passionately on the couch as their hands start to roam. Diego's hands grab at Brody's cock before the layers start to slowly come off. Diego lies back as Brody washes over his smooth pecs with a wave of tender kisses. His jeans come off as Diego stands to give his lover something to play with. Brody dives into that crotch face first as he licks at that meat trough its cotton confines. Diego won't be kept waiting for long as Brody wraps his lips around his cock. ?Suck that dick, Baby? Diego coos as he starts to fuck his face. Diego's eyes roll back as he gets that cock pleasured.  Diego then gets down so he can give back; as he wraps around Brody's Midwestern meat. ?You like that?? he moans before shoving it back down his throat. Diego can't get enough of that thick cock and Brody's not complaining. Brody then takes his turn doing the face fucking before they land in a hot 69. Diego takes top bunk as he does pushups into Brody's hot mouth. Diego sucks on Brody's cock but soon turns his attention elsewhere. Brody bends over and offers up that hot ass. Diego tongue fucks that sweet hole getting it ready for more...Diego pushes his cock into Brody's hole and starts to pound him doggy style. Brody bucks back taking every inch he's given. Next it's Brody that's suiting up as Diego straddles that meat. He winces as Brody's thick cock makes its way inside. Once he gets used to that meat, Diego starts to ride that cock. He plays with his cock as Brody helps bounce him on his cock. Diego leans back as they kiss with Brody completely buried inside him. Brody then switches it up and gets Diego on his back and starts to fuck him missionary. Diego loves that dick and begs Brody to fuck him harder. Brody pounds away at that hot ass faster and deeper driving Diego crazy. ?Gimme that dick, baby? moans Diego as he gets that hole pounded over and over. Diego can't help but jack his dick as Brody takes his ass and it makes him nut. He explodes all over himself as Brody keeps ramming into him literally fucking the cum out of him. Brody then lies back and jacks his meat as Diego licks and sucks his nuts. Diego gets so turned on he busts a second nut all over Brody's chest. Diego's done and orders his boy to the shower. Never send a boy to do a man's job they say. We couldn't agree more.",
  "models": [
    {
      "name": "Brody Alexander",
      "person_id": 27824
    },
    {
      "name": "Diego Vena",
      "person_id": 27984
    }
  ],
  "release_date": "2011-01-13",
  "scene_id": 54120,
  "tags": [],
  "title": "Hot Dad, Horny Lad, Scene #02"
}