{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back with us this week is our favorite 'thirty something' hottie, Matthew Rush whom was more than happy to help us with our newest member to the 'MenOver30-by-injection' club, Seth Knight. Seth is a hot 20 year old guy from Wichita Falls. Seth is new to the industry and has proven he can hang with the big boys. Matthew, for those of you who didn't know, loves to read. His latest book is one by Chelsea Handler. He likes books that either make him laugh or help to improve himself. Seth isn't much on reading. Seth went to school for Cosmetology; so on his spare time he does people's hair. They're both pet people and have dogs. Seth has a huge Mastiff-Shepherd mix while Matthew has two, a pug named Egg Roll and a Jack Russell Terrier named Butch. Awww. We often see Matthew topping on cam and wondered what gets him to bottom in his personal life. 'I'm a sucker for romance' says Matthew who says a little sweetness and food will get him to put out. Seth, on the other hand, is more than happy to have Matthew top since he has been looking forward to this ever since he found out who his co-star would be. Let's not keep the newbie waiting...Matt and Seth are discussing Seth's first scene and how he'd much rather try doing one with someone more muscular. Go figure. 'Well, you haven't really done a scene; unless you've done a scene with me.' You don't have to tell Seth twice; who jumps at the chance. They start to kiss as their clothes come off. Seth is in awe of Matt's chest and biceps as he lets his tongue do the talking. He licks his way across Matthew's defined frame. He grabs at Matt's hard cock in his briefs as he continues to lick at his nips and pits.  Matt then drops his briefs to let Seth have at his raging hard on. Seth kneels and swallows every inch. Matt groans as the newbie shows off his oral skills. What gag reflex? Seth swirls his tongue around Matthew's cock head for a while before Mat decides to return the favor. Matthew gets down between Seth's legs and starts to blow him launching the new guy into orbit. But wait...there's more. Matt then bends him over on the chaise to get at that smooth ass. He shoves his tongue deep into Seth's hot hole. He laps and slurps all over that ass getting it ready for a lot more than a French kiss... <evil grin>Seth then backs that ass up right onto Matt's dick. Matt holds Seth by that taught waist as he starts to slam his cock deep inside him. 'Work your ass' Matt grunts as he gets his cock milked. Seth moans in a mix of pleasure and pain as he struggles to accommodate his intruder. Matt watches as his thick cock disappears inside that compact ass. Seth knows how to get what he wants as he starts to buck back onto Matt's dick. Matt is slamming his dick deep as they fuck themselves silly. Matt then sits back and watches as Seth sits on his dick in a reverse cowgirl. Seth does all the work as he bounces on that dick like he would a bouncy ball. Matt is in awe as he watches the new guy work his thick dick with ease. Matt then gets Seth on his back to he can fuck him missionary. He slides his cock back in for more as Seth orders him to fuck him harder. Matt is getting a work out as he pounds away at Seth's hungry hole. Cardio?...check! All that pounding sends Seth over the edge as he creams all over his smooth abs. Matt's not far behind as he shoots his load all over himself. Well, it's official: Seth's finally had his first Matthew approved scene. lol!",
  "models": [
    {
      "name": "Matthew Rush",
      "person_id": 27951
    },
    {
      "name": "Seth Knight",
      "person_id": 28008
    }
  ],
  "release_date": "2011-02-03",
  "scene_id": 54126,
  "series": "Knight Sweats",
  "tags": [],
  "title": "Knight Sweats"
}