{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today we have a hot duo as we welcome back Troy Halston and Brock Russell. Troy will soon be 41 and having been in the business for over 20 years, this Illinois native  still makes it look easy. Brock is now 37 and is from Wisconsin but calls Cape Cod home. They both are in peak physical shape and looking better than ever. We wondered if there was any one procedure they would want done if cost wasn't an issue. Troy's hair is beginning to thin as well as his eyesight. Those are the things that might be worth looking into. Brock has a few lines on his forehead just above that baby face that he would wanna take care of. Looking at everything south of those lines we hardly think they'd be noticed. Troy started in the biz doing mostly bi porn, however, bi sex is left for only in front of the camera. Brock's only been in a 3 way with a female once; but that was only to get at his hot work out partner whose girlfriend wanted some of Brock. We all have our reasons for doing what we do. So let's give these two a reason to do each other...as if they need one.They sit chatting about working in the business; how glad they both are that this will be a twink free set and about how hot each other look. That leads to stroking, more than a couple of egos, as they start to make out. Troy takes off Brock's tee to get a better look at his playmate and he likes what he sees. They strip each other's clothes off and Brock gets on his knees for a closer inspection of the tent in Troy's briefs. He wraps his lips around that cock and gets to work. Troy is rock hard as Brock nurses on his meat. ?Damn you suck good cock? he grunts as he fucks his mouth. Brock jerks his own meat while he sucks on Troy's. Troy loves the attention he's getting but soon wants to taste Brock's thick cock. He kneels and gets a mouthful as Brock moans his approval. Troy can't get enough of Brock as he orders him to bend over so he can feast on that smooth ass. He dives in tongue first as he gets that beefy ass ready for some fucking. Brock bucks backward as he gets that hole tongue-fucked. Troy takes advantage of that ass splayed out before him and suits up. He starts to slide his thick cock inside that ass as he starts to give Brock dick, doggy style. ?Fuck yeah? Brock grunts as he struggles to accommodate that hard cock. ?Don't fuckin' hold back' Brock moans, 'pound my hole!? Troy is more than happy to oblige as he slams his dick in deeper. Brock takes it like a champ as Troy rails into him. Brock switches it up as he flips the script and puts the porn vet on his back and gives him a taste of his own medicine. ?Damn that's good cock? grunts Troy as he gets that hole stretched wide. Brock pounds away at that hole, missionary, as Troy begs for more. The chemistry between these two is on fire as they fuck each other. Troy then takes the lead back as he sits back and has Brock sit on his meat. ?Like my tight ass, huh?? teases Brock as he starts to ride that thick dick. Troy is in awe as Brock works his tight hole up and down on his throbbing cock. Brock rides him harder and faster and it sends Troy over the edge. He stands and unloads all over Brock's smooth pecs and abs. Brock follows suit as he busts his own batch all over his cum-soaked abs. Damn, Daddies.",
  "models": [
    {
      "name": "Troy Halston",
      "person_id": 27796
    },
    {
      "name": "Brock Russell",
      "person_id": 27911
    }
  ],
  "release_date": "2011-01-20",
  "scene_id": 54122,
  "tags": [],
  "title": "Russell-ing His Feathers, Scene #02"
}