{
  "collections": [
    "Men Over 30"
  ],
  "description": "?The Brock is Back? and Boston's favorite resident has brought along a friend, Mr. Mike Dreyden. We haven't seen 37 year old Brock Russell in a while; but we're always happy to see him. Mike Dreyden is a swarthy native New Yorker hailing from Brooklyn. No matter how old these men may be they make getting older look effortless. We wondered these two world travelers where in all of their travels would they want to go back strictly on vacation. Brock would want to go back to Berlin while Mike would want to make it back to London where he had a blast at HustlaBall London last Summer. Mike wants to get the chance to get his passport stamped all over. Mike is dying to visit Berlin, Spain, Israel, Greece and Italy since his mix includes the aforementioned countries. Brock has always wanted to go to Australia so we have a feeling he'd be doing a lot more than going down under ...in the down under. We then threw the topic old school and asked them if they remembered the first cock they ever sucked. 'I was 7 and it was the neighbor kid upstairs' beams Mike. Child prodigy is in da house! Brock got a dick in his mouth at 11 playing Truth or Dare...good times.Mike is tense and Brock starts to give him a neck rub. As he starts working on his knots his hands start to roam as Mike starts to moan. Mike's shirt comes off to give Brock better access. (of course!) then things get interesting as Brock unzips his own pants and reaches for Mike's cock. This has got to be better than a neck rub. Brock and Mike start to kiss as their hands explore each other's bodies. Brock then sits back and watches as Mike finally gets a taste of that cock. He swallows Brock's thick cock all the way to the hilt as he pleases his new BFF. 'Stroke it while you suck it' coos Brock as he moans his approval. Mike gets on his knees and takes his time worshipping Brock's cock. He laps at it and sucks on his knob making Brock's cock throb. Brock has Mike lavish his dick with attention until it's time he gives some back. He pushes Mike back onto the chaise before going at his hard cock. Mike moans and groans as Brock feverishly swallows his meat. 'Let's see that ass of yours' orders Brock as he gets Mike on all four. Brock starts to finger that hot hole making Mike even hornier for a proper dicking.'Fuck my hole!' Mike begs as Brock slams his dick inside. Brock is off and running as he power fucks that ass. Brock's balls slap away at that hungry hole as Mike revels in the sensation. This boy came to play?HARD! Brock then sits back in the chair and has Mike sit on his dick. Mike has no problem getting right back on that dick for more as he bounces and grinds that hot ass all the way down to the hilt. Brock lets Mike do all the work for a while till Mike stops to catch his breath. Then its Brock's turn as he starts to slam that hard cock up into that tight ass. No matter how he gives it?Mike takes it. Missionary is next for these two as Brock pushes Mike over towards the couch. There he picks up those beefy thighs and slides his cock back in for more. Mike is rock hard and stroking his cock as he gets that hole stretched wide. 'Cum for me, Baby' Brock coos as he watches Mike getting closer and closer to climax. Brock picks up the pace which just sends Mike over the edge. Mike explodes all over his furry chest and abs. Brock isn't far behind as he too unloads all over Mike...",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "Mike Dreyden",
      "person_id": 28009
    }
  ],
  "release_date": "2013-05-13",
  "scene_id": 54127,
  "series": "Brock N' Roll",
  "tags": [],
  "title": "Brock N' Roll, Scene #01"
}