{
  "collections": [
    "Men Over 30"
  ],
  "description": "After popular demand, Max Sinclair is back in the house. After the amazing response to the 36 year old Orlando native; we're definitely glad to have him back. Making his debut this week is a San Francisco treat by the name of Blake Daniels. Blake is 29 and a tall drink of hotness measuring in at 6'4?. We asked these two if they could write a reflective memoir on the past year what it would be called. ?I Got Fucked in the Ass? would be the title of Max' since he got dicked by a real cock for the first time with us on cam. No more toys for Max in the New Year. Blake's memoir would be titled ?So Long 20s?as he prepares himself for his 30s. February is around the corner and we wondered what these two would do with their significant other on Valentine's Day. A cruise to Mexico is first on the list of romantic options for Max; while Blake would rather commune with nature on a nice little picnic up in the Redwoods. As for new adventures, we wondered what was on their sexual horizons. The Mile High Club is on Max' to do list while Blake wants to keep exploring group fun. Orgy anyone? ?Let's get this party started...Max starts off with a strip tease for Blake's amusement. He pulls off his tee and shows off his ripped frame. Someone's been hitting the gym and it shows! His abs are more defined and Blake's hands are helping themselves to the new additions. Max' pants come off next and he's left in a sexy black jock strap which showcases his stellar Puerto Rican ass. By now, Blake has hauled out his fat cock and is stroking to the show. Max goes in for a closer look as he starts to stroke that thick dick. Blake's cock is getting harder by the second. Blake then kneels to get a better look at that cock as he pulls off the jock strap. Max moans as his cock finds itself in a hot mouth. ?Keep suckin that cock? he groans as Blake strokes his spit lubed meat before going right back down on it. Blake rubs that dick all over his face and savors every inch of it before sitting back to get some in return. Max doesn't skip a beat as he gets to work on his cock. He bobs his head up and down on that thick white boy meat wanting to get it as hard as he can. He has plans for that thick cock and it won't be long before he's finding a new home for it.Blake then bends Max over on the couch so he can play with that hot ass. Max spreads his cheeks apart as Blake lubes and fingers that hot ass. He teases that hole making Max want his dick even more. Blake then suits up and lubes his thick cock as Max straddles him and slowly impales himself on it. Max grimaces as his ass slowly concedes. Once that cock finds its way inside Max starts to slowly ride it til his ass can handle it. Wanting a bit more control, Blake bends him over so he can fuck that ass doggy style. Blake is in the driver's seat now as he picks up the pace and starts to fuck him deep. Max struggles to accommodate that thick dick as Blake pounds away at his ass. Bet those toys were never this good. Max then gets flipped over on his back where Blake goes right back to doing what he does best?power fucking that hole. Max strokes his dick off as Blake continues his anal assault and it sends Max over the edge. His cock explodes without warning sending his load all over his ripped abs. Blake pulls his meat out and also unloads, shooting his thick cargo all over Max' spent cock.",
  "models": [
    {
      "name": "Blake Daniels",
      "person_id": 28007
    },
    {
      "name": "Max Sinclair",
      "person_id": 28003
    }
  ],
  "release_date": "2011-01-27",
  "scene_id": 54124,
  "series": "Max & Spermas",
  "tags": [],
  "title": "Max & Spermas, Scene #02"
}