{
  "collections": [
    "Men Over 30"
  ],
  "description": "There's never a dull moment when Brenn Wyson is in the house. This week Boston's favorite son helps us welcome baby faced 20 year old Damon Audigier. Damon is from Oklahoma and has been on our brother site CircleJerkBoys. Today he will be an honorary MenOver30...by injection. We asked these hungry boys what their perfect meal would be. Brenn loves Italian. Home made lasagna with meat sauce; some warm bread and some calamari. Some Tiramisu for dessert would complete his perfect 3-course meal. Then we ask Damon what his favorite 3 course meal would be and as he goes to answer what his favorite appetizer would be we hear ?Brenn Wyson? as a smirk appears on Brenn's face. ?I don't think you'd be the 'appetizer'? laughs Damon. Brenn goes on to reassure him that Damon's ultimate meal would consist of Brenn for the appetizer followed by some meaty Brenn Wyson for the main course and to top things off with a creamy yet rich finish, some Brenn Wyson for desert. Well with all that protein we're sure that meal plan would be Atkins approved. Mmmm. That visual just got us very hungry...Brenn is napping on the chaise when Damon wanders into the room. He can't resist the sight and leans in for a kiss. Brenn is startled but instantly recovers as they start to make out. Damon's hands roam all over Brenn's smooth chest as he pulls his tee off and strips his own clothes off. As he does, Brenn notices the huge bulge in his underwear and strips them off as Damon's massive meat springs free. Damon then kneels to get at Brenn's cock as he gets busy deep throating that meat. Brenn rubs his dick all over Damon's face. ?Yeah suck it? he grunts as he grabs Damon's head and forces it up and down on his thick dick. Damon then stands and starts to rub his massive tool against Brenn's. ?Fuck my face!? Brenn orders as Damon slides his extra thick cock inside. Damon's dick gets rock hard in seconds as he starts to slam his dick deep down Brenn's throat. His smooth balls slap away at Brenn's chin as Brenn face takes a pounding. Brenn then bends Damon over and shoves his tongue deep into that hot smooth hole. He grabs Damon's dick; pulling it back to rubs it against his own hole. Damon goes nuts and wants that dick.Brenn suits up and slides his dick inside that spit lubed hole. Damon groans as he starts getting fucked doggy style. ?Let me see that ass stick up? Brenn orders as he start to cram his cock deep into Damon's hole. Once he gets inside that hot ass he goes to work delivering dick like only he can. He pounds away at that hot hole as he orders Damon to keep his head on the ground. ?Keep your legs together, Bitch? he grunts as Damon gets into the action and starts to beg for more. Brenn locks his arms around Damon's waist as he starts to jack hammer his meat home. Damon is taking the fuck of his life as Brenn just rails into him. Brenn then sits back and orders Damon to sit on his meat. Damon doesn't skip a beat before straddling his cock and impaling himself for more. Brenn grabs Damon by the back of his head and pulls him close so he can make out with him as he rams inside. ?Push all that cock into you? he moans as Damon slowly starts to grind his hot ass down on his cock. Missionary is next as Brenn gets back in there watching that hungry hole swallowing his meat. ?Fuck me!? Damon moans as Brenn fucks him harder and faster. Missionary does the trick as Damon gets the cum fucked out of him. Brenn is seconds behind him as he pulls out and unloads all over Damon's cum covered cock.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Damon Audigier",
      "person_id": 30777
    }
  ],
  "release_date": "2011-03-10",
  "scene_id": 54136,
  "tags": [],
  "title": "Pile Driving Daddy, Scene #02"
}