{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a special treat as we welcome Doc Rock to the site. One look at Doc and you know how this 42 year old from North Carolina got his nickname. Doc is one beefy piece of man meat. He actually got his nickname from his Dad who was also called Rock. His namesake was inherited. You could say he's a chip off the old rock. He does, however, work out religiously to make sure people keep guessing. Doc is married and loves to get off. He beats off 4 or 5 times a week as well as giving it to his other half every chance he gets. He's relatively new to the scene but is enjoying everything so far. We wondered what fantasy he would work out if he had the chance to make it happen on cam. ?I have so many...I'd like to be in a guy gang bang or orgy with both males and females.? It seems everyone should get a piece of this rock and who knows we may be able to make that happen for you.  So stick around and watch as Doc does his thing...Doc starts out on the couch putting away his tennis racquet when he gets a call. It's his friend Phenix that's called to say he left his jock strap behind and is on his way to get it. Doc hangs up and starts to smell Phenix' jock and begins to get hard. He rubs his crotch as he gets hard thinking about all that Phenix has to fill that jock strap with. He stands as he loses himself to the fantasy. He plays with his cinnamon nips as he flexes his massive pecs. The dedication this stud has for working out has really paid off. He starts to flex his guns and licks and kisses his huge biceps. He turns around and gropes his muscular ass through his shorts. He knows how to tease and loves every minute of it. He then slides off his shorts and he's left in a bright yellow jock strap. The jock frames his beefy ass incredibly well. He bends over and slaps his ass. He pushes that hot ass way up into the air begging for it as we see his smooth hole. He reaches back and teases that hungry hole with his fingers which only gets his cock harder. He then stands up and pulls off his jock strap giving his swollen meat the room it needs to breathe.He strokes his rock hard cock as the camera pans north. His pecs are massive and they flex as he continues pleasuring himself. Doc then moves the party over to the couch where he gets on all four and spreads that beefy ass wide. His gluts are huge and as he spreads that ass we get a great view of his hole and those massive quads that support his frame. After showing off that ass, he flips back over again; takes another whiff of Phenix' jock and lubes up that dick giving it the attention it needs. He moans softly as he strokes his rod. As he lays back his abs flex and writhe just beneath his smooth skin. He has amazing definition throughout making him rather easy on the eyes. His smooth nuts are pulling up close to the shaft as he picks up the pace. He is at the edge and can't hold back any longer as he grunts, exploding all over his washboard stomach. He coats his abs leaving him spent and ready for a nap. Phenix better take his time or he's gonna catch Doc wet handed.To be continued...",
  "models": [
    {
      "name": "Doc Rock",
      "person_id": 28014
    }
  ],
  "release_date": "2011-03-17",
  "scene_id": 54138,
  "series": "Jock-Strapped Daddy",
  "tags": [],
  "title": "Jock-Strapped Daddy, Scene #02"
}