{
  "collections": [
    "Men Over 30"
  ],
  "description": "Damien Nero is 31 and a New York City boy. A slightly younger Damien was first with us a few years back on our brother site CircleJerkBoys. Well Damien is all grown up now and we're happy to see he's only gotten better with age. We asked Damien if he could spend a week in any city in the world where that would be. Well if it was in winter he'd want to spend it in Miami. If it was over the summer he'd pick someplace out in California. Damien discovered his cock at an early age when he started jerking off to Wonder Woman. Was it the gams, the outfit or an early interest in bondage as she ties up naught boys with her truth lasso? Hmm, we'll never tell.  Damien's fantasy 3-way would include Johnny Depp and Angelina Jolie. We hope they are ready for Damien whose wildest sexual romp lasted 8 days. Eight days! Well, that's a lot of footage. We were afraid to ask for details. Sadly he hasn't had anything earth shattering in that department in a while so we may need to have him back to change all that for him. We assume is would be ok with you guys... Damien walks in after a long work out and starts to strip. He peels his tee off as he starts to check on his progress. He starts to flex his chest and biceps making sure things are coming along smoothly. Damien loves to show off his hard work at the gym. His naturally smooth body is defined and his abs are cut up. He drops his briefs to show off his taught muscular ass for a few before jumping into the shower. He lathers up as he starts to clean himself off. As he does, his cock comes to life and stands at attention. Damien grabs it and starts to play with his swelling meat. As the water ripples over his washboard stomach we get a better appreciation for his dedication. He wraps a towel around his waist and heads back to the bedroom. He starts to dry off bending over to show off his smooth ass. Once he's done drying off, Damien takes matters into his own hands as he lubes up that thick dick.Damien sits back and spreads those muscular thighs apart as he starts to jerk his meat. He slaps it against his palm before double-fisting it. Damien's cock is throbbing and in need of attention. All that exercise got a lot more than his juices flowing as Damien sits back and gets into it. Sitting back you get an amazing view at everything this stud brings to the table. Damien then stands to give us a better view and as the camera goes in for a more personal approach we get a spectacular view of his hairless balls and ass. His rigid dick is being taken care of and it's making Damien hornier by the second. Damien then gets back on the chaise and bends over showing off his sweet ass. He slowly plays with his hole as he pushes a fingertip inside. He knows you want that hole and he wants to make you work for it. He kneads his muscular cheeks as he pulls them apart. Damien then flips over and starts to jack himself off. He settles in and picks up the pace as he gets closer to climax. His muscles tense and writhe just beneath his sun-kissed skin as his cock unloads sending a massive load all over his abs. Whew. Now that's a workout we could all look forward to.",
  "models": [
    {
      "name": "Damien Nero",
      "person_id": 28010
    }
  ],
  "release_date": "2011-02-17",
  "scene_id": 54130,
  "tags": [],
  "title": "Jersey Whore, Scene #02"
}