{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have two new faces this week as we welcome Devon Hunter and Mike Rivers to the club. Devon is 34 and from Atlanta, GA. Mike Rivers is only 26 but after today this New Jersey boy will be a ManOver30 by injection.   We wondered how these two boys keep abreast on current events. Devon apparently doesn't watch much TV at all so he likes to keep tabs online when he logs in to check his email and sees the headlines pop up. Mike likes to use his phone to check on BBC and get a more realistic take on what's going on in the world. We wondered what kind of men these studs were interested in. Devon likes older, taller men that are not only well rounded but polite as well. Mike loves a man with an accent. Who doesn't? He also loves men that are into outdoor things and sports versus being bar bound. We then wondered what their best sexual experience was. Devon's was when he had this younger blond boy that put it all up for him to feast and then told him it was his best ever. Mike tops that, well figuratively, when he fondly remembers a Colombian boy with a 9? cock that made him cum without touching himself...  Where do you go after that?  ?GET NAKED!!The chemistry is more than apparent with these two and as Devon tries on different outfits Mike does his best to be objective on his choices. The first one isn't gonna work and as Devon takes it off to try the second one on Mike discovers he looks best without one on. His hands caress Devon's abs as they start to make out. Soon their clothes are coming off. This is so much more fun than a fashion show! Mike moves south to explore the bulge in Devon's briefs. He takes out Devon's cock before engulfing it. Devon's thick cock comes alive as Mike starts nursing on it. Devon moans as he tries to get his cock deeper in Mike's hot mouth. Mike is in no hurry and takes his time savoring every inch of cock he's given. From here these two get into a hot 69 so that each get all the cock they want. Devon nurses on that Jersey bone as Mike continues deep throating Devon's. Devon's cock is rock hard and needing a lot more than Mike's mouth by now and that issue will get addressed sooner than later.Devon suits up ands sits back as Mike straddles his dick and impales himself on it. Mike grunts as his tight ass stretches wide trying to accommodate Devon's thick country cock. Devon's eyes roll back in ecstasy as that tight ass squeezes down on his meat. He starts to slam his cock up into Mike who responds by sitting up and grinding that hot ass all the way down on Devon's dick. Devon then bends Mike over and goes to work tapping that ass doggy style. Mike takes it like a champ as he gets that hot ass of his fucked. ?Drill Baby Drill? he teases as Devon starts to fuck him harder. Devon's dick gyrates deep into that hot ass driving Mike wild. Devon's smooth balls slap away at Mike's ass as he continues to fuck that ass. Missionary is next as Mike flips over and lifts those muscular legs up for Devon. Devon slides back inside and gets back to fuckin that hole. Mike's cock is rock hard as he starts jacking off until he can't hold his nut any longer. ?Cum for me? Devon grunts as he fucks the cum out of him. Devon then lies back and explodes all over his abs leaving them completely white-washed in a creamy mess.",
  "models": [
    {
      "name": "Devon Hunter",
      "person_id": 28011
    },
    {
      "name": "Mike Rivers",
      "person_id": 28012
    }
  ],
  "release_date": "2011-03-03",
  "scene_id": 54133,
  "series": "Up the River",
  "tags": [],
  "title": "Up the River, Scene #01"
}