{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have two blasts from the past as we welcome back Steven Daigle and Braxton Bond. Braxton is 32 and originally from Maine but is now residing, across the pond, in London. Steven Daigle is also back and this sexy 37 years old currently lives in San Diego. We wondered if these two had to move and live in another city which city would it be. Oddly enough, Steven would want to live in London because he thinks it's one of the best cities in the world. Braxton would want to live in Los Angeles. We wondered if Steven's now infamous stint as a houseguest on Big Brother 10, for all of 2 seconds, helped him discover his exhibitionist side. We thought it may have helped make the transition into the adult industry that much easier. Steven admits he was always an exhibitionist at heart and has always wanted to be in front of the camera. Big Brother just reaffirmed his need. Braxton also got his start in the industry wanting to fulfill his need to be watched. He got some pictures together and set out to get into the industry. We wondered if in the industry if they got into toys of any kind. Steven doesn't really get into them but he feels he should at least buy a Steven Daigle dildo. As he laughs it off, we notice a gleam in Braxton's eyes. TSA agents beware Braxton's might be ?packing? one hell of a souvenir. Steven starts to check out Braxton's new ink that he got out in Los Angeles. The dragon on Braxton's arm gives Steven a reason to finally touch Braxton and as he gets the tattoo tour discovery turns into fondling as Steven starts to lick and kiss on Braxton's body. They start to make out as they peel away each other's clothes. They tumble onto the chaise as they continue to kiss and lick each other. Steven's curiosity gets the better of him as he undoes Braxton's shorts and goes for it. He takes Braxton's growing cock in his mouth and swallows every inch. Braxton moans in ecstasy as Steven worships his meat and licks on his nuts. Steven can't get enough of that dick as he face fucks himself with Braxton's throbbing bone. Steven then whips out his own cock and offers it to Braxton. Braxton takes to his cock like a hungry calf as Steven holds his head and pounds his throat. Steven shoves his dick so deep it makes Braxton gag and he loves it. Steven then gets Braxton bent over the chair so he can get his tongue up into that hot hole. Braxton moans as Steven tongue fucks that ass getting it ready for more.After taking his time prepping that imported ass with his tongue, Steven gets his fingers in the mix as he starts to finger that hole. ?Fuck my ass? Braxton begs as Steven goes to it. Steven bends Braxton over and slides his thick cock deep inside that ass. That tight hole feels amazing wrapped around his meat and he starts to pound away. Braxton bucks back wanting every inch of Steven buried inside him. ?Yeah that ass feels good? Steven grunts as he watches his cock disappear into Braxton's hungry hole. Steven grabs Braxton by the waist and starts to plow into his ass fast and hard making Braxton moan with pleasure. They switch it up as Steven sits back and watches Braxton ride his dick. Braxton bounces his hot ass on his meat as he sits on it facing him initially then twirling around into a reverse cowgirl to keep getting that ass plugged. Braxton's own cock is bouncing up and down like a diving board as he gets nailed. Braxton can't help but jack his dick as he's taking Steven's cock and it sends him over the edge as he lies back and cums all over himself with Steven still buried inside him. Steven then pulls out and jacks out a huge load all over himself and Braxton as he empties his nuts as well.",
  "models": [
    {
      "name": "Braxton Bond",
      "person_id": 27950
    },
    {
      "name": "Steven Daigle",
      "person_id": 28004
    }
  ],
  "release_date": "2011-02-24",
  "scene_id": 54131,
  "series": "Cocks & Bond",
  "tags": [],
  "title": "Cocks & Bond, Scene #01"
}