{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today we have 2 new faces for you on MenOver30 and we're happy to welcome Epic Novell and Axel Johnson. Epic is 31 years old and originally from Los Angeles, CA. Axel is a young'n at 22 and he's from North Dakota. We wondered what these two stock up on when they go to the grocery store. It's produce for Axel while Epic makes a mad dash for the meat department. Hmmm art imitates life. To expand on that we asked what is their healthiest love vs. their guilty pleasure in the food department. Axel admits he can eat anything he wants (...just you wait, my Pet! lol); but if he had to pick he'd say he buys lots of fruits. Chocolate seems to be his guilty pleasure. Epic loves healthy salads while his guilty pleasure is bacon. Mmmmm. These two can eat all they want and still look hot. We then decided to turn the topic back to sex, go figure, and asked them what the wildest thing they'd ever done in that department. Axel was gang banged by like 10 guys (lucky Betch!) while Epic chimes in with a foot long double headed dildo that he and a friend backed their asses up to. With that in mind we should get this party started...The chemistry between these two is apparent since they haven't been able to keep their hands off each other before we started. They waste little time before getting right to it. Axel starts to lick and suck all over Epic's smooth chest. As he does, Epic's hands start to tug on the tent that's forming in Axel's pants. Axel is working Epic's nips and it's driving him wild. They start to strip each other and as Epic's pants go down so does Axel who lands on his knees eager to  get at Epic's thick cock. He pulls it out of his briefs and starts to suck on it as Epic holds his head and starts to bounce it on his rock hard cock. Axel takes every inch with ease as he pleasures his new buddy. Both of these studs are naturally smooth and defined. Axel takes to that thick cock as he continues to nurse on that meat until Epic decides he wants some too. Axel sits back as Epic kneels between his legs and gets to work. Epic does his best to take Axel's massive cock. This boy's packin' a python. 'Chokin' on it?' Axel teases as Epic's eyes water struggling to take it all '...all you need is practice' Epic does his best until Axel pulls him off it wanting to suck on Epic's cock again to get it as hard as possible for what's next.Axel sucks on Epic's heavy hangers getting his cock rock hard and once it's ready he suits it up and sits on it. His ass struggles to take Epic's fat meat. His ass wants what it wants and is soon stretched full of cock. Epic moans as he gets that cock ridden. Axel glides up and down on that meat with ease once his ass gets accustomed to its girth. Axel is in heaven as he bounces up and down on that meat with reckless abandon. From there Epic decides he wants a different position as he lies behind Axel and slides in from behind. Axel grunts aloud in pain every time Epic manages to shove every inch of his thick cock inside. 'Use that ass!' Axel orders as Epic continues his assault. Epic then turns Axel over face down as he moves right into a hot doggy position. He jackhammers that dick deep as Axel whimpers and begs for more. Epic means business as he pounds that hot ass deep and hard. The sound of his balls slapping ass fill the air as they get more and more into their fuck session. Tappin' that ass good does the trick for Epic who pulls out just in time to unload all over Axel's ass and lower back drenching it with jizz. Epic then flips over as Axel jerks his cock off all over Epic's spent cock.",
  "models": [
    {
      "name": "Epic Novell",
      "person_id": 28015
    },
    {
      "name": "Axel Johnson",
      "person_id": 28016
    }
  ],
  "release_date": "2011-04-14",
  "scene_id": 54148,
  "series": "Broken Axel",
  "tags": [],
  "title": "Broken Axel, Scene #02"
}