{
  "collections": [
    "Men Over 30"
  ],
  "description": "Matthew Rush is back this week and have we got a hottie for him. Bringing back two of our most formidable MenOver30s we have paired Matthew up with sexy Brock Russell. For those unfamiliar with these two studs, Matthew is a Ft. Lauderdale native and is in his late 30s (...and holding). Brock is 37 and originally from Duluth, MN. We asked these two well-known studs what their fans would be most surprised to learn about them if they were to write an autobiography. You might wanna sit down for Brock's reveal. Turns out Brock went from Preacher to Porn Star. He also played 4 sports professionally: Golf; Basketball; Football and Billiards. For Matthew, his fans would be most surprised to learn he's never been able to watch the Wizard of Oz in its entirety. Apparently this big boy is terrified of flying monkeys; he ends up leaving the room every time. Fortunately, we just exterminated for flying monkeys so we're clear for all sorts of monkey business.Matt comes in a bit frustrated and plops down on the couch. Brock comes in and starts to complain about not having enough men over 30 going at it with each other versus some hairless twink. ?I wonder what it would be like to do a scene with a hot men over 30 like you?? Matt says. Brock is a quick study as he leans in for a kiss. He has every intention on showing him just what that scene would look like. They kiss as they start to peel each others clothes off. Brock starts to lick Matt's chest and nips as his hands start to roam. He drops down to his knees as he helps Matt out of his jeans. He slides Matt's briefs south a bit showcasing that muscular ass of his. Brock then gets Matthew's dick wet as he starts to service his throbbing meat. Matt moans as he watches Brock polish his knob. Brock savors every inch of it before Matthew switches places wanting to return the favor. Brock lays back as Matt starts to nurse on his aching cock. Matt grabs Brock's boner by the base as he slides it down his throat.Once he's had his fill, Matthew bends Brock over on all four so he can start to explore that hot ass. He slowly teases that smooth ass fingering it and making Brock want a lot more than his fingers up there. Matthew is more than happy to oblige as he slides his fat cock inside. He holds Brock by the shoulders as he starts to deliver the goods doggy style. Brock moans in ecstasy as he gets that ass stretched open. We think they're definitely on to something having both men in the scene be in their prime. Brock then squats down onto Matt's hard cock as he proceeds to impale himself on Matt's cock. He rides that cock like he's on a pogo stick sending Matthew into a frenzy as his thick cock gets milked by that hungry ass. Matthew then flips Brock over onto his back and slides back inside him missionary. His heavy balls slap away at Brock's smooth ass as he picks up the pace. Brock can only moan and groan at this point as he watches Matt fuck his hole. Brock's jackin his cock and Matt senses he's close. He fucks Brock harder making him explode all over himself. Matt then pulls his cock out and unloads all over Brock's cum covered abs. Two men over 30 together? ?Who knew!  lol",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "Matthew Rush",
      "person_id": 27951
    }
  ],
  "release_date": "2011-04-21",
  "scene_id": 54145,
  "series": "School of Hard Brocks",
  "tags": [],
  "title": "School of Hard Brocks, Scene #01"
}