{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week on MenOver30 we have a private showcase as we give Chad Brock the floor. For the few that have not met Chad on MenOver30.com before, Chad is 38 years old and from Chicago. Chad will be sporting a leather outfit that he hopes to sport when he accepts his award for Best Fetish model in an upcoming award show. Chad got interested in the leather scene in the last couple years. He met a friend that happened to be leather and asked him to try some stuff on. That was all it took to get Chad hooked. Chad has gotten more and more into leather and admits that age and experience has opened his eyes and horizons to many things. He considers himself a 15 on a kink scale of 1 to 10. This stud definitely does not do vanilla. He has a partner at home that also enjoys the leather scene and we may just ask him and his better half to come in wearing their best gear. Who better to show us how it's done than the Fetish King and his hot #1? Chad starts off in his leather sporting some shades and his leather crop. He's in leather chaps with a leather jock strap. He's all dressed up and worked up. He's ready to go. His ride is late as he decides to start working his cock through his jock. He takes his leather crop and starts to whip his ass with the long leather straps. That just turns him on even more as he undoes his leather jock. He starts stroking his cock that is now rock hard and begging for attention. He leans forward as his fingers find his hole. He teases his ass as he pulls his hairy cheeks apart. He stands and turns around to show off his throbbing cock. He strokes it slowly and deliberately as he waves it around in the air. He undoes his chaps as they start to come off. He lies back in the chair and lets his hands do the walking on his defined abs and chest. He needs more room to play in so he unzips his chaps to get out of them. He slides his cock in between the laces of his chaps enjoying the feel of the leather chords against his bone as he continues tugging on his meat.His chaps finally come off as he sits back and strokes his aching cock. He picks up a dildo that's on a nearby table and starts to rub it against his own hard cock. Soon that dildo makes its way south between his hairy cheeks as he starts to rub it against his hole. He holds one leg up as he starts to shove it inside his hungry hole. That ass is up for some excitement as that thick dildo slides inside with ease. He groans softly as he strokes his cock and starts fucking himself. He pulls that thick dildo almost all the way out before shoving it all the way back in. Once he gets used to it he starts to fuck his hole in quick thrusts that just make his dick harder. He goes at it with his legs in the air, shoving that dildo deep inside him. He's in no hurry and wanting to savor every minute of it. He then switches it up and kneels on the chair, bending forward as he shoves that toy back inside that hungry hole. He strokes his meat underhanded as he fucks himself doggy style. That position does the trick as it hits his prostate. Chad is soon ready to explode as he flips over onto his back and cums all over his cock.",
  "models": [
    {
      "name": "Chad Brock",
      "person_id": 27925
    }
  ],
  "release_date": "2011-04-07",
  "scene_id": 54143,
  "tags": [],
  "title": "Raw Hide, Scene #01"
}