{
  "collections": [
    "Men Over 30"
  ],
  "description": "Doc Rock is back to finish what he started. For those of you who missed Doc Rock's debut last week, this beefy 42 year old from North Carolina is married and open to more than just the usual on the sexual menu. We knew we had to bring him back to see this str8 cock lover in action. Hmmm. Who ever could we call? Well, wait no more; back by popular demand is the steamy Phenix Saint. This may very well be the last time we see Phenix when he can actually still say he's 20 anything. At 29 and holding, Phenix will soon join the ranks and more than likely our hot stable of MenOver30. We asked these two studs what was their favorite time of day. ?Bed time? grins Doc. Phenix likes to eat so he chimed in with Dinner time as his answer. We then wondered where on the odd couple scale they fell when it came to how clean they were at home. Were they a slob like Oscar or neat freaks like Felix? Doc is somewhere in between. Phenix admits he's somewhere in between but closer to the neat freak. They both like women in their sexual menu and both agree there's nothing hotter than finding a chick to give it up to them and a buddy. Well, we'll have to take their word on that one; but for now it'll be Doc  that will be giving it up. We now return you to your regularly scheduled program.Doc is spent after his hot jack off session thinking about his buddy Phenix while sniffing the jock Phenix left behind. He doesn't have a lot of time to recover before he gets a call from Phenix who is downstairs and back to pick up his jock. Phenix comes in and grabs his lucky jock strap as he starts to admire Doc's beefy chest. They start to explore each other as their hands start to roam on each other's muscular frames. Doc stands so that Phenix can feel his massive quads as his hands roam all over. Doc pulls off Phenix' tee as Phenix starts to lick Doc's biceps and chest. Phenix strips down to his briefs before getting back to playing with Doc's muscular frame. He plays with Doc's cock through his jock before taking it out and suckin' on it. Doc moans as Phenix takes his dick all the way to the hilt. Doc has a massive bod that he keeps completely hairless. Phenix laps at his smooth balls while Doc moans and groans. They stand and start to rub their cocks together for a bit before Phenix lies back and gets his massive cock worked. Doc gags as he struggles to take Phenix' meat. Phenix is rock hard as Doc worships his dick. Phenix bobs Doc's head on his cock burying his dick even deeper.Phenix then gets Doc on his back with his legs in the air so that he can better appreciate that muscular ass. He spreads those cheeks apart and slaps that ass getting Doc ready for dick. Phenix suits up and presses his throbbing cock to that hot hole and pushes his way inside. ?Fuck that ass? Doc groans as Phenix sinks his meat deep inside. Phenix loves that hot ass wrapped around his meat and wastes little time before pounding away at that hole. His thick cock slides out almost completely before sliding back inside. Phenix then bends Doc over and gets back to work fucking that tight ass doggy style. Doc can't get enough of that cock as he takes a proper pounding. Phenix slaps that ass as he buries his meat inside. Phenix then lies back and has Doc ride his dick. He can get all of his cock buried inside this way as Doc fucks himself. He rides that pole bouncing on it harder and faster as Phenix slams his dick up into that hole. Phenix' hot cock is hitting Doc in all the right places causing him to blow his wad. Phenix is right behind him and unloads seconds after Doc dismounts blowing a huge wad all over his inked navel.",
  "models": [
    {
      "name": "Phenix Saint",
      "person_id": 27996
    },
    {
      "name": "Doc Rock",
      "person_id": 28014
    }
  ],
  "release_date": "2011-03-24",
  "scene_id": 54140,
  "series": "Rock Hard",
  "tags": [],
  "title": "Rock Hard, Scene #02"
}