{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a special treat as we welcome back Dominic Pacifico. For those of you unfamiliar with this West Hollywood hottie a.k.a. DJ PornStar, Dominic is 30 years old and a tall, dark and handsome hottie who never fails to impress.  Also back this week is the hot 21 year old from Daytona Beach, FL that gave Brock Russell a special Yule ?log? on our Christmas update, Mr. AJ Banks. Today East meets West as these two get to go at it. We asked these studs if they are looking forward to the politics involved in the upcoming election but neither is all that political. Not a bad thing. Dominic realized he had a bigger than average cock when he was 13. According to Dominic big dicks run in his family. Everybody loves them bigger. AJ can't say he knows for sure what he likes since he's relatively new to the whole ?taking it? side of things. AJ doesn't like to define himself sexually. If it feels good he'll do it. He's more of a get in and get out kind of lover vs. Dominic who prefers plenty of kissing and passion. Then again AJ ?IS? 21. Patience is never high on the 21 year olds ?Help me get my dick off? list. AJ is fidgeting nervously as he confesses to Dominic that he's nervous about his scene. It turns out AJ has never bottomed before and he's heard that Bigger is Better but the thought of that isn't helping to settle his nerves any. ?Well, I'll be gentle if that helps? reassures Dominic before he starts to kiss AJ's neck. He takes off his tee as a lust struck AJ fawns over his defined abs and chest. AJ starts to lick and kiss all down his chest and Dominic drops his pants to give AJ more to play with. AJ kisses and tugs on that growing cock through Dominic's briefs a bit before hauling out to get a better view. He opens as wide as he can as he goes down on Dominic's massive pole. Dominic holds his head as he starts to fuck his throat. He shoves it so deep it makes AJ gag. AJ isn't giving up as he gets back on that cock lapping it up and worshipping those heavy nuts as well. Dominic loves the attention he is getting; but it's time to give AJ some in return. He slips down onto his knees and starts to suck on that hard cock. AJ gasps as his meat disappears into Dominic's talented mouth. Dominic takes his time as he works every inch of that cock down his throat. Dominic's attention then shifts to that untapped ass as he gets AJ on all four. That  hot hole is about to meet it's first ExtraBigDick as Dominic spits on it and teases it with his fingers. He slides two fingers inside loosening it up a bit before slipping on a rubber. AJ grunts as he does his best to accommodate the new sensation. AJ grimaces as his tight ass resists its intruder. ?That ass is so tight? moans Dominic as he moves in to get more inside. He lays AJ on his side and slides in that way getting it even deeper. ?Is that all you got?' grunts AJ '?harder!? Dominic slams that dick all the way to the hilt making AJ sorry for taunting him. Dominic rams that dick as deep as it will go leaving AJ to figure it out. AJ loves the new sensation of another dudes dick in his hot ass as he moans for more. Looks like you can learn new tricks from an old dawg.  AJ then sits on Dominic's meat as he starts to jack himself off. He bounces up and down on that cock taking as much as he wants. Dominic then finishes it off missionary style as he gets AJ on his back so he can fuck the load out of him. AJ surprises himself as he blows a huge load ALL over himself as Dominic pounds away. Dominic then pulls out and unloads all over AJ's cum covered body as well.",
  "models": [
    {
      "name": "AJ Banks",
      "person_id": 28005
    },
    {
      "name": "Dominic  Pacifico",
      "person_id": 27999
    }
  ],
  "release_date": "2011-03-31",
  "scene_id": 54142,
  "series": "Banking on Experience",
  "tags": [],
  "title": "Banking on Experience, Scene #02"
}