{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a new face on MenOver30 named Junior Verde. Junior is from Akron, OH and is 20 years old. Junior is sitting at the big boy's table as he gets to play with swarthy Diego Vena. For those of you unfamiliar with sexy Diego, he is 33 and hails from South Elkhart, Indiana. We asked these two what they felt a good first date would be. Diego said dinner and a movie while Junior went with dinner and the club. Any questions on who the 20 year old is? lol On this dinner theme, we wondered what their favorite food is and who makes it best. Diego loves chicken enchiladas and no one makes them better than he does. The hottie cooks too! Junior loves a spicy chicken sandwich made special at his friend Wendy's. On the whole full meal deal we asked them what the biggest cock they'd ever been with and who it belonged to. Diego says his biggest cock ever was 10? and it belonged to a 24 year old porn actor whose name shall remain nameless. Junior has also had a 10?? in his repertoire that belonged to a hot black boy that fucked him silly. Well today Junior will get to infuse some 20 back into Diego's vena.Diego and Junior are sitting on the couch as Diego tells Junior that his chest hairs growing in and driving him nuts. He tells Junior to check it out as he strips his shirt off. Junior's hands do the walking as he starts to feel up Diego's pecs. They start to kiss as their clothes start to disappear. They reconvene on the couch in their briefs as Junior takes out Diego's growing cock and goes down on it. Diego moans as Junior works his cock and smooth nuts. Diego loves the attention but he is curious about what he's missing out on. He gets Junior to lie back so that he can free his cock that by now is straining to be let out. He gladly goes down on Junior's rock hard cock as Junior watches his cock disappear into Diego's skilled mouth. ?Damn, that feels good? he moans as Diego continues to worship his hard cock. The start to make out some more before Diego bends over the couch and offers up his sweet ass. Junior kneads that delicious ass a bit before spreading those smooth cheeks apart and diving in tongue first. Lunch is served as Junior goes to town eating that hot ass.Once Diego's ass is wet and willing, Junior moves into position behind him and slides his rock hard cock inside. Diego grimaces as he takes that dick balls deep. Junior starts to plow away at that ass as he watches Diego writhing beneath him. ?You like this dick?? he teases as Diego bucks back wanting more inside him. Diego's lean frame glistens as Junior holds him by the waist and impales him over and over. This was just what the Doctor ordered and Diego is loving every minute of it. He is loving it so much he wants to return the favor as he sits back and has Junior sit on his cock. Junior sits on that cock in a reverse cowgirl position and starts to ride. The chemistry between there two is incendiary as they meld into one another. Junior grinds his ass back onto Diego's meat as the sex intensifies. Someone crack open a window cuz its getting' hot up in this bitch! They then take the party south as Diego gets on his back and once again gives it up to Junior who pounds that ass like he owns it. Junior's taught waist gyrates as he gives Diego the dicking he needs. At this rate these two won't last much longer and sure enough Diego is the first to blow with Junior still buried inside him. Junior then pulls out and unloads all over Diego's smooth, cum soaked abs. Whew!",
  "models": [
    {
      "name": "Diego Vena",
      "person_id": 27984
    },
    {
      "name": "Junior Verde",
      "person_id": 28018
    }
  ],
  "release_date": "2011-05-05",
  "scene_id": 54152,
  "series": "Daddy's Laddy",
  "tags": [],
  "title": "Daddy's Laddy, Scene #02"
}