{
  "collections": [
    "Men Over 30"
  ],
  "description": "David Chase is back this week. He's helping us christen a new guy to the 'MenOver30 by injection' Club, Mr. Ben Tramer. Ben is 24 years old and is from Wyoming. David is still 30 and we're glad he's finally old enough to join the club himself. Jacksonville has done us all proud producing a hottie like David Chase. We asked these two if they each had their own talk shows who they would want as their first guests to start off their shows. Christian Bale for David just so he could be close to him; while Ben would want to bring on either Tom Cruise or Jennifer Aniston. Watch out Oprah! David's had a lot going on in his personal life these days. The ladies keep David hella busy including the one he has at home. David discovered he could get pleasure from a guy early on with his best friend of 5 years that ended up fooling around. Ben got his first blow job from his best friend who was curious about giving head and Ben was only to accommodating to help out. Since then, Ben has gotten really good at accommodating all sorts of requests from guys he's met. If we're lucky, we might just get to watch him do just that... David and Ben are getting better acquainted as Ben appreciates David's body hair. Turns out David's never trimmed or waxed his body hair. Ben really digs David's beard as he runs his fingers on it. David pulls up his shirt to give Ben more fur to run his fingers through. See where this is going? David's shirt comes off as Ben lets his fingers do the walking. David's curiosity gets the best of him as he lifts Ben's shirt to discover he's not the only furry one in the room. David starts to lick on Ben's abs and chest as he makes his way north to plant a wet one on his new friends lips. They start to make out as they feel each other up. Ben then kneels and hauls out David's fat cock so he can get a taste. David gasps as Ben sucks his cock down his throat. David wants to return the favor as he pulls Ben up so that he can get some cock too. Ben's eyes roll back as David wraps his lips around his own throbbing cock. ?Lick those balls? Ben moans as David eagerly pleases his meat.David straddles Ben's face on the couch so he can slide his cock back inside that hungry mouth of his. They then switch places as Ben straddles David's chest giving him more cock to suck as well. By now David's cock is throbbing and in need of more than a wet mouth.  David gets Ben back on the couch as he lifts his legs and slams that cock deep into Ben's hole. Ben's ass opens up as David takes that ass. Ben jacks his cock as David fills his hungry ass. ?You love getting fucked don't ya!? David grunts as he slams away at that ass. They make out as David pounds him even harder. Ben's taking a pounding and loving every second of it. David switches it up by putting Ben on the floor; lifting up his legs and sliding his cock back inside for more. He pile drives his thick cock back into that hole where it belongs. After fucking his hole in this position for a bit they get Ben bent over so that David can take him from behind. No matter how David gives it; Ben's more than willing to take it. Ben then straddles David's cock and impales himself on it. He rides that dick like a skilled jockey as David's cock disappears up his ass. This does the trick sending him over the edge with David's meat buried inside him. David then jacks his swollen cock off all over his happy trail.",
  "models": [
    {
      "name": "David Chase",
      "person_id": 27963
    },
    {
      "name": "Ben Tramer",
      "person_id": 28020
    }
  ],
  "release_date": "2011-05-26",
  "scene_id": 54157,
  "tags": [],
  "title": "Furry Daddy, Scene #01"
}