{
  "collections": [
    "Men Over 30"
  ],
  "description": "It's been a year since we've seen this week's surprise, Mr. Clay Towers. Clay is 35 and originally from Chicago. Clay is the better half of a familiar face here on MenOver30 which belongs to Chad Brock. These two met on set and hit it off and it went from there. They've been together now for almost a year and a half.  This week they are sporting their leather and admit each had an interest in leather before meeting; but now it's great to have someone to share that interest with. Chad admits he got into leather more so on account of Clay who first got interested in leather after attending Mid-Atlantic Leather in Washington, D.C about 4 years ago. We asked them if wearing the leather inspires kinky things or do kinky things inspire the leather. Clay confirms that kinky feelings inspire the leather. That let us right towards our follow up which was to describe the kinkiest thing they've either done?or plan to. Clay hasn't yet but wants to do some kinky things involving groups. Well we're sure that kind of trouble won't be too hard to cum by...Clay's flipping through a magazine on the couch waiting for Chad to show up. Chad arrives and pulls the magazine out of his hands. When Clay looks up he sees his boyfriend's in full leather. Wearing his harness, chaps and leather cap Chad moves in for a kiss as they start to make out. ?Are you gonna behave this time?? Chad barks. ?Yes, Sir? Clay responds now in full leather gear himself right down to the collar. Clay's on his knees with his wrists handcuffed as he's ordered to lick Chad's cock piece. He laps at it like a good slave as Chad tells him to beg for it. ?Thought you were gonna listen better this time', Chad taunts, 'am I gonna have to rough you up again?? Chad finally pulls his cock free as Clay goes for it. Denied! He needs to ask first. Duh! After asking Chad for permission, he goes for it as he starts to savor his cock. Chad impales his throat as he bobs his head roughly on his hard cock. Chad then orders Clay to kiss his cock all over before ordering him to undo his chaps for him. He goes back to sucking on that meat for a while until Chad feels it's time to return the favor. He goes to work on Clay's cock but teasing him and ordering him around the whole time.Chad's not done using Clay's mouth as he orders him back onto his dick. Once his cock is satisfied for the time being he gets on all four and offers his ass up to his slave's skilled tongue. Clay gets in there tongue first as he eats Chad's hole. Once play time is over, Chad spreads Clay's beefy cheeks apart to get a look at that ass he'll soon own. ?It's all yours, Sir? says Clay seconds before Chad slides his cock inside. Chad fucks his boy doggy style as the sounds of his ball slapping fills the room. Clay grimaces but takes every thrust he's given. Chad pounds his hole harder then switches it up as he sits back and has Clay ride him. They fuck as they make out as Clay rides his meat like a bouncy ball. Chad's cock is buried deep as Clay grinds his hot ass down on his throbbing meat. Missionary is next as they move to the couch. Clay knows who that ass belongs to as Chad goes right back to fucking his tight ass.  Chad starts to slam his meat deep as Clay jerks his cock faster. He explodes all over his stomach as Chad fucks it out of him. Chad pulls out next and unloads all over Clay's cum covered cock.",
  "models": [
    {
      "name": "Chad Brock",
      "person_id": 27925
    },
    {
      "name": "Clay Towers",
      "person_id": 27968
    }
  ],
  "release_date": "2011-05-19",
  "scene_id": 54156,
  "series": "Cock Bent for Leather",
  "tags": [],
  "title": "Cock Bent for Leather, Scene #02"
}