{
  "collections": [
    "Men Over 30"
  ],
  "description": "Epic Novell is back this week and we have a treat for him as we welcome back a blast from CircleJerkBoys past Casey Monroe. Casey who is originally from San Antonio, Texas is 23 now and it's good to have Casey back. He's looking remarkably well these days. For those of you unfamiliar with Epic, he is 32 years old and a Los Angeles native. We wondered if these two fit studs had a favorite dessert. It's fried ice cream for Casey who admits the best fried ice cream is his Abuelita's. Well no one does it better than Grandma but for Epic his sweet tooth loves some cheesecake. He can leave his Gram alone and just head to the Cheesecake Factory when he needs that itch...scratched. Speaking of ?itch? we asked Casey to describe the perfect blowjob. ?No teeth, lots of spit and don't swallow unless you want them to?. Hmm. We then asked Epic to describe the perfect rim job. He likes a guy with some stubble so that he can sit on their face and have that tongue all up in his business. ?But rim jobs aren't for everyone? chimes in Casey with a grin. Rim jobs may not be for everyone but both of these studs admit that playing with their rear buttons makes then pop that much faster. On that note....We won't have to worry about chemistry between these two as they sit next to each other on the couch with their hands already roaming by the time we start. They start to make out as they peel their shirts off. Casey undoes Epic's jeans and goes for that cock. He hauls it out and starts to suck on it as it grows in his warm mouth. ?Yeah suck that dick? Epic moans as he watches Casey working on his bone. Casey holds his thick dick by the base as he works it all the way down to the hilt. Epic gets his knob polished as Casey's spit coats his meat. Casey then stands and offers up his own thick cock to Epic. Epic grabs it, pushes back his foreskin and gets busy returning the favor. Casey's cock is rock hard in no time as he watches Epic on his knees worshipping his meat. Casey grabs a fistful of Epic's hair and uses it to bob Casey's hot mouth up and down on his raging boner. Epic does his best to keep up but gags on that uncut cock whenever Casey buries it too deep. Epic takes his time and laps that thick dick all over pleasing his new buddy anyway he can. Casey then gets back to working on Epic's getting it ready for more.Casey gets up on the chair and spreads those legs setting that alabaster ass on display. Epic aims his raging hard on south and slowly starts to shove his cock inside that ass as it slowly starts to give way. Casey moans and whimpers as he gives up that hot ass. He gasps for air as he gets his str8 hole fucked. ?Fuck me Daddy? he moans as he finally gets used to that thick dick in his hole. Epic loves the sensation he's getting on his thick cock as he stretches Casey's ass open. Epic then bends Casey over the chair into a doggy position as he slowly slides that dick back inside. He's conscientious about going slow enough to let Casey get used to that meat before picking up the pace. Watching Epic's cock disappear into Casey's hole never gets easier as Casey's hetero hole resists it's intruder every thrust of the way. Epic isn't complaining. They then switch places and Casey takes control. He sits on that meat in a reverse cowgirl and he's home. ?Yeah, you're MY bitch now, just take it!? he grunts as he rides Epic's thick cock. Someone loves to ride. This does the trick as Casey blows a huge wad way in the air with Casey still buried in him. Casey then kneels and begs Epic for his load. Epic soon blasts his sending it ALL over our Lone Star stud. Who knew??somebody ordered Fireworks!",
  "models": [
    {
      "name": "Casey Monroe",
      "person_id": 28019
    },
    {
      "name": "Epic Novell",
      "person_id": 28015
    }
  ],
  "release_date": "2011-05-12",
  "scene_id": 54154,
  "series": "Epic Fuck",
  "tags": [],
  "title": "Epic Fuck, Scene #02"
}