{
  "collections": [
    "Men Over 30"
  ],
  "description": "Doc Rock makes his triumphant return and it's payback as he gets to do some pounding of his own. Originally from Charlotte, NC, this 42 year old was the lucky recipient of a Phenix Saint pound-a-thon. We should all be so lucky. Today we have a special lad who just a few days ago was home in Baltimore jacking off to Doc's performance and dreamt of being on the receiving end of this bi brick house. Careful what you wish for because today, Joey Baltimore gets his wish come true. Joey is a rookie and this is the first time on camera for this eager 27 year old. Well it's nice to know more than just Mrs. Doc who gets that cock. Doc admits that from time to time he has the Mrs. strap one on to peg his muscular ass. We then wanted to know what their favorite sexual act they liked to do. Doc loves oral both getting and giving. Joey is a consummate bottom and just loves getting his holes filled. He also loves threesomes. America needs more boys like this one. Let's let these two get the party started... cuz we never wanna be tardy for the party. Joey is talking to Doc about seeing him for the first time and how nervous he is about doing his first scene with him of all people. Doc pulls him to his feet and tells him he'll make him feel a bit more relaxed as he starts to make out with him. ?Just leave it to Daddy? he says. They start to kiss passionately when Doc rips off Joey's tank top. Joey swoons with anticipation as he heads south landing on his knees in front of Doc's growing cock. Joey is in awe as he looks up at the massive pecs and abs that tower over him as he gets his throat fucked. He gags on that dick as Doc bobs his head on his throbbing cock. Doc then pulls off Joey's pants wanting to return the favor and Joey can't help but tell Doc that he feels like he's dreaming as Doc starts to suck on his uncut cock. ?You like Daddy sucking that cock?? Doc teases as Joey watches his idol going to town on his cock and smooth low hangers. Doc then gets Joey back on his knees to keep feeding him dick. ?You like being my bitch?? he grunts.?Yeah Daddy, that feels so good? Joey moans as Doc starts to eat that smooth hole. Joey is in ecstasy as he gets that hot hole prepped as Doc tongues his bung hole. Once that hole's nice and wet, he stands and slides his cock inside. Legs in the air; and moaning like he just don't care?Joey takes that dick ball deep. He starts to moan & beg for dick like a str8 porn slut as Doc pounds him. Joey can't get enough as he begs Daddy to give it to him. Doc watches his cock slide into Joey's spectacular ass before flipping Joey over on all four. ?Yeah Daddy, teach me how to take it? he whimpers as Doc takes what's his. He slaps Joey's ass as he orders him to tighten that hole on his dick. Doc holds Joey by the waist and impales him repeatedly while Joey just moans and cries out for more of it. They then switch it up as Joey sits on Doc's cock. He rides it in a reverse cowgirl and asks Daddy for his approval as he grinds that hot ass all the way to the hilt. Fortunately, Daddy loves the way he's riding that cock and soon has him back on his back to finish him off. He pounds Joey so hard that he fucks the cum out of him as he unloads all over his smooth chest and abs. Doc is next as he blows his baby batter all over one happy Joey.",
  "models": [
    {
      "name": "Doc Rock",
      "person_id": 28014
    },
    {
      "name": "Joey Baltimore",
      "person_id": 28017
    }
  ],
  "release_date": "2011-04-28",
  "scene_id": 54150,
  "series": "Good Morning Baltimore",
  "tags": [],
  "title": "Good Morning Baltimore, Scene #02"
}