{
  "collections": [
    "Men Over 30"
  ],
  "description": "The Proverbial Prince of Porn is back in the flesh as Troy Halston makes his triumphant return to MenOver30. Today West Virginia's most infamous son, Troy will help us welcome Tyler Sweet into the 'MenOver30-by-injection' Club. Tyler's Surname couldn't be closer to the truth and we're happy to welcome this sweet 18 year old from the lone star state. We asked these studs what their guilty pleasure was when it came to watching TV. Tyler loves Desperate Housewives; while Troy likes to watch the History and Discovery Channel. When it comes to getting their meat on, we wondered what their ideal burger would look like. Troy thinks the best burgers are made at home with some A1 and some onions. Tyler loves a Dallas eatery back home and swears that Hunky's has the best burgers. He likes his more classic with lettuce, tomatoes and maybe some avocado. Troy's been married almost as long as Tyler's been around and as a happily married bisexual man he admits that the eating is good on both sides of that table. He wouldn't have it any other way. Tyler isn't too far behind in his ambitions and gives us a bit of a clue where he's headed when he tells us his secret fantasy he has yet to fulfill is to have a 3 way with 2 guys and a girl. Hmmm. Where's the Mrs. when we need her?Troy is home reading as Tyler comes over looking for his daughter, Tania. Troy puts down his book and tells Tyler his daughter is out with her mom for a while so maybe they should sit back and get to know each other better. Troy shakes his hand but never really let's go of it. He holds it near his crotch as he sits back and asks him questions. He inches closer to Tyler as he starts to undo his shirt; telling Tyler he thinks he's too thin to be a football player. He is really cute though and probably gets a lot of attention in the locker room. He puts Tyler's hand on his chest and reaches over to start rubbing his. ?Ever played with a man before?? Troy asks as Tyler shyly follows his lead. They stand as Troy helps his daughter's date out of his clothes. Tyler's cock is already stiff and leaking by the time Troy wraps his hands around it. Troy pulls off Tyler's briefs and turns him around inspecting all this innocent boy has to offer. Troy drops his own pants and gives Tyler his first taste of man meat. Tyler opens wide and takes to it as Troy's cock grows rock hard in his mouth. ?What do you think about me sticking my fat cock in that sissy ass of yours?? Troy taunts as Tyler's busy choking on his cock.Tyler takes his time sucking on Troy's cock as Troy orders him around telling him just how he likes his dick sucked and balls pulled. Troy then pulls Tyler up to return the favor as he wraps his mouth around his young friend's cock. Tyler's cock is rock hard as Troy strokes and sucks on his rigid cock. Troy then turns him around to inspect his sweet ass. He sticks his finger inside as Tyler winces in pain. Apparently Tyler's never had anything inside that sweet bubble ass as Troy tells him how to relax so he can get that finger in. When he's ready he starts to slide that cock inside as Tyler grunts in pain. Troy tells him to relax as he starts picking up the pace, fucking that ass deep. Tyler's ass is tight and feels amazing wrapped around Troy's cock. This ass will soon be Daddy approved and he's gonna make sure he's does it right as he slams that dick home. Tyler then sits on his cock and starts to ride that daddy dick as Troy tells him to bounce on his meat and make him feel good. Troy can't get enough of that sweet ass as he puts him on his back to fuck him missionary. Tyler's cock is throbbing as Troy pounds his boy hole. Tyler can't hold back any longer as Troy fucks the cum out of him. Troy then pulls out and unloads all over Tyler's cum covered cock.",
  "models": [
    {
      "name": "Troy Halston",
      "person_id": 27796
    },
    {
      "name": "Tyler Sweet",
      "person_id": 28023
    }
  ],
  "release_date": "2011-06-16",
  "scene_id": 54163,
  "tags": [],
  "title": "Daddy's Home, Scene #01"
}