{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today we have a Latin overload as we welcome back sexy 32 year old Steven Ponce from ?La Isla del Encanto? (the enchanted Island) a.k.a. Puerto Rico. Steven is in for a treat, and then some, as we welcome back Colombian 'papi', Alexander Garrett. We asked them if they had the chance to show off their native countries to friends that had never been; where they would take them. Steven would take them to the Rain Forests as well as the white sandy beaches of his Caribbean birthright. Well, down in South America, 34 year old Alexander would show off the breathtaking, Colombian mountainsides; enjoy access to both the Pacific and Atlantic Oceans and his favorite the beautiful people back home. We then asked them what food they miss most from back home. It's Mofongo for Steven, who started to salivate just thinking about it. Mofongo is mashed green plantains often stuffed with shrimp or seasoned beef. Alexander misses Paisa. Red beans and rice with 2 eggs over easy on top served with sweet plantains and toast. Mmmm. All this talk of food is making us hungry. Fortunately, these two have worked up quite the appetite. So enough about the menu?let's get right to the main course.  Bon Apetit, Gentlemen.They sit reminiscing about Memorial Day weekend on the couch as Alexander's hand slips between the cushions and finds a double headed dildo. ?What's this?? he asks. A blushing Steven completely denies it's his. Plausible deniability at its best...lol They start to joke about it which leads to them making out. Steven kisses Alexander as his hands run down his defined abs right into his pants. Alexander's looking better than ever and Steven can't wait to get into those pants. Alexander's rock hard by the time Steven pulls off his jeans. Steven then does a strip tease for Alexander who lies back and watches as Steven strips bare and shows off his spectacular ass. Alexander uses his feet to spread those smooth cheeks apart getting his first look at that ass he'll soon own. ?I can't wait for that cock in my ass? Steven moans before getting to work on that throbbing cock. Alexander grunts as Steven works his cock down to the hilt as he slurps on that uncut meat. Alexander can't get enough of that mouth as he stands up so he can fuck that face of his. Steven takes that dick like a champ wanting to get it all down his throat. Alexander then returns the favor as he gets on his knees and deep throats Steven's meat as well. Steven is on overdrive and wanting more.Alexander takes his time sucking on that meat then spreads that smooth ass apart and puts that double header to good use. He slides it inside as Steven moans with pleasure. He teases that ass getting it loosened up for his own cock that will be stretching that ass a lot wider than this dildo ever could. He rams that dildo deep inside driving Steven crazy who by now is begging for the real thing. Alexander suits up and finally gives him what he wants. He slides that thick cock inside and starts to pound his ass deep. Steven is in heaven as he gets that hot ass of his stuffed full of Colombian cock. Alexander shoves his meat deep as he fucks Steven on his back. Steven can't help but stroke his rock hard cock as he gets that hole fucked. Steven then straddles that dick and sits down on it as he starts to ride it some more. He has more control on top and fucks himself silly as he lies back on Alexander's chest and grinds away on that thick pole. Alexander slams his cock up into him wanting it just as much. They then lay sideways as Alexander continues fucking him on his side. That does the trick as Steven explodes all over himself. Alexander then pulls out and blows all over Steven's furry chest and abs.",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Steven Ponce",
      "person_id": 27969
    }
  ],
  "release_date": "2011-06-30",
  "scene_id": 54167,
  "tags": [],
  "title": "Ponce De Lion, Scene #01"
}