{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have two blasts from our not so distant past as we welcome back Drake Jaden and Chris Stevens. The chemistry between these two even had our cameras steaming up. For those of you unfamiliar with these two, Chris, now 42, is originally from Ohio. Drake is 26 and a native Floridian. We asked these two if there was a book that really impacted them. ?Kamasutra? says Drake as Chris interjects ??that's what I was gonna say!? Great minds think alike. We asked them, keeping up with current events, since Oprah is now giving up the mic, were they to take over her show who would they pick to be their first guest. Chris would bring on President Obama while Drake would want to bring on Oprah herself. We then wondered which of these is the bigger turn on, getting their balls licked or their nipples worked on. It's a unanimous nipples crowd with Drake chiming in with ?...sucked, bitten, pulled, electrocuted, burned? There is a rumor that porn stars have so much sex that they never beat off; but these two are here to say that that's just not true. Drake jerked off last thinking about all the fun he was gonna have at I.M.L. in Chicago; while Chris jerked off last night thinking about his shoot with Drake today. AwwwThese two were ready to rumble before we even got the cameras ready and once we called action they went right to it. They lip locked immediately as they groped each other kissing passionately. Drake takes his tee off as he shoves Chris' face into his crotch. ?Yeah, you know you fucking want it? he grunts as he grinds his crotch into Chris' face. He pulls off his jeans still holding onto Chris by a fistful of his hair. He pulls out his cock and slaps it in his face before finally shoving it into his mouth. He shoves it all the way down his throat as he orders him to take it and not give him any teeth. Chris happily obliges as Drake uses his mouth as he sees fit. Chris licks Drake's hairy balls and cock as Drake continues his oral assault on his new friend. Chris then sits back as Drake returns the favor. He shoves Chris' underwear into his mouth as he goes down on his cock. Chris is rock hard as Drake deep throats his meat. He sucks on his smooth balls as Chris starts fucking his face and making him gag on his meat. Drake does his best to take that cock as Chris shoves it deeper and deeper. Drake spits on Chris' cock as he services it.Drake then gets up on the couch as Chris slides underneath him to get a taste of that hot ass. ?Stick it in there and tongue-fuck my ass!? Drake orders as he grinds his sweet hole on Chris' face. Drake's cock is rock hard as he rides that hot tongue. They then move onto the couch as Chris continues to eat that ass as Drake helps himself to Chris' hairy hole. This hot 69 action is getting them both hotter for more than just oral as Drake lies behind Chris and takes his ass. Drake starts to fuck that ass deep as he pounds away. ?Oh fuck my ass? Chris moans as he takes a proper fucking. Drake then sits back and has Chris straddle his meat. Chris sits on his cock and starts to ride it as Drake slams his dick up into his ass harder and harder. Chris holds on to Drake's shoulders as he bounces up and down on his cock. From there they take it home as Chris gets put on his back and fucked deep. Drake slides his aching cock into that hungry ass and powers away until Chris can't hold back any longer exploding all over himself. Drake then pulls out and shoots his own thick batch all over one cum soaked and satisfied Chris.",
  "models": [
    {
      "name": "Chris Stevens",
      "person_id": 27908
    },
    {
      "name": "Drake Jaden",
      "person_id": 27955
    }
  ],
  "release_date": "2011-06-23",
  "scene_id": 54166,
  "tags": [],
  "title": "DareOn Stevens, Scene #02"
}