{
  "collections": [
    "Men Over 30"
  ],
  "description": "Is there a Doctor in the house? ...Is there a Doctor in the house! Gentlemen we have that covered this week as we welcome back Doc Rock. Originally from Charlotte, NC, 42 yr old Doc is going to help us welcome 20yo hottie Connor Maguire who is from right across the bay in Miami. We asked these two what they like best, or miss most, about their hometowns. Doc misses seasons and the changing foliage. Yeah, our leaves only change when you forget to water 'em. For Connor the one thing he misses most when he's away from Miami is the Heat (pun shamelessly intended!)?GO HEAT! That and with 70 degree weather, our winters are just brutal. We then asked what these boys love to eat using their hands. Yeah, we take our roles incredibly serious here. Doc loves to get his hands dirty on a juicy burger, Five Guys is his favorite. Connor is a bit more practical and loves to devour his Sour Patch Kids. We then turned the topic to the bedroom and wondered what these two would say is their kinkiest experience ever. Connor has had sex on a Ferris wheel. How many tickets do we need for that ride? Line forms to the left. Doc runs away with the kink ribbon as he offers up this gem, ?Well, I've been tied up; gagged and fucked in the ass. I think that's pretty kinky.? Hmm. No arguments there?Role 'em!Doc is reading on the couch when Connor walks in asking him for his roomie that offered to help train him. Doc offers to help him instead. Doc then tells Connor he needs to change into the proper attire. He tosses a tee and some gym shorts his way as Connor starts to change. When he drops his pants Doc insists he change into a jock strap. As he's putting it on Doc's hands start to roam on Connor's exposed ass. When he goes to put on the shorts, Doc stops him altogether and decides he looks much better naked. He strips him as Connor returns the favor. They start to kiss as they explore each other's defined bods. Connor starts to lick Doc's chest as he moves south to taste what the Doc's prescribed. He sucks that cock as Doc helps bob his head on his meat. Doc's dedication in the gym is obvious and we're sure Connor's about to get schooled. Doc sits back and lets Connor take his time worshipping his meat. As he does, we get our first glimpse of Connor's hot ass. By now Connor's cock is aching for some attention of its own. He sets his thick cock free and slides it deep into Doc's hungry mouth. Doc loves sucking cock and Connor isn't about to complain any time soon.They get back to making out as they rub their cocks together. Doc has more plans in the oral department as he turns his attention to Connor's hot hole. He bends Connor over and starts to tease it with his finger before diving into it tongue first. Connor is moaning as he gets that ass eaten. Connor wants more than that tongue and soon the Doc is up in position and making a back door house call. He starts to fuck Connor deep as Connor begs for more. Luckily the doctor ordered more than just a delivery, it also called for a deposit. Connor suits up and slides his extra thick cock home as he start to fuck Doc's muscular ass. Doc can't get enough of that dick as he just moans and groans wanting every inch inside him ?Feels so good' he moans 'aaww yeah, Baby give it to me? Connor pounds away at that ass missionary hitting Doc in all the right places. Doc wants control back as he moves Connor onto the weight bench, fucking him missionary. Connor explodes as Doc continues to bury his meat. Connor coats his furry navel with Doc pumping that ass. Doc then pulls out and shoots all over Connor.",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 28024
    },
    {
      "name": "Doc Rock",
      "person_id": 28014
    }
  ],
  "release_date": "2011-07-07",
  "scene_id": 54169,
  "series": "Daddy's Workout",
  "tags": [],
  "title": "Daddy's Workout, Scene #01"
}