{
  "collections": [
    "Men Over 30"
  ],
  "description": "Matthew Rush is back in the house and looking as hot as ever. Holding on to his thirties with both hands, Matthew currently lives in Fort Lauderdale, FL. This week we have a blast from the past as Kameron Scott makes his return to porn after taking some time to regroup. It's definitely nice to have this 23 year old from Norfolk, VA back in front of the camera and on MenOver30. Matt walked in today sporting a tee that read 'NERD' on it; so we asked him about that. Matt grew up a scrawny, 130 pound man. He may look like he has it all together on the outside; but he's still a big geek. A bit of a klutz; he runs into things; slips and falls constantly-he really hasn't left much of that nerd behind. We asked them if they were tidy at home or more relaxed. Matt is the Felix Unger and needs to have everything in its place. Kameron is way more relaxed and kind of lets things fall where they may (for a week or two). As for their preferences in the sack, Kameron likes to be versatile on and off cam and Matt couldn't agree more. Well today, we're taking a page out of Kameron's rulebook. Let's get this party started and let things fall where they may...Matt is lying on his stomach as Kameron gives him a massage with a back massager. Matt is in heaven as he gets his muscles massaged. He then flips over so that Kameron can work the front. Kameron moves the massager over his massive pecs then heads south to check out a growing bulge. The massager feels wonderful as it vibrates up and down Matt's hard cock. Matt grunts and groans before losing control and ripping off Kameron's tee. He grabs Kameron and shoves his tongue down his throat before coaxing him south to get a face full of Matt's cock. Matt groans as Kameron goes to work sucking on that cock and lapping at his smooth balls. Matt takes his time as he fucks Kameron's face getting that dick as deep as he can. Matt then returns the favor as he gets some cock for himself. Kameron's cock is throbbing as Matt nurses on it. As much as Kameron loves the attention he's getting; he's not quite done with Matt's. Soon enough he gets on his knees to service Matt's throbbing meat some more. He wants that cock as hard as possible for...well, you know!As Kameron sucks on Matt's hard cock we get a spectacular shot of that smooth ass of his and soon it's Matt with a front row seat. He suits up and pushes that cock inside as Kameron's ass clenches tight. Matt moans and groans as Kameron's hot ass concedes giving way to Matt's rock hard cock. Once he gets that cock inside he goes to work fucking that ass deep. Kameron takes it like a man and just begs for more. Matt holds Kameron's waist as he plows into him, slapping that ass as he gets his. They switch things up as Matt sits back and watches as Kameron straddles his dick before impaling himself on it. Kameron starts to jack his cock as he rides that thick dick in a reverse cowgirl position. He is bouncing on that meat with reckless abandon as Matt gets to sit back and thoroughly enjoy the ride. Kameron grinds down deep wanting every inch Matt has to offer buried up his ass. Missionary is next as Matt holds Kameron's legs in the air and slides back inside to bring it home. He fucks him harder and faster as they both get closer to climax. Once they both get close they sit back and jack their loads all over themselves. Matt blows his nut all over his cock and navel. Kameron tops that shooting so far he gives himself a protein facial. ...Welcome back, Kameron. <evil grin>",
  "models": [
    {
      "name": "Kameron Scott",
      "person_id": 28022
    },
    {
      "name": "Matthew Rush",
      "person_id": 27951
    }
  ],
  "release_date": "2011-06-09",
  "scene_id": 54161,
  "series": "Anal ASSault",
  "tags": [],
  "title": "Anal ASSault"
}