{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today we have a brand new face that's gonna leave a lot of our members wanting more. Hailing from San Diego, 32 year old Preston Steel makes his debut this week. We asked Preston where he gets most of his entertainment these days. ?IPhone, TV and movies? are his go-to. He likes watching movies at home as well as in the theaters and the last flick he watched that really enjoyed was ?Tangled?. He loves cartoons and really loved that one. When it comes to TV he likes watching Discovery channel and the Food Network with a little bit of the Cartoon Network sprinkled in there. He loves summer best of all when it comes to seasons and it's because he loves being able to wear as little as possible. Preston's earliest sexual recollection was being blown by a guy and cumming 4 times in 4 hours. Preston was 20 at the time and even though he may have gotten a late start by comparison; he wouldn't change a thing even if he could. Everything happens for a reason and he believes it happened when it was meant to and was totally worth the wait. Well, fortunately we won't have to wait 20 years?so let's get this fucker nekid! Preston comes home to find a box for him with the words ?Be Home Soon!? on it. Oh Goody! He opens it up and finds a double headed dildo. (Mom?you shouldn't have...just kidding!). Preston takes it out as his mind starts to wander. He peels his tee off as he starts to rub his chest. He licks his finger and teases his nipple as he starts to feel his chest and arms. His hands then head due south to explore the bulge growing in his jeans. As he does we get a better view of the rest of him as we see the massive tattoo that covers his entire back of an angel with outstretched wings. He drops his jeans and bends forward a bit to show off his smooth ass. He starts to rub his new toy up along his cotton clad crack before dropping his underwear altogether. Preston's hot ass comes in to view as he starts to grope and knead his cheeks. By the time he turns around for us he's already rock hard. He starts to tug on his aching cock as we get a great view from below of his cock and defined chest and abs.Preston's cock is rock hard as he starts to swing his it back and forth as it slaps against his waist on either side. Preston then bends forward and decides he wants to see what this new toy's about. He starts to slide that dildo up into his ass as he strokes his rock hard cock. Soon he has the tip of that dong lodged inside his sweet ass making him even hornier. He fucks that hot ass for a bit before lying back in the couch to keep working his dick. He spreads those beefy thighs apart as he strokes. Soon he gets that urge again as he slides that dildo back inside his hot hole. His cock is throbbing as he starts to fuck his hole with it. He presses it deep inside and beats his dick harder and faster. He moans softly as he jacks off and it isn't long before his breathing, as well as his moaning, intensifies. That dildo is doing the trick as he jacks off faster and faster. ?Oh fuck, I'm gonna cum? he groans as he grinds that hot ass deeper onto his new lover sending his loads all over his sex navel leaving them glistening and coated in cum.",
  "models": [
    {
      "name": "Preston Steel",
      "person_id": 28021
    }
  ],
  "release_date": "2011-06-02",
  "scene_id": 54160,
  "tags": [],
  "title": "Dildo Rider, Scene #02"
}