{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we welcome back two familiar faces as we pair up hung hottie Kris Anderson with the poster boy for 'Good things come in small packages', Mr. Ari Sylvio. It's been a while since we've had Ari with us and we're glad we were able to get this hot 34 year old back here from Los Angeles. We're pretty sure Ari's timing was spot on getting to meet and play with Portland Oregon's own, Kris Anderson. Kris is 27 and that cock of his is always welcome. We asked these two if they had $1,000 to donate to any charity which charity would they choose. Ari would donate his to AIDS research. Kris would donate his towards educating young girls in Africa. We then asked them whom they would nominate to be on a postage stamp. Ari, being very spiritual, would nominate the Dalai Lama. Kris would nominate Bob Marley. To wrap things up we wondered what they would want in the bedroom. Ari wants a boyfriend and that he could top more with him. Kris is stumped and seeing as he likes 2 of everything he would love another fat cock just like his so he could maybe fuck two guys at a time. 'I wanna be there!' chimes in Ari. Of course you do, Sweetie. Kris is amazed that Ari is in his 30s because he looks so young for his age. Ari is flattered and assures him he loves being in his 30s because in your thirties you really know what you want. He also knows now to tell the difference between a hyped 9' cock and a real one. Well Ari is in luck today as Kris gives him the opportunity to figure out which one he's packing. Ari undoes Kris shorts and goes in for a closer inspection. He grabs Kris' thick cock as he gropes it starts to lick it through his briefs. Kris loves the attention but feels he's a tad overdressed. He gets up and drops his shorts and underwear to get that fat cock of his inside Ari's warm mouth. Ari shoves as much of it deep inside as he sucks and strokes on Kris' huge meat. He can't get enough as he worships that thick monster cock lookin' like a kid in a candy store. Kris fucks his face wanting to feel that hot tongue along his thick cock. They start to make out for a bit before Kris gets the chance to return the favor. He sucks on Ari's hard cock for a bit before getting him on all four to eat that ass. He shoves his tongue deep inside making Ari squeal with joy.Kris then moves over to the couch where he suits up and watches Ari sit on his dick. Ari slowly impales himself on that horse cock and starts to moan and groan. He can't get enough of that fat cock as Kris shoves his meat all the way inside. Kris holds his pint sized lover as he bounces him up and down on his dick. Ari can't get enough as he tells Kris just how good his cock feels buried inside him. Kris then gets Ari on his back and goes right back to taking that ass missionary. Kris sinks that massive python into Ari's stretched hole watching as Ari squirms at the other end of it. The chemistry between them is on fire as Kris picks up the pace and pile drives that dick all the way inside. Kris is on a mission and he's not stopping anytime soon. He then picks up Ari off the floor and drops him on the couch to get in there again. Here he slowly fucks Ari's ass as he gets more of that sweet ass. This sends Ari over the edge as Kris fucks the cum out of him literally. Ari shoots all over his abs and navel while Kris pounds away. Kris then pulls out and blows all over Ari who begs him for every last drop. YUM!",
  "models": [
    {
      "name": "Ari  Sylvio",
      "person_id": 28893
    },
    {
      "name": "Kris Anderson",
      "person_id": 28028
    }
  ],
  "release_date": "2011-08-04",
  "scene_id": 54178,
  "series": "Passions of the Kris",
  "tags": [],
  "title": "Passions of the Kris, Scene #02"
}