{
  "collections": [
    "Men Over 30"
  ],
  "description": "It's been a year since we saw IronMan and we can tell that the last year's been great for this local personal trainer. His body is back in shape and looking leaner and bigger than before. Having been born in Havana, Cuba IronMan came over when he was a toddler so he was basically raised here in Miami. IronMan spends a lot of time at the gym and when we ask him if he ever gets wood at the workplace, IronMan blushes. He tells us that's something he'll never admit to. He does admit to seeing a lot of guys walking around with their boners for all to see. When it comes to getting pleasured IronMan prefers getting his dick sucked to getting his ass licked. He also tells us that he feels his most sexy when he's about to cum. We asked him if there was any fantasy couple he would want to have a 3way with. Marc Anthony and Jennifer Lopez top that list. Well, if that's what he wants to get between he better step it up before there isn't a Marc and J-Lo to get between. Well, let's stick to the kinds of fantasies we can get our hands on?literally. And who better to start with than IronMan himself...IronMan starts off by showing off his impressive physique. He flexes his massive guns for us as he shows off one bicep after the other. He shows off his lats and his traps and slowly gives us the nickel tour. His body has definitely improved and is much leaner than we've seen him in a while. His tank comes off as he shows off his massive pecs and abs. He strips down to his boxer cut briefs that by now are definitely showing signs of stirring in the crotch region. He then turns around and gives us a few more poses showing off his back muscles as well as his defined shoulders. He teasingly kisses his biceps, smiling as he hams it up for the camera. He knows what he's got and loves showing it off. He drops his briefs as we get our first glimpse of his muscular ass. When he turns around he has his underwear hanging off his boner. ?Can you handle this?? he teases as he starts to smack it on his open palm. He is rock hard as he starts to stroke his thick meat.IronMan holds his cock by the base with one hand as he strokes his shaft with the other. His massive quads look impressive as they hold up his sculpted frame. He then sits back and continues to work on his throbbing cock. He swirls his finger around and teases his knob with the sweet precum he's oozing. He grabs it with both hands as he double fists it giving his cock maximum pleasure. He spreads his legs apart getting as comfortable as he can while he continues to stroke that cock in the hopes of relieving some of the day's pressure. His cock is rock hard and throbbing as he strokes it and it won't be long before those balls of his are going to want to explode. IronMan is in no hurry as he slowly and methodically jacks his meat. IronMan's muscles begin to tense as his stroking gets faster. He's not done yet and goes face first into the couch in a mock hump showing off his gym-toned ass. Look all you want, men it's not on the menu. He flips over and lies back so that he can bring it home. He jacks that dick faster and faster until his cock explodes sending his load all over his defined pecs and abs. Now that's a workout!",
  "models": [
    {
      "name": "Ironman",
      "person_id": 27926
    }
  ],
  "release_date": "2011-07-28",
  "scene_id": 54175,
  "tags": [],
  "title": "Fortified with Iron, Scene #01"
}