{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today we have two well seasoned men that have both made impressive careers for themselves in the industry. The first is Chad Brock. Chad is 38 and holding from the Windy City. Chad has been looking forward to this shoot for a while, and we can't blame him as we welcome back an industry legend, Troy Halston. Troy is 41 and originally from the Midwest but now calls Fort Lauderdale home. We wondered what the last thing was that made them very happy. ?A few minutes ago?on my back? confesses Chad. Apparently someone did it right. For Troy the last time something made him very happy was this morning when the Mrs. called to apologize for being such a bitch the last few days and reminded him that she loves him. We asked these two what the best blowjob that they'd ever received was. Troy was dancing at a club and went to the bathroom with a guy that damn near broke his nose deep throating his cock. It was the sloppiest blowjob he'd ever had and loved it. For Chad, his best blowjob ever was the first blow job he got from his current partner. ?Hmmmm, well, isn't that convenient? Well, experience speaks volumes in the horizontal mambo known as ?sex?, so sit back and pay attention!Troy is hanging out when Chad comes in with a cool napkin on his brow.  He got a new piercing over his brow so Troy goes in to kiss it and make it all better. Troy then unbuttons his shirt so that Chad can return the favor and kiss the piercings he has on his nips. Turns out he'd taken them both out but since Chad was already there... They start to make out before Troy sits back and starts to rub his cowboy boot into Chad's crotch. He helps pull them off as they strip each other. Chad gets on his knees and as Troy undoes his jeans he's there to give that cock a warm reception. ?Swallow that cock? coos Troy as he watches Chad swallow his hard dick. Chad strips Troy completely and Troy starts to return the favor. He pulls down Chad's underwear and engulfs his cock to get a quick taste. They go back to making out before Chad finds himself back on his knees deep throating that cock while Troy fucks his face. Troy then orders Chad to get on the couch where he lies back and gets his cock taken care of. Troy expertly swallows that cock to the hilt making Chad squirm in ecstasy. These two are working themselves up and soon oral won't be enough to satisfy them. Troy gets up flipping Chad's legs up over his head so he can get at that hole. He dives in tongue first as he gets that hole ready for a proper fucking. Once that ass is nice and wet, Troy moves into position and slides that dick in deep. He goes right to fucking Chad missionary as Chad moans with delight. The louder Chad moans the harder Troy pounds that ass. He pulls that cock out completely only to slam it back in. The chemistry is undeniable as these two go at it and Troy knows exactly how to give Chad the dick his hungry hole needs. He then flips Chad over onto his knees so he can go back to ramming that ass doggy style. ?You like that fat cock in your ass?? Troy teases as Chad grunts his appreciation. Troy's low hangers are slapping away at Chad's hole as he picks up the pace. To bring it home, Chad gets put on his back on the floor as Troy slides back in and starts to pile drive inside. Chad's getting exactly what the doctor ordered?dick! Troy pounds him pistoning his cock deep inside sending Chad over the edge as he shoots his wad all over his chest and face. Troy pulls out and unloads his own batch all over Chad's cum covered chest and face.",
  "models": [
    {
      "name": "Troy Halston",
      "person_id": 27796
    },
    {
      "name": "Chad Brock",
      "person_id": 27925
    }
  ],
  "release_date": "2011-07-21",
  "scene_id": 54174,
  "tags": [],
  "title": "The Troy of Sex, Scene #02"
}