{
  "collections": [
    "Men Over 30"
  ],
  "description": "Diego Vena is back this week and he, as well as all our members, is in for a real treat as we welcome a hot sexy addition to the MenOver30 Club, Mr. Ari Gypsy. Ari is 32 years young and hails from New Orleans, LA. Ari's background is Romanian Gypsy and Mexican which help give him the exotic look he's rockin. Ari is new to this whole new scene and up until a few weeks ago was only into the female persuasion. ?Everyone out there that is straight, you need to have an experience with a man. It's a lot better than a female can give you? Well there's an unexpected endorsement from the newbie. Maybe that Spanish ass Diego brought to the table still has him a bit loopy. Ari may be new to fuckin men but he's not new to fucking and he can bring it better than most. With that in mind we asked these two where the hottest place they'd ever fucked was. Diego's hottest experience was just last week where he ended up getting fucked near a vending machine. He was in a closet next to the machine and people were coming and going as he got plowed and the risk of getting caught made him hornier. For Ari, he's been responsible for dropping more than just 'prices' at Walmart. (by ?prices? we mean?well, YOU know.)Diego is done showering and when he comes back into the room he sees Ari playing with his boner. He walks in and as he reaches over Ari to get his pants, his towel comes off. Ari's curiosity gets the better of him as he grabs hold of Diego's ass. He starts groping as Diego starts to tease him falling into Ari's lap and going in for a kiss. They start to make out as Ari's hands explore Diego's growing cock. Ari then gets up and drops his jeans as Diego goes to work teasing his boner through his loose fitting boxers. That's short lived as Ari shucks his boxers and sticks his dick in Diego's warm mouth. This is more like it as Ari gets comfortable on the armrest and starts to bob Diego's head on his hard cock. Diego doesn't mind one bit as he swallows all the str8 dick he can. Someone's working their ass off for a toaster oven. Hmmm. Ari then gets led to the couch so that he can give head a go. He pulls off Diego's briefs and shoves them into Diego's face as he goes in for another kiss. He then licks his way down Diego's chest and abs til he gets a mouthful of cock. He starts to suck on it as best he can, making himself gag a few times when he gets more in then he can manage. Diego doesn't mind one bit as he watches Ari service his cock.Fortunately for Ari, Diego wants more of his dick anyway and is soon on his knees worshiping that Gypsy meat. Ari then slaps that hot ass wanting to get that ass around his cock. He leans back and watches as Diego climbs aboard and just sits on his dick. Diego impales himself on that dick like a pro and is soon riding that cock like a seasoned jockey. Ari is in awe as he gets to lay back and watch his dick disappear inside that tight ass while Diego does all the work. Go on with your bad self! Diego then takes the lead as he gets up and bends Diego over on the couch for some hard fucking doggy style. ?Like that fucking shit' Ari grunts 'your ass is so tight? He slams harder and deeper into Diego's hot hole as Diego bites down into the couch trying to keep his composure. Straight boy can fuck an ass?but wait, there's more. He moves the party south as he gets between Diego's legs on the floor and brings it home missionary. He fucks him so good that Diego explodes all over himself sending his nut blasting onto his smooth navel. Ari then pulls out; quickly jumping to his feet and jacks his load all over Diego. We could definitely learn a move or two from this curious str8 boy. Hope y'all took notes.",
  "models": [
    {
      "name": "Ari Gypsy",
      "person_id": 28025
    },
    {
      "name": "Diego Vena",
      "person_id": 27984
    }
  ],
  "release_date": "2011-07-14",
  "scene_id": 54172,
  "series": "The Gypsy King",
  "tags": [],
  "title": "The Gypsy King, Scene #02"
}