{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a scorching new addition to MenOver30 as we welcome Spencer Reed. Spencer is 28 and from the City of Brotherly Love. This Philly native is the complete package. He's huge, hung and handsome. This dark featured monolith is anyone's cream boat. Today Diego Vena will get to try out Spencer's 'reed' as we welcome back this 33 year old from South Bend. We asked if they liked to read. Diego doesn't have a favorite author but loves horror books. Spencer prefers to hit the gym over the books and the results are evident. We then wondered what they both wish they had more knowledge about. Spencer flashed that killer smile of his and answers foreign policies. Riiiight! Diego goes with American Politics. We then turned the topic back to sex and wondered if they'd ever taken someone's virginity. Both of them have been the first for some lucky men and both agree the idea of it can be hotter than the actual doing that. Those usually end up in either awkwardness or they fall madly in love with you which can get pretty awkward too. Well, there will be no awkwardness with this two seasoned pros this afternoon so let's get this party started...They start off making out on the couch as Diego starts to run his tongue down Spencer's massive chest and abs. Spencer flexes for Diego as he lays back so that Diego can have at him. Diego licks his way south til he reaches Spencer's growing crotch. He pulls off his jeans as he starts to tease that cock through his briefs. Diego then teases Spencer some more as he starts to suck on his toes and make him wait. Spencer lets him work his sexy feel for a few before standing up and putting his crotch in Diego's face. Diego goes to town on that thick cock as Spencer starts to bob his head on it. Spencer's cock is soon rock hard as Diego deep throats as much of it as he can. Diego goes wild wanting that fat dick as he slaps his face with it while he looks up at Spencer for approval. Spencer loves that mouth on his dick and shoves it right back in for more. Diego works his heavy nuts before going right back to shoving that meat all the way down his throat. Spencer then bends Diego over and gets his tongue up in that smooth ass he will soon be stretching open. Diego groans as he gets that ass prepped for a proper fucking.Spencer eats that ass and starts to finger that ass teasing Diego and making him want that cock even more. 'You want dick?' Spencer grins as he gets into position and starts to shove inside. Diego grunts in pain as he gets that tight ass plugged. Spencer starts to pound away at that ass as his ball slap away at Diego's hole. Diego jacks his cock as he gets his ass plowed. Spencer loves that ass and gets on the floor to let Diego do some work. 'Ride that dick' he grunts as Diego starts to ride. He squats up and down on that meaty dick as he holds on to Spencer's neck as he goes in to make out as he impales himself on that dick. Spencer then gets Diego on this back and keeps the party going missionary style. He watches as Diego's hungry ass just swallows his meaty dick with ease. Diego grunts as he gets that dick shoved even deeper than before but he's not about to start complaining now. Spencer then gets him over on his side as he continues to give that ass what it needs- more dick. Spencer then pulls out and unloads all over Diego's face and head as Diego strokes his own load all over his happy trail.",
  "models": [
    {
      "name": "Diego Vena",
      "person_id": 27984
    },
    {
      "name": "Spencer Reed",
      "person_id": 28030
    }
  ],
  "release_date": "2011-09-15",
  "scene_id": 54189,
  "series": "Spencer's Gift",
  "tags": [],
  "title": "Spencer's Gift, Scene #01"
}