{
  "collections": [
    "Men Over 30"
  ],
  "description": "Ari Gypsy is back in the house and we love watching this str8 32 year old beau from New Orleans go at it on the all male side of the buffet. This week we have a blast from our CJB past, Zane Jacobs. Zane will finally make his debut here on MenOver30... by injection. This 27 year old Illinois native recently moved here to South Florida. We asked these studs if there was anything they'd want to do before summer wraps up. Ari wants to fuck two guys on the beach as the sun sets. Zane wants to get a decent tan, try some wind surfing...and punch a shark. Yeah, that's a definite Midwestern thing- locals know better. Ari has only been doing all male porn for a couple months after deciding that there may be more to life than what meets the eye. 'Best thing I've learned about is be yourself today' says Ari, 'enjoy who you are and you'll feel more comfortable with yourself.' Ari admits he is more attracted to older guys now that he's exploring that aspect of his sexuality. Zane just loves masculine men. We wrapped it up by asking what their ultimate fantasy was. Ari wants a 3 way with two transs and wants to be the cream in that sandwich. <...cricket> Zane wants a steamy beach scene with several sex partners involved but is still holding casting auditions.Ari is kickin' back waiting on his costar to show up when Zane walks in thinking he's in the wrong place. Ari doesn't look like he'd be into guys but Ari assures him he's come to the right place as he whips out a pic of himself sucking cock. That's good enough for Zane who moves over to the couch and starts to make out with Ari. Ari gets up and does his best stripper dance as he slowly peels off his shorts. (Soundtrack pending) When his shorts do come off, Ari's half hard cock is happy to greet Zane who is more than ready to swallow it whole. Ari's cock quickly comes to life as he starts to face fuck his new buddy. Zane has his own growing situation in his pants and Ari helps him out of his jeans to help a buddy out. Zane's cock flops out as Ari starts to rub his cock against Zane's long schlong. Zane gets on his knees to get more of that Bayou bone for a bit before switching to let Ari return the favor. These studs can't get enough of each other's cocks and eventually Ari's cock needs more than Zane's hot mouth.Zane gets put on his back as Ari holds his legs up and shoves his cock deep into Zane's tight ass. He starts to fuck that ass as Zane moans his approval. Ari braces himself on Zane's thighs as he starts to pound that ass, bouncing in and out of his ass like he's jumping on a trampoline. 'Like my fucking dick?' He grunts as he fucks Zane deeper.  Ari grinds his dick deep into that hungry hole driving Zane wild. He then moves Zane to the floor where he keeps fucking him missionary but has easier access to that ass. He pile drives his meat deep into that hot ass. He can't get that dick deep enough as he revels in the sensation wrapped around his throbbing cock. He makes out with Zane as he keeps pumping that ass. To take it home, he sits back and has Zane ride his cock. Zane takes that dick all the way and grinds on it pushing Ari's cock into his prostate. That does the trick as Zane explodes all over himself coating his face and chest. Ari then pulls out and jacks his own batch all over his smooth frame. Zane tweaks his Ari's nips and jacks off as he watches Ari shoot his nut. Zane is so turned on he pumps out a second nut all over his cum covered abs. Whew.",
  "models": [
    {
      "name": "Ari Gypsy",
      "person_id": 28025
    },
    {
      "name": "Zane Jacobs",
      "person_id": 28029
    }
  ],
  "release_date": "2011-08-18",
  "scene_id": 54184,
  "series": "Zane-a-do",
  "tags": [],
  "title": "Zane-a-do"
}