{
  "collections": [
    "Men Over 30"
  ],
  "description": "Love is in the air as we welcome back the dynamic duo, Chad Brock and his better half, Clay Towers. Clay is 35 and originally from Chicago. Chad is eternally 38 and also from the Windy City. They have been together for about 2 years now and have managed to mesh their porn careers into their personal lives. We asked if they were at all fazed by the goings on this summer with the economy and the tea party antics, etc. They both weren't at all fazed by the hoopla and didn't let any of the craziness affect them. The fact that they both work in the adult industry is also another thing that they don't allow to faze them. 'I get a little jealous sometimes' says Clay 'but it's just because I miss him'. They seem to be very compatible. Clay loves Chad smile the most and really appreciates the way he cares about him. Chad loves Clay's face the most and the fact that he's so laid back really works well with his own energy. To wrap it up we asked them what special request they'd want from each other on their birthdays. Chad would want to have Clay set up a gang bang for him in a sling. Clay would just keep it simple and have Chad just get naked with him in bed for his birthday. Clay is clearly the 'High Maintenance' one. They haven't seen each other in a couple weeks so they've decided to have their reunion 'union' here with us. They start to make out slowly as their hands begin to explore the familiar. Chad's shirt comes off as Clay kisses his way down his hairy chest towards that cock he's missed. He unzips his jeans and goes for it. He pulls it out of his tight briefs and starts to nurse on his growing cock. He licks his balls and runs his tongue along the length of his shaft before engulfing it completely. Chad moans as he gets his cock serviced by the one who knows it best. Clay looks up at his partner to make sure he's enjoying everything he's doing on that cock. Clay then stands to give Chad the opportunity to give some back. Chad peels down Clay's underwear setting his thick cock free. He wraps his lips around that meat as Clay starts to fuck his face. Chad greedily takes every inch he's offered as they continue to work each other up. By now they're both rock hard as they stand and make out while rubbing their boners together. Chad gets Clay back on the chaise as he goes back for more cock and giving his tongue the chance to slide south into that hot ass he wants to fuck. Clay moans as he gets that ass prepped...Chad eats that ass deep and Clay's legs are up and already in the perfect position to get that dick inside. Chad puts that cock in Clay's tight ass as he starts to slide it in. Clay groans as he gets that hairy ass stretched. Chad grabs his beau's cock and strokes it as he starts to pound that ass. They make out as Chad fucks him missionary. Then Chad switches it up getting Clay to bend over so he can tap that ass doggy style. Clay can't get enough cock as he bends over and feels Chad's smooth balls slam against his hungry hole. Chad gets to shove that dick as deep as he wants in this position and he's taking full advantage of that. Chad then gets Clay right back where he started. Clay is soon on his back with his legs in the air and taking that dick deep. As Chad fucks him harder Clay starts to stroke his thick cock getting him closer to climax. 'I'm fuckin' coming!' he grunts as Chad fucks him deeper making him bust his nut all over himself. Chad then pulls out and jerks his own load all over his cum-drenched partner. Now that's how you welcome your partner home.",
  "models": [
    {
      "name": "Chad Brock",
      "person_id": 27925
    },
    {
      "name": "Clay Towers",
      "person_id": 27968
    }
  ],
  "release_date": "2011-09-08",
  "scene_id": 54188,
  "tags": [],
  "title": "Marital Bliss, Scene #02"
}