{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have an old friend back and at 42, Chris Stevens is looking as good as ever. Well, he's not alone; we also have another blast from our past as we welcome Dallas Reeves back as an honorary MenOver30-by injection. Dallas is 27 now and even though we haven't seen him on our brother sites in a while we're happy to have him back. We asked these two if they had the opportunity to take a trip and got to pick out any car they wanted as their means of transportation what would it be. Dallas would want a green Maserati. Chris is torn between an arrest me red Lamborghini or a 1974 Cadillac El Dorado. TV was next on the topic band wagon and we wondered what their favorite TV show of all time was. Dallas loves anything on the Nature Channel while Chris is a diehard fan of the Price is Right. We wondered who is their favorite musical performer or band. Dallas is a big fan of Sade while Chris used to love Zeppelin but his tastes have changed over the years. Yeah that happens. Fortunately time may have changed what these two may like but we know there's one thing that hasn't changed. We're about to see what that is... Chris Stevens-COME ON DOWN!Dallas is kickin' back reading a mag when Chris comes in all embarrassed about a situation that just happened. Apparently he tore his overalls in the most precarious place. He asks Dallas for a needle and thread when Dallas asks him how bad it is. Chris turns around and Dallas realizes his hairy ass is accessible. Well, that's not really a bad thing as Dallas goes in for a closer look. He shoves Chris forward as he falls into a doggy position on the chair before him. Dallas quickly spreads his cheeks and dives in tongue first. Lunch is served! Chris moans as Dallas eats his hot, hairy hole. He then turns around as Dallas continues to strip him exploring his nips and chest. Chris pushes Dallas back on the couch so that he can get some of that dick. He peels off Dallas' shorts a he goes in for that hard cock. Dallas groans as he watches Chris swallow that thick dick. Chris gags on it as he takes as much of it in his throat. They then take turns servicing each other as their cocks throb from all the attention. Soon Dallas' cock is craving more than Chris' hot tongue on it.Dallas lays back and suits up as Chris straddles his cock and starts to impale himself on it. He starts to ride Dallas' cock once he gets used to it as Dallas just lays back and enjoys the view. How much is that showcase worth? Chris bounces on that dick hard as he continues to pleasure himself on that rock hard cock. Dallas loves the ride but he wants more control as he gets up and bends Chris over and gets right back to business. Chris gets that tight ass pounded as Dallas' balls slap away at that ass. Chris bucks that hot ass back onto that rock hard cock wanting to get every inch of it inside him. Fucking Chris doggy style lets Dallas bury his cock all the way inside as he buries his boner balls deep. Chris reaches back grabbing Dallas' ass and thigh wanting to pull him in even deeper as he gets mounted. Missionary is next as they reconvene on the couch with Chris' legs in the air begging for Dallas to fuck him harder. Dallas obliges slamming inside him harder and faster and hitting him in that sweet spot that sends him over the edge. 'I'm gonna cum!' he grunts as Dallas fucks the cum out of him. Dallas then pulls out and unloads his own thick batch all over one cum covered Chris.",
  "models": [
    {
      "name": "Chris Stevens",
      "person_id": 27908
    },
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    }
  ],
  "release_date": "2011-09-01",
  "scene_id": 54181,
  "series": "Torn Between Two Rubbers",
  "tags": [],
  "title": "Torn Between Two Rubbers, Scene #01"
}