{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have a treat for you this week as we welcome back Cali native Alexander Garrett. Colombia is proudly represented today by this 34 year old hunk. His co-star this week is none other than Cole Streets. This sexy 32 year old from the Lone Star State subtly reminds us all at 6'5' that they really do grow them big in Texas. We asked these two what was the last compliment they received. For Cole it was a compliment on his hairy chest. Alexander got complimented on his biceps which are looking quite impressive. We then wondered how tidy these boys were on a scale of 1 to 10, 1 being a total slob and 10 being a hotel maid. Cole rates himself a solid 6. Alexander would be an 11. He likes everything in order. When it comes to body hair they both like their partners trimmed especially in the pubic region. Cole takes it one step further and demands that everyone shave their balls. -amen! We then asked them what their most memorable sexual experience was to date. For Cole, it would have to be his first time. It was awkward but definitely memorable. Alexander likes to make every sexual experience as memorable as his first. Awwww. We should all be as lucky as this tall, dark charmer. Cole laughs as he tells Alexander that the pants he gave him were way too short for him to wear. Alexander can't understand why since he's 5'11' and Cole is only 'a bit' taller. Cole turns him around as he reminds him he's 6'5' as he measures up to see just how tall he really is. As Cole is figuring that out Alexander comes up to just about his nose level, Alexander's hands are roaming behind him grabbing Cole's cock. Cole grins as he wraps his arms around Alexander and starts to feel his defined chest and arms. Alexander peels up Cole's tee as he starts to lick on his furry chest. They make out as their clothes come off. Alexander goes down to get a better idea of what he's working with and is soon sucking on Cole's hard cock. Cole watches as he gets that dick worked by Alexander who takes his time pleasing his hard cock. Cole then takes Alexander's cock out to give it some breathing room. Cole goes down on the floor to nurse on Alexander's cock as he takes all of it deep. Alexander feeds him all the dick he can handle. Cole can't get enough of that cock as he savors every inch of that uncut Colombian meat. Cole then bends over on the couch and spreads that hot ass open for Alexander's approval. Alexander decides to go in for a closer inspection, tongue first. Cole moans as he gets that hot ass rimmed making him want that dick even more. Alexander then lays back on the couch as Cole straddles his thick cock and sits right down on it. He takes that dick deep as he starts to ride it. Alexander helps him out by thrusting his hips up into Cole's tight ass. He bounces him on his cock with ease before they switch things up. Alexander lies on his side on the couch as Cole slides in (literally) behind him; giving him a taste of his own medicine. He slides that cock into Alexander and starts to fuck him. Alexander groans as he feels Cole impale his cock as deep as he can get it. Then things get interesting as they maneuver into a reverse pile driver. Alexander is on his back staring at Cole's balls as he gets plowed. Cole then flips around and pile drives him so he can look at his face. It makes him blow as he pulls out and drenches Alexander's hot ass and face with his load. Alexander whose cock is now above him explodes drenching his own face and chest. The ultimate facial package...",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Cole Streets",
      "person_id": 27983
    }
  ],
  "release_date": "2011-08-11",
  "scene_id": 54180,
  "series": "Shoveling Cole",
  "tags": [],
  "title": "Shoveling Cole, Scene #02"
}