{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a pairing that's been months in the making. We've wanted to get these two together ever since our MenOver30 by injection, Trey Turner, told us he would love to be in a scene with Matthew Rush. Trey is a hot 23 year old that hails from New Jersey. Matthew is in his 30s and is originally from Pennsylvania. We asked these two how politically savvy they were on a scale of 1-10. Matthew says he's about a 5 after that it gets to be too much. Trey seconds that emotion and says he's about a 5 as well. We then wondered what their favorite TV network and show are. Trey loves HBO and is a fang bangin' fan of True Blood. Matthew likes FOX and is hooked on Hell's Kitchen. On the line of favorites, we asked these two what is their favorite thing to do sexually and what do they considered themselves great at. Trey loves to bottom and considers himself a damn good one. Matthew agrees. For Matthew he loves to rim. That is the one thing he can single out as his favorite to do in the bedroom among so many other possibilities. Well, let's not keep the young'n waiting and give him what he's been craving-one hell of a Rush.Trey is laying on the bed looking at a pic of Matthew in a folder thinking all sorts of things when Matthew comes in; takes the folder out of his hands and replaces it with the real thing. They start to kiss as Trey starts to strip Matthew. He goes to work licking at his massive chest as Matthew groans his approval. Trey moves south to the growing bulge in Matt's shorts as he starts to work that cock through his shorts. Trey figures he's waited long enough as he undoes Matt's shorts and gets to work on that swollen cock. He takes that dick into his mouth and finally gets to run his tongue along Matt's smooth balls and cock. He sucks it all the way down his throat as he looks up at Matt for approval. Matt holds his head as he helps bob him on his meat. Trey deep throats that thick cock with ease and soon they are making out as they rub their cocks together. Trey then gets back on his knees for more of Matt's dick. Matthew begins to feel left out as he takes his turn at bat. Trey sits back and watches as Matt sucks on his cock greedily swallowing every inch he's given. Trey is rock hard and not about to complain any time soon. Things then turn around (literally) as Matt gives Trey access to that ass so that he can get his tongue up in it. Trey rims Matt getting that ass nice and wet. It makes Matt horny as Matt then wants to taste Trey's ass. He gets that tongue deep inside Trey's ass and shows off his best skills. Trey's backing that ass up onto Matthew's face as he gets that hole teased. Once it's nice and slick, Matt gets behind him and pushes that dick inside. He fucks Trey doggy style as Trey's ass slowly gives in. Matt fucks that sweet ass deep and once that ass gets used to his cock he switches it up and has Trey sit on his cock. Trey obliges finally getting that dick he's wanted for so long shoved deep as he starts to ride it. He squirms and grinds that hot ass all the way down as Matt bounces him on his cock. Matt grunts and groans as Trey rides that meat hard. Missionary is next as Matt gets Trey on his back to fuck him some more. Trey is moaning as he gets that ass stretched. Missionary always does the trick and as Matt pounds him deeper Trey loses it, shooting his load all over himself. Matt then follows suit shooting his load all over Trey.",
  "models": [
    {
      "name": "Trey Turner",
      "person_id": 27927
    },
    {
      "name": "Matthew Rush",
      "person_id": 27951
    }
  ],
  "release_date": "2011-08-25",
  "scene_id": 54186,
  "series": "Menage a Trey",
  "tags": [],
  "title": "Menage a Trey, Scene #02"
}