{
  "collections": [
    "Men Over 30"
  ],
  "description": "Matthew Rush is back this week as we welcome a new face to the fold. Kyle Butler is 25 years old and a proud Chicagoan as he does a little 312 dance. Chicago in da house!  Matthew will be 38 in a few days and this fan favorite hails from Pennsylvania. We decided to get more personal with the self admitted geek, nerd and avid reader Matthew Rush. We asked if he were to write a book what kind of book it would be. He would make it humorous and totally non-fiction. It would be a comedic look at porn. Erma Bombeck, watch out. If Kyle were to write a book it might be a friend-fueled memoir on his own crazy day to day stories though he's actually working on a zombie novel based on 13 different characters. He loves Zombies. Being that Kyle is str8, we wondered when he discovered that his ass was a pleasure zone. Apparently undressing in 6th grade gym class made him curious enough to start touching himself in new places. Kyle also discovered a world of toys and sometimes even carries a pocket vibrator to give the ladies pleasure while grinding on the dance floor. Matthew is doing curls showing Kyle how he stays in shape while on the road. Kyle can't help but comment on how big his muscles are. Matthew encourages him to take a closer look and as he does, they start to make out. Matt moans as Kyle's tongue explores his chest and nips while his hands are groping Matt's growing boner. Kyle is soon on his knees wanting to explore another 'muscle'. He hauls out Matt's cock as he opens wide and gets it nice and wet. He opens his mouth wide as Matthew bobs his head up and down on it making him gag on it. Kyle gets that dick deep in his throat as Matt moans his approval. Kyle then gets up and has Matt return the favor. He strokes his bone as he gets Matt to lick his balls. Once he's rock hard he shoves his thick dick in Matthew's mouth. Matt looks up at his new buddy as he gets his face fucked. Kyle holds Matt's head as he grinds his dick inside sending his low hangers into Matt's chin over and over. Matt then gets on the bench and gives up that ass as Kyle's tongue finds its way inside. Matt can't get enough as he spreads those beefy cheeks so that Kyle can get that tongue deep.Kyle then gets on his back so that Matt can suck his cock and eat his ass as well. Matt obliges and soon Kyle gets some anal beads for Matt to use on his ass. Matt slides them into Kyle's hairy hole; teasing that ass a bit before pulling them out and replacing them with his thick cock. 'Fuck me with that big dick' Kyle grunts as Matthew goes to work fucking that tight ass. He slaps Kyle's ass as he mounts him which only makes Kyle want more. Matthew fucks him hard and deep as Kyle strokes his rock hard cock. Matt then switches it up as he sits back and watches Kyle take his dick in a reverse cowgirl. Kyle impales himself on that dick and starts to ride that meat taking it all the way inside his tight ass. Matt groans in ecstasy as he gets that dick worked by that tight hole riding it. Missionary is next as he gets Kyle on his back before slamming inside. Matt's cock is hitting Kyle's spot just right as he explodes all over his hairy chest and abs. Matt then pulls out and stands as he unloads all over Kyle.",
  "models": [
    {
      "name": "Matthew Rush",
      "person_id": 27951
    },
    {
      "name": "Kyle Butler",
      "person_id": 28034
    }
  ],
  "release_date": "2011-10-13",
  "scene_id": 54197,
  "series": "Bead Work",
  "tags": [],
  "title": "Bead Work, Scene #01"
}