{
  "collections": [
    "Men Over 30"
  ],
  "description": "Who's YOUR Daddy? This week you're in for a real treat as Brooklyn's own, Doug Jeffries makes his return to MenOver30. Doug is now 45 and fit as ever. Doug is in for some local flavor as he gets to have a go with horse-hung Mario Costa. Mario is a Cuban favorite of 25 years and a HUGE fan favorite on our brother site ExtraBigDicks. With that lean frame and a monster, uncut 9? cock you can see why. lol We wondered if either of these boys had ever lived through a natural disaster. Mario has survived several hurricanes, like Wilma and Katrina, which makes sense living here in the tropics. Doug has only had a brush with a severe snow storm in upstate NY. Both of these studs admit that their first sexual experiences with other men were good ones and they wouldn't change a thing. They both waited til they were in their late teens and early 20s. It was a life changer for Mario while Doug ended up dating his first beau. These studs have a lot in common seeing as they both love to kiss and are both romantics at heart. We then asked if they'd rather give or receive oral. ?Receive!? Mario blurts out with a grin. Doug also agrees and admits he'd rather get then give. Well today we'll be having a whole lot of both...Mario and Doug are chillin on the couch talking about how nice it is to finally get to work together. That leads into some kissing as Doug asks Mario if he'll bottom for him. Hmmm. They go at it hot and heavy as they stand and start to help each other out of their clothes. Doug pulls down Mario's shorts and starts to check out that smooth ass. Mario's moaning as Doug runs his hot tongue along his smooth ass crack then shoves it inside. Mario loves the attention he's getting so he turns around to show Doug just how much. Doug's eyes light up as Mario swings around and points that beer can cock at his face. Doug grabs it by the base and shoves as much as he can down his throat. He'll have plenty of Cuban cock to work on as he kneels before his buddy to worship at his cock altar. He grabs those smooth nuts, tugging on them as he slaps his face with that wet cock. Doug then stands up to give Mario a chance to give back. Mario kneels and gets to work on Doug's dick. Doug fucks his face finally having that mouth around his cock. But wait...there's more.They then move over to the chaise where they maneuver into a hot 69 with Mario taking bottom bunk and getting that dick lowered into his mouth. Meanwhile Doug is bobbing his head up and down on Mario's. Doug then bends Mario over that same chaise and slides his cock inside. It's not every day we get to watch this hottie take it up the ass. He grimaces as Doug slams inside. Doug reaches forward grabbing Mario by his shoulders so he can pull him back onto his cock. He pounds away as he's latched onto Mario sending that cock deeper and deeper. Missionary is next as Doug slides his dick home again. He holds Mario's legs in the air as he fucks the Cuban boy deep and hard. Mario is rock hard and stroking his own meat as he gets that hole pounded. They then move over to the couch where Doug lies behind Mario and then slips his dick in from behind. Mario's massive meat is aching to cum as Doug picks up the pace. He slams that meat deeper as they kiss. Mario can't hold it any longer as he shoots all over his smooth navel. Doug is next as he pulls out and unloads his cargo all over Mario's cock and balls.",
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 27928
    },
    {
      "name": "Mario Costa",
      "person_id": 28031
    }
  ],
  "release_date": "2011-09-29",
  "scene_id": 54193,
  "tags": [],
  "title": "Coastal Erosion, Scene #01"
}