{
  "collections": [
    "Men Over 30"
  ],
  "description": "Two hot studs debut this week and we couldn't be happier to have them. Alessio Romero is 37 years old and originally from Mexico City. Alessio is beefy, inked and hairy and today will be playing with one who appreciates all he has to offer. Smooth; a huge uncut cock and rock hard abs are just some of the attributes 33 year old Valentin Petrov brings to the table. This Russian import is definitely one to watch. We asked these studs what their favorite holiday is and where they like to spend it. Alessio loves the Fourth of July and Valentin loves Christmas. They both would want to spend it in New York City. We then asked where they would go if they had a week's vacation. Alessio would want to go to Prague. Valentin would want to go to Australia. We asked these two studs what they felt they could use help on in the sexual department. They both wish they would take more time doing it giving them more durability. Sex wasn't meant to be something you have to rush through. When we wondered what they wish other guys were better at. Alessio said kissing and Valentin couldn't agree more. If the kissing isn't there it just isn't happening. Well, lets get these two started... The chemistry is off the charts as they get to it without wasting any time. Alessio calls Valentin over as they start to make out immediately. Their shirts come off as they begin to lick and explore each other's chests. Alessio licks Valentin's smooth pecs and works his hairy arm pits as Valentin moans his approval. Valentin then licks his way south til his face is buried in Alessio's underwear. He hauls out his hard cock before taking it in his mouth. He works that thick cock taking his time as he worships every inch of it. On his knee, Valentin looks up at Alessio making sure he's doing a good job. Alessio then takes his turn at bat as he gets on his knees and releases Valentin's thick uncut cock. Valentin is rock hard as he slides his thick dick deep into Alessio's hungry mouth. Alessio pulls his thick foreskin forward as he shoves his tongue inside it making Valentin squirm. They then stand as Valentin slides Alessio's cock into his foreskin. Docking never looked so hot and the sight of it makes Alessio hungry for more Russian meat as he goes right back down on Alessio's thick meat taking it as deep as he can.After working that thick cock, he hoists Valentin's legs up so he can get at that hot ass. He shoves his tongue inside and goes to work eating that hairy hole.  Valentin's cock is rock hard as he gets that ass rimmed. Once it's nice and wet, Alessio suits up and slides his thick cock inside. Valentin's ass concedes and is soon taking that dick with ease. Alessio pounds that ass missionary as he watches Valentin stroke his aching cock. They switch it up as Alessio sits on the chair and watches Valentin sit on his dick. He starts to ride Alessio's cock like a pogo stick as he gets every inch of dick inside him. Valentin is pleasuring himself with all the dick he needs. Alessio has more in store as he bends Valentin over and gets to work fucking that hot ass doggy style. Valentin is grunting and groaning as Alessio buries that dick into him over and over. He starts to fuck him faster and deeper as his breathing begins to labor. That tight hole does the trick as Alessio pulls out and explodes all over Valentin's chest and abs. Valentin's next as he too unloads shooting his own face and chest.",
  "models": [
    {
      "name": "Alessio Romero",
      "person_id": 28032
    },
    {
      "name": "Valentin Petrov",
      "person_id": 28033
    }
  ],
  "release_date": "2011-10-06",
  "scene_id": 54196,
  "series": "Valentin's Day Ass-acre",
  "tags": [],
  "title": "Valentin's Day Ass-acre, Scene #02"
}