{
  "collections": [
    "Men Over 30"
  ],
  "description": "Troy Halston is back this week and this Buckeye is in for a treat as we welcome back hunky 30 year old David Chase. Troy is now 41 and though he was born in Akron he has considered Florida home for the last couple decades. We wondered if either of these two have ever lived through a natural disaster. Troy got here 2 years after Hurricane Andrew clear cut a path through South Florida and he doesn't feel the few that have followed have been that big a deal. David hasn't and says that where he's from they have yet to have any ?natural disaster? happen. We wondered how different their sex lives at home are compared to what they experience on set. David feels he uses the adult industry to spice up what he considers pretty vanilla sex at home. Troy says his is a mixed bag since him and the Holly Halston at times keep it pretty vanilla then there are other days when they get their freak on totally twisted. When it comes to what turns them on the most, for David it's having his tongue 3? up a hot ass. For Troy, it would be having a tongue 3? up his hole. Hmmm. How conveeenient. That's a ?hole? lotta info right there. lolDavid is sitting on the couch trying to figure out how to tie a tie when Troy decides he needs a little help. Troy put the tie around David's neck and as he proceeds to show him how to, David's hand finds his way onto Troy's crotch. He turns to face Troy as they start to make out. David then heads south to check out what Troy's packing. He hauls out Troy's cock and gets to work on it as Troy groans his appreciation. Troy fucks that face and watches as David struggle to take all of it. David swallows it as deep as he can, making himself gag on it. David looks up at Troy as he services that cock wanting to make sure he's doing it right. Troy then wants some as he sits down and pulls David closer. He returns the favor as he gets to work sucking on David's thick cock. David gasps as Troy's talented mouth goes to work on his meat. This is just what he needed before his big interview and Troy's not about to let him down. Troy then gets David bent over on the couch again and slides his tongue deep into David's beefy ass. David squirms as Troy teases that ass with that hot tongue of his.Once that hole is wet and ready, Troy gets into position as he slides inside. His smooth ball slap away at that ass as Chase grunts and begs for more. ?You like that cock?? Troy teases as he starts to rail that ass. David whimpers as he gets that hungry ass filled. He can't get enough of it. Troy then switches it up as he sits back and watches David sit on his cock in a reverse cowgirl position. David's hard cock springs like a trampoline as he bounces on that hard cock. David is going to town on that dick as he pleasures himself on that hard cock as he strokes his own. Troy does his best to shove his dick as deep as possible. Troy's cock is hitting David's prostate just right and it makes David's cock throb as he busts his nut riding Troy's. Troy then kneels over David's chest as he unloads his thick cargo. David, who is stroking his still swollen meat as he gets coated, jerks his cock into a second orgasm adding even more protein to the mix. Now that's how you tie a tie, Betches!",
  "models": [
    {
      "name": "David Chase",
      "person_id": 27963
    },
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2011-09-22",
  "scene_id": 54191,
  "series": "The Troy Fuck Club",
  "tags": [],
  "title": "The Troy Fuck Club, Scene #01"
}