{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have waited a while to be able to say, Dean Monroe and Ricky Sinz are finally here on MenOver30. We asked these studs what their fan base at home would be surprised to know about them that they don't know. 'A lot of people think I'm this hungry power bottom always out looking for sex' says Dean with a slight London accent 'but that couldn't be farther from the truth. I'm usually at home every night, cooking dinner.' There's no romance going on at the moment for Dean. For Ricky he actually has a hobby collecting Buddhist figures. We wondered about their very first sexual experience. For Dean it wasn't memorable. He left his home country of Greece cuz he couldn't be gay back home, moved to London and went to a gay club picked up a guy so eager to have sex. It must've lasted 2 minutes. For Ricky he was 13 and was seduced by a 28 year old woman. She thought her was older....right! He didn't have sex with a guy til 98. He always had an attraction but never went after it until it fell on his lap. We then wondered what these two thought they'd win medals for. 'My latex ass' answers Dean that says he can take anything up there and he's happy. For Ricky, he loves to verbally dominate in the bedroom and knows he talks dirty better than most. Hmm. Ricky and Dean are chatting on the couch when Ricky asks Dean what was the hottest scene he'd ever shot. Dean didn't want to name names; but he assured him the guy fucked him really good and really knew how to work his big dick. Ricky had a really hot scene with a big muscle power bottom that could take it really good. Dean grins and says he's better than any power bottom with his 'latex' ass. 'That's what I'm known for' he grins. Ricky tells him he doesn't know who fucked him real good but Dean hadn't had his dick yet. They start to go at it as Ricky hauls out his thick cock. Dean goes for it sucking as much of it down his throat. 'You have a latex mouth, too' Ricky groans as he fucks Dean's mouth. Dean savors every inch as Ricky bobs his head up and down on his meat shoving it down his throat. Ricky's body is massive. His frame is covered with ink and has an array of tattoos all over his muscular frame. Dean worships that meat until Ricky turns around and tells him he wants that attention on his ass. Dean dives in as his beard brushes against Ricky's hairy ass. He spits on that ass as he goes in repeatedly wanting to bury his tongue deep into Ricky's hole. Ricky then lays back and as Dean goes back to sucking that cock, Ricky starts to finger that tight hole. Dean moans as he gets that hot ass fingered. Ricky then suits up and watches as Dean lowers himself onto that dick. Dean's ass takes that dick deep and once inside he leans back onto Ricky's chest and starts to fuck himself with it. He bounces on that meat as Ricky lays back in ecstasy. Dean's rock hard as he gets off Ricky's cock so that he can turn around and ride it facing him. That hungry ass takes that cock deep as he bounces up and down on it. Ricky lets him have his fun until he wants to take control. He puts Dean on his back and flips his legs up towards his head. That hot ass is up in the air and begging for it. It won't have to wait for long as Ricky aims that meat south and slides it home. He pile drives his dick deep into that tight ass as Dean begs him for more, telling him how hot he looks while fucking him. Ricky then gets him down on the couch and starts fucking him missionary. He slams inside deeper and deeper as he picks up the pace. He takes that ass deep and fucks harder sending Dean over the edge. He shoots his load all over his furry navel as Ricky continues to fuck. Ricky then pulls out and unloads his huge load all over Dean's face.",
  "models": [
    {
      "name": "Dean Monroe",
      "person_id": 28040
    },
    {
      "name": "Ricky Sinz",
      "person_id": 28041
    }
  ],
  "release_date": "2011-11-17",
  "scene_id": 54208,
  "series": "The Monroe Doctrine",
  "tags": [],
  "title": "The Monroe Doctrine, Scene #02"
}