{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brant Dickson is in the house and finally making his debut with us. Brant is 30 and originally from California and we're happy to have him. We've decided to pair him up with another California native, Connor Maguire. Connor is 20 and already a fan favorite on our sites. Today Connor will be a MenOver30 by injection. Keeping up with current events, we wondered with the recent passing of Steve Jobs, what Apple device they felt they liked most. They both agree on the iPad as the one device they like the most. iPads can be nice things to save up for so we wondered what else they were saving up for. Brant wants to open his own bar some day so he's putting away his pennies for that. Connor had been saving up but is now spending it on college courses. Connor is pursuing a degree in Physics. Who knew? We have a smart one. We then asked what kind of men they're attracted to. Brant likes big, burly men with big asses. Connor likes dining on both sides of the sexual table and finds he is mostly into femme bottom boys; but then really loves tall chicks that boss him around. Hmmmm. They start making out as they get better acquainted. Soon their shirts come off as Connor licks his way south along Brant's chest until he reaches a bulge in Brant's shorts. He rubs it for a bit before Brant hauls out his thick dick for him. He immediately takes it into his mouth as he starts to suck on that cock. Brant moans as he grabs Connor's head and starts bobbing it up and down on his aching dick. Connor sucks on his cock for a while before they go back to making out. As they do, Brant starts to grab Connor's cock that is tenting his shorts. Connor gets up and drops his shorts as Brant kneels before him. He slides Connor's thick cock down his throat. Connor gladly helps him out as he guides Brant's mouth up and down on hid rock hard cock. Brant can't get enough as he worships Connor's thick meat, lapping at his balls and making sure to please his new buddy. He then wants more as he bends Connor over and goes to work eating that hot ass of his. He laps at that tight hole before burying his tongue inside it. He shoves his face as deep as he can into that beefy ass tongue fucking that hot hole.Connor then returns the favor as he gets Brant's cock rock hard sucking his cock then eating his ass. Once Brant's ass is nice and wet, Connor sits back on the chair and has Brant sit on his thick dick. Brant grunts as his hot hole concedes. Once he gets that cock inside he starts to ride it as Connor sits back and enjoys. Brant grinds his hot ass up and down on Connor's meat then spins around from a reverse cowgirl to looking at Connor without ever coming off Connor's fat dick. ?Fuck my ass!? Brant groans as Connor slams his meat up into that ass. Brant then gets up and kneels between Connor's legs. He lifts them up and shoves his dick into Connor's tight hole. Connor grimaces as he does his best to accommodate his new intruder. Brant fucks that ass missionary. Giving it to him deep and hard as Connor strokes his aching meat. Time to flip again as Connor gets to fuck Brant missionary. He slams his dick in fast and hits Brant's sweet spot making him cum all over his furry navel. Connor isn't far behind as he pulls out and unloads all over one cum-soaked Brant.",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 28024
    },
    {
      "name": "Brant Dickson",
      "person_id": 28039
    }
  ],
  "release_date": "2011-11-10",
  "scene_id": 54206,
  "series": "Oh Mr. Brant",
  "tags": [],
  "title": "Oh Mr. Brant, Scene #02"
}