{
  "collections": [
    "Men Over 30"
  ],
  "description": "Halloween is here and, all tricks aside, we have a new treat on MenOver30 that goes by the name of Sean Banks. Sean is 23, a Florida native and a first timer from Gator Country. Well Gainesville is in the house and in good hands as veteran Troy Halston does the honors and shows Sean the ropes. In keeping with current affairs, we asked these studs if they had the ability to address both Houses of Congress to fix one thing, what it would be. On Sean's list, being that he is a student, it would be to get the financial aid mess situated. Allocating funds to ensure that college kids get a better education is important. Troy would ask that they stop fooling the people and just work together towards a common good. It seems it's politicians and the people they serve aren't always on the same side. To lighten the mood we asked them what their favorite cities were. Sean loves Cannes, Australia. Equidistant to the equator as places like San Francisco, Cannes boasts pleasant weather year round. Troy was born in West Virginia but grew up in Colorado so that's where he would most want to be when away from our sunny beaches. Well none of these studs are going anywhere; until we get a few things taken care of...Two party goers meet and end up going home together. Troy and Sean come in and sit down to get better acquainted. Now that they can hear each other away from the loud party, Troy tells Sean he sounds familiar. He takes off his mask and as he removes his buddy's he realizes it's his nephew, Sean. ?My brother's gonna be pissed', he scoffs '...Oh well? He goes in for a kiss as they make out. Sean is soon on his knees as he takes Troy's hard cock in his mouth. ?Swallow that cock? Troy groans as Sean shows him what he can do. Sean deep throats that dick with ease fucking his throat with it as he gets it nice and wet. Troy is impressed at Sean's skills as he fucks his face and revels in the sensation.  Troy isn't done checking out all the perks his nephew has to offer so he pulls his cock out and bends over so that he can get his ass rimmed. Sean obliges as he spreads Troy's ass and shoves his tongue inside. Troy moans as Sean starts to tongue fuck that ass making him squirm. They can't get enough of each other as Troy pulls him to his feet to get at his hard young meat. Troy feverishly returns the favor as Sean's thick cock disappears into his mouth. Sean is in awe as his Uncle shows him how it's done.Troy takes his time sucking Sean's cock getting between his legs to better service that dick. Once he's ready for more he gets up on his knees, holds Sean's legs up and shoves his dick inside. Sean's moaning with pleasure as he gets that smooth hole stretched wide open. Troy fucks that sweet ass pounding it deep as Sean just moans for more. Troy means business as he impales Sean over and over onto his meat. Troy then gets up and sits back so that Sean can sit on his dick. Sean straddles that meat and slowly sits back on it. Troy rams his dick up into Sean pulling him down onto his dick before they start to go at it again. ?Fuck my cock with your asshole!? Troy orders as Sean does his best to grind his hot ass onto Troy rock hard cock. Troy's shoving that dick in and out of that ass with ease as that tight as milks his meat. Troy then gets Sean on his back again so he can bring the fun home missionary style. He holds Sean's legs up and rams inside. He fucks that hot hole faster and deeper obviously on a mission. Sean doesn't mind at all as he jacks his throbbing cock faster as well. Sean can't hold back any more as Troy fucks the cum out of him. He explodes all over his chest with Troy seconds behind him. Troy pulls out and unloads his batch all over Sean's chest and abs as well.",
  "models": [
    {
      "name": "Sean Banks",
      "person_id": 28036
    },
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2011-10-27",
  "scene_id": 54202,
  "series": "On the Quiver Banks",
  "tags": [],
  "title": "On the Quiver Banks, Scene #02"
}