{
  "collections": [
    "Men Over 30"
  ],
  "description": "Is there a Doctor in the house? This week we welcome back Doc Rock who is looking leaner than usual. Well we're not about to complain and neither is this weeks new addition Cameron Kincade. Cameron is finally 30 and he's from Orlando, FL. We're happy to have him join the club. For those of you unfamiliar with Doc, he's married and originally from New Jersey.  We wondered when the last time these two were caught off guard. Doc was recently caught off guard sitting at a Johnny Rockets on Lincoln Rd, a local pedestrian mall, when a guy walked by wearing nothing but a necklace. Cameron had a similar experience only his involved two naked homeless people going at it behind a dumpster. Orlando is crazy like that. We then asked them where they wanted to retire to since they are already in Florida the Mecca of retirement. Doc wouldn't mind retiring here while Cameron would be ok here as well if not maybe Hawaii or Fiji. To wrap up we wondered who they've most jacked off to fantasizing about. Doc jacks off to many different situations and doesn't have a favorite. Cameron admits his neighbor across the street mows his lawn without a shirt on and that gets him off plenty. Doc is flexing for Cameron who is admiring his guns and ripped abs. Admiration turns to appreciation as Cameron starts to lick on Doc's pecs and nips. Doc starts to strip Cameron to see what he's packing. Cameron's shirt comes off as Doc starts to lick his smooth, lean frame. They start to make out as their hands explore the other. Cameron slips south as he pulls Doc's cock out of his briefs and goes to work on it. Doc moans his approval as he helps bob Cameron's head on his throbbing meat. Cameron is totally into Doc's defined body and he does his best to make that dick feel good as he kneels to work it some more. They stand as they continue to make out, rubbing their cocks together for a bit before Doc gets on his knees to return the favor. Doc starts to nurse on that meat as it grows in his mouth. Cameron loves the way Doc sucks that hard cock and Doc couldn't be happier to do it as he shoves that dick so deep it makes him gag on it.Cameron then bends Doc over and gets that ass wet as he shoves his tongue inside. He spreads that beefy ass wide as he tongue fucks him deep. Once that hole is nice and wet, Cameron stands and slides his hard cock inside. Doc's ass gives way as Cameron buries his dick all the way in. He starts fucking that ass doggy style as Doc moans in ecstasy. Cameron looks down and watches as his cock disappears into that muscular ass. He fucks him harder getting that ass used to his hard cock. Cameron then gets Doc in position so he can pile drive that ass. He gets in position as Doc holds his massive legs in the air and starts to bounce up and down into that tight hole. Cameron's never fucked ass in this position but loves how deep he's able to shove his cock. He bounces up and down into that hole faster and faster as Doc jacks his hard cock off. As they get closer, Cameron moves them over to the chair where he pounds Doc's ass missionary making him shoot all over himself. Cameron pulls out and blows his load all over Doc's cum soaked abs.",
  "models": [
    {
      "name": "Doc Rock",
      "person_id": 28014
    },
    {
      "name": "Cameron Kincade",
      "person_id": 28035
    }
  ],
  "release_date": "2011-10-20",
  "scene_id": 54200,
  "series": "What's UP Doc?",
  "tags": [],
  "title": "What's UP Doc?, Scene #02"
}