{
  "collections": [
    "Men Over 30"
  ],
  "description": "Bronson Gates is making his debut with us this week and we couldn't be happier to have finally landed this west coast hunk. Bronson is 'slightly' over 30 these days and originally from Los Angeles. Here today to show Bronson how the hot boys in the south do it is Reed Royce. Reed is 24 years old and from the very 'Heart of Dixie', historic Alabama. We asked these studs if they won $1K in a lottery what they would do with their winnings. Bronson would get a membership to MenOver30.com. (...shameless plug) then spend the rest on a ticket to Hawaii. Reed would go out and party with his Mom. We then got a bit more personal and asked what part of a man's body they most like to put their tongues on. Bronson loves to use his tongue on a hot ass. Reed's more of a chiseled chest man. I sense a bit of foreshadowing. We then flipped it around and asked where they most want a man to put his tongue on them. 'In my mouth', eagerly replies Bronson; only to be out done by 'In my ass!' by Reed who is now grinning ear to ear. These two are going to get along just swell. Reed finds beefy Bronson's jock and picks it up to get a closer look. He sniffs it and starts tugging on his crotch thinking about the hairy daddy it belongs to. Bronson comes out of the shower and finds Reed on his knees with a face full of jock strap. He startles Reed as he pulls the jock away and goes in for a kiss. Bronson drops his towel as Reed starts to play with the cock growing in his camouflage briefs. The underwear is short lived as Reed pulls them off to suck on Bronson's cock. Bronson moans as his cock gets the attention it needs. Reed gets more than a mouthful as Bronson stuffs his underwear into Reed's mouth teasing him a bit before sliding his cock back in it. Reed teases that dick and gets Bronson rock hard. Bronson then pulls Reed to his feet where they make out a bit before Bronson goes south to return the favor. Reed is naturally smooth and keeps everything hair free. Bronson gets to work on Reed's smooth balls and hard cock as he savors every inch of Reed's throbbing meat. He then turns Reed around and uses that hot tongue to get that hot ass wet. He slides his skilled tongue deep into Reed's hungry hole making him squirm with anticipation.Once that ass is prepped and begging for it, Bronson suits up and slides his cock inside. His cock sinks all the way inside as Reed braces for a hot fucking. Bronson holds on to that tight waist as he starts to pound away. He grunts and groans, slapping that ass as he fucks Reed's hot ass. Reed is taking that dick doggy style and loving it. Reed arches his back making that ass easier to stuff as Bronson plows on. Bronson then gets Reed on his back; spreads those smooth thighs wide and slides his thick dick back inside. Reed plays with Bronson's hairy chest as he watches him take his hole. Bronson holds Reed's ankles like handle bars as he slams in and out of that hot ass. Bronson then moves the party south as he lies on the floor. Reed straddles his cock and lowers himself on it. He impales himself on that dick and starts to ride it. He bounces on Bronson's cock like a pogo star as Bronson enjoys the view. Bronson's thick cock is hitting Reed in all the right spots as it sends him over the edge. He explodes, sending his load all over Bronson's hairy chest and abs. Bronson cums next jacking his aching cock all over his hairy cock and cum-covered abs.",
  "models": [
    {
      "name": "Bronson Gates",
      "person_id": 28037
    },
    {
      "name": "Reed Royce",
      "person_id": 28038
    }
  ],
  "release_date": "2011-11-03",
  "scene_id": 54204,
  "series": "The Athletic Supporter",
  "tags": [],
  "title": "The Athletic Supporter, Scene #02"
}