{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have two hotties here this week as we welcome Joe Parker to MenOver30. Joe is 31 years young and from the City of Brotherly Love Chilly Philly. Joe is not alone he's with Dean Slater. Dean is 26 and originally from the Lone Star state of Texas. Dean is new and improved and now safe on fabric. We asked these two if they could play a game of 20 Questions with anyone who they would choose. Margaret Cho is Joe's choice and Dean would pick Bob Barker from the Price is Right. Having just survived another holiday season where giving and receiving abound, we wondered what the best gift each of them has ever given someone else. Joe bought his Mom a new dining room set and it made her cry. Awww. For Dean the best gift he ever gave someone was divorce papers. ...ouch. To wrap things up we asked them to fill in the blank. 'My dick gets rock hard when I'm _____.' For Dean it's looking at a nice ass that makes his dick hard and for Joe it's as simple as sucking on a rock hard cock. Well, who doesn't?  Well, nice ass and hard cock's are both in the house so let's get this party started...Dean and Joe are kicking back on the couch as they both tug on their boners. They get curious about what each other's packing as they start tugging on each other's crotches. Dean feels its getting hot and they should give their junk some air. Joe hauls out his thick cock as Dean goes down on him. Joe moans as he gets that dick serviced by Dean who shoves it down his throat as deep as he can get it. Dean takes his time worshipping Joe's meat as he runs his tongue along his shaft and smooth balls. Joe then pulls off Dean's tank top as they start to make out. Joe's grabbing at the tent in Dean's jeans before undoing them to get some uncut dick of his own. Dean's been hittin' the gym and it's paying off. His bod is ripped and Joe doesn't mind the view one bit as he kneels between those thick muscular thighs and goes for that dick. Dean gasps as Joe works his swollen cock to the hilt. He sucks on his huge nut sack teasing Dean before swallowing that cock back down his throat. He gets on his knees and lets Dean fuck his face of his. Dean moans loving the attention he's getting on his thick cock. Soon Dean needs more than his cock taken care of as he straddles Joe's thick cock and sits down on it. He grunts as his hot little ass starts to give way. Joe starts to slowly shove his thick meat up into Dean's tight ass as he moans and begs for more. Dean is rock hard and slowly getting used to that fat dick as he starts to ride it. 'How's that feel, huh?' Dean groans as he slowly grinds that ass on Joe's cock. Joe can only moan in appreciation as that tight ass grabs hold of his thick dick. Joe then tries to make things easier and gets Dean on his back. He lifts those legs and slides his large cock back inside Dean's ass. Dean is quivering as he gets that ass stretched. Joe starts fucking him deeper and harder getting that ass used to his meat. Dean is begging for it soon enough as he orders Joe to fuck his ass. Joe gets on his back as Dean sits on his dick again and holds still as Joe slams that dick home. Joe then leans Dean back on the floor as they now end up in missionary yet again. Joe fucks that tight ass until he can't hold off any longer. He pulls out and unloads his thick cargo all over Dean's smooth abs. Dean's right behind him as he busts his nut all over his own already cum-drenched abs.",
  "models": [
    {
      "name": "Joe Parker",
      "person_id": 28044
    },
    {
      "name": "Dean Slater",
      "person_id": 28045
    }
  ],
  "release_date": "2011-12-29",
  "scene_id": 54219,
  "tags": [],
  "title": "Slater Tots, Scene #01"
}