{
  "collections": [
    "Men Over 30"
  ],
  "description": "After making quite the impression on ExtraBigDicks, Prague's wonder boy, Lucas Knowles will make his much anticipated debut this week here on MenOver30.com. Lucas is 32 and now calls Los Angeles home. His hair is a bit longer and he's rockin a sexy beard that's workin' rather nicely. Helping us welcome him is a 22 year old hottie from Long Boat Key, FL, Ridge Michaels. Ridge is in for a treat today as Lucas who fucked hung Mason Coxx last he was here agreed to take one for the team. We asked these two studs with the end of the year approaching if there was anything they wanted to do before years end. Ridge would love to sky dive while Lucas would just love to clean his room. Lucas admits to being more versatile in his personal life as opposed to mostly being a top on film. Ridge is mostly bottom on and off cam. We then asked them to describe the perfect cocks in their opinion. The grass is always greener as Lucas, who has a thick, uncut cock likes his meat cut with large protruding veins. He guesses it's from all the cut guys he fooled around with growing up. Ridge as well loves the opposite of what he has and is totally into foreskin and the smooth feel of it. Well, today we have something for everyone. Lucas and Ridge are on the couch as they get to know each other tongues first. As they make out Lucas' thick uncut cock gets rock hard and just out of his soft sweats. Those flimsy shorts can't contain his 'excitement' ...you know. They stand and continue to make out as their clothes start to come off. Lucas heads south to check out all Ridge has to offer and gets busy. He opens wide and takes Ridge's dick in his mouth. Ridge moans as he watches Lucas go to town on his throbbing cock. 'Take it all the way in your mouth' Ridge coos as he shoves his dick deep. Lucas strokes his own swollen cock as he gets that hot face fucked. Ridge grabs hold of Lucas' head and jack hammers his cock down his throat as Lucas takes it deep. Ridge then gets Lucas on the couch so that he can have some alone time with that foreskin he's been dreaming of. He savors every inch as he teases Lucas' uncut shaft. Lucas lies back and watches his dick disappear down Ridge's throat. Lucas then stands up to give Ridge better access. Ridge sucks that dick some more before getting Lucas on all four on the couch to get at that sweet ass of his. Now it's Lucas that's moaning as his ass gets a tongue full from Ridge.Lucas arches his back getting that sweet ass up in the air to give Ridge all the access he needs. Ridge is rock hard and wants in. He grabs Lucas' legs and holds them up as he slides his cock inside. 'Show me what you got' Lucas order 'Fuck me harder and don't stop!' Ridge starts to slam his cock deep into Lucas' hungry hole as Lucas orders him to fuck him harder and faster. Ridge then stands Lucas up; turns him around before bending him over for more. Lucas bends over and waits for more. He gets that ass stuffed again as he starts to beg for more. Ridge does his best to pound that hole as Lucas orders him to give it to him harder and deeper. Lucas bucks his ass back onto Ridge's cock getting it as deep as he wants while Ridge holds on tight. Ridge's balls slap away at that hot ass as Lucas starts to jack his own cock off. Ridge then pulls out and lays on the couch so that Lucas can bounce on his cock and get it all the way inside. Lucas impales himself on it and using his body weight takes every inch of it inside. It hits his prostate every time he bounces on it and soon his uncut cock is oozing strand after thick strand of hot cum as they pool on Ridge's abs. Ridge then jacks his own cock all over himself adding to the creamy glaze.",
  "models": [
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    },
    {
      "name": "Lucas Knowles",
      "person_id": 27994
    }
  ],
  "release_date": "2011-12-08",
  "scene_id": 54213,
  "tags": [],
  "title": "Beyond Say Knowles, Scene #01"
}