{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week Troy Halston is helping us welcome a new member to the MenOver30-by-injection Club, Mr. Micah Andrews. Micah is 23 and originally from Denver, CO. Troy knows a little about Denver himself, since that is his home town. With all the occupy movements going on and so many people unhappy with the ways things are being run, we asked these studs what upsets them these days. Troy is upset that everything is moving toward world domination and the truth behind all of these protests is so real. Micah gets angry with liars and stealers. We then switched it around and asked them what makes them happy. For Micah, he likes to fight competitively so he loves to train. Troy likes even the simplest things in life like a smile from one of his daughters. We then brought the focus back to the hot and present asking them what they feel their one sexual act they are best at. Micah thinks he is a pretty amazing bottom so he'd go with that. Troy tries to be good at all of it so he would answer with that. Humility is in the air this week. lol Well lets let these two get at it and let them figure out who's good at what (while we watch...)Micah shows up at Troy's soaking wet and gets the third degree from his boss. Troy in incensed about how irresponsible he could be going out in the rain like that. Micah tells him to stop acting like his dad already and that sets Troy off. He grabs Micah and pulls his shirt off telling him he knows he's always looking at his cock in the office and maybe it was about time he gets a closer look. He shoves Micah's face into his crotch before undoing his jeans and giving him a taste of the real thing. Micah doesn't struggle as he gets his face fucked. Micah's mouth is soon stuffed full of cock as he sucks it deep. Troy then drops to his knees to see if Micah has anything to offer. He takes out Micah's cock and starts to return the favor.  He laps and sucks on Micah's smooth balls before shoving his dick so deep he makes himself gag on it. Micah then bends over as Troy starts to play with his hot ass fingering it as he gets Micah even hornier. Once Troy's done playing with that hot ass he sits back and gets Micah's mouth back on his dick. He fucks Micah's mouth as he bobs his head up and down on his cock. Micah's tongue then moves south as he starts to eat Troy's ass. Troy's cock gets rock hard and that mouth just isn't enough...Troy gets Micah on his knees and pushes him down until his ass is up and begging for it. He aims his cock south and slides inside. Micah moans as Troy takes that ass deep. He pile drives deep as Micah struggles to accommodate Troy's hard cock. Troy pounds that ass and gets tired of looking at the back of Micah's head so he turns him over on his back. He flips Micah's legs up and goes right back to pile driving his dick. He can now watch Micah's face as he begs him for more dick. Micah was right about having a hot ass that could more than take a pounding. Troy then gets up and sits on the chair and watches as Micah lowers himself back onto that meat. He sits on Troy in a reverse cowgirl and takes that dick to the hilt. He rides that meat like a seasoned jockey driving Troy wild. Troy isn't one to just sit back so he too starts to slam his hard cock up into Micah's hungry ass. That does the trick as Micah's cock explodes. He busts his thick load all over his smooth chest and navel. Troy then stands and jacks his cock off all over Micah's face coating it with his thick seed.",
  "models": [
    {
      "name": "Micah Andrews",
      "person_id": 28042
    },
    {
      "name": "Troy Halston",
      "person_id": 27796
    }
  ],
  "release_date": "2011-11-24",
  "scene_id": 54210,
  "series": "Rain Men",
  "tags": [],
  "title": "Rain Men"
}