{
  "collections": [
    "Men Over 30"
  ],
  "description": "Bells are ringing this week as we help celebrate a special occasion. Alexander Garrett, a MenOver30 favorite and Mike Rivers, his real life boyfriend, are here this week sharing their 7 month anniversary. That's like 2 reincarnations with the same mate in heterosexual terms. For those of you who aren't familiar with them, Mike Rivers is 27 and originally from Jersey. Alexander is 36, a Colombian import and looking even hotter than ever with that scruff on. These two crazies met through their mutual agent who put them to work a booth together at the Erotica Convention in Orlando. Little did they know that sparks would be flying. Their first official date was back down in South Florida having a romantic night on Las Olas Boulevard, a strip of restaurants, cafes and high end boutiques located in the heart of Ft. Lauderdale. When it comes to having your significant other working in the industry we wondered if jealousy was ever a problem. Mike answered 'Yes' immediately admitting that sometimes it has come up. Alexander grins and chimes in with '...sometimes'. Mmmhmm. Depending on who the other is paired up with has at times caused friction; but with the proper communication everything works out. Mike is kicking back with sore feet as Alexander begins to give him a foot massage. Mike is getting turned on as Alexander decides those toes are too delicious to pass up. He starts to lick and suck on them making Mike's cock stir. Alexander kisses his way up to his boyfriend's face as they start to make out. Mike pulls Alexander's tee off and goes to work on his chiseled frame. He licks his nips and pits as he gropes that cock he wants. He lowers Alexander's shorts as he sets that uncut Colombian cock free. Alexander moans as Mike wraps his mouth around it. Alexander slowly starts to fuck that face as he holds Mike by a fistful of hair. Mike gets on his back as he nurses on that meat from below unable to get enough. Mike's cock is now rock hard and Alexander knows just what it needs. He leans forward and starts sucking on Mike's dick landing them in a steamy 69. They each have as much cock as they want as they suck and savor to their heart's content. Alexander then flips Mike up and over so that he can get at that ass he will soon fuck. He shoves his tongue inside and along with a few fingers gets Mike hungry for more.He teases his beau's ass as he gets a fat dildo, lubes it up and shoves it in. His tight ass gives way as that dildo disappears inside. Mike loves that toy stretching his ass open and knows it will soon be replaced by the real thing. After teasing that ass a bit, Alexander gets that ass primed and in need. He then suits up and gets behind that ass and replaces that big toy with his real one. 'Gimme the real thing' Mike coos begging for that dick. Alexander fucks him doggy style as Mike eggs him on. 'Ugh, This is the best anniversary gift ever' he groans as he begs Alexander to give it to him. Alexander fucks that ass deep, pulling out almost entirely before slamming it back in for more. He then gets Mike on the floor and hoists his legs up over his own head so he can pile drive that dick in for more. Alexander pistons his thick dick in and out of that hot ass as Mike just watches him fuck and strokes his own dick. Alexander picks up the pace and soon he gets that familiar tingle in his smooth balls. He pulls out and unloads all over Mike's face and neck. Mike cums seconds later as Alexander is still bathing his neck and face with his massive creamy load. Mike may have thought that that fuck was the best anniversary present ever?but that was way before he got his very own pearl necklace!",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Mike Rivers",
      "person_id": 28012
    }
  ],
  "release_date": "2011-12-01",
  "scene_id": 54211,
  "series": "Rivers Edge",
  "tags": [],
  "title": "Rivers Edge, Scene #01"
}