{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have two Titans of the adult industry coming together to steam up our camera lenses. Ricky Sinz and Doug Jeffries are here and have been looking forward to working with each other for a while now. Ricky is 31 now and originally from Chicago. Doug will be 46 this January and proudly calls Brooklyn home. We asked these two studs when the last time they felt proud of something they accomplished was. For Ricky he says everyday. 'Doing the right thing always makes you feel good' For Doug it was a couple weeks ago when he was helping out some kids that were homeless and giving them heart to heart advice on how to stay sober and out of trouble. We then asked them to think back and tell us what the best gift they'd ever received. Doug was thankful that when his father passed away, a couple years ago, he left the house he grew up in to him. That really meant a lot to him. For Ricky he doesn't really get a lot of gifts and even when it comes to giving them it's just not his thing to give material things. 'You have material things and then you have friendship' Ricky admits 'and I think 'friendship' is much more important.' We couldn't agree more, Amigo...Ricky and Doug are catching up on the couch talkin shop and industry awards each has won when Ricky confesses to Doug that he's wanted to work with him for years so he's really happy to be here. Doug calls him over as they start to make out. Doug slips to his knees and explores Ricky's hard cock tenting his shorts. Doug then turns him around and slides off Ricky's shorts to get a closer look at that ass. He spreads those cheeks wide before going in for more tongue first. Ricky moans as Doug slaps that ass as he shoves his tongue inside. Doug flicks his hot tongue on that hungry hole driving Ricky mad. Ricky then stands up and gives Doug something else to work on?his cock. Doug wraps his lips around it and takes it all the way down his throat. Doug worships that dick getting his face all up in Ricky's crotch. Then Ricky goes south to return the favor as he gags on Doug's fat dick. He works that meat with his hand and mouth wanting to please Doug. Doug has other things in mind as he gets on his back and has Ricky feed him more of that dick. Ricky squats and delivers all the meat Doug can suck on getting Doug horny for more than just oral.Doug then gets up and bends Ricky over and slides his cock in from behind. His smooth balls are soon bouncing against that hole as Ricky gives it up. Ricky is rock hard and can't help but jack his meat as Doug pounds him and talks dirty while he does. Doug impales his cock all the way in making Ricky grunt and groan. Doug slows it down a bit before he picks up the pace again bouncing Ricky back onto his dick. 'Does my dick feel good?' Doug groans as he fucks Ricky harder. 'Awww yeah' Ricky moans 'fuck me, Daddy!' He can't get enough as Doug switches it up and has Ricky ride his cock. Ricky sits on him in a reverse cowgirl as we watch his ass swallow every inch of Doug's thick cock. He bounces up and down on that dick fucking himself silly. Doug just sits back and watches as he gets his cock worked. Missionary is next as Doug gets Ricky on his back. He slides back into that hot ass and fucks Ricky steadily as he strokes his meat. It isn't long before they're both ready to blow and as Ricky jacks his load off all over his inked abs, Doug stands over him and delivers his batch as well sending his thick cargo splattering all over Ricky's chest and abs.",
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 27928
    },
    {
      "name": "Ricky Sinz",
      "person_id": 28041
    }
  ],
  "release_date": "2011-12-22",
  "scene_id": 54217,
  "tags": [],
  "title": "Sinz of the Flesh, Scene #01"
}