{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we welcome back Mr.Brock Russell. It's been a while since we've seen this sexy, 38 yr old from Provincetown, MA. Fortunately he's in for a treat since we've paired him up with some cajun spice that's oh so nice, New Orlean's own, Ari Gyspy. Ari is 32 and looking better than ever. We asked these boys what was the highlight of 2011 for them. Having a hot three way with an  English couple that was visiting P-Town was definitely Brock's favorite. For Ari, 2011 was the first year he ever tried anal and admits it's been crazy! LOL Both have great bodies so we wondered what their weakness is when it comes to cheating on their diets. Brock loves sweets of all kinds while Ari loves food in general. Ari is relatively new to the man to man table and admits everyone should try it at least a couple times to see whether they like it or not. Don't knock it 'til you've tried it. Brock couldn't agree more and admits he tried fooling around with a girl at one point but it didn't go as well as expected. Well, fortunately these two are going to be just fine once we leave them to their own devices...  Shall we?Brock is kickin' back after a long drive to Miami and catching up with a friend on the phone when Ari walks in. 'You must be Brock' Ari smiles, 'I'm the welcome wagon.' Music to Brock's ears since he could use help releasing some tension. They start to make out as their hands start to roam. Brock undoes Ari's pants as he goes in to check out what's on the menu. Ari stands up to give him better access as Brock starts to suck on his cock. Brock slurps on that hard cock as he takes it all the way down his throat. Brock's hot mouth is working magic on Ari's meat. Ari then wants to sample what Brock has to offer as he heads south to do the same. He gets on his knees and goes for it. He slides Brock's cock into his mouth and looks up to make sure he's doing everything the way Brock likes it. Ari opens wide and slowly shoves Brock's thick meat as far as he can without making him gag. Brock just moans as he looks south and watches Ari do his thing. Ari knows exactly what to do as he deep throats Brock's cock taking every inch of it.  Ari's cock is rock hard and he knows his hand isn't where it needs to be. He checks out Brock's smooth ass for a few before suiting up and going for it.Ari slides his cock deep as Brock grunts trying his best to accommodate the intrusion. Ari loves that tight ass around his dick and fucks him even harder. Brock is soon bucking back onto that meat wanting every inch of it. Ari slaps that ass a bit only to be told if he's going to slap that ass he better slap-that-ass. Brock loves that dick up inside him and he can't stop begging for more bayou bone. Ari then sits back as Brock straddles him and starts to ride him in a reverse cowgirl. He bounces on that dick as Ari sits back and watches as his aching dick disappears up into Brock's hot hole. Ari then gets Brock on his back on the couch before getting between his muscular legs. He shoves his dick back inside and gives him all he's got. He nails that ass deep and hard and as he fucks Brock missionary they both get closer and closer to climax. Brock can't hold it back any longer as he unloads his huge load all over himself. Ari is right behind him as he pulls outs and jacks his massive pent up load, soaking Brock's cum drenched abs and chest over and over until he's spent. ",
  "models": [
    {
      "name": "Ari Gypsy",
      "person_id": 28025
    },
    {
      "name": "Brock Russell",
      "person_id": 27911
    }
  ],
  "release_date": "2011-12-15",
  "scene_id": 54215,
  "series": "Brock and Roll",
  "tags": [],
  "title": "Brock and Roll"
}