{
  "collections": [
    "Men Over 30"
  ],
  "description": "Marxel Rios is back in the house after leaving quite an impression on our members. Marxel made his debut right here and is now an honorary MenOver30... by injection. Marxel is a local flavor from Fort Lauderdale, FL and is 26 years old. Today he's in for a real treat as we welcome a well known Windy City native by the name of Ricky Sinz. Ricky is definitely a hot man over 30 and this hunky, inked Chicagoan has made quite the name for himself in the industry. Wanting to get to know these two cultured souls better we asked what the last major museum each attended. Marxel's most recent museum venture was visiting Madame Tussaud's Wax Museum in Washington. Ricky is an avid art collector and his most recent delve was into the whimsical and colorful realm of Fabio Napoleoni where he was able to pick up a piece at an artist signing to add to his collection. Speaking of collections of art, both of these studs have their own inked onto their bodies. We asked them of all their ink which means the most to them. For Marxel it would be a tattoo on his left bicep that's dedicated to his late Grandmother who lost her battle with cancer; while for Ricky it would be the cross on his right arm. It was his very first tattoo at 16 and he 'promised' his mother he wouldn't do it again. Boys will be boys... Marxel's phone goes off and as he goes to answer it, Ricky beats him to it. Marxel begs him to give him back his phone while Ricky teases him about who could be calling him. Ricky wrestles him to the ground and sits o his chest and starts to go through Marxel's pics and teases him more about the cock pics he has on it. Ricky decides he'll give Marxel something but it won't be his phone. He takes out his cock and slides it into Marxel's mouth as Marxel starts to suck his dick. Ricky slaps his cock on Marxel's tongue for a bit before feeding him some more. Ricky then stands and loses his jeans and gets right back in that hot mouth as he assumes a push up position over Marxel's face and starts to fuck his throat. He can't get enough as he buries that meat and soon flips around and puts that ass of his in Marxel's face. Marxel gets to work eating that ass as Ricky takes out Marxel's thick cock and returns the favor. Ricky takes it as deep as he can and makes himself gag on Marxel's thick meat. Ricky then stands and gets up against the wall so that Marxel can eat that ass some more. Marxel's mouth is at his service as Ricky gets right back to fucking his throat some more. Ricky then hauls Marxel to his feet and bends him over as he takes that ass. He slides his thick meat inside as Marxel struggles to accommodate his hard dick. Ricky pounds that ass deep and hard as he grabs hold of Marxel and impales every inch of his cock into him. Ricky teases that hole by slamming it deep inside and taking it out making Marxel wince with every thrust. Ricky knows just how to make Marxel crazy for his dick and its working. Ricky's balls go back to slapping that ass as he fucks him doggy style. Ricky then gets Marxel on his hands and knees for more fucking. He gets behind that hot hole again and pushes Marxel's lower back down making that smooth ass arch up for his dick. 'Where you going?' he teases as Marxel tries to move forward as he gets that ass stretched open. Ricky is relentless as he takes that hole harder. He pushes Marxel onto his stomach and just starts to pile drive this cock deeper into Marxel's tight ass. His cock disappears into that ass over and over and it sends them both over the edge. Ricky pulls out and watches as Marxel blows his load all over himself. Ricky then gets Marxel to sit up so he can blow his load all over Marxel's face.",
  "models": [
    {
      "name": "Ricky Sinz",
      "person_id": 28041
    },
    {
      "name": "Marxel Rios",
      "person_id": 28050
    }
  ],
  "release_date": "2012-04-05",
  "scene_id": 54226,
  "tags": [],
  "title": "Sinz City, Scene #02"
}