{
  "collections": [
    "Men Over 30"
  ],
  "description": "David Chase is here to help us kick off 2012 right. David also brought along a familiar face to help do just that, Chris Stevens. David is now 31 and originally from Jacksonville, FL. 'Born in Jacksonville; grew up in Jacksonville; ain't ever gonna get outta that place!' David groans with a grin. Chris is 42 and originally from West Virginia but grew up in Ohio. It being the New Year and the spirit of giving abounds, we wondered what charity they firmly believe in all year round. For Chris it would be the ASPCA. He has two young girls and anything that keeps pets safe he's all for. David who has a few rug rats of his own is for any charity that protects children and their innocence. They are both looking great these days but we wondered what their weakness is when it came time to cheatin' on their diets. It's Breyers ice cream for David. He loves their plain chocolate and can eat it all day long. Chris' weakness is Reese's Peanut butter cups with anything Ben & Jerry's coming in a close second. Hmmm. Well today, hold the ice cream because these two will have all the temptation they need right here. Sorry Elsie Borden, No cream needed today. Soon we'll be swimming in plenty of our own. David comes home lookin for his wife but finds Chris instead baby sitting his kids until she gets off of work. They start catching up on stuff when David starts to bitch about how his wife won't put out anymore. He starts grabbing his cock through his shorts which is all the invitation Chris needs. He gets on his knees and gets to work as he pulls off David's tee and runs his tongue all the way from David's mouth down to his growing cock. Brother in law of the year goes to Chris who is more than happy to perform her spousal duties as he devours David's cock. David groans as he watches Chris eagerly nurse on his meat. 'She better not know about this' Chris grins as he slaps David's thick cock on his tongue. David then stands Chris up and gives him plenty of leverage as he gets Chris' cock in his face and down his throat. David is hungrier than expected as he goes nuts on that hard dick. Family that stays together... David then bends Chris over on the couch and gets to work eating that ass. Chris arches his back wanting to give David all access as David shoves his face deep into that ass sending his tongue deep inside.Chris then straddles that dick and sits on it in a reverse cowgirl. He wastes little time before he starts to ride it like a seasoned jockey. His dick is rock hard as he fucks himself with David's. At the rate these two are going at it, Chris needs to baby sit more often. David bounces Chris' hot ass on his dick harder as Chris welcomes every thrust. Chris then twirls around and rides that dick looking at David. He watches the look on David's face as he continues to get that ass stretched open. David then changes up the pace and they lay back on the couch. David lies behind Chris and slides that meat back inside. He starts to fuck him slowly giving that ass of his a much needed break...but that doesn't last long. He's back to slamming that dick deep inside as he gets hornier and harder. Next he gets Chris on his back, flips his legs up over his head and pile drives his dick deep into that hole. He does squats into that ass as he jacks Chris's dick off. He fucks him deep and jacks that cock in time making him cum as he aims it at Chris' own mouth. David then pulls out and kneels over Chris' face and adds even more cream all over Chris' mouth and cum-covered face. Cream, it does a body gooooood.",
  "models": [
    {
      "name": "Chris Stevens",
      "person_id": 27908
    },
    {
      "name": "David Chase",
      "person_id": 27963
    }
  ],
  "release_date": "2012-01-05",
  "scene_id": 54222,
  "series": "Family Splatters",
  "tags": [],
  "title": "Family Splatters, Scene #02"
}