{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back with us this week, by popular request, is Scott Alexander. Scott made quite the impression with fans, old and new alike, when he originally indulged our brother site, ExtraBigDicks.com with their first 'unplugged' session and gave us a better idea of just what makes him tick. Alongside Scott is another hottie we brought back because he can take a fucking better than anyone we know, Mr. Krist Cummings. Krist at 5'4 is about as polar an opposite as you can get to Scott Alexander who stands 6'3. Scott is 37 and originally from Texas. When we asked what kind of guys float his boat he turns to Krist as he says, 'Guys like these, he's so cute'. Hmmm. Oddly Scott and Krist both like the same things; so we're not sure how accurate that is. lol Krist is an unapologetic size queen and who could blame him? Scott likes hairy guys and admits the only times he's bottomed it's been for guys taller than himself. 'I've tried smaller guys; but it just feels awkward.' Well, fortunately Scott, a true 'P.C.' gent, is gonna be laying all the pipe adorable Krist can handle this afternoon which is an awful lot, so 'Houston,-we will not have a problem!'These two waste little time before getting better 'acquainted'. They begin kissing and feeling each other up.  Quicker than a Hog Tie, Scott has little Krist on his back with his legs in the air as he strips his pants off him. Scott's large frame towers over his prize as he begins to lick and suck on Krist's cock and smooth balls. Krist's frame is naturally hairless and defined. Scott lets him up as he stands, giving Krist access to his pants which he quickly undoes. He pulls down his jeans and as they fall to the floor, Scott's beefy ass comes into view. DAMN!. This Baby's got back-and then some! Scott's large bubble butt is followed by rock solid thighs and calves as your eye follows the line of sight south. Krist's eyes slowly gaze back along the wall of Alexander that will be his and his alone to climb and conquer. <Queue the theme music> As he pulls down Scott's bulging briefs, his rock hard cock springs to view. Krist knows exactly what to do as he goes right to work. He bobs his head up and down on Scott's thick black cock trying to get as much of that thick dick in his mouth as he can.  After a few minutes of that, Scott pushes him back onto the couch where he can get some more of Krist's cock and smooth ass to taste. Krist then goes back to work on 'THE' main attraction. You know, Scott's monster cock! (...duh)Krist can't get enough of Scott's Chocolate choker as he chokes as much down over and over while slapping his face and tongue with it before going back in for more. Scott loves the attention on his meat and soon he's gonna need to bury it deeper than just the back of Krist's throat. Krist is making love to that thick uncut meat; and it's about time we switched that around. Krist is laid over the arm rest as Scott begins to take his ass. Krist braces as Scott's 8.5' meat is put deep. The look on Krist's face coupled with his grunts and groans says it all as he winces with every inch he's taking. Scott's cock means business and in no time he's pounding away at his smooth, stretching hole. Scott holds his legs up and is fucking him as deep as Krist's hot ass will let him. 'Aww, Fuck my ass' Krist begs as he gets that rock hard cock impaled. All Krist can do is moan as Scott's cock rises and falls ball deep until our little trooper is whimpering. Scott only pounds him harder. We love a man with a 'tough love' approach for his boy. Scott's heavy balls are slapping Krist's smooth ass until Scott changes it up and sits Krist down on his dick bouncing him up and down on his meat for more. Krist takes every thrust like a champ and after a hard ride they switch to missionary where Scott has all the access he wants. This is ultimately the one that does them in as Scott fucks the cum out of little Krist and then explodes his own jizz all over his conquest.",
  "models": [
    {
      "name": "Krist Cummings",
      "person_id": 30770
    },
    {
      "name": "Scott Alexander",
      "person_id": 28046
    }
  ],
  "release_date": "2012-01-12",
  "scene_id": 54223,
  "series": "My Chocolate Pop",
  "tags": [],
  "title": "My Chocolate Pop"
}