{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brock Russell is back and here to help us welcome a new member by the name of Cameron Kincade. Cameron is a recent addition to the MenOver30 crew having recently turned 30 and is originally from New Jersey. Brock is now 38 and he's from Provincetown. We asked these two if they could recommend a book for a friend taking a long flight. Brock would recommend a book by Clive Cussler or James Lee Burke. For Cameron he would recommend Less than Zero by Bret Easton Ellis because it epitomizes the lifestyle he tries to lead yet knows it may not be the best to strive for. We then changed it up and asked if they were on the long flight who they would want to sit next to. Brock would want to sit next to his real life boyfriend, Mr. Johnson, whom I'm sure would make that flight breeze by. Cameron wishes he could meet a mysterious stranger on that flight that would turn out to be 'the one'. However he hasn't as of yet so he'd willing to settle for Oprah because she seems pretty cool. Well neither of these boys care to be Mile High Members so were gonna keep the fucking right here in our studios. All systems GO; it looks like we're ready and cleared to film. So, buckle up, boys...Cameron is on his laptop when Brock comes in and introduces himself as his new neighbor. They chit chat a bit before Cameron asks him if he's living alone or has a Mrs. Russell. Brock assures him he lives alone because he liked sucking dick better than his x-fiancee. Cameron tells Brock that he's single as well because he hasn't found anyone that can suck good dick.  Brock's suddenly happy he stopped by as he goes in for a kiss. Brock's tongue explores Cameron's smooth chest on his way south as Cam stands to give him full access to that growing dick of his. Brock hauls it out and gets his lips around it as he starts to service his new neighbor. He swallows that dick to the hilt as he runs his tongue along the shaft and smooth balls. Cameron then pulls Brock to his feet so he can make out some more then head south to return the favor. Brock's cock is rock hard by the time Cameron wraps his lips around it. Brock fucks that sexy face as his balls slap away at Cameron's chin. They take turns going back and forth on each other's cocks til Cameron's tongue finds a new target-Brock's ass. Cameron eats that ass out deep getting Brock's cock hard as a rock and ready for more.Brock lies on the floor as Cameron sits on his hard cock. It takes a few seconds to get that cock inside; but once it feels right Cameron starts to ride it. He leans back and braces himself on the floor as he starts to bounce that hole on Brock's hard cock. He fucks himself deep as Brock lays back and enjoys. Brock then sits up and helps bounce Cameron on his meat before pulling out and getting on his back to give Cameron some ass of his own. Cameron suits up and slides his hard cock deep into Brock's bubble but as he starts to fuck that ass missionary. They make out as Cameron slows it down a notch fucking that hole nice and slow. Cameron then gets Brock on his knees and pushes him over the chair and goes at that ass doggy style. He holds Brock by the waist and rails into his hole deeper and harder as Brock takes that dick like a champ. Cameron pulls out and shoots his load all over Brock's smooth ass. Brock starts to beat his hard cock off as Cameron gets on the floor wanting a front row seat to the cream works. Cameron rubs his face all over Brock's knob as Brock unloads his thick nut all over Cameron's face. Apparently this welcome package came with a piping hot facial. Ooooh, Gooody!",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "Cameron Kincade",
      "person_id": 28035
    }
  ],
  "release_date": "2012-01-26",
  "scene_id": 54229,
  "series": "Wel-Cum Wagon",
  "tags": [],
  "title": "Wel-Cum Wagon, Scene #01"
}