{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a special treat as we pair up sexy Ari Gypsy with Brenn Wyson. Brenn is now 40 and originally from just outside of Boston, MA and looking better than anyone has a right to. Ari is 32 and he's originally from New Orleans, LA. We wondered where was the weirdest place these two ever fell asleep. Brenn admits he fell asleep a lot in class and Ari has been known to fall asleep in the back room when he's waiting for his dance sets at clubs. Both of them love to be watched and in this industry being an exhibitionist is a very good thing. Even off set and at the gym they've been known to give a good show when they realize they're being checked out in the locker room. We then asked these two what is their favorite piece of clothing they own.  Both agree that their jeans would definitely be their favorite. Ari actually has more jeans than shirts. As for their sexiest thing in their wardrobe Brenn has whips he finds sexy and Ari loves his toys. We then asked what their oddest climax story was. Brenn takes the cake with 'sounding' where a rod is inserted into your penis over and over and it makes you cum. We'll take his word on that one. Let's just watch these two get off the old fashioned way. Shall we...Ari is beating off to porn on his phone when Brenn walks in and joins him. Brenn undoes his pants and hauls out his fat cock that gets rock hard in seconds as they both stroke to the video. Ari can't help but notice Brenn's fat dick and it peaks his curiosity. He shuts off the phone and gets on his knees to get some of that dick. He spits on that head and gets to work on Brenn's meat. Brenn moans as Ari takes his dick deep. Brenn holds Ari's head as he bobs it up and down on his throbbing cock as he goes back to watching porn on Ari's phone. Brenn needs more from Ari as he shoves his meat deeper into his throat. Brenn then stands to give Ari better access as he slowly fucks his face. Ari strokes his cock as he works the knob with his mouth. Brenn then gets Ari on the couch to give him a little of the same as he goes down on his cock. Brenn jacks that dick for Ari as he takes it all the way down his throat. Ari just lays back and watches as his dick disappears into Brenn's eager mouth as he sucks and slurps on his rod. Ari's ass is next on the menu as Brenn starts to eat that ass out making Ari moan like a bitch. That gets Ari rock hard and in the mood to fuck some ass.Brenn gets on the couch and gives it up as Ari slides his dick inside and starts fucking him doggy style. Ari loves that tight ass as he pounds away at that ass. He drives his dick deep inside Brenn as his ball slap at Brenn's smooth hole. 'C'mon fuck my ass!' Brenn groans as Ari taps that ass. Ari then pulls out and sits back as Brenn straddles his meat and sits down on it. 'Fuck that ass is tight' Ari grunts as his dick goes back inside. Brenn starts to ride that dick like a jockey bouncing up and down wanting every inch of that dick deep inside him. Ari just sits back and enjoys as Brenn greedily does all the work. Brenn is rock hard as he gets that ass stretched and can't help but jack his dick as he gets plowed. Ari then gets him on his back on the chair and slides inside for more. Missionary is gonna do the trick as he slams that dick deep in that ass. Brenn beats his dick faster as Ari's meat sends him over the edge. He blows his wad all over his abs as Ari pulls out and sends his own huge batch all over Brenn. He explodes a massive load coating everything from Brenn's face and chest all the way down to his now cum covered cock.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Ari Gypsy",
      "person_id": 28025
    }
  ],
  "release_date": "2012-01-19",
  "scene_id": 54227,
  "series": "Little Big Man",
  "tags": [],
  "title": "Little Big Man, Scene #01"
}