{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have one of our favorite imports back this week. Sporting long locks, sexy beard and that uncut geyser of a cock: say hello to 32 year old, Polish Playboy, Lucas Knowles. The only one luckier than our members this week is Milwaukee native Morgan Shade. Morgan is 22 years old and will soon have the best 'seat' in the house.  We wondered what these studs wanted to be as kids when they grew up. Morgan had big plans to be an architect while Lucas wanted to trade papers on the stock exchange floor.  We then asked if there was a year in their lives that they'd want to relive or do they just prefer to barge ahead with new experiences. Morgan likes to live for tomorrow and is open to the adventure of it all. Lucas tends to linger in memories of high school and how fleeting time can be. We then asked them to tell us what they like best about the other. For Lucas he loves Morgan's tight pink hole while Morgan is really into Lucas' sexy feet and full lips.  Wrapping up, we asked these two studs where they prefer to shoot their hot loads. They both agree that they prefer to shoot on a guy's chest. 'I like to see the fruit of my efforts' beams Lucas; and with loads like his-who can blame him?' The chemistry is off the chart as these studs start before we hit record. They start to kiss slowly as Morgan gets better acquainted with Lucas. Morgan's dick is straining to get out of his pants so Morgan stands up and drops 'em. His boner springs free as Lucas goes right for it. Lucas deep throats Morgan's 7' boner to the hilt as Morgan just moans his approval. Morgan's naturally smooth with just a sexy happy trail leading south to that cock that's lodged down Lucas' throat. Lucas strokes his own uncut meat as he pleasures Morgan's meat. Lucas stands to continue making out with Morgan as they begin to stroke their hard cocks together. Lucas then sits back to give Morgan a taste of what he's brought to the table: a thick 8' Polish sausage. Morgan takes his time as he licks down Lucas' smooth chest and nips 'til he gets to the heavy balls aching for release. He laps at them a bit before taking that fat dick in his mouth. Morgan goes to work on that dick shoving it deep into his throat making Lucas writhe in ecstasy. Morgan's tongue gets Lucas so horned up he gets bent over on the couch so that Lucas can show him what his tongue can do. Morgan just moans as he gets that ass tongue-fucked and ready for more.Once Lucas gets that ass nice and wet he suits up and slides his fat cock deep. Morgan's ass was already up in the air so what better way to start than tappin that smooth ass doggy. Morgan groans as he accommodates Lucas' thick cock. Lucas slowly pumps his meat into that tight ass slowly picking up speed 'til he's pounding that hole deep. Morgan grunts in a mixture of pleasure and pain as Lucas continues to bury that dick deeper and deeper. Lucas then pulls out and sits back and has Morgan ride his meat. Morgan climbs up on the chair and squats down on that dick for more. Once he gets that thick dick inside he starts to ride it. Lucas holds his tight waist and helps bounce him on his cock as they make out some more. Lucas loves being able to sit back and watch Morgan fuck himself as he bobs up and down on his cock. The party then heads south as Lucas lays on the floor. Morgan straddles his dick and goes right back to riding it harder and faster until he loses control and blows his wad all over Lucas' chest and abs. Lucas then stands up and jacks his massive load all over eager Morgan's face, neck, shoulder and back-you get the picture-leaving Morgan a glazed and dripping mess. ...Lucky!",
  "models": [
    {
      "name": "Lucas Knowles",
      "person_id": 27994
    },
    {
      "name": "Morgan Shades",
      "person_id": 28048
    }
  ],
  "release_date": "2012-02-02",
  "scene_id": 54232,
  "tags": [],
  "title": "Made in the Shades, Scene #02"
}