{
  "collections": [
    "Men Over 30"
  ],
  "description": "Diesel Washington is back in the house this week; and the only one happier to see Diesel is this week's costar Marxel Rios. For those of you unfamiliar with Diesel, Diesel is 41 and originally from New York. Diesel's had a successful career in the industry and even though the persona he played as a big tough top brought him much fan fare he's really just a comic loving softy. Marxel is relatively new to the biz. He's 26 years old and from Ft. Lauderdale, FL. We asked these studs what their favorite animated TV show or character was. Marxel loves Family Guy and especially Stewie in drag. Ooooh, YES! Diesel's favorite Superhero would be Silver Surfer; but admits he loves Family Guy. He's a Quagmire man himself. Marxel's knew what he liked early on after his first sexual experience with another boy when he too was a lad on a childhood sleep over. He woke up to find his best friend rock hard. He got hard too and they just did what felt natural. Those sleepover's get you every time. For Diesel, being 6'6 and lookin like he does, it made it harder to come out as a gay man. 'When people see a large or big guy they think Alpha male and though I have those characteristics' Diesel smiles 'we all need to be loved'. Awww. Get in line, boys!Marxel is on his hands and knees looking under the futon for something he's lost when Diesel walks in and is greeted by the visual of Marxel's ass in the air. 'Looking for something?' Diesel asks as he comes in for a better look. 'Yeah, I'm looking for a controller' Marxel says. 'So am I' Diesel grins as he reaches for Marxel's ass and grabs his cock and balls. Someone's found the controller they were looking for as Diesel gets Marxel on his feet and gets this growing cock out of his shorts and into his mouth. Marxel moans as he gets his dick polished by Diesel who loves to suck dick. He works that hard cock as Marxel starts to fuck that face of his. Diesel shoves that dick so deep he gags on it as he pulls out his own cock and starts to jack off. Diesel's cock is rock hard and in need of some attention as well as he lays back and lets Marxel return the favor. Marxel gets on that thick black dick and takes as much of it as he can, wanting to please his horny buddy.  He bobs his head up and down on that hard cock as he swirls his fist around it as well making Diesel moan. Diesel and Marxel then get into a hot 69 as Marxel swallows that dick and Diesel eats that sweet ass getting it ready for more than his tongue. Diesel then suits up and watches as Marxel straddles his cock and impales himself on it. That ass slowly concedes as it takes Diesel's dick all the way in. Marxel then starts to ride that dick as he groans still getting used to it inside him. Diesel then holds his tight ass and starts to pound that dick up into him as Marxel takes that fucking like a champ. Marxel then holds himself in place as Diesel continues to slam his fat dick up inside that hole. Diesel then holds on to Marxel as he gets up still buried inside him to change position. He bounces Marxel on his dick as he stands up before turning around and sitting back on the bed. Marxel's ass never gives up that sweet cock as Diesel lays back and has Marxel ride him in a reverse cowgirl. Marxel bounces on that dick faster and harder and it does the trick as he starts to feel that familiar tingle in his balls. He can't hold back any longer and starts to shoot his load still riding Diesel's meat. He then lies on his back as Diesel straddles his chest and gives him a hot cream facial drenching that face repeatedly with his huge load.",
  "models": [
    {
      "name": "Diesel Washington",
      "person_id": 28049
    },
    {
      "name": "Marxel Rios",
      "person_id": 28050
    }
  ],
  "release_date": "2012-02-16",
  "scene_id": 54236,
  "series": "Fueled by Diesel",
  "tags": [],
  "title": "Fueled by Diesel, Scene #02"
}