{
  "collections": [
    "Men Over 30"
  ],
  "description": "Might wanna turn down the A/C, it's about get hot up in here as this week's duo sizzle on set. After overwhelming response we brought back sexy Joe Parker and teamed him up with Diego Vena. Joe is 32 and originally from Philadelphia while Diego is 33 and originally from Indiana. We asked these two to title their own future memoirs to give people an insight into their lives past and present. 'The Secret or Not So Secret Life of Diego Vena' is Diego's while Joe's memoirs would be titled 'The Making of a Gay Handyman'. We then asked if they were turned into films, which male actor would they cast to play themselves. Diego would want George Clooney and Joe would want Christian Bale. We could see the resemblance there. In closing we asked these studs what sexual encounter from their past still makes them cum thinking about it years later. Joe was in a LTR for 7 years and after breaking up, he took a summer vacation and met a guy a little older than he was with dark hair and a furry chest. Everything he likes in a guy and they went to town. It still makes him horny thinking about it. Diego's was in high school when he slept with his girlfriend's boyfriend. He always wondered why he was always so jealous when they hung out. Well, it wasn't about her at all. ...and that's the way we like it.Diego is hangin' out and playing on his phone waiting for Joe who finally strolls in wearing board shorts and a tee. 'You going to the gym in these?' asks Diego as he tugs at his board shorts. He then hands Joe a pair of gym shorts he can change into so that they can head out already. Joe drops his shorts and his cock is at attention in his briefs. Gym!? What gym? Diego reaches for it and starts to stroke on it through his briefs before getting closer to sample the supply. He pulls down Joe's briefs freeing his aching cock before going down on it. Joe moans as Diego's head bobs up and down on his aching cock. Diego knows just what that cock needs as he repeatedly shoves it deep into his throat. Diego then slips onto the floor on his knees to get a better angle on that dick. He fucks his face with Joe's cock as Joe just moans his approval. Joe pulls Diego to his feet so they can make out for a few before giving Diego even more cock. Joe eventually wants to return the favor and gets Diego on his back as he kisses his chest and abs on his way to Diego's cock that by now is screaming for attention. Joe takes his cock all the way to the hilt and gives Diego some of the same as Diego lays back and enjoys the show.Joe services that dick until his own cock wants 'in' on the action. He flips Diego over and gets him on all four as he fingers that hot hole. His cock rock hard aching with anticipation as he finally pushes his dick inside shoving it all the way in as Diego does his best to accommodate Joe's extra thick cock. Joe starts to pound that ass deep as Diego grunts and moans. 'Gimme that dick' Diego coos as Joe picks up the pace. He fucks Diego doggy style. Diego is moaning as his tight hole is getting stretched wide open. His cock is rock hard the entire time Joe is pounding that ass and he can't get enough. Joe then gets on the couch and has Diego sit on his dick. Diego impales himself on it and then just holds still as Joe fucks that ass slamming his dick up into Diego's worn hole. Diego jacks off as Joe continues to fill that ass full of dick. The chemistry between these two is off the charts. Missionary is next as Joe gets between Diego's legs and goes right back to fucking his hole. This position does the trick as Diego loses his load. Diego jacking off faster about to blow his wad, when Joe pulls out and drenches Diego's dick with his own thick load which then triggers Diego's cock to follow suit...cum bath, anyone?",
  "models": [
    {
      "name": "Diego Vena",
      "person_id": 27984
    },
    {
      "name": "Joe Parker",
      "person_id": 28044
    }
  ],
  "release_date": "2012-03-01",
  "scene_id": 54238,
  "series": "Quid Pro Joe",
  "tags": [],
  "title": "Quid Pro Joe, Scene #02"
}