{
  "collections": [
    "Men Over 30"
  ],
  "description": "Adam Rogue makes his action debut with us this week on MenOver30.com. Adam is a big boy and carries a bigger than average club. After originally doing a sexy solo scene, we figured it was about time to watch this hunk get it on. Adam is originally from Chicago and still a head turner at 44. When you got it, flaunt it.  Helping us welcome back Mr. Rogue is our very own, Alexander Garrett. Alexander is a hot Colombian who now calls South Florida home. Alexander is a natural fit since he too is packing quite the big, uncut cock. These two are bound to have a good time and the chemistry seems to be working. We asked these two if there was any other country they could live in which would it be. Adam wants a cultural destination steeped in history. Italy is his top pick which has more than just culture to admire.  Alexander would love to live in Brazil. Brazil has many things to offer and the men aren't bad to drool over either. Neither of these studs realized they were packing more than the average guy down below until they were in their 30s. Makes you kinda wonder what they weren't doing in their 20s, huh? Well, this afternoon you won't have to wonder much at all. Just sit back, get hard and enjoy.Adam is relaxing and flipping through a dirty magazine when he gets a knock on the door. Alexander arrives to measure him for some alterations. He begins to take his measurements: chest, arms and biceps. As he kneels to measures for his inseam his hand lands squarely on Adam's already swollen crotch. He stands up as they start to make out. They begin to undress each other as they kiss and we see our first glimpse at Adam's huge frame. Alexander undoes his pants and takes out Adam's rock hard cock. He playfully measures it before getting to work on it. He opens wide for Adam's thick cock and sucks it down to the hilt. Adam moans in appreciation as Alexander spit shines his meat. Adam then wants to suck some dick to as he sits before his new Latin playmate. Alexander gives him more than a mouthful of uncut Colombian cock to work. As Adam sucks on that sweet meat he's busy stroking his own meat down below. They then get back to making out as they compare dicks and stroke them together. Adam then goes back down for more of Alexander's cock as Alexander bobs his head on his pole.Adam then gets Alexander on the couch and puts him on all four so he can get a better appreciation of that ass he'll soon fuck. Alexander serves it up on a platter as he arches his back and that delicious ass beckons Adam closer. Adam fingers that sweet ass a bit before giving it a lick or two to get it ready for more. Adam then suits up and sits back while Alexander straddles his thick meat and impales himself on it. It takes a few seconds to get all that cock inside that ass; but once it's in?it's in! Alexander starts to ride that meat as he bounces up and down on it. ?You like that big cock?? Adam grunts while he watches Alexander go to town. Adam then gets Alexander back on the couch and slides his thick meat back inside his hot ass doggy-style. He fucks that hungry hole deep as Alexander braces and takes it like a man. Alexander's tight ass is driving Adam wild as he palms Alexander's head using it to bounce his defined frame back onto his thick dick. Adam then gets Alexander on his back and fucks his ass missionary. Alexander strokes his meat while Adam's cock is hitting his sweet spot. As they near climax, they sit back and beat off. Alexander soon explodes all over his smooth abs just as Adam unloads all over his own furry frame.",
  "models": [
    {
      "name": "Adam Rogue",
      "person_id": 27991
    },
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    }
  ],
  "release_date": "2012-02-09",
  "scene_id": 54234,
  "series": "Adam's Rib",
  "tags": [],
  "title": "Adam's Rib, Scene #02"
}