{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a special treat as we welcome back Steven Daigle. Steven is gonna have his hands full with one of our alumni that is coming out of retirement after 8 years. Peter Finland is back and looking hot as ever at 45. Steven is now 38 and we know Peter's in good hands with our resident exhibitionist. Both of these guys love to be in front of an audience and they both have current projects underway. Steven, of 'Big Brother' fame, will be featured in a new gay movie called 'Eating Out 4?Drama Camp'. It's due to be released soon and he's excited about it. Peter also has a flick on the way due out this spring called 'Bear City 2' in which he'll have a cameo as a boat captain. 'It's gonna be hilarious!' he assures us. We then asked these two when they are out at the movies what they like to eat at the concession stand. Steven loves Hot Tamales while Peter is hooked on Sour Gummy Bears. We then wrapped it up by asking these studs what they enjoy most about working in the adult industry. They both couldn't agree more on being fortunate enough to be able to travel while meeting incredibly hot men and get paid to have sex with them. ...Makes one suddenly want to question their career path. Peter is kicking back on the couch with his feet up talking to a friend on the phone. He wraps the call up and as the camera pans out you realize that Steven is on all four acting as his ottoman. Peter figures it's about time to put him to better use as he slides his hand inside Steven's shorts and explores that hot ass. He pulls those shorts down to get a better view of that ass and then grabs Steven and begins to make out with him. Peter peels off his tee as he shoves Steven's face into his chest. Steven licks at his chest and works his way south to that hard cock in his jeans. He undoes them to get at that dick and soon he has Peter's uncut cock in his mouth. Peter fucks his face for a bit before sitting back to have Steven worship his meat some more. Steven can't get enough as he takes that dick down his throat. Peter stands up again so he can shove that meat as deep as he wants to as Steven coughs and gags on it trying to take it all. Peter slaps that face with his cock and then with his hand making Steven even hornier for it. Peter then bends Steven over and gets that sweet ass nice and wet as he dives in tongue first. Steven can barely contain himself as Peter French kisses his smooth hole. Peter then stands in front of Steven and fucks his face some more wanting to get his cock rock hard again before sliding it inside that hole he just got through eating. Steven takes it like a good boy as he services Peter. Peter bends forward and starts sucking on Steven's cock and his tongue ends up back in Steven's hole. Hmmm.  He gets Steven on all four and slowly pushes his meat inside that tight ass. Steven groans as he gets used to that dick in his hole. Peter pounds him hard and deep from the start as Steven just begs for more. Peter pounds that ass doggy style before pulling out and laying back on the floor. Steven knows his place as he straddles that daddy dick and goes right back to taking it. 'That's m' boy' groans Peter as he watches Steven bounce up and down on his meat. Steven's doing all the work; and he's not complaining. He grinds that hot ass deep wanting every inch of Peter's cock inside him. Peter grabs him and shoves inside even deeper as he fucks him missionary. He pounds away hitting Steven's sweet spot as Steven begs for more as he's about to cum. Steven blows all over himself with Peter still buried inside him. Peter then pulls out and unloads all over his own chest leaving himself a cum-covered mess.",
  "models": [
    {
      "name": "Peter Finland",
      "person_id": 28055
    },
    {
      "name": "Steven Daigle",
      "person_id": 28004
    }
  ],
  "release_date": "2012-03-29",
  "scene_id": 54245,
  "series": "The Big Finnish",
  "tags": [],
  "title": "The Big Finnish, Scene #01"
}