{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have sexy Trent Diesel back in the house for more. Trent is 28 and will be a full-fledged member in no time. For now he's an honorary MenOver30 member-by-injection and this hunky Wisconsin native is gonna help us welcome a new face to the club, Mr. Tony D. Tony is 32 and from the City of Brotherly Love, Philadelphia, PA.. With all the politics spinning these days we thought we'd try the murky water ourselves and asked if there was a way to change term limits, whom they felt was deserving of a third Presidential term in office. 'Personally, I'd have to go with Ronald Reagan' says Trent 'he is 'the' President everyone is compared to ever since. So there's gotta be a reason'.  Who gets to tell him old 'Dutch' died about 8 years ago? Wait, it gets better...although Tony agrees with Trent 99.9%, he'd have to go with Bill Clinton. Huh? (Trent then agrees Clinton is a good choice.) -WTF? These studs are truly 'BI-partisan'. 'BI' is a recurring theme since these studs like to dabble on both sides of the sexual fence. Trent discovered he liked surf and turf early on. Tony, who's new to the all male scene, admits he's surprisingly more comfortable with guys and doesn't feel as pressured like he does with women. That-and guys give better head, too.  Well, yeah...Tony and Trent are on the couch as Tony strokes his hard-on under a towel. He loves how it feels on his pecker and he thinks it works well. Trent has a better idea. He unwraps Tony's cock and goes down on it. Tony gasps as he feels that hot mouth on his hard cock. 'Fuck yeah, look at you. Those lips are magic' Tony grunts as he gets that dick worshipped. Trent makes his cock disappear with ease as he swallows it to the hilt making Tony ramble and rant about how good his cock feels in his mouth and comparing his oral talents to a Jedi. What Star Wars movie was that in? Hmmm. Tony is impressed with that mouth but wonders what that ass will look like. Trent strips down and shows off his smooth ass as Tony starts to play with that ass as he gets more head. He slaps at that ass in anticipation of what's to come. Trent then turns over as Tony awes over his cock. He strokes on Trent's dick as Trent drops his head off the edge of the futon to keep nursing on his. Trent then stands as they rub their cocks together and figure out what's next.Trent then bends Tony over on the couch and slides his hot tongue deep into his ass. He spits on that hole making Tony beg for more. Trent obliges shoving his face as deep as he can driving Tony crazy as he tongue fucks that hot ass. Tony then wants to do some fucking as well but before he can he wants to get as hard as he can inside Trent's whirlwind mouth. Trent goes to work milking that cock so well Tony wants to cum in it. Tony suits up instead and gets behind Trent and starts to fuck him doggy style. He pounds him fast and hard as Trent moans for more. Tony pounds at that hole hard as he makes Trent beg for more. 'I'm in there deep, Baby' Tony moans as that ass takes it all. He then gets Trent on his back and flips his legs up and over his head so he can pile drive that dick in some more. He starts doing squats into that ass as he buries that hard meat over and over. Trent takes it like a champ as he gets railed. Missionary is next as Tony gets Trent on his back for more. He pounds him hard and hits that sweet spot over and over sending Trent over the edge as he shoots all over himself while Tony is still impaled inside him. Tony then pumps his own load out all over Trent's cum-covered cock and abs.",
  "models": [
    {
      "name": "Tony D.",
      "person_id": 28053
    },
    {
      "name": "Trent Diesel",
      "person_id": 28054
    }
  ],
  "release_date": "2012-03-15",
  "scene_id": 54242,
  "tags": [],
  "title": "Toweling Off, Scene #02"
}