{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have 2 fresh faces on MenOver30 that are both packing some serious dick. The first is a Windy City's son named Eddie Kordova. Eddie is 36 and this sexy Latino has a lean defined body and an 8'+ dick to boot. This week Eddie's in good company with one of our local Florida boys by the name of Ken Tanner. Ken is 26 and originally from Ocala, FL. Ken has that all-American jock look with the dirty blond hair and the athletic frame to go with it. We asked these studs if they could be any character from either the Star Trek or Star Wars series, what character would it be. Eddie went with Darth Vader. He must love to be in control. Ken also went with a Star Wars character and chose Yoda. How appropriate, since he will soon feel the strength-inside him. We then asked them if they could be a panelist for CNN and they could be an expert on a certain subject what subject it would be. Eddie chimed in with big dicks. Well alright for Eddie and his phallic expertise. Ken went a tad safer and went with Music. He loves rock and his favorite band is, believe it or not, Blink 182. Sweet! They both like big muscular guys and both get tongue tied around guys they find intimidating. Well, it's nice to know even they have moments of weakness. <evil grin> They start making out as they start to explore each other's body. Eddie peels off Ken's shirt as he starts to lick his chest and suck at his nips. Ken follows suit, taking off Eddie's tank top and going to work on his smooth chest as he makes his way south past his pierced nips to the tent that's popping his jeans. He undoes his jeans and explores the bulge straining against his briefs. Ken slowly hauls out Eddie's fat cock as his tongue begins to sample the goods. He laps at Eddie's heavy hangers a bit before going to work on his uncut cock. Anticipation-look into it! Ken loves every inch of Eddie's dick and sucks away at it looking up at Eddie's face while he does. Eddie gets so hot with Ken on his dick he can't wait to get a sample of that smooth ass. He bends Ken over a chair before shoving his hot tongue deep into his ass. The look of lust and awe that come over Ken's face as Eddie rims his ass is inspiring. Ken then turns around and shoves his own thick meat down Eddie's throat. Eddie does his best to keep up as Ken slaps and fucks his face with his heavy cock. All this show and tell is working them up into an even hotter frenzy and by now Ken wants more. Eddie lies back as Ken straddles his defined frame and starts slowly lowering himself onto that thick cock. Little by little his tight ass concedes and starts to take it inside. Ken needs to accommodate as soon as he can because Eddie has plans for that hole and they involve fucking it. Ken moans and groans as Eddie starts to pump his thick dick up into his tight ass. Ken can only jack his meat to distract him from the fucking he's getting. If he keeps this up he may not last very long as he tries to deal with the pain and pleasure all produced by Eddie's huge cock. As Ken bounces and grimaces on that meat he jerks noticeably faster. Sure enough he moans and grunts out an 'Oh, I'm cumming' as he jacks his load all over Eddie's smooth chest. After he shoots his load, Ken gets on his knees to help Eddie out. He sucks and works his beefy uncut dick with his mouth and hands. Eddie doesn't need much more to blow his wad and once he's ready he strokes off an impressive batch that flies everywhere. Damn, these two definitely had some mad hot chemistry going on and we're glad we had front row seats. ",
  "models": [
    {
      "name": "Eddie Kordova",
      "person_id": 27964
    },
    {
      "name": "Ken Tanner",
      "person_id": 28052
    }
  ],
  "release_date": "2012-03-08",
  "scene_id": 54240,
  "series": "Steady Eddie",
  "tags": [],
  "title": "Steady Eddie"
}