{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have a blast from the past and a recent hottie that came together to rock our studios. Joe Parker, the 32 year old from Philly is back and he's lucky enough to welcome back sexy James Hamilton. James is from Kansas City and at 29 he is a MenOver30 by injection but soon he'll be a full fledged member himself. We're living in crazy times these days so we asked these studs what the last thing they found hard to believe. 'Porn on Canadian Cable TV' astounds James; while Joe is bummed out about the recent overturning of gay marriage in North Carolina. Yeah that surprised some while reminding others that we still have a long way to go. On a brighter note we asked these hotties what they each think they both excel at. James says cumming is something he does rather well and we'd have to agree. 'I give a hell of a blow job' says Joe as James concurs with an instant 'yeah!' Heard it here first! We wrapped it up by asking what the most unexpected sexual encounter has been. Sex on the roof for James while Joe admits he was in a bathroom at a bar in Philly once and...well, that's how he met his current boyfriend. Nice!James is flipping through the channels looking for something to watch as he finds porn playing on regular TV. Joe notices more than James' curiosity has been peaked as he reaches over and grabs his growing crotch. 'What are you doing?' James asks as Joe goes down to show him. He hauls out James' oversized cocks and puts it in his mouth. James doesn't mind one bit as he gasps at the sensation as Joe swallows every thick inch of his cock with ease. Joe goes to town on his big dick as James just sits back and enjoys it. Joe then gets up and takes out his own boner to give James the opportunity to give back. James gets right to it as he start to bob his head on Joe's fat meat. The chemistry is off the charts as these two go at it. James takes care of Joe's hard cock for a while before Joe needs some more of James down his throat. He has James lie back so he can get on his knees between those thighs and worship his meat some more. He laps at that cock and smooth balls getting James horny for much more than head. Joe gets on the floor and lubes up. James straddles him and eases his tight ass down on Joe's thick meat. It takes him a while before that ass concedes and takes Joe's thick dick inside. Joe starts pumping that dick up into James' tight ass wanting to bury it deep as James winces. It hurts so good as James starts to jack off as Joe picks up the pace. James is riding his cock soon enough as Joe pounds up into him. James gets up in a squat position as Joe takes the opportunity to pound his thick cock right up his ass. All James has to do is hold still as Parker pounds his dick home. He leans him back and fucks him in a missionary position for a bit before getting behind him on the floor to slip his meat in for more. Joe starts to fuck James' as he lies behind him. James' hard cock is throbbing and James can't help but jack off as he gets that hole stuffed. That does the trick as James busts his huge load all over himself and the floor. Joe pulls out and jacks his own load all over James' cum drenched cock and abs.",
  "models": [
    {
      "name": "James Hamilton",
      "person_id": 27947
    },
    {
      "name": "Joe Parker",
      "person_id": 28044
    }
  ],
  "release_date": "2012-06-07",
  "scene_id": 54256,
  "series": "Ready for Prime Time",
  "tags": [],
  "title": "Ready for Prime Time"
}