{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have a special treat for you this week as we welcome back one of Colombia's hottest exports, Alexander Garrett. Alexander is 34 years old and this sexy papi now lives in South Florida. It will be a meeting of the Americas this afternoon as we pair Alexander up with one of the hottest talents in the biz, Mr. Jeremy Bilding. Jeremy is 28, originally from Los Angeles, CA and one hot stud. We asked these two if they had a day to spend watching a series on DVD what they would pick. Alexander would love to catch up on LOST; while Jeremy is more of an Entourage kind of guy.  Jeremy loves to cook and his favorite to make is his signature pizza. Alexander loves seafood but he also loves Italian. Jeremy has the masculine appeal many are drawn to and his masculine persona has helped him land a str8 boy or two (dozen).  Alexander isn't one to fall behind and off cam he loves it all. Versatility is the spice of life. Who are we to disagree? Finally, we asked these studs what a man has to do to make them achieve that ultimate orgasm. Alexander just needs the guy to be hot. Jeremy, on the other hand, grins as he confesses, 'Not really anything in particular...I'm easy.' They start off kissing as they break the ice. Alexander takes off his tee then helps Jeremy out of his shirt as they continue making out. Alexander than lets his tongue roam south as he explores Jeremy's smooth chest. Jeremy stands to give Alexander more to play with as his jeans come off. Jeremy is left in a sexy orange jock that's straining to contain his growing cock. Alexander then strips as well and he's looking leaner than ever. His uncut cock is at attention by the time he gets back down to business. Kneeling, Alexander takes Jeremy's cock deep in his mouth as Jeremy just moans his approval. Jeremy has a thick 8.5' cock that is throbbing for attention. Jeremy watches as Alexander worships his thick cock. Alexander takes his time on Jeremy's meat; but eventually Jeremy wants to return the favor. He leans Alex back on the couch and goes to work on his cock. He licks that thick cock and those smooth balls sending Alexander into a frenzy. That tongue starts on that uncut cock but soon finds its way back to Alexander's hot hole. He licks and sucks on that hot hole he'll soon be fucking.Alexander grunts as Jeremy slides his thick dick inside him. Once he gets that cock buried he wastes little time before picking up the pace. He steadily starts to ride that hot ass as Alexander does his best to accommodate that entire dick. Jeremy holds Alex by his tight little waist as he pounds away at that ass. They switch it up and Jeremy sits back on the couch and watches as Alexander sits on his dick. 'Yeah, ride me' Jeremy moans as Alexander starts to bounce on his meat. Alexander is rock hard as he gets that hole rammed deep. Jeremy's eyes are rolling back in his head as he gets his dick milked inside that insanely hot Colombian ass. But wait?there's more! Jeremy then gets his hot Latin playmate on his back so he can continue fucking him missionary. His hard cock goes right back inside as he pounds that hole faster. Alexander starts stroking his cock in time to the dicking he's getting and it won't be long before these two explode. As they near orgasm, they sit side by side and jack their aching cocks off. Jeremy is the first to blow as he unloads all over his smooth chest. Alexander cums seconds after Jeremy sending his own glue like cream cascading down his shaft and balls.",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Jeremy Bilding",
      "person_id": 28057
    }
  ],
  "release_date": "2012-04-26",
  "scene_id": 54250,
  "series": "Bilding Inspection",
  "tags": [],
  "title": "Bilding Inspection, Scene #02"
}