{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have some New England flavor that's been long overdue in these parts. Brenn Wyson is back with us this week and we have to admit we've missed his crazy antics and that signature accent. Originally from right outside of Boston, Brenn is 40 now and looking better than ever. Today Brenn is going to help Cody Robbinson, a sexy 22 year old from the Hoosier state, make his debut with us. This will be Cody's first time with a 40 year old and little does he know he's about to set the bar really high. Both of these hotties have tattoos so we wondered what the first tattoo they got was and what inspired them. Brenn's first tattoo was a drawing he made to honor his late brother who passed while stationed overseas. It runs the length of his right arm and has the Archangel Michael atop what became an intricate illustration representing not only his brother but his home town and friends he left behind in Boston and Brooklyn as well. Cody's first was his last name on his wrist. We then wrapped it up by asking them to tell us something about themselves that most people wouldn't expect. Cody used to do professional motocross and ended up breaking 2 ribs. 'I don't think I can shock anybody out there anymore' Brenn grins, 'I've shocked them enough'. He may have a point there... Brenn and Cody are packing up their apartment and after a long day Cody grabs his lower back and tells Brenn his back is going to hurt tomorrow. Brenn walks over and grabs him as he grunts in his ear 'That's not the only thing that's gonna hurt' as he makes Cody kneel. Brenn undoes his jeans and hauls out his cock that is rock hard and shoves it into Cody's willing mouth. 'You like that cock in your mouth?' Brenn groans as he starts fucking his face. Cody savors that thick dick and takes it all the way down his throat. Brenn pulls that cock out and makes Cody kiss his cock before ordering him to shove it deep. Brenn wants to bury that dick as far as he can get it as he holds Cody's head and bounces his face onto his meat. Brenn then pulls Cody up and kisses him as he undoes Cody's jeans. Brenn goes down and gives him some of the same as Cody slides his dick down Brenn's throat making him gag on it. Brenn knows what he's doing as he slurps on that hard cock getting it all wet and easier to take. Soon he applies that principle to Cody's hole as he turns him around and shoves his tongue inside. Cody moans as Brenn French kisses that tight ass. Cody loves it as he backs that ass onto Brenn's face wanting that tongue as deep as possible. Once Brenn has that hole nice and hungry for more he stands and delivers. He bends Cody over and after teasing his hole a bit he slides that fat dick home. Cody buckles in for a bumpy ride as Brenn does what he does best-fuck hard. He pounds that young ass deep and hard as Cody takes it all. 'You love being a fuckin' bitch!' Brenn grunts as he slaps his ass and rails into that hole. 'Tell me you fuckin' love it!' he orders as he grabs him by the neck. The sound of Brenn's balls slapping that ass fill the room as Brenn continues to take what's his. He then slows it down for a bit giving Cody a bit of a short lived break before getting him down on the couch in a doggy position. He slides back into that smooth ass and gets to work mounting that ass. He spanks Cody's ass hard as he goes back to fucking him and calling him his little bitch. Brenn then gets him in a missionary position over the couch and just starts to pound him deep hitting his sweet spot as Brenn jacks him off. Cody unloads all over himself as Brenn jacks and fucks him. Brenn then pulls out and shoots his own massive load all over Cody's chest and cum-covered cock.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Cody Robbinson",
      "person_id": 28058
    }
  ],
  "release_date": "2012-05-03",
  "scene_id": 54254,
  "tags": [],
  "title": "Wyson: Chicken Done Right, Scene #02"
}