{
  "collections": [
    "Men Over 30"
  ],
  "description": "Back after a long absence in these parts is none other than Tim Kelly. Tim has gotten all dressed up for the occasion and we all know that boys go crazy for a sharp dressed man. Tim is hitting the big 5-0 this year and we must admit he's looking better and leaner now than he did 3 years ago when we saw him last. Tim decided he wanted to go from just being big to being leaner and cut up as he got older. So he found himself a trainer and he did just that. Mission accomplished. For many talk is a big game; but Mr. Kelly brought us results and to that we raise our martini glass. It's 5 somewhere! Tim is single and has been since we last saw him. He's currently accepting applications and loves men with a good sense of humor. He's a bit of a goofball so he likes men that appreciate that. He usually is drawn to guys that are more muscular and he isn't too particular on whether they are hairy or smooth. We then wrapped it up by asking him if he could cast a fantasy scene what it would be. Tim admits he would want to do a romantic scene which is rarely done. Find models that have chemistry and can bring that to the set and really capture something as intimate as romance to then share it with the viewers at home. Mr. Tim Kelly, always the visionary. -Now get naked!Tim comes home wearing a sharp black pin stripe suit and a blue button down shirt. His shirt is set nicely against his paisley tie which has been around his neck far too long. It's time to kick back and get comfortable. The tie, always the last accessory put on, comes off first and the rest of the ensemble is sure to follow suit. (no pun intended) Tim drops his pants and starts to grope his growing cock through his boxers. His shirt is unbuttoned and framing his hairy chest nicely as he sits back to give his cock more attention. As he sits back we can better appreciate the fur front as we get a better view of all the body hair he has to offer. If you're a hair lover, get your tongues ready-cuz there's a fur ball in your future. His cock is ready to make its debut as Tim stands to lose his briefs. Now fully 'debriefed', Tim is ready for his assignment as he gets to work on his needy cock. He tugs at this shaft dry while remembering to keep his balls in the game. His cock is coming to life glad to finally get the attention it's been craving all day.Tim's cock is quick to respond and is soon at full mast and swinging side to side as Tim continues stroking and teasing it. He takes off his shirt to show off his upper body and sits back to play with his cock and balls. His dedication in the gym and his trainer's guidance has really paid off. Tim sits back and lubes up his cock to get better results. He tugs on his nuts as he picks up the pace. His fist becomes a blur as he pumps his hard cock up and down. It won't be long before his cock gets the kind of release it needs. He runs his free hand through his thick chest hair as he gropes his muscular chest. His hairy nuts start to pull up closer to his shaft as they prepare for launch. Tim is on point as he continues to jack his dick. He spreads his muscular legs apart getting ready to blow his wad as he stops and displays his hard erection for us. As he feels that familiar tickle in his balls he pinches his nipple and jacks even harder sending his body into convulsions. He moans and groans as he writhes in ecstasy as his cock coats his furry navel with jet after jet of jizz. Now that's how every work day should end.",
  "models": [
    {
      "name": "Tim Kelly",
      "person_id": 27957
    }
  ],
  "release_date": "2012-06-14",
  "scene_id": 54258,
  "series": "Dressed for Sex-cess!",
  "tags": [],
  "title": "Dressed for Sex-cess!"
}