{
  "collections": [
    "Men Over 30"
  ],
  "description": "Lucas Knowles is back this week and we're not about to complain. We know a fan favorite when we see one and this 33 year old import from Poland is definitely top notch. Today, Lucas' playmate is a new comer that goes by the name of Wolfie Blue. Wolfie is 25 years old incredibly charming and from Eastern Europe. Both of these studs are, aside from uncut, well traveled; so we thought we'd ask them for some tips on where to go while on vacation. It seems logical. Given the opportunity, Lucas would go back to Azerbaijan. Bounded by the Caspian Sea to the east and Russia to the north, The Republic of Azerbaijan is a beautiful place to visit still true to its ancient culture and history. (Relax; we had to look it up, too) Wolfie would like to get back to Peru, Tupac Amaru, to be specific. One of the last holdouts of the mighty Incan Empire before falling to the Spanish, Amaru is still unearthing ancient artifacts that shed light of their primitive past. We then decided to make the question a tad easier and asked which country in their opinion has the hottest men. Wolfie has a thing for rugged Aussie men, so 'the Land Down Under' would be his choice. Lucas prefers them hairy and beefy so he's headed to Serbia and Croatia to stock up. Well that was easy enough-let's fuck shall we?Wolfie is wringing out his t-shirt after getting caught in a rain storm. Lucas walks in and finds him upset and cold so he offers to do what anyone would've done-warm him up. They start to make out as Lucas' hands start to explore his new conquest. Lucas heads south to get a better look at that uncut cock as he goes down on Wolfie's hard cock. Wolfie gasps as he gets his dick swallowed whole. It seems to be working because he's not shivering anymore. Lucas knows exactly what he's doing as he gets that dick nice and sloppy. Lucas' own thick cock is rock hard and waiting to get in on the action. Lucas stands and quickly gets Wolfie to his knees. He slides his thick cock inside and goes to work fucking his face. Wolfie deep throats Lucas' cock with ease as Lucas slides it in and out of his eager mouth. Lucas' cock is rock hard as Wolfie grabs his huge balls and helps aim it down his throat. The temperature is definitely rising as Wolfie savors every inch of that Polish pole. Lucas wasn't done with Wolfie's meat just yet so they maneuver into a steamy 69 on the floor as they go to town on each other's cock. Wolfie then finds new grounds to plunder as his tongue slips into Lucas' hot ass. He tongue fucks that beefy ass getting it nice and ready...Wolfie then gets up and aims that meat south as he slides his cock into Lucas. He pile drives his hard cock into that hot ass as Lucas moans his appreciation. Wolfie then gets Lucas on the couch and gets busy stretching that ass wide as he pounds him missionary. Lucas takes it like a man as Wolfie gives it to him full throttle. His balls slap away at that beefy ass as the sounds of sex fill the room. Lucas' legs are in the air; but soon that will change. Lucas suits up and gets Wolfie face down on the floor as he takes his turn at bat. Wolfie grunts and groans in both pleasure and pain as he takes Lucas' meaty cock. Lucas is unfazed as he takes what is his, doing pushups into Wolfie as he buries his cock deeper and deeper. Lucas towers over Wolfie as he writhes beneath his solid frame. That tight ass has Lucas on point and he's not about to stop fucking anytime soon. Lucas then pulls out and lays back and has Wolfie do the rest. Wolfie straddles his cock and sits on it. He rides that cock as he moans in ecstasy. Lucas just watches as his cock disappears in and out of that hungry hole. Wolfie's stroking and Lucas' cock is hitting his sweet spot as it sends his load all over Lucas' chest and abs. Lucas then busts his own massive nut all over his smooth cum-soaked frame.",
  "models": [
    {
      "name": "Lucas Knowles",
      "person_id": 27994
    },
    {
      "name": "Wolfie Blue",
      "person_id": 28063
    }
  ],
  "release_date": "2012-06-21",
  "scene_id": 54259,
  "series": "The Boy Who Tried Wolfie",
  "tags": [],
  "title": "The Boy Who Tried Wolfie, Scene #01"
}