{
  "collections": [
    "Men Over 30"
  ],
  "description": "Doug Jeffries is back this week and he's helping us welcome a newbie to the site as well as the industry. Doug is from Los Angeles and is now 46. His costar, Patrick Hunter, is a 22 year old, blue-eyed stud that hails from Virginia. Well, Virginia is for Lovers so we definitely found ourselves a keeper. We asked these studs if they could spend their summer vacations anywhere in the world where that would be. Doug would head south of the border to Rio de Janeiro while Patrick would cross the pond to his motherland of Ireland. No wonder he's so pale. Today was Patrick's first time on camera and he says it was a lot of fun though he admits they call it 'work' for a reason. There are many parts to a man so we asked these studs which they find most attractive. Patrick finds sexy, defined lats a major weakness. Doug can't pick just one and says he's attracted to guys with strong nose and a hot ass doesn't hurt either. As for indulgences Doug loves massages and Patrick loves treating himself to the chiropractor. A proper alignment can do wonders for the body. We wrapped it up by asking these studs which sexual act doesn't get enough attention and they both agree that good kissers are underrated.Patrick's reading his book when Doug comes over looking for a shirt that Patrick's Dad said he could borrow. 'It looks a little small' Doug sighs when Patrick assures him he probably just needs help putting it on. As he holds it for Doug to slide his arms into it, Patrick can't help but cop a feel of his buff chest which leads to them making out. Shirt!-what shirt? Doug takes the shirt off as Patrick's tongue finds its way to his chest and starts to lick all over it. Doug spins Patrick around and yanks down his pants exposing his hot ass. He slaps it and gropes it a bit before spreading those furry cheeks and sliding that tongue of his inside. He licks and blows on that hole as Patrick squirms with anticipation. Patrick then gets to lick all over Doug's biceps and chest as he makes his way south to that cock. Doug slaps at his ass as Patrick takes his dick deep. He starts to nurse on his cock taking every inch of it down his throat. Doug holds his head as he starts to slowly fuck that hot mouth of his. Doug loses his shorts as he gets comfortable for more to come. He flips Patrick over onto his back and feeds him more dick before going forward into a hot 69 taking Patrick's hard cock in his mouth as well.Doug then stands up and sits on Patrick's face as he gets that ass eaten out. Doug goes wild as he gets that ass tongue fucked and now he's ready to do some fucking of his own. He gets Patrick on his back and slides inside missionary. Patrick moans as he gets used to that fat cock in his ass. He slides that dick deep over and over as Patrick strokes his own hard cock. Doug then turns Patrick over onto his knees while he's still buried inside him. Once he has him where he wants him he takes that ass doggy style. He slaps Patrick's ass as he bounces it on his fat dick. Patrick's takes that dick like a champ as Doug uses his holes any way he sees fit. Doug then holds still and watches as Patrick fucks himself, bucking back onto his hard cock unable to get enough of it. Doug then switches positions again and gets Patrick back into missionary where he slides back in and takes it slower. Patrick jacks his cock as Doug buries his. Missionary does the trick as Doug's cock hits that sweet spot. Doug can't hold back any longer and pulls out and unloads all over Patrick's cock. Patrick isn't far behind and blows his own load all over his cum coated navel as Doug fingers his sore hole.",
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 27928
    },
    {
      "name": "Patrick Hunter",
      "person_id": 28059
    }
  ],
  "release_date": "2012-05-17",
  "scene_id": 54251,
  "series": "Good Neighbor Policy",
  "tags": [],
  "title": "Good Neighbor Policy, Scene #01"
}