{
  "collections": [
    "Men Over 30"
  ],
  "description": "Nicko Morales, who made his debut with us last week, is back to show us just how he puts all that sexy 'Guatamalan-ness' to work as he puts fan-favorite Diego Vena to the test. For those of you who missed his steamy solo, Nicko is 31, originally from Guatemala and now calls the Big Apple home. Diego is 34 and he's originally from South Bend, IN. We asked these two hotties if they could go anywhere in the world for a week long vacation where that would be. It's a toss up for Diego who is between either going to Brazil or to Barcelona. Nicko actually has family back in Brazil so that's where he would want to go. We wondered if either of these boys were members of the mile high club. Diego hasn't found the right flight attendant yet and Nicko hasn't had the chance to try to have sex in those tiny lavatories either. We asked Nicko how he felt about actually doing porn to what he might've imagined it to be before doing it. Nicko grins as he says that the guys are definitely hotter in person than in porn. When we asked them what their best orgasm to date was, Nicko, ever so suave, says his most memorable orgasm ever was 'this' very shoot as he bites his lower lip(...for effect) and gives Diego puppy dawg eyes. Awww. Oh Boy! Diego, always the gentleman, blushes as he cordially agrees...Lip locked and all over each other is how we start as Diego and Nicko get better acquainted. Diego pulls off Nicko's tee to get at his furry chest as they continue to kiss passionately. Diego runs his tongue down that hairy chest working Nicko's nips as he licks and bites them. They can't get enough of each other as their shirts come off and their pants get unbuttoned. Diego stands as Nicko lands on the floor taking Diego's pants with him. He gropes Diego's growing cock and ass as he lowers his sexy briefs. Diego's smooth ass comes into view and Nicko can't help but want a taste. He bends Diego over and dives right in tongue first as he eats that hot ass. Nicko shoves his face up in there darting his tongue deep into that hungry hole making Diego squirm. Nicko then stands up to free his own cock that is straining for release. Diego quickly kneels before him as he gets that cock out and gets to work on it. He shoves that cock all the way down his throat as he savors every uncut inch.Nicko then gets on the couch suits up and sits back as Diego sits on that dick in a reverse cowgirl position.  His ass slowly gives way as he slides down that pole and starts to ride. Once he gets used to that dick he bounces on that meat like he's on a pogo stick. Nicko grunts and groans as he gets his cock ridden hard. These boys came to play as they go at each other with wild abandon. Nicko then moves forward so that Diego goes on all four as he stays inside his ass pounding it hard doggy style. He rams his cock into that insatiable ass as Diego just grunts and moans begging for more. 'Te gusta!' he grunts as he fucks Diego even harder. Diego's hot ass is bouncing off of Nicko's cock as he gets that ass railed. They then move the party south as Diego and Nicko lay on the floor with Nicko holding Diego's leg up as he slides inside for more. His balls slap away at that hot ass as they make out hot and heavy. Diego can't help but jack off as Nicko starts to hit that sweet spot getting him closer to climax. Nicko senses that and fucks him even harder sending him over the edge. 'I'm gonna cum' Diego moans seconds before exploding all over himself. Nicko then pulls out and shoots all over his own furry trail.",
  "models": [
    {
      "name": "Diego Vena",
      "person_id": 27984
    },
    {
      "name": "Nicko Morales",
      "person_id": 28066
    }
  ],
  "release_date": "2012-07-26",
  "scene_id": 54269,
  "series": "Latin Heat",
  "tags": [],
  "title": "Latin Heat"
}