{
  "collections": [
    "Men Over 30"
  ],
  "description": "Arron's favorite sexual experience is when his friends caught him having sex in the backseat of his car; and, rather than give him some privacy, they cracked a few beers & watched him go to town. That event may have set the stage for much of Aaron's adult life, as not only is he an auto mechanic, he is a hard core exhibitionist as well. We first met Arron about a year ago when he stopped by to get off after getting off work, but this time we catch him on his way into the garage with morning wood that is begging for some serious attention. As we learned last time, that big hard cock has to vie for attention with another pleasure zone that looms large at the center of his sexual universe: his ass. And even though he left his toys at home this time, as you will see, that did not interfere with his playtime on the front or the back!His black t-shirt clings to his tight, lean torso, and even in his baggy work pants his trouser tent steals the scene from across the room. As we get closer, Arron reveals the sexy trail on his tight abs and caresses his crotch with loving expectation of taking out his favorite toy. The fur on his pecs fans out to cover his chest as he opens his pants to reveal a cock that literally spills out of the fly. We can just imagine that the sensation of the silk fabric of his boxers will keep him at half mast all day, but there is nothing halfway about the condition of that big, fat cock right now. All eight inches are up and throbbing and so hard that when it stands, his cock points toward the ceiling without the need of a hand for support. But as he lovingly licks his index finger, it is clear that he will soon be using his hands for something else.Facing the mirror, his finger starts a disappearing act into his ass. And as he turns around, the steady stream of pre begins to ooze from the slit and puddles to the floor. Moving to have a seat on the back of the headboard, his cock continues to throb with a life all of its own. As Arron slides down to the mattress below, his finger slides back into that hole, and the look on his face is of a man at the zenith of nothing short of sexual rapture. With his abs tightly coiled and seemingly every muscle in his body flexed to support the impending explosion, the pressure in his balls finally gives way until a massive outburst of thick jizz covers his abs. Scooping up a good dollop of the white stuff and licking it off his fingers, if shows a good mechanic always cleans up after himself. Arron must be a great one!",
  "models": [
    {
      "name": "Arron",
      "person_id": 27811
    }
  ],
  "release_date": "2008-05-16",
  "scene_id": 54264,
  "tags": [],
  "title": "Five Finger Pleasure, Scene #02"
}