{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today we have a special treat as we welcome back a dynamic duo. Trey Turner and Jessie Coulter are here to share a bit of themselves with us. Trey, who is 24 years young and a local favorite from right here in Ft. Lauderdale, has been together with Jessie Coulter for about 9 months now. Jessie is originally from Louisville, KY and is a recent inductee into the MenOver30 Club. Being together and both working in the industry present different challenges. They both agree that it was love at first sight and both knew there was something special the moment they laid eyes on each other. We asked them what the most endearing emotional quality was that drew them to each other as well as what physical feature they find most appealing. Jessie loves that Trey is goofy because he is silly himself so they complement each other well.  For physical feature, Jessie loves Trey's smile. For Trey he likes Jessie's eyes. 'His eyes speak a lot' Trey blushes 'and I LOVE his ass!' These studs have the right mindset and know that everything they have is built on trust and knowing who they get to come home to makes all the difference in the world and we couldn't agree more.We seem to be late for the party as the camera pans to find Trey on his knees with an ass on his face. Jessie is moaning softly as he gets that tight hole eaten out. That ass is smooth and it's no wonder Trey's favorite feature. Trey slaps that ass as he shoves his long tongue deeper. He sucks at that hole making Jessie gasp and moan. Jessie then stands up and gives Trey something else to work on as he slides his rock hard cock into that hungry mouth. Trey swallows every inch of it down his throat as Jessie shoves is as deep as he can get it. Jessie's feeling left out as he gets Trey on the chaise. He undoes his pants and then goes to work on that hard cock waiting for him. He grabs Trey's dick by the base and starts to stroke it as he works the head with his mouth and tongue. Tag team is in effect as he gives Trey's cock the attention it craves. Trey is gasping for air as Jessie totally gives into his lust and savors every inch of dick he can take. Jessie then straddles Trey's chest to get some more head and it puts him in the perfect position for what's to come. Trey sucks that cock for him and when he's ready, Jessie moves that hot ass back and sits right on Trey's dick. He groans aloud as he impales himself on that thick cock. Trey just lays back and watches as Jessie goes crazy riding his dick. Trey starts to slam his cock up into that hot ass just as Jessie is bouncing on it. It sends that dick deep into Jessie as he goes wild for it. Trey grabs him and shoves him down on that dick even harder. He then moves him onto the floor as he gets between his legs and starts to pound that manhole with ease. Jessie's ass is taking a pounding and he can't seem to get enough of Trey's cock. Trey picks up the pace. His smooth balls slap away at that ass harder and faster as Trey goes up on his knees to keep fucking his horny boyfriend. Jessie jacks his hard cock as Trey lies beside him still delivering the dick he needs. He fucks him on his side as Jessie gets sent over the edge making him shoot his huge load all over his furry navel. Trey then pulls out and blasts his own load all over Jessie's cum-covered abs and cock. ...Hmm, Now what's for dessert?  lol",
  "models": [
    {
      "name": "Trey Turner",
      "person_id": 27927
    },
    {
      "name": "Jessie Colter",
      "person_id": 28064
    }
  ],
  "release_date": "2012-07-05",
  "scene_id": 54265,
  "tags": [],
  "title": "Trey Me On For Size, Scene #01"
}