{
  "collections": [
    "Men Over 30"
  ],
  "description": "Our favorite African is back with us as we have ourselves a blast from the past. Charlie Xavier is back with us after quite a while. He's now 36 and still looking damn fine as he comes back to show off that beef cake frame of his. Charlie was originally born in South Africa and admittedly grew up all over the world having moved around a lot. He now calls Miami home and says this is where he wants to be. Charlie is now a married man and no longer on the market. He says he's been with her for 6 years and that he met her online. His first date, he took her to Lincoln Road here on South Beach for a romantic dinner and stroll. Things worked out well and they've been together ever since. He admits he doesn't have as much sex as he used to but he's happily married and it's fun to have someone to share your life with. He still gets to jack off between romps, he just gets to do it at home instead of on airplanes like he did while single. Fortunately his better half isn't a complete dud she is into having a good time as well. He admits the hottest sex they've had recently was fucking in the water while out at the beach. Muuuuy Caliente...Only in Miami! lolCharlie just got home after a long day and decides he could use a shower. It's a scorcher out there. He peels off his jeans and shirt and heads for the shower. He stands under the shower as the water bathes his well-developed frame. Not much has changed on Charlie. He is still taking remarkable care of that body of his and it shows. He soaps up that big chest and beefy ass taking time to wash his thick cock and foreskin too. As he's washing up his hand lingers on his cock that is now getting bigger as he strokes it. He keeps his crotch as smooth as the rest of him and it doesn't take long before his thick uncut cock is at attention. His balls are heavy and look like they've been waiting for relief all day. Charlie finishes up in the shower and towels dry before heading back to the bedroom. He's all nice and clean now and ready to get dirty.  Charlie sits back on the chair totally relaxed, bathed and ready to give that dick the release it needs. Charlie gets to work on his cock that is still half hard with anticipation. He grabs his meat with his index finger and thumb and starts jerking off. His massive thighs frame the visual quite nicely. Just above the action we get to appreciate Charlie's flat stomach and his well defined chest and those small cinnamon nips of his breaking up a sea of smooth defined muscles. Charlie closes his eyes as he sits back and jacks that meat getting it harder than ever. Charlie then stands up and keeps teasing that dick as he pulls that foreskin back over his knob then swings it back and forth showing off his club cock. This South African's bringing the party favors and it seems no one can get enough. He squeezes his uncut cock making his knob glisten as thick precum pools at the tip. The cam then gives us a shot from below where we really get to appreciate the full visual of his massive quads, traps, biceps and shoulders. His smooth balls are getting tight around his dick and getting ready to launch a load. He lays back on the futon and gets that cock ready to blow as he jacks his meat faster. That does the trick as Charlie blows his wad all over his smooth navel and cock.",
  "models": [
    {
      "name": "Charlie Xavier",
      "person_id": 27898
    }
  ],
  "release_date": "2012-06-28",
  "scene_id": 54261,
  "tags": [],
  "title": "Charlie Cums Clean, Scene #01"
}