{
  "collections": [
    "Men Over 30"
  ],
  "description": "Named after Queen Elizabeth I, known as the 'Virgin Queen', the state of Virginia has had a long standing history as one of the original colonies. Well, as if being the first colony to plant peanuts, turn tobacco into a cash crop and house the World's only oyster museum wasn't enough, we can also thank Virginia for this week's addition to MenOver30, Mr. Dave Gibson. Dave makes his debut with us this afternoon and at 44 years of age, this mild mannered Southern gentleman is here to show it 'ALL' off. We asked Dave if he had a chance to go back to school and pay better attention in any subject what that would be. He definitely wishes he'd paid better attention during English. 'If you don't know proper punctuation and grammar you can end up looking stupid' he admits. As a kid, Dave was always a computer nerd; which is what he does now as a computer professional. However, he always wanted to pursue something in acting, not so much on a professional level but more so community theater. The best play he's ever seen was a rendition of Phantom of the Opera at the Pantages Theater in Toronto. Well it's been said that 'All the world's a stage, and all the men (and women) merely players'. Today, it's Dave's turn...Dave comes home talking on the phone to his better half that is currently on his way out of town and filling him in on a little something he left behind. In his absence, there's a gift wrapped box waiting for Dave. Dave unwraps the box and, to his surprise, finds a Fleshjack inside. He grins as he opens the top and slides his fingers deep into the soft, wet opening. His dick starts to stir in his jeans as he ponders the possibilities. Dave gets up and decides to get more comfortable as he peels off his tank and jeans. He's left in a pair of tight black briefs that's struggling to contain his growing erection. He teases his nipple with one hand as the other hand dives into his briefs to take matters 'in hand' (That's punny!...No?) His dick is hard as a rock and he strips off his briefs to give it some much needed breathing room. It's been a long day and this is just the kind of relief he needed. He strokes his cock dry as he gets it rock hard. Dave then gets comfortable on the couch lubes up his cock and grabs that Fleshjack to see what it's all about. Dave aims his cock at the clear hole before him and pushes his knob inside. The soft flesh-like opening concedes enveloping his cock inside it as it starts to milk that cock with every thrust it's given. Dave holds the Fleshjack with both hands as he starts to slam his dick inside it. The sound of slurping fills the room as Dave starts to fuck that faux ass. He groans in ecstasy as he gets that dick deeper and deeper. He pulls the jack off and strokes his dick with his hand then slides it back inside. He lays back and takes his time slowly experimenting on how well he can work his dick varying the pressure on it by opening the end. His dick loves the unexpected pleasure it's getting as Dave starts to twirl the Fleshjack on his knob. Dave then gets an idea and slides the Fleshjack underneath the futon. The futon now holds it in place as Dave slides inside and starts to fuck that hot ass as it takes the pounding its being given. Dave then lies back on the couch and jacks his cock off until he blows his was all over his smooth abs. Dave's in for a busy weekend.",
  "models": [
    {
      "name": "Dave Gibson",
      "person_id": 28065
    }
  ],
  "release_date": "2012-07-12",
  "scene_id": 54268,
  "tags": [],
  "title": "Jack Splat, Scene #02"
}