{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a special treat for those of you who appreciate your men with a bit of fur on 'em. Swarthy Nicko Morales makes his industry debut with us right here on MenOver30 as he takes it all off and shows off what this sexy, 31 year old New Yorker has to offer. Nicko first visited the US as a child; but grew up and studied in his native Guatemala, finally moving here after he finished college. He admits he loves his New Yorkers, but misses the warmth of the people he left behind. In Guatemala the people are naturally open and friendlier. It took him a while before he was able to feel that kind of warmth from The Big Apple. New Yorkers can be cliquish? -who knew!? lol Nicko was a bit of a late bloomer when it came to having sex with men and his first was a personal trainer in his early 20s. Coming to the US after college also made it easier for him to come out seeing as the culture here is more receptive more so than Latin America. When it comes to men he likes men that take care of themselves and are fit. He's also drawn to white boys and his biggest turn on in another guy is a nice ass. Well, something tells us we'll get to see Nicko going to town on a hot ass...sooner than later. Nicko is slowly grabbing his crotch with one hand as he slides his other hand up under his shirt to play with his chest and nipple. He gets comfortable as he lays back and pulls up his shirt to show off his hairy chest. Bedroom eyes and full lips aren't the only thing in this hotties' arsenal as we see more of him. He has an intricate sleeve tattoo that covers his right shoulder and bicep giving him a bit of bad boy edge and as he strips off his shorts we get to see that the chest hair is just the tip of the 'hair-burg?. He has a rather happy trail that visually leads you south to his hairy bush and thick thighs beyond that. He tugs on his growing cock through his sexy briefs before pulling them off altogether. He keeps his pubes trim but knows better than to shave them off appreciating the fur that came with the packaging. Nicko is uncut and hard as a rock as he stands to stroke his dick for us. He tugs on his foreskin as he teases his throbbing cock a bit before starting to pick up the pace.Nicko strokes his cock as the camera gets below his hard cock to give us a better view. His cock is wet with precum as he strokes his aching meat. His hand runs all over his chest as he feels himself up while beating off. He then gets back on the couch, spreads those sexy thighs apart and goes back to jacking that glistening meat faster. He is hard and at attention as he decides to show off that hairy ass. He goes face down on the couch and starts to hump the couch. His ass is framed by his sexy tan lines. Someone wears Speedos at the beach. Hmmm. He has a hot bubble ass and as he grinds his hips we get a preview of what that ass would look like once he slips that hard cock inside a willing hole.  Once he's done teasing us with the goods he has no intentions of having us sample he gets back on his back and starts to stroke again. His breathing is heavy and his fist becomes a blur as he feels the impending orgasm brewing in his tight nut sack. He plays with his taint as he jacks off and it does the trick sending his nut shooting all over his furry navel. Who knew all that Guatemalan-ness could be SO damn hot!?",
  "models": [
    {
      "name": "Nicko Morales",
      "person_id": 28066
    }
  ],
  "release_date": "2012-07-19",
  "scene_id": 54271,
  "series": "Nick-OH!",
  "tags": [],
  "title": "Nick-OH!, Scene #01"
}