{
  "collections": [
    "Men Over 30"
  ],
  "description": "You all cried for more and more you shall receive. Welcome back muscular hottie, Mitch Vaughn.  Well, fortunately not everything that happens in Vegas stays in Vegas; since we have Vegas to thank for 30 year old Mitch. Mitch with that beefy bod and killer smile left our members wanting more after his hot solo last week and we're happy to oblige. Mitch's costar this afternoon is a new face here on MenOver30 and we have a feeling you will enjoy him almost as much as Mitch did. Tall, dark and handsome, Parker Wright is from Phoenix, AZ and makes 37 look delicious. His hair is cropped short; his pecs are furry and he has a sparkle in those eyes you might wanna watch out for. We decided to ask these studs if they had someone over for dinner what they would make for them. Mitch isn't much of a cook but his specialty is desserts. He's a pastry chef by hobby and his favorite Italian dessert to make is 'Boccone Dolce'; a meringue-shelled dessert with chocolate and layers of fruit and cream. Parker isn't a chef but his Mom has taught him a few recipes and his favorite is Shrimp Scampi Marinara so it's in a red sauce and some parmesan over linguini. 'So I'm coming to dinner, when?' laughs Mitch. 'Whenever' grins Parker 'as long as you bring dessert? Hmmm, we should probably get started on that cream filling...Mitch and Parker finally make it home after a long flight and Mitch misses that ass already. They start to make out as their clothes start to hit the floor. Both of these studs are built and their dedication to their bodies has paid off. Parker licks his way south on Mitch's chest til he gets that hard cock in his mouth. Mitch moans as he buries his thick cock all the way down Parker's throat. Parker gags a bit but doesn't give up as he accommodates every inch of it. Mitch fucks his face for a bit standing up before laying Parker on the floor so he can feed him even more. Mitch has more in store for Parker as he makes his own way south to give Parker's cock some of the same. Parker writhes in ecstasy as Mitch works his magic sucking on that cock. Mitch works that hot cock before picking Parker's legs up and diving into that furry hole, tongue first. 'Oh that tongue is so good!' Parker moans as he gets that hole fucked and spat on. Mitch can't get enough of that ass as he gets Parker to bend over so he can continue to eat it out and get it ready for his own fat dick.Mitch then sits back as Parker straddles and sits on his hard cock. Mitch helps Parker as he starts to ride that dick. Mitch's thick cock is stretching Parker's tight ass wide open as he bounces that hot ass up and down on it. Parker can't get enough as he grinds his hot ass as far down as he can getting all of Mitch's cock buried inside him. Parker then gets off of it only to sit back on it in a reverse cowgirl. Mitch sits back and just watches as his thick dick disappears up inside that hungry hole. Parker wastes little time before going right back to riding that meat like a seasoned jockey. Mitch then gets Parker off his dick so he can bend him over and slam that hard dick of his back in doggy style. Bent over and taking it, Parker can't help but moan as he begs for more. They make out as Mitch continues to pound that hole. Missionary is next as Parker gets put on his back for some more filling. Mitch slides inside and picks up the pace as he nears climax. His thick cock sends Parker over the edge as he unloads all over himself. Mitch then pulls his own cock out and jacks his own load sending it splattering all over Parkers chest, abs and cum-covered cock. ",
  "models": [
    {
      "name": "Mitch Vaughn",
      "person_id": 28068
    },
    {
      "name": "Parker Wright",
      "person_id": 28069
    }
  ],
  "release_date": "2012-08-16",
  "scene_id": 54277,
  "series": "Love Me Wright",
  "tags": [],
  "title": "Love Me Wright"
}