{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a special treat as we gladly meet our newest member of the MenOver30 Club, Mr. Mitch Vaughn.  Mitch makes 30 look effortless and we are glad that this Utah native that escaped to Vegas has decided to share his gifts with the world. (...& by 'world' we mean us!) Mitch is handsome with a smooth frame and a muscular build. Mitch has charm on speed dial and a smile that could light up any room. We're sure he gives the boys in Vegas a run for (...what's left of) their money. Mitch wasn't always this delicious; it turns out he had meager beginnings. 'I was very different then I am now. I was a 125lb skinny, little twink,' he reminisces 'I didn't have good looks; but I had the grades.' Well that's definitely no longer the case and we're glad he left that Mitch back in high school. Mitch tries to work all his body out evenly so that things stay pretty symmetrical. He loves working out on his chest most. His favorite cheat snack would have to be dipping Oreos into peanut butter. These days that's the only cheating Mitch is doing since he's no longer on the market. Sorry Boys. Mitch has known his partner for about 2 years and they've been happily married for one. ...AwwwwwMitch gets home and kicks off his sneakers so he can relax and take matters into hand, literally. It seems his feet aren't the only things that could use some pampering. He lets his hands roam south as he starts to grope his growing cock. He has his hands full as he stands up and drops his shorts to give it the attention it needs. His shorts fall to the floor as his cock straining against some sexy briefs. He holds his thick cock still with one hand as he strokes his rigid meat with the other. The silky feel against his boner makes it throb and ache for more. Mitch teases us some more as he turns around and gives us a peek as he slides his briefs down over his smooth ass. His ass is insane! It's the kind of ass you just wanna spread wide and dive in tongue first. His hands reach back and grab his beefy glutes and spread that sweet ass apart, showing off his smooth hole. A sparkle catches our eye as his guiche piercing comes into view. Piercing his perineum is a silver captive bead ring that just adds to this lusty landscape before us. He kneads his ass for a bit teasing us some more before turning around for the big reveal.Mitch finally turns around and shows off his rock hard cock. He's at attention and proudly stroking his thick dick. His balls are smooth and he keeps that area trim. His pecs are well defined and he gives his chest and nips some attention as he strokes himself. The camera heads south and as we get a view from below we get a better appreciation for Mitch's thighs and taught waist. He then sits back and gets comfortable as he strokes his cock and tugs at his taint piercing. His finger lingers since it's so close to that sweet hole. Mitch has a raging boner that now requires all hands on dick as he strokes his fat cock double fisted. His hand roams all over his smooth body as the other hand continues to work that dick. All this stimulation is getting Mitch closer to climax as he picks up the pace. Mitch strokes faster concentrating most of his attention at the head of his cock, getting that cock right where it needs to be. Quietly and without much ado Mitch's cock explodes, sending volley after volley of thick cum soaring. It coats his chest and defined abs one hot splatter after the other. Whew.",
  "models": [
    {
      "name": "Mitch Vaughn",
      "person_id": 28068
    }
  ],
  "release_date": "2012-08-09",
  "scene_id": 54276,
  "tags": [],
  "title": "What a Mitch!, Scene #02"
}