{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a new face on MenOver30 as we welcome Justin Cage to the site and the adult industry. Justin is 38 years young and from San Francisco. Helping us welcome him aboard is a bright eyed hottie named Patrick Hunter. Patrick is 20 years young and recently moved to the St. Pete area along Florida's west coast. It wasn't long ago that Patrick had his very first scene on one of our brother sites. We asked these studs if they could spend the upcoming Labor Day holiday with anyone who would that be. Justin usually spends his holidays with family, so he wouldn't mind switching it up. Maybe meet some hot guy for a wild and crazy night on the town. Patrick would probably go back to Pittsburg and have a big barbecue and see all the friends he hasn't seen in a while. Justin considers himself to be bisexual but prefers a hard cock. (Don't we all?) His first time was at 16 in the high school gym. Patrick blushes with envy as he admits his first time wasn't til he was a freshman in college. He admits it was worth the wait and we're sure he's more than made up for lost time. So, on that note...Justin is taking a snooze on the couch in nothing but underwear & a ten gallon hat when Patrick walks in and can't help but want a closer look. 'See something you like?' Justin grins as he wakes up to find Patrick hovering and grabbing at his crotch. Patrick immediately gets between Justin's legs and hauls out his growing cock. Patrick eagerly gets to work on that dick as it grows harder in his hot mouth. Justin grabs Patrick's head as he helps bob him up and down on his cock wanting to get it as deep as he can. Patrick knows what he's doing as he worships that cock, taking it all the way down his throat. Justin's body is smooth and defined and has a sexy happy trail that leads from his navel all the way down to his hard cock. Justin appreciates the head but soon wonders what else Patrick has to offer as he stands him up; strips him down then bends him over. Once in position, Justin slides his tongue up into Patrick's sweet ass. Patrick's ass is smooth and irresistible as Justin buries his face in it. Patrick's cock is rock hard as he gets that ass eaten and Justin makes sure to get that dick just as much attention as he opens wide and takes his thick cock down his throat. They take turns on each other's cocks as they get hornier for more. Justin stands and gets Patrick on his knees so he can fuck that pretty face of his. That gets his cock rock hard as he gets Patrick into position. On all four, Patrick braces himself as Justin starts to slide his dick inside. Patrick's hot ass concedes and soon Justin is fucking that sweet ass. He watches as his dick disappears in and out of that ass as Patrick bucks back for more. Justin holds Patrick by the waist as he bounces him over and over on his hard cock. From there Justin takes the party south as they lay on the floor. He holds Patrick's leg up as he slides his cock back inside that tight ass. His balls are slapping away at that ass in no time as Patrick groans. Justin picks up the pace as he feels that familiar tickle in his balls. Justin's cock hits Patrick in just the right spot sending him over the edge as he explodes all over himself. Justin holds him tighter as he loses control and busts a load deep inside that hot ass. He then pulls out and empties the rubber all over Patrick's cum covered chest. There's nothing quite like a second coat of glaze!",
  "models": [
    {
      "name": "Justin Cage",
      "person_id": 28067
    },
    {
      "name": "Patrick Hunter",
      "person_id": 28059
    }
  ],
  "release_date": "2012-08-02",
  "scene_id": 54274,
  "series": "Stet's Son",
  "tags": [],
  "title": "Stet's Son"
}