{
  "collections": [
    "Men Over 30"
  ],
  "description": "David Chase is back and looking hotter than ever as he helps us initial a new member to the MenOver30 club. From the City by the Bay, Adam Herst is redefining the San Francisco treat. Adam is 37 and excited to be working with David Chase. He loves his beefiness and the hair isn't hurting any. David is flattered and in good company as he confesses he can't get enough of Adam with those massive thighs and big beefy ass. On that note, David and Adam both love to eat some ass and for Adam it's probably his favorite thing to do before taking a dick. ?It's definitely the one thing that will get me hardest' he says 'just eating a really nice ass.? David whom we know can eat ass better than most agrees and confesses what turns him on the most is feeling that his partner is responding to what he's doing. ?When I feel either a pussy get wet or a dick start to get hard, I know I'm doing something right.? Well if anything this thick hottie does is wrong?then we don't wanna be right. MmmKay! Well let's not keep these horny boys dressed any longer than they need to be. Shall we? David is toweling off after a shower wearing only a jock strap as Adam enters the room. David's ass looks amazing framed in that tight jock as Adam can't help but comment on it. ?That looks good enough to eat.? David doesn't have to think twice before he bends over and spreads that ass open. Adam lands on his knees as his tongue starts to make itself at home in David's hairy hole. He pulls that ass open as he buries his face in it. Fill that hot hole with your tongue, you dirty fucker' David groans 'cuz I'm gonna fill yours up with my dick once you're done.? That's music to Adam's ears as he gets lost eating out that hot hole. David then turns around and shoves his swollen cock into Adam's mouth. Adam gobbles it down without missing a beat as he rams it all the way down his throat. David teases and taunts him as he feeds him more dick telling him how bad he wants to fuck him with it. David then hauls Adam to his feet so he can get some dick of his own. Adam gladly slams his hard cock down David's throat making him gag on it. As David gets that face fucked we get an amazing view of Adam's smooth bubble butt. It's beefy and so inviting David can't help but abandon Adam's dick for deeper pastures. ?That's a hungry hole!? David grunts as he makes a meal out of that hot ass.Adam just grins as he pushes his hot ass right back into that hot tongue already inside it. He knows David's hooked and it will soon be that cock up there instead. David suits up and sits back as Adam straddles his pole and lowers that wet hole right on it. He takes that thick dick all the way inside as he starts to ride that cock. He whimpers as he struggles to get that fat dick situated in his tight hole. David holds that beefy ass still as he slides his dick in nice and slow for a bit before going right back to slamming that hard cock deep inside him. Adam is whimpering the entire time he gets that hole railed as he humbly begs for more. David then puts him on the floor and slides back inside that hot hole missionary. ?You love my fat dick don't you, fucker!? David grunts as he fucks him. ?I love YOUR dick? Adam coos totally surrendering to David's lust. David the moves to the floor as he lays behind Adam and gives him some more. Adam holds his massive leg up as David pounds that hole faster as the both near climax. Adam is the first to blow as David literally fucks the cum out of him. David then pulls out and straddles Adam's chest as he shoots his thick nut all over Adam's face. David then leans down and kisses Adam's cum-coated lips. That boy is so durty!",
  "models": [
    {
      "name": "David Chase",
      "person_id": 27963
    },
    {
      "name": "Adam Herst",
      "person_id": 28072
    }
  ],
  "release_date": "2012-09-06",
  "scene_id": 54283,
  "tags": [],
  "title": "Good Enough to Eat, Scene #01"
}