{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a special treat for our members imported all the way from that designer boot smack in the middle of the Mediterranean -Italia! Drop those drawers; spread those legs and get your lube on as we welcome Fabio Stallone to MenOver30. Fabio, Italian for 'bean grower', is a rather fitting name for our delicious 32yo import. You'll see why once you get a look at the massive bean 'stalk' this muscular god is packing. Let's not get ahead of ourselves. Fabio has been in the US for 6 years now and was about 26 the first time he had sex with a guy. If you do the math, it didn't take him long at all to leave str8 Fabio back in Italy and explore his sexuality once he arrived. Fabio has more than the average guy in more ways than one. He has a huge muscular frame, an ass that's all sorts of inviting as well as one of the thickest dicks we've had on our sites. We normally wouldn't know what to do with all that; but we knew our members would. (You know who you are!) Fabio has a very classic look to him with his hair cropped short and a sexy beard that frames his masculine features nicely. He's not a shy one and admits that when it comes to sex there isn't much he hasn't done. If there was one thing he wouldn't mind doing more of it would have to be sex in public. ...any volunteers? Fabio just got home as he strips down and heads for the shower. He stands under the shower as the water cascades down his defined frame. He soaps up as he starts to wash that sweet ass of his. The suds just bathe his perfect cheeks as he starts to wash them and wash up in between them as well. Just as your mouth starts to water thinking about the possibilities, Fabio turns around and damn near turns this scene into a 3D one as his massive cock swings towards the camera. He's rock hard and his beer can of cock is amazing. We're by no means 'size queens' ...but, we can be impressed!  He strokes his thick uncut cock with one hand as he tugs on his smooth balls with the other. As he showers you get a great view of his physique in general that is just sculpted sin. There's just no way to admire him in the nude without getting all sorts of twisted thoughts rattling on upstairs. Fabio finishes up; dries off and heads back to the bedroom to take care of that swollen cock.Fabio drops the towel and sits back to take care of his fat cock. He plays with his balls with one hand as he strokes his throbbing cock with the other. Fabio's body is a buffet of delights with so many things you wanna try. His thick quads are spread wide as we get a peek at that furry hole just below his balls that bounce in time to his stroking. His chest is massive and well defined with a light coat of fur he keeps short. His dedication to the gym is obvious and well worth the effort. He jacks his cock getting it nice and hard and even gets up on his knees to show off that hot ass of his. Fortunately he's versatile and isn't against getting that hot ass fucked if he finds a man masculine enough to deserve it. He spreads that ass open as he fingers it a bit making him even hornier. He flips back around and lies on his back as he goes back to jerking off his massive meat while paying attention to his hot hole. All the attention he's giving his fat cock is making his balls tingle and it won't be long before he needs to nut. He stands and gets busy jerking off fast and hard wanting to shoot his load. His breathing starts to labor as his fist becomes a blur on his cock. He lets out a soft grunt as he unloads, sending thick stream after stream of cum splattering all over the glass below. ...Somewhere, there's a cannoli missing it's cream.",
  "models": [
    {
      "name": "Fabio Stallone",
      "person_id": 28073
    }
  ],
  "release_date": "2012-09-13",
  "scene_id": 54286,
  "series": "Stallone Alone",
  "tags": [],
  "title": "Stallone Alone, Scene #02"
}