{
  "collections": [
    "Men Over 30"
  ],
  "description": "Well gentlemen, have we got a treat for you this week as we welcome back none other than Fabio Stallone. For those of you who missed Fabio's solo last week, this Italian demigod is 32 years young and packs a rather impressive sausage. Unhinging jaws might come in handy trying to handle this piece of meat. Our members unanimously begged for more and who are we to deny them? We found the perfect hottie, that's just a little bit Italian and a whole lot of Bayou, that fit the bill. Ethan Slade makes his debut with us here and Louisiana definitely did a wonderful job making all this happen. Ethan attributes his sexy look to his Native American and German ancestry as well as a LOT of Italian in there as well. Well, he's gonna have a lot more Italian in him soon enough. We asked these two studs which country they feel has the hottest men. Fabio loves Spanish men. Oh those boys in Barcelona.  Ethan can't decide on a certain country but just admires well defined athletic men regardless of where they're from. Ethan rarely bottoms and Fabio appreciated the struggle it took to get his dick in there. 'It was good' Ethan blushes 'I might let him get it again.' Oh my, what have we done!? These two are getting to know each other on the couch as Ethan tells Fabio he loves his accent. 'How do you say you're hot?' in Italian he grins as Fabio replies with 'Ce bello'. Ethan smiles before asking Fabio how he would say 'Kiss me'. Fabio is more into action than words as he goes in for that kiss Ethan really wants. They make out a bit before Ethan realizes the tent that's developed between Fabio's legs. He goes down as he starts to lick and nibble on it through his soft shorts. It feels massive and he can't help but need a closer look. Fabio stands up and gives Ethan all the freedom he needs as Ethan gets on his knees and continues to lick and tease that bulge. Fabio takes off his tank showing off that amazing body as Ethan finally hauls out his fat cock. Fabio moans as Ethan gets that dick down his throat. He laps inside that thick foreskin making Fabio shiver with desire. He knows just what to do with that fat cock as he repeatedly takes it down his throat. Ethan is pleasantly surprised as he reaches around and discovering that impressive, firm ass as he uses it to push that dick even deeper into his throat. Ethan then stands and licks his way back up to Fabio's full lips. They continue making out as Fabio takes his turn undressing Ethan and giving him some of the same.Ethan sits back as he watches Fabio on his knees deep throating his own hard cock. This Cajun delight packs his own party in those pants and Fabio is happy to help himself. Fabio then turns Ethan around and bends him over so he can taste that sweet hole. He buries his face in that smooth ass as he gets that tongue up inside him. As he does, we get our own amazing view of Fabio's hot ass on display.  Fabio then suits up and sits back as Ethan straddles his cock and impales himself on it. He starts to ride that monster cock slowly as he picks up the pace once he gets used to its girth. That fat cock is stretching that ass wide and Ethan isn't about to complain. He starts to buck back and forth on it loving the sensation.  Fabio then gets him on his feet and bends him over to get that hole doggy style. Ethan can only grunt and take it now that Fabio's back in the driver's seat. He slams that fat cock deep inside as his balls slap away at that hole. Ethan's own cock is rock hard the entire time he's getting fucked. He takes that dick like a champ before Fabio gets him on his back for some missionary. That does the trick as his fat cock pounds that prostate making Ethan cum all over himself as Fabio shoves it in even deeper. Fabio then pulls out and busts his own cannoli cream all over Ethan's chest and cum-covered abs. Now that's Italian.  ?Ciao, Bello!",
  "models": [
    {
      "name": "Fabio Stallone",
      "person_id": 28073
    },
    {
      "name": "Ethan Slade",
      "person_id": 28074
    }
  ],
  "release_date": "2012-09-20",
  "scene_id": 54288,
  "series": "Italian Lessons",
  "tags": [],
  "title": "Italian Lessons, Scene #02"
}