{
  "collections": [
    "Men Over 30"
  ],
  "description": "Forgive us for the Sinz we intend to revel in whole-heartedly as we indulge ourselves to even more Ricky Sinz. Yes Ricky is back this week as we welcome back the Windy City's inked, heart throb aged 31 years to perfection. Ricky is looking better than ever; and the only one happier to see him than we are would be 22 year old Tristan Sterling. Tristan is a Florida native from Orlando and he's a familiar face on our brother sites but today he becomes a member of the MenOver30 gang...by injection. We asked these two what their favorite type of cuisine is. Ricky likes Asian but admits he likes to eat strange things. He'll try anything. Tristan likes all kinds of food except seafood. As for favorite cuisine he likes Italian and Thai. Thai being one of his favorites, Tristan admits that he had one of his best dates ever that started at a Thai restaurant. As far as dating is concerned, Ricky's never had much luck. 'I can't think of any good ones, just bad shit' moans Ricky 'like losing my keys in China Town.' Well Ricky won't be losing any keys this afternoon. We're not that kind of studio. <evil grin>Tristan's hanging out when Ricky comes in to deliver a package. Tristan notices he's packing more than one as he reaches for the one in his pants. 'Oh you want a good package delivered!?' grins Ricky as Tristan hauls out his growing cock. He licks all over the shaft before sliding it all the way down his throat. No gag reflex has its privileges. Ricky moans as he grabs Tristan's head and starts to bob it on his rock hard cock. He can't get enough of that hot mouth on his dick as Tristan lands on his knees in complete submission to better worship that meat. Ricky skull fucks him deep and hard as he shoves every inch he can down Tristan's willing throat. Ricky then pulls Tristan up by his tank top and bends him over on the couch. He pulls down his shorts and spits on that hole before roughly fingering it. Tristan moans like a bitch as Ricky fingers that tight ass. He spits on that ass some more as he continues to work that hole making Tristan moan like a str8 girl. 'Spread that fucking ass!' Ricky orders as Tristan holds his ass wide open.Ricky then puts Tristan on his knees again so he can get his dick back in that mouth for more. His cock gets the service he needs before he turns around and offers that hot ass up for Tristan's tongue. Tristan buries his face up inside as Ricky tells him to eat that hole like a good boy. Tristan can't get enough of that ass as he stands up and slaps his cock on Ricky's ass. 'Think you're gonna fuck me, Bitch?' Ricky muses as he grabs Tristan and orders him down. Tristan whines as Ricky takes that ass hard. He slams that dick inside him as Tristan just moans uncontrollably. 'Fuck my hole!' Tristan begs as Ricky obliges. He pummels that ass giving him all the dick he needs. Tristan gets cocky ordering Ricky to fuck him like he means it. Ricky grabs him and hoists him into the air while still inside him and bounces him on his dick while standing up. Tristan's eyes bulge open as he gets that hole stretched wide open. Ricky, still fucking Tristan, sits down on the couch and orders Tristan to ride that fucking cock 'til he says otherwise. Ricky pounds up into Tristan so hard it makes Tristan cum. He shoots all over his happy trail as Ricky slams inside. One hot facial coming right up as Ricky then stands over Tristan's face and unloads his hot  cum all over Tristan's sweet face.",
  "models": [
    {
      "name": "Ricky Sinz",
      "person_id": 28041
    },
    {
      "name": "Tristan Sterling",
      "person_id": 28071
    }
  ],
  "release_date": "2012-08-30",
  "scene_id": 54281,
  "series": "Special Delivery",
  "tags": [],
  "title": "Special Delivery"
}