{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brenn Wyson is back in the house and you know it's gonna get hot up in here with this crazy Bostonian that makes 40 look effortless. His play mate today is from Virginia Beach and goes by the name of Josh Long. Josh is a furry str8 boy that at 24 is just getting started in the industry. We asked these two what their fantasy mode of transportation would be. Brenn wants a donkey. Go figure. 'Mine would be a little higher class' grins Josh 'mine would be a red Ferrari coupe'. Brenn then chimes in with 'I'd want a blue donkey'. We're not sure whether he's a fan of Eeyore or he just came out as a Democrat? We then turned the topic to sex. We asked them what they thought about public sex. Brenn loves it, he can't get enough of it. He likes swinger's parties and loves a lot of people watching him fuck. Josh, as innocent as he looks, loves public sex as well and his first romp in public was the back row in a school bus. Wrapping up: the most outstanding sexual moment they'd had was? 'Farrah Fawcett', says Brenn. Ooh boy! Josh's best was having sex while on a backyard trampoline. Hmm, crazy is contagious. We better get started before their unicorn shows up to take them back to Narnia.Josh is hangin' out reading when there's a knock on the door. Brenn lets himself in as he asks Josh where his Dad is. He's not around, so Brenn forces Josh to his knees. He shoves his face into his crotch as Josh tries to tell him he's str8! 'You like fuckin' dick!?' Brenn teases as he undoes his pants and shoves his cock into Josh's mouth. Josh can't help but suck Brenn's meat as Brenn bounces his head on his growing dick. 'That's a good little boy' Brenn coos as he gets all his meat down Josh's throat. Josh gags on that dick as Brenn gets more aggressive ordering him to do it right. Soon Josh gives in and is slowly slurping on his meat. 'I knew you'd like it' Josh swirls his fist around Brenn's boner as he works that dick. Brenn then gets him up and strips him down so that he can get some dick too. Josh sits back in all his furry glory as he watches Brenn go from dominant to submissive, slurping on Josh's growing meat. Josh can't hold still as he writhes in ecstasy as Brenn's tongue and mouth work his hard cock and hairy balls. Brenn then moves up and forcefully kisses Josh who gets caught up in the moment and kisses him back.  'You wanna suck my ass, little boy?' Brenn coos as he seizes Josh's apparent willingness. Josh feverishly takes to that ass shoving his tongue deep inside as Brenn bucks that smooth ass back all over Josh's face. Josh tugs on Brenn's dick as he tongue fucks that hole like its lunch time. All that tonguing gets Brenn horny for more as he sits Josh back and climbs aboard. Josh's dad might've done him a solid by leaving him alone since his absence has gotten him laid. Brenn rocks back and forth as he tries to get every inch of young Josh's dick up inside him. Brenn starts off in a reverse cowgirl position as he bounced on that dick but soon gets up and straddles him to lean forward into him and continue taking a pounding. Josh just moans as he grabs Brenn's ass and slams it down harder on his bone. Doggy is next as Brenn orders him to shut the fuck up and just fuck him. Brenn's getting that ass railed by Josh who's giving it to him as hard as he knows how. He's moaning and grunting over Brenn's groans and pleas for more. Missionary is going to take them home as Josh gives Brenn all the dick he needs. Brenn explodes all over his chest as Josh fucks the cum outta him. Josh then pulls out and unloads his own thick nut all over Brenn's cum glazed abs.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Josh Long",
      "person_id": 28070
    }
  ],
  "release_date": "2012-08-23",
  "scene_id": 54280,
  "series": "The Randy Daddy",
  "tags": [],
  "title": "The Randy Daddy, Scene #02"
}