{
  "collections": [
    "Men Over 30"
  ],
  "description": "Our members are in for a real treat this week as we pair up two hotties that really turned up the heat. Jesse Coulter is back and this 30yo from rural Kentucky is looking better than ever. Third time's the charm as we finally get Jacques LaVere on MenOver30. Jacques is 22 and from 'La Ville-Lumiere' in France. We're sure the City of Lights shines a bit dimmer since Jacques left Paris for the states bringing his donkey dick with him. Their loss is our gain, Jesse's in particular, as we get better acquainted with some rather filling French cuisine. (pun-ny, was it not?) With Halloween around the corner, we asked what each would wear, were they invited to a costume party. 'Edward Scissorhands' says Jesse who's pulled that one off before. We assume he means the look; though pulling off the costume sounds even better. Jacques would be Pinhead from Hell Raiser. Staying on point we wondered what their favorite candy was as a kid. It would be Skittles for Jacques; while Jesse loved his peanut butter and molasses Mary Jane. In closing we asked Jesse who has been successful in this industry if he had any advice to Jacques who is just starting out. 'Be yourself and build strong relationships in this industry' he advises 'you won't go far without that.' Solid advice for our newcomer; so-can we fuck now? Jesse's waiting on Jacques to come out of the bathroom so they can head to the beach. When he does make it out, Jesse realizes Jacques packing more than just lotion in his swim trunks. Jesse quickly kneels in front of the huge tent in Jacques swim trunks as he gets a closer look. He hauls out Jacques massive uncut cock and gets to work. He wraps his lips around it as he swallows every inch he can. Jacques moans in ecstasy as he watches his dick disappear into Jesse's hungry mouth. He holds Jesse's head still as he fucks his mouth wanting to shove his dick deeper into his throat. Jesse then gets Jacques to lie back on the chaise so he can better work that dick. 'Look at that big, beautiful dick!' he says as he slows it down to better appreciate it. He pulls Jacques thick foreskin forward and shoves his tongue inside it lapping up his precum as he drives Jacques crazy. He swirls his tongue around his knob making that fat dick dance in his mouth as Jacques gets lost in the sensation engulfing his throbbing cock.Jesse savors that dick and as he runs his tongue up to explore Jacques smooth abs and pecs Jacques starts to finger that ass. That's all it took for Jacques to get behind that ass and ram his hard dick inside. Jesse grunts as he tries to accommodate that fat dick inside him as Jacques gets right to pounding that hole. He holds Jesse by the waist as he rails his meat deep as Jesse groans, taking every bit of it. Jesse, still in his jock strap, is getting exactly what he wants as he gets that hole pounded fast and hard. They switch things up as Jacques lies back on the floor and has Jesse sit on his dick. Jesse groans and whimpers as he starts to ride that cock telling Jacques just how good it feels buried inside him. That just gets Jacques hornier as he starts to jack-rabbit that fat dick up into his ass even harder. Jesse reaches around and plays with Jacques nuts that are packed with cum he'll get soon enough. Missionary is next as Jacques gets those legs in the air. Jesse is whimpering awash with pleasure and pain as Jacques continues to plow his hole. Jacques dick slides inside that worn ass with ease as he sends Jesse over the edge. He shoots all over his abs and chest as Jacques pulls out and follows suit. Jacques stands over Jesse as he jacks off and bathes him in his cum.",
  "models": [
    {
      "name": "Jacques LaVere",
      "person_id": 28077
    },
    {
      "name": "Jessie Colter",
      "person_id": 28064
    }
  ],
  "release_date": "2012-10-18",
  "scene_id": 54296,
  "series": "Ready for Something!",
  "tags": [],
  "title": "Ready for Something!"
}