{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brockton's own Brenn Wyson is back in the house and we can't wait to see what he has in store for us this week. After Brenn's last appearance, where he put Sebastian Keys in check while aggressively redecorating the set, our members have been begging for more. Sometime being left to your own devices is a good thing. In Brenn's case, it's ideal and this week's handsome addition to the MenOver30-by-injection club is about to find out. Sean Duran, a sexy 24yo from Charlotte, NC, is in for a real treat. All Hallows Eve came but a moon ago (just go with it)...so we wondered what these trickster's favorite costumes have been in the past. Brenn loves dressing up as Dracula while Sean liked being a skanky devil. Hmmm. We asked them if they had Trick or Treaters stop by tomorrow night catching them unprepared, what they could expect to walk away with. 'An egg in the face!' laughs Brenn; who quickly assures us he's (mostly) 'kidding'. Sean follows that gem up with this, 'An apple', he beams, 'because I'm always an advocate for children's health.' Yeah we're totally egging this kid's house later. LOL Well enough about Halloween trickery lets leave these two to figure out what treats are still left to be had. And by 'had' we mean...well, you know! Sean is texting on the couch looking for some action when Brenn comes home and catches him in the act. 'Who you fuckin' texting?' he barks as he takes the phone away. 'This is what you should be taking care of' as he undoes his pants and instructs Sean to pull them down and to get on that dick. Sean swallows that cock all the way to the hilt as Brenn starts to fuck his pretty face. Brenn's rock hard as he gets his cock serviced. 'Look at me!' he orders, holding Sean's head in place as he slides that cock down his throat repeatedly. He slows it down to enjoy the view as Sean worships his thick cock. Brenn then pulls Sean up off the floor before pushing him back onto the chaise where he strips his pants off. He takes out Sean's cock and gives him a little of the same as he swallows Sean's hard cock. Sean is well defined and like Brenn has his share of tattoos that just add to their charm. They then work their cocks in a hot 69 so that they both get more of what they want before Brenn gets his tongue up Sean's ass. He slaps that ass as he rims it deep getting it ready for more...Bent over on the chaise, Sean grunts and bears it as Brenn slides his fat cock deep into Sean's hairless hole. He knows what he wants and gets right to pounding that ass as he hammers his dick deep into Sean's gut. He forces Sean to bend lower so he can mount him harder. Brenn lays on top of a face down Sean and pistons that cock deep. His balls slap away at that ass as he gives him every thick inch he can take. Brenn then pulls out and sits on a basketball as he gets Sean to straddle him and sit on his dick. Suddenly Basketball got a lot more interesting as Brenn dribbles Sean's tight hole up and down on his dick. They make out as they fuck and Brenn eventually gets Sean on his back as Brenn continues to fuck that ass still sitting on the ball. He holds Sean's legs up as he gets to it and pounds that ass missionary. He needs to bring it home and he gets Sean on his side and slides his cock back inside for more as he pounds him harder. Sean can't help but jack his throbbing cock and is soon sending his massive load all over the rug and himself as Brenn fucks every drop out of him. Brenn then gets on his knees and unloads his own massive nut all over one incredibly satisfied Sean.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Sean Duran",
      "person_id": 28079
    }
  ],
  "release_date": "2012-11-01",
  "scene_id": 54299,
  "series": "Get On This Dick",
  "tags": [],
  "title": "Get On This Dick, Scene #01"
}