{
  "collections": [
    "Men Over 30"
  ],
  "description": "Ginger alert! This week we've doubled up as we welcome back Puerto Rican hottie Steven Ponce and his co-star, on and off camera, Mr. Brian Bonds. These two have been together almost a year and just moved in together less than a week ago. This is their first scene together and we're glad we get to be the ones to film it. They met last year at Gay Days in Orlando. Steven knew he was interested as soon as his friend Jason introduced them. As luck would have it the stars aligned and here they are. Steven loves Brian's honesty and confidence. He also appreciates his humility. Brian loves Steven's drive. He doesn't take shit from nobody and when he sets his mind to something he just goes for it. Physically Steven loves Brian's eyes. Brian loves Steven's eyes and ass. Hmm. They are looking forward to this shoot since it's going to be very easy to forget that the cameras are even in the room. When we ask about how they deal with what they do and maintain their own intimacy without the jealousy, they both agree that 'work is work'. At the end of the day they know who they're coming home to.  Steven and Brian are toasting to finally moving in together. Once they toss back some bubbly they look at each other and the fireworks begin. They start to make out as they grope each other each one helping the other out of his clothes. Steven slides onto his knees as he laps at Brian's growing cock as it strains to get out of his briefs. Brian just gasps as Steven pulls it out and takes it in his mouth. He sucks on that cock hard and deep as he slides it down his throat. Steven gags on it wanting to take it all down as Brian just watches his lover service his meat. Brian then gets Steven on the couch and kneels before him as he sucks on his toes and licks his feet. Steven plays with Brian's hard on with his feet before Brian goes down on Steven's cock. Steven is rock hard as he finally gets the attention he needs on that cock. From there they take the festivities to the floor as Brian gets on all four and shows off that spectacular ass. Steven gets right to work eating that ass as he buries his tongue deep inside that smooth hole. He tugs on Brian's cock as he buries his face deep into that ass wanting to get as deep as he can.Brian then gets on the floor and has Steven squat on the couch so that his ass lands on his face. Steven then rides his beau's tongue as Brian eats that hole deep. Steven writhes in ecstasy as he gets tongue fucked and hornier for much more than that hot tongue in his hole. Steven gets off the couch and sits right down on Brian's hard cock already waiting for him. He impales himself and starts to ride that dick as he bounces up and down on it. They fuck passionately as Brian slams his dick up into Steven before moving onto the floor as he lays Steven down and keeps tappin' that ass lying behind him. Steven jacks his fat dick as he watches Steven fucking that ass. Steven then sits back down on Steven's meat as they make out and Brian bounces him on his hard cock. Steven grunts as he gets that ass plowed deep. Brian lies back and plows Steven even harder as Steven goes over the edge blowing his load all over Brian. He then gets down and makes out with Brian as he helps Brian bust his own huge wad all over his cum-covered chest as jet after jet of cum shoot all over his abs and chest.",
  "models": [
    {
      "name": "Brian Bonds",
      "person_id": 28078
    },
    {
      "name": "Steven Ponce",
      "person_id": 27969
    }
  ],
  "release_date": "2012-10-25",
  "scene_id": 54297,
  "series": "Happy Anniversary Baby!",
  "tags": [],
  "title": "Happy Anniversary Baby!, Scene #01"
}