{
  "collections": [
    "Men Over 30"
  ],
  "description": "Today we have a sexy 34yo from South America by the name of Angelo Marconi. Angelo is a beefy daddy that puts in his time in at the gym. He was born south of the border but came to the states at the age of 11. He went back once since then about 10 years ago.  He doesn't remember much from where he was born; but he does miss family he left behind. He has traveled extensively and if he had to pick a favorite out of all of his destinations he would have to say he loves Italy the most. What is it about those Italian men? Hmmm. When it comes to hot men, Angelo usually prefers white and European guys. He doesn't have a preference on whether they are hairy or smooth as long as they have hair somewhere. He prefers guys about his age or older because at the end of the day when all is said and done, experience is always the best thing. When it comes to crazy sexual encounters Angelo was in a Jacuzzi with his partner at a get together when a wet spontaneous orgy broke out giving the concept 'Party of Five' an entirely new meaning. This one's not as innocent as he looks-and we wouldn't want him any other way.Angelo is working on his pecs doing push ups in his room. Once he's done he realizes his pecs aren't the only muscles getting larger. He rolls over onto his back and slips his hand into his shorts. His cock is growing as it comes to life wanting attention. Angelo strips out of his tank top and shorts and gets to work on his cock. He writhes in ecstasy as he strokes his aching cock. His body is naturally smooth and he puts in a lot of time at the gym. He strokes his dick fast as his balls bounce around. As he jerks with one hand his other hand makes its way to his smooth ass. He starts to finger that smooth hole as he rubs his hole with his finger tip making him moan for more. He slides that thick finger deep inside that ass making him moan and groan loving the pleasure it gives him. He lies back against the couch as he continues to jerk his dick. He then stands up to give us a better view of everything he has to offer. He knows that hot ass of his is what makes men the weakest, so he gets on his knees and bends forward. He spreads those muscular cheeks apart before burying his fingers deep into that snatch. He loves getting that hole stretched and it makes his cock throb with anticipation. Once he feels that load getting closet he gets on his feet and jerks his dick off faster. He finally unloads, blasting his thick cum all over, sending thick strands of thick white glue splattering all over the chaise below.",
  "models": [
    {
      "name": "Angelo Marconi",
      "person_id": 28075
    }
  ],
  "release_date": "2012-10-04",
  "scene_id": 54291,
  "tags": [],
  "title": "Working It Out, Scene #01"
}