{
  "collections": [
    "Men Over 30"
  ],
  "description": "'Strangelove'. Will you take the pain; I will give to you, again and again?and will you return it? Depeche Mode sang about it; and this week we get to explore it. In order to do so, we intend to leave 40yo Brenn Wyson to his own devices. Brenn's in for a real treat as we pair him with a like-minded accomplice, 22yo Sebastian Keys. Sebastian loves it mild to wilder; and today we're going to let these two get as wild as they want. Buckle up boys, it's gonna be a bumpy ride. No need to pose! 'Standing and Modeling' isn't on the menu today. We wondered when these boys first got the urge to get into S&M. Sebastian was always curious to try it; but never had the balls to until he got a chance to on set. He loved it from the minute he tried it and has continued to do it both on set and in his personal life. Brenn's first experience was growing up when he had a man take total advantage of him in High School, smacking and beating him, forcing him to do all sorts of things. That was until Brenn flipped it on him; overpowered him; beat and then fucked him instead. Brenn's been into domination ever since. Brenn loves to find submissive bottoms that aren't about getting pain but about getting pleasure. Sebastian agrees and adds that a dominant top has to be skilled in reading their submissive and know just how far to take it.Sebastian is alone and so horny he's decided to put a fat dildo he finds to good use. He slides it deep inside that hot ass of his as he starts to fuck himself with it. He shoves it all the way inside and gets caught by Brenn who walks in on him. 'You're gonna use my fucking toys staying in my house?' Brenn barks as he pulls that dildo out of his ass; strips Sebastian's pants off and orders he put his legs up. Sebastian complies immediately as Brenn kneels between his legs and shoves that dildo deep inside that hungry hole. 'You like using my toys, you lil bitch!' he taunts as he starts to lick that hole he's fucking with that thick toy. He plunges that dildo in and out as he gets to work sucking on Sebastian's cock and balls. He holds the dildo in place and orders Sebastian to ride it. Sebastian squats up and down on it with ease as Brenn whips out his own cock and feeds it to Sebastian. He grabs hold of his head as he slaps his face around before shoving his dick down that throat. 'Take it, you fucking little whore!' Brenn grunts before slapping his face and chest some more. Sebastian groans loving every bit of it. Brenn gets him on his knees and orders him to sit on that dildo while he sucks that dick. Brenn totally has Sebastian under his control as Sebastian totally submits to his dominant energy. Sebastian then gets on all four as Brenn bites that dildo and fucks that hole with it. Brenn loves to watch as that hungry ass just swallows that thick toy. He slaps that ass hard as he fucks it. Brenn slaps at Sebastian's nuts as he winces in pain and pleasure. Brenn then suits up and slides the real thing inside that hot ass. He goes right to work fucking that hole as he orders Sebastian to pull on his nuts while he fucks that ass. Brenn leans down to tell Sebastian he's being a good boy as he spits in his face. Brenn mounts that ass hard as Sebastian takes a pounding. Brenn then gets Sebastian by the neck as he pins him to the wall. He hoists him up and shoves his dick into him as he carries him. He bounces Sebastian on his dick up against the wall before turning him towards the side table knocking everything off of it as he continues to take that hole. From there they take it to the floor where Brenn brings it home missionary fucking that ass with that dick and a double headed dildo at the same time. Sebastian explodes all over himself before begging Brenn for his hot load. Brenn pins his head to the floor as he busts his nut all over Sebastian's face as he holds still like a good boy.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Sebastian Keys",
      "person_id": 27966
    }
  ],
  "release_date": "2012-09-27",
  "scene_id": 54290,
  "tags": [],
  "title": "Glutton for Punishment, Scene #02"
}