{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a familiar face back and a blast from the past here on MenOver30. Joe Parker is back in the house with that handsome face, big guns and even bigger dick. Joe is helping us welcome back Brant Dickson. The chemistry is great between them. Joe loves Brant's beautiful eyes while Brant is in lust with Joe's big arms. They've both been taking care of themselves. Brant's been living it up, trying to work out as much as possible and has been able to put on some muscle mass since the last time we saw him. Joe's always looking delicious and he's mostly a home body. We wondered if they could go anywhere in the world where it would be and who they could take with them. Brant would want to go on Safari to South Africa and he would want to take his Dad with him. Joe has always wanted to go to Bali but recently his interests have shifted to Sydney, Australia instead. When it comes to being men of a certain age, we asked them what the best thing about being over 30 is. Brant says that with age comes experience and Joe agrees that with the years gone by you gain a level of maturity and experience that allows you to better express yourself sexually. 'Express Yourself!'-that sounds oddly familiar.Joe walks in to the locker room and finds Brant admiring a jock strap that's hanging off an open locker. 'Is that yours?' Joe asks as Brant tell him it's not his. He has his on but he really likes it. Joe pulls Brant's shorts towards him as he peeks into his pants and tells him he likes his instead. Need we say more? The two start to make out. Their hands start to roam all over their bodies as Joe's tongue explores Brant's smooth pecs. Their shorts get pushed farther south until they hit the floor leaving them in their tight jock straps. Brant takes the opportunity to get a better grasp of the situation as he kneels and takes Joe's big cock into his mouth. Joe grunts as he revels in the warm sensation now engulfing his hard cock. Brant bobs his head up and down on Joe's throbbing cock taking as much of it as he can down his throat. Joe then gets Brant up so that he can go down on Brant's cock. He sucks on that dick getting it rock hard before turning Brant around and getting him bent over towards the locker showing off that ass.Brant moans as Joe's tongue slides deep inside him. His head writhes from side to side as Joe eats that hot hole out. Brant is getting hornier for more than that tongue and he isn't going to have to wait for long. Joe stands up and suits up before sliding his fat cock into that spit-lubed hole. Brant grimaces a bit as his ass slowly gives in. 'Fuckin' great hole' Joe coos as his thick cock slides all the way inside. He starts to fuck that ass with ease as Brant takes every inch of it inside him. 'You like that cock' Joe taunts him as he buries his face in the back of Brant's neck as he fucks him deep. Brant bucks that hot ass back onto Joe's dick wanting to get every inch inside. Joe then pulls out and sits back on the bench and has Brant ride his meat. Brant straddles Joe and impales himself on that same dick as he starts to ride it with the same conviction. Joe holds him by the waist as he helps bounce him on his meat. Missionary is next as Joe gets Brant on his back before sliding his fat dick inside for more. Brant's begging for more as he gets that ass stretched. That cock does the trick as it hits Brant's sweet spot making him bust his nut all over himself. Joe slams inside him making him cum harder before pulling out and unloading his own batch all over Brant's cum-covered chest.",
  "models": [
    {
      "name": "Brant Dickson",
      "person_id": 28039
    },
    {
      "name": "Joe Parker",
      "person_id": 28044
    }
  ],
  "release_date": "2012-10-11",
  "scene_id": 54294,
  "series": "Jocked and Loaded",
  "tags": [],
  "title": "Jocked and Loaded, Scene #02"
}