{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have a furry surprise for our members this week. We're sure many will be pleased to see, none other than, studly Joe Parker back in the house. Joe sporting a sexy beard is originally from Philly and he's now 32. Joe's playmate today is a new face by the name of Adam Star. Adam is a local boy and looking forward to today's madness. Adam will be a the latest member of the MenOver30-by-injection club and at just 20 he has so much to look forward to-Joe's fat cock for one! We asked these guys if they remember their first crushes. Joe's first crush was in kindergarten while Adam's first crush wasn't until the 6th grade. These days, boys are coming out earlier than the generations (...that apparently had to walk 3 miles in the snow to do anything) that preceded them. Joe came out in the 9th grade. He wasn't alone; he had several lesbian friends. He remained popular; had lots of friends and even some trophy jerseys from the sports teams. Adam never had an official 'Coming Out' fiesta, but it was around the 3rd grade that he started identifying himself as gay. When it comes to what each of these studs like it's what makes them perfect for today's festivities. Joe loves a hot ass; and Adam loves a big cock. Go figure!Joe comes home real quick and doesn't have much time but knows he promised Adam some lunch. He drops the take out bag and pulls down his pants. 'You wanna get busy real quick?' he grins as Adam gets on his knees. Joe's fat cock gets hard in Adam's mouth as he gets all that dick down his throat. He runs his tongue from the bottom of Joe's nut sack all the way up along the shaft 'til he reaches his throbbing knob. Joe's moaning in ecstasy as he watches Adam go to town on his thick meat. Adam knows exactly what Joe needs as he swirls his tongue along the underside of his shaft. Joe's cock is rock hard as Adam worships every inch of it. Joe then decides he could use that tongue elsewhere as he turns around and presents the next course-tossed salad. Adam dives right into that hairy ass tongue first making Joe writhe with pleasure. He spreads his cheeks wide open to give Adam access to his hole. Joe then turns back around and puts his dick back in that mouth so he can get rock hard for what's next on the menu. Adam has some hot set of buns and Joe intends on stuffing it full of Philly, Philly meat that is. He bends Adam over the couch and slides his thick cock inside as Adam moans for more. 'Who's your bitch!?' Adam whimpers as Joe's thick cock stretches that hole wide open. Joe takes that ass doggy style burying his dick deep inside. Adam can't get enough as he bucks back on that pole and begs for more. Joe obliges and pounds that hole hard just the way Adam wants it. Joe then gets Adam on his back and slides his pole back into that submissive hole missionary. Adam is moaning and groaning as he gets that ass pumped. Joe holds his legs up in the air as he watches his dick disappear sliding deep inside that hungry hole. Adam takes it like a champ as he tells Joe just how good it feels. Joe then pulls Adam forward as he leans back. Adam is now sitting on and riding Joe's cock. They make out as Joe bounces that hot boy hole on his fat meat. That cock is getting milked by that tight hole and his balls are beginning to feel that familiar tingle. He lays Adam back and pulls out wanting to bust his nut all over his face. Adam closes his eyes and braces for his reward as Joe jacks off his thick nut all over Adam's pretty face leaving it a glazed mess.",
  "models": [
    {
      "name": "Joe Parker",
      "person_id": 28044
    },
    {
      "name": "Adam Star",
      "person_id": 28082
    }
  ],
  "release_date": "2012-11-21",
  "scene_id": 54308,
  "series": "Rush for Lunch",
  "tags": [],
  "title": "Rush for Lunch, Scene #02"
}