{
  "collections": [
    "Men Over 30"
  ],
  "description": "Angelo Marconi is back after popular demand. Angelo is 33 years old and from Los Angeles. Angelo is smooth, ripped, sexy and definitely turned up the heat, just as the temperatures were beginning to dip, with his steamy debut solo last month. We've been bombarded by requests to see more and that's just what you're gonna get today. Back from the past is a local native we haven't seen in a few years, Andrew Blue. Andrew is 25 now, looking hot as hell and we're happy to have him. The weather down here has been a bit wet thanks to the hurricane barreling by just off our shores so we wondered what these two studs like to do when they're stuck indoors. 'Sex, sex, sex' is Andrew's go to while Angelo loves to eat. Is he KIDDING? Moving on, we then wondered how they would compare their off screen sex lives to the sex they have onscreen. They both agree that the sex at home is about the same though not having to worry about the cameras and positions is nice and because they know who they're being intimate with at home it's usually a lot more passionate. Passion and chemistry are both incredible accelerants and they don't always come together on set. Well, today we won't have to worry about that with these two. They've been eyeing each other all morning ...Shall we? Andrew is home waiting for his food to be delivered when he hears a knock on the door. It's Angelo in jeans and a tight tee. 'Damn you look good' Andrew gushes 'if I eat healthy will I look like you?' Angelo grins as he mumbles a 'maybe' as Andrew starts to feel his chest. Angelo isn't about to stop him as Andrew lands on his knees and starts to fumble with his pants. Andrew soon has Angelo's growing cock out of his pants and inside his mouth. Angelo moans as he gets that dick of his sucked. Angelo's body is a smooth cinnamon canvas and, except for a short-cropped bush, he's naturally smooth. He watches as Andrew worships his cock looking up at him as he takes every inch down his throat. Andrew then stands up and drops his shorts jeans and hauls out his fat cock. Angelo is more than willing to return that favor as he wraps his lips around Andrew's thick cock. Andrew fucks his face for a bit before sitting back and getting comfortable as Angelo makes a meal out of his thick dick. Angelo slaps that hard cock against his tongue and shoves it so far down his throat he gags on it. Andrew is smooth, tattooed and has a thick beefy frame that just adds to his bad boy charm.Once Angelo is ready to get that dick 'delivered' he gets on all four; arches his back and moans 'Fuck me'. He spreads those muscular cheeks wide open as he plays with his hole teasing Andrew. Andrew gets in on that action as he kneels behind that ass and starts to finger that hole. 'I don't want you teasing me' Angelo coos, 'I want you inside me!' Angelo doesn't have to be told twice as he presses his rock hard cock against that hole and slides inside. He gets that dick all the way inside that hot as and starts to tap that ass doggy style. Andrew just slides that cock in and out of that tight ass with ease as he buries his dick inside over and over. Andrew then gets Angelo to bend over on the chaise and slides his dick back inside that hungry ass. Angelo can't contain his desire as he just begs Andrew for more. Andrew's smooth balls slap away at that smooth hole as he uses that tight ass to milk his throbbing cock. Missionary is next as he puts Angelo on his back and gets busy fucking that ass hard and deep. Angelo can't help but jack off as that fat dick slams into his prostate. He unloads all over his chiseled abs as Andrew fucks him deep. Andrew then pulls out and busts his own load, sending jet after jet of thick cum splattering all over Angelo's lean, cum-soaked navel.",
  "models": [
    {
      "name": "Angelo Marconi",
      "person_id": 28075
    },
    {
      "name": "Andrew Blue",
      "person_id": 28081
    }
  ],
  "release_date": "2012-11-15",
  "scene_id": 54306,
  "series": "Dick Delivery",
  "tags": [],
  "title": "Dick Delivery, Scene #02"
}