{
  "collections": [
    "Men Over 30"
  ],
  "description": "The Man, the Myth and of course the 'Girth' of it all has come a'callin to MenOver30 now that one of ExtraBigDick's finest, Girth Brooks turns the Big 3-0!  Having just turned 30 this past summer it's nice to have more ways to enjoy him. Girth is from Massachusetts originally but lives in Florida now. With the recent political climate and the recent elections we discovered that Girth loves all the debates and has been following things since the GOP elections and likes being very involved in the process. Girth is hung and considers himself to be str8 even though he's open to things that make that big dick of his feel great. He's become more comfortable in his skin and as he starts to charter his thirties that will come in handy. Girth is currently single and enjoying the freedom that being a man-whore affords him. Girth likes tiny, fit girls that are short with a nice ass. He's also attracted to women that are nurturing and affectionate since he wants to have a family someday. Well, that may be down the road a ways; but today we're all about 'Man-whore' Girth who has done everything he's ever wanted to do sexually... <lucky fuck!>Girth's at work trying to get stuff done but unable to concentrate with his dick standing at attention in his slacks. He gives in and decides to take care of business in the break room. He locks the door and strips off his suit and shirt as he fondles his fat cock through his pants. He unzips them and after squeezing that fat cock through his briefs he takes it out, giving it the breathing room it needed. Girth's cock is extra fat and rock hard in his hand as he starts to stroke it. He sits back on the couch and keeps playing with his huge boner as he moans with delight. He strokes his cock dry for a bit before spitting on his knob a bit. He uses a porn rag for inspiration as all the images of tits and snatch get that dick hard. He lubes up and gets to work on his meat making it much easier to pleasure himself. His cock is throbbing by the time he stands up to give us a better view. He bends over to show off that hot ass we'll never get a crack at. (...pun intended) He spreads his smooth ass cheeks apart as he pushes his hard cock back so we can see everything on the menu. Girth's hairy chest is trimmed short and his body is looking better than ever. He stands up and gets back to work stroking that cock as the camera slides beneath him to give us a better view of those swollen nuts and fat cock getting ready to unload. Girth picks up the pace feeling that familiar tingle in his balls. He grunts as his cock explodes sending his thick load splattering everywhere and just inches above our lens. He squeezes out every last drop finally giving his cock the relief it begged for. Whew!",
  "models": [
    {
      "name": "Girth Brooks",
      "person_id": 28083
    }
  ],
  "release_date": "2012-11-29",
  "scene_id": 54309,
  "series": "Working Stiff",
  "tags": [],
  "title": "Working Stiff"
}