{
  "collections": [
    "Men Over 30"
  ],
  "description": "We have the boyish charms of Joey Cooper on set today as we ask him to join the MenOver30-by-Injection Club. Well Joey took one look at 30yo Jace Chambers and his thick Carolina cock and was more than happy to help. Joey is 23yo and now lives in Fort Lauderdale. Jace knew he had a bigger dick than the rest of his friends early on. This wasn't hard to deduce since his cock has been just above 8' since he was 12. Jace's grin says all we need to know about the trouble that got him into. Fortunately Joey is a fan of the endowed and his largest conquest was a fat 10' cock he manages to make a meal out of. We then decided to test the waters with these and asked what their hottest online hook up has been. Jace picked up some trade online and met up and ended up fucking him on the hood of his car in the parking lot. Joey one-ups him with a Brit and another bottom in a steamy three-way. Didn't see that one cumming. Joey met them both individually online and made it happen getting the hot Brit to top them both. All that AND a party planner?! Watch out boys! Well, for now it's going to be a party of two. So let's get this one started...Jace is cruising on his phone when he gets a knock on the door. It's the hook up he ordered. Ya gotta love modern technology. Joey goes to greet him as Jace pulls him in for a kiss. They start to make out as their shirts start to come off and their tongues start to roam. Joey licks that chest as he heads south to see what's waiting for him. He undoes those jeans and once he does Jace's fat cock springs out at him. He's rock hard and ready for attention. Joey knows just what to do as he starts to worship that cock. Jace fucks that pretty face with ease as Joey takes as much of that 9' cock down his throat. Jace then gets Joey's pants off so he can get some dick too. He sucks on Joey's cock as Joey watches his meat disappear down Jace's throat. Joey moans as he gets that dick worked but soon wants more of Jace's for himself. He gets him up on the chair so he can get more as he gets back to swallowing as much of that cock as possible. As he slides that dick down his throat, Jace leans forward and starts to explore Joey's smooth ass. He can't resist it. He spreads those beefy cheeks apart as he starts to finger that pink hole. Joey moans and wants more. He gets up on the chaise as Jace lifts his legs and dives in tongue first. He eats that hole deep until Joey begs him to fuck him. Jace isn't about to play hard to get as he immediately slides his fat cock into that spit soaked hole. He glides in ball-deep as he starts to fuck that hole nice and steady. Joey's in ecstasy as he gets that hole stretched wide. Doggy is next as Jace gets Joey on all four. His heavy balls slap away at that ass as he picks up the pace. Joey isn't done as he gets Jace to sit back so he can ride it some more. He impales himself on that cock again and starts to ride that cock hard. He has that hard cock hitting him just where he wants it as his cock erupts all over Jace's smooth chest. Jace then pulls out and jerks his own fat load all over his cum soaked pecs.",
  "models": [
    {
      "name": "Jace Chambers",
      "person_id": 28094
    },
    {
      "name": "Joey Cooper",
      "person_id": 28095
    }
  ],
  "release_date": "2013-04-04",
  "scene_id": 54302,
  "series": "Ass-Delivery",
  "tags": [],
  "title": "Ass-Delivery"
}