{
  "collections": [
    "Men Over 30"
  ],
  "description": "It's been 5 years since we've seen Peter Stallion on our brother site CircleJerkBoys. Now that this sexy Czech import is back making a rare appearance state side it turns out he's now lucky enough to be a member of the MenOver30 club. Peter is originally from Prague in the Czech Republic and these days he spends a lot more time behind the camera than he does in front of it.  At 34 years of age Peter has only gotten better with age. He's leaner and even more handsome if that is even possible. Peter got his start in porn by first doing large sex parties for horny women. That madness led to film opportunities and today is incredibly busy spending most of his time directing films and searching out new talents to film. Peter fucks just about everything from 18 to 60 years old. He's a total ass man and loves to just grab a girl and fuck her really hard and if he can fuck her doggy style that would be even better. Peter loves it when a girl can handle it a bit rougher so he can slap her around and have his way with her. Even in his personal life he likes her to know who's in charge. Today we get to see Peter in charge of the show as he gives us a refresher on everything 'Stallion'. -So, Saddle-up Gentlemen.  Wearing a tight tee and white shorts, Peter begins by pulling up his shirt to show off his smooth abs and flexes his pecs. He's leaned down over the last few years and in better shape than ever. He takes off his shirt and shows off his huge biceps, his obliques, his triceps and his well defined back. He's definitely been dedicating time at the gym and its paying off. He undoes his shorts and starts to play with that other muscle. You know the one, <evil grin>, as it starts to tent his briefs. He lets his shorts fall off as he slips his hand inside his underwear to tug on his uncut cock. He looks at the camera and gives us a grin as he jacks his cock giving it the attention it needs. Peter is naturally smooth and he keeps it that way. Peter peels off his briefs and shows off his throbbing cock. He then gets on the couch and bends over showing off that spectacular ass. His ass, also hairless, is perfection. It's beefy and muscular and winking at us as he plays with his cock and spreads those cheeks wide. He looks right at the camera with those bedroom eyes knowing exactly what you're thinking. (...but you're never gonna get it!) He then sits back on the couch; spreads his thick legs apart and goes back to work jacking that meat. He grabs his hard cock at the base and squeezes as his cock throbs inside its foreskin. He spits on his knob and picks up the pace as his smooth balls begin to pull up tight around the base of his cock. He gets closer to climax and as he does he gets on his feet to unload that meat. Our cameras take cover and get a great view of Peter's cum blasting wave after wave of thick load as it splatters all over the glass above. Let's hope we don't have to wait another 5 years for more Peter. ",
  "models": [
    {
      "name": "Peter Stallion",
      "person_id": 28080
    }
  ],
  "release_date": "2012-11-08",
  "scene_id": 54304,
  "series": "Czech Bate",
  "tags": [],
  "title": "Czech Bate"
}