{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brock Russell is back this week and it's a special treat as we welcome back Massachusetts' favorite son who is now 39 years young. This week we have another New Englander in the mix hailing from Maryland. Jake Steel is 24 and today we'll be exploring some long division to see how many times 24 can go into 39.  These two are getting along rather well so the chemistry is definitely working. We asked Jake what physical attribute he likes best on Brock. 'His big ol' dorky smile' is his answer. Brock blushes as he admits that was gonna be his answer for Jake. Brock decided to go with Jake's sexy bedroom eyes as his second choice to not be a copycat. When it comes to the single most important men that they are attracted to it varies person to person. Brock admits he's more of a cock man, though he starts off by noticing the face first. Jake is a tit man. He loves a good chest and works his way down as well after noticing the face. When it comes to hair it can go either way as long as it's groomed well and not an afro. Brock definitely agrees you need to trim your Chia pet. Well these boys are smooth, hot and ready-2-go! Let's do this... These two won't need any coaxing to get a little bit closer since the sparks have been flying since the moment they walked in the door. They can't seem to keep their hands off each other as they suck face. Jake gets right to unwrapping his present, peeling off Brock's shirt and feeling up on his smooth pecs. Brock returns the favor as he licks his way south on Jake's smooth chest and abs til he gets to what he wants-Jake's hard cock. He gets right to work as he swallows that dick. He has just what he wanted and it's halfway down his throat in no time. Jake watches as Brock worships his cock a bit before coming back up for air and more making out. They kiss passionately before Brock decides it's his turn and hauls out something for Jake to work on. Jake opens wide and takes Brock's cock into his mouth, nursing on it as Brock moans his appreciation. Brock's cock is rock hard as it disappears down Jake's throat. Jake's own cock is throbbing and soon ready for more. Brock then gets on all four and serves up that hot ass for Jake who already knows what he's having. He dives in tongue first and gets that hot ass nice and wet.Brock squirms as Jake eats that hot ass of his out, running his tongue from taint to the top. Brock's backing that ass up on Jake's face wanting way more than his tongue at this point. Jake gladly obliges as he gets into position and slides his fat dick inside and starts to fuck Brock doggy style. He gets right to work claiming what's his as he pounds that hole. Brock braces as he takes a pounding from his young and horny playmate. Jake watches as his dick disappears deep inside Brock's sweet ass. Jake then pulls out and gets Brock on his back so he can tap that ass some more missionary. He holds Brocks legs and pins them way above his head on the floor as he rams his cock in for more. Brock takes it like a man as his ass gets served up a-la-flexible. Jake has Brock's legs over his head as he makes out with him and buries every inch he can. Brock can't help but stroke his aching cock as Jake continues to slam his inside his tight hole. Brock holds back as long as he can before exploding all over his smooth abs and cock. Jake isn't far behind as he too unloads drenching Brock's cum covered cock and abs with a second coat of glaze.",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "Jake Steel",
      "person_id": 28084
    }
  ],
  "release_date": "2012-12-06",
  "scene_id": 54311,
  "tags": [],
  "title": "Steeling a Kiss, Scene #01"
}