{
  "collections": [
    "Men Over 30"
  ],
  "description": "Brett Bradley makes his debut with us on MenOver30 and he's a recent addition to the Club. Turning 30 is a definite right of passage and can go one of two ways for men once they reach it. Well, age isn't anything but a number to Brett so hitting the milestone didn't phase Brett one bit and he's definitely looking forward to his thirties. Brett is originally from Houston, TX. Brett has it pretty well in the 'packing' department and admits he noticed he had a bigger dick than the rest once he started taking showers in gym class and comparing equipment. Brett started messing around with guys at about 17 and he's very open minded when it comes to guys. At home he's more of a top man by choice and he doesn't mind at all. He likes when he ends up in bed with a guy that had every intention of fucking him until he hauls out his own cock and suddenly they want to be at the end of his cock instead. He considers himself to be adventurous in the bedroom and when it comes to sexual fantasies he has yet to try but wants to it would be a full on orgy. Well, that's definitely the best New Years Resolution we've heard so far. Brett is kicking back on the couch playing with the boner growing in his pants a bit before he slips his hand inside to arrange his hard on. It doesn't take long to realize he's run out of room and has to undo his pants to give his cock some much needed breathing room. He sits up and starts to tug and rub his cock through his briefs as he takes off his tee. His cock is now hard as a rock, its shape clearly outlined through its cotton confines. Brett gets up as his pants hug his ankles. Brett is lean and naturally smooth and keeps what body hair he has trimmed. He rubs his cock that by now is aching to be released. Brett finally pulls down the front of his briefs exposing his fat cock. His big balls are as smooth as the rest of him dangling just below his thick meat as Brett starts to jerk off. Brett then decides to show off his ass as he kneels on the couch and bends forward. He pushes his thick meat back towards the camera as he strokes his meat underhanded as it throbs just below his furry ass crack. Brett then sits down on the lounger; spreads his legs apart and starts to stroke his cock that by now is at full mast. His cock isn't only large but the girth on it could make anyone want to ride.  Brett sits back and works his lubed cock focusing mainly on his knob. He jerks his cock slowly and revels in the sensation as his balls start to tingle. He moves back onto the couch and jacks off faster. His breathing begins to labor and with a few guttural moans his cock unloads its thick cargo all over his smooth navel.",
  "models": [
    {
      "name": "Brett Bradley",
      "person_id": 28087
    }
  ],
  "release_date": "2013-01-31",
  "scene_id": 54317,
  "tags": [],
  "title": "Get Me Going, Scene #01"
}