{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have Florida boy Trey Turner back with us. This 24yo fan favorite is doing the honors of entertaining a hot ginger number that goes by the name of Christopher Daniels. Christopher comes to us from Las Vegas, Nevada and he's now 31. We asked these studs to tell us about the largest dick they'd ever seen and whether it was more decorative than practical. Trey has seen a 12' dick and chuckles when he admits that thing was definitely more decorative than practical. Step aside, you amateur, for Chris the biggest he'd seen an 11' dick and in his humble opinion, he found it to be plenty practical. He loved it every which way he did it which was like 20 different ways. When it comes to hair on their partners both of these appreciate hair on a man as long as they keep it trimmed not mangy. Wrapping things up we asked these boys to give us the one thing that really turned them on. Trey loves to rim while Chris loves to suck cock and service a guy. Hmmm, this could actually work. <evil grin> Shall we...These two started without us as they kiss and let their hands start to wander. No question on chemistry here. Chris' hand runs up Trey's thigh 'til he finds the hard cock he's in for. Trey stands and peels off his tee to give Chris something to work on as he licks Trey's chest and nips before heading south to start giving that hard cock a lot of the same. Trey moans as his hard cock disappears down Chris' throat as Chris does what he enjoys most. Chris easily tames that big dick sliding it completely down his throat. He's obviously done this before. (...an awful lot!) Chris then gets Trey on all four and puts that tongue to better use rimming Trey's hole. Trey is squirming as Trey tongue-fucks his ass. Trey loves the attention, but rimming is his thing. He flips the table and gets Chris on his back; holds his legs up in the air before shoving his face up into Chris' hot ass. Chris, still wearing his hot red jock strap, tugs at his cock as Trey shows him how it's done. He spreads those cheeks apart and gets that hole nice and wet. 'You ready for my cock?' He groans as he slides his cock inside. Chris gasps as his ass gets stretched open. He takes Trey's cock deep as he gets fucked missionary. That couch is rockin' as Trey pounds that ass hard. Trey then sits back and has Chris sit on his cock. Chris eagerly straddles Trey before squatting down on that cock for more. He bounces on that cock like he's riding a pogo stick as Trey moans his appreciation. Doggy is next as the party moves to the floor. Trey rails that ass fast and deep and it does the trick. As he gets close to climax he gets up and gives Chris a massive facial, drenching his face and outstretched tongue with his thick seed. Tasting that hot cum sends Chris over the edge as well as he busts his own nut all over the rug below as Trey slaps his cum covered cock on his face, Mmmm, milk. It really does do a body good.",
  "models": [
    {
      "name": "Christopher Daniels",
      "person_id": 32932
    },
    {
      "name": "Trey Turner",
      "person_id": 27927
    }
  ],
  "release_date": "2013-02-21",
  "scene_id": 54319,
  "series": "Afternoon Delight",
  "tags": [],
  "title": "Afternoon Delight"
}