{
  "collections": [
    "Men Over 30"
  ],
  "description": "Johnny Parker is freshly 30 and this hairy hottie from Arkansas proudly makes his debut on MenOver30. Johnny loves to keep that beefy body au natural and we ain't mad at him for wanting to leave all that sexy fur right where it belongs. Johnny, sporting a neatly trimmed beard and a big smile is rockin a sexy scruffy look. It's complemented by a sweet tattoo that wraps around his left bicep. He's not done with it. He knows he wants to fill in his shoulder completely then figure out how much more he'll add. Tattoos are addicting. Johnny is just waiting to find the right artist to make his even better. Johnny is recently partnered and he lucked out finding a guy just like the one he's always wanted: 'a guy with short hair; bit scruffy with lighter hair than his own; has a hairy body; knows his way around the gym and an all around good guy.' Wow that's pretty specific but when it's meant to be you can't fight fate. Johnny is versatile in his sex life, both on and off camera, and admits he loves the new 'on-camera' experience. Porn is always something he wanted to do; so he's gonna do it 'til he gets tired of doing it. Pfff!?who ever gets tired of 'doing it'? ...A regular jokester this one!Johnny comes home to find the place a mess. He starts to tidy up a bit and starts picking things up off the floor. As he reaches under the couch he pulls out a skin mag full of sweet young twinks with huge cocks. As Johnny flips through it his cock starts to stir in his jeans. This clean up can wait as he puts down the magazine and strips down to his briefs. His cock is rock hard and tenting his tighty-whiteys as he rubs his thick cock over its cotton confines. He continues to look at the hot guys playing with their boners and he can't help but haul out his own. He strokes his cock slowly, finally giving his cock the attention it's been craving. Johnny smiles right at the camera as he pleasures his meat. He then gets comfortable on the couch, pulling the magazine towards him as he slowly continues to stroke his hard cock. His free hand tugs at his heavy nut sack for a bit before slipping past it. His fingers dart further south making their way into his furry cheeks til they find that tight hole. Johnny bites his lower lip as his fingers breach his sphincter. His cock is throbbing as he plays and fingers that hot hole. His eyes roll back as he spreads those beefy thighs apart giving him better access to that sweet spot. His fingers work that hole and launch Mr. Parker into orbit. His eyes roll into the back of his head as his balls pull up tighter and then release their cargo. Johnny grunts as his load shoots sending jet after creamy jet spraying atop the fur canopy that covers his abs. Johnny then dips his fingers into the suspended cream and hungrily helps himself to most of it.",
  "models": [
    {
      "name": "Johnny Parker",
      "person_id": 28086
    }
  ],
  "release_date": "2012-12-20",
  "scene_id": 54313,
  "tags": [],
  "title": "Good Enough to Eat, Scene #01"
}