{
  "collections": [
    "Men Over 30"
  ],
  "description": "Alexander Garrett and Matthew Star will be steaming up the set on MenOver30 this week. Matt's sexy drawl only adds to this 20yo Southern Boy's charms and he's in for a real treat as our 35 year old Colombian import takes our Tennessee native for a walk on the wild side. Every once in a while you need to expand your horizons. We asked these studs where they would go if they had won an all expense trip anywhere in the world. Alexander would love to explore Asia. He would love to experience the exciting culture of Japan or China. The cradle of civilization is in Matt's sights; as he admits Greece has always been a dream destination for him. They both discovered their dicks at about 12 by accident while exploring their bodies. Both admit they thought something had gone wrong when they went off. Today, after years of experience, we are pleased to know that they have a handle on that situation. When asked what they are best at, Matt admits he is really good at giving girls oral. Alexander agrees and says he loves oral too. These guys may use different visuals when they jack off; but they have enough in common to make for one hot afternoon. Shall we...Alexander and Matt are hanging out as Alexander starts to coax Matt into a massage to help him relieve some stress. 'You know I don't go that way' Matt says before finally giving into a back massage. Alexander starts to rub his shoulders a bit before moving in for a kiss. Matt hesitantly gives in as they start to kiss. Matt stands as Alexander starts to grope his cock and pull off his underwear. Alexander then drops his pants and lets Matt get a better view of his own meat. Matt's eyes open wide as he slowly strokes that thick uncut cock.  'My God, it's so big' he marvels as Alexander's cock throbs in his hand. Alexander then goes to work sucking on the str8 boy's meat launching Matt into orbit. Alexander can't get enough of his thick cock and soon they are back to making out as they rub their hard cocks together. Matt then plays with Alexander's cock, stroking him for a few before his attention turns to that hot Latin ass. Matt gets into position as he slides his thick dick into Alexander. Matt looks down and watches as his cock easily slides in and out of Alexander's tight ass. Matt then sits back on the chair while Alexander straddles him for more. Once impaled, Alexander begins to ride that dick. His hot ass is milking Matt's dick and as he bounces up and down on that dick. That hot ass feels amazing wrapped around his cock. From here, Matt takes Alexander on the couch where he lifts up his jock legs and slides his dick back in missionary. Matt picks up the pace as his balls slap away at that hungry hole. It isn't long before Alexander's cock gives up its content. He unloads all over his defined abs. Matt then pulls out and jacks his own load all over Alexander adding to an already sticky situation.  ",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Matthew Star",
      "person_id": 27949
    }
  ],
  "release_date": "2013-01-24",
  "scene_id": 54315,
  "series": "Star Search",
  "tags": [],
  "title": "Star Search"
}