{
  "collections": [
    "Men Over 30"
  ],
  "description": "Rod Daily is back this week and its been a while since we've had Rod with us and we've decided to make it all about him this week. Rod is now 31yo and this delicious West Point New Yorker is looking better and better. Rod admits 70% of what makes his body the way it is would definitely be diet. He tries to be good but on occasion he cheats. He tries to go to the gym every day and admits he's hooked up at the gym once or twice. Probably working at the gym might've made that a lot easier. Rod's been doing this for a while and loves being recognized in public. 'All my fans are good to me' he smiles 'and I love seeing them out in public.' Rod first had sex with a girl when he was 14 and he didn't have sex with a guy for another 5 years. He loves it all now and doesn't discriminate as to what can turn him on. When it comes to what attracts him it is all chemistry. Rod is a dedicated lover and prefers to keep his lovin' off cam to one on one fun. He feels 3-ways are over rated and they don't always go down the way you'd think. Well, we've got this blue eyed hottie all to ourselves so let our one on one fun begin...Rod is lying on the chaise watching porn on his phone until his dick starts beggin for more room in his jeans. He flips over and starts to rub his growing cock. He pulls up his tee showing off his smooth abs that are perfectly defined. He feels his abs and chest as he gets more and more turned on. Rod's body is a canvas for a series of intricate tattoos that adorn his delicious hairless frame. He stands up as he undoes his pants to give his dick the breathing room it needs. He plays with it as it gets even harder through his sexy briefs. He finally slides those briefs south over his massive quads. His thick legs provide the support needed for the chiseled frame that Rod's worked so hard on. Rod then gets comfortable as he sits back on the chair, spreads his legs and lubes up his thick cock. He moans as he slowly strokes his throbbing meat. He pours the lube on his knob as he slicks that pole up generously. The feel of his hand as it slips all over his shaft have Rod writhing in ecstasy as he starts to fuck his fist. Rod then decides to show off that sweet ass as he kneels on the chaise. He pushes his cock back towards his crack as he kneads those beefy cheeks. He leans forward and spreads that ass wide open.  Rod then lies back on the chaise and starts to work that dick faster so he can finally give it the relief its been begging for. His abs and pecs start to contract as his breathing begins to labor. Rod moans as his thick cock erupts sending his thick pearly cargo all over his navel.",
  "models": [
    {
      "name": "Rod Daily",
      "person_id": 28096
    }
  ],
  "release_date": "2013-04-11",
  "scene_id": 54324,
  "series": "Rubbing the Rod",
  "tags": [],
  "title": "Rubbing the Rod, Scene #02"
}