{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week we have a friendly face to our sites by the name of Tony D. Tony made his debut with us about a year ago when he got to tap Trent Diesel's hot ass. That's definitely one hell of a welcome and we're glad to have him back and all to ourselves. Tony D is now 33 and it turns out he's originally from Ecuador. Tony's been hitting the gym and his body is coming along nicely. He's admits his first experience with porn was finding his older cousin's Hustler. He's come a long way since then. When it comes to his sexual identity, Tony D considers himself tri-sexual. He's willing to try anything once. Hmmm. His most memorable sexual encounter was a threesome he had with 2 Brazilian girls that made him feel like the King. We asked him what his ideal sexual partner would be. Black hair, silky smooth skin with full lips. He loves a nice ass, the tits don't have to be big but he really gets turned on by hourglass figures which really get him going. We're assuming those are the girls he's into. lolTony is looking at some porn on his handheld as his cock starts to come to life. He sits back and starts to tug on it through his jeans. It isn't long before he needs to give his cock more room. He stands and starts to play with his pecs and abs before zeroing in on that cock that's straining for more room. He flexes for the camera for a few before dropping his drawers to show off his hard cock. His dick is aching by the time he gets to it and Tony quickly starts to jack it off. He smacks his dick as it bounces like a trampoline. He teases it until his knob starts to ooze precum. Tony licks his lips as he gets into stroking himself off. Tony's a bit of an exhibitionist so he has no problem showing off all his goodies. He sits up on the counter top, spreads his legs and continues giving that cock the attention it deserves. His smooth balls bounce just below his cock as he pounds away at it with his lubed fist. He lies back on the counter, making himself comfortable, as his cock throbs at full mast. Tony D is NOW served. Eat up boys cuz there's plenty to go around. Tony then goes face down and ass up as he shows off that ass of his. He pushes his hard cock back to give us the full effect. By now his cock can't take much more without getting some release. He flips around and jacks that cock off until he blows. He moans as he lets out blast after massive blast of thick cum spraying all over the oriental carpet below.",
  "models": [
    {
      "name": "Tony D.",
      "person_id": 28053
    }
  ],
  "release_date": "2013-03-28",
  "scene_id": 54321,
  "series": "Counter Intuitive",
  "tags": [],
  "title": "Counter Intuitive, Scene #01"
}