{
  "collections": [
    "Men Over 30"
  ],
  "description": "This week, MenOver30 has a big piece of Cuban cuisine in the house, and he goes by the name of Mario Costa. For those of you unfamiliar with this Hispanic hottie who speaks softly but carries a huge stick, where have you been?! This week 23yo Mario has a sexy playmate with dark features and an evil grin named Ricky Martinez. Ricky is 24 and originally from the Windy City. Mario and Ricky are both single now. Mario just recently got out of a long term relationship and admits he loves his newfound freedom. These two are just two typical guys. Ricky loves Comedies and things that make him laugh...Mario loves all shows. When it comes to music, Ricky likes Cold Play, Dave Matthews and an alternative mix of others. Mario loves- you guessed it -'all' music. Hmmm, Well he's either has a vast range of entertainment likes...or he's just not big on chit chat. Ricky would win the creative award in the 'getting your nut' department; since he now likes to jack off while driving. Well, Lucky for Mario, he'll be the only one doing the driving this afternoon. Gentlemen, Start your engines! They begin to break the ice as they slowly kiss. Ricky is the first to head south as his mouth explores Mario's exposed chest. He kisses and licks his nips as he makes his way down to his sexy briefs that are already beginning to show an expanding bulge. As Ricky pulls down his briefs, his thick uncut cock comes into view. He takes it and begins to tease and lap at his hooded knob before going down on him. He sucks on that meaty monster as it begins to grow to its full length. Ricky takes his time as he worships the fat 9.5 inches he now gets to savor. The look of amazement on Ricky's face is classic as he continues to chow down on the all you can eat buffet. Mario has had enough and wants the real deal. He quietly gets up, and Ricky knows to get on his back. Mario gets in position and slowly begins to slide his meat deep inside. Ricky can only groan as his ass gets stretched wide. 'Fuck me with that big cock!' he grunts, as Mario obliges. Mario then gets up and sits on the chair to give Ricky the control he needs to get that cock in his tight ass. Ricky slowly impales himself on his thick meat and it isn't long before Ricky is sliding that thick cock in and out of his ass. Ricky is breathing deep and trying his best to relax as he continues taking Mario's fat pinga deep inside him. Once Mario knows his ass is stretched open for his meat, he bends Ricky over and begins to fuck him doggy style. Ricky can only moan aloud as Mario slams his cock deep inside him. Ricky's doing his best to take the pummeling he's being given; but Mario wants to get that load off and isn't showing him any mercy. Ricky is groaning like a broken record as he gets that asshole stretched wide. Mario picks up the pace as he nears climax. Once he's ready, he pulls his fat dick out and explodes his load all over Ricky's back. Once he's done, Mario bails, leaving Ricky to get himself off. Ricky's famous last words: 'Mario,Call me!?'",
  "models": [
    {
      "name": "Ricky Martinez",
      "person_id": 27780
    },
    {
      "name": "Mario Costa",
      "person_id": 28031
    }
  ],
  "release_date": "2013-04-18",
  "scene_id": 54325,
  "tags": [],
  "title": "Call Me!, Scene #01"
}