{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Good Golly, Miss Molly have we got an Extra Big update planned for you. This week we have not one, not two but three hung studs for your viewing and wanking pleasure. The first is none other than Chasen Hart. Chasen is finally 21 and this strappin' 6'5' hunk hails from right here in sunny South Florida. Here to help Chasen out with that thick 9' cock is 25 year old Drake Jaden and his buddy, Wayne Manly. Wayne is 25 years old, from Texas and he'll be making his debut here on our site this afternoon. Drake is a familiar face on our sites and this compact hottie with the thick 8' cock is always a good time. <evil grin> We asked these studs what part of their body is their favorite. Chasen grins and says his 'cock area'. It seems that's the part of his body that everyone seems to gravitate towards. Well, no surprise there, he does have a huge dick. Drake follows suit, locking in 'ass area' as his answer for the same reasons as Chasen. With that hot ass of his, it's hard for guys not to want to tap that. Wayne Manly, on the other hand, boldly looks into the cam and with a slight grin gives us his response. 'My eyes' he says, 'people really like my eyes.' Well played, Manly--well played.Drake and Chasen sit on a couch debating what to do with this model that is coming in thinking it's a model audition. <wink, wink> Just go with it! They both agree he needs to be pounded instead. Wayne walks in and they have him read his first and only line for his 'audition'. 'You look tired, do you want a massage?' Chasen tells him that isn't a bad idea at all; stands up and shows Wayne just what needs massaging. He drops his jeans as his monster cock is tenting his thin boxers. He unveils that dong to one impressed Wayne who can't believe he fits that in his pants. Chasen proceeds to show him where else it fits--his mouth. Drake follows suit and strips down to get in on the action. As Wayne undresses, Drake picks up where he left off sucking on Chasen's thick cock. Soon Chasen has both of them taking turns nursing on his over sized dick. Drake playfully slaps Wayne's face with Chasen's dick as Wayne goes back to sucking it. It's a 'Look what I can do' competition as these horny studs each take turns on all the meat they can eat. Chasen just groans as he looks down to watch the delicious carnage. Wayne then sits up on the couch where Chasen and Drake can both suck on his cock. Chasen starts to play with Drake's hot ass. This is getting hotter by the minute.While Drake sucks Wayne's cock Chasen suits up and gets ready for the main event. Drake straddles his thick cock and sits down on that meat reverse cowgirl. He takes that cock like a champ and starts to ride it grunting and groaning. Wayne's busy feeding him dick as he does. Drake rides him good and soon Chasen switches it up by putting him on all four so he can fuck him doggy. Drake is Chinese cuffed with Chasen in his ass and Wayne down his throat--but not for long. Wayne offers him some ass as Drake slides his rock hard cock into Wayne's tight ass. Once he gets that ass warmed up and used to that dick, Chasen moves in and takes his place back inside Drake. It's a fucking conga line--literally--as these three fuck themselves silly. Drake is the filling in this extra hot, extra hung fuck session. Chasen and Wayne have it made as Drake does most of the work sliding into Wayne's hot ass one second then sliding his hot ass back onto Chasen's monster cock the next. Why can't Mondays be this much fun? Seriously! They fuck furiously bringing them all to the edge. They then lie back on the couch as they unload their heavy cargos all over themselves and each other. ",
  "models": [
    {
      "name": "Chasen Hart",
      "person_id": 28027
    },
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Wayne Manly",
      "person_id": 28357
    }
  ],
  "release_date": "2010-06-30",
  "scene_id": 54327,
  "series": "The Three Splooges",
  "tags": [],
  "title": "The Three Splooges"
}