{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Tommy Defendi is back in the house with us again this week. We can't get enough of this hung hottie and neither can our members. Tommy and his huge 9' cock are back to welcome a new face to ExtraBigDicks. Originally from Miami, 22 year old Brent Biscayne is making his debut on the site and we're pleased to have such a tall drink of native waters to sample. At 6'6' Brent is taller than the average stud and today Tommy has met his match in the below the belt department. These two will soon be undressed to the nines. (evil grin) They both agree that they like reality shows and both started wackin' their willies relatively early. Tommy discovered his dick about 8 or 9 and with some advice from older friends figured things out sooner than most. Brent started around 12 and had it down pat by 14. He still watches the same kind of porn as his first only now the str8 porn he strokes to isn't his parents'. Tommy likes his porn more on the gonzo or amateur arena. He prefers the real aspect of amateur shoots that makes things hotter vs. the larger more scripted/polished productions. That's why he loves our site he chimes. Hmm Let's hope he can take cock as well as he can brown nose 'cause Tommy will be catching this game.</br></br>So they start playing 'Rock, Paper, Scissors' and make it a strip game. After a few rounds, Brent is the first one with his thick dick bouncing free. Just the sight of it is enough to make Tommy forget all about 'Rock, Paper--what?' He immediately falls to his knees and wraps his lips around Brent's thick cock. He slowly savors every inch as he licks his balls and up along the shaft before shoving it as deep as he can down his hungry throat. Tommy then peels off his underwear which are already struggling to contain that huge cock of his. As soon as Brent gets an eyeful he wants some of that. Tommy sits back and watches as Brent greedily returns the favor. He deep throats Tommy's fat cock while Tommy moans his approval. Brent is naturally fair complected and has ice blue eyes that add to his sex appeal. You can always spot a true Floridian; they're the ones without the dark tans we reserve for tourists. From there they move to the floor as they get into a hot 69 that looks like a double headed oil rigger as each one bobs on the others massive poles. There is definitely no shortage of cock this afternoon and in a few Tommy will have a place to put his...</br></br>Brent straddles Tommy's cock as he slowly slides down on it. Tommy is soon pumping that thick dick up inside Brent's ass as his balls start to bounce up against it. Brent is soon riding that meat like a pro. Now that Tommy has had a taste of Brent's tight ass it's Brent who wants a taste of Tommy's. Tommy gets bent over the chaise as Brent starts taking his ass. Tommy groans aloud as Brent starts fucking that sweet ass. 'Fuck yeah, that feels so good' Tommy moans as Brent just watches his cock slide in and out of that hairy ass. Brent's dick is rock hard as he impales Tommy's hot ass. Tommy can't get enough of that dick and Brent's more than happy to oblige. Tommy then moves over to the futon and lifts those muscular legs in the air. Brent gets right back in that worn ass for more fucking as he continues to slam that dick deeper and faster. This position's hitting Tommy in all the right spots and soon enough he's exploding a massive load all over his hairy chest and abs. Brent then pulls out and shoots his own thick load of Vitamin D all over our very own Tommy D, Tommy is left spent, satisfied and somewhat glazed. Rock, Paper, Scissors anyone?",
  "models": [
    {
      "name": "Brent Biscayne",
      "person_id": 27975
    },
    {
      "name": "Tommy Defendi",
      "person_id": 28400
    }
  ],
  "release_date": "2010-05-26",
  "scene_id": 54337,
  "series": "Cock, Paper Scissors",
  "tags": [],
  "title": "Cock, Paper Scissors"
}