{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we have a new face on ExtraBigDicks.com, and we've pulled out all the stops to show him an Extra BIG welcome. Hailing from Pittsburgh, PA, 28 year old Kyler Rogue joins us this week. We're in for a treat, since Kyler is not only here to enjoy an extra big dick, but also packs an 8?' whopper of his own. Kyler not only has a big dick but also has a world class ass. He blushes when we ask him if he gets lots of attention from both of his assets, and which does he prefer to enjoy. Kyler grins and admits he usually just tells guys he prefers to bottom. Wonderful words to the ears of Miami native, Mario Costa...The Man, the Myth--the Ping?n (Cuban for REALLY big dick) who will be more than happy to tap that ass. Cuban born and packing one of the biggest dicks we've ever seen, 24 year old Mario is a size queen's wet dream. Today we finally asked Mr. Power Top, the question many have wanted to know, 'Does Mario ever bottom?' Mario grins, confirms he does, and leaves it at that. Hmmm. That gives us an idea or two. Mario likes big guys, big muscles, big everything which makes sense since that seems to be the theme for Mario. Well, we're all in for a hot time so we should let these two get started.Kyler is on the phone when Mario comes into the room with plans of his own. He tugs at the phone trying to get Kyler to hang up as he puts Kyler's hand on his growing cock giving Kyler something to tug as well. Once Kyler hangs up, he undoes Mario's jeans. As he pulls down his pants, we catch our first glimpse of that uncut monster cock. Kyler immediately goes to work as he licks up and down the length of the 9?' Cuban python. It slowly starts to grow in Kyler's mouth. Soon, Kyler has way more than a mouthful to contend with. Mario's thick cock stretches Kyler's mouth wide as Kyler swallows every inch deep. Mario then returns the favor as he gets Kyler jeans off and starts to nurse on an extra big dick of his own. Kyler loves the attention he's getting. But soon enough, he wants more of that Cuban dick. Mario is more than happy to sit back and oblige him. On his knees, Kyler worships Mario's uncut masterpiece unable to get enough of it. Mario's thick cock is throbbing as they maneuver into a wicked 69 so that each can help themselves to seconds. This is gonna get good...real quick.Once the oral pleasantries are complete, they go back to making out and playing with each other's cocks as they size up their thick cocks. Then Mario suits up; sits back, and watches as Kyler straddles his thick pinga and starts to ease his hot ass down on it. Kyler's tight hole slowly gives way as Mario holds him by the waist and helps bob him on his fat cock. Kyler grimaces and groans as he gets fucked with a sense of accomplishment that screams 'dedication'. Soon, Mario's dick is working in and out of that ass with ease as he bounces Kyler on that bone. Mario then bends Kyler over for more dick. That ass more than welcomes him in. His tight balls bounce off of Kyler's hairy hole as Mario gets his deep one. Mario is focused as he watches his extra thick meat disappear into Kyler's hungry hole. We couldn't ask for better chemistry as these two go at it. Kyler's face says it all as he does his best to weather the pummeling his ass is taking. He may be walking funny by the time he heads home; but he'll be talking bout it for a long time. Mario then puts Kyler on his back and pounds him deep in a missionary position, giving us a spectacular view as that cock pistons in and out of that worn hole. It won't be long before these two explode. Kyler is the first to blow, with Mario still pounding that ass. Mario then pulls out and shoots his own leche all over our cum-covered debutante.",
  "models": [
    {
      "name": "Kyler Rogue",
      "person_id": 28757
    },
    {
      "name": "Mario Costa",
      "person_id": 28031
    }
  ],
  "release_date": "2010-06-09",
  "scene_id": 54334,
  "series": "The Big Top",
  "tags": [],
  "title": "The Big Top, Scene #02"
}