{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we have Scott Alexander back in the house. It's always a good time when Mr. Alexander is 'in' anything. Scott is in for a real treat this week, as Ryan Raz makes his ExtraBigDicks debut. Ryan is 6' of blonde, blue-eyed sunshine with a dashing smile and an ass that just won't quit. Ryan has been featured on our brother site CircleJerkBoys, and we figured it was about time we gave our members here a little 'Raz'-zle Dazzle of their own. Ryan is 26. He now lives in New York. Well, he'll be getting quite the welcome from Florida's own Scott Alexander. These two are gonna be in for a treat. They both still watch porn, even though they're in porn. Interestingly enough, they both prefer str8 porn now, mostly because they've been with so many of the guys in gay porn. Geez, what a dilemma. We asked these boys if they could make any changes to their bodies, what it would be? Scott said he's want bigger legs and a smaller head (the one upstairs). Ryan gives us those dashing dimples as he smiles and says, 'I know we're all not perfect, but I wouldn't change anything. I'm happy with myself just the way I am.' On-no-he-di-unt!They start to kiss as Ryan's hands and tongue begin to explore. Their tees come off. Before Ryan's jeans have come off, Scott's pulled down his briefs to taste that thick cock of his. Ryan sits back and watches as Scott devours every inch of his meat. Scott loves oral, so he takes his time pleasuring Ryan's meat. Ryan bobs Scott's head on his cock for a few before he wants to have some dick himself. Scott strips and stands before Ryan as Ryan gets to work on his thick cock. Ryan chokes down as much of it as he can, shoving Scott's meat deep into his throat. He licks along the shaft and works Scott's balls as Scott just moans and sighs his approval. Scott isn't anywhere near done with Ryan, as he pulls him up to his feet to give him a kiss before turning him around. He bends Ryan over on the couch and goes to work on that hot ass. He slides his tongue deep into Ryan's smooth ass which only makes Ryan buck back, wanting that hot tongue deep in that ass. That ass is gonna need it soon enough.Scott then gets into position as he slides his thick black cock deep inside Ryan's hungry ass. He starts fucking that ass deep in no time, as Ryan moans and groans, having his sweet ass stretched. Scott slaps away at that ass as he fucks it. He then switches things up by having Ryan sit on his cock. Ryan straddles him and starts to ride him. In this position, they can fuck and make out. Ryan holds still as Scott pumps that throbbing cock up into his ass. Then it's Ryan's turn as he starts to ride that dick like he's on a bouncy ball. They trade off fucking duties until they migrate into a hot missionary position on the chair. Scott slams that dick deep into Ryan, who loves the fucking he's getting. In this position, Scott can really fuck Ryan deep. As he gets closer to climax, he picks up the pace, fucking Ryan's ass faster and faster as he watches Ryan jackin off, getting close to cumming. Ryan's cock explodes as Scott continues to give him dick. Ryan's load cascades out all over his smooth navel. Scott isn't too far behind, as he pulls out and jacks his load all over Ryan's cock and balls.",
  "models": [
    {
      "name": "Ryan Raz",
      "person_id": 27995
    },
    {
      "name": "Scott Alexander",
      "person_id": 28046
    }
  ],
  "release_date": "2010-05-19",
  "scene_id": 54339,
  "series": "Great Scott",
  "tags": [],
  "title": "Great Scott"
}