{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back with us is Puerto Rico's very own, Steven Ponce. Steven is looking better than ever. Just when we thought things couldn't get any hotter ...enter Davin James. Davin is new on the site. He hails from Midland, TX. Davin is 23 years old. He admits he's loving Florida so much that he may never leave. We don't think that would be a bad thing. Davin is adorable. True to Texas standards, they grew this boy BIG!! Davin is packing a thick 9' pole all wrapped up in an 'oh-so-polite' Southern package that actually answers with a 'yes sir' or a 'no sir' when spoken to. Davin realized he had a bigger than average cock back in 5th grade when he got into his Dad's porn stash and realized that his dick was just as big if not bigger than the guys he was watching on screen. Ya gotta love these early bloomers. Fortunately, Davin is in great hands with Steven whom we know for a fact is rather appreciative of hot guys with extra large dicks in need. Steven has had his fair share of huge cocks with us on the site. Davin like many others we've had on our site confirmed that he is pretty sure that big dicks definitely run in the family. Well, I say we get Steven better acquainted with the James' family jewels.Steven starts to explore as he takes off Davin's shirt. Davin is naturally smooth. As his clothes come off, we see more of this Texan with the thick cock and those full sexy lips. Steven is soon putting those to good use as they start making out. Steven then manages to get the last article of clothing off Davin before going down on that thick cock that is slowly coming to life. They aren't kidding...they really DO grow them big in Texas. Steven is in awe as he shoves as much of that thick cock down his throat. Davin's thick cock gets thicker and harder as Steven sucks on his knob and swirls his fist around its massive girth. Steven can't get enough of that cock as he devours it. Davin isn't about to complain as he gets that beautiful cock worked. 'Suck my cock' coos Steven as they fall atop each other on the couch. Davin is soon unable to speak much with a mouthful of Boricua Boner to savor. His first taste of the Caribbean but we're sure it won't be this Country boy's last. Steven then gets back on Davin's meat making it rock hard for what's to cum...Once Davin has that cock primed and ready to bury, he sits back as Steven straddles him and slowly impales himself on that fat cock. Steven winces as Davin's fat cock stretches that hot ass wide. 'Like that dick?' Davin grunts as he watches his fat cock disappear up Steven's hot ass. Davin the puts Steven in a hot doggy position before shoving that beer can cock back in for more. Steven grimaces but bucks back wanting to get every delicious inch buried in that hot ass of his. Davin is more than willing to help him out as he pounds away deeper and deeper. From doggy they switch into a sizzling missionary position as Davin goes back to burying that meet deep and hard. Steven's legs are spread wide as Davin grinds and pounds away at that hole. They kiss as they continue to fuck. As Davin's cock is pummeling Steven's prostate, you know they won't last long before these studs explode. Seconds before their cocks unload, they fall back side by side and jack their impressive cocks off, shooting their thick loads all over their sweaty, spent bods. Whew.",
  "models": [
    {
      "name": "Steven Ponce",
      "person_id": 27969
    },
    {
      "name": "Davin James",
      "person_id": 28756
    }
  ],
  "release_date": "2010-06-02",
  "scene_id": 54336,
  "series": "Country Gravy",
  "tags": [],
  "title": "Country Gravy, Scene #02"
}