{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we have one of our favorite cock slingers in town. Whenever Jessie Alan is in town, it's good to be reminded why. You're gonna be in for a treat this week cuz we stumbled upon the perfect chemistry that made this hung hottie give us an 'aha' moment we weren't expecting. (Size queens prepare to salivate in ...3,...2,...1) Jessie's 23 years old and from the west coast of Florida. Today, he and that 9' cock of his have met their match in 20 year old Jon Estevez. For those of us that on rare occasion have been in a torridly hot situation and looked south to find your equipment is bigger than you remember it will completely relate. It's those 'Whoa, where did YOU come from?' moments we all live for that makes this week's webisode so tantalizing. Jessie was SO horny to fuck his baby-faced playmate that you'd think we filmed this thing in 3D! We're in for a really hot session this afternoon. Jessie is into Jon's dark hair, his facial hair, and that hot ass of his. Jon is into Jessie's pretty eyes and totally loves his ink. Jessie definitely has some impressive ink but that's not all that ranks impressive on this Hyde Park native. They also both love math as well so I say we do a refresher on simple division and find out how many times Jessie can go into Jon.They start kissing softly as Jon's hand starts to explore and undress Jessie. Jessie undoes his pants as he stands up to give better access to that growing cock. Jon starts to lick and suck on that cock as he hauls it out and takes that uncut monster in his mouth. Jessie's cock grows by the second as Jon sucks that massive dick. He holds Jessie's smooth balls in his hand as he swirls his tongue around his shaft taking as much of it as he can. 'You like the way that tastes?' Jessie coos as he slaps his rock hard cock on Jon's face and tongue. Jessie's cock is throbbing as he watches this Latin hottie slobber all over his meat. Jon can't get enough of that dick as he shoves it down his throat over and over. Jessie grabs his head with both hands as he face fucks Jon's pouty lips. Jessie then returns the favor as he goes down on Jon's aching cock. They kiss some more before Jon gets right back on Jessie's meat. Can't say we blame him. As he's servicing that meat, Jessie moves his hairy ass above his face so he can start prepping that sweet ass with his tongue. Jessie rims that hole deep, making Jon want that dick in more than just his mouth.Face down on the chaise, Jon is in position as Jessie moves into position and buries his cock to the hilt. Jon braces as his ass gets stretched wide and Jessie starts to give him every thick inch of it. He pounds that ass, gyrating it up and down and around as Jon's grimace tells us everything we need to know. He's awash in a sea of both pleasure and pain. Do NOT try this at home, this boys obviously a trained professional. Jessie slams that cock deep making Jon wince. Jessie then gets Jon on his back so he can fuck him missionary and get his cock even deeper inside that ass. Jon moans almost whimpering as Jessie pounds away at that ass. Jessie softly kisses Jon as he fucks him. Jon lays back with those thick thighs spread wide as he watches Jessie fuck his hot little ass. The visual is intense for both of them as watching Jon's facial expressions sends Jessie over the edge. He pulls his cock out and explodes all over Jon's smooth chest and abs. He then goes to work on Jon's ass as he fingers that worn hole helping Jon shoot a massive load all over himself. Whew.",
  "models": [
    {
      "name": "Jessie Alan",
      "person_id": 28496
    },
    {
      "name": "Jon Estevez",
      "person_id": 28760
    }
  ],
  "release_date": "2010-06-23",
  "scene_id": 54330,
  "series": "Pole Position",
  "tags": [],
  "title": "Pole Position, Scene #02"
}