{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Today, we have two new faces for you, and we're sure you're gonna be pleased. The first is tall, dark and imported. Addison Andrews is 26 years of age. At 6'3', this international man of intrigue is a 9' cut above the rest. (Feel free to read into that one!) Born in Israel, Andrew grew up in London; got that sexy accent and has spent the last few years traveling the states. The second hottie making his debut this week is a home grown boy from one of our bordering states here in Florida. Parker Brookes is 22 years of age. He still calls Alabama home. Parker's musical interests are varied since he's been a vocal and piano major for 14 years. Addison interests aren't far off, since he's a house and dance DJ and produces his own music and lots of pop remixes as well. We then asked these two horny boys where was the most scandalous place they ever got nut. Addison, whose evil side more than agrees with him, grins and says he'd probably have to go with the Rabbi's office--Final answer. We asked Parker to top that,and he went with fucking his x boyfriend on the 50 yard line at night with all the stadium lights lit. Not bad, Brookes.They start kissing before Parker takes the lead and pushes Addison back so he can start exploring his smooth pecs and abs with his tongue. Addison plays along before going in for some exploration of his own. They lick and savor each other as their clothes come off. Both of these studs are naturally smooth. Addison drops his drawers to discover he's gone commando. His massive cock looks impressive. 'That's a huge cock' says Parker only to be assured it's not done growing yet. Loving the challenge, Parker gets to work on that extra big dick as it grows in his hot mouth. Addison's cock is throbbing and quite the man handler. Surprisingly, that python dick has met its mongoose in this mop-topped Alabama stud who has no problem deep throating every inch Addison's brought to the table. Damn, Son! Addison moans and groans as Parker's mouth works his shaft. Addison then gives some back as he takes Parker's cock in his mouth and sucks on his hard cock and balls. That hot tongue then heads south as it starts to explore that sweet ass he'll soon be fucking. 'Eat that ass' Parker groans as Addison tongue fucks that hot hole.Addison gets Parker up on the couch and gets him on all four so he can get his tongue up that ass. He can't get enough of that ass as he holds his tongue out and bounces that ass back onto his face over and over. All that rimming has got Addison's dick begging for more. Addison slides his cock inside that ass and immediately starts to fuck . 'Aww fuck me' begs Parker as he gets that ass nailed. Addison fucks Parker as he holds his head by a fistful of that shaggy hair. The chemistry between these two is unmistakable. Addison has plans for that Alabama ass. They move to the floor where Addison keeps fucking Parker doggy style. He grinds and slides that dick in repeatedly as Parker fucks back wanting every delicious inch inside him. But WAIT--there's more! Addison the sits back as Parker sits on that dick in a hot reverse cowgirl. Parker bounces on that dick like he's on a bouncy ball. It's sending Addison into overdrive. A few minutes of that leads them into an even hotter missionary session. On his back with his legs wide open, Parker's ass is getting dick deeper and harder than ever before. It's hitting him in ALL the right places. As Parker starts to explode, Addison buries his dick even deeper. Addison then pulls out and shoots his load all over Parker's smooth chest and face. Whew. These two might need to re-hydrate.",
  "models": [
    {
      "name": "Addison Andrew",
      "person_id": 28758
    },
    {
      "name": "Parker Brookes",
      "person_id": 28348
    }
  ],
  "release_date": "2010-06-16",
  "scene_id": 54332,
  "series": "Packer In",
  "tags": [],
  "title": "Packer In"
}