{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Eat your 'Hart' out, fellas. We have none other than Chasen Hart back in the house with us this week and he's gonna be sharing a softer side we haven't seen here on ExtraBigDicks. For those of you unfamiliar with this 6'5', Ft Lauderdale native, Chasen  is every size queen's wet dream. Everything about this 21 year old stud is huge from his room brightening smile to that extra thick 9' cock. We also have another surprise with us on set and we couldn't be happier to finally have him back. Dallas Reeves is back and it's been a while since we've seen this now 26 year old son of the lone star state. Dallas  has been on several of our sites and he never fails to please. This afternoon Dallas will be pleasing the softer side of Chasen for a change and Chasen's gonna be in for one hell of a ride--Texas style. We asked these two studs to give us a clue on what their sweet spot is, that spot that just launches them into orbit. Dallas blushes as we call him on his, knowing that that long neck of his is his erogenous zone. Chasen just grins as we wait for his response--wait for it--'my cock!' Ya gotta love it and soon Dallas will be. He'll be loving on that 9' pole he wants so much and tappin that ass few get to.They start making out as Dallas lets his tongue roam on Chasen's neck and ear. They pull off their shirts as the exploring intensifies. Chasen undoes his jeans and by the time Dallas hauls out his larger than life cock he's at full mast. Dallas has been looking forward to this for a while now so he wastes little time before wrapping his lips around that extra thick dong of his. He strips himself completely still latched onto Chasen's thick dick. Chasen moans as Dallas shows his appreciation on that now throbbing cock. Chasen's cock is more than a mouthful and thicker than most. His inked frame, donkey dong and swarthy looks make for one irresistible package. Dallas then stands to get some attention on his own 'package'. Chasen goes to work on Dallas' cock as he does his best to return the favor. Chasen's better at getting his cock worshipped so he sticks to what he's knows best. He lies back on the couch and offers Dallas more dick. Dallas is more than okay with that as he lies between Chasen's mammoth thighs to suckle on that fat fuck pole. He licks, jacks and sucks away as Chasen moans and sighs his appreciation. Dallas gets lost in his own world as he worships Chasen's cock to his 'Hart's content.It's 'go time' and all we hear is Chasen grunting, and not in a good way, as Dallas buries his hard cock in that ass. Dallas steadily fucks that beefy ass as Chasen does his best to accommodate his anal intruder. Chasen isn't usually on the receiving end of the cock-o-matic so he's managing as best he can. There is nothing hotter than watching an over-sized stud like Chasen on the end of another stud's cock. Dallas balls slap away at that sweet ass as Chasen continues to grunt and groan. This stud does not look happy; but Dallas, on the other hand, looks like he's somewhere past Cloud 9. <evil grin> He grins as he looks up at the beautiful stud who's now riding his cock. Dallas' cock is buried deep as Chasen bounces up and down on it wanting to get that cock in his ass off already. Dallas isn't in any hurry as he gets all 6'5' of Chasen bent over so he can fuck him some more doggy style. Chasen grimaces as he continues to get that ass fucked. The more Chasen grunts the harder Dallas fucks his hole. 'Awww shit' he grunts as Dallas bounces his balls against that ass over and over. Finally as Dallas gets close to cumming he pulls out and sits back to stroke off a load. Chasen jacks his own hefts wad all over Dallas' chest while Dallas explodes all over his own navel. Whew. ",
  "models": [
    {
      "name": "Chasen Hart",
      "person_id": 28027
    },
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    }
  ],
  "release_date": "2010-04-21",
  "scene_id": 54347,
  "series": "Large And In Charge",
  "tags": [],
  "title": "Large And In Charge"
}