{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Micah Matthews is finally making his debut on ExtraBigDicks, where he belonged all along. Micah  first appeared on our brother site, CircleJerkBoys. It wasn't long before we had to have him and that thick 8' cock of his back for more. Micah is 36 years old and from Tennessee. This afternoon, Micah brought along his bigger half--wait for it--that goes by the name of Bradley Michaels. Bradley is 25 and from West Virginia. Bradley is adorable, blond, and bright-eyed. And did we forget to mention the 10' monster dong he's packin'? What were we thinking? Yes, although Micah is not a size queen by any stretch of the imagination; he obviously can be impressed. These two have been together for about 9 months. 'It was love at first sight' beams Bradley, while Micah reluctantly admits it took a few days, but he grew on him quick enough. By now, they have their sexual kinks out of the way. Bradley now knows that licking Micah's balls is enough to send him over the edge, while Bradley just loves getting fucked by Micah--period. Apparently on Birthdays or Holidays and after a bottle of Jack, Micah might agree to bottom for his extra hung twink. That might be something to consider on set...hmmmm.Micah is gropin' his crotch slowly as Bradley patiently watches. Micah soon joins Bradley as they begin to make out passionately. They strip off their clothes until they're left making out in their briefs. It doesn't take long for Micah to slip south and release the Kraken. Bradley's hung huge. His semi erect monster cock springs free, ready for some attention. Micah wraps his lips around it and starts to nurse on Bradley's meat. Micah can only service a few inches of it as Bradley tries to shove more of his cock inside. Micah then wants some lovin' on his cock; so he sits back and gives Bradley access to his cock. Bradley pulls down his briefs and immediately goes to work sucking Micah's cock to the hilt while Micah talks dirty to him under his breath. He eggs him on to suck his dick, and it's working. They then stand to continue kissing and stroking each other's cocks. After rubbing their swords together, Micah bends Bradley over on the couch and gets that sweet ass ready for some fucking. He licks and sucks at that ass, getting it nice and wet for what's to cum--err come.                Once Bradley's ass is spit lubed, Micah stands and aims his rock hard cock at his intended target. He slowly pushes into Bradley's hot ass that willingly affords it entry. Micah starts fuckin away at Bradley's smooth ass as Bradley strokes his own cock. Micah watches as his big dick disappears in and out of his lover's ass. He can't get enough of that ass. Soon enough, he switches things up by sitting down and having Bradley straddle him. Bradley sits on that cock and starts to ride Micah in a reverse cowgirl. His huge cock bounces up and down like a seesaw as he pleasures himself on Micah's bone. Micah's cock is throbbing as it gets ridden. His large balls are slowly pulling up tight around the base of his pole. Micah holds Bradley by the waist as he thrusts Bradley back onto that cock, wanting to get it in deeper. Micah then has Bradley lay on his back and gets right back inside that hot ass missionary. He starts to fuck away at that ass. Bradley loves every delicious inch he's being given. Micah's hot ass is rising and falling with every thrust he gives. It won't be long before these two climax. Sure enough, they dismount and lie side by side as Bradley blows all over his smooth abs, followed by Micah, who shoots an impressive load all over his own.",
  "models": [
    {
      "name": "Bradley Michaels",
      "person_id": 28751
    },
    {
      "name": "Micah Matthews",
      "person_id": 28397
    }
  ],
  "release_date": "2010-04-24",
  "scene_id": 54346,
  "series": "BIG Love",
  "tags": [],
  "title": "BIG Love, Scene #02"
}