{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Making his debut on ExtraBigDicks this week is a Sarasota native who made quite the impression on our brother site MenOver30 a while back. This Floridian with the Abercrombie & Fitch air about him is none other than Ridge Michaels. Ridge  is 22. We've decided to pull out all the stops and give him a HUGE welcome. Literally! Yeah, Ridge will definitely remember this day after his smooth, jock ass gets officially introduced to Diesel Washington. Diesel, the man, the myth, the 9' python in his pants, needs no introduction. At 39, Diesel has made himself quite the reputation as an accomplished actor in the adult industry. We've gotten to know this New Yorker a lot better than most; and it's nice to see Diesel in person is nothing like his on-screen ruff-n-tuff persona. For example, we asked these two if they could be any animal, what it would be. Ridge said without question he would want to be a jaguar. Diesel (the self-professed Comic book geek) then turns and asks Ridge what cartoon he would be? Ridge was stumped but Diesel already had a vision of his own cartoon creation: 'Some kind of granite rock life form that comes to life, has super human strength, can fly and has teleporting capabilities.' OMG--Geek alert, Geek alert! Lol Ya gotta love it.They break the ice, kissing softly on the couch as their hands begin to explore each other. The clothes start coming off as these two get better acquainted. Ridge's curiosity gets the better of him as he slides off Diesel's jeans and gets a better idea of all he gets to play with. After a bit more kissing, Diesel stands up and just watches as Ridge unwraps his new toy. He hauls out Diesel's thick black cock through the fly of his boxers and goes to work. Ridge wraps that pretty mouth around Diesel's 9' cock as Diesel moans and groans his appreciation. 'Show me those beautiful eyes' Diesel moans, as Ridge stares up at him with a lustful stare. Ridge knows exactly what he wants--and he fixin to 'git it'! Diesel then wants some dick too, as he gets Ridge on his back so he can suck that pretty dick. Diesel goes to town on Ridge's rock hard cock as Ridge writhes in ecstasy. Diesel uses his tongue all over that hot cock and balls before turning this Sarasota Stud around and getting that expert tongue up that hot ass. Diesel buries his face deep in Ridge's crack, as Ridge pushes his cock back towards Diesel's mouth, wanting more on his cock too. It's an all-u-can-tongue fest for Diesel--and it can only get better.Diesel then sits back and groans as Ridge starts sitting on his thick cock. 'Just have to get used to it' Ridge grunts, as his ass slowly concedes. Once that hot ass is fully impaled, Ridge starts to grind his ass on that dick, sending Diesel into a frenzy. Diesel helps Ridge put his feet atop his knees so he can get better leverage and ride the ride a lot better. After a few minutes of taking that dick in a reverse cowgirl, Ridge wants a better view. He twirls around on that dick so he can face Diesel and get to make out with him as he gets that ass stretched. Diesel coaches the young stud into a better position so that he can better take that cock. This is a teaching set, and Ridge is definitely gonna learn a thing or two about taking a big cock in that ass. 'Aww, fuck me' is all Ridge can say as Diesel impales that ass and even moves him from the couch and props him onto the adjacent chaise into a doggie position without ever pulling his python out of his ass. Show off! As Diesel fucks him in a doggie position, Ridge is getting that ass stretched and fucked deep and he does his best to accommodate all that cock Diesel's burying. Diesel then literally spins him around while on his dick into a missionary position then stands up with Ridge still attached to this cock and moves him back to the couch to fuck him missionary. Grand standing we say! Diesel buries his cock deeper and deeper. Soon, they are both ready to explode. They dismount and unload as they jack their loads all over themselves before basking in the afterglow.",
  "models": [
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    },
    {
      "name": "Diesel Washington",
      "person_id": 28049
    }
  ],
  "release_date": "2010-05-12",
  "scene_id": 54341,
  "series": "360 Degrees Of Fornication",
  "tags": [],
  "title": "360 Degrees Of Fornication, Scene #01"
}