{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "After almost a year and a half, it is with great pleasure that we welcome back swarthy Dominic Pacifico. Scruffy, dark and handsome with bedroom eyes and a thick dick, Dominic  is the complete package. Dominic has been quite industrious since we've seen him last. He's been working on his music and is actually releasing his first album in stores locally. Appropriately called Porn Star DJ, his first album of mixes is set to do well. He started dabbling in music back in 1998. After 12 years, he's matured into quite the stud. He's also been in the industry for about 12 years, and has been able to make it work for him. He's also glad he's been able to merge both of his passions to work together. Working in the adult industry it's also afforded him the type of jet set lifestyle he particularly enjoys. He's been able to see many places and meet incredible people along the way in a journey that would've been much different had he not pursued porn. 'If you wanna do it for fun then do it for fun, if you want to do it as a career then think twice and give it a shot' Words to live by from an amazing man who is on top of his game.Dominic begins his own episode of Dominic Pacifico 'Unplugged'. His hands begin to roam over his defined frame. He pulls his shirt over his head showing off those chiseled abs and furry navel. He opens his board shorts and slides a hand inside while the other is exploring his smooth chest and nips. He slides his shorts off, showing us that thick cock of his straining against his briefs that are just barely containing all he has to offer. He strokes and tugs at that thick meat through his underwear as it throbs aching to be set free. Dominic then stands on the chaise and continues to tease his dick. He finally pulls his briefs down and gives his dick the breathing room it needs. It is rock hard. Dominic begins to give it the attention it requires. His massive balls are smooth. He keeps everything trimmed and under control. Dominic then loses his underwear and turns his attention to that spectacular ass of his. He bends over on the chaise and starts to finger himself. He licks his fingers before shoving them deep inside this tight ass. He stares right at you knowing very well you have other plans for that ass that don't involve his fingers!Dominic then sits back on the futon as he lubes and strokes his cock, which by now is at full mast. He lifts his muscular legs in the air as his fingers find that sweet ass of his. He fingers himself a bit while jacking his engorged member. He tugs on his balls and pulls them away from his cock with one hand while burying more fingers inside that hungry hole. This stud definitely knows how to make a boy work for it as he continues to tease u and that ass. Dominic then just sits back and slowly strokes that cock. He puts his hand behind his head giving us a peak at those sexy arm pits of his. There isn't a bad angle on this 29 year-old. He just looks better and better. He grabs his thick meat at the base and squeezes it hard between strokes. Soon he's breathing heavier, muttering under his breath, 'I'm ready to bust' as his pecs and abs begin to tense and flex. Dominic then grabs his massive dick and starts to jack it off with both hands on deck. Soon, he's double fisting out a massive load that splatters up all over his heaving chest and coats his abs and furry happy trail. Someone was a bit backed up. We're just glad we could help.",
  "models": [
    {
      "name": "Dominic  Pacifico",
      "person_id": 27999
    }
  ],
  "release_date": "2010-03-31",
  "scene_id": 54353,
  "series": "Pacifico Time",
  "tags": [],
  "title": "Pacifico Time, Scene #01"
}