{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'This week, we just had to bring Dominic Pacifico back. It's been so long since we've seen this 'San Francisco Treat' in action we figured our members were overdue. Unlike many we meet, this California native never left his home state. He's still proud to live in Cali. Last week we got a chance to see Dominic  in some steamy solo action. This week we got a hot Southern number to play with. At 19, Jake Woods has all the right moves. He's tall, lean, dirty blond, great smile, packs an impressive 8' cock and--wait for it--has a Southern drawl. Does it get any better, folks? Jake is from Atlanta, GA. We couldn't be happier to have him. Both of these boys like to keep in touch since their budding careers keep them on the go. Jake likes to tweet while Dominic is more of a face book kind of guy. They're both horny guys and like to jack off whenever possible. Jake likes to use his imagination versus watching porn. When it comes to whether or not they prefer using lube or dry, Dominic likes to use lube. Silicone base lubes work on his thick dick; while Jake prefers spit. Hmmm.  Spit? We didn't see that coming. Well we have a feeling he'll be needing more than spit to accommodate all that Dominic has for him this afternoon but never underestimate the charms of a Southern gentleman.Dominic and Jake don't waste much time before getting to it. They start kissing passionately as they strip each other's clothes off. Jake undoes Dominic's jeans. Once they come off he makes a bee line for that cock he's heard so much about. He licks and teases it through the briefs that are slowly beginning to tent. He pulls them down and starts sucking on that fat cock he's more than ready for. Dominic is hard in seconds as Jake swallows his meat to the hilt. Jake loves that thick dick. He makes sure to take his time and savor every delicious inch. Dominic isn't about to complain as he watches the hot Southern boy go to town on his meat. Dominic then wants some cock as well as he strips Jake's jeans off to get at the thick dick he's packin'. Jake just moans and groans as Dominic works his meat like a champ. On all four we get a double bonus as we not only see Dominic's skills in the oral department but some incredible views of that smooth ass of his which is arched up almost begging you to explore it. That has yet to happen but stick around--you never know what might happen.Dominic then bends Jake over a bit so he can get that tongue of his on more than that 8' cock. Dominic's tongue expertly runs all over that smooth ass and dives into his tight ass. The light glistens on the light touch of blond fuzz on his sweet ass. There's no denying where this peach is from. Dominic loses himself in that sweet ass as he licks and bites that ass, devouring it, getting it ready for what's to come. Dominic can't get enough of that sweet ass. Dominic then rubs that sweet hole with his cock and starts pushing his Latin cock inside. Jake grimaces as his ass starts to give way to Dominic's thick meat. He jacks his cock which is rock hard as Dominic begins to bounce that ass off his dick. Dominic is burying that dick of his hard and deep as Jake tries his best to accommodate his new friend. He's getting a pounding on that sweet ass. Once Dominic's done banging him doggy he leads him to the chaise where he lifts Jake's legs up and holds them as he shoves that throbbing cock back inside for more. Just when Jake is getting used to that thick cock; Dominic starts to pile drive it home even harder. From here they switch to Jake riding Dominic's cock which he does until he blows his load all over himself while he's still riding that cock. Dominic then pulls out and unloads his thick cum all over Jake. That's a definite wrap.",
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 28599
    },
    {
      "name": "Jake Woods",
      "person_id": 30698
    }
  ],
  "release_date": "2013-05-22",
  "scene_id": 54351,
  "tags": [],
  "title": "Into The Woods, Scene #01"
}