{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Bobby Brock is our blast from the past this week. It's hard to believe it's been about four years since we last saw this tall, hung, Miami native. We're definitely glad to have him back with us, and now a lot more 'open minded'. Not just a solo artist anymore, Bobby  has brought along a Southern treat for all to enjoy. Georgia may not always be on your mind, but chances are sexy 25 year old Hunter Cole will leave a lasting impression. Hailing from the ATL, Hunter is 25. Today, he'll be taking all of Bobby's 9' boner--one way or another. We asked these two studs, given the option of time travel, where would they want to go. Hunter decided he would boldly go where no man has yet to and fast forward 3000 years. He's a tad impatient on getting his flying car. Bobby went in reverse and wanted to travel back 80 years and get a taste of the roaring twenties. You couldn't drink legally but everything else was ripe for the picking. They both like to have fun. Where Hunter still loves roller coasters, Bobby still enjoys a good game of Pac Man (might need to wikipedia that one). Well, back to today, they will both be having a lot of what they love: Bobby gets to use his oversized joystick, and Hunter's gonna ride the ride. Shall we?They start kissing on the couch. They slowly start to strip, as their tongues search for new territories to uncover. They strip down to their briefs. As Bobby pulls off Hunter's jeans, we can already see his massive boner jutting out the top, unable to remain covered. Bobby is more than happy to take matters into his own mouth as he engulfs that swollen dick with ease. He sucks on Hunter's throbbing cock before dropping his own shorts to get his cock some attention. Hunter readily holds still as Bobby starts to face fuck him with his thick meat. They can't seem to get enough of each other's thick meat as they maneuver into a sizzling 69 on the chaise. Hunter licks and teases Bobby's boner with his tongue before shoving as much of it as he can down his throat. On the other end of this boner buffet is Bobby who is easily deep throating every thick inch that Hunter has to offer. WHAT gag reflex? Hunter stands and lets Bobby have his fill as he slowly savors that Southern cock, getting himself all worked up for more--lots more.Hunter then straddles Bobby as he holds both their cocks together and starts to jack them off. He humps into his fists, rubbing his boner atop Bobby's, which is now aching for more than a hand or simple blow job. Bobby suits up as Hunter eases himself down on that 9' dong. His ass gives way as Bobby's thick cock slowly disappears from view. Hunter is soon riding that cock like a champ as he gets his legs up on the couch, allowing him the flexibility to not only get that ass fucked, but to give some back as he arches his back and grinds that sweet ass back onto Bobby's rock hard cock. Bobby then wants the control back and bends Hunter over. Bobby starts fucking Hunter doggy style. All Hunter can do is moan and groan as he gets done. Missionary is next, as Hunter again goes ball deep inside that tight ass. Missionary with a dick that big can only mean one thing--they're a comin'! After Bobby pounds that sweet Southern ass for a few, they both dismount, lie back, and stroke off one amazing load after the other as they both climax all over themselves.",
  "models": [
    {
      "name": "Bobby Brock",
      "person_id": 28748
    },
    {
      "name": "Hunter Cole",
      "person_id": 28749
    }
  ],
  "release_date": "2010-04-14",
  "scene_id": 54350,
  "tags": [],
  "title": "Bobby Brock & Hunter Cole Interview"
}