{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "As the camera rolls, we find a familiar face sitting on the couch, blushing like a school girl. It's none other than Miami's own, Trey Turner. Trey  was on EBD last Fall, when he broke in a first timer with that hot ass of his. Trey is excited to be back and well...we can't blame him. As we pan to the left, we see WHY Trey's a grinning mess, Mr. Chasen Hart. Any questions? For those of you unfamiliar with this oversized, extra thick cock carrying, dimpled god, we ask: 'Where ya been?' At 6'5, Chasen  definitely kicked off 2010 the right way--boned up and buried deep!  Chasen is 21 and from Fort Lauderdale, FL. Makes you wonder what they've been feeding this one. Hmmm. Well, ultimately it's what he'll be feeding Trey (but we'll get to that in a minute). Trey is still dating the same beau and they've been together almost a year. Chasen is single and loves it. They both agree that beer and shots is how they prefer to party. A recent favorite movie for Trey is Avatar. He loved it. Chasen hasn't seen it and has no desire to. 'I really don't do movies much' he explains. Well, once we get that beer can cock loose, Trey's gonna be in his own 3D movie with plenty action and loads of Chasen cummin' at him. (literally)Trey doesn't waste any time before getting to it. He lifts Chasen's shirt as he starts to explore his smooth chest with his tongue. Chasen's tattoos come to view as he undresses. Trey finally undoes his shorts and sees his prize still asleep. His tongue dives and starts to work it as he takes as much of the growing me meat he can handle. Chasen is moaning softly as Trey starts to deep throat as much of his now throbbing cock as he can. Chasen is rock hard, and spreads his massive thighs wide to let Trey have better access to his cock. Trey is in it to win it and is working every inch of that cock. Chasen just steadies his massive club at the base with one hand while he watches it disappear into Trey's expert mouth. Trey then stands up and gives Chasen a chance to return the favor. Chasen grabs his cock and bobs back and forth making his cock shine. Chasen isn't on Trey's cock for long before Trey wants more of Chasen's. Who could blame him? He gets on his knees and goes back to work sucking on Chase's extra big dick. He wants to make sure it's as hard as he can for things to come.The next thing we see is Trey slowly starting to impale himself on Chasen's thick dick. He's grunting as his hole tries to accommodate his extra large intruder. Once it pops past his sphincter, it makes it deep inside. Once Trey adjusts to his girth, he starts riding that dick at a full gallop. His own cock smacks his abs as he bounces up and down on that cock, unable to get enough. Chasen, who's sexy facial expressions tell us all we need to know, just sits back and watches while his cock is being ridden. Wanting to get in on the fun, Chasen puts Trey on all four and slides that cock back in for more. He starts fucking Trey again. He slams Trey's hole hard. When Trey pulls forward a bit, we hear Chasen say, 'Aww, where you going?' as he slides him right back where he belongs--on his dick. Chasen then starts fucking Trey hard as Trey bucks back and begs to be fucked even harder. Chasen obliges as his balls slap away at Trey's ass. Chasen then puts Trey on his back and fucks him missionary. His fat cock sliding in and out of his ass is driving Trey crazy. He begs him to fuck him harder. Chasen piston fucks into his tight ass. Within minutes, Trey is shooting all over himself. Chasen fucks the cum out of him before pulling out and jacking his own thick batch all over his chest and abs.",
  "models": [
    {
      "name": "Chasen Hart",
      "person_id": 28027
    },
    {
      "name": "Trey Turner",
      "person_id": 27927
    }
  ],
  "release_date": "2010-03-17",
  "scene_id": 54357,
  "series": "The Bigger They Are",
  "tags": [],
  "title": "The Bigger They Are, Scene #01"
}