{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back in the house this week is Scott Alexander. And he's brought along a new face to play with. Scott  is now 37 and always a welcome face here on ExtraBigdicks. We can't seem to get enough of this 6'3 stud and his rock hard 8' cock. Originally from Gainesville, Scott admits that he loves to play with gadgets. New and shiny things keep his attention every time. Speaking of 'new and shiny', we turn to Scott's friend.  William Vas is 29. Sarasota, Florida's responsible for the hottie we have with us this afternoon. William likes to spend his extra coin on food. Whatever he may be in the mood for at the moment is what he'll spend his money on. They both like to watch news channels to stay connected with the rest of the world. We wondered what their first gay porn was. When put to the test, Scott blushed afraid he would date himself. Hmmm. 'The Other Side of Aspen' he answers. Well, he probably should've been more specific since there is a slew of them, the first of which dates back to 1983 when he was a randy 11. Early bird gets the worm, we gather. Well, it's William that will be getting the... you know. So let's get to it, shall we?Scott and William can't wait to get to the fun stuff as they immediately begin to kiss and take each other's clothes off. The chemistry between these two is unmistakable as they kiss passionately and continue exploring each other's bodies. Soon they are in their underwear as William gets on his knees to get a better view of Scott's underwear that is bulging to contain his rock hard cock. William slides off Scott's underwear as he frees his thick 8' monster. William gets more than a mouthful as he starts sucking on his cock. 'Look up here at me, Babe' Scott says, as he slowly starts to face fuck William, who's doing his best to take every thick inch of Scott's black cock that's being pushed down his hungry throat. William can't get enough as Scott continues using his mouth and slapping his face with his swollen meat. Scott then pulls William to his feet as he kisses him, before heading South himself. Scott wants to please his lover. Soon, William's cock is deep inside Scott's hungry mouth. Scott loves to suck cock, and goes to town on William's pole. All this oral action is leading to some intense action, and things are only getting started.Once Scott's had enough of William's cock, he gets him on all fours so he can have a better look at his sweet hole. Scott slowly fingers that tight ass and gets it ready for a fucking using his fingers and tongue to do the trick. Scott starts to eat that ass, which only makes William hornier for dick as Scott dry humps his bare ass. William won't have to wait long before Scott suits up and starts to slide his python home. William's ass is more than ready, and easily gives way to Scott's desire. Scott starts fucking William deep. Judging from the look on William's face, he loves every minute of it. 'Awww that's a big fucking dick!' William groans with delight as Scott picks up the pace. The grin on William's face is priceless as Scott continues to drill his ass. Scott then slows it down. Just when he comes to a momentary pause, William starts to buck that sweet ass of his right back onto Scott's cock as he repeatedly impales himself on it for more. This just makes Scott hornier, knowing how much William wants it, so he goes right back to piledriving his meat deep to make sure William gets his fill. William then switches it up and straddles Scott for more. His ass is stretched wide as Scott's cock continues to ram deep inside him. William can't stop begging for more as he gets his ass stuffed. They then switch into Missionary, which will do the trick. William's the first to nut as he stands over Scott and bathes him in his load. That's enough to send Scott over the edge as he too blasts his load ALL over William's chest and face.",
  "models": [
    {
      "name": "Scott Alexander",
      "person_id": 28046
    },
    {
      "name": "William Vos",
      "person_id": 28743
    }
  ],
  "release_date": "2010-03-03",
  "scene_id": 54362,
  "tags": [],
  "title": "What A Ride, Scene #02"
}