{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Josh West is with us this week and we're always glad to have this hairy hottie in the house. Josh is hairy, hung and makes 37years of age look amazing. Maybe it's the weather in Los Angeles? Josh has always had a high sex drive and having a thick 9' cock makes it all the better. He realized he was 'larger' than the rest of his friends at about 12 and it made him slightly self conscious when it came to coming out. Josh came out late at the age of 26 but he has no regrets. He's more than made up for lost time. He's currently single and content for now. To help us out with Mr. West, we invited a native Floridian (they really do exist) along that goes by the name of Kain Warn. Kain is 28yo and has a smile bright enough to light a room. He is originally from Gainesville and is in for a treat this afternoon. Bravely into battle he will go... Kain is really into older men and if the daddy's hung that just sweetens the pot. Well, Kain is in for the ride of his life. Josh not only has the big gun but he knows how to use it. This afternoon, we firmly believe Kain will be getting 'the' cr?me of the crop. These two have started before we've even hit the record button as they kiss and grope each other. The chemistry is more than apparent as their clothes start to come off. Josh lies back as Kain undoes his jeans. His thick dick is already at full mast and his knob is protruding over his waistband. Kain wastes little time before getting his first taste of Josh's junk. 'Fuck yeah, Suck that dick' Josh moans as Kain goes to work. He swallows as much of the thick python as he can; taking it out to stroke it and look at it in awe. Josh pulls him up on his feet as he kneels to return the favor. He slowly starts to nurse on Kain's thick meat as we hear him gag a few times attempting to deep throat it. Kain's eyes are closed as he lies back and enjoys the head he's getting. Josh bobs his head up and down on his meat before shoving it entirely into his throat as Kain just grunts with pleasure. Josh loves pleasing Kain's meaty dick; but Mr. West has other plans for our local native. He flips him over and once in position he spreads his smooth cheeks and dives into his sweet ass tongue first. Kain can only squirm at the sensation as Josh gets his ass wet and ready for a fucking. 'You ready for it now?' he teases, as he slides his fat cock between his spit-lubed cheeks.'Aww yeah' Josh coos as his thick 9' monster begins to stretch Kain's hot ass. He enters him slowly giving him time to get used to the thick dick that's now slowly fucking his ass. Kain jacks off to distract from the pain he feels initially. The pain's short lived and in no time Josh is dickin' him deep and with ease. He pounds his ass doggie style as Kain just takes every delicious inch inside him. Josh then puts Kain on his back before sliding that fat dick back into his worn hole. In this position, Kain's prostate is getting a sensory overload as Josh's thick dick massages it from the inside. 'Fuck that's a nice ass' Josh grunts as he plows his ass. Kain is on his back with his legs in the air as Josh just pounds his sweet ass. Kain's ass is hungry for more and Josh is more than happy to give him his fill. His massive balls slap Kain's ass with every thrust he makes. Josh falls forward to make out with Kain who's still impaled on his meat. Josh then lies back as Kain straddles his cock and gets right back on for more. He rides Josh's cock hard which only gets him hornier. Josh senses the familiar tingle and he puts our hungry bottom boy on his knees as he pounds him like a bitch. Kain is grunting and jackin off while Josh just takes his ass. Josh is the first to nut as he kneels beside Kain unloading his thick batch all over his smooth chest. He then reaches down to finger Kain's worn hole as he jacks his own batch all over too.",
  "models": [
    {
      "name": "Kain Warn",
      "person_id": 27924
    },
    {
      "name": "Josh West",
      "person_id": 27931
    }
  ],
  "release_date": "2012-03-14",
  "scene_id": 54368,
  "series": "Kain is Able",
  "tags": [],
  "title": "Kain is Able, Scene #02"
}