{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Jokers are WILD and it won't be any different this week at ExtraBigDicks when we introduce you to two new faces you haven't seen yet. Both have made their appearances on our brother site, CircleJerkBoys. We figured it was about time we had an alumni reunion here on our site so they can showcase all they have to offer. The first face in this Wild reunion goes by the name of Christian Wilde Christian is 20 and from San Francisco. It's been a while since we've had this 6'3 hottie in our studio. Today, we'll get to see him in a lot more than solo action. Christian is single and not all that involved. He has a 'few' special females back home in California. This afternoon we have a special surprise for Christian as we pair him up with 23yo Kurt Wild. Kurt is gay for pay. He's married and has a couple toddlers back home in Missouri. He loves what he does and his little lady at home is perfectly ok with what he does. Kurt was blessed with an 8.5 inch cock yet says he had no idea his dick was all that big til he was 18. Bigger is definitely better and Kurt agrees. '..I got like a small ass. You take a big cock and put that with my ass. It makes my ass look better; it makes his cock look better and it can actually feel better sometimes because everything's like 'filled'. Hmmm. We wonder if Miss South Carolina coached him any?Kurt and Christian are exhausted from lugging in boxes for their new apartment. As they plop down on the couch, Christian decides he is ready to get more than a load off his feet. They start to kiss as their shirts hit the floor. Christian has ink across his sexy chest and more on his back and arms as well. He licks down Kurt's chest as he strips his jeans off. Kurt is hard in seconds as Christian goes to work on his thick cock. Christian spits on his knob before going right back down on his meat as he gives him an intense oral session. Kurt is loving it as he jacks his thick cock before sliding it back into Chris' mouth. 'It's my turn' Kurt says as he kneels to release Christian's monster meat. Hr greedily gobbles up as much of that cock he can take as Christian groans his appreciation. Christian is rock hard as Kurt licks and teases his meat. 'That's a big cock!' Kurt says as he continues to worship that fuck stick that will soon make his ass look better--and feel great. Kurt takes his time as he tries to pleasure every thick inch Christian has to offer. He knows he'll need more than his mouth soon enough.They move into a hot 69 on the couch as they each savor the other's thick cock. Who knew str8 boys could suck cock? Soon Christian is playing with that beautiful ass he gets to stretch open. His fingers start exploring as the anticipation makes Kurt buck back, wanting a lot more inside. Christian then suits up and sits back so Kurt can have that cock. Kurt squats down as his small ass slowly takes Christian's cock ball deep. 'Fuck that ass is so good around my big dick' Christian groans as Kurt rides him hard. Kurt is moaning like a bitch in str8 porn as he fucks himself hard with Christian's extra thick meat. Kurt's moaning is only making Christian's cock throb harder as he fucks up into that sweet ass unable to get enough. He bounces Kurt up and down on his solid 6'3 frame before bending him over the couch and fucking him doggie style. 'Grab my hair and FUCK ME!' grunts Kurt as Christian happily obliges pounding him harder. --GO str8 BOY' Christian pounds his ass good before rolling him over and fucking him missionary. Christian's cock starts hitting all the right spots. Soon, Kurt's moaning he's gonna cum as he gets the cum fucked out of him. Christian isn't far behind as he pulls out and unleashes a massive load. Christian's first two blasts of cum fly way over Kurt who is still in the throes of his own orgasm. The rest of Christian's load splatters across Kurt's chest and face. Now THAT was definitely a Wild, Wilde Session",
  "models": [
    {
      "name": "Kurt Wild",
      "person_id": 28391
    },
    {
      "name": "Christian Wilde",
      "person_id": 28481
    }
  ],
  "release_date": "2010-02-24",
  "scene_id": 54363,
  "series": "The Wild Bunch",
  "tags": [],
  "title": "The Wild Bunch, Scene #01"
}