{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Chasen Hart is in the house and he's sitting next to another lucky fan favorite Alexander Greene. For those of you unfamiliar with these two hung hotties, Chasen is now 23 and originally from Fort Lauderdale and Alexander who will be 21 and finally legal in a couple months is from New Jersey. Seeing as Alexander has a birthday coming we wondered what would be the best present ever. He's always dropping his iPhone and they have replacement cases for them to change the glass and start customizing his phone. For Chasen he would want two strippers coming out of a big strawberry-vanilla birthday cake. We're sure the present would happen after they pop out of the cake. Seeing as both of these boys are packing more than the average guy we wondered if having that much between their legs gives them extra confidence. Alexander admits it definitely gives him extra confidence knowing what he's got going on and what it does when he hauls it out. Chasen says that yeah it does give him a confidence boost but there are times when he feels 'small'. Riiiight! We have two words for anyone that might actually fall for that 'I'm small' bit...Brace yourself! lolChasen and Alexander are hangin' on the couch when Chasen asks Alexander if he's up for a challenge. Hmmm. Alexander assures him he's yet to meet one too big for him. Music to Chasen' ears as he stands and drops his shorts so that Alexander can get a look at his monster dong. 'Is that big enough?' Chasen asks. Alexander would've gone into a lengthy reply but his lips were on that dick faster than hope leaving Newt's Presidential Campaign. Chasen moans as Alexander strokes and works that thick dick. He takes as much of it as he can into his mouth as he sucks that hard knob. Chasen stands with his hands behind his back and looks down and watches Alexander worship his meat. Alexander then gets up to get his dick some air as they start tugging on each others huge cocks. They rub their dicks together as they get harder and eventually Chasen heads south to return the favor. He kneels and takes Alexander's thick uncut cock into his mouth and savors it as Alexander fucks his mouth. Chasen works that meat some more but Alexander wasn't done with Chasen's so he gets right back to suckin' him off getting him rock hard so he can take it deep.Chasen then sits back and watches as Alexander straddles his cock and sits down on it. Chasen moans as that tight ass takes his dick deep inside it. Alexander knows exactly what to do as he starts to ride that thick dick like a pro. Chasen steadies him as he holds his tight waist and tells Alexander to tell him how much he likes it. Alexander can't get enough of that dick as he rides him even harder. Chasen then stands him up and bends him over to tap that ass doggy style. His dick slides right back into that tight ass and soon his heavy nuts are slapping away at that hot ass. Alexander strokes his own fat dick as Chasen pummels that hole. He fucks that ass harder and deeper having the control he wanted. Chasen then lies on his back and Alexander gets right back on that horse cock for another ride. Chasen just groans as that tight ass swallows his meaty dick to the hilt. Alexander impales himself on that meat and starts bouncing on that dick as it start to hit him in all the right places. That fat dick hits his sweet spot making him nut all over Chasen's navel. Chasen then pulls out and jacks his own load all over his cum covered happy trail. Challenge completed. ...WINNING! lol",
  "models": [
    {
      "name": "Chasen Hart",
      "person_id": 28027
    },
    {
      "name": "Alexander Greene",
      "person_id": 28463
    }
  ],
  "release_date": "2012-02-22",
  "scene_id": 54369,
  "tags": [],
  "title": "Chasen Nation, Scene #01"
}