{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "West coast be praised for the Sequoia we have in the house today. We are definitely looking forward to the big wood Mr. Justin Christopher is packing; and he's schlepped his thick 9' trunk all the way from California. Justin is 30 and loving the weather we've been having here in the Sunshine State. Once Justin unwraps his hunky costar, Brandon Lewis, Justin will be loving a lot more than the weather. Brandon is 26 years old. From the moment this 6'1 dream boat opens his mouth, there's little question he's the perfect Southern gentleman. Brandon blushes and gives us that signature grin as he tells us he's from Atlanta, Georgia. There's only one thing hotter than a tall, jock-looking stud with bedroom brown eyes--one with a Southern drawl! Brandon is a Sports guy and loves to be outside doing anything athletic. He'd rather be out and about than inside watching TV. Justin doesn't mind kicking back and watching TV and loves crime shows like Law & Order. Sexually these two are horn dogs; but Brandon admitted he loves to try new things and has even had a girl tie him up once. Hmmm. We thought we'd take advantage of that mind set and have Brandon, who is usually the hunter, become the hunted. 'It's nice to flip things around on occasion' he grins. Well, soon he'll be the one being flipped around.They start to slowly feel each other up as they naturally progress to kissing and making out. Brandon's hands are making headway as he explores Justin's growing crotch. Their tees come off as Brandon decides his hands could use some oral recon. He starts to lick Justin's chest as it makes its way down incredibly his smooth terrain, heading south to what looks like a rather large pop tent. Justin stands up to give Brandon better access as he starts to run his tongue along the length of his hardening shaft still contained inside his black briefs. Brandon tugs at his underwear, and we get our first view of Justin's incredibly thick python. It's thick from head to base. Brandon wastes little time before wrapping his lips around it. Justin has an amazing view as he watches Brandon go to town on his fat cock, slapping his face and tongue with it as he looks up at him for approval. Then it's Brandon's turn as Justin kneels to give him a little of the same. Brandon's cock is rock hard and ready for some help as Justin goes to work on that thick country cock. Justin takes his time, slowly making Brandon's bone feel amazing as he licks and slurps away at his meat.They stand and continue kissing as they rub their cocks together and get ready for what's to come. Justin sits back and holds his massive meat by the base while Brandon backs up and sits down on it. 'aww, that's a big dick!' Brandon groans, as his ass slowly starts to concede and take Justin's meat. Soon, Brandon is used to that thick cock and is riding him with ease. The look on Justin's face tells us just how hot that ass must feel as it slowly milks that cock for every drop it's worth. Justin is more than happy to oblige, shoving his cock deep up into him. Justin then gets Brandon on all fours as he bends him over on the couch, gets behind him, and slides his thicker than average cock back inside his amazing ass. 'Give it to me' Brandon grunts, 'gimme that Big Dick!'. We can watch Justin's ass stretcher at work as he slowly slides it balls deep, only to pull out and slam it back home. Justin picks up the pace. As he's getting closer, he puts Brandon on his back so hr can fuck him missionary. This does the trick, as Brandon loses his thick load all over his sexy navel. Justin pulls out as well as he too unloads his thick seed all over a cum drenched Georgia peach. ",
  "models": [
    {
      "name": "Brandon Lewis",
      "person_id": 27916
    },
    {
      "name": "Justin Christopher",
      "person_id": 28745
    }
  ],
  "release_date": "2010-03-10",
  "scene_id": 54360,
  "series": "Justin Credible",
  "tags": [],
  "title": "Justin Credible"
}