{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back with us this week is a familiar Floridian we just can't get enough of these days, Mr. Drake Jayden. Drake was here a few weeks ago, when he got to explore Sexy Trent Diesel's ?backyard? with that 8? anal aerator. (Mmm, the visual alone!) Our fans wanted more, so the sexy 25 year-old from Central Florida is back, only this time we found him a hot, hung stud that's gonna be driving the plow into his fertile fields. Maybe fertile isn't the right word. What comes around goes around, and 28 year-old Bostonian Trevor Knight is here to help us out with that. Trevor is more than equipped for the task.  Soon, Jayden will be much better acquainted with all that is Trevor. Both of these studs are busy boys, admitting they share the same thing on the top of their procrastination list:  To stop smoking. They also have something else in common. When asked what they love to do, they both answer ?having sex?. ?I could do it here all day, and when I get home, if my boyfriend or whatever the case wants it?I'll do it again. Sounds like these two horny boys are gonna be all sorts of fun. We might need to get them naked first...By the time we start filming, Trevor's fly is undone, with these two are lip-locked as they move past 'break ice' to 'get you some' on the to-do list. They begin to explore each other.  Both of their extra thick dicks are breathing a bit easier out of their confines. Trevor goes down to get a taste of Drake's cock as he bobs up and down along its growing length. Drake then has a go at Trevor's 9? python as it bobs and throbs with every swirl of Drake's tongue. Trevor lies back and spreads his legs wide as Drake settles in for an intense nursing session. He expertly sucks his cock all the way down to the hilt as Trevor coos and moans in delight. Trevor is naturally smooth.  After getting his share of attention, he decides he wants to give Drake a little of the same. Drake holds Trevor's head as he gently bobs him on his meat. Trevor is all about oral, and he's only just begun. He gets Drake on all fours and moves in for the tossed salad appetizer.  He dives into Drake's ass tongue first before going to town on that hairy ass he will soon claim. Drake is moaning in ecstasy as Trevor continues to eat that sweet hole and get it nice and ready for what's to follow. We assume you know what that is? After having Drake on his knees worshipping his cock some more to get it as hard as he can, Trevor moves his furry fuck buddy over to the couch where he begins the introductions. Soon enough, Trevor's fat cock is being introduced to Drake's tight ass. The two hit it off wonderfully, with Trevor's heavy low hangers joining in on the fun as they soon meet Drake's hungry ass?repeatedly! Trevor takes Drake's ass doggy style for a few before switching things up and sitting back on a chair, having Drake impale himself on that thick dick for the ride of his life. Drake is more than up for the fun.  In no time, he's bouncing on that thick dick like a well-seasoned jockey. We don't know where he put it, but all 9?? have disappeared deep inside that smooth ass. Trevor slaps away at his ass as Drake grinds and bucks back on his cock. He's got it bad, and who can blame him? Drake moves up and slowly slides back down on that thick dick as he drives Trevor crazy with his muscular ass. They then move over to the couch, where Drake gets on his back and offers up that sweet ass for more. Trevor can't refuse, and is soon fucking his ass missionary. Trevor's fat cock is hitting Drake in all the right places.  Sure enough, that does the trick. ?Feel that fuckin dick?? Trevor grunts, as he picks up the pace. ?Fuck me!? Drake grunts repeatedly, as Trevor literally fucks the cum out of him. He blasts all over his furry abs. Trevor follows suit as he hauls his cock out and blows all over Drake's cum drenched bod.",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Trevor Knight",
      "person_id": 28736
    }
  ],
  "release_date": "2010-02-03",
  "scene_id": 54371,
  "series": "Long Knight",
  "tags": [],
  "title": "Long Knight, Scene #01"
}