{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Georgia is known for many things. Many think of the music scene. Others, their delicious peaches. Today, we get to pick one of its finest fruits that, at 2,1 has reached its peak of perfection. Xander is with us this week in his very first scene ever. Wide eyed and excited to be here, we see 'big things' (foreshadowing) happening for Atlanta's native son. We can say that with certainty because we know something he doesn't. Just to the right of our industry virgin sits a Bostonian named Bobby Knight. Bobby is tall, charming, and packs a really big 8 1/2' cock. Something tells us you already knew that. Hmm. Well, Xander has no clue, but he's already been cast in EBD's remake of Knight Rider. Xander is a self professed follower. He likes to go with the flow, whereas Bobby's more the leader type. Bobby's first time was at camp with a fellow camper. He wouldn't change a thing. Xander blushes as he says he would change everything. He was too young and it was horrible. A lot has changed since then, and admits his best orgasm ever was a week ago. He went out partying with two friends, and ended up being the center in a fucking trio. He had his dick buried in his friend while his other friend's dick was stretchin' his own hole. There's a visual. It's the quiet types ya gotta watch out for. Bobby's hottest sex was a random hook up in Cali. It turned into a memorable shower fuck that he still thinks about. Well, let's see if we can't top both of those once we get these two nekid!They don't wait very long before getting started. They kiss each other as they strip off each other's clothes. Xander quickly fumbles with Bobby's jeans, trying to get them off and find out what all the talk is about. He doesn't have to wait very long, since Bobby's boned up by the time the pants come off. His briefs are short lived as Xander dives head first into Bobby's beef. Bobby's long dick is at attention as Xander skillfully bobs his head on his knob and strokes the shaft with his fist. Bobby definitely needs all hands on dick in order to get the job done. Bobby's naturally smooth and keeps his bush cropped short. His low hangers dangle below his thick cock as Xander continues worshiping every delicious inch of it. Bobby then gets Xander up and gets a go at his cock. Xander is more than happy to oblige as his own hard cock gets a mouthful of attention. Xander is naturally defined and has a sexy patch of fur at the base of his rock hard cock that he keeps cropped as well. Bobby holds still while Xander fucks his face. He doesn't mind--soon he'll be the one fucking while Xander tries to hold still. In anticipation, Xander gets right back on his knees and sucks on Bobby's aching dick as he gets it wet and ready for more. Xander can't seem to get enough dick--he's only just begun!After watching Xander go to town on his throbbing cock, Bobby decides to explore newer prospects for that dick of his. He bends down and starts to finger Xander's sweet ass. In no time, Xander is on all fours with Bobby's tongue shoved up his ass. Xander can only moan as Bobby makes a meal out of his new fuck hole. Bobby has Xander's cheeks spread wide as his tongue gets a workout, getting better acquainted with his smooth hole. 'You ready for it?' he teases, as he lubes up Xander's ass. He gets on the couch and kneels into position, easily sliding balls deep into Xander. Xander's ass is overdue by now, and Bobby easily starts to pound him. An overhead shot gives us a great view of Bobby's dick disappearing in and out of that hungry hole. Bobby changes things up with a new position by putting his new buddy on his back. With his legs in the air and a huge cock up his ass--Xander couldn't be happier. (Don't hate!) Bobby's low hangers slap away at his ass, and Xander's own cock is rock hard. Bobby's getting a workout as he continues to piston his hard cock deep into Xander before sitting him on it for more. Riding Bobby sends Xander over the edge as they both sit back and jack themselves off. They each explode their smooth, sweaty frames, leaving them a cum covered mess. Yum.",
  "models": [
    {
      "name": "Bobby Knight",
      "person_id": 28542
    },
    {
      "name": "Xander",
      "person_id": 28543
    }
  ],
  "release_date": "2010-01-20",
  "scene_id": 54375,
  "tags": [],
  "title": "Knight Rider, Scene #01"
}