{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It seems our members here at ExtraBigDicks just can't get enough of Scott Alexander. Even though Scott helped us--and one very happy Krist Cummings--celebrate Christmas, you keep beggin' us for more. Well, who are we to say no? As charming off camera as he is on, Scott has a new playmate today. Scott's new friend may be new to Scott, but he's no stranger to us at least not anymore. Making his 2nd recent appearance after more than a year in hiatus, Rusty Stevens is back and looking better than ever. Judging by the way he was able to handle Chasen Hart a few weeks back, we're sure Scott's cocks in good as--err hands! We asked these two studs what their vice or downfall would be. Scott smiles and admits his downfall has always been Oreos. Can't blame him for that. Rusty on the other hand is on the exact opposite of the vice pool, if you will. 'Until I've had my whole grain, my vegetables and my meat for the day...You don't even want to be around me.' Fortunately for Scott, he'll soon be getting enough meat for the week. As for New Year's Resolutions, Scott wants to just make sure this year is better than the last; while Rusty wants to give up having sex with strangers in public restrooms. We're not even touchin' that one...They begin to make out before Scott's tongue begins to do a little exploration of its own. Scott licks Rusty's defined abs as he takes off his shirt. It isn't long before Rusty's tongue is doing the exploring as he slides down between Scott's legs and checks out the equipment as he licks Scott's thick cock along the shaft. 'I've seen your equipment; now see mine' Rusty says, as he turns around and slowly pulls down his shorts, revealing his beautiful ass. Scott's hooked and can't stop looking as Rusty kneels on the chair and bends forward to show Scott his smooth fuck hole. Scott dives in tongue first as Rusty moans and groans his appreciation, ordering Scott to get his tongue in there even deeper. After Scott's had his fill of that sweet ass (for now) he gets up and lets Rusty have a go at his throbbing cock. Rusty kneels before Scott's massive meat and devours it. He sucks and laps at it with his pierced tongue and gets even hotter as Scott slaps his face and tongue with his thick 8' cock. Rusty is cock crazed and can't seem to get enough. They then get into a hot 69 on the couch so that Scott can return the favor for a bit before he gets to tap that hot ass of his. It's only a matter of time...'I hope this one's sufficient' Rusty teases, as he bends over for Scott, offering him his ass. Scott slowly starts to slide his thick meat inside as Rusty winces and takes it. This isn't Rusty's first time at the rodeo, and soon enough he's being ridden hard. Scott's balls are slapping his ass as he fucks him fast and deep. Rusty grunts as he gets his ass stretched wide open as Scott continues to take his ass. A shot from below gives us a great view of Rusty's hungry hole taking every thick inch he's being given. Scott then changes things up by sitting back and having Rusty do a little riding of his own. Rusty sits right back on that cock and starts to bounce up and down on it in a reverse cowgirl position. He can't get enough as he grinds that hot ass as far down as he can. Scott then has Rusty twirl on his cock so he can face him while he fucks him. In this position, the two continue to fuck while making out, and it's only getting hotter. After Scott bounces Rusty on his meat some more, he puts our horny receiver on his back and shoves that thick dick back inside him missionary. Rusty can only moan as Scott's thick cock hits all the right spots as he buries it over and over in his hot ass. This does the trick as Scott pulls out and sprays his thick batch all over Rusty's chest and abs. Rusty isn't far behind as he too gives up a healthy load.",
  "models": [
    {
      "name": "Rusty Stevens",
      "person_id": 28733
    },
    {
      "name": "Scott Alexander",
      "person_id": 28046
    }
  ],
  "release_date": "2010-01-27",
  "scene_id": 54374,
  "series": "Cerebral BALLsy",
  "tags": [],
  "title": "Cerebral BALLsy, Scene #02"
}