{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have two new faces on ExtraBigDicks. The first comes from Central Florida and made his debut just last week on our brother site, MenOver30, Mr. Drake Jayden. Drake is 25 year-old, and at 5'6, this inked morsel packs quite the package. We're lucky he's showing off all his assets as he passes through Sunny South Florida. Along with Drake we have a corn fed Midwesterner that goes by the name of Trent Diesel. Trent is 26 years old and originally from Chicago. This Windy City boy is on vacation, and apparently making it a 'working' one. We ain't mad at him.  They are both enjoying the weather down here. These boys are both more relaxed and laid back. They're both relatively new in the scene. Drake has been doing films since this past February and has already lost count. Trent hasn't done as many but admits he's enjoying the fun and the adventure he finds with every new set. 'It wasn't what I was expecting' he admits. He was expecting that every scene would be filmed in a hotel, but that isn't always the case. He is learning new things with every shoot, and we're glad that things are going his way. Let's see if he can't pick up some new tricks from Drake, who's quickly becoming an old pro.They begin kissing as their hands and Trent's tongue begins to roam. His tongue dances along Drake's defined chest, and soon he's undoing his shorts and hauling out his thick cock. Drake groans in ecstasy as Trent takes his cock into his mouth. Trent strips Drake before going back down on his meaty dick, which is now rock hard. Drake can't get enough of Trent's mouth as he pushes Trent's head further and further south, getting as much of his dick as he can deep in his throat. Trent worships that meat and heavy hangers as he polishes that knob with a sense of hunger. Drake loves the attention he's being given, but is soon feeling left out as he goes to give Trent some of what he's been getting. His plans don't exactly go as planned. Just when he's stripped Trent's inked frame down, Trent has other plans. Trent has Drake sit right back down so he can kneel at his feet again to continue worshipping his rock hard cock. Drake's throbbing 8' fuck pole is aching for attention, and Trent's more than happy to oblige. He knows the harder he gets Drake's cock, the more ass Drake's gonna wanna drill. Ulterior motives can be quite sexy, n'est pas?Drake turns Trent around and gets him on all fours before shoving his tongue up the smooth ass he'll soon plow. He fingers that tight hole using his spit, and is soon teasing Trent as he slaps his ass with his rock hard cock. Trent is going crazy waiting for that cock to stretch him wide. Fortunately, he doesn't have to wait for long. Drake suits up and slides his cock in deep. He wastes little time before burying it in its entirety into Trent's hungry hole. He bounces in and out of that ass, making it his own. Trent does his best to accommodate the dicking he's given. Drake then lies back and has Trent sit on his dick. He watches his dick disappear as Trent rides that cock like a pro. Trent moans and groans as he continues to fuck himself with Drake's throbbing meat. From there, Drake puts our inked Midwestern boy on his back before he sends that dick back in for more. Trent, legs in the air, takes every deep pounding he gets as Drake fucks him faster and faster, burying all 8' inside that hot ass. This does the trick as Drake pulls out and unloads his nut all over Trent's washboard abs. Once Drake's done, he hauls ass just like 2009, leaving one sore assed Trent asking for a towel... Happy New Years!",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Trent Diesel",
      "person_id": 28054
    }
  ],
  "release_date": "2009-12-30",
  "scene_id": 54382,
  "tags": [],
  "title": "Up In Smoke, Scene #02"
}