{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we have two fresh faces for you, and we couldn't be happier to meet them. The first is Shane Frost. Shane is from Boston, and he's brought along a friend. Lex Sabre is 28 and from Los Angeles. The chemistry between these two is obvious as they sit comfortably close to each other. We asked these two if they had a fantasy walk on role on any show what would it be. Shane is a game show kinda guy and wants to be able to win a fortune so he went with 'Who Wants to be a Millionaire?' Hmmm. 'I have a little brain up here' he grins. Well, good luck with that. Lex has a different agenda and chose 'Law and Order: SVU' because he has a thing for Christopher Meloni. Who doesn't? We then asked them if they had a fantasy 3 way with any straight boy they knew would never dabble in the all male world who would it be. Shane chose Ashton Kutcher--an excellent choice--to be the bone he'd endure female company to get access to. Lex Sabre surprised us all when without hesitation he answered ....'Chris Meloni'--yeah he's got it bad. We're sure Lex wouldn't mind burying his 8.5' saber deep inside that ass. Well, Hell would frost over before Shane lets that extra big dick anywhere near Chris Meloni--so we best let these two get started.They sit opposite each other as they begin to tease their cocks. They show off their growing packages to each other as the show & tell escalates. It isn't long before their jeans are undone and Shane's shorts are coming down. The attraction is too much to handle as Shane moves over and begins to kiss Lex. They lose all inhibition as they begin to lick and suck on each other's bare chests. They kiss and explore each other as their tongues roam free. Lex then begins to lick his way south along Shane's defined frame til his tongue hits the bulge under his briefs. His tongue quickly grows tired of the fabric, and soon enough, Shane finds his cock in much warmer quarters. Lex sucks Shane's cock down to the hilt as he slowly begins to worship his meat. 'Yeah suck that dick' Shane coos as Lex happily obliges. Shane loves the attention his dick is getting, but he's beginning to feel left out. He nudges Lex back onto the couch and unwraps his gift slowly taking Lex' sleeping 'Saber' into his mouth. Lex's cock responds instantly, and in no time, Shane has a meaty 9 1/2' cock to work to his heart's content. Shane goes to town, making love to that big dick using his talented mouth, and Lex loves every minute of it.Shane works Lex's fat cock with ease. All the attention is only making Lex's cock harder and wanting more. Shane's wishes of getting that dick parked in him are soon realized as Lex begins to push his fat cock into his tight ass. Shane's ass gives way as his intruder inches deeper and deeper. Lex starts fucking that ass deep as Shane grunts and eggs him on for more. Lex gives him all the dick he can handle as he continues to bury his thick uncut cock into his hungry hole. The sounds of Lex's balls slapping his ass fill the room as Shane begs him to bang his ass harder. Shane's taking it deep and he's not missing a beat as Lex pounds away at his ass. Careful what you wish for, Mr. Frost. Lex's heavy hangers slap away at Shane's ass as Shane continues to moan and groan in a mixture of pleasure and pain. 'Fuckin' Bang it!' Shane moans so Lex decides to switch it up and sits down so that Shane can ride his thick cock and take every inch of it deep in his gut. Shane is more than happy to ride that cock and Lex fucks up into his hole burying it as deep as he can. This is just what Shane wanted and he revels in the fucking he's getting as he grinds his hot ass down against Lex' rock hard cock. Shane's hot ass sends Lex over the edge as he blasts his thick, massive load all over Shane's chest. All that load sends Shane over as well as he explodes a healthy heaping all over his cum soaked chest. DAMN!",
  "models": [
    {
      "name": "Shane Frost",
      "person_id": 28457
    },
    {
      "name": "Lex Sabre",
      "person_id": 28728
    }
  ],
  "release_date": "2009-12-02",
  "scene_id": 54389,
  "tags": [],
  "title": "Sabre Rattling, Scene #01"
}