{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we have two local faces back with us that became instant fan-favorites since appearing with us. Even though the two hung hotties have never met, they do share a common denominator. That common denominator would be super hung hottie Jessie Alan, who happens to be yet another Floridian. The first of these cuties is 23 year-old Troy Montgomery. Troy, a self proclaimed 'Size Princess' is originally from Ft. Lauderdale. He has never had a problem handling even the largest of assignments. Tall, dark and willing--just the way we like 'em. Troy packs a nice cock on him; so he can always appreciate a boy with an even bigger toy. Speaking of bigger toys, we have baby-faced Isaac Summers back to show Troy a good time. Isaac  is 21 and also from Ft. Lauderdale. Isaac held his own with Jessie, but today he'll be the one giving Troy plenty of thick, uncut pleasure. Both of these studs are single bachelors and love living on their own. We're sure their mothers would be surprised at the company they keep. They may be all grown up, but they both admit they still love playing video games. The only joystick they love better than their X-BOXes is their own...and soon you'll know why!Sitting across from each other, they start groping their meat. Isaac immediately comes over and starts undoing Troy's jeans. Isaac's not wasting any time as he hauls out Troy's Latin meat and begins to suck it. Troy moans his approval as Isaac spit-shines his now throbbing cock. Isaac explores north as he licks Troy's chest before finally landing a kiss on Troy's sexy full lips. Troy wants to return the favor as he gets Isaac to sit back as he slides off his pants and starts to lick at his tenting briefs. It isn't long before Isaac's meat is too big to be contained as his uncut cock gets bigger and bigger. Troy pulls them down and goes to work on Isaac's thick uncut meat. Isaac's naturally smooth and his thick cock is in good hands. Troy works his cock getting as much of it as he can down his throat, then coming back to lick all along his shaft and naturally smooth balls sending Isaac into over drive. Isaac strokes his massive meat giving us a private show of what he'll soon bury in Troy's hot ass. Isaac then goes back down on Troy to get more of that rock hard cock. Troy isn't complaining one bit as Isaac sucks his cock while getting his own pole ready to fuck. These two then get on the floor in a hot 69 as they each help themselves to all the cock they can handle. While Isaac's nursing on Troy's meat his fingers begin to explore that hot ass he'll soon plow. It's only a matter of time...Isaac looks up at Troy's face as he watches him start to slide down on his thick meat. Troy's ass gives way as Isaac's meat starts to sink inside. Troy starts riding him within minutes, loving all the dick he's getting. Isaac's bone is stretching Troy's ass wide and Troy can't seem to get enough of it. Isaac looks amazed as he stares up in awe at just how well Troy's riding his meat. Isaac then gets Troy bent over as he moves into position. He aims that meat south and slides back inside him. He starts pounding Troy's hungry hole with ease as Troy takes it ball deep. The cam closes in on the anal action as we see Isaacs cock sliding deeper and deeper into Troy's hole. Troy is in ecstasy as he continues getting his ass pounded. Troy then gets on his back and Isaac fucks him missionary. Isaac watches his pole slide in and out of Troy's hot ass. Now Troy has access to his own dick that's screaming for attention. Isaac fucks Troy faster and deeper and it's only a matter of time before these two explode. Without much ado, Troy is sent over the edge with an ass crammed full of Isaac and sends jet after massive jet all over his face and chest. Isaac follows suit as he too douses an already cum-covered Troy with an even larger explosion of thick cum. Geez! Imagine if these two actually liked each other!",
  "models": [
    {
      "name": "Troy Montgomery",
      "person_id": 28334
    },
    {
      "name": "Isaac Summers",
      "person_id": 28493
    }
  ],
  "release_date": "2009-12-16",
  "scene_id": 54386,
  "series": "Hard Summers",
  "tags": [],
  "title": "Hard Summers, Scene #02"
}