{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "D?j? vu you ask? No, you're not imagining this at all. This week, we brought back two horny studs who sizzled in their first scene so hot that it demanded a follow up. It being Christmas, who are we to deny you your guilty pleasures?  Hailing from Houston Texas, 37 year old Scott Alexander is back with us. Scott  didn't mind one bit when we asked him to come back for some more of what he got this summer. Scott got an early 'Krist'mas present in the form of one tight, horny Nebraskan by the name of Krist Cummings. Krist  isn't adverse to the idea of a man with an extra big 'situation' that needs handling, so it only made sense. This being the holidays, we asked these two what was on the top of their Christmas lists. Krist, who's an avid wrestler, says he wants wresting DVDs. Scott would want to be able to move to Chicago. The Windy City wouldn't know what to do with Mr. Alexander. We then asked these two if there were any secrets that nobody knew about that they'd like to confess. Krist blushes as he admits he'd love a scene with Nick Cross. Hmm. Scott thought about it for a few before giggling as he confesses he has a degree in accounting. Well the only addition we'll have today is figure out how many times Scott(A) can go into Krist(B)? We're guessing that will equal (C)Plenty! ...In Algebra, that's called a given. --duh.Krist walks into his room to find a large Christmas present with his name on it. Once he opens it, out pops Scott Alexander in a Santa hat & sexy red jock strap. 'OMG! Even better than Transformers' he beams before kneeling to get at Scott's thick dick, which is now protruding out of one of the holes in his Live Cargo box. Krist eagerly swallows every inch he can as Scott groans his appreciation. They soon outgrow the box as Scott steps out of it to get at all that Krist has to offer. Krist goes right back to work on Scott's rock hard cock that is now throbbing. Scott then decides to return the favor as he goes down on Krist sending him into orbit. He then gets Krist on all four before rimming his naturally smooth ass. 'Aww, smack my ass' Krist begs as Scott continues to fuck his hole with his skilled tongue. 'You like your present?' Scott teases, as he continues licking away at the ass he'll soon be stretching open. Krist then gets back between Scott's thighs to continue sucking on his rock hard cock. He revels in it, slapping his tongue and face with Scott's spit-lubed meat. All this oral is making for one horny and ready to fuck Santa.After Scott's had his fill of oral from Krist, he's more than ready to 'fill' Krist's stocking. He bends Krist over a chair and slides his fat cock deep. Krist's compact ass gives way as it engulfs every thick inch he's being given. Scott grabs him by his tiny waist as he repeatedly rams his 8' fuck tool inside. The camera angle from the rear gives us a spectacular shot of Krist's hungry ass in action. Scott then gets Krist on his back and slides back in for more fucking missionary style. Krist is taking it like a champ as Scott continues to pound away at his ass. Scott's muscular ass rises and falls as he sinks into Krist. Krist is groaning and moaning in a mixture of pleasure and pain. Scott watches as his thick meat goes in and out of Krist's hot hole. 'Aww fuck me, Santa' Krist begs as Scott picks up the pace. He starts fucking him deeper with shorter strokes that drive Krist wild. Scott then puts Krist on all four and fucks him doggy style. Krist is just a moaning mess in overwhelm at the sensation he's being given. Scott starts fucking him deeper and deeper, telling him how good it feels. That does the trick as they dismount seconds before spraying their seed all over one completely satisfied--cum drenched--Krist Cummings. It's a White Christmas after all!",
  "models": [
    {
      "name": "Scott Alexander",
      "person_id": 28046
    },
    {
      "name": "Krist Cummings",
      "person_id": 30770
    }
  ],
  "release_date": "2009-12-23",
  "scene_id": 54384,
  "tags": [],
  "title": "Kristmas Is Cumming, Scene #02"
}