{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have Tommy Defendi back in the house this week. We never get enough of this young and hung hottie. Tommy  is living in Florida again and is looking better than ever. He says he has to keep looking good in Miami because that's the way Miami rolls. We admit Miami is a bit more body conscious than his hometown of Chicago. This week, we have a new face on our site that goes by the name of Phenix Saint. Phenix is originally from San Diego, but grew up in the Midwest and currently calls Minneapolis, MN home. Phenix is 27 and says if he had the chance to move anywhere different it might be Florida since he's never lived down here. He's not much of a pet person, so it would be easy to relocate south. Tommy has a few pets, but they're back home in the Windy City. We asked these two who they last jerked off to. Phenix admits he last stroked to someone in his little black book. Tommy couldn't remember the last time he had to jack off. Oh the humanity! Tommy is usually a top based on that thick 9' cock of his. Today, Tommy's gonna give our members something to jack off to as he continues to explore his sexuality and gives that sweet ass up to Phenix, who's hardly a Saint. What fun would that be?They begin groping each other slowly as Phenix begins to explore Tommy's furry chest. He licks and sucks his nips and neck before moving south. Tommy begins to explore Phenix as well, as they commence the dance. Tommy's tongue glides across Phenix' smooth chest. Soon, Phenix is peeling off Tommy's jeans to get at that thick cock. Tommy groans in delight as Phenix takes his fat cock inside his mouth. Phenix works his mouth around Tommy's throbbing cock as Tommy moans in delight. Phenix then gets up; and, as Tommy starts undoing his pants, we get our first glimpse at his ink. Phenix has several tattoos that frame his navel. If that isn't a tasty enough surprise, Tommy is soon slurping on his rock hard cock with its shiny Prince Albert eager to be pleased. Tommy expertly swallows his cock deep, sending Phenix into overdrive. Phenix then lays back to have more of Tommy as he sucks his cock and heavy low hangers. Phenix is stroking his thick dick as he sucks on Tommy's meat. The harder Phenix gets, the more he wants to get inside that hairy ass Tommy's about to give up. Soon enough, Tommy is assuming the position as Phenix moves into place.Phenix slides his cock into Tommy without much hesitation. Tommy grunts and groans as he tries to accommodate his rock hard cock. Once inside, Phenix is on a mission as he pounds away at Tommy's hole. He holds on to Tommy's waist as he rams his cock in deeper and deeper. 'Awww fuck my ass that feels so good' Tommy begs, as Phenix continues to take what's his. Phenix looks amazing plowing away at Tommy's ass as Tommy takes every thrust he's given with pleasure. Phenix then pulls out and sits back to have Tommy ride his cock. Tommy impales himself back on that cock and starts riding his meat hard. Tommy's fat cock is rock hard as he takes that dick deep in his hole. Phenix is loving that ass as he grinds up to meet every thrust Tommy's ass is giving him. After a while in this position, Phenix puts our top boy on his back and goes back in, fucking him deep while jacking Tommy's meat in tandem. 'You like that ass?' Tommy whimpers as he gets the living daylights fucked out of him. By 'the living daylights' we mean the amazing cum load Phenix fucks out of him. Tommy has met his match as Phenix turns our star top into a cock hungry bottom. Phenix gladly pounds every thick blast of cum out of him to a repetitive 'OH MY GOD!' chorus as Tommy explodes all over his face and chest. Phenix pulls out and sends another huge batch all over one cum-covered Defendi.--DAMN!",
  "models": [
    {
      "name": "Phenix Saint",
      "person_id": 27996
    },
    {
      "name": "Tommy Defendi",
      "person_id": 28400
    }
  ],
  "release_date": "2009-12-09",
  "scene_id": 54387,
  "tags": [],
  "title": "Tommy Gives It Up, Scene #01"
}