{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have two hot hunks for you on ExtraBigDicks. One is a blast from the past and the other an extra hung newcomer. We couldn't think of a more appropriate way to kick off 2010 than by taking a reflective look back as well as admiring the here and now. First appearing on our brother site CircleJerkBoys almost 2 years ago, 24 year old Rusty Stevens is back and looking better than ever. Turns out this now chiseled California native is back after taking a year off from the biz. From what we can tell, he must spend every waking moment at the gym. He's filled out, and his once boyish frame is boyish no longer. His costar today is a 20 year old local boy from Ft. Lauderdale that is 'Extra Big' in every sense. At 6'5' and packing one of the thickest 9' cocks we've ever seen, Chasen Hart will be the one to appreciate all of Rusty's hard work. Tall Dark & Hung, Chasen knew he had more than the average guy when he was about 15 and in military school. One look at this tall stud with the bedroom eyes and room-brightening smile makes you wish you were a fellow cadet in those showers. Chasen admits Big Dicks run in his family, and he was lucky to inherit his Daddy's genes. His brother did not. Well Chasen is in for a treat, and his extra thick cock will be filling Rusty's now bottom ass in properly. If this isn't the best way to 'break in' a New Year--then we don't know what is!Chasen stands to show Rusty why he has trouble wearing underwear. When he unzips his fat cock is already poking out over his jock strap. There just isn't enough pouch to contain that monster cock. Rusty immediately gets on his knees and begins to worship at his feet. He licks and sucks at his cock before engulfing as much of it as he can into his hungry mouth. Chasen holds his head as he continues to stroke and suck on his growing cock. Chasen is rock hard in seconds and starts to slowly face fuck Rusty's mouth. Rusty is in awe of the thick meat he gets to play with. He devours as much of it as possible. He spits on Chasen's cock as he strokes his own meat. Rusty then gets up and has Chasen return the favor. Chasen goes to work on Rusty's cock as it gets the attention it needed to come to life. Rusty doesn't last long before he wants more of Chasen's thick cock back in his mouth. Who could blame him? Rusty shoves it deep into his throat as Chasen groans in ecstasy. Chasen's beefy inked frame is quite the site to behold and that dick is icing on a very tempting cake. Rusty moves up to make out with Chasen. As he does, Chasen smacks Rusty's smooth ass with his thick meat. Rusty's ready for more...Chasen suits up and Rusty straddles his monster dong and begins to impale himself on it. His ass slowly gives way as it takes Chasen all the way to the hilt. Chasen bites his lower lip as he feels his meat sink into Rusty's tight ass. He cups Rusty's ass with his hands as he begins to bounce him up and down on his fat cock. A view from below shows Chasen's smooth boys bouncing up against Rusty's ass that is now taking that monster dick in stride. Rusty then begins to ride Chasen, who is loving every second of that ass. Rusty then dismounts and lies back on the chair and lifts his legs, beckoning Chasen for more. Chasen aims his meat south and slides his meat back in for more. In this position, we can fully appreciate the ass stretching Rusty's getting as Chasen pounds away at his hot ass. The chemistry between them is insane. It isn't long before Chasen wants him riding his cock again. Chasen sits back and sits Rusty back on his cock. Rusty begins grinding his hot ass deeper and deeper on that fat cock, stretching his hole, and it sends him over the edge. Chasen looks delicious as his full lips part, peeking around Rusty to watch all the cum his fat meat has fucked out of Rusty as he explodes all over the couch below. Rusty then falls forward as he dismounts. A he catches his breath on all fours, Chasen jacks his meat and explodes all over Rusty's back and sore ass.",
  "models": [
    {
      "name": "Chasen Hart",
      "person_id": 28027
    },
    {
      "name": "Rusty Stevens",
      "person_id": 28733
    }
  ],
  "release_date": "2010-01-06",
  "scene_id": 54380,
  "tags": [],
  "title": "Rusty Nailed, Scene #02"
}