{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a blast from the past as we welcome back Kyle Quinn. It's been a while since we've see Kyle who is now 27, originally from Washington D.C. and is keeping busy helping out with the family business. Making his debut this week is a hot Hispano from the Pearl of the Caribbean, Cuba that goes by the name of Jacob Lucha. Jacob is 18 and obviously packin' which is why he's here. We asked these studs to tell us of all the places they've been which their favorite city would be. Exotic Fiji is Kyle's answer while Jacob, who may not necessarily be a 'friend of Dorothy', knows there's no place like home. Miami is the only place this hung, uncut hottie wants to be. Both of these studs started exploring their sexuality in middle school; and while both broke the ice with girls their age only one stuck to that dietary menu. 'Some' men can not live on fish alone. (evil grin) So to wrap things up we asked these studs to tell us what the biggest dick they'd ever seen was. Kyle saw one that was 10' long. He would've taken it too if only his hole was more accommodating. For Jacob, it would have to be his own dick. He's not being cocky, it's just, being straight; he doesn't make checking out other guys' junk a habit.Kyle and Jacob are hangin' out when Kyle asks Jacob where his accent is from. Jacob tells him he's Cuban. Kyle admits he's a sucker for a foreign accent and wonders if girls respond to it as well. Jacob assures him they do with a smile. Kyle then turns up the heat when he coyly asks Jacob how do you say 'Put your dick in my mouth' in Spanish. Jacob stands up and decides to just show him instead as he hauls out his growing uncut cock. Kyle swallows it to the hilt as he nurses on it. Jacob's cock arches south and it easily glides down Kyle's willing throat as he starts to fuck it. Kyle licks at Jacob's smooth balls before going back to worshiping that Cuban 'pingon'. He strips Jacob as he asks him how to say blowjob in Spanish. 'Mamar pinga' Jacob replies as he grins and then straddles Kyle's face as he slides his dick down his throat for more. As Jacob fucks that mouth we get our first glimpse at that str8 boy ass as it humps away into Kyle's mouth. Kyle can't get enough of that uncut dick and he's nursing on every inch. Kyle then gets up and lets Jacob return the favor. Jacob slides Kyle's thick cock into his mouth and does his best but soon realizes he's better at eating ass than he is at sucking cock.Kyle moans as he gets Jacob's tongue shoved up his tight hole making him squirm with anticipation. Something about Island men and eating ass, they just can't get enough of it. He eats that ass like a pro making Kyle so horny for dick he's practically begging for it. Kyle slides a rubber on Jacob's dick and sits right down on it. That wet hole is overdue as it takes every inch. He starts to ride on that cock as Jacob helps bounce him on his hard cock. Jacob lays back and just watches Kyle who is caught up in the ecstasy he's feeling taking that big Cuban dick. He then changes position by turning around while still sitting on that dick so that he's in a reverse cowgirl. Jacob starts to pound that ass hard in this position as Kyle leans back and takes it. Jacob then wants more control of that ass as he bends Kyle over against the wall and shoves that meat back inside. Jacob's smooth balls slap away at that hungry ass as he fucks him harder and deeper. That Cuban dick sends Kyle over the edge as Jacob pulls out so Kyle can lay back and bust all over himself. Jacob then kneels over Kyle's head as Kyle sucks his cock until Jacob shoots that fat load all over Kyle's face.",
  "models": [
    {
      "name": "Jacob Lucha",
      "person_id": 28855
    },
    {
      "name": "Kyle Quinn",
      "person_id": 28443
    }
  ],
  "release_date": "2012-04-18",
  "scene_id": 54394,
  "series": "The Rosetta Bone",
  "tags": [],
  "title": "Jacob Lucha & Kyle Quinn Interview"
}