{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'Pretty in Pink' seems to be the unplanned theme this afternoon, as we get better acquainted with today's 'garcons en qu?te' (Boys looking) and we all know what they're looking for. To your right, in a dark pink tee sporting the phrase 'I do my own nude scenes' is none other than Scott Alexander. Scott  is from Houston, TX and was last with us this Summer. Our fans can't seem to get enough of this tall 37 year old Texan queer who's as BIG as a steer-- let alone his chocolate thunder stick. (Yeah, we went there!) We'll need to ask his co-star, Feliz Andrews, if he could give us a better idea as to why, since he'll soon have personal experience to draw from while reflecting on all things 'Scott'.  Hailing from the west coast of Florida, Feliz  is 21 and has been on our site a few times. We're always happy to have him with that sexy body and a smile that could brighten the darkest day. We asked these two if they could have a fantasy walk-on role on any TV show what would it be? Scott admits he's a Soap Opera Junkie and that he would want to be on General Hospital. Hmmm. Feliz grins and says he'd want to be in a new show on cable called 'HUNG'. 'Big dicks run in my life' he laughs and we actually have the footage to prove it. On that note, Let's give Feliz the opportunity to add yet another hung episode to his ExtraBigDick repertoire.There's no doubt that the chemistry between these two is set to boil as they immediately begin kissing and tugging at each others clothes. They make out as they get better acquainted and better un-suited for what to come. Scott licks on Feliz' smooth abs as he undoes his jeans and pulls them off. Once Feliz is stripped down to his drawers, Scott has him where he wants him as he pulls down his briefs and has his first taste of 'Happy'. Feliz watches as Scott starts to suck on his uncut cock. Scott swallows every delicious inch as he continues his oral assault. He's nowhere near done with his plans. As he peels off Feliz' briefs, he can now move on to phase 2. Scott then gets Feliz on all fours and gets a spectacular view of the next course. Well, this one is all-u-can-eat, and that ass just screams 'BUFFET!' Scott dives into that smooth ass tongue first as he licks and sucks at that hole he'll soon plunder. Feliz is moaning in ecstasy as he gets that sweet ass worshipped. Now it's Scott's turn as he lies back and gives Feliz access to his thick 8' cock. We guess Feliz was right, big dicks DO come his way --but we're getting ahead of ourselves. Feliz strokes Scott's uncut cock as he works as much as he can take, making Scott moan and want more.After Scott's had enough of Feliz' mouth on his dick, he wants a deeper fit, and gets behind Feliz before sliding his cock deep inside Feliz' hot ass. Scott is soon fucking away as Feliz grunts and moans, begging for more. Feliz reaches back to kiss Scott as he continues taking a pounding. Feliz wants easier access as he straddles Scott and impales himself on his thick cock. Scott wastes little time before slamming his dick deep inside Feliz. He easily bounces him on his dick as his heavy balls slap away at Feliz. Feliz moans as his ass gets stretched. They kiss passionately as they continue their fuck session. Scott then gets Feliz up and bends him over. His prize awaits. Within seconds, he's back to fucking Feliz doggy style. A camera view from below shows Feliz' ass taking every inch of Scott's cock as Scott jack-hammers into his hungry ass. They both egg each other each on, begging the other for more, unable to get enough ass or cock. Feliz then flips around and rides Scott in a reverse cowgirl as Scott continues to bury his cock. The only thing left is missionary, and Scott takes them both home as he fucks the cum out of Feliz who explodes all over himself. Scott then pulls out before spraying his own seed all over one satisfied Feliz Andrews. Job well done.",
  "models": [
    {
      "name": "Feliz Andrews",
      "person_id": 27962
    },
    {
      "name": "Scott Alexander",
      "person_id": 28046
    }
  ],
  "release_date": "2009-11-11",
  "scene_id": 54396,
  "tags": [],
  "title": "Pole Dancing, Scene #02"
}