{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we decided to bring you a little bit of Happiness; and Happy brought a friend. Feliz Andrews is back and hotter than ever. Feliz  has been tanning and working on that bod since we last saw him. This west coast Florida boy always knows how to have a good time, and today he'll be having a good time with another Florida Boy. Hailing from the east coast is Johnny Deep. Johnny is 22 and from Palm Beach County, FL. Tall, dark and delicious, this Floridian is more of a Ladies man. He admits he likes girls with big butts and dark features. Johnny has trouble written all over him. When asked if he's single or dating, he flashes us that brilliant smile and says, 'Let's just say I'm single and loving it' Even though Johnny loves the women he enjoys men occasionally. Hmmm. Fortunately for Feliz, he has the dark skin and dark features Johnny likes covered. When it comes to men, Johnny doesn't really have a 'type'. He likes guys that have things in common with him. 'If it's good conversation and they're attractive, it's golden'. Apparently he thinks with his big head when it comes to other guys; and his 'other' head when it comes to women. America could use more guys with a more direct approach like Johnny. Today, however, Feliz will discover why they call him Johnny 'Deep' They waste little time before getting better acquainted and by the time we start filming they're already sucking face. Their tees come off as they begin to lick and suck at each other's smooth chests. They strip down and let the fun begin as Feliz kneels before Johnny to get a taste of that sweet dick. Johnny's head rolls back as Feliz works his magic on his spirit stick. Feliz has more than a mouthful as he sucks on Johnny's thick cock. The more Feliz sucks on his meat the harder and longer it grows. Johnny gets to sit back and watch as Feliz worships his meat. Johnny then stands and has Feliz sit on the couch so he can feed him more dick as he stands in front of him for a little face-fucking action. Now it's Johnny's turn to return the favor as he kneels between Feliz' legs and goes to work on his rock hard cock. He bobs up and down on Feliz' boner and gives us quite the oral performance for a 'Ladies man'. lol Feliz can now watch as Johnny does his best to suck his cock deep into his mouth and throat. The sounds of Johnny's slurping fill the room. Soon these sounds will be replaced by those of Johnny fucking ...shall we?Feliz stands in front of Johnny and sits down on his cock. Johnny braces himself as he holds on to Feliz' cock and waist as Feliz begins to ride his thick dick. The camera gets behind the action, and we can see what Johnny's seeing: Feliz' hot ass swallowing his meat all the way to the hilt. Johnny grinds up into his ass as he meets Feliz with every thrust. Johnny wants more control as he pushes Feliz over toward the couch and slides his meat back in doggy style. 'Deeper!' groans Feliz, as Johnny's balls continue slapping at his smooth ass. Johnny looks delicious as he bites his lower lip and steadily feeds that hot ass the dick it deserves. 'You like that big dick?' Johnny teases as he continues his anal assault. Johnny then grabs Feliz' cock and starts jackin his cock faster as he fucks him faster. Feliz is moaning and in ecstasy as Johnny's dick hits all the right spots. Johnny then puts Feliz on his back and fucks him like a bitch. Holding his legs in the air, Johnny pounds his thick dick deep into Feliz. That big dick is hitting Feliz' happy spot. As Johnny fucks him harder and faster, he's sent over the edge as Johnny fucks the cum out of him. Johnny then pulls out his own throbbing cock and blasts his hot, thick batch all over Feliz' cum-coated happy trail. --DAMN",
  "models": [
    {
      "name": "Feliz Andrews",
      "person_id": 27962
    },
    {
      "name": "Johnny Deep",
      "person_id": 28636
    }
  ],
  "release_date": "2009-11-04",
  "scene_id": 54397,
  "tags": [],
  "title": "Hard Candy, Scene #01"
}