{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have two new faces on ExtraBigDicks and these two young men bring with them 21 reasons why we will more than love them here on our site. Both of these boys represent what every size queen, self-proclaimed or closeted, dreams of discovering once that button fly is ripped asunder and the bulge straining beneath the tight briefs is finally let loose. Wait for it--this is about to get really good! Devon Moss is the first of our new 'morsels'. Devon  is a baby-faced 20yo from North Carolina. Devon is currently single and we're sure the boys in North Carolina are loving him and all of his larger than life 10' cock. Oh yeah, he's packin a horse-sized cock on that country boy frame. Devon lost his cherry at 13 in a threesome. I guess several boys wanted in and who could say no to that smile? To Devon's right, is an Island import named Mario Costa. Mario is 23yo and originally from Cuba. Mario has been in Miami for about 10 years. He, like Devon, always knew he was into men and is also currently single. They are both into muscular, jock types and they have more than their tastes in common. Mario is also gifted in other departments and has a cock big enough to probably float to freedom on. Cuba might have amazing beaches but Mario and his thick 11' uncut cock are on this side of the Florida straights. Ok, please put on your 3D glasses....NOW!They slowly break the ice as Devon softly kisses Mario's neck. Their hands are roaming on each others crotches as they begin. Devon stands and pulls off Mario's tee as he begins to lick his chest, Mario returns the favor and it isn't long before Mario is lying back with Devon getting those jeans off him. Mario's cock is straining against his briefs and when Devon finally pulls them down his thick uncut cock comes into view, it's massive with his thick foreskin framing the end of his knob. Devon immediately engulfs it as he tries to suck on as much of it as he can into his full lips. Mario bobs his head up and down on his meat as he revels in the new sensation. Then it's Devon's turn as Mario gets him out of his jeans. He undoes his pants and hauls out his thick dick even before his pants are completely off. Devon's cock is as thick as a beer can and Mario wants to show his appreciation. Devon holds his thick meat with both hands while Mario licks and bobs on the end of it as Devon licks those lips of his and enjoys the attention he's getting from his Latin lover. Mario kneels as he strokes his massive meat while polishing Devon's. These two are working themselves up into quite the horny frenzy as they get up to compare notes...among other things.Standing side by side these two swing their massive cocks around as they show off for each other. The camera gives us a view from below and all we see is uncut dick and lots of it. And now the weather: Horny with a strong chance of hot cream showers. Mario sits back and suits up before Devon sits on his cock. As Devon impales himself on Mario's thick dark meat, his own cock is jutting out like a trampoline. Any takers? Slowly his ass accepts the intruder who wants in and as he moans and groans slowly takes more of that Cuban cock inside his smooth bubble butt. Devon does his best to accommodate Mario's 'pingon' as he rides him at an angle. His face tells us everything as he grunts and grimaces with every descent. Mario just sits back and watches as he gets that dick further and further inside Devon's sweet ass. Mario then switched things up and puts Devon on all four as he slides back in for more. Mario has the upper hand now and better control of the ass he's getting. Devon can only cry out as he gets his ass stretched and we imagine his prostate and lower intestines tickled. (...and by 'tickled' we mean--OUCH!) Mario isn't phased by his cries and buries his cock even deeper than before and gets every inch inside. As Mario gets close he hauls out his cock and they sit side by side jackin off their over sized dicks. They look like two soldiers polishing the barrels of their bayonets. Mario is first to nut sending his Cuban cream all over his smooth abs and Devon brings it home as he watches the Cuban fireworks and shoots his own batch all over himself.",
  "models": [
    {
      "name": "Devon Moss",
      "person_id": 30478
    },
    {
      "name": "Mario Costa",
      "person_id": 28031
    }
  ],
  "release_date": "2009-10-07",
  "scene_id": 54406,
  "series": "Sword Fighting",
  "tags": [],
  "title": "Sword Fighting, Scene #02"
}