{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a dark, brooding, Latin hunk that we're sure will please. Dark featured and sporting a smile that could lighten any room are just a few of the qualities 26yo Ricky Maletti brings to the table (...and by 'table' we mean boudoir...and by boudoir we mean--Oh look it up!). Originally from Colombia, Ricky knew at an early age that he had a little more in his uncut package. 'I had three sisters and I'm the only boy; so they always teased me about it' he blushes. His first girlfriend also used to tell him he was 'black' from the waist down. Now theres a visual. Ricky was a late bloomer and lost his virginity at 18. He admits he gave it the old 'college try' for about 2 years before realizing that girls (and the closet) weren't for him. He had his first gay experience at the age of 21 and has never looked back since. Currently, Ricky is partnered and has been with this lucky guy for about a year. When we asked him what it was about this guy that makes him stick around; he admits that he has always been into white boys. Opposites do attract. Turns out he scored when he found a white boy that fit the bill: tall, a gr8 smile and green eyes. Detail-oriented and caring, Ricky's beau landed his heart--and in a sec we'll get to see what else he 'gets'. Lucky fuck!Dressed in coveralls, Ricky slowly begins to undress. He opens his coveralls to reveal a sexy grey tank beneath. As the coveralls open we see more of Ricky's defined frame. His sun-kissed abs slowly come into view as Ricky pulls up his tank. Clearly, he's over dressed. The coveralls drop by the way side leaving Ricky in his tank and briefs. He's no stranger to the gym and his tight tone body is a sight to behold. He peels off his tank and begins to tease us as he turns around and starts massaging his ass. He slowly lowers his briefs as we get our first glimpse of his smooth, bubble butt. His smooth ass is firm and inviting as Ricky kneads his cheeks for us to watch and want. As the camera pans around to the front, we see Ricky grabbing his growing boner through his briefs as he begins to sport wood. He sits back on his utility ladder where he continues massaging his boner. He then hauls out his delicious uncut marvel that's run out of room in his briefs. He slowly strokes his meat as his smooth balls rise and fall in time with the motion above. Ricky's sexy eyes are trained on his meat as he strokes off both over and underhand.He leans back against the wall where he continues stroking his now aching cock. Ricky is naturally smooth and has light hair on his legs and a natural patch at the base of his dick. He keeps his body hair in check but natural looking. The cam gives us a view from above as Ricky looks up at us as he licks those full lips. His defined pecs tense and twitch as he slowly strokes his meat. There isn't a bad angle on this stud and the more we see--the more we want. Ricky then lies down on the floor to get a bit more comfortable as he prepares for the fireworks. As he lies back, he spreads those muscular thighs and we get a view from below looking up at that furry ass, smooth balls and rock hard cock over his smooth abs and chiseled pecs at that seductive face. Ricky's knob is glistening by now as he begins to pick up the pace. His balls, once hanging, are now pulled up tight against the base of his uncut bone. It won't be long now before we get our first explosion of 'Crema Colombiana' (Colombian cream). Ricky's eye's roll back as a guttural moan leaves his sexy lips. His cock swells and without much ado begins to unload. Ricky writhes in ecstasy as his nuts empty out their precious cargo leaving a thick creamy pool of leche caliente (hot milk) atop his edible self. Mmmm--Hold the coffee, Juan Valdez!",
  "models": [
    {
      "name": "Ricky Maletti",
      "person_id": 28692
    }
  ],
  "release_date": "2009-09-30",
  "scene_id": 54408,
  "series": "Painting The Town White",
  "tags": [],
  "title": "Painting The Town White"
}