{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "After a much anticipated wait, we finally have one of the industry's brightest stars doing his very first web-only production here at ExtraBigDicks.com. We're talking about none other than Diesel Washington. Diesel is 40, originally from Brooklyn, NY; and the only thing hotter than his 6'6 body is his impressive body of work. Diesel plays an aggressive alpha male top on video, but he's the first to admit he's actually a big teddy bear, and that what he does in front of the camera is just a 'role'. Having met him in person he's one of the sweetest guys we've had the pleasure of working with. Along with Diesel, we have a familiar face, on our brother site MenOver30, Kain Warn, who was lucky enough to get the co-star role with Diesel. Kain  has extensive experience handling the 'Larger than Average'. Enough said. Kain is 25 and a Florida boy. Kain has a boy-next-door look, but does his best to distance himself from it. He likes things a bit more 'a-la-raunch' and gets into things nowhere near vanilla. Kain hangs out at coffee shops with friends on his free time and enjoys having good conversations. Diesel, on the other hand, is more of a comic book shop geek. Believe it! His favorite character you ask? Lucas Bishop a time traveler from the year 1191. Just Google it.There's no lack of chemistry between these two as they begin to make out immediately. Diesel pulls off Kain's shirt as he continues to suck his face. Diesel's tee is next, giving Kain, whose mouth is at nipple level, access to his smooth chest. Kain undoes Diesel's jeans as he buries his face into his boxers. The boxers come off as Diesel's growing meat lands in Kain's mouth. 'Stick that tongue out', Diesel orders, as he feeds him his thick meat. Diesel gets hard in his mouth and begins to face fuck the Florida native. 'Yeah gag on that good dick' he chuckles as Kain needs to take a breather. Diesel goes back to kissing him as he undoes Kain's pants and starts to suck on his meat. Kain is sporting his Prince Albert. Diesel licks and tugs at it as he swallows it to the hilt. Diesel then stands up and grabs Kain, literally picking him up as he places him on all four on the couch. He then dives into his hairy ass, tongue first, as he gets that hole ready for a fucking he won't soon forget. Diesel is working that ass deep as he spits on his ass and shoves his tongue as deep as he can. Diesel then sits back; spreads those massive thighs wide, and has Kain get his cock rock hard again. You gotta lick it--so u can stick it.Kain braces for it as Diesel starts to shove his massive cock inside his spit-soaked ass. All Kain can do is grunt as Diesel coaxes him as his ass starts to give way. 'That's what I've been looking for', sighs Diesel as his meat slowly starts to get easier access. He starts fucking Kain faster and deeper. It isn't long before he's bouncing Kain's hot ass on his thick dick. 'There it is, gimme some more' he coos, as Kain continues to take one hell of a pounding. Diesel can't get enough of Kain's ass as he watches his thick black cock disappear deep inside him. Kain's face tells us everything we need to know as he grimaces with every thrust Diesel buries. Diesel holds Kain in place, grabbing his shoulders and pulling him back hard to repeatedly impale him on his meat. Kain is taking this fucking like a champ as Diesel has his way with his ass. After fuckin him doggy all this time, Diesel switches it up and puts Kain on his back before going back in missionary. He continues to slam that meat inside Kain, whose legs are in the air as the fucking continues. Diesel pounds away, and as he gets closer, he sits Kain down on his dick and fucks the cum out of him. Kain jacks his dick off with an ass full of Diesel. There's a visual. Then Diesel strokes his thick load off and splatters it all over Kain's chest as he kneels before him. Whew. ",
  "models": [
    {
      "name": "Diesel Washington",
      "person_id": 28049
    },
    {
      "name": "Kain Warn",
      "person_id": 27924
    }
  ],
  "release_date": "2009-10-14",
  "scene_id": 54404,
  "series": "Diesel Power",
  "tags": [],
  "title": "Diesel Power"
}