{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "ExtraBigDick poster boy Josh West is back this week, and we are glad to report that he is no longer a 'West' coast kinda guy. Since we last saw Josh, he has moved cross-country and now calls Fort Lauderdale home. 'Film it and they will cum' they say--or something like that. Josh says the hardest part of adjusting from one coast to the other is the humidity. Yeah living in the sweltering tropics has its downfalls; but the scenery is quite amazing. Well, this week we have a new face on our site named Kevin Cavallie. Kevin is 24 and originally from NY and now lives out in California. Hmmm. Seems like California's all around Mr. West. Josh loves it here and admits he is definitely enjoying the beaches. Kevin considers himself an all-around jock. He spends most of his free time doing sports, and is very competitive. His favorite sport happens to be baseball.  When it comes to sex, Josh admits on a scale of 1-10 he comes in at about an 8 on the kinky scale. Kevin says he's more like a 5 he can go either way, literally. Kevin prefers the ladies; but sex is sex. Well, there's a catcher's mitt with his name on it--so let the games begin!'Batter up' as these two break the ice kissing passionately. Kevin pulls off Josh's tee and starts to explore his hairy pecs before going right back to sucking face. Josh closes his eyes in ecstasy as Kevin's tongue begins to roam all over his chest and hairy abs. Kevin is a tall one with a beefy frame. He has a sexy star tattoo on his neck and a larger one across his back. His short cropped fade has a design shaved in, and those sexy pouty lips make this bi-curious buddy quite irresistible. They strip down to their underwear. Kevin gets on his knees as he begins to lick at Josh's cock, which is exploding out of his underwear. Kevin can't take the anticipation much longer and hauls out Josh's massive meat. He opens wide as he tries to shove as much of that xtra thick dick inside his mouth. He licks and sucks along its massive length as Josh moans at the new sensation. Josh slowly begins to fuck Kevin's mouth as Kevin strokes his shaft while sucking on as much of his dick he can get in his mouth. By now, Kevin has pulled out his own impressive dick and is stroking it dry as he licks Josh's cum laden balls. Go str8 boy, Go str8 boy! Kevin looks up at Josh almost submissively as he chokes on his thick dick. Now it's Josh's turn as he kneels before Kevin and goes to work on his rock hard baby maker. Kevin is completely hairless and even shaves his crotch. He's any tongue's wet dream. Kevin forces Josh on his meat and bobs his head wanting to bury his own meat deeper.Speaking of burying meat, Josh finally gets Kevin on all fours before he starts to shove his over-sized dick inside our straight boy's ass. Steady she goes as Kevin's ass begins to give way to its intruder. Josh is soon balls deep in his smooth ass and loving every thrust he gives that hungry ass. Kevin's face tells us everything as he tries his best to accommodate that massive cock taking his ass. Josh doesn't wait for long before he goes for it and starts to fuck him good. Kevin's smooth ass is bouncing back onto Josh's fat dick, which is now finding itself buried as deep as it can possibly go. It feels amazing as Kevin wraps around his dick; but Josh wants it even deeper. He sits back on a chair and has Kevin sit on him. He watches as Kevin lowers his ass onto his dick and in no time, Kevin is riding Josh like a true cowboy. Josh's eyes gloss over as he holds onto Kevin's waist and watches his dick disappear inside that ass. Josh loves it and wants to fuck him deep, so he pushes him forward onto the couch and starts to fuck him deep. His balls are slapping Kevin's ass as he pounds that ass harder and faster. This bi boy's gonna remember this fucking and Josh can't hold back anymore. They sit back and jack off as Josh explodes a massive load all over his face and chest, followed by Kevin who shoots all over his own.",
  "models": [
    {
      "name": "Josh West",
      "person_id": 27931
    },
    {
      "name": "Kevin Cavallie",
      "person_id": 28060
    }
  ],
  "release_date": "2009-10-21",
  "scene_id": 54401,
  "tags": [],
  "title": "Bases Loaded, Scene #01"
}