{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'Walk tall and carry a BIG stick' is a credo that not everyone can live up to; but today we have a native Floridian that can do both those things. His name is Peter Stamin. He's 22 and from the Tampa Bay area. He is currently seeing a girl back home who's a natural red head. She has big tits, a nice ass and the carpets match the drapes. How often does that happen?  She's not typical of the girls he likes seeing as he prefers dark haired lovelies; but it's been about a year now and it seems to be working out. He's a leg and ass man and she has both, tits and ass; so he's not complaining. He loves ass and will do as much as she will let him. He found out he had a big dick relatively early and confesses he thinks big dicks run in the family. He's relatively new to the industry and admits it's not as easy as he thought. There's a lot more going on behind the scenes than he imagined. He's always horny and started wackin' his larger than average fuck stick at about 16 and now he indulges it at least 3 times a day--morning, noon and night. This morning, he's already behind schedule.We walk in on Peter who started the party early as he's already jackin off to the porn he brought. A bit embarrassed, Peter puts his boxer briefs back on and excuses his early departure on the 'Get-Me-Off' Express. Well, we ain't mad at him. We're gonna see the dick that started the rumors sooner or later; so we have him sit back on the couch and get back to business. He hauls out his half hard cock and begins to tug on it. It responds and within seconds his thicker than average 8' meat is at full mast as he watches his str8 flick. His boxers are pulled just below his smooth balls and we get to see his smooth, naturally defined 6'2 frame as he sits back and jacks his rock hard meat. He stands and loses the boxers as he playfully swings his fat dick around in circles as he plays 'Propeller Pete' with his extra thick meat. Now there's a flight we'd all love to get on. He keeps his bush trimmed close and he barely has much hair on those smooth thighs or long legs of his. He grabs that meat again and begins to work it as he strokes it, giving it the proper attention it deserves.He goes back to the couch where he makes himself comfortable sitting on the arm rest. His meat is rock hard and as he jacks his dick faster, his balls bounce in tandem as he starts to pick up the pace. His sexy face takes on a more focused look as he concentrates on the rather large task at hand. Not wanting us to feel left out, Peter stands up and bends over the couch to give us a view of that str8 ass. Though he's not looking to give it up anytime soon he wants us to know what we're missing out on. Fucker! lol His ass is compact and as deliciously smooth as the rest of him. His low hanging nuts still bouncing as he jacks his cock underhand. Peter then gets back on the couch, sits back and spreads those thighs wide, as he heads for the home stretch. He jacks that fat dick faster and harder and as he does his breathing begins to deepen as subtle moans begin to escape his lips. His abs tense as he groans softly and without much ado his cock erupts sending his load airborne. His smooth balls pull up tight--locked and loaded as they coat his abs with his thick baby batter. And now, all is right with the world.",
  "models": [
    {
      "name": "Peter Stamin",
      "person_id": 28495
    }
  ],
  "release_date": "2009-08-26",
  "scene_id": 54417,
  "series": "A Star Is Porn",
  "tags": [],
  "title": "A Star Is Porn, Scene #01"
}