{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back in the house is the man, the myth, the 'Legend', Mr. Jessie Alan. Jessie was here last week and gave us a sweet session with that 9' uncut python of his that left many lickin' their monitors. This Tampa, FL native is more than a handful and he discovered he was packin more than the average bear early on. The first to tell him he had a huge cock was a set of twins he messed around with and compared size. Some boys have all the luck. Sounds like our exclusive top boy always had a hole or two available with those sexy twins around. Today he'll be tappin younger ass again in the form of a sexy Jacksonville boy by the name of Isaac Summers. Isaac is 20 and now lives in Ft. Lauderdale. Isaac is single and likes it that way. Isaac is also packin a big dick and he smiles when we ask him about it. Isaac, like Jessie, concurs that big beef runs in the family and he's glad his DNA landed him an EBD. Isaac is versatile and likes to take a big dick as much as he likes to give a big dick. Isaac discovered how much bigger he was when he fooled around his last year of high school when he and a friend were left alone in class. Now that definitely deserves extra credit. Speaking of extra, we need to let these two pull out their big dicks and show a whole lot of 'extra'. There's no ice to break here as these two begin to make out. Jessie is laying back and kissing Isaac as Isaac's hand begins to roam up under Jessie's t-shirt. Jessie's 'Thug Love' tattoo comes into view immediately as Isaac continues to explore. They take their tees off as they continue to undress each other. The jeans come off leaving them both in bulging briefs. Isaac can't keep his eyes off Jessie's boxers and he's not about to play coy as he pulls them down to get a closer look. Jessie's massive meat springs out as it throbs thicker and larger by the second. Isaac goes down on it getting as much of it as he can in his hungry mouth. Jessie steadily bobs Isaac's head on his meat wanting to get as much of his meat in Isaac's warm mouth. Then it's Isaac's turn as he drops his briefs releasing his own meaty cock. Jessie wastes little time before swallowing his uncut cock. Isaac's rock hard in seconds and judging by the smile on his face, Jessie's doing a great job on his meat. Jessie swirls his tongue around on Isaac's cock while his finger begins to explore that sweet ass he will soon have stretched around his fat dick. Jessie gets up on his knees between Isaac's legs and places his monster cock over Isaac's as he strokes them together. His cock is ready for more.Isaac's ass is gonna need a little coaxing to take what Jessie wants to give him so Jessie spreads that smooth ass open and begins to lick and suck on his hole. He holds his legs up to get at that ass and as he shoves his tongue deeper, Isaac's licking his own cock that's dangling in his face. The next sound we hear is Isaac squealing like a stuck pig as Jessie invades his ass with his monster cock. 'Shhh' Jessie coaxes as he continues to bury his meat. He rams his bone all the way to the hilt as Isaac moans in a combination of pleasure and pain. Isaac gasps as Jessie pulls out only to flip him onto his knees and slams that cock back in for more. Isaac can't stop moaning and whimpering as Jessie fucks the hell out of him. He has no intentions of stopping until he gets his and Isaac's in for the ride of his life. Next Jessie sits Isaac on his meat and begins to bounce him up and down on it. Jessie's heavy balls bounce up to meet Isaac's stretched hole. 'Ride that dick' he whispers as Isaac jacks his meat and bares the anal assault he's getting. Isaac is rock hard all the while he's impaled on Jessie's cock. His thick dick bounces up and down like a trampoline as he bounces his sweet ass on Jessie. Jessie then gets him face down in the couch and starts to pound his ass deep. Isaac is almost crying as Jessie's balls slap his ass. Jessie then puts our bottom boy on his back and fucks him deep until he shoots his load all over himself. Jessie keeps right on fucking him as Isaac winces in pain. Jessie eventually hauls his cock out and jacks his load all over his navel and happy trail. DAMN!",
  "models": [
    {
      "name": "Isaac Summers",
      "person_id": 28493
    },
    {
      "name": "Jessie Alan",
      "person_id": 28496
    }
  ],
  "release_date": "2009-09-23",
  "scene_id": 54410,
  "series": "Back 9",
  "tags": [],
  "title": "Back 9, Scene #02"
}