{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a class reunion of sorts with a recent regular; alongside one we haven't seen in over a year. Steven Ponce is back this week and representing the Isle of Puerto Rico. Steven was last with us with one very hung Tommy Defendi. This spicy redhead brings so much flavor to the table with his thick ping?n and that sexy ass that we decided this week we needed to flip the script. Next to Steven is a face we haven't seen in a while belonging to Mr. Tucker Forrest. Tucker hasn't been around because he's been traveling and had taken time off to get back home to the Midwest to see the folks. It was interesting to run into his old friends who had seen his recent 'exploits' online. ''I didn't know you were doing porn' they say and its weird cuz they are all shy about it...and I'm not.' Steven is also no stranger to being recognized on the street by fans and men thinking they've 'met somewhere before'. Mmhmm. The biggest thing most guys are surprised to find out is the actual hours of work involved in the whittled down version they get to see as the final product. Regardless the best part of what they do is that they get to fuck hot men and get paid for it!They begin to make out as they break the ice. Their hands are all over each other as they begin to pull of tanks and tees. As they strip we get to see their naturally smooth, defined chests as they lick and suck every exposed inch they can. The jeans are next as they begin to tug on those til they come off. Both of these hung studs are poppin' tents in their briefs as Steven goes down on Tucker's cock. He licks it through the cotton for a few but it didn't take half as many licks to get into this center. Tucker's cock is quickly engulfed in Steven's hungry mouth as he swirls his mouth all over it. Tucker's 8' bone is rock hard and at Steven's command. Steven's expert mouth works Tucker's shaft and balls sending him into orbit as his eyes roll back and a huge grin stretches across that face. Steven is boned up and wants some attention too as he stands up and lowers his briefs. His thick, meaty shaft springs out and isn't out for ling before Tucker latches onto it. He readily deep throats every inch of his meat as Steven gasps his appreciation with moans and groans. Tucker bobs his head up and down on Steven's dick with ease making him hornier for more than just his pretty mouth. Tucker's not gonna have to wait for long as Steven puts him on all four. He greedily dives inside his ass tongue first getting that sweet bubble butt ready for some Puerto Rican dick. Steven's going to town on his ass lapping deep into him and running his tongue from the tip of his shaft all the way up into his hungry hole. Now spit lubed and ready for more, Steven puts his thick dick where it wants to be?inside Tucker's sweet ass. His cock glides in with ease and in no time his balls are slapping away at Tucker's smooth ass as he fucks him ball-deep. An over head shot gives us a gr8 view of Steven's thick dick disappearing up inside Tucker's hot ass. Steven's balls are pulling up tighter around his shaft as he continues to bury that dick deep inside Tucker. Tucker just grunts and takes it as Steven fucks his ass. It's Tucker's turn as Steven lies back on the couch and feels Tucker's own rock hard cock up inside his ass. Tucker slowly fucks his ass burying his meat with every long thrust. Tucker grinds his cock deep into him picking up the pace and working Steven's prostate just right causing him to explode as Tucker fucks the cum right outta him. Tucker then pulls out and jacks his own huge nut all over his smooth chest. Well, it looks like our work here is done.",
  "models": [
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    },
    {
      "name": "Steven Ponce",
      "person_id": 27969
    }
  ],
  "release_date": "2009-09-09",
  "scene_id": 54414,
  "series": "Thunder & Lightning",
  "tags": [],
  "title": "Thunder & Lightning, Scene #02"
}