{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Today it's 'Bring a Breeder to Work' Day here at ExtraBigDicks and we have one of fan favorites back to give us an update. Sexy Trey Turner is back and apparently no longer on the market. Trey  gushes as we ask him about his new beau. Apparently he pulled a U-Haul (lesbian lingo for fast-tracked) and they are now living together.  'He totally gets me as a person and knows where I'm coming from' Trey says 'that's what got me.' While Trey floats back to earth, we turn our attention to a new face we recently became familiar with, Mr. Peter Stamin. Peter  doesn't have a boyfriend waiting for him back home. Peter has a girlfriend he's been dating for about a year now. For those of you who missed Peter last week, Peter's been dating a redhead and assures us the carpets match the drapes. He lost his virginity at 16 and admits it was a mess having to be quiet with the girl's mom in the next room. Today Peter is going to lose a cherry of a different flavor going where few str8 men have boldly gone before! Well...that may not be necessarily true (after all it IS Trey); but Peter will be burying his larger than average cock inside another guy for the first time. 'Sometimes you gotta open up and explore yourself and see what happens'. We can't argue with that.Trey reaches over and begins to undo Peter's jeans as Peter sits back and focuses on the flick before him. By the time Trey hauls out his cock it is rock hard and ready for attention. He goes down on Peter's massive meat which immediately makes the straight boy start to squirm as he revels in ecstasy. Trey then gets up to give Peter access to his own meat which Peter takes out and samples as well. Peter is apparently committed to this opening up concept as he sucks on Trey's cock. After a bit of oral, Trey wants more of Peter's cock so he goes right back to nursing on his thick meat. Peter's body is naturally smooth and lean. His abs ripple as he slowly fucks Trey's mouth wanting more. The chemistry between these two is perfect as Peter allows himself to explore his new found desires. He goes back to sucking on Trey's cock which by now is rock hard and aching for release. Trey just sits back and watches as the str8 boy plays with his cock like he's discovered a new toy. Peter grabs it by the base, shakes it about before going right back down on it. He can't seem to get enough of a good thing; and things can only get better at this point. Trey goes back to work on Peter's cock getting it harder for what's to come.Trey can't seem to get enough of Peter's uncut meat and he seems to be in good company as they maneuver into a hot 69. The foreplays building towards even more excitement and before we know it we're hearing Trey groaning 'Oh yeah, fuck my ass!' as Peter's balls are slapping his ass. Peter is fucking Trey doggie-style as Trey moans with delight. Peter then flips Trey on his back and slams back in for more of that sweet ass. Peter's thick dick isn't having any problems fucking in new territory as he tears Trey's ass up. Peter is rock hard and slamming deeper and deeper giving Trey the fucking he craves. They both stand as Peter bends over his new conquest and rams that thick dick back inside as he continues to pound his new friend with privileges. Trey is in heaven as he gets his ass tagged by a hung str8 guy losing his proverbial (gay) cherry up his experienced ass. All this fucking is sensory overload for Peter whose balls are feeling that familiar tingle as he pulls out and strokes his cock off all over Trey. He explodes coating Trey's smooth chest and cock with his batter which in turn sends Trey over the edge. Trey grunts sending his own load lassoing into the air as he adds to the milky mess all over his navel and chest.",
  "models": [
    {
      "name": "Trey Turner",
      "person_id": 27927
    },
    {
      "name": "Peter Stamin",
      "person_id": 28495
    }
  ],
  "release_date": "2009-09-02",
  "scene_id": 54416,
  "tags": [],
  "title": "A Breeder Apart, Scene #02"
}