{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we have a fresh face here on ExtraBigDicks. At 22 years of age, this native Floridian from Tampa goes by the name of Jessie Alan. Jessie is a rowdy, hands-on kinda guy who isn't afraid to speak his mind. In fact, the only time he ever broke a bone was in his wrist, while punching a guy in the face. He got an early start as a lover before he became a fighter losing his cherry at the age of 12. Even at 12, he already knew he was packing more in his underoos than the average school boy. Hmmm. Jessie admits big dicks do run in his family and he has two other brothers that are just as hung. Jessie first started playing with his larger than life weenie when he was 9; a bit of foreshadowing since his boy pecker would one day grow up to be an extra thick 9' uncut fuck stick. That dick of his has many more than interested on being on the receiving end of a grudge fuck. (Line forms to the left!!) He started fooling around with guys in middle school and now he's an equal opportunity lover. He's packing the kind of meat that has many taking a double take and others second thoughts. He smiles and admits he loves talking them into it anyways, and most of them eventually give in to his thick dick. Can't say we blame 'em.Jessie starts by rubbing his growing meat through his shorts. He's sporting a pop-tent in his briefs from the moment he undoes his fly. He pulls off his tee, giving us our first glimpse at Jessie's inked torso. This bad boy is inked all over his sexy, smooth frame. His chiseled chest is a canvas for his tats, and the smoldering look from those mysterious eyes combine to create quite the irresistible package--wait--it's gonna get even better. He lies back on the couch as he begins to rub his cock around. It has a mind of its own as it finds its way out of his boxer briefs. His thick hooded head comes into view, and Jessie makes sure to give it all the room it needs as he loses his briefs altogether. His main tattoo across his navel that reads 'Thug Love' crowns the impressive sight just beneath it. Jessie's rock hard python is at full mast as he jacks that meat slowly. He takes his time so we get a close up view of his monster meat and those weighty nuts of his as they dangle below. Told you it was about to get even better. He spreads his thighs wide as he works his meat with both hands. With a dick this big, you have to make sure you have every inch 'handled'.Jessie continues to pleasure himself, all the while lying back and stroking that meat, creating an amazing landscape view of his muscular frame and the numerous tats that adorn his torso. He sits back and bites his lower lip as he concentrates on that monster dick he's taking care of. Jessie switches up his stroking using different techniques to keep his cock rock hard. His thick foreskin easily glides over his beefy knob as he strokes up and down along its impressive length. Jessie stands and as he does, we get to watch that big dick just hanging from his lean frame. It's nothing shy of amazing. How he can get all that blood below without feeling a tad faint. The view from below as we get a peak at that off-limits ass and his slowly tightening balls is delicious as Jessie continues to work up a load for us. All his work is paying off and as he feels that familiar tickle in his heavy nut sack he lies back on the couch and focuses on getting his thick cock off. His breathing begins to deepen as his fist goes into a flurry. His heavy balls are now tight up against his cock base, and he's seconds from exploding. He grunts aloud as his thick meat sends volley after volley of thick cum all over his navel and happy trail. Now that's what we call a BIG finish. :) <sigh>",
  "models": [
    {
      "name": "Jessie Alan",
      "person_id": 28496
    }
  ],
  "release_date": "2009-09-16",
  "scene_id": 54412,
  "series": "Live Life",
  "tags": [],
  "title": "Live Life"
}