{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have more meat for you size queens (you know  who you are) in the form of one Tommy Defendi and that ExtraBigDicks. For those of you who haven't had the pleasure, Tommy made his debut about 2 months ago. He's 19 and originally from Chicago and packs a rather impressive 9' cock. Alongside our Meat Packer is a slice of Puerto Rico, Steven Ponce. Steven  is no stranger to handling large equipment. He's been living in Florida for 5 years and aside from friends and family, he immediately says he misses 'nothing' about Puerto Rico. Well, as big a playground as the Fort Lauderdale area is; that is easily understandable. Steven is all about the dick and likes Latinos because they're passionate; but 'gringos' have a certain spark too. They all have something different to offer. Tommy on the other hand was str8 when he started doing porn; but now admits he's experienced new things and is more attracted to men than he was before. His ideal scenario would be to find a hot couple and have the chance to do them both with his thick dick. Steven laughs and says he'd rather have the girl just go home...All in favor say 'Ay'! The chemistry between these two is more than apparent even before we start filming. They begin kissing softly as they gradually begin to undress. Steven undresses Tommy eager to get at that cock he's heard so much about. In no time all we hear is Tommy moaning as Steven bobs his hot mouth up and down on his rock hard fuck stick. Tommy gets up so he can give Steven better access and Steven goes to work on his meat. He strokes his cock as he swirls his mouth and tongue up and down the length of his meaty shaft. Tommy's cock is a thick piece of Midwestern Maverick and Steven can't seem to get enough of it. Tommy is tall and has a naturally lean and defined frame. Tommy wants some dick too as they get into a hot 69 on the couch. Tommy's thick dick is dangling in Steven's face as he suckles on it from below; while on the other end, Tommy is sampling the Puerto Rican 'bicho' (bee--cho). Steven goes back for more of that Chicago meat as he continues to swallow Tommy's thick dick, getting it nice and wet and ready for what's to cum. (pun intended) Tommy lubes up his fuck stick and sits back as he watches Steven back that sweet, smooth ass back onto it. His hungry ass readily engulfs every inch he has to offer and starts riding it hard. He bounces up and down and grinds his hungry hole way down to the base, sending Tommy into orbit. Steven is just beginning as he switches positions, straddling Tommy again facing him this time so he can suck his face while his ass is sucking...well, you know! Tommy is groaning and totally into it as he stands up and begins to bounce Steven onto his dick. Steven's impaled on Tommy and loving every thick inch of it. Tommy then puts him back down on the couch while still buried inside him and starts tappin' his ass missionary. 'Harder' Steven begs as Tommy picks up the pace. 'Like that ass?' he taunts as Tommy stands him up and gets right back in that ass. Steven is aggressively bucking back onto Tommy's cock and a view from below shows that hot ass taking it deep. Tommy puts him back on the couch and fucks him hard and fast. Steven loses it and shoots what seems like a gallon of 'leche' all over his smooth chest and abs. Tommy isn't far behind as he too coats Steven's cum soaked frame. Now THAT is how you get a proper taste of Chicago. ",
  "models": [
    {
      "name": "Steven Ponce",
      "person_id": 27969
    },
    {
      "name": "Tommy Defendi",
      "person_id": 28400
    }
  ],
  "release_date": "2009-08-19",
  "scene_id": 54420,
  "series": "Paging Dr Longstroke",
  "tags": [],
  "title": "Paging Dr Longstroke"
}