{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back with us this week is Chicago's own meat packer, Tommy Defendi. Tommy  is 19 and made his debut with us last month when he plowed sexy Feliz Andrews. Tommy was a late bloomer and he knows to take his time with his partners so not to hurt them with the 9' cock he's packin'. This will come in handy with a new cutie from Nebraska that's with us today, Krist Cummings. Krist is 21 and now lives in Miami. Krist is currently dating and he beams when he admits he's dating his perfect guy. He's 5'4, just like him, and a twink with a really big dick which he loves. The down side is that his beau lives in Arizona for now. They've been dating for about 6 months but Krist assures us he loves him and they're gonna make it work. Aahh, Young love. Tommy tells us his hottest sexual escapade was with a str8 couple. He fucked them both and he loved knowing that she was totally turned on watching him pound her husband. Tommy loves masculine guys and likes to dominate and be a man with a woman but loves to feel like he's with a 'man' when he's with a man. When asked, Krist blushes and admits his hottest was his first time with Phillip, you know 'the one', and how they had sex for 3 hours str8 and it was all 'romantical' and there were angels and harps playing...something like that.They begin to kiss, breaking the ice as we prepare to give Krist something else to love. He wastes little time before undoing Tommy's shorts to get at that thick dick he's heard so much about. They kiss and grope each other as they slowly explore the other. By the time Tommy's shorts hit the floor, his thick dick is straining to be free. Once it is, Krist takes his place on his knees and immediately wraps his lips around Tommy's massive meat sending out boy Tommy into a moaning frenzy. 'Aaww, that feels so good' he coos as Krist works his thick dick with his hand and mouth. Tommy isn't a selfish top so he gets Krist up and gets on his knees to give Krist a little of what he'd been getting. Krist's eyes roll back as he gets some help on his own meat. Tommy then lays Krist back down on the couch and straddles his chest, dropping his horse hung cock back into Krist's hungry mouth. Krist can't seem to get enough of his thick dick (and who could blame him?) From there, they switch over into a hot 69 with Krist nursing on Tommy's dick like a milk-starved calf and Tommy bobbing for Krist apples. Tommy then gets up and continues to feed Krist his dick, telling him to get that fat cock wet for what's to come.'You want that cock in your ass?' Tommy teases before putting little Krist on his back and sliding ball deep into Nebraska's back woods. Krist may be a compact 5'4 but he sure can accommodate some thick dick. Tommy is moaning as he feels Krist's tight ass slowly begin to milk his meat. Krist's face says it all as Tommy begins to slowly pull his cock almost all the way out before slowly sliding it back inside. Tommy wasn't kidding when he said he likes to take his time fucking a hot ass so that his partner gets the best experience on the end of his dick. He then orders Krist to get on his stomach and once he does, Tommy lines his thick cock up with that sweet ass and lowers himself into Krist. Krist's mouth gapes open as he feels every thick inch of Tommy's cock sink even deeper inside him. Tommy's sexy ass goes into a blur as he now fucks that ass faster and faster driving Krist nuts. He fucks him deep for a bit then jack rabbits that cock and repeats. The combination is insane. He then pulls out, lays back and has Krist ride his meat. Krist's ass is getting the impaling of a lifetime as Tommy pounds up into him. Tommy's fucking Krist and watching him stroke when he suddenly realizes he's about to nut. He quickly pulls out and explodes all over Krist's back and ass as load after heavy load go airborne. Krist then unloads his own load all over Tommy's chest.",
  "models": [
    {
      "name": "Krist Cummings",
      "person_id": 30770
    },
    {
      "name": "Tommy Defendi",
      "person_id": 28400
    }
  ],
  "release_date": "2009-07-22",
  "scene_id": 54428,
  "series": "How To Fill A Twinkie",
  "tags": [],
  "title": "How To Fill A Twinkie"
}