{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Scott Alexander is in the house today and he's giving us a 'behind the scenes' look at all that is Scott. We decided he would be great to do our first 'unplugged' episode where we get more insight at the man behind the legend. Scott is 37yo and he's from Houston, Texas. He has moved around and has lived on the West coast and currently lives in Gainesville, FL. When we asked him where he would love to live given the chance he blurted out AUSTRALIA! Someone wants to go down under in a bad way. He's always wanted to go. His favorite city he's lived is Chicago and even though it's cold the city's energy makes up for it. The least favorite of places he's lived was Phoenix, AZ. We'll leave it at that. He is currently single and says he has no set 'type'. He does love a hairy guy. It drives him crazy. He also likes guys that are kind; attitude definitely doesn't work for him. Looks aren't that big a deal for him and even admits that when you meet a guy and can really get to know him on or off set, that's when you fall in love with them. Scott is mostly top and admits he has taken (it) before but because he's 6'3 and 195 lbs. 'I've tried smaller guys; but it just feels awkward', he muses. If you're gonna scale a mountain you need the right equipment. Speaking of equipment...Wearing a cut off tee with 'Friend with Privileges' across his chest, Scott makes us all wish we were on his list of possibilities. He leans back in this chair and begins to explore his defined frame. His hands run down his rippled abs as he slowly begins to undress. He has ink on both biceps and another tattoo just above the waistline of his sexy black briefs. He hauls out his uncut cock and begins to awaken his growing python. It isn't long before he's at full mast. His cock is rock hard and as he strokes it, his smooth balls bounce in tune. He's naturally hairless and his body is lean and defined. He strokes his cock at attention before bending over and showing us his beefy ass. He spreads wide as he continues to stroke his cock underhanded. He loves to tease and doesn't mind showing you all of the sweet ass he's packing; since you'll never get any. Hmmm. He then gets back up and continues stroking that big dick as we watch his foreskin move up and back down over his swollen knob. His dick is definitely throbbing at his very touch and will soon be needing a lot more than this standing at attention business.He gets back on the couch and continues to tease us with that smooth ass of his as he kneels on the couch and leans forward showcasing that ass again, slowly running his finger on his tight hole. He begins to air hump away at the cushions below as we watch his ass rise and fall giving us an idea of what he'd be doing if he had a hot ass beneath him. (HINT: Foreshadowing--but you'll have to wait on that one) We digress, He then flips back around and lays back on the couch and continues to play with his thick dick. As he lays back we get a better view at his massive frame. At 6'3, Scott has an awful lot to offer and packing a thick 8?' uncut cock it always makes it a better package to play with. Not like we're size queens--but we can be impressed! Seriously. He plays with his nips and he begins to pick up the pace as his balls, ounce bouncing, have now pulled tight around the base of his shaft. It won't be long before he blasts his load. His muscles begin to writhe beneath his skin as his chest and abs begin to tighten. 'Oh my God' escapes his lips over and over as his uncut cock erupts, sending huge volley after volley of thick cream all over his heaving chest. Whew.",
  "models": [
    {
      "name": "Scott Alexander",
      "person_id": 28046
    }
  ],
  "release_date": "2009-08-05",
  "scene_id": 54424,
  "tags": [],
  "title": "Scott Alexander Unplugged, Scene #02"
}