{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Someone's in the kitchen again and we have a feeling they're gonna be preparing a delightful 'dish' that will make more than one lucky guy very happy. This master chef we're referring to is none other than our very own Cooker Stevens. Cooker, for those of you who aren't familiar with this culinary dream packing a 9' juice infuser, <what a visual> came to us several years now as a str8 boy willing to jack it for some rent money. A word from our sponsors later and Cooker isn't afraid to try much of anything. He's even discovered that getting a big dick shoved in his hole feels as good as when he gets to shove his inside his girlfriends back home. It's made him a better lover. We love the way he thinks. You gotta know how it feels to take it before you can give it. Speaking of 'taking it' we have Cooker's costar whom we plan on making very happy. This happy 21yo from West coast FL goes by the name of Feliz Andrews. Feliz  has managed to handle some of the largest studs we've had and he's handled them all like a champ. Feliz is charming and is usually attracted to older men and obviously if they're hung he won't be mad at them. Feliz is going to get his chance to sample the skills of this now self-proclaimed 'bi' boy has to offer.They begin to kiss as they slowly break the ice. Cooker and Feliz begin to strip each other's clothes off as they lick and suck every inch of skin they uncover. It isn't long before Cook jockeys into position and slides down between Feliz' knees. This str8 boy has always been all about the oral. He kisses Feliz' crotch as he undoes his pants getting his first taste of Feliz' meaty shaft. Feliz just licks his lips and watches as Cooker works his meat. It's Cooker's turn next as Feliz undoes his jeans and begins to play with Cooker's 9' python that is aching to be free of the loose fitting boxers that contain it. Feliz hauls out his meat and immediately goes to town on its knob. He crams as much of it into his mouth and throat as he can as Cooker closes his eyes and revels in the sensation. Cooker's cock is rock hard and throbbing in minutes as Feliz continues to work his shaft. Cooker, who only got a taste of Feliz' meat gets back down to get some more. His head bobs expertly up and down on Feliz' meat and as the oral escalates they then flip into a hot 69 with Cooker on top still shoving his throat down onto Feliz' cock as Feliz lies back and nurses on his meat. Cooker has earned his stripes and it's hot to watch him deep throat Feliz' rock hard cock to the hilt.nAs these two studs take turns deep-throating each others rock hard cocks; it only makes them hornier to do more. Cooker watches as his thick dick gets swallowed with ease. It was this kind of oral attention that got Cooker into men in the first place. Cooker's all about prepping his dish before it's ready to go and he goes to work on Feliz' sweet ass with is tongue. He rims Feliz' sweet ass as he makes Feliz even hornier for dick. Cooker then stands, lines up his meat and easily slides inside. He's pounding away at Feliz' ass as Feliz just moan and begs for more. Cooker's heavy balls slap away at Feliz' balls and ass with every deep thrust Cooker sends home. Next, Feliz straddles Cooker's cock as he impales himself for even more tenderizing. 'Ride my dick' Cooker moans as Feliz engulfs his dick. Feliz begins riding Cooker like a jockey as his ass bounces up and down on Cooker. Cooker jacks Feliz' cock as his face tells us just how good that ass feels on his aching cock. He then turns Feliz around and continues to fuck into him in a reverse cowgirl position --Yeehaw! Then they get into a hot missionary position as Cooker pounds his ass deep ordering him to cum for him. Feliz explodes in minutes and Cooker isn't far behind coating Feliz' abs and chest with a thickened sauce of his own. :) ",
  "models": [
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    },
    {
      "name": "Feliz Andrews",
      "person_id": 27962
    }
  ],
  "release_date": "2009-07-15",
  "scene_id": 54429,
  "series": "Hunting For Hole",
  "tags": [],
  "title": "Hunting For Hole"
}