{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Kyle Rivers was in town recently, and we didn't want to miss out on getting him into a scene or two. Kyle is a young buck who showed up in town on a little vacation. We've run into him before at a few of the porn expos we go to, so we knew he was into porn. He's a nice, laid back, muscled guy who enjoys sex, enjoys fast cars and loves spending money.We convinced Kyle to show up for a shoot of ours, but he made us promise to get him a massage before the shoot. We don't know any masseurs in the area, so we gave Phenix our van and told him to show up pretending to be the massage guy.When Phenix pulled up, Kyle was ready to go. He's been working out extra hard lately to pack on the muscle he thinks he needs to be hot. We like him the way he is.The two wonder up to the massage table we had set up in the garden. Kyle doesn't waste anytime and strips off his robe. With Kyle lying on the table nude, Phenix starts rubbing the hot young man's back. This doesn't last too long, as Kyle seems to want a cock in his mouth more than a back rub. He starts servicing Phenix as he gets a nice, deep massage.Kyle isn't satisfied with just the cock in his mouth; he wants that thing in his ass, so he turns around and demands that his dark haired friend slide that hard cock into his puckered hole.The two fuck this way and that. Phenix's thick cock stretches Kyle's tight ass, making him moan and growl like an animal.Phenix pulls out and empties his load onto Kyle's cock, adding some lube to help his buddy get off quicker. Kyle doesn't wait long before stroking himself into a creamy release, spewing his hot cum all the way to his chin.Kyle got what he came for. Enjoy!",
  "models": [
    {
      "name": "Kyle",
      "person_id": 4912
    },
    {
      "name": "Phenix Saint",
      "person_id": 4914
    }
  ],
  "release_date": "2007-04-27",
  "scene_id": 5442,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Brunette",
    "Condom",
    "Fraternity",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Kyle & Phenix Saint"
}