{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week on ExtraBigDicks we have one of our recent finds by the name of Feliz Andrews. Feliz  was last here a few weeks ago and much to the envy of many was on the receiving end of Josh West's hateful 9' monster dick. Well, with a name like 'Feliz' (Sp. for 'Happy') we think we've discovered the 'secret' to his happiness. --Wait for it--because today he brought along a friend. Hmmm. Tommy Defendi is 19yo and a Chicago native. He is single and not looking to settle down. He's 6'1 and, Lucky for Feliz, he's into smaller and shorter guys. Tommy is a big 'thick' Mid-Western boy and a late bloomer. He had sex for the first time at 17. He waited around to find the right one. Tommy's definitely more of a top and, again lucky for Feliz, is packing a thicker than average 9' cock. Do you see a 9' happy pattern here? (Shhh--it's a secret) Tommy bottomed once and even though it wasn't his thing it gave him a better idea of what it's like to be on the end of his thick meat. It definitely made him a more conscientious top. He doesn't pound an ass much; he prefers to take his time as to not hurt his partner. Awwww--He's one of the good ones. Well, here's to giving our newcomer a warm welcome and a warmer place to bury his meat ( ...and by 'place' we mean Feliz--Duh! )They begin to slowly kiss as their hands start to roam over each other. Feliz hands make an immediate dash for Tommy's crotch that is already beginning to strain against his jeans. Tommy is stripped down to his boxers while Feliz kisses him. Tommy's cock is too big to stay in his boxer briefs and the visual of that meaty python snaking out past his waist band is too much to resist. Feliz strokes his cock and it seems to double in size once he does. He holds it by the base before attending to it properly. Tommy sighs and moans as Feliz works as much as he can trying to get more into his mouth. Tommy's cock is a python among dicks. It's thick from base to head and Feliz is more than happy to work it as best he can. Hot tope with monster cocks don't come along every day and Feliz is working as best he can to satisfy the Windy City meat packer. Tommy then goes down on Feliz to give him a little of what he's getting. Feliz appreciates his efforts but sooner than later, he's back on Tommy's meat shoving it as far down his throat as possible. Tommy softly holds Feliz' head as he watches him bob and down on his thick cock and working his cum-filled balls that dangle below.Tommy teases Feliz with his thick dick, waving it in his face and slapping his hot mouth with it before burying it right back in for more. It won't be long before he's burying his thick dick elsewhere. Once they've had their fill of oral; Tommy is ready to have his fill of Feliz. Feliz straddles Tommy's meat and begins to ease down on his fat cock. It doesn't take long at all for his hungry ass to engulf every delicious inch of Defendi Dick. Tommy's smooth balls that are now pulling up tighter to the base of his cock are getting better acquainted to Feliz' smooth ass that is now easily taking it all. Tommy's face says it all as his eyebrows furl and his sexy mouth gapes open. Feliz is riding him hard and working his dick like a rodeo champ. Tommy wants more control and he gets it. He stands behind Feliz and slides back inside for more. He piston-fucks Feliz' ass as his heavy balls slap at his hot Latin ass. 'Aww fuck' Feliz groans as Tommy repeatedly buries his baby maker to the hilt. Watching Tommy methodically fuck Feliz' tight ass gives you a better idea on just how conscientious a top he is. Once he's ready to wrap it up, Tommy bends Feliz over and fucks Feliz hard and deep. It isn't long before he pulls out his one-eyed snake and unloads a huge blast of seed all over Feliz' back. Feliz then returns the favor unloading all over Tommy's smooth chest. ",
  "models": [
    {
      "name": "Feliz Andrews",
      "person_id": 27962
    },
    {
      "name": "Tommy Defendi",
      "person_id": 28400
    }
  ],
  "release_date": "2009-06-17",
  "scene_id": 54437,
  "series": "Beautiful Reamer",
  "tags": [],
  "title": "Beautiful Reamer"
}