{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Hailing from the Midwest, the 23yo we have for you this week on ExtraBigDicks now calls Orlando, FL home. He's currently doing his thing and studying med and wants to major in plastics. Well, at least we know as a Plastic Surgeon, Dimpled hottie, Jason White will always have his looks to fall back on. For now, he's taken and isn't looking. He's dating a guy that fits what he was looking for. He's fit, takes care of himself and has an outgoing personality and rockin' 6-pack. They didn't meet online--shocker--and actually met out at a club. They've been together for 6 months. Behind closed doors, Jason beams as he admits he's totally versatile. He loves to give it as much as he loves to get it. Luckily, for one special man in the 407 area code, Jason has more than the average boyfriend in that department. He sends out a shout out to dear old Dad thanking him for the package. Apparently it still rings true since we here at EBD take our roles as journalists seriously. He can confirm his Dad has the master mold and he realized it at about 13 since his Dad loves to walk around in boxers. Then as exhibit B, Jason also confesses to having an identical twin brother who's equally as blessed. Stand down, Sisters! His twin is allegedly 'as str8 as they come' Hmmm. Well, that's because his twin hasn't met 'us'. Jason begins grabbing his meat through his jeans slowly getting into it. He lifts his tee as he feels up his chest. It reveals his smooth upper body and a sexy happy trail that disappears into his underwear. He tugs on his sensitive nipples in unison for a bit before losing his shirt altogether. He wastes little time before stripping down to his sexy underwear. Clad in a yellow blanket of red stars, Jason's thick Midwestern 9' monster is already expanding to its full potential. He is jacking his big dick inside his briefs and soon enough there isn't any room left to stroke. His briefs come off and we finally get to see his huge cock. It's as thick at the head as it is at the base and it's throbbing at Jason's touch. His naturally smooth nut sack dangles below as it bounces back and forth in time with his stroking. Jason teases us as he looks down at the cam below his dick as he wags it like a thick tail on a happy puppy. His cock is definitely impressive and the backdrop of Jason looking down at it and licking his lips isn't bad either.He continues working his thick meat while he stands above the lens. There isn't a bad angle on this corn-fed boy. After he feels we've had enough meat, he moves over to the couch to give us a better view of the other options on his 'all-u-can-eat' menu. He bends over on the couch and begins to stroke his cock and in position he lets his big hand wander further back until his thick fingers are grazing his beefy ass that's as smooth as the rest of his edible 2000 parts. Once he's given us more than an eyeful he gets up and sits back on the chair so he can continue working his aching cock. His dick is full mast by now and as Jason pins it at the base with one hand and strokes it with the other we begin to hear Jason's audible sighs as he gets closer and closer to pay dirt. As he spreads his legs wide, we get an overhead view of his rock hard bone and his muscular quads (thighs) that are flexing as he works his 'other' muscle. As he continues to stroke his cock Jason's sighs turn into moans and they serve to signal for the impending fireworks. Jason groans as his thick cock begins to unload its' cargo. He sends blast after blast of thick seed airborne as they splatter across his smooth chest and abs. If that doesn't give you a better appreciation for all things 'Midwest'--nothing will!",
  "models": [
    {
      "name": "Jason White",
      "person_id": 28490
    }
  ],
  "release_date": "2009-06-24",
  "scene_id": 54435,
  "series": "The White Castle",
  "tags": [],
  "title": "The White Castle, Scene #01"
}