{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have Leo Castro back in the house this week. Leo  made quite the splash a couple months ago as this 26yo, 6'4 'Brasileiro' made his debut here on Extrabigdicks. Tall with dark features and a chiseled frame this stud could give the infamous girl from Ipanema a run for her money. Originally from Sao Paolo, Brazil, he currently lives in the UK. He went to visit his brother 'on holiday' as they say across the pond and met who would soon become his wife. Yeah, he's married. After the nuptials he discovered he had unexplored desires that didn't involve his wife and now you're up to speed. Got it?--good! Paul Orson is 20 and moved to London to attend university. He's open to try 'anything' as long as it's not 'dirty' (safe). Hmmm. He lost his cherry with a bloke he went to school with at 16; and he's never been with anyone who isn't English. So this will be a first for the British boy who packs an impressive 'wanker' easily measuring up to Leo's 8 1/2' boner. This afternoon the steamy tropics of Brazil will collide with the not-so-proper side of Britain. <Hold the tea, m'Lord> These two are in for more than a mouthful as they 'sample' their wares (...and by 'wares' we mean meat) ...duh.Paul takes charge s he begins to kiss Leo passionately. His hands begin to explore Leo's crotch as they both begin to ease into their groove. It isn't long before their shirts come off and we get another glimpse at Leo's impressive washboard. Paul is bewitched as he licks his way past them, unbuckling his jeans and going right to work. Leo's thick uncut cock is growing by the second as Paul expertly works it down his throat. He flicks his tongue all around Leos' knob and foreskin driving him wild. Leo affectionately caresses Paul as he sits back and gets his meat worshipped. Leo's appreciative but he wants some too. He undoes Paul's pants, and begins to work his growing bone through his briefs. Once he's ready he hauls out Paul's extra thick cock. OMG! This 20 yr old boy is hung like giant. Leo's mouth stretches wide as he does his best to accommodate every thick inch of Paul's meat. Paul's head is back and he's in awe of this sexy Brazilian's oral skills. But wait there's more as they maneuver into a hot 69 to keep it going.Leo is all over Paul's meat and can't seem to get enough of this well hung hottie. He decides he needs to sample more than just his cock and Paul is too busy moaning to say no. He puts Paul on his belly before going back down on him. He greedily laps at his smooth ass and sends Paul into a frenzy as he gets his ass wanting a lot more than a goof rimming. Leo softly applies some lube to Paul's spit-soaked rose bud before pulling him up into a doggie position and back onto his thick cock. Paul is taking his cock like a trooper in no time. He grimaces as he takes Leo's cock pounding away at him. 'Ohh, fuck me' he groans as he revels in the fucking he's being given. Leo at 6'4 leans forward and easily kisses Paul's neck and sexy lips. He continues to fuck away at his ass as he gets more and more aggressive. His balls are soon slapping away at Paul's ass and all Paul can do is brace himself as Leo takes his ass. Paul isn't lagging behind either as he bucks his much smaller frame back up onto Leo's 'pica dura'. The chemistry couldn't have been any hotter for this international fuck fest. Leo then gets Paul to kneel on the couch before entering him again from behind. This position hits Paul in all the right places and within minutes he's close. They sit back and each pump out their diplomatic pleasantries one thick blast after another. Whew. ...tea will now be served in the Parlor. ",
  "models": [
    {
      "name": "Leo Castro",
      "person_id": 28546
    },
    {
      "name": "Paul Orson",
      "person_id": 28547
    }
  ],
  "release_date": "2009-07-08",
  "scene_id": 54431,
  "series": "English Sausage",
  "tags": [],
  "title": "English Sausage"
}