{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we brought back Jason White who left many a sore cock after last week's scorching update. This 23yo thick Midwestern stud is quite the 'ass-full' packing a thicker than average 9' cock. The dimples are just the cherries atop everything else Jason  has to offer. Fortunately Jason is not in Kansas anymore and he's landed on South Beach instead. Today we decided to bring back one of MenOver30's native alumni, John Stone. This is our first glimpse of John here on ExtraBigDick; but he's made many a fan from his appearances on our brother site. John is originally from Boca Raton and has been hitting the gym as well as the beach. At 22 he's got it going on and enjoying the sun and putting that hot bod to use. John can have all the fun he wants because he's still single. John is attracted to guys that are outgoing, adventurous, have smarts and take care of themselves. Jason on the other hand is no longer on the market and is currently attached. He's a truly versatile guy that admits most people assume a big dick means you only top but not in his case. Jason likes to get it as much as he gives it. That's always a good thing. Both of these boys admit they're both more into oral but they'll both be doing a LOT more than that today...and we're off!They begin to break the ice, slowly kissing each other while their hands start to roam. Jason pulls at John's tee as they both begin to strip. Jason licks a John's cinnamon-toned chest and as he does, John pulls out Jason's thick cock. John immediately goes down on his massive meat. Jason gasps as John begins to expertly work every growing inch of his 9' pole. John's jaws are stretched wide as he repeatedly dives down on his meat. Jason feels up John's sexy chest and nips as he gets his meat spit-shined. Jason wants some too and drops to his knees in front of John who is more than willing to feed him dick. He holds Jason's head still as he fucks his throat; his smooth balls slapping away at Jason's chin. After a while, Jason gets back on the couch and lies back so that John can continue to worship his fat cock. John is going to town on his dick as he strokes his cock, swirling his fist around the shaft while he works his tongue all around his knob. The double combination he's getting on his aching cock is sending Jason into orbit and soon enough that thick fuck stick is going to want a warmer tighter place to wedge itself into...and we're all for it!The next thing we see is the look of anguish as John braces himself. Jason is sliding his extra thick meat into his tight ass and the more he struggles the harder Jason impales him. He's taking it like a champ as Jason bends him over and has his way. There's no learning curve with Jason who needs his dick in his tight hole. 'You like that?' Jason taunts as John can only grunt his reply. He moves him to the floor and begins to pound him in a doggy position and we gat a spectacular over head shot of his massive meat going in and out of his ass like it was meant to be inside him. Jason moans and groans as he watches John's hungry hole devour every inch. 'Yeah, Take that dick' he orders as John continues his endless grunting and groaning. Jason flips him on his back and slams his pole back inside him. He holds his legs up in the air as he fucks him missionary position. His balls slapping his ass repeatedly before he gets moved to the couch again where Jason sits on the back rest and pile drives John's hole. Just when you thought it couldn't get any hotter these two kick it into high gear. John starts to jack his cock as Jason's baby maker starts slamming his prostate and it isn't long before Jason's huge cock sends him over the edge. He begins to shoot as Jason hauls out his own meat and fires off a massive load that drenches John's chest and face. --HOT!",
  "models": [
    {
      "name": "Jason White",
      "person_id": 28490
    },
    {
      "name": "John Stone",
      "person_id": 27917
    }
  ],
  "release_date": "2009-07-01",
  "scene_id": 54434,
  "series": "Rear Nose & Throat",
  "tags": [],
  "title": "Rear Nose & Throat, Scene #02"
}