{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'Gostoso, gostoso, gostoso!' is all we have to say this afternoon looking at 26yo Leo Castro who is absolutely 'Gostoso' (Brazilian for 'delicious'). We can thank the land-locked city of Sao Paulo for this week's swarthy stud. Bedroom eyes and a boyish grin to leave you wondering all sorts of things, At 6'4, this statuesque Brazilian is definitely a sight to behold, He also packs an equally impressive 'pica dura'; which at its hardest measures in at an ass-stretching 8.5 inches. What it is about Brazil and these horse hung boys? Someone needs to bottle the water and share the wealth. Leo moved to England after visiting his brother in London. He loved it, moved there, met a woman and married. Wait for it--there's more. He lost his cherry to a woman at 17 in Brazil. He tried sex with a guy at 20. 'I met some guy on the internet, just for sex, went out a few times, I didn't realize about the kiss at that moment, just sex.' He blushes innocently, '...but then--he kissed me--and I knew.  He now considers himself 'gay'. See! (the more) His hottest sex to date was on a deserted beach; which we're sure he's missing. British beaches can't compare to the hot beaches in Rio de Janeiro. That 'girl from Ipanema' ain't got shit on this boy. To top it off, this boy looks even better naked. Who'd a thunk?Leo leans back as he begins to explore his toned body. One hand dives into his pants and the other under his body-huggin tank. As his hand moves up his torso, we get our first glimpse of his abs. This boy is ripped. His abs could be the cure for the laundry blues. You could wash just about anything on his washboard abs. He's naturally smooth and hairless. He undoes his jeans and pulls them down just far enough to free his growing cock. He slowly strokes his stiffening 'pica' as it instinctively responds to his every touch. He looks amazing as the light just dances on every delicious ripple and curve of his well-defined frame. He loses the pants and sits back so he can stroke comfortably. His thick uncut cock is rock hard in seconds and at full mast, Leo is quite the formidable stud. Speak softly and carry a HUGE stick must be his creed. Whatever it is--we're in! He strokes for a few before kneeling on the rug to give us a better view of his smooth frame and cock. He strokes overhand and underhand and there isn't a bad angle on the hung stud. We can even make out the light tan lines from his box cut suit that lightly runs across his smooth, muscular thighs.Leo then takes that bod and that fat dick in tow back to the couch where he lies back and begins to really work his meat. Aside from a tat on his left arm, his body is a virtually smooth canvas just waiting for a tongue to explore. He kneels on the couch and gives us a view of his muscular, tan line-encased buns. He looks just as good cumming as he does going--but let's not get ahead of ourselves.  Leo then lies back and goes to work on his cock. His thick uncut cock is throbbing as his foreskin glides up and down along its' meaty length. It's like looking at an overstocked Brazilian buffet and not knowing where to start. FEED ME. SEYMORE! He sits back up and spreads his legs as he wiggles his cock in the air. His smooth nuts are pulling up tighter to the base of his aching bone and just beneath them is his hot ass just peaking out at us making sure we know it's there. It's getting hot in here. He licks his fingers and lubes his knob as he picks up the pace. Now on the floor, Leo is stroking and focused on getting some relief for that cock he's been working. His chest and abs flex and contract, the muscles dancing just below his beautiful skin. As his fist becomes a blur and he begins to gasp we know it's here. With one heavy sigh, Leo unloads thick streams of creamy Brazilian batter all over, running down his sides and pooling in thick puddles just below his navel.",
  "models": [
    {
      "name": "Leo Castro",
      "person_id": 28546
    }
  ],
  "release_date": "2009-05-27",
  "scene_id": 54443,
  "series": "In The Castro",
  "tags": [],
  "title": "In The Castro, Scene #01"
}