{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Cooking is always fun when our very own Cooker is involved.      Cooker, who has come a long way over the last 6 years, is no longer that humble str8 guy who first walked through our doors with a girlfriend back home and only open to solo work. No Sir-ee! . Cooker has pushed his sexual envelope so much it's now a folder. He's fully versed in the art of gay sex. He's received oral, given oral, had his first taste of ass and even kicked off 2009 by giving up his virgin ass to one very lucky, Kameron Scott. Along this week to add even more young and hung excitement, we brought back a very special fire crotch that hails from the enchanted Isle of Puerto Rico. He's 25 and at a compact and muscular 5'6, Steven Ponce is quite the freckled head-turner. Steven made his debut with us last month is an all the cock you can take extravaganza as he took none other than Cooker's 9' cock as well sexy Dustin Michaels' thick fudge packer. Steven has already won awards since we last saw him. He's well on his way to infamy! Work keeps Steven busy for the most part. Our chef's been up to no good (as usual) and his latest adventure was getting the hostess where he works to go to her car with him. Just as she's sucking his knob the fuzz rolls up and ruined all the fun. Well, no blue balls for Cooker this afternoon and we have Steven here to make sure that doesn't happen. JThey begin to kiss as they break the ice. The clothes begin to come off piece by piece until they are underwear clad. At that point, after making out some more, Cooker stands in front of Steven who's kneeling at his feet. His thick 9' cock easily tents his loose-fitting boxers. Steven isn't about the wrapping as he quickly looses the boxers. 'Oooh yeah' moans Cooker as Steven begins to expertly work his knob and shaft. Cooker's in good hands (and then some) as Steven works his cock to the hilt. Cooker then returns the favor a bit before they both reposition into a sweet 69. Steven is on his back and nursing on Cooker's thick dick while Cooker's bobbing up and down on Steven's Puerto Rican 'pinga' at the other end. It just gets hotter as Cooker sits back, spreads wide and lets Steven service his aching boner. Steven holds it at the base as he takes it all in. Cooker's spit-shined cock is throbbing as it aches for more attention. Steven knows exactly what to do as he deep throats every thick inch and laps at Cooker's oversized nut sacks as well. Steven can't get enough as he repeatedly rams Cooker's meat down his throat.All the oral attention has Cooker's thick dick ready for a tighter hole to explore and Steven readily obliges. He straddles Cooker's dick and sits down on his dick. His sooth ass slowly gives way to its intruder and Steven is soon moaning and beggin' for more as he rides Cooker. Cooker bounces him on his dick with ease and once that position lost its charm; he easily picks up Steven and puts him on his back for more. With his legs up in the air, Steven is putty on Cooker's cock. Cooker slides his dick in and out of his ass missionary as his heavy balls slap at his ass. After a few minutes, Cooker lays Steven down and lies behind him, lifting Steven's leg up and entering him from behind. In this position we can easily see Cooker's thick cock repeatedly ram in and out of his hole. Cooker is fucking him hard and Steven is loving every inch of it. He then rolls on top of him and he's back to burying his dick missionary. They're both moaning and groaning as their fucking intensifies. Cooker's dick is hitting Steven in just the right spots on his back and Steven is soon moaning and warning Cooker he's gonna cum. Steven unloads a massive load all over his smooth abs. The sight alone makes Cooker blow his own batch all over Steven's cum soaked navel.",
  "models": [
    {
      "name": "Steven Ponce",
      "person_id": 27969
    },
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    }
  ],
  "release_date": "2009-06-10",
  "scene_id": 54440,
  "series": "Big and Red",
  "tags": [],
  "title": "Big and Red, Scene #02"
}