{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back to fulfill even more member fantasies this week is horse-hung, Josh West. After making his much anticipated debut last month, Josh added even more fans, and a size queen or two, to his already growing fan base. Originally from Los Angeles, Josh was always a horny one and discovered the joys of wanking at the early age of 5. It was bigger so it was that much more fun to play with. Gotta love it! Having that 9' monster cock has afforded him many opportunities and he's tried just about everything that's ever caught his fancy. The only draw back is that often times he gets shut down at the starting gate once he hauls that massive meat out. We guess it takes a 'certain' kind of man to appreciate all the thick cock Josh has to offer (You KNOW who you are!). With us today to help Josh take care of business is a somewhat local boy from Orlando, FL. Feliz Andrews is 21 and he will be the one to envy this afternoon as he gets first dibs on that donkey dick. It looks like this is going to be a great time. Feliz likes guys that are older and a bit taller and Josh admits he loves darker guys and Latinos are a plus. Well, New-comer, Feliz, is in excellent hands. Josh now has over 30 titles under his belt...and a thick 9' cock just past it. Apply bibs ....NOW!They waste little time and are already making out when the cameras begin to roll. They begin to undress each other as they make out, exploring each other's tight bodies as they do. Josh is on his feet and fumbling for his belt while Feliz looks up at him with a classic look of anticipation. As his shorts come undone and his fly parts, his massive cock is clearly outlined against the cotton that's trying to contain his boner. The thick cock arches up, snaking alongside his crotch and Feliz makes his move. His tongue begins to trace the outline of the meaty python as Josh coos at the warm sensation on his meat. His cock tents his briefs so that we can see it straining out along the sides. Feliz frees his aching meat and is instantly rewarded with a mouth full of cock. His opens as wide as he can while Josh feeds him all the dick he can handle--with both hands! Josh's aching cock slowly dips in and out of Feliz' sucking mouth as Josh fucks his face in several positions., rubbing his meaty shaft along his full lips and across his face as he teases him mercilessly. As Josh holds his monster cock by its base, we get a better appreciation of just how big his fuck stick is--it's thick as a baby's arm and in preparation for where he'll be using it, Josh goes down on Feliz' smooth ass, licking it before he'll shove his fat cock inside.'Awww, Fuuuck yeah' is all we hear, as Feliz, face buried in the pillow, moans as Josh claims his tight ass. Everyone knows you can't claim anything without putting a flag in it. And as far as flag poles--Josh is more than equipped to claim a continent...or two. Feliz is taking every thick inch like a man; as they both groan and verbally revel in just how good it is. 'Take that dick!' grunts josh as he watches his thick dick disappear inside Feliz as he easily pummels Feliz in a hot doggie position. From there, Josh tells Feliz to switch and he puts him on his side., pushes one of his knees forward a bit and slides his dick back inside for more. In this position, he can kiss Feliz as he starts really fucking his hungry ass. His heavy balls slap at Feliz' thigh as he repeatedly buries his bone. Josh's beefy ass looks amazing, rising and falling with every deep thrust he gives. 'Ohhh, nice hole' he continues, now fucking Feliz bent over so he can watch his meat in action. Feliz isn't saying much, bracing for the fucking he's getting, Josh's cock has Feliz' hot hole, well...'Feliz' easily slides in and out of him. Seriously, what bottom wouldn't be 'happy' with a dick like that buried in him? (Don't answer that, fuckers--it was a rhetorical question!) LOL Josh's chest and arms flex as they hold Feliz, pinning him in different positions. He then lies back, sitting Feliz back on his cock where Feliz eagerly rides his cock hard. That always does the trick as Feliz, explodes his seed all over the place. Josh isn't far behind and soon empties his own heavy load all over Feliz' spent cock. Whew.",
  "models": [
    {
      "name": "Josh West",
      "person_id": 27931
    },
    {
      "name": "Feliz Andrews",
      "person_id": 27962
    }
  ],
  "release_date": "2009-05-20",
  "scene_id": 54445,
  "series": "A Very BIG Deal",
  "tags": [],
  "title": "A Very BIG Deal, Scene #01"
}