{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back this week for more madness is a Caribbean cutie with a thick dick and a fire in his pants. Steven Ponce is back with us after having made quite the impression last week when he had the sad misfortune of being at the mercy of two extra hung top boys who were more than happy to use him like a pair of Chinese handcuffs (two dicks, two holes--no waiting). Look it up. Steven took both cocks like a champ and was able to keep both hungry tops more than satisfied with his hot ass and his Puerto Rican talents. Steven is 25 and now calls Fort Lauderdale home. He loves the weather down here as well as the boys. He doesn't have a set 'type' but likes men that take care of themselves and don't take themselves too seriously. Over-run with model types in South Florida it's nice to find hot ones with their egos in check. Steven is back to show us more of his talent act. He has this gift of making large things disappear--tadah!  On the menu for today is a thick 8?' uncut tube steak belonging to Scott Anderson. One look at this 37yo Nubian fuck-god, and you know  Steven's gonna have his assho--err HANDS!...his 'hands' full. Oops. Every delicious inch of his smooth frame makes you wonder which parts melt in your mouth, instead of your ...you know! Only one  way to find out.At work at his desk it seems Steven's about to take a break of the conjugal kind. Scott walks in and their chat goes from numbers to inventory apparently as they start stripping each other down locked in a steamy kissing session. As their pants come down, Steven sees the tent in Scott's briefs and pulls them down to investigate. His thick black cock springs free. It's hard as a rock but with the right motivation it could get bigger. Steven can't resist the urge and immediately bends down to swallow his meat. True to form, that delicious cock goes 'buh-bye' as his heavy balls meet Steven's chin. Scott strokes his cock as his foreskin runs over his spit slicked knob, He slaps Steven's tongue with it, teasing out Latin lover. He then kneels to get a taste of the Caribbean as he begins to suck on Steven's cock. Steven moans his appreciation as Scott shows him what he can do on his fat meat. While he's down there, Scott turns Steven around, spreading his cheeks before sampling a taste of that beefy ass he's itchin' to fuck. Steven's eyes roll back as Scott shoves his tongue deep inside him getting him ready for the thick baby maker that is soon to follow. Steven's hole is spit-lubed and ready. Steven straddles Scott's magnum-sized cock as he lowers himself on his afternoon delight. His smooth ass begins to surrender as the ebony intruder makes its way inside. Steven is groaning with every inch he gets and it isn't long before he goes from a trot to a full gallop riding Scott's cock like a thoroughbred. DAMN! Scott just watches as Steven's ass works its magic. Steven, who's been riding Scott reverse cowgirl, leans back and puts his feet up on each of Scott's knees. Steven now uses his feet as leverage, bouncing his compact 5'6 frame up and down on the 6'3 chocolate jungle gym beneath him. Steven then goes back to sitting on his dick and lets Scott do the work. He holds his waist, impaling his Latin ass on his black boner. Steven's ass is in heaven as it gets pummeled by Scott. Scott then bends Steven over the desk before slamming his dick in again. Steven is moaning and stroking his own boner and it won't be long before this fuck session is going to take its toll. Steven backs up on that dick like a pro and as they get closer, Scott puts him on his back. He re-enters that sweet ass and fucks him deep. There's a load in his balls that's a-cummin and he ain't about to stop now. He pounds Steven so hard he (literally) fucks the cum out of him, sending volley after volley of cum everywhere. Scott isn't far behind as he too unloads all over Steven's fire crotch.",
  "models": [
    {
      "name": "Scott Alexander",
      "person_id": 28046
    },
    {
      "name": "Steven Ponce",
      "person_id": 27969
    }
  ],
  "release_date": "2009-05-13",
  "scene_id": 54447,
  "series": "Black, Red and White all over",
  "tags": [],
  "title": "Black, Red and White all over, Scene #01"
}