{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have ourselves some Southern debuts in the form of two gents packin more than the average trapper. Austin Grant is a 23yo boy-faced stud from Tennessee and he's packin a thick 8.5 dick that keeps the boys comin' back. The second half of our 'Mason Dixon Dick All' is 21yo, Virginia native, Jimmie Slater. Both of these Southern 'charms' are single and ready to mingle. Jimmie like masculine guys and is turned off by feminine men. He's attracted to a muscular man. Austin agrees and says he doesn't like them too big just a nice guy he can go fishin' with.  The first time Jimmie had sex, he was 17 and it wasn't all that. Austin's first experience was a bit more eventful and 'family' oriented. He played around with a friend in the neighborhood. Then, unbeknownst to his friend, Austin hooked up with his brother, and later the other brother. Families that play together ...well, you know.  Jimmie likes sex in public places and one of the hottest was in a state park and so far this hottie's never been caught. Austin, on the other hand, has been caught several times by friends. Mmhmm. Austin stroking his thick 8'+ meat would not be a bad visual to walk in on. Well all this sex talk is getting these two horn dogs ready for more than chit chat; so lets get these two boys nekid--and busy. They start kissing softly as they slowly peel off their clothes. The chemistry between them is evident as they slowly kiss and lick each other as they explore every inch of skin that comes into view. Jimmie licks down Austin's sexy abs and is rewarded at the end of his journey with quite the mouthful. Austin's thick knob was waiting at the end of his happy trail as his cock was bone hard and sticking out of his jeans. Austin moans softly as Jimmie begins to work his thick shaft with his tongue. After a bit Austin pulls Jimmie back up so kiss him some more and also get himself some dick. He pulls down Jimmie's sexy briefs and goes to work on the thick dick that springs free. These two can't get enough of each other as they maneuver into a sexy 69 with more than enough dick to go around. Both of these boys are packin' thick dicks and no one's complaining. Not that they could; Southern boys know it's not polite to speak with your mouth full--specially with that much meat in it. Austin goes to work on Jimmie's dick which is slowly face fucking him and then it's Jimmie's turn to get down and service the thick dick he'll soon be getting more of. The next thing we see is Austin on his back with his legs in the air as Jimmie goes even further 'south' and begins to work his smooth hole with his tongue. Rimming Austin's hot ass is only gonna make him that much hotter to get his dick off and that means one sweet fuck for Jimmie's sweet ass. Sure enough after Jimmie's had his fill of Austin's sweet hole, Austin puts him on his back, lifts his legs and takes what's his. Jimmie grunts and groans as Austin slides his fat cock inside. In no time Austin is fucking him ball deep. 'Aww yeah, gimme that dick!' begs Jimmie who's looking down at Austin's navel as it pounds him deeper and deeper. Austin's balls slap his tight ass as he fucks away working up a thick nut. Jimmie can't get enough of Austin's cock and Austin doesn't mind one bit. He fucks Jimmie's ass like it's going out of style. Austin then puts Jimmie on all four before slamming his fat cock back inside doggie style, Holding Jimmie's tight little waist, Austin bounces Jimmie's ass up and down on his fuck stick. Jimmie is in heaven as Austin pounds away at his hungry ass. Austin pounds him harder and as he picks up the pace you know he's approaching the inevitable. Austin pulls out his meaty dick and unloads all over as Jimmie follows suit sending his hefty load blasting as well. Whew.",
  "models": [
    {
      "name": "Austin Grant",
      "person_id": 28323
    },
    {
      "name": "Jimmie Slater",
      "person_id": 28401
    }
  ],
  "release_date": "2009-06-03",
  "scene_id": 54441,
  "series": "Country Gravy",
  "tags": [],
  "title": "Country Gravy, Scene #01"
}