{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "After much anticipation we finally have Josh West on set with us here on ExtraBigDicks. Josh is well known for compact frame, sexy furry chest--but mostly his 9' extra thick cock. He is self assured and unlike many with his penal qualifications he doesn't suffer from 'Bigdikitis'(big-dick-EYE-tuss). He knows he has a large cock but he is a complete package and doesn't use his 'gift' as his validation. Early on, knowing he had a bigger dick than average, it kept him from coming out worried that people would see him differently because of his 'situation'. Little did he know the mixed reaction his large member and he would receive. Josh is a horny guy and he's always been in tune with his meat. He started masturbating since he was 5 years old because when it's bigger it's just more fun to play with. Well we appreciate that. Josh does admit that even though many guys will do all sorts of craziness to get at his dick; having a big dick does have its downside. On several occasion Josh has actually had situations where he gets turned down flat because a guy just isn't willing to try putting his rather thick dick anywhere. Ugh--Amateurs!  That doesn't stop Josh at all; and he freely admits he has tried most everything he's ever wanted to sexually. It only gets better when he grins and admits he's always open to adding new things to the mix. Sitting on the locker-room bench after a work out, Josh begins to feel his already stiff dick through his dark grey shorts. The outline of his massive meat is clearly outlined against the fabric struggling to contain his meat. He runs his hands up under his tee as he exposes his hairy chest and abs. His tee comes off and his shorts follow suit. As he strips off hi shorts, Josh is left in a sexy orange jock. His thick dick is now pointing straight down as it stretches the orange fabric as it grows to its full length. Josh teases and tugs at his growing meat as he reaches in on the sides of his tented jock teasing his nuts and the underside of his aching cock. He slowly pulls his jock away from his toned abs and gives us our first glimpse of his swollen member. Its knob is buried in the jockstrap and after a few tugs from Josh, his thick dick springs free as it bounces up in all its glory. Josh moans and groans as he finally gets skin on skin contact with his aching meat. His dick is massive and thick from head to base. This may not be your Daddy's Oldsmobile--but good luck trying to park this beauty! Josh is into his dick as he slowly teases his meat spreading his legs and bending over to give us a shot of his sweet ass as he jacks his solid cock underhand. No wonder some guys get intimidated; Josh's cock is massive and demanding attention. Josh leans back on one hand as he strokes away at his impressive fuck stick. He's a definite sight for sore eyes and a Size queen's wet dream. He then lies back on the bench as he begins to double fist--with room to spare--his thick meat. He tugs on his smooth balls as he strokes away with his other hand. The sounds of Josh's moaning and groaning as he pleasures himself only heighten the sexual tension as he gets closer and closer to climax. He gets up and leans back against the office door as he works and jerks his dick. At one point, Josh picks up 2 footballs and uses them side by side as friction for his meat. Josh is working himself into a frenzy and as he does, he decides to give us another view of that muscular ass as he bends over the bench and spreads wide, stroking his aching meat which by now is feeling a familiar tingle in those cum-laden balls below. he stands and continues stroking faster as his dick seems to grow visibly harder and thicker seconds before Josh grunts aloud sending volley after volley of thick seed splattering all over the locker room mirror. He then wraps his sweaty bod in a towel and heads off for the shower.",
  "models": [
    {
      "name": "Josh West",
      "person_id": 27931
    }
  ],
  "release_date": "2009-04-22",
  "scene_id": 54453,
  "series": "Go West",
  "tags": [],
  "title": "Go West, Scene #01"
}