{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Just when you thought the coast was clear, trouble finds its way back. Fortunately, it's the kind of trouble we all enjoy--whether we willingly admit it or not. Yes, it seems the Kansas boy with the Cheshire cat grin and the 'dirty boy' from down South are back and apparently wanting more...of each other. Well, who are we to cum between their passion and desire? Don't answer that--that was a rhetorical question. <look it up> Anyway, it seems oral may not have been enough to satisfy these cock titans. Nothing's been going on since we last saw them at least nothing these two are willing to share. James is being his usual evasive self; but his grin always gives him away. Never wanting to be pinned down to a precise question he always dances around managing to remain politically correct as designated in the 'Playah' Handbook. One thing we can say for sure is that both of these boys are horny and willing to give dick--and sometimes even take a dick. Speaking of the occasional rear deliveries, we heard that top boy James (who wouldn't even wanna try to remember how many asses he's fucked) may actually be giving it up this afternoon. It's always great to see the hunter become the hunted and end up taking it like a man...in the end. (obviously) These two aren't wasting any time and have already begun before we hit record. They go from making out and groping to stripping James til he's in his birthday suit with his dick in Brad's mouth. Brad works faster than we remembered. As Brad gets up to take his jeans off James goes to work on his thick dick. The chemistry between these two is explosive and they can not seem to get enough of each other. Brad sucks and swallows every inch of James' thick dick as James moans and groans his approval. Brad's mouth takes quite the fucking as James bounces his head on his dick like he was dribbling it down center court. Brad then stands up to get some attention on his meat and James gladly returns the favor. He swirls his fist along the length of his shaft while swirling his tongue around his knob. The combination is sending Brad into a frenzy and he can't help but stare down and watch James as he goes to town on his thick 8' meat. Brad's balls dangle low as James jerks his cock faster while lapping at his knob with his tongue, flicking his tongue all over his spit coated knob. These two are working themselves up and whatever the intense foreplay leads to, it's going to be intense. We just hope our sexy rough neck James can handle it--or at least his ass can. <evil grin> Brad then pushes James back onto the futon and gets between his legs as he jerks their cocks together. James moans as his meat feels the sensation of Brad's cock rubbing all over it. He'll be feeling a lot more of Brad's dick any minute now. James gets on his stomach and braces himself for what's to come. Brad quickly takes his position behind James' sweet ass. He spits on his knob and slicks his thick cock up as he slaps his heavy meat on James' ass. He teases the ass he's about to fuck so James can get an idea of just what he's in for. As he begins to impale our Kansas boy, James lets out a slow grunt as his hole begins to give way. His face says it all as he grunts and groans, taking deep breaths to ease the pain of Brad's anal assault. He buries his head in the futon as Brad begins to pick up the pace. It won't be long now before that pain turns to pleasure and soon enough James hoists his sweet ass back into a doggie position allowing more of Brad's dick inside him. 'Yeah you like my dick?' moans Brad as he pounds his ass. James is loving it and the harder Brad fucks him the louder he grunts and moans. Brad then sits him on his dick as he fucks up into his awaiting hole. Bent over against the wall is next followed by a hot missionary position that ultimately sends James over the edge spraying his seed all over him. Brad isn't far behind busting his nut all over a cum-soaked Kansas boy with a rather satisfied look on his face. Whew! ",
  "models": [
    {
      "name": "Brad Benton",
      "person_id": 28569
    },
    {
      "name": "James Hamilton",
      "person_id": 27947
    }
  ],
  "release_date": "2009-04-15",
  "scene_id": 54455,
  "series": "Skater Punk Bottom's",
  "tags": [],
  "title": "Skater Punk Bottom's"
}