{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a bit of Brooklyn back in the house to remind us just what he's packin. Mr. Tony Dinero is back and we couldn't be happier to have him back. It's not every day we find the perfect mix of boyishly sweet and bad boy hot that packs a thick 9' club to boot. Tony now calls Florida home and loves not only the weather but also all the ladies South Florida has to offer. Today Tony came in with an evil grin on his face that just screamed trouble. Turns out Tony  scored last night with a hot girl he met through friends. She was typical of the girls he likes: his height, slim, nice rack and nice ass. Tony loves a nice ass. She was driving him crazy. She was attentive to him and confident and that carried over into the bedroom as well. He had a great time and already has plans to see her again. If he had his pick of his ultimate fantasy where he'd want to have her he admits he'd want to have her at the Hard Rock. We found out last time he was here that Tony loves adventure and isn't one to shy away from adventurous scenarios in which to bury his fat cock. Recently he got his fantasy fulfilled and joined the Mile High Club on a flight back home. Obviously there isn't much to keep this single stud from getting his rocks off. On that note, why should we.... Something's heating up the kitchen and it seems to be a hot Italian wearing nothing but a jock strap and an apron. Tony slowly teases us as he turns around and shows us that sexy ass of his. He realizes he's over dressed an in no time loses the apron as it falls to the kitchen floor. His thick dick is stirring as it tents the front of his jock. Tony's lean and muscular body is on display as he caresses his abs and pecs with one hand while burying his other hand deep into his crotch giving his meat the attention it craves. Watching his cock thicken and fill out his jock gives us a better idea why Tony has such a 'hard' time hiding his unexpected mid-day boners. He jumps up on the counter top and begins stroking his cock through his jock before hauling his massive meat out the side. His thick dick is impressive and it's no wonder Tony loves watching girl's faces as he fucks them. We can only imagine the looks on their faces; a wash of pleasure and pain as they try and accommodate his fat baby maker. Tony lays back and strokes his meat over hand as he caresses his pecs and stares down at his throbbing meat as it aches at his touch, begging for release. Tony sits up on the counter and spreads his legs wide. A shot from below gives us a better view of his massive meat. He stares down at the camera knowing very well he has what you want. Hi balls are tight and are beginning to pull up closer to the base of his thick meat. He isn't done teasing and he moves to the cool floor below. He lies back and spreads his legs as he gives us a shot of his furry ass. he double fists his meat as he slowly humps up into his hands. His sexy ass rising and falling as he grinds his hips into his hands as if he was being ridden by a hot piece of ass. He then stands and gives us another view of his ass as he continues slowly stroking his dick. Once his balls begin to tingle; Tony moves to the couch where he can get comfortable. He lies back, legs spread and begins pumping his cock faster and faster. His breathing becomes more erratic as his hand becomes a blur on his lubed meat. He pulls and tugs on his hairy nut sack with his free hand and that does the trick. He begins to grunt and groan and within seconds the tip of his Italian sausage begins to give up its cargo. Wad after wad of cream splatter his abs and navel pooling in his belly button. His climax leaves a thick mess just above his sexy tan line. ",
  "models": [
    {
      "name": "Tony Dinero",
      "person_id": 28716
    }
  ],
  "release_date": "2009-04-01",
  "scene_id": 54459,
  "series": "Turn The Heat Up...",
  "tags": [],
  "title": "Turn The Heat Up..."
}