{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "As usual, the more the merrier on ExtraBigDicks and this week we brought three boys together that definitely pack more than the merriest. Among this pole packing trio is a familiar face we have all come to recognize as that sexy, once str8 and narrow, Chef whose eyes have been opened to the fact that guys can handle his 9' dick as well--if not better--than any female. Cooker Stevens is back with us and for those of you who missed out, 30yo Cooker lost his cherry on cam with us a few months ago taking Cameron's dick up his breeder ass and loving every minute of it. Along with Cooker, we have Steven Ponce who is a redheaded Caribbean morsel. From the enchanted Island of Puerto Rico, this 25yo cutie is here and ready to have his share of the fixings. Steven claims he's a natural 'redhead' and in a few more than his hairdresser will know the fiery truth. Rounding up the hung trio is Dustin Michaels. Dustin  made his debut with us last week and it didn't take long before we knew we needed to have more of the 22yo Panama City, FL boy (and that thick beef) back with us. Well with two extra hung and extra horny tops, it seems Steven's gonna have a lot more than just his hands full accommodating these two. Hmmmm--ALL ABOARD! Steven and Dustin break the ice as they begin kissing. Cooker, feeling left out, moves closer and gets in on the action. As he does, Steven starts to undress him. In no time, these three are down to their underwear as they continue to kiss and grope each other. Cooker is the first to go down, unable to resist Steven's thick meat. Sure enough, Cooker takes his dick deep, burying his nose into Steven's fire crotch. As he does he pulls down Dustin's briefs as his thick cock springs free. It isn't free for long as Cooker moves over to get a taste of his. From there, an all out oral session breaks loose. Steven and Cooker kneel before Dustin as they take turns working his thick meat, jacking each other off as they do. 'Fuck, you're getting me so hard' moans Dustin as he watches them go at it. Cooker then stands up beside Dustin as Steven takes his thick 9' cock in his mouth. Cooker moans in ecstasy as he gets his knob and shaft worked. Steven's got huge cocks on either side of his face and he's going nuts sampling them both. He can't get enough. They both lie down and slide closer together 'til their balls are close enough so that Steven can work both cocks together. He crams as much meat as he can into his mouth as they both look down at him worshiping their meat. The sounds of Steven moaning as Dustin begins to enter his smooth ass fill the room as his ass begins to give way. Cooker is on his knees with his dick dangling inches from his mouth, ready for him to suck it once he's adjusted to the fucking Dustin is now giving him. It isn't long before Steven is sucking cock and taking cock like a champ as both tops have their own hole to fuck. Dustin looks down at his dick as it disappears inside Steven, pinning his legs up towards his chest as he fucks him deep. 'Fuck my ass!' Steven groans as the fucking intensifies. Next we see Cooker burying his own 9' pipe in the hole Dustin warmed up for him. He stretches his ass even wider and deeper and Steven takes every inch like a champ as he swallows Dustin's dick. Someone's done this before. lol Cooker pounds his ass doggie style and as he does he lays on top of him to get at that thick dick Dustin is feeding him. Cooker's sucking cock while burying his own as Steven laps at Dustin's smooth balls. Steven then wants more dick as he straddles Dustin, impaling himself back onto his 8' cock and starts to grind his ass on it some more. Cooker is quick to give him something to suck on while Dustin fucks his ass some more. They then stand side by side as they jack their cocks off. Cooker's the first to blow; followed by an impressive finale from Steven who pumps out well over 9 blasts of 'leche' all over the sheets below. That visual is enough to send Dustin creaming as he too adds to the protein pool below. --Housekeeping!",
  "models": [
    {
      "name": "Steven Ponce",
      "person_id": 27969
    },
    {
      "name": "Dustin Michaels",
      "person_id": 28322
    },
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    }
  ],
  "release_date": "2009-05-06",
  "scene_id": 54450,
  "series": "My Three Sons",
  "tags": [],
  "title": "My Three Sons, Scene #02"
}