{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a couple of hotties making their debuts here on ExtraBigDicks. The first of the hung pair is a 25yo from Texas who was named after his birthplace. Dallas Reeves is a tall piece of the Lone Star state. We got our first taste of Dallas recently on our brother site, MenOver30. So we decided we needed a little bit of Texas, too. Award-nominated after only a few films under his belt, Dallas is a relative newcomer to the adult scene. He plans to be a big star in the adult industry and from the looks of it he's well on his way. Dallas imparts some advice on how to make it in the industry: 'Be yourself and don't let it get to you'. His costar could use it, being he's just getting started. His costar, a Chicago native, goes by the name Karter James. Karter, a wee lad of 18 summers, packs more than the average (Chicago) Bear, Bubu. This will be his third shoot to date. Karter had his first boyfriend at 15; so there was never any question he liked guys. He loves muscular men and a hairy chest never hurts. Karter usually looks for vers/top men because he does like to change it up on occasion. For now, we're gonna stick to what works. Though packing 8'+ we might wanna see how well he operated heavy machinery. Stick around... Slowly kissing on the couch, they break the ice. Their tongues intertwine as they slowly lose their inhibitions. It isn't long before they begin stripping each other in a blur of hands and tongues. Dallas sits Karter back on the armchair where he slowly licks Karter's defines abs and pecs. Karter watches in amazement as Dallas takes over. He slowly pulls off Karter's jeans, leaving him in a pair of half-tented boxer briefs. Karter wants to have a turn as he slides off Dallas' jeans. As his brief clad cock comes into view, Karter goes down on it. He licks and sucks the thin white fabric keeping him from pay dirt. Dallas' cock is soaked and he's definitely among the finalists for a wet underwear contest. ...Meanwhile, Back on the ranch, Dallas needs contact as he stands up and lets his thick cock come out to play. He aims at Karter's mouth who readily accepts it. Dallas slowly face fucks Karter before switching it up again and going down on Karter's thick dick. His meat is massive. His over-sized nut sack dangles below, swinging slowly as Dallas spit shines his fuck stick. Dallas can't get enough of his cock, greedily taking every thick inch, rubbing it all over his face as he does. Mmmm--Hot! They take their passion to the floor as they 69 working each others cocks. Karter is on top as he bobs his head on Dallas' meat. Dallas has a better vantage point on the bottom because it gives him access to not only that thick dick but to Karter's sweet ass. His tongue finds its way inside his ass and Karter goes wild. Dallas knows a little tongue can get you all sorts of perks. Karter is bent over and groaning as Dallas tongue fucks his sweet ass. Tossed salad is always a great way to start a meal and Dallas is serving an 'All the meat you can take' special. Spit lubed and ready for it, Dallas slowly takes Karter's ass. His thick dick slowly makes its way inside as Karter groans accommodating every inch. It isn't long before Dallas is fucking away at Karter ass as his legs reach for the stars. Dallas' smooth ass rises and falls as he fucks fast and deep; slapping Karter's ass with his smooth balls. Karter then straddles Dallas and holds still as Dallas fucks up into his sweet ass. Dallas' ass goes airborne with every thrust. 'Oh yeah, Fuck that ass!' Karter groans. Dallas obliges and pounds him harder. There's no stopping him as he pistons into his ass doggie style. Karter is taking a pounding and Dallas isn't about to let up. He fucks him using short quick thrusts driving Karter mad. Sensory overload for these two studs as they lay back, side by side, busting their thick loads all over themselves. Need Milk? ...we just got two deliveries. : )",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    },
    {
      "name": "Karter James",
      "person_id": 30701
    }
  ],
  "release_date": "2009-04-08",
  "scene_id": 54457,
  "tags": [],
  "title": "Bottoms Up!, Scene #01"
}