{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Miami's own, Darius Cobra is back for more and we guess it's true what they say: 'Third time is the Charm'--Wait for it. Our members can't seem to get enough of Darius' thick 'Cobra Cubana'. It works out since Darius can't seem to get enough himself. Even with a steady girl at home, he can never get enough pussy on his 'pingon' (Cuban for REALLY big dick). Trouble seems to find this one and he recently attended a party that turned into an all out orgy on a windy balcony, 16 floors above the Miami skyline. With 7 guys and 4 girls, there were plenty of Bros--but not enough Ho's. Darius made lemonade out of lemons and tried his first double fuck session--2 poles: 1 hole = No Waiting! 'My balls were freezing; but it was a tight fit...there was cum everywhere' he smiles. Sounds like a hot pilot for a new show: 'DNA Miami'. Horatio eat your heart out. This week, pint-sized Colombian Hottie, Matt Garrett is making his debut. Matt loves living in Miami. Why?--the guys. There's a first. Matt loves light skinned guys; that are taller than him; have meat on their bones...and have a nice package. Hmm We couldn't think of anyone that matched that description; so 23yo Matt's gonna just have to settle for 6'3 Darius who has agreed to let Matt be the first guy to orally appease his thick 9' love pole (aged to perfection some 33 years). With any luck, Matt brought his unhinging jaw with him. Matt isn't as adventurous as orgy-prone Darius; but admits he loves sex in public places and that risk is an aphrodisiac. Well handling snakes can be very risky; especially one as large and packing as much thick venom (and by venom we mean cum) as a cobras packs. Matt will soon have 9' in him from a thick Cuban who has 9' on him. On the bright side, unlike the David of old he won't need a rock or a sling shot to bring down this  modern day Goliath--just some mad oral skillz and protective eye wear.Matt isn't one to waste time and immediately begins to fumble with Darius' belt wanting to free his cock. Darius lays back and lets Matt do his thing, playing with Matt's hair as Matt licks and sucks all over Darius' hairy navel. Kneeling, Matt is teasing Darius who can't wait to get his dick wet. Matt's making him wait and by the time he makes it to his dick--it's throbbing and demanding attention. Darius slaps Matt's face with his thick dick before Matt takes control of it and starts to lap the meaty length of it driving Darius nuts. He drops his jeans and straddles Darius. He writhes is hot Latin ass on Darius' aching boner, teasing him with what he could have--but isn't getting. Darius has had enough and sits Matt down, grabs his head and feeds him dick. Open Wide-errr, Matt! Darius slowly begins to face fuck Matt while he moans his appreciation. Matt sucks his cock like a champ and when Darius lays back he follows the dick without missing a beat. Matt is stroking and slurping all over Darius' dick as Darius lies back and watches in awe. Caught up in the moment, Matt crawls up and goes to kiss our str8 boy. We weren't sure what was gonna happen in that instant--'til Darius kissed back! WTF? Matt then stands and goes over to the chaise and lies back to taunt Darius as he caresses his defined tight body. Darius' eyes are locked on his target and he moves in for the kill.Darius stands over Matt and points his dick down into his awaiting mouth. While Matt begins to worship his thick dick, Darius leans forward and rams his thick fingers up inside Matt's tight ass. Darius' big hands, roughly fingers his hole like he would a snatch getting it ready for a plowing. Matt's legs are in the air and his small frame writhing in ecstasy moaning through a mouth-full of meat. Darius wants more of that mouth and when Matt turns over, he rams his dick back in his throat. Matt gets up and pulls himself up along Darius' body and they begin kissing passionately again. Darius puts him on his back and slides his meat back into his hungry mouth. Matt's working his dick for all it's worth, sucking his cock like there's oxygen in his balls. Darius looks down and the sight of this hot little Latin boy swallowing his breeder meat is giving him tingles he's never felt before. A few licks and concentrated swirls underneath his foreskin are enough to do the trick and Darius rears back, giving his thick dick the last few tugs he needs to send him over the edge. He explodes. His first massive load of leche blasts in one solid rope of cum that fires way past Matt as it splatters on the floor behind him. The rest of his troops coat Matt's chest and neck as Matt's own uncut cock is coating his own navel and cock with thick cream of his own. Whew. It's a good thing we couldn't find anyone Matt's type, huh?",
  "models": [
    {
      "name": "Darius Cobra",
      "person_id": 28590
    },
    {
      "name": "Matt Garret",
      "person_id": 28669
    }
  ],
  "release_date": "2009-03-04",
  "scene_id": 54467,
  "series": "Seek The Schlong",
  "tags": [],
  "title": "Seek The Schlong, Scene #01"
}