{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a special treat for those redhead aficionados. Fort Lauderdale native, Red Savage is here this afternoon to let us take a peek at his 'Fire' down below. Red is 26 and he's currently dating a girl that he likes. She's pretty good in the sack but he says he's had better and that might be what's lacking in their relationship. Red's problem is that he packs more than the average bear in the cock department. He admits he's ended up hurting a few girls with his massive 8.5' cock. He has a time frame in which he needs to nut and if he takes too long it's gonna start to hurt --but Red's gotta cum! The best part of having a dick as big as his is the self confidence it brings to the table as well as the bedroom. He knows if anything goes down he's more than equipped to drive a girl wild. The bad side is a lot of girls can't take it and other girls flat out turn him down. Red's a horn dog & needs to pound a hole or get off at least twice a day. When he needs to get off he gets off even if it means finding a supply closet at work to wank off in. The sexual fantasy yet to come true for this stud is to fuck a female police officer in the back of her squad car. 'Something about a woman in uniform makes em look like they can take you on. It's extremely erotic to me'. Well, Red is 2 days behind on Wank Duty, so grab your protective eyewear, sit back and let's let this Cop-lovin' Lady's man polish his X-tra thick Billy club to a spit-shine finish.Sitting on the couch, Red begins to grope his crotch as he watches the flick across the room. He doesn't waste much time before taking off his tee, undoing his fly and giving that growing bone some breathing room as it begins to fill out his boxer briefs. As he leans back to get comfortable we can already see the clear outline of his thick dick pressing up against the silky fabric. He tugs at his nuts through his briefs and in one smooth move, Red's cock springs out in all its glory. His thick dick is massive and thick from base to head. Yes Ladies, the carpets match the drapes and he strokes it with both hands and still has room 'on dick' to spare. It's no wonder he's been turned down by several women--he's huge! He jacks his thick dick a bit before standing and dropping his briefs altogether. His fire crotch comes into full view as his pubes and surrounding body hair provide an auburn backdrop for Old Glory who is now standing tall, proud and at attention. Red releases his thick dick to let it throb in the wind. As the camera pans back we get a full view of Red's incredible body. He has little fat on him. His biceps and pecs are defined and his flat abs streamline as they dive right down into a red sea.There just isn't anything small about this 6'4 Lauderdale lad as he takes his act to the floor. He leans back against the closet door; spreading his legs wide to have easier access to his now throbbing cock. His heavy hangers are bouncing with every stroke of his hand and Red doesn't forget about them as he gently tugs on them which only makes his cock throb harder. He then bands over onto the couch and shows us the forbidden fruit--his str8 boy ass. He has a sweet ass and it's covered in a light dusting of dark auburn fuzz. Red then stands back up and keeps working his rock hard cock. He focuses on his knob that looks like its ready to shoot its cargo. He again turns around giving us one last glimpse of his cock while he begins beating it faster. He then kneels on the couch and goes at his meat full force. His dick is rock solid as his fist becomes a blur. He jerks it harder and faster and his breathing begins to labor a bit as he nears his climax. We can see why some girls can't take the pounding necessary to get this bad boy to bust his nut. He jerks harder and his breathing and soft moaning crescendo as he approaches pay dirt. His stroking becomes erratic as his body begins to clench. His dick spurts a bit which is the mere forerunner of the massive load that quickly follows. He grunts and groans as wave after wave of thick load coat the couch below. The only thing hotter than that load is the evil grin Red shoots us as he recovers. Hot--RED HOT!",
  "models": [
    {
      "name": "Red Savage",
      "person_id": 28689
    }
  ],
  "release_date": "2009-03-11",
  "scene_id": 54465,
  "series": "Red Velvet",
  "tags": [],
  "title": "Red Velvet, Scene #01"
}