{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We hope you guys are hungry this week, because we've brought together two recent finds who just happen to be two huge horn dogs. Exhibit A: One James  Hamilton: 22 years old; hung, fortunately no longer in Kansas (apparently ditched Toto in a backroom somewhere); motto: 'If it feels good --Do it!' and by 'do it' we're pretty sure he means 'fuck it'. Yeah, this horny Kansas boy will fuck anything with only one qualification. After all, he needs some standards doesn't he?...Don't go there. 'They have to be hot!' he grins, as he confesses he is an equal opportunity fuck--Male, female--it's all good. Nodding his head in agreement is the second half of our all the dick you can take update, Mr. Brad Benton--or 'Exhibit B'. Georgia native; 29 years old, also hung and a self-described 'dirty boy', Brad is grinning as he chimes in with his brand of moral mojo. 'Yeah they just gotta be hot. Not a pillow with a strap on', he laughs. Fortunately we're not that kind of site.  Together, these two boys pack enough meat to choke a small horse. More than likely a horsey from out West; since many of the Miami locals have no gag reflex.  Either way, Gag reflexes are what we'll be testing today as these sexy, dirty boys each have a go at each others ExtraBigDicks. Fasten your seatbelts ...this might get sloppy. These two have no problem or ice to break before getting to the nitty gritty. They've been touchy feely even before the camera started to roll. They begin to kiss, and within seconds, layers start to come off as tees and pants get voted off 'Couch Island'. Brad is the first to have his way with James' fat cock, which is already at full mast and tenting a Circus-sized tent in his briefs. Brad's feeling more than puckish as he begins sucking James' thick dick through his underwear. DAMN! There's always a first it seems. Realizing the dick tastes better after its' unwrapped; Brad hauls out James' thick 8?' fuck stick and goes back down on it, getting better access and a deeper fit sliding it down his throat. James is kicking back and enjoying the head Brad is hell bent on giving him. Who can blame him really? That's an awful lot of dick to not wanna put to use. Needing some TLC himself, Brad stands and hauls out his 8' love joy and points it at James, who knows just what to do. He immediately goes down on Brad and readily services his pole in appreciation of the head he's already received. Brad appreciated his efforts; but his desire for more of James' dick puts an end to things as he pushes James backwards and goes right back to suckin' dick.'Aww Fuck!' James groans as Brad swallows his meat. Brad is in a frenzy as he sucks his cock. He then puts both of their dicks together before stroking them in his hand. He can't get enough of James, and it isn't long before they relocate to the lounger. James sits back as Brad climbs on, lowering his meat into James' mouth. James willingly accepts, taking his rock hard cock, only to get face fucked by this Southern boy. Brad lets him work his meat for a bit and goes crazy as he gets his nuts sucked. Brad squats down to make out with James. As he does, his ass comes dangerously close to the thick dick below.--Can't you just sense the foreshadowing? One false move and he'd been playing 'Jail House Poker'--or Pokhim! These two have no problems finding each other's buttons. As they reconvene on the floor in a sizzling 69, James shows us just how crazy he can make Brad. Bobbing up and down on Brad's dick is enough to drive Brad wild. It isn't until James starts fingering his hole that Brad get sent into sexual orbit. All this stimulation has these two on the verge of a seminal meltdown. As James gets close, Brad works and laps at his nut sack, sending him over the edge. His load speaks volumes (literally) as his thick cum shoots way over his head, splattering all over the wall and his face. The visual alone was enough to send Brad past the point of no return as he, too, coats the couch with seed. Whew. We need to bring these two back for some of that 'Jail House Pokhim' was it? lol ...Stay tuned.",
  "models": [
    {
      "name": "Brad Benton",
      "person_id": 28569
    },
    {
      "name": "James Hamilton",
      "person_id": 27947
    }
  ],
  "release_date": "2009-03-25",
  "scene_id": 54461,
  "series": "The First Taste",
  "tags": [],
  "title": "The First Taste, Scene #01"
}