{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Born in New Jersey but raised a Florida boy, Trey Turner is in the house to show us what he's got. At 20 this exotic mix of Island spices would make many a heart swoon and even more asses sore. Get your attention did we? Settle down. When asked about his sexuality, Trey blurts out 'Gay!' before we even finished asking the question. He figured that out way back in High School when he decided to come out his senior year. This tall stud knows exactly what fills out his thicker than average love joy. Trey is 2 parts Puerto Rican and 1 part Filipino coming together to give us one lean, smooth and muscular stud. Fortunately for Trey--and more than a few of us--one of those Puerto Rican parts materialized in the form of an 8' ass master. Trey is versatile but in a relationship he usually ends up topping mostly. Contrary to what one would think, most guys are apprehensive about letting him fuck them. Usually, left to their own devices they figure out a way to make it work and then can't get enough. For now, Trey is off the market and has been dating a guy for a few months and they're still fucking like bunnies.  Good times. He's still exploring his sexualities and at his age he has many sexual fantasies left untouched. Incorporating food into sex intrigues him and he wants to have a 3some where he can be stuffing one hottie--while another hottie is stuffing him...any takers? Trey gets comfortable on the couch as he sits back to watch a flick. He stands to take off his tee and as it comes off his sun-kissed abs come into view. His massive frame is caf?-au-lait in tone and he flexes for us showing off his dedication at the gym. His sexy pits and pecs look amazing. He strips down to his sexy briefs before sitting back and teasing his growing cock through its cotton confines. He kneels on the couch and slowly begins to pull down his briefs showing us his sweet ass. His back is strewn with a shower of stars that start at his shoulder and trickle down to his waist. Tats can't hurt on a hot guy like this. Once he gets off the couch and turns around his massive meat is out and proud. A shot from below shows his thick meat with his rippled torso as the perfect backdrop. He slowly strokes his thick dick and as the camera pans back we get a better sense of just how hung this boy actually is. No matter he gets those that take one look and think, 'That fucker ain't gonna fit.' ...amateurs. Lol trey then goes back to the couch. He sits back as he spreads his thick legs wide; giving his dick the attention it deserves.The sound of slap after slap fill the room as Trey pushes his rock hard cock down and releases it as it catapults back up, slapping against his toned lower abs. This stud's got a massive dick and he knows it. He gently teases his heavy balls rolling them around in his big hands inspecting the batch of boys he's preparing. His cock dances and throbs at his touch and Trey slowly watches his thick dick as it gets worked over by both hands. Trey gets back up on his knees to give us an up close and personal view of his smooth back door. He leans forward and spreads his cheeks apart. With the exception of a patch of fur on his chest this exotic morsel is smooth all over. Mmmmm. He then lies back to finish the deed as he gets comfortable on the couch and starts to beat his meat in earnest (Not Ernest). As Trey jacks his dick faster his smooth balls bounce about as they keep time to his stroking. He softly plays with his nip as he gets closer to his climax. His body begins to writhe as do the muscles in his abs and thighs as his body prepares for release. His hand becomes a blur as he feels that familiar tingle in his balls. 'Oh fuck, I'm gonna cum' he grunts, seconds before his thick dick begins to unload volley after volley of thick cream. His batch splatters all over his pubes and smooth navel. We need a clean up on Aisle Trey.",
  "models": [
    {
      "name": "Trey Turner",
      "person_id": 27927
    }
  ],
  "release_date": "2009-03-18",
  "scene_id": 54463,
  "series": "Smoldering Appeal",
  "tags": [],
  "title": "Smoldering Appeal, Scene #01"
}