{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We all know that what comes around goes around. At least that's what they say. This afternoon we have a special dish for you thanks to our very own 'Top' Chef, Cooker Stevens. For those of you unfamiliar with Cooker, He has been with us now for several years and we've held his hand as he boldly went where many str8 boys feared to tread. From solos to giving in to receiving oral, to having a hungry bottom swallow the length of his 9' rod, Cooker has steadily expanded his horizons and even tried and enjoyed giving oral to other str8 boys like himself. Last here Cooker  got to suck on Cuban Papi and newcomer Dick Armstrong's pussy pole in a hot oral duo. Like Cooker a few years back, Dick just sat back and got his dick worked. Dick has had his fair share of boys wetting his pole too since we first met this engaged local. He was last here in a hot 3 way where he and another str8 boy got to work over 21yo Virginia Boy, Kameron Scott in his first on-cam appearance. Kameron took it like a man on both ends and fun was had by all. (...and by 'fun' we mean Kameron!) Kameron usually is a BB (Busy Bottom) usually and today he'll be doing something a little different. Cooker will finally get to expand more than his horizon today and Kameron's thick dick will be expanding Cooker's rear pantry. Cooker is apprehensive and his nervous smile says it all. Knowing a chef is nothing without the proper prep; Kameron offered him these words of advice: 'Breathe, let it happen...and enjoy the ride.' Yeah, --Good luck with that!      The games begin as these two begin kissing and exploring each other as they begin to undress. Cooker takes the lead as he licks Kameron's chest as he fumbles to undo his jeans. Kameron stand to give Cooker better access as he gives better access as his jeans come off. Cooker slowly licks and gropes at Kameron's sweet ass. Sorry Cooker, That's not on the menu. Kameron then returns the favor as he undoes cooker's jeans and begins to sample the chef's 'stock' (literally) Cooker's eyes close as he gets his massive meat sucked. He lays back on the couch to let Kameron settle in for some sweet throat fuckin. Cooker holds Kameron's head in place as he slowly fucks Kameron's mouth. 'Ohhh yeah, Suck it!' Cooker groans as Kameron swallows every inch of Cooker's thick dick as he deep throats him with ease. A deep throat was Cooker's down fall and it's nice to see he hasn't lost his appreciation for the oral skillz a talented boy can bring to the table. Cooker begins to face fuck Kameron as he is kneeling before him as Kameron strokes his own bone and begins to play with what IS on the menu--Cooker's ass. He bends Cooker over and darts his tongue deep inside to prep him for what's next. 'Wow!' is the only thing Cooker can muster to say as he gets his ass rimmed then slowly fingered as he readies our top boy to play assistant to Top Chef Kameron Scott. Let's see how long it'll take him to plate this dish.On all four, Cooker braces as he finally gets his wish. His face is a mix of anxiety, pain with a wash of sexual excitement. Kameron slowly impales him and takes his time so that Cooker can get used to his fat dick. Cooker gets up on his knees to reach back and kiss Kameron as his dick gets more of Cooker's ass. 'Yeah take that dick, there ya go!' Kameron encourages as he starts fuckin him faster. Cooker's face is different; it's taken on a whole new expression. Wait for it...'Fuck me, fuck me, --AWW FUCK ME!!' Cooker groans as his head goes back in total ecstasy. WTF is that about!? LOL Apparently Kameron tripped the cock-lovin' switch cuz Cooker's going nuts with his first ass pounding. Kameron is more than happy to oblige as he fucks away at Cooker's once cherry ass. Cooker then gets on his back, throws his legs in the air and gives it up some more as Kameron slides back in Missionary. His fat dick plunges in and out of Cooker as he groans with every deep thrust. All the anal stimulation is proving too much for Cooker who begins to jack off faster. Kameron, sensing his impending climax, fucks him even harder until Cooker's cr?me is airborne, soaking his smooth abs and chest. Kameron is next to plate as he straddles Cooker's chest. He'll be using Cooker's face as a plate. Kameron moans aloud as he sprays Cookers chest and face with his own special sauce. Whew. We might need more of that ... To Go, please. lol",
  "models": [
    {
      "name": "Kameron Scott",
      "person_id": 28022
    },
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    }
  ],
  "release_date": "2009-01-28",
  "scene_id": 54478,
  "series": "Trading Places",
  "tags": [],
  "title": "Trading Places, Scene #02"
}