{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Cobra: (koh-bruh) is a snake  and usually a venomous member of the family Elapidae (elapids). The name is short for cobra de capello (or cobra di capello), which is Portuguese for 'snake with hood'. When disturbed, most of these snakes can rear up and spread their neck (or hood) in a characteristic threat display. Today we have a Cuban Cobra that goes by the name of Darius. Darius is 33; and at an impressive 6'3' this Cuban monolith (look it up) packs an impressive 9' cobra of his own. When Darius' cobra is disturbed--and by disturbed, we mean aroused--his cobra thickens and as it does it too rises and his thick hood spreads back slowly revealing his glistening head (or knob). Darius' cobra then prays that YOU will be the one to (back your) rear up. . You know you want to! At full mast, it intimidates the faint of heart. Darius' uncut 'pingon' got its first use at the age of 15. He soon realized after hurting a few girls, he was larger than the rest of the boys. 'Girls say they don't want to try it--but end up taking it all anyway', he beams. We can't say we blame 'em either. Darius is the strong and silent type. His soft charm is disarming; but don't let your guard down or he'll have you exactly where he wants you--on your back. Darius is a horny fuck and jacks off regardless of how much pussy he may get. He currently has a girlfriend that gives it up plenty; but Darius still finds extra help whenever opportunity cums a-knockin'. Offering one hell of a package with a 9' cobra (packing load after load of non-toxic cream to inject); we give you this week's find: Miami's very own local love-snake 'charmer'--Mr. Darius Cobra.                      Darius slowly begins groping his growing member through his jeans as her feels up his massive pecs with his free hand. His tee comes off as he is left in a black wife-beater as he stands to undo his tight jeans. He drops his jeans and sits back down to play with his tenting crotch. His body is massive and hairy all over. Darius is hyper masculine and all man. His short cropped hair and massive frame give him a look that would intimidate many from approaching him but the ladies can't seem to get enough of him. Sorry fellas, Darius likes the ladies; but there's always light at the end of that tunnel. When a straight boy is this horny you never know what he might consider under the right circumstance$. Stranger things have happened here on EBD. Cross your fingers, Bitches! Darius is horned up and takes it to the couch where he immediately hauls out his uncut baby maker. Its throbbing by now and as he begins to stroke it we see his pre-cum soaked knob peaking out from underneath his thick foreskin. He loses his briefs seconds before spreading his massive thighs wide to get better access. He is a heavy breather as he lays back and pants you can't help but get aroused watching him in his element. Darius is every inch a man and watching him as he sits up on the couch as he jerks and teases his dick would make anyone wish he was on our team. You always pick the big guys first.Darius lays back a bit to keep jerking his meaty dick and his heavy balls bounce around as his dick gets the attention it deserves. Darius' face contorts in pleasure as he forcefully man handling his rock-hard shaft. His fist makes an unmistakable slapping sound every time his fists meet his cum-laden balls. Close your eyes and you have the soundtrack to many Miami nights where he quietly fucks some Latina while his balls slap her whisker box. Watching Darius as his expressions change one cant help but imagine the vast range of his 'sex face'. The more Darius strokes his dick the harder it gets as he nears his climax. His heavy balls are slowly beginning to pull tight as they prepare to launch their cargo any minute now. Darius picks up his pace and his upper body begins to tense up, his breathing picks up, his lips snarl as he begins to feel the familiar tingle brewing in his balls he erotically licks his thick kissable lips. FUCK! His 'leche' is ready to simmer and once it hits a full boil there will be no place left for it to go. (Say Aaah. j/k). Darius begins a low guttural moan that crescendos and culminates in a startled gasp as his head falls back and he's sent over the edge. His initial gasp leads to a series of low moans each accompanied by a thick stream of Cuban baby-batter. Our Cuban charmer is left cum-coated, catching his breath and holding his own (literally) as he revels in the after glow of a 2 day load he had backed up. Whew. Yeah, we might need to figure out a way to get this guy back for more.--a lot more.",
  "models": [
    {
      "name": "Darius Cobra",
      "person_id": 28590
    }
  ],
  "release_date": "2009-01-14",
  "scene_id": 54479,
  "tags": [],
  "title": "Never Say Never, Scene #01"
}