{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It is often said that Missouri loves company--well, sorta. This afternoon we are in luck because Missouri has come to keep us company. Who knew!? One good look at 25yo Kansas City native James Hamilton and you just know this boy is trouble. You know that kind of trouble, the kind we all want to end up in--or under. <evil grin> James is back in Florida again and he admits he loves it here because he gets to play with his dick a lot. Fortunately, if the rumors pan out, James brought enough for the whole class. Losing his cherry at 14, James admits it was horrible. He had no idea what he was doing. He got his second chance at the same 17yo ass a few days later. 'It was a lot better the second time. I used to watch a lot of porn back then, too (at 14?--WTF!) so that helped' he beams. 'Educational Videos' he called it. Moving right along, James is a horn dog and has to get his thick 8 1/2' dick off every day (whatever that looks like: jackin, fuckin--you name it). He doesn't care how or on what side of the fence. He's an equal opportunity fuck as long as he gets his. 'Whatever's clever' he grins, 'if it feels good do it.' When it comes to sex, this bad boy loves rough sex--the rougher the better. If it's a dirty, raunchy and rough fuck you're looking for, then we've found the pole-packin' stud for you. <sigh>...and he seemed SO prim and proper, too.--NOT!James starts before we do and he's already groping his bulging crotch as the camera starts to roll. His hands feel up under his wife beater and as he does, his tank lifts up giving us our first glimpse of his defined abs. James is naturally lean and except for his short cropped bush, is mostly smooth all over. <lick> On his right pec, he has a rather large tattoo of the Cheshire cat grinning ear to ear. Don't you just love foreshadowing? Oh, ummm, in literature, that's when you get a--never mind. It isn't long before his hands dive past his belt and reach in to give his growing cock the proper greeting it requires. He drops his shorts and gropes his growing cock through his briefs. His loose fitting boxers can't contain his thick dick as it flops out and snakes down his thigh. James sits down and hauls out his slowly growing python and begins to stroke it. His heavy balls bounce in tune to his jerking. James is over-dressed and the briefs must go. Once he's in his birthday suit, James lubes up and his monster meat responds and within seconds he's holding a hateful club. A thick club he'd rather be ramming up a tight ass or down a deep throat. We'll need to work something out for this bad boy--and soon. His dick is throbbing and all 8.5 inches are rock hard as he lies back and strokes his cock. He spreads his white thighs wide giving himself better access to all that meat he's got between them, As he stands, we get an under the cock shot that truly shows you what this stud's packing. Let's hope he plays niceHe sits atop the chair to keep working his massive meat. He teases his ass with his fingers while steadily beating his swollen meat over-hand, under-hand and a new one--the reach around. This boy's got skillz. He leans forward and reaches up under his leg to get at his dick so he can keep stroking. There are benefits to an ExtraBigDick and here's a really good example of how they come in 'handy'. James is a hung professional. Please do not attempt this at home. He leans back and as he does he catches a glimpse of himself in the mirror. He likes what he sees (can we blame him?) and decides to give himself a show. He leans back, spreading those thighs wide as he begins jacking his lubed cock faster. His thick dick is as thick at the base as it is at the knob and we're sure he's many a boy moan with pleasure and a few more grunt with pain. Either sounds good at the moment. Hmmm. As he gets closer to unloading his missile, James takes his sexy ass to the floor and settles in for the inevitable explosion he's due. His fist becomes a blur as he pounds his meat to get 'er done. The harder he jacks the more his ass wants to come off the floor as he starts to air-humps his fist. He can't hold it any longer and the look on his face tells the tale. His abs contract and as his body tenses, his thick dick unloads, firing a geyser of thick cream all over his sexy abs and chest. Whew. Well, now we know how good he is at handling his meat. The trick (no pun intended) is finding a boy that can handle that monster dick as well. We think we know the perfect guy for the job--a real 'peach' if you will. lol ...stay tuned. ",
  "models": [],
  "release_date": "2009-02-25",
  "scene_id": 54470,
  "series": "Ruff Play",
  "tags": [],
  "title": "Ruff Play"
}