{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have a special treat this week for those of you who have grown rather fond of Miami local, Robert Long. Robert  was last here just before thanksgiving when one Kameron Scott has plenty to be thankful for. Kameron got stuffed for his holiday by 2 extra big dicks and the turkey was not having it! (Hater!) Robert's been beefing up at the gym and has also become a real 'papi' since we met him. Now that she's 6mo old, he and the ol' lady are back to fuckin regular. Robert is basically str8, but he can never get enough pussy. So, on occasion he knows that a horny friend of Ben Dover is always a welcome friend to Robert Long. Fortunately for Robert, Mr. Ben Dover sent over such a friend. His name is Nick Cross. Nick is 20 and originally from Cuba. He's been here in the states for the past 8 yrs and loves all that Miami has to offer. He admits he is attracted to (some) women; but currently he's engaged to a guy he's been seeing almost a year. Nick laughs when he admits that his family knows and is ok with what he does but that his beau is probably at home pulling his hair wondering exactly what he's up to. Well enough of the formalities, Nick has met Robert; but he has yet to meet Mr. Long. Who are we to deprive this Cubanito of such a feast? Robert's Cuban Tube steak is best served HOT!Nick isn't wasting any time as Robert lies back and Nick strips his pants off. He starts groping Robert's growing cock through his sexy boxer briefs. Those don't last very long and in no time he has his fat cock in the palm of his hand. Robert just watches as Nick strokes his growing dick and begins to suck it. Robert, hands behind his head, coos eggs Nick on while his dick gets fatter in his mouth. 'Yeah, suck my fuckin' dick' Nick is more than happy to oblige and is worshipping the growing totem pole before him. Robert's dirty talk is only making Nick suck his dick that much harder. We all love a verbal str8 boy. He stands up against the wall as he keeps ordering Nick to suck his fuckin dick. Nick is working his own uncut bone by now with is free hand while stroking and sucking on the infamous 'Mr. Long'. Robert teases him as he slaps his mouth and face with his spit-lubed baby maker. He grabs the back of Nick's head as he starts to forcefully face fuck the Lucky Cubanito. He rubs his heavy balls all over his face before going back to holding his head with both hands and impaling it repeatedly on his throbbing cock. Whew. We need a minute...Next thing we see is Nick as he straddles Robert's awaiting shaft. Robert's thick meat slowly makes its way inside Nick's tight ass. Nick slowly impales his sweet ass on Robert. In no time Robert is bouncing him on his fat dick as he rides Mr. Long reverse cowgirl. (Illustration available on request) Robert's in ecstasy as his fat cock enjoys the tight hole its buried inside. 'It's huge, I fuckin love it' moans Nick as he begins to bounce harder on that massive dick. Robert's heavy nut sack rises up to meet Nick's ass with every delicious thrust. Robert easily handles Nick like his own fuck toy; maneuvering his small frame into different positions. Robert groans as he gets his fat cock ridden. 'A hole is a hole' he groans '--not like mine!' snaps Nick, making damn sure this str8 boy knows the deal. Nick's defined body looks amazing as he thrusts himself up and down on Robert's meat. Robert decides he's had enough and wants to do the fucking. He bends over Nick and starts pounding his sweet ass deep. His balls are slapping away as he fucks him doggie. There isn't a position these two wouldn't look hot in. Robert takes it to the chair where he again starts to use Nick's ass like his own fuck hole. He holds Nick by the waist and literally bounces him on his fat dick like he was jacking off, double-fisting a pocket pussy. His groaning and dirty talk only heightens the intensity. Nick is taking it like a champ and keeps up with every thrust he's given. Nick then lies on his stomach as Robert begins to feel the tingle. Looking at the ass he just got thru fucking is enough to send Rob over the edge as he fires off load after load all over the couch, the floor but mostly Nick's hot ass. Lucky fuck!",
  "models": [
    {
      "name": "Nick Cross",
      "person_id": 28393
    },
    {
      "name": "Robert Long",
      "person_id": 28696
    }
  ],
  "release_date": "2009-02-18",
  "scene_id": 54472,
  "series": "Married Meat",
  "tags": [],
  "title": "Married Meat, Scene #02"
}