{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Breeze slowly blowing moss in the poplar trees, sweeping views of the Chattahoochee River, and pastoral scenes all invoke images of the gallant Georgian South. Well the Gallant South was busy--so we brought you the Dirty one instead. A 'Dirty Boy' from the Dirty South is how Brad Benton describes himself. This 29yr old Atlanta son is definitely a head turner. His charming features, and the club that comes with it, have landed him squarely in the adult industry, a far cry from Law school which was where he was headed. He began dancing at clubs to help pay for law school when he was discovered by a Big wig Studio Exec who offered him a role in one of his feature films. Always one for adventure, Brad said yeah and ended up landing him in some 26 movies to date and won him an award for the hottest 3way in that debut film. The film turned out to be Falcon's fifth installment of a sizzling series that originated back in 1978: 'The Other Side of Aspen'. Brad's very open and says he came out at 12 when he introduced his boyfriend to his Momma. 'I didn't know any better.' He laughs. He ended up dating the first boy he ever fooled around with at 13 for 7 years. He was out with everyone and it wasn't an issue. He was a top jock in school and even made Homecoming King Senior year. 'I was a dick, so had anyone given me shit, I'd a beat 'em up.' He chuckles. Well, we guess we are all fortunate that law school took a back seat to his career in the adult playground. Brad doesn't have a set type when it comes to dating. The currently single stud just wants someone who doesn't take life to seriously and most importantly is funny. 'He doesn't have to be funny; but he has to laugh at all of my jokes. As long as he thinks I'm funny, it's all good.' So, now you know boys.... Sucking on his thumb, Brad begins his sexy show. He leans back in the chair as he begins to explore his abs and pecs up under his white tee. It isn't long before the tee comes off as he shows us just what he's working with. His chest is defined and smooth and is deliciously defined. He raises one arm over his head as he starts to lick his sexy pit. Madonna ain't got shit on this boy! He is sexy as all hell and knows just how to use it. Let's just hope he uses his powers for good. He loses his pants and straddles the locker room bench as he slowly starts to tease his cock. He strips and spits on his dick as he lubes it up for some fun. He swirls his fingers around the knob as it gets larger and larger. His massive meat reaches it's full length at a very thick 8?'. His body is smooth from head to toe and he makes his act a floor show. Lying on his back, he raises his legs to show us his tight ass. He teases and fingers h is hole for us as his dick throbs. He is in no hurry and takes his time as he begins fingering his love hole. His sensitive nips can't be ignored as he remembers to include them in the love fest. The view is amazing and he knows just how to tease with everything in his arsenal. He stands to give us a better view of his now enraged bone. He strokes it inches from the cam. It's so close you could taste it...almost.Brad then turns around and shows us more of that award winning ass. He then sits back down to use both hands on his massive meat. He double fists his meat slowly and holds his balls with one hand, using a few of those fingers to tease his hole and strokes his mega dick with the other. He uses his broad tongue to rewet his hand as he continues stroking his rock hard bone. He raises his legs in the air as h is fingers find their intended target. Brad whimpers like a bitch as he fingers his sensitive hole. It's hot to watch him pleasure himself and he is so passionate in his execution, it's no wonder he won an award right out of the starting gate. Brad's dick is throbbing and he's building up one hell of a load in that those heavy balls of his. His fingers are buried deep inside his chute as he probes and teases his prostate. His breathing is becoming more intense and it labors as he gets closer to the impending climax. His fist becomes a flurry as he beats off faster. That does the trick as Brad is sent sailing over the edge of ecstasy. His fingers make one last dive deep into his sweet ass which launches volley after volley of cum to explode out all over his smooth abs and torso. Spent, he continues stroking his swollen cock making sure to get every last drop out. Good to the last drop, this one.",
  "models": [
    {
      "name": "Brad Benton",
      "person_id": 28569
    }
  ],
  "release_date": "2009-02-10",
  "scene_id": 54474,
  "series": "Award Winning",
  "tags": [],
  "title": "Award Winning, Scene #02"
}