{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We rang in October this year with a swarthy burst of Texas newly relocated. At 6'3', Austin Jacobs now calls San Diego, CA home. For those of you who aren't familiar with Austin, he is from Austin, TX and prefers older guys. He finds them to be more mature and open minded. Austin,  made his debut on our site when he topped hung Cody Kennedy. That was a hot so we brought back dark featured, bedroom brown eyed Austin to see if he takes it as good as he gives it. Making his debut on our site this week is a familiar face on our brother site, CircleJerkBoys. Logan Robbins, the San Diego native with a roaming spirit, loves to travel and bounces between Las Vegas, Seattle and San Diego. He is another tall one, measuring in over 6'3' and packs a thick 8?' club between his milky white thighs. His dark features contrast nicely against his fair skin. Logan confessed on CJB that he's a bit more open-minded and has explored a few roads many would think twice about. (i.e. dating a tranny) All ancient history, Logan admits he's actually married. Austin's jaw drops as the he hears the news. Logan is a straight boy that just loves  to get his dick off and realizes a hole is a hole. Gotta love that! Logan is blessed in certain ways but laughs as he admits even though he's packing, he can't seem to do easier things most people take for granted. Logan apparently can't touch his toes. His legs are taller than his upper body so it's physically impossible. 'Long legs: long dick' he laughs. Yeah, cuz we're sure most of us would give up a huge cock for some Q.T. with our little piggies down South--NOT! Austin chimes in with 'I can't bend over and touch my toes either.' Yeah, that's great Austin, but this isn't 'Show and Tell' and you will be bent over --very soon! ...Let the bending begin.They begin to make out as they let their hands roam. In no time each is groping at the other's crotch. Logan pulls off Austin's tee and begins to lick his chest and fumbles to open his pants. Once his pants pop open, Austin's boner springs free already at full mast. Logan wastes no time before going down on him. Str8 boys always love to do things they can't do with their girlfriends. (...unless you count that tranny he wa--never mind.) lol Austin shucks his jeans as he lays back and gets his cock serviced well. Logan has done this before. Logan then stands up and lets Austin haul out his thick cock. Austin has more than a mouthful staring him in the face and he wastes little time before engulfing it down to the base. Logan moans in ecstasy as Austin sucks his cock and tugs on his heavy hangers. Logan also strips and we get to better appreciate all this tall stud has to offer. His naturally smooth frame with those broad shoulders and naturally defined pecs make quite a visual. After letting Austin worship his cock, Logan sits on the floor and has Austin straddle his face so he can taste that sweet ass he knows will be wrapped around his massive meat. He laps up at Austin's tight ass with broad strokes spreading his cheeks apart as Austin moans his appreciation. Logan's cock is rock hard as he rims San Diego's newest resident. His cock looks like its about to explode as he jacks it. His heavy balls bounce as his tongue is still giving Austin's ass a work out. Logan can't wait any longer and as he stands up, Austin puts some lube on his throbbing cock and bends over to give Logan the ass he needs. FINALLY! We told you he'd be bent over in no time. This is where it gets good! Austin braces as best he can as Logan begins to slide his thick cock inside. As Austin's ass gives way to Logan's meat he's able to pick up the pace and start fucking him faster and deeper. Logan holds Austin with one hand as he easily pumps his ass full of cock. A view overhead and we get to see Logan's abs and pecs tense as they flex and writhing as he fucks his ass. A view from below and we see Logan's egg sized balls slapping Austin's ass with every thrust. WOOF Austin is taking it like a champ as Logan holds him by the waist with both hands and continues using his sweet ass. Logan then pulls out and sits down on the couch. Austin stands in front of him and sits down on Logan impaling himself with every delicious inch of dick, Austin begins to ride Logan as he steadies himself on Logan's smooth pale thighs, Logan cups Austin's ass with both hands as he bounces him on his throbbing meat. Logan sounds hot as he grunts and groans fucking the hell out of our Texan boy as he impales him over and over onto his dick. Austin is boned up and it's bouncing in tune to the steady gallop he's maintaining on his stallion. He doesn't wanna touch his own cock to avoid cumming too fast. As we get a close up of Logan's cock being shoved repeatedly up Austin's ass we see how thick it's become and we know it won't be long before it needs to explode its thick load. Logan wants more control as he puts Austin on his back and slams back inside missionary. He really begins to pound Austin deep and hard as the couch creeks with every thrust he buries. Logan' thick dick is hitting Austin in all the right places and Austin is jacking his dick in a flurry of strokes. Logan's thick meat appears and disappears over and over as Austin's ass swallows it up. 'Keep going, just like that' Austin moans as Logan picks up the pace and fucks him even faster. Austin's face furls as he gets his ass plowed. He's way too close so Logan pulls out and they sit side by side to stroke off their aching cocks. Austin is the first to blow sending his thick load cascading over his knob, hands and down his shaft. Logan isn't far behind as he strokes out his own creamy load as it coats his hands balls as it splatters. Whew. Definitely a hot time was had by all. Christmas came early this year for young Austin and what a package he did receive.",
  "models": [
    {
      "name": "Austin Jacobs",
      "person_id": 28337
    },
    {
      "name": "Logan Robbins",
      "person_id": 30434
    }
  ],
  "release_date": "2008-12-08",
  "scene_id": 54487,
  "tags": [],
  "title": "Lads At Play, Scene #01"
}