{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Mr. Dean Sands is new on the scene and comes to us from New York. This new arrival came to Florida in search of Beaches and better weather. He is 26 and every inch delicious. He has dark features and a smile that could light up any room. Good natured and laid back, Dean has no preference when it comes to women. He's an equal opportunity ladies man. He does however admit he loves tits. He's definitely a tit man and loves girls that have beautiful assets without the enhancement many get in order to get more attention. Being on South Beach, we're sure this Bronx transplant has no trouble finding those bunnies with 'altered' racks running around the each in their skimpy bikinis. He got a late start and didn't lose his cherry til he was 18. That doesn't happen much anymore and luckily Dean has more than made up for lost time. Back home, he smiles when he admits he didn't leave a girlfriend behind. He did however leave behind several 'friends with benefits'. He has no regrets because he had his first time with someone that meant something to him and it led to a long relationship instead of an awkward 30 second disaster. (...you know who you are) He started jackin off at about 12 and he still needs to spank his monkey often. South Beach affords him way too much visual stimulation and he's even had to jack off at work. Shhhh. His boss has no idea. He loves to have sex in public places and loves an adventure. Sex in the mountain or in the woods, it's all good. He is out to please his lovers and when you get a look at what this New Yorker is packin'--you'll now why those friends back home are missing their 'benefits'! Their loss is our gain and we have Dean all to ourselves. So, kick back and enjoy. Dean's representin' the Bronx, yo!Sitting on his step ladder, Dean needs to take a break from his painting and pay attention to a growing situation in his board shorts. Dean brought along some magz in case he needed some 'light reading' in the event he found the time to take such a break, He peels his shorts off and lays on the floor in his jock strap. His cock is half hard as he begins flipping through the porn mag. His muscular legs are spread apart as he peruses the images. His hands are buried in his jock strap as he strokes his growing bone. He stands up to give his dick more room and as he turns around for us we get our first view of his ass. DAMN! Now this boy's got some junk in his trunk. Dean has a thick, muscular ass that would make anyone do a double take. It's the kind of ass that initially floods your dirty mind with SO many things you want to do; but you just don't know --where to start! He pulls his jock off before sitting back down on the ladder. He begins to stroke his cock through his muscle shirt. His large biceps flex as his hand pistons on h is cloth-clad cock. Dean just grins and smiles as he teases us with his meat. He knows we want more and he's perfectly ok with that. He lifts his tee up above his pecs and we see his massive cock come into view. His thick 8'+ fuck stick is impressive and looks amazing with Dean's ripped abs and pecs for a backdrop. Dean's been taking advantage of the beach and his sun-kissed body totally showcases his hard work in the gym.He takes his shirt off and lies on the floor. Leaning up against the wall he puts one leg on his ladder and spreads wide giving him easy access to his throbbing cock. He slowly double fists his cock as it pulses with his touch. His torso is smooth with the exception of light fur on his chest, then again on his happy trail that leads to a furry delta just beneath his fat cock. His thighs are muscular and have managed to escape the sun's rays. His 'Surfer' tan starts back up just above his knees. Dean then stands and leans back against the closet to jack his meat. As the cam pans up across his body we see the definition he has achieved in his pecs, the 6-pack abs as well as his strong arms. His physique is definitely one of Dean's many weapons in an over stocked arsenal of charms. The bedroom brown eyes and sexy full lips we're sure go a long way in getting their attention. No wonder he hasn't had any problems finding local ladies and the occasional tourist to help him out. He lips his delicious lips from time to time as he focuses on the matter at hand. He lets go of his dick and makes it dance as he flexes his shaft. The view is breath taking on this Latin stud. We don't think there's a bad angle to this guy. He continues to slowly stroke and tease his cock which is getting harder and harder and will soon need some much needed release. Dean's cock is throbbing and his once heavy nuts are pulled up tight. He starts to beat his cock faster and faster as he approaches climax. He spreads his legs a bit wider as he prepares to explode. His massive cock swells as Dean grunts and begins to empty his thick cannon. Blast after blast of semen paint the drop canvas before. Like the professional he is, Dean gives the canvas several coats, as volley after volley of cum platter down across the cloth. He slowly squeezes out the last of his thick load as he catches his breath. Whew. That was definitely a much needed break. --Now, get back to work!",
  "models": [
    {
      "name": "Dean Sands",
      "person_id": 28808
    }
  ],
  "release_date": "2008-12-03",
  "scene_id": 54489,
  "series": "Painter's Dream",
  "tags": [],
  "title": "Painter's Dream, Scene #01"
}