{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Two new faces this week on ExtraBigDicks.com. Mario Cruz, a sexy, defined cafe con leche complected Latino is the first on our duo. Mario came wearing a little red string around his wrist. Apparently, much like Madonna, Mario is a follower of Kabbalah. The red string around his wrist is used to protect the wearer against 'evil eye', negative energy or thoughts that people may send your way intentionally or otherwise. Mario is originally from Panama. He moved to L.A. for a boyfriend and that didn't work out. We've never  heard that one before. Seriously. Mario is open minded, into leather and recently agreed to leave his door open for a trick that came over to find him blindfolded, bent over, lubed and ready to go. He didn't take his blind fold off til the guy had plowed him senseless. Fortunately, it was the same guy in the pictures; because, seriously, everyone online always uses recent and actual pictures--right?? <...cricket...cricket> Moving right along, Leed Scott brings up the rear this week. Leed is new on the scene and is a West coast boy through and through. He's tall with dark features and a classic look on his 6' frame. The San Diego native has piercing brown eyes, a model physique and a thick 8'+ dick he plans on using on his Latin co-star. Some guys have all the luck! Leed isn't as adventurous as Mario; but admits he likes anonymous sex. Home Depot and other cruise spots can be wonderful for spontaneous hook ups. Keep an eye out for this one, we will see more of Leed here and on our brother sites soon enough. He's definitely got the look many will want more of. Let's get these two hotties naked!    The chemistry between these two is obvious as they begin kissing eagerly unable ot get enough of the other. Mario takes the lead and lets his tongue do some exploring on Leed's sexy hairy chest. Lee moans as Mario works his nips. Mario needs more and undoes Leed's jeans and hauls out his semi-hard cock. He engulfs it to the hilt as Leed gasps in ecstasy. His cock springs to full mast in seconds as Mario gives it a spit-shine finish. 'Nice cock' Mario says seconds before going right back down on him. Leed's massive meat is getting the servicing it needed. Leed then pulls off Mario's shorts and kneels beside Mario guiding his head back where it belongs--on his fat cock. Mario lays back and moans as he sucks on Leed's bone. Leed's heavy nut sack slaps Mario's chin as he feeds him. Leed wants some dick to and decides it's time he had some. He dives onto Mario's meat. Mario orders him to take it deep and Leed gags on his throbbing bone. Mario tells him to take it all the way. He kneels in front of Leed and holds his head as he fucks his mouth. As he buries his dick in Leed's throat he bends forward and begins to slap Leed's sweet ass. Leed groans with every slap and the more he slaps him the more it turns him on. Mario takes the hint and goes to work on his ass. He spreads his sweet ass and buries his tongue deep into Leed's ass. Leed groans as Mario eats his sweet ass. Leed then returns the favor but with an added twist--a finger. Leed begins fingering Mario's sweet ass in anticipation of things to cum.   Leed's finger is soon replaced as Leed slowly introduces Mario's tight ass to his thick cock. 'Aww that feels so fucking good' confesses Mario as his ass gives way to Leed's desire. In no time Leed is fucking him deep as his muscular sweet ass rises and falls, pounding Mario to the hilt. His heavy balls now slap Mario's ass as he takes every inch inside. Leed slides in then pulls out almost all the way before slamming back in. his thick cock glistens as it comes into view before disappearing back into Mario's hot hole. Mario then straddles Leed and impales himself on his meat. He rides Leed hard as he bounces up and down on his thick meat. Mario's abdominals flex and writhe as he rides harder and harder. Leed steadies his ass as he lays back and watches Mario's ass swallowing every inch of his cock. Mario's grinding back onto Leed and it's driving him wild. 'Yeah, take that dick.' Leed groans. These two look amazing together as they fuck each other's brains out. Leed wants more of Mario's ass on his terms so he pulls him off his dick and puts him on his back again. Legs in the air and an ass made for fucking; Mario is about to get the load fucked out of him west coast style. Leed slams back inside his hungry hole and starts fucking him deep and hard. Mario is jacking his cock fast and furious as Leed continues his assault. It isn't long before Mario begins to whimper and moan uncontrollably; his uncut cock explodes shooting leche all over his toned abs. Leed then falls back and strokes his own thick load all over his furry stomach and cock. Whew. It seems opposites not only attract; but they create some explosive chemistry too.",
  "models": [
    {
      "name": "Leed Scott",
      "person_id": 27899
    },
    {
      "name": "Mario Cruz",
      "person_id": 28667
    }
  ],
  "release_date": "2008-12-17",
  "scene_id": 54486,
  "series": "Time For Bed",
  "tags": [],
  "title": "Time For Bed"
}