{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we've paired up two of our member favorites, each popular in their own right. The first is our favorite bottom boy, who oddly enough is more of a top in his personal life, Mr. Tucker Forrest. Tucker  is 23,originally from Ohio and was last here deflowering sexy Rocky Charles, who's country charm & long locks would make many hearts swoon. Rocky took Tucker's thick 8' like a man as we watched Tucker fuck him deep. Tucker is beaming like a school girl today because he's always wanted to meet his co-star. Tall, silent, muscular with ink on his massive frame, Mr. Joe Strong could make anyone a tad nervous. Joe  is 26 and originally from Puerto Rico. Joe has been on EBD solo and in action and we never get tired of watching this 6'1' gentle giant bury his cable--8? monster inches of Caribbean cable. Tucker has been traveling and trying to stay out of trouble since we last saw him and he admits it's funny to go back home and run into people he left behind that now know about his internet adventures and it always serves as a good ice breaker and has even led to some hot hook ups. Joe has been up to no good. The hottest sex he's had since we last saw him was hooking up with a married Cuban couple that took him home and then 'took' him. He fucked them both and loved having the wife watch as he dicked her husband. Some guys have all the luck. With a face and a body like Joe's; it's easy to see why he ends up in the hottest scenes no matter where he goes. Today we all know 'where' Joe is gonna go; and from the shit-eating grin on Tucker's face--he does too!                                                               The chemistry between these two is obvious even before the cameras roll. They slowly begin to kiss as they undo each others pants and begin to strip. Joe lies back in his sexy black briefs as Tucker goes to work on his tenting bulge. It isn't long before Tucker pulls down his briefs and gets his first taste of Joe's growing fuck stick. He wraps his lips around Joe' dark, uncut muscle as it immediately comes to life. Tucker lips and sucks on his thick dick as he plays with the thick foreskin. Joe is in heaven as Tuck expertly sucks his big Latin dick. Tucker sits back as Joe straddles him and begins to face-fuck his sweet mouth. Tucker is rock hard as our str8 boy uses his mouth and rubs his heavy balls all over Tuckers mouth and face. Watching Tucker's rock hard cock while getting his own dick sucked has peaked our Str8 boy's curiosity and Tucker leans back against the all as Joe decides to do some experimenting of his own. He softly begins to nurse on Tucker's rock hard boner as Tucker can only gasp his appreciation. Joe slowly and sensuously swallows Tucker's meat as if he had no hurry and wanted to savor every minute. With that in mind they move into a hot 69 where Tucker gets more of his meat to swallow and Joe gets his first taste of the ass he's going to fuck. He laps at Tucker's smooth ass and gets it nice and wet for his fat cock. Tucker is bobbing up and down on his thick cock as Joe buries his tongue deep inside Tucker's hot ass. A tongue in your bum can only lead to fun! ...but you knew that!    Tucker slides his ass from Joe's mouth down to his cock as he begins to impale himself sitting back onto it. Joe looks down and watches as Tuckers tight ass begins to give way to his invading meat. Tucker groans as he takes every think inch inside. Joe wants more control and he bends Tucker over and enters his ass again doggie-style. He slides his fat cock iin deep as he begins to fuck Tucker's ass as he playfully slaps it. Joe's heavy balls are pulled tight as he bounces them into Tucker. Tucker's getting everything he wanted as our str8 boy takes his ass and uses it to pleasure his uncut cock. Joe's cock easily pounds Tucker who grunts as he's being fucked by Joe's ExtraBigDick. Joe then puts Tucker on his back and begins to pound him missionary. He holds Tucker in place as he fucks him deep burying his dick as well as his tongue kissing Tucker passionately. Joe's balls slap Tuckers ass he picks up his pace and in no time Joe jerks back onto his knees, pulls out and unloads all over Tucker who in turn unloads his own load all over his already cum covered abs. I guess it' true what they say. 'Be careful what you wish for--cuz you just might 'take it' all!' ...or something like that.",
  "models": [
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    },
    {
      "name": "Joe Strong",
      "person_id": 28631
    }
  ],
  "release_date": "2009-01-07",
  "scene_id": 54482,
  "series": "Pillow Biter",
  "tags": [],
  "title": "Pillow Biter, Scene #02"
}