{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back by popular request, we have two recent additions to the ExtraBigDick stable of men Dominic and Gio back for more. For those of you unfamiliar with these two, Dominic was here a couple weeks ago. The response was overwhelming, and we brought this 28 year-old San Francisco native back to show us more than just him wanking his thick 8' willy. So we brought him back and paired him together with a Chicago native and newbie to the adult scene, Mr. Gio Sumers. Gio hasn't done much work in the industry but is enjoying the new adventure. 'I thought it would be a lot easier', he muses, 'it's a little more complicated than I thought it would be.' We second that emotion. Dominic, however, has been doing porn for well over a decade. He's done a lot of work between print, web, niche sites, live events, as well as 25 DVD titles under his belt. Dominic has no regrets and loves what he does. He's gotten to experience many things because of it. As we know, Gio loves older guys and prefers to bottom, and Dominic loves to fuck ass with that thick dick of his. We have a feeling this will be another hot session between these two. They are both horny guys who, regardless of all the work they do, seem to constantly feel the need to jack off. Fantasy, role-play and group sessions are just a few thoughts that end up between Gio's ears. Interesting, but we're here to see what ends up between his legs--not that pretty little head of his! ...and we're off. Dominic and Gio begin kissing softly as they get reacquainted. It isn't long before Dominic moves over to the couch, where he sits back and lets Gio undress him. As his clothes come off, Dominic's thick dick is already tenting his sexy black briefs. He moves again to the far wall as Gio follows him like a moth to a flame. Once he gets to Dominic, Gio unveils his fat cock as it springs out to greet him. Gio goes down on it immediately as he begins savoring every thick delicious inch of it. He playfully slaps his cock on Gio's face and tongue before sliding it back inside to face fuck him some more. Gio is in heaven as he gets more of the cock he came back for. Dominic slides and rubs his spit soaked cock all over his cocksucker's face. Dominic is in total rapture as he leans back against the wall, holds Gio's head, and fucks away at his throat. Gio's mouth has Dominic in a frenzy. He readjusts and puts Gio on his back before kneeling over his face and shoving his cock back in for more. Gio tries his best to accommodate Dominic's fat meat as he begins to pound him deep. You can hear Gio gagging a bit with every deep thrust Dominic gives him, yet he doesn't fall behind, and Dominic is loving it. He pulls his thick meat out so he can watch Gio laying there, staring up at him like a hungry chick begging for his meaty worm. ...Open up and say,'Aaahh!' The oral action is about to get better as Dominic bends Gio over the couch to start prepping his ass for a hot fucking. Gio moans in ecstasy as Dominic shoves his tongue deep inside his tight ass. Dominic laps at his prize as Gio revels in pleasure. Dominic can't get enough of his sweet ass as he spreads his cheeks wider to get his face as deep as possible. Gio won't be able to take much more before he's begging for it. Dominic sits back on the chair and motions Gio over, who straddles him and feeds him cock. Sucking Gio's cock gets Dominic rock hard and ready to fuck. Gio grimaces as Dominic begins shoving his cock deep into him. Dominic means business and plows Gio deep in no time. His thick cock plays peek-a-boo as it pops in and out of Gio's ass. Dominic then puts him on his back and holds his legs straight up in the air before slamming back inside. He starts fucking Gio harder and as he does, Gio's abdominals all tense as he braces himself. This gets them to the brink of exploding. Once he's ready to blow, Dominic jacks off inches from Gio's face, exploding load after load of thick cum all over his pretty face. Gio then busts his own all over himself seconds later. Whew. That's a wrap.",
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 28599
    },
    {
      "name": "Giovanni Summers",
      "person_id": 30672
    }
  ],
  "release_date": "2008-12-31",
  "scene_id": 54483,
  "series": "Hide The Boner",
  "tags": [],
  "title": "Hide The Boner, Scene #01"
}