{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have 2 for the road this week with two hot alumni having their first 'go at it' for our fans to see. The first is Derek Princeton. Derek   was last on EBD when he somehow agreed to bottom for the first time. Somehow this poor str8 boy had the fortunate misfortune of ending up on the very fat end of Jarrett Fox's thick dick. Many would pray for such a fate! lol That was a steamy set and Derek took it like a champ. He's back this week and we've promised he can be the one to lay pipe this week as he continues to push his sexual envelope. Curiositys a Bitch, eh!? Seeing as his recurring theme here has been massive cocks; we figured we'd keep this str8 boy on the same path to bliss and Boo-yow! Sporting a fat 8?' cock, Cody Kennedy came to mind and he was more than willing to help us out. Originally from Salt Lake in Utah, Cody  is built like he'd be packin a cap gun --but he packs an Uzi instead. One of 84 Mormon grand children, Cody claims he is the only black sheep among them. He is 'the only gay in the (family) village'. Mmhmm.  Statistics would suggest otherwise; but we're not that kind of site. Moving right along, today Derek will get a chance to play with the big cock instead of taking it. He'll have some hot male on male action and get to be on top this time. He's definitely gonna be in excellent han--err buns. After all, Cody is a Kennedy. The chemistry is apparent from the go with these two, wasting no time getting to know each other. Their tongues intertwine as they kiss and it isn't long before they're pulling off each other's clothes to have more to lick and suck. Derek takes the lead as soon as Cody's massive cock comes into view. He goes down on Cody who is more than willing to give the str8 boy his fill. Cody will get his sooner than later. After a few minutes on his cock, Derek gets pulled off and stood up so that Cody can show him how it's done. Derek can only moan in delight as Cody expertly engulfs his thick cock. Cody definitely knows what he's doing on Derek's breeder bone. Cody isn't stopping there, Derek's getting the deluxe treatment as Cody bends him over the armchair. Cody spreads Derek's smooth cheeks apart and dives in tongue first. He laps at Derek's rose bud while Derek's face furls in ecstasy. Cody can't get in deep enough so he flips over and hits it from a better angle, forcing his tongue deeper into Derek's hot ass. Cody definitely knows how to toss a salad and from the looks of it he skipped lunch. Derek's cock is throbbing by now and Cody has big plans for it too. He turns Derek around and once he's seated, Cody seats himself--right on Derek's cock. He begins to ride Derek's thick cock and in no time Derek is fucking up into Cody's ass wanting even more. Cody's face says it all--he's in bottom boy heaven getting str8 dick shoved deep. Cody then gets off Derek and bends over for him giving up control and letting Derek fuck him at his own pace. Derek immediately gets his cock back in Cody's hot ass as he fucks him doggie. Cody has one leg up on the chair and the view from below is amazing as Derek impales his ass over and over. He holds on to the chair with one hand and Cody's leg with the other as his navel and hips dance in and out of Cody. Derek's mouth is gaping and his eyes are shut as he revels in Cody's tight ass. Derek then flips Cody over and takes him missionary. He wants to see the look on Cody's face while he takes his ass. Cody spreads his cheeks wide wanting that cock back up his ass. Derek obliges and now watches Cody jack his monster meat as he watches his own cock disappear inside that hungry ass. Derek's cock is hitting all the right spots and Cody grunts as his cock shoots its nut all over him. Derek keeps plowing Cody's ass 'til he's fucked every drop out of him. Derek then pulls out and strokes off his own massive load all over himself. For a str8 boy he sure is a quick study. Bright one's can be fun too! --Who knew?",
  "models": [
    {
      "name": "Derek Princeton",
      "person_id": 28293
    },
    {
      "name": "Cody Kennedy",
      "person_id": 30499
    }
  ],
  "release_date": "2008-11-05",
  "scene_id": 54497,
  "series": "Dirty Deeds",
  "tags": [],
  "title": "Dirty Deeds, Scene #01"
}