{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a West Coast morsel that somehow ended up clear across the country and in our laps...so to speak. At 5'7 with a muscular, lean frame, Dominic Pacifico is another example of how big things come in small packages. Dominic is packing a thick 8' piece of San Francisco Bay bone. Dominic is 28 and currently single. He's open to more than staying single, and loves a guy with a great sense of humor - though a nice body is a plus. He is very versatile and is a sucker for a hairy chest. He's definitely a chest man. 'Big and defined and smooth is nice; but if it's less defined and hairy, that's nice too,' he smiles. Dominic got an early start at 13 with an older boy who was 17. It was a great first experience and he has no regrets. He attributes that to having had the time to really enjoy it instead of a hurried first time some others have had. We're guessing the folks were away and Dominic did play. When asked about the hottest sex he's had, he grins and tells us a while back he was 'taken for a ride'. Some guy offered him a ride on his motorcycle. He agreed and once on, the guy drove way out and down a dirt road. When he got off the bike, the guy pushed him down on the ground, pulled down Dominic's pants and had his way with him. Woof! It must've been a hot scene. Dominic still  flushes retelling the tail. The one thing he has yet to try is a group scene. If he could have his way, he'd want at least 8 guys involved. Hmmm, that's a guy per inch! ...Interesting <evil grin> Wearing a tight black tank and jeans, Dominic begins to slowly feel his taught chest and abs. As he does, he runs his hands up into his tank and gives us our first peek at his sun-kissed washboard abs. Dominic determination at the gym is undeniable. He takes off his tank and reveals his defined chest and abs. He has a sexy happy trail that disappears into his trunk cut briefs. The jeans come off as he makes himself at home, slipping into something a little more comfortable. (...and by 'more' we mean 'less') As the briefs come down, we see Dominic's sweet ass. Someone loves to sun bathe nude, cuz there isn't a tan line on him. It's one continuous shade of yum. He slowly feels his muscular ass, teasing us as he does. He takes his sexy self to the couch where he lies back and gives his now throbbing cock some help. He holds his thick meat at the base with his tight hand and strokes lefty. His cock is more than a mouthful. As the camera pans giving us a view from below, we see just how delicious the landscape is. His heavy nuts hang below his thick cock. Just past that, we see the rippled abs, defined chest, and that swarthy, sexy face. Dominic's bedroom brown eyes and full lips would make anyone take a second look. As he continues jerking his cock, his hands begin to roam further, exploring his sexy body. He teases his hairy ass a bit as he strokes, which only makes his cock throb harder. Looking at this muscular, Latin stud with his legs in the air is a sight to behold. His muscular shoulders and arms all add to the view as he gets closer and closer to his climax. His lean physique looks amazing as the light dapples on every lickable curve and definition. As Dominic gets closer, he stretches his legs out, and you can see his body begin to tense as his stroking intensifies. His cock is aching and incredibly thick as it prepares to launch its contents all over our sexy stud. Dominic's pecs are flexed as his bod begins to rise and fall as he jacks faster and faster. His eyes are locked in on his cock, awaiting the fireworks. It isn't long before he's grunting and his cock is exploding. His abs clench, and in seconds, they are splattered with his thick cream that lands in waves, coating his sexy happy trail leaving poor Dominic spent. Whew. --Now that's a San Francisco treat!",
  "models": [
    {
      "name": "Dominic  Pacifico",
      "person_id": 27999
    }
  ],
  "release_date": "2008-10-29",
  "scene_id": 54499,
  "series": "Purrrrfection...",
  "tags": [],
  "title": "Purrrrfection..."
}