{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week on ExtraBigDicks we have a special treat. We've brought back one of our regular favorites, Mr. Tucker Forrest. Tucker, originally from the cold Midwest; now calls Ft. Lauderdale home and the locals, as well as our fans worldwide, just can't get enough of this compact cutie and his meaty joystick. Tucker is treating us to a special event this week. Tucker has been mostly a bottom on cam for us and other sites but in his personal life he's more of a top. With an 8' thick dick on his 5'6 frame he boys go nuts. Tucker says he's not a selfish top and gives it as well as he takes it. We've seen Tucker on both sides of that here on ExtraBigDicks. Tucker's been moonlighting on our brother site, CircleJerkBoys and he met a hot Virginian by the name of Rocky Charles. Rocky is the bisexual poster boy and lives by the creed 'A mouth is a mouth & a hole is a hole'. You gotta love free thinking boys that appreciate the skill over the gender. Rocky & Tucker were paired up several times on CJB for some stroking, oral &  then Rocky got to bury the deep one a couple weeks ago. Tucker's been a good sport up til now and the time has come for him to get to tap some ass too. Tucker will get to top Rocky's inexperienced hole. Rocky admits he loves fingers and tongues exploring his ass while getting oral but has been a bit hesitant as far as letting a dude fuck him. It's the fear of liking it that keeps 'em leery. lol Well, Tucker decided that if he was gonna get to fuck Rocky's sweet ass, it would be on his home turf here on ExtraBigDicks. So this week, we bring you 'Tucker & Rocky' in Rocky's first ever scene where he 'takes it like a man!' We have front row seats, too. Buckle up; we--well, Rocky--is in for a bumpy ride!They begin by making out slowly as the familiarity lends itself to more intimacy. They begin to slowly undress each other while sucking face. Rocky's inked, defined body comes into view as Tucker undresses him, tugging at his shorts to get at that ass that will soon be his. Rocky stands on the couch and Tucker, now eye-level with his cock, undoes his jeans and pulls them off, Tucker then does the same as Rocky helps strip him bare. Tucker then lays back and lets Rocky have his way with him. Rocky is extremely oral and when it comes to guys he loves to suck cock. Tucker's thick dick is hard in seconds as Rocky engulfs it with ease. Swirling his mouth and hands on his shaft and knob all Tucker can do is moan in ecstasy. Rocky then stands up and gives Tucker a face full of cock as Tucker has a go. Rocky groans as Tucker gets reacquainted with Rocky's hard cock. From there Rocky turns around and bends over thrusting his ass into Tucker's eager mouth as he begins to rim Rocky's ass preparing it for the fucking to follow. Rocky bending forward in a 69 and continues to suck Tucker's cock even harder with the sensation of a hot tongue fueling him on. It won't be long now before his ass is begging for more--a lot more! This is gonna get interesting in no time. Something tells us Rocky's gonna have to grin and bear it. Fortunately, he's in good hands with Tucker who will go easy on him.Rocky straddles Tucker as he reaches back and grabs his throbbing cock, aiming it towards his virgin hole. His ass clenches and he is visibly struggling to get it inside him 'This shit ain't funny.' Rocky laughs between deep breaths trying to get it in. Tucker tries to comfort him telling him 'Shhh.' Rocky snaps '--Shhh MY ASS!' lol There's nothing to do now but wait while Rocky slowly adjusts to the sensation of Tucker's larger than life cock as it slowly invades his hole. Rocky is breathing like his water just broke and he's in labor as he gets a overgrown package shoved up inside him as opposed to one coming out of him. Tucker then flips him over into a missionary position giving him a bit more control and making it easier on the newbie so he's not taking more than he needs to. Rocky's getting used to the sensation and is now stroking his cock as Tucker holds his legs in the air and steadily fucks his ass. Rocky's head is turning side to side as he begins to enjoy the sensation of Tucker's cock inside him. Now our bi boy knows what it feels like for the few boys he's had the pleasure of fucking. His face speaks volumes and you know his emotions like his sensations are mixed. He may be enjoying the Kool Aid; but he's just not sure he'd buy it again. Tucker then bends him over and enters him doggie. He fucks him for a bit before Rocky grunts, 'Do what you gotta do but make it quick. This shit's starting to hurt.' Tucker immediately pulls out and gets him back into missionary where he can enter him easier. Rocky grabs at Tuckers face and begins to make out with him as he fucks him which does the trick. Tucker pulls out close to climax as they both stroke off side by side. Rocky is the first to blow and the visual of his cream coated knob is enough to send Tucker over the edge as he too sprays his thick load all over himself; blasting cum all over his smooth chest, and coating his happy trail. Whew. When asked if Tucker had made him a 'Power Bottom', Rocky blushes and laughs as he says 'I can't say a 'power bottom'--but my ass hurts!'",
  "models": [
    {
      "name": "Rocky Charles",
      "person_id": 27956
    },
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    }
  ],
  "release_date": "2008-11-26",
  "scene_id": 54492,
  "tags": [],
  "title": "Your Turn!, Scene #02"
}