{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Dom D-Dom Dom--Dom! Dominic Pacifico is back! Dominic  was here a couple weeks ago. The response was overwhelming and we felt we couldn't pass up the chance to give you more of what that little fishing town with an opera house has been hiding. Dominic hails from San Francisco for those of you who aren't familiar with this 28 yr old sun-drenched muscle stud. He's single and we're sure he has his fair share of admirers back home. Bedroom brown eyes, full lips and a smile that could light any room, Dominic has all that to offer--and packs a thick 8' dick too! Some guys get--everything! Dominic appreciates a man that takes care of his body; but a great sense of humor and having something to say scores points with this Renaissance man as well. He's versatile and likes to explore new things. He got an early start and has since perfected his craft. Today we plan on seeing just what this smooth, defined love toy can do. Dominic brought along a friend today. Gio Sumers is 19, single and cute as all hell. At 5'8' with a lean 117 lb. frame, this Chicago native is down in Florida enjoying the weather. He admits it's a lot hotter and the humidity is kicking; but Chicago has the Lakeshore and, well...we have South Beach! Sexually Gio is versatile as well. Go Figure! He grins and admits he prefers to bottom and loves older guys. Oh, the beauty of it all. How many times does 28 go into 19? Hmmmm. Well, we might need to get these two back again to find out! Dominic wastes little time before going in for his mark. He leans in for a kiss pushing Gio back as he climbs on top. They make out as Dominic slowly begins to undress Gio as they continue sensuously kissing. The chemistry is obvious as these two linger in the moment, passionately kissing and in no rush to hurry anything along. If it's good why rush it? The kissing slowly begins to roam from their lips to their nips from their necks down to their pecs. (Ok, that rhymed!) Gio's curiosity eventually gets the best of him as he positions himself between Dominic's legs wanting to see if the rumors were true. He hauls out Dominic's throbbing cock and much to his delight they're all true. Next he does the only logical thing--he shoves it down his throat wanting to get every inch of it! Well, what would YOU have done? We're not mad at him. lol neither is Dominic who gently caresses Gio as he services his cock. Next Dom pulls Gio up on the couch and as Gio rubs his underwear clad cock along Dominic's face, Dominic reaches up and slips a quick finger up inside Gio's underwear inspecting the sweet ass he will soon claim. The inspection passed so well that Dominic bypasses Gio's swelling meat and bends him over the couch to start eating his sweet ass. Gio's face says it all as Dominic expertly tongue-fucks his sweet hole. Gio falls forward and starts to deep-throat Dominic's fat uncut cock which only makes Dominic eat his ass that much harder. Every Ying needs its Yang. Purr-fect Harmony. The oral action is only intensifying as Gio decides to take matters into his own hands...or mouth actually. He has Dominic kneel on a chair, bends him over and goes to town on his muscular ass. Dominic can only moan in pleasure as our young stud dances his hot tongue all over Dom's rosebud. Every good rimming deserves another and Gio isn't holding anything back. After he eats Dominic's ass for a while, they move over to the couch and get back into a hot 69 again. Only this time, Gio is sitting on the floor with his back to the couch and Dominic stands over him, feeds him his dick and then bends over to suck on Gio's. Acrobatic Cock-a-Robics. These two are trained and horny professionals--Do not try this at home! All the oral action has these two ready to blow and as they get closer to cummin' they regroup back on the couch. Dominic lies down and strokes his massive cock while Gio watches, squatting on the couch at his feet. Dominic grunts and as he gets closer to climax and as he's moaning his cock begins to fire off what can best be described as ropes of thick cream firing up over his pecs and abs. His nut is massive and coats his sexy body. The visual is enough to send Gio over the edge as he straddles Dominic's cock to unload his own massive nut all over a spent Dominic. Whew. These two go out as they came in as Gio bends over again for more of Dominic's sweet kissing. The End. ...or is it? <evil grin>",
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 28599
    },
    {
      "name": "Giovanni Summers",
      "person_id": 30672
    }
  ],
  "release_date": "2008-11-12",
  "scene_id": 54496,
  "series": "Nervous Much?",
  "tags": [],
  "title": "Nervous Much?"
}