{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we bring you two studs whose ancestries goes back along similar lines. The first is Maximo Cazzo. Judging from the name, you can imagine there's gotta be a reason why anyone would be named 'biggest cock.' Well, we have 8 and a half reasons why. Maximo sports a 8 and at times 8.5 inch cock. We're sure the boys in San Francisco are all lining up to welcome their newest addition to the Castro district. He's first generation Lebanese/Italian, and was brought up with the same culture in which his parents were reared. His family migrated during the civil war in the 70s. Add a little Italian for good measure, and we got Maximo. Maximo loves it out in California, and it's a far cry from Detroit where he spent the last few years. He spent the night partying with buds on the streets in the Castro, celebrating the over turning of the anti-gay amendment. 'Back in Detroit, we'd been secretly calling each other to say 'Hey we can get married, let's go to California!'' he laughs. Admittedly, the gays are a bit more 'progressive' out West. We also have another hottie whom we've brought along to throw into a hot bathroom with Maximo. He goes by the name Jeharrad L?pez. Jeharrad is 22, and a quarter Lebanese. We're not sure which quarter; but all of him looks edible. His family also fled the war, but landed in Venezuela. We here in Miami know all about Venezuelan boys; so we can only imagine Jeharrad's keeping the boys in San Diego quite busy. Let's see, 2 mostly Lebanese, horny boys, 1 hot bathroom, a cam--what else do we need? J By the time we roll, the heat has our boys half-dressed. Jeharrad is twirling his growing cock, and Maximo in unbuttoned jeans decides to address the situation. He kneels before Jeharrad and takes his cock in his mouth. Jeharrad's cock is quick to respond as it grows bigger and bigger. Maximo expertly holds Jeharrad's thighs as he moves them back and forth, fucking his mouth with his buddy's cock. Jeharrad closes his eyes as he gets serviced, but his curiosity is piquing. He has met the man and heard about the myth--but needs to taste the Legend. Maximo hauls out his growing cock and offers it to Jeharrad, who quickly kneels in the shower stall to get at it. Maximo holds the back of his head as he bobs his mouth on his thick monster dick. Maximo wasn't kidding; his cock is as thick as a beer can. Jeharrad slowly takes more and more meat in his mouth as Maximo patiently guides his head deeper and deeper. Jeharrad's mouth has got Maximo hard, but Maximo's gonna want more than just a mouth to plow. He stands Jeharrad up against the tile wall and goes down to taste Jeharrad's sweet ass His ass looks like 2 perfect orbs bouncing atop one swarthy Mediterranean tongue. Maximo laps at Jeharrad's tight ass, burying his tongue deep inside. Hmmm, Five O'clock shadow Rides 50 cents.Next thing we see is these two laying side by side, with Jeharrad's leg in the air and Maximo's third leg looking for a new home. He slowly tries to gain entry into Jeharrad's ass. Little by little, it gives way, allowing more and more cock inside. Jeharrad holds Maximo's meat as he tries getting more up his ass. Jeharrad's face says it all as he tries to concentrate on getting that cock inside him. Maximo changes positions and bends Jeharrad over so he can get in from behind. Holding his waist still with one hand, Maximo begins to fuck our Latin boy slow and steady. His cock is getting in deeper and deeper as Jeharrad's ass surrenders to the massive meat. Maximo holds his mostly hard cock at the base while slipping it in and out. Maximo's, olive-skinned, hairy Mediterranean features contrast nicely to Jeharrad's smooth, sun-kissed ones. Jeharrad's had all he can take before they both sit side by side on the floor to jack their cocks to completion. Jeharrad's the first to blow, shooting an impressive load. His first jet shoots clear across the bathroom while the rest coat the floor below. Maximo follows suit as he pumps his own thick nut out over his sexy happy trail.",
  "models": [
    {
      "name": "Jherrad Lopez",
      "person_id": 28338
    },
    {
      "name": "Maximo Cazzo",
      "person_id": 28670
    }
  ],
  "release_date": "2008-10-22",
  "scene_id": 54501,
  "series": "Exchange Students",
  "tags": [],
  "title": "Exchange Students, Scene #01"
}