{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "IIt's all about the 'dick' here at ExtraBigDicks so we brought back one of our favorite dicks--Dick Armstrong that is. At 19 years of age, Dick  has quite the whopper in his pants. A thick 8.5 inch cuban cock that keeps his fiance very satisfied. We're pretty sure it keeps more than just one Florida girl happy. Recently Dick was pulled over by a female trooper who through sheer luck recognized him from his online work and they were able to 'settle out of court' and do some on-site payments in the back of her patrol car. Having a big dick does have its privileges. Someone who also knows all about its privileges, and its downfalls, is Lee Snyder. Lee is 21. He's originally from Austin, Texas. He's another 'long horn' from the Lone Star state measuring in at 8.5 inches as well. He knew he had a big dick at 15 when he was dating women who were 10 yrs his senior. They both agree having a big dick is awesome and it helps them get laid. Dick loves watching a girl's facial reactions as she tries to take it. Lee confesses he has hurt a few women in the process and has even had one or two just refuse to even try. Lee's only had one girl deep throat him and Dick pouts as he admits he's still waiting to find one that can. I guess you can't send in a girl to do a man's job! When will these str8 boys ever learn? Watchin a flick and talking smack these two start rubbing their cocks through their jeans. In no time you can clearly see the 'excitement' tenting their pants. They each shuck their tees and continue tuggin' at their cocks. Dick undoes hid jeans and gets comfortable on the floor while Lee unbuttons as well and moves over to the chair after dropping his shorts. Lee's cock is rock hard and aching to get out of the underwear containing him. Dick moves closer to the TV and with his back to Lee drops his jeans and begins stroking his fat cock. That's all the reassurance Lee needs as he too strips. Dick turns around and continues jackin his meat while he eyes up the competition. Seventeen inches of str8 boy dick: That's one HELL of a weekend if you ask us! lol They jack their cocks to the flick while sneaking glances of the other's equipment. From there they move back to the futon where they started, they each partially kneel on the futon as they work their massive cocks. Their straight baby makers are mere inches from each other as they pound their cocks. It's like watching two male beta fish drift dangerously close to each other. Something's just gotta happen. Not a moment too soon, Next thing we know these two are sword fighting with their lickable lances. <Boy Scout flashbacks!> ...I digress  They take their places on the futon, Dick laying back while Lee sits at his feet each stroking their massive meat. The side view is amazing as we see the 'all the cock you can shove wherever it'll fit' landscape. They each focus on getting their loads out to relieve their now aching balls. Lee plays with his meat holding his monster rod by the base as he looks down at it almost in wonder. Lee then moves to the floor and lies parallel to Dick who's stroking on the futon just above him. With all the stroking these two have been doing it can't be long before they start to unload. Sure enough Dick is the first to nut. Without much warning, Dick's abs tighten as he curls forward seconds before his fat cock pumps out his thick load. Dick's face furls in ecstasy as h e continues pumping his nut all over his shaved crotch, navel and even coating his sexy Scorpion tat. Lee sensing Dick's climax looks over to see Dick pumping his cum everywhere and it instantly send him over the edge. His fat cock sends up a thick lasso of cream that falls right back on itself lubing up Lee's cock even more as he jacks the rest of his thick nut all over his happy trail. His very happy trail.",
  "models": [
    {
      "name": "Dick Armstrong",
      "person_id": 28596
    },
    {
      "name": "Lee Snyder",
      "person_id": 28653
    }
  ],
  "release_date": "2008-10-15",
  "scene_id": 54503,
  "series": "The Sword Fight",
  "tags": [],
  "title": "The Sword Fight"
}