{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week's ExtraBigDick is Derrick Taft. Derrick's 25 and is from the San Francisco bay area in sunny California. This tall, thick hottie is everything you'd want in a hot jock: muscular, defined, chiseled features, into sports and a snow boarder as well. He loves soccer and hangs out at the beach on his free time. He lost his cherry in Junior High at the age of 14 with a girl he was dating at the time. He's a horny guy and has to beat his meat at least 2 times a day to keep his demons at bay. His extra thick 8.5' monster cock does have a mind of its own. His thick cock has often given him problems with girls who can't take it, but it never stopped him from finding places where he could fuck all through High School. He's a leg man & smiles when he admits his legs are the part of his own body he likes the best. He's sexual and adventurous and his ultimate fantasy would be a group scene with a couple girls and maybe even another guy experimenting as long as it's hot. Sounds like there's hope for this thick jock yet. His face and cock have gotten him plenty of attention and even landed him a spread in Playgirl last year. Today we're gonna have Mr. Taft all to ourselves so kick back, unzip and enjoy the show. Derrick slowly begins to grope his crotch as he sits back on the nightstand. His shirt comes off as we get our first glimpse at his thick frame. He's naturally smooth and has two small cinnamon nips that adorn his defined pecs. He wastes little time in losing his jeans and the sexy blue briefs follow suit almost immediately. His abs flex as he takes off his briefs and frees the soft monster cock of his. It comes to life in seconds as he pulls and strokes on it. He focuses all his attention on the end of his thick club. His breathing deepens with every stroke of his now throbbing cock. It is curved downwards at the tip and has a large thick knob. No wonder those HS girls had problems taking all of his cock inside them. He lays face down and starts to dry hump the bed as his cock strains against the bed loving the friction. He rolls over and spreads his legs wide to start playing with his thick dick with ease. His knob is leaking small pearls of precum as Derrick works and strokes it. He uses one hand to hold it at the base and teases it with the other, often times needing both hands to fist it properly. This boy's definitely packin'! He goes on all four to show us that sweet untapped ass. His beefy ass has a light dusting of hair and his sweet hole peeks out from between his round cheeks. Bib anyone? His balls are pulled up tight near the base of his swollen cock as he continues to stroke it. The view is insanely hot. He then goes back to lying on his back as he once again starts stroking and teasing his cock. He runs his fingers around his door knob cock as he shudders in ecstasy at his own touch. He knows just where to caress to get his cock to dance. He can't keep this up for much longer so he repositions himself and lies back to finish off and give his aching meat the release it so desires. His meaty shaft is amazingly thick from the base to the end as he strokes it faster and faster. His nuts are now pulled tight and ready to unload their precious cargo. He begins to breath deeper and sporadically as he again works just his knob. That does the trick and Derrick is sent over the edge. His mouth gapes open as he softly lets out a series of sinfully hot gasps each accompanied by a massive explosion of cum most of which volley over his abs onto his smooth chest. Derrick jerks and writhes in pleasure as he continues to pump out his thick cream. He finally relaxes as he gently caresses his equally-spent cum covered tool. Whew. Now that was definitely a hot load from an ExtraBigDick! Cheers.",
  "models": [
    {
      "name": "Derrick Taft",
      "person_id": 28593
    }
  ],
  "release_date": "2008-09-24",
  "scene_id": 54509,
  "series": "Big Things Come In...",
  "tags": [],
  "title": "Big Things Come In..."
}