{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "After discovering San Diego during a Gay Pride weekend, we now have a newly relocated Texan among us. Austin Jacobs is from Texas from the city that shares his name. He recently moved in with his boyfriend and is beginning to settle in here on the west coast. He's a tall one and stands at about 6'3'. He's tall, lean and has sexy dark features. He admits that when it comes to dating he definitely prefers older guys because he finds them to be more mature. That's usually what he prefers but he's open minded. 'Open Minded' is a good choice of words to describe his play mate this week. Cody Kennedy is back to show off all he's got to offer. Cody  was last here doing a steamy 3-some where he took two cocks at the same time. We're still getting fan mail from that one! What a little lube can do. Cody may not have the height Austin has; but this compact 5'7 hottie packs an impressive 8.5' fuck stick. He laughs as he confesses '...but I'm a bottom!' He's only topped a handful of times and they've all cried. We suggest he find a more appreciative audience. Cody doesn't have a set type as far as the men he dates referring to himself as an open m indeed kinda guy. (i.e. slut) His words not ours! He's dated guys in their 20's, 30's and just recently celebrated his birthday in Chicago with a sexy daddy older than his own daddy. Who knew? They both peel off their tees and within seconds, Cody unbuttons his fly and hauls out his cock. He's commando so it rolls out as soon as his button-fly's release it. If Austin had any doubts about Cody's endowment, they've all been answered instantly. Needing a closer look, Austin goes down quicker than the Titanic. Cody moans as he feels the wet mouth wrap around his throbbing meat. Cody sits back on a bench as Austin lies on the floor below still suckin at his meat. Cody is loving it as he fucks Austin's hot mouth, holding his head and feeding it to him inch by inch. It's Austin's turn as he has Cody work his thick cock. Cody expertly bobs up and down on his thick shaft as Austin bites his lip and closes his eye in ecstasy. He holds Cody's head with both hands as he fucks his throat causing Cody to gag once or twice as he buries it deep. Austin's lean body is naturally defined and practically hairless except for his pits and his bush at the base of his meaty cock. The same bush that Cody's nose is buried in as he swallows his cock. Austin's cock is in heaven, but needs more than a hot mouth as Austin gloves up and sits on the floor allowing Cody to take control. Cody straddles our tall Texan and in no time is bouncing up and down on his thick shaft. Austin steadies Cody as he holds his sweet ass and helps bounce him up and down on his cock. Cody then gets up and lies down on the ground and lifts his leg as Austin jockeys into position behind him seconds before slamming back inside. In this position Austin has all the control he needs as he holds Cody's leg and buries his cock deeper and deeper. Cody begins to jerk his thick meat as he gets his sweet ass pounded. Close ups of Cody's ass being invaded by Austin's meat give you a better perspective of the 'all you can take' Texan Fuck fest. Austin then gets up on his knees and fucks Cody missionary allowing him even deeper penetration. His sweet ass going back and forth as he shoves his cock home. They are both moaning as their breathing begins to become labored. It won't be long now.  Sure enough, Cody's thick cock erupts sooner than he expected as he's forced to finish himself off sending his thick spunk all over his tight abs. Austin then pulls out and sits back as he jacks himself to completion. His head goes back as his cock explodes wad after wad of jizz all over himself. We guess an open mind is a terrible thing to waste!",
  "models": [
    {
      "name": "Austin Jacobs",
      "person_id": 28337
    },
    {
      "name": "Cody Kennedy",
      "person_id": 30499
    }
  ],
  "release_date": "2008-10-01",
  "scene_id": 54508,
  "series": "The Game Of Cat & Mouse",
  "tags": [],
  "title": "The Game Of Cat & Mouse"
}