{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Dark swirls of hair peer over the top of Playboy's wifebeater, while his hand never leaves that bulge in his pants. Here at ExtraBigDicks.com, that is just how we like it.  Playboy was having his first sexual experience at 14, with a girl from school, and was busted by his Aunt. He took that as a sign he needed to try something else. The next year, he sampled his first taste of man flash and has never gone back to the fish counter. His wildest sexcapade was doing the nasty with his ex across rail road tracks in the middle of broad daylight next to a busy warehouse...'I loved it!' was all he had to say, and the dancing in his pants told the rest! One mention of his boyfriend, and this 26 year old serving of chocolate breaks into an ear to ear smile and gives his already growing cock another deep, hungry grasp, 'I can be here and put on a show for you and still remain to true to him!' Attracted to his boyfriend's accent and sense of humor, we couldn't help but ask if he goes home to someone as well hung as he himself is. 'Nah,' he said, shoving a hand down his jeans and rearranging the inventory, 'but that's ok, I got plenty for us both!' In the 10 nanoseconds between Playboy saying 'both' and us saying 'action,' he had already slid down on the couch, worked his wifebeater up to his cinnamon colored nips, and took his hand out of his jeans only long enough to undo his belt: This boy was ready to play, and so was Playboy. His shirt now history, we can follow the trail of dark hair as it fans across his lean abs and comes to a dead end at the top of his green, packed briefs. Barely semi-hard, he hauls out his heavy meat under an endangered species these days: a natural, wild bush just as thick and dark as the big meat it crowns. Standing up and showing off the schlong in profile, it grows in length in his warm big hand, but the width is plump, too. This fat club of a dick is fat and juicy, with an upward bend just under the tip that looks like it could do some serious damage to everyone's tonsils. When it comes to fucking, all we can say is, only experienced power bottoms need apply, and don't say we didn't warn ya!Salami thick, glistening in pre, and framed in a sea of black hair between those long lean legs, Playboy fists that pole deep and hard until his cock looks like a creature unto itself, complete with a glowing pink head and a big piss slit of an eye that seems to be staring right at you. Moving to the chair, the head of the cock now seems to hit his chest above his nipples and works hand over hand, double fisting that beauty until his balls are high, tight and seem to disappear and become part of that fat shaft. Sprawled out on the couch, his body is functioning like a lean machine, with the singular purpose of extracting as much pleasure, and every drop of sperm, out of a cock and balls engorged to the point of rhapsody. Though not even a moan escaped from his lips, his entire body tensed, and soon the first jet of thick white, molten jizz started a puddle on his palm that soon grew in a lake of sperm deep enough for even a stud this hung to play with!",
  "models": [
    {
      "name": "Playboy",
      "person_id": 28685
    }
  ],
  "release_date": "2008-10-08",
  "scene_id": 54505,
  "series": "Locked",
  "tags": [],
  "title": "Locked, Scene #01"
}