{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have two fan favorites back to stroke their str8 cocks side by side for the first time. Two straight studs jackin their extra big dicks inches from the other. We know you'd love to see more ...we're working on it!  Ronald Casis originally from Colorado, is 27. The phrase 'Speak softly and carry a Big Stick' definitely sums him up. This soft spoken stud packs an 8' thick cock that drives the ladies crazy. He's currently single and admits he loves living in Miami. He's been down here for a little over a year and even though he's not seeing anyone special he's happy with what he's got going onAnother Stud that loves Miami for all it has to offer is our second partner in crime, Dick Armstrong. This 19 yr old Miami another one of Miami's Cuban Cuties and has the 8'+ pinga to prove it. He's now engaged and says the sex is phenomenal. He loves the thrill of public sex and that keeps their love life fresh and exciting. They were recently on a cruise and ended up fucking in an all glass elevator. We need to figure out what cruise  that was? He beams as he admits he loved knowing he had an audience. We bet! Well, since both of these hotties admit they appreciate an audience watching them while they work their magic...let's give 'em one! Sitting in their chairs they both begin stroking and tuggin at t heir growing crotches. As the camera pans across the str8 panorama, Dick takes an opportunity to give us a wink and a kiss. Hot and Trouble! It isn't long before they begin to strip down. First their tees come off as we see Dick's tat of a scorpion just above his waist line. With Dick in his shorts and Ronald in his briefs they lie back and watch a flick while getting their massive meat ready to go. Ronald is the first to slip off his briefs freeing his massive cock to give it the room it needs to breathe. Dick isn't far behind as he drops his shorts and begins jackin his swelling cock. A close up of Ronald's thick club and we can better appreciate his meat. It's as thick at the base as it is at the knob. Dick is beating his growing cock rapidly; his hairy balls bouncing in tune with the quick stroking above. From there they switch positions as Ronald sits on the couch inches from where Dicks laying still double-fisting his Cuban Pinga. Close ups of Ronald's sexy face are made that much hotter by the sight of Dick's thick meat towering just behind him. As the camera pans back and shows off all they got to offer, there isn't a single bad angleThey both stand up and continue jackin their cocks. Dick on the chaise and Ronald standing beside him, these two are going at their cocks like horny school boys. Dick's eyes occasionally wonder over to stare at Ronald's tube steak that is at eye level for the horny 19yr old. ...Nothing wrong with checking out the competition. They both laugh as we have them stand up and compare their dicks. 'I'm still bigger', jokes Dick as he leans his cock in just below Ronald's fattie. With this much str8 cock it's a shame they're only jackin em. They each take a couch as they lay back and start stroking for pay dirt. Ronald works his knob with his fingers as he hits all the right spots. He's getting closer as he adds just a bit more lube to the mix. He begins to jack his now throbbing cock and as he does he starts to hump up into his fists; his sweet bubble butt lifting off the couch with every thrust. It isn't long before his meaty shaft gives up its content. His load shoots up all over his tanned abs. Dick isn't far behind as he whimpers seconds before shooting his leche all over his faint happy trail. Whew These two definitely made for a hot extra big dick duo. We'll need to have these two back ...for more! <evil grin>",
  "models": [
    {
      "name": "Dick Armstrong",
      "person_id": 28596
    },
    {
      "name": "Ronald Casis",
      "person_id": 28697
    }
  ],
  "release_date": "2008-09-17",
  "scene_id": 54511,
  "series": "Who's Bigger?",
  "tags": [],
  "title": "Who's Bigger?"
}