{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we brought back Mr. Strong. Joe Strong was featured several weeks ago. When he was here last h e told us all about a hot encounter he had in Time Square in NYC. He ended up getting picked up by a young, sexy Brazilian couple that took him back upstairs to their suite at the W Hotel and had him for dinner and dessert. He loved looking down and watching both go at his uncut Puerto Rican cock and having the chance to fuck the hell out of the guy while his wife watched was a major turn on. Joe loves Latina and Asian girls and when it comes to boys he loves white and white latinos --but no Asians. When he was last here we promised we would find a cutie for Joe to play with that would fit his taste. We brought out our very own hot latin boy that has the white complexion and big latin bootie that would drive our Joe nuts! Mr. Tony Michaels didn't mind at all helping us out with our 'pre-dick-ament'...again! Tony Michaels is now 23 and originally from Miami. Tony loves latin and dark boys. He recently had quite a group session to celebrate his birthday. 'I had a blast, had friends come over ...little bit of everything.' We've seen Tony in action so we can imagine he had a blast. Speaking of blasts, we need to let these two go at it. Each is the other's ideal type so they are in for a definite 'blast'! ...well, two actually!These two waste no time as they immediately begin to make out. Tony latches on to Joe's thick lips like a hungry calf. Joe's eagerly kissing back as they begin to strip down piece by piece. Tony massages Joe's cock that's quickly gaining length. Tony goes down on him and the next thing we see is them locked in a hot 69 where Tony's swallowing Joe's cock and Joe can't get enough of Tony's hot ass. We gotta admit, Tony's ass looks amazing in this shot with sexy Joe's face buried up inside it like he's suffocating --and there's oxygen in it. Tony's loving the attention he's getting and it's only making him suck harder on Joe's uncut ping?n!  From there Tony flips around and comes back for more of Joe's sweet mouth as he straddles him for another make out session. Joe then stands up and needs more of Tony's oral skillz on his fat meat. Tony expertly swallows his throbbing boner, licking and sucking his foreskin while Joe looks down in awe as he gets his uncut cock worshipped. It won't be long before he'll need a place to bury this bone!A look of pleasure and pain is the next thing we see on Tony's face as Joe impales his tight ass with his dark meat. Tony grimaces as Joe shoves inside again and again to loosen up his hole. It doesn't take long before he's able to plow him deep. 'Yeah, that's what I'm talking about..' moans Joe as his balls slap Tony's ass in a doggie position. Joe's loving Tony's hole and he's gonna enjoy it in every position he can get it in. Tony turns around and sits on Joes cock while sitting in a chair. He rides Joe's meat at a full gallop as he takes every inch of this horse-hung stud. Joe's so horned up he's talking dirty to Tony while he's getting his cock ridden. Joe hasn't gotten a chance to sample Tony's thick dick so he pulls out and has Tony feed him some. He sucks on Tony's club while jackin his own and they take turns jackin and makin out as they both begin to stroke off. Tony's the first to blow shooting his wad all over while Joe licks his nips. Tony then sits back on Joe's face giving him the added incentive he needed to bust his thick nut all over. 1 blow + 1 bust = 2 blasts! Our work is done here! ...til next week.",
  "models": [
    {
      "name": "Joe Strong",
      "person_id": 28631
    },
    {
      "name": "Tony Michaels",
      "person_id": 27902
    }
  ],
  "release_date": "2008-08-27",
  "scene_id": 54518,
  "series": "Moon Over Licked!",
  "tags": [],
  "title": "Moon Over Licked!, Scene #02"
}