{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Sit back and buckle your seat belts cuz we have a doozy for you as we welcome back Brenn Wyson as well as David Chase. Brenn is 39 and this Bostonian now calls Ft. Lauderdale home. David Chase is 30 years old and from Jacksonville, FL and although he is making his debut with us this week he's already a fan favorite on our brother site MenOver30. We asked these two where they thought would be a great place to retire once they were ready to. David would want to settle down in a small town where it's quiet and not a lot of pollution. Brenn would want to head over to Lithuania which is where his family is from. We asked these two whether they preferred to spit or swallow. You know we're cutting edge journalists here. It's 'swallow' for David Chase while Brenn isn't giving us any information. ?I'm gonna keep 'em guessing?, Brenn says with his signature grin. When it comes to kink, for Brenn it depends on the person and it has to be set in a moment. David is accommodating on the kink realm and likes to spice things up with a little bit of pain mixed in with his pleasure. We're not sure Brenn Wyson is the one you want to drop that pearl of wisdom in front of.  Well, he's about to find out why...David is sitting back on the couch in handcuffs and one leg in a cuff as Brenn enters the room in his underwear tented by his raging hard on. ?What are you looking at?? he barks as he secured David's other ankle. ?You ready for this dick?? he taunts as he grabs David by the head and shoves his cock down his throat. David cowers as he gets his throat fucked making him gag repeatedly. Brenn strips off his boxer briefs and whips David across the face with them several times before going back to burying his dick down his throat. ?You like big dick?? Brenn teases as he continues his assault on David's throat making him gag and choke on his meat. David could've said he liked long walks on the beach but NOOOO he had to go and say pain. Brenn manhandles him as he pulls his legs in the air using the chains around his ankles. He orders him onto the floor as he shoves his cock back down his throat and orders David to tell him he loves his cock while his dick is buried in his throat. David does and as a reward he gets the handcuffs taken off. David loves every minute of it as he grabs that cock and shoves it right back down his throat.We have a feeling Brenn's done this before as he plays perfect Master to David's slave. David can't get enough of that meat as he worships that dick. Brenn then returns the favor for a bit as he sucks on David's hard cock. Brenn then gets David on the floor and spits on his hole. He orders David to spread those beefy cheeks apart as he slides in. ?Shut up and push it back before I jam that shit in there!? Brenn orders as he starts to fuck that ass. He makes David lick the carpet and imagine it's his ball sack. ?Bark like a dog!? Brenn orders as David starts to bark. ?NO!?a smaller one, like a Shih tzu?. David continues to bark...but in a much higher pitch. (O.M.G!) We couldn't have scripted it better if we wanted to. Brenn goes to work pounding that hole as David wails in a combination of pain and pleasure. The louder he wails the harder Brenn pounds. Brenn then gets David on his back and start to pile drive his dick straight down into David's worn hole. David just begs for more as Brenn moves him into missionary. David's cock is rock hard as Brenn fucks him silly and Brenn watches his thick cock disappear into that sweet ass. That thick dick sends David over the edge as he shoots his load. Brenn is at the edge too as he pulls out and sprays jet after jet of hot cum all over one cum-soaked David Chase.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "David Chase",
      "person_id": 27963
    }
  ],
  "release_date": "2011-05-11",
  "scene_id": 54514,
  "tags": [],
  "title": "All Choked Up, Scene #02"
}