{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have another straight boy about to lose his cherry to a rather well endowed gay boy. There's something to be said for wanting to start small and then there's 21 yr old Derek Princeton. Apparently, Derek Princeton was not aware of just what he'd be up against when he agreed to bottom for one of ExtraBigDick's returning alum, Jarrett Fox. No longer in blond shaggy locks, Jarrett Fox is back and totally up for the challenge. Before they began we asked unsuspecting Derek if he had any idea of just how hung Jarrett was he blushed and says 'we'll work on it'. He's gonna have 9 thick inches to work on. They decide to arm wrestle to decide who's going to bottom, giving Derek one last reprieve. After putting up a valiant effort, Jarrett overpowers Derek. We're not really sure how valiant it was --but somehow the straight boy is taking one for the team. Jarrett is grinning ear to ear regardless. Derek's plea to go best 2 out of 3 falls on deaf ears. He's definitely in for a hot session. Hot sex in a hot garage with a hot top--what else could you ask for? They take their shirts off as Jarrett moves over to Derek. They begin to break the ice by slowly kissing. Derek begins fumbling for Jarrett's belt. It seems curiosity got the better of our straight boy. Jarrett is more than happy to help out as he undoes his pants and lets his jeans fall to the floor. He's commando so Derek can immediately see what's on the menu for today. He doesn't even flinch as he reaches for Jarrett's flaccid monster cock which asleep has to be a good 7'. He licks at the head before engulfing it in his mouth. Jarrett moans his approval as his cock comes to life. We get a great view of Jarrett's naturally smooth, defined body as Derek works as much of his meat as he can in his mouth. Jarrett wants some of the straight boy too so he props him up onto the bin they arm wrestled on earlier and goes down on him. Derek's fat cock is hard in seconds in Jarrett's expert mouth. He stands to give Jarrett better access and we get to appreciate h is creamy, hairless bod as Jarrett works his cock like a pro. Next Jarrett decides he needs to loosen up this straight boy before he can get a shot at fucking him. He turns him around and buries his tongue deep inside his smooth ass. Derek can only moan at the new sensation. Taking that 9' cock up his ass just got easier. Soon his ass will be beggin' for more! The next we see is Derek's sweet ass slowly impaling itself with Jarrett's fat monster cock. His once virgin ass can only take so much of it at a time as it slowly cedes way to Jarrett. Derek's moaning and groaning as he gets used to the feel of a man's cock using his tight ass. Derek's jerking his cock to try and ease the pain and his face clearly shows his anguish yet he's not giving up. Jarrett decides he needs to take more control and has Derek get on all four so he can give it to him doggie style. Derek's taking it like a champ even though Jarrett still hasn't managed to slide it all in. They're both moaning as they get into their fuck session. Derek's taking a bit more as he gets used to it and his tight ass is giving Jarrett's cock one hell of a work out. Jarrett is loving it; but wants it in deeper. He has Derek lay on his back and enters him missionary. He now has him where he wants him and starts fucking him deeper and deeper. Derek grunts and groans as Jarrett's massive nuts are finally beginning to slap his well worn ass. The deeper he's fucked the louder he grunts. Jarrett's breaking him in--good! They lay back side by side to jerk off as they near climax. Derek's the first to explode all over himself followed by our pile driver Jarrett who sends his thick nut all over his tan abs. whew! If only all of our first times were this hot!",
  "models": [
    {
      "name": "Jarrett Fox",
      "person_id": 27761
    },
    {
      "name": "Derek Princeton",
      "person_id": 28293
    }
  ],
  "release_date": "2008-09-03",
  "scene_id": 54515,
  "series": "Winner Takes All",
  "tags": [],
  "title": "Winner Takes All, Scene #01"
}