{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "And then, there were two as the dust and lube finally settle on this week's steamy set. Say hello to the two that remain: Chris Cox and Puerto Rico's own, Steven Ponce. This wasn't how we started today; but things kind of worked themselves out. Initially we welcomed Hispanic hottie Cris Love who made his debut. Cris is 19 years old and stands at 6' tall. This island boy with the bedroom eyes is going to leave many wanting more. (literally!) Ironically, Cris was ready to enjoy 26 year old Chris Cox and his thick 9' Cuban dick when he realized he bit off more than he could swallow. Fortunately, 31 year old Steven was in the area and knew he had to uphold Puerto Rico's image. He had no problems taking over or taking Chris' thick meat. We asked Steven what was the biggest cock he'd ever taken. 'It was 11'-12' and really thick. It was almost in the too big category but back then I wasn't as experienced.' Chris isn't all that picky on dick size but he does like big dicks. None of these boys think a small dick is ever appropriate and they both get turned on when they hear a hungry cocksucker gagging on their dick. Well, with these two we'll just have to see who makes who gag. Shall we?Cris is sitting anxiously on the couch nervous about his upcoming scene. Chris walks in and asks him what's up. 'I'm nervous. It's my first scene and it's going to be with a guy named Chris and he has a really big cock'. Chris grins and introduces himself. Cris reaches over and grabs Chris' meat that is getting bigger by the second. Cris can't wait to get at that as he hauls it out to get a better look. He wraps his mouth around Chris' cock as Chris moans and orders him to suck that dick. Cris gets on his knees and worships that huge Cuban cock as he does his best to take it. They start to make out as Cris bends over and shows off his hot ass for Chris to explore. Chris slaps his thick cock on that ass as he teases Cris' ass. Chris strips Cris and we get our first glimpse at that smooth ass. It's naturally smooth and Chris can't get enough as he rubs his fat cock on that hole and teases it with his fingers. Chris can't help but get a taste of that hot young hole as he dives in tongue first. Cris moans as he gets that ass eaten out as Chris shoves his tongue deeper getting it wet and ready for what's to cum.Once that hot ass is hungry for more, Chris suits up and watches as Cris straddles him and starts to sit on his massive meat. Cris groans... but it's not working. 'I can't, it's too big!' (...Amateur.) 'What are you talking about?' Steven grins, as the Cavalry arrives to save the day, 'that's not that big!'. Steven dismisses Cris and gets to work making out with Chris whose cock is still throbbing. Steven peels off the rubber and goes down on that dick. He wants to taste that meat as he gets hungry for more. Chris watches in awe as Steven takes his dick deep. Once that cock is throbbing, Steven slides on a rubber over it and sits on it. He starts to ride it in a reverse cowgirl so he can take that dick and jack his own. Chris sits back and watches as his cock disappears into Steven's hot ass. Chris then wants to be in control as he stands Steven up and bends him over. He slides back in and gets to work tappin' that ass doggy style. His heavy balls slap away at that smooth ass as they get each other worked up. Missionary is next as Chris gets between Steven's legs and shoves his cock back inside. Chris' cock is hitting Steven's hot spot just right as he slams inside sending Steven over the edge. He blows his thick wad all over himself followed by Chris who pulls out and adds more milk to the mix.",
  "models": [
    {
      "name": "Chris Cox",
      "person_id": 28468
    },
    {
      "name": "Cris Love",
      "person_id": 28826
    },
    {
      "name": "Steven Ponce",
      "person_id": 27969
    }
  ],
  "release_date": "2011-11-23",
  "scene_id": 54521,
  "series": "Tag You're It!",
  "tags": [],
  "title": "Tag You're It!, Scene #01"
}