{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we bring you another installment in the 'Cooker Chronicles'. For those of you who don't know Cooker, Cooker came to us a couple years back as a str8 boy needing some cash and willing to stroke his 9' to get it. Over time, we've been able to convince him that boys really do 'do it' better. The first chance he gave us, we had Chase give him his first oral session. Chase swallowed Cooker's cock to the hilt, leaving a wide-eyed Cooker in disbelief. He'd never had a girl be able to do that! From there, we paired him up with our second secret weapon. Tucker Forrest, the pint-sized 23 year-old hottie packin an 8' club would become the first lucky boy to take Cooker's cherry in the Backdoor Bambie category, giving up his sweet ass for Cooker's breeder bone. Tucker's back, along with our third accomplice, 22 year-old Jason Fury, to give Cooker his first ever all-male 3some. Cooker confesses he had a 3some with a str8 couple in order to prepare for today. 'It wasn't full on', he says, 'he was str8 so there wasn't any man-to-man action; but I think I'm ready for this' We asked Cooker, now that he's been exposed to so much fun on the other side of the buffet, if there were any fantasies he still had but hadn't gotten around to fulfilling. Cooker blushes as he says --wait for it-- 'The only thing I haven't done is be the bottom. I'm scared, but I know it's gonna happen.' Someone's getting a toaster oven--we converted another one!  ...Hallelujah!!! Tucker starts things off by undressing Jason as they begin to kiss. While they make out, Cooker stands up and drops his jeans. Cooker is definitely ready for this--he's totally boned! He kneels beside them as he leans in to suck face as well. Cooker stands to feed Jason his first taste of dick as Tucker goes down on Jason, forming a chain. From there, they swap, and Cooker moves around to get some of Tucker's cock. He playfully laps at Tucker's knob as he works just the head, which is now throbbing. Last time, Tucker played bottom for Cooker; but today, he's playing Pitcher right along with Cooker. Jason moves to the armchair as Cooker and Tucker stand on either side of him. He has 17' of thick cock needing attention inches from his face. Jason's in heaven as he takes turns sucking both cocks. He can't get enough. Soon they swap, as Tucker straddles the chair, feeding Jason his cock, and Cooker goes south to swallow more of Jason's. This intense oral can only lead to one thing--intense fucking!The sound of Jason groaning in a mix of pleasure and pain is what we hear next, as Cooker slides his thick 9' cock deep inside his ass. His huge nuts slap Jason's smooth ass as he wails into him. Cooker is suckin dick while he's giving dick as they fuck and suck each other. Cooker is relentless as he fucks ass. Next, it's Tucker's turn on the mound as Jason sits on his fat cock. 'Yeah, Suck my fuckin dick!' Cooker orders, as he watches his bud use the same ass he was just pounding. Jason rides Tucker like a champ and loves every minute of it. Cooker dangles his cock and heavy low-hangers into Tucker's mouth as he fucks Jason. 'This feels as cool as it looks' smiles Cooker as he's getting his cock sucked by Tucker. Then, that familiar grunt is back, and we see Cooker really fucking the hell out of Jason's tight ass. Jason can't help but grunt and groan as Cooker impales him hard and fast. This rough pounding is more than Jason can handle and he can't hold back his cock much longer. He moans and groans as he busts a huge nut all over his abs and chest. Cooker pulls out and is jackin by the time Jason explodes, causing him to bust his load all over Jason's spent cock. Tucker is the last to go, and jacks off furiously as Cooker begins groping his ass to help him along. Tucker unloads a massive load that jets all over Jason's face. Jason's in ecstasy, mouth gaping wide open as Tucker's first stream coats his face. Whew! --Mission Accomplished!",
  "models": [
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    },
    {
      "name": "Jason Fury",
      "person_id": 28620
    },
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    }
  ],
  "release_date": "2008-07-30",
  "scene_id": 54525,
  "series": "WANTED",
  "tags": [],
  "title": "WANTED, Scene #01"
}