{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "After almost 7 months, we were able to get Mr. Joe Strong back in our studios. This muscular 25 year old from Puerto Rico currently lives right here in Miami. He's single at the moment and smiles as he tells us it's a very good thing: 'I can do whatever I want!' He h as been traveling and visiting family and friends back home in Puerto Rico since we last saw him as well as doing an adult flick or two on the side. When we asked him what the hottest sex he'd had since we last saw him was he grinned as he confessed a threesome with a Brazilian couple. He was approached in Time Square by a guy that told him his girlfriend liked him. Out of curiosity he asked to meet her. She was hot so they invited him up to their suite at the W Hotel. Once up there, the champagne was flowing and once the 2 started fucking as Joe watched. After a few, the brazilian boy asked him to join in. He ended up fucking them both! Fucking the boy as his own girlfriend watched turned out to be one of the hottest things he's done to date. He also loved looking down at his huge uncut cock watching the young couple both take turns on his knob as they made out. 'That was hot--I have pictures!' he chuckles. Joe doesn't like to jack off and hasn't bust a nut on about 5 days. He prefers to have someone take his load from him. Settle down, boys! ...The line forms to the right! Joe begins to slowly rub himself through his tee with one hand while groping his cock through his camo cargos with the other. He's not looking to waste anytime so his shirt comes off, followed by his shorts as he sits back and begins playing with his cock through his sexy black briefs. His crotch begins to fill out as he works it with both hands on dick. His massive pecs are well defined as are his large biceps. He has ink, tribal as well as illustrated and a row of Chinese characters that help to frame his sexy abs. This boy is HOT! His sexy bedroom brown eyes just ooze sex as he gazes in your direction. He peels off his briefs to reveal his 'bicho'. His massive meat is uncut and thick as a billy club. No wonder his cock was the biggest in the room at the W hotel. He playfully slaps it into his palm as he strokes and tugs at it. He has smooth nuts that are hanging low holding a 5day reserve of Puerto Rican cream. He stands to give us a better view of his cock and 'ass'-ets. His frame is impressive and everything about him seems larger than life. He sits down and keeps playing with his uncut cock paying special attention to his foreskin as he pulls it forward and shakes his meat back and forth holding just his overhang. As he pulls it all the way back and holds his thick meat at the base you get to appreciate the size of his now dripping cock. He stands up again and keeps jackin his meat occasionally licking his knob to add more lubrication to the mix. He looks delicious in just about every angle. His thick thighs covered with a light dusting of hair look amazing in contrast to his naturally smooth upper body. He sits back and continues exploring his meaty cock and stroking it as he tugs on his heavy balls. His knob seems to glisten more an more the faster he strokes. His eyes are clenched tight and his head is laid back as he continues his session. It's obvious he's getting into his zone. The zone from which there is no return. He jacks faster and faster as his balls begin to pull tight getting ready to launch his load. He strokes quicker and quicker paying close attention to his knob and you can just tell it won't be long now. He starts to moan and groan and he suddenly jerks forward and aims his throbbing cock towards the floor. 'awwww FUCK!....' he grunts as his meat explodes sending thick strands of 'leche caliente' all over the hardwood floors below. He collapses back into the chair with a look of bliss we can all relate to. Any takers on clean up?",
  "models": [
    {
      "name": "Joe Strong",
      "person_id": 28631
    }
  ],
  "release_date": "2008-07-23",
  "scene_id": 54527,
  "tags": [],
  "title": "Stroking Creed, Scene #01"
}