{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Cody Kennedy is this week's Extra Hung Hottie. Cody is 23 and originally from Salt Lake City, UT. He's as cute as can be and packs a thick 8.5 inch club. At a compact 5'8', he's a little reminder that big things really do come in small packages. He's relatively new to the scene, but has his sights set on greatness. He is currently single and has a backup in place for those lonely nights when he needs a good fuck. Everyone needs a horny ex in the wings, ready and able to take care of that. Just 'cause it didn't work out doesn't mean the hot sex was worth giving up. He loves older, hairy 'daddy' types who can handle him in bed. He's mostly bottom for now, and says he hopes to eventually have a top phase. For now, that thick cock is just eye candy as he gets pounded. To make that cock look even hotter, Cody got it pierced when he moved back home to Utah from Portland, OR. 'I just thought I needed something to spice it up a lil bit...' he explains. Well, Cody we don't know how much spicing up you think you needed, but we think you look pretty damn tasty as is! This afternoon, Cody's agreed to show us just what he can do with that thick piece of man meat as he takes care of his cock in his cruiser. Both hands on the cock. Buckle up, Boys!Sliding back into his cruiser, Cody begins to tug at his crotch with one hand while feeling his chest with the other. He's obviously overdressed for the task at hand, and immediately loses his tank. We see his defined torso with a light dusting of trimmed hair on his pecs. His abs contract as he pulls off his cargo shorts. He's now in a pair of briefs that frame his sexy ass deliciously. It isn't long before he pulls out his thick dick. He's massive even when he's not at full mast. The Prince Albert sparkles in the light as he gropes and tugs at it. His cock slowly starts to fill out as he continues stroking. Cody then turns around for us to give us a better view of his sweet ass. He has a tribal tattoo on the small of his back. He bends over for us as he playfully fondles and fingers his smooth ass. He continues jerking his cock as he toys with his bum. As far as nice asses go--Cody's got that covered! He then flips over and starts to work his now throbbing meat. He loves having his ass played with, and he teases his sweet hole as he jacks his huge cock. You can clearly see his cock is aching for release, and Cody's stroking it to no end.From there, he takes the show upright to a kneeling position as he continues to taunt and tease us with his fat cock. He bounces his meat up and down and pushes it way down, allowing it to spring back up. Hot reflexes are always a good thing. His face looks hot as his full lips curl in ecstasy. His thick eyebrows furl as his eyes shut tight. He's loving the attention he's giving his cock. His smooth balls look huge as they pull up tighter and tighter around the thick base of his shaft. He pushes his boner straight down and lets it flop back up as it springs up, making a loud thud as it hits his toned lower abs. He continues teasing his meat, slapping his abs with it as he gets closer and closer to release. He jacks faster and faster, his breathing beginning to labor as he starts to moan. 'I'm getting close...' he grunts in between strokes as we see him start to shift around more and more. There's no mistaking he's seconds from busting his load as his face transforms into one of rapture as he begins to cream 'I'm gonna nut!' he grunts as his load begins to splatter on his bumper below. His thick load pools on the blue bumper until Cody slaps his hard cock into it, smearing it all around. He falls back in relief once he's done glistening is sweat and seed. With looks and a package like this, Mr. Kennedy won't have any trouble attaining any height he sets that cock to.",
  "models": [
    {
      "name": "Cody Kennedy",
      "person_id": 30499
    }
  ],
  "release_date": "2008-08-06",
  "scene_id": 54524,
  "tags": [],
  "title": "Cody's Prince, Scene #02"
}