{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Ricky Larkin is back in the house this week looking better than ever. Ricky will be helping us welcome back a blast from the past Ty Tucker who appeared on our brother site CircleJerkBoys.com a few years ago. We asked these studs if they could have anyone interview them who it would be. Ty would want to be interviewed by Charlie Sheen. Ricky would want to be interviewed by none other than Stephen Colbert. We then flipped the script and asked if they could interview anyone they wanted to whom it would be. Ricky grins as he answers Mila Kunis just to be in the same room with her. Ty would want to 'interview' Super Model Heidi Klum. Both of these boys prefer the ladies off cam but are open minded enough to do male on male work. We wondered what if anything they've learned from being in this position. Ty learned that not everything needs to be so restricted and being open with your sexuality is healthy. Ricky started off not really liking it but he didn't dislike it either. One way or the other both of these studs agree that the best head they've received to date have been from men. 'I heard what you were doing with my sister last night' Ricky tells Ty, 'these walls are paper thin. Ty tries to apologize but his pleas fall on deaf ears as Ricky makes him pay. Payback's a Bitch as Ty gets dragged to his knees and has Ricky's crotch shoved into it. Suddenly 'payback' ain't lookin' all that bad! lol Ricky grinds his growing cock into Ty's face before undoing his shorts so that he can get that hot mouth around his cock. Ty doesn't put up much of a struggle as he services that thick dick. Ricky grabs his head and starts to fuck his face deep. His smooth balls slap away at Ty's chin and just as he's getting used to sucking that thick meat Ricky grabs him and throws him on the couch. He straddles his chest and shoves his cock back in. He fucks his throat deeper and harder making Ty choke and gag on his oversized cock. Ty reaches around and grabs Ricky's beefy ass with both hands as he helps to steady that cock going down his throat. Ricky then gets Ty on his feet and strips off his jeans to get at that dick. Ricky gets on his knees and bobs up and down on that dick taking it all the way down his throat. 'You're better than your sister!' teases Ty as Ricky continues sucking his rock hard cock gagging on it as he shoves it all the way down his throat.Ricky savors that cock for a while before wanting as he bends Ty over. He spreads Ty's smooth ass open and dives in tongue first. Ty moans as he gets that ass rimmed. Once Ricky gets that tongue up Ty's ass, there's NO way he's going back to his sister. Ricky gets that ass wet before suiting up and giving Ty what he's got coming. Ricky slides inside as Ty struggles to accommodate him. Ricky starts fucking that ass deep as he delivers doggy style. He holds Ty's head down as he takes that ass and makes it his. Ty begs for more and Ricky complies pulling out and sitting back so that Ty can ride it. Ty whimpers and grunts as he impales himself back on that dick. Ricky's not cutting him any slack as he grabs his tight waist and rails his dick up into that tight ass hard and fast. Ty is groaning as his ass still fights it. Ricky's not done with him yet as he puts Ty on the floor so that his shoulders are holding him up as his legs reach for the sky. Ricky kneels on the couch; aims his thick meat south and slides it home. He gets into a push up position over Ty and starts to pile drive that ass missionary. The sight is spectacular as Ricky's muscular frame repeatedly sinks in and out of Ty's sweet ass. They then get on the couch and jack their loads all over themselves side by side drenching themselves in cum.",
  "models": [
    {
      "name": "Ty Tucker",
      "person_id": 28325
    },
    {
      "name": "Ricky Larkin",
      "person_id": 28464
    }
  ],
  "release_date": "2011-12-07",
  "scene_id": 54529,
  "tags": [],
  "title": "Ty One On, Scene #01"
}