{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'What's in a name? That which we call a rose by any other name would smell as sweet.' Even Shakespeare had it right when he penned that quote; so we can imagine just how Kris Kaos got his name. Admitting his first sexual experience was a game of doctor at the tender age of 5 with a girl in daycare; this chocolate-toned lover plays both sides of the field, creating 'kaos' wherever he goes. At 11, he watched a Pamela Anderson/Tommy Lee video with his classmate and ended up bending the kid over. 'He seemed to like it. It was fun. But, we never talked after that actually' he grins. We're sure that many boys did like it and didn't run away; unlike all the girls that did once he showed them his developing boner in junior high. At 5'6, Kris packs an impressive 9' that would make most think twice about going there. 'Most'--not us! HELLO! We're ExtraBigDicks! We're all about the dick! We digress; he's a horny fuck and jacks off 3X a day. He loves sex wherever he can get it. Bathroom, Parents driveway in broad daylight with a bud or in his girlfriend's house while her parents are home; he's not picky and loves the excitement. 'Sex is sex, ya gotta nut--So what!?' is his creed. We actually love the way he thinks. He slowly begins to rub his toned abs as he shows us more and more of his defined stomach complete with a very sexy happy trail. His hands part ways, one, feeling upwards across his pecs; while the other dives straight down into his growing crotch. By the time he manages to open his jeans and pull them down enough ogive his meat some room, he's almost at full mast as his thick cock strains against the cotton. His heavy balls dangle out of his briefs as he tugs on his meat through his underwear. He turns around giving us a great view of his bubble but. You could bounce a quarter off his cheeks. He lies back on the bed and throws his legs in the air as he massages his rosebud with his own cock head. We know who we wanna be when we grow up. WOOF! It isn't long before Kris is at full mast; and what an impressive mast it is. Thick from base to knob, his 9' pleasure pole is quite the site. He buries it into the bed as he strokes it and the thick vein that runs down the shaft pulses in delight. He turns over and begins to dry hump the bed. His smooth ass and fury hole are on display as they rise and fall in sync with his thrusts.Kris reaches back around and teases his tight hole with both hands. He knows just what buttons to push when getting himself off. His meat is throbbing by now and as he writhes in ecstasy, his muscles dance just below his skin. He feels himself up all-the-while as h e continues jacking his fat cock. His breathing is heavy and his nuts are pulling up closer and closer. It won't be long before he explodes all over. His face furls in pleasure as he jacks faster and faster. He begins to arch forward several times as he gets closer and closer to reaching his climax. His mouth drops and with a grunt he unloads. He sends his cream splattering onto his firm lower abs and dense bush below. Once he's done and catches his breath he busts out laughing. 'I always laugh after I nut' he chuckles. This seems like as good a time as any to remind our viewers of important bedside etiquette. Remember, it's perfectly ok to laugh in bed ...just make sure you're not pointing at anything when you do. That's bad.",
  "models": [
    {
      "name": "Kris Kaos",
      "person_id": 28651
    }
  ],
  "release_date": "2008-08-20",
  "scene_id": 54520,
  "tags": [],
  "title": "Full Eclipse, Scene #02"
}