{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Mason Coxx is back this week. Twenty six and packing more than the average New Englander, we're always happy to see him. As happy as we may be, there's a 21 year old, Colorado native by the name of Alex Andrews that will be even happier. Alex is a familiar face from our brother site CircleJerkBoys.com. We asked these two what was the last compliment they had recently received. For Alex, it was walking around downtown Colorado shirtless and having some guy walk by and just say 'Thank you' and keep walking. Nice! Mason had someone recently tell him he had a nice dick. Packing 9', we're sure Mason rarely hears that. lol We then wondered if they would change anything about their last sexual encounter. Alex wouldn't change a thing because when he has sex off cam it's more emotional and more passionate. Mason would add another person. Which led us to our final question: what's the largest number of guys they'd had sex with at the same time? Mason can't say for sure; but it was a lot. Alex blushes and admits to having a 6-some while camping for a friend's birthday. Candles weren't the only thing blown that weekend. On that note, let's kick back; watch these two go at it and pop some tents of our own... Alex asks Mason how the job search is going only to hear that the only place hiring is Hooters. Mason wishes there was a place called 'Weiner Schnitzel' then he'd have the proper qualifications. 'You working with something down here?' Alex grins as he reaches over and squeezes Mason's growing cock. They start to make out as Alex' hand makes it into Mason's pants. He pulls down Mason's briefs and immediately goes down on his rock hard cock. Mason moans as Alex works his knob with his mouth and strokes the length of his shaft with his hand. Alex gets on his knees as he gets comfortable worshiping that meat. Mason pulls him back up to make out some more as he then helps Alex lose some of his clothes. Alex gets back on that 9' cock and savors every inch. Mason then gets him on his feet, pulls off Alex' jeans and starts to return the favor. Alex moans as he helps guide Mason's head up and down on his uncut cock. Mason's own cock is throbbing as he sucks Alex' all the way down to the base. Alex then gets Mason up so that he can get more of that thick cock and works on that aching meat until Mason bends him over to get at that hot ass. He spreads Alex' hot ass open and shoves his tongue in deep eating that hot little hole and getting it ready for a lot more than his tongue.Mason then puts his head on the couch as Alex straddles his face. Alex can only moan and groan as Mason tongue fucks his hot little ass. Alex can't wait any longer and gets up to straddle Mason's cock. He impales himself on it and goes to town riding it. He grinds that tight ass up and down on that meat as Mason slams his hard cock up into him. Alex lays back and uses the couch to shoulder his weight as he bounces up and down on that dick driving Mason wild. Mason just gets to sit back as he gets his dick taken care of. Mason then bends Alex over and gets into the driver's seat as he drives his fat dick deep inside him. Alex can only moan as Mason stretches that ass wide open. 'Fuck me!' cries Alex as Mason starts to pound that hot ass harder and deeper. Alex just can't get enough as he begs for more. Mason's thick dick slides into that hot hole with ease as he gets that big dick milked. Mason then gets Alex on the couch where he lies behind him and slips inside for more. He slams that dick into that ass hard and fast and it sends Alex over the edge. Alex shoots his load all over his smooth abs as Mason beats his cock faster. Mason finally explodes; sending his hot batch all over Alex' face and chest.",
  "models": [
    {
      "name": "Alex Andrews",
      "person_id": 28438
    },
    {
      "name": "Mason Coxx",
      "person_id": 28799
    }
  ],
  "release_date": "2011-12-14",
  "scene_id": 54538,
  "tags": [],
  "title": "Deep Drilling, Scene #02"
}