{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Jeremy Kirk, the hot all-American blond boy, is back for more fun this week. Last week, we had this hot 24 year-old in a sizzling combo. This time, we'll get to see him do more than just stroke his massive 8'+ piece of meat. Jeremy  is truly versatile and doesn't really care what he gets, as long as he gets some. 'Easy to please' works for us. We decided to pair him up with adorable 21 year-old Kirk Cummings. Kirk is another one of the boner blessed boys carrying an 8' club himself. Who knew a baby face like that could be packing a man-size pole in his Osh-Kosh B'gosh's? That sweet face and big cock landed Kirk as an exclusive on our brother site Boyz Party.com, where in both solo and action sets, he became an instant fan favorite. Jeremy started early, and actually had his first gay sexual experience years later at 16. Kirk laughs as he confesses he skipped the whole girl thing altogether and somehow managed to lose his virginity to a bathroom counter top at the tender age of 10. ...WTF? Necessity  is the mother of invention; but, we're thinking--she must've  had the day off! 'I was looking for something pointy that got thicker as it went back...' he says. While you work on that visual, we're gonna let these two studs go at it. No worries, all countertops have been protected to prevent any possible distractions. J These two waste no time as they begin making out. Their tongues entwine as they explore each others mouths and bodies. Their hands roam to find growing bulges, which will be explored soon enough. Jeremy is the first to lose his pants, and within seconds, Kirk goes down for some of that big cock he's heard so much about. Jeremy bobs Kirks head up and down on his meat and loves the attention he's getting. Kirk knows exactly what he's doing on Jeremy's cock, and it shows. Jeremy wants some too, so he strips Kirk's pants off and goes down on his own massive meat. Kirk watches in awe as Jeremy takes him deep with ease. Jeremy sucks him down and comes back up for air before going right back down on him. Jeremy needs more of Kirk, and in no time, flips him over to get at that sweet ass. Kirk, on all fours, is in heaven as Jeremy begins exploring his tight hole. His fingers glide in slowly at first, then he picks up the pace. If you're gonna stick it, ya might as well lick it. Jeremy dives in tongue first, which sends Kirk into a frenzy. 'Oohhh eat my ass!' he moans as Jeremy chows down on his smooth hole. Both of these boys love dirty talk, and it only makes things get a lot hotter. Jeremy holds Kirk's ass as he impales it onto his throbbing cock. Kirk begins to ride Jeremy as his own swollen cock is flapping around as he bounces up and down. 'You like that?' he coos as he gets his ass filled. From there, they switch positions to doggie style. Jeremy's fat cock never leaves Kirk's hungry hole. Here, Jeremy has all the control he needs and starts fucking Kirk--really fucking Kirk--pounding his ass deep, over and over. Poor Kirk is doing the best to accommodate 8?' of thick dick, and is grunting and groaning with every thrust. He's moaning so much, if you closed your eyes, you'd swear you were watching str8 porn. Kirk's in Bottom Boy Heaven! Jeremy holds Kirk in place as he takes his ass. His heavy balls slap against Kirk's smooth ass. Jeremy did say he loves it rough, and he starts burying his cock deep. Kirk's at the end of his rope and almost sounds like he's can't take anymore. 'Fuck that!' Jeremy grunts as he jack-hammers away at his sweet ass. He then flips Kirk over and fucks the cum out of him missionary style. Kirk explodes all over himself, and Jeremy isn't too far behind, coating Kirk with his own huge load of boy batter! DAMN. (No countertops were harmed during the making of this video).",
  "models": [
    {
      "name": "Jeremy Kirk",
      "person_id": 30432
    },
    {
      "name": "Kirk Cummings",
      "person_id": 30504
    }
  ],
  "release_date": "2008-06-25",
  "scene_id": 54535,
  "series": "Come In, Kirk!",
  "tags": [],
  "title": "Come In, Kirk!, Scene #01"
}