{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Jeremy Kirk, the 24 yr old Southern boy, is back with us to show us a little more of that huge 8.5 inch cock in action. He was last here a couple weeks ago when he put that cock to good use on cutie Kirk Cummings. He's making up for lost time after taking a hiatus from the industry for a few years. Jeremy was away in Spain getting his fill of dark-featured, hairy, Mediterranean men--the kind that drive him wild!  Jeremy loves sex and he doesn't have a preference. Top, bottom, flip-flop: its all on the menu for this blond, blue-eyes hottie. Jayden Holloway, a petite piece of yummy with a thick 8' cock himself, is gonna be the next on the list of lucky boys in the Kirk pool. Jayden is smooth and lean and has a problem--he's addicted. Yup, he's addicted to tanning beds. Well, Ok, he's actually 'a-dick-ted' to jackin' off in em. He can't seem to tan without needing to jack off and then he uses that 'rag' they give you to nut in. He must've missed the 'That's not a cum rag' memo. To make matters worse, he leaves it on the tanning bed unaware of the basket full of cum-free ones in the corner. We can only imagine what kind of nick-names the employees must have for him by now. Go ahead, run with that one. Fortunately, he says 'I love it, all my friends work there!' This would be a good time to go to commercial. --And we're back! Apparently they started over the commercial break because these two are going at it hot and heavy. They're making out passionately as they begin to undress each other. Jayden rolls on top of Jeremy as he undoes his jeans kissing him deeply. Their tongues intertwine as they explore each other. Jeremy's pants are off now and Jayden's tongue has plans of its own. He licks down Jeremy's smooth chest til he reaches paydirt--8.5 inches of thick meat. He's on his knees suckin Jeremy's cock like there's oxygen in his balls. Jeremy's loving it and quickly submits, giving him full access as he bends over the couch and gets the rimming of a lifetime. The chemistry's explosive as they devour each other. Now it's Jeremy's turn to taste the wares. He goes down on Jayden's throbbing 8' cock as Jayden pulls his hair and bounces his head on his cock. 'Eat my ass' Jayden orders as Jeremy flips back into position. Jayden then sits on his face while Jeremy's tongue works its magic. Jayden's in heaven as he alternates between his cock and his smooth ass riding Jeremy's hot mouth! We all know that eating ass inevitably leads to one thing ...FUCKING! And we're off! Jayden is riding Jeremy's fat cock at a full gallop. He bounces up and down as Jeremy's cock stretches him wide. Jeremy hands explore Jayden's smooth body as he impales him on his rock hard cock. Jeremy's smooth balls bounce up and down as he's being ridden. Jeremy wants more control as he bends Jayden over and slams his shaft deep. 'Oh my God!' is the only thing poor Jayden can seem to utter...over and over. Jeremy is fucking the hell out of him as he turns back to look at Jeremy and pull his hair as he does. Jeremy is relentless as he takes his ass. Jayden wants to ride some more and they go back to Jayden bouncing on that fat cock. Jeremy's cock is doing wonders for Jayden and it pushes him over the edge. He explodes sending his first load--yeah, his first load--all over the place. Jeremy pulls out of his hot ass and jacks a huge load up into Jayden's balls and freshly fucked ass. Wave after hot wave of cum splatter up against Jayden's hot hole; sending Jayden into the throws of yet another orgasm as he cums again. Whew Ok, Roll credits because we may or may not have a wet spot to attend to. <evil grin>",
  "models": [
    {
      "name": "Jayden Halloway",
      "person_id": 28624
    },
    {
      "name": "Jeremy Kirk",
      "person_id": 30432
    }
  ],
  "release_date": "2008-07-09",
  "scene_id": 54531,
  "series": "Playin Hookie",
  "tags": [],
  "title": "Playin Hookie"
}