{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we brought back the sex import that made quite the splash on this side of the pond, Blake Edward. The 23 yr old cinnamon-toned lad is quite the package with an indiscriminating 8' British Bone. These are the str8 boys we love, the kind that live by a slightly relaxed code of ethics. 'Whatever pleases me pleases me' is how Blake describes his orientation. Blake's definitely open-minded. He recently gotten up to having his roommate sucking him off. He handled it the way any str8 bloke would've: 'Finish!--then get the hell out.' He had no clue his roommate was a fan of the all-meat breakfast. Sounds like a sweet set-up to us. After his initial appearance with us, Blake's back for his second go round with a bloke on cam. Sweet little Luke Riley will be volunteering for the task at hand. Luke is the perfect example of how big things do come in small packages. This adorable, boy-next-door type may be 18, but he's packin' a man-sized 8' whopper. In his experience in the industry, he confesses the hottest scene he has shot to date was when he was paired up with Parker Williams on our brother site MenOver30. We can't say we blame him; that was a scorching duo. Luke has fantasies a bit more developed than Blake. Where Blake wants to mess around with a str8 couple; Luke wants 3 muscular, tattooed 'Mexicanos', the kind that look like they just got out of jail, all taking turns on his sweet bubble butt. Now that's dedication! We have a feeling after watching these two go at it; we'll all end up with a few fantasies of our own. They begin kissing slowly as they fumble with the others clothes beginning to undress the other. Blake is the first to lose his pants as his massive meat swings into plain sight. He's already hard in anticipation as Luke dives for it. Blake holds Luke's head still while Luke opens wide and gets what he's been wanting--dick. Blake immediately starts face fucking Luke as his dick gets harder and harder. Blake's heavy nuts dangle below laden with their precious cargo. Luke flips over to have Blake feed him even more of his massive meat. Blake's in heaven as Luke strokes his huge cock; lapping up at the knob and shaft. A sweet twist on the lay back & feed me concept; besides, the whole grapes thing has been done. Blake wants more of Luke's mouth and Luke's more than happy to oblige. Blake sits back on the chair as Luke crawls across the sofa for more. He sensuously works Blake's rock hard cock, making love to it with his sweet mouth. The look on Blake's face speaks volumes as he sits back and enjoys Luke's mouth. Luke's sweet little ass is on display as he lies on his stomach working Blake's cock. His smooth bubble butt will be next on the 'all you can fuck' buffet for our mate Blake. The Main course will now be served. A tantalizing shot of Luke lubing up his amazing ass is the only bit of foreshadowing we're getting before we see him lowering his tight ass onto Blake's throbbing cock. Luke is rock hard as he slowly impales himself on Blake's meat. Blake moans and just lies back as Luke starts slowly riding his meat. In no time, Luke's at a full gallop bouncing up and down on his cock while his own impressive meat flops around. Blake spreads Luke's smooth cheeks further apart so he can watch his fat cock pump in and out. Doggie is next as Blake gets behind Luke and starts plowing him. His smooth nuts slapping Luke's as he fucks him. Luke is really moaning now having to take even more cock in this angle. He no longer has the control he had while riding it. He's now at Blake's mercy & Blake has one thing on his mind! Fucking a Hot ass! He flips him over into a missionary and buries inside again. Luke is going crazy as Blake begins fuckin' him faster and faster. Harder! Luke moans as Blake begins to piston fuck his sweet ass. It won't be long before these two explode. Luke is now jackin his cock furiously as Blake continues pounding his ass. He moans and grunts and within seconds pumps his creamy load out while Blake fucks it out of him. Blake then flips over and busts his own sweet cream all over his navel. Whew. Appetizer, main course and dessert yet we're still left wanting more of there two. We have a feeling they'll be back soon enough.",
  "models": [
    {
      "name": "Blake Collier",
      "person_id": 28567
    },
    {
      "name": "Luke Riley",
      "person_id": 27859
    }
  ],
  "release_date": "2008-06-11",
  "scene_id": 54539,
  "series": "Side By Side",
  "tags": [],
  "title": "Side By Side"
}