{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "After a year away from sunny South Florida, Natural  is back. The 26 yr old had to come back to the familiar: the friendly people and the warm weather. Natural is a pleasure seeker who loves to find pleasure, free himself up and connect with himself and others. The feel of his skin and the warmth of a hot body next to him drives him crazy. He loves passionate women. He loves women with full lips which separate a good kiss from a great kiss. He loves full breast and a juicy ass. Curves are meant to be appreciated in Natural's book of sex-capades. He loves to please those exceptional few he deems worthy. He believes the pleasure she obtains from his handiwork brings him pleasure. He's a charmer and we're sure he gets his share of play. The full lips, amazing smile and those sexy almond eyes would stun most women long enough for him to seduce them. He is all about pleasuring and if he can't find one to pleasure he turns all that magic on himself enjoying his own 9' cock keeping the equipment up to par. He's charming and well spoken and incredibly sexy. One title can sum up everything he is and everything he has to offer: 'a natural' Unbuttoning his shirt, Natural stands as he slowly caresses his rock hard abs. His naturally smooth, lean frame is a chiseled master piece. He has an 8 pack! Think of the money you can save washing all your drawers on that rack. He strips off his clothes piece by piece before sitting down to begin his show for us. His cock is slowly coming to life as he pulls as it. His smooth balls hang below bouncing with every jerk as his uncut python swells thicker. It isn't long before his bronzed boa is fully erect; his foreskin gliding easily over his throbbing knob. He is a spectacular sight to behold. The lean muscle tone, his small cinnamon nips floating on a sea of definition set in a cafe-au-lait seascape. His thighs and legs are muscular and as he gets up to show us his ass we see this piece of work was well finished on both ends. His smooth ass is perfect and muscular. There isn't anything his ass wouldn't look good in--we'll stop right there. ...we're WAY ahead of you! Natural then sits down on the floor to continue stroking his monster cock. He beats of faster as his nuts bounce up and down in tune. The camera pans over him slowly; showing off every delicious inch of his frame. He then takes the show to the couch where he lies back and works up his cock til it's aching for release. Shots form below give you an amazing view of that amazing ass and as the camera repositions itself just over his uncut cock you see him double-fisting his pride and joy as h is foreskin glides back and forth over his wet knob. His cock is definitely at full throttle and won't be long before it needs to unload. Sure enough as he lies back he whispers 'Here I cum...here I cum!' and with that his abs contract sending out volley after volley of thick cream cascading over his cock and fist falling on the smooth skin below. Our stud is spent as he releases his thick cock letting it fall on his rock hard abs. Whew. Everything about this hottie is just delicious--naturally!",
  "models": [
    {
      "name": "Natural",
      "person_id": 28675
    }
  ],
  "release_date": "2008-07-02",
  "scene_id": 54533,
  "series": "Carnal Conflicts",
  "tags": [],
  "title": "Carnal Conflicts"
}