{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Escobar is from the West Coast. This 20 year old sweet glass of milk chocolate is as delicious as he looks. Bedroom brown eyes and a smile that makes them twinkle are only some of the things in this stud's arsenal. Some are visible at first glance, while others are hidden from plain sight. He's out here in South Florida, having his fair share of the beach, the girls, and trying to make some money while he's at it. He loves brunettes with big asses, small waists, and nice tits. He loves the curves, and South Beach has plenty for this CA native. He started having sex at 16, when he got his first chance to in a car. He was more than ready when he did; since he first started jerking his fat 8' uncut, love joy at 13. Now, he says he only jerks off whenever he needs release. Wait for it.  '...Three to four times a day!' he beams, when asked just how often he 'needs' release. Horn dog! He loves to try new things and isn't afraid of taking it outdoors. He's even had sex with a girl in a kids playground in the wee hours of the morning while people strolled by, unaware of the grindin' on the playground! He has one fantasy he is still working on, and that's to have a 3-some with 2 girls. Yeah, along with every other str8 boy who hasn't been able to manage that! Well, enough of what could be and back to what is. We have Escobar, right here, groping his growing boner and itchin' to show us his thick meat. Escobar begins by undoing his belt buckle and opening his jeans. He caresses his smooth abs as his shirt rides up along his defined torso. His shirt is the first to go, as he ditches it seconds before standing up to follow suit with his jeans. His cock is already half hard in his boxers as his jeans head south. His small dark cinnamon nips are the only contrast you see other than the ripples underneath his muscular definition. He slowly turns his back to the cam before peeling down his boxers to showcase his bubble butt. Light dusting of fur can be seen in the crack of his otherwise smooth ass. He goes face down on the couch and begins to mock hump to give us a better idea of what he can do on the horizontal. His full lips pout as he looks dead at you. He knows you want to see more, and he's making you want it more and more. He finally flips over, and when he does, you see his uncut cock half awake as it flops around waiting for the attention it craves. Escobar starts working it, and in no time, his 8' pole is rock hard and ready to go!He stands up and continues jerking off as he gives us better views of his ass, his abs and muscular legs as well as his low hanging balls that are already at work creating the fireworks for his finale. His cock is throbbing, and he glides his thick foreskin easily over his knob. He sits back as he bites his lower lip in what only can be described as a boyishly wicked grin. He's enjoying this more than he thought he would. He strokes his meat steadily as his smooth nuts begin to tighten, no longer bouncing in tune. He sits atop the chair and begins jerking his meat faster and faster as he nears his climax. His smooth muscular legs are spread wide as he aims his cock towards the chair's seat and unsuspecting cushion below. He moans a few times as his body begins to tense, and with a short 'Alright' --he blows! His thick seed cascades all over the cushion below as he pumps jet after jet of cream in its direction. Lucky for us, this must've been one of those moments where Escobar was 'needing' that release. Mmmhmmm.",
  "models": [
    {
      "name": "Escobar",
      "person_id": 28606
    }
  ],
  "release_date": "2008-05-14",
  "scene_id": 54548,
  "series": "Porky De Escobar",
  "tags": [],
  "title": "Porky De Escobar"
}