{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Go West, Young Man! ...and West we motored; til we hit Colorado and tripped over this week's ExtraBig find, Ronald. At a thick, muscular 5'11, Ronald Casis is a 27 year old hottie. Boyish looks and soft spoken his charm is only over shadowed by his 8' club he packs between his muscular thighs. He's currently single and making up for lost time after leaving his x for 'irreconcilable differences' I guess she's regretting not letting Ronald tap her ass now, huh? Ronald's on the prowl and loves petite girls. They need to be curvy and have big knockers, dark featured with exotic looks. He loves the imports: Indigenous, Indian, Latina, Asian or a mix; they all get him hard in seconds. Ronald was an early bloomer and discovered his water gun at 11. By the time he was 13 he realized his was more of a Super Soaker by comparison. Ronald wasn't the only one that noticed his equipment and by years end had lost his cherry to a horny 17 year old girl who had to have him ...what a whore!  (Sorta kidding.) Ronald loves sex and loves it outdoors: in the car, on the beach and in the occasional bank drive thru after hours. Ya gotta  love his sense of adventure! Well, actually once we get him out of his clothes; we have a feeling there will be a lot more to love. Ronald wastes no time immediately fumbling to undo his belt. He is ready to get the show started. He begins to feel himself as he looks dead into the camera. He knows you wanna see what he's packin but you're gonna have to wait to see it. He peels off his yellow t-shirt to reveal his smooth torso. His meaty pecs and supple abs look amazing as he continues to strip down to his black boxers. He is sexy and deliberate in his movements as he begins focusing attention on his throbbing cock. He is pulling at his meat and stroking it inside his briefs and it isn't long before his huge cock has run out of breathing room and needs to be released. He stands and slowly drops them as he kicks them across the floor. His cock springs out as he does and Super Soaker was an understatement. This stud's packin some serious meat. Thick from bottom to top, hard and screaming for attention, his 8' python will not be ignored. He works his knob with his fingertips as we get a great view of the massive trunk beneath it.He takes his cock to the couch so he can lay back and continue jackin his lubed monster. His heavy balls are tight as he plays with his meat. They are as impressive as their counterpart. Ronald jacks his cock faster as his hips buck up to meet his hand with every stroke. Makes you wonder how that would feel were it not Rosie Palm he was thrusting into. Hmmmm Ronald's cock isn't the only thing that would make your mouth water, his body is amazing. Boyish looks with bedroom brown eyes, sexy full lips; broad shoulders that sit atop his defined pecs are flanked by thick biceps. As the carnal panorama heads south, you see his aching meat just north of his massive quads and thighs that would make any tongue anxious, his strong calves aren't far behind. Ronald is getting closer and closer to climax and is now bucking wildly into his fists. He looks hot as hell fucking his palm like he is being ridden by an imaginary exotic female as his ass thrusts up off the couch. It isn't long before he busts his thick nut all over himself and the couch ...moaning, groaning, still pounding away. We're guessing Ronald isn't one to pull out. Now there's a visual. Whew.",
  "models": [
    {
      "name": "Ronald Casis",
      "person_id": 28697
    }
  ],
  "release_date": "2008-06-04",
  "scene_id": 54542,
  "series": "The Stroking Curve",
  "tags": [],
  "title": "The Stroking Curve, Scene #02"
}