{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It is Memorial Day Weekend, and that means it's time for the annual ExtraBigDicks.com cookout; and what would a cookout be without a cook...or in our case, a Cooker! Our very own nine inch stallion, Cooker  has added meat to his previously 'all fish' diet to include first getting head from Chase, then finding out that a guy's ass really is tighter than a girl's when he played hide the hot dog with a very appreciative Tucker  Chase. But today, the Cooker reminds us of every chef's rule: taste what you serve - that's right, in yet another first for our adventurous, colossally-cocked cook, Cooker takes his first tentative lick on 21 year old Troy's equally impressive eight inch pole, then goes back for seconds and thirds and does not stop until his nose is tickled by Troy's short and curlies. Troy's own oral skills soon have Cooker cooking on all four burners. And for the dessert course, Cooker rams all nine inches up Troy's hole for a Memorial Day explosion no one will ever forget. These two waste no time as they immediately reach over to explore the other. Cooker leans over to get better access at Troy's swelling crotch, giving Troy the perfect opportunity to land his lips on Cooker's. They slowly undress each other as they kiss passionately. Cooker's all over Troy, tasting his neck and gently licking him all over. It isn't long before these two realize they're still over dressed. Once in their birthday suits, they have better access to all the meat on the ExtraBigDick buffet. Cook goes down on Troy, and we were pretty impressed what he can do for a relative newbie on the all male scene. He sucks his shaft and pays close attention to Troy's shaved nuts. Troy's in heaven as he gets his bone marinated in Cooker's warm mouth. Troy is feeling left out of the prep process and decides to do a little marinating of his own. Cooker stands up and gives him full-access. 'Awww yeah, that feels good!' is all Cooker can say. ...over and over. Troy deep throats Cooker's thick cock with ease, leaving this straight boy in head heaven. They can't get enough of each other as they position themselves for more oral action in a steamy 69. The chemistry between these two is undeniable. If this bedroom were a kitchen, now would definitely be the time to get out if you couldn't stand the heat.Like any good meal the last step is putting your meat in a hot oven. Fortunately for Cooker, Troy brought his hot little oven with him today. In no time, that hotness is being lowered into position. Cooker is hard as steel as he makes his way inside Troy's tight hole. Troy only needs a few minutes to adjust before he begins to ride Cooker like a champ. He bounces hungrily, wanting every inch inside. Cooker jerks Troy's huge cock as he gets ridden. From there, they go to a sizzling doggie position, giving Cooker more control as he holds Troy's tight waist and impales him with ease. Troy can only grunt in ecstasy as he gets the fucking of a lifetime. An overhead shot shows Cooker's cock as it pounds deep inside. Missionary is next as they flip things around. Cooker's heavy nuts slap the couch below as he continues fucking Troy's tight ass. He is churning up some serious Cooker sauce in those heavy sacks, and it won't be long before he's ready to plate his dish. Troy can't take much more of Cooker's cock without needing to explode his own secret recipe. When he does, he explodes, sending stream after stream blasting all over his chest and defined abs. Cooker knows no dish is complete without his own sauce, and in seconds, pulls out and hovers above Troy, seconds before spraying a heaping load of thick cream as well mixing in with Troy's own. All this prepping, marinating, pounding has us all a bit hungry. Maybe next time we'll need to put these two in a real kitchen and let them have at it. We're sure no matter what they did, it would be delicious and hot. After all, they do call him 'Cooker' for a reason!",
  "models": [
    {
      "name": "Troy Montgomery",
      "person_id": 28334
    },
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    }
  ],
  "release_date": "2008-05-21",
  "scene_id": 54545,
  "series": "A 1st For Everything",
  "tags": [],
  "title": "A 1st For Everything, Scene #01"
}