{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Enrique is back for more action! Enrique and his fat 8.5' cock are back for even more action. To date, Enrique  has been featured in a scorching solo as well as a hot duo with Robbie where we got to see him going to town on a hot ass. 'Very good top ...and also a hot ass bottom' was how he first described himself; and today we will get to see just how good a bottom he is. His swarthy looks & baby blue eyes would make him absolutely delicious in any position. To help us put Enrique to the test we have 22 yr. old Jonathon. Jonathon is originally from Ontario, CA and he is a lean piece of stud with a big toy. His cock is about 8' and he loves to use it. This will be quite the show. Jonathon is single and his last sexual tryst was at a local bathhouse where he got into some hot glory hole action. The anonymous scene works for Jonathon whereas Enrique claims to be a 'good boy' and stays away from the bath house scene. That sounds like a good story since Enrique, who is already rubbing his swollen cock through his pants, wouldn't talk about the raunchiest thing he's ever done off camera ...Mmmhmm!  Well, for now we get to see what he is willing to do for us 'on cam'. Jonathon wastes no time and immediately slides off Enrique's shorts to reveal his massive cock struggling to get free of the thin cotton confining it. In no time, these two studs are kneeling before each other exploring each other's cocks. Jonathon is the first to go down for a closer look as he engulfs Enrique's uncut cock balls deep. He savors it and gives it a slow sensual sucking before getting back up to give Enrique a taste of his own throbbing meat. These two can't get enough as they get into a hot 69 position, sucking each others swollen cocks. These two studs look incredible with their faces buried in the others crotch as they chow down for an 'all the cock you can eat' buffet. No buffet is complete without a properly tossed salad so it isn't long before Jonathon goes to town on Enrique's perfect bubble but. He laps & licks & darts his tongue deep into Enrique's smooth hole. His tongue and fingers explore what his cock will soon enjoy. Enrique lays back and enjoys the attention he's receiving from Jonathon. ...Who wouldn't'!?  Jonathon rolls him over on his stomach as he straddles Enrique and slowly jockeys into position. His fat cock dangles above its intended target which by now is more than ready for a fucking. He lowers his cock and makes contact with a wet hole which readily welcomes him inside. In seconds you hear Jonathon's heavy balls slapping Enrique's sweet ass as he pounds him deep. From there he rolls over on his side and continues fucking Enrique. The shots of his cock stretching Enrique's ass wide are hot as hell. He then kneels over Enrique, puts Enrique's leg on his chest and enters him on one knee. In this position he has great access to that hot hole. Enrique is as hot a bottom as he is a top; taking Jonathon's massive meat --like a champ! Missionary is next as they near climax with Jonathon pounding away at Enrique. Enrique jacks his 8.5 inch cock faster as he gets impaled and when he's getting close, Jonathon starts fuckin' him like a jack rabbit. He knows that's enough to send anyone over the edge & sure enough he fucks the load right out of him! Enrique shoots so hard his first shot hits him in the face. Once he gets Enrique off he lies back and jacks off his own massive load that covers his navel. Well, I guess Enrique was right after all; and with a hot top like Jonathon we now know it.",
  "models": [],
  "release_date": "2008-05-07",
  "scene_id": 54549,
  "series": "Playing With His Bone",
  "tags": [],
  "title": "Playing With His Bone"
}