{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a local piece of hotness. He's 19, sweet, sexy with bedroom brown eyes and a smile that could melt hearts on both sides of the fence. We're talking about home-grown, Miami boy, Dick Armstrong. Dick came to us wanting to make a little money as well as explore his freaky side. We were only more than happy to oblige. Any doubts we had immediately vanished once he hauled out his thick 8' Cuban cock! This 5'7 hottie is packin' some serious dick. We guess good things DO cum in small packages. Dick is currently single, but lookin' to mingle. He loves all types, but admits that although a pretty face will get his attention, it's a great personality that seals the deal. He's adventurous in and out of the bedroom. He once had a girl straddle him while driving down the highway. (Go Speed Go) That's just crazy. He still has many fantasies left to fulfill, and wants to explore more role play scenes (i.e. Naughty nurse, Teacher/Student). Dick is a very, very bad boy. So bad, he started wankin' in the 6th grade. Imagine how many fantasies were hatched being held after class by some hot teacher. He's very passionate and says he's an amazing kisser and can create a 'spot' on a girl wherever his skilled mouth lands. ...Is it hot in here? Ok, focus. So, now, we bring you what we could all use more of --DICK!  ...Armstrong, that is.We hadn't begun rolling, and Dick already had his hands in his pants. Dick's ready for action as he gropes his cock and begins to strip down for us. His t-shirt comes off, and as he peels it off, we see a glimpse of a scorpion tattoo on his lower abs. That might explain why this Hispanic hottie is so intense. If there's one thing you definitely need to watch out for--it's a horny Scorpio! He turns around slightly as his shorts drop halfway down his incredible bubble butt. This boy's got the Cuban booty and he knows it. He lets them fall around his calves as he leans up against the wall to stroke his now throbbing cock. His defined pecs look amazing as the light dances off of them, casting shadows on them and the sweet abs below. Dick is a sight to behold as he fists his fat 'pinga Cubana'. He lies down and continues to jack his aching meat. The camera pans slowly across his hairy legs, up over his smooth nuts and rock hard cock, and up over the torso that is lean and well-defined.He gets up and sits back on the chair to continue working his meat. He concentrates on the task at hand, even biting his bottom lip as he does. If only he knew how many boys wish they were the ones biting on those sexy full lips of his. He sits back and jacks his thick cock with both hands as you get a great view of his defined frame. There isn't a bad angle to this Cubanito. He lies down on the couch to get ready to bust his nut. His pale olive skin contrasts against the black leather, setting off his features even more. He jerks his cock faster as he looks back at the camera. From this angle, you can appreciate the boyish face on this pint-sized stallion. Long lashes that frame his brown eyes and that sexy mouth parted ever so lightly as his breathing begins to deepen, and the black goatee which adds even more attention to those full lips. The look on his face is one of pure rapture as he nears his climax. His eyes roll back seconds before he releases his load. His cock jets load of after load of hot, creamy 'leche' coating his now happier, happy trail. Well, we only have two words to say to Mr. Armstrong: 'Que Rico!'",
  "models": [
    {
      "name": "Dick Armstrong",
      "person_id": 28596
    }
  ],
  "release_date": "2008-05-28",
  "scene_id": 54544,
  "series": "Before Class...",
  "tags": [],
  "title": "Before Class..."
}