{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "One look at those mischievous blue eyes, and it's obvious why he goes by the nick name 'Baby Blue'. Baby Blue is quite the character. He's 22, 5'10, and packs a whopping 8' cock in his pants. He is energetic and outgoing with a great sense of humor. He's the kind of guy that would make any party 'a party'. He's an exhibitionist and a voyeur. He isn't shy about much, and isn't afraid to try new things. Last week he had a girl he knew come pick him up at a bar cuz he was tanked. He ended up nailing his Designated Driver in a friend's bathroom for 2 hours. Well, he was  drunk! A hang over and a damaged towel rack later...'She was sober...and she initiated it, so I was like--alright', he laughs. He is a horny one and loves to jack off anywhere and everywhere he can. His ultimate fantasy is to be with 30 virgins ...or is it? 'Come to think about it ...maybe I want 30 whores, cuz they'd probably be better at it!' His face lights up as he nods giving us a devilish grin. He's 'Trouble'! Girls compliment him on his baby blue eyes and his pearly teeth as well as his personality. He says he likes his eyes as well, but more than anything he likes who he is. We like who he is too; but we think once we get him 'nekid', we're gonna like a hell of a lot more.His cock is growing as it begins to snake down his pant leg. Baby Blue strokes and rubs it as he also begins to explore his sexy torso. He takes his shirt off to reveal a smooth, defined slice of heaven. His small cinnamon nips are both pierced, and he has a light dusting of hair that nestles where his pecs meet. His abs are lickably smooth, and then there's his navel, where his sexy happy trail leads the way to bigger and better things as it slips beneath his boxers. He has tattoos on both arms, and he looks amazing as the crotch he's tugging on begins to bulge before your very eyes. He undoes his jeans, and his cock is clearly visible through his thin boxers. It's throbbing and in need of attention. He pulls up his boxers to show off the intricate ink on his thighs before he turns about-face and moons the cam. He flashes us that sweet ass several times before slowly working his smooth hole for us. His bubble butt is amazing, and as he bends over, you get your first glimpse of his huge low-hangers and throbbing cock.He turns around for us and gives us the much-awaited 'Full Monty'. His cock is throbbing, and as the cam closes in, he's already leaking. Besides the baby face and baby blue eyes--there's nothing 'baby' about his cock. His nuts look like 2 Grade A Large eggs dangling in their own smooth sack. At full mast, his cock is impressive and so hard he could chisel with it. He moans softly as he strokes his cock dry. Overhand, underhand, under one thigh, double-fisted--he can't get enough. He flips over on his stomach and spreads his legs wide, showing off his backdoor as he slowly fingers himself. His back is covered in ink. Baby Blue knows just what to do to get you hot and bothered. He kneels and continues to jerk off, showing off his rock hard cock on his lean frame. He lies back and goes for it. His face looks amazing as he nears his climax. The thick, sexy eyebrows that showcase his baby blues furl, his pouty, full lips part as he begins to whimper and moan just when you're admiring that lust-driven look. 'Oh yeah, I'm gonna cum ...ready? Awwww Shhhi--He explodes! He fires off geyser after thick geyser coating his now happier trail. Just when you think he's done...more geysers follow. Whew. He lies back, spent as he rubs his load all over his navel. OK, I need a cigarette. Oh wait. I don't even smoke!",
  "models": [
    {
      "name": "Baby Blue",
      "person_id": 28562
    }
  ],
  "release_date": "2008-04-30",
  "scene_id": 54552,
  "series": "Dick Hunger",
  "tags": [],
  "title": "Dick Hunger, Scene #02"
}