{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "22 year old Joey is a rosy-cheeked cutie with a body so lean and chiseled, it seems created for the singular purpose of making his fat, cut eight inch cock appear even more drop-to-your-knees and suck-him-to-the-balls goregous than it already is. Joey said his most exciting sexual experience took place with an adventurous nymphette atop a pitcher's mound on a baseball field. Joey seems to have a thing for the older, wilder females, as when he was a freshman, he met a Junior girl 'who saw an opportunity to get something from me, and she took it: my cherry!' His sinewy, smooth fat-free physique is a work in progress that began when he a young man: eleven years of wrestling, baseball, swimming, and boarding have definitely done his body good. Fortunately for us, one of those places was in our California studio, and we made sure to get the first load of the day. As you will see at the end, this is one time the early bird definitely got the...sperm!The first thing Joey does is hike up his shirt to cool down. One look at his deeply etched abs, and things in the room definitely started heating up. He casually opens his belt, makes history of the shirt, unbuttons his jeans, and immediately grabs that twitching tower of power inside his grey shorts. As he stands up, our eyes touch base with those twin, quartered sized cinnamon colored nipples that are as hard as his cock... and ours at this point. The deep valley at the center of those spectacular abs acts like a street sign that moves our focus downwards. Joey stands up and lets his pants fall down around his knees - to allow us to take in the beauty of a cock so big, it extends beyond the side of his body as it lays across his hips. A casual rub of the bulge, and the leaking head sticks out the bottom of his shorts, and it's way too hard for him to stuff it back inside. That suits us just fine - there are many places he could stuff a beauty that fat and long, but back in shorts will never be one of them.Sitting on the arm of the couch, Joey tugs downs those shorts, stands and steps out of his jeans. He moves back to take a seat. In profile, that extra big dick looks like a kickstand that could keep a man twice his height and weight from hitting the ground. As he fists his cock with long, loving strokes that work that pole from the pubes at the base to just under the pale pink, plum sized head, his eyes close in delight as he licks his lips in anticipation. Now working just the head, we get to appreciate just how far from the base that head actually is, and how fat around that thick slab of dick meat really is. When he bends over and shows off how far that dick hangs down and how gloriously edible those white cheeks and fuzzy hole are, Joey looks like an all you can eat buffet. Damn, that has us working up an appetite. Grabbing some lube, stroking even faster, and moaning louder still, his balls tighten, his toes curl, and he aims his cock right on his thigh and milks out a load that ricochets up to his abs, then creates several small white lakes on his leg all the way down to his thigh. Now that we can see what Joey was cooking up, there is plenty of protein on the menu....who is in for seconds?",
  "models": [
    {
      "name": "Joey 1",
      "person_id": 29749
    }
  ],
  "release_date": "2008-04-23",
  "scene_id": 54554,
  "series": "What Strokes May Come",
  "tags": [],
  "title": "What Strokes May Come"
}