{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we brought back Enrique, the blue-eyed, San Diego hottie. Last week, he did his first solo for us, and we were more than happy to invite him back for more. This 5'10 stud is more than equipped, with a massive 8.5 inch uncut cock on his well-defined frame. The masculine face is captivating, and those azure eyes seem to draw you in. Like a moth to a flame! Fortunately, this fire is always ready for anything. Even as we interview him, he is rock hard and playing with his throbbin' cock through his jeans. You gotta love it. Robbie is a 20 year old cutie who's a new arrival on the West Coast. At 5'11, Robbie is deliciously smooth and has a baby face that would make most take a second look. Robbie is still awestruck with the sights and sounds of Los Angeles (i.e. Britney!). Coming from a small town can be quite overwhelming. Unlike Enrique, Robbie is new to the area as well as to doing videos. Lucky for him, he gets to do his first scene with us with Enrique who is more than up for the challenge. By the time the cameras roll, these two have already begun. They begin slowly making out as they start undressing each other. First their shirts come off, then Enrique unzips his jeans, instantly freeing his swollen cock. Robbie wastes no time in going down on it. Enrique's eyes close in ecstasy as he gets his cock worked. Robbie is next as he pulls out his throbbing boner and offers it to Enrique, who gladly helps him out swallowing his bone to the hilt. In no time, these two are laying side by side, feeding each other cock in a sweet 69. Both of their heads bob up and down on the other as they continue exploring each other. There isn't a bad angle as they each swallow cock. The views of these studs heavy hangin nuts and asses as they lay end to end is extremely erotic. It won't be long before these two are going to want more than just a little oral attention! Who could blame 'em?Lying behind Robbie, Enrique holds Robbie's leg up as he slowly shoves his uncut cock home. Robbie's ass slowly gives it up as it's invaded by Enrique's fat cock. Enrique starts slowly fucking Robbie, burying his rod deep until his smooth nuts meet ass. Robbie takes every inch in stride, even as Enrique picks up the pace. Robbie's smooth hole is loving the attention it's getting. Enrique flips into a missionary position, letting him gain better access to Robbie's tight ass. His muscular ass looks amazing as he begins to piston fuck Robbie's hungry ass. Robbie goes from quiet to 'Uunngh!' in seconds, as Enrique starts slamming his cock in to the hilt. Enrique looks amazing fucking Robbie fast and hard, drilling his cock deep as Robbie struggles to take the fucking he's getting. Doggie is next on the menu as Enrique continues his anal assault on hot Robbie's hole. Enrique can't take much more and pulls out seconds before exploding--sending load after thick load all over Robbie's smooth ass. Robbie isn't far behind as he flips over and busts his huge nut as well. Whew! Putting these two together was definitely a good idea, and Enrique, as usual, didn't disappoint. Seconds anyone? ",
  "models": [
    {
      "name": "Enrique Currero",
      "person_id": 27886
    },
    {
      "name": "Robbie",
      "person_id": 29608
    }
  ],
  "release_date": "2008-04-16",
  "scene_id": 54555,
  "series": "Rockin' Robbie",
  "tags": [],
  "title": "Rockin' Robbie"
}