{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Enrique comes to us from the West Coast. He was in San Diego when he decided to give this a go. At 33, Enrique is new to the adult industry and is making quite the name for himself. He has already worked with several studios out west and is enjoying every minute of it. He says he was a tubby boy 2 years ago at 210 pounds; but, he got rid of the extra pounds and has managed to maintain it through cardio and biking. He pulled a muscle about two months ago and has been unable to hit the gym like he'd like to, but he laughs and warns us that next time we see him, he will be rock solid muscle. His look is very masculine with a sexual energy about him. His tanned skin offsets his brilliant blue eyes. You can't miss them as he stares through you. His cock is just as impressive, measuring in at an impressive 8.5 uncut inches. 'Very good top ...and also a hot ass bottom'... Enrique is up for anything. Fortunately, he's about to give us an idea of what that cock looks like in action. Enjoy!The camera's barely begun to roll, and already Enrique has his hands down his pants. The outline of his growing cock is unmistakable as he continues groping his growing cock. He undoes his jeans to reveal his short cropped bush and the base of his thickening rod. Enrique's shown up commando. As his jeans get kicked off, you get your first glimpse at his massive uncut cock as it snakes side to side. It hangs between his hairless thighs as it continues to fill out. His massive cock has company in the form of two man-sized nuts that hang just below in their smooth sack. They bounce up and down in time with Enrique's strokes. He kneels on the couch as he continues stroking. His foreskin glides up and down the length of his massive cock. A shot from below gives you a better perspective of all he's packing, and the view from behind is just as impressive! He has a smooth bubble butt that makes you wonder whether you want to eat his pizza crust first instead. Hmmmm. We don't think it would matter where you started ...Enrique's just delicious!He continues stroking his now throbbing cock. As he does, his face reveals his delight. His heavy eyebrows furl as his eyes close tight. He begins to play with his smooth cinnamon nips as he caresses his defined chest. His mouth opens in ecstasy as he continues working his cock. He is a sight to behold going at it. His cock is rock hard, and he has enough foreskin to still cover its massive length. He begins stroking his cock faster and faster, and it won't be long before he blows his much anticipated wad. He licks his lips as he nears pay dirt. Like a rocket on a launch pad, 'All Systems Go', as everything begins to fall into place signaling the launch. His body begins to tense, his heavy balls are now pulled tight up against his smooth frame, his mouth gaping open, eyebrows furled, and within seconds, he grunts and moans. Blast off! He moans softly as he erupts, sending his load all over his smooth thighs and the couch below. Whew. Well, that was a creamy launch well worth waiting for.",
  "models": [
    {
      "name": "Enrique Currero",
      "person_id": 27886
    }
  ],
  "release_date": "2008-04-09",
  "scene_id": 54557,
  "series": "Light Eyes",
  "tags": [],
  "title": "Light Eyes"
}