{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Cooker is back! Cooker has come along way since we met him a few years back when all he would do for us was jerk his massive 9' cock. Cooker, a certified chef, is from Pennsylvania; & has been dating his girl for 7 years. She lucked out because big dicks happen to run in his family! And we definitely mean BIG! Nine inches of rock hard cock that can only be suited up in one thing --Magnum XL! He laughs & admits if he tries anything smaller they won't roll all the way down to the base. An ExtraBigDick has its disadvantages & there are certain girls that can't take it as well as he'd like them to. He has only had 2 experiences where a girl's been able to swallow him ball deep without a problem. The only other time was our doing! Cooker finally agreed to let us show him that guys do it better & had Chase  give him his first ever Hummer from a dude! He admits he closed his eyes & thought of a girl doing it; but it was SO good that he almost bust a nut 30 seconds in. It was one of the best blowjobs he's ever had. 'They definitely do it better!' he laughs. Which gives us an idea, since only a few girls have ever let Ol' Cooker attempt anal without success; we're gonna convince him that 'You really can't send a girl--to do a man's job!Wearing the Tee that says it all 'Bigger IS Better!' Cooker immediately ditches his jeans. His python is already coming to life as he start rubbing it through his loose fitting boxer briefs. He pulls them down as his semi hard meat flops out. Its massive & growing by the second as he stands to take his boxers off. By the time he's back on the couch he's rock hard. 0-9' in no time flat! He spreads his legs with one on the floor & the other on the couch as he starts to work his huge low-hangers. His cock is throbbing and at attention as he jerks it; his huge nuts bouncing along for the ride. Cooker is smooth all over & even keeps his crotch buzzed short. He grins as he releases his dick & makes it dance on its own. It jerks to & fro at his command. He not only knows what he has but knows just how to use it!Standing up, he puts one foot up on the couch & continues stroking his meaty monster. You can see the definition in his lean torso & legs. A shot from down under gazing up at him at work, shows his cock & those massive low hangers as they dangle like two eggs in a soft pouch. He lets go of h is cock & wiggles side to side, setting his cock off on a free ball dance, shaking it side to side. Apparently the sauce he's preparing for us requires a little bit of shaking & no stirring! Hmmmm. Then our chef lies back on the couch & continues the final step in his recipe. Whipping the heavy cream to a thick froth! He pins his swollen boner at the base with one hand & starts working the tip with the other. His breathing deepens as his climax nears & with a look that can only mean release is a second away, he nuts. A 'Here it comes...' followed by a guttural '...Aaaaw Fuck!' and we have it! --Ladies & gentlemen, The creme fresh is now served! ",
  "models": [
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    }
  ],
  "release_date": "2008-02-27",
  "scene_id": 54569,
  "series": "Cooker, Stroke Your Dick!",
  "tags": [],
  "title": "Cooker, Stroke Your Dick!"
}