{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'You can't send a girl...to do a Man's job!' is what we kept telling horse-hung Cooker. Slowly but surely, Cooker's come around. As a lot of you know, Cooker, the 29 yr. old, professional chef, has come a looong way with us here at ExtraBigDicks! Starting with solos for us, we found out in past interviews that due to his enormous endowment, he rarely finds a girl to with a deep enough throat to handle him. 'Boys do it better!' we said and he'd politely laugh it off; but eventually--we showed him! Chase, our oral wonder boy, swallowed Cooker to the hilt with ease and left a wide-eyed Cooker curious to explore just what 'other' things boys can do better. Well, the long awaited day has come, and Cooker's ready to find out! Today, our favorite chef will be accompanied in what we are sure will be one of his hottest scenes to date. If you're good, we'll give you the recipe! For this long awaited segment of the 'Boys do it Better' Buffet, we knew just who to call--Tucker! We know that Tucker, the 23 year old from Michigan who's cute as a button at a compact 5'6, will do what he does best--play with the biggest of boys! Tucker gets to be the first guy to ever have his tight ass invaded by our very own Cooker--the ultimate 'Top Chef'! Some boys have all the luck!Cooker is ready to go as he leans back, stroking an already boned cock. Tucker needs little encouragement as he begins to undo Cooker's pants to get to what he wants. They both take turns teasing Cooker's snake through his boxers as Cooker begins to undress. Cooker's a tad nervous, and to make him a bit more at ease, Tucker begins kissing his neck, then works his way down to his chest and finally hits paydirt--cock! Cooker is hard in seconds, as Tucker's expert mouth begins pleasuring him. Tucker's nose is buried in Cooker's nuts, reminding him how he got this far in the first place. The look on Cooker's face is classic as Tucker swallows his cock, enjoying every delicious inch of it. What happened next totally surprised us all, when they stripped and got back into bed, kneeling as they faced each other. Tucker kisses Cooker--and Cooker kisses back! WOOF! They make out for a few minutes before Tucker's urge for more cock overpowers him. He's hooked on the Cook! He devours Cooker's meat, savoring every throbbing inch, and the look of satisfaction on Cooker's face lets you know he's doing everything just right!Sitting back on the chair with Tucker on his knees in front of him, Cooker gets his meat worshipped. Curiosity gets the better of him, as he reaches down to stroke Tucker's swollen 8' cock. Then the real games begin, as he leads Tucker to the bed. Tucker goes face down as Cooker mounts him. He slowly slides his thick 9' cock inside til their balls meet! Tucker moans and grunts in delight as Cooker begins giving him all he has. Cooker's thick cock slides in and out of Tucker easily as Tucker grins and bares it. He knew what he was getting himself into and is loving it! Cooker looks dead at the camera while he pounds lil Tucker with a look of satisfaction you have to see to believe! We don't think Cooker regrets his decision one bit! From there, they switch position as Tucker bounces on Cooker's throbbing pole! This is a dish we like to call 'Stuffed Tucker'! Cooker then picks up Tucker, still impaled on his cock, and gently carries him to the bed where they climax. Cooker shoots his signature sauce all over one well tenderized Tucker! The feel of Cooker's load splattering onto his cock sends Tucker over the edge as he explodes. Whew! Well, someone might as well stick a fork in these two ...cuz they're done!",
  "models": [
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    },
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    }
  ],
  "release_date": "2008-03-05",
  "scene_id": 54568,
  "series": "Same Sex, Different City",
  "tags": [],
  "title": "Same Sex, Different City, Scene #02"
}