{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "The Midwest has been very good to us this week. Colorado, Boulder specifically, produced this week's incredibly sexy stud, Ray! At 5'11 this sexy 22 year old with the cat-like almond eyes and deliciously thick lips is currently single. 'The More the Merrier' he says when it comes to women. He loves girls who are well put together. She can be thick, but she can't be fat! Tits aren't all that important as long as she has a nice ass. Ray doesn't want any bruising. He's an ass man through and through. He'll lick it, spank it, he'd do it all; but he hasn't met one yet that will let him fuck her in the ass! Gee, it wouldn't be the thick 8.5' cock he's packing that might have most women in Colorado a bit uneasy about trying anal would it? 'I guess they're afraid I'll rip 'em a new one!', Ray laughs. They don't know what they're missing! Well...neither will we with this straight boy. He is poised and relaxed with a confident demeanor that just oozes sex. His eyes are piercing and his smile is innocently seductive. His charms are so persuasive that one of his fondest sexual memories was banging his boss' daughter--no holes barred--within the hour of being initially introduced while he was at work! Looking at him, you can't really blame her for jumping at the chance to get him naked. So, on that note and in the spirit of little Miss Hump-a-lot, I say we do the same damn thing--Get him NAKED!!Sitting back, Ray licks his thick lips as he begins to undress. Not camera shy at all, Ray looks dead at you as he slowly undoes his belt and peels down the zipper. He knows he has what you want and is all about making you wait for it. His pants drop to the floor as he gives us a show in his boxers. His soft cock is impressive as the thin fabric clings to its every curve. He slowly peels them down showing us more on his terms. Just when we think we're gonna see what the happy trail hides, he grins, turns, and shows us his smooth bubble butt instead. Works for us! He then sits back so we can better appreciate what he has to offer. His abs and chest are well defined on his thick muscular frame. Hey may be a young 22, but Ray is ALL man! He reaches into his loose boxers and begins to awaken his sleeping python. In no time, the head peers out from its cotton confine as he continues stroking it to its full potential. Within minutes, his boxers are piled to one side and Ray is stroking his huge cock. Thick from the base to the head with an even larger knob, this bad boy's baby maker is one to be reckoned with. It's no wonder girls won't give him backdoor access! He's HUGE!He stands while he strokes his thick cock. His perfectly smooth balls are tight as he fists his throbbing cock. His face is one of concentration as his desire takes over. No longer teasing--Ray is on a mission! An overhead shot of his cock being worked gives us a great view of his smooth, toned thighs and rock hard abdominals. The best is yet to cum! He takes the show to the floor as he lies back against a couple pillows, spreads his muscular legs wide, and starts jerkin his boner. His thick python is now aching for release. As he lies back, we get a glimpse of the full menu: His sweet ass that's spread ever-so-slightly as his legs are spread wide, his heavy balls that are being pulled tighter and tighter by the stroke, his delicious thighs, his abs, and of course his enormous cock. No matter where you start on this buffet line--the eatin's GOOD! He pays closer attention to his knob as he nears climax. His facial expression is priceless, caught up in the moment as he nods us a 'thumbs up' --All Systems Go!! ...and they GO alright! He grunts as his body tenses and he explodes. His first nut splashes against his pecs, and the rest of his cream splatters closer to home, coating his truly happy trail!",
  "models": [
    {
      "name": "Ray",
      "person_id": 28688
    }
  ],
  "release_date": "2008-03-12",
  "scene_id": 54566,
  "tags": [],
  "title": "Rent Due!, Scene #02"
}