{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'Be careful what you wish for', they say. Well, lucky for us, we had our wish come true. Last week, we brought you Christian, the 21 year old Columbus boy who left quite the impression with his over-sized man cock. Christian, who packs a thick 9' cock on his 5'11' frame, loves to have people watch, and at times even join in when he has sex. Knowing he could be caught at any minute is just the adrenaline he needs to fuck a tight ass just about anywhere. Last week, we hoped to maybe get him to do more than a solo and give us an idea of just what someone who walked in on them would actually see as he pounded an appreciative hole. Well, get your lube out--cuz it's ON!!  Aiden is 6' tall and baby-faced. He recently turned 21, and is also another Ohio native. Unlike Christian, who has had limited experience in front of the camera, Aiden has several films under his belt, and has done work on the net as well. He is now at the point where he's beginning to get recognized on the street. He was last 'spotted' while driving on the turnpike, by of all people, the guy at the toll booth! 'I dropped my money and drove off!' he laughs. Well this afternoon, there will be some of the same; except it will be Christian doing the 'dropping', as he repeatedly drives in and out of Aiden's tight booth! ...before driving off!Christian wastes no time as he gently reaches over and begins to kiss Aiden. They begin a sensual make out session, as each begins undressing the other. The chemistry is obvious as they slowly kiss each other, sucking on each others' lips as they allow their hands to roam about freely. Both of their bulges are beginning to tent as they continue their embrace. Within minutes, the pants come off, and Aiden immediately hauls out Christian's impressive meat. He's at half mast when it goes into Aiden's hungry mouth. You can see it filling out once Aiden goes to work on it. He looks up at Christian as Christian slaps his fat cock on Aiden's open mouth and tongue. Aiden grabs Christian's cum-laden orbs as they dangle below. Christian loves the attention, but soon wants some himself. They strip and get into a steamy 69 position. Christian jerks Aiden's thick cock while he is still getting head from Aiden. Christian then pulls Aiden on top of him and buries Aiden's cock into his throat. In this position, he has full access to Aiden's smooth ass. Aiden, on all fours, holds still while Christian begins fucking his face. Aiden's ass is too much to resist, and soon enough Christian's fingers just won't do!He pulls Aiden off him as he goes right for more of that sweet ass, his tongue probing the sweet hole he will soon stretch wide with his massive cock. Aiden's face is one of total rapture as Christian eats his ass out: licking, lapping, biting, probing --completely driving him insane. Christian is an expert rimmer, and his tongue is hitting ALL the right spots. Christian is inches from Aiden's ass as you hear him whisper 'Wanna ride it?' Aiden immediately nods his approval! Duh!--that was a no brainer! Christian lies on his back and Aiden straddles into position while Christian peels on a Magnum. Its amazing watching Christians huge nuts bounce as he piston fucks Aiden's tight ass. They're massive, and it makes you wonder just how long it's been since they unloaded. From riding his cock, they switch to fucking on their sides, and eventually to a hot missionary position where you can truly appreciate Christian's extra thick, battering ram in action. No matter the position, Aiden takes that monster cock deep! You can see Christian's low hangers slapping Aiden's ass when they aren't busy dragging on the sheets below. DAMN! They reach climax and lay back side by side to unload. Christian fires first and coats his defined abs with seed. Aiden isn't far behind, and soon they are both drenched ...Ohio has many things to be proud of!",
  "models": [
    {
      "name": "Aiden Shay",
      "person_id": 30339
    },
    {
      "name": "Christian",
      "person_id": 29189
    }
  ],
  "release_date": "2008-03-26",
  "scene_id": 54561,
  "series": "If Only 4 1 Time",
  "tags": [],
  "title": "If Only 4 1 Time"
}