{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, we have an Extra Big piece out of the Midwest! Christian, who recently turned 21, looks clean cut; and, on first impression, would lead you to believe he's just another well-mannered Midwesterner with a disarming smile and a laid back attitude. Don't let the look fool you! Christian, at 5'11, is a big boy all around. As laid back as he may seem, his wild side makes him twice as hot. Packing a thick 9' cock, Christian likes to get his cock off whenever and wherever he can. His hottest sexual memory to date was fucking his then boyfriend in a beer cooler at a bar where they could've been caught at any minute. He loves the adrenalin rush knowing he could be walked in on while he slams his fat cock in a tight hole. He used to have guys come over and walk in on him fucking his then boyfriend and join in in order to spice up their bedroom dynamics. That must've been quite the site, walking in on Christian and seeing that hard cock pounding a hungry hole! WOOF! Well, for now, we have Christian here willing to give us a peek of that thick cock he loves to show off. Besides, with Christian, you never know what could happen!Wasting no time, Christian loses his tank top and undoes his jeans as he begins to feel himself up. His lean torso is a wonderland. As his jeans fall to the floor, you can see the outline of his sleeping python clearly as his loose fitting boxers hug every delicious curve. His hands dart inside to begin waking his beast. One hand on his nuts, the other on his cock, it doesn't take long before his cock is at full attention. He hauls it out, giving it more breathing room, and with it come out his huge low hangers. Apparently, everything's huge on this stud! He lays back and begins stroking his now throbbing cock, giving us a great view as he spreads his thighs wide, his huge balls bouncing in time with each stroke. Christian's chest is completely smooth, and the only thing besides his small cinnamon nips is the faint treasure trail that leads to his massive cock. By now, he is fully erect, and it's a whopper! Not only is his cock 9', but the girth is amazing. He jerks his cock dry as he holds down his massive nuts.Christian's face is focused, and the look of pleasure is obvious as he continues pleasuring that fat club of a cock. His eyes shut as gasps begin to escape his mouth as he begins jerking faster and faster. His left hand still holds down his boys as he begins working his cock at its thickest, which is just below his shiny knob. Overhead views give you a great perspective of just what he has to offer. He begins to tense up as you see him clearly approaching his climax. You can tell that this boy can fuck for hours if he has this much control of his nut. He begins to whimper and let out the occasional moan, and you can clearly see he's pushing all the right buttons. His mouth slightly opens in ecstasy as he points his rocket straight up and jacks his cock... and within seconds--he blows his load! His thick jizz cascades out over his knob and lands in a pool atop his short-cropped bush. There isn't an inch on this stud that doesn't make you wanna scream 'MORE!' I guess for now, we'll just have to wait and see!",
  "models": [
    {
      "name": "Christian",
      "person_id": 29189
    }
  ],
  "release_date": "2008-03-19",
  "scene_id": 54563,
  "series": "The Thing About A Man...",
  "tags": [],
  "title": "The Thing About A Man..., Scene #01"
}