{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "John Desmond has the All-American jock look that would make anyone look twice as he passed them by. At 6'1', his defined frame is kept in shape by his love of outdoor sports. He's a long distance runner; often doing pack runs carrying 40-50 pounds for 8 or 9 miles. Kayaking and rock climbing keep his upper body in peak shape. John lost his cherry at the tender age of 13 in Catholic school with a classmate when a game of 'Show and Tell' led to much more. As exciting as that must've been for a 7th grader, it pales in comparison to other experiences in his repertoire. He's even had sex on the 'Zipper' at the fair. His then girlfriend thought it would be hot to try it, and on a minute and a half ride--they did! 'I don't remember where--it could've been upside down--but I know I came!' he boasts. A minute and a half? Hardly braggin' rights, but there's something to be said for spontaneous sex. His ultimate fantasy would be fucking a college professor after being held after class. Anyone see a pattern here? Between goes, John takes care of his cock about three times a week depending on how much pussy he gets. Well, we already know how he keeps that bod in shape, so today he's gonna give us a peek at how he keeps his 8' baby-maker primed and ready for anything--anywhere!Wearing a gold and sky blue football jersey and a tight pair of jeans, John wastes no time and zeroes in on his belt buckle, anxious to get to the task 'at hand'. His jeans come undone, and his cock is already swelling, knowing it will soon be free of its cotton confines. His jersey comes off, and you see a large sun tattoo also inked in sky blue across his left pec. The sun, as well as the blue stripes it encases, pay homage to his Uruguayan heritage. His jeans drop, and he begins to tease us through his boxers. He rolls around his huge nuts as his cock begins to lengthen slowly, like an awakening python. He runs his hands over his defined chest and rippling abs. As you pan down on this muscular hottie, he's deliciously smooth til you come to the hint of a happy trail that leads you to his now throbbing cock. The underwear comes off, and now John is ready for business! His cock at attention, John rises to the occasion, giving us a spectacular view from below.The camera is angled upwards as John dangles his throbbing cock. His heavy hangers dangle below as he jerks his monster cock. He hasn't forgotten it's a full show we want, so he turns around to show us his backdoor. His compact muscular ass is coated in light blond fuzz, and he caresses it slowly to let us fully appreciate it. He then sits back and goes back to work on his aching cock. His lips parted slightly as he pleasures himself, John is caught up in the task of getting his fat cock off. He fists his massive meat as he sits atop the headboard. He then decides you haven't seen enough of his forbidden zone. He gets on all fours and begins teasing his ass and cock for you to see. Once he feels you've had enough, he turns over and goes for gold. His toned abs tense and writhe as he approaches climax. He begins gasping and moaning subtly as his cock swells even thicker. He braces for his orgasm, and within seconds, he explodes, sending strand after strand of thick cum splattering on his now very happy trail. Whew. Need we say more?",
  "models": [
    {
      "name": "John Desmond",
      "person_id": 28633
    }
  ],
  "release_date": "2008-04-02",
  "scene_id": 54560,
  "series": "Packin Big Things",
  "tags": [],
  "title": "Packin Big Things"
}