{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Two of the hottest influences in the Caribbean came together to give us Manny, this weeks ExtraBig Dick. Cuban-Puerto Rican, braids, tatts with a lean build make this baby-faced 20 yr. old mad hot! He has a girl he's been with for 3 years now & laughs when he says 'What happens over here ...she don't gotta know!' We bet there's a lot she doesn't know about! He was only 13 when his cherry was plucked by a horny 17yr old girl that taught him the basics. 'You know what they say, 'Once the foam pops--it never stops!'' he laughs. This sexy Latino has been perfecting his game ever since. Manny loves ass & loves when a girl knows how to ride his dick. He loves anal in every position he can get it. He loves an ass that jiggles just right when he hits it; but It can't jiggle all over the place either. He doesn't need to jerk off much because he has a girl to take care of that for him; so we're guessing he doesn't get to jerk off thinking bout his ultimate fantasy of being with 4 girls at once much. Well, lucky for us Manny's going to get the chance to. We're about to see just how Manny makes his thick pinga, go ...'POP!!'White Tee & loose gym shorts are the only things blocking our view of this naturally lean playah. Tatts on each bicep peeking out from each sleeve make you wonder what else waits to be seen. He rubs his abs as he slowly pulls up his tee to reveal rock hard abs. This boy is cut up! He lifts his shirt & playfully asks 'Should I take it off?'--AS IF!? His torso is well defined and as he pulls down his shorts his boxers say it all 'It's all about ME!' Manny is talkative and works the camera telling us everything he wants. How he loves head & how you should be doing more than just watching him. Teasing with the thought of how he'd take your ass --if you can get him hard! Warning you that you're gonna have pain when he hits it from the back in two ways: when he slaps your ass around & when he hauls it out when he's done! Enough talk, Manny ! Get to it!He stands up & gives us a profile shot as he pulls down his boxers. His throbbing cock caught in the waistband as he lowers them. Manny's last words--'Surprise!' seconds before his dick springs free, bouncing proudly in the air. Manny wasn't kidding! He is packing some serious fuckin! Thick, and even thicker in the middle, uncut and with a curve to the left that's sure to hit all sorts of places, Manny has the perfect fuck tool sure to drive all the Latinas nuts! ...and the rest of us too! His crotch is kept buzzed & his smooth nuts are pulled up close as he jacks his fat cock. He licks his fingers adding spit when necessary to his meaty mamba as he strokes. Standing up, sitting down, no matter the angle he's more than an eyeful--and then some! He lays back on the couch to finish off & he begins jackin faster & faster workin up some foam & when it pops it pops, landing on his lickable abs & navel. Just as he's squeezing out the last drops of leche you hear his parting words: 'Don't you wish that was in your mouth, huh?' --Que Puto'",
  "models": [
    {
      "name": "Manny2",
      "person_id": 2
    }
  ],
  "release_date": "2008-02-20",
  "scene_id": 54571,
  "series": "Look Down!",
  "tags": [],
  "title": "Look Down!, Scene #01"
}