{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we brought back three of our faithful alumni and put them together in a room with a tub of lube ...and we're gonna see what happens! We're hoping for an intense, no holes barred, pre-Valentine's Day 'Triple Play!'. 'Big Long Dick' is what BLD stands for, and at a jaw dropping 11.5' he more than lives up to it. BLD appeared early on ExtraBigDicks. With a python like his, it only made sense to have this 30 year-old Miami native back for more. His ultimate fantasy involves Halle Berry, Condoleezza Rice, Monique, and some Mayo! Yeah, you're on your own on that  one! At least we know there would be enough of him to go round!  Speedy, also a local boy, is 21, and was last on EBD in a scorching twosome with Rico late last Summer. His ultimate fantasy involves him as the only male in an Asian orgy. Then, there's the insatiable, uniform loving, Tony Michaels. Tony the 22 year-old Georgia native became an immediate fan favorite with the angelic face and bad boy appeal. Tony lives by the same mantra we do: 'Bigger IS Better!' So, we couldn't think of a better stud to appreciate all the meat we've brought to the table! -- Bib anyone?Sitting between BLD and Speedy, Tony wastes no time, and immediately reaches over and buries his hands in their growing bulges. He massages and strokes their swelling cocks in their pants as they begin to slowly undress. Speedy loses his tank, then so does BLD. After a few minutes of feeling them up, Tony directs them to 'drop trou'. They all start to get up off the couch to get more comfortable; but only two get up! Tony eagerly slips to his knees, and within seconds, has two growing cocks inches from his mouth. Tony licks and teases BLD's python through his boxer briefs while stroking Speedy's growing bone. BLD hauls out his meat, and Tony goes for it while pulling down Speedy's Boxers to get at his as well. Tony is in heaven, taking turns on the two hung studs that by now are rock hard and loving the attention his expert mouth is giving them. They then take it to the couch, as Speedy lays back to give Tony access to his aching cock. On all fours, working Speedy's cock, Tony gives BLD perfect access to his sweet bubble ass. BLD fingers Tony's sweet ass, getting it ready for the fucking of a lifetime! This is gonna be good!BLD fingers Tony's hole as he suits up and begins sliding his meat home. If he had trouble finding the perfect hole, able to handle his monster cock balls deep, he need look no further. Tony takes every thick inch, and in no time BLD is riding his ass hard. Tony grimaces as his ass gets mounted and loves every inch of it. He then switches things up and straddles BLD, impaling himself for more cock while suckin' on Speedy's meat. Tony's facial expressions say it all. 'It hurts SO good!' Tony rides BLD with ease, grinding his smooth ass back onto his massive cock, wanting it deeper and deeper. The look of awe on BLD's face is classic as he holds Tony's waist and bounces him harder and harder on his cock. Speedy strokes his cock watching the action, and once Tony has had his fill, he lays down as BLD and Speedy get into position to give him the loads he's worked for. One by one, they explode all over Tony's defined chest and abs, causing Tony to explode as well! Whew! I guess it's true what they say, 'Two is company and three's just a LOT more fun!'",
  "models": [
    {
      "name": "Speedy",
      "person_id": 27873
    },
    {
      "name": "Tony Michaels",
      "person_id": 27902
    },
    {
      "name": "BLD",
      "person_id": 28568
    }
  ],
  "release_date": "2008-02-13",
  "scene_id": 54574,
  "series": "War Of the Swords",
  "tags": [],
  "title": "War Of the Swords, Scene #02"
}