{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Last we saw, Jay he was poolside in what turned out to be one of our hottest outdoor shoots to date here on ExtraBigDicks. Well, Jay is back! At a striking 6', this Latin 'papi' is quite the charmer. Bedroom brown eyes, cinnamon skin and sexy, full lips make him look like a latin LL Cool Jay. Those lips look even hotter when he flashes his brilliant smile! A smile like that could make any girl's, or guy's, knees buckle! At 19, Jay is a confirmed bachelor & admits he likes it that way. He keeps his x around strictly for 'booty call' purposes & grins as he admits it's a win/win situation. We bet!  Jay has many things he prides himself on; but sexually he admits he's naturally ahead of the pack! 'I last long and I can cum on command!' So basically, he's packing a thick uncut cock and knows how to use it! The fantasy he has yet to try is anal; but when girls take one look at his cock they all say 'No, no, no!' 'I love to stick my thumb in a chick's ass when I fuck her!' he laughs but wait! It gets better--he loves to pull hair too! That gets him off hard! --ANIMAL! This Latin lover knows just how to please! No wonder his x is sticking around! --Thumbs up!Kicking back in a black tee & cargo shorts, the growing boner would be hard to miss. Jay's cock is ready to go! He teases his massive bulge and needs both hands to do it. Pulling off his tee he's left in a sexy tank which doesn't stay on for long as he ditches it & immediately undoes his shorts. His shorts come down far enough for him to haul out his swelling member. The grey briefs strain against the growing cock as he massages & strokes it. His smooth chest is defined as are his shoulders & arms. His cock snakes to the side fighting to break free of is cotton confines. He lies back as the strip tease continues &when he's felt you've been waiting long enough--he hauls out his thick uncut cock & within minutes, strips down to his birthday suit! What a sight! Face down on the black couch he begins a slow dry hump that makes his perfect ass rise & fall giving us a sneak peak at what he looks like doing his thing. Lucky couch!His energy is masculine & extremely sexual. He sits back & legs spread wide, he strokes his rock hard 'pingon'! His heavy nuts, a few shades darker than the rest of his smooth frame bounce between his lickable thighs as he continues stroking. It's obvious he takes care of his body as his defined abs & chiseled chest provide quite the backdrop for the floor show. He then lays back & gets ready to give his meat the release it is looking for. His knob glistens, drenched in precum, as he approaches pay dirt. His heavy nuts no longer bounce as they too begin to pull up tight. There's a Latin Launch a cummin' & it's lookin' like all systems are a GO! Quietly, and without warning, his body tenses as he unloads; sending blast after blast of hot 'leche' splattering across his defined abs & navel. Hmmm Cafe con Leche anyone?",
  "models": [
    {
      "name": "Jay",
      "person_id": 30391
    }
  ],
  "release_date": "2008-02-06",
  "scene_id": 54576,
  "tags": [],
  "title": "Solo Play, Scene #02"
}