{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'When I wake up, in the afternoon ...and at night!' Words to hump by from our returning latin lover, C-Lo. We first brought you C-Lo a couple months ago, and the response to this naturally defined hottie warranted a second helping! This 21 yr old self-confessed horn dog first became curious about sex in Junior High. By the time he was in 9th grade, the rumor mill had bestowed him the nickname 'The Legend!' One look at the thick 8' uncut monster this hottie is packing, and you can easily see why! Piercing brown eyes, clean cut looks, and deliciously full lips are just part of his charm. Luckily for many, this bad boy has trouble resisting sexual advances, isn't shy about doing it in public, and can't seem to say No! --PERFECT! Once he is in it; (no pun intended) he's in it to win it! He loves to be on top, completely dominating a female in the bedroom. He loves to kiss, and making a girl moan turns him on the most! In other news: Backdoor Bingo?! Sadly, his backdoor is EXIT ONLY! Sorry fellas! Well, now that we've learned a bit about the Man and helped dispel some of the Myth, we can move on to the best part ...the Legend!Dressed in an oversized shirt and jeans and looking right at you, C-Lo starts to do his thing. Slowly rubbing his chest and abs, he begins to pull off his shirt, giving you peeks of the rock hard bod beneath. His shirt comes off, leaving him in a white tanktop. His smooth, broad shoulders and biceps are defined. As he sits back and begins groping his growing cock, it's obviously ready for action. Just above his thickening cock is a silver buckle that appropriately reads LEGEND. Gotta love it! The tank comes off, and you see the killer abs and defined chest on this hairless wonderland. You don't see abs like these every day! He undoes his pants, and as he 'drops trou', you see peeks at the monster beneath his boxers and realize that when we said he was a 'hairless' wonderland--we weren't kidding! He teases his buzz cropped cock through his boxers, and you can clearly make out his knob as it gets bigger and bigger! He then moves over to the couch where he lays back and hauls out his growing meat to give it more room! Ready, Set, Lick!Standing on the couch, C-Lo sits on the back of it and spreads wide to show us the Legend in all its glory. Eight inches of thick latin cock with enough foreskin that even at full mast, there's enough to cover the head. He grabs it by the base and shakes it, teasing you with his cock. He licks his sexy lips seconds before sending some much needed spit to help lubricate the throbbing cock down below. Everything he does oozes sex. As he sits back and frees his meat, it bounces on its own--craving more attention! The chair is next, as he kicks back and continues stroking his meat. His hairless balls, the shaved crotch, and that thick uncut cock that naturally curves down hitting all sorts of spots are stimulating. The camera pans up from his swollen meat, over his defined abs and chest, and to that face... as he innocently blows you a kiss! Oh, this player is goood! Moving to the floor for the grand finale, C-Lo begins to stroke his cock faster and faster. The view is amazing as you watch this lean studs muscles flexing as he works himself closer and closer to the inevitable! His abs contract, and his chest tightens as he sends his first blast clear over his shoulder onto the floor. The rest of him splatters across his abs and chest. Whew! With fireworks like those, it's no wonder he's known as 'The Legend!'",
  "models": [
    {
      "name": "C Lo",
      "person_id": 28578
    }
  ],
  "release_date": "2008-01-30",
  "scene_id": 54578,
  "series": "Roughing It",
  "tags": [],
  "title": "Roughing It"
}