{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We met Blake, that delicious UK import with the even more appetizing 8.5' English Sausage, and he told us that one of his ultimate sexual fantasies would be to join in with a couple; so we decided to see what that would look like if that couple was shy one female! It's our fantasy...just go with it! The perfect combination of naughty and nice, it's no wonder CircleJerkBoys chose the sexy Tony Michaels to give 2007 the perfect send off! Angelic-faced, and anything but, this Georgia native with the dreamy eyes and designer fade can't help but grin as he shares his mantra in the sack --'Let it be BIG!'  We knew he'd be perfect for the job! Living in Philly the last four years; Blake's probably had his fill of Cheesesteaks. It's about time we gave this Manshire mate a taste of southern cookin'--Georgia style!! ...though lucky Tony will be the one getting his 'fill' this time! ...Let the filling begin!Wasting no time, these two begin kissing passionately as they grope each other underneath their shirts. Luckily, the shirts aren't on for long, as they lose them while lost in a licking frenzy. The chemistry is apparent, and it seems these two can't get enough of each other. Tony licks and sucks Blake's smooth chest and in the sense of giving, Blake lowers his shorts, hauling out his growing cock. Tony needs no direction, and heads south to show this British bloke's package some Southern hospitality! Stroking, sucking, and licking are all on the menu, as Tony devours Blake's now swollen cock and aching balls. Blake is more than accommodating, getting in several positions to give Tony access. Hands behind his back and straddling Tony's chest, the look on Blake's face says it all as he fucks Tony's hungry throat. Blake's cock is getting a taste, as well as a sweet preview of the next course of country fixins --the main course!Dinner is served as sexy Tony gives it up to Blake's thick cock. Blake's rock hard cock glides in and out of Tony's deliciously smooth, round ass. No matter how hard Blake fucks his hungry ass, Tony's ass fucks back! He bucks back onto Blake, wanting every inch of British beef inside him. The action is erotic and sensual as Tony and Blake kiss tenderly, not missing a beat as they continue their passionate session. It is intense watching Tony's face as he clenches and grimaces from time to time, taking every thick inch of Blake's cock. No pain no gain for this hungry Southerner. He take's it like a man! An overhead shot shows you Blake's view, and it's a good one, as he continues his assault on that perfect bubble butt! The next thing you know, Tony and Blake have kicked it into high gear! Blake sits back against the wall as Tony, leaning back on one hand, jerking off with the other, rides his cock like a hobby horse! As soon as you see these two in this position, you know the shows about to turn explosive! Lying side by side, they stroke one off, spraying themselves with their man juices! These two are plumb tuckered out! ...I guess there's nothing like--a lil 'Southern Hospitality'!",
  "models": [
    {
      "name": "Tony Michaels",
      "person_id": 27902
    },
    {
      "name": "Blake Collier",
      "person_id": 28567
    }
  ],
  "release_date": "2008-01-23",
  "scene_id": 54580,
  "tags": [],
  "title": "Check Mate, Scene #02"
}