{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Victor began and ended his interview with the same proclamation: 'I woke up late today so let's do it.' The 'it' he is referring to is his morning ritual of jacking off before getting out of bed. As long as the 'here' is our own ExtraBigDicks.com studio; his uncharacteristic change in schedule suits us just fine.  When this twenty year old, tall, dark, Venezuelan hottie first unleashed his wrist thick, uncut eight and one half inches of penile perfection attached to a package this disarmingly f-i-n-e, you were clamoring for more, and today you get your wish! 'I have fisted chicks, had my booty licked, and fucked one girl in the ass while I ate the other out' is how Victor described his finest sexual hour. Like many of the Latinos we have met here, Victor is all about the ass, and rather indifferent to the tits. 'Anything more than a mouthful is a waste,' is Victor's take on breasts, but we sure feel differently about his cock. That big leaking pole is more than a mouthful, and we are going to make sure our first man for 2008 is good to his last drop.With his mop of dark curls pulled back in a condition that matches his ball sack, tight, Victor immediately loses his shirt and thrusts his hand into his shorts to give that twitching, fat cock the attention it has been begging for since before he even walked in our door. His smooth chest makes a perfect canvas for that pair of cinnamon colored nips that are just begging to be nibbled on. But the real target for the taste test would be his big balls as they spill out of the legs of his boxers. Victor then stands, lets his shorts drop, and lets his heavy, soft 6 inches plus dangle in the breeze, the head barely visible behind the thick folds of skin, under a bush he has let grow in since last time. Some guys think they need to shave to make their dicks appear bigger, but when you are hung like Victor, the gene pool already gave you everything you need - and what the rest of us want.As he skins back his shaft, the moist pink cock head comes into full view as his cock approaches full mast.  He turns his back to us, showing us one delicious, lightly haired, backside that we did not get to see last time. When Victor flips back around, those eight and one half inches practically knocked the camera right out of our hands.  After making his dick do the 'look ma, no hands ' dance in a performance long enough to for a super-bowl half time show, he grabs onto his cock with both hands, rubbing his shaft and his balls in long, hand over hand strokes, before moving to the floor and firing off a six-blast sperm salute that beat any fireworks we saw on New Year's Eve!",
  "models": [
    {
      "name": "Victor",
      "person_id": 30026
    }
  ],
  "release_date": "2008-01-02",
  "scene_id": 54586,
  "tags": [],
  "title": "Oh Cum All Ye Boners!, Scene #02"
}