{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Being an 18 year old with shoulder length hair framing that handsome Latin face would have been enough. That tight, hairless, smoking body would have been enough. That fat, thick, uncut eight inches would have been enough. Add that all together and you get CJ - this Cuban heart throb. As we saw from his first appearance here at ExtraBigDicks.com, he is someone no one ever gets enough of. He started having sex at 14 and did not start working his own pole until three years later. 'I know 17 is kind of old to just start jacking off, but I had been doing for a few years what everyone else was just whacking themselves silly dreaming about,' he stated. One look at those arms, pumped up from years of football practice and spending every morning in the gym, that narrow waist, those broad shoulders and that meaty ass, and CJ is going to jump to the top of your Christmas list - and one glance at that bulge growing by the second and you will wish he was a top that will jump you for Christmas.CJ stands up and stretches, his shirt lifting to show off those flat abs. As he reaches up to palm those rounded pecs, we noticed something we missed last time: those half dollar sized cinnamon colored nipples that are just like his cock: hard and ready for attention. CJ gives each one a tug before pulling his shirt up over his head, bringing his arms together and flexing those big guns before pulling the rubber band out of his hair and the belt out of his jeans. His pants fall with a thud to the floor which is what your jaw will do when he turns his back to us and slowly lowers his boxers, revealing one perfect ass cheek then the other.  The view just gets more appetizing as he bends over to step out of his shorts, offering us a flash of sack and a wink of his hole.  Taking a seat and spreading his legs, his cock is now at full mast and his cockhead is sticking so far in the air, he could use it to rub his nipples again. But he's staying put where we all wish we were: tightly around the shaft of the eight inch, dripping Cuban cock.As the camera gets in closer, we see one holiday wish has been granted, as unlike last time, he has started to let his pubes grow in. CJ has one of those cocks that even at full mast, his skin is still visible as the head peeks through the folds. CJ brings down his fingertip and works the pre back into it and down the shaft. His cock arcs up and his smooth balls hang low, bouncing in their sack as he works the curved bone before moving to the couch and humping away, his glutes flexing and releasing as that cock leaves a trail as he runs up and down on the fabric underneath him. We told him to make believe there was a female under him, but when you see him fucking away, you will wish it was you below him, on the receiving end of that big, thick, beautiful dick.  On his knees on the floor, hands free, that cock is sticking straight up, like someone put a hood on the Washington Monument and stuck it between his legs. In an instant, those low hanging balls are sucked up and a thick white load is spilled out all over his abs as he works his own sperm back into his skin. Guess it was a White Christmas after all! From CJ and all of us at ExtraBigDicks.com, Happy New Year!",
  "models": [
    {
      "name": "CJ",
      "person_id": 29711
    }
  ],
  "release_date": "2007-12-26",
  "scene_id": 54587,
  "series": "Ring A Ding Ding",
  "tags": [],
  "title": "Ring A Ding Ding, Scene #01"
}