{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Dressed in tank and gym shorts, at first glance Blake seems like your typical guy on his way to the gym - but upon closer examination of the bulge in those shorts, whatever is inside them is definitely anything but standard issue. At 23, this 5'9, cinnamon hottie is relaxed, self-assured and with a remarkably personable sense of humor that just draws you. Infectious as his smile is, it just gets better from there as starts to speak in a deliciously sexy accent that proves to be almost as thick as his cock. Haling from Manchester, this UK treat now calls Philly home and confesses his accent is a bit of an aphrodisiac to the local girls. We're pretty sure it has that effect on more than just 'the local girls'! Blake was a late bloomer, losing his virginity at 19, but has spent the last 4 years making up for lost time. Lucky for us, this boyish Brit isn't shy about much and confesses that one of the top fantasies on his list would be to join in a threesome with a couple. As you will see, he is packing more than enough to go around.Leaning back, Blake wastes no time as he begins to rub his chest under his tank. In seconds, the tank comes off, revealing his smooth chest. Quarter-sized nipples, a few shades darker than his light cocoa complexion, adorn his torso along with a tribal tat on his left bicep. He lies back as he reaches inside his waistband to awaken the giant. Feeling he has too much on, Blake quickly shucks his shorts and gives us a better view of his assets in his form fitting underwear. The size of his growing basket is unmistakable, and the way his underwear hugs his perfectly round arse makes you wish they were on the floor instead. Blake moves over to the couch where he puts on quite the show, face down with his undies pulled down just enough to get a teasing glimpse of that smooth bum as he begins humping away. Slowly gyrating and thrusting into the couch, he gives us a show that would make 'the artist formerly known as' proud! Blake unabashedly gives us a taste of the sensual moves he has in his arsenal! If you never thought you could possibly be envious of a couch ...well --get ready!The show gets to business as Blake flips over and loses his drawers altogether. His cock, semi-erect, comes alive as he strokes it free of its former confines. His short-cropped crown of fur at the base of his growing cock is the only hair around on this smooth, sexy wonderland. Aside from his patch down south, the only other body hair you'll want to lick are the hidden tufts of hair nestled away in his incredibly sexy pits! From sitting down to laying back to standing upright, the views on this import are spectacular. Standing up and bent over, you get a great view at the Brit rump that we're sure many a girl has held onto as he did his thing! His face is serene and focused as he strokes. His bedroom brown eyes and those deliciously full lips make you wonder just what this straight boy's pondering as he strokes his bone. You won't be able to wonder for long as Blake lays on the floor and strokes himself to completion! His heavy breathing serves as the coming attraction to a 4 star release as he sends jet after jet splattering atop his stomach and drowning one very lucky belly button! One thing is for sure, after this mate's performance you will get a renewed appreciation for the Boys on the other side of the pond! Cheers!",
  "models": [
    {
      "name": "Blake Collier",
      "person_id": 28567
    }
  ],
  "release_date": "2008-01-09",
  "scene_id": 54583,
  "series": "Figure Of Sexy",
  "tags": [],
  "title": "Figure Of Sexy"
}