{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'...It was a one time deal!' is how this week's helping describes his first sexual experience while on a train in his early teens. Even then, Luis's eight inch and change pole was already an object of desire. Well, ever since that first random girl who lured him into the bathroom for a quickie, Luis has had plenty of time to perfect his craft. At a lean 5'11', this caf?-au-lait dream is soft spoken and shy. He confesses that one of the fantasies that top his list is definitely an all out orgy where 'anything goes!' So, maybe he's not as shy as he may seem; but there's a visual worth dreaming about! Short cropped hair, mostly smooth face, sexy full lips and bedroom brown eyes are among the many things that catch your eye; but, according to Luis his best feature is his abs! Wonder what those look like all sweaty after the gym! The only thing hotter than that visual would be seeing just what he looks like as he gives himself a 'work out', stroking his meat several times a day! Even though he prefers to do this in his room at home; we've talked Luis into giving us a better idea of what that looks like --up close and personal!Luis wastes little time before starting a game of one man boxer pool, taking turns with each hand rubbing and massaging his cock inside his briefs. He doesn't need much direction as he begins to make himself at home. His shirt comes off, revealing his smooth torso that ends in a faint happy trail that disappears inside his boxers. His small cinnamon nips adorn his smooth pecs, which are defined and make you wonder just how many places your tongue could explore if only he'd let you. He pulls down his pants just far enough to free his balls and stiffening cock. The knob, though still cotton-clad, is so prevalent that you can clearly see it defined through the thin fabric. This cock means business; but it's when he pulls down his boxer briefs that you can truly appreciate his staff! Once his swelling cock has been freed, Luis doesn't waste any time dropping his boxers around his ankles within seconds. Sit back! ...this show's just getting started!Sitting on the bed's edge, legs spread apart; you get a birds-eye view of just what Luis is packing! You no longer have to wonder what it would be like to kneel before this hung hunk for an oral session. He's mesmerizing as he slowly strokes his thick 8.5' baby-maker. His labored breathing creates an erotic soundtrack as you watch him take care of his own needs. The close-ups are incredibly teasing, and the angled views from beneath, looking up at this straight boys rigid cock, are mouth-watering. These views from below are best appreciated once he stands up and strokes, as his meat hovers inches from our lens. Careful not to lick your monitor! Sitting, lying, standing or bent over showing us that incredible ass--Luis doesn't disappoint! As he lays back on the bed for the finale, you get a better appreciation of the abs he loves so much. They begin to flex in time with his breathing that begins to deepen. Just as it becomes a pant--his cup spilleth over! Luis moans softly as his cock throbs, erupting its molten lava as it coats his navel below! Whew! Is it hot in here? After seeing that show, we're hoping we get better dibs than some random girl on a train! '...Please Sir, May we have some more!!'",
  "models": [
    {
      "name": "Luis",
      "person_id": 30181
    }
  ],
  "release_date": "2008-01-16",
  "scene_id": 54581,
  "series": "Strange Bedfellows",
  "tags": [],
  "title": "Strange Bedfellows, Scene #01"
}