{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "What we are most thankful for here at ExtraBigDicks.com is that after three l-o-n-g years, Cooker has returned! We know that nine-inch, cut, pink throbber is as big as ever, that he still has not caught up in size to his dad, and that he is still with the same girl he was when we first saw him. But today we are about to receive the best news flash of all...Cooker is straight, but not narrow: enter Chase.  Chase has the All-American appeal and big, thick inches that Luke loved taking up his ass and a butt that Sean pounded into heaven as well. While Chase's stats, 25, 5'11', 165, 8.5' make for one very pleasing package in their own right, there is one thing in particular that made him especially well suited to taking Cooker on his first voyage to 'Man Land;' Chase has no gag reflex whatsoever. And you will see very soon, with a dick as big as Cooker's, that is exactly what this mission calls for.Like the first holiday gift of the season that cannot wait to be unwrapped, Chase immediately begins getting Cooker undressed, licking Cooker's neck as he explores the territory in his jeans that is soon headed elsewhere. We know Cooker was down for getting a blow job, but were not sure if he would go for receiving a man's lips above the waist. Our fears were short lived as not only did Cooker not pull away, he nuzzled Chase's neck right back before laying back and undoing his own belt to help the process move along. Chase hauled Cooker's half hard cock out of the leg of his shorts before taking it out and stroking it as he made a meal of Cooker's bite sized nips. With just a few pumps, Cooker was at full mast, all nine inches proudly throbbing in Chase's fist as Chase lowered his mouth towards its target. Chase opened his lips and then 'presto change-o, al-lick-a-zam,' like magic, Chase's hot mouth made that whopper disappear along with any doubts Cooker had about what was to happen next: Cooker is about to get the blow job of his life!Moving to the chair, with a look of star-crossed ecstasy on his face and moans so soft they are inaudible coming from his mouth, Cooker plunks his hand on Chase's neck, easing his cock down Chase's throat until that bone is tickling Chase's tonsils as his lips dance on Cooker's short and curlies. Cooker has been in search of successful deep troating for 29 years, and from the look on his face, it has been worth the wait. In a combination of expertise and worship, Chase orally explores every pore of flesh on Cooker's dick, polishing the knob, licking the shaft, sucking on the balls and back again in a rapid succession of events that brought them both to brink of sexual nirvana. Side by side on the floor, Chase gives Cooker's nips a tug, and that is all it took for Cooker to fire a load all over his stomach. Grabbing Chase's nips, and even giving a tug or two on Chase's bone, Cooker returns the favor and Chase explodes with a massive battery of jizz followed by, oh yes, a second cumming from Cooker: after all, if there was ever an occasion where two desserts are welcome, it is Thanksgiving! Happy Turkey Day guys! And not to worry, wait until you see what else we have on the menu with Cooker.",
  "models": [
    {
      "name": "Chase",
      "person_id": 27867
    },
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    }
  ],
  "release_date": "2007-11-21",
  "scene_id": 54599,
  "series": "Secret Admirer",
  "tags": [],
  "title": "Secret Admirer, Scene #01"
}