{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'I LOVE freaky girls,' is how CJ started his interview. 'I will do whatever she wants as long she's hot!' is the bold statement of this 18 year old, Cuban born hottie with shoulder length coal black hair, a hunky body, a handsome face and best of all, eight inches of fat, unit Latin cock that is always ready for action. His eyes are so deep and dark, they seduce you when he locks his gaze on you - which would not be a problem as long as you force yourself to look down and take in everything this stud offers up so willingly. He started playing doctor at 7, officially lost his cherry at 14, and has been fucking non-stop ever since. A lot of guys brag they never jack off because they have a stable of willing partners. When it comes to CJ's case, he is not just being macho; in fact, one of his girls called right during the interview looking for a booty call: sorry sister - he's all ours today. Jacking off is something new for our man CJ, and we can think of no better place for him to practice his new hobby of dick pulling than right here at ExtraBigDicks.com.CJ looks into the camera, brings one arm up to flex his baseball sized biceps, and in the process, pulls the elastic band out of his hair, releasing his dark waves until they cascade across his broad shoulders. He then pulls his shirt back behind his head, exposing a set of round, hairless, pumped pecs over a lean set of solid abs that just beg to be worshiped. He licks his lips, shakes his head, and then grabs a handful of crotch that is packed with the promise of something special underneath. After exploring every inch of his upper body with his hungry hands, CJ pulls out his belt like it's a rip cord, slides down the back of his jeans to reveal one ass cheek, and after giving that cheek a solid slap, he drops his jeans, shimmies out of his boxers, and sets his sites where ours has been all along - on that heavy hanging cock.Pulling one leg up on the cushion, then spreading his thighs wide apart to give his packed sack the room it needs, in less then a minute, a few tugs awaken that sleeping giant. CJ's cock reaches maximum capacity almost instantly. At full mast, CJ's dick is like the rest of him: flawless. Very thick with only a slight taper at end, CJ's fat cock bends a bit due to the width, and the length causes his foreskin to retract back to just under the glans, leaving the tender, pink, pointed head exposed and leaking. Moving to the floor, CJ takes his fingertip to work the precum back into the head before rubbing it into the shaft to use as the ultimate lube for even faster pounding. He swings that dick around like a propeller before mounting the couch and humping away as if he's sticking it to his favorite lover as opposed to just the pillow. The view of those muscular glutes on top, and his long cock leaving a trail of pre below is almost more than we could stand - and apparently, CJ had reached his limit as well. Darting onto his back, CJ begins to hammer away like a man possessed, leaving his abs covered by white ribbons. He told us he has a friend who is packing more than he is. Stay tuned next week guys and see for yourselves!",
  "models": [
    {
      "name": "CJ",
      "person_id": 29711
    }
  ],
  "release_date": "2007-11-29",
  "scene_id": 54595,
  "series": "A Lad & His Lamp",
  "tags": [],
  "title": "A Lad & His Lamp"
}