{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "As much as we miss the parade of hunky bods with their big dicks hanging lose on 'Oz,' we missed our own Dean Winters look-a-like, Drew  and his fat, cut nine inches of heaven even more.  It has been over a year and half since this 22 year old displayed the smooth 6' frame with his lean 170 pounds and that massive throbber by the pool. When he called to let us know he was back from Vegas, the only thing we could say was, 'How fast can you get here?'.  Drew reports that Sin City did live up to its name, especially when he realized one of his fantasies and found himself smack dab in the middle of a three-way, on the receiving end of one big dick while he was filling the guy in front of him with his own palatial penis.  We have seen Drew's ability as a top when he gave Angel's sweet ass a solid stuffing, and as a cocksucker when he lived out everyone's fantasy of swallowing all 9.5' of Nicolay's thick meat. But today we have him where we want him: back in the ExtraBigDicks.com studio. With a five day nut brewing in his balls, he can not wait to bust.Horny as ever - and just the way we like it, Drew was already grabbing at the hungry bulge in his jeans before the camera started to roll.  He stuck one hand under his shirt to give his nips a tug before shucking his shirt, opening his jeans, standing up, and reaching deep enough into his jeans so that a solid flash of his still thick pubes come into view.  Is there something sexy about a naturally smooth, sexy chest that ends in a thick pubic forest?  Hell yes there is, and Drew is the perfect reminder of that fact.  Languishing some further attention to his nips before moving both hands back to the other hard thing - those nine inches trying to break from the confines of his boxers - Drew takes a seat, spreads his legs, and hauls out the fat sausage.  One look at the size of his balls lends credence to his statement he has not shot in a few days, and one glance at those dripping nine inches says he is ready to change the status on his sperm gauge to 'empty.'Holding his cock by the base, the helmet head flares and leaks as he fists the fat shafts with his hand, his cock seeming to grow a little fatter with each stroke.  Staring down at his cock, like he was reliving for the first time the magic sensations a cock this big can given even to its owner, Drew works every inch of his shaft to extract as much pleasure from it as any man ever has.  Laying back, sitting up, down on the floor, bending, even bent over and showing off his ass at the same time, Drew worked his bone from every possible angle and position, holding off shooting as long as he could - while never letting go of that cock.  Finally, leaning back against the couch, he shifts his eyes tightly, curls his toes, and begins to moan as the first two jets fire out of his cock and land on the cushion behind him, while the last three come down for a landing right on his lower abs.  He said that load had been building since before he left Nevada, proving once again that not everything stays in Vegas after all.  ",
  "models": [
    {
      "name": "Drew",
      "person_id": 28600
    }
  ],
  "release_date": "2007-12-05",
  "scene_id": 54593,
  "series": "The Boner Is Back",
  "tags": [],
  "title": "The Boner Is Back"
}