{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It was just a couple of weeks ago that Drew  made his triumphant return to ExtraBigDicks.com just in time for the holidays. And we can think of nine long, fat reasons for the warm welcome you gave him.  We learned then that though he had been gone for a year and half, he surely had not forgotten how to show off each and every one of those nine throbbing inches for the camera. Today, in the gift that keeps on giving, we are going to find out if can work the same kind of magic on Tucker's bum that previously sent Angel  into orbit and back. At 5'6' and 135 pounds of adorable and sexy, Tucker calls himself 'sexual silly putty because I can get into a whole lot of things with the right inspiration.' What motivates this hottie most are bigger guys; at 6'4', 170 and 9' inches of hard cock, they do not get much bigger than Drew. Before the afternoon is over, with a pending invasion by a dick this big, we are going to find our just how much silly putty can stretch.It took Drew all of ten seconds to get Tucker's shirt off and ram his tongue down Tucker's throat as his fingertips tug away on Tucker's hard nipple. Tucker wastes no time in getting Drew shirtless as he nuzzles his way up and down Drew's neck with a technique that had Drew's eyes rolling back in his head and his cock ready to explode out of his shorts. Drew grabs his bulge with a passionate leer as he guides Tucker's head down and undoes his belt and Tucker tugs down the zipper.  Drew's cock is so hard, it is practically bursting though his briefs as Tucker sucks away right through the fabric before Drew stands up, pulls off Tucker's jeans, shucks his underwear, and feeds hungry Tucker all nine inches right down his throat, stopping only a few minutes later to return the favor on Tucker's own party sized, eight inch cock. Flipping Tucker on his stomach, Drew pulls Tucker back for a final taste before letting his fingers do the walking to make a trail where that dick is going next - deep inside the man land of Tucker's trembling hole.Tucker climbs over Drew, rests his pucker on Drew's cockhead and lowers himself in one steady push until all nine inches are buried inside him.  Drew reaches his hands under Tucker's cheeks and uses them like a handle to bounce Tucker up and down, working his cock deeper into that hot ass with each pass.  Keeping himself deeply buried inside Tucker, he pivots on the couch, places Tucker on his back, grabs those ankles to his shoulders, and deeply drills away with such precision that Tucker's cock throbs away on his belly hands free. Bending Tucker over the chair for one anal assault, Tucker then strokes away his aching bone until he douses his abs in a thick white load and Drew leans over him and punctuates the day by giving Tucker a protein facial just in time for those holiday pictures. ",
  "models": [
    {
      "name": "Drew",
      "person_id": 28600
    },
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    }
  ],
  "release_date": "2007-12-19",
  "scene_id": 54590,
  "series": "Double Standard",
  "tags": [],
  "title": "Double Standard"
}