{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'I am sexual - anything comes along that I like, I'll do it' is how 25 year old Joe Strong introduced himself, and that is just the kind of introduction we like here at ExtraBigDicks.com.  We are pretty sure he was not given the name Joe in his native Puerto Rico, and as for 'Strong,' well, strength is what he needs to haul around a slab of meat this big - and strength is what you are going to need when you see it.  An early bloomer in all respects, Joe starting jacking at ten, fucking at twelve and has lived out the orgy, 3-way and 'Mile High Club' experience most guys twice his age are still hoping for. As for the age of question of 'do big dicks run in families,' Joe was also able to corroborate what we already know from Cooker, that the answer is 'Yes.' Having caught his brother rubbing off a load, Joe knows he is not the only giant cock at their family reunions. While his brother was embarrassed when Joe caught him red handed, when Joe was caught, he liked it...and if he likes being watched as he plays with the big dick, he sure came to the right place.Joe's black wifebeater shows off his well-inked bicep as he reaches inside to tug on his nip, leaving the shirt pulled up to just under his pecs, showing off another line of ink, this one disappearing into the waistband of his shorts.  Joe grabs tightly at the big bulge in the center before flexing his big arms as he lets his shorts drop to the floor. His hand goes immediately to his briefs, and he tries to rearrange the hardening cock inside, but that big dick had other ideas. It immediately reacted to the warm touch of his hand by doubling in length, so what else could Joe do other than what we have been waiting for all along, haul out that fat, uncut slab of dick and give it the quality time something this hard, thick and wet deserves.Licking his fingertip and bringing it to his cock head to mix his spit with his precum, Joe delicately touches that belly of the beast before roughly swinging that meat back and forth, side to side, and up and down before moving to the couch and humping away like a man getting his chance at fucking before being shipped off to a deserted island. Harnessing the strength of those rounded, white buns of granite, his biceps tense as he holds his upper body up off the mattress. We were almost in awe as Joe maintained total control over every inch of his body to pound away like a machine designed for the singular purpose of reproduction.  His cock gets fattest half way down the shaft, and we just imagine the stretching it does to whatever hole is lucky enough to be invaded by it. With the cock ring looking more like a tourniquet as his shaft and sack battle to remain under control, Joe relaxes his neck, tightens his grip, and spills out a thick white load that drips down all over his abs and puddles on the floor below. If you do not have the strength you need to make it through the holidays, at least you have Joe Strong! ",
  "models": [
    {
      "name": "Joe Strong",
      "person_id": 28631
    }
  ],
  "release_date": "2007-12-12",
  "scene_id": 54592,
  "series": "No More Waiting",
  "tags": [],
  "title": "No More Waiting"
}