{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "A mixture of Jewish and Korean ancestry makes Curtis one of the most exotic mixes yet to visit ExtraBigDicks.com. He could not wait to get out of his shirts, followed quickly by his jeans, revealing a body just as lean and smooth as we expected. With a knowing glance, a sedate leer, almost a wink without the blink and a smile from a guy who has been up to no good more than just once, he reaches deep into his powder blue briefs, occasionally hauling a piece of flesh above the waistband and then hiding it just as quickly, telling us that what lies beneath is something we might not have expected at all...but something much bigger. Flopping out a heavy, very low hanging sack with a pair of oversized orbs inside, after a few tugs, with a gentle arc and deep golden caramel color from the wet tip to the black of his bush, Curtis shows us a serving of very thick meat that, at 8 1/2 inches, is more than a man-sized meal ready to be served.Moving over to the chair, playing the camera with a grin and that cock with his fist, he holds his cock up against those flat, fat free abs, the head a good inch over his navel and the vein on the underside like a deep channel connecting down to those balls. Standing up, we follow the triangle of hair fanning out from his navel down to a dark bush, straight, silky and lush while his balls, hanging just as loose and even heavier now, swing below like a pair of punching bags going ten rounds with an energetic boxer preparing for a fight. Laying down and spreading his legs, his sack now looking like the overfilled udder of a cow, he grasps his cock and lets it fall, knowing how much the view is one he wants to make sure we appreciate totally unobstructed, and appreciate it you will.His gaze now fixed straight ahead, his inked arm moving faster, his grip on that fat meat tighter, the intensity on his face is that of a man intent on one thing, getting off. It is not until the very last moment, but look at his balls as they quickly rise, like an express elevator going to the top floor in record time, as steady ropes of thick white jizz decorate those dark pubes, his flat abs and the underside of his shaft. Even as he milks out one last serving of cream, that fat cock still shows no signs of deflation. Sometimes what goes up might only cum down, not come down.",
  "models": [
    {
      "name": "Curtis",
      "person_id": 28584
    }
  ],
  "release_date": "2006-07-19",
  "scene_id": 54598,
  "series": "Papi Leche",
  "tags": [],
  "title": "Papi Leche"
}