{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "C-Lo first explained the origins of his name by offering off that he is the strong but silent type; and therefore, they call him C-Lo because of his low-profile. But when we dug a little deeper, after all, this is ExtaBigDicks.com, C-Lo admitted he really got his name because his fat, uncut, milky white eight inches hangs mighty low even when he is soft - which we also quickly learned is a state his dick is not often in. This 21 year old Honduran import has that kind of quiet game that simmers just under the surface and does not take long to reach a full boil. From the minute he walked in the door, C-Lo kept tugging at the bulge in his jeans, which was growing bigger and bigger by the minute. Before he even finished filling out his paperwork, he told us he had not shot his load in three days and he could not wait to empty to balls. All we could do was second the motion and happily let the games begin.C-Lo grabs a handful of the cargo in his pants, like a preview of cumming attractions, as he raises his shirt, showing off his smooth mocha skin. His jeans ride low on his slim hips, the line of his obliques naturally drawing our eyes to the center, just above the waistband where the upper curls of his dark bush snake over the top. Steeping out of his pants, even in his black boxers, from the heavy hanging prize flopping around so clearly visible inside, it was also just as obvious whoever first called him \\'C-Lo,\\' must have already seen what was inside. Fortunately, we were soon members of that club - club and member both being the operative words!Like a proud Poppa about to show off his baby for the first time, C-Lo ceremoniously slides his thumbs into his boxers and slides them down, revealing a semi-soft cock that is already a good five inches. With a few slaps into his palm, it grows another three inches in just a few seconds. Dark and fat and with a dangerous looking curve, his cock is thickest in the middle, then tapers slightly to an oversized head that is baby pink when he slides the skin back. C-Lo gives us ample time to get up close and personal with that great slab of meat, hanging so heavy, it makes your mouth water as he strokes so freely and generously, taking as much time as his rapidly contracting balls will allow.  His biceps flex as he starts stroking overtime, his cock seems to get an inch longer and fatter as he spills three days worth of pent up jizz all over his crotch - proving that that \\'lo\\' in C-Lo sure does not describe his sperm count!   ",
  "models": [
    {
      "name": "C Lo",
      "person_id": 28578
    }
  ],
  "release_date": "2007-10-31",
  "scene_id": 54605,
  "series": "The Mighty C",
  "tags": [],
  "title": "The Mighty C"
}