{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Right after tossing his beret in air and leaving Minneapolis, Chase dropped his pants for our cameras two days later, putting that beautiful, thick, pink cut almost 9' pole on display at ExtraBigDicks.com. This inked, sexy hottie has a things for twinks, and the way he pounded sexy Luke's tender hole a few weeks ago, giving that beautiful guy's hole the big meat it craves, we learned that he is indeed a man who walks his talk. Sean is a twenty year old New York born little cutie who came out at 18, started doing porn at 19, and like his co-star, has a thing for the smooth and tender. Fortunately, they do not get much smoother than our man Chase. On the twink-o-meter, Sean scores pretty high. Doing the math, this sounds like just the right formula for an equation of the most sexual kind. Chase says when the time is right, he enjoys a good anal probing. And one look at the bulge in Sean's shorts said that time is right now.They start off with the beautiful vision of two young faces sharing deep, passion filled kisses, stopping only long enough to remove their shirts. They resume, facing each other on the bed, rubbing their bulges together, running their tongues from each other's mouths to each other's nips. Chase let his hands do the walking, lowering Sean's pants and hauling out Sean's thick, fat, eight incher out of his underwear. Grabbing Sean's fat pole by the base. Chase eagerly licks every inch of that meat, taking it down to the short and curlies, with that lust filled anticipation that only happens when you know exactly where that cock is going next - and you can not wait. Chases own cock is even a better barometer of how he is feeling and Sean does his best to return the favor. But Chase's hole has other ideas, and Sean is ready to try one on for size.Moving to the chair, Chase straddles Sean, centering his hole right over the spear shaped tip. He lowers his body down in a single, hungry push until Sean's balls brush Chase's cheeks as Sean grabs a hole of Chase's cock, using it like a handle to guide Chase up and down just as fast - and as slow - as his cock needed. Putting Chase on his back, Sean once again feeds Chase's hungry hole with all eight, plump inches, varying the tempo but never wavering in intensity. Both of them have reached that sexual nirvana where the sensations are so powerful, so toe-curling and mind blowing, they both seem lost in an out of body experience while at the same time, being as intimately connected as two men can get. Getting on all fours, Chase moves back as Sean presses forward, each slam working Sean's cock in deeper, faster and harder. Lying side by side and fisting away furiously, Chase sends a load careening all over his stomach and soon after, Sean aims and fires all over Chase's thigh. Looking into the camera a few moments later, Sean says 'Now that is the best thing ever' and damn, we could not agree more.",
  "models": [
    {
      "name": "Chase",
      "person_id": 27867
    },
    {
      "name": "Sean",
      "person_id": 27941
    }
  ],
  "release_date": "2007-10-24",
  "scene_id": 54608,
  "series": "The Hard Part",
  "tags": [],
  "title": "The Hard Part"
}