{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'I just thought it was normal,' Cooker explains, referring to his legendary 9 inch plus pole, 'until this girl called me 'freak show', then I knew it must be bigger than I thought.'  You can not blame the poor guy, the only other dicks Cooker had seen before then were his brother's, which is about the same size as his, and his father's, which Cooker describes as 'the biggest fucking thing I have ever seen!' It has been three long years since we last saw Cooker, and while absence does indeed make the heart grow fonder, damn if it does not make the 'hard' grow bigger too, as Cooker's cock looks even bigger than we remember. A classically trained chef, hence the name, Cooker had been working in a restaurant in Philly the past few years before a better gig brought him again to Florida. He gave us a call and wondered if we remembered him. We all know this smooth operator with a fat, thick, white, cut, nine inch plus bonanza of a cock that wet dreams are made of is truly unforgettable - though we jumped at the chance to serve up a fresh reminder that cocks may be cocks, but Cooker's puts the 'extra' right where it belongs; in ExtraBigDicks.com.Though we ordinarily say unwrapping the package is half the fun, when the package is as big as Cooker's nine inches of heaven, the fact that he had his belt undone, his zipper down, and his hand digging deep inside the promised land of his boxers within the first ten seconds worked just fine for us.  Cooker gives us the patented 'aww shucks, this ain't nothing special' grin mixed with that knowing 'I know you want what's in my hands' look in his eye that still makes us melt like it did when we first saw him working that dick of dicks. We know what's flopping around inside, making that tent inside his grey shirts bulge obscenely. Just when we think we can not wait one more second to see it again, Cooker flops out seven soft inches of shaft, twin low-hanging fun bags and gets on with getting off.Sitting back, Cooker spreads his legs wide on the couch. His oversized sack rests on the cushion below as that shaft, all rock hard nine inches of it, points directly at the ceiling. The precum starts to drip down his abs and collect a couple of inches below in his navel.  With one fist firmly on the base, twisting clockwise, and the other hand on the head, twisting in the opposite direction - and of course, a few inches of exposed tender flesh in the middle, Cooker's whooper gets the two handed treatment a cock like this demands. Lying back, Cooker locks his grip on the head once again, locks his eye with the camera, and soon frosts his abs with his second load in so many hours.  As great as it was to see Cooker again and watch him work that cock we all love so much, there is one thing that will be even better. Come back next week and see what happens when, for the very first time, Cooker ain't cooking alone!",
  "models": [
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    }
  ],
  "release_date": "2007-11-14",
  "scene_id": 54601,
  "series": "Long Order",
  "tags": [],
  "title": "Long Order, Scene #01"
}