{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Ralphy has a smile as big as they come, a waist most of us have not seen since junior high, and a dick as big as the state of Georgia.  If you think they only grow 'em big in Texas, you have not seen what Ralphy is packing.  This 24 year old puts the 'hot' in Hotlanta: that is, if you call 24 year olds with 9.5' of thick cocoa cock hot.  'I like a woman who licks my inner thigh - I can even have an orgasm when they do it right' he told us.  At first we thought that was strange, but as soon as he dropped his pants and we saw that thick, uncut beauty of a cock that hangs well below his inner thigh, suddenly, that all made sense.  'I will stick it wherever it will fit,' Ralphy went on to say.  Considering that totally soft, he is bigger than many guys are when they are hard, we are not sure how often he finds ladies who can accommodate that massive dick, but here at ExtraBigDicks.com, he fits in just fine.Ralphy's shaved head foreshadows what his body looks like; marble smooth and caf? au lait in color.  With just 163 pounds on his 6'3' frame, Ralphy proves you do not need much meat on your bones when your main bone is that meaty.  He said he was a very sexual person and considering he had his shirt off and zipper down in less then thirty seconds, Ralphy walks his talk right from Jump Street.  Playing the game of sexual peek-a-boo like a master, he hauls his balls out of his fly, showing off those egg sized baby makers in their smooth sack.  As Ralphy casually adjusts and readjusts his cock, we catch a glimpse that while still limp, his cock head is already up to his belly button - and it does not stay soft for long.  Looking like one of those snakes that explodes out of a jar of trick candy, with a couple of tugs, that cock reaches nine inches plus. But do not look for that hard head as it peeks out of the crown of skin around his navel...look down at his knees, as that is where you will find it.Sliding his hand up and down in a steady, well practiced essay of self-love, the luscious folds of skin cover the head on the way up and expose the leaking, baby pink helmet on the way down.  Under his short cropped dark curls, that shaft is thick as a flashlight and leaking like a faucet.  Ralphy has reinvented one handed stroking, letting his fingers down the shaft and past his balls to pay close attention to the ''taint' - that sensitive hot bed of pleasure that ain't his balls, and ain't his hole.  As he stands up, we can see just how bloated his sack is, and that his shaft is every bit as wide.   Falling back on the couch, his causal stroking has become an intense hammering away.  Toes curling, lip quivering, and his abs coiled and ready, Ralphy covers his belly with a heavy load of jizz.   We learned something today guys, they do not just grow 'em big in Texas, and if the lights ever go out in Georgia again, we hope we are caught in the dark with this guy.",
  "models": [
    {
      "name": "Ralphy",
      "person_id": 28686
    }
  ],
  "release_date": "2007-11-07",
  "scene_id": 54603,
  "tags": [],
  "title": "Ralphy's Rollout, Scene #01"
}