{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Chase and Luke give new meaning to 'it takes two, baby' at ExtraBigDicks.com today, though before it is over, Luke will be taking nine--nine inches of Chase's cock right up his ass that is--but we are getting ahead of ourselves. Born in the Twin Cities, it took all of two days for Chase  to find our studio after arriving in Florida and leave us with a big load from his even bigger cock as a souvenir. Fellow Midwesterner, Luke, also shares two as a lucky number. While he waited for eighteen years to come out, within two months of bursting out of the closet, he burst onto the gay porn scene with his fine, smooth body and an ass that wet dreams are made of being just two of the many qualifications he brings along with him. We already knew that Chase loves him some twinks and Luke loves to get fucked and the bigger the dick the better. Luke is a twink, Chase is hung--sounds like a match made in heaven. And after Luke sees the size of Chase's schlong, this is one time heaven cannot wait, and neither can Luke.After a few tender kisses, Chase immediately starts nibbling up and down Luke's smooth tanned abs before getting Luke's legs out of his pants. Then, Luke's cock comes out of his tight, black briefs and into Chase's hungry, wet mouth. Licking Luke's balls, then up over the shaft, Luke's cock thickens, lengthens, and eagerly returns to Chase's mouth before Luke sets his eye on the considerable prize in Chase's briefs. Luke nurses on Chase's cock like it is an appetizer he does not want to fill up on--he knows his ass is the main course of this meal and that seems to be exactly the menu they both have in mind. As Luke stands on the chair and straddles Chase and feeds Chase his cock, Chase's own cock has now grown to epic proportions as he happily primes that big pipe for its next move. Moving to the bed, Luke resumes his oral examination of Chase's cock as Chase reaches down and begins to slide his fingers where his cock is going next--right up Luke's quivering hole.Chase's lubed cock is so rock hard and so damn big as he slides that mammoth pole slowly and steadily into Luke's hole with a single, controlled, deliberate push. It looks like a 747 entering an airplane hanger. Luke's hole is soon sporting Chase's balls as ear muffs as Chase makes it all the way inside, and Luke delightfully pushes back to make sure every millimeter of that big meat is right where they both want it--in deep. Chase gets behind Luke, and after a few minutes of jack rabbit fucking, he flips Luke onto his back, pushes Luke's knees back to his chest and rides that hole until Luke spills his load over his abs before Chase adds a second sperm deposit of his own--after all, the best part of a twinkie is the cream filling!",
  "models": [
    {
      "name": "Luke Riley",
      "person_id": 27859
    },
    {
      "name": "Chase",
      "person_id": 27867
    }
  ],
  "release_date": "2007-09-26",
  "scene_id": 54615,
  "tags": [],
  "title": "Cock Sliding, Scene #01"
}