{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It would take an extra big dick not to be dwarfed by Shay's 6'6' frame, and fortunately the nine-inch chocolate slab between Shay's thighs fits the bill--and just about anywhere it wants to go--quite nicely. Here at ExtraBigDicks.com, our motto is 'bigger isn't just better, it's everything,' but Shay has a different spin on being so well-hung: 'more is better than less, and I've got more--M-O-R-E' he told us with a matter-of-fact chuckle brimming over with innuendo, but totally lacking in conceit. When you are as well-hung as our man Shay, there is no reason to brag--his partners do plenty of that for themselves. As you will soon see, they have plenty to crow about.Towering back against the wall like the tallest Black Walnut tree in the forest, Shay shows off his smooth lean abs as he lifts his shirt with one hand and then, with the other, darts right into the tent in his jeans that seems to be getting bigger and bigger by the second. He continues to work his pecs and rubs his entire upper body in a slow, methodical, torturously sexy exploration before shucking his polo and grabbing a bottle of oil. Bead by bead, the oil shines his torso until it gleams like freshly hewn marble before the fluid collects in the center and begins to make the journey south. Opening his jeans, Shay hauls out a massive dark pipe of thick chocolate meat that is bordering on seven inches while still being soft. You better look quickly, though--it will not be soft for long. With his shiny pate and oiled body, Shay gleams like a Nubian War G-d, his weapon at the ready. Under a lush, dark, expansive array of black curls, that now throbbing pole is nine inches of wonder with a plump, pink business end that is already dripping precum. As he turns around, bends over, and spreads his feet apart, his gargantuan balls hang down like two cocoa balloons, while his shaft sways in front like a skyscraper's flag pole dancing in the breeze. With his mouth contorted in waves of pleasure, he stretches his sack with one hand while his other furiously pounds away at that beckoning shaft. Tugging on his nipple as if it is the on/off switch to his balls, one final twist and those abs are soon covered with four rapid fire splats of sap.",
  "models": [
    {
      "name": "Shay",
      "person_id": 27860
    }
  ],
  "release_date": "2007-10-10",
  "scene_id": 54611,
  "series": "A Long Way Down",
  "tags": [],
  "title": "A Long Way Down, Scene #01"
}