{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Jay is the original strong and silent type. From the first time you saw his eight inch, uncut beauty of a cock and learned it was just as hot, tempting and irresistible as the rest of him, all you wanted is more. The only thing Jay loves more than some time on the courts is a woman's ass. We passed on the female butt but jumped at the chance to film Jay playing basketball only our cameras did not stop at the locker room door, but followed him as he took off his uniform and got down to the business on working out a post game load. Between that brooding face, the begging to be touched body of a natural athlete, and that fucking perfect, mouth watering unclipped bonanza of a cock, Jay is just too hot to be indoors without setting off the smoke alarm. So today, we are heading to the great outdoors. 'I have never jacked off outside - but there's always a first time, right?' Jay said as we headed towards the pool. There are actually a lot of things we would not mind seeing Jay do for the first time. Rubbing off one of his massive loads while beads of pool water drizzle down his body like icing under the unbridled noon day sun is one we can cross off the list today.His arms looked more pumped than last time we saw him, and from the bulge in his shorts from jump street, so is his cock. Jay is having a hard time taking his hand away from the trouser tent long enough to strip off his shirt, but finally forces himself to break free and get more comfortable. His muscular chest gleams like a cr?me de caramel under the sun rays, and thankfully, his belt and khakis soon join his tank top in a pile next to his feet. There's something big and heavy in those grey boxers. The fabric clings to the precious cargo inside like a second skin. Walking to the other end of the pool, Jay slips out of his boxers, showing off the f-i-n-e fine curves of one of the most perfect asses on the planet, before stepping under the out door shower to cool down. From the appearance of his cock when he turns out - bloated, and throbbing - rather than cooling him down, it heated him up, and suddenly we were the ones that needed a cold shower.As Jay dives into the pool, the water can not conceal each muscular globe of that ass as he swims to the other end before getting out and settling into the lounge chair on the deck. Grabbing the oil, he greases his upper body before turning his attention to where ours has been since the moment he walked in the door: his eight inches of meat. As if to prolong our agony a few moments more - Jay turns around once again and bastes his own backside with lotion before rolling over and letting that now fully hard and throbbing cock land with a thud against his smooth, sweaty abs. Slinging one arm back behind his head, the vein running across his bicep is popping out prominently, matching the now bloated vein on the underside of his cock as he fists away, legs spread wide, and eyes closed tightly. Rising like a skyscraper against the horizon, his cock is as hard, as thick, and as long as we have ever seen it. It casts a giant shadow as he walks over and takes a seat on edge of the pool while edging back a load that has his sack coiled into two overly filled orbs in desperate need to release their pressure. As always, without saying a word, Jay fires off his first splat of sperm which lands just below his nipple, then covers his stomach in three more heavy, white blasts.",
  "models": [
    {
      "name": "Jay",
      "person_id": 30391
    }
  ],
  "release_date": "2007-10-17",
  "scene_id": 54610,
  "series": "Cock Frenzy",
  "tags": [],
  "title": "Cock Frenzy, Scene #02"
}