{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Victor is a Venezuelan serving of prime beef without an ounce of shame, but with just the kind of cock we love here at ExtraBigDicks.com--eight and a half inches of uncut, battle-ready dick meat that is never happier than when it is on display. 'I had sex at the Air and Sea show with about 50 people watching,' Victor tells us with not so much as a blush. Victor started jacking at 11, fucking at 13 and has not stopped since. A self-professed ass man, Victor resists the urge to get tied down. 'Who needs the drama of a girlfriend--all I need is her twat,' is how he puts it. His olive skin and dark head of curls frame a face that is a thing of beauty, and the 6'1' solid frame ain't too shabby either. Since it has been seven years since a 19-year-old took his cherry, if his dick was big enough for her then, we cannot wait to see it now.Victor removes his t-shirt and then his tank, showing off that baby-smooth chest as his eyes stay on the porn and his hands stay right where they belong--on his cock. The well-defined angles of his obliques form a trail to take your eye to the thick dark curly patch he teases us with, pulling his shorts and jeans down low to let the top of his shaft peek out as well. This is all within the first 30 seconds. Stopping only to flash a smile that is nothing short of dazzling, he settles into the couch and spreads his legs wide to offer his hand easy access to that heavy-hanging lump of heaven making a tent in his boxers. He offers up a quick peek of the head through the leg opening before hoisting that bad boy out of the fly and putting it where it belongs: front & center and so close that you can almost taste it.With no agenda other than the enjoyment of his big dick, and relishing the chance to show off his favorite toy, Victor slowly rubs his fist up and down the shaft from the base to the tip, bringing with him a copious hood of skin that he expertly employs in the most erotic game of hide & seek with his cock head ever. As he stands, we see his plum-size balls hang low in the middle of his hair-dusted, beefy thighs. When he bends over, the view almost takes your breath away. Twin globes, perfectly curved, with a dark hole in the middle almost steal the scene until that big cock, now visibly throbbing, plops back into view. When he makes that meat dance by itself, it is almost too much not to unzip right there and join him. But he is clearly in the zone of a man and his bone, and we are just glad to be along for the ride. Victor squeezes out a thick, heavy load that lands on his abs before beginning a downward journey and soaking the hair on his balls. Victor definitively ignites the travel bug in us and, we're not sure about you guys, but all of a sudden Venezuela moved up about 8.5 notches on the places to go and dicks to check out list. Hasta Luego!",
  "models": [
    {
      "name": "Victor",
      "person_id": 30026
    }
  ],
  "release_date": "2007-09-19",
  "scene_id": 54617,
  "series": "Bad Rep",
  "tags": [],
  "title": "Bad Rep, Scene #01"
}