{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "You just cannot get enough of a good thing, especially when it involves a muscled, smooth body, a horny 28-year-old with an accent as thick as his dick--and oh yes, eight inches of prime meat ready to make its encore. It was a couple of months ago that Gabriel first let it all hang out  and we could not wait until he returned stateside to get that perfect body and heavy, uncut, girthy slab of beef back in the studio. Gabriel has a soft spoken, gentle demeanor when he's dressed, but as soon as his clothes start coming off, he turns from the Clark Kent of Budapest to the sexual superhero that emmerges. Instead of a red cape, Gabriel is wearing a scarlet jock, and within the first 30 seconds of filming, his shirt is off, his pants are down, and the red pouch is showing the signs of life that really belong in an x-rated centerfold, not a comic book. After all, men this hot are no laughing matter!In the middle of his handsome face, those piercing, soulful eyes seem like they are trying to tell you something. But as you scan down that powerful body - even leaner and more defined than last time - once your gaze hits the waistband of his jock, you will only be wondering what is inside that pouch, not what is on his mind. He tugs the band low, revealing the perfectly etched contours of his obliques before turning around and flashing the rounded white globes of his perfect bubble butt. When he moves to the bed, he sprawls out, spreads wide, and rubs that bulge with a 'come hither' look that will leave you weak in the knees. In the perfect passive-aggressive power play, only when he is sure you are ready to pounce on the bed and rip off that strap does he wait one more minute, then slides the waistband down. That heavy, hooded sausage tumbles out and throbs on his flat abs. His sack is already coiled into a tight little ball and his shaft is so filled with blood that it has thickened into a jaw-breaking, ass-filling pipe of dick meat. Standing up on the bed, his shaft shows a sharp arc that features an almost 45 degree turn so that the head is actually pointing at the wall. We can only imagine what a bend like that does when he is hammering that home in a hole that will never be quite the same once he has finished with it. He is now so hard that his foreskin has retracted back, and that tapered, pink business end is exposed and leaking a steady stream of precum. He looks like a Greek statute as he stands. His face contorts in the final moments where the agony of holding back his load gives way to ecstasy as he pumps out dollop after dollop of jizz. He tells us that it sure made him work up an appetite and come to think of it, he has had the same effect on us. Suddenly, we are in mood for something HUNGarian - how `bout you?",
  "models": [
    {
      "name": "Gabriel",
      "person_id": 29842
    }
  ],
  "release_date": "2007-10-03",
  "scene_id": 54613,
  "series": "Bend It Like Gabriel",
  "tags": [],
  "title": "Bend It Like Gabriel"
}