{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Chase is a 25 year old who, within 48 hours of arriving in Florida, arrived at the ExtraBigDicks.com studio. As soon as we saw that nine inch plus, wrist thick slab of cock between we legs, the only thing we could say is, 'What took him so long?'. Chase told us with a smile, while patting the lump in his jeans that was already growing restless to come out and play, 'If the guy is bigger than me, I bottom, but if I am bigger, I am the top - which means I am almost always the top.' Chase is a guy who loves sex, jacks off at least twice a day if not more, and loves to be watched. This is most definitely the right guy in the right place, and as for the right time to get the show started, that began the second he walked in the door.Chase already has his belt undone and his jeans open as he tosses off his shirt. He seemed lost in a dream-like state as his hand slide inch by inch past the ink on both of his pecs, down the center of his abs, and finally into his pants. Working his jeans off, he sprawled back on the couch, spreading his legs wide as his cock spread the fabric of his briefs to their breaking point. He pulls the waistband down under his big, oversized nuts as he slowly tugs at his shaft, making it get longer and fatter with each move until his cock first points up at the roof, then flops down between his legs, the big head leaving a half dollar size dollop on the cushion like a deposit on a bigger pay day yet to cum. When guys are this tall, a small cock looks puny, and an average cock looks small. But fully hard and hanging heavy, Chase's big bone is a thing of beauty that towers over us as he stands and jacks away. The outline of his cock is almost as exquisite as the profile of his handsome face: this is one young man who is f-i-n-e fine from head to toe, and especially that big pole in the middle. Falling back on the chair and grabbing his balls as if to keep them from exploding as long as possible, Chase hammers away at his pole double time, breathing heavy with moans so deep, they are barely audible. When his resolve finally gives way to the need to bust his nut, he fires a load that actually lands on the wall behind him with one final splat finding a home just under his right nipple. We are already making plans to have Chase back, so do not go too far guys...just wait till you see him in action!",
  "models": [
    {
      "name": "Chase",
      "person_id": 27867
    }
  ],
  "release_date": "2007-09-05",
  "scene_id": 54620,
  "tags": [],
  "title": "The Trouble With Stroking, Scene #02"
}