{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Porn star names are a lot like the actors themselves: often they look better on a marquee than they do close up. But of course, there are exceptions to that, and few of them are as aptly named as Brad Star. From that magazine cover face that is a masterpiece of angelically-wrapped bad boy, to that nine-and-one-half-inch legendary dick that sets the bar by which an entire generation measures a big dick against, Brad Star is one heavenly creature from head to toe, and especially in between. Bursting onto the scene just a couple of years ago, this gay-for-pay, ex-navy heartbreaker made a string of mega-hit movies before dropping out of site. Today not only marks Brad Star's ExtraBigDicks.com debut, but also his return back to camera after taking the last year off.  Brad's recent rest meant he walked into our studio looking finer than ever, extremely relaxed and most important of all, more than ready to get that famous nine-inch-plus pole back where it belongs--in the spotlight.Brad looks right into the lens with that shit-eating grin and flashes us those devilish eyes beneath that mop of tousled, bed-head, brown hair.  He makes short history of his shirt and immediately settles back on the couch, pauses just briefly enough to offer up a fleeting glance of that 'lost in dreamland' look before his hand immediately darts beneath the waistband. We can clearly see that while Brad may have been absent from the new release shelf of your video store for the last year, he did not take a break from the gym: his body is leaner and more defined than ever, proving you can sometimes improve on perfection after all. As Brad opens his shorts, the twin tattoos on either side of his navel make their much anticipated return under the studio lights and, having gone commando, so does his cock. In just a few tugs, it becomes clear, no matter how long he has been away, Brad's star is rising again!With that massive pole in the front, as Brad stands with his back to us, we forget just how creamy white, perfectly tight and flawlessly rounded his backside is. As we are treated to those luscious cheeks in motion as he humps away at the couch, his legs spread wide enough so we get a clear view of a sight very seldom seen: that fur-lined no-man's-land of his hole.  Brad stays bent over, presenting a view that is destined to be preserved in the fantasy files forever: following the view down across his cheeks, his bloated ball sack fills the space underneath and, hanging down behind it all, that heavy, hungry cock. Brad's fingers give his own ass a fly-over that sends out a shockwave to the front: all 9.5 inches are now fully charged and beginning to leak. With one hand at the base and the other just under the head, Brad uses his patented 'taffy pull' technique of his cock, each tug leaving the shaft thicker and longer, until the top of the head seems to be somewhere between his nips and his chin.  With his eyes shut tightly and his toes curled, Brad becomes a shooting star, spilling his milky way all over his pecs and abs. Brad Star's star power is his staying power, and he promises to let it shine again just for us --so keep looking up, guys!",
  "models": [
    {
      "name": "Brad Star",
      "person_id": 28570
    }
  ],
  "release_date": "2007-08-15",
  "scene_id": 54627,
  "series": "Star's Comet",
  "tags": [],
  "title": "Star's Comet, Scene #01"
}