{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Robert Long has acquired a cult following all of his own, and his fans are no stranger to this 19 year olds 8.5' thick uncut slab of beef fueled by hormones that demand release and will not let a little thing like a wedding ring get in the way. Despite having a horny new wife at home, Robert found himself here at ExtraBigDicks.com on the receiving end of the oral mastery of Yankee. That held him off for a while, but then he came a-knocking at our door again, this time upping the ante by fucking the hell out of sexy Eli. Needing to get off whenever and however, to find someone as horny as he is, we only needed to look to CircleJerkBoys.com for soccer star heart throb Antonio. We last saw Antonio when he was getting his birthday present in the form of ramming his big club of a cock up Speedy's hairy hole and knew he was ready to go round for round for the only guy who is as perpetually horny as he is: Robert. 'I think you should let us do what we do best.' Antonio offered up after seeing the equipment Robert was packing. That was exactly the plan we had, too.In less than thirty seconds, Antonio was already digging inside his shorts; Robert had lost his wife beater and his jeans. Antonio showed off that fine, muscled, tanned form of the college athlete he is, but it was the rock star, world class ass that commanded Robert's attention. Robert pulled off his underwear, pushed Antonio to his knees, and proceeded with a skull fucking that started standing up and ended lying down on the bed. Using Antonio's Tarzan mane of hair like a handle, Robert put every inch down Antonio's hungry throat while fingering the furry hole that was his next destination.Grabbing Antonio's ankles and spreading his legs wide, Robert pressed the thick blunt end of his cock at Antonio's backdoor, and with one steadily, merciless push, did not stop until his balls were pressing against Antonio's ass cheeks. With his knees smashed up against his pecs, Antonio took the pounding with the clenched teeth of a man who was reeling with the pleasure and pain of a big dick drilling deep inside. Robert moved Antonio on all fours and resumed ramming speed, slamming his hips forward as Antonio pushed, matching each thrust with a lusty hunger mixed with primal desire. The longer the fucking went on, the longer Antonio's cock got until he finally rose on his knees and fired off a load that shot across the room, landing well behind the camera as Robert's load covered, then dripped off Antonio's back immediately after. As to who was hornier that day, it's difficult to say for sure: we need a rematch to tell for certain. We will keep you posted.",
  "models": [
    {
      "name": "Antonio Farias",
      "person_id": 28558
    },
    {
      "name": "Robert Long",
      "person_id": 28696
    }
  ],
  "release_date": "2007-08-29",
  "scene_id": 54622,
  "series": "All The Way In",
  "tags": [],
  "title": "All The Way In"
}