{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "24 year-old Nathan, with that mop of hair brushing his shoulders, a smile that goes from ear to ear, and the pale skin of a night owl, looks like your typical Midwestern guy who heads to the West coast to try and break into the music scene.  At 6'1' and weighing in at a buck sixty-five, Nathan looks like you could pick him up and snap him in half. But despite the teeny bopper appearance from the neck up, from the collar down, Nathan is all man. Starting with an unexpected blanket of fur on his chest, impossibly lean abs with a dark trail in the middle, and the real reason we are gathered here today, a fat, cut nine inch slab of thick meat, Nathan has a body he has been dying to show off. 'I thought every girl just told their boyfriends that they have a big dick,' he told us during his interview. 'But it didn't take me long to figure out that with me, they were telling the truth.' Slipping on a jacket and leaning against the wall, Nathan goes from would-be pop star to a sexual savant as he lifts his shirt and looks right into the lens like he has been waiting for this chance to show off ever since his pubes sprouted. He gets rid of his shirt and hooks his thumbs in his belt loops to pull them down to show off the dark swirls of his trimmed bush while tucking his fingers deeply into his buckle to show off that his best assets have yet to be revealed. Prying each button of his fly open one by one, the heaviness of his cock causes a bit of the shaft to peek through the slit in the from of his boxers until he finally hauls it over the waistband, the head of that very hard shaft extending a good two inches plus above his navel. The only things in the room that is heavier than that fucking slab of dick are the moans coming out of his mouth. His cock is now so hard he can barely get his boxers off, and when we finally get a look at him totally naked, that flashlight-thick cock sticking out so far in front of him, we are doing some heavy breathing of our own.He tucks one arm back behind his head as he lies down on the bed, pulling one leg up and out wide at the same time. All it takes is one look at the tight hairy hole and we want to grab that fat cock of his and use it like a handle to pull his ass right onto one of our dicks --but we keep a professional distance. After all, the view of him working a pole that is dancing and dripping in his hands is not a bad consolation prize. It is almost like Nathan woke up this morning and looked down to find his cock had doubled in size and is still enjoying the self-discovery of learning what to do with something this big. When he rolls over and starts fucking his fist and never loses his grip, even as he rolls over and hammers away at the mattress underneath, we know this is no amateur act. More than anyone else, he knows how to work every possible ounce of pleasure out of his cock. And while this may be his first time being watched, we are sure it will not be his last. With his cock sticking straight up between his legs, his cock is so long and straight and thick, it looks like the world's most perfect dildo--but much better than plastic, this is the real deal.  As for the mountain of jizz that covers those abs, oh yes, that is the full-meal deal too. Bone Appetit!",
  "models": [
    {
      "name": "Nathan",
      "person_id": 29637
    }
  ],
  "release_date": "2007-08-22",
  "scene_id": 54626,
  "series": "Knock Knock I'm Here!",
  "tags": [],
  "title": "Knock Knock I'm Here!"
}