{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have a couple of new faces for you today as we welcome Seth Haus and Tony Royce. Seth is 20 and from Denver. He has a significant other that isn't crazy about what he does; but it's worth it to her to be ?ok? with it. Tony is just 18 and this hottie is what locals refer to as a ?conch?. Yes, Tony is from the Conch Republic down in the Florida Keys. This wild child is still single but would gladly settle down if he found the right guy. We asked these two if they could get their dream car what would it be. Seth already owns his dream car an '84 Firebird. He's had several of them and wouldn't want any other car. Tony would want a Bugatti in red and black. We then asked them what country they each felt had the hottest people. Seth thinks Brazil has the hottest people because of the mix and sexy skin tones. Tony loves Italian blood. As for favorite sexual fantasies, Seth wants to explore an Asian menage-a-trois. Tony fantasizes about having sex in public. Well, luckily we won't need to go outside to watch Tony get a dickin'. Shall we? Tony is filming a new episode for his blog as he introduces Seth, the man of the hour. ?Word is you have a pretty big dick, Tony grins ?We gonna get to see it?? Seth tells him to put the camera away and he just might. Tony moves in to grab his crotch and leans in for a kiss. They start to make out as they peel their clothes off. Tony undoes Seth's shorts wanting to dispel the myth. He grabs Seth's growing cock through his loose fitting boxers before hauling out his massive 9? dick. At 6'4, there isn't much that's little on this hung hottie. Seth is naturally smooth and even keeps his crotch hair free. Tony strips and gets comfortable as he gets to work worshipping that cock. Seth moans as he gets his knob polished. Seth appreciates the work Tony's doing and his cock is rock hard. Tony decides it's time to give Seth a better idea of just what he's getting into. Tony bends over on the chair and looks back over his shoulder at Seth that can now appreciate the hot ass that awaits him. Seth moves in for a closer look as he lubes up his finger and starts teasing that hot little hole that has his name all over it.He gets Tony back on the couch on all four as he starts to slowly slide his thick dick inside. Tony groans as he gets that hole stretched. Seth's cock gets even harder once it's inside as he starts to fuck that ass. Tony's hot ass is accommodating all that dick just fine as Tony grimaces to take it. Seth holds his rock hard cock by the base as he aims south and repeatedly plunges his meat deep inside Tony's hungry hole. He then flips Tony over and gets right back to fucking him missionary. By now that ass is just begging for it as Seth slams his meat deep inside. Seth watches as his fat cock slides in an out of Tony's hole as Tony just moans in ecstasy. Seth then moves over to the chaise again where he sits back and has Tony ride his dick. Tony straddles him and gets right back to taking that dick. He holds still as Seth fucks that cock up into him. ?Aww fuck? Tony moans as that thick dick hits him in all the right places. Tony gets off Seth's cock and jerks his load off all over his smooth abs. Seth is next as he blasts his load all over Tony's chest. Welcum to Florida, Mr. Haus",
  "models": [
    {
      "name": "Seth Haus",
      "person_id": 28803
    },
    {
      "name": "Tony Royce",
      "person_id": 28804
    }
  ],
  "release_date": "2011-02-02",
  "scene_id": 54624,
  "series": "Haus Party",
  "tags": [],
  "title": "Haus Party, Scene #02"
}