{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "One of our favorite combinations here at ExtraBigDicks.com is when angel-faced men have devilish minds! When Aiden Krew shed his wings a few weeks ago, along with his clothes, in addition to a face so beautiful it takes your breath away, this horny 20-year-old has a fat eight-inch cock that gets hardest when those beautiful, creamy, snowy-white ass cheeks on the flip side are being filled. Who would be worthy of giving our heavenly creature the ass reaming he has been begging for? He would have to be another celestial creature, so we found ourselves a star, a porn star, to do the honors, Mr. Damon Phoenix himself. With 180 pounds of rock-solid muscle packed onto a 5'8' frame, Damon says, 'I like all different kind of porn videos. LOL, I'm a porn freak.' Knowing how much he likes smaller guys he can pick up and bench press, we knew Aiden would be a perfect costar for this veteran of half a dozen-plus major DVD's. But little did we know just how mutual the attraction would be!From the moment their lips first touch each others, you can see the thought bubbles over their heads are filled with the vision of a fireworks display as the chemistry flows right through them - almost as fast the blood flows right to their cocks. Displaying gentleness despite his size and strength, as Damon brings Aiden to the bed, you can see how much he wants to roll him over and fuck him right that moment, but chooses instead to build the passionate anticipation. Aiden's hand immediately goes to Damon's crotch, and soon Aiden's mouth goes directly to Damon's cock. With the wet urgent mouth you only see when someone is sucking a cock they know will soon be bound for their ass, Aiden works his magic on Damon before Damon returns the favor. We already know nothing makes Aiden bone up like some back door stimulation, and sure enough, as soon as Damon's finger starts to slip into Aiden's ass, Aiden's eight inches are instantly at attention and starting to drip as his moans turn into cries of desire. Whoever said 'big boys don't cry' obviously never had their ass teased by Damon Phoenix. Damon moves over to the bed and makes room for Aiden next to him, but taking one look at that hard cock, Aiden decides the time for 'next to' has passed and pounces his hole onto that meat in one steady, hungry push.Damon holds Aiden's hungry hips and proceeds to pile-drive under him, giving that hole the reaming it has been begging for. Aiden's hole soaks up every inch of Damon's thick cock like a dry sponge being tossed into a deep puddle. That cock stays planted firmly in its new home as they pivot into a missionary position that allows Damon to use Aiden's legs for leverage to go even deeper and faster until his dick had investigated every nook and cranny in Aiden's backside. Getting on his knees, jerking his cock right over Aiden's, Damon gives Aiden a protein facial that causes Aiden to release a big white explosion all his own. When exactly Aiden fell down to earth is still anyone's guess, but as for where all of his and Damon's jizz landed is easy to see: all over each other!",
  "models": [
    {
      "name": "Aiden Krew",
      "person_id": 28549
    },
    {
      "name": "Damon",
      "person_id": 28589
    }
  ],
  "release_date": "2007-08-01",
  "scene_id": 54631,
  "tags": [],
  "title": "Toy Soldiers, Scene #01"
}