{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have all heard the expression 'walk tall and carry a big stick,' and standing at 6'3', Barrett Long definitely has the tall part in the bag. As for the big stick, at eleven inches of some of the juiciest, thickest, jaw-breaking meat ever bestowed on any man, Barrett has no choice but to carry it: despite towering in at the height of a major league basketball center, if he did not pick up that over-sized gargantuan appendage, it would trail on the ground. Barrett's body of work has lead to leading roles in, according to the man himself, between 30 and 40 films, but we can only estimate that the number of personal fantasies he has starred in is in the millions. Barrett's first appearance here at ExtraBigDicks.com inspired a rallying cry for an encore that he answers today in his second exclusive appearance, where he once again proves why Barrett Long is far from just an honorary moniker.Though unwrapping the package is often half the fun, even Barrett's piercing baby-blue eyes and clean cut guy from a Midwest frat house face can make you forget just how over-sized his package is. And when he wastes no time in unwrapping it, it is like he is answering the call of a silent prayer. Looking leaner than last time, Barrett quickly gets naked and, even totally soft, that long tube of flesh almost reaches his navel as his low hanging balls puddle on the mattress below. Barrett is one of those blessed beasts who is both a grow-er and a show-er. As he tugs away while still absolutely flaccid, the length at which his cock stretches, which seems almost up to the nipples, gives a clue as to just how much room there is for expansion. A well-practiced grip is all it took for the meat to go from condo to condominium. Fully hard, it looks like he could scratch the bottom of his chin with the top of his dick. And yes, we are itching for more too.As if he is reading our minds, Barrett grabs the lube and starts greasing up his nearly foot-long penis pole as he looks directly ahead and declares 'ask and you shall receive.' He is definitely in a giving mood, and we are ready to take it all. Standing up on the bed, even his giant stature cannot dwarf the sheer size of seeing the sperm-inducing vision of all eleven inches towering hands free, above our heads. Barrett lays down as he begins to double-fist that throbbing tower. Even stacked hand-over-hand, his cock is so big that there still is inch after inch of exposed shaft leaving room for endless possibilities. But as that sack starts to contract and his balls go from pale pink to bright red, the jet of sperm makes an arc in the air and comes down to splat across his wrists as he turns that cannon forward and guns off a load that shot well beyond the edge of the bed, this time updating another old saying--the bigger they come, the bigger they cum.",
  "models": [
    {
      "name": "Barrett Long",
      "person_id": 28564
    }
  ],
  "release_date": "2007-07-18",
  "scene_id": 54636,
  "tags": [],
  "title": "Odds On Cumming, Scene #02"
}