{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "While still a teenager, Skills was already jacking off twice a day. By the time he got a driver's license, he had already learned he liked vintage models after his first two sexual experiences were with '30 something' ladies who took one look at the size of his bulge and decided that they had to have it. As for exactly when his cock got to be all nine inches of jaw-breaking, thick, dark chocolate, we can only assume he was born hung and reached the humongous stage not soon after. He gets rid of his shirt almost immediately and shows off his lean chest with the scattered dark swirls of hair. Skills tells us he has been dying for the chance to show off his big dick. Not only has he come to the right place, he wastes no time giving the colossal cock the air time something this big deserves.Even in his baggy boxers and standing across the room, we can already see whatever is under that fabric making it dance around like that is something we need to see up close and damn fast. For it does not seem like he is just rubbing a bulge in his shorts, but he is petting a pet boa constrictor that will definitely be capable of causing strangulation when it is uncaged. Skills lowers his boxers in the back first, showing off the fine mocha globes with the musculature for deep thrusting engineered into the tasty looking framework, before turning around and presenting that big, thick black snake with the head already hissing. Though the swell of his biceps seems far from the center of his arms, and the roundness of his pecs causes his chest to advance well in front of the rest of his lean body, the sheer length of that cock would make it look huge on a man twice his size. Though we will take a man like this: measuring average everywhere else, but coming in extra big in the dick department, any place, and time.His sack is coiled tight as he stands up and shows off that dark hole and that long meat at the same time, slowly stroking to show off every inch of that now gleaming, licorice-colored shaft.  When he lies back on the couch, it looks like he could use the head of his cock to scratch under his chin as it stretches across the middle of his body like the center roof beam spans a football arena. Looking straight at his cock, as if he is still as mesmerized by the size as we are, Skills loosely grasps his cock at the base and, displaying his skill as a sharpshooter, blasts the first load on his upper pec and spends the next couple of minutes just holding his shaft as the cum exits and flows down like a just-tapped oil well with an endless supply of thick, white gold.",
  "models": [
    {
      "name": "Skills",
      "person_id": 28707
    }
  ],
  "release_date": "2007-08-08",
  "scene_id": 54630,
  "series": "The Long Goodbye",
  "tags": [],
  "title": "The Long Goodbye"
}