{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "With a wholesome, well-scrubbed face that should be asking Mrs. Cleaver if Wally can come out and play, 20-year-old Aiden Krew has the compact-framed body and All-American look that can only mean one thing here at ExtraBigDicks.com: the guy is sporting heat. And in this case, it's eight-and-one-half inches of red-hot dick meat capped by a flaring, spear-shaped trimmed cap and flanked by a set of equally oversized babymakers that need to be emptied as often as possible. While Aiden may look like a guy who is still packing his own lunch, what he really wants you to do is pack his fudge. And when you take one look at the creamy, smooth set of globes, this is a job you will gladly apply for. As for what to hang on to while you are riding that heiney into paradise, Aiden has a handle you to hang on to with both hands.Just talking about the beefier, more seasoned men that really put the Twinkies in his lunch box is all that Aiden needs to start rubbing the mound in his jeans before quickly needing to pull them off to give room to the rapidly expanding tube of flesh coiled inside. In a pair of snug briefs riding low enough to show off the sexy tat on his lower hip, the glory of his naturally smooth body is showcased like a tactile playground in wait of your touch. As for where he wants to feel your fingers first, he stands up and lowers the back of his shorts first, making it clear where his idea of a quality night at home is going to end. When he sits down, spreads those legs, and lets his antennae point toward the ceiling, that prime pole is definitely ready for some attention of its own.Just like the man himself, Aiden's cock is a long, slender velvet-looking cylinder of delight. With a look of mesmerizing sexuality infused with a touch of lost innocence, Aiden milks his cock, producing a steady stream of dripping pre from an oversized slit that seems capable of pumping out an endless supply of steamy liquid. And from the look of his rapidly tightening balls, that opening will soon be employed for the task at hand. Letting spit drip from his lips for the extra speed required for the final lap, Aiden polishes the knob with one hand while working that shaft with the other as he ushers forth a load that all but disappears against the pale plain of his milky white abs.",
  "models": [
    {
      "name": "Aiden Krew",
      "person_id": 28549
    }
  ],
  "release_date": "2007-07-11",
  "scene_id": 54638,
  "tags": [],
  "title": "The New Guy, Scene #02"
}