{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Aidyn looks directly into the lens and announces with pride that he needs to jack off 2-3 times a day at a minimum. After we take one look at his equipment, he cannot be blamed for wanting to play with himself as often as possible. Aidyn has a thick, veiny eight-inch slab of dick with a flaring head over a low-hanging sack that could just as easily be used to transport a set of bowling balls as a 22-year-old's pair of baby-makers. In the center of Aidyn's 'recruiting-poster-ready' face is a pair of the most perfectly-formed, bow-shaped lips we have ever seen. Those lips get even more precious when he shares with us that despite his experience only being with women so far, he is more than just a little 'bi-curious.' And not only does he want to see if it is true that guys give better head than women, but he would even return the favor. If a guy has the balls to admit to something like that on camera for all the world to hear, we know what he is about to do is most definitely going to be something worth watching.Just under 6' tall and a beefy 185 pounds, Aidyn snakes his hips to push the lump in his jeans into his left hand, undoes his belt with his right, and licks those lips with a sexual anticipation that says he wants to show you what is inside as much as you want to see it. Tugging his shirt up behind his neck, Aidyn reveals a smooth chest with bold ink on both of his rounded pecs, encircling both his nicely-formed biceps. As he slides his pants down low on his hips, he shows there are tats on both sides of his hips as well. With his pants now around his knees, you can see that ink forms the shape of wings on his abs. But we know your attention is drawn to the same thing as ours: sticking out of the waistband of his boxers, his cock head almost covers his navel and he is not even fully hard yet. That 'yet' only lasts as long as it takes him to pull his shorts down to free those massive balls before all eight inches are at attention and ready for action.Running a fingertip up and down the shaft and across the moist slit in the center of the head, Aidyn is not exaggerating about how often he jacks off. From the deep primal moans that immediately fill the room, this is a man who knows how to produce the kind of sensations from every surface of his cock that most guys only get when they are ready to nut. His cock looks like a big fat stake that could be driven into the ground, and his dick is more than hard enough to do just that. The more he strokes, the thicker and longer his cock gets as his egg-shaped balls dance in the sack underneath. After a quick view of his milky-white ass cheeks, Aidyn lays back and soon propels out a load that lands in a perfect line down the center of his body that starts just under his jeans, then forms a puddle in the center of his pecs. The load continues to ooze out of the head of his cock as he looks into the camera just one more time and uses the same word to describe how it felt as we are thinking of how it looked.... 'awesome.'",
  "models": [
    {
      "name": "Aidyn",
      "person_id": 28551
    }
  ],
  "release_date": "2007-07-25",
  "scene_id": 54633,
  "tags": [],
  "title": "Whatever Works, Scene #01"
}