{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "In our own, appropriately oversized salute to the 4th of July, we definitely have some rocket's red glare this week here at ExtraBigDicks.com. But in our case, what is left crimson is Speedy's hairy hole after Rico's 10', uncut, veiny weapon of ass destruction launches a battle plan that leaves Speedy sore, Rico breathless, and the lube bottles empty. We first saw Rico's legendary schlong a little over a year ago, and his recent command encore performance of that amazing, almost foot long tower of delight produced a universal plea to see him playing a game of anal invader with that mammoth, mouth-watering, double-hander of manhood. Speedy made his first appearance receiving a pounding from soccer stud Antonio on our brother site, CircleJerkBoys.com, and lived to tell the tale. Whether his tail is up for Rico's even more colossal cock is yet to be seen. Speedy shows up looking like he was ready for a gang war, but we already know the outcome. Judging from the fact Rico's bulge snakes down his thigh until it almost reaches his knee, after taking one glimpse at Speedy's round ass in those black shorts of his, this is a battle over his own turf that Speedy is about to lose.Inked shoulder, do rag, wifebeater and attitude, Speedy lays back and lets Rico start working his way up Speedy's chest until Rico has one hard nip in one hand and one hard cock in the other. Stripping off his shirt and then getting Speedy out of his shorts, it took all of two swallows of Speedy's cock before all eight inches are hard as a flag pole. With his eyes closed, his lips moaning and his hand guiding Rico's head exactly where he wants it, it looks like Speedy is starting to think there is a change in the battle plan and he will wind up on top without warning. The only thing that is flipped is Speedy's ankles high up over his head, as Rico's tongue darts deep inside that dark hole with the aggression of man who is just starting to mark his territory.The look on Speedy's face as he sees Rico's now throbbing ten inches registers with the fear of a patient walking into the operating room and seeing a sinister tray of oversized instruments, knowing exactly where they will soon be going. As Speedy feeds his still hard cock into Rico's hungry mouth, Rico works his own pole at the same time he begins excavating a pathway with his finger between Speedy's ass cheeks. Rico continues to grease a trail as they stand, and in a rare moment of intimacy that Speedy does not know we catch on camera, they nuzzle against each other before Rico lays down, grabs Speedy's hips like the gateways to pleasure, and slowly guides Speedy's hole until all ten inches are buried inside. Rico next bends Speedy over on the bed, and, gripping Speedy's fully-hard eight inches like a handle, Speedy resumes his tactical assault until they wind up on the bed once again with Rico dunking every inch of that dick. Flipping onto their backs, Speedy fires his load, followed soon by Rico who sends his white bombs bursting so high in air that they land above his head and come crashing down on the pillow behind Speedy in a display of Independence Day fireworks for the record books.",
  "models": [
    {
      "name": "Speedy",
      "person_id": 27873
    },
    {
      "name": "Rico",
      "person_id": 28192
    }
  ],
  "release_date": "2007-07-04",
  "scene_id": 54639,
  "tags": [],
  "title": "Double Or Nothing, Scene #01"
}