{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Next to the spot that asks for cock size on his application, Ty put down nine inches. That is not the first time we have seen that answer to that question here at ExtraBigDicks.com, but it is the first time a model wrote down 'nine' and was referring to length when it is totally soft. Even if Ty was simply what is known as a 'show-er,' he clearly had something worthy of being put on display, but even better for us, Ty turned out to be a 'grow-er,' and nine inches was, in every sense of the phrase, 'just the start of something big.' Seems like a crime against huge cock lovers everywhere that Ty did not dip his pole for the first time until he was 21. Despite having been married for a while, in the years since then, Ty has learned to be an equal opportunity fucker and fully appreciate the charms of both sexes. Today, Ty is all ours, and that suits us just fine. Even though his eleven fully erect inches offer plenty to go around, with a cock this big, we want it all for ourselves.His muscle shirt lives up to its name, showing off the sexy contours of his well-worked arms. And his jeans cling to his lower half like wrapping paper does on that big gift that has been calling your name under the tree since Thanksgiving. He lifts his shirt to reveal granite solid abs with something not often seen on African-American's, copious swirls of dark curls that become more dense until they fan out across his well-etched pecs. As Ty works his pants down, the outline of his cock inside his white shorts makes it look like he is smuggling a whole cucumber or zucchini in his underwear - and we have no doubt the actual cause of that obscenely large outline will prove to be just as tasty. Rubbing that massive heap, like a rightfully proud papa caressing his baby, as he tugs on the waistband, we know we are about to get a delivery. And oh yes...it's a boy!Laying back across his stomach, that dark cock looks like a just-beached whale flopping on the beach with the tip of that pulsating head closer to his pecs than his navel. Ty's baritone moans are almost primal as he stands and begins to stroke with an underhand grip. Though due to the sheer girth of his shaft, his fingers can barely make it all the way around. When he lets that mighty cock swing in the air, the extraordinary distance between that thick, dark bush and the even thicker pink cockhead showcases just how oversized his equipment actually is. The look on his face resonates with the crest of pleasure as the tightness of his balls, in combination with double-time stroking, coax a huge five splat load to land all over those hairy, hard abs. ",
  "models": [
    {
      "name": "Ty",
      "person_id": 28158
    }
  ],
  "release_date": "2007-05-31",
  "scene_id": 54648,
  "series": "Double Duty",
  "tags": [],
  "title": "Double Duty"
}