{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Jay told us, 'I like anything with a big ass.' You told us, 'That Jay is the most stunning piece of man flesh ever to walk the planet.' We said to ourselves, 'we have to get Jay and that 8' throbber back to ExtraBigDicks.com as fast as we can!' This 18-year-old serving of Latin love-candy has an all day sucker men around the globe are lining up to have their jaws stretched by. From the day Jay's first episode aired, we fell in love with that masculine, square-jawed face made all the more mesmerizing with skin the color of Creme Brule, the naturally-built, idyllically-hairless body, the curves of an ass so round and tight it seems a crime against the natural order that it is off limits, and of course, eight mouth-watering inches of a thick, uncut palatial penis that has spurned a dynasty of fantasies.Jay's first love may be a bountiful booty, but his second love is playing basketball, so we've got him on court near the studio and let him indulge his passion while we indulge our eyes with the view of that big package doing its own double-dribble inside those shorts. It is not long before there are very obvious boners on both sides of the camera and it is a tough call as to who is happier to get back to the studio so Jay can get down to playing with his balls. With a look into the lens that reeks of an effortless seduction so complete you are ready for a cigarette even before he really gets started, Jay starts rubbing a tent that, even in his black shorts, is clearly visible even from across the room. Pulling off his shirt, he is quickly pulling on the lump sneaking its way out of his grey boxers until the entire beauty is center court, throbbing at attention. And, oh yes, something this big is definitely going to run into overtime!Teasing us first with a view of those golden orbs, Jay moves to the couch and begins humping away, unknowingly offering us a glimpse of the no-man's land of his hole in the center of his furry crack, before turning over and doing a double-dribble on a shaft as hard as we have ever seen it. The double-dribbling turns into doubled-fisting, as he works his dick standing up for a bit. By the time he settles down in the chair, those bloated balls are forcing a steady stream of pre to drip down like a summer rain. By now, his dick is heavy enough to work out with, as his biceps flex like he's doing a super-set of curls. But the super-set here are those twin baby makers in that tight sack, which soon force out a scrimmage of jock jizz that first covers his hand, then puddles down on the pillow below. While we are pretty sure Jay will never give up chasing cheerleaders, we are damn sure that if he ever decides to try the guys only version of a full-court press, there will be no shortage of volunteers.",
  "models": [
    {
      "name": "Jay",
      "person_id": 30391
    }
  ],
  "release_date": "2007-06-27",
  "scene_id": 54642,
  "tags": [],
  "title": "The Stroking Kind, Scene #02"
}