{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We asked Johnny what inspired his name, he told us he thought of it one day when he was at a urinal. Due to the size of his cock, not only could he tell the water was cold, but it was deep too, and hence, the name Johnny Deep was born. Johnny's porn career was almost over before it started: three ladies hired to film scenes with him took one look at that fat, veiny nine-inch fuck stick and said 'no way that is going in me!' Of course, here at ExtraBigDicks.com, we know bigger is not just better, it's everything, so we took one look and got him right into the studio so you all could enjoy the view of one flashlight thick slab of cock with an equally oversized mushroom cap head crowning a pole that is designed for excavation - and we are ready to get dirty.With his military buzz hair cut, Army 'T' and inked arms, Johnny looks like G.I. Joe getting ready to do battle with a tight hole. Needless to say, he is well armed for the task. He quickly shows off his tight, smooth hairless torso and makes history of his jeans. Almost immediately, the blunt cut head starts snaking out the leg opening of his shorts, quickly followed by a few inches of tender shaft topping a thick vein underneath that is already acting as a pipeline to sperm reserves in the still-hidden balls below. As he stands, a good stretch of cock is sticking out of the top of the waistband. And when he loses his shorts, we finally get to appreciate just how big that dick is by seeing how far his arms have to extend for him just to be able to grip his shaft under the head. It is easy to understand why this massive meat has inspired fear in some of his leading ladies, but this ain't our first time at the big dick rodeo, and cocks this big are a task that we are most definitely up for. We love it when a dick sticks right out, hands free, and Johnny's ability to hoist up a slab of meat this big and then swing it back and forth like an orchestra conductor is like visual music with the most perfect beat of all.  His cock has a slight upward curve just under a head that looks like it can go places few men are equipped to invade. With a one-handed grip at the top of his shaft as a cue to his most sensitive spot, his cock balloons until it seems to double in size, turning a shade of purple as his sack contracts underneath making precum drip a steady stream down a shaft so hot, we are surprised it doesn't steam on contact. A few more strokes, and those churning balls reach their boiling point and the jizz starts sliding down. But this time it is not steaming, it is smoking hot!",
  "models": [],
  "release_date": "2007-06-20",
  "scene_id": 54644,
  "series": "A Hand's Tale",
  "tags": [],
  "title": "A Hand's Tale"
}