{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Magnus' 6'2' frame is packed with etched Brazilian muscle, but it is the nine phenomenal inches of uncut, prized girth that gave rise to his last name, Maximus, as well as inspired the swelling of the cocks of anyone fortunate enough to see this prize specimen of manhood's manhood. As a personal trainer, Magnus can most often be found in the gyms of South Florida during the day, but at night, after seeing him and Diego tag team big dicked, tight-assed Angel, or have that incredible body worshipped by Miguel, the place Magnus is most likely to be found is in your fantasies. With that incredibly lean and finely-honed physique and that uncut bonanza of massive meat, it is easy to understand why he has inspired so many wet dreams. But what we want to know is, while we dream of porn stars, what does a porn star dream of? With a libido that is never satisfied and a cock that never quite goes soft, the answer is not really surprising at all; they dream of somewhere to stick that stick. And do we ever have a target for him: Stonie's ass!Stonie made his first movie in 1999. And his creamy-smooth skin, lithe-tight body, and angelic face have earned him accolades ranging from accurate: 'the hottest power bottom in the business' to the curious 'He's the Kate Moss of gay porn.' Stonie is now perched on the fine line between the Walk of Fame and the Hall of Shame, after having appeared in the mainstream box office hit 'Borat,' as the main character's son. But like his costars in the two dozen plus movies of interest to us, Magnus is fixated on only one thing of Stonie's, his 'booty of work.'rHaving a fuck flick playing for masturbation inspiration is an everyday occurrence here at ExtraBigDicks.com. But when Magnus says he has been dreaming of a beautiful ass, rather than pop in a DVD, we hook up the second camera to a television and show him the footage we have just filmed of Stonie. From the moment his perfect cheeks undulate like a beckoning love call under the thin white fabric of his shorts, Magnus's hips gyrate in a mating dance of their own as he hauls out his already salivating nine inches just as Stonie unveils that world class ass in all of its splendor. While Magnus works his shaft, there is a look of astonished hunger on his face as Stonie mounts the couch, bends over, and offers up the perfect view of his ass, his hole, and own cock that is likewise hard as steel. Like a duel between two hard, fat dicks, Magnus and Stonie are furiously fishing away with Stonie firing first and then a massive heavy load from Magnus following shortly thereafter. I guess an old classic now has some lyrics, 'beautiful dreamer, jizz onto me.'",
  "models": [
    {
      "name": "Magnus",
      "person_id": 27851
    },
    {
      "name": "Stonie",
      "person_id": 28712
    }
  ],
  "release_date": "2007-06-06",
  "scene_id": 54646,
  "series": "One Touch",
  "tags": [],
  "title": "One Touch, Scene #01"
}