{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It has been just a year since we first saw Rico, and in that short period of time, he has finally grown into his monster cock. At 10 jaw-breaking, thick inches long and half a foot around, no wonder it took 26 years for him to grow into a cock this huge. Even here on ExtraBigDicks.com, his uncut, veiny, hungry, massive slab of cock measures in at the top of the size charts and emerges as a major contender in the War of the Big Dicks.  With skin the color of golden cocoa touched by the Brazilian sun, and a naturally smooth sinewy body, Rico is enviably lean and endlessly sexy as the perfect canvas for the big brush of gargantuan manhood. Rico tells us 'seeing a guy grabbing my cock with both hands and moaning with pleasure gives me more pleasure than anything else.' Watching Rico double-fist that great stick of his, with plenty of shaft still left exposed, will give you as much pleasure as it gives him... it sure does for us!We quickly zoom in on the two-hand-full lump Rico is massaging in his pants, like a great loaf of bread just about to rise in an oven of unlimited pleasure. A deep moan comes from those sexy lips as one hand finds his nipple and the other grabs the pipe snaking down his thigh, which has grown into what looks like the outline of a flashlight. As he rises, his jeans unbuttoned, the edge of his dark pubes fill the opening until inch by inch, Rico deep sixes his pants and a coiled, jaw-breaking, uncut meat takes up almost all of the screen--and our breath along with it. With a firm grip on that missile, like an infantry soldier clutching his weapon as he rides into battle, Rico in one stroke slides back the thick skin to expose the mushroom-shaped, glistening head underneath. In that single motion, all ten inches are now battle-ready and standing at attention.Moving to the couch, hand-to-hand combat takes on a new meaning, as with both fists wrapped tightly around his shaft, there is still a good five inches of meat sticking out of the top. When he takes his hands away, it lands with a heavy thud with the head seemingly closer to his knee than his crotch. When he stands up, from below the arc, girth and sheer length of his cock looms overhead like a formation of fighter planes. Slapping his cock roughly in his hand, moaning heavier as he swings it from side to side, cradling it against his arm and taking a moment to admire the sheer size, he finally crash lands on the floor. With a battle cry almost primal, Rico fires of a round of liquid artillery all over his abs. While he may be hung like that, a dick this big definitely requires a Magnum-sized condom. Seeing is believing, guys; Rico will be back in a few weeks and this time, he will not be alone in the foxhole.",
  "models": [
    {
      "name": "Rico",
      "person_id": 28192
    }
  ],
  "release_date": "2007-06-13",
  "scene_id": 54645,
  "series": "Slice Of Life",
  "tags": [],
  "title": "Slice Of Life"
}