{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Jay is an 18-year-old stunner with a smile so white it is almost blinding, a manner so charming you immediately want to ask him out, a sexuality so laid back he gives you a hard on before you even realize it, and what could quite possibly be the world's most delicious ass: flawlessly muscular, perfectly round, and unquestionably 100% cherry. Seems like such a waste for a butt that wet dreams could be inspired from belongs to a guy as straight as they come, but after we saw what he is sporting on the front side, we almost forget about that prime real estate in the back. His mouth-watering, nine-inch beauty is just like the rest of him--absolutely perfect!nMaybe it's the well-trimmed goatee and mustache that make Jay look older than his 18 years, or perhaps it's the intense smoldering quality of the passing gaze from those deep brown eyes that make it appear that the man looking into the camera possesses an endless sexual repertoire of a very experienced erotic virtuoso. Whatever the cause, the effect is only intensified as Jay removes his shirt to reveal a torso almost totally devoid of hair, with arms rippling with natural muscle. The view just gets hotter as he slides out of his jeans and reveals a pair of grey boxers that despite being baggy, cling to the outline of what seems to be some heavy cargo. Jay mounts the bed and slowly shimmies out of his shorts. As the curves of that luscious ass begin coming into view, they do so without any hint of a tan line. The purposeful undulations as he grinds away on the mattress are those of a lover who has his partner's satisfaction as the launching pad for his own enjoyment. As Jay turns over, the golden sheets cling to the outline of his now very erect cock as he makes a two-fisted grip on the mighty slab over the fabric to show that silhouette of ultimate temptation. All eight inches are throbbing in Jay's hand as he strokes with the slow, steady rhythm of a man who knows just the kind of grip he needs for the ultimate pleasure. With his legs spread wide, his sack is already bloated between his thighs. Though Jay has seemed almost indifferent to the camera, he now locks eyes with the lens and makes it seem like he is fisting that meat just for you as he rubs the precum into the head. Standing up, that cock sways back and forth under his dark, trimmed bush, and swings from side to side like a big heavy pendulum of delight. Getting a tighter grip and moving faster, the slow easy road to fulfillment has been replaced by a fast track need to seed as he strokes double time. With one final, beckoning look into camera, Jay fires off a massive load where the first splat crashes down on his upper pec, the second lands on his lower abs with a couple more spurts going even farther until they land in a puddle on the blanket to his side.   ",
  "models": [
    {
      "name": "Jay",
      "person_id": 30391
    }
  ],
  "release_date": "2007-05-02",
  "scene_id": 54657,
  "series": "Operation Stroke",
  "tags": [],
  "title": "Operation Stroke"
}