{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "When we ask a guy how he is doing and he responds with 'I'm horny and I want to fuck,' we know we are in for a fun afternoon at ExtraBigDicks.com. When the guy in question is none other than sexy, smooth and hung Robert, we know it will not just be entertaining, but damn hot as well. Few guys know how to work the camera like Robert does. And as we saw a few weeks ago when Yankee took a taste test of those 8.5' thick hooded inches, Robert plays as well with others as he does alone. This time around, we caught up with Robert the day before he was to turn 21. And rather than a piece of cake to mark to day, we served him a piece of ass--hungry to be filled. We first met 24-year-old Eli when he was plowed by porn star Todd Maxwell on our brother site, MenOver30.com. We knew that a power bottom who loves to be ridden as much as Eli does would be perfect for Robert as, despite his wedding ring, this ain't Robert's first time at the backdoor rodeo either.Like the Emperor waiting to be pleasured, Robert is sitting expectedly, his legs spread wide, when Eli comes over to start the festivities. Robert immediately puts his hand on Eli's head and guides that mouth south. He immediately opens Robert's jeans, tugs down his underwear and with just a few expert licks, Robert's cock is fully hard and tickling the back of Eli's throat. Robert has also switched from just being along for the journey to taking the reins, and control, meat whipping Eli's mouth with his fat, needy cock, and blessing Eli's ears with a chorus of primal dirty talk. Eli fishes out his own cock to stroke along as Robert stands above him. At first, Robert starts fucking his face, but soon realizes all he needs to do is stand there and let Eli's head move and back and forth. Back and forth becomes the operative phrase as they both decide enough of the preliminary activities: what this birthday party needs next is an interactive man-to-man version of pin the tail on the donkey.Bending over and pushing his hips back to meet Robert's thrusts, Eli makes sure he gets every inch from every angle. Robert pounds away so fast and furious that the knocking of the head board against the wall sounds like the percussion section of a Latin dance band. Moving to the bed, Eli is able to accommodate Robert's anal assault in a single, slow, purposeful insertion and even keeps that big dick tightly in his ass as Robert flips him over onto his back and, grabbing his ankles, begins pounding away at Eli's hole double time. Arching his back, Robert pulls his cock out, and with less than a minute of fisting, covers Eli's trembling abs with a thick load that is soon joined by a fresh serving of white icing from Eli's balls. Robert started out saying he was horny and wanted to fuck, but leaves saying something else we love to hear...'I had a blast!' ",
  "models": [
    {
      "name": "Eli",
      "person_id": 27817
    },
    {
      "name": "Robert Long",
      "person_id": 28696
    }
  ],
  "release_date": "2007-05-09",
  "scene_id": 54655,
  "series": "Too Much, Too Soon",
  "tags": [],
  "title": "Too Much, Too Soon"
}