{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "28-year-old Gabriel may just be the hottest export to come out of Hungary since 'goulash.' And with a chiseled face, ripped, smooth body, and thick, eight uncut inches, we are sure he is just as tasty. We are not sure if Gabriel started working out every other day just to build up a strong enough body to walk around with a piece of meat this big without toppling over, or did he do it just to get in his daily dose of the need to seed? 'I LOVE sex,' he proclaims proudly, 'and I 'spank the monkey' every day, too.' After seeing the tube in his pants inch its way from the starting point of his crotch to the ending point half way-plus down his thigh, it is obvious Gabriel is more than ready for his daily dose of sexercise, and boy has he ever cum to the right place!As he lifts his shirt, it is like the opening curtain rising on scenery that is nothing short of spectacular. His shoulders are broad, his pecs are round, his biceps are beefy, his torso is smooth, and the sharp-angled lines of his obliques drive your eye exactly where it wants to go: to the packed bulge of his shorts, bulging with the promise of something big and hungry for your attention. As Gabriel turns around to reveal a flaringly-wide, well-worked back, the crack in between a perfectly round ass so packed with muscle it looks like it could deflect a round of machinegun fire and remain untouched, comes into view. We are treated to those mighty orbs in motion as he grinds away on the couch before rolling over and putting eight throbbing inches on display under a trimmed bush and over a set of balls that mimic the state of that two-fisted dick: tight, bloated, and oozing with the liquid promise that only a man this fine, this buff, this horny, and this hung can offer.Gabriel looks like a statue of a Greek Deity come to life with every muscle in perfect motion with the singular objective of sending out the pleasure to every inch of his body by stroking that big dick. As Gabriel stands, his balls are so tight they almost disappear into the base of his shaft, which juts out so far ahead of him it looks like an arced, thick tree branch that exists independent of the trunk. His cock bobs and weaves through the air, just begging to be worshipped. As he turns and strokes from behind, the view of that meat hanging heavy between those golden globes is a vista that will make you weak in the knees. As Gabriel moves to the floor, we get a close up view of his shiny, pink cockhead as it completely sheds its covering of skin, opens wide at the slit, and sends out a thick white blast that puddles down onto his still heaving abs.",
  "models": [
    {
      "name": "Gabriel",
      "person_id": 29842
    }
  ],
  "release_date": "2007-05-16",
  "scene_id": 54652,
  "series": "Restless",
  "tags": [],
  "title": "Restless, Scene #01"
}