{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Logan is just the kind of guy we love here at ExtraBigDicks.com: just as horny as they come, but able to quell the urge-to-purge long enough to walk in the door with a load just as fat as his dick. This 24-year-old California cutie weighs in at 175lbs. and comes in just a hair under 6' tall, but the most important measurement, the real estate between his legs, is a thick, cut 8' beauty and one Logan is quite at home putting on display. While definitely a man with an eye for the ladies, Logan is honest enough to say that while he would rather get a blowjob from a female, guys definitely do it better. Seems Logan is not above letting a bud go down when the porn is hot, the beer is cold, and he has a need to seed. With a pole like his, we surely cannot blame a buddy for wanting a taste test. And judging from the way Logan keeps tugging and rearranging the lump in his jeans, he definitely has plenty to offer on the menu.Logan can barely stop rubbing his cock right through his jeans long enough to flick his shirt across the room before getting back to the business at hand - or what he cannot wait to get in his hand actually. To make sure he provides a nice big, wet, sloppy finish, Logan says he's refrained from jacking off for four or five days, and clearly his need to seed could not wait much longer. He undoes his belt and unbuttons his jeans in one urgent motion and immediately, his boxers spill out of the opening like a canister of pop-and-fresh biscuits has just cracked against the counter. With an insistent tug, he lowers the waistband down to under his balls, and the head of that visibly throbbing eight incher lands a good inch above his navel.The ink on Logan's shoulder and thick, curly bush are the only things decorating that hairless, milky-white skin of his naturally-toned frame. His cock is so swollen, it points directly at the ceiling, cushioned by a pair of balls bloated with an avalanche in the making. Long and thick, with a perfectly-tapered head, his cock becomes the reality behind the expression 'the third leg,' as it defiantly is so hard and so large; it appears with all of the characteristics of an appendage in its own right. With his hands working double-time and never breaking their rhythm as he strokes sitting down, standing up and finally lying back, Logan's run to the finish line is rewarded with a thick load that covers his lower stomach from one side to other with a very special white sauce he had been simmering for almost a week. ",
  "models": [
    {
      "name": "Logan 1",
      "person_id": 29821
    }
  ],
  "release_date": "2007-04-25",
  "scene_id": 54658,
  "series": "An O To Remember",
  "tags": [],
  "title": "An O To Remember"
}