{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Sometimes art really does imitate life: 33-year-old Scott makes his living as a pipe-fitter and spends his weekends trying to find a hole to fit his big, fat eight-inch tube. We are not sure if that thick vessel of his inspired his career choice, but we know he had plenty of time to think about it as he told us he first learned he had a big dick when he had the chance to compare his schlong to that of his grandfather's at a urinal. Family lore stated that the old man was packing heat, and fortunately for us at ExtraBigDicks.com this was a family characteristic that has been passed down through the generations. Still in his greasy wife-beater and dirty work pants, Scott is in the mood for the same thing we are: since he had already shed his blue collar, it was time to make history of his blue balls as well.Scott makes quick history of the grungy tank, but maintains the grease factor by polishing his smooth chest with baby oil. This makes the perfect slippery slope for his hand to ski down into his pants, while the other thumbs through a skin magazine. When he finds the right fit for his pipe, he uses his belt like a rip cord and gives that hard cock the breathing room it needs. Scott's dick is so throbbing hard, it makes the striped fabric of his boxers look like a giant candy cane in a holiday window display. We get the first real idea of just how fat his cock is as his cylinder is so fat at full mast that the fly of his shorts is forced permanently open. When he hangs it out of the leg opening, we can see that not only is this one girthy tube steak, it is a mighty long one as well. As he slaps the leaking head into his fist, it echoes loudly across the room. Scott is definitely playing our song and we are crazy about his chosen method of staying on beat.Seeing how far down his thigh that his cock stretches, Scott's dick is just the kind that the expression 'third arm' was coined after. It looks like a totally independent appendage, and this one, like the man it springs from, clearly has a singular purpose: to be out to use as often as possible. As he turns and gives us a view of his hairy crack and white ass cheeks, his cock hangs heavy under his bloated balls. Scott's stroking picks up speed as he finds the centerfold in the magazine--that's what he needs for the final assault. As he stands with his cock now at its fullest size, the club-like profile of his ready-to-fire cock is down right menacing. With a tight, single-fisted grip, the cum begins to ooze out of his cock and he collects it in his fingertips into it a white frothy handful. We are not sure how Scott performs when is on the job, but one thing is for certain, we are crazy about his plumbing.",
  "models": [
    {
      "name": "Scott",
      "person_id": 30510
    }
  ],
  "release_date": "2007-05-24",
  "scene_id": 54651,
  "tags": [],
  "title": "On The Couch, Scene #02"
}