{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Since the motto of ExtraBigDicks.com is 'bigger isn't just better, it's everything,' then Barrett Long is the man who has it all. At 24, with 20-plus big studio films on his resume, we were thrilled to get him alone for a very up close and even more personal one-on-one session. Rather than sharing the screen time, all 6'3' 190-pounds of this angelic faced hottie, with some of the most piercing blue eyes on the planet, takes center stage. And he brought along his own co-star, 11' tonsil-tickling inches of some of the fattest uncut meat ever seen on something that walks on only two legs. With a sex life that is even wilder off screen than on, Barrett was born with just the kind of uber sex drive that makes him a natural for this line of work. He is a guy who needs to empty his pipes on a daily basis by his own hand regardless of how much help he receives in the unloading department from others. With no script to follow, no scenario to bring to life, we are proud to present our unique version of 'Barrett Unplugged.' Along with those agate baby blues, there were plenty of things that we had never noticed about Barrett before. We can think of almost a dozen reasons why his ink, that milky-white complexion, and that fine dusting of chest hair had gone unnoticed. It does not take Barrett Long long to get down to his fine naked form, and he is as anxious to let us see the full glory of the man and the meat, but he is also more than ready for a little solo quality time with what is also his favorite toy. Sitting back on the couch, the sheer size of his equipment splits his thighs apart, and the true marvel unfurls: already over 7' long and still limp as a dish rag, that great pendulous penis is about to make an entrance--a very big entrance.We are very glad a break in his regular filming allows that very sexy happy trail fanning down from his navel out to his pubes a chance to grow in. This acts as the perfect crown for the jewels below, and with a steady, easy stroking, that priceless gem becomes hard as a diamond and just a rare. Just shy of a bona-fide foot of cock, Barrett's shaft at full glory is a sight to behold. With Barrett, no perfectly-aligned camera angle on an upward slant is required; no special lens is needed; his cock is just as enormous as you thought it would be. Alone in the spotlight, this is just the cock you have always dreamed of but feared did not exist outside the realm of sex toys. That final precipice between prolonging the joy and needing to release registering so clearly on his face, following the steady growl of low, deep moans, Barrett aims that mighty cock right at the wall and fires it off like cannon, the first of many jets firing a good two feet-plus over his shoulder and the rest coming in for a landing not much lower. With a load like that, the unplugged in 'Barrett Unplugged' becomes the operative phrase indeed.",
  "models": [
    {
      "name": "Barrett Long",
      "person_id": 28564
    }
  ],
  "release_date": "2007-04-18",
  "scene_id": 54660,
  "series": "One Giant Stroke",
  "tags": [],
  "title": "One Giant Stroke"
}