{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Cole is 21, 6' tall and tips the scales at 140 pounds. He is also just as pretty as they come. We thought he was coming for a modeling gig on BoyzParty.com, but when we took a look at his application and saw there was 9' of tender dick hanging between his legs, we knew exactly where he belonged. It's been said you can tell the size of a guy's dick by how large his hands are. Others say it's the nose. Some insist shoe size is the real barometer, and there's a group that say look at a guy's frame. Having seen cocks of all shapes and sizes on men of all shapes and sizes here at ExtraBigDicks.com, the only thing we can say for certain is you just really never know who is packing the major meat until it's hard and offered for inspection. And this is one inspection Cole passed with flying colors.Giving the big bulge a solid grab, we can see there is something rapidly making his jeans too tight. His hands move to reveal a very smooth tender chest, totally devoid of a solitary hair. He caresses that smooth skin in a way that says Cole is indeed a tactile playground and he likes a sensuous touch by his own hand--or anyone else's. He reaches deep into his crotch, grabs his package, looks right in the camera, and states our favorite rhetorical refrain, 'You like the big cock, huh?' Looking like he is trying to unsuccessfully smuggle a flashlight in his briefs, he quickly loses his shirt and his pants; and he gives that hefty meat the growing room it needs by hauling it out of a leg opening. Moving to the chair, we get a quick glimpse of his tight hole as he kicks his shorts across the room and turns his attention to where ours has been all along...the fat, hungry pole.Sprawling back in the chair, pulling one leg up and stretching one leg out, Cole's cock rises like a third leg suddenly sprung forth in the middle - and it's sure ready to kick up its heels. We also get our first good look at an oversized sack with a pair of bird egg-sized baby makers in their low hanging cocoon that seem to push his thighs from coming any closer together. With both feet now on the chair, as beautiful as his cock is, his ass is just as delicious looking. Sliding over to the floor, we get the full meal deal as he grinds away, letting his cheeks be kissed by the breeze as he reaches under and strokes that fat heavy cock. Cole told us he is strictly a top, but when his fingers slide over his hole, a moan escapes his lips. Could he possibly be toying with the idea of giving bottoming a test drive? He certainly has been toying with something, but soon his attention reverts back to his favorite toy: that big, fat cock. Pounding away with an urgency to nut that gives us blue balls just from watching, his balls suddenly contract, and his load shoots out so far and so fast that it was completely out of view. We'll work on getting him back, and this time, we will both work on our aim.",
  "models": [
    {
      "name": "Cole",
      "person_id": 28264
    }
  ],
  "release_date": "2007-03-21",
  "scene_id": 54669,
  "series": "A Woody In The House",
  "tags": [],
  "title": "A Woody In The House"
}