{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We are not sure if Robert's wife ever found out how he spent that afternoon a few weeks ago when he stopped by and put that fat, juicy slab of cock on display in all its glory. In just a few tugs, this 19-year-old newlywed went from zero to sixty, or from 5 to 8.5' plus to be exact. And despite it being his third load of the day, he fired off a three pronged attack of cum that left his chest and stomach dripping at the end. Robert told us he loves nothing better than a good, long, deep oral examination. We also recalled our friend Yankee, whom we met on our brother site, MenOver30.com, giving straight guy Anthony his first blow job from another guy. Then we thought...one gay guy who loves well-hung, straight guys, and one well-hung straight guy who loves a good blow job: we did the math and figured that was an equation that added up to a one hot episode for ExtarBigDicks.com and damn, were we ever right.Yankee is not one for a quick dick dive or a drive-by shaft swallow. He loves giving a blow job because he sees a cock as both a literal and figurative extension of the man himself. As he starts to work his hand up the leg of Robert's shorts and under his shirt to rub his chest, Robert's head tilts back, his eyes shut tightly, and he is instantly transported into a pleasure zone. As Yankee's lips find their way to Robert's nipples and begin to nibble their way all the way down his belly, Mr. 'I will just lie back and be serviced' becomes Mr. 'This is the best head I have ever received in my life.' As he brings his hand around to the back of Yankee's head to move that mouth to his crotch, he realizes that while he has already proclaimed this the ultimate blow job, his cock is not even exposed yet. Yankee's hands begin to snake around and free that object of desire as this worship session moves from silent admiration to the 'taste test' phase.Yankee begins by swirling his tongue around Robert's cock as if he is licking an ice cream cone after a few days in the scorching desert with nothing but an empty canteen. As his tongue explores every inch from the already bloated balls, up the throbbing shaft, and finally to the head that emerges from its folds of skin in eager anticipation, his thirst changes to hunger and he begins to swallow every vein-covered inch. As Robert spreads his legs wide to allow Yankee even deeper access, he begins to take more and more control, going from a passive player to a sexual aggressor as he holds onto Yankee's head for the skull fucking they both reach the need for at the very same moment. With Yankee rubbing his shoulders, Robert leans back and shoots a load high in the air that lands with a thud right between his pecs. As for Yankee's load, he fires his nut right in his shorts with not so much as a tug: clearly Robert passes the taste test, but is he up to the 'top' test? Stay tuned, guys!",
  "models": [
    {
      "name": "Robert Long",
      "person_id": 28696
    },
    {
      "name": "Yankee",
      "person_id": 27820
    }
  ],
  "release_date": "2007-04-11",
  "scene_id": 54662,
  "series": "Service Stop",
  "tags": [],
  "title": "Service Stop, Scene #01"
}