{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Did 19-year-old Robert get snapped up by a wife at such a tender age because of his irresistible looks? Or was he immediately shackled because of that big, fat, hard uncut cock? Most likely, it was a combination of the two: she got one taste of how irresistible that mouth-watering dick looks and laid her claim--and who could blame her?! Robert exudes a sexuality far beyond his years. Every glance from that sculpted face that makes his cock not just a mere 8.5\\' appendage, but truly an extension of a young man with an unquenchable desire to use that fat slab of cock for your ultimate pleasure without any question in your mind that he was born to deliver. Though he has been a husband for just one month, and they are still definitely in the \\'fucking like rabbits\\' honeymoon stage, Robert has more than enough testosterone and sperm leftover for us at ExtraBigDicks.com. Wedding band or not, he is still true to his first love: his big, fat dick.Robert cannot get rid of his shirt fast enough and, as his hand explores the smooth territory under his wifebeater, the look on his face is immediately one of total and instant bliss. He tugs on his belt as if it were a rip cord before standing up and digging deep into his underwear, pulling the waistband low enough to expose the top of a thick, dark bush and causing the pouch to cling jealously to the meat underneath. While many guys need to be watching porn, or at least laying down to work up a full hard-on, Robert simply had to reach down, give a tug, and that mighty meat was sticking out in front of him like a big hungry branch swaying in the breeze. As he moves and mounts the couch, the intense look on his face says it all: he loves to fuck, he is damn good at it and boy, is he ever in his element. Of course, we do not mind the view it affords us of his perfectly-formed, round ass as he grinds away. But when he rolls over and that now throbbing pole slaps back against his stomach, he is looking better and better all of the time.There is a serious band of ink on his arm and another on his calf, but that cock being double-fisted in the middle is the real matter at hand. With his wedding band gleaming on one finger, his balls are already bloated, and the view from the side shows off just how thick that toy he is playing with really is. He has long grown to the point where his foreskin has been absorbed in the process of his cock expanding so much, in both the length and the width, that the perfectly formed bell curve of that fat magic is causing the head to shine like the north star as the ultimate destination that calls all cock lovers from miles away. Laying down, moaning loudly, his stroking moves to triple time, and soon his stomach is decorated with three large splats of jizz. He said there is more where that came from, as he shoots even bigger loads after he has been fucking. Do not worry guys, we are having him make good on that promise, so stay tuned!",
  "models": [
    {
      "name": "Robert Long",
      "person_id": 28696
    }
  ],
  "release_date": "2007-03-21",
  "scene_id": 54667,
  "series": "Shake Rattle & Bust",
  "tags": [],
  "title": "Shake Rattle & Bust"
}