{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Did this 24-year-old exquisite, Cafe au Lait-colored bonanza of a man acquire the name 'Natural' because a body this perfectly lean, built, and symmetrical could only be a natural phenomenon? Or was it because such confidence and powerfully compelling sexuality is something that could only be so undiluted if it was a gift he was born with? It might be either of those two, but the real exclamation is not just the crown of foreskin that was left intact, but the nine-inch thick beauty it tops! Natural is simply one of those rare specimens that packs it all between his legs, and everywhere else, as well. Despite this being his first time in front of a camera, as well as waiting until he was 17 to start having sex, or even jacking off, Natural is a man who quickly grew into his own. And from the moment he discovered just how much pleasure he cannot just receive, but give with that big cock, he became a sexual savant who knew his time had cum. He begins to work off his shirt not like he is getting undressed, but uses it like the only veil keeping the hungry eyes between his salivating fans and the object of their desire. That smooth torso gleams like a marble monument under the spotlight, each and every muscle from his wide delts to the his deeply etched abs guides your eye down to that packed crotch and the snowy-white briefs spilling out of his open fly. Under his sparse, but of course, natural bush, his cock makes its first appearance. One glance from the penetrating eyes in the center of that exquisite face sends out a 'don't worry, it is a grower' message, but as soon he starts giving that cock a gentle stroke, no reassurances are required as the evidence speaks for itself--all the thick, mouth-watering bonafide nine inches of it!His cock is perfectly straight, and even as the spear-shaped head pokes out of the hood it is all the same golden hue as the rest of him, right down to the sack housing his equally over-sized balls. We have seen guys swing their poles back and forth and he does it better than most, but it is when he turns around, bends over, and keeps stroking that pole while offering a view of those incredible ass cheeks at the same time--it was like viewing the oversized check of a lottery winner. Lying back on the bed, he hammers away before moving to the floor to fire off a load so thick with sperm, it looked like blobs of glue were dripping down his abs. He was already hard again by the time he got dressed a few minutes later to leave for the gym, and we convinced him to start his work out with another session in front of the camera as opposed to the treadmill. So twenty minutes after his first load, he worked up round two, and this one landed not on his abs, but his pecs. Guess when you are just a Natural, that is how it works!",
  "models": [
    {
      "name": "Natural",
      "person_id": 28675
    }
  ],
  "release_date": "2007-04-04",
  "scene_id": 54665,
  "series": "Nocturnal Craving",
  "tags": [],
  "title": "Nocturnal Craving, Scene #02"
}