{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Despite the 80+ ultra-hung hunks featured here at ExtraBigDicks.com, with those over-sized whopper cocks you crave, and men that run the gamut of all ages, races, body types and sexual persuasions, there are a few standouts that have become universal favorites--Nicolay and Drew are at the top of that very hot list. We introduced Nicolay only a few weeks ago, and that sexy Russian accent, fat-free fitness model body, and that instantly legendary, cum-blasting 9.5' Soviet Schlong redefine what a man produced by the most magnificent end of the gene pool should be. The response to seeing Drew's 9-inch slab of meat as he shucked off his shorts and put on a poolside stroking match made the scorching Florida sun seem cool by comparison. The man and his meat were eclipsed only by his sizzling encounter with Angel. Though no slouch in the meat department himself, it was not long until Angel lived out the fantasy for so many of you by pushing back until Drew's pubes were scratching his hole. We had completed shooting the still images for a follow up episode with Nicolay and had just started filming his video when Drew stopped by the office. We learned in Nicolay's interview that he is straight and we saw in Drew's encounter with Angel that he's definitely a top and while that would usually mean 'end of story,' today it proves to be just the beginning of one of the hottest and most unexpected pairings ever.Drew takes one look at Nicolay's pictures on the monitor and gets so hot and bothered, he switches his sexual script and decides that a taste test was in order. The 'after all, a-mouth-is-a-mouth' line actually works, and Nicolay, perhaps more persuaded with the aid of a few extra Benjamin Franklins, decides that even if 'a-mouth-isn't-a-mouth,' it is at least as good as his hand. Just like the champ he is, if Nicolay is going to do anything, he is going to do it 100%, and that includes getting that magnificent slab of meat sucked by a guy. He lays back, spreads his legs, and as Drew starts rubbing Nicolay's abs and opening his pants, awaking that sleeping giant stuffed into those tight white jeans, all Nicolay can do is lay on his back and moan. Ready for more, Nicolay tosses off his shirt and moves to get more comfortable as Drew peels off Nicolay's pants and finally gets the object of supreme desire in his mouth.Drew doesn't suck that cock as much as devour it, and much to our amazement, takes an impressive amount of that quickly rock-hard and throbbing shaft all the way down the back of his throat. Nicolay feeds Drew every inch of the meat and then lowers his balls in Drew's mouth before straddling him and giving Drew the face fucking of his life as Drew furiously beats his own considerable slab of meat in the hottest example of multi-tasking you will ever see. Laying side by side on the bed, Nicolay's hand is working double time up and down his shaft until he whips up a load that shoots clear up to the top of the pecs and drizzles down those shredded eight-pack abs as Drew pops right after. We said Nicolay does everything 100%. Since he originally came to the studios to do a solo scene, with less than a 15 minute rest, that is exactly what he does in a very special double feature. Happy Valentine's Day, Guys!",
  "models": [
    {
      "name": "Drew",
      "person_id": 28600
    },
    {
      "name": "Nicolay",
      "person_id": 28677
    }
  ],
  "release_date": "2007-02-14",
  "scene_id": 54679,
  "tags": [],
  "title": "In The Cumming Days..., Scene #02"
}