{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Before we even saw that thick uncut 9' slab of dick in all of its glory during Richard's debut here at ExtraBigDicks.com a couple of weeks ago, we already knew his lost his cherry in a bisexual 3 way and he has first hand knowledge that his father's cock measures in at double digits. We also knew this sexual savant was currently in a new relationship with none other than Angel, that lithe, sexy serving of carnal joy with an impressive eight inches of his own. Between the two of them, they are sporting almost a foot and half of wrist-thick pure Latin love muscles, and we could not wait to see them in action. The lustful gaze they give each other is even more evident in the way they kiss - they use their tongues in each other's mouths with such passion and fire that they become bona fide sexual organs in their own right. Within the first 20 seconds, Richard already has Angel's shirt off and is opening his jeans. Inside of a minute later, Angel has Richard naked, rock hard and all nine inches of Richard's meat down his throat. Richard's hand stays firmly on the back of Angel's head, and Angel's half-open jeans allow those beautiful snowy white ass cheeks to make their way to where the action is headed.Even for an accomplished cock-smith like our Angel, or 'Richard's Angel' as the case clearly now is, Richard's nine inches are testing the limits of Angel's abilities - judging by the particular shade of crimson Angels' face turns as he struggles to inhale every inch. When it comes to oral at least, Richard believes in share and share alike, as he hauls up Angel and gives his pole some attention before standing on the chair and offering his cock to Angel's once again hungry mouth. Reaching down and pulling Angel again to his feet, those twin hard poles sword fight as they go for another round of kissing before Richard tosses Angel on the bed. As if pulled by some extra planetary force, Richard's tongue immediately finds its way deep into Angel's hole. He doesn't merely give that ass a brief oral once over, but a thorough, deep probing helped by Angel backing up as he presses forward. Angel is going to need every spit soaked pass of Richard's tongue as his nine inches are throbbing hard. And we all know where that bloated fuckstick is going next.First raising his lover to his knees, Richard pulls back Angel's cock to give it a few sucks of its own before holding it in position. With one expert pass of his tongue, Richard can lick from the head of Angel's cock, pass over the vein on the underside, go up over his balls, and finally dart in his hole before returning back. A sexual multitasker if there ever was one, while he performs those oral laps, Richard also manages to open and put on a condom and lube his cock. Then, in one steady move of sexual lust mixed with the ultimate control, Richard rises to his feet, aims his cockhead at the target, and in a slow, but steady pace, presses in until his balls are dancing check to cheek with Angel's now very full, but very happy ass. Gripping Angel's cheeks like they were round handles to the gates of pleasure for them both, Richard rams forward while Angel presses back. Moving to the bed, Angel climbs aboard, lowering himself completely. He grinds away on Richard's cock as Richard jacks Angel's cock until his belly is covered with a huge load. Richard then quickly moves to add a well earned explosion of his own. No need to wonder who the lucky ones are on this St. Patty's day, eh guys?",
  "models": [
    {
      "name": "Angel",
      "person_id": 30331
    },
    {
      "name": "Richard",
      "person_id": 28691
    }
  ],
  "release_date": "2007-03-14",
  "scene_id": 54671,
  "series": "A Long Days Work",
  "tags": [],
  "title": "A Long Days Work, Scene #02"
}