{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "His 9 inches of succulent, prime Puerto Rican pinga made Antonio's first appearance here at ExtraBigDicks.com a wet dream come true. Definitely the strong-but-silent-type, Antonio exudes a level of sexuality that instantly renders you his carnal servant. When he next returned to our studio, he was still a man of very few words. Antonio showed a new found finesse for the art of the undress, and used the camera merely as a conduit for the ultimate seduction. Like a sexual savant, he teased us with the outline of that ultra-thick, massive meat through his briefs until the anticipation was as difficult to take as that ass-ripper of a dick would be. He left us clamoring for more; and, though it took over a year until Antonio returned from the Island, he walked in looking as handsome as ever and radiated that now legendary charisma. Lightning was about to strike for the third time, and the result is the most perfect storm of them all. Antonio immediately lifts the black curtain of his shirt. He slides one hand up to his nipple as the other dives deeply into his jeans, until that salami-thick pole inside strains at the seams of that packed crotch. When he stands, the clear outline of that massive meat and colossal balls, moving as he walks, looks like a coming tsunami under the light blue denim. As he opens his zipper, the sheer weight of that rock hard dick inside those straining white briefs actually pulls down the top of the waistband until a good inch-plus of his thick, dark bush spills over the top. Taking a seat, his low-hanging balls appear, and the head of his cock snakes over the waistband until he pulls it out of the leg. All nine inches are throbbing and sticking straight up in the air without the need of his hands, but he soon puts those hands to very good use.With the head of his cock rising well above his navel, the incredible length and massive width look like they've been taken from a page in the record books. And just to make sure there is no doubt in your mind that camera trickery is not responsible for what you are seeing, he grabs a tape measure to show that this is no mirage--this is indeed the cock you have been dreaming of your entire life. His balls dance in their sack as he strokes that shaft with increasing fury, even offering us a rare glimpse of that round, tight ass before laying back. Finally, after a thunderous, low moan, Antonio unleashes a torrent of white sperm that leaves his brown belly covered.",
  "models": [
    {
      "name": "Antonio Biaggi",
      "person_id": 28557
    }
  ],
  "release_date": "2007-03-07",
  "scene_id": 54672,
  "series": "Fluid Impressions",
  "tags": [],
  "title": "Fluid Impressions, Scene #01"
}