{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'Never judge a book by its cover' is a lesson that becomes truer and truer all the time here at ExtraBigDicks.com, and 25-year-old Richard drove that point home emphatically. With the typical macho aloofness speaking volumes from the devilish gaze of his penetrating dark-brown eyes, once he started talking, even for us who thought we'd heard it all, the sexual exploits this Cuban Clark Kent made us realize there is no such thing as sexual kryptonite after all. His first sexual experience was when he was barely into his teens and consisted of a bi-sexual three-way with a 22-year-old friend and a stripper. A few years later, he made amateur porn with his girlfriend of the time, and she decided to share the video with his mother. And just to keep things close to home, he also reported receiving a visual aide to act as confirmation that his father's dick measures in at 11'. Richard is indeed a chip off the old block in the meat department. As that growing slab snaking down the leg of his white jeans reiterated, in their gene pool at least, when it comes to big dicks, like father, like son.Richard was actually already an extended member of our family as he came to us by way of his boy friend, better known around these parts as slim, sexy and no slouch in the meat department himself, Angel. Anyone capable of making a married man out of Angel had to be something special above and below the belt, and Richard proved to have two very well equipped heads at that. Before we had time to even reload the camera after that live sexual tabloid of an interview, Richard had his shirt hiked up to his fur-covered pecs, revealing a dark line of hair that dead-ends into the top of his waistband, like a road map leading to the ultimate destination of choice. Licking his fingers and rubbing his nips, the sensation seems wired right into his cock. The sheer strain of a piece of meat this big forces the zipper apart until he has to haul out that thick uncut beauty of a cock...all nine inches of it.His pubes are thick and dense and lush and the perfect topper for a piece of spectacular meat that is all of those things and more. We can almost picture the image he has of Angel in his mind as he rolls over and begins humping the couch. Though the image in front of us of that tight, round, creamy white ass is more than enough to keep us satiated until he rolls over, and that rock hard, throbbing tower of meat springs back against his abs with a blood-filled thwap that echoes across the studio! That sexy dusting of hair on his bod begins to glisten as he works that meat with increasing fury until his balls are bouncing in their sack. His toes are curling, and with a low, deep moan, he covers his heaving abs with a thick load. If he is this good to watch just stroking, imagine what he looks like when he is fucking. Stay tuned guys, we will back soon with a visual aide on that topic of our own!",
  "models": [
    {
      "name": "Richard",
      "person_id": 28691
    }
  ],
  "release_date": "2007-02-21",
  "scene_id": 54676,
  "series": "Return Of The Boner",
  "tags": [],
  "title": "Return Of The Boner"
}