{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Looking like a thug and talking like a lawyer, D-Unit is hung enough for both with almost nine thick inches of tasty looking chocolate hanging off a lean, tightly muscled, well-worked body that shines like gleaming ebony. His brilliant white smile matches the color of his shirt; but even in his baggy pants, the flopping meat inside isn't matched by many men, but is the envy of most. This 32-year-old serving of overactive hormones says he loves to work his cock, and with a piece this oversized, perpetually hard and just plain irresistible, who can blame him if he jacks off at least three times a day? The idea of stroking on camera is something few men we have ever met find as exciting as he does; he could barely get his hand out of his pants long enough to fill out paperwork. From the time the cameras started rolling, the room was filled with the sexual confidence only seen in that rare, special man who knows his body and the wonders it can produce for his own pleasure, as well as the pleasure of others. He was lost in his own erotic journey, and he was going to take no prisoners. This is one big cock train we all want to ride.Lifting his shirt to reveal those flat abs, his hand makes the journey up his chest. His large, oversized licorice-colored nips poke their way out of the armhole of his tank top. The front of his pants, pulled down by the weight of a cock getting harder by the second, gives us the first flash of a lush, dark bush. While getting off, the need to seed is definitely serious business for him. There is a playful quality as he plays peek-a-boo with every flawless piece of his chest before tossing off that shirt and revealing the deep cuts on the other side of his obliques that form a perfect V guiding your eye down. Waiting in the center is D-Unit's unit. And as anxious as he is to haul it out and play...he makes us work for it, to make sure we are ready. Little does he know we have been ready for a cock this big and thick and meaty and perfect ever since we first figured out what makes our cock hard. When he climbs onto the back of the headboard, spreads his legs wide and lets that chocolate tower propel down toward the bed, it is show time folks and we can tell what is coming next is going to be an award-winning show at that.D-Unit is moaning deeply as he licks his lips, staring down as his hardening cock with a sense of first time awe and the feelings that the huge slab of love can produce despite how many times it has been at the rodeo. His cock is more than 8' before it is fully hard, as if he has learned a special technique to get it hard enough to insert but keeping an inch or three for growing room once it is inside. He gets on his knees, turns around, and displays one fine set of round, tight glutes. He even flashes the dark center before returning to his back and holding up that now throbbing meat at the base, hoisting it up and staring at it with all the due reverence a cock this big deserves. His eyes never leave that leaking pipe until he closes them tightly as he pumps up five thick quirts of well-deserved jizz. He may call himself D-Unit, but after a show like that we are calling him Grade-A Prime Choice!",
  "models": [
    {
      "name": "D-Unit",
      "person_id": 28602
    }
  ],
  "release_date": "2007-02-28",
  "scene_id": 54675,
  "series": "King Dong",
  "tags": [],
  "title": "King Dong, Scene #02"
}