{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "With his jet-black hair, deep-brown eyes and the chiseled jaw worthy of a matinee idol, Nicolay will play the leading man in your personal fantasy theater for a long time to come.  Having been in the United States for only two years from his native Russia, his sexy soviet accent drips through his speech, but it is his raw sexuality that comes through in every glance, every move, and every pose. When a man looks this good, who cares if he can talk -- but after seeing how disarmingly friendly and down-right smart he is, you will not know which head you will want to start getting to know better. Once he loses his shirt, Nicolay's smooth skin, pumped pecs, and fat-free abs come into view over what appears to be a two-fisted pole in his pants. The choice is clear...we'll get to know him only after that 9.5' pole has called it quits.As his belt hits the floor with a thud, his soft meat is already causing the stripes of his briefs to swell right along with that meat inside them. With Nicolay appearing to gaze right into your eyes through the lens, you can almost feel the warmth of his smile as he begins to dig inside his shorts. Nicolay is having a fine time working that pole up and definitely invites the rest of us to experience the same joy. I guess when you are this hung, you are not afraid to let the camera catch you soft, but he does not stay that way for long. A few tugs and he is thick, spongy and half hard. A mid-shaft grip lets us see just how fat that meat is getting. As he stands, the pole towers out above the waistband--Nicolay is quickly getting ready for his close-up. We are treated to a quick view of a pair of rock-hard glutes as he steps out of his shorts. Turning around and taking a seat, that shaft now at full attention and pointing directly up to the deep valley between the plates of those abdominal muscles--the feature attraction begins.Nicolay rises to allow a close-up view of those full, smooth-shaven balls. Though he has trimmed his bush, the outline of where the dense 'V' of hair would rise up towards his navel is just begging for a good oral exploration. His abs are so well-defined that they seem to dance in the rhythm created by his stroking. As he rolls around and humps the mattress, that perfect ass in glorious view, the look he gives the camera will make you wish you were that cushion and he was doing the grinding into you. That motion must have kick started his need to get to the closing credits, because when he rolls over, his shaft looks bigger than we have ever seen it. As his balls begin contracting, Nicolay takes his hands away for one moment, just to prolong the journey for him as well as us, a final grasp and arc after arc of jizz squirts up high in the air, creating the sexiest White Russian beverage of them all. ",
  "models": [
    {
      "name": "Nicolay",
      "person_id": 28677
    }
  ],
  "release_date": "2007-01-17",
  "scene_id": 54687,
  "series": "The City",
  "tags": [],
  "title": "The City"
}