{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "James is making his video debut this week here at ExtraBigDicks.com. While the filming is a first for this 20-year-old Cali military brat, the 'extra big' moniker is something he has been used to since he lost his cherry at age 13. Even then, the woman who seduced him right out of his baseball uniform told him he was the biggest she had ever had. He said some girls are amazed at his girth, others cannot take it all and still others just scream a lot. James has already tossed his shirt off by the time we get the camera rolling; and, going against the 'wax-till-the-skin-is-smooth-as-a-baby's-ass' trend, reveals a briar patch of dark-brown fuzz smack dab in the middle of his chest. His hand immediately drops down to the big mound in his jeans and what he grabs is definitely party-size and growing. He quickly undoes his belt, and as he opens his zipper, it is clear he is more than just a little excited. The pressure of that big meat on his boxers causes the fabric to explode out of the opening like dough springing out of a canister of 'pop and fresh' biscuits as soon as the seal is cracked. As James rubs at the base of his shaft, the outline of cock tells us he is beyond rock hard--he is throbbingly-stiff. While James bragged about how fat that pole is, he did not mention the amazing length as well. With his sexy, full lips parting for a low, pleasurable moan, he shucks the rest of his clothing and that big pole can be fully appreciated in all of its glory. He was not exaggerating... it is a two-fister in length, a real mouth-full in width, and it sure looks like it needs some attention. Once naked, we get a full view of his body, with his thick, meaty thighs and strong legs covered with a dusting of fur that continues all the way up until it forms a thick, dark carpet above that cock. Even with both hands wrapped around the middle of that shaft, there is still much visible skin both above and below his fingers; his cock just continues to grow and grow until it seems as though he could scratch the bottom of his chin with the head of that meat. Anything this over-sized would need a mammoth set of balls to fuel it up, and James has those too. As he stands and works that shaft, his nuts sway in their sack like a pair of ping-pong balls in the midst of a world championship volley. The real end game is soon evident as that sack starts to tighten, both fists return to the shaft and his belly is soon marked with a thick strand of jizz right down the center like the broken white line in the middle of the highway. Guess when a rig is this big, every bit helps!",
  "models": [
    {
      "name": "Johnny2",
      "person_id": 2
    }
  ],
  "release_date": "2007-02-07",
  "scene_id": 54681,
  "series": "Cum Again!",
  "tags": [],
  "title": "Cum Again!, Scene #02"
}