{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Sun-kissed blonde hair and skin, lip ring, tats from shoulder to shoulder and a leer composed of half a grin and half a sneer at the same time, Henry looks just like what he is: a California skater guy looking for a good time. He does not have his shirt on for long, as he loves showing off that ink. But the real prize lies below the belt. Ten inches of thick, white cut meat that even soft is impressive, but when hard, this jaw breaker will definitely clean out the tonsils of anyone brave enough to try to swallow this monster. He wastes no time digging into his pants to give his meat some breathing room. And with a salami of these epic proportions; it needs all of the room it can get.Henry has a bronco's Long Horn inked around his navel. For once this is truth in advertising, because the phrase 'hung like a bull' has seldom been such an accurate moniker. With but a casual one-handed stroke, it seems like the head of his cock will brush against his nipple as he strokes away at that meat with the nonchalance that only someone this well-hung could have. As he settles back, that meat points directly at the ceiling like the Eiffel Tower or the Washington Monument. At times, he seems as transfixed by the view of that cock as we are, in a mix of pride at what he is packing with a touch of astonishment that yes, it really is that fucking big.Henry practically rubs the lens with that shaft, as if he wants to be sure that there is a record of every vein of that fat meat, before showing off those balls which are the matched-set of oversized baby-makers that a slab of beef this big should have. As he finally kicks off his jeans, we see from the trimmed, golden fuzz at the base that Henry is indeed a natural blonde. He pulls that meat down as if he is, pardon the expression, cocking a pistol, and when he lets it go, the resounding thwap it makes as it slaps back against his belly echoes like a gun shot. As he stands, the view looking up, over those incredibly full, heavy-hanging balls down the entire length of that shaft, is like doing an aerial fly-over of a wonder of nature. Lying back on the sofa with the most mischievous smile on that face, Henry does a one-handed send off to the pent-up load in those balls and sends a spray of jizz all over that tattooed tummy.",
  "models": [
    {
      "name": "Henry",
      "person_id": 28610
    }
  ],
  "release_date": "2007-01-24",
  "scene_id": 54685,
  "tags": [],
  "title": "Crimes & Masturbators, Scene #02"
}