{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Tyrese could be the poster child for 'Holy Speak-Softly-and-Carry-a-Big-Stick, Batman!' Granted, this 32-year-old dark chocolate lover might not be breaking height records by standing 6'1', but it is that ten-inch, cut, dark slab of restless meat that even on a site called ExtraBigDicks.com, is a real throat buster that joins the ranks as one of the biggest poles of them all. Seeing those skimpy orange briefs hanging so low on Tyrese's naturally lean, smooth frame, the sheer weight of the meat inside only heightens the anticipation. The way he had to coil up his meat just to stuff it all inside those shorts made it look like he was unsuccessfully trying to smuggle a Boa Constrictor, and as he promised he was not just a show-er, but a grow-er too, the dark curls of pubes started to snake over the top of the waistband. He started by first flashing a gloriously high, tight, round ass then settled back in the chair, lowering his briefs inch-by-inch until over seven inches of still soft meat flopped out. Tyrese said he would grow...and he did!He stood up again and bent over; showing off his hole and pushing back those full balls while letting that rapidly stiffening meat dangle down like a tower of ultimate temptation. Rubbing his pecs with one hand, tugging on that meat with the other and while still sporting the sponginess indicating there was still more room to grow, the head of his cock was already more then half way down his thigh. He was beginning to breathe heavy as if getting all the blood required for an erection of this was a bona-fide cardio feat. Sitting down and spreading wide, at last we see all ten inches ready for action. He is rubbing his thumbs back and forth over a nipple that seems to be connected right to his cock as each contact with his nip makes his cock twitch back and forth hands free - but look quickly because it does not stay hands free for long!There is a sharp curve right at the top of Tyrese's shaft that makes the glands really look the head of snake, even more so as the entire pole undulates with a mind of his own. Along with his cock itself, the cum tube on the underside has now bloated to become a veritable channel and from the look on his face and the way those balls are making their climb up, he is definitely going to need the extra irrigation. With both fists working up and down the considerable length, with a deep, low moan that dark skin is soon splattered with dollop after dollop of thick white jizz that continues to ooze out of the head as his still hard cock swings in the air like a construction crane in the skyline.",
  "models": [],
  "release_date": "2007-01-10",
  "scene_id": 54688,
  "tags": [],
  "title": "The Importance Of Being Horny, Scene #01"
}