{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Beautiful Cafe Au Lait-colored skin, a strong, handsome face and chiseled tight, and a fat-free body are just the beginning of the laundry list of charms that Smokie brings to ExtraBigDicks.com this week. Despite his gentle manner and refined profile, Smokie comes to us just two weeks after being released from prison. And 'released' being the operative word here as, from the show he puts on, 'release' is something he does to an art form; and, knowing the back story elevates his show to the hardcore version of HBO's 'Oz' that was too hot for even cable. A totally lean 153 pounds on a 5'10' frame, it is that 8' muscle between his legs that must account for most of his body weight. He says he kept to himself within the big house, but I am sure that was by choice: he has just that kind of thick, heavy hanging dark chocolate that you do not need to have a sweet tooth to find irresistible. Smokie peels his shirt up from the bottom, revealing a marble-smooth, honed chest which he plays with using one hand while undoing his zipper with the other. As his jeans fall to his thighs, the still sleeping snake inside his black briefs has already tugged the waist band low on his hips, the dark colors of his bush spilling over the top. Coiled inside, the ridge of his cockhead is clearly visible even through the dark fabric as the thickness of the bulge in his hand indicates whatever is stirring inside is just as thick as it is long. Shedding the rest of his clothes off piece by piece, Smokie settles back on the bed and hauls out the piece we all wanted to see. Hanging loose in their sack, his balls look like a pair of Grade-A, Jumbo-sized baby makers full of venom, and that Anaconda of a cock is definitely getting ready to go on the attack.Sitting on the headboard and spreading his legs wide, still not fully hard, but definitely more than the 8' he claimed to have, his cock is hanging down between his legs like a tree branch swaying in the wind. Lying back, his long fingers weave their way over his shaft, behind his sack, and seem fixated on that spot behind his balls and even lower. While we cannot tell exactly where that digit may have disappeared into, it certainly seems that Smokie may not have been just the detached casual observer for the prison sex-capades he confesses to. Whatever he was doing back there definitely triggered the magic switch as that cock is now rock hard, throbbing and starting to ooze. With well-practiced, forceful and deliberate strokes, he works his fist up and down every inch of that meat until all that pent up sperm makes its great escape.",
  "models": [
    {
      "name": "Smokie",
      "person_id": 29858
    }
  ],
  "release_date": "2006-12-27",
  "scene_id": 54693,
  "tags": [],
  "title": "Anaconda, Scene #02"
}