{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "First impressions tell a lot about someone, and 28-year-old Luke, ExtraBigDicks.com's latest serving of oversized meat, is a prime example. He seems like a dirty skater guy who grew up and never lost the dirt, or rather, had it inked in permanently on his forearm along with an 'I've been so bad' half sneer that never seems to leave those full, pouty lips. The piercing blue eyes on his tan face seem to be saying, 'I dare you to watch me--- and I double dare you to look away,' at the same time. Time is something Luke does not waste as he raises his shirt slowly up from the bottom, revealing a marble smooth chest. While tweaking his own nipple with one hand, he undoes his belt with the other with the finesse of someone who has clearly traveled down this road before, most likely with that other hand on the back of someone's head as he guides it towards his crotch. His pants soon make a disappearing act, and as he stands up, there is something at attention in those blue boxers sizeable enough to be clearly visible even beneath the plaid fabric. We did not have to get much closer to see what is behind curtain number three, as by the time he sat down, that cock head was already sticking out of the waist band of his shorts.Working that meat out of the legs of his shorts, we see that spear-shaped, clipped head crowning the top of a thick shaft. Standing up, he lowers his shorts inch-by-inch, showing a natural blonde bush, mercifully untouched by scissors, trimmer or razors, against a band of milk-white skin in contrast to the dark caramel of his upper body. But it's the way the stretched elastic clings to the length of that meat as he lowers it at an achingly slow pace until it hits the ridge of his head, then finally allows that mighty organ to pop out like a can of trick peanut brittle that finally explodes in your face. Working that meat with a hand that has seen as much labor as that cock no doubt has, he does it with the bravado of a man who knows he is blessed with the goods we all want. Luke sports a pair of appropriately over-sized balls to fuel that big furnace, already causing the cum tube on the bottom to be full and pronounced with the promise of even bigger things yet to come.Laying back, spreading wide, that massive meat now so engorged that the outer tip extends beyond the edge of his hips, he lays sprawled out like a big buffet with an 'all you can eat' sign. Licking the tip of his fingers and rubbing his cock, Luke stares dead into the camera as if asking for your hand to be doing the job. As the precum begins to ooze out of the tip, a little giggle escapes from his lips as a reminder he likes being a dirty boy no matter what the date of birth says on his driver's license. He now invites the camera in close to explore every angle, including a brief shot of that fuzzy hole before turning around. With that cock head ready to rub his nips, he gushes out a load that covers his navel and lower abs to a chorus of deep moans that let us know he enjoyed it every bit as much as we did.",
  "models": [
    {
      "name": "Luke",
      "person_id": 28212
    }
  ],
  "release_date": "2006-12-13",
  "scene_id": 54696,
  "series": "Stonie's Edge",
  "tags": [],
  "title": "Stonie's Edge"
}