{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Drew is a 21-year-old, lean-bodied cum machine with an impressive 9' throbber of a cock and a face that makes him a dead ringer for Dean Winters from 'Oz' fame. In other words, Drew could be on the recruiting poster for ExtraBigDicks.com or, judging by your responses from the moment we added Drew's first episode, this perpetually horny show off would be equally at home on a 'Most Wanted' poster as well. Even in his baggy board shorts, the wet fabric clings to that big package inside and it is not long before it is begging to be unwrapped. The buttons come undone and under the cool water of the outdoor shower those brown pubes become dripping ringlets crowning the big meat looming below. Moving to the chair, Drew shucks those shorts and, still soft, his meat hangs across the pale white band of skin across his hips. Soft is not a condition that lasts long when it comes to Drew, and looking directly into the camera and flashing those penetrating eyes we can see his fist working down below, his contracting big nut sack a sure indication our pool party is just getting started.The heavy hose, with still plenty of growing room left, bobs from side to side as he walks towards us, the head already hanging below the sharp tan line where the white skin meets the tan thighs not shielded from his trunks. Laying back on the chaise, that cock now almost hard just in the grasp of one hand, makes the rest of its journey to full-blown erection with the addition of a little lube which acts like a light switch as Drew suddenly becomes as energized as that cock. With a piercing look that is half a smirk, half a leer and totally dangerous, he stands up, puts a leg on the seat and offers forth those now throbbing nine-inches to be worshipped. Double-fisting that shaft, with a good two-inches still sticking out the top, he releases it from his hands, letting it swing back and forth like a pendulum, signaling it is time to hit the starting block for the final laps.Offering a rare glimpse of that cute, white butt, unlike many well-equipped guys, Drew does look quite appetizing from the back. Like most well-hung guys, Drew gets nervous when his ass is the center of attention and quickly returns to the lounge chair and to the business at hand...all nine leaking, swollen inches of it. With that cock head now seemingly rising above his nips, he spreads his legs to accommodate a ball sack that is quickly tightening, but at the same time so bloated it looks like a pair of fuzzy coconuts ready to be shaken from the tree. His legs tremble, his lips quiver, and he covers his abs with a well-earned load. Milking the head for final last drops, even as he waves good-bye that meat shows not a single sign of softening, giving 'great' in 'the great outdoors' a much bigger meaning!",
  "models": [
    {
      "name": "Drew",
      "person_id": 28600
    }
  ],
  "release_date": "2006-12-06",
  "scene_id": 54699,
  "tags": [],
  "title": "Atlantis Meat, Scene #02"
}