{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "One of the best ways to ring in the New Year is in the company of friends. That is just as true here at ExtraBigDicks.com, and even more so when the two comrades are none other than 'Penis-Palooza' Drew and the sinner's poster boy, Angel.  Drew's 9'pole on that lean body topped by his handsome face has sported a legion of fans almost as big as that humongous pole from the moment he first dropped his drawers. Angel  is an alluring mix of a pint-sized body with an over-sized package. As much a showman as he was by himself, seeing him take charge and have his fill of Magnus and Diego, two big Brazilian studs  with big muscles and even bigger cocks, was a stellar event of epic proportions. In that mix of inside, outside, solos and three-ways, we never had had either one of these guys in a one-on-one situation to really allow the passion to spill over like the bubbles from a freshly-opened bottle of champagne. While 'old acquaintance be forgot' is sung on New Year's, the chemistry and spark between these two will never be.Right from the beginning, as they get each other out of their shirts, there is a powerful mix of passionate aggression; a curious mixture of tenderness and hunger trying to balance the desire to prolong every moment of the journey while getting to the ultimate destination even faster. Angel sucks on Drew's tongue as they grind their crotches together, then starts with Drew's nipples and licks inch-by-inch down to the waiting nine inches below. Angel's mouth seems to strain to open wide enough for a pole as fat as Drew's, as Drew spreads wide to feed Angel deeply while reaching around and exploring his tight white, round, hungry ass. Angel swings around and Drew nibbles on his sack while starting to rub that hole until Angel is moaning so deeply that Drew's cock falls out of his mouth. Drew, however, knows another place to put his meat.Flipping Angel on his back, Drew rubs his swollen meat up and down the valley between Angel's cheeks as if he's staking a claim and marking his territory. Arching his back, Angel is clearly more than ready, but wants to make sure Drew is as fired up as possible and prolongs the insertion by moving to the chair. Drew stands over him and deposits his throbbing meat into Angel's mouth like the cornerstone of a new skyscraper being lowered into place before moving him to the bed, licking his neck and fingering that hole, lubing it up in the process. Angel now takes what he wants, sitting down on Drew and his hole seems to inhale that meat in one long, slow, steady push. Giving Drew the ride of his life, Drew then flips Angel on his back and, grabbing his ankles, dives in hard before laying over him and doing push-ups that launch his cock in and out of Angel's ass with the speed and precision of a racing engine firing all 9 cylinders. They both moan even louder, and Drew bends Angel over the headboard and slam fucks that ass for all it's worth with Angel pushing back until Drew's pubes are scratching his hole. Drew fires his load all over Angel's back and ass cheeks and then, falling back on the bed, Drew uncorks a second load while Angel soon follows with a spray that arcs high up in the air and by the time it lands back on his abs, it is already 2007! Happy New Year from Angel, Drew and all of us at ExtraBigDIcks.com",
  "models": [
    {
      "name": "Angel",
      "person_id": 30331
    },
    {
      "name": "Drew",
      "person_id": 28600
    }
  ],
  "release_date": "2007-01-03",
  "scene_id": 54690,
  "series": "In Way Deep",
  "tags": [],
  "title": "In Way Deep, Scene #01"
}