{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We characterized Oscar as a 24-hour sexual opportunity just waiting to happen when we first featured him. At 26, 6'2' and an 8.8'-thick lead pipe of a cock, we have no doubt opportunities are never far, as the only thing Oscar likes better than playing with his big thick slab is showing it off. Looking leaner than last time, his abs cut up, and those angel wings flanking that great pole like a frame to draw your attention downwards, he called up saying he just happened to be in the neighborhood. He also just happened to have the latest edition of his favorite pussy magazine and it seems he could not wait to get into it and get his butt off. He says he needs to shoot at least three times a day or he gets so hard he can not even zip up his pants. ExtraBigDicks.com is always ready to help out a man in need - especially when he has just the kind of over-sized pole we love: long, fat, hard and ready.Never one for foreplay, Oscar ripped off his shirt and had one hand inside his pants within thirty seconds. Before he even had both legs out of his pants, the magazine was out of its wrapper in one hand. As he dropped to his knee, all eight and one-half inches were sticking straight up in the air without need for support from the other hand. His ball sack was already looking high, tight and bloated like this party had started a while ago and he could not wait for the guests to leave so he could get on with what that throbbing bone and tightening nuts clearly needed.Standing up, he raises a leg and invites the camera in for an undercarriage shot to show off that cock and balls moving back and forth, bobbing up and down like an engine firing on all eight cylinders. Moving to the bed, we pointed the camera down over his shoulder to get the same view Oscar was having as he knelt down and worked his own meat with the appropriate admiration for the fine piece of machinery that is between his legs. The best scenery of all was when he laid back down, his legs splayed wide, his sack bouncing, his abs flexed, the serious ink on his thigh dancing to rhythm of the well-worked hamstrings underneath, and that tower of power he calls a cock almost a blur behind the rapid fire stroking of a fist on a very definite mission. Switching arms, and then using both, he finally lets that third load of the day make its appearance, covering his cockhead and hand in the final sexual surrender for a very cocky friend.",
  "models": [
    {
      "name": "Oscar",
      "person_id": 29686
    }
  ],
  "release_date": "2006-12-20",
  "scene_id": 54695,
  "tags": [],
  "title": "Lover's Lounge, Scene #02"
}