{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Three of our favorite statistics are 6'2', 21 years old and 9' that never quite go fully soft. When they all appear on the same guy, such as our new flavor this week, Drew; it is a trifecta of hotness that has ExtraBigDicks.com all over it. A little tan, a little scruffy and very laid back in his A&F shirt and his camo pants, he reaches inside and starts rubbing that big meat like a true frat guy who thinks it is the most natural thing in the world and seems oblivious that we are there. Then, as he flashes those baby blues right at the camera, he lets us know not only is he aware of us, but that he is glad we're there as that shirt quickly comes off, those pants open up and soon he is down to blue boxers that are already at the breaking point. In less than the first 60 seconds it is very clear that Drew is big. And from the stain of precum starting to form, that big things will be cumming!Drew, looking a lot like Dean Winter's character 'O'Reily' from 'Oz,' licks his lips, locks eyes with the lens and rubs that bulge with a seductiveness many men never achieve totally naked. Then again, Drew knows what is inside those briefs. So heavy already, the head peeks out of the bottom while far from at full mast yet. He is enjoying making us squirm until we finally get the royal view of the full Monty, building the anticipation like few have the expertise, or the equipment, to do. Standing up, we can see the top of the line of his dark bush and say a small prayer of thanks that he has resisted the urge to shave his cock; guess when you are packing something this big, you need no help in making it appear larger. Finally, those briefs are history and with the head poking a good couple of inches above his navel, that big pole can be observed in all of its glory.Flanked by equally oversize nuts that hang in their hairy sack until they brush the cushion of the chair, we get a good long look at that flesh colored rocket of pleasure: veiny, thick and with a rosy cut head. A perfectly mushroom-shaped head streamlined as if by design, to go as deep as you think you can handle, then even further to give him what he needs. That meat sways back and forth, and then finally, fully appreciating the total length as he has two solid fists on that pole with a healthy bit of the shaft and the entire head sticking out the top, the camera records every movement from the perfect vantage point. Sitting on the back of the couch, his tightening nuts forcing his legs wide apart, his cock bobs and weaves all on its own before Drew grabs that shaft with one hand, his balls with the other, and looking like that cockhead could almost brush his nips, he gives the sperm in those balls their parole.",
  "models": [
    {
      "name": "Drew",
      "person_id": 28600
    }
  ],
  "release_date": "2006-11-01",
  "scene_id": 54709,
  "tags": [],
  "title": "Oz Revisited, Scene #02"
}