{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We like to do things a little differently here at ExtraBigDicks.com and a Thanksgiving feast is no exception. Let's start with a 5'7', 135-pound Angel with an 8' slab of wrist-thick, uncut Latin meat between his legs and a set of tight, round brown glutes on the flipside that are just begging for some attention. Add to that one of our biggest studs from MenOver30.com, Diego; a 6'2', 205 pound serving of Brazilian beef with an equally impressive slab of dick meat. Since there was an extra seat at the holiday table, to round things out, we could think of no one better than Magnus. Also from Brazil and also 6'2', Magnus is a bit leaner then Diego but makes up for it quite nicely with a 9' missile of a cock.  Magnus has been seen groping with Miguel right here. He and Diego have even touched each other's pole on CircleJerkBoys.com, but there has always been a big 'No, I won't do that' boundary on doing anything more...until today that is.Things start off with a bit of macho posturing as first Magnus shows off his fitness magazine-ready body---from the smooth pumped pecs, to his massive arms and down to those lean, ripped abs. Not to be outdone, Diego strips off his shirt to unveil an equally well-honed body, flaring his back to display impressively wide lats, obliques and shoulders. As they are standing there in a 'most muscular' stand off, it is Angel who steps up, reaches down and gets the guys pants off; their dicks up, letting his tongue dart from cock to cock until both Diego and Magnus are cock fighting to get more. Letting them rub and touch as they are massaged with his tongue until Magnus' cock slides out and seeks other territory in search of filling!Diego and Magnus lay down balls-to-balls while Angel rubs their cocks together like he is starting a fire, though the real hotness is coming from Angel's now twitching hole. With the grace of a well-choreographed sexual ballet, Diego straps on a condom and begins giving Angel's hole the stuffing it has been begging for, as Magnus moves to the chair and gives Angel's mouth a preview of the dick on deck. Diego's cock now fills Angel's mouth as Diego rubs his throbbing nine up and down Angel's crack in a display so hot, even the most ardent tops will contemplate taking on ride on that big piece. From his moans, it seems Angel should be paying us for this visit, because he is loving every thick, veiny inch and does not seem to decide which one he likes best. He climbs on Diego and gives him the ride of his life while Magnus straddles over them and fills Angel's mouth once again. Filled with big Brazilian meat from both ends, critical mass is soon looming. Flanked by the 'muscle brothers' on either side, Magnus fires off first with Diego soon to follow and Angel hot on their heels. With a smile on his face and a cock that never goes soft, we sure know what Angel is thankful for! Happy Thanksgiving from all of us at ExtraBigDicks.com!",
  "models": [
    {
      "name": "Angel",
      "person_id": 30331
    },
    {
      "name": "Diego",
      "person_id": 29656
    },
    {
      "name": "Magnus",
      "person_id": 27851
    }
  ],
  "release_date": "2006-11-22",
  "scene_id": 54702,
  "series": "Holy Muscle Batman!",
  "tags": [],
  "title": "Holy Muscle Batman!"
}