{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Jimmy walks in the door right from the office, still in his dark suit, shirt and tie. Pimping his way in the door with that unmistakably cocky strut of man so confident of just how big his cock is, even in all those layers of fabric it shows from a mile away. He snaps his suspenders, peels away at the clothing like the layers of an onion, and finally his gleaming, muscled set of pecs and lean deck of abs come into view like a prized piece of chocolate finally shed of its wrapper. Jimmy rubs his way down from those licorice-colored nips, past his abs and into the waistband of his briefs. Whatever is waiting inside has opened the zipper of his pants and has our sweet tooth salivating for more.Shaved pubes and a clipped head come into view surrounding a pole that is already flashlight-thick and six-inches-plus while being still totally soft. Kicking off his boxers, he builds the anticipation by turning around and flashing a backside so incredibly round, muscular, high and tight, we almost forgot for a split second the real prize is on the flipside. He bends over just far enough to offer the full meal deal: that world-class, dark chocolate ass and the heavy tootsie roll hanging down in between as a reminder that satisfying our sugar fix for the day is still in store.Jimmy lets us admire that giant from every angle, laying back, spreading wide and inviting us in close. Then with but three strokes, that dark tower rises up until his head seemingly goes past his nipples over a pair of nuts that now seems to hold a pair of bowling balls. Bending over again, he strokes from behind, letting that huge pole wave on its own power so we can appreciate every single one of the throbbing nine-inches before settling back in a rhythm fast enough to leave him, and everyone on the crew frankly, breathing heavily. With the plates of his abs shiny with sweat, Jimmy soon gets down to the real business of the day by adding a heavy dose of white chocolate to the mix, proving that a hard day at work is not always a bad thing after all.",
  "models": [
    {
      "name": "Jimmy",
      "person_id": 28220
    }
  ],
  "release_date": "2006-11-29",
  "scene_id": 54701,
  "series": "Day Wear To Nothing To Wear...",
  "tags": [],
  "title": "Day Wear To Nothing To Wear..."
}