{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "After first seeing that almost 11 x 6\\' uncut bratwurst fall out of his pants under a trimmed blond bush of that fat free body, we could not wait to get Cris over here to ExtraBigDicks.com. As on a man of any color, from anywhere, at any age, this 31 year-old German uber-stud has a world class schwantz that needs to be seen, appreciated, stroked and stroked off to if there ever was one!His muscles pour out of the sleeves of his shirt; those piercing blue eyes on that handsome face seem to look right though you and those impossibly lean abs just beg for your touch. As he sits with open, spread legs in the chair, that mound in his shorts that practically pops the buttons of his shorts open just by the pressure of something that big getting stiff inside. Now that is just the kind of calling we could not wait to answer.nAs his grey briefs cling to that milky white, marble smooth frame that displays the near perfect symmetry of a well cared for body; the incredible mound in the center contains a pink tube of flesh that literally spills out of the top. Cris crosses the room and stands over the camera, releasing that now resting heavy, hooded snake before moving over to the couch and gyrating his ass up and down in the air. His glorious glutes flex and release, showing what a fuck machine he must be when he finally finds someone lucky enough to get all of the meat inside them. Rubbing his nipple with one hand, his cock comes to life in his other hand until the now exposed head extends a good couple of inches beyond his navel.Standing once again, he bends all the way over, giving a perfect sight line to follow the darkness of his hole all the way down every inch of that shaft as it sticks straight down between those muscular legs. He demonstrates he has as much control over his own dick as he makes the head of his dance without touching it, as by now that dick has total control over you. Once he moves to the floor, his body screams to be attended to and demonstrates his supreme control, making his meat swing around in a circle. Giving it a final one handed stroke, it seems like the head of his cock is almost hitting him in the chin as his sack shrinks into a hard knot and forces down a shower of white rain. If this is how they make men in Germany, all we can say is \\'when do we leave?\\' Auf Wiedersehen! .",
  "models": [
    {
      "name": "Cris",
      "person_id": 27821
    }
  ],
  "release_date": "2006-11-15",
  "scene_id": 54704,
  "series": "The Best Bratwurst",
  "tags": [],
  "title": "The Best Bratwurst, Scene #01"
}