{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "While Santino is a name you might remember from last season's Project Runway, and indeed it would be just like him to design a namesake that is 5'9', 150 pounds and sporting a hefty, hungry, thick eight-inch pole that seems so heavy on his lean frame that it just might make him topple over. Our Santino is a mop-topped 26-year-old guy who only has one thing more over-sized then his cock; the amount of hormones that his matching bull-sized sack supplies him with as he was almost in a trance, working his pole inside his shorts from even before we had the camera rolling. When a guy is that eager to work his bone, and that bone hits the measuring tape at the eight-inch mark, we were only too happy to stay out of the way and let him get down to business.There is something just a little evil in the way he smirks at the camera, knowing how badly we want to see what is holding up the big tent, but instead he whips his shirt off first, revealing a naturally hairless chest, a pair of dark brown nips and shoulders covered with ink drawn with a sinister edge. A sigh escapes his lips as his eyes roll back and he gives us a teasing glimpse of his shaft then stuffs it back in the fly, prolonging both our torment and his pleasure in a move as sexy as it smooth. Crossing to the chair, he gets down to his briefs as his cock is now too hard to button his fly again. Standing up, his meat finally flops out, a good six inches of thick, cut meat that is barely showing signs of life yet. Santino is the kind of guy that is both a show-er and a grow-er, and he sure ain't done any growing yet.His balls are two sacks that hang low, heavy just like the meat he is swinging above them, looking like a pendulum in a tall clock tower about to trick midnight on New Year's Eve. He humps the mattress, showing off that milk-white ass before rolling over and revealing his now fully hard pole that lets us know that it's witching hour, and that his long fat cock has decided it is play time. He works that pole with one hand and his balls with the other until that sacks compact and force out a load that covers his stomach and starts to run down his thighs. Wiping the runway with sperm from his finger and milking the finals drops that leak from the head, Santino licks his fingers clean, proving that sometimes it's OK to play with your food after all.",
  "models": [
    {
      "name": "Santino",
      "person_id": 28699
    }
  ],
  "release_date": "2006-11-08",
  "scene_id": 54706,
  "series": "Lightweight Division",
  "tags": [],
  "title": "Lightweight Division, Scene #01"
}