{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Mix the laid back sexiness of a surfer dude with the body designed by the Greek Gods and throw in the dark brooding good looks of a soap opera heart throb all together and you have our Daev, our man for this week. Could you possibly want for anything more in a man? Oh yes...how about a huge 9\\' cock and oh yes, that is exactly what this package is packing. With just enough left over dumb college jock to him to be all the more endearing, he wastes no time in lifting his shirt to show off a powerful chest, ripped abs decorated with but a single line of dark brown hair, leading to the promised land wet dreams are made of.As he strips down, your eyes will scan him as if you had a bionic eye, keying into every exquisite detail of his anatomy that is, as you will see when he lets those pants and boxers fall to the ground, baked golden brown by the sun, yet totally free of any tan lines. With back side carved from marble and legs that could power a steam engine, one look at the rear view and you will want to toss him against the wall and fuck him silly until he bends over. That huge hose and low hanging sack will have you dropping to your knees and probably forgetting your own name in the process.He sits down and invites the camera in close, down the sharp ridge of his obliques to that mammoth cock, so fat, so hard, so long, that even a blind man could tell he is well hung! Using one hand, with plenty of skin exposed above and below it, it gently works out every nuance of pleasure from that considerable pole. When he holds it up straight, and the tip almost seems to touch his nips, make sure you listen closely to hear the low, primal growl that escapes from his lips over the deep moaning that will be escaping yours. He bends over again, offering us the perfect view of the best of everything including both of his heads, either one is more than worthy of a close up, but even better when we get to see them both drooling in lusty expectation. He then tenses up one final time and covers the black leather couch cushion with just the hell of a big load you would expect from a hell of a big cock!",
  "models": [
    {
      "name": "Daev",
      "person_id": 28585
    }
  ],
  "release_date": "2006-10-11",
  "scene_id": 54715,
  "tags": [],
  "title": "Ripple Me This..., Scene #02"
}