{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Troy's 8.5 inch chocolate dipped dick-sicle made its first appearance, if you looked quickly enough to catch the fleeting glimpses of that meat when Alex actually backed off it enough to be visible, as it gave Alex's beautiful white bubble butt its premier interracial pounding in a heavy duty toe curling encounter that left them, and judging from the amount of email we received, many of you with majorly empty nuts. In a different kind of first, a couple of weeks ago, Ryan offered up his ass to give BadBoy's 9.5 inch its first taste of what fucking a guy is all about and oh yes, BadBoy seemed to enjoy that maiden voyage literally. What could top all of that? Pick one from column A, Troy; one from column B, Ryan, and add in another 8' licorice stick belonging to Jailen to put the other end on this visual on how an Oreo can be double stuffed and still want more!It took all of three seconds for Ryan's hands to reach over to Troy and Jailen's crotches to get a preview of the almost foot and a half of dark chocolate he was about to sample in every way possible. Jailen and Troy were just as quick to get Ryan out of his pants and create a quick access route to the prized destination they both had their eyes on. All three on their knees, Ryan's briefs are ripped down and his bare ass cheeks teased by banging already huge, but still only semi hard, poles of Troy and Jailen. Troy then takes command, offering up the biggest dick in the room and grabbing Jailen and Ryan by the back of their heads, he uses their tongues to polish and lick his cock at will. Our threesome then moves to the bed where Ryan begins to double his pleasure, stuffing both of those big cocks into his hungry mouth...until he found a place where he wanted those cocks even more!Jailen helped spread Ryan's cheeks apart as Ryan lowered himself on Troy's cock, taking all 8.5 inches in a slow steady assault, sucking on Ryan's nipples before having a seat on the head of the bed and feeding Ryan his cock while Ryan bucked up and down on Troy's meat, loving every considerable inch. When Troy got to ramming, Ryan's moans echoed around the room as he fought to catch his breath while another 8' cock filled his mouth. He was soon flipped on his back and the guys flipped positions with Jailen doing pushups over Ryan and feeding the white boy his cock in the process while Troy face fucked Ryan just as hard as he had just tapped his ass. With all of that action, it was not long before it was time for the cream to fly on his knees between them. Ryan was treated to a double blast of thick white cum that covered his face and dripped down his chin to his chest where his own blast soon followed. Ryan definitely got his sweet tooth, along with his mouth and ass, filled that day and believe it or not, he is ready for more!",
  "models": [
    {
      "name": "Jallen",
      "person_id": 28615
    },
    {
      "name": "Ryan",
      "person_id": 30334
    },
    {
      "name": "Troy",
      "person_id": 27788
    }
  ],
  "release_date": "2006-10-04",
  "scene_id": 54717,
  "series": "Double Dipped and Stuffed",
  "tags": [],
  "title": "Double Dipped and Stuffed, Scene #02"
}