{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Curtis is a man of exotic contradictions from his first appearance here at ExtraBigDicks.com: he is of Jewish heritage but uncircumcised and while part Asian as well, with a dark, fat, heavy hanging 9', what he is packing is definitely party sized, not bite sized as common lore would have it. Many of you emailed in wanting to see Curtis in action and we ran across the perfect partner for him on our brother site, CircleJerkBoys.com, Miguel. Miguel is another man of opposites: he is a white guy with braids, and a straight guy whose first blow job from a guy left him wanting more. Since he wanted more, who better than horse hung Curtis to break that heiney open in an encounter that his backside will never forget. But from the nut Miguel shot afterwards, his front side will not be forgetting either. In fact, it was Miguel who got Curtis down to his shorts in record time, copping a feel of the bulge before shedding his own clothes and almost licking his lips in anticipation. He tugs Curtis's briefs down and in a move directly from the 'toss your salad' section of the jail house handbook, takes a seat right on Curtis's face. Curtis was more than happy to oblige and in fact, one of the hottest visions was watching Curtis's cock to all nine inches and stick up straight in the air without his hands. He got Miguel's hole for a round of exploration they both wanted to prolong and hurry up as the same time. Hoisting one leg up on the bed, Miguel allowed Curtis's probing tongue even more access while Curtis's twitching cock throbbed and leaked and was then latexed up. Enough of the appetizer, that big dick was ready for the main course. And from those deep moans, so was Miguel.With a slow and steady pace, Curtis inched that dick up Miguel's hole till his balls were brushing those ass cheeks and a look of painful laced pleasure poured out of Miguel's eye while a low primal whimper from his lips kept time with that battering he was receiving in his other hole. This was not a romantic, slow sensual romp; Curtis was fucking hard and taking what he wanted, using Miguel's ass as a personal playground. It wasn't long before Miguel was backing up into that meat and after another quick lick of that hole, he got on all fours, and Curtis climbed between his legs and reclaimed that territory with that hungry cock. After a quick round of 'hop on the hot dog,' the two lay side by side, breathing heavy, covered in sweat and very soon, covered in twin loads too.",
  "models": [
    {
      "name": "Miguel",
      "person_id": 27783
    },
    {
      "name": "Curtis",
      "person_id": 28584
    }
  ],
  "release_date": "2006-10-25",
  "scene_id": 54710,
  "tags": [],
  "title": "Carnal Cravings, Scene #01"
}