{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "The walnut colored skin of his smooth chest shines as Jack works his nipples like a man who clearly knows how to push his own buttons. But it is that gleaming silver buckle and that bulge underneath that steals the show. When he dumps his shirt and reaches down to give his meat a good grab, it isn't his crotch he is rubbing, but a chunk of rising real estate a good way down his knee. With dark, deep hair and a devilish smile, Jack is a tall thin East L.A. kind of guy that you want to get in trouble with. The minute he unzips, the meat underneath forces his boxers to spill out like you just cracked open a tube of 'Pop-n-Fresh' biscuits. He plays with the heavy hanging flesh inside his shorts until he pulls out a fat, dark uncut piece of sausage that still soft, is 6' plus, but you have to look quickly, as it does not stay soft for long.Jack's cock seems to swell as he strokes it, getting thicker and longer with every touch until it is a throbbing mass of eight inches of cock flesh, a good 6' around. With lips like two pillows that would be the perfect bed for your lips, or your cock, or both, the smile is of a man confident he brings just what you want but clearly, he is more than capable of giving himself every ounce of pleasure and sure seems to enjoy the audience. With a look like 'watch this' in his eyes, he spread his legs wide and rubbed the head of his cock open and down his own hairy ass cheeks. That must be his secret spot: his cock was instantly rock hard, throbbing, dripping, bloated and clearly on a mission to unload.Jack's sure is a grow-er and his now huge hard on swings on its own with a slight upward curve that has a date with any G-Spot able to accommodate a piece this big. It sways back and forth like a tree trunk caught in the gale wind, before be bends over and shows off his ass. With his long finger teasing his own hole, he jerks that meat with the other hand. His thick cock is so engorged, the head almost touches the mattress on the floor below. Flipping over on his back, his sack so swollen, the chorus of moans so deep and hungry, he grabs his cock with his thumbs and forefinger under the head and rapidly strokes away, spitting a huge double shooter load right on his heaving, flat stomach.",
  "models": [
    {
      "name": "Jack",
      "person_id": 28228
    }
  ],
  "release_date": "2006-10-18",
  "scene_id": 54712,
  "series": "Spanish Lessons",
  "tags": [],
  "title": "Spanish Lessons, Scene #01"
}