{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Even on a site called ExtraBigDicks.com, BadBoy's 9.5' plus portion is oversized anyway you look at it and more than just seeing it again, you wanted to see it in action. BadBoy is 100% straight and we had to reach deep into the piggy bank to entice him to let a guy have a crack at that huge pole, but reach we did. It was not long at all, from the smile on BadBoy's face, that we thought perhaps he should have paid us. He admitted to having heard that gay guys give better head, especially to an oversized pole like his. He also shared he had been frustrated more than once from pleas from ladies who could not handle being rammed with a mammoth pole like his; but that a guy would totally rock his world and take his huge meat like it has never been taken before. We ponyed up the cash, found a 'big dick specialist' in the form of Ryan, and while BadBoy is not ready to give up women, both he and Ryan had a mighty fine time. Watch along as BadBoy has man-to-man sex for the very first time right before your eyes!Ryan did his homework and knew BadBoy loved to play with own nips so even as BadBoy laid back, feeling the need to dress extra tough in his hat and mits, it was not long after Ryan started licking BadBoy's nipples that BadBoy started undoing his own belt and was anxious to give Ryan's talented mouth a test drive on that hungry cock. Standing up, Ryan gets the chance to do what we all want to: feel the enormous pouch in those black shorts to make sure what is inside is real, not just socks. He tugs down those shorts and after but a few licks, BadBoy's bad boy is rock hard and damn if Ryan did not take the huge meat all the way down to the balls before moving to the bed and giving Ryan the skull slamming of his life. He then pounds that meat on his hungry lips before squatting over him and feeding that pole with the joy of finally finding a partner who can take it all and still want more. He later straddles Ryan's face and finally grabs the condom for his first voyage inside a guy's ass. He may have giggled nervously but that throbbing cock said it all. It was time to fuck!BadBoy's cock was so hard. We could see the veins on the shaft throbbing right through the latex and with one hand at the base, Ryan lowered himself on that pole inch by inch, breathing deeply as the biggest cock he had ever taken rearranged a good portion of his lower anatomy. He took it all...every last inch and keeping it all inside, turned around to face the front and feel that huge cock from every angle possible. Standing up on the bed, BadBoy mounts and rides Ryan's ass like a jockey coming around the last leg for the triple crown, ramming in and out so deep and so fast, it sounded like a horse at full gallop until he finally pulls out and covers Ryan's back and freshly fucked ass with a massive load. He jumped up and down and broke in laughter at the end, like a kid who just discovered that the toy he never played with before makes for a pretty fine time after all.",
  "models": [
    {
      "name": "Bad Boy",
      "person_id": 28244
    },
    {
      "name": "Ryan",
      "person_id": 30334
    }
  ],
  "release_date": "2006-09-06",
  "scene_id": 54725,
  "series": "Tickle My Ivory",
  "tags": [],
  "title": "Tickle My Ivory, Scene #02"
}