{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "The accent wasn't practiced in acting class and the cowboy hat and rodeo belt buckle are not part of a costume, Bralick is a pure country kind of guy who is packing one whopper of a slab of meat that is damn close to a country mile. Well, all right, not a mile, but by any standards, a 9' thick cock is definitely big and when it tumbles off a lean, ripped frame that is a compact 5'7' in stature, it's downright MASSIVE. Bralick makes quick history of his wifebeater and his muscles gleam like a chocolate covered anatomy chart of what a shredded 6 pack, perfect pecs, pumped arms and a flaring back should look like, but rarely does. Then again, we have not even seen tube steak bulging out the crotch of his jeans yet but the way he reaches deep down inside, this country boy is fixing to change that in a New York minute and does he ever!Giving that meat a couple of warm up strokes, the solid, thick shaft pops up, the head well past his navel and almost kissing his elbow. Before he stands up, he shoves it back in his briefs and finally drops trou. As his jeans hit the floor, the sheer length and width of his cock are so big, they force the top of his briefs down so low, a good inch of his dark pubes spill out of the top. He gives us a profile shot you will want to commit to memory forever; the perfectly rounded curves of his ass on one side and the overly packed pouch, now swelling to half way down his thigh, on the other. He climbs up, the camera drinking in the splendor of that perfect ass under that impossibly small, fat free waist until he grabs his hat for a final game of hide and seek and then oops there it is; a 9' tootsie pop that is just begging to see how many licks it takes to get to the creamy center!Bralick is such eye candy from head to toe, it is difficult to know where to look first, but following down the center line of those chiseled abs, that fat, thick, meaty pink headed monster of a cock definitely commands your attention and keeps it there. Standing there, stroking fist over fist with room to spare, he is clearly enjoying stroking that pole as much as we are the view. Spreading his legs wide, that heavy sack filling the middle, the sheer length and girth now totally unobstructed and becomes forever the building blocks that wet dreams are made of. Lying on his side, every muscle gleaming, Bralick covers his lower abs and thighs with a load as thick and impressive and the mighty cock that made it.",
  "models": [
    {
      "name": "Bralick",
      "person_id": 28571
    }
  ],
  "release_date": "2006-08-30",
  "scene_id": 54726,
  "series": "Country Jerkin",
  "tags": [],
  "title": "Country Jerkin, Scene #01"
}