{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "I'm more than ready and I need to be in front of the camera' were the first words out of Big Pike's mouth and that sure got our attention. The one indefinable quality we look for is someone who will be turned on by the experience as you can tell from that ear-to-ear grin; Big Pike seemed to be having the time of his life!  Another quality we look for that is definable is size and I can give you 9.5 reasons Big Pike's nickname is well deserved - and that surely has nothing to do with his 5'8' frame. From the size of the bulge in his sweats, he was raring to go before he even walked in the door and couldn't wait to show off that massive slab of dick which was truly past the niner mark by a good 1/2 an inch, but rivaled a flashlight in terms of girth. He worked that jaw breaker into a lather and until those pearly whites of his smile were matched by little white drops he sent high into the air from that big cannon of a cock.He tosses off his shirt to reveal a deeply tanned, smooth chest and immediately goes to work, feeling that obscenely large tent with a clearly large, defined tube inside that is dying to break free. The sweats come down and we are greeted by a smooth white cute ass before he turns around and there it is; 7.5' of ultra thick cock and yes guys, he is still soft. He grabs the oil and lets it drizzle down his brown abs to his cock and after but a stroke or two, Pike's spike is at full 9: plus mast. Sitting back in the chair, we also get to appreciate that his sack is just as oversized as that meat above it and as he spreads his legs, his cock towers in the air, totally hands free, like a monument ready to welcome visitors, and were we ever ready for the personally guided tour.The expression 'his cock is so big, it looks like a third arm' has never been so true before: he strokes with both hands, lets it fall down with a thud against his thigh, but no matter what he does, that 9 ?' slab of thick meat would look huge on a man of any size, much less one with a compact frame like Pike's. He is no one hit wonder that can barely stay hard either; he seems to get thicker and longer with each stroke, until the outside is covered in a network of veins that look like the road map to heaven with a plum sized knob at the end that is meant for delivering the ultimate invitation. With those nuts now looking like they are fused together and swollen to the size of a small melon, Pike's moans increase along with the speed of his stroke and soon that huge cock explodes, the first blast circling out like the opening blast of a fireworks display. Knowing how to make a hell of an exit, a steady stream continues to dribble out of his cock even as he waves goodbye.",
  "models": [
    {
      "name": "Pike",
      "person_id": 28684
    }
  ],
  "release_date": "2006-09-20",
  "scene_id": 54720,
  "series": "Pike's Big Spike",
  "tags": [],
  "title": "Pike's Big Spike, Scene #01"
}