{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Skyler is the kind of guy we all had a crush in high school: a handsome, masculine jock who was just sensitive enough not to make fun of us yet way too straight for us to even think of talking to him. Skyler is 23, 5'8' and 145 lean but muscular pounds on a smooth tanned frame that fantasies are made of, dotted with two, small brick colored nips and a sexy tat right on his pec. Lots of laps around the tracks have given him a well rounded, firm tight ass and we can just imagine what that big package in front looked like, bouncing like a load of fresh fruit in his shorts. Skyler is more than just the guy we had a campus crush on. He is also more than just the stud that filled out his jeans with what we were sure was a huge, beautiful dick. Skyler also grew into a man who discovers he likes sex with other men and we are probably as shocked about that as he is. More to the point, getting to see, or better yet, getting to feel, taste and even ride that enigma of his cock turned out to be not the forbidden apple we always thought, but the special of the day.He quickly sheds his shirt, tugs his jeans down low enough to show off that sexy tan line and the cuts of his obliques, before looking into the camera with some of the sexiest eyes we have ever filmed. Skyler has just the kind of effortless sex appeal that draws you and makes you want more. A few rubs of his nipple and then he lays down on the bed, the motions of his undulations bringing more and more of that creamy ass into view. Finally, we get to see the object of our fantasies; we can tell just from the size of balls and the thickness of his shaft at the base, under that luxurious triangle of dark hair, that his long fat juicy slab of meat is just as tempting and sexy as the man stroking it.The look on his face is one of lusty hunger as he rubs the spot just under his balls, letting a finger slip ever so close to the no man's land between his crack. As the tip slips in, he bites his lip as if to stifle a moan. That cock is now a throbbing eight inch tower with a swollen tube on the underside and a pair of balls so hungry to unload, they are bright red. His pole is engorged with throbbing veins, perfectly straight and as thick at the base as it is just under that clipped head. As he stands and strokes with both hands, his cock hangs so heavy off his slim frame, like a mighty branch that is about to cause a tree to topple over. He thinks we do not notice as he rubs his crack once again, his ball sack now so full it works like a cock ring to keep his meat upright, the leaking head making a wet spot well above his navel. He lays back and rides the crest of pleasure until he finally unleashes a round of sperm, the first one flying up and across his body and landing on the pillow above his head. We are not sure what he will do for an encore just yet so stay tuned guys...we can not wait to see him in action either!",
  "models": [
    {
      "name": "Skyler",
      "person_id": 27857
    }
  ],
  "release_date": "2006-09-13",
  "scene_id": 54722,
  "series": "Strict Top",
  "tags": [],
  "title": "Strict Top"
}