{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Oscar looks at life as a 24-hour sexual adventure just waiting to happen, and he believes he is just the man to make it so. After seeing just how horny and hung this self-proclaimed 'fuck machine of the millennium' is, we could not agree more. This 26 year old, 6'2' hunk of man is sporting a flashlight thick 8.5'-plus club of a cock and we take him at his word when he says sometimes girls are scared of the damage it can do. We told him that is the reason you should never send a girl to do a man's job, and we are going to do our best to prove ourselves right on that point. Very seldom have we ever seen anyone so eager to get on with the show and start showing off to the point where he even made himself laugh as he stripped off his shirt.  Flexing his big arms as he laid back on the pillow, the head of his cock was already sticking out of the waistband of his shorts and extending well beyond his navel--- we knew we had a treat in store. Hope you have a sweet tooth guys, because the candy man is in the house.Free-balling Oscar can 'free Willy' in record time and within a minute, his is buck naked, kicked back and spread wide, inviting the camera in close for a flyover of that very thick cut meat with a not so gentle bend that looks downright dangerous. Once anything that big snakes inside, it seems like it will be locked into place until Oscar is good and ready to drill even deeper. Standing up, the view gets even better as your eyes go from the dark ink covering his well-muscled thigh, to those smooth balls that are tightening, yet still low hanging at the same time, then up to a lush forest of dark hair. His cock looks like it is well past the midpoint of his hamstrings, and yet as he strokes there is still a fold of skin to wrap around the now leaking head. Could this thing still get bigger? This we had to find out!Oscar gives us a quick view of his tight white ass before settling down on the bed for the final assault on Mission Sperm. The camera pans up and down his body, appreciating the well-muscled body of a man who lives life in and out of the gym. His physique is really a lot like his cock; thick, meaty and effortlessly designed for some serious sin. Perhaps something that big wears out even the most seasoned jock as he switches from hand to hand, spreading his legs farther apart, his sack stretching as he reaches the boiling point.Moaning deeply, his stomach trembling and his thigh twitching, Oscar delivers a rain shower of semen all over his pubes. This is one movie that deserves a sequel...stay tuned guys!",
  "models": [
    {
      "name": "Oscar",
      "person_id": 29686
    }
  ],
  "release_date": "2006-08-23",
  "scene_id": 54729,
  "series": "Goalie's Hang Out",
  "tags": [],
  "title": "Goalie's Hang Out"
}