{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "What started out as just another sexy, rough looking, horny straight guy coming to join the ranks of our brother site, CircleJerkBoys.com, turned out to be young man packing a surprise, and a big surprise at that. As soon as we saw that 9.5' slab of meat sprout from the tight, caramel-colored body and grow and grow and grow, we could not wait to get him over here to ExtraBigDicks.com, where that bona fide monster of a cock could be on center stage and savored by an audience that would truly appreciate that bona fide bonanza of big cock in all of its glory. Working up his meat before he can even take off his boxers, he told me he was horny, but damn, BadBoy spared no time letting his freak shine through even as that meat takes center stage!With a golden brown apple bottom, he rolls over to his stomach to show it off. Staring deep into the camera, he grinds his ass, humping his imaginary girlfriend underneath as those bull balls hang low in their sack, almost hitting the cushion below. Even giving his own ass a slap, he likes showing it off as much as taking a good hit! Once his dick is rock hard, we know once again why this boy can be bad! While stroking, he slaps the now 10' of throbbing cock against his thigh, his dick dancing like a hungry snake listening to the tunes that this charmer can play.Pinching his nip with one hand, stroking that long shaft with the other, BadBoy stares into the camera as if he is stroking just for you. He stands and begins to pump his hips, as if fucking his hand like it was a pussy while glancing straight at you to make sure your eyes are still riveted exactly where he wants them! Standing on the couch, aiming at the table below, the black curtain forms the perfect backdrop for a torrent of white cum that erupts from that cock in one mighty blast after another. We actually found a guy brave enough to offer up his ass for BadBoy to take a test flight deep into the black hole. Stay tuned guys...BadBoy proved to be an ace!",
  "models": [
    {
      "name": "Bad Boy",
      "person_id": 28244
    }
  ],
  "release_date": "2006-08-02",
  "scene_id": 54734,
  "series": "Proceed With Caution",
  "tags": [],
  "title": "Proceed With Caution"
}