{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "With those deep brown eyes, the devilish soul patch and the shiny pate, SexyOne looks every inch the slick player he is. As for how many inches exactly, here is a hint; divert your eyes to end of the ruler and look where his cockhead meets the 9' inch mark with more room to grow, but we are getting ahead of ourselves here. He makes quick history of his shirt, shoes and track pants and we first see Sexy One's sexy niner though a pair of grey boxers. He has one of those dicks we love: even totally soft it hangs a fat, spongy 7' plus and is so thick, it strains the fabric and clings to the ridge of that big head which clearly is aching to come out and play.He reaches deep into his shorts and while definitely aware of the camera, he ignores it with the detachment of man who is very secure in having what you want as he gives us the first glimpse of that very thick base. He then flops out that anaconda and we see just how thick that beauty is: cocoa brown, heavy hanging, with a lucky crown of skin. No hurrying for SexyOne, he strokes slowly and deliberately. When a guy is this hung, he is not afraid to let us see him soft and he knows we will stick around for the main event and oh yes, it is worth waiting for.Sitting down in the chair, those fat balls keeping his meaty thighs spread wide, that mighty pole finally reaches critical mass in all of its glory; the vein on the underside thick and pronounced, the skin uncovering a leaking, helmet shaped head that looks like it could almost draw a circle around the 'Sexy One' ink just above the nip on his left pec. Standing up and letting it jut out like a tree branch, squatting down on the ground and allowing it to fall like a mighty oak, then finally laying back and stroking that meat, offering forth a profile shot of just how long and curved and thick that now fully hard cock is.His head back, his balls tight, his legs scissoring back and forth, he finally surrenders to the sensations and propels out strands of white cum spreading from side to side across those dark, flat abs.",
  "models": [
    {
      "name": "Sexy One",
      "person_id": 28705
    }
  ],
  "release_date": "2006-08-16",
  "scene_id": 54731,
  "tags": [],
  "title": "Jack-a-wanna Blues, Scene #02"
}