{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Shaved head, piercing eyes, black wifebeater and baggy hip-hop jeans, Antonio is the proverbial straight gansta-wanna-be who figured a jack off gig would be some easy money but was not sure his 5'11' frame and only 140 pounds qualified him to be model material. There is one thing we have learned about these skinny guys - they usually have the thickest cocks; Antonio did not disappoint us in that respect. While a very respectable 8' in length, this lean man has the fattest cock we have ever seen and sets the bar even higher on ExtraBigDicks.com for every else to try and measure up to. There is a certain naivete in his manner; having not been hard in front of other guys or seen many in the flesh. It was a little charming a lot sexy to hear him talk; he clearly has no idea just how big and girthy that incredible slab of meat is - but did he ever come to the right place for such an organ to be fully appreciated.As he makes history of his goth-like black tank, he reveals a stomach so flat it almost defies the imagination. Those loose baggy pants soon followed the exit sign with no underwear; it was free willy in record time. Hanging totally soft, he has more than just a few guys beat in size and that thickness is more than apparent right from the start. His facial expressions and plump lips start your juices rolling as he pumps away with a slow curious detachment of a man who does not understand why anyone would want to watch. Antonio may have no idea that most guys do not have a shaft that is almost the same width of a low-hanging scrotum, but we know better. This is not the kind of flesh colored cucumber you see everyday. Once he stands up and flexes those glutes, we can only imagine his ass muscles got a real work out trying to hold up that big meat on the flip side.With one hand on the base, he works his shaft with the other, beating it into his palm with a resounding echo of a whale splashing around in the water and that cock swings heavily below a dark trimmed nest. He works that meat, alternating his hand over hand technique. Anything this big requires with deep, targeted, purposeful strokes of a man who knows every considerable inch of his cock and how to milk every ounce of pleasure from them.Then with a solid grip right in the middle, he squeezes down hard on the fattest part of his shaft, sending three rapid fire spurts of white juice high in the air that leave his abs covered and that fat cock bobbing and weaving in the air",
  "models": [
    {
      "name": "Antonio Mohadeem",
      "person_id": 28810
    }
  ],
  "release_date": "2006-07-26",
  "scene_id": 54737,
  "series": "Mr. Clean Jr.",
  "tags": [],
  "title": "Mr. Clean Jr."
}