{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Kenny, like his cartoon namesake, is a kid from the wrong side of the tracks. He did not take off his shirt to reveal his wifebeater; that white ribbed tank IS his shirt, and there is an unconventional, yet undeniable sexiness about those soulful eyes under that $5 hair cut. Could that have to do with fact he starts playing with himself before he is even undressed? Perhaps it is the outline of the slab of his soft cock, even inside his baggy tack pack, that looks like a real tonsil tickler? Is it the bushy tufts of hair under his armpits or that full, dark, natural blond bush? Or is it that he knows, as he calculatingly gives us a flash of his sleeping giant, that sexy is as sexy does, even from the trailer park, and that we are all hungry for the meal ticket between his legs?After a few sexy peeks at that slab of flesh that is rapidly fleshing out, Kenny gets up, shimmies out of his shirt and reveals a waif thin chest, tiny hard nips and upper arms surprisingly filled with muscles built by playing with that slab of meat every chance he gets. Kenny settles back in the chair, spreads his legs wide and shakes his cock and balls like a limb that has fallen asleep and feels a bit tingly. Inch by inch, that tube swells, literally growing before our eyes until Kenny stands and the full 8.5\\' of meat jut out from his body and just begs for a warm tunnel to find itself a good home.Shining with lube and precum, we can see that mighty cock has not just grown in length, but impressively in width as well with a thick base almost as wide and equally oversized as the ball sack below. Those nuts begin to tighten as a firm grip of the arced shaft leaves a good handful on top and below. He fists that pole, finally producing some of the clearest cum we have ever seen. No matter. With a gun this nice and this big, who cares if he is firing blanks!",
  "models": [
    {
      "name": "Kenny",
      "person_id": 29846
    }
  ],
  "release_date": "2006-07-12",
  "scene_id": 54739,
  "series": "Kenny's South Pole",
  "tags": [],
  "title": "Kenny's South Pole, Scene #02"
}