{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Alex has enough play in his game for an entire team. Amazing what a baby face, hungry round ass and flashlight-thick, always hard, 8.5 inches of cock can do for a guy, and Alex works it all to get what he wants not just without shame, but with pride. After seeing him with Sebastian, we learned the catalyst for Alex's big dick to move into the extra big dick category is having another pole just as big, or preferably bigger, invading that world class backside. Enter Troy, a 25 year old, 6'1' serving of mocha delight with a very tasty looking 8.5' chocolate bar that definitely set off Alex's sweet tooth. Alex had never been with a man of color before, on screen or off, and our pairing them together was not a statement on race relations but rather cause and effect; Troy can play the game as well as Alex and this was a match up we could not resist. The formula for attraction is most definitely color blind and there were no first time jitters here. In fact, during the nano-seconds between the time we finished the interview and were getting ready for the main event, Alex had already stripped down to his underwear and was yanking off Troy's shirt!Alex could not resist squeezing the bulging front of Troy's white briefs as Troy was anxiously pulling off his jeans. Troy immediately rolled on top, darted his tongue in Alex's ear, which doubled as the magic switch for Alex's leg's to move into receiving position. Blondie definitely had a fever for the flavor and was in for a very big meal! Troy grabbed Alex's ankles and hoisted them to his shoulders, like an auto racer testing out every position of the seat to find the perfect position to get in and drive. Just as quickly, he pulls Alex's pants down and swirled his tongue inside of that tight white hole. Moving from a 69 position and then standing over Alex, Troy offered forth that long, thick, uncut dark piece of meat. Alex could not decide if he wanted to just look at it, rub it on his cheek or swallow it down to the balls, so he did all three before having a seat and rubbing his hole up and down Troy's throbbing shaft like the last few bars of the overture before the symphony was about to begin.Alex's cock was rock hard and already leaking as Troy slipped on a rubber, needing a Magnum to fit all that meat inside. On all fours and hanging onto the edge of the bed to keep the force of Troy's thrust from hurling him to the floor, Alex began a chorus of never ending moans as Troy gave that aching hole the ride of its life. His arms extended like he was doing push ups, Troy piston fucks Alex before sending Alex's legs back over his head and moving in for a full scale fontal assault. Standing him up then finally moving to the chair, Alex rides Troy's meat while Troy thrusts forward till that magic spot was reached, triggering a huge load out of Alex's cock. Alex then gets on all four's, offering that freshly fucked backside as the perfect target for Troy to blast down one of the biggest, thickest loads we have ever seen, the cum still oozing from his cock as he grabs Alex for a final kiss.",
  "models": [
    {
      "name": "Alex",
      "person_id": 29813
    },
    {
      "name": "Troy",
      "person_id": 27788
    }
  ],
  "release_date": "2006-08-09",
  "scene_id": 54733,
  "series": "Jungle Fever",
  "tags": [],
  "title": "Jungle Fever, Scene #02"
}