{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Dave strips off his white shirt and peels off that wifebeater in record time, showing that this California Player isn't paying around. His laugh is deep, his smile is bright and that lean body is beautifully smooth, naturally toned and red-hot and ready. Undoing his belt like an expert locksmith and opening the zipper even faster, he holds a hypnotic gauge at the camera as he shucks off his jeans, tugs down the waist band of those skin-tight blue boxer briefs and, rising like a massive line of dark clouds on a flawless blue summer sky, a still not fully engorged, veritable slab of cock that will ultimately reach 9.5' swings into view, making it easy to see where Dave Wood got his last name from!Not just long, but so thick he can barely close his fingers around this rod at its widest point, the sheer girth on his very slim body gives that fat, black snake help it does not need to appear fully formed in all of its oversized glory. A velvety looking head at the top turns up just slightly at the end, as if pre-titled to start tunneling the real estate needed for what follows. With the thumbs and forefinger of one hand rubbing both nipples at the same time, he keeps up the stimulation on them as his other hands works up and down that shaft with the slow, steady strokes of a big-dicked man who knows the pleasures of his own body better than anyone.Looking up and over those full balls, the vein on the underneath looks like a thick track ready to carry forth its precious cargo up a shaft that seems to extend well above his navel and close to his pecs. The length and width almost dwarves his fist as he takes plenty of travel time to go from the base of that huge meat and back again in slow, deliberate motions until finally, he pulls back on the throttle and covers those dark abs with a thick white load that seems to have even caught Dave by surprise.",
  "models": [
    {
      "name": "Dave",
      "person_id": 29498
    }
  ],
  "release_date": "2006-06-28",
  "scene_id": 54745,
  "series": "The Jawbreaker",
  "tags": [],
  "title": "The Jawbreaker, Scene #02"
}