{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Broad shouldered, square necked and with a baby face hardened by a nose that has been broken at least once on the scrimmage field, Justin is that hunky serving of football player we all lusted after at one time or another, in spite of - or maybe especially because of, that more than just standard-issue cargo bay between his legs. With the impossible to resist clumsiness of a guy so impossibly straight, but with an inner porn star just dying to make a one time appearance, Justin wastes no time in showing off those meaty smooth pecs, tanned, muscled arms and a stomach that has seen as many empty beer cans as it has sit ups. This is the real deal, guys, and Justin was more then happy to show off that untouched bubble butt before putting on a half time show with a thick, hard, nine inch cock that is definitely worth going into overtime for.Seeing those golden glutes dance as he humps the mattress will get your tongue wagging, until he rolls over and shows off that cock, perfectly straight, with a flaring, extra-wide head that looks perfectly engineered to slide wide open between any surface it splits apart. Clearly he enjoyed having the camera there, but Justin seems almost oblivious to it, as if we're really a fly on the wall, catching a jock with the privacy to do exactly what he wants to in the locker room, stroking that big, fat cock until he can hold back no more. Spreading wide, he shows off an ample ass that is just as beefy and hairy as you would expect, then turns around and just lets that cock stick out at a 45 degree angle under a shaved bush, and it is every inch the extra long, twitching, straight hungry jock cock you have dreamed about. His pecs dance as he palms that cock with one hand, the other holding down a nutsack that is visibly so swollen, you can feel how heavy they are just by looking at them. As if making the 3 point conversion to clinch the championship, standing behind the chair, he first shoots his load up and over the back, splattering the pillow on the cushion in front with a sweet smile on his face as the final droplets of jizz continue to rain down from that still hard meat.",
  "models": [
    {
      "name": "Justin",
      "person_id": 29624
    }
  ],
  "release_date": "2006-06-14",
  "scene_id": 54747,
  "series": "SuperSize Me",
  "tags": [],
  "title": "SuperSize Me"
}