{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Zach Alexander is back in the house this week showing off his extra big dick. Zach is 24. Zach was actually born in Germany and now lives right outside Chicago. This week Zach is helping us welcome a new face on our site, Mr. Jeremy Bilding. Jeremy is 27 and this tall, dark and handsome hunk is originally from Denver. Turns out Jeremy was born in Denver but grew up just down the coast in Key West. If this stud was raised a 'conch' then he knows how to party. We can imagine he keeps all those hotties back home in Los Angeles on their toes. We asked these two studs what it is they enjoy the most having careers in porn. Zach says he enjoys the vast amount of interesting people he's been afforded to meet while doing what he does. 'It's pretty cool to meet great guys; have a great time; say your goodbyes and possibly never see them again.' Jeremy loves that he woke up one morning wanting to be in the industry and was able to do just that with those killer looks and that big dick. Jeremy admits he loves having a big dick because there are very few positions you can't do. Zach humbly admits, 'I believe in giving everybody the chance to be their best person; and a really good person takes a really big dick. So, I'm here to give them that opportunity. (...Thank you, Miss Illinois.) lolThe chemistry between these two was obvious even before we started so once they were let loose they immediately began to make out. After kissing for a bit, Zach takes that tongue south licking and kissing down Jeremy's smooth chest and abs. He licks at his cock through his jock strap; teasing him a bit before hauling it out. Zach swallows his cock deep as Jeremy groans in approval. Zach is definitely happy with the buffet today and he's going to town on that thick Midwestern meat. Jeremy then decides it's time to return the favor. Zach stands before Jeremy who proceeds to tease his cock through his briefs before slowly tugging them down revealing Zach's throbbing monster. Zach looks down to see Jeremy taking his cock deep as he looks up with those intense bedroom brown eyes. Jeremy isn't one to tease without a payoff as he swallows every inch of Zach's 9' cock to the hilt. Zach moans and groans as Jeremy's expert tongue and throat work his bone. They then stand and go back to kissing as they rub their huge sticks together. Fire's definitely a' comin' These two then maneuver into a hot 69 so they can get even more of those thick dicks. Jeremy decides he needs to prep that ass and does so by sliding his tongue deep inside Zach's hole. He licks and fingers that hole making Zach want it even more as he begs to get fucked. Jeremy then lies back and watches as Zach impales himself on his dick side-saddle. He holds still as Jeremy starts fucking up into his hot ass. Brace yourself! Zach does his best to accommodate that fat cock as he starts to jack his own. Jeremy definitely knows how to fuck as Zach's ass gets a proper pounding. Zach grunts and takes it like a man. Jeremy then bends Zach over and slides that cock in for more. Zach's thick dick swings like a pendulum as he gets more dick. Zach is moaning and groaning louder with each thrust as Jeremy starts to pick up the pace. Just when Zach's getting used to this position Jeremy switches things up and takes him missionary. In this position his cock is hitting all of Zach's buttons. Jeremy knows exactly what to do and starts fucking him fast and deep making his own aching cock explode. He pulls out and bathes Zach in his thick load. Some guys have all the luck.",
  "models": [
    {
      "name": "Jeremy Bilding",
      "person_id": 28057
    },
    {
      "name": "Zach Alexander",
      "person_id": 28375
    }
  ],
  "release_date": "2010-07-06",
  "scene_id": 54748,
  "tags": [],
  "title": "Big Zach Attack, Scene #01"
}