{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Inked, cropped, buff and hung, his name may be Jacob Slader but after seeing the size of the bulge in his shorts, Jacob's Ladder is more like it, as something this big needs to be climbed. Grasping what looks like a lead pipe lying across his thigh, it takes both hands just to explore all of that territory. He peels off his wifebeater, giving a lick to his own busy armpit, before running his hand over that smooth, tatted, sculpted chest, then digging deep inside, opening the zipper to get better access to that prized pole. Like a white obelisk in the skyline, Jason hauls out that pink, thick tower, slapping into his hand with such force, it echoes across the room.Kicking out of his shorts, spreading his legs to get full access to the veritable abundance in between, he uses his own spit as lube, shining up the pole, running his fingers up and down until almost nine inches of rock solid cock meat glistens. Bucking the shaving trend and looking even more manly under a thick brown bush and a sexy trail from under his navel, he plays rough with his own meat; slapping, grasping, until the head is shiny with pre. Taking a taste of his own juice, he gives us a look like there is plenty more where that came from and indeed, from the size of those swollen bull balls, we don't doubt it for a second.Right-handed, left-handed, dual-fisted, rubbing the head, squeezing the center; Jacob is like an encyclopedia of how to work a huge cock every way possible before flipping over, showing off the wide, strong, inked back and those powerhouse glutes as he airfucks the pillow like a jet engine building up the pressure for lift off. What is about to take flight is a major load of sperm. Every muscle flexes as he fists that pole with frenzied intensity. With eyes rolling back and one last growl of delight escaping from his lips, he empties his balls and, giving his cock one final slap, announces his swimmers have safely deplaned.",
  "models": [
    {
      "name": "Jacob",
      "person_id": 30465
    }
  ],
  "release_date": "2006-07-05",
  "scene_id": 54741,
  "tags": [],
  "title": "Big Artillery, Scene #02"
}