{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Kenny and Johnny are a pair of causal acquaintances. This handsome early 20's something duo has traveled socially together but never to the bedroom; until now. Perhaps Kenny had heard about that 8' cock and dirty, dirty mouth Johnny has? Could it be Johnny learned his thin smaller pal has one fat cock that is over 8.5' long? Whatever it was, from the way they were groping each other's crotches from the very start, one thing is clear; this is an encounter of friends crossing the line into lovers in one they both have secretly wanted and they started making up for lost time from the first opportunity. Shirts fly off, tongues invade each other, mouths in a lust-filled kiss that just drips in hunger, and they quickly both discover their friend is just as horny and hung as they had heard, but even more so.Beneath that sexy dark bush, Kenny's cock is fat, thick and giving Johnny's hungry mouth the skull-fucking of his life; shoving it down his throat, pistol-whipping his face. From the hard meat Johnny is playing with as he tries to swallow his friends huge meat, they both are loving each minute and inch of how it feels. Kenny lays down opposite Johnny for what he thinks will be some 69 action, only to have Johnny grab Kenny's head and feed his now-throbbing bone like a power top, telling Kenny to 'eat that fucking cock like a little slut' as he rams his bone all the way in, over and over until Kenny's lips are rubbing Johnny's short and curlies. The verbal aggression between the two of them is a powerful turn on to hear and even hotter to witness. Cooling down just a bit in a slow, deep, mutual suck fest, Kenny starts slathering on the lube as liberally as a cock this big demands, and his cock, along with Johnny's leg, are up and waiting for the anal invasion to follow.Johnny reminds Kenny to be gentle as the bloated slick head of Kenny's cock is already pressing on Johnny's ass lips. Kenny takes full control as we see his huge cock disappear into Johnny's ass inch by inch by inch. 'You like that dick in your ass?' Kenny asks. 'You like it when I go in deep!' he says as a statement this time. Johnny's moans, on the brink of the sensations only being mounted this forcefully by a dick this big can produce, literally say it all. Pulling out until the head almost appears, then slamming it back fully again and again have earned Kenny the name 'Larry Long Strokes' and he flips Johnny over on his back for the final fury before grabbing his face and giving him the facial of facials until his cum drips down Johnny's chin and onto his pecs. Johnny takes his turn, firing his load right on Kenny's cheek and chest before Kenny leans over and gives Johnny a final kiss.",
  "models": [
    {
      "name": "Johnny",
      "person_id": 27777
    },
    {
      "name": "Kenny",
      "person_id": 29846
    }
  ],
  "release_date": "2006-06-28",
  "scene_id": 54743,
  "tags": [],
  "title": "A Long Way From Home..., Scene #02"
}