{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a treat for our members as Cole Streets makes his debut on ExtraBigDicks. Cole couldn't be here at a better time since we have our most recent find back again this week to show us just what he can do with that 'girthy' cock. Yeah, you guessed it, Girth Brooks is back and he's gonna put that Extra Thick Dick to good use. For those of you who missed Girth last week, Girth is a 27 year old Massachusetts native and is one sexy, hairy stud, Girth also packs an awfully thick--not to mention big--dick. Cole is in for a real treat. For those of you unfamiliar with Cole, he is 31 and originally from San Francisco. He now lives in Miami. We asked these two if there was any place they hadn't had a chance to visit but would like to. Cole wants to explore Brazil; while Girth has his sights set on Fiji. Then we asked these seasoned travelers what they prefer to watch on TV and if they keep up with current events. Girth now lives on the Gulf coast so he likes to watch CNN since the oil spill may very well affect him. That and ESPN Sportscenter which keeps this str8 boy happy. Cole is way too busy to follow the news so he likes to watch CNN as as well since he can get a recap of everything in a short amount of time.They start talking chest hair as they start comparing. Soon their hands are roaming over their furry chests and abs which leads to more. Cole starts to suck and tweak Girth's nips as they get better acquainted. Cole doesn't want to waste any time and it doesn't take him long at all to get Girth down to his briefs. He wants to know if all this 'girth' talk is all hype. He starts stroking the massive python that's struggling to escape its cotton confines. Cole gets on his knees as he continues to stroke and tease that impressive bulge. Finally he hauls Girth's thick cock out and stares at it in awe. It's rock hard, thick as a club and every inch the cock he'd been hoping for. Cole immediately goes to work shoving as much of that cock in his mouth. Cole's jaws struggle to accommodate Girth's thick cock. Cole works that dick and those naturally smooth balls as he gets Girth hornier and hornier. The camera gives us a spectacular view as Girth fucks Cole's face. His balls slap Cole's chin as he works as much of that cock as he can.Cole then gets back on his knees between Girth's sexy thighs to suck on that cock some more. He wants to get that dick hard as a rock so he can get it deep inside him. Once Girth's cock is throbbing, Cole straddles that dick and sits right down on it. Girth just holds still as his fat cock makes its way inside Cole's tight ass. Cole grimaces as he takes that cock deep and starts to ride it as best he can. He rides that cock for a while before Girth moves him over to the couch where he has more control over that hot ass he's now fucking. He slides that beer can dick back into Cole and goes to town. Girth slams that meat all the way inside as Cole moans and begs for more. Doggie is next as Girth continues to stretch Cole's ass wide. The view we get over Girth's shoulder as we see his furry chest and abs trailing down to his thick cock piston in and out of Cole's ass is insane. 'Take that fuckin' dick, you lil'bitch!', Girth grunts as he fucks that hot hole deeper and faster. Girth can't hold his nut any longer as he pulls out and unloads all over Cole's hairy chest. Cole can't help but want a taste. Cole then sits back and takes care of his own throbbing boner as he shoots an impressive load all over his already cum-soaked frame. ...DAMN!! ",
  "models": [
    {
      "name": "Cole Streets",
      "person_id": 27983
    },
    {
      "name": "Girth Brooks",
      "person_id": 28083
    }
  ],
  "release_date": "2010-07-21",
  "scene_id": 54753,
  "series": "Girth Hits The Streets",
  "tags": [],
  "title": "Girth Hits The Streets"
}