{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It is hard to tear your gaze off those beautiful, sexy, under-the-Beetle-haircut to notice that thin cute frame, but if anything will force you to do so, it will be to wonder if Damon shoved a sock in his pocket, or if this little cutie is packing just the kind of extra big surprise that the unassuming skinny types so often unleash. As his shirt goes flying, the ink of his pecs ripples on his naturally lean, defined chest, dotted with two small dime sized nipples just begging to be nibbled on. All eyes move to that single, dark line of hair starting at his navel and heading directly south with that extra big dick of his at the ultimate destination of choice.He reaches inside his jeans, unsnaps the waist, and the sheer weight of his cock forces the zipper the rest of the way down. The pouch of his tiny skimpy black briefs are so stretched by the bulge they are trying to contain while his balls are peeking out of the bottom, until they finally are forced out of the leg and, already so full, they practically rest on the mattress under him. Finally, the spongy head of his cock comes into view and, while far from hard, the full length of his meat extends beyond the edge of his hip. He lets the camera in so close between his legs that you can practically reach your tongue out and lick that thick shaft, which has now grown into a play toy more than two handfuls high. Rising like a skyscraper from that dark bush, he looks down at his own nine inches and, with deep, loving strokes, raises that crown all the way up over the pink head of his dick in the ultimate game of hide and seek. One hand on the base, the other just under the glans, the slit is as oversized as the perfect helmet head it centers. As he works his balls, we can see that low hanging sack is rapidly tightening. With a deep, primal glare towards the camera, he fires off a load that covers his abs in a spray of white as a look of blissful exhaustion says it definitely felt as good as it looked.",
  "models": [
    {
      "name": "Damon",
      "person_id": 28589
    }
  ],
  "release_date": "2006-06-07",
  "scene_id": 54755,
  "tags": [],
  "title": "Cocked & Loaded, Scene #02"
}