{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "ExtraBigDicks is in full effect and Trey Turner joins us to make sure. Wild and hung horses couldn't keep Trey away when he heard Mario Costa and his Cuban horsecock were a' cumin'. Who could blame him? We asked these two familiar faces about some of their favorite things growing up. When it came to candy, Trey loved Nerds Rope and Mario loved Nerds as well. Favorite bedtime stories: Trey loved Little Red Riding Hood yet Mario doesn't have one that stood out. So we asked Mario what his favorite TV show was instead. 'I was living in Cuba' Mario laughs, 'in Cuba there are no TV shows'. Oops. Well here in Miami, he admits he loves to watch Dancing with the Stars along with Trey who also agreed he loves the reality TV show craze. We then turned the topic to sex off camera and asked Trey, who has been mostly a bottom for us, if the same applied at home. Trey is actually more of a top at home with his boyfriend. Mario has mostly been a top on cam for us with the occasional foray into the bottom zone. At home Mario admits he's black and white, going with the flow depending on who he's with. Well the flow this afternoon will be directed up into Trey's love canal. Objections, anyone? (...that was completely rhetorical!)Mario is sitting with Trey and asks him why he's wearing a CircleJerkBoys cap. Trey assures him that it's not important cuz they're on ExtraBigDicks and it's exactly what he wants from him as he reaches for it. They start to kiss as their hands and tongues explore each other. Mario licks Trey's impressive abs and works his tongue all over Trey's nips and chest. Trey then goes south to get a closer look at Mario's package. He slips onto his knees and pulls off Mario's shorts. Mario's uncut python is growing by the second as Trey licks at it through his briefs. Trey then sets it free as he takes a moment to appreciate what's coming. He opens wide and shoves as much cock as his mouth can hold as he starts to service Mario. Mario moans as he watches Trey bob on his Cuban meat. Mario then stands to give Trey better access as Trey continues to nurse on his throbbing cock. Trey then turns around; gets on all four and shows Mario just where he's gonna want that dick. Mario strokes his pole as he stares at Trey's hungry hole. Mario then gets on his knees to return the favor as he takes Trey's cock in his mouth, driving him wild.They take turns for a while sucking on each others big dicks and when Mario is ready for more he bends Trey over and shoves his tongue up inside that hole. Trey moans like a bitch as he whimpers at the sensation just begging to get that ass stuffed. Mario isn't about to disappoint him as he stands into position and slides in. Trey's hole takes that fat dick deep, finally getting what it needed. Mario pounds that ass deep as Trey moans his gratitude. Mario then pulls out and sits back and has Trey sit on it. Trey stands in front of him and sits right down on it as he reaches back to brace himself on the chair and ride. He mounts that cock like a seasoned jockey as that ass swallows every aching inch of Mario's monster cock. Missionary is next as Mario gets Trey on his back. Trey spreads them wide to give Mario the ass he needs. Mario slides inside and shoves his dick so deep it makes Trey's eyes roll back.  Mario fucks that ass faster and harder as Trey begs him for more. 'C'mon, fuck the cum outta me!' Trey begs as Mario starts to jackhammer into that ass. That does the trick as Trey explodes all over his abs. Mario is right there as well as he pulls out and shoots his thick batch all over Trey's cum covered cock and abs.",
  "models": [
    {
      "name": "Trey Turner",
      "person_id": 27927
    },
    {
      "name": "Mario Costa",
      "person_id": 28031
    }
  ],
  "release_date": "2011-11-30",
  "scene_id": 54758,
  "tags": [],
  "title": "Turner the Beat Around, Scene #01"
}