{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we are proud to bring you one of the 'biggest' names in the industry. Well, he may not be the biggest name around; but at 27 Girth Brooks definitely has the equipment to make even the seasoned size queen take stock. Originally from Massachusetts Girth more than lives up to his name. He has a boyish air about him yet he's definitely a manly man. The physique is delicious, the chest is defined and hairy, the smile could brighten any room and that extra thick dick would make most pray for an unhinging jaw. Lol Girth now calls Florida home and he has no intent of crossing the Mason Dixon line anytime soon. 'Fuck no' he says, 'I'm a fan of the warm weather and lack of clothing that gets to be worn here.' Girth enjoys watching CNN and the sports channel (& porn). Does that give you any clue? Yeah, Girth's a certified str8 guy. He admits he hasn't been recognized much on the street which helps. He's dating a girl now that knows what he does for a living and she's ok with it. I'm sure weighing the pros and cons she's sticking around for everything Girth brings to the table. Next week we'll get to see just what that is when Girth agrees to get some help on that thick cock of his.Girth starts to stretch as he gets comfortable. As he does, he starts to take his clothes off. His tee comes off giving us our first glimpse of that hairy chest. He keeps his chest trimmed short but long enough to form a faint happy trail down the middle of his defined abs. He has a natural 5 o'clock shadow that just adds to his sex appeal. He takes his shorts off and as he does we can already make out the beginnings of a pop tent growing in his boxer briefs. Those briefs look like they're hiding an anaconda. He grabs that thick dick and teases it as he tugs at it and slaps at it with his other hand. Girth then drops his briefs and crawls into bed with a good book. Girth does his best to read but there seems to be a huge distraction below the sheets. Girth grins as he sees the huge pop tent that's formed in the comforter. He reaches in and hauls out his massive cock. His dick is a solid 8' dick that is by far thicker than the average dick, Bubu. He strokes that aching meat with both hands as he starts to give his cock the attention it requires. Even with both fists wrapped around his monster cock there's room for more.Girth then moves over to the chair where he continues to stroke his swollen meat. He puts his left hand behind his head showcasing his sexy pits. He slowly runs his tongue along his bicep and pit which just makes his dick throb harder. Girth is stroking that meat faster as he focuses on his meaty knob. He stands to give us a better view as the cam goes in from below giving us a spectacular view of those smooth balls and that thick cock. Girth knows just how to show off what he's packing. He then gets on the couch and assumes a more revealing position as he gets on all four. He arches his back a bit as his beautiful ass gets put on display. Look all you want boys, that's as close as you're gonna get to that ass. There isn't a bad angle on this stud. He strokes that cock underhand as he shows off that sweet ass that's framed by his sexy tan lines. Girth's cock is getting close so he flips over and lies back to give that cock the release it's now begging for. He grabs that thick cock by the base as he jacks off faster. His smooth nuts pull in tight as he prepared to unload. His abs contract as he starts to moan and groan aloud as his rock hard explodes coating his furry happy trail with his thick load.",
  "models": [
    {
      "name": "Girth Brooks",
      "person_id": 28083
    }
  ],
  "release_date": "2010-07-14",
  "scene_id": 54750,
  "series": "For Wad It's Girth",
  "tags": [],
  "title": "For Wad It's Girth, Scene #01"
}