{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Nathan, that Cajun Sensation at 5'5' and 8.5' debuted last week and after the double loads he shot within 20 minutes, you all wanted to see what would happen if he had someone to play with. Enter Dexter, another small framed southern boy packing eight inches of ready-for-action cock of his own, for a match made of lust, big dicks and gallons of white lightening that can only happen with two hung guys who are clearly craving each other.  The boyish smile, the hunger in undressing each other tempered by a need to make sure they enjoy every moment, display a certain innocence as these two discover each other for the first time with the blatant passion of those who have hungry tools and know how to use them.Undoing their belts even during the interview, the chemistry started building before we turned the cameras on.  Nathan kisses Dexter's lean, hairless stomach before opening Dexter's pants to be greeted by cock so hard, the head was already a good inch-plus beyond the waistband of his white briefs.  Those eight inches soon disappear into Nathan's mouth and Dexter quickly returns the favor with a warm tongue that takes Nathan from 'grow-er' to 'show-er' in less than a nanosecond.Nathan lays back, that cock like a slab of pink meat with a life of its own hanging over his thigh, thick and swollen and begging for more attention.  Dexter dives down between Nathan's legs and tongues that hole like a master at work, which clearly sends Nathan into a state of audible and palpable ecstasy.  Ever the generous one, Nathan first hoists Dexter's ankles into the air to expose that hole and with his tongue never leaving, later flips him on all fours and continues his excavation with his finger as he rolls on a condom.  Will Nathan discover it is as good to receive as it is to give? Tune in next week and see for yourself the conclusion of this 2 part episode that will bring new meaning to the word climax!",
  "models": [
    {
      "name": "Nathan",
      "person_id": 29637
    },
    {
      "name": "Dexter",
      "person_id": 30459
    }
  ],
  "release_date": "2006-05-17",
  "scene_id": 54762,
  "series": "Double The Fun Part 1",
  "tags": [],
  "title": "Double The Fun Part 1, Scene #01"
}