{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Nookie at Nite has a new way to get you UP late: a remake of The Munsters, starring our Rico. One look at the bona fide ten inch boner on this sexy, Latin 25-year-old with six-pack abs, dark eyes and a flawlessly lean, smooth body, shows that this monster of an extrabigdick deserves a spin-off series all its own. . .and this ain't no mini-series either.  Standing 5'11' but weighing in at 150 pounds, that massive meat would be equally at home on a giant, but on this slim, sexy slice of man, that monumental bone, a full six inches thick, is a penis of truly epic proportions.Those eyeballs peering straight ahead under that widow's peak, he opens his shirt to reveal cuts in his abs that could be etched in stone, and the crotch of his jeans was packed in such a way that we knew it was time to break out the wide angle lens. Rubbing his nipples, massaging that bulge, he lowered his jeans as if waiting one minute more would cut off circulation to something that needs a generous hemoglobin supply. There isn't just a tent or mound in those white briefs; it looks like he tried to smuggle a zucchini through customs. The head literally stretches and pushes the fabric above the waistband until he finally tugs the bottom open and hauls out a full ten inches of meat that goes so far past his navel, it almost looks like it will rub the bottom of his chin.The length of Rico's cock would be apparent even to a blind man, but look down at the base:  When you see the diameter of his cock equals the entire span of those eager-to-spill balls below, you truly appreciate just how fat this joystick is.  He licks his fingers and, starting with those balls and working his way to the edge of the skin, he shines that curved dong and, barely leaning over, works his hard nipples with his cockhead - just because he can.  Yes, his cock really is that big. Finally lying back, he fires off jet after jet of sperm that lands well onto his pecs and finally settles on the thick brown bush. Since they never really kill off the monster, and since he always reappears in a sequel, we can't wait to see Rico's sequel: Monster Balls! ",
  "models": [
    {
      "name": "Rico",
      "person_id": 28192
    }
  ],
  "release_date": "2006-05-03",
  "scene_id": 54766,
  "series": "Suave and da Boner",
  "tags": [],
  "title": "Suave and da Boner"
}