{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Chad Davis is back on ExtraBigDicks this week and he's just in time to welcome back a recent new find to the fold. For those of you unfamiliar with Chad, Chad comes to us from the West Coast of the Sunshine State and this 21 year old, hung hottie packing 8 thick inches of sunshine never fails to deliver. Our hung newbie making his second appearance is Chris Cox. It's definitely an appropriate name since he's packing 9 thick inches below the belt. We're sure this dark haired Cubanito of 25 years will fit in just fine. We wondered if they like their men smooth or hairy. Chad loves twinky boys so he loves them smooth while Chris likes them in between. We then asked if there was anything they would change about their dicks. Chris wouldn't change a thing. Who could blame him? Chad has a small flaw on his he could live without but we're sure a bunch of size queens would hardly notice that blemish on such a hot cock. You KNOW who you are! <evil grin> Well enough talking about cock and lets get this party started... The hands are doing the talking as these two start things before we do. They start slowly making out as their cocks begin to struggle to get out. They won't need to wait for long as they stand and start to undo each other's pants. Their pants hit the floor in unison and the underwear come off just as fast. They each grab the other's joystick wanting to play with their new toys. They are both hard as they tug and stroke on each other's meat. They playfully cock fight with their throbbing dicks for a bit before Chad goes down for a better look. He opens as wide as he can as he starts to suck on Chris' Cuban cock. Chris wastes little time before fucking his face. Chad's cock is rock hard as he jacks it while servicing Chris' meat. Chris then gets Chad to lie back so that he can return the favor finally giving his meat some much needed attention. Chad gasps as he watches his dick get worshipped by his new hung buddy. 'Open that mouth wider', Chad orders as he gets his knob polished. Chris' mouth feels gr8; but Chad's cock will need more than a warm mouth to do the trick.They sit back side by side and stroke each others cocks til Chad's cock is rock hard. Chris gets into position as Chad lies behind him and slides his thick dick home. Chris takes it like a champ as Chad starts to nail his ass. Chad's smooth balls are soon slapping away that ass as Chris takes a pounding. Chris' cock is rock hard as he gets that ass fucked. He bounces him on that thick dick with ease. They switch it up as Chad sits back and has Chris take more of his cock in a reverse cowgirl position. Chris' cock bounces like a trampoline as he rides that thick cock. When he does stop bouncing on Chad's dick; Chad picks up the slack slamming his club up into his hole. They are working each other into a frenzy as they maneuver into missionary. Chad buries his dick deeper and deeper as he takes that hole. That does the trick as Chad's cock trips Chris' GO button getting him dangerously near climax. 'Let me see your load!' Chad grunts as he fucks him deeper. Chris can't help but nut all over himself. Chad then pulls out and explodes drenching Chris with his thick nut. Whew.",
  "models": [
    {
      "name": "Chad Davis",
      "person_id": 28421
    },
    {
      "name": "Chris Cox",
      "person_id": 28468
    }
  ],
  "release_date": "2011-05-18",
  "scene_id": 54760,
  "series": "School of Hard Cox",
  "tags": [],
  "title": "School of Hard Cox"
}