{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Chrome-domed, mocha-skinned Achilles is just the kind of horse-hung, ghetto fantasy of your dreams: pick the player right off the street corner, pull him away from his ladies and have him show you just how big his meat is...if he would let a guy see it, that is. On the down-low, Achilles told us he always wanted to show off his stuff and as you will see, there is a lot to show! There is a tight, lean body under that oversized white T, and as he dropped his jeans and we saw what was banging around inside those boxers, we knew that oversized tool was meant for extrabigdicks.com, and we couldn't wait to see every inch.nHe teases us like a pro, rubbing that mound in his running shorts, playfully patting the bottom of his balls and the head of his cock - our jaws dropped when we saw just how far down they hung. Grabbing the bulge and squeezing it, you could almost feel the sheer weight of them. He shows us his balls first; huge eggs inside of his sack, naturally smooth and seemingly so oversized, they hang down his thighs farther then some guys' cocks do.  Reaching into the top of the waist band, he tugs it down to reveal a thick black nest and then finally, he unleashes the meat...and what a slab of meat it is.  Still only semi-hard and already a good 8' with a wicked curve and a shiny, leaking helmet of a head, this ten-inch fudgesicle looked good enough to eat. Stroking that cock with both hands, the amount of meat still sticking out was extraordinary, as was just how much space his nuts took up between his thighs...too much for him to even close his legs. Lying back, he takes his hands away and makes his cock stand, bob and weave by itself, like a mighty anaconda hissing and getting ready to spit. Those gigantic eggs started to gather and soon his sack was high and tight as if his body had inhaled his babymakers. Achilles lets out an 'oh yeah', so low you can barely hear it, and then lets out a load even a blind man could see. The first blast covers his abs, the second blast hits him right in the neck, and the third fills in the middle.  Ebony and Ivory never looked so good!",
  "models": [
    {
      "name": "Achilles",
      "person_id": 28548
    }
  ],
  "release_date": "2006-04-03",
  "scene_id": 54774,
  "tags": [],
  "title": "Super Fly, Scene #01"
}