{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "The blonde hair and baby face didn't fool us one bit.  Even a 'hello' from Alex's seductive full lips says it like it is: the only thing Alex likes more then talking about sex is having it.  8.5 inches of thick, curved meat up front and an ass that defines what a perfect butt is all about are just the beginning of the assets Alex brings to the table as this 19-year-old is as cocky as anyone this cute and hung has a right to be.  He told us last week he needed some dark-haired, dark-eyed, horse-dicked stud to bang him into the headboard, and we knew just the stallion for the job...Sebastian!Sebastian is a 21-year-old thoroughbred we raced over from our brother site, CircleJerkBoys.com, who is impossibly handsome, incredibly buff, and incomparably hung with just the kind of fat, eight inch slab of thick, uncut meat that wet dreams are made of.  Having guided him from a solo debut, to an encore, to watching a couple fuck, to participating in a red hot four-way last week where he not only got sucked, he even sucked some cock too, we knew Sebastian was ready to try for the triple crown.  And Alex was just the jockey to ride him!Sebastian starts off rubbing Alex's back before Alex quickly has his tongue down Sebastian's throat and his hands down Sebastian's pants.  The passion escalates until they cannot wait to strip each other. Sebastian's tonsil got an up close and personal visit from Alex's huge cock and, after another around of deep kissing, number 69 was off and running. Soon a condom was being slipped on Sebastian's cock. Alex climbed on top and lowered himself steadily until Sebastian's balls were rubbing his cheeks and, without breaking position, they kept the deep drilling up even as they moved to the chair and then back to the bed as Alex grabbed the headboard and pushed his hungry hole back to meet the thrusts of Sebastian's mighty cock. Grabbing his shoulders, Sebastian pounds away at that very hungry, but very happy hole of Alex's who moans with a sexual hunger and delight that drips off the wall like the beads of sweat down Sebastian's back. Sebastian pulls out and covers Alex's cock with a massive load while Alex's own pole fires off at the same time, making a winner's circle of jizz.",
  "models": [
    {
      "name": "Alex",
      "person_id": 29813
    },
    {
      "name": "Sebastian",
      "person_id": 30166
    }
  ],
  "release_date": "2006-03-17",
  "scene_id": 54779,
  "series": "Winner Take All",
  "tags": [],
  "title": "Winner Take All, Scene #02"
}