{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Once the camera starts clicking away, it's not uncommon for a case of stage fright to freeze models in their tracks.  Then there's Justin!  This 21 year old doesn't have a shy bone in his body, especially that ten inch one in his pants. As amazing as the length is, it's how unbelievably thick it is that's the real jaw breaker.  Even totally soft, especially hanging on that tight, lean, young frame, his cock has many a guy's hard-on's beat in size, and as horny as he is, it's not soft all that often.  He got so turned on during the biography chat that he started reaching up his shirt to rub that smooth chest while the other hand went down his pants to give that huge spike the attention it deserved, creating a tent that could provide shelter for a family of four.  We couldn't wait to get him back in the studio for an encore!Those pants came down and, though far from rock hard, the head of his cock already hung a good inch or two beyond the fabric of his boxers. He gave the 'shorts' in boxer shorts a very literal meaning and a hell of a visual.  He teased us by starting in a pair of loose boxers, the huge head poking out the bottom while he was still soft. Next, he slipped into a pair of boxer briefs which didn't look as much like a tent in there as a lead pipe, and then finally popped on a pair of black bvd's that couldn't even hold his big long hanging balls, much less that huge meat. We were dying to see that hose in all its glory again. He grabbed a full sized stapler off the desk and it looked like a pen knife compared to his hose . . . and he was still soft! But not for long.  All ten inches stuck out like the mighty tower that it is. He walked over and made a scan of that giant meat, hopped on the table and covered the print out of his own cock with a white gusher that shot from his cock like a pressure cooker ready to explode while his body trembled from the sheer force of expelling that much cum out a dick that long!",
  "models": [
    {
      "name": "Justin",
      "person_id": 29624
    }
  ],
  "release_date": "2006-03-24",
  "scene_id": 54776,
  "series": "BigTen Inch",
  "tags": [],
  "title": "BigTen Inch, Scene #01"
}