{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Young, hung and full of cum can sometimes be just a catch-phrase, but with the two guys we have today, and one of them with the 8.5' thick, cut spear like Jarrett, it's not just words, but a description of the players and action involved in this week's scorcher of a tail tale.  We have seen Jarrett working his huge cock alone, and then there was that famous oral fest with the even more hung Kiko, but today we get to see Jarrett do what he does best: fuck. From deep, passionate kisses to Jordan inhaling Jarrett's considerable cock, their lust for each other is evident from the minute the camera starts to roll.  Jarrett's throbbing cock formed a lump in his tight, lycra shorts that Jordan needed to admire.  Who can blame him?  Seeing something so thick and so long on a guy this hot in shorts is a scenic vista that makes you want to grab that bone and never let go.  Jordan's long, sensuous tongue and deep throat engulfs Jarrett's cock to the base before the two move into a red hot 69 where Jarrett's tongue finds that Jordan's hole is ready for some serious attention.  Jarrett is just the man to give it to him.Lubing up Jordan's ass, Jarrett moves him into doggie position and begins a slow insertion, easing that considerable sausage into his hole. Jordan's eyes rolling back into his head, soft moans and the pressing forward of his hips indicate just what a great top Jarrett is.  Jarrett rolls him over into missionary position, grinding his pelvis into Jordan.Fevered by Jarrett's pitch, Jordan climbs on top and rides that meat like an athlete vying for the most valuable player trophy. With Jarrett's cock impaled through Jordan's hole and Jordan's tongue down Jarrett's throat, being filled with Jarrett from both ends was Jordan's last inning of an explosive finish right onto Jarrett's abs with Jarrett's quite considerable load soon to follow. They are still young and still hung, but no longer full of cum - just as it should be!",
  "models": [
    {
      "name": "Jarrett",
      "person_id": 28618
    },
    {
      "name": "Jordan 1",
      "person_id": 30239
    }
  ],
  "release_date": "2006-04-17",
  "scene_id": 54770,
  "series": "The Tight End",
  "tags": [],
  "title": "The Tight End"
}