{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "On his tasty, slight, 5'6' frame, Anthony's nine uncut inches loom like a sun rising over the Ecuadorian mountains.  Some guys are blessed from head to toe.  Others have one uniquely superior asset they have learned is their calling card.   We know what Anthony's is: that fat joystick has tickled many a set of tonsils and from the way he displays that world-class ass and quivering hole, it seems he also likes to have his own itch scratched from the inside as well.  Like a pint size Zorro, Anthony is blessed with the Latin heat. In his case, it simmers slowly, like a pot of arroz con pollo over a low fire, and then before you know it, it's time to eat and damn, he's packing the family-size value meal at that.From the first caress of those hard nipples on his smooth chest, Anthony doesn't cut right to the chase. He works every inch of that hairless body like a well-played instrument of incredible sexuality. When he unzips his jeans, the mound inside his white briefs spills out the top like a can of pop and fresh dough exploding from the wrapper. His dark bush, with coal-black, stick-straight hair comes into view while that chorizo dances just under the waistband. Flipping around, dropping his shorts and bending all the way over, our view of those inches is hanging straight down between a pair of the smoothest, roundest, mocha-colored ass cheeks we have every seen.Flopping back in the chair and spreading his legs wide, he works his hole with one hand and his cock with the other before using both palms on either side of that mighty shaft as much to make sure we can appreciate every inch as to deliver himself every drop of pleasure possible. This is a man who knows how to play his body like a fine instrument, whether it's for his own enjoyment or for a command performance from an appreciative and very luck patron. Grabbing the baby oil, his pole glistens, his hole shines and the seduction is complete in its perfection until he can stand it no longer and launches a quarter of white ropes that still drip down the sides of that slight brown frame like white icing on a milk chocolate bar.",
  "models": [
    {
      "name": "Anthony",
      "person_id": 27804
    }
  ],
  "release_date": "2006-02-25",
  "scene_id": 54785,
  "series": "The Dong Song",
  "tags": [],
  "title": "The Dong Song, Scene #02"
}