{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Pierce is only 24 years old and has already accumulated a wife AND two girlfriends. With a body this fine and 11.5 thick inches of meaty, heavy hanging, succulent breeder meat, its a wonder they didn't kill each other fighting for the right to get that magnificent bone!  We first met him on CircleJerkBoys.com and with a 'penis colossus' like his, we had to bring him back - this time just for a command performance on ExtraBigDicks.com.  When you see how he got his nickname, you will have a visual for the term 'family jewels' that will send you right for the lube.Square jawed with blue/green eyes giving you a come hither stare, he almost dares you not to look down over that expansive chest, bulked arms, hard nipples and not follow the trail of dark hair right down into the top of those boxers. But Pierce wastes precious little time hauling out that 11.5 inch beauty and with but a few strokes, the sleeping giant is wide awake and ready for action.  The mighty head emerging from the skin as he strokes that great shaft, the silver beads on the underside take a gleam from the dripping precum as the camera sneaks in a back view to show a perfect, apple-shaped ass while he reaches below and tugs on his balls as if the coiling sperm needed more room to begin their journey.Devoid of any curve or bend, there isn't just one spot we needed to be in to appreciate the length and width of this perfectly oversized pole.  Pierce's tool was a marvel to behold and looked plain old huge from every angle in the room. Pounding away with both hands to make sure we got to appreciate it from all angles, at one point it's so engorged with blood it sticks up straight in the air and just begs to be mounted. Making sure he discovers the ultimate vantage point so his prowess can best be appreciated, Pierce stands up and sends down a hail storm of jism that lands all over the table top like a side dish creamier than fettuccini alfredo, and with more protein than tofu.  BONE appetit!",
  "models": [
    {
      "name": "BLD",
      "person_id": 28568
    }
  ],
  "release_date": "2006-02-18",
  "scene_id": 54786,
  "tags": [],
  "title": "Mr. Swing, Scene #01"
}