{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Alex is a bit of a sorcerer and he has one whopper of a wand that can magically turn givers into receivers with just the kind of heavy-hanging, curved cock that makes even a breeder's palms feel itchy!  But in hindsight - a fine sight in this case - Alex is also blessed with an ass that is meant to be filled.  Devoid of any tan lines, we can just imagine the commotion he must cause on the nude beach with that 8.5 inch hose swinging on the way there and world-class booty on the way back.  There is no shame in Alex's game.  He has a sexual confidence way beyond his 19 years and with an extrabigdick like this, who can blame him!We only wish we could see what he was picturing in his mind as he was not just turned on right from the start, but literally squirming in his seat, reaching deep inside his pants and hauling out a pole that while not even totally hard yet, was already sporting a wet head that went past the ring in his naval. Turning around and flexing his glutes in a way that makes you want to grab him and give him a good long ride, he rolls over to finally show off a pole that could easily seat a party of two. Smacking the fat schlong in his hand with a crack that echoed in the room, he lets it hang and shows off a slow, wicked curve with a pair of elephant balls to match. Rolling over on his back, he begins to fuck his hand, pumping his hips and, in a move that surprised us, he found our little pocket rocket and just happened to place it under the cushion for safe keeping...though safe cracking seems be more what he had in mind!With the vibrator turned on, he lets it dance across his shaft, spreading his legs wide until his ball sack is so swollen it literally dangles off the seat of the chair. He stands up, the full profile shot of that huge cock, which now resembles the handle of a paint bucket, and we were awestruck by the thickness, the length and the curve of that meat, and just how far down his thighs his balls hung. That pocket rocket pulled a disappearing act and standing up, the vibrator hitting that magic button in Alex's backside, he fires off a load that leaves certainly nothing up his sleeves, but nothing in those balls either!",
  "models": [
    {
      "name": "Alex",
      "person_id": 29813
    }
  ],
  "release_date": "2006-03-10",
  "scene_id": 54781,
  "series": "Mi So Horny",
  "tags": [],
  "title": "Mi So Horny"
}