{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Today we meet little Nathan, the Cajun Sensation, and while the sensation part is true, that heaping helping of Jambalaya between his legs is definitely a double handful and then some. 8.5' of thick, cut dick is definitely a mouthful by standard and when it's jutting forth from a compact frame of 5'5' and 135 pounds, it becomes a sight to behold.  With milky-white skin and endless energy, Nathan is a self-proclaimed grow-er, not a show-er, and if anything, he was being modest.  And more than just big, everything about his cock is so right; he may have one of the most perfect cocks we have seen in quite some time.His body is naturally lean and as he begins stroking to awaken that sleeping giant, we were struck by the fact that while they were still loose, his sack looked so full you could practically hear an ocean of sperm sloshing around inside. Taking his time and relishing every sensation, he spreads his legs wide, showing off a tender rosebud between those milky white cheeks while his sack continues to swell right along with his cock until it's bloated, throbbing and soon firing off a load that splats across those smooth pecs.  This is where most guys finish, but Nathan was just getting started.We thought he was getting dressed to leave, but he quickly kicked off his shorts, producing a rock hard cock that was ready for air time. No playful, drawn out strokes this time around; that meat was bone stiff and Nathan quickly got lost in the sensations as he seemed to use his whole body to produce a second load that was far from a simple dollop, but rather a credible blast that landed on his abs this time. With two loads in 20 minutes, I wonder what a machine he must be with a partner. Stay tuned, guys.  I will be back soon with a visual!",
  "models": [
    {
      "name": "Nathan",
      "person_id": 29637
    }
  ],
  "release_date": "2006-03-03",
  "scene_id": 54782,
  "tags": [],
  "title": "The Cajun Sensation, Scene #01"
}