{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "For the big meat fans out there, an extra big dick is welcome any place, any time. But for the true massive meat connoisseur, it's those places you would likely never find yourself where the ultimate big dick dreams leads you to haul out cock and star in the epic of your hottest desires. Picture yourself being tossed into Cell Block 8...you know you always wanted to share space with those men from Oz and wanted a cellmate like Duke: Incredibly straight, covered in ink, mean looking, tight bodied and a basket that won't quit and a sex drive to match.Duke is your hottest fantasy and biggest nightmare all rolled into one. He just drips 'badness,' yet when he smiles, there is just a hint of the angelic kid this tough guy grew into. When he slides off his jeans, you can't miss the mound in his shorts and when those boxers hit the floor, he has the kind of cock we love: while still soft, he is longer and fatter than some guys are hard. When a flaccid cock is 6', we know were about to see a whopper and as he licked his fingers to rub the meaty head, it was long before he was at full mast, muscled thighs spread wide and working that pole that a man who loved his dick as much as you will.Letting go of that hard exterior but never loosening his grip on that big fat cock,  Duke waves his dick to the camera man with a smile, delighting in the attention and liking how it felt to put on a show he had held inside for too long. Not much of a mover or a talker, then again, with a cock this fat and this long, he doesn't have to say a word.  The bull size balls hang heavy too and when he lies back, the head pops out of the skin and lands with a thud on his tight inked abs well above his navel. He switches hands repeatedly as he jacks - as if stroking something that fat tired his grip. With no warning, he leans to the side, squeezes his meat in the middle and eight, count 'em eight ropes of cum go creaming out and project so far...take a good look at the cum stains on the bed that extend all the beyond the mattress!",
  "models": [
    {
      "name": "Duke",
      "person_id": 28601
    }
  ],
  "release_date": "2006-01-27",
  "scene_id": 54794,
  "series": "Pink Ice",
  "tags": [],
  "title": "Pink Ice"
}