{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Kevin is the kind of tall, thin 19 year old who looks like a stiff wind would knock him flat on his cute little ass. But don't start calling 9-1-1 just yet; this Laguna Beach Boy is packing a 9 1/2' built-in kick stand that is half a foot in diameter with elephant sized balls to match.  I have a feeling that it will break his fall and if you are lucky, it might just break some new ground in your windpipe or lower digestive track as well. Even on a site called ExtraBigDicks.com, this fair haired boy is packing more than his fair share! His skin is alabaster white and his hair so pale, the sparse tufts under his arms almost disappear as your eyes travel down that smooth torso and see the first hint of the bad boy he is in the rising sun inked on his lower belly. When you see how packed those briefs are just below while he is still fully soft, you will have something rising too.  The head tumbles out the leg, as if the fabric could simply not hold it back any longer. An elephant sized nut sack soon follows, already heavy with the promise that the mother of horse-hung white boys has a mother load as well.Standing up, fully boned, that cock extended out in front of him like a bent tree branch that serves as a guide post hikers can see from the far distance, the sheer length and thickness can fully be appreciated as it literally dwarfs the hand that strokes it. Bending over, massing that bone from the back, he spreads wide and shows the road less traveled.  Anyone this hung winds up being a top by default but the way he massages those ass lips and his cockhead at the same time, you have a feeling our Kevin will be happy to take one for the team and might even be a little overdue. His tightening balls indicated one hell of a load was overdue too, and soon the first white drop landed well above his pecs while the rest decorated his abs and a steady stream continued to drip from that great white hose. ",
  "models": [
    {
      "name": "Kevin",
      "person_id": 29445
    }
  ],
  "release_date": "2006-02-11",
  "scene_id": 54790,
  "series": "The Dong Song",
  "tags": [],
  "title": "The Dong Song"
}