{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This Puerto Rican 6 foot Papi is seductive with every look and move and on that tasty lean frame, is the ultimate Holiday treat: a throbbing, uncut, ultra-thick 9'plus slab of sweet dick meat that is the just the kind of all day sucker you have been waiting all year for! His 'North Pole' comes without the frigid temperatures but doubles up on protein!Dream isn't even the word as far as Antonio is concerned...the word is more like more as he has everything you want in a man and more: more than pleasing to the eye, more than tasteful to the mouth, more then just a handsome face, more than just a sexy nuance to every look, move and glance, that extra big, ultra huge & meaty cock is all you could want in a serving of massive dick and more!He grabs that lump in his jeans, still soft but already huge and heavy. When he finally unzips the fly, his cock is so big it is literally coming out of the top of his tight, snowy white briefs but he tease us with that bulge until we were almost panting to see the mighty meat and wow...one of the biggest we have ever seen and so worth the wait. Once he begins humping the couch you can see the foreskin of his dick slide back and forth and he lets us not that while just decorative, that ass is as fine as the rest of him. Stroking his meat with passion and reverence. Antonio approaches the camera as if feeding his dick to all of you hungry cock suckers out there. Not only is the dick HUGE...but so are those balls, so big that you know an awesome load will sprout from it. Working in every inch of the set to show off every inch of his gift, Antonio proves that actions speak louder than words - the load he finally spews out dots his abs, splatters on the chair and says 'tis the season' better then any greeting card ever could.  From all of us at ExtraBigDicks.com, have a great holiday!",
  "models": [
    {
      "name": "Antonio Biaggi",
      "person_id": 28557
    }
  ],
  "release_date": "2005-12-24",
  "scene_id": 54804,
  "series": "Dream Dick",
  "tags": [],
  "title": "Dream Dick, Scene #02"
}