{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Whomever said 'its not what you have but what you do with it' has never been on the business end of 8' cock that is thick as a salami and judging from the hunger in Dakota's pleading to br drilled deeper and harder and longer, he more then liked what Christian has and even more, what that big pole did when it was inside every hole. Christian is all top and Dakota joins the pack as a hungry bottom with a desire to fulfilled .... or should I say a hole to be filled, make that a couple of holes and you are getting the picture. From the start Dakota seems as if he is drooling for Christian, craving him in more ways than one and with a handsome face, incredible body and a dick wet dreams are made of, who can blame him!.With the very first touch, these two are extremely verbal with each other and Dakota inhales Christian's cock, letting him know that he is in good hands. Even better yet, Dakota takes Christians dick and slaps his own face with it, giving leeway for Christian to become even more dominant yet Christian remains a passionate, generous top,. instinctively sensing how much Dakota wants and how much he can take, then just giving him a little bit more. Christian is teasing Dakota with his dick like a lion tamer does with a big piece of meat...making him beg for it. In as much reverance as compliance, Dakota licks the cock from balls to head. In his commanding way, Christian tells Dakota where to go and soon after starts grinding his dick in Dakota's ass saying 'You like that?'Without notice, Dakota's dick rises to attention and as he turns around Christian inform him that 'You got a nice dick for a bottom.' As the fucking begins, the dick ease's in slowly and once it's all the way in, we hear a moan of sheer bliss that almost borders on pain as if the fear the pleasure can't not last is too much for Dakota to bear. Dakota's ass seems made for Christians piece, the chemistry between the two seems bud before our eyes. As they move to the floor, the Man in Christian comes out even more as one leg goes up and he sensually begins to hump Dakota which makes him fall deliciously down to his chest. Begging for more, Dakota rolls over onto his back and Christian has no problem complying to Dakota's demands of 'FUCK IT' Shortly thereafter Christian strokes Dakota's dick until he cums onto his own stomach while Christian is still inside him. Christian moves over to the couch to finish himself off as Dakota waits longingly for it and he is not disappointed but down right glad. Apparently Dakota found something to be thankful for ahead of the rest of us and behalf of all of us at ExtraBigDicks.com, have a great holiday!",
  "models": [
    {
      "name": "Christian 1",
      "person_id": 29602
    },
    {
      "name": "Dakota",
      "person_id": 28586
    }
  ],
  "release_date": "2005-11-26",
  "scene_id": 54812,
  "series": "Deep Drilling",
  "tags": [],
  "title": "Deep Drilling"
}