{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Justin says his friends have many names for him but after we that pole that at most conservative assessment would be called 'humongous,' we christened him 'B.L.D;' Big Large Dick. At 6'1' and 190 pounds of the leanest cocoa flesh we've have every seen, we're sure a good portion of his body weight has to come from that 11', wrist thick  fudgesiscle of a cock.  The shaved head, handsome face, sensitive eyes and so sensual, kissable lips top a perfectly smooth torso that is ripped, lean and just to throw a bad buy edge to things, a couple of tats. His abs are an essay in perfection and as he oils that torso and tugs down the waistband of his boxers, he gives us a glimpse of the single line of hair he left that acts like an exit sign to the dick you have been seraching for your whole life.  His snowy white can barley contain that 11' giant and it literally comes out the bottom of the leg, the big head already leaking, before he shucks them for good and reveals where his other nickname, '11 strong' came from! He pauses every so often, talking right to you, aware of the power he posses in his hands and how badly you want it. Laying back, stroking hat pipe that could easily be three handfuls full and still have the big head sticking out the top, exposing just a hint of that untouched hairy hole as the ball sack above starts to tighten as he reveals he has needs of his own.  This is a man in total control of himself and doesn't release his seed until he sees fit and when he does, he look right in the camera and doesn't shoot, he lays back and lets it slowly ooze out like the white caps of the tide as it kisses the sand. This was his very first time in front of the camera and we can't wait to see what he does next time now that he has his sea legs!",
  "models": [
    {
      "name": "BLD",
      "person_id": 28568
    }
  ],
  "release_date": "2005-08-25",
  "scene_id": 54838,
  "tags": [],
  "title": "Eleven Oh-cock!, Scene #02"
}