{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We've got two new faces on ExtraBigDicks today from opposite ends of the Atlantic! The first is 26 year-old Hanz Dinkler. Hanz comes from European stock, but currently lives out on the West coast. We're glad to have all 8.5 inches of him to play with! Representing the U.S. of A. is a larger than life 23 year-old Texan that answers to the name of Micah Jones. This beefy auburn son of the Lone Star State measures in at 6'4 and packs an impressive package. We asked them if they could get a 4 year degree, where would they get it and what would it be? Micah would get his degree in Business. Since he loves Florida, he'd go to Florida State. Hanz would study Accounting, and he'd want to attend UCLA. Micah is what we consider 'Hetero-flexible'. He likes it all and does not discriminate. The biggest difference between them is the texture. He says they're both just different. Don't we know it! Hanz is proof positive to the old adage 'Big things come in small packages'. He admits some people are caught off guard as the passion progresses to 'tah-dah' time. Hanz grins and admits he loves that. Well, this afternoon, that cock of his will definitely get tickled; but Micah will be using Hanz' back door and a Texan 8' tickler to do it.There's definitely no missing sparks here as these two immediately go at it. Micah licks at Hanz' smooth chest before Hanz can strip off Micah's tee and have at him. He licks and works Micah's nips before going back to kissing. Micah teases Hanz a bit before getting up and putting his growing crotch in his face. Hanz isn't wasting any time as he grins and unzips Micah's shorts. Once Micah's shorts fall to the ground, Hanz pulls his growing cock out of his boxers. Micah has a thick pink cock that's coming to life and growing by the second. Hanz sucks on it and gets much of it in his mouth. Micah moans as he gets that Texan pole polished. 'Yeah you want me to fuck your mouth?' Micah teases as he holds Hanz by a fistful of hair. He slaps his thick cock on Hanz' face before slamming it back down his throat. He fucks away at Hanz' face who does his best to accommodate Micah's meat. Micah then wants to see what all that hype was about as he gets on his knees and hauls out Hanz' cock. Hanz delivers as Micah's eyes open wide. Micah spits on Hanz' cock before taking it into his mouth. Hanz is rock hard in seconds. Micah then strips off Hanz' underwear and shorts as he leans him back on the chair to get more of that huge uncut cock.Micah loves that fat, uncut cock and takes his time worshipping it as he laps his tongue all over it, playfully slapping his face with it. They stand and compare swords as they rub their massive cocks together. They kiss and continue stroking their cocks. Micah's had enough foreplay. He grabs Hanz and throws him onto the couch. He suits up and takes Hanz' ass. He slides in missionary as Hanz groans and takes all thick 8' up his tight ass. 'You like that?' Micah teases as Hanz just begs him for more. Micah's big and naturally smooth. He easily pounds away at Hanz compact, defined frame. Micah then bends over the hot little import and fucks him doggy style. He towers over Hanz as he grabs him by the shoulders and neck and impales him back onto his thick cock. He has Hanz skewered on his fat cock. Hanz won't be going anywhere anytime soon. Micah's smooth balls pound away at that hot ass as Hanz just moans and whimpers beneath him. Micah then has Hanz sit on his cock as he fucks up into that ass for more. Hanz can't hold back any longer as he unloads as Micah continues to fuck his hole. Micah then pulls out and jacks a massive load all over Hanz' defined abs and chest.",
  "models": [
    {
      "name": "Hanz Dinkler",
      "person_id": 28773
    },
    {
      "name": "Micah Jones",
      "person_id": 28774
    }
  ],
  "release_date": "2010-09-01",
  "scene_id": 54857,
  "tags": [],
  "title": "The Devil In Mr. Jones, Scene #01"
}