{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'Fire in the Hole!' We have one of our favorite fire crotches in the house and it's his birthday. Steven Ponce is with us this week and we're glad we get to spend time with him on his special day. Finally 30, Steven might just be popping up on one of our 'other' sites. Well, we'll get to that later; but for now we should get a better look at Steven's birthday present. Sitting to Steven's right is a tall drink of water that hails from Houston, TX. 'Where everything's bigger.' Well we're about to find out if this dark, handsome 23 year old can back his own words up. Alex Mercedes is here and this Latin hottie is in for a treat. We asked these two studs, what holiday they like best, besides your birthday of course. Alex loves Independence Day. He loves that everyone's happy and partying American style. Alex, on the other hand, loves Christmas. 'I get gifts from everybody' he grins. We decided to ask them if they could have any man, living or dead, greet them dripping wet and in next to nothing next to their cereal who would that be? Steven blushes and says David Beckham. Alex goes with a less known contender by the name of William Levy, a delicious, 6' Cuban actor/model. (Google him, Betches!--and thank us later) lol Well, now that we've had our breakfast fantasies, let's get back to Steven's birthday reality.Judging by the fact these two started before we even got a chance to hit record, it's evident the chemistry between them is incendiary. Steven and Alex can't get enough of each other as they kiss and suck on each others faces and necks. Alex pulls Steven's jeans down giving his tongue even more canvas to explore. He licks his way south along Steven's smooth frame. He teases him some before standing up and dropping his own pants. Steven instinctively goes to work as he gropes and licks at the hardening cock in those sexy black briefs. Alex just moans as he gets his cock teased. Fortunately, Steven is one impatient birthday boy and he wants that candle. He pulls down Alex' briefs and is pleased to find the fattest birthday candle he's ever had. He grabs Alex' thick uncut cock and makes a wish. (Any takers on what that wish could be?) lol He blows that birthday candle like a champ; shoving it deep down his throat. Alex grunts as he watches Steven deep throat his meat. We get an amazing under carriage view of Steven sucking all of Alex' cock to the hilt. He wants it so bad that even though he gags on it a few times, he isn't coming off of that thing for air.Well, the Birthday Boy deserves to be happy and that being said, Alex decides to give Steven some help in return. He kneels between Steven's smooth thighs and starts sucking on his rock hard cock. It's not every day you get spicy Puerto Rican food in Texas. Luckily there's more than just Puerto Rican meat on the menu. Today's specialty is 'Culito Caliente'. Hot Puerto Rican ass for our Texan boy; and in preparation they get into a hot 69. Steven takes top bunk so he can continue milking that thick dick while Alex gets his tongue deep inside Steven. It may be Steven's birthday, but both of these studs are in for plenty. They both suck and lick on each other's asses and cocks until Alex can't wait any longer. He gets Steven on his back before sliding that cock inside. He wastes no time before fucking that ass deep. 'Aww, fuck that ass!' Steven begs as he gets that tight ass stretched. Careful what you wish for, Se?orito Ponce.  Steven continues to grunt and groan as Alex bends him over the chair. It's hard not to; when you have a hard, hung hottie relentlessly slamming cock up your ass. Missionary is next as Alex continues fucking the hell out of Steven. Steven can't hold back any longer as Alex fucks one of the biggest loads we've ever seen out of Steven. He shoots a thick coat of leche all over his smooth chest and face. Alex then follows suit adding his own cream to the mix.  ...Feliz Cumpleano, Steven!",
  "models": [
    {
      "name": "Alex Mercedes",
      "person_id": 28772
    },
    {
      "name": "Steven Ponce",
      "person_id": 27969
    }
  ],
  "release_date": "2010-08-25",
  "scene_id": 54856,
  "series": "Magic Stick",
  "tags": [],
  "title": "Magic Stick, Scene #02"
}