{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "The Man, the Myth, the Cuban Legend is back with that 9' uncut, monster python our members can't seem to get enough of. We, of course, are talking about none other than Mario Costa. Mario is a 24 year old local boy; and he brings an awful lot to any table. <evil grin> This week Mario helps us welcome a new face to EBD, Dylan Roberts. Dylan is 21 years old and from San Francisco, CA. Dylan was a huge success over on our brother site so we figured it was only fair to share. We asked these two studs what it is they like to spend their coins on. 'SHOES!' blurts out Mario. He didn't have to think about that one at all. Dylan loves to buy nice jeans; his favorite brand is 'Lucky' brand. That fits, since he's about to get luckier than most. We then asked what they hate to spend their money on. Mario says he hates bills. Dylan agrees, but says the bill he hates the most is his cell bill. We're sure that there are many that will agree. We did a little bit of investigating and found out that our strict top has been on the receiving end. We might need to explore that side of him. Dylan is a hot guy and considers himself 'hetero-flexible'. 'Whoever I 'click with' is what draws me in; whether it's a guy or a girl.' We need more hotties like Dylan. In a minute we'll get to see just how 'flexible' this hottie is once he gets to work on Mario...or is it the other way around?They break the ice by kissing as their hands start to roam. Mario takes off his tee as Dylan follows suit. Both of these studs are smooth with natural definition. They stand to continue kissing and Dylan starts to work Mario's growing cock through his shorts. His shorts come off as we see his tight jock strap struggling to contain its content. Dylan drops to his knees for a closer inspection and soon has a fat Cuban cock in his hands as it throbs for more than a handshake. Dylan obliges and takes that delicious meat in his mouth. He sucks as much of it as he can into his mouth sending Mario into orbit. We get an amazing shot from below as we see Dylan nurse on that giant cock. Mario really is every size queen's wet dream. Dylan then stands up and drops his own drawers and he isn't skimping on portions either. Dylan has a rock hard uncut cock that's damn near 8'. Go White Boy! lol Mario takes to it like a calf and sucks that rod like there's candy on it. Dylan just watches as he gets his cock spit-polished by his Caribbean consort. After he gets that cock serviced a bit; Dylan decides he wants more of Mario's. He gets on his knees again to continue worshipping that massive meat.Bent over sucking that cock, we get our first glimpse of Dylan's smooth ass. Mario puts Dylan on his back as he slowly starts to push his huge cock inside. It's not going in without a struggle as Dylan tries his best to relax. He finally gets his knob inside and slowly but surely he manages to slide more and more in with every thrust until he's fucking that hot ass deep. Dylan can only groan and say his prayers as he moans and groans. His hot ass is stretched around that fat cock that's now pounding his hole. Mario braces himself on the back of Dylan's thighs as he pumps away at that tight ass. After he gets that ass nice and welcoming, he bends Dylan over and starts to fuck him doggy style. His fat cock now slides in with less resistance and now Dylan's not groaning in pain but in ecstasy. 'Oh, that feels good' he moans as Mario continues to pump away at his ass. Dylan's ass is getting a proper fucking, but wait--there's more. Mario sits back and has Dylan sit on his cock. Using his weight Dylan can now take as much of that cock as he wants deep inside him. He bounces on that cock as his eyes roll into this head. This position gets them both close to climaxing sooner than they wanted to as they dismount and cum all over themselves. Leche all around, Boys.",
  "models": [
    {
      "name": "Dylan Roberts",
      "person_id": 28414
    },
    {
      "name": "Mario Costa",
      "person_id": 28031
    }
  ],
  "release_date": "2010-08-11",
  "scene_id": 54852,
  "series": "Super Mario, Brutha!",
  "tags": [],
  "title": "Super Mario, Brutha!"
}