{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have two new faces this week on ExtraBigDicks and it only took them a couple hours to get here. Florida's west coast is in the house and we're glad to have these local flavors around. Fresh out of the starting gate is 18 year old Justin Kaze. Justin has a baby face and porcelain skin and hails from Fort Myers. Chad Davis is the second addition to our stable. Chad has more of a jock look, is 20 years old and from Sarasota, FL. Wanting to get to know these two better, we asked them who they felt was over-exposed in the media these days. Justin thinks Megan Fox is over already. Chad chimes in with Lady Gaga. She may still be popular; but this hung hottie could live without her. We then asked who they can't get enough of. Justin thinks Tom Cruise because he's finally coming back; Xenu, leader of the Galactic Confederacy would be so proud. Chad is all about Britney. 'Sounds really gay but she's finally getting her life back' We all love an under dog. Chad also loves twinks. 'I like them 18-19, slim white'. Justin also likes them young and around his age but he prefers them to be more muscular. Seems like we got it right this afternoon and these two will be pleased with each other. It's Justin's ass that's gonna be impressed with what Chad has to fill it with--just in 'kaze' you were wondering. <evil grin>Chad and Justin are sitting on the couch as Chad tells Justin he's heard a rumor about him. He plays coy and finally tells Justin he's heard he has a huge cock. 'What if I told you it's true?' he grins. Chad just smiles and retorts, 'I may have you beat!' Justin reaches over and grabs Chad's cock. They start to kiss as they start to fondle each other. Their clothes come off in seconds. Once Justin's pants come down Chad goes in for his own inspection. He hauls out Justin's thick cock and takes to it. He sucks on that thick cock as it gets bigger in his mouth. Justin is naturally smooth and incredibly fair. They go back to kissing as Justin gropes Chad's briefs. Chad's cock is popping the circus tent of all tents in his briefs. Justin yanks them down as Chad's cock springs free. Yup, Chad has him beat as his rock hard cock comes out to play. They stroke their cocks together as they moan and enjoy the skin on skin contact. Justin then kneels to get a better idea of what Chad is packing. He'll soon be getting that delicious cock 'packed' elsewhere. 'You like that big dick?' Chad teases as he bobs Justin on his meat. (The 'no duh!' is implied.)Justin services that cock as it gets rock hard from the attention it's getting. They both have more than enough to work on; and soon Chad wants more as well. They maneuver into a hot 69 with Justin on top. They both go at those cocks as they get hornier for more. Chad starts to play with Justin's smooth ass as they suck each other off. Chad's thick cock is done with simple pleasantries and it wants more. Chad suits up and bends Justin over. He slides his cock inside that hungry ass that readily takes every inch. Chad fucks away at that smooth hole as Justin grunts and groans. After pounding him doggy style, Chad decides he wants to fuck his ass missionary. He lays him back on the edge of the couch with his ass in position for a pounding. Chad shoves his meat back in for more ass. He starts to power fuck that hole like it's going out of style. His balls slap away at that ass and Justin can only grunt and hold on as he gets that ass rammed deep. This kind of fucking can only make these two nut that much faster. Once they feel that familiar tickle they sit back side by side and jack themselves off. Chad's the first to cum shooting all over his tight abs. Justin follows suit shooting all over himself as well.",
  "models": [
    {
      "name": "Chad Davis",
      "person_id": 28421
    },
    {
      "name": "Justin Kaze",
      "person_id": 28776
    }
  ],
  "release_date": "2010-08-18",
  "scene_id": 54853,
  "series": "Dangling Chad",
  "tags": [],
  "title": "Dangling Chad"
}