{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a Parker Brothers extravaganza! Well, these two aren't really brothers; but just go with it. The first is a recurring favorite who last had one hell of a time taking Addison Andrew's huge cock. We're glad to see Parker Brookes back with that sexy face, sweet smile and that ass that doesn't quit. For those of you that don't already know, Parker Brookes is 22 and from Mobile, AL. Mr. Brookes is more than happy to help us introduce a brand new face on ExtraBigDicks. Originally from Austin, Texas, Parker Perry is here to show us just how BIG they grow them in Texas. (...wait for it) Parker is a well defined hottie with a twinkle in his eye and what looks like a well built bod underneath those clothes. At 21, Mr. Perry has a prominent future ahead of him. We asked these two if they could have any profession made a reality right now; what would that career choice be. Parker Brookes wants a degree in acting to complement his current degree in music. Parker Perry wants to fly fighter jets. Well, boys will be boys. We think Parker Perry would look damn hot in a flight suit. Then again, he'd look even better out of one...and in Parker Brookes instead. Shall we? Parker P. is relaxing on the futon when he's joined by Mr. Brookes. They start to make out as they break the ice. Parker P. gets Brookes on his back as he undoes his shorts and goes exploring. Brookes is already rock hard and Parker P. wastes little time before running his tongue along his cotton-clad cock. He goes back to kissing Brookes who lies back and watches as Parker P. runs his tongue down his chest. He works those sexy nips before pulling out his throbbing cock. Brookes gasps as Parker P. runs his tongue on his knob. Parker P. goes down on that cock and starts to bob his head on it as he takes every inch of Brookes' cock deep. Brookes watches a bit before he starts to playfully hump up into Parker P.'s skilled mouth. Brookes' smooth bod and rock hard cock look amazing as he gets that dick worked. Then Brookes wants to return the favor as he sits before Parker P. and slowly undoes his shorts. As he pulls down his briefs we get our first view of his thick, 9' mammoth cock. He wasn't kidding--they REALLY do grow 'em big in Texas. Brookes wraps his mouth around as much of it as he can as it gets harder and harder.Brookes works that cock like a pro as he manages to get most of it in his hot mouth. Parker P. not only has a man size cock but a sexy hairy chest and abs to boot. Brookes plays with his smooth balls as he continues to nurse on that thick meat. Parker P. slowly starts to fuck Brookes' face as he tries to get more of his dick in that warm mouth. Brookes takes his time as he worships that huge dong wanting to get Parker as hard as possible. They then maneuver into a hot 69 position with Brookes on the top nursing that fat cock while Parker P sucks his cock as well as eats that smooth ass. When these two are ready for more, Parker gets bent over as Brookes slides his rock hard cock inside that hot hairy ass. Parker groans and moans for more as Brookes pounds away at that ass. 'Yeah, take it!' Brookes orders as he claims that ass. Parker P. can't get enough of that thick dick in his ass and he fucks Brookes right back, bucking his hole back onto that dick for more. Brookes then sits back as Parker P. sits on his cock and rides him for more. Brookes bounces the hung Texan on his meat before fucking him missionary. Missionary proves too much for Parker P. who gets the cum fucked out of him as he explodes all over his hairy chest and abs. Brookes then pulls out and unloads his thick load all over Parker P's cum-drenched, uncut cock.",
  "models": [
    {
      "name": "Parker Brookes",
      "person_id": 28348
    },
    {
      "name": "Parker Perry",
      "person_id": 28487
    }
  ],
  "release_date": "2010-08-04",
  "scene_id": 54850,
  "series": "Parker Bros",
  "tags": [],
  "title": "Parker Bros, Scene #02"
}