{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back with us this week is sexy Mario Costa. Mario, and that unforgiving Cuban cock of his, is always a treat on ExtraBigDicks. This 24 year old Cubanito is still a size queen's ultimate wet dream. Mario is looking even leaner these days and no one will be happier with those improvements than our latest addition, Micah Andrews. Micah has been on our brother site and we think this Denver native will be a great addition to the stable of the hung...and hung lovers (you KNOW who you are!) Both of these studs keep in top physical shape and it's a balance of metabolism and working out. Being down here on the beach, there are many beautiful men here year round. We asked them when they do venture out to the beach what is their favorite thing to wear. 'Anything white!' beams Mario. Take a moment to drink in that visual. Apparently Mario loves to show off that huge 'pingon' every chance he gets. Micah likes the tighter smaller fitting shorts and as long as it's not a thong he's ok with it. Mario has dabbled in new areas since he started with us as a strict top and we gotta say he looks hot getting it as well as giving it. Micah gets into his own kind of trouble and with that fresh, boy next door face has luck seducing the somewhat curious str8 boys. Well, there will be plenty of seduction going on in a minute so let's let these two get their groove on...They both sit back as they tug on their crotches. Mario starts to play footsy as he gets things started. They quickly pick up the pace as they start to make out. Their tees are first to come off as they get better acquainted. Mario licks Micah's smooth chest as their hands explore the other. Micah's curiosity gets the best of him as he helps Mario out of his shorts and starts to play with his thick cock that's already straining to get out. Micah teases him by licking his hard shaft through his tight whites before setting it free. Mario's python waves victoriously as Micah admires all that he's got to work on. He shoves that thick cock deep into his throat struggling to get as much of it inside his mouth as he can. An over the shoulder shot shows Micah on his knees stroking that monster cock as he confesses he can't wait to get that huge cock inside of him. Well, he's come to the right place (--cuz we were thinking the same exact thing).  They stand as they continue to make out. Mario's hands start to explore Micah's smooth ass as he gets better acquainted with the hole he'll soon widen. He then sits Micah back to give him some help in return. He kneels between Micah's smooth thighs and takes his cock in his mouth. They then move into a hot 69 which only makes these two hornier for more.Micah starts to finger his own ass as he sucks Mario's cock. DAMN! He knows he's gonna have a lot to handle in a few minutes. Mario then suits up and sits back. Micah straddles his Caribbean cock and starts to ease himself down on it. He grunts and groans as his ass slowly gives way. Once that hole stretches enough to get that cock inside, Micah starts to ride it like a pro. Mario holds him by the waist and helps bounce him on his meat. Mario is getting all 9'+ buried deep inside that tight ass and Micah can't get enough. He gets up and sits back on it in a reverse cowgirl. Mario holds his battering ram with both hands as he watches Micah's ass swallow it whole. Do not try this at home; we are obviously dealing with trained professionals. Micah then starts grinding on that cock at a gallop as Mario just watches him pleasure himself on his meat. Mario then switches it up and puts Micah on his back. He starts to fuck that ass missionary and has better control of just how deep he can get inside. Mario fucks Micah deep while Micah starts to jack his hard cock faster and faster. Mario's hitting Micah's sweet spots with that uncut horse cock and it won't be long before this hot ass milks his load. As they get close they sit back and stroke off their massive loads all over themselves.",
  "models": [
    {
      "name": "Mario Costa",
      "person_id": 28031
    },
    {
      "name": "Micah Andrews",
      "person_id": 28042
    }
  ],
  "release_date": "2010-09-15",
  "scene_id": 54862,
  "tags": [],
  "title": "Meat Grinder, Scene #02"
}