{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Wish they all could be California boys? Well relax cuz this week they are. Christian Wilde is back in the house and this sexy blue eyed morsel is always a good time. Dylan Roberts is also back and both of these 21 year old studs are from Northern California. This year has been a journey of self-revelation for Dylan as he finds himself and his career takes off. Christian sums up his year as 'Chaos, awareness and seeking a path'. Along that line of thinking we asked these two if they had $5K to donate to charity what would that charity be. Christian would donate to African water organizations which bring potable water to remote villages. Dylan would want to help needy children because it's such a growing issue. Speaking of 'growing', Christian didn't realize he had a bigger than average dick 'til he was 18?really!? It wasn't until he heard there were rumors about his size which made him realize he wasn't as small as he thought. Both of these studs consider themselves bisexual and they are both avid lovers of both sexes. They both agree that it all has a lot to do with how well they mesh with a person whether it is male or female. Well, today we just wanna see how well they 'mesh' and by mesh we mean...You know... Christian is taking a nap when Dylan wanders in and sees an opportunity. He sits on the couch and lets his fingers do the walking as he gropes Christian's cock. Christian wakes up and grinds his head down into his crotch as he grins. What a way to wake up. They start to kiss as they begin undressing each other. Christian stands up as Dylan pulls open his button-fly jeans to get at that growing cock. Christian's cock is straining against his sexy briefs and it only takes Dylan a few seconds to remedy that situation. Dylan wraps his lips around that thick cock and goes to work. Christian groans as he gets his cock worshipped. Dylan expertly swirls his tongue along his shaft as he nurses on all that meat. Dylan then gets up on the chair and watches as Christian returns the favor. He grabs Dylan's cock by the base as he bobs his head on it. He looks up at Dylan with those baby blues as he continues sucking that cock. He playfully slaps his tongue with Dylan's rock hard cock which only turns Dylan on even more. Dylan then gets even more dick to suck as Christian gets in position to fuck that pretty face of his.All this oral action has these two ready for a lot more than oral. Christian holds Dylan legs up as he slides his thick dick inside that hot ass. 'Feels so tight' he groans as Dylan's ass slowly gives way. Christian is soon burying that baby maker deep inside him as he picks up the pace. Christian jacks Dylan's hard cock as he fucks him. Christian's smooth balls slap away at Dylan's ass as he takes what's his. Dylan then straddles that big dick for more as he starts to ride it. Christian sits back and watches as his cock disappears in and out of that tight ass. Dylan is riding him like a bouncy ball unable to get enough of Christian's dick inside him. They make out as they keep fucking. 'You like that?' teases Christian (obviously rhetorical!) Christian then bends Dylan over and plows him doggy style. His cock plunges deep inside as he fucks his ass faster. It won't be long before that load needs an out. When he's ready to cum he stands over Dylan and sprays his massive load all over Dylan's smooth frame. Cum-soaked Dylan is next to cum as he jerks his own load all over himself. Mighty fine 'MESH' we got ourselves into, eh!? lol",
  "models": [],
  "release_date": "2010-10-13",
  "scene_id": 54869,
  "tags": [],
  "title": "Nocturnal Emissions, Scene #01"
}