{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back in the house is one of our favorite Texans, Micah Jones. Micah is proof positive that they really do grow them big in Texas. At 23 and standing at 6'3, this auburn dream brings a lot to the table including a thick 8.5' cock. His co-star today is in for a real treat and since he's making his debut today, we thought we'd spare no expense. Brenden Black is with us today. Originally from Indiana, this 19 year old cutie now calls Chicago home. Micah is looking even leaner than before and he's been working out every day to get himself in fine form. Brenden is lean naturally so he has that metabolism we all hate him for. He eats all he wants and doesn't gain a pound. We asked these studs what their earliest sexual memory was. For Micah he lost his virginity at 13 to his best friends Mom. --DUDE! Where do you go with that? lol Brenden's first sexual experience was his best friend at 12. His best friend's mom had nothing to do with it. Whew. Micah might've been distracting her. We then asked them if we were to hand out sexual merit badges what would they qualify for hands down. Brenden would get the 'endurance' badge. Not a bad thing at all. Micah can't think of just one he'd qualify for...since he's good at everything. We'll give him the 'Overachieving Douche' badge to cover our bases. lolThey are about to work out together when their session takes a turn for the better as Micah leans in for a kiss. They then start a different game where they explore each other's defined bods. That soon leads to the couch where Micah drops his shorts to give Brenden a better view of one rather hard 'muscle' in particular. Brenden pulls that muscle out through the fly in Micah's boxers. Micah moans as Brenden starts to suck on his cock. Micah's boxers come off as Micah holds Brenden's head and starts to face fuck him. Micah's thick cock slaps at Brenden's tongue and face as Micah teases him with that meat. 'Spit on it' he orders as Brenden continues to service him. Micah then lies back on the incline bench and gets comfy as Brenden kneels for more of that dick. Micah can't get enough of Brenden's mouth. This str8 boy definitely loves getting his massive meat worshipped and polished to a spit shine. They then stand up and start to make out for a bit before Micah bends Brenden over to get a better 'view' on things.Bent over the incline bench, Brenden patiently awaits his first rep of anal plunges. <evil grin> Micah pushes inside him and starts to fuck his ass deep. Brenden takes it like a champ as Micah pounds away at that hot ass. Both of these studs are naturally smooth and look delicious as they fuck. 'Fuck me' Brenden whispers as Micah's heavy balls slap away at that tight hole. Micah picks up the pace and starts to jack rabbit that cock into him making Brenden even harder. Brenden isn't just taking that thick dick; he's actually egging Micah on to give him more. Micah then sits back and watches as Brenden sits on his dick in a reverse cowgirl. Brenden goes to town getting all the dick he wants as he bounces on that pretty Texan pole. He grinds his tight hole all the way onto Micah's meat and it's only making Micah want more. Micah then puts him on his back on the bench and slides that dick back in for a third set. He fucks away at Brenden's worn hole and Brenden can't take much more before exploding. They reconvene on the couch where they both jack themselves off shooting their heavy loads all over their sweaty frames.",
  "models": [],
  "release_date": "2010-09-22",
  "scene_id": 54864,
  "series": "Love Muscle",
  "tags": [],
  "title": "Love Muscle"
}