{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We are excited this week to have hottie Chad Davis back again. This 20 year old Sarasota resident, with the room brightening smile, is always a welcome sight. Chad is going to help us welcome a new addition, Michael Dora, to our stable of hung hunks. Michael is 21 and originally from Fort Lauderdale. We asked these two studs what the highlight of their summer was now that summer is soon parting. Michael blushes and says his highlight is getting to meet Chad Davis personally before starting his career. This is Michael's first shoot ever so he did pretty well his first time out. <evil grin> Chad's highlight, besides meeting his biggest fan, was all the traveling he was able to do. Topping his list (no pun intended) was his trip to the ATL. We asked these two what kind of men they are attracted to. Michael is into a man that's masculine and they should be a little preppy but still be a bit jock. Chad is into twinks. 'I just like the twinkie ones' he beams. Who are we to judge? As long as they're packing we won't take issue with your tastes. We already know what Chad's packin' but we have it on good authority that Michael isn't afraid to hang out with the big boys--and we're about to find out why.Michael gets called in to the 'casting couch' where Chad briefly interviews him before moving past the formalities. They start to kiss as their hands start to wander. Their tees come off and then Chad pulls off Michael's pants. Michael's rock hard and his briefs are struggling to contain his thick 8.5 inch dick. Chad's eyes open wide when he realizes what he's gotten himself into. Fortunately he's never been one to shy away from a challenge. Open wide, Chad! Chad grabs Michael's smooth balls as he goes down on his throbbing cock. Michael has a sexy and smooth chest and Chad's having fun exploring all he has to offer. Michael moans as he gets his fat cock worshipped by Chad whose face is buried in Michael's crotch. Chad then strips and sits back and gives his #1 fan a chance to return the love. Michael gets on his knees as he takes Chad's thick cock in his mouth. He looks up at Chad with those bedroom brown eyes of his as he licks that aching cock all over. He takes as much of that dick down his throat for a few before standing up and letting Chad have even more of his cock. Chad is more than willing as he goes back down on him.With two 8.5 inch cocks to play with, these two can't get enough as they get into a hot 69. They nurse on each other's cocks 'til they're ready for more. Chad suits up with a little help and once he's ready Michael straddles his cock. He slowly impales himself on Chad's thick cock before riding him. Chad winces with pleasure as Michael's tight ass gets stretched around his cock. Michael rides him like a pro and soon Chad wants more control. He bends Michael over and slams his cock back inside. Chad starts to power away at that sweet ass as Michael holds on. 'Aww fuck me' Michael begs as Chad wails away at that willing ass. Chad loves that ass and he isn't letting up anytime soon. He holds Michael by the shoulders as he impales him back on his cock repeatedly. They then move south as Chad takes Michaels hot ass missionary. He easily glides his thick cock in and out of Michael's worn hole. By now these two are ready to blow as they sit back side by side on the couch. Michael is the first to shoot as he dumps his thick cargo all over his smooth abs. Chad isn't far behind as he explodes ALL over the place: the wall, his head, his chest. DAMN. Someone was amazing on the casting couch. ...to bad he didn't get the job. lol",
  "models": [
    {
      "name": "Chad Davis",
      "person_id": 28421
    },
    {
      "name": "Michael Dora",
      "person_id": 28420
    }
  ],
  "release_date": "2010-09-29",
  "scene_id": 54865,
  "series": "In The Back Dora",
  "tags": [],
  "title": "In The Back Dora"
}