{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have a special treat this week on ExtraBigDicks as Kevin Cavalli makes his triumphant return. For those of you unfamiliar with this sexy, inked New Yorker it's about time you got reacquainted. In order to appreciate this 6' stud we figure the best way would be to see this open minded str8 boy in action. Making his debut in the industry this afternoon is Beau Kennedy. Beau is 21 and originally from Fort Myers, FL. Beau has a rather large reason he's gonna do well this afternoon and Kevin will know all about that soon enough. Kevin has dipped his 'toe' in porn both gay and str8; while this will be Beau's first adult venture ever. He admits he's had a few women take a look at his 9'+ cock and say 'Hell no!' but most of the time they end up rising to the occasion. Maybe he'll realize on this side of the fence, it's never big enough.  We asked these two players what their dream cars as well as their dream girls would be. Kevin wants a white on white Lamborghini and his dream date would be Kim Kardashian. Flashy much? lol Well Beau isn't one to be rivaled with, so he wants a Bugatti Veyron and as his dream date he'd want Lacey Duvalle. Well, their choices in women may range from Flashy to Exotic but this afternoon we'll get to see what it looks like when they're left to their own devices.They sit on the couch and start comparing tattoos. They both have tattoos all over their bodies. As they play show and tell the clothes come off. First their shirt come off then Beau drops his pants to show Kevin where he wants his next one. He wants 4 aces across his lower obliques. Kevin notices what's hangin' inside those loose fitting boxers and makes his move. He starts to tug on Beau's cock as Beau lets him do his thing. Kevin's impressed with that cock and they start to compare cocks. Beau tells Kevin he's got about 9'. Kevin doesn't believe him so Beau moves his dick front and center so that Kevin can find out for himself. Kevin tugs on his boxers as they come off exposing Beau's thick dick. Kevin goes to work on that cock as it grows...and grows. Beau's cock is a monster and has a natural curve south. Kevin gags on it trying to take all of it down his throat. 'This thing hangs down to your knee.' Kevin teases as Beau just beams and watches Kevin nurse on that cock of his. Beau dribbles Kevin's head on his massive 9'+ cock as Kevin continues gagging on that huge cock.Now it's Kevin's turn as he offers the new comer some cock. Beau strokes it tentatively at first before taking it in his mouth. Beau does his best to imitate the oral attention he'd just received as he sucks on his first cock. Kevin moans as Beau slobbers all over his throbbing cock. After a bit Beau is ready for more as he strokes his rock hard cock. He bends Kevin over and slides that python into that sweet ass. Beau's cock shoves into his first ass as Kevin starts to buck back onto his meat. Beau just holds still as Kevin rides him. 'Awww, that's a tight ass', Beau grunts as he watches his dick disappear into Kevin's beefy ass. Beau takes control as he starts to fuck Kevin harder grabbing him by the waist as he impales him back onto his pole. 'Fuckin' big dick feels good' groans Kevin as Beau continues to stretch that ass open. Beau then sits back and has Kevin straddle him so he can ride that dick for more. Kevin eases himself up and down on that cock taking as much of that cock as he can. Beau fucks that tight ass with a few inches never making it inside that hot ass. Beau bounces Kevin on that dick trying to get it in deeper as Kevin's ass works its magic on Beau's smooth balls. As they get close they sit back, side by side, and jack themselves off blasting their heavy loads all over themselves.",
  "models": [
    {
      "name": "Beau Kennedy",
      "person_id": 28499
    },
    {
      "name": "Kevin Cavallie",
      "person_id": 28060
    }
  ],
  "release_date": "2010-10-06",
  "scene_id": 54867,
  "series": "Hot Rods",
  "tags": [],
  "title": "Hot Rods, Scene #01"
}