{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Well we have a very special surprise as Van Wilder decided to stop by the studio this week with an itch to show it off. We aren't about to complain when 19 year old, Miami native Van decides to drop by with his fat 8' cock. So we got him a lucky newcomer to help out.  Making his debut with us this week is Tony Rokk who is 27 and from Puerto Rico. Tony is in for a wild ride...but let's not get ahead of ourselves. We wondered what these two fit studs consider their guilty indulgence. 'Cheetos!' is Van's answer. He didn't even need to think about that one. Tony likes pizza when he strays from his diet. Van's packing a fat dick and we wondered if he's ever been fully deep-throated and he admits it has happened and can't say which team does a better job. He must be getting together with some skilled females. The next burning question we asked was where the weirdest place they ever shot their load into was. 'A girl's eye' grins Van; as Tony admits he's busted his nut in his own eye and it burns.  We wrapped things up by asking what does one need to do to make them cum really well. Van loves his balls played with & his nipples worked. Tony likes a guy to find that 'sweet' spot-and fuck it harder! (...our kinda guy)Van is kicking back watching some porn on his laptop and decides to jack off. He strips down to his briefs and hauls out his thick cock and starts to stroke it as it comes to life. As he's jacking his hard cock with both hands, Tony bursts into his room finding Van with cock in hand. 'What are you doing jacking off on my couch, Bro?' Van's confused as to why he would come in unannounced; but after realizing it is Tony's place he agrees to pay the price and offer Tony some of his cock. Tony gets on his knees and starts to savor the rewards as he sucks on Van's foreskin and fat cock. Van moans as Tony swallows as much of that dick as he can, making it even harder in his mouth. Tony takes his time worshipping that meat, stroking it up and down as he sucks on his throbbing knob. This is way better than jacking off to porn as Tony starts to rub their cocks together as his own dick gets hard. He lies on top of Van as he starts to  lick his smooth body from his neck all the way back to that cock he can't seem to get enough of. Who can blame him? He then stands up and backs that ass up against Van's cock as Van slaps his thick cock on Tony's ass. 'You want that dick inside you?' Van teases as Tony rubs that ass all over it.Tony is hard as he gets up and offers Van some dick. Van returns the favor taking his Puerto Rican dick all the way down his throat. He works that shaft for a bit and once he's done he gets up and puts Tony up against the wall. Seconds later Tony's moaning as Van's cock slides inside his tight ass. Van wastes little time before going to town on his hole. His balls slap away at that ass as he fucks him doggy style. Tony just whimpers in ecstasy as he gets that ass stretched wide. Van grabs Tony by the waist and fucks him even harder as he slaps that ass. Van then switches it up by pulling Tony back so that Van is against the wall so that he can do the work. Tony gladly bucks that hot ass back onto that dick fucking himself. Van then grabs hold again as he starts to slam that dick deep inside that hole. Van then gets Tony on his back and fucks that tight ass missionary. He pounds that ass faster and deeper hitting Tony in just the right spot. Tony beats his dick as Van pounds him harder until he can't hold off. Van pulls out and jacks off all over Tony's cock drenching it in cum as Tony's nearing his own climax. That does the trick as Tony cums all over his cock and navel to.",
  "models": [
    {
      "name": "Tony Rokk",
      "person_id": 28858
    },
    {
      "name": "Van Wilder",
      "person_id": 28816
    }
  ],
  "release_date": "2012-05-09",
  "scene_id": 54860,
  "series": "Get a Piece of the Rokk",
  "tags": [],
  "title": "Get a Piece of the Rokk, Scene #02"
}