{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Whoever said 'Two is company; but three is a crowd' obviously wasn't in the 'right' company. You won't have to worry about that this afternoon and there are 3 very good reasons why: Ryan Buckley, Ethan Ayers and Parker Perry. Ethan is 32 today and this Austin native is about to have a pretty amazing birthday as he gets better acquainted with 23 year old, Boston boy Ryan Buckley and Parker, a fellow Texan who at 22 is living proof that they really do grow 'em big in Texas. We asked these studs what their favorite classic TV shows were and Golden Girls and Bewitched were among the top contenders. For their modern day favorites Ryan loves The Closer while Ethan and Parker are self admitted fang bangers and all about True Blood. All three of these studs are horny and have all been caught getting their freak on. Ryan had his friend walk in on him which was awkward for her; Parker was caught fucking on the rooftop of a club while Ethan was sucking a dick in the bush when some unsuspecting old man walking his dog got way more than he was looking for. Well, unlike old faithful we're not sure we could ever get enough of these three. Let the games begin.Ethan and Ryan are filling out their paperwork before a shoot when Parker walks in looking for his cell. One thing leads to another and soon Parker is being stripped as he becomes the object of their desire. Parker moans softly as he feels both tongues moving south along his furry chest heading towards his growing crotch. He stands up and starts making out with his new playmates as they haul out his massive 9' cock. They all strip and take each other's cocks in hand stroking as they get their dicks rock hard. Ryan and Parker decide they need to blow out the birthday boy's candle as they kneel and go to work on his rock hard cock. They take turns sucking his dick as Ethan's eyes roll back in ecstasy. The fun then moves over to the couch as Parker sucks Ryan's throbbing cock while Ethan starts to nurse on Parker's. Daisy chains never looked so good. Parker then gets on all four as he offers that sweet furry ass up. Ethan wastes no time before shoving his tongue deep inside him getting that hole ready for more.Ethan slowly slides his thick dick inside as Parker groans and begs for more. Ethan pounds away at Parker as he goes back down on Ryan. Locked in a Chinese Cuff, Parker has dick in both ends as they make use of his hot holes. 'It's my turn for a taste' teases Ryan as he sits back and watches Parker sit on his dick. Parker grinds up and down on Ryan's meat as Ethan goes down on his fat uncut cock. The party moves south as Ryan gets Parker on his back and slides back in for more. 'Fuck me!' moans Parker as Ryan's balls slap away at his hairy hole. Ethan kneels over Parker's face as he strokes his thick dick as he watches Ryan pound that ass. Ethan gets so turned on watching he starts to jack off faster and faster. Ryan's cock is hitting Parker's sweet spot and it sends him over the edge. He explodes all over himself as his thick nut coats his chin and chest. A cum covered Parker sends both Ryan and Ethan over the edge as well as they simultaneously shoot their loads all over Parker. Some guys have all the luck.",
  "models": [
    {
      "name": "Ethan Ayers",
      "person_id": 28002
    },
    {
      "name": "Ryan Buckley",
      "person_id": 28368
    },
    {
      "name": "Parker Perry",
      "person_id": 28487
    }
  ],
  "release_date": "2010-11-10",
  "scene_id": 54877,
  "tags": [],
  "title": "Stuffing the Turkey, Scene #01"
}