{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "November is upon us, but wait ...there's more. Today one lucky guy will have more than just November 'upon' him. Today we have two new faces for you. The first, and afore mentioned, is Val Aris who is 25 and from the Windy City, Chicago. Last, but definitely not least, is a native Floridian that goes by the name, Cliff Jensen. Cliff is 21, a meager 6'3' tall, has seductive blue eyes and a thick 8.5 inch cock. Bare with us, we know how much you HATE a stud with a huge cock. We digress; we asked these boys what their favorite birthday to date had been. Cliff loved turning 21 because he could finally drink without having to hide it. Val loved turning 18 because he could finally fuck anyone he wanted without being jail bait. Birthdays can be over rated at times and so can certain sexual acts. Cliff agrees but more specifically thinks some people, not positions, are over rated when it comes to sex. The package doesn't always fit the sales pitch. Amen Brother! That's something we can all relate to. Val thinks that when it comes to sexual positions, anything done in a car is over rated. Seriously--get a room! Well, that won't be a concern this afternoon. --this room's paid for.Val lets his hands do the talking as he starts feeling up Cliff's chest and abs. His tongue begins to explore his cinnamon nips and smooth chest as Cliff's clothes start to drop. Cliff has a sweet tribal tattoo on his right shoulder and bicep giving him that bad boy edge we all love. He stands at the end of the couch where Val is ready to get a better look at that dick of his. Cliff hauls out his fat cock as he waves it in the air teasing Val for a bit. Cliff then lies back on the chair so that Val can get between his legs. Kneeling before him Val goes to work worshipping at the Cliff cock temple. 'You like looking at me when you suck my dick?' Cliff coos as Val quickly affirms his delight. Cliff loves watching Val slobber all over his dick and takes it out of his mouth to playfully slap his face and tongue with it. Val licks that shaft and soon Cliff stands up to give him better access to all his meat. Cliff's balls are pulled up tight as Val continues spit shining his rod. From there they take it bunk style as they maneuver into a hot 69. Cliff is on his back as he goes back to nursing on Val's dick while Val is riding top bunk bobbing his head on that throbbing cock. Cliff's thick cock appreciates the attention but it's gonna want more...'Love the way that asshole feels on my dick' groans Cliff as Val slides his hot ass down to the hilt. He starts to ride Cliff's thick cock as he bounces up and down on it wanting all of it inside him. Cliff then stands and bends Val over so he can keep fucking him doggy style. He slowly glides his massive cock back into Val's tight ass as Val groans his appreciation. Cliff's balls start to slap away at Val's hole as he picks up the pace. Val is whimpering as he gets that ass stretched wide. Cliff means business as he starts to hammer that thick dick home. Cliff then flips Val over and gets him into missionary. He holds his legs up as he slowly slides that meat in again. Once Val's hole gives way he starts fucking him faster. 'How do you want it?' Cliff taunts while still buried inside him. 'Shove it up me!' Val orders as Cliff obliges. Val's hole likes it hard; and it's getting the proper fucking it needs. Cliff picks up the pace heading towards the home stretch. He rails deep into his ass as Val does his best to accommodate that cock. Cliff then sits back down to let Val ride his cock some more. This position does the trick and Cliff quickly flips Val over onto the couch as he pulls out and shoots all over him. Val isn't far behind as he unloads all over himself adding to the sticky scene.",
  "models": [
    {
      "name": "Cliff Jensen",
      "person_id": 28423
    },
    {
      "name": "Val Aris",
      "person_id": 28789
    }
  ],
  "release_date": "2010-11-03",
  "scene_id": 54875,
  "series": "Cliff Humping",
  "tags": [],
  "title": "Cliff Humping"
}