{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Halloween is in the air and for many of us it reminds us of the Great Pumpkin. Poor Linus of Peanuts' fame sitting in the pumpkin patch waiting for the Great Pumpkin to appear. Well, we know how that one ended; so we went out looking to rewrite our own version. While finding a pumpkin big enough turned out to be fruitless; we were able to turn up one of the biggest stalks ever?Mr. Jessie Alan. We know that Jessie's thick, uncut 9' 'stalk' is the object of many 'trick or treat' (wet) dreams. Yes, we pulled out the big guns...Bang, Bang! Jessie's helping us ring in All Hallows Eve as well as Ryan Buckley's EBD debut. Ryan is 23 and originally from Boston. Jessie, also 23, is more of a local flavor from the west coast of Florida. Jessie's most memorable Halloween memory was last year's when he dressed up as a pimp and cut out the crotch of his pants and had nothing but candy stuffed into his crotch. Now THAT'S a goody bag!  Ryan's best memory (or lack thereof) was being at his friend's Halloween party & waking up in his friend's driveway. He didn't remember a thing. Nice. Jessie finds birthdays are mostly over rated while the Holiday Ryan thinks is most over rated is Easter. 'It just seems like something Hallmark dreamt up to sell more things...' We're gonna let that simmer for a bit. On second thought, let's get these two naked before the thunder clouds start forming. lol ?ACTION!!!They're seated on the couch in their masks as they cautiously get to know each other. Jessie moves closer and before he pulls off Ryan's tee he takes off his mask. Ryan's comes off as well seconds before Jessie goes in for a kiss. They start to make out as Jessie's hands start roaming. Ryan sits on the couch as he undoes Jessie's jeans. 'Let's see that cock' he coos as he slips down onto his knees. He slowly peels Jessie's briefs down and releases his throbbing cock. Jessie is hard and growing by the second. Ryan takes it in his mouth as he starts to work his knob while using both hands to jack him. Jessie groans as he gets his massive monster worshipped. Ryan knows exactly what he's doing and apparently he's quite the cobra charmer. He tugs at Jessie's heavy nuts as he traces his tongue along its length. Jessie then gets Ryan on the couch where he can return the favor. He sucks on Ryan's rock hard cock as Ryan watches him stroke his own meat. 'You want it?' Jessie teases as he strokes his thick python cock. 'C'mon' Ryan answers as his legs part welcoming Jessie in.  Such tawdry foreshadowing, it's downright durty...Jessie moves south to get that ass ready as he slides his long tongue deep inside it. He rims and licks that smooth hole as he strokes his rigid pole. He slaps his thick dick on Ryan's spit lubed hole making him squirm. Once he slides inside, Ryan grunts in a mixture of pain and pleasure as he does his best to accommodate its girth. Ryan takes it deep as Jessie continues to bury that meat. Careful what you wish for, Mr. Buckley. Jessie then bends Ryan over and slides back inside that hot ass doggy style. Ryan's hole finally gives in and Jessie can now fuck that ass like he wants to. He slaps his heavy balls up against Ryan's ass as he fucks him deep. Ryan bites his lower lip as he's made to take that cock. Jessie then sits back and has Ryan ride him. By now, Ryan is used to that sweet cock and he's more than willing to bounce up and down on it. Jessie figures he'll help him out as he starts to fuck his thick cock up into Ryan. That does the trick sending Ryan's load cascading out of his swollen cock. He unloads all over Jessie who follows suit. Jessie blasts his own massive nut all over his cum-drenched bod. Wish all that fit into your trick or treat bag? Mmhmm ?Dream on.Happy Halloween from all of us at ExtraBigDicks.com.",
  "models": [
    {
      "name": "Ryan Buckley",
      "person_id": 28368
    },
    {
      "name": "Jessie Alan",
      "person_id": 28496
    }
  ],
  "release_date": "2010-10-27",
  "scene_id": 54874,
  "series": "Hard Candy",
  "tags": [],
  "title": "Hard Candy, Scene #02"
}