{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We've got two new faces for you this week on ExtraBigDicks. The first is Kemer Diaz who is 19 years old and a homegrown favorite from Miami. Hailing from the volunteer state of Tennessee is 23 year old Jesse Bryce. Jesse has volunteered to help christen Kemer as he makes his first visit to the man table. It didn't take long for Kemer to realize he had a larger than average dick. 'Basically, ever since I was 12 years old and had a little fun with a girl...and it's been going on since then' he beams. Rest assured everyone in his family had always told him he had a big dick since he was little; so it must not have come as a big shock. Jesse isn't a slouch in the big dick department either. He also packs a thick cock so we are all stocked up today.  Jesse admits he thinks bigger is always better. We couldn't agree with him more. We asked these studs what the best sex they'd ever had was. 'When they take the whole thing' grins Kemer. Apparently for poor, hung Kemer, very few have managed to take every inch of his thick cock. Silly Rabbit, Dicks aren't for Chicks--they're amateurs!  lol Well, we know Kemer's in good hands with Jesse; and soon Kemer will find himself 'in' a lot more than that.Jesse has gay porn on trying his best to seduce Kemer. 'You can't tell me that's not hot' Jesse grins. Kemer isn't amused by the all dick scene. 'I'm used to jackin off to girls' he says. Jesse decides to offer a more hands on approach and moves closer. He starts to grope Kemer's cock which slowly starts to come to life. Kemer's eyebrows raise as a confused, but consenting, look washes over his boyish face. Jesse has him stand up so he can get better access as he pulls down Kemer's pants. After tugging at it for a few through his boxers, Kemer's cock is now throbbing and at attention. Jesse opens wide and swallows Kemer's str8 cock to the hilt. Kemer gasps as he watches his dick disappear. Kemer is a quick study as he immediately starts to face fuck his new buddy. Kemer's smooth balls are pulled up tight as Jesse continues to slurp on his thick 8.5 inch cock. Jesse then stands and strips, hauling out his cock for Kemer to play with. Kemer reluctantly starts to stroke Jesse's cock as it gets rock hard in his hand. That's as good as it gets for Jesse so he goes back down on that thick cock again. Kemer's in awe as he gets his thick cock deep throated.'Are you ready for this ass?' teases Jesse as he gets that thick cock slapped on his face. 'Lets see if it fits' teases Jesse before bending him over and sliding that dick deep into his hot ass. Jesse grunts as Kemer starts to pound him deep. Guess taking it all won't be a problem this afternoon as Jesse's hot hole is taking every delicious inch. 'You like that!?' grunts Kemer as he slaps that ass. Kemer then sits back on the floor and orders Jesse to sit on his dick. Jesse squats on that thick cock and starts to ride it. Soon all he has to do is hold himself steady as Kemer takes over. Kemer is fucking that ass like a champ as he repeatedly bucks up into that hot hole. At 19, Kemer knows exactly what to do with that thick dick and its driving Jesse wild. The sound of Jesse's balls slapping away at Jessie's hot hole fill the room. Missionary is next as Kemer slams back in for more. That thick dick is wreaking havoc on Jesse's prostate which is in heaven. Jesse explodes shooting his load all over himself. Kemer isn't far behind. Once he's done fucking the cum out of Jesse, he pulls out and jacks off all over Jesse's cum covered abs.",
  "models": [
    {
      "name": "Jesse Bryce",
      "person_id": 28534
    },
    {
      "name": "Kemer Diaz",
      "person_id": 28533
    }
  ],
  "release_date": "2010-11-17",
  "scene_id": 54879,
  "series": "Pumpkin Cream Pie",
  "tags": [],
  "title": "Pumpkin Cream Pie, Scene #01"
}