{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "As if we didn't have enough with Mario Costa in the house (as if!); we have a new stud making his debut today. Logan Drake told us he was up for a 'challenge' when he recently did his first ever shoot on CircleJerkBoys. What better way to christen this baby-faced 21 year old than throwing him in with 9.5 inches of uncut, local flavor. No es facil! Logan will officially be Cuban by injection by the end of today. Logan is attracted to foreign men and their accents and loves Aussie accents the best. Mario, without question, loves an Italian accent. Being a seasoned veteran we asked Mario to give Logan some advice that might help him on his budding career. 'Be on time and be professional': words to live by on and off set. Logan has yet to be spotted on the street by his newfound fans. That will come in time as more people see him on screen. Mario admits that happens from time to time and the last time was in the mall when a manager at a store came up and discretely asked him for an autograph. Well, this afternoon Logan will be getting a lot more than Mario's autograph and we're pretty sure he'll remember this afternoon for a while. He will have to sit down eventually.  Cheers, Mate.Logan stumbles upon a huge dildo and tells Mario that that's a rather big dick. 'Mine's bigger than that' he grins. Logan's eyes open wide as he places the dildo on Mario's crotch and tries to imagine it. Mario leans in as they start to kiss. Logan won't have to imagine for long as Mario drops his shorts and stands before Logan who is lost in a state of wonder. He pulls down his briefs as Mario's massive cock comes out to play. Logan licks his lips before going down on the monster cock. Now would be a good time to wish you were double jointed. Logan starts to lick along the shaft before shoving as much of that Cuban pinga into his mouth. Mario just watches as Logan worships his thick dick. Logan takes his time as he savors Mario's meat making sure to pay attention to his smooth balls. Mario is naturally smooth everywhere and he's in good company with Logan who is also a smooth one. Mario then lays Logan back on the rug as he moves in to return the favor. Logan's eyes roll back as Mario shows him what he can do with that mouth of his. Mario takes all of Logan in his mouth as they get each other hotter and hotter.They can't get enough of each other as they get into a hot 69 so they can each get more dick. Mario's cock needs more than a tongue bath as he lifts Logan's leg to get inside that hot hole of his. He slides inside that hole and Logan definitely rises to the challenge as he starts to get that ass fucked. Mario slides in and out of him as Logan jacks his rock hard cock off. After fucking on the floor they move up to the couch as Mario sits back and watches Logan sit on his cock. Logan impales himself on Mario's cock as he starts to ride that fat cock reverse cowgirl. Logan's cock is throbbing the entire time as he bounces on that delicious dick. Mario just kicks back as he lets Logan milk his dick with that sweet ass of his. Mario then gets Logan on his back as he starts to fuck him missionary. Mario picks up the pace as he's back in the saddle and in control of the dicking. Logan jacks his cock faster as Mario's thick cock hits all the right spots deep inside him. It won't be long before his cock's gonna want to explode. Mario fucks him harder and it sends him over the edge blasting a huge load all over himself. Mario then pulls out and adds his own leche to the mix.",
  "models": [],
  "release_date": "2010-10-20",
  "scene_id": 54872,
  "series": "Stick Ball",
  "tags": [],
  "title": "Stick Ball, Scene #02"
}