{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "The Holidays are approaching and the men just seem to get hotter; not that we're complaining. Here to make his debut as well as wet our holiday appetite is Brock Russell. Brock's a familiar face on some of our other sites and this sexy 37 year old from Cape Cod is always a welcome sight. In the Christmas spirit, we pulled a few strings and got him what he's been wishing for this year--9.5 inch uncut inches of Cuban cock. Yes, the man, the myth, the python is back. Miami's own Mario Costa... will be getting more than his stocking stuffed today. Let's not get ahead of ourselves. Christmas dinner will soon be served and we wondered what they are looking forward to the most. 'Lechon' is what Mario's looking forward to, like any good Cuban, since roast pork is the tradition on Christmas Eve. Brock's favorite is a dish his mom makes that consists of ham in a honey mustard sauce. They both admit they are economically responsible when it comes to Christmas spending. The economy always dictates the gift giving one way or another. But as far as gifts go this year, Brock is beaming since he's about to unwrap one he's been itching to for quite some time. Mario is grinning ear to ear at the thought, so buckle up, Betches! Mario's in for one hell of a ride.Brock's waiting for Mario to get dressed and once he is done, he looks too delicious to pass up. Brock starts to kiss him as he lets his hands roam. He slides Mario's tee off as we see his smooth chest. Brock's tongue has an agenda of its own as it makes its way down Mario's pecs and abs. There's only one thing stopping Brock from getting what he really wants--Mario's damn jeans! Brock undoes them and as they come down Mario's massive meat springs out ready for action. Ready is Brock's middle name as he quickly wraps his lips around Mario's massive meat. He savors that Cuban cock for a bit before hauling out his own to feed to Mario. Mario sucks on Brock's cock but it is short lived since Brock really wants more of that throbbing cock in his mouth. He kneels between Mario's legs and gets back to worshipping that meat. He does his best to take as much of that dick into his mouth as Mario moans his approval. They then get into a hot 69 so that they can both get their needs met. MmmmBrock's tongue, at it again, wanders south towards Mario's smooth ass. He eats his hole out making Mario squirm as he gets ready for more. Brock flips Mario over and slides his cock inside. Mario winces as he gives it up. His dick is rock hard as Brock starts to tap his ass. It's always a treat to watch Mario take a dick since he's usually the one on top. Brock is in ecstasy as his cock revels in that tight ass. He bends forward and sucks on Mario's knob as he continues to fuck him. Bigger IS better--who knew? He then gets Mario from behind as he starts fuckin him doggy style. He holds Mario still as he grinds his thick cock deep inside him. Mario is jacking his rock hard cock. It hasn't wavered since they started and as the action gets hotter his dick just seems to get harder. He sits on Brock's cock next as he rides that dick. Brock helps bounce him on his meat as his balls start to pull up needing release. Mario jacks his dick faster as he gets fucked and it sends him over the edge. He blows his 'leche' everywhere as he bounces on Brock's cock. Brock then jacks his cock off all over himself as he makes out with Mario. Guess someone's gonna be late for that Christmas party...",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "Mario Costa",
      "person_id": 28031
    }
  ],
  "release_date": "2010-12-15",
  "scene_id": 54887,
  "series": "Yuletide Log",
  "tags": [],
  "title": "Yuletide Log"
}