{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Chad Davis is back in the house to help us celebrate the Holidays. Chad, the extra hung 21 year old hottie from Florida's west coast has brought along a special friend. Well, we're definitely glad we're not in Kansas anymore; and neither is our latest find, Ashton Parker. Ashton is 20 years old and also Chad's other half. These hotties have been together a couple months now and going strong. Yes gentlemen, he's off the market. We asked these studs if they had $1K to donate this holiday season where would it go. They both are avid supporters of the Human Rights Campaign. If they had another $1K to spend on each other what would they get each other? Chad would get Ashton an iPad and some hair stuff. Ashton rolls his eyes since Chad's the one that's been dying for an iPad. Ashton of course admits he'd get Chad the iPad he's been begging for and accessorize it. Turns out that in his personal life Chad is a bit more versatile than he has been on screen which works out great for Ashton. Ashton is doing everything right it seems. Chad admits Ashton is one of the sweetest people he's ever met and as for physically 'You guys will see later' he beams. Ashton loves Chad's mind; that he's always in a happy mood and we can think of at least 8 other rather thick reasons to love Chad.Ashton's trying to guess what Chad's getting him for Christmas. 'You can ride on it' Chad says. Ashton wants more hints. 'You can sit on it' he adds. Chad decides to show him instead as he leans in for a kiss. They start making out and Chad soon stands in front of Ashton and gives him an even bigger hint when he hauls out his thick cock. How did we not see this coming? Ashton goes down on Chad's thick bone as Chad moans his approval. Chad gets his cock worked for a bit before wanting to return the favor. They switch places as Chad hauls out Ashton's low hangers. He plays and licks at those huge nuts before pulling out his massive cock. Ashton is packing a thick cock as well. Some guys have all the luck. Chad gets to work on Ashton's thick cock as he licks it up and down before engulfing it. Chad tries to take it so deep he gags on it. Ashton then gets back on Chad's cock as he swirls his tongue around his throbbing cock. Chad's gonna need a lot more than that mouth of his in a minute. Any volunteers?Chad gets Ashton on all four as he lubes up and slides in. That ass opens up as Chad's thick cock rams inside. 'Oh Chad' moans Ashton as he gets that asshole stuffed. Ashton's cock is rock hard as he gets pounded. Both of these studs are naturally smooth and defined. The chemistry between them is unmistakable as Chad impales his ass deeper and deeper. They look delicious as they fuck doggy style but that is about to change. Chad pulls out and sits back and has Ashton ride his meat. Ashton quickly gets back on in a reverse cowgirl as breaks into a full gallop. As he bounces on that thick cock, Chad starts to ram it up into him even harder. 'You like that, Baby?' he coos. The sound of Chad's balls slapping away at that insatiable ass fill the room. Chad then gets on top of Ashton and slides back in missionary. Chad rams that cock in over and over as Ashton moans and groans his appreciation. Ashton can take a dicking and his rock hard cock is seconds from exploding. As he starts to shoot, Chad fucks him even harder making him explode all over his defined abs. Chad then pulls out and drenches his man with a huge load. The first of many Christmas presents. We should all be so lucky.Happy Holidays from ExtraBigDicks.com!",
  "models": [
    {
      "name": "Chad Davis",
      "person_id": 28421
    },
    {
      "name": "Ashton Parker",
      "person_id": 28798
    }
  ],
  "release_date": "2010-12-22",
  "scene_id": 54889,
  "series": "Merry Fucking XXXmas",
  "tags": [],
  "title": "Merry Fucking XXXmas, Scene #01"
}