{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Today we have a couple of new faces for you. The first is Connor Maguire. Connor is 19 and he's from Miami. The second addition to the fold is 19 year old Alexander Greene. Alexander was born in Jersey but now calls Miami home. Both of these boys have more than just being 19 in common, but we're getting ahead of ourselves. We asked these two what their dream automobiles would be. Alexander is keen on the new Lexus while Connor wants the 90's Bat Mobile. Excellent, Maguire, excellent. Alexander, like Connor, has a lot more than many between his legs but Alexander didn't even know he had a huge cock until a couple months ago when he showed up to a studio and they informed him of the amazing news. We learn something new every day. Both of these guys are horny all the time and admit they get off a lot and most of it is taking care of the equipment between runs. They each get off a few times with help from a female or three a week which isn't a bad average factoring in the recession and their egos. Fortunately, Connor admits that even str8 guys get curious about each other's junk and will sneak the occasional peak in the showers. Well, today they'll have more than enough time to check each other out. ...Shall we?Connor is checking his cell when Alexander comes in with girlfriend drama. Apparently his dick's too big and she won't take it--AMATEURS! Connor doesn't believe him and asks him to show him. Alexander undoes his jeans and his cock is already rock hard. Connor is amazed at how big that dick is. He strokes it through his briefs a bit before taking it out to get a better look. Alexander just watches Connor stroke his now throbbing cock. He knows exactly where this is going. Alexander strips down to his briefs with Connor still tugging on his meat. He drops his drawers to give Connor better access. 'Can I put it in my mouth?' Connor asks as he looks up at Connor with puppy dog eyes. 'Go for it' Alexander coos as he watches Connor wrap his lips around it. Alexander can only moan as he gets his thick cock sucked. Alexander is naturally smooth and he bites his lower lip as Connor continues to milk his dick paying special attention to those big balls. 'Let me see yours' Alex says as they stand and compare equipment. They jerk each others cocks as they get harder. Connor isn't done with that thick dick so he's soon back on his knees for more of that juicy dick. He sucks on Alexander getting him rock hard for more.'Whoa that's a tight ass' Alexander amazes as his cock slowly makes its way inside. Connor's str8 ass isn't giving it up easily and as Alexander gets that ass used to his thick cock, Connor just grunts and groans while doing his best to accommodate it. Alexander won't have to worry about that case of blue balls anymore since he's soon sliding his thick cock in and out of his buddy's hole. Alexander fucks Connor's beefy ass doggy style as his smooth balls slap away at that ass. He picks up the pace as Connor's ass starts to enjoy the intrusion. Alexander then flips Connor over and fucks him like he wanted to fuck his girlfriend--on his back with his legs in the air. He slides his massive cock back inside that tight hole as he keeps fucking Connor. He starts to fuck him faster hitting Connor in all the right spots. This str8 boy knows how to fuck. Alexander's not done yet as he sits back and has Connor ride his cock. Connor impales himself on that dick and bounces on it as they both get closer to cumming. As they near orgasm they sit back side by side and shoot their loads all over themselves. Proving the familiar adage once again, 'We don't need no stinkin' girlfriends!' lol",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 28463
    },
    {
      "name": "Connor Maguire",
      "person_id": 28024
    }
  ],
  "release_date": "2010-12-08",
  "scene_id": 54886,
  "series": "Dick Straighty",
  "tags": [],
  "title": "Dick Straighty"
}