{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have plenty to be thankful for this week and it's a good thing we can't seem to get enough of Texas native, Parker Perry. In our defense, with a face like that and his mouth-watering uncut cock, we have at least 9 reasons why--and by 'reasons' we mean inches.  Parker's in for a treat this afternoon as we welcome Las Vegas native Rod Daily. Rod is 29 and has quite the body on him. We're looking forward to seeing him in a lot less. We asked these two studs what in their closet do they wear when they wanna go out looking hot. Rod likes to rock it in a tank top and shorts since Vegas is kinda hot. Parker likes to dress down in his Diesel jeans and tee shirt. Parker might need to rock a tank were he to visit Vegas; since that sexy coat of fur he was blessed with may make Vegas even hotter. Parker and Rod are both horny boys and Parker likes to wank it at least twice a day. Rod keeps it down to once a day; unless he's shooting that day then it's strictly a 'hands off' policy. They call it the money shot for a reason. Speaking of money shots, we asked what triggers the biggest loads when in bed with another hot guy. For Rod it could be anything depending on who he is with or what he's doing at the moment. Parker, hands down (and legs up), knows exactly what he likes--to get fucked really hard. ...Enough said.Rod's showing Parker a new app he has that makes things appear fat. After playing around trying to take each other's pics, Parker stumbles onto Rod's abs. 'You trying to make my abs look fat?' Rod asks. Parker looks at his rock solid abs and reassesses the situation. His aim suddenly veers south. 'You want something you can take a picture of?' Rod teases, grabbing his crotch. They start to kiss as they grope each other and start to peel off each other's clothes. Parker is on his knees waiting for Rod to free his cock. Once he does, Parker goes down on him taking every inch of it. Rod moans as he watches his cock disappear. Rod then moves to return the favor. He undoes Parker's pants and hauls out his thick cock. He goes to work sucking on that thick dick while Parker moans his approval. Rod's cock is rock hard and his low hanging balls dangle below as he takes as much cock as he can. Rod is naturally smooth and he keeps everything hair free. The definition he's achieved is impressive and Parker's not about to let that go to waste. Parker gets right back to suckin his meat getting it harder for a lot more than oral.'Suck that dick, Dude!' Rod groans as Parker deep throats his meat with ease. Rod's cock is throbbing as they get into a hot 69 and continue pleasing each other. Rod can only take so much before he gets Parker on all four and slides inside. Parker's hairy ass gives way as Rod starts to fuck him deep. Every muscle is writhing beneath his skin as Rod fucks that hot hole. His heavy nuts slap away at the ass he's claiming as he buries his dick. Rod aims to please as Parker gets the rough fuck he wanted. He flips Parker onto his back and shoves his boner in for more. 'Like that dick in your ass?' he taunts as Parker squirms in ecstasy. 'Fuck me with your big dick!' Parker begs as Rod starts to slam in and out of that tight ass. Parker is jackin his dick in time to the fucking he's getting and it gets him close to cumming. As he starts to unload his thick cargo, Rod jack hammers his dick into him. Once Parker's done, Rod pulls out and hovers over Parker's face to give him a hot protein facial. Happy Thanksgiving indeed from all of us at ExtraBigDicks.com!",
  "models": [
    {
      "name": "Rod Daily",
      "person_id": 28096
    },
    {
      "name": "Parker Perry",
      "person_id": 28487
    }
  ],
  "release_date": "2013-06-19",
  "scene_id": 54881,
  "tags": [],
  "title": "The Daily Show, Scene #01"
}