{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Topping off 2010 with a bang we bring you 2 new faces this week, Jess Taylor and Mason Coxx. Mason is 24 from Connecticut. Jess is 23 and a local boy from Florida. On the cusp of 2011 we asked these studs what one of their highlights was for this past year. They both agree that moving back home this year has definitely been the highlight. Click those heels three times, because there really is no place like home. Speaking of 'home' we turned the topic to the more familiar--literally--and asked them if big dicks run in the family. 'Seven (brothers) not so much; and only 2 are big' shares Mason. Someone was busy procreating in Connecticut. Jess has no idea whether or not big dicks run in his family and wants to keep it that way. If these two seem comfortable around each other it's because they have history being that they are friends (with benefits)--the best kind of friends. It seems opposites attract since their opinions on most things don't align. Jess prefers uncut cock and likes his men ink free. Mason doesn't have a preference on cock and loves a guy with tattoos. What we can concur on is that when it comes to horizontal relations they both agree to 'meat' in the middle. ...Enough said. Mason is shaving as he gets ready for the party. Jess comes in to 'get him going' and he manages to do just that. They end up on the couch and decide they can be fashionably late --cock calls! They make out as Jess' clothes come off. Mason pulls that dick free and swallows it. 'You like that cock?' teases Jess as he starts to fuck Mason's face. Mason slurps on that meat while Jess moans his appreciation. Mason's own 9' cock is rock hard and at attention while he sucks that dick. That cock will get the attention it deserves as they switch places and it's Jess that's getting his tonsils tickled. Mason holds Jess' head still as he rams his thick cock deep. Jess strokes and sucks on that cock like a pro as it throbs to his every touch. Jess sits up to better worship that thick cock as Mason slaps his tongue and face with his dick ordering Jess to look at him as he pleasures that thick dick. Fortunately, pleasuring that dick tops the 'TO DO' list this afternoon and it's Jess who is to be 'done'. They stand and playfully slap cocks together before Mason bends Jess over for more.Mason spreads that smooth ass open as he aims his meat at the intended target. He shoves inside as Jess' ass concedes. Jess can only groan and beg for more as Mason's smooth balls meet his ass. He pulls back and starts to fuck his ass as he quickly picks up the pace. 'Gimme that big dick!' Jess grunts as Mason stretches his tight ass wide. He pounds his hole as the sound of ball slapping fills the room. Mason then switches it up and puts Jess on his back. He doesn't waste any time before shoving that cock back in for more. By now both of these smooth studs are glistening in sweat as Mason continues to shove his thick cock deep inside. Jess is rock hard and can't help but jack himself off while he gets plowed. Mason then sits back and watches as Jess straddles his dick and sits on it for more. He rides that cock reverse cowgirl as he bounces up and down on Mason's cock. He wants every inch inside him and Mason is more than willing to oblige. That thick dick hits Jess in his sweet spot making him cream. 'Happy Fucking New Year' Jess grunts as he shoots all over. Mason quickly pulls out and moves over Jess' face giving him a thick, 2010 commemorative facial. Now that's how you send off an old year and welcome in a new. Whew.Happy New Year from all of us at ExtraBigDicks.com!",
  "models": [
    {
      "name": "Jess Taylor",
      "person_id": 28800
    },
    {
      "name": "Mason Coxx",
      "person_id": 28799
    }
  ],
  "release_date": "2010-12-29",
  "scene_id": 54892,
  "series": "New Year's Sleaze",
  "tags": [],
  "title": "New Year's Sleaze, Scene #02"
}