{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "They say that 'Knight' time is the right time; and we couldn't agree more as we welcome back Trevor Knight. Trevor is now 29 and holding. Looking like he does this Bostonian ain't going anywhere. If he was to go 'anywhere' he might want to take his co-star this week, Mr. Logan Drake, with him. Logan is 22 and a native Floridian from Orlando. We asked these two if they were deserted on an island and could bring along any TV show series to watch on this deserted island (...which apparently comes with flat screens and free electricity) what would that show be? 'Family Guy' hands down for Trevor who could watch that show for days straight. Logan would take along his 'Friends' and that way he would never be alone. Who wouldn't want Phoebe along on an island adventure? Ok, seriously, put your hands down. We then asked once they got off this island where would they want to eat. Ruth Chris for Logan, whose mouth is already watering for a filet mignon and Trevor would go straight to a little eatery in Los Angeles named St. Felix who also serves up a great steak. Well, all this talk about meat has our mouths watering for more than what is on the menu. Let's get these two better acquainted shall we? '--Let them eat Steak!'Logan is fast asleep on the chaise when Trevor comes in wanting to play. He slowly starts to feel on Logan's chest and arms as he moves south. Logan wakes up as Trevor's hands reach his crotch and they start to kiss. Their shirts come off as their hands fumble to strip each other. They move to the chair as Trevor helps Logan out of his pants and stands to allow Logan to undo his. Logan comes face to face with Trevor's 9'+ monster cock and he knows exactly what to do. He opens wide and shoves as much of that thick cock into his mouth. He strokes the shaft a bit before going back down on it. Logan's own thick cock is at attention as he nurses on Trevor's. Trevor doesn't want to feel left out so they switch places so that Trevor can have some dick to suck as well. He lies between Logan's legs as he sucks on his cock. Logan moans as Trevor swallows every inch of his aching cock with ease. Once Trevor's had his fill he stands up and goes right back to shoving his dick down Logan's hungry throat. Logan can't get enough of his thick cock as he lies back and gets his mouth fucked. ...but wait, there's more.Trevor then bends Logan over and inspects that hot ass he will soon own. He fingers that ass as Logan gets hornier for cock. Trevor then sits back as Logan straddles him and jacks both their dicks together. Trevor's cock is throbbing by now and needs a hot hole to fuck. Logan lubes Trevor's cock up and winces as he sits down on that thick cock. Once his ass gives way he starts to bounce up and down on it, slowly getting more and more inside his tight ass. Trevor lays back and watches as he gets that thick meat ridden. It isn't long before Trevor's balls are slapping that hairy hole as Logan's ass takes all 9 inches deep inside. Trevor loves it and holds Logan by the waist as he helps bounce him on his cock. Logan then gets up and turns around, sitting on his cock again only this time facing him. Trevor spreads that ass open getting his meat in him deeper. Trevor is going nuts as Logan's hot ass milks his thick cock. Missionary is next as Trevor gets Logan on his back and pounds away at that ass. This position always does the trick as he pulls out and unloads all over Logan who isn't far behind with a huge load of his own.",
  "models": [
    {
      "name": "Logan Drake",
      "person_id": 28418
    },
    {
      "name": "Trevor Knight",
      "person_id": 28736
    }
  ],
  "release_date": "2011-01-05",
  "scene_id": 54893,
  "tags": [],
  "title": "Knight Stick, Scene #01"
}