{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Mario Costa is back this week to finish off January and get us ready for February.  We also have Mason Coxx back this week after making quite the impression sending off 2010 in our New Year's update. Mason is 25 and originally from Connecticut. Mario is 24 and a home grown hottie from Miami. We asked these hung hotties what was the best Christmas present they got this past Christmas. Mario got a sweet watch while Mason got a scratch off ticket that won him $500. That skipped his wallet and went directly towards his car payment. Both of these guys are packing a little more than average with Mason toting a thick 9' cock which comes in just shy of Mario's Cuban at 9.5 inches. We wondered if having such big dicks they were able to blow or fuck themselves. They both blush that they can't even though they've tried. Can't blame a guy for trying! Both of these skinny studs have huge cocks and we wondered if there was a down side to packing such big dicks. They both agree that at times people can't take them; but they aren't about to trade them in for anything smaller. If you can't take the heat get the hell out da kitchen. I'm sure we speak for monster cock aficionados everywhere when we say, 'You can't send in an amateur to do a Size Queen's job'...or something like that. Mario comes in all dressed up to head out to his reunion. Mason has other plans as he goes in for a kiss. The suit comes off quicker than a prom dress as Mason starts to tug on Mario's massive cock. Mario's briefs can hardly contain that dick. Luckily, Mason has a better place to put it. He opens wide as he slides Mario's massive cock inside his eager mouth. Mario moans his approval as he gets his cock sucked to the hilt. Mario drops his briefs and gets comfortable as he starts to play with Mason's meat. Finally he has someone as hung to play with as he strokes Mason's thick cock. He goes down on Mason to return the favor as he wraps his lips around that throbbing cock. Mason watches as the Cuban stud worships his dick. Mason then stands up to give Mario better access as he slowly fucks his face. Mario can't get enough of that dick as he savors every inch he has to play with. Mario's own cock is throbbing as they move into a hot 69. Mason takes top bunk as he slides his meat back into Mario's mouth and bends forward for more of Mario's. These studs can't get enough.'I want you inside me' coos Mason as he looks up at Mario. Mario is more than happy to oblige as he suits up and watches as Mason sits on his thick cock in a reverse cowgirl position. Mason's hungry hole opens up for that thick dick and is soon riding it like a champ. Mason's own cock is rock hard and bouncing like a diving board as he rides that cock. Mario's in ecstasy as he gets that cock ridden. Mario then switches it up as he bends Mason over and gets some more of that ass doggy style. No matter how he gets it, Mason takes it. Mario looks down to watch his thick cock sliding in and out of that tight ass with ease. He buries that dick all the way to the base as his eyes roll back with pleasure. Missionary is next as he gets Mason on his back with his legs in the air. He gets right back to pounding that hot ass as Mason starts jacking his rock hard cock. Mario's thick cock is hitting him in all the right spots as Mason cock's explodes sending his thick load all over his navel.  Mario isn't far behind as he unloads all over Mason's cum covered cock.",
  "models": [
    {
      "name": "Mario Costa",
      "person_id": 28031
    },
    {
      "name": "Mason Coxx",
      "person_id": 28799
    }
  ],
  "release_date": "2011-01-26",
  "scene_id": 54899,
  "tags": [],
  "title": "Costa Rica, Scene #01"
}