{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Brenn Wyson is finally making his debut on ExtraBigDicks. Brenn, the Boxer from Boston, makes 39 look delicious. We also have another new face making his debut this week, Christian Ray. Christian was featured on our brother site, CircleJerkBoys, to rave reviews so we didn't see why we couldn't let Brenn at this hot 20 year old import. Feed him to the Christian! (...or is that the other way around?)  We asked these studs what their favorite vacations had been. Lithuania for Brenn who found it to be beautiful while over there researching his family roots. Christian loves vacationing on the beach with his family. They both knew they had big dicks by the time they were 12 and while Brenn considers himself to be a freak in the sack Christian considers himself to a bit more reserved. Don't let the innocent face fool you, Christian may be more reserved but he boasts that he's good no matter where he lands. Versatility is key! Well, the challenge has been made since Brenn considers himself to be not only a power fucker but a hot bottom as well. 'We'll have to see', Brenn grins. Place your bets gentlemen, things are about to get a hell of a lot more interesting...Brenn's feeling horny and is in his room doing something about it. He undoes his pants to give his growing cock some room. Unbeknownst to him, Christian peeked in the door and is now transfixed staring at Brenn playing with his thick cock. Brenn pulls it out of his briefs and starts to jack off. Christian's own cock comes alive as he watches the show.  It's the classic boy stalks boy stalk. Get it? 'Stalk' first as a verb; then as a nou--never mind. Christian can't hold back any longer and walks in on Brenn. Brenn is happy to see him as they start to make out. They strip down to their briefs as Brenn sticks his dick down Christian's throat. He face fucks his new friend as Christian struggles to take all of it. Brenn lies back as Christian gets right back on his dick giving him one hell of a spit shine. 'I wanna suck your cock' Brenn moans as he gets the chance to return the favor. Christian stands and once Brenn wraps his lips around his cock, starts to throat fuck Brenn making him gag. Christian then takes top bunk in a hot 69 as he sucks on Brenn's dick while fucking his throat.The party moves to the chaise where Christian sits on Brenn's massive cock. Christian's tight bod slowly impales itself taking all of Brenn's meat up inside him. Christian's cock is rock hard as he starts to ride that dick. Brenn shoves his dick up into that ass as he makes him take it. Christian isn't about to back down and orders him to give it to him harder. 'Ride that fucking dick, my little Cubano boy' Brenn grunts as he watches his thick Boston bone slide inside that hot ass. Brenn is soon bent over as Christian takes his turn at bat. 'You like it?' Christian asks as he starts to pound Brenn's tight ass. Brenn loves that Cuban cock as he gets that hole pounded. Christian grabs Brenn by the waist as he slams his meat home. The sound of fucking fills the room as Christian's balls slap away at that hot ass. Brenn loves that dick but he wants the driver seat again as they flip again. 'Fuck that ass' Christian begs as Brenn goes back to fucking that tight ass missionary. The chemistry between these two is explosive and we're about to see just how explosive as Christian fucks himself on that dick busting a huge nut all over his defined abs. Brenn is next as he pulls out and coats Christian's navel with even more leche. Mmmm, Leche...it does a body goooood.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Christian Ray",
      "person_id": 28431
    }
  ],
  "release_date": "2011-01-19",
  "scene_id": 54897,
  "series": "Leche Fresca",
  "tags": [],
  "title": "Leche Fresca, Scene #01"
}