{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Stars may have fallen on Alabama; but today Alabama has nothing on us as we finally welcome back Brad Star. Brad is all grown up and at 27 we're glad he decided to return to his rightful place in front of the camera. Sometimes a few years away from the industry helps you attain a good perspective on things. We're definitely glad he's back and you'll know why soon enough. Here to help welcome Brad is our very own Colombian 'estrellita', Alexander Garrett. Tall, dark and hung: 34 year old Alexander is a Latin dream. Alexander has done his fair share of work and admits he's been recognized on the street. Even though their lives seem like open books, it's refreshing to know that Brad prides himself on his cooking while Alexander loves being a family man. Both of these studs are packing more than the average guy. They both learned at an early age that they were 'gifted' in certain areas. Having the type of equipment they have they both have run into situations where their partners were willing but just weren't able to accommodate them. --amateurs! Well, fortunately they are in good company and we're sure we speak for size queens everywhere when we say...Let's get this party started.Brad and Alexander are chillin' when Brad asks Alexander if he's ever been with anyone that wanted to fuck him and had a bigger cock than him. Alexander tells him that that's never happened. 'Well, today's your lucky day' Brad grins as he pounces on Alexander. They strip their clothes off as their hands explore each others cocks. They stand and unleash their meat as we get our first glimpse of the all you can eat meat buffet. Alexander's thick uncut cock is huge but no match for Brad's 9'+ boner. Yeah, today is definitely his lucky day as Brad goes down on his thick cock. Brad takes his uncut cock deep in his throat while jacking his dick as he sucks it. Alexander moans his approval as he watches the All American jock gagging on his thick Latin meat. Brad then sits back and wants some in return as Alexander gets to work. He kneels between Brad's legs and worships that cock, taking as much of it as he can. Brad moans as Alexander polishes his knob. From here they maneuver into a hot 69 so that they're both happy getting as much cock as they want.'I think it's about time I fuck that ass' announces Brad to Alexander who is still latched onto his meat. He gets Alexanderon all four and spreads that hot ass; teasing his intended target. Brad then suits up and starts to slide his cock inside. Alexander's tight ass gives way and soon you can hear his muffled moans as he gets that cock rammed up his ass. Brad holds Alexander by the waist as he impales him, slamming his rigid dick deep inside him. Brad's ripped abs tense as he pumps away at Alexander's hungry hole. 'Awww fuck yeah' grunts Brad slamming his meat deeper and deeper. Alexander is taking one hell of a fucking--but wait, there's more. Brad then flips Alex over on his back lifts those muscular legs and gets right back to fucking that tight ass. Alexander grunts and moans as he does his best to take that cock stretching him wide open. Brad fucks deep and doesn't ease up as he makes that ass his. Brad's definitely met his match and as they switch positions he gets served. Alexander sits on his cock and starts to bounce on that cock like a spring board as Brad's eyes light up in awe. Alexander grinds his cock deep sending Brad over the edge. Brad unloads all over Alexander's chest setting off Alexander who unloads all over his cum covered abs and chest as well. Whew.",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Brad Star",
      "person_id": 28570
    }
  ],
  "release_date": "2011-01-12",
  "scene_id": 54896,
  "series": "Shooting Star",
  "tags": [],
  "title": "Shooting Star"
}