{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We're taking a walk on Easy Street this week as we welcome back Cole Streets. This 31 year old sexy hottie from California's bay area is a definite crowd pleaser. Well today it's Cole who will be pleasantly pleased by a 34 year old hailing from Colombia, Alexander Garrett. The chemistry between these two is on fire and they're still fully clothed. Yum! We decided to ask what food they each looked forward to. It's Thanksgiving with all the trimmings for Cole, who is especially fond of the dressing. Alexander has a sweet tooth and would love to focus his interests on desserts like chocolate cake or cheesecake. We then wondered what they would love to have more time to do if they had more time to do it. Cole would love to be able to just kick back and relax and catch up on his TV shows. Alexander would also love to lay back and play with his remote and maybe watch some porn. Well, we're guessing it'll be more than the remote he ends up playing with. They both discovered they had larger than average cocks relatively young and both agree it's nice not having to worry about disappointing their lovers. Well, we know we definitely won't be disappointed... ROLL EM!They start kissing even before we start filming. Alexander's hands roam all over Cole's hairy chest as they explore each other. Alexander takes off his warm up jacket showing off his smooth and defined abs. He slides off his pants and his cock is ready for action. Cole doesn't waste any time as he hauls that Colombian meat out and goes down on it. Alexander is rock hard as Cole gives it the attention it needs. Alexander loves that mouth on his dick; but he's beginning to feel left out. He takes out Cole's thick cock and gets some dick too. He licks along the throbbing shaft before swallowing it to the hilt. Cole's cock is throbbing as it gets spit shined. Alexander then stands up wanting more attention on his own 'situation'. Cole is more than happy to help as he goes back to gorging on that thick uncut cock. These two can't get enough of each other as they take turns on their dicks and suck face. When Cole's not choking on Alexander's meaty cock Alexander's worshipping Cole's. Cole then gets Alexander on all four so he can get a taste of that hot ass. He runs his tongue along that tight ass as he slides his fingers inside, getting that ass hungrier for more than just his digits.When Cole's ready he stands and starts to push his thick cock in. Alexander groans as he gives it up. Cole's smooth balls are soon slapping away at that hot ass as he fucks Alexander doggy style. Alexander's own cock is rock hard and at attention as he gets that hot ass railed. Cole can't get enough of that hot ass wrapped around his meat as he continues to drive it in deep. Cole then moves the party back to the couch as he gets Alexander on his back. He lifts those muscular legs as he aims south and slides back inside. He grabs Alexander's boner and starts to stroke it as he fucks that hot hole. An overhead shot shows Cole's thick cock stretching Alexander's hole wide open. Alexander can't get enough cock. We can't say we blame him. The party then moves back to the chaise as Cole sits back and watches Alexander sit on his meat. He impales himself back on for more as he starts to ride that cock. Alexander can't help but start to jack his cock off as he gets that ass filled and it sends him over the edge. He lies back and explodes all over his own cock. Cole cums in a close second as he shoots jet after jet of load all over his furry pecs. Damn Baby!",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Cole Streets",
      "person_id": 27983
    }
  ],
  "release_date": "2011-02-16",
  "scene_id": 54903,
  "tags": [],
  "title": "On Sleazy Street, Scene #01"
}