{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Mason Coxx is back in the house with us this week. Mason is helping us welcome a new face to the EBD Club, Mr. Aaron Felix. Aaron is a baby-faced 20 year old that is originally from California but is spending a few months right here in sunny South Florida. Mason, for those of you unfamiliar with this hung 25 year old hottie, is originally from Connecticut. We wondered how health conscious these two fit hotties were and it turns out they are both very aware of what goes into their bodies. Aaron eats lots of small meals a day and buys organic whenever possible. Mason is a self-professed ?pesceterian?. Turns out he only eats seafood along with dairy and vegetables. So the only red meat he enjoys is...well?you know!  We then wondered how they lost their cherries. Aaron lost his at 16 when he and the boy he was dating decided to take it to the next step. Mason lost it at 11. We opted out on the lurid details. Grammys around the corner we then asked them what they would win an award at the Sexual Grammys. Aaron says he'd win ?Best Top? while Mason would win ?Best Cocksucker?. Well, let's see what got these boys nominated in the first place. Shall we...Aaron comes in ready to roll when Mason tells him that he should iron his jeans. Aaron doesn't know how to iron so Mason offers to and takes off Aaron's pants. As he does he realizes there's a growing bulge in Aaron's briefs. Iron! ...What iron? Mason hauls out Aaron's thick cock and wraps his lips around it. ?You like my dick?? Aaron coos as he gets his cock worshipped. Mason can't get enough of that delicious cock as he swallows it balls deep. ?Awww fuck? Aaron exclaims as Mason deep throats his massive tool. We don't know why he's in awe... he did win the Grammy for cock sucking. He tugs on Aaron's smooth nuts as he strokes and slurps on it. Aaron is naturally smooth and defined. Mason takes his time pleasing Aaron as he polishes that cock with ease. Mason then stands and puts his extra thick cock in Aaron's face. Aaron strokes it and looks up at Mason as he teases him with a naughty hand job. ?You have such a nice dick? Aaron says before Mason pulls him to his feet so they can rub their cocks together. Their massive cocks slap against each other as they gear up for more.Mason then gets on his back and spreads his legs wanting that cock inside him. Aaron starts to shove inside as Mason's hole gives way. ?You have such a tight hole? he moans as that hot ass slowly engulfs his dick. Aaron's thick cock is soon sliding in and out of that hot ass as Mason gets fucked missionary. Aaron's thick cock is throbbing as it shoves its way in that hole. Aaron then switches it up and sits back so that Mason can ride that dick some more. Mason straddles him in a reverse cowgirl and gets back to taking that dick. Mason's own fat cock is rock hard as he bounces on that cock wanting to get every delicious inch buried inside him. His thick tool is bouncing up and down like a diving plank as he rides. Aaron then bends him over to tap that ass doggy style. Mason doesn't care how he gets it as long as he gets plenty of it as Aaron's balls start to slap away at that ass. He pounds away at that hole stretching it wide open as he holds Mason's tight waist. As he nears climax, Aaron sits back and has Mason lick his balls while he jacks an impressive load all over his smooth abs. Mason delivers seconds after Aaron as he blows all over Aaron's cum drenched abs.",
  "models": [
    {
      "name": "Aaron Felix",
      "person_id": 28502
    },
    {
      "name": "Mason Coxx",
      "person_id": 28799
    }
  ],
  "release_date": "2011-03-09",
  "scene_id": 54909,
  "tags": [],
  "title": "CoxxTail, Scene #01"
}