{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Two hot boys this week to share and the first is Ty Benton who is 22 years young and from Phoenix. Hayden Alexander makes up the torrid twosome. Hayden is 19 and from Newport, Arkansas. They both love Florida and we imagine the weather in the tropics must be a welcome change. We wondered while they were down here what comfort food they miss back home. Hayden loves Italian food with extra cheese. Ty recently was turned on to a local joint that makes chicken and waffles. Well that covers food, so we turned to entertainment and wanted to know what they like to watch on TV. Saturday Night Live for Ty and Burn Notice is Hayden's absolute favorite. Hayden has been rumored to have a little extra in his briefs than most guys so we wondered when he became aware of that 'gift'. Hayden noticed when he was about 12 that he had a lot more swinging between his legs in the shower and as the years went by none of his friends ever caught up. Ty didn't have his first experience with another guy till he was about 17 so that was the first time he got to compare notes and appreciate the sweet standard package he was blessed with. Well today, we're gonna let these two loose so they can put their 'natural talents' to good use...Hayden's alone looking at a porn mag and his hand is getting the party started in his pants. Ty comes in and decides to give Hayden a better option. He takes away the mag and reaches for Hayden's growing cock. They start to make out as they explore each other. Ty loses his shirt as Hayden undoes his pants. Soon they are both in boxer cut briefs that are struggling to contain their boners. Ty sits down and takes out Hayden's massive cock. He opens wide as he slides that aching meat inside. Hayed sighs as he gets that cock sucked on. Ty takes it out of his mouth and starts to stroke it up and down needing both of his fists to do it. He can't get enough of that dick as he goes right back to sucking it. Hayden loves the attention but doesn't want to seem selfish as he gets Ty on the chaise. He gets to work sucking on Ty's growing cock that is more than appreciative of some T.L.C. Hayden kneads his smooth nuts as he works his throbbing pole making him even harder. Hayden then gets Ty on all four so he can explore that hot ass he'll soon make his own. Ty groans in ecstasy as he gets that hot ass fingered. That finger feels so good; but he's gonna need sooo much more.Hayden suits up and gets into position as he watches Ty sit back on his dick. In a reverse cowgirl, Ty takes that thick dick up inside his tight ass. Hayden strokes Ty's swollen meat as he struggles to take Hayden inside. Hayden holds his massive meat at the base as Ty's ass slowly concedes letting only a little in at a time. Once he has a better feel for that meat, Ty starts to ride it as Hayden watches his looks of pleasure and pain come across his face. Ty's cock is rock hard as he gets nailed. This stud loves that fat cock inside him. We ain't judgin' lol... Ty does dips onto that cock getting that dick deeper and deeper till he takes it all. Once he's used to that fat cock, Hayden bends him over and takes that ass doggy style. Ty grunts and groans as Hayden fucks him. Hayden reaches around and strokes Ty's cock that has yet to go limp since he got that dick in him. 'Like it?' Hayden moans. 'God I love that cock in me' moans Ty as he continues to get that hot ass railed. Missionary is next as Ty gets flipped on his back. Legs up and that dick goes right back to pounding his prostate. Hayden fucks him faster and it's going to send Ty over the edge. 'Cum baby' coos Hayden as he slams his fat cock deeper realizing Ty's about to cum. Ty explodes sending a huge load all over his smooth navel with Hayden still buried inside. Hayden is next as he unloads adding more cream to the mix.",
  "models": [
    {
      "name": "Hayden Alexander",
      "person_id": 28805
    },
    {
      "name": "Ty Benton",
      "person_id": 28437
    }
  ],
  "release_date": "2011-02-09",
  "scene_id": 54902,
  "series": "Ty One On",
  "tags": [],
  "title": "Ty One On, Scene #02"
}