{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back after almost a year away, John Magnum is back in the house. Sporting more hair than his last visit, this rather evasive Alabama native currently lives in Los Angeles. Also back this week is Logan Drake. Logan is originally from Virginia but now calls Orlando home. Both of these boys left their hometowns and moved on. We wondered what they miss most after leaving home. Logan misses the place of his childhood and the memories but was glad to leave and get the chance to grow up. John misses the good old country cookin'. We're sure that isn't easy to come by out on the West Coast. John is avidly ?sexual?. He loves beautiful people and doesn't have a preference. John had already experienced everything before getting into the industry so he was already well prepped for the gig. Logan sexual preference involves getting dick but what we learned today is that even though we've only seen him as a bottom on our sites he assures us he's great at topping as well. We're not surprised since Logan isn't exactly lacking in that department. We'll have to make a note of that and maybe put that to the test.  They start making out as they break the ice. Logan pulls off John's tee as he buries his hands in John's sexy furry chest. They stand and continue kissing as their hands start to roam. It isn't long before these two studs are down to their boxers sporting boners. Logan gets comfortable as he starts rubbing John's cock through his boxers. John then pulls his boxers down just below his ass and bends over to make out with Logan as well as give us an eyeful. John's beefy ass is at its best as he shows off that hot ass. He gets back up and lets Logan have that dick. Logan's eyes light up as he gets it out and goes for it. His mouth opens wide as he takes that fat cock down his throat. John's thick cock is finally getting the attention it craves as Logan worships it. John soon returns the favor as he drops to his knees and shows Logan what he can do. Logan is moaning instantly as John puts that hot mouth to work. John spits on that cock before shoving it down his throat. Logan goes back down on John for a few before bending that hot ass over on the couch for John to desire. John's massive cock gets rock hard as he watches Logan's hot ass across the room. He needs a closer look as he walks over and shoves his tongue deep into that hot hole. Logan's whimpering at the sensation of that tongue on his hole. He wants so much more. John can't get enough of that hot ass as he continues to eat that hole. His dick is beginning to feel left out so John suits up and slides inside. Logan's ass slowly gives way to that thick cock and after giving Logan time to get used to his intruder, John is soon fucking that hole deep. He's fucking him missionary and we get a great shot of that thick dick just disappearing into Logan's tight hole. John is getting every delicious inch inside that ass and Logan wants it all. John then bends Logan over and fucks him doggy style on the chaise. His heavy balls slap away at that ass as Logan moans his approval. John pile drives his massive meat deep into Logan's hungry hole. No matter what John dishes out, Logan is happy to take it. Logan then straddles that cock and rides it. John bounces him up and down on his meat which does the trick for both of them. Logan explodes with John still buried inside him. John can't hold it any longer either, exploding seconds after Logan dismounts. Whew.",
  "models": [
    {
      "name": "Logan Drake",
      "person_id": 28418
    },
    {
      "name": "John Magnum",
      "person_id": 28752
    }
  ],
  "release_date": "2011-03-02",
  "scene_id": 54908,
  "tags": [],
  "title": "Magnum Men, Scene #02"
}