{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It's been far too long since our studio has been Diesel driven but this week we're in for a treat as we welcome back Diesel Washington. The Man, the myth, and this afternoon, the lover as Diesel decides to take things down a notch and show us and his co-star, Dylan Roberts, the 'softer side' of Diesel. You heard it here first! This will be 21 years old Dylan's 2nd time on EBD and we're pretty sure this Valentine's Day will be one to remember. We wondered what these two party animals did for New Year's Eve. Dylan spent the night hanging out with his Mom at home; while Diesel stayed home as well; read some comic books and watched the ball drop on TV. Hmmm these two have a lot in common it seems. St Patrick's Day is coming and we wondered what plans they would want. Dylan being part Irish dreams of going to the motherland and getting shit-face drunk in a real Irish Pub decked out in green. Diesel took the green and ran with it. He wants to have a lot of green with him, wear a lot of green, have a lot of 'green' and try not to step on any green throw up. Well Dylan won't need to worry about anything besides accommodating some Diesel as he gets the Irish fucked right out of him for Valentine's Day. <3 Diesel and Dylan start off all flirty telling each other how excited they are to meet the other when Diesel tells Dylan that rather than bang out he's about to give him some McLovin'?OH-NO-HE-DI-NT! They start to kiss as Diesel kicks it into sensual mode. He runs his tongue along Dylan's neck sending him into a frenzy. They stand and continue the tongue fest as they each lick necks and peeks, taking their time as they do. Diesel lies back as Dylan gets a better look at what's for lunch. He opens wide and slides his mouth over Diesel's thick cock. Diesel coos as Dylan samples the World's Finest Chocolate. Diesels cock throbs as it gets the attention it's been needing. Dylan goes nuts struggling to take Diesel's thick dick down his throat. 'Let me have a taste' says Diesel wanting to return the favor as he wraps his lips around Dylan's cock. Diesel loves to pleasure his partners and this bad boy can suck a mean dick. Dylan's head is spinning as he watches Diesel nursing on his rock hard cock. Soon enough Dylan wants more of Diesel's as he kneels to continue servicing his massive cock. Diesel starts to fuck that pretty face as his balls slap away at Dylan's chin giving him what he wants. Diesel then turns Dylan around and gets a taste of that sweet hole he'll soon be stretching open. He tongue fucks that hole as Dylan whimpers with excitement. As soon as that hot ass is spit lubed and ready for some dick, Diesel gets into position.Diesel gets Dylan on his back as he looks down and sees that hot ass, glistening with spit begging to be filled. He slides that thick 10' cock in as Dylan whimpers and groans trying to take that dick. 'My God your dick's so fucking big' He whimpers as Diesel slides that horse cock home. Diesel starts to fuck that hot ass deep and fast like only Diesel can. Dylan is rock hard and struggling to take the fucking he's being given when he yells out 'Stop it?you're gonna make me cum!' For the unassuming boy who said 'size never really mattered to him', things may have just changed forever. Diesel eases off and assures him he wants to make it last.  and goes back to tappin' that ass nice and slow. Diesel then lets Dylan sit on his thick dick. Dylan rides that big dick pleasuring himself on Diesel's dong. Diesel then gets him on his side and slips into him in a spoon position. He's bouncing Dylan's tight ass off his thick dick so hard that it sends Dylan over the edge. Dylan busts out a load that flies all over his chest and face. Someone was a tad excited. Diesel follows suit as he unloads a thick nut all over Dylan's face as well . Whew. Just when you think they're done, Diesel bends over and laps his load clean off. ...Oh Mr. Diesel, Bravo!",
  "models": [
    {
      "name": "Diesel Washington",
      "person_id": 28049
    },
    {
      "name": "Dylan Roberts",
      "person_id": 28414
    }
  ],
  "release_date": "2011-02-23",
  "scene_id": 54905,
  "tags": [],
  "title": "Diesel Power, Scene #01"
}