{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have a new face for all of you this week, Kyle Quinn. Kyle is 25 and originally from the District of Columbia. To help make him feel welcome we invited our favorite Colombian Alexander Garrett. Alexander is 35 and now lives in South Florida. Kyle is a skeptical Gemini who doesn't put all that much faith in astrology; while curious and eternally optimistic Alexander reads his Virgo horoscope whenever he gets a chance. Well we know what time of year they were born; so we wondered what their favorite flavor of birthday cake is. Kyle loves cookies & creme ice cream cake while Alexander loves chocolate cake. These two are sexual and love to jack off. Kyle likes to beat it on his couch while Alexander loves to tug in front of the mirror in his bathroom. We then asked where was the weirdest place they'd ever had sex. Kyle had sex in a frat house while Alexander says his weirdest place was in a car. Is that weird? Hmm. A confessional?now that's weird. We digress, now where were we? Oh yeah, well there won't be any weirdness on set this afternoon just an awful lot of nekidness...and a whole lot of fucking going on.The chemistry between these two is undeniable as they go at each other even before we've started filming. They make out as they slowly peel their clothes off. Kyle runs his tongue south along Alexander's defined abs as he continues to explore his new playmate. He pulls down Alexander's jeans to find his cock's rock hard and waiting to be freed from its cotton confines. Kyle opens wide as he frees Alexander's uncut cock and goes to work sucking on it. Alexander moans his appreciation for a few minutes before stripping off Kyle's underwear to return the favor. ?Suck that cock? Kyle orders, as Alexander swallows his thick cock to the hilt. He makes sure to pay special attention to Kyle's smooth balls which just launches him into orbit. Kyle is writhing in ecstasy as he gets his knob spit polished. Kyle then bends Alexander over on the ottoman so he can have access to that smooth ass. He dives in tongue first as he starts to eat that ass. Alexander moans as he gets a hot tongue shoved inside that ass. Kyle can't get enough of that hole as he laps and sucks on that hot hole.Kyle then straddles Alexander and squeezes their cocks together as he starts to jack them together. Alexander's cock is rock hard as Kyle slides a rubber on and starts to sit on it. Kyle grunts and groans as Alexander's thick dick starts spreading that hole wide. Alexander has Kyle moaning like a bitch as he starts to pump that thick Latin dick deep inside that smooth hole. As Kyle gets better acquainted with that cock he starts to ride it harder. He loses himself and grinds away at that cock as Alexander starts to pound his cock up in to him. ?Awww I love your cock in me!? moans Kyle as the sound of Alexander's balls slapping his ass fill the room. Then they switch it up as Kyle bends Alexander over and gives him plenty of dick as well. Alexander moans as Kyle starts to pound that ass doggy style. Kyle slams his meat in as deep as he can making Alexander grunt with every thrust of his cock. ?You like that?? Kyle coos as he continues to tap that ass. Then they go back to basics again as Kyle gets on his back for more cock. Alexander fucks him missionary until Kyle can't help but bust a load. Alexander then pulls out and unloads his own massive load all over cum-covered Kyle. Muy Caliente!",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Kyle Quinn",
      "person_id": 28443
    }
  ],
  "release_date": "2011-03-30",
  "scene_id": 54916,
  "tags": [],
  "title": "Quinner Takes Al, Scene #02"
}