{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Brock Russell is back with us on and we're glad to have him back. Last time we saw Brock, this 37 year old hottie from P-Town, Mass got the chance to top extra hung Mario Costa. What goes around comes around and today we have a new face that gets to return the favor. Kris Anderson makes his debut with us this week. Kris is 26 years old and originally from Portland, OR. We asked these two to tell us what the best year of their young lives was. Kris says each day gets better and thinks this year will bring the best days of his life. Brock reminisces that his 30s were much better than his 20s so he's going with 2007, the year he moved to Boston. We then wondered what their favorite food would be. Brock has a sweet tooth and was raised in Wisconsin so he's a steak and potatoes kinda guy. Kris loves pizza and claims to make a pretty good pie. We then asked these two to tell us the 3 things they need to have great sex. Chemistry, great kisser and knowing what you're doing are the three for Brock. Great smelling, great eyes and a bright smile are Kris' requirements. Well, we think Brock has ALL those qualities so now all we need to find out if whether or not Kris can kiss...They start making out as they break what little ice had the chance to form. The chemistry is obvious between these two as the clothes start coming off. Brock helps Kris out of his tee as his hands explore his smooth frame. Brock runs his tongue down along Kris' chest as he takes off his own tee. Kris' jeans come off as Brock starts to explore the tent in his boxers. He licks and teases Kris' cock as it throbs for more attention. Brock finally hauls out that fat cock and opens wide as he wraps his lips around it. Kris moans softly as he watches Brock struggle to take as much of his dick as he can. Brock grabs that massive dick by the base as he proceeds to fuck his throat with it. He grabs that meat with both hands as he double fists it. Brock then gets up as they start to make out some before Brock lies back and gets some help on his own throbbing cock. Kris is more than happy to return the favor as he swallows every inch of that cock. Brock can't get enough of that hungry mouth on his meat and is soon climbing over Kris to fuck his mouth some more. Kris swallows his meat as he strokes his own raging boner.Brock slides back a bit to make out with Kris which just lands that hot ass of his up against Kris' raging cock. Kris starts to hump and grind his cock up against Brock's smooth hole. We know where this is going. Brock then slides on a condom and lubes it up. He's got plans for that thick dick. He straddles that cock and moans as he slowly impales himself on it. It isn't long before that hot ass has every inch of Kris buried inside him. Kris grabs that hot ass and helps bounce him on his thick 9? cock. Brock takes that cock like a champ as he gets that cock slammed up inside him. Brock then gets up and bends over the chair so he can get it doggy style. Kris slides that long schlong back in for more as Brock groans for more. ?It's so fucking big? grunts Brock in heaven as he gets that ass stretched wide. Kris' huge low hangers slap away at that hole heightening his pleasure. Missionary is next as they reconvene on the couch. Kris easily slides inside that well worn ass that just wants more. Kris' thick cock is hitting Brock in all the right places and as he jacks his cock it sends him over the edge. Brock busts his nut all over himself while Kris fucks it out of him. Kris is next as he blows his wad ALL over Brock.",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "Kris Anderson",
      "person_id": 28028
    }
  ],
  "release_date": "2011-04-06",
  "scene_id": 54917,
  "series": "Passion of the Kris",
  "tags": [],
  "title": "Passion of the Kris, Scene #01"
}