{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Trey Turner is back in the house and looking better than ever. It's been way too long since we've seen Trey; but it looks like this 22 year old Fort Lauderdale boy has been hitting the gym. Trey's efforts will be greatly appreciated by his costar, newcomer Cole Branson. Cole makes his debut with us this week and this sexy 21 year old from Georgia, complete with that sexy hint of drawl, is packin' plenty. We wondered if these studs could pick a dream car which it would be. ?I'd love a BMW Z4.? beams Trey who would want his navy blue with beige interior. Cole jumps in on that bandwagon and wants one too. Cole's ZX4 would be black. We then asked them where they would want to take these cars to on a road trip. Trey would want to drive out to the California coast; while our Georgia peach would be just fine heading south to the Florida Keys. Key West can be just what you need to get your mind off things...and your dick in other things.  With that in mind we should get these two naked.Trey is waiting for a glass of water on the couch and as Cole goes to hand it to him he accidentally spills some on his shorts. How convenient. Trey stands up with his crotch soaked as Cole apologizes and tells him to just take them off so he can throw them in the dryer. As Trey drops his shorts, Cole notices the bulge in his briefs. ?Trey what's this?? he blushes as he grabs his growing cock. They start to make out as the rest of their clothes fall on the floor. They grope at each other's cocks and once Trey realizes just what Cole's packing he gets on his knees and gets to work sucking on that thick country cock. Cole moans as he gets his massive meat and smooth balls worshipped. Trey then stands to give Cole a mouthful as well. Cole slips onto his knees and starts to return the favor as he swallows Trey's cock to the hilt. He bobs his head up and down as he looks up at Trey who is reveling in the sensation. Trey then crawls atop the chaise to show off that hot ass of his. Cole is all over that as he starts to finger that hole he'll soon have around his dick.Cole teases that hole for a bit before sliding that cock home. Trey winces as his ass gives way to the thick dick making its way inside. Cole is fucking that hot ass deep in no time as the sound of ball slapping fills the room. Trey moans and groans as he takes Cole's fat dick doggy style. Trey's own cock is rock hard as he gets railed. Cole then pulls out and lies on the floor to give Trey the chance to squat and ride it. Trey impales himself on that thick cock and starts to bounce up and down on it as he works himself into a lust-filled frenzy. Cole lays back as Trey slowly pulls that thick cock almost completely out before sliding all the way back down on it. Cole strokes Trey's cock as he gets is own cock ridden. Trey is taking his time and loving every inch he's getting shoved up his hot ass. Then they switch things up and it's Cole that's on his back with his legs in the air. Trey suits up and slides his own cock deep into Cole as he starts to take that ass missionary. Trey's thick cock is harder than ever as he fucks that Southern hole. Trey picks up the pace and that does the trick as Cole blows all over himself. Trey is close behind as he too unloads all over one cum drenched Georgia Peach. Mmmm",
  "models": [
    {
      "name": "Cole Branson",
      "person_id": 28812
    },
    {
      "name": "Trey Turner",
      "person_id": 27927
    }
  ],
  "release_date": "2011-03-16",
  "scene_id": 54912,
  "series": "Turner & Cooch",
  "tags": [],
  "title": "Turner & Cooch, Scene #02"
}