{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have two new faces this week on ExtraBigDicks.com and we wanna give a warm welcome to Windy City native Ricardo Vaughn. We're sure this 20 year old is not missing the weather back home as he's chillin' in sunny South Florida. His playmate, Junior Verde, also 20 years old, is taking a respite from the weather having left Akron, OH for a few days. Wanting to get a better idea of what makes these boys tick we asked them if they won $1K in the lottery what they would spend the money on. Junior would spend it on clothes. Ricardo isn't far from that himself admitting he'd spend some of that on shoes. He loves shoes. Both of these boys are horny as expected so we wondered where the weirdest place they'd ever jerked off was. Junior has jacked off in his car and for Ricardo it would be outside on his patio. Ricardo was a late bloomer losing his cherry at 18. Junior was also 18 when he lost it and as for regrets they each have their own. Junior wishes it would've been with someone different while Ricardo wishes he wouldn't have been so timid. Well there is no need to be timid today as these two get better ?acquainted?.Junior is waiting for Ricardo to get dressed afraid they're gonna be late. Ricardo comes out trying to pull his pants on when Junior realizes he's got a tent in his boxers making it harder to do. ?Whoa, what's this?? Junior says as he starts to tug on Ricardo's hard cock. Ricardo grins as he watches Junior explore his growing cock. Junior pulls it out of his briefs and opens wide. He wraps his lips around that thick black cock as Ricardo starts to fuck his face. Ricardo's 9? cock is rock hard as Junior takes it deep. Ricardo then climbs onto the chaise where he straddles Junior's face and starts to fuck his throat from above. He slides that thick dick as deep as he can as his balls slap away at Junior's chin. Ricardo then gets up and strips Junior wanting to suck some dick himself. He goes down on Junior's cock as Junior watches his meat get serviced. ?You like that dick?? he coos as Ricardo deep throats his meat. Ricardo blows him for a while before ordering Junior back on his knees to give him more dick. He holds his head and goes right back to burying that dick down his throat.Ricardo's cock is throbbing and going to need a lot more than a hot mouth to get it off. He bends Junior over before sliding his cock deep into his hot ass. He starts to fuck him doggy style as Junior struggles to accommodate his thick dick. Ricardo starts to fuck that ass deep loving the feeling of that hot hole wrapped around his dick. He holds Junior by the waist and bounces him back onto his cock as his low hanging balls slap away at that ass. Ricardo then sits back in the chair and orders Junior to come over and sit on his cock. Junior straddles that juicy dick and impales himself on it. That hungry hole is soon full of cock again as he rides that meat. He strokes his own aching cock as he gets his ass stuffed. Junior rides that cock like a champ and soon he's bucking back onto it as he shoves it deeper and deeper inside him. Missionary is next as Ricardo gets Junior on his back. Legs in the air and a dick up his ass, Junior is set as he jacks his cock off faster and faster. Ricardo's thick dick is hitting his sweet spot just right and it soon sends him over the edge. He blows his thick load all over himself as Ricardo fucks him deeper. Ricardo then pulls out and stands over Junior shooting his load ALL over our favorite Buckeye.",
  "models": [
    {
      "name": "Junior Verde",
      "person_id": 28018
    },
    {
      "name": "Ricardo Vaughn",
      "person_id": 28818
    }
  ],
  "release_date": "2011-04-13",
  "scene_id": 54919,
  "tags": [],
  "title": "Dicky Ricardo, Scene #01"
}