{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back in the house is Josh West as he makes his triumphant return after taking a year long break from the madness. We are happy to have him back for so many reasons?at least 9 right off the top of our head. All inches aside, he's back and at 36 years young he's looking better than ever. San Francisco is doing something right. To keep the class reunion vibe going we brought back 22 year old Luke Riley. We hadn't seen this sexy buckeye in about as long. We asked these two studs if they had any plans for the upcoming holiday weekend. Josh has no plans but he's hoping to get whatever he can. That sounds encouraging. Luke laughs and admits he'll probably be working that weekend. Get your dollars ready, boys. Josh is known as one of the nicest guys in the industry and has one of the largest cocks as well. It's definitely a title he wears proudly. Luke is known for being able to handle and enjoy being on the receiving end of cocks like Josh's. He has no problem admitting he's just as committed in finding big dicks when he's off cam. Well, let's let the python and the python hunter go at it, shall we?Josh and Luke are getting acquainted when Luke mentions his backs been hurting. Josh tells him to turn around so that he can pop it for him. He gives him a bear hug as he lifts him off the floor. That does the trick as Luke grunts in relief. On the way down, Luke notices his ass rubbed against something unusually hard. His hands race back to investigate and find that Josh's cock is growing. ?What did you find there?' Josh grins 'that's a thick piece of meat; think you can handle that?? You don't have to ask Luke twice as he gropes at that cock as he kneels to get a better look at what's for dinner. He fumbles with Josh's jeans as he hauls out that massive dick. He opens up as he goes down on Josh's throbbing meat. ?Get it nice and wet?, Josh orders as he starts to fuck Luke's face. He holds Luke's head with both hands as he rams his cock deep. ?Let's see that ass in those pants, boy?I'm gonna fuck it!? Luke worships Josh's meat wanting to please his new buddy. He knows that hard cock will not go to waste. ...duh.Josh takes Luke's shorts off as he checks out that hot ass as well as his now raging bone. He returns the favor and starts to give Luke's cock some much needed attention. From there they maneuver into a hot 69 building up for the fuck that's a'comin. ?Open it up!? Josh orders as he starts to slide his beer can cock inside Luke's tight ass. Luke's ass resists as much as it can before submitting to Josh's fat cock. Josh starts to pound away at that ass deep as Luke struggles to accommodate every inch he's being given. Josh grinds his big meat deep as his balls slap away at that ass. Josh's lean abs tense and tighten as his dick sinks into Luke's hole in missionary. Luke's legs are spread wide as he starts to jack his cock with Josh's cock up his ass. Josh buries that dick in over and over as he looks down to see his meat disappear into Luke's hungry hole. They switch it up as Luke sits on Josh's fat cock. He starts to ride that meat as he strokes his own. This position's gonna do the trick as Luke starts to bounce on that dick harder and faster. Luke grunts as he starts to cum with Josh slamming his dick up inside him. Josh then pulls out and jacks his own load all over Luke's chest.",
  "models": [
    {
      "name": "Josh West",
      "person_id": 27931
    },
    {
      "name": "Luke Riley",
      "person_id": 27859
    }
  ],
  "release_date": "2011-05-25",
  "scene_id": 54928,
  "series": "BIG Papi",
  "tags": [],
  "title": "BIG Papi, Scene #02"
}