{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "You know it's going to be a great week when the Hombre, the Myth and the Cuban Legend, Mario Costa walks in our door. Our members can't get enough of his uncut 9.5 pingon. If we didn't know better, we'd swear our site was a magnet for size queens. Well, this afternoon it will be Mike Rivers who is making his debut here with us and he couldn't have landed a better scene partner. Mike is 26 years old and from New Jersey. Mario is 25 and this Miami boy will be giving our Jersey boy a taste of the tropics. We asked these two how connected they are with social media. Mario loves Facebook and his phone to keep in touch with friends, fans and loved ones. Mike on the other hand is addicted to social media. You name it, he's on it: Facebook, Twitter, blog, phone and text. He feels handicapped without them. We wondered if these two had ever been fucked so good that they exploded without wanting to. Both admit they think that the big cock in play had something to do with that. We can't imagine having a thick cock rammed up a tight little asshole would have anything to do with that  but we're willing to go with it. Now for visual of what that might look like we go live to Mike at the tight ass desk. Mike...Mario is listening to his tunes on his phone when Mike comes in and decides to give him something better to do. He runs his hands along Mario's thigh up into his shorts and starts to play with his growing crotch. Mario grins as they start to kiss. He's totally onboard with the change of venue as Mike strips off his shirt and leans in for a kiss. They make out as they continue exploring each other's smooth frames. Mike finds his way south so that he's face to face with that cock he's heard about. He pulls down Mario's briefs as his massive cock springs out. Mike's eyes open wide but his mouth opens wider as he immediately latches his lips around Mario's enormous, uncut cock. Mike loves uncut cock and Hispanic men often times are left intact. Mike sucks on that foreskin and rubs that cock all over his face as he worships his meat. Mario is rock hard as he gets Mike on his feet to return the favor. Mario starts to suck on Mike's cock as he continues stroking his own. Mario isn't on it for long before Mike wants more of that Caribbean cock. Mike can't get enough of it as he slowly double fists that dick into his hungry mouth.They then maneuver into a hot 69 with Mike on top still swallowing as much of that cock as he can while Mario nurses on his. All this oral's just making them hornier for things to cum. (pun intended) ?Bring that dick over here? Mike teases as he bends over on the chair showcasing his hot ass. Like a moth to a flame, Mario's fat dick is soon pushing its way inside. Mike's hot ass pushes back onto it until every inch of Mario's cock is buried inside him. Mario starts to pound that hole as Mike just begs him for more. Mike's ass takes every inch with ease as he fucks Mario right back with his hot ass. Mario's balls slap away at that ass as he gets that cock milked by Mike's tight hole. Mario then flips him over onto his back and glides that fat cock back inside. He gets to work pounding that hot white boy ass deep and hard. Legs in the air, Mike is in ecstasy as he gets that hot ass stretched wide. Mike starts to jack his cock as he watches Mario slamming that dick deep into his hole. Mario picks up the pace as he feels that familiar tingle in his balls. He pulls out and unloads a huge load all over our Jersey boy coating him in thick ?leche?. Milk does a body good.  Mike then blows his own cum covered cock off adding more leche to the milky mess.",
  "models": [
    {
      "name": "Mike Rivers",
      "person_id": 28012
    },
    {
      "name": "Mario Costa",
      "person_id": 28031
    }
  ],
  "release_date": "2011-04-20",
  "scene_id": 54922,
  "tags": [],
  "title": "El Costa Grande, Scene #02"
}