{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Niko Reeves and Wade Riley make their ExtraBigDicksdebut this week. Nikko is 23 and is originally from Los Angeles. West coast meets the South as 18 yr old Wade proudly represents Alabama. We wondered what these two liked to watch on TV and what series they like enough to buy. Wade loves Grey's Anatomy while Niko likes the Sopranos. We then wondered what the kinkiest thing these two fine individuals had gotten themselves into. Wade admits he's been tied up in the woods before. He says there was just one woodsman though by the time they were done it felt like there had been 3 of them. Niko blushes and admits he's never done anything that kinky but he had been with a police officer who handcuffed him with his real handcuffs and it made the action that much hotter. Well this afternoon we won't need to tie Wade down and there won't be any handcuffs for Niko. There will be plenty of hot hands free fucking and sucking going on so without further ado... By the time we start rolling Wade is rock hard and Niko's hands are all over it. He pulls down Wade's pants and starts to grope his boner through his boxers. ?Nice and thick just the way I like it? says Niko as he tugs on it before pulling it free. Wade's hard cock and his huge low hangers stands proudly at attention as Niko opens wide. He starts to nurse on that country cock as Wade reaches down and plays with his own balls. Wade then strips Niko so that he can return the favor. Niko moans his approval as Wade goes to work on his cock. Niko loves the attention he's getting but he's not done with Wade's as he kneels on the floor so that Wade can feed him more cock. Niko laps at his smooth balls as Wade's cock throbs at attention. He grabs Niko's head and starts to fuck his face trying to get as much of his thick dick down Niko's hungry throat. Wade then bends Niko over and lets his tongue explore that smooth hole he'll soon be filling. Niko can't get enough as he writhes in ecstasy while Wade tongue fucks his hot hole and slaps that ass. Once that hot ass is ready and wet enough to get inside of, Wade suits up and gets into position. He flips Niko over onto his back and slams inside. He starts fucking that hot ass hard as Niko whimpers as he takes a pounding. Wade buries that meat over and over as Niko takes every thrust. ?Fuckin' tight ass? Wade moans as he looks down and watches his dick disappear into Niko's hot hole. Niko is rock hard the entire time Wade is pounding that ass. Wade's relentless as he assaults that ass. He then switches it up and bends Niko over so that he can fuck that ass doggy style. Wade gets right back to pounding that ass as he slaps that ass and asks Niko if he likes that (...purely rhetorical, of course). Next he gets Niko to sit on his dick as he starts to fuck up into that worn hole. Niko gets bounced up and down on that massive dick as Wade starts to jack Niko's cock. Wade jacks Niko harder as he bounces on his meat. Sensory over ride for poor Niko who ends up exploding all over Wade's defined abs and chest. Wade keeps shoving that dick deep making him cum even harder. Wade then pulls out and busts his nut all over his own cum-covered and very happy, happy trail.",
  "models": [
    {
      "name": "Wade Riley",
      "person_id": 28823
    },
    {
      "name": "Niko Reeves",
      "person_id": 28824
    }
  ],
  "release_date": "2011-05-04",
  "scene_id": 54925,
  "tags": [],
  "title": "Wade in the Shade, Scene #01"
}