{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have two new faces on ExtraBigDicks. The first belongs to sexy, and hung, Chris Cox the 25 year old Hispanic hottie from right here in Miami. The second half of today's horny duo is Jarrod King, a 24 year old cross over from one of our brother sites, CircleJerkBoys. We're sure you'll love this sexy Jersey native as much as they have on CJB. We asked these studs if they were avid movie goers and if they weren't was there any movie they had wanted to see but missed. It would be ?Limitless? for Jarrod who wanted to watch Bradley Cooper get to use his entire...brain. Get your minds out the gutter! Chris had wanted to watch ?Red Riding Hood?. When it comes to TV shows they both love ?Family Guy?. Jarrod also loves ?Modern Family? and ?It's Always Sunny in Philadelphia?. They both love to fuck and today Jarrod is taking one for the team. They both love smooth, bubble butts to slide their cocks into. They are also adventurous. Chris sucked off a guy at the airport once and Jarrod found himself smack in the middle of a spontaneous orgy at a friend's party. No GPS needed apparently. Well, Chris won't need one either as he gets to take a long drive through Jarrod's...you know. Chris is sittin' back playing with his growing cock as he sexts with a friend. ?Sexting? is the new cyber sex via text messaging. Kids these days, who knew PDAs could be this much fun. Jarrod comes in and finds him rock hard on his phone and asks what's going on. Chris tells him he's lining up some for later. Apparently that won't be necessary since Jarrod's curiosity will be taking care of that soon enough. He grabs Chris' cock and starts to tug at it through his jeans as he undoes his pants. Jarrod kneels before Chris who drops his pants to give Jarrod better access. Jarrod strokes and teases Chris' 8? cock which is now throbbing and wanting attention. Jarrod stands back up as he drops trou and starts making out with Chris. Chris then sits back on the couch's armrest and pulls his cock out for Chris. Chris goes down on his rock hard cock taking it all the way to the hilt. Chris pulls off Jarrod's boxers as he gets comfortable worshipping that cock. He strokes it as he polishes that knob making our Jersey boy moan his approval. Chris looks up at Jarrod as he deep throats that meat. Chris is rock hard and soon wants some help on his own throbbing cock.Chris lies back and strokes his meat as Jarrod straddles his face. He slides that dick back into his mouth as Chris gets his cock rock hard for what's to come. Already in position, Jarrod slides out of Chris' mouth and onto Chris' raging bone. Jarrod's tight ass struggles to take Chris' thick cock but after a while finally concedes. Chris' thick cock pushes all the way inside as he starts to fuck up into Jarrod's sweet ass. Jarrod is groaning as he takes that cock as Chris tries to shove as much as he can deep inside. They go at it until Jarrod wants a turn. He gets Chris on the floor and gets behind him as he prepares to return the favor. Chris moans as he gets that thick dick shoved deep inside. Payback's a bitch?Oh, Goody! We have a feeling our versatile Miami boy doesn't mind at all. Jarrod slams away at Chris' tight ass as his balls slap away at that hungry hole. Jarrod then flips Chris over onto his back as he lifts his legs up and slides back inside for more. Chris is rock hard as he gets more cock shoved deep inside. Jarrod fucks him faster and deeper ultimately sending Chris over the edge. He explodes all over his smooth chest and abs. Jarrod follows suit as he pulls out and adds another coat to the whitewash finish.",
  "models": [
    {
      "name": "Chris Cox",
      "person_id": 28468
    },
    {
      "name": "Jarrod King",
      "person_id": 28822
    }
  ],
  "release_date": "2011-04-27",
  "scene_id": 54924,
  "tags": [],
  "title": "Cox and Bagels, Scene #02"
}