{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Mason Coxx is back with us again and with a namesake like Coxx we'll never get enough of this hung, 25 year old Connecticut native. Mason is not only gonna help us out but also make one guy very happy as we welcome a new face to the club, Gene Neely. Gene comes to us from Ohio and this handsome 22 year old Buckeye is in for a real treat. We asked these boys if they were able to drink for free all night what their drink of choice would be. It would be Long Islands for Mason while Gene would stick to his Bud Lite. We asked Gene what his first sexual memory was and apparently finding a porn magazine at 6 years old and it apparently paved the way to where he is now. ...ok. lol We then asked these hot blooded fuck machines to describe the ?perfect orgasm?. For Gene it would be after hot sex and it would have to be an orgasm you could ride out for at least a minute. ...Pff?Amateur. lol Mason wins this one with this classic, ?Perfect orgasm for me would be one that hit multiple times in a row; where you wouldn't fully orgasm until the last time. Where about 10 minutes into it, you're still cumming, still orgasming? ...is it hot in here?Mason asks Gene to pull out a measuring tape to help him measure something. ?What are we measuring? asks Gene tape in hand. ?My Cock? answers Mason as he hauls out his growing meat. Gene does his best to measure before deciding there's got to be an easier way to do this. He opens wide and slides Mason's fat cock down his throat. Why hadn't we thought of this? Mason's cock is soon rock hard as Gene worships his throbbing cock. Mason holds Gene's head as he helps shove his dick deeper inside Gene's warm throat. Mason then helps Gene out of his jeans so that he can return the favor. Mason holds Gene's smooth balls as he slides his cock into his mouth. ?Does that taste good?? Gene coos as he watches Mason work his meat. Gene appreciates the help but he really wants more of Mason's big cock. He bends over and gets back on that dick as he laps at Mason's smooth nuts and shoves that cock back down his throat. He fists Mason's meat as he swirls his tongue around the thick shaft sending Mason into ecstasy. ?No hands' Mason moans, 'just your mouth? as he watches Gene on his knees totally service him.Gene needs more than that dick in his mouth as he gets Mason on all four before sliding his dick inside. Mason groans as his ass stretches to accommodate Gene's cock. Mason's cock is rock hard as he gets that ass fucked and he tugs at it as Gene's balls slap away at his hole. From there they switch it up as Mason sits back and watches as Gene impales himself on his 9? cock. ?Feel good?? Mason teases as Gene rides his thick cock. Gene bounces on that dick as Mason just sits back and enjoys that hot ass on his meat. He hugs Gene as he helps bounce him on his dick. Missionary is next as Gene lies back and spreads those legs wide. Mason slips that thick cock back inside Gene's warm hole and slides it home. He looks up at Gene who is now jacking his meat off while taking Mason's. This position's gonna do the trick as Mason's massive meat pounds away at his sweet spot. Gene grunts as he unloads with Mason still buried inside. Mason then pulls out and jacks his own hefty batch all over his trimmed navel and cock. Whew.",
  "models": [
    {
      "name": "Gene Neely",
      "person_id": 28552
    },
    {
      "name": "Mason Coxx",
      "person_id": 28799
    }
  ],
  "release_date": "2011-06-01",
  "scene_id": 54929,
  "tags": [],
  "title": "BIG Coxx, Scene #01"
}