{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week's gonna be a larger than life episode as we welcome back Chasen Hart. Chasen always makes the boys swoon with that oversized meat of his. This week to appreciate every inch the hung 22 year old from Ft Lauderdale has to offer is Binx Tanner. Binx just turned 24 and is from Saratoga, NY. We asked these two studs when they got their first blowjobs. Chasen had his first at military school at the age of 13. Later that week he had his first 3 way with their 18 year old sergeant. Binx was 15 when he had a friend over that was bi-curious and they ended up doing it in his Mom's new car while everyone was resting. We then asked these two what would need to be done to them in order to make them blow a huge wad. 'Bend me over and take advantage' grins Binx. Well, we're sure that offer can be more than accommodated. For Chasen, it's even easier as he offers up this little gem, 'Get on your knees and let me cum on your face', he grins. Well, that line will be forming to the left, Gentlemen; single-file no pushing! Lol As for the rest of you: sit back; relax and get comfortable-cuz we're about to get this party started. Chasen and Binx are on the couch debating on what to do later for Binx' birthday when Chasen tells Binx he has a surprise for him first. He blindfolds Binx and tells him he'll be right back with his 'surprise'. Unbeknownst to young Binx, Chasen has taken out his anaconda of a cock and is preparing to introduce him to his 'little' friend. He holds Binx by the back of the head as he pulls him into his cock. 'Open your mouth' he orders as he stuffs it full of meat. Binx struggles to get that cock in his mouth. No complaints as he removes the blindfold and gets back on that throbbing dick. Chasen is rock hard as he looks down to watch Binx enjoying the best birthday present he'll ever get. 'Stand up and show me that cock' Chasen orders as Binx gets up to do as he's told. The obedient birthday boy is in for one hell of a treat. Binx strokes his own cock in one hand as he awes at Chasen's huge cock in his other. Chasen gets back on the couch to give Binx all the dick he can nurse on. Chasen fucks his big dick up into Binx' hungry mouth as he tries to bury it as deep as he can. Binx is in no hurry as he strokes and sucks on Chasen's fat cock.rChasen then suits up and starts to slowly slide his extra big dick into Binx' tight ass. Binx groans as Chasen makes his way inside. Chasen slowly picks up the pace as he fucks Binx doggy style. Chasen is sliding his cock deeper and deeper with each thrust and once Binx' ass can accommodate its girth he starts to give it to him. He holds Binx' tight little waist as he plows away at that hot hole. 'I can't believe my ass can handle this' Binx moans as he gets that hot hole stretched wider than ever before. Chasen grunts as he starts to slam his thick meat deep. Chasen then moves the party over to the couch where he lays behind Binx and slides back in for more. He goes right back to sliding his meat deep inside Binx' hungry hole. 'Feels so damn good' Binx coos,' I want it deeper too.' Chasen is more than happy to oblige as he grinds his meat deep. They then switch it up as Chasen sits back and has Binx sit on his dick. Binx is rock hard as he sits on that cock and starts to ride it like a seasoned jockey. Chasen's gasping at the sensation as Binx hot hole continues to milk his thick cock. Binx can't hold back any longer as that fat cock hits every spot possible. He unloads all over himself as Chasen's cock continues to fuck that ass. Chasen then gets what he wanted to begin with as Binx kneels and gets that pretty face of his drenched in Chasen's thick cum. ...pretty.",
  "models": [
    {
      "name": "Binx Tanner",
      "person_id": 28828
    },
    {
      "name": "Chasen Hart",
      "person_id": 28027
    }
  ],
  "release_date": "2011-06-08",
  "scene_id": 54931,
  "series": "Hart Attack",
  "tags": [],
  "title": "Hart Attack"
}