{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Mike King is back in the house after making quite the impression last week when he showed off his thick 9? cock. Our members screamed for more so we decided to bring this sexy 22 year old Georgia native back and see what he can do with all that cock. Today we have a familiar face from New Jersey by the name of Alexander Greene. Alexander is 20 years young and looking as hot as ever. Both of these boys like to get out and have a good time. They both admit they love a little karaoke. ?Get a few drinks in me and I'm right on stage?, says Alexander who loves to belt out old rock songs. We know Mike discovered he was bigger than the average guy back in junior high; but Alexander didn't really notice he was above average in that department until he started doing porn. Go figure! We then asked if they had a sweet tooth. Topping the chocolate chart is Hershey's Milk Chocolate for Alexander while Mike loves Nestles Crunch Bar. They both love being well hung and Alexander loves that he's never gotten any complaints. More than anything Mike loves the expression of amazement on guy's faces when he whips it out. Well, with a set up like that one, we should definitely let Mike do his thing... prepare to be amazed. Mike is toweling off after his shower when Alexander comes in sad he missed catching him in the shower. Mike is more than happy to make that up to him as he grabs him and starts to make out with him. Their hands start to explore each other as Alexander drops to his knees and starts to tease Mike, licking near his crotch before unveiling his half hard cock. He opens wide and takes Mike's growing cock in his mouth. Mike's mammoth meat is hard in seconds as Alexander sucks on it taking as much of it as he can in his mouth. Mike groans as he starts to fuck Alexander's face. ?Choke on my dick? he groans as Alexander worships his meat. Alexander then strips down to his briefs and sits back on the couch giving Mike access to his own 9? uncut cock. Mike hauls Alexander's thick dick and goes to work returning the favor. It's a meat lover's kinda day and more than enough cock to go around as these two work each others cocks. Mike takes his time savoring that Jersey meat before coming up to make out some more as they rub their throbbing cocks together.They get on the couch and keep making out as they explore each other's smooth asses. Mike needs that ass and Alexander straddles him and takes it in a reverse cowgirl. His ass slowly gives in as he starts to ride that thick cock. He's soon taking that dick to the hilt as he grinds his hot ass deep wanting every inch of it inside him. ?Ride that cock!?, Mike orders as he sits back and watches Alexander go to town on his meat. Alexander then gets put on all four on the couch as Mike moves in behind him and takes that ass doggy style. He slams that dick back inside as Alexander winces trying to accommodate every thick inch. Mike fucks him harder and deeper as he gets that dick pleasured. The chemistry between them is off the chart and soon its Alexander's turn. He lies back and suits up as Mike straddles his cock and eases down on it. Mike starts riding that cock as he looks down at the expression on Alexander's face in ecstasy. Alexander then flips Mike over onto his back and starts to pound him missionary. He fucks him fast and deep and sends Mike over the edge as he pumps his thick load out all over his smooth navel. Alexander pulls out and explodes his huge load all over Mike's cum covered navel.",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 28463
    },
    {
      "name": "Mike King",
      "person_id": 28829
    }
  ],
  "release_date": "2011-06-29",
  "scene_id": 54937,
  "tags": [],
  "title": "King Cobras, Scene #01"
}