{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have our favorite Cuban cock in the house, Mario Costa. Mario is in for a treat. He'll soon be getting his hands on, and dick in, 22yr old, Cole Harvey. For those of you unfamiliar with Mario, Mario is originally from Cuba; is 25 years old and packs a thick 9? cock. We asked these two if they could have any car they desired what car would they pick. Mario has his heart set on a black Maserati with white interior. Cole would want an all black Lamborghini.  We then asked Cole to describe the perfect cock. Cole looks to his side as he admits he may have just found it. We're guessing Cole isn't a size queen after all; but he can be impressed. We're sure Mario won't be letting him down any time soon. We then asked Mario to describe the perfect ass. Mario says the perfect ass is not too big or small but compact enough to grab on to as he plows inside. We then asked them to ponder the possibility of being invisible and getting to spy on whomever they chose to as they did the deed. Mario would want that to be Brad Pitt and Angelina Jolie. Not a bad choice at all. Cole couldn't think of one so he just jumped on the Brangelina band wagon. Luckily he'll be jumping on a lot more than that in a minute...Mario is getting dressed after his shoot was canceled. Cole comes in and starts to get ready for his when he asks Mario why his shoot was scrapped. ?I'm too big apparently' Mario says, 'the guy got scared.? Not one to pass up a free lunch, Cole insists on checking that out for himself. ?I think I should be the judge of this? he says as Mario stands up to let him. Cole starts to grope Mario's growing cock as Mario strips off his tee. Cole's curiosity gets the better of him as he pulls down Mario's pants to expose the huge python straining to be free. He licks along the shaft still encased in its cotton confines before setting it free. He opens as wide as he can as he starts to nurse on Mario's massive cock. He strokes it up and down as he worships that thick uncut meat. Cole is in heaven as he slaps that cock on his tongue looking up at Mario. Looks like Mario's gonna get that cock taken care of after all. Mario then sits back on the couch to let Cole take his time as he gets right back to servicing as much of that dick he can handle. Cole savors every thick inch of it before moving back up to make out with his new ?amigo?.Mario then decides to return the favor as he moves down to get some dick of his own. He starts to suck on Cole's cock making him moan as his cock finally gets some attention. Cole appreciates it but he needs more of Mario's as he gets right back on that dick wanting to get it as hard as possible. He knows where it's going next. Mario then bends Cole over and starts to slide his mammoth cock inside. Cole winces in pain as his ass slowly concedes. Soon Cole is getting that ass stretched wide as Mario starts to fuck him deep. Cole can't get enough of that cock and they end up on the couch as Mario lies behind him and keeps slamming that dick deep inside him. Cole's ass takes every inch with ease as Mario's swollen cock slams against his prostate. Mario's smooth balls are pulling up tight against the base of his shaft as he gets closer to climax. Mario then flips Cole over onto his back and keeps delivering that dick missionary. This position proves too much to handle as that thick cock pounds Cole's prostate. He busts his nut all over himself. Mario then pulls out and jacks his own load all over one cum-covered Cole.",
  "models": [
    {
      "name": "Mario Costa",
      "person_id": 28031
    },
    {
      "name": "Cole Harvey",
      "person_id": 28440
    }
  ],
  "release_date": "2011-07-06",
  "scene_id": 54939,
  "tags": [],
  "title": "Blonde Ambition, Scene #01"
}