{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Today we have a new face from the Deep South named Mike King. Mike's last name is just a bit of foreshadowing for this 22 year old Georgia peach. Once we get him out of his pants you'll see why. Mike was home schooled all his life and he didn't particularly like it. His favorite subject was history and he wished he paid better attention in Math. We asked Mike what he loved to collect and what his Most Wanted List comprised of. It turns out Mike's a self-admitted nerd. He loves electronics, iPads and also loves comics. He has tons of Batman memorabilia and even has Adam West's autograph. Mike realized he was packing when he was about 15 while wearing those thin pants in Karate class. Mike is currently single and even though he doesn't have a partner; he admits he's a hopeful romantic. He likes to be romantic and to cuddle not just wham bam then be done with it. He doesn't think size matters when it comes to his potential lover since Mike's mostly a top but can be versatile. He loves a man's chest most of all and this stud just has to be sweet, kind and know how to kiss. A bad kisser can really fuck up a free lunch...Mike's at home waiting on a friend to show up to go out and gets a call that his friend's running a bit late. Mike figures that will give him some free time to himself and decides to do some hands on maintenance. He takes off his tee and his hand slides into the waist band of his shorts as he starts to tug on his growing cock. There's never a bad time to visit cock town. He gropes himself for a few before standing up so he can drop his shorts. His briefs are straining to contain his cock that is now tenting them. He frees his meat as he grabs it with both hands. He starts to moan as he double fists his massive 9? cock. Mike is lean and standing over 6' tall his body is naturally smooth and defined. He has dark features and bedroom brown eyes in his arsenal; but none rival his thick man meat. Mike strokes that throbbing cock as it responds to his every stroke. Mike sits back on the chair and gets to work on his big dick. Watching this stud work that fat cock with both hands and have cock to spare is quite an impressive sight.He spreads his legs apart as he jacks his cock. His hands roam his balls and small nips. He slaps his fat cock up against his taught abs as he continues to tease it. He gets back up to stroke and show off his cock. From below we get a great view of his smooth nuts and fat cock as he looks down to watch his cock getting a dry rub. Mike then heads over to the couch and gives us a view of the backside as he spreads his smooth ass. This stud is truly hairless and as he bares all, he grinds his thick cock against the couch below. It's nice to know this hot piece of ass isn't strictly for show. He flips back over and gets back to rubbing that thick cock. His cock is aching by now and bigger than ever. He moans the entire time he jacks that meat and it won't be long before he's gonna need to vacate those smooth balls that are slowly pulling up tight against his shaft. He picks up the pace and as he does his breathing begins to labor. His eyes close as his mouth parts slightly in a state of rapture as he nears his climax. He grunts as his abs contract making him come up off the couch just as his cock unloads. Jet after jet of thick cum splatter all over his abs as his cock blows his hot load. Laying in his own cum covered mess, Mike better get in the shower before his friends arrive and find him in a rather ?sticky? situation...",
  "models": [
    {
      "name": "Mike King",
      "person_id": 28829
    }
  ],
  "release_date": "2011-06-15",
  "scene_id": 54933,
  "tags": [],
  "title": "King Dong, Scene #01"
}