{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Chris Cox is back in the house this week and he's in for a real treat as we welcome a fan favorite on our brother site CircleJerkBoys, Mr. Aiden Lane. Aiden is 22 and from Ft. Lauderdale. Miami native Chris is 25 and we're really glad to have him and that hung cock back. We asked these two if they could open a restaurant what would it serve and what they would name it. Aiden would want to open a beachside grill and probably name it ?Wet Willies?. Chris would open a Cuban restaurant but isn't sure what he'd call it. We then asked them if they were to find $100 on the floor in front of the mall what they would spend it on. Chris would want to buy shoes with it while Aiden admits that he'd jump in his car and head to the Hard Rock Casino. We then turned the focus on things of a naked nature. We wondered if they preferred a rim job or a blow job. They both would rather get a blow job.  We asked them to describe their ideal man and Chris turns to Aiden and says ?Right here?. Aiden loves a tall guy with a big dick that has an ass that won't quit. Well, let's get these two started so that they can get their requests met...Blow jobs and more in store.They start to make out as Chris moves in for the kill. Aiden doesn't fight it as he kisses him back and lets Chris start to explore the bulge growing in his pants. Aiden's cock is rock hard as Chris slips down between his legs and frees his aching cock. He strokes it a bit before getting a taste of it. He runs his tongue along the length of it before going down on him. Aiden is in ecstasy as he gets his dick sucked. His back arches up as his body contorts with pleasure. Aiden then stands up to give Chris better access to his throbbing cock. Aiden slowly fucks his face as Chris sucks and strokes his thick cock. Chris then gets up and lets Aiden have a go at his junk. ?Holy Shit!? Aiden exclaims as he hauls out Chris' extra thick cock. They go back to making out as they jack themselves some more. Aiden can't resist the urge anymore as he goes south to suck on that fat cock. He gets on his knees to get more of it in his hungry mouth. Chris moans as he watches his fat Cuban dick disappearing into Aiden's pretty mouth.  Chris loves the attention he's getting but wants more of Aiden's cock as  he goes back to sucking his cock.Aiden then moves Chris over to the chair where he bends him over and starts exploring that hot ass. Chris moans softly as Aiden spreads his cheeks apart as he goes in tongue first. He eats that hot ass driving Chris wild and making him even hornier for his meat. When he has that ass prepped and ready for dick he slides inside. ?You want my dick?? Chris all but begs him for it as he starts taking every inch Aiden has to give him. Aiden holds Chris by the waist as he goes to work slapping his balls against that ass. Aiden then switches it up as he sits back on the couch and has Chris ride his cock. Chris straddles his aching meat as he leans forward for a kiss. He takes that dick deep then starts to ride it like a seasoned jockey. Chris bounces on Aiden's cock as Aiden gets closer to climax. Aiden then flips Chris over onto his back and slides back into that hole to bring it home. He pounds that ass hard and deep and Chris isn't able to hold his load much longer. He busts his nut all over himself as Aiden sinks his dick all the way to the hilt. ?Cum all over me? Chris coos as Aiden pulls out and bathes him in his seed. All in a day's work for these two.",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Chris Cox",
      "person_id": 28468
    }
  ],
  "release_date": "2011-06-22",
  "scene_id": 54936,
  "series": "The Disappearing Act",
  "tags": [],
  "title": "The Disappearing Act, Scene #02"
}