{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Trey Turner is back in the house and brought a friend along. For those of you unfamiliar with Trey, the 23 year old Fort Lauderdale native with the big cock and the boyish smile has already amassed quite the fan following on our sites. His friend du jour is Johnny Rock. Johnny Rock is 21 years old; also from Ft. Lauderdale and was featured on our brother site CircleJerkBoys.com a few months back. We're glad to have him on EBD where he and that 9' cock belong. We asked these two Floridians if they were relocated to the west coast what they would miss most. Trey would miss the weather here while Johnny would miss the sun. (um, the Sun?) Moving right along, we asked these two when it was they figured out they were packing more than the average guy. Johnny figured he was average until he got into the industry a few months back. Trey realized he was packin' more than the average high school student back when his classmates would pull theirs out and he'd feel a tad under whelmed. Well, here we strongly believe that there are only two kinds of folks: Size Queens... and liars! Get ready for an extra double dose of big dick.                                                     Johnny walks in pouting about how no girl can take his dick. Trey who was perfectly fine just reading before Johnny stormed in, decides to turn the tables. 'Well, have you ever thought about how it would feel like to be on the other end?' That was enough to peak Johnny's curiosity as they start to make out. Their clothes come off as Trey reaches Johnny's tight boxer briefs straining to contain his fat cock. Trey's not about to back off now as he hauls out Johnny's cock and shows him how it's done. Johnny moans as he watches his fat cock disappear. He starts to fuck Trey's mouth as he gets that cock deep inside that throat. Trey loves that cock; but this isn't gonna teach Johnny the lesson he needs. Trey lays back and lets Johnny get to work. He goes down on Trey's cock as Trey talks him through it. 'Rub it on your face' Trey moans 'work my pole!' Johnny is a quick study as he swallows every inch he's told to. They then take turns working each other's cocks getting each other as hard as possible for what's to cum.'Now it's time for you to feel the pain that I feel' announces Trey as he bends Johnny over and starts sliding his fat cock inside as Johnny whimpers. Trey starts to fuck that ass as Johnny whimpers and winces in pain. 'Next time, be a little nicer!' Trey gloats as he mounts that ass. What goes around comes around as Johnny gets to take his turn at bat. Somehow we think Trey is grunting for different reasons as he begs Johnny for more of that dick. Johnny pounds away at that hot ass as Trey takes it like a champ. 'Don't stop! Fuck my hole' he groans as Johnny tries to slow down. Johnny's cock is appreciated but his lesson is only half way through. Johnny gets put on his back as he gets fucked missionary. Trey wants him to know just what those girls feel like when he's slamming into them like this. Trey pounds him hard and rough as Johnny goes from wanting him to slow down to wanting more. Trey can't hold off any longer as he pulls out and unloads all over Johnny's defined abs and chest. Once he does he bounces leaving Johnny to take care of his own dick. Johnny jacks himself off all over his chest and cum covered abs. Here he thought Trey wanted to cuddle... NOT!",
  "models": [
    {
      "name": "Johnny Rock",
      "person_id": 28466
    },
    {
      "name": "Trey Turner",
      "person_id": 27927
    }
  ],
  "release_date": "2011-08-03",
  "scene_id": 54947,
  "series": "Top to Bottom",
  "tags": [],
  "title": "Top to Bottom"
}