{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Alexander Greene is back this week on ExtraBigDicks and we're always happy to have this hung Jersey boy in the house. For those of you unfamiliar with Alexander, he's become a definite fan favorite with that 20 year old boyish face and man-sized meat. Making his EBD debut this week is Mr. Elijah White. Elijah is from Orlando, FL and apparently this tall, hung hottie turned 18 and hit the ground running. Well, he's definitely equipped for what we're looking for...so who are WE to judge?  lol We asked these two if there was anyone they admired enough to suggest they be featured on a postage stamp. Alexander grins as he admits it wouldn't be anyone in his family. Elijah can't think of anyone off hand, not even his identical twin brother. Maybe they should both be featured on a Hung Series of stamps. We then asked these two what pleasure they enjoy best getting on their dicks. Alexander says hands down he loves getting his cock sucked most of all. A good mouth is hard to find specially one that can easily accommodate all he's packin'. Elijah brightens Alexander's day as he admits he too loves oral but prefers giving vs. receiving. Well Hell?what are we waiting for?Elijah is busy doing homework when Alexander comes in looking for condoms. Elijah hands him a couple but none of them will work. ?Maybe for my little cousin? Alexander says ?but they won't work on this.? He grabs his crotch as Elijah realizes Alexander is rock hard and packing way more than would fit into a regular rubber. Alexander undoes his jeans and lets Elijah get a closer look at his uncut monster. Elijah is soon on his knees opening wide and wanting to see just how big this thing gets. He starts to nurse on Alexander's cock stroking it with his hand as he gets it inside. Alexander found just what he was looking for as Elijah worships his thick meat. Alexander is lean and naturally smooth and after getting that dick worked on, his curiosity gets the better of him. He stands Elijah up and strips him to get a look at what he's packin'. Alex is in good company as he frees Elijah's hard cock. Elijah then gets right back to business laying on the couch as he nurses on more of that thick meat he'll soon want somewhere else. (...any suggestions?) ...that was completely rhetorical.Elijah then swaps places on the couch with Alexander who readily starts to return the favor. He takes that thick cock all the way down his throat as Elijah moans his approval. Alexander then suits up; watching as Elijah sits on his dick. He slides that tight ass down in a reverse cowgirl and starts to ride that meat taking every inch of it deep inside him. Alexander helps bounce him on his cock wanting to get his entire dick inside. What's good for the goose is good for Elijah who takes his turn at bat. He suits up and bends Alexander over his desk and takes that ass. He gets that cock inside and goes to work pounding that ass doggy style. Alexander is a trooper and takes every inch he's given. His own massive meat is rock hard as Elijah buries that dick deep. The chemistry between these two is off the charts. But wait?there's more. Alexander then takes control back as he lays Elijah on the couch. He lifts those legs and slides his thick dick inside for some missionary. This position's going to do the trick as Elijah jacks his thick cock in time to the fucking he's getting. He can't hold back any more as his load erupts all over his hairless navel. Alexander grinds inside making him cum even harder. Alexander then pulls out and unloads a huge batch all over Elijah's cum-drenched cock.",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 28463
    },
    {
      "name": "Elijah White",
      "person_id": 30772
    }
  ],
  "release_date": "2011-07-13",
  "scene_id": 54941,
  "tags": [],
  "title": "Long Days Journey Into White, Scene #01"
}