{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Coast to coast hotness this week as we welcome back Florida native, Chasen Hart and that redonkulous dong of his. Chasen will be getting some help from California boy Jason St. James. Jason is 22 years old and he's in for a treat once Chasen's clothes start coming off. We asked these two what they love to shop for as well as what they hate spending money on. It is cars for James; while Chasen loves spending his money on Bud Lite. On the flip side, James hates having to pay covers at bars; and Chasen hates spending any money on bills. Join the club, Brutha. We asked James if he agreed that 'Bigger is Better' and he definitely thinks that is always the case. Unless it gets so big, that you can't do anything with it. (Amateurs!) We then wanted to know what they were best at in the sack and what they could use help on. ?Opening you up? is Chasen's response as he flashes us that trademark grin. That motion carries unanimously. James says he's best known for his bottoming skills. As for things they could use help on it would be a bigger load for Chasen and when we asked James, Chasen answered for him ?Sucking dick!? OMG! James blushes as he simply concedes, ?Yeeeah, I get a little bored? ?C'mon man, I almost had her? complains Chasen on account of James grabbing his junk in front of her. Apparently she didn't find it as funny as James thought she would've. James feels horrible and is willing to do whatever it takes to make things right.  He grabs Chasen's cock that is already rock hard and in need of attention. ?She probably wouldn't have known what to do with all this? he grins as he starts to lick and rub his face all over Chasen's cotton clad colossus. He undoes Chasen's shorts and opens wide shoving as much of Chasen's 9? cock into his mouth. Chasen moans as he watches James make everything better as his cock disappears into that hungry mouth. Chasen reaches around to start stroking James' cock as he continues to get his own dick nursed on. Chasen then gets up and strips giving James better access to his cock as he starts to fuck his face with it. James doesn't look remotely ?bored? now. He shoves that cock throat deep as he plays with Chasen's smooth balls. Back on the couch, Chasen leans forward and starts to explore the hot ass he's about to own while James is still latched onto that meat of his.Chasen then slides on a Magnum and sits back to let James figure out how to get that thick dick in. James sits on that cock in a reverse cowgirl as it slowly starts to enter. He jacks his dick trying to make it easier as Chasen's cock slides deeper and deeper. Once he's all the way down on it, James starts to bounce up and down on that rigid meat as Chasen helps bounce him on his dick. Chasen looks down to see that cock getting swallowed up by James' hungry ass. There's plenty of meat to give so Chasen switches it up getting James on the floor so he can fuck him doggy style. James moans turn to whimpers now that Chasen has full control and can shove that unforgiving cock as deep as he wants to. James takes that dick like a trooper as Chasen buries every inch of his thick cock deep inside him. Chasen's not done yet and to take it home he flips his new playmate over. On his back, James watches as Chasen gets between his legs and buries his meat in for more. He fucks that ass harder and deeper sending James over the edge. He shoots all over himself while Chasen feeds that hole more dick. Chasen then pulls his cock out and blasts his own nut, spraying ALL over one cum-drenched James.",
  "models": [
    {
      "name": "Chasen Hart",
      "person_id": 28027
    },
    {
      "name": "Jason St.James",
      "person_id": 28833
    }
  ],
  "release_date": "2011-07-20",
  "scene_id": 54944,
  "tags": [],
  "title": "Chasen Jason, Scene #02"
}