{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Drake Jaden is back this week and he's in for a great time as we introduce him to Chris Cox. Florida is definitely in the house! Drake is 26 now and is originally from Central Florida. Chris is a local boy; 25 years young and just another hot Miami, Cuban boy. They seem to be everywhere down here. We asked these boys if they could spend 2 weeks on vacation one week domestic the other international where would they want to go. Drake would want to spend his first week here at ExtraBigDicks getting his ass plowed. The second week he'd want to spend it in Germany also getting his ass plowed by some big hairy German bear. Chris would want to go to San Francisco for a week then take that big cock of his to Greece. Chris would probably be kicking back with his Patron while on vacation while Drake would want a Jack and Diet Coke. They both love a sexy chest the most on a man's body and on their own bodies they both love their extra big dicks. We imagine those big cocks have served them well over the years and this afternoon Drake will be taking one for the team. No sacrifice there, he gleefully volunteered. Drake is hanging out on the couch when Chris comes in all upset about having to bottom in his next scene. Seems once they get a look at his nice eyes and ass they want him to bottom. Drake admits he really does have nice eyes as they start to make out. ?I'm sure you have a really nice ass' says Drake as he rubs Chris' cock, 'but I've been told I have one of the nicest asses in porn?. Drake stands and pulls down his shorts showing off his spectacular ass. Chris is in awe as he starts to grope that smooth ass. Drake's cock starts to stir and since it's already so close to Chris' face, Chris does some exploring as he pulls that cock free and gets his mouth on it. Drake grabs his head and starts to bob it on his dick as Chris takes every inch of it. Drake loves the attention on that big meat of his but at the moment his curiosity is getting the best of him. He sits Chris back and finally gets to feast his eyes on Chris' thick 9? cock. He opens wide and does his best to take that dick down his throat. Chris is rock hard as he watches Drake worship and gag on his meat. Drake repeatedly chokes on that thick cock wanting to take it all. Drake then bends over on the couch and shows off his ass. Chris watches as Drake plays with his hole; beckoning for someone to play with it. Chris takes him up on the offer as he dives in tongue first. ?Eat that ass!? Drake orders as Chris shoves his tongue inside getting that hole ready for more. Chris then suits up and watches as Drake straddles him and slowly impales that tight ass on Chris' mammoth cock. Drake holds still as Chris starts to piston that thick dick deeper and deeper into that ass of his. If Drake was on that vacation, he'd be off to a great start. Drake grunts and moans as Chris takes that ass, stretching it wide open. Chris then gets Drake up off his cock and bends him over to tap that ass doggy style. He holds on to Drake's tight waist as he slams back inside for more. Drake's hungry hole is taking every inch of that cock now as Chris' smooth balls slap away at that ass. But wait?there's more?as Chris moves the party south; getting Drake on his back and fucking him missionary. Drake rubs his rock hard cock on Chris' abs as he gets plowed. That cock hits him in all the right spots making Drake shoot his load all over himself.  Chris pounds the last drop out of him before pulling out and exploding all over Drake's face and chest.",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Chris Cox",
      "person_id": 28468
    }
  ],
  "release_date": "2011-07-27",
  "scene_id": 54945,
  "series": "Drake Me in the Morning",
  "tags": [],
  "title": "Drake Me in the Morning, Scene #01"
}