{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Chasen Hart is back looking all sorts of manly sporting a rugged beard and trimmer than we've seen him before. Steven Ponce is also back and we know he'll be able to handle anything Chasen throws at or 'in' him. Chasen is 22 years old and originally from Hollywood, Florida. Steven Ponce is 31 and he's from San Juan, Puerto Rico. As for colors Chasen's favorite is purple while Ponce loves blue. As for their favorite things to watch, Chasen loves Swamp People while Steven loves watching World's Dumbest Criminals. To round up the favorites hit list we asked what their favorite comfort food was. Chasen loves skylight chili or sushi. Steven loves 'comida criolla' or home spun Island food like rice and beans and pork chops. Summer is almost over and we asked these two what they were looking forward to starting. Chasen is looking forward to starting school. Ponce just wants to get to travel as much as he can. We asked Chasen who favors the ladies if he could see himself dating women exclusively in the future and he says he wouldn't want to be limited to just girls. Well we couldn't agree more...Chasen's showing off his boner through his shorts teasing Steven. 'Think you can suck this better than my girlfriend?' Not one to back down from a challenge, Steven gets Chasen on his feet as he kneels before him to get a better look. 'That's a man's dick in need of a man's mouth' Chasen chuckles as he watches Steven strip him and awe at his massive meat. Steven rubs his face on the tent that Chasen's sporting before finally setting it free. Once the boxers come off he laps at Chasen's heavy nuts and runs his tongue up along the shaft. He then opens wide and starts to slurp on Chasen's thick dick. Chasen moans as he gets that extra thick cock sucked on. Steven slurps on that pole getting it nice and wet. Chasen loves the attention his fat knob is getting and he doesn't want it to end anytime soon. Chasen gets back on the couch where Steven lies between his massive thighs and gets back to worshipping that meat. Chasen's hands start to roam as he checks out Steven's hot ass. Steven just deep throats his cock even deeper wanting to please Chasen and show him what a man can do. Chasen then starts to fuck Steven's hot mouth as he buries as much of that beer can cock as Steven's throat will permit.Steven then strips his own jeans off and bends Chasen over to get a taste of that sweet ass. He can't get enough of that beefy ass as he shoves his tongue deep inside Chasen's hole. Steven is rock hard as he buries his face inside that str8 ass. They stand and compare cocks before Chasen gets Steven back on his knees to fuck that face some more. Steven gets him rock hard before handing him an XL rubber. Chasen grins and watches as Steven slides that cock loving ass of his down on his fat pole. It isn't long before Steven is bouncing on that cock as he groans and licks on Chasen's neck. 'You're ass is gonna be so sore' Chasen groans as Steven helps himself to all the dick he can get. Chasen's monster cock has met its match. Chasen then pulls out and bends Steven over and fucks him doggy style. Steven groans and just begs for more. Chasen is totally into it loving how cock crazed Steven gets on the end of his. He starts to slap that ass as he pounds away at that ass deeper than he ever has. Chasen moves them to the couch where he lays behind Steven and keeps fucking him until he explodes all over himself. Chasen then pulls out and shoots his own thick batch all over his happy trail.",
  "models": [
    {
      "name": "Chasen Hart",
      "person_id": 28027
    },
    {
      "name": "Steven Ponce",
      "person_id": 27969
    }
  ],
  "release_date": "2011-09-14",
  "scene_id": 54959,
  "series": "Hart Broken",
  "tags": [],
  "title": "Hart Broken, Scene #01"
}