{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Big dicks galore this week as we welcome back Cole Streets to help us introduce a new face to the stable. Ricky Larkin finally makes his debut with the big boys and he'll be in excellent company. Ricky is 25 and from Fort Lauderdale, FL. Cole is 32 years old and originally from Texas. At 6'5 with a beefy 8' cock we're guessing they really do grow them big! We asked these two if they had a $500 gift certificate to eBay what they would spend it on. Cole wants a Louis Vuitton bag. The weekender is only $2200 so that might help. Ricky would buy himself an entire collection of Air Jordan shoes. Ricky took a break from the industry and is back after two years and he says he missed the attention. We're definitely glad he's back and wife free. We know Cole is happy he's unattached too. Cole is a firm believer that bigger is better when he's giving or receiving. He likes to know its 'happening?. Yeah, we've all been there. Both of these guys have high sex drives but even though they get a lot of attention on their dicks on cam they still like to jack off at home as well. They both like to jerk off to porn and Ricky admits he's into swinging these days; so those fantasies come in 'handy? as well.Ricky is having trouble with his laptop and it's not working. Fortunately Cole comes in and saves the day letting Ricky borrow his. Cole warns him to not look around in it too much or he may run into things he may not wanna see. Ricky's curiosity is peaked as he gets it out of Cole that what he's referring to is gay porn. Ricky's eyes light up as he assures he'd rather see that kind of action in person. They start to kiss and undress each other as their hands and tongues explore each other. Cole strokes on Ricky's cock through his underwear til it gets rock hard and ready for attention. Cole gets to work as he runs his tongue along its meaty shaft. Ricky's huge cock is rock hard as he slides it all the way into Cole's mouth. Cole gets that hard cock nice and wet while Ricky watches him worship his meat. Ricky's dick is so big it makes eager Cole choke and gag. ...amateurs!  Ricky then wants to get some dick of his own as he strips Cole and gets to work on his raging hard on. He sucks that big dick and pays attention to Cole's smooth balls as he chokes and gags on that thick meat as well. These two can't get enough of each other and eventually end up in a hot 69 giving each of them exactly what they wanted-more.Ricky then gets Cole on the couch and gets that tongue up inside it. He rims that sweet ass getting it ready for his fat dick. Cole is squirming at the sensation and is begging Ricky for that dick within minutes. Ricky takes his time eating that ass and licking all the way from Cole's tight ass to the tip of his swollen dick. When he's ready Ricky sits back and watches as Cole straddles and mounts his meat. He takes that dick like a champ as he bounces harder and harder on Ricky's cock. 'Ride on that long dick? Ricky groans as he helps bounce Cole on his dick. Ricky then switches it up and bends Cole over on the couch again and slides inside doggy style. Cole moans as Ricky pulls his meat all the way out and slams it back inside. Ricky's smooth balls are soon banging away at that hot ass as he pummels that tight hole. Fucking Cole in this position lets Ricky watch as his dick slides in and out of that sweet ass. Ricky then brings it home missionary as he slides it back in and starts to fuck Cole deep. That prostate pounding makes Cole explode as he gets the cum fucked out of him. Ricky continues pumping that ass then pulls out and blows his wad all over Cole's furry, cum-soaked abs and chest.",
  "models": [
    {
      "name": "Cole Streets",
      "person_id": 27983
    },
    {
      "name": "Ricky Larkin",
      "person_id": 28464
    }
  ],
  "release_date": "2011-08-24",
  "scene_id": 54954,
  "tags": [],
  "title": "Street Meat, Scene #02"
}