{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It's an all you can eat week, as we bring you two certified extra big dicks. Go Figure! The first, Jessie Alan needs no introduction. We can't seem to get enough of this 24 year old native Floridian with the sexy ink and monster cock. This week we also welcome back Orlando's own Elijah White. Elijah, the tall, hung 18 year old made quite the impression when he made his debut with us last month. We asked these two if they found $100 on the street what they would do with it. Jessie would put his money in the bank. Elijah would head to H&M and get himself something to wear. We then wondered what TV shows they loved as kids. Elijah loved Rugrats while Jessie grew up watching the Teenage Mutant Ninja Turtles. Today Jessie watches the Discovery Channel the most and Elijah is a Fang Bangin' fan of True Blood. Both of these studs are packin' more than the average and we wondered who's was the biggest dick they'd ever seen. Elijah beams as he admits the stud to his left has the biggest cock he'd ever seen. We're sure Jessie gets that a lot. Fortunately, Jessie will get to show Elijah just what that thick cock of his can do...Jessie and Elijah are on the couch as Elijah confesses to Jessie that every time his boyfriend sees his big cock he wants him to top him. He's getting tired of always having to top and maybe if he found a bigger dick he'd be tempted to bottom for a change. Jessie is already groping his growing crotch. ?I can help you out with that' he grins. Elijah moves in to see just what he has to offer as he frees Jessie's massive cock. He opens wide and takes as much of that cock into his mouth as he can. Jessie groans as he watches that thick cock getting worked on by one eager Elijah. Elijah runs his tongue along the shaft and around the swollen knob driving Jessie crazy. Jessie then stands to give Elijah better access to his meat. Elijah takes his time as he savors every inch of that cock. After working it for a while he stands and lets Jessie strip him and get a taste of what he has to offer. Jessie frees his 8' cock and eagerly returns the favor as he swallows his cock to the hilt. The chemistry is apparent as these two take turns sucking each other's thick cocks getting hornier for more to cum.Jessie eventually suits up and sits back and watches as Elijah sits on his python. Elijah's hot ass finally gets what it needs, a proper fucking. He slowly impales himself on that cock til it's all the way inside. He then starts to ride that cock bouncing on it for a bit.  Once he stops Jessie takes over and keeps shoving that meat up into that hungry hole. Elijah's cock is rock hard as he gets that hole stretched. He grinds that hot ass wanting every inch of Jessie buried inside him. Jessie then stands and bends his new playmate over and slides right back in tapping that ass doggy style. Jessie's heavy balls slap away at that smooth ass as he fucks him deep. Elijah moans and begs for more. Careful what you wish for as Jessie gives him just that. He flips Elijah over onto his back and shoves that thick cock in again missionary. He fucks him harder and faster and that does the trick as Jessie's cock makes him cum all over himself. Jessie then pulls out and unloads a thick nut all over one cum drenched Elijah.",
  "models": [
    {
      "name": "Jessie Alan",
      "person_id": 28496
    },
    {
      "name": "Elijah White",
      "person_id": 30772
    }
  ],
  "release_date": "2011-08-10",
  "scene_id": 54950,
  "series": "The Alan Wench",
  "tags": [],
  "title": "The Alan Wench, Scene #02"
}