{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Kris Anderson is back on ExtraBigDicks and we're so happy to have this hung hottie back. Kris is now 26 years old and whenever this Portland, OR morsel finds his way to the opposite coast we're more than happy to 'have him'. On that note, Brice Carson is going to discover what our excitement's all about as this 21 year old Tennessee native gets a closer look at all that is Kris.  We decided to ask Kris about his tattoo, specifically the one of several stars on his back. Stars seem to be popular these days. Kris' stars have nothing to do with the recent trend. They form the big dipper as well as represent Polaris, the North Star. Well Big Dipper would make sense since everything about Kris is BIG! Brice has no ink yet; but would love some. On Kris' suggestion, he might just get the 'little' dipper. Brice has never seen a bigger dick than Kris' in person, so this should get interesting. We then asked these two what the most unexpected sexual experience has been to date. Brice took an RV with friends to Canada and enroute hooked up with one of his friends in a KOA bathroom. For Kris, he was on a train into London from the airport; got hit on by a guy and ended up fuckin' around in the bathroom right on the train... a couple of sluts these two-Oh, goody!  Kris and Brice are on the couch, chatting when Brice asks Kris about the tattoo on his forearm. It's a tattoo of the Portland skyline, where he's from. He shows him the Hawthorne Bridge and Brice tells him he's been to Portland and loved it. 'I got a little piece of Portland for you right here' Kris grins as he grabs his growing cock. They start to make out as their hands begin to explore each other. Brice's hand makes its way into Kris' boxers as he starts to tease his massive cock through them, licking and sucking at it. Kris stands to give Brice better access to his rock hard cock as he drops his pants to get more comfortable. He finally hauls out his cock as it swings free.  Brice immediately puts that meat in his mouth as he gets to work sucking on it. Kris' massive cock slides in and out of Brice's hungry mouth as Brice grabs it by the base. He looks up at Kris as he eagerly worships his 9' curved cock and his smooth low hangers. Kris then strips Brice before laying him on the couch to return the favor. He easily deep throats Brice's cock as he strokes his own. Already between Brice's legs, Kris flips him up and dives into that sweet ass tongue first. Brice plays with Kris' cock as he gets that ass rimmed deep.Bent over the couch, Kris continues his lingual assault on that tight hole. He slides his fingers and tongue inside getting it ready for more. Once that ass is nice and spit soaked, Kris suits up and starts to slide that cock inside. Brice's ass resists as much as it can but us soon breached by Kris' thick python. Kris gets that ass used to his girthy cock and starts to slowly fuck that ass. Brice takes every inch of that cock til Kris's smooth balls are slapping his hole. Kris fucks him doggy for a bit before pulling out and sitting back on the couch. He holds his rigid cock still as Brice straddles it and sits on it in a reverse cowgirl position. Kris slams his cock up into Brice as he bounces him on his dick. Brice wants every inch of it as he squirms and grinds that hot hole onto that cock inside him. Kris strokes Brice's cock as he shoves his deep inside him. Missionary is next as Kris watches his meat disappear into Brice's hungry hole. Kris picks up the pace and fucks him deeper and harder. This position's gonna do the trick as Kris' cock hits Brice's sweet spot. Kris senses Brice's orgasm coming and fucks it out of him. Kris then pulls out; straddles Brice's chest and unloads a massive load all over Brice's face, leaving him with one hell of a facial. Mmmm.",
  "models": [],
  "release_date": "2011-08-17",
  "scene_id": 54952,
  "tags": [],
  "title": "Cumming to Portland, Scene #02"
}