{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Chris Cox is back with us this week and we have a feeling you'll be seeing a different side of this hung local as he helps us welcome a new face to the ExtraBigDick stable. The Lone Star state produced our in-DICK-tee this week that goes by the name of Tyler West. Tyler is 21 years old and originally from Lubbock. For those of you unfamiliar with Chris, he is a Miami native and is 25 years old. When it comes to big dicks Tyler agrees that bigger is always better. We couldn't agree more. The biggest cock Tyler's ever had was 11'. 'He was Puerto Rican' he blushes, '...it took a while.'  Chris knows all too well the pitfalls and bonuses of having a big dick. Chris' favorite plus is people's reactions to it when they first see it. Both of these boys are horny and started playing with their equipment at about 11 years of age. They still admit they take care of business on their own and when it comes to what helps them get the job done Tyler likes to fantasize about barrack sex. For Chris just thinking about a really hot guy does the trick.  Well we have a feeling that what these two are about to do will give many of you out there plenty of fuel to beat off to. Shall we? Chris is chilling at home and his cock needs attention as it strains against his tight underwear. He has a plan for this bad boy as he takes out his handy fleshjack and slips it over his throbbing Cuban cock. He starts to pump it up and down on his cock finally getting some attention on his meat. As he's sliding his dick in and out of that Tyler walks in and sits on the couch next to him. Chris is startled as he opens his eyes to find Tyler there eager to help out. He takes over and pumps that cock a few times before realizing he could do a better job. He loses the fleshjack and opens wide as he takes Chris' cock into his hungry mouth.  Chris moans as he watches his throbbing cock disappear into Tyler's mouth. Tyler runs his hot tongue all over Chris' smooth balls driving him wild. They start to make out for a bit before Tyler gets on his knees to service Chris' cock some more. Chris then gets Tyler on the couch, stripping him so that he can return the favor. Tyler is rock hard as Chris takes his cock in his mouth. He groans as that dick gets some attention. Chris works that cock and eventually runs his tongue back into that hot ass. Tyler grunts as he gets that sweet ass rimmed and prepped for more.'Oh fuck me!' Tyler begs with Chris' tongue still inside that hot ass. Chris suits up and slides his fat Cuban python into that tight ass. Tyler is rock hard as Chris starts to fuck him missionary. He takes that dick ball deep. He's done this before? <evil grin> Chris pounds that ass for a few before putting Tyler on the floor. He cushions his back as he lifts his ass str8 up in the air and gets that ass ready to be pile-driven. He points his fat cock south and slides that cock home. His dick sinks deep into Tyler's hole as Tyler begs for more. Chris bounces in and out of that hole doing squats into it. This Texan can take it better than most. This position is ideal for cramming as much of that cock as Chris can deep into Tyler and he's loving every minute of it. Chris then gets his hot buddy back onto the couch to continue fucking him on his back. He gets those hairless thighs up in the air and slides his thick cock right back where it belongs. Chris' cock is hitting Tyler's prostate just right and it makes him shoot sooner than he wanted to. Chris then pulls out and shoots his massive load all over Tyler drenching him from head... to head. ",
  "models": [
    {
      "name": "Chris Cox",
      "person_id": 28468
    },
    {
      "name": "Tyler West",
      "person_id": 28838
    }
  ],
  "release_date": "2011-08-31",
  "scene_id": 54955,
  "series": "It's a Hard Cox Life",
  "tags": [],
  "title": "It's a Hard Cox Life"
}