{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we are extra stocked as we welcome two new faces to ExtraBigDicks. The first is a dark and swarthy hottie by the name of DJ Spins. DJ is 22 and originally from Santa Cruz. DJ is in for a treat as we pair him up with a Midwestern hottie, Leo Corona. Leo is originally from Prague and if his sexy accent doesn't make you melt, wait til you see his dick. We asked these two what their favorite time of day is. DJ loves the morning when he first wakes up and gets to touch his morning wood. Leo was bummed that DJ took his answer but also loves the morning especially breakfast. Both of these studs appreciate dining on both sides of the buffet and both love sex and started young and haven't stopped since. By the time they got to college they were well versed. We then asked if they had any advice for people that had trouble taking their huge cocks. 'Breathe!? is DJ's advice and to not push out while he's pushing in. Leo says to prep yourself and to make sure you get the dick nice and wet before trying to slide his fat uncut pole inside a tight ass. Well, those sounds like words of wisdom and some that may cum in handy...soon!DJ & Leo are coming back from meeting friends when Leo sees a mag sticking out of DJ's backpack. He snags it as DJ freaks out. Turns out it's a gay magazine. Leo tells him it's fine and that he's always wondered if the rumors were true. Do guys suck better dick than girls? DJ laughs as Leo grins wanting a sample. DJ agrees and starts to undo Leo's pants. As he reaches his boxers he realizes he's in for a huge treat as he hauls out his thick uncut monster. He runs his tongue along its shaft before taking almost 9' into his mouth. Leo moans as he watches DJ work his meat. Leo is fair complected and has a hot look to him with tattoos all over his arms and chest. DJ is totally focused on that dick as he slurps on its meaty length. Leo stands up to give DJ easier access to all of it. DJ happily kneels before his new play buddy and goes right back to worshipping that cock. His attention then turns to that sweet ass as Leo bends over and gives that hot tongue access to his str8 hole. Leo moans and asks DJ if he likes that ass. DJ answers that question by ramming his tongue deep inside his ass making his cock throb.Leo then gets DJ bent over the couch as he gets into position and starts to slide his thick cock into DJ's tight hole. His ass gives in and soon Leo is buried ball deep as he starts to fuck that ass. DJ's own uncut cock is at attention as he gets that ass pounded. Leo holds his tight waist as he impales his fat Czech meat inside. DJ whimpers unable to get enough of that str8 dick inside him. Leo's balls are slapping away at DJ's hairy hole. 'You like that?' he grunts as he continues to make that ass his. Leo then pulls out and sits back so that DJ can ride his dick. DJ gets that hot ass right back on that meat, bouncing on it like it's a pogo stick. He grinds down on it wanting to get every delicious inch inside him. We can't say we blame him. Leo's eyes roll back as he gets the ride of his life. Leo then gets DJ on his side as he lies behind him and slips his meat in for more. Leo shoves that dick in and out over and over as DJ jacks his meat faster and faster. Soon he's ready to blow his load and as he explodes Leo shoves his dick in deeper. After DJ bathes himself in his load, Leo lies back and makes his own mess unloading all over his inked navel.",
  "models": [
    {
      "name": "DJ Spins",
      "person_id": 28839
    },
    {
      "name": "Leo Corona",
      "person_id": 28840
    }
  ],
  "release_date": "2011-09-07",
  "scene_id": 54958,
  "series": "Corona Time",
  "tags": [],
  "title": "Corona Time, Scene #02"
}