{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Steven Ponce is back this week and we're always in for a good time with Puerto Rico's favorite ginger. Steven is 31 and this San Juan native is gonna help us welcome a new face to the site Mr. Sean XL. Sean is 23 and grew up on the outskirts of the Mojave Desert in Victorville, CA. We don't wanna get ahead of ourselves, but they do call him Sean 'XL' for a reason. We asked these boys if they could open a restaurant what would it be and what it would serve. Sean grins and answers 'Mrs. Hat's Pancakes'. Guests would sit stationary while all the servers were on a type of conveyor belt that went around the eatery and serve as they moved around. IHOP meets the airport. Someone's been giving Mrs. Hat's some serious consideration. How do you follow that? Give Steven a minute. We then asked them what their first sexual experience was. Steven's was back when he was 16 with a 'cousin'. It was dark and it just kinda happened. For Sean his earliest sexual memory was walking in on his parents. Enough said...Steven is up to no good as he pours water all over his shorts. He walks into the next room and asks Sean to lend him his shorts because his are drenched. Sean isn't buying it as he grabs his mug and pours water all over his own. Getting Sean out of his shorts was easier than expected. Steven kneels to feign his dismay but soon the two are making out hot & heavy. Sean kisses his way south along Steven's chest as he pulls off his shorts. Steven is hard as Sean pulls his cock out. He starts to suck on his cock as Steven moans his approval. He takes care of Steven's throbbing meat for a while before he wants some in return. Steven gets on his knees as Sean stands up and hauls out his massive meat. Steven struggles as he tries to take it all in his mouth. Sean's huge cock is growing by the second and is soon at full mast. Steven can't get enough of that 9' cock as Sean starts to fuck his face with it. Steven savors every inch of that uncut cock as he shoves as far as his throat will let him. Do not try this at home. Steven is a trained professional. Sean then gets Steven on his back so he can get a taste of that smooth ass he will soon own. Steven moans and begs for more as Sean tongue fucks his sweet ass. Once that hot ass is nice and wet, Sean suits up and sits back. Steven straddles him and sits on it. He holds still as Sean starts to pump that fat dick up into his tight hole. 'You're big!' is all Steven can muster to grunt as he gets his tight hole stretched wide. Sean has that ass all loosened up as he starts to grind that dick deeper inside him. Steven then gets on all four as he bends over the couch. His hot ass is up in the air and ready for more as Sean slides his chocolate dick back inside. His balls slap away at that hot ass as he picks up the pace pounding Steven's hot ass even harder. Sean is all smiles as he looks south and watches his fat dick disappearing into Steven's hungry hole. Doggy style lets Sean get his dick in deep. From there he gets Steven on his back and gets right back in that hole missionary. He knows this is the position that will send Steven over the edge as he starts to bury his dick even deeper. Steven can't help but start to jack off as he gets his tight ass nailed. Steven can't hold back any longer as he explodes all over his chest and abs. Sean in right behind him as he too pulls out and coats Steven's cum-covered body. ...whew.",
  "models": [
    {
      "name": "Steven Ponce",
      "person_id": 27969
    },
    {
      "name": "Sean Xavier",
      "person_id": 34844
    }
  ],
  "release_date": "2011-10-12",
  "scene_id": 54967,
  "series": "Sean's John",
  "tags": [],
  "title": "Sean's John, Scene #01"
}