{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have a meat overload this week as we welcome back 24 year old Tampa boy Jessie Alan and his oversized, uncut dick. Not that we're complaining. Jessie is all smiles as he sits next to Max Gunnar. Max is 19 years old and he's from Largo, FL. We have a feeling there may be more going on with these two than meets the eye. Hmmm. We asked these two what their favorite drinks were, alcoholic and non-alcoholic. Jessie loves Grey Goose and Red Bull. For Max his preferred drinks would be Coke and Tequila for the hard stuff. We then wondered what the last thing they treated themselves to. They both came up with the same answer with a really nice pair of shoes. Jessie admits he's been with a guy that has an even bigger dick than he does. Fortunately for Jessie he was a bottom. We then asked Max what the perfect cock would look like. He blushes as he looks over at Jessie who is grinning ear to ear. To wrap things up we then asked Jessie to describe the perfect ass. 'Not too firm, not too plump just right in the middle.' Most likely have a pink little hole that I could stretch open. Well, Max can definitely handle that request.No time's wasted as they start to make out even before we start filming. The chemistry is obvious between these two as they start to undress each other. Max kisses his way south along Jessie's inked torso until he reaches the obvious tent in those jeans. Once they come off he goes down on that thick uncut cock. 'Like that dick?' Jessie moans as he watches Max bob on his dick. Max worships that dick, taking his time as he makes Jessie's cock throb. He takes as much of that cock as he can down his throat. Jessie writhes with pleasure as he gets his dick worked. Max then stands and gives Jessie some dick to work on as well. Jessie gets on his knees and returns the favor as Max holds his head and fucks his face. Max' cock is rock hard as he watches it disappear into Jessie's hungry mouth. Max loves the attention but he isn't done working Jessie's cock as they move back over to the couch so that Max can keep working on Jessie's massive python which he now deep throats with ease. Jessie then bends Max over and spreads his smooth ass open going in tongue first as he preps that hole for his fat dick.rJessie laps away at that pink hole sliding his finger into it. He gets Max horned up for more and he won't have to wait long. Jessie suits up and sits back as he watches Max sit on his cock. He rides that dick in a reverse cowgirl as Jessie slams that meat up into his hole. Max just stands still as Jessie pumps that thick dick up into him. Max then goes right back to bouncing on that thick cock. He rides that meat like a pro as he bucks that ass back taking every thick inch inside. Then they switch it up as Jessie bends Max over and fucks him doggy style. His heavy balls slap away at that tight ass as Max grimaces taking one hell of a pounding. Max' own cock is rock hard as he gets that hole stretched open. From there they end up back on the couch with Max' legs in the air and Jessie buried deep inside him. Jessie slowly fucks that tight ass burying his dick deeper as it gets Max closer to the edge. He finally explodes all over himself as Jessie continues to pound him fuckin' him even harder once he starts to nut. Jessie then pulls out and shoots his thick load all over Max' face and open mouth. He slowly rubs his spent cock all over Max' cum soaked face and lips. Milk, it really does a booty good.",
  "models": [
    {
      "name": "Jessie Alan",
      "person_id": 28496
    },
    {
      "name": "Max Gunnar",
      "person_id": 28843
    }
  ],
  "release_date": "2011-10-05",
  "scene_id": 54966,
  "tags": [],
  "title": "I Wish That I Was Jessie's..., Scene #02"
}