{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a blast from the past as we gladly welcome back Scott Alexander. Scott is 39 now and looking damn good. No one could better appreciate all that Scott's packing more than our newest introduction to the fold. Austin Tyler makes his debut with us. Austin is originally from Cuba where he was raised on black beans and rice before coming over to Miami five years ago. We asked these two if they could pass a law to right a wrong what would it be. Austin would pass a law to get rid of tube sites that weaken the industry. Scott would just pass a law that made it ok to marry one another regardless of sexual orientation. Austin is relatively new to the industry so we wondered how different the real thing was to any expectations he may have had. Austin has wanted to do porn since he was 14 so he's just happy to be old enough to do it. Well this IS the land of opportunity so let's go with that. For Scott he has been at this for a while and he credits his ease with other men to having had hetero relationships early on that just made him more aware of what he truly wants out of life and he now goes after it.Scott and Austin are giving each other the eye as Austin decides to take it one step further. He stands right in front of Scott and pulls down his shorts showing off his smooth ass. Scott isn't passing up on that sweet ass as he moves in for a closer look?tongue first. Austin moans as Scott explores that ass with his tongue and fingers. He laps away at that smooth ass getting it nice and wet. Austin then gets Scott on the couch where they start to make out and strip each other's clothes off. Scott gets up to give access to his cock as Austin hauls it out of his boxers and goes to work. He runs his tongue along Scott's throbbing black bone. He opens wide and takes as much as he can and starts to suck it. Scott watches as he gets his cock worshipped by his new friend. Austin can't get enough as he bobs his head up and down on Scott's thick shaft. Scott then gets Austin on his back and straddles his face for more oral as he starts fucking that pretty face. Scott then moves south as he licks Austin's smooth body all the way south til he gets his mouth around Austin's cock so that he can return the favor. Scott swallows every inch as Austin writhes with pleasure. Scott then bends Austin over and gets his ass wet again... HmmmOnce that ass is nice and wet, Scott starts to slide his thick dick inside. Scott sinks it in all the way as he starts to fuck that ass doggy style. Austin backs that ass up as he bounces that ass on that dick. Scott watches for a bit as Austin pleasures himself on his meat but soon takes charge pounding that ass good.  Scott holds Austin tight as he jack rabbits that dick into him. Scott then grabs Austin and sits back on the couch with Austin still on his cock. He then holds those legs apart as he starts to slam that dick up inside him. Austin is riding that dick in a reverse cowgirl grinding his tight ass down on that dick. Scott just watches as Austin has his way with that thick dick. Austin then twirls around still on that dick until he's done a 180 and is now facing Scott. They start to make out as Austin bounces on that meat faster. Austin loves being in control of that dick. Scott then stands up with Austin still onboard and lays him on his back. He slides back inside missionary. He fucks that tight ass deep getting them both closer to climax. Austin is the first to cum, exploding as Scott pounds that ass. Scott pulls out next as he dumps his thick load all over Austin's cum drenched abs and chest.",
  "models": [
    {
      "name": "Austin Tyler",
      "person_id": 28842
    },
    {
      "name": "Scott Alexander",
      "person_id": 28046
    }
  ],
  "release_date": "2011-09-28",
  "scene_id": 54964,
  "series": "Great Scott",
  "tags": [],
  "title": "Great Scott, Scene #02"
}