{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We're excited to have a familiar face make his debut on ExtraBigDicks. From our brother site MenOver30, Lucas Knowles is in the house. Lucas is 32 years old and originally from Poland. We know this 6'3', hung import won't disappoint. Mason Coxx is also back and we know our fans love this 26 year old New Englander with the thick 9' cock. That sparkling personality is just irresistible. <evil grin> We asked these two what their favorite way to unwind was after a stressful day. It would be cocktails and TV for Mason; while Lucas would rather hit the gym and listen to some great music. As two well hung men we wondered what guys out there wanting to handle that kind of equipment should know. 'I think it's all mental' says Lucas, 'if you want it bad enough it won't hurt.' Mason thinks more lube always helps. They both agree that bigger is better and even though they are hung it's nice to have a bigger dick. Lucas would bottom for a guy with a bigger dick than his own. If he was less endowed he probably wouldn't be eager to give it up. Mason agrees. They won't have to worry about that today cuz there's plenty of dick to go round.Mason is admiring a pic of Lucas with his hair slicked back. He definitely likes the look and shows Lucas just how much as he goes in for a kiss. They start to make out as they peel each other's clothes off. Mason's cock is already tenting his boxers as Mason gropes it. Lucas then stands to let Mason get at his own throbbing cock. Mason obliges as he pulls down Lucas' shorts and frees his thick uncut, Polish meat. He opens wide as he gets that beautiful cock wet. He grabs Lucas' smooth nuts as he deep throats every inch of it. Lucas playfully slaps his thick dick on Mason's face before shoving it back down his throat. Lucas then pushes Mason off his cock and strips off his underwear to get some big dick of his own. He grabs Mason's cock and slams it down his throat. He loudly slurps on all the dick Mason has to offer and rubs it all over his rugged face. Mason holds Lucas' hair up so he can watch his thick dick disappear into that hungry mouth. Lucas can't get enough of that big dick and he's in good company cuz Mason feels the same way as they take turns servicing each other's throbbing cocks.Lucas then suits up and lies on the couch as Mason straddles his thick cock. He slowly impales himself on it as his ass starts to give way. Lucas gasps as that tight ass lets him inside. 'Ride it' he groans as Mason starts to do just that. Mason is soon grinding his hot ass all the way down wanting every inch of that dick buried deeper. Mason then holds still as Lucas starts to slide that cock up into that hot ass. Lucas then bends Mason over so he can tap that ass doggy style. Mason takes it like a man as Lucas goes right back to feeding him dick. He pushes Mason's ass lower to get it just where he wants it before picking up the pace. His engorged sac slaps away at that hot ass as Lucas pounds Mason's willing hole. Lucas teases Mason, pulling his thick cock free of his ass then slamming it back inside. But wait. There's more. Missionary is next as Lucas gets Mason's legs in the air and slides back inside. Missionary always does the trick as his fat cock hits Mason's sweet spot. Mason shoots his load all over himself as Lucas fucks him. Lucas then stands and unloads that huge signature batch of his ALL over his new friend. ",
  "models": [
    {
      "name": "Lucas Knowles",
      "person_id": 27994
    },
    {
      "name": "Mason Coxx",
      "person_id": 28799
    }
  ],
  "release_date": "2011-09-21",
  "scene_id": 54961,
  "series": "It's a Hard Cox Life",
  "tags": [],
  "title": "It's a Hard Cox Life"
}