{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Two new faces grace our page this week as we welcome hung, hottie Joe Parker and his buddy Dalton Tyler. Joe is a 31 year old Jersey boy with rugged good looks and a defined body to match. Dalton is from the Midwest and hails from the Windy City. This tall 20 year old is in for a treat once - well, let's not get ahead of our selves. We asked these two what class in school they now wish they'd paid more attention to. For Joe it's Spanish which we're sure would help him pick up more hotties here in South Florida. Dalton wishes he'd paid more attention in math. Turning our chat to the tawdry, we asked these two whose cock they would wanna see if that wish could be granted. Russell Crowe's cock would be Joe's choice and a good choice it is. Dalton is going with something a bit more polished and wants to see Marcus Schenkenberg's, Calvin Klein model cock. We're sure it comes with its own portfolio. When it comes to jacking off, we asked when they last did the deed. Four days for Dalton but over a month for Joe.  They both like a dry rub so hold the lube and they didn't even need porn to do it. Well, the best porn is in your head. LIES!Joe is complaining about how hot he is and that the heat is just killing him. He is so hot he peels off his tee shirt and once he does, Dalton has to agree he is hot. He leans in for a kiss as they start to make out. Their hands roam as they grope each other's growing crotches. They stand to continue making out for a bit before Dalton heads south to closer inspect Joe's growing bulge. He helps him out of his jeans and starts to tease the growing cock in the sexy briefs. He pulls them off and goes to work on Joe's throbbing cock. 'You like that?' he coos as he looks up at Joe. Dalton is on his knees and getting his mouth stuffed full of Jersey cock. Joe then sits back so that Dalton can continue to worship his meat. Dalton shoves that thick cock as far down his throat as he can as Joe just sits back and enjoys the view. Joe then pulls Dalton to his feet and drops his pants so that he can return the favor. Joe wraps his lips around Dalton's cock and gets to work on his hard cock. Dalton moans his appreciation as he gets his shaft shined. He loves the attention he's getting but he isn't done sucking on Joe's. He gets back on that thick cock sucking it deep, wanting to get it as hard as he can for what's to come.Joe's cock is raging and needs more than Dalton's hot mouth. They lay on the couch and Dalton backs that ass up onto Joe's hard cock. Joe slides his thick meat all the way inside and starts fucking that tight ass. They make out as Dalton jerks his cock. Joe's cock slides all the way inside as he slowly takes that ass. He holds Dalton's leg up and starts to grind that cock in deeper as he uses the couch cushion as leverage enabling him to thrust up into that ass. Joe then gets Dalton on the floor on all four as he goes back to fucking that ass doggy style. He slides that fat dick deep as Dalton groans. He wastes no time before picking up speed. He holds Dalton by the waist and gets busy impaling him with his meat. Joe watches as Dalton's tight ass swallows his meat over and over as he slams away. They then go back to the couch as Dalton sits on that dick and leans back against Joe's chest. Joe slams his dick up into that hot hole over and over making Dalton just beg for more. That tight ass sends Joe over the edge as Dalton gets off him so he can bust his nut all over his defined abs. Dalton then sits back next to Joe, closes his eyes and jacks his dick off trying to bust a nut. Joe, having already handled his business, sneaks off leaving Dalton jerking off with his eyes closed. ...um, RUDE! lol",
  "models": [
    {
      "name": "Joe Parker",
      "person_id": 28044
    },
    {
      "name": "Dalton Tyler",
      "person_id": 28851
    }
  ],
  "release_date": "2011-11-16",
  "scene_id": 54978,
  "series": "Parker's House Rules",
  "tags": [],
  "title": "Parker's House Rules, Scene #02"
}