{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Trey Turner is back on ExtraBigDicks and looking better than ever. He's excited to help us welcome newcomer Evin Brampton. Evin is 21 years old and from Brent in Ontario. Canada, eh? Hmmm. Trey is 23 years old now and he's a local hottie from right here in Miami. We asked them about their favorite holidays. Evin's favorite is Halloween and he loves to spend it with friends in Orlando. Trey was gonna say the same thing but opted for Thanksgiving which he loves to spend with friends as well. Trey also loves it because he loves to cook. We wondered if we asked their ex-boyfriends what these two would win a gold in the sexual Olympics for. For Evin it would be being aggressive. Trey blushes as he admits he'd win a medal from his past boyfriends for being an awesome bottom. They are both hung and both admit it's impressive to have because it looks great but often times guys can't handle it when they try to take it. When we asked them for tips on taking big cocks Trey recommends you breathe. Evin feels it falls on the tops shoulders and to know how to pleasure someone vs. hurting them with it. Any questions?Trey walks in with some coffee for Evin to help him wake up but finds that certain parts of Evin are 'up' bright and early as Evin strokes his morning wood. Trey brought in coffee but scores breakfast as he goes south to sample Evin's thick sausage. Evin spreads his muscular thighs as trey kneels between them and gets to work. He savors every inch of that thick cock as Evin watches him service that meat. Evin's chest is smooth and defined and his dedication in the gym shows. He stands to give Trey better access as he starts to fuck his face. Trey opens wide as Evin shoves it in deep making him gag on it. They start to make out as Evin starts to strip Trey wanting to return the favor. Trey is rock hard as Evin gets on his knees to explore what he has to offer. Evin sucks on his cock as he strokes it making Trey moan with pleasure. The chemistry between these two is obvious as they take turns sucking each other's cocks. They get each other hot and horny and ready for more than just some head.Evin then gets Trey on his back as he slides his thick uncut cock inside him missionary. Trey grunts and begs for more as Evin fucks him harder. 'You like my ass?' Trey moans as Evin pounds him harder. Trey can't get enough as he gets that ass stretched open. Evin grabs Trey's throbbing cock as he start to jerk him off as he impales him. Evin then gets Trey up and bends him over to fuck that sweet ass doggy style. Trey bends over the couch and gives it up as Evin's balls slap away at Trey's hungry hole. 'Pound my ass!' Trey orders as Evin grabs that tight waist of his and rails him harder. Evin has more in store as he gets Trey on the floor and flips his legs up over his head and slides that dick deep. He starts to fuck that ass as he pile drives it home. He squats up and down as he stuffs that tight ass with dick. Trey is jacking his cock faster as Evin pounds him deeper. He can't hold his load for long as he shoots all over his own chest as his cock hangs above his head. Evin then sits back and pops his own nut all over his smooth abs and chest. Mission accomplished.",
  "models": [],
  "release_date": "2011-10-19",
  "scene_id": 54970,
  "series": "Evin-tually",
  "tags": [],
  "title": "Evin-tually, Scene #02"
}