{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Valentin Petrov made his debut with us on our brother site; but after seeing all that this sexy 33 year old hung, Russian import had to offer?we knew exactly where he belonged.  We have a feeling his costar won't mind welcoming him seeing as he is packing a thick 9' Cuban cock to match Valentin's own uncut counterpart. Chris Cox is back with us and this local 26 year old Miami stud is in for a real treat. We asked these studs to tell us on a scale of 1 to 10 how clean and tidy they were at home. Both claim to be 10s in that department. We then wondered what they'd always wanted to do but hadn't had a chance to do. Chris wanted to be a gymnast while Valentin wanted to be a trainer. These guys are both packing big dicks and admit they have been with guys bigger than them but that doesn't happen often. They both agree that when they find guys with bigger equipment the roles often change. Bigger, after all, is better. You heard it here first, folks! Sexually they are both open to all the possibilities, versatile and willing to try new things. We couldn't ask for a better match up. The chemistry is on high as these two go at it even before we hit record. They start making out as they slowly strip each other. Both of these studs are naturally smooth and have sculpted physiques. Valentin licks his way south on Chris' chest as he kneels before him. He takes out Chris' Cuban cock which by now is throbbing for attention. He takes it in his mouth and starts to work on it as Chris moans. Valentin worships that dick getting it nice and wet as he savors every inch. Valentin strokes Chris' meat and looks up at him as he sucks on Chris' low hanging balls. Chris then pulls Valentin onto his feet and as they make out Chris undoes Valentin's pants to free his uncut comrade's meat. They stroke each other's cocks together before Valentin gets on the couch to let Chris get some cock of his own. Chris grabs Valentin's balls as he aims that meat home. He opens wide as Valentin starts to fuck his face. Valentin pulls his thick foreskin forward so that Chris can suck on it before shoving it back down his throat. They can't get enough of each other as they end up in a steamy 69 on the floor. That gets so hot that Chris' tongue moves further south and explores Valentin's tight ass. He munches on that ass getting it ready for more.Once that hot ass is nice and wet, Chris takes aim and slides his thick cock home missionary style. Valentin moans as Chris' cock slowly slides inside. Chris is soon fucking that ass deep as Valentin grunts trying to accommodate the thick cock he's taking. Chris fucks him good shoving his thick meat and out, kissing him as his balls slap away at that ass. 'You like that?' he moans as he continues to fuck ass. Chris then moves the party to the couch as he sits back and has Valentin sit on his dick. Valentin takes it like a champ as Chris bounces him on his meat. Valentin knows exactly what to do with that oversized meat and Chris loves every second of it. Chris then moves to the side as he lays Valentin in front of him. He holds Valentin's leg up and slides that cock in for more. He pounds that ass faster and harder as Valentin starts to jack off. It isn't long before that ass makes Chris want to explode as he pulls out and shoots a huge wad all over Valentin's face and chest. Valentin then blows his wad all over his cum-soaked navel.",
  "models": [
    {
      "name": "Chris Cox",
      "person_id": 28468
    },
    {
      "name": "Valentin Petrov",
      "person_id": 28033
    }
  ],
  "release_date": "2011-10-26",
  "scene_id": 54972,
  "series": "Valentin-O",
  "tags": [],
  "title": "Valentin-O, Scene #02"
}