{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Get out the party hats we have a birthday boy in the house this week as we welcome Drake Jayden who's celebrating his 27th birthday. Well, it was yesterday, but close enough. To help make his day special, mostly a coincidence, we got a 22 year old hottie from northern California that all of our members love, Mr. Dylan Roberts. We know these boys work hard so we wondered if they could have a dream vacation what it would look like. Dylan would love to got to Ireland and see all the old castles and learn about the history. Maybe go to an authentic Irish pub and help himself to some ale or lager and become immersed among their thick accents. After 2 beers he may not understand a thing. For Drake he's going on what he hopes will be a dream vacation and will be spending a long weekend in Mexico with four other adult stars. Now that's a party right there. We wrapped things up asking if the ratio is even off camera in their personal life. They both like it 50/50 and Dylan admits he prefers to top at home; but when he's working he gets the opportunity to be with guys that are larger in some areas so he always makes the best of that. ...What a trooper.Drake is thumbing through a magazine when Dylan comes in to say hello. Drake is excited to see his old friend and they start to catch up and compare notes. Drake notices Dylan's a lot leaner and bigger and they both start to show off their chiseled abs. 'You still got that big dick?' grins Dylan. Dylan wants a closer look as he gets Drake up on the chair. He starts sucking Drake's nips and chest before making out. Dylan's hands find their intended target and as his shirt comes off so do Drake's pants. Dylan goes down on Drake's hard cock that is already at attention and eager to see him. Drake moans as Dylan swallows that meat all the way down his throat. Drake shoves his hard cock all the way down Dylan's throat as Dylan services his hard cock. Dylan then gets on his knees to work on Drake's dick some more and once Drake's had enough of that sweet mouth he returns the favor. Dylan groans as Drake deep throats his uncut cock. Drake knows exactly what he's doing as he swirls his hot mouth around Dylan's throbbing dick. From there it's a hot 69 as Drake gets that ass tongue-fucked by Dylan as he continues to nurse on Dylan's cock. It isn't long though before Drake's hot tongue finds its way to Dylan's back door.Drake then lubes up Dylan's cock and straddles it. He sits on that uncut dick as Dylan starts to slide that meat up into his hot hole. Drake grunts as he tries to accommodate that thick dick inside him as Dylan piston fucks up into him. He bounces Drake's hot little ass on his meat without any mercy, taking that ass deep. Drake doesn't mind one bit as he bucks back onto that dick wanting every inch of it. Dylan then gets Drake on his back and lifts his legs way up and over so that he can pile drive his dick back into that ass. Drake watches as Dylan owns that ass of his. He starts to do squats in and out of that ass as he repeatedly plunges his dick all the way inside. Drake is stroking his own throbbing cock that's hard as a rock as he gets fucked. From there they slide all the way down to the floor where Dylan continues to pound that ass missionary. Drake can't help but beg Dylan for more as Dylan's smooth balls slap away at his sore hole. Missionary does the trick as Dylan nears his climax. He fucks Drake harder and faster actually sending Drake over the edge as he bathes his furry abs and chest in his load. Dylan then pulls out and adds his own thick batch to Drake's matted mess.",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Dylan Roberts",
      "person_id": 28414
    }
  ],
  "release_date": "2011-12-21",
  "scene_id": 54979,
  "tags": [],
  "title": "Sleazy Drake's Oven, Scene #01"
}