{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have an extra big surprise for you. Here to help us out with that is Jersey's own Alexander Greene. Alexander is 20 and being that this hung fan favorite is from Jersey, we thought he'd be perfect to help us welcome the newbie from the Big Apple, NYC. We actually had ?10? good reasons why- but, let's not get ahead of ourselves as 24 year old Ricky Dicardo makes his debut. We asked these two what their ideal Saturday night would look like. Ricky likes the clubs, dancing and yelling at as many people driving by as you can. Alexander is all about pre-gaming at a friends, then more pre-gaming at a bar then hitting the club. Speaking of ?clubs? both of these boys are packing more dick than the average club holder. When it comes to advice on how to take their cocks, Ricky says he's rejected from a lot of ass by females. So his best advice, you ask? ?You gotta learn how to just take it in the ass and shut up.? We hope someone in the room is paying attention. Alexander concurs and says that the worst thing to do, which is also his biggest turn off, is when you run away. ?If you run away (from it), it's not going to go smooth. So just try and stay with me?. Well relax, Alexander, there will be absolutely no running this afternoon. ( We just hope you're ready!)Ricky is kickin' back with Alexander complaining about guys always blowing up his cell with offers to suck his dick cuz ?guys do it better?. Alexander grins and assures him it's true. ?How would you know?' Ricky asks 'can you prove it?? Alexander doesn't need to be told twice as he reaches for Ricky's growing crotch. Ricky's already at half mast as Alexander starts to knead his meat through his jeans. It's massive and Alexander goes in to see just what he's packing. He plays with Ricky's growing bone through his loose fitting boxers that can barely contain his junk. Ricky just sits back and watches as Alexander gets lost in the task 'in' hand. He hauls out Ricky's half hard cock and huge balls. He can't hold off any longer and goes for it sucking as much of it as he can. Ricky's meat gets harder by the second in that hot mouth and soon Alexander's nursing on a thick 10? cock. He pumps it with his fist as he works the swollen knob with his mouth. Ricky then gets up to give Alexander more dick as he starts to fuck that mouth of his owning up to the fact that Alexander might've been right after all. Alexander can't get enough as he worships that huge meat wanting nothing more than to pleasure Ricky's extra fat dick.Ricky then gets Alexander on his feet and helps him out of his pants and gets a closer look at Alexander's 9? cock. He licks it; rubs his face with it and teases Alexander as he jerks his thick dick. Knowing this is out of his comfort zone, Alexander gets him back on the couch to get more of Ricky's dick in his mouth. He sucks on it some more wanting to get it as hard as he can. Once Ricky's rock hard, Alexander slides a rubber on him and sits on his fat meat. Ricky is getting more than he asked for as he starts to tap that tight ass. Alexander is rock hard as he takes all 10 inches deep; riding that cock like a champ. Their massive balls slap together as Alexander rides that dick reverse cowgirl. Ricky then gets Alexander up before bending him over to fuck that ass doggy style. Alexander moans as he gets his ass packed full on New York's finest. Ricky now knows where to get the anal he's needed.  Alexander grunts as Ricky pounds his tight ass harder and soon they end up back on the couch where Ricky lays behind Alexander and fucks him from behind. Ricky's cock pistoning into Alexander's tight ass is only getting them both closer to cumming. Alexander jacks his meat furiously as Ricky fucks the cum out of him. Ricky then pulls his massive dick out and unloads all over Alexander's chest.",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 28463
    },
    {
      "name": "Jay Rizzing",
      "person_id": 28849
    }
  ],
  "release_date": "2011-11-09",
  "scene_id": 54975,
  "series": "I Love Loosely",
  "tags": [],
  "title": "I Love Loosely, Scene #01"
}