{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Two hot studs grace our site this week and we have a feeling you're gonna more than like what you see. Phillip Aubrey is new to the site and will be making his debut. Along side the hung 27 year old North Carolinian is a familiar face; that of William Vos. William is now 31 and originally from the west coast of Florida. We asked these boys what they were most looking forward to happening in the coming year. Phillip is looking forward to all of it, looking to take the New Year by storm. William wants to go back to school and hopes to change everything he wants to change about himself. We then asked them how they prefer to communicate in these digital times. William texts constantly; where as Phillip makes more phone calls than he does text. We then wondered if these two ever jerk to mobile porn. They both laugh as they admit they do however they both prefer computer porn. Well we're thinking ?size' might have something to do with that. William admits he's a card carrying member of the Bigger is Better Club. His largest cock was probably his first who was a good 9' plus. That's definitely the way to make an entrance. Well, let's make ourselves scarce so that these two can get it started...William and Phillip are on the couch making small talk. Fortunately they run out of things to talk about as William starts to grope and undress Phillip. All this talk about Phillip's fat cock has his curiosity peeked. He pulls off Phillip's pants and goes to work on his thick meat. Phillip groans as William swirls his tongue all over his shaft. He strokes it with one hand as his mouth works his swollen knob. Phillip's massive 8?' cock is throbbing as William takes his time worshipping it. Phillip is naturally smooth and the dedication to his body has paid off nicely. William then gets up as they reconvene on the floor. They both have plenty of meat to work on as Phillip starts to return the favor. They 69 on the floor swallowing each other's hard cock. Phillip then gets comfortable so that he can get a better appreciation of William's thick cock. He lies on his stomach as he nurses on that thick meat. He can't get enough as William watches him service him. William then wants to get more of Phillip's meat as Phillip stands on a chair and fucks William's face, rubbing his wet meat all over his face. All that oral attention is making Phillip hungry for more.Phillip gets William on all four as he spreads that smooth ass apart and shoves his tongue in. He starts to eat that ass making William squirm. William holds his cheeks apart wanting to feel that hot tongue deep inside him. Phillip then gets into position and starts to slide his fat cock inside that hot ass. William takes it like a champ as Phillip starts to pound his hole. Phillip takes that hungry ass doggy style as his balls slap away at that hot ass. They move the party to the couch as they lay down and continue fucking. Phillip holds William's leg up as he slides in for more. William begs him to keep fucking him as Phillip continues to pound that hole. They kiss slowly as Phillip slows it down a bit giving him the chance to ram it deep then slowly pull it out only to ram it in again. From there Phillip gets on his back and watches as William sits on his thick cock. He spreads his ass apart as Phillip's thick cock impales it. William loves that cock and starts to ride on it. Phillip helps as he slams his dick up into that hot ass sending William over the edge. William shoots all over Phillip's chest and abs. Phillip then pulls out and shoots all over himself as well.",
  "models": [
    {
      "name": "William Vos",
      "person_id": 28743
    },
    {
      "name": "Phillip Aubrey",
      "person_id": 28847
    }
  ],
  "release_date": "2011-11-02",
  "scene_id": 54974,
  "tags": [],
  "title": "Phil-em-UP, Scene #02"
}