{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have Chris Cox and Trent Diesel in the house steaming up our cameras. Chris Cox our 26 year old local hottie is here to put that Cuban cock to use welcoming back Trent Diesel. Wisconsin native Trent is 27 now and it's been a year since we've seen his hot ass. (literally...) With all the political turmoil going on these days we figured we'd pose a hypothetical question and asked these hotties if they were President of the United States and could push any law through what that law would be. El Presidente Cox would make gay marriage legal across the land; while President Diesel would enact a law making it mandatory for those who look good naked to BE naked... all the time. We applaud his efforts to make America beautiful; but some things should not be done naked...or in public. lol We asked Chris what he felt bottoms wanting to take huge cocks like his should know. 'They need to be more gentle' he says. We then asked the reverse of Trent who concurred and felt that advice works both ways then he added his own twist. 'I seem to find a lot of guys with big dicks think just having a big dick is good enough', he grins 'you still gotta know how to fuck sweetie! ...just saying.  Enough said...'How big is that?' Trent asks wanting to know if that dick lives up to the hype. Chris isn't about to pass up an opportunity so he undoes his pants and lets Trent find out on his own. Trent's not disappointed as he grabs Chris' thick meat in his hands then in his mouth. Chris moans as Trent services his throbbing cock. He licks all over the shaft and heads south to lick and suck on his heavy balls. Trent gets right back on that dick for more as he chokes down as much of it as his throat will let him.  Trent spit shines that dick as Chris helps bob his head on it. He fucks that face wanting to get his dick as deep as possible. Trent then stands and drops his pants giving his dick some much needed breathing room. Chris has other plans as he bends him over to inspect that hot ass he'll soon have on his dick. He spreads those smooth cheeks apart and sinks his hot tongue inside. Trent moans as Chris eats that hot ass out getting it nice and wet and ready for a proper fucking. Trent pushes his ass back onto Chris' face as he gets that sweet ass tongue-fucked. Chris then gets up and fucks Trent's face some more getting rock hard for what's next on the To Do list ...TRENT!Chris suits up and sits back as Trent straddles him and begins to lower himself onto that pole. Trent grimaces as his ass slowly gives in. Once he gets that fat dick inside him he starts to ride it like a champ. That tight ass feels amazing on Chris' cock as he grabs Trent by the waist and helps bounce him on it. Chris then gets up and bends Trent over to tap that ass doggy style. Trent braces himself on the arm rest as Chris goes back to pounding that sweet little ass of his. Chris' balls slap against that ass hard as he picks up the pace. Trent grunts and groans as his ass gets stretched wider. Chris then moves the party back on the couch as they lay down. Chris lifts Trent's leg and slips that dick in for more. He slowly taps that ass as Trent moans his approval. He starts sliding that dick in deeper and faster as Trent beats off. That Cuban dick's hitting that prostate just right and it sends Trent over the edge. He shoots a huge load all over his chest and abs. Chris then gets Trent on his knees and beats off his own massive load all over Trent's face as Trent opens wide wanting to taste every drop he can. With an intense protein facial such as this, Trent's sure to be looking his best this coming year. Sign up now, Gentlemen. Supply IS limited.",
  "models": [
    {
      "name": "Chris Cox",
      "person_id": 28468
    },
    {
      "name": "Trent Diesel",
      "person_id": 28054
    }
  ],
  "release_date": "2012-01-04",
  "scene_id": 54984,
  "series": "Diesel Genes",
  "tags": [],
  "title": "Diesel Genes, Scene #02"
}