{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we've asked a good friend we haven't seen in a while to help us welcome a new, and rather hung, stud to the ExtraBigDicks' fold. We knew Connor Maguire would help us out as soon as he took one look at his costar, newcomer Van Wilder.  Van is new to the industry and at 19 years of age, this Miami boy has a promising future packing that big ol' dick. For those of you unfamiliar with Connor, he's a California boy and now legal at 21 years of age. Oh goody! We asked Van when he realized he had a bigger than average dick. Apparently his Mom broke the news when she walked in on him showering and was shocked to find him packing since his Dad apparently didn't. (...awkward) Van was freaked out at first (really?!) but when all the girls he was with told him the same thing he knew he had something special. Connor, no stranger to our site, also has a big dick. We asked if after having bottomed on cam if that made a difference on how he tops. 'Yeah, I go slower now' Connor admits 'now I kinda feed it in versus just slamming it in.' Yeah, it often helps to know what it's like to be on the receiving end of that big dick to make you a more considerate top. Well, let's hope Van's bottomed...Van and Connor are hanging out before their shoot when Van asks Connor what the hat he's got about. It's a CJB hat which he explains stands for CircleJerkBoys. Van is confused thinking he's shooting for ExtraBigDicks when Connor checks him and says 'Well to shoot for EBD you need to have an Extra Big Dick.' Van grins and informs Connor he's in luck because he just happens to have a really big dick. He gets up and undoes his pants so that Connor can find out for himself. Connor does and soon the only thing open wider than his eyes with awe is that mouth of his trying to wrap it around Van's huge cock. Van just watches as Connor sucks that dick on his knees. He can't get enough as he grabs that thick cock by the shaft and takes as much of it as he can into his mouth. Van lets Connor have his fill before wanting some cock himself. He gets Connor on the couch as he kneels between his legs and starts to work Connor's thick dick. Van runs his tongue around Connor's knob before sliding it down his throat. Connor moans his appreciation as he watches the bi boy work his hard cock but soon has another mouthful of Van's meat as Van straddles his chest and goes back to fucking his face.Soon that hot face isn't enough as Connor gets bent over and railed. He moans and groans as Van shoves his dick inside. It looks like someone's had more experience being on 'top' of things. Van's fat dick slides into Connor's tight hole over and over as Connor does his best to accommodate its girth. Van loves that sweet ass on his dick and he continues to pound that ass deep feeling his balls slap at Connor's ass. Van then switches it up as he sits back and has Connor ride his huge cock. Connor impales himself on that dick again as he starts to bounce up and down on it. He has more control of how much dick he takes but that extra big dick Van's got is stretching him wide open. Not one to back down from a challenge, Connor powers through it as he rides that dick determined to make Van blow his hot nut. Connor's own cock is hard as he rides that meat. Missionary is next as can gets Connor on his back. He fucks him deep like he does his girlfriend and Connor can't help but jack his throbbing boner. Van's fat dick slams into Connor's sweet spot sending his load flying all over himself as he drenches his navel with cum. Van then pulls out and unloads his thick load all over Connor's cum-covered cock. ...whew.",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 28024
    },
    {
      "name": "Van Wilder",
      "person_id": 28816
    }
  ],
  "release_date": "2011-12-28",
  "scene_id": 54982,
  "series": "Van-a-dude",
  "tags": [],
  "title": "Van-a-dude, Scene #02"
}