{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Trey Turner is back this week and he's brought along Alexander Garrett. There is plenty of dick to go round with these two in the house. No complaints here! It being the holidays and the aftermath thereof we wondered what the last purchase they made for themselves was. 'Shoes' answers Trey and Hugo is quick to concur. Hugo, who apparently has a bit of an Imelda Marcos complex, loves shoes so much he tries to get a new pair every weekend. We then asked them what their favorite desert is since we figure it can't be all gym all the time. Key Lim Pie is Trey's weakness while Hugo loves Cr?me Brul?e. Already having dispelled the myth that porn stars don't need to jack off we wondered who these two jack off to. Trey likes to masturbate to his boyfriend (YAWN!) while Hugo admits he likes to fantasize about a bunch of hot men having sex with each other. An orgy is never a bad thing to stroke to. We then asked them what they feel is something guys should work on when getting together with someone hung and they both agree that taking the time to give better head would be awesome. So relax those jaws boys, teeth are not appreciated. ...Who knew!?Hugo finds a pair of sexy briefs on the floor and loves'em and tells Trey that he would love to see what he looks like in them. Trey isn't one to disappoint as he undoes his jeans and bends over so that Hugo can peel them off of him. Hugo pulls down those jeans as Trey's bare ass comes into view as he's wearing ass-less briefs. The ass in those briefs is enough to make Hugo forget all about the briefs he wanted to see him in as he spreads Trey's ass wide and dives in tongue first. Trey moans and begs for more as Hugo eats that hole. Trey arches his back wanting to get as much of that hot tongue buried inside him. He then turns around as Hugo plays with his bone through his briefs. They then start to make out as Hugo drops his pants and takes out his fat uncut cock. He's hard in no time and that's all the invitation Trey needs to go down on him. He swallows that cock to the hilt as he fucks his face with it. He can't get enough of it as he worships that meat. Hugo then gets Trey on the floor to return the favor as he sucks on Trey's hard cock. Trey moans his approval as he gets that dick worked. Trey loves the attention but he isn't done with Hugo's as he gets back on his knees for more Colombian cock.Hugo then starts to work Trey's toes and feet as he runs his tongue along Trey's toes as Trey groans in ecstasy. Hugo then kneels as he pushes Trey's leg in the air giving him access to that ass he starts to tease. Trey's ready for more than that finger as Hugo suits up and sits back on the couch. Trey lowers himself on that fat dick as his ass gives way. Hugo's cock sinks inside and starts to pump up into him. Trey is rock hard as he gets that hole pounded. His boner bounces like a trampoline as he rides that cock like a seasoned pro. Hugo just sits back as he watches his dick disappear into Trey's hungry hole. Hugo then gets Trey on all four as he gets back inside that ass tapping it doggy style. He pulls his cock out slowly and then rams it back in letting Trey feel just how much is being rammed into that hole of his. Trey takes that dick deep as Hugo delivers that dick harder and deeper. Missionary is next as Hugo gets Trey on his back and keeps railing into that hole making Trey whimper and groan for more. Hugo's fat dick hits just the right spot as Trey nears climax. They both sit side by side as they jack their hot loads all over themselves.",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Trey Turner",
      "person_id": 27927
    }
  ],
  "release_date": "2012-01-11",
  "scene_id": 54986,
  "series": "The Lay-Over",
  "tags": [],
  "title": "The Lay-Over, Scene #02"
}