{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have a larger-than-life edition of ExtraBigDicks and you'll understand just why in a minute.  With us this week we have an industry favorite that has blown up and has amassed quite the following so we thought we'd have him back with us, none other than Tommy Defendi. Tommy is a 22 yo Chicago native who now calls Ft Lauderdale home. Tommy is tall, dark and hung like a horse packing a 9.5' cock. What else could you ask for? -wait for it. Alongside Tommy sits our newest find, Mr. Devon Moss who is also 22 hails from Greensboro, NC. This baby-faced country boy is a size queen's wet dream. Packing 10' of Carolina cock, Devon reminds us all to never judge a book by its cover; cuz this boy could split you in two. lol Tommy blushes as he admits this is the first time he's ever been with someone that has a bigger dick than he does. Even though most of the time the guy with the biggest dick ends up on top, that's not the case with Devon. We imagine most guys are just afraid of his dick. (AMATEURS!) Fortunately Devon is truly versatile so he doesn't mind either way. Fortunately both of these hung studs are single and loving their freedom. Well enough bragging from these two-let's get 'em nekid.Tommy starts rubbing Devon's foot as he breaks the ice. As he massages his foot, Devon begins to rub his foot on Tommy's growing cock. They begin to kiss as they lie back on the bed. Tommy hovers over Devon, slowly kissing him before pulling off their tee shirts. The jeans come off next as they are left in their underwear. Devon goes to work on Tommy's meat as he licks it through his underwear. It isn't in there for long as he hauls it out and engulfs it. Tommy can only moan while Devon's head bobs on his meat. Tommy wants some too and he gets between Devon's thighs for some cock of his own. Devon's massive uncut meat is rock hard in seconds as Tommy worships his 10' rod. Devon's cock is massive, not only in length but incredibly thick as well. This is not for the faint of heart (...or ass). They get into a hot 69 so that each has access to all the cock they want. Devon and Tommy savor every inch of their meat as they slowly enjoy their oral session. All this cock sucking and oral attention can only lead to one thing and that's Devon's smooth ass-Oh, goody, goody.                                                                                       Eyebrows furled Devon winces as Tommy slides his thick cock deep inside him. Devon does his best to relax as Tommy continues to take his ass. Tommy is steadily pounding his ass as Devon takes every thick inch he's given. Tommy looks down and watches as his massive meat disappears into Devon. 'You're so fucking big!' Devon grunts as he gets his ass stretched. Tommy continues to thrust his cock into Devon fucking him doggie style and enjoying the show below as Devon does his best to manage the dick he's giving him. 'Spank my ass' Devon grunts between moans as Tommy keeps impaling him. Tommy then lies back on the bed as Devon climbs aboard for more. He impales his sweet ass on Tommy's cock and starts to ride. Tommy is soon thrusting his hips up into Devon wanting to get his fat dick deeper inside him. Devon grinds his ass down onto Tommy making sure he gets every inch inside him. Missionary is next as Tommy slides his cock back in for more. Devon's whimpers get louder as Tommy fucks him harder and deeper, his fat cock easily claiming its prize. Devon won't be able to handle much more of this before his cock explodes. He pulls out and sits next to Devon as they both jack off. Tommy is the first to nut exploding as his load skyrockets all over him. Devon follows suit as his beer can thick dick unloads its own creamy cargo.",
  "models": [
    {
      "name": "Tommy Defendi",
      "person_id": 28400
    },
    {
      "name": "Devon Moss",
      "person_id": 30478
    }
  ],
  "release_date": "2012-01-18",
  "scene_id": 54989,
  "series": "Too Big To Fail",
  "tags": [],
  "title": "Too Big To Fail, Scene #01"
}