{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Well guess whose back!? This week, after much fan fare, we have Caleb Colton back to show us what he can do. Our fans really loved watching Caleb stroke his big dick a couple weeks ago so it's only logical we add fuel to that fire. Speaking of fire, we have a hottie we never seem to get enough of, Mr. Ty Tucker. Both of these fit studs take great care of their bodies so we wondered what snacks they like to indulge in. Caleb likes bananas and strawberries when he wants something healthy. For junk food he loves Funions and Fried Chicken. He is after all a 'southern boy'. Ty likes blueberries and fruits as well; but when it comes to junk food he's torn. There's just so much out there to eat. He loves pizza and chips and soda. We then thought it would be interesting to have these boys architect the perfect cock and we were quite pleased to achieve critical mass. They both like dicks that are big-but not too big-with some nice veins so they can feel it pulsing and it has to come with a nice set of balls. Well we definitely think they've come to the right place for that so we should stop chatting and let these get to gettin'! <evil grin>Caleb is hanging out when Ty walks in with the ice he requested. 'Here's the ice for your drink' says Ty as Caleb informs him they're not for his drink at all. Ty's confused until Caleb pulls up his tank and points his nips at him. Ty grins and gets to work icing those bad boys as they stand at attention. His tongue is next as he works his tongue on that hairy chest and nips, slowly licking his way south. He undoes Caleb's pants and finds what he's looking for. Caleb's cock is growing by the second in his sexy draw-string briefs. He takes the ice and teases it as the water makes his brief cling to his growing meat. Ty can't take it any longer and just pulls it out. He opens wide and goes for it. He takes that cock all the way down his throat until he gags on it. Caleb moans his approval as Ty worships his thick dick. Ty deep throats that meat sending Caleb into orbit every time. Ty knows just what he's doing as he makes sure to service Caleb's hard cock and smooth balls. Caleb then gets down on his knees as they make out and gets a chance to return the favor. He takes Ty's meat into his mouth and uses his hand in combination to get Ty's cock rock hard and throbbing. ...and Caleb's just getting started.He then gets Ty up and bends him over so he can check out that hot ass. He slides his finger along the crack before kneeling to take a closer look. He dives in tongue first and starts to lap away at that sweet, furry hole he intends on filling. Ty is rock hard as he gets that hole rimmed and Caleb can't seem to get enough of it. Caleb gets up into position and finally slides his rock hard cock inside. Ty groans in ecstasy as he finally gets that dick inside him. Caleb gets right to it as he pounds that ass deep. Caleb holds on to Ty as he mounts that tight ass wanting to get his cock as deep as possible. Caleb then moves the party south as he gets on the floor and has Ty sit on his dick. Ty just moans as he gets that hole hammered. Caleb slams that dick up into Ty repeatedly as Ty does his best to hold on. Caleb knows what he wants and there's no stopping him. Ty is rock hard and can't help but jack his dick as Caleb's cock slams against his prostate. That does the trick as Ty blows his wad all over Caleb's chest and abs while Caleb's still giving it to him. Caleb then straddles Ty and gives him some of the same as he jacks off all over his sweaty playmate. Seems these two had a lot more in common than a love for big cock after all. ",
  "models": [
    {
      "name": "Caleb Colton",
      "person_id": 28862
    },
    {
      "name": "Ty Tucker",
      "person_id": 28325
    }
  ],
  "release_date": "2012-06-13",
  "scene_id": 54988,
  "series": "Ice, Nice, Baby!",
  "tags": [],
  "title": "Ice, Nice, Baby!"
}