{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Two titans of cock shall meet this week as we bring together Alexander Greene and Valentin Petrov. Alexander is 20 and originally from New Jersey. This Jersey Boy's about to go international, as he takes on this sexy, 33 year old comrade of Russian descent. We asked these two what kind of music they both enjoy. Valentin likes classical music when he's in a bad mood but most of all he loves house music. Alexander agrees and says he's a house junkie. So it's house music all night long for these two. We then wondered if money was no object where they would take a vacation. Alexander would want to fly off to Dubai for a week or two while Valentin would just park that fine ass of his right here on our gorgeous beaches. We can't blame him since there can't be too many of those back in the Soviet Republic. Both of these boys are packing more than average and Alexander admits when the playing field is even it makes it that much hotter. Valentin agrees that bigger is better. We then wrapped it up by asking which they prefer between a handsome man vs. a hung one. Luckily they both ace that question and go with handsome. Fortunately today we have the perfect combination of hung and handsome. ...Shall we?nAlexander is complaining to Valentin that the construction upstairs kept him 'up' all night long and he didn't even have anyone to play with. Valentin notices the bulge in Alexander's pants and moves in to help. They start to make out a bit before Alexander stands to give Valentin better access to the heavy machinery. Valentin's pleasantly surprised as he hauls out Alexander's massive uncut meat. He opens wide and starts to suck on that cock as he runs his tongue along Alexander's fat shaft and balls. Alexander moans as he watches his big dick disappear into his bud's mouth as Valentin worships his dick. He holds Valentin's head still as he starts to pump that throat with as much of his knob as he can force down. Valentin then stands to make out some more as he drops his drawers and shows Alexander how they grow them in Russia. Valentin's cock is about as thick as Alexander's 8.5' cock but a bit longer at 9 rock solid inches. Alexander gets in position as he starts to return the favor. He sucks on Valentin's fat dick as Valentin strokes his hair and moans in appreciation. Alexander is rock hard as he swallows that dick and they take turns milking each other's cocks before Alexander's tongue finds its way to Valentin's hot hole. That does the trick as Valentin wants more than just his tongue.Alexander sits back on the chair and watches his fat dick disappear into Valentin's hot ass. Valentin starts to ride that meat like a pro as he bounces up and down on that rod. Alexander just sits back and lets Valentin do all the work as he revels in the sensation of that tight ass wrapped around his meat. Alexander reaches around and strokes Valentin's fat cock as he rides him faster and harder. Valentin's boner is bouncing like a trampoline as he bobs up and down. Alexander then gets Valentin to bend over and touch his toes as he slides his fat dick in for more. Valentin braces himself on his finger tips as he gets that ass railed hard. Alexander's smooth nuts slap away at that hole as he buries it to the hilt making Valentin grunt and groan with every deep thrust. Alexander then gets on his back on the floor as Valentin straddles his dick and goes back to riding him. Alexander helps bounce him on that meat as they both get closer and closer to climax. Alexander's thick cock is hitting Valentin's prostate just right and as Alexander pounds that dick up into him it sends him over the edge. He shoots his load all over Alexander's smooth chest. Alexander then jerks his own aching cock off as he plays with Valentin's shooting his huge load all over his cum covered abs.",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 28463
    },
    {
      "name": "Valentin Petrov",
      "person_id": 28033
    }
  ],
  "release_date": "2012-01-25",
  "scene_id": 54991,
  "series": "Construction D-Lay",
  "tags": [],
  "title": "Construction D-Lay, Scene #01"
}