{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Two favorite hotties are back this week and once unleashed produced some of the most explosive chemistry to date. The first of the two volatile ingredients is from Boston and goes by the name of Brenn Wyson. Brenn is 40 and even though he grins and says he's from Alabama; the twang (or lack thereof) gives this hung, smart ass away. Brenn considers himself as 'sexual'. It doesn't matter who he fucks as long as the chemistry is there. His costar Dean Tucker is 36 and hails from San Diego, CA. Sexy and furry, Dean can take a dickin' and keep on ticking. Dean is versatile; but prefers to bottom. After watching these two go at it there's no question he can bottom for the best of them including an aggressive, sexy boxer from Boston. It isn't every day you get your ass pounded the way Brenn likes to pound. We asked Brenn if everyone can take the kind of fucking he likes to give to which he replies, 'I don't ask 'Can you take it'-I just give it!' Damn. Add to that the fact this aggressive top is a dirty talker and you have the perfect recipe for a really hot time. They start to break the ice as they kiss and Brenn immediately takes Dean's hand and puts it on his crotch to get the action going. Dean works his cock through his jeans and they don't stay on for long. They get into a hot 69 as they get better acquainted. Brenn then stands and lets Dean have that dick. He grabs his hair as he fucks his mouth. 'Suck that fuckin' dick' he orders as Dean licks his balls and moves to his ass. Their chemistry is on fast forward as they begin to devour each other. Dean's tongue is up Brenn's ass as Brenn bends over to suck Dean's dick. They get up again and as Dean's swallowing more meat, Brenn bends forward and starts to roughly finger that ass. Dean's whimpers are muffled by Brenn's dick that's lodged in his throat as he gets his ass fingered. Brenn spins him around and gets him in position as they begin to dry hump with Dean grinding his hairy ass back onto Brenn's rock hard cock. He's horny for that dick and Brenn knows it. Brenn gets his tongue deep in Dean's ass, spit-lubing that sweet ass he'll soon fuck.Already in position, Brenn moved up and replaces his tongue with his rock hard cock. He immediately goes to work pounding Dean's hole. Dean's grunting and groaning as Brenn bounces his smooth balls up against his hairy hole. Brenn pulls him up into a doggie position and gets rough on Dean who gets totally into it, pounding the couch with his fists as he gets his asshole rammed deep. 'Tear that hole up!' Dean begs as Brenn obliges. Brenn flips him onto his side while still inside him as he begins to scissor fuck his hole. No matter what position Dean ends up in, he's getting that ass fucked hard and deep. Brenn isn't letting up as he drills that sweet ass giving him the fuck of a lifetime. Brenn fucks him deep for a while before having Dean sit on his dick. He rams it up into him while he starts to jerk Dean's hard cock. Dean sits back and gets the load fucked out of him as Brenn jerks him off still buried deep inside him. Once he's bust his nut, poor Dean gets bent over gets his sore hole jack-hammered by one horny Brenn who pulls out and busts his nut all over his latest conquest. Whew.",
  "models": [
    {
      "name": "Brenn Wyson",
      "person_id": 27922
    },
    {
      "name": "Dean Tucker",
      "person_id": 27923
    }
  ],
  "release_date": "2012-02-15",
  "scene_id": 54998,
  "series": "The DEEP End",
  "tags": [],
  "title": "The DEEP End"
}