{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Packin' more than the average hottie, Jay Rizzing is back this week to show everyone the top 10 reasons why our members love him. By 'reasons' we, of course, mean inches; and who better to appreciate such a monumental task than our good friend, Drake Jaden.  Drake is 27 and a local Florida boy. Jay is 24 and a product of the Big Apple. We asked these two what the last thing they watched on TV was and for Drake it was The Grinch with Jim Carry. Jay watched Family Guy which he can't get enough of. We then asked these two what the biggest dick they've ever seen. Drake's thickest would be his buddy Girth Brooks who is EBD alumni and as for the longest dick he's seen it would be a guy he hooked up with this past weekend. 'It was practically down to his knee' he says 'it was insane.' As far as Jay is concerned, his is the biggest dick he's ever seen and just another perk of packing a 10' pole. To wrap things up we asked these two porn lovers what kind of porn they watch to get themselves off. Drake likes to watch any type of porn that he could see himself doing in. For Jay, who used to love watching girls get gang banged now watches his own videos watching himself fuck onscreen... Sign us up!Jay is squeezing his thick dick through his pants as Drake goes in to investigate. He starts to grope at that dick as they make out. Jay then stands up and puts his crotch in Drake's face as Drake pulls down Jay's shorts and wraps his lips around that well hung dick. Jay moans as Drake takes it all the way to the hilt. Do no try this at home, boys; Drake is a trained professional. Drake hauls out his own fat dick and starts to beat off as he continues to ram that thick cock down his throat. Jay then sits back as Drake continues worshipping his fat dick remembering to pay attention to his smooth balls as well. Drake shoves that dick all the way down his throat and holds it down as long as he can before gagging on it and having to come up for air. Jay is in awe as he watches Drake take his dick better than most. Drake then stands and strips to give Jay the opportunity to give back. Jay grabs Drake's throbbing meat and sucks on it. He bobs his head up and down on that throbbing meat getting as much of it down his throat as he can. He jacks Drake's dick into his mouth as he sucks on his knob. Both of these studs are packing serious meat as they go back and forth pleasuring each other's boners.Jay then gets Drake on the floor as he kneels behind him and starts to rub his fat dick along that hot hole. Drake moans quickly turn to groans as Jay's dick starts to slide inside. 'You like that big fuckin' dick?' Jay taunts 'does that fill you up?' Drake grimaces as his ass gives in and takes that fat dick balls deep. Jay is soon tappin' that ass deep as Drake starts to back that ass up onto his meat wanting every inch of it inside him. Jay's thick meat slides in and out of that hungry hole with ease as Jay moans in ecstasy. Jay then gets Drake to lie on the couch so he could fuck that ass missionary. He grabs Drake's ankles as he goes right back to laying that pipe deep. Drake just begs for more as he gets that hole hammered by Jay's str8 dick. That mammoth meat is feeling damn good as it rams inside; but wait...there's more. Jay then lies on the floor and holds still as Drake sits on that cock. He bounces up and down on that dick fucking himself harder and harder until it sends him over the edge as he explodes all over Jay's smooth chest and abs. Jay is next as he jacks his own thick load all over his already cum-covered navel. Well, welcome back Mr. Rizzing. <evil grin>",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Jay Rizzing",
      "person_id": 28849
    }
  ],
  "release_date": "2012-02-01",
  "scene_id": 54994,
  "series": "Full Moon Rizzing",
  "tags": [],
  "title": "Full Moon Rizzing"
}