{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we get to revisit the epic classic 'Clash of the Titans'; though it won't be the one you're thinking of. We recommend a salad to help choke down all the meat this week's webisode is packing as we bring together a smorgasbord of Cuban cuisine. Mario Costa is back in the house packing over 9' of uncut goodness. Here to enjoy that carne Cubana is another Cuban morsel that never shows up empty handed, Chris Cox. Chris, like Mario, is a Miami native with a 9' Cuban cock to boot. This week's menu selection is definitely Atkins approved.  We asked these studs what they watch when they aren't watching porn. Vampire Diaries for Chris while Mario loves to watch 'Dancing with the Stars'. Both of these studs are Cuban and they somewhat agree that most Cuban men are blessed in that department. Hmm. Living in Miami you soon realize Cuban men talk a big game. lol We then wondered if there was anything that they do sexually that they could use some work on. 'I would say I'm pretty good at everything' Chris humbly answers trying not to laugh. We then turn to Mario who says, 'I would say the same'. Really!? Sit back, it seems we are about to have the 'perfect' shoot with 2 perfect Cubanitos. 'You know I've always wanted to work with you' Chris blushes 'I hear you have a really big dick.' Mario grins as he sits back and lets Chris figure that out. Chris gropes Mario's growing boner as Mario stands to give him better access. Chris pulls off Mario's jeans and frees his massive meat. He strokes it a bit before finally getting that dick in his mouth. Dreams really do cum true. He swirls his fist on Mario's python as he runs his tongue along the shaft as well as Mario's smooth nuts. Mario is naturally smooth so Chris' tongue has plenty of real estate to explore. Mario watches as Chris worships his meat. Mario then joins Chris on the floor where they make out some more. Mario strips Chris to give him some of the same. Chris moans as he gets that dick sucked by Mario who's still stroking his own meat. There's plenty of dick for everyone so they capitalize on that by getting into a steamy 69 where they can have all the meat they can savor. Having huge cocks makes 69ing SO much easier as they bob up and down on each other's fat dicks. All this dick suckin is getting Mario horny for more than just some head...Mario then bends Chris over and gets a taste of that smooth hole. He laps at that ass driving Chris crazy as he stroked his hard cock. Eating ass has Mario's own meat throbbing and he's about to do something about it.  Mario sits back as Chris sits on his huge dick. Chris was definitely looking forward to working with Mario; cuz his tight ass swallowed that mammoth dick like it was made for it. He starts to ride Mario's cock with ease as they kiss. Mario gets comfortable watching Chris bounce on his dick as Chris strokes his own huge cock. Chris can't get enough as he grinds his ass on that dick. Chris then twirls around and takes more dick in a reverse cowgirl. Chris leans back and braces himself on the couch as he continues to ride that hard dick hitting his spot just right. Mario has the best seat in the house as he watches Chris fuck himself silly. They transition onto their sides as Chris keeps riding that dick for all it's worth. Mario lays there, watching as Chris gets the fucking he's always wanted. Chris can't hold off anymore and shoots a huge load all over himself with Mario still inside him. Mario then sits back and quietly gives his dick the release it needed, shooting all over his smooth navel. -Perfect.",
  "models": [
    {
      "name": "Chris Cox",
      "person_id": 28468
    },
    {
      "name": "Mario Costa",
      "person_id": 28031
    }
  ],
  "release_date": "2012-02-08",
  "scene_id": 54995,
  "series": "Cock Monsters",
  "tags": [],
  "title": "Cock Monsters, Scene #01"
}