{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a rather large taste of San Francisco with Cole Streets in the house. Cole is 32, a San Francisco native and we're ExtraBigFans. Well, we why wouldn't we be? Everything about this stud is larger than life. At 6'5' and packing a thick 8' cock, there's plenty of Cole to go around. (-so, LINE UP!) He's in for a treat since we've brought back a hung local to welcome him on board. Drake Jaden is here and we know Cole will be in very good hands. Our sources tell us Drake will be in a lot more and soon. We asked these two when they were still naive and innocent (just go with it) what they wanted to be when they grew up. Cole's earliest memory was his dream to become a veterinarian. He loved the idea of being able to work with pets and make puppies better.  Awwww. Drake on the other hand really wanted to be a dentist. 'I remember always wanting to put my tool in people's mouths all day' he grins. Seems that dream didn't completely derail now did it?  We asked these two if there was anything they could be better at what would that be. Cole wouldn't mind being able to suck his own cock. Drake one ups him and says he'd like to be able to throw his legs behind his head and eat his own ass. -WINNING!  lolThey start to chat on the couch and it isn't long before they inch closer and closer. They start to kiss as their hands begin to roam. Drake is the first one out of his shorts and as he drops trou' his cock is jutting out of his briefs. Cole can't resist the urge to taste it as he starts to lick the knob that is boldly protruding over the waistband of his tight briefs. Cole pulls them down as he gets all of that thick cock in his mouth. Drake moans as Cole shows him what he can do. Drake loves the attention he's getting; but soon he wants to give back as well. He helps Cole get out of his clothes as he gets his first view of Cole's thick 8' cock. Drake goes down on his cock and swallows it whole. Cole watches in awe as Drake kneels between his legs and totally services his throbbing member. He licks all over his shaft making sure not to miss his smooth balls. Cole hadn't gotten enough of Drake; so he's back on his knees giving Drake time to fuck that mouth of his. Drake slowly shoves his dick as deep as he can into Cole's willing throat. Cole then decides he wants his tongue to explore even more. Drake gets on all four as Cole starts to eat out that outrageous ass of his. Drake grunts and groans as he gets his kitchen cleaned.Drake then suits up and sits back on the chair as Cole straddles him. He lowers that hot ass right onto Drake's rock hard cock. Once that hot ass gives way and he's got every inch of that dick inside him, Cole starts to ride that cock. Drake's balls are pulled up tight around the base as Cole grinds his hot ass hard around his dick. Drake soon starts to slam that cock up into Cole's ass wanting to fuck him back as well. 'Aww, that dick is so big!' groans Cole as he continues to take that dick deep. Drake then gets Cole on his back so he can fuck him good. He slides deep into Cole's ass and starts to pump his dick in and out faster and faster. He holds Cole's legs up as he rams that big dick inside. 'Take that big dick' he grunts as Cole asks him how much he likes that ass of his. Drake then flips Cole over and mounts him doggy. His balls slap at that ass as he drives his dick in faster and faster. 'I wanna feel that cum, man' Cole begs as he gets railed. Drake holds Cole by the waist as he repeatedly impales that hole. His balls pull tight as he pulls out and sprays Cole's smooth back with his hot load. Cole then stands and as Drake kneels before him shoots his huge load all over Drake's hairy pecs.",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Cole Streets",
      "person_id": 27983
    }
  ],
  "release_date": "2012-03-28",
  "scene_id": 55006,
  "tags": [],
  "title": "Meat Streets, Scene #02"
}