{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Handsome came to town this week as we welcome two handsome hotties, Boston Miles and his boyfriend Dylan Hauser. Boston is 35 years young and originally from Milford, DE and now resides in Atlanta where he met 28 year old Dylan. These two met through mutual girlfriends that wanted them to meet. Boston tried to do the polite thing and meet him for a couple minutes on a ride along taking his girlfriend from a restaurant to the bar. As soon as he picked up Dylan, he knew he was in trouble. Unable to ditch him as planned, Boston dropped them off and came back later. They spent the evening together and the next... and every weekend since. They've moved in and have been together 6 months now (-which is 3 reincarnations with the same mate in hetero terms). Dylan appreciates that Boston is direct and you always knows where he stands. Boston appreciates Dylan's sincerity and youthful energy. That energy recharges his own since he's been around the block and seen a lot of things that have made his outlook on things 'different'. Hmmm These two have an intense connection between them and it's not just physical it's also spiritual. That's nice; but about that 'physical' connection...As we start Dylan is giving his lover a private show as he models in an orange jock strap. Boston is rock hard as he hauls out his thick cock and starts to jack off. He can't resist that ass as he goes for it, diving in tongue first. Dylan moans as he gets that sweet ass tongue-fucked. Boston can't get enough as he spits on that ass and buries his face in it. Boston's thick 8' cock is rock hard and Boston wants to return the favor as he stands up to make out with Dylan. Dylan's cock is straining to get out of his jock and Boston does the honors before going down on him. Boston takes his time as he savors every inch of his beau's cock as Dylan fucks that hot mouth of his. Dylan appreciates the attention but he needs some dick too as he gets on his knees and gets busy worshipping Boston's thick fuck tool. He shoves that extra thick cock deep down his throat making Boston squirm with ecstasy. The chemistry between these two is off the charts and oral isn't going to cut it anymore as Dylan gets up and straddles Boston's fat cock. Boston holds his fat cock still as Dylan sits on it. His smooth ass gives in as he takes it all the way to the hilt. Once inside Dylan starts to ride that meat like a seasoned jockey. Boston holds that waist of his as he helps bounce him on his cock. 'Fuckin bounce on it, baby' Boston moans as Dylan obliges taking every inch of it deep inside him. They make out as they continue fucking and Boston can't seem to fuck him deep enough as he twirls Dylan around while still sitting on his dick into a reverse cowgirl so he can stroke Dylan's hard on as he fucks him. Boston leans back and just watches as Dylan grinds his hot ass some more. Doggy is next as Boston gets Dylan on his stomach. He slides his cock back inside and starts to slowly slide it in and out as they make out. Dylan flips over onto his back giving that ass up once again as Boston slides it home. He starts to fuck that ass harder and deeper as Dylan beats his meat. Boston's cock hits that sweet spot just right and it makes them both want to nut. Dylan jacks off and drenches Boston's face with blast after blast of thick cum. Boston then jacks his own thick load off all over his cum-drenched chest and abs.",
  "models": [
    {
      "name": "Boston Miles",
      "person_id": 28802
    },
    {
      "name": "Dylan Hauser",
      "person_id": 28852
    }
  ],
  "release_date": "2012-04-04",
  "scene_id": 55008,
  "tags": [],
  "title": "The Boston Marathon, Scene #02"
}