{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have a special episode today as we welcome back Girth Brooks. The Man, the Myth, the Cock is back to show us how it's done and welcome a new edition to the site, Tanner Wayne. For those of you who haven't had the pleasure, Girth's a sexy Bostonian that's 30 years young and packs an almost 9' cock that's about 7.5' in circumference. He credits his Polish descendents for giving him his High School nickname 'The Polish Hammer'. Tall and hunky Tanner is 24 years young and originally from Nebraska. We asked these studs what was the last thing they watched on TV. Girth caught some political spin on CNN. Tanner worked up his appetite watching The Food Network. Other than TV, Girth likes to either work out or fuck some dudes on his free time.  Tanner likes to work out on his spare time as well; and likes pushing himself and going on long runs to blow off steam. Everything seems to be falling into place as Tanner admits he's not a size queen; but he can be impressed. Well today, Girth is going to show Tanner just how all that big equipment works; the proper care for it...and then some.As we begin we have Girth standing as he gropes his growing crotch. His hands run under his tee as he feels his hairy pecs and abs. His shirt comes off and hits the couch as he continues his sexy strip tease. He undoes he belt and shoves his hand in his pants to accommodate his fat cock that by now is growing by the second. He pushes his jeans down and starts to tug on his cock through his boxers. The outline of his massive cock strains against the cotton longing to be released. (Enter Tanner: stage right) 'Get your fuckin hand on my cock' moans Girth as Tanner kneels and starts to grope his cock and rubs his face all over it. Tanner soon pulls that underwear down to get at the real deal; opens wide and takes that fucking dick. Girth moans as he gets that thick cock sucked on giving it the attention it craves. 'Lick my balls you dirty fuckin whore' Girth grunts as Tanner does as he's told lapping at his huge nut sack. Tanner takes that dong all the way down his throat driving Girth wild as he talks dirty to him and tells him exactly what to do on his throbbing meat. 'Stick your tongue out' Girth orders, slapping his cock on his tongue before turning around to give him something else he could lick, 'fuck yeah get that ass you dirty whore' Tanner eats that ass out shoving that tongue deep inside.Girth can't wait any longer and pulls Tanner to his feet before shoving him against the wall and ripping off his tee. He manhandles Tanner as Girth climbs on a chair and has Tanner get under him so he can keep licking his hole. Girth then sits on the floor and orders Tanner to drop his pants and sit on his fat dick. Tanner doesn't need to be told twice and is soon sliding onto that meaty pole. Tanner is rock hard as he starts to ride Girth as he bounces up and down on it. Girth groans as he helps bury his meat in that sweet. Girth then gets Tanner and bends him over as he slides inside him and takes that sweet ass doggy style. 'Take all that fuckin dick, filthy whore' Girth moans as his balls slap away at that tight ass he's stretchin' wide open. The hornier Girth gets the dirtier he talks as he slams that huge cock deep into Tanner's hole. Tanner is grunting as he does his best to accommodate that monster dong. Pile driver is next as Girth gets Tanner on the floor and hoists his legs up over his head giving up that sweet ass for more pounding. Girth slams inside and starts to do squats into that ass and it sends them both over the edge. Girth pulls out and sprays all over Tanner who joins him in covering his chest abs with thick load. As soon as Girth is done, he bounces leaving Tanner on the floor in puddle of cum saying those three little words ...'Girth, Call me!'",
  "models": [
    {
      "name": "Girth Brooks",
      "person_id": 28083
    },
    {
      "name": "Tanner Wayne",
      "person_id": 28784
    }
  ],
  "release_date": "2012-04-11",
  "scene_id": 55004,
  "series": "Waynes Worlds",
  "tags": [],
  "title": "Waynes Worlds, Scene #02"
}