{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Handsome devil Mason Coxx is in the house this week so you know you're in for a real treat as he helps us welcome 21yo Johnny Knoxx to the fold. Little does Johnny know that Mason has 9 really good reasons why he should stick around; but he'll take all 9 of those soon enough.  This is Johnny's debut shoot with us as well as the rest of the adult world and we can assure West Palm Beach's finest that he's in good hands. Mason is now 26 and originally from Connecticut. We started off by asking these studs what's a movie they never get tired of watching. 'Pretty Woman' is Mason's favorite while 'Avatar' never gets old for Johnny. Well Pandora may not be the easiest place to visit but we asked these two where they would love to visit if they could. Mason wants to go to Egypt and Johnny has his sights set on Australia. Foreign lands are full of foreigners so we wondered which they thought were the sexiest. Mason loves Parisian men while Johnny prefers Latin men so we figure his interests would again take him south where the Latinos are a plenty. Well, that's enough chit chat for now and we have those 9 really good reasons to get to... nMason and Johnny are kickin' it on the couch when Johnny holds up an extra large condom he found and asks Mason about it. 'That's mine' blushes Mason, 'you don't believe me?' Johnny grins and wants proof that he has what it takes to fill it as he reaches over and grabs Mason's growing cock. They start to make out and Mason is rock hard in seconds as Johnny proceeds to give that thick dick some room. Johnny then strips as Mason loses his pants and underwear. His cock is rock hard and ready for more as Johnny gets on his knees and takes that dick deep. He opens wide and starts to work that knob and shaft as Mason sits back and enjoys. Mason then stands to give Johnny all the access he needs to that dick and even helps out by fucking his mouth. 'Damn you got a big dick' Johnny coos before getting right back on Mason's thick cock.  Mason then gets Johnny to his feet to make out some more and also give him a chance to score some dick himself. Mason sits Johnny on the armrest and lands between his legs as he sucks and savors Johnny's rock hard cock. Both of these studs are rock hard and take their time sucking each other's cocks. Soon, sucking dick won't suffice...Mason then gets up and opens up that rubber Johnny found and slides it on his massive cock. Perfect fit just like the fit Johnny's tight ass is about to give him as Mason slowly slides inside. Mason wastes little time before bending Johnny over pounding away at that hot ass doggy style. Johnny just moans as he gets his ass stretched by that thick meat. Mason picks up the pace shoving that dick in faster and deeper as Johnny whimpers doing his best to accommodate all that dick. Careful what you wish for, Johnny. Mason then pulls out and sits back on the couch as Johnny sits on it for more. In a reverse cowgirl position Johnny can have as much dick as his hot little ass can take as he grinds up and down on it. He can't get enough of that dick and Mason's not about to complain as Johnny just bounces on his rock hard cock. Mason then gets Johnny on the floor and slides into him again as they lay on their sides. Mason holds Johnny's leg up as his balls slap away at that smooth hole. Johnny can't help but jack off as Mason's cock hits him in all the right spots. It quickly sends him over the edge as he unloads all over himself and the rug. Mason is next as he straddles Johnny's spent cock and busts a huge wad all over Johnny's face and chest.  Mason and Johnny are kickin' it on the couch when Johnny holds up an extra large condom he found and asks Mason about it. 'That's mine' blushes Mason, 'you don't believe me?' Johnny grins and wants proof that he has what it takes to fill it as he reaches over and grabs Mason's growing cock. They start to make out and Mason is rock hard in seconds as Johnny proceeds to give that thick dick some room. Johnny then strips as Mason loses his pants and underwear. His cock is rock hard and ready for more as Johnny gets on his knees and takes that dick deep. He opens wide and starts to work that knob and shaft as Mason sits back and enjoys. Mason then stands to give Johnny all the access he needs to that dick and even helps out by fucking his mouth. 'Damn you got a big dick' Johnny coos before getting right back on Mason's thick cock.  Mason then gets Johnny to his feet to make out some more and also give him a chance to score some dick himself. Mason sits Johnny on the armrest and lands between his legs as he sucks and savors Johnny's rock hard cock. Both of these studs are rock hard and take their time sucking each other's cocks. Soon, sucking dick won't suffice...Mason then gets up and opens up that rubber Johnny found and slides it on his massive cock. Perfect fit just like the fit Johnny's tight ass is about to give him as Mason slowly slides inside. Mason wastes little time before bending Johnny over pounding away at that hot ass doggy style. Johnny just moans as he gets his ass stretched by that thick meat. Mason picks up the pace shoving that dick in faster and deeper as Johnny whimpers doing his best to accommodate all that dick. Careful what you wish for, Johnny. Mason then pulls out and sits back on the couch as Johnny sits on it for more. In a reverse cowgirl position Johnny can have as much dick as his hot little ass can take as he grinds up and down on it. He can't get enough of that dick and Mason's not about to complain as Johnny just bounces on his rock hard cock. Mason then gets Johnny on the floor and slides into him again as they lay on their sides. Mason holds Johnny's leg up as his balls slap away at that smooth hole. Johnny can't help but jack off as Mason's cock hits him in all the right spots. It quickly sends him over the edge as he unloads all over himself and the rug. Mason is next as he straddles Johnny's spent cock and busts a huge wad all over Johnny's face and chest.",
  "models": [
    {
      "name": "Mason Coxx",
      "person_id": 28799
    },
    {
      "name": "Johnny Knoxx",
      "person_id": 28814
    }
  ],
  "release_date": "2012-03-07",
  "scene_id": 55001,
  "tags": [],
  "title": "School of Hard Knoxx, Scene #01"
}