{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have the hottest boys to show you this week as we welcome Hayden Richards and hung hottie Chase Austin. Chase is 20 years old and hails from the historic southern city originally named after King Charles of England, Charleston, SC. Just when you thought sweet grass baskets were the only things causing a commotion; we find Chase with over 8 more incredibly thick reasons to visit. Road trip anyone? Now Hayden is 22 years old and comes to us from the Mile High City of Denver, CO. Its location being a mile above sea level may have earned Denver its nickname; but it isn't anything we can relate to here on Florida's coast. We asked these studs, given front row seats, who they'd want to see perform. Hayden would want to see Janet Jackson; while Chase would love to see Kylie Minogue. Chase was blessed with more than the average boy in the cock department and once he started showering in gym class that became obvious. Hayden, who has some thick equipment of his own, admits that even though he doesn't have much experience with guys he's found he just loved to get his dick off regardless of who he gets to put it in to make that happen. Vote Richards/Austin 2012. Because behind every curious straight boy there should be a gay one holding a much larger...well, you know!Chase is kicking back and stroking his big dick to a mag when Hayden walks in on him. 'I knew you were gay, you've been checking me out' Hayden brags as he takes the gay mag away from Chase leaving his rock hard cock to speak for itself. 'You can't tell anyone', begs Chase as Hayden decides his silence will cost Chase some head. Chase has no other choice and starts to blow Hayden's rock hard cock. Hayden moans as he watches his dick disappear into his friend's mouth. 'You like that thick ass cock in your mouth?' he moans as he slides his dick in and out of Chase's mouth. Chase licks along the shaft and works his knob a bit before sucking it back down his throat. 'I want you to eat my ass' orders Hayden as he ups the ante. Chase isn't complaining as he shoves his tongue deep inside that hot ass. Hayden spreads his beefy ass wide to get Chase's tongue in as deep as possible. Chase knows just what he's doing as he tongue fucks that sweet ass as Hayden strokes his rock hard cock. Hayden then gets Chase on the chaise as he straddles his face for more head. Chase swallows every inch he's given as Hayden fucks his throat getting his cock rock hard. It seems it'll take more than just head...Hayden flips Chase over onto his stomach and starts to finger that smooth ass. He rams his finger inside, slapping that hot ass as Chase squirms. 'You ready for this dick?' he taunts as he goes in for a kiss. Hayden then sits back as Chase impales himself on his thick dick. Walking in on Chase is the best thing to happen to their friendship as Hayden starts to ram his dick even deeper into Chase's ass. Chase is bouncing on that meat hard as the sounds of balls slapping ass fills the room. Chase lets go of his dick and it twirls like a propeller as he rides that meat for all its worth. Hayden then grabs Chase by his pits and gets up still buried inside him and puts him down on all four on the chaise. Once he's in position he gets right back to pounding that ass. Hayden likes to be on top and we can see why as he owns that hot hole. Chase can't get enough as he begs Hayden for more cock. Hayden is taking that ass doggy style and slamming every inch of his meat deep inside. Missionary is next as he flips Chase over on his back. He slides his dick back in and start to slam that dick home. Missionary does the trick as it hits just the right spot sending Chase over the edge. Hayden pulls out at the same time and they both explode all over Chase's smooth abs and spent cock.",
  "models": [
    {
      "name": "Hayden Richards",
      "person_id": 28508
    },
    {
      "name": "Chase Austin",
      "person_id": 28848
    }
  ],
  "release_date": "2012-05-23",
  "scene_id": 55018,
  "tags": [],
  "title": "Thrill of the Chase, Scene #02"
}