{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have two new faces on ExtraBigDicks, Jake Masters and Dareian Blue. Jake is originally from Texas but now calls Fort Lauderdale home, having moved out here at the tender age of 18. Dareian is originally from Seattle and moved to Wisconsin and is now debating making the move to South Florida as well. We wondered if these studs wrote their own auto-biographies what would it be called and who would portray them in the movie version? 'The Man That Could Never Have Enough.' would be Jake's title and he'd want to play himself. If you want things done right... Dareian would call his book 'Wild Life...Along for the Ride' and starring any one who could relate. On the movie topic, we wondered what kind of movies they like to watch. Jake likes adventure, action and psychological thrillers. Dareian likes thrill rides so he loves horror, action movies and mind fucks. He also loves porn and can't seem to get enough of it. Well they can both agree on that one and neither can pin down what they prefer. There's just so much porn to watch. We agree so let's stop talking and start making more. Porn, that is.Dareian is on the couch in his undies as Jake walks in on him. He's startled and blushes as Jake apologizes for having startled him. 'You enjoying yourself?' Jake teases. Dareian smiles and assured him he will be now that he's there. Sounds like an invitation to us. They start to make out as Jake's clothes come off. Jake then stands up and hauls out his cock. Dareian is pleasantly surprised as he takes Jake's huge cock in his mouth. It grows fast as it gets the attention it craves. Dareian shoves it so deep down his throat he gags on it. Jake holds his head as he forces it even deeper. Dareian gags repeatedly but he's not giving up on pleasuring that mammoth dick. Jake just feeds him all the dick he wants and lies back so that Dareian can have better access to it. Dareian kneels and keeps milking that fat dick as Jake commends him on the good job he's doing. Jake then gets up and strips Dareian bending him over the chair. He slaps that furry ass before going in tongue first. He eats that hole out as Dareian just moans his approval. Jake switches it up using his tongue and his fingers as he teases that hole and gets it ready for more. nDareian gets on his back and braces himself as Jake suits up and starts to slide his big dick inside. On his back, we can better appreciate the sexy body hair that Dareian has to offer as Jake starts to slowly gain entry into that tight ass. Dareian's ass concedes and Jake is soon pounding that hairy hole with ease. Dareian jerks his cock as he gets bounced on Jake's as he picks up the pace. That tight ass feels amazing on that big dick of his and Jake switches it up to get even deeper inside him. He gets Dareian on all four and takes that ass doggy style. He pounds away at that ass as Dareian just takes every thrust he's given. 'Fuckin' ride that ass!' Dareian begs as Jake grabs hold of his tight waist and slams it in even harder. 'You're making me so fuckin' close' Jake grunts as he starts to jack hammer into that hot hole of his. Dareian bucks that hot ass back onto that dick wanting every inch inside him. As Jake feels that nut coming he pulls out and jacks off as he lays beside Dareian. His load explodes all over himself with such force it hits his face and neck. Dareian then jacks his own cock and while workin on his nut Jake kneels over him and unloads a second load all over Dareian's.",
  "models": [
    {
      "name": "Jake Masters",
      "person_id": 27989
    },
    {
      "name": "Dareian Blue",
      "person_id": 27990
    }
  ],
  "release_date": "2012-05-16",
  "scene_id": 55016,
  "tags": [],
  "title": "The Blue Job, Scene #02"
}