{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "P-Town's hottest representative is with us this week as we welcome back Brock Russell. Brock is now clean shaven and pumped. He is a personal trainer so he's used his powers for some delicious self improvement. Brock's been on several of our sites and today he's going to take a walk on the larger side of life. Today he will be 'treated' to something of a younger variety. Tommy Defendi, now 22, is the 'coque du jour'. Tommy admits he's been with older guys on occasion and he loves the fact that older guys know what they're doing. Tommy is sporting facial hair this time and not the clean-shaven jock look he usually treats the boys over at CircleJerkBoys.com to. The five o'clock shadow is working wonders for the ex-Florida boy. Tommy's career keeps him moving around and at 22 he's still relatively new to the 'gay' thing. He was exclusively a ladies man for his first 19 years. From the way Tommy's 9.5' cock was throbbing extra thick, we can tell that not only is the guy thing working for him but the older men seem to have that added a kick that makes his dick extra hard. As far as Brock's concerned we quote: 'Anytime, any place, anywhere-and I mean that!?  -Release the Brocken!!Brock sits on the couch as he begins to stroke his cock lookin' at his co-star Tommy Defendi. Anticipation! But, who could blame him as these two begin to make out exploring each others hard bodies as their tongues and hands begin to roam. Their shirts come off as they continue to kiss and tease each other. Tommy's shorts are next, exposing his thick dick straining against his tight briefs. Fortunately, they aren't confined for long as Brock dives in for a better taste of the situation. Tommy moans softly as Brock begins to work his meat all the way down to the hilt. His thick dick is rock hard in seconds as Brock worships every delicious inch. He knows he wants this bad boy as hard as possible so he can enjoy it. Brock then gets up and strips as he takes Tommy's briefs off as well. They sit back and begin to make out for a few before Tommy goes down to return the favor. Brock grins ear to ear as Tommy sucks on his cock. Tommy slowly savors Brock's boner as he engulfs his cock, swirling his tongue around Brock's knob and shaft. It isn't long before Brock pushes Tommy back for more of that thick dick. He sucks on that cock unable to get enough, getting him rock hard for what's to cum...They stand up as they kiss and compare cocks, playfully sword fighting for a few before Tommy turns Brock around. He bends him over before slapping his thick meat on Brock's bubble butt. He likes the ass he's been given and he's not about to let it get to waste. He slides inside that ass as Brock groans in ecstasy. 'You like that big dick?' Tommy teases as Brock moans his approval begging for more. Tommy then sits back and lets Brock ride his big dick. This position gives Brock more control and in no time he's bouncing up and down on Defendi like he's winning a derby. Tommy holds Brock's sweet ass in his hands as he watches Brock bounce that beautiful ass on his meat. Tommy then pushes him forward so that he can fuck him doggy style for a few. Tommy's heavy balls slap away at Brock's smooth ass as he gets his dick in deep. He then flips Brock over on his back, lifts his legs and slams back inside him in a missionary position. On his back, Brock can now jack his meat while Tommy pounds away at his ass. This ultimately does the trick sending Brock's load exploding all over his chiseled abs. As Brock nuts, Tommy has pulled out and lays back busting his own load all over his furry abs as well. Whew.",
  "models": [
    {
      "name": "Brock Russell",
      "person_id": 27911
    },
    {
      "name": "Tommy Defendi",
      "person_id": 28400
    }
  ],
  "release_date": "2012-05-02",
  "scene_id": 55013,
  "tags": [],
  "title": "Home on the James, Scene #01"
}