{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have Matthew Rush with us and he's here for his play date with CJ Madison. Matthew, who made his first ever web episode for our brother site MenOver30.com, is back and wanting more. Matthew is 37 and originally from a small 'burg' in Pennsylvania. He now calls Ft. Lauderdale home. Matthew has an impressive body as well as his body of work in film and print. This afternoon, we decided to pair Matthew up with another veteran of the industry who has as an impressive cock. Originally from New York City, CJ Madison now lives in Miami Beach. CJ and Matt both admit the first time they were recognized on the street was a bit odd. CJ had a guy in Starbucks that kinda leaned in while in line and said 'I'm a big fan'. It caught him off guard, but he found it flattering. Matthew's was a little different. He was standing at an ATM when some one kept yelling 'Matthew!' Matthew heard him yelling but he had no idea they were screaming at him. Hmm. They both agree that being recognized is a good thing and shows people enjoy what they do...but it also helps to remember your aliases (just in case).  These two don't waste any time before making out and groping each other. They peel off their tees as they stand in front of the other. CJ undoes Matthew's jeans as they get pushed down, taking CJ with them as he falls to his knees before Matt. Matt can only groan as CJ gives his cock a work out. He shoves his cock deep down his throat as he sucks every delicious inch Matt has to offer. Matthew then returns the favor as he too gets a mouthful of CJ's 9' Italian sausage. CJ wasn't done with Matthew's cock, and is soon back on his knees getting his fill of Rush's rod. CJ is stroking his cock as he sucks Matthew and his cock is rock hard. Matthews smooth everywhere and even keeps his crotch fur-free. CJ doesn't mind and continues worshiping his meat. Matthew sits back and spreads his massive thighs wide to let CJ get back to work as he continues licking and milking his cock with his hungry throat. CJ then directs Matt back onto his own uncut neat and watches as Matthew licks and sucks on his New York nine. He slaps Matthew's face and tongue with his fat cock as Matt sucks on his heavy balls. CJ then gets back to work on Matthew's cock and balls as he dives even further south to taste that sweet ass. CJ tongue fucks Matthew's beefy ass getting him rock hard and ready for more.Matthew sits still as he watches CJ sit on his cock in a reverse cowgirl position. His muscular ass is soon giving way to Matthew's thick meat. Once he's got every inch inside, CJ starts to ride as he bounces up and down on that dick. Matthew is moaning and groaning as CJ's tight ass bucks back against him, burying his cock deeper and deeper. Matt then starts to fuck up into CJ as he just holds still as Matthew fucks him silly. Matt then gets up a bit and starts fucking CJ in a doggy position. He's pounding his cock deep inside him as he grunts and talks dirty. 'Yeah Daddy' Matt grunts 'take that dick'. Matthews's thick cock is slamming deep inside him with ease as CJ takes the grudge fuck he's getting. 'Fuck that hole!' CJ begs as Matt continues to give his ass a pounding. He then gets him on all fours on the rug to continue tapping that ass. The chemistry between these two is sizzling as they continue their intense fuck session. CJ then gets on his back and has Matt fuck him missionary. This position does the trick, as he watches Matthew's face as he takes his ass added to Matthew's thick meat hitting him in all the right places. They lie back side by side as they jack themselves off to climax. Matt busts his nut as it coats his cock and balls while CJ uses a dildo to fuck a rather massive load out. Whew.",
  "models": [
    {
      "name": "CJ Madison",
      "person_id": 27954
    },
    {
      "name": "Matthew  Rush",
      "person_id": 28856
    }
  ],
  "release_date": "2012-04-25",
  "scene_id": 55012,
  "tags": [],
  "title": "Madison Cuntry, Scene #02"
}