{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Fur is definitely in fashion and it's nice to know 'manly' is back. Fortunately both of our studs this week are sporting their fur coats au natural. We definitely have an appreciation for two furry, hung men here on ExtraBigDicks.com and this week we have two of the sexiest. The first is a Utah born native who relocated to Fort Lauderdale. He's hoping to find a greater peace of mind here in Florida which was harder to come by in California where he was living.  Fortunately for Ft. Lauderdale, this stud brought his own greater 'piece' with him. (-Sound the Size Queen Alarm!) We are talking about, none other than, Josh West. Josh, the man, the myth, the legend made his debut right here on our site. The second stud this week is definitely excited to be here. Hailing from Peru, this Latin stud has been on our sites a time or two and has amassed his own fan base. Jesse Balboa is here and more than excited to have a go at everything Josh. We have a feeling Jessie heard the alarm and came a'runnin'. Jessie has lived in many places; but in the US he's been in Florida the longest. When asked why, he said he loves Florida mostly for the weather, the beaches and Josh West-of course. ...Shameless. lolThese two are all over each other before we even begin and it only gets better from there. Josh and Jessie begin making out as Jessie's hand immediately makes a move to Josh's growing cock. He peels off Josh's tee and starts to explore his firm abs and hairy chest. Josh returns the favor seconds before these two reposition themselves as Jessie lies on top of Josh and begins to explore again only this time he's using his tongue. He licks Josh's chest and nips and soon Josh is flipping him over so that he too can explore. He licks and sucks along Jessie's furry frame sending one very horny Jessie into orbit. Josh makes his move as he undoes Jessie's jeans and strips him. Jessie's cock is growing by the second as josh takes it into his mouth.  Jessie pinches his nips as he looks down and watches Josh work on his meat.  Jessie's waited a long time for this; but the best is yet to come. Jessie then kneels in front of Josh who happily begins to fuck his throat. Josh's soda-can 9' cock is stretching Jessie's hungry mouth open as he does his best to accommodate the massive oral invasion.Josh loves the oral he's getting but he needs more. He knows it's going to require some work so he puts Jessie on all four before diving into his beefy ass tongue first. Jessie can only moan as Josh eats that ass out. He's been rendered helpless as Josh's tongue swirls around his smooth, hungry hole. Josh then begins to finger that ass getting tit ready for the fucking of a lifetime. When he's ready, Josh gets up and feeds Jessie his dick again so Jessie can get it rock hard for his ass. Josh then gets into position and playfully slaps his thick meat on Jessie's ass before sliding his thick cock inside. Jessie's ass is hungry and more than ready for that meat and Josh is soon slamming deep inside him. Jessie grimaces as he takes that thick dick. 'Pound that ass' he groans as Josh obliges. Josh then moves him onto a chair where he once again slides his meat in for more. All Jessie can do is hold on and beg for more cock. Josh is more than happy to oblige as he bounces Jessie's ass up and down to the hilt. Both of these masculine studs are grunting and glistening in sweat as they kick it into high gear. Josh begins to pound Jessie as he buries his cock faster and harder. Jessie straddles Josh's cock before impaling himself for more. Jessie rides that thick cock til he can't hold back any longer as they both begin to beat off to completion. Josh and Jessie both explode their loads all over one extremely satisfied Jessie.",
  "models": [
    {
      "name": "Jessie Balboa",
      "person_id": 27930
    },
    {
      "name": "Josh West",
      "person_id": 27931
    }
  ],
  "release_date": "2012-03-21",
  "scene_id": 55010,
  "series": "West Ida-hoe",
  "tags": [],
  "title": "West Ida-hoe"
}