{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Caleb Colton makes his debut with us this week and he's a long way from Nashville, TN. Caleb is 26 years young and looking forward to his birthday next month. This sexy Gemini started watching porn at an early age and knew it was something he'd want to look into. Caleb is packing more than many and he didn't even know it. When Caleb first started having sex with girls he shied away from it since he thought he had a small one. He lost his virginity at 17 to a girl then started getting head from guys at 19. By the time he was 25, head wasn't enough and he started fucking guys. After fucking a couple guys he got to compare equipment and came to the realization that he wasn't small at all. We then asked Caleb if he could win a gold medal in a sexual category what it would be. 'Fucking' he grins. Well seems like he's come a long way since he was 25. His hottest encounter to date was walking home with a date and ended up sneaking into someone's backyard where he got his big dick sucked on and got to do some backyard exploration of his own as he got to bury his meat right then and there.Caleb comes in after a long flight and had to deal with lost baggage and the usual airport hassle. He kicks off his shoes and reaches for the only package that matters-his own. He grabs at his growing cock through his shorts as it grows by the second. He stands and drops his shorts getting more comfortable after the long ordeal. He bends over in his jock strap as he shows off his sweet ass. His smooth ass is tempting as he lubes up that hole for some more fun. He tugs at his cock as his fingers start to tease and explore his hot ass. He finally decides to give his meat the breathing room it deserves and slides his hand into his jock strap. His cock throbs at his touch and soon the jock strap is pulled aside as he gets that thick dick in his palm. A little spit goes a long way as he lubes up his hard cock. Caleb is naturally smooth and has some pretty impressive ink adorning his chest and biceps. He's rock hard by now and freely stroking his hard cock as his low hanging nut sacks enjoy the fresh air. Caleb is giving his dick the attention it deserves and decides to lay back and get the party started. He strokes his rigid dick as he goes back to that ass for more fun. He takes out a fat dildo and lubes it up. Once it's nice and ready he does the same to his hot hole as he gets it ready to take some dick. He kneels on the bed and aims that dildo north as he impales himself on it. His hot ass concedes as he moans and groans. The chaise is perfect for this since he can bounce up and down on it delivering more dick with every thrust. He loves that dildo inside him and pushes it as far as he can. He then switches to a much longer double header dildo and bends over. He shoves that long dildo into his hole and fucks himself with it, ramming it in and out hitting all the right spots. This toy won't bring him home so he gets right back on that fat dildo and goes back to sitting on the first one. He puts it on the floor as he starts to shove it in and out of his hungry ass. That does the trick and soon Caleb is shooting his massive load all over the rug before him. We're definitely glad he didn't lose this package in transit. <evil grin>",
  "models": [
    {
      "name": "Caleb Colton",
      "person_id": 28862
    }
  ],
  "release_date": "2012-05-30",
  "scene_id": 55020,
  "series": "Boy, Toy, Joy",
  "tags": [],
  "title": "Boy, Toy, Joy"
}