{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Back in the house this afternoon is a Windy City Charmer we haven't seen in a while, Mr. Shane Frost. It's been a while since we've seen this 29 year old Chicagoan. Shane's in luck because we brought out the big guns to help celebrate his return. By 'Big Guns' we of course mean Mario Costa. Mario is a local Cuban commodity that needs no introduction; neither does his extra thick uncut 9' dick. These two crazies have hit it off famously so we're in for one hell of an afternoon. Recent events dictate that President Obama came out...for gay marriage! (No pun intended) Both of them agree it was unexpected; but admire him for having the courage to do that for all the right reasons. The 2012 election is around the corner and neither of them is excited about it, since once it's done it all just starts back up again. Shane was excited to hear he was working with Mario and he's looking forward to getting some of that Cuban Anaconda Mario's packin'. Mario admits many have thought they could take his dick without a problem and haven't always emerged victorious. Fortunately our money's on Chicago. For a City that invented the (Extra Big) ferris wheel and the giant game of soft ball-we're sure it can handle an Extra Big...Cock! That's what they call 'em in the Midwest-COCK! Say it. You know you want to!Shane is dressed and ready to go for a weekend trip and kisses Mario goodbye. He grabs his gear and is headed out the door when Mario stops him. 'Aren't you forgetting something?' he asks as he starts to kiss Shane. Shane's not going anywhere but down as he lands on his knees before Mario's monster cock. Mario moans as he watches Shane swallow every inch of that uncut cock. Shane takes his time worshipping Mario's cock before Mario decides to make it even easier. He sits on the edge of the chaise and has Shane lie beneath him. He spreads his legs as his massive cock just dangles before Shane's mouth. Shane can't help but suckle on that Cuban cock like a hungry calf as Mario gets to enjoy the view. Mario's cock is rock hard as it gets the attention its needed all morning. Mario then gets into a hot 69 position as he returns the favor and goes to town on Shane's Midwestern meat. They are both busy taking as much cock as they like. Shane opens wide as Mario slides his thick cock in and out as he bobs up and down on Shane's. Mario then wants more that just that cock. He gets Shane on his back and spreads his smooth ass open and finds what he's looking for.Shane can only writhe in ecstasy as Mario slides his gifted tongue inside. He laps at that smooth hole and cock as he rims Shane's hot ass. He buries his face into that hot ass as he tongue fucks Shane as deep as possible. Once that hole is horny for more, Mario gets into position and starts to shove his fat cock in. Shane's tight ass eventually gives in and lets that cock inside. Mario wastes little time before pumping his meat in and out of that hot hole. Shane is rock hard and jacking as he gets that ass filled. Shane loves every minute of it as he gets that ass plugged. Mario then gets Shane on all four so he can tap that ass doggy style. Mario shoves that meat back in as he pounds that hole. The cam gets up close as we watch Shane's ass getting stretched wide open as Mario mounts that ass. Mario then brings it home as he lays Shane on his side and Mario slides in behind him. He repeatedly slams that dick into Shane as they make out.  Shane begs him to fuck him deeper and when he does it sends Mario over the edge. He pulls out and unloads all over Shane who's jacking his own cock off. Shane isn't far behind and shoots a massive load all over his cum-drenched abs and cock. ",
  "models": [
    {
      "name": "Mario Costa",
      "person_id": 28031
    },
    {
      "name": "Shane Frost",
      "person_id": 28457
    }
  ],
  "release_date": "2012-06-20",
  "scene_id": 55024,
  "series": "Aren't You Forgetting Something?",
  "tags": [],
  "title": "Aren't You Forgetting Something?"
}