{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We have a new face with us on ExtraBigDicks that's a reminder of the benefits of living so close to the Caribbean, Steven Verano. Steven is 23 years old and is from Cuba. 'Big Dick has to be from Cuba!' he boasts. Cuban men are known for big dicks and bigger talk. Humility is optional. Lol Steven's big cock is a little different than most since he has three pearls embedded along the top of his shaft. Historically Cubans get these pearls embedded just beneath the skin while serving time. When they get their cocks back into some pussy those pearls stimulate the girl's clit when they fuck driving them wild. We can only assume some of those pearls have a similar effect on the willing in Cellblock D. Steven is very sexual and admits to jerking off more than once a day to keep his dick happy. When it comes to women he prefers Cuban women over American girls. 'Cubanas' have that big booty he loves. He loves blond girls with average sized tits. The ass is always more important than the hair or the tits. You need the cushion for the pushin' and Steven says only a couple of girls have been afraid to take that dick. We're sure that with the dick he's packin and the game he's spinning; he gets plenty of...well, you know. Steven comes home and finds a box waiting for him. A friend decided to do some spring cleaning and left him some X-rated goodies to enjoy. Steven wastes little time before popping in a DVD and stripping his clothes off. His cock is growing with anticipation as he takes off his tee shirt and tight jeans. Steven's body is beefy and defined and naturally smooth. You can tell he works on that body of his and it's paying off. He stands in his boxers playing with his boner through his briefs talking dirty to the sluts on screen. That dick of his needs more than a tug as he pulls down his boxers to set his ping?n free. His fat uncut cock comes alive as he spits on his knob and starts to give that thick dick the attention it deserves. He keeps his cock as smooth as the rest of him and his three pearls coast along his shaft as he slowly slides that heavy foreskin back and forth, He uses both hands to make a tight tunnel to pump his fat cock in and out of as he watches pussy getting packed on screen. Steven gets into the video and starts slapping his own beefy ass showing the girl on screen how he'd slap her ass. He then sits back on the chaise to keep taking care of his cock. His balls are slowly pulling up tighter around the base of his dick. He spreads those thick thighs wide open as he settles in. He puts his arm behind his head and we realize even his underarms are hairless. Lick all you want boys no fur ball to worry about. He strokes that dick faster as his balls bounce up and down. He licks those full lips as he tells her exactly what he wants to do to her in 'Spanglish' (Miami's bicultural tongue made up of phrases using both languages to get your point across) Steven's getting closer to climax as his muscles begin to tense. His breathing gets deeper as his hand becomes a blur on his fat dick. 'Que rico!' he groans as he works that dick harder. He then looks over and realizes there are skin mags as well and gets one out to help get him off. He flips through one and settles on a pic of a hot blonde. He puts it down on the chair and rubs his dick all over her pic. That does the trick as he finally unloads his thick leche all over it.",
  "models": [
    {
      "name": "Steven Verano",
      "person_id": 28865
    }
  ],
  "release_date": "2012-07-11",
  "scene_id": 55029,
  "series": "The Cuban Missle Crisis",
  "tags": [],
  "title": "The Cuban Missle Crisis, Scene #01"
}