{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "First time for everything they say, and today is Aiden Tripp's first time with us here at ExtraBigDicks. He is 24 years old and originally from Orlando, FL. Aiden's in college these days working on his degree and 'trying' to stay out of trouble. We wondered once he makes it big what kind of car he'd want to treat himself to. Well, Aiden would want to go back to the future in his very own Delorean. Aiden is packing a lot more than the average but didn't realize he was much different than anyone else until he was about 20. There've been a few girls that have told him it's nice but 'No Way' <Amateurs> Aiden measures in at a little over 8' and he admits he has certain benefits that come with having a big dick. He can't say he's ever had the urge to dabble in the man-to-man end of the wading pool, but he's all about people doing what ever works for them. He's sticking to what he does best-pussy. Having a big dick, for example, also lets him please women the way he likes to, like after he's pleased a girl totally by fucking her like 5 times in one night.  Some girls have all the luck, but for now we got 'ALL' the dick we need...right here! Aiden walks in and finds a stack of DVDs. He tosses out the gay and bi ones and settles on one with hot girls with loads all over them. He sits back and gets comfortable as his dick gets bigger. He peels off his tee to reveal a sweet smooth upper body. His pecs are nicely defined and draped by his muscular shoulders and biceps. He walks over and puts the disc in as we get our first glimpse at that hot ass. His shorts hit the floor as he starts to stroke that dick staring at all the pussy on screen. His body frame is well proportioned and naturally smooth. His quads are solid and hold up his delicious frame. His cock is another story altogether. This Orlando boy is packing. His cock is rock hard as he uses both hands to fist his fat 8' cock. 'I wanna cum inside you so bad' he groans as he stares at all the hot whore action on the screen. The camera then pans round back and we get a better view of his amazing ass. It's smooth, round, has a sexy board short tan line. It's basically the kind of str8 boy ass you wanna shove your tongue inside-if you're into that kind of thing. <Twiddling thumbs>Aiden is transfixed with the action on screen as he double-fists his fat dick. He keeps his pubes natural but tidy which is a nice change of pace from all those boys who feel the need to shave everything clean off.  Aiden then sits back on the floor and spreads those thick thighs to work on that thick dick. 'I wanna fuck you so bad and cum inside you, you dirty little whore' he moans as he strokes that throbbing dick. Any takers? (...you know who you are!) Aiden then decides to show off that ass we can't have as he bends over and starts to dry hump the chaise leaving his milky ass and furry hole up in the air for us to dream about. He then gets up on his knees and tugs on that cock still showing off that hairy hole. <Apply all-u-can-eat bibs now> All this teasing has his fat dick ready to blow. He gets on his knees and jacks that thick dick for all its worth. 'Oh I'm cummin' he groans as he works his aching cock focusing all his attention on his knob. He explodes, sending jet after jet of hot cum flying everywhere. The first one splatters all over the chaise beneath him while the second shoots so far it clears the chaise altogether. The rest of his huge wad soaks the chaise as he empties the rest of his nut one hefty stream of batter after the other...lucky chaise! <evil grin>",
  "models": [
    {
      "name": "Aiden Tripp",
      "person_id": 28863
    }
  ],
  "release_date": "2012-06-27",
  "scene_id": 55025,
  "series": "All Tripped Up",
  "tags": [],
  "title": "All Tripped Up"
}