{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a special surprise for you and we're sure you're gonna love seeing this native Chicago boy in action again. Soon to be 23, Tommy Defendi is back and looking hotter than ever. Tommy has been under exclusive contract on the West Coast for almost 2 years now...but not anymore. Well as lucky as we are to have him back in the 305, his costar Marxel Rios is even luckier. Marxel is a local hottie having been born and raised in Ft. Lauderdale. Marxel is 27 and he's taken a proper pounding here before; so we're confident we have the right man for the job. Marxel definitely agrees that bigger is always better. Tommy enjoys both sides of the table and admits his motto is 'If it's warm and wet I'll stick my dick in it'. We need more boys like Tommy. We then asked what the hottest sex they've had is that gets them off just by thinking about it. Marxel admits he and his partner have hot sex all the time from road head to impromptu bathroom sex at clubs. For Tommy his 'go to' scene is a 3 way with a swinger couple in NYC. He got to fuck the hot wife then gave that ass up to the hung hubby whose dick was so fat he'd never had a guy willing to bottom for him or had yet to find a guy able to deep throat him.(...amateurs!) Tommy makes it home and gets out of his clothes to take a shower. It's hot out there and he needs to cool off. Little does he know things are about to get even hotter. He stands under the showerhead as he gets all wet. When he goes to lather up the soap is missing so he calls for his roomie to bring him some soap. Marxel walks in with the soap in one hand and a boner in his pocket. 'Looks like you brought me more than just the soap' Tommy grins as he reaches for Marxel's cock. 'Mind if I join you?' Marxel announces as he strips down and steps in. They start to make out a bit before Marxel heads south to sample the goods. He opens wide and takes Tommy's growing meat in this mouth. Tommy moans as he starts to fuck Marxel's face. Tommy's fat cock is rock hard as Marxel takes as much of it as he can down his throat. Marxel then stands up and tells Tommy he has something for him to taste too as he turns around and offers up that smooth ass. You don't need to ask Tommy twice as he drops to his knees to shove his tongue up inside that ass he plans on fucking. Marxel moans as he gets that hot hole tongue-fucked deep as Tommy goes to town on that ass. But wait, there's more...They towel off and take the party back into the bedroom. They start making out as Tommy sits Marxel down so he can return the favor and give that cock some TLC. He starts to swallow Marxel's cock as he tugs on his own boner. His fingers start to explore that tight ass as Tommy keeps sucking on that dick. Tommy is getting that ass hungry for more than just his finger and Marxel is begging for just that soon enough. Marxel puts one leg up on the chair as Tommy suits up and slides his monster dick up inside that ass. Marxel grimaces as Tommy starts to fuck that ass. Marxel's ass is soon taking that dick ball deep as Tommy picks up the pace and taps that ass. Tommy fucks that ass doggy style as Marxel just groans for more. Tommy then lies back and has Marxel sit on that dick. He straddles that big dick and takes it in a reverse cowgirl. We get to watch Tommy's cock disappearing into that hot hole as Marxel fucks himself silly on it. He bounces that hot ass up and down wanting every inch inside. Missionary is next in a pile driver position as Tommy drives that meat home-literally. This one does the trick and soon they are both shooting their huge loads all over one lucky Marxel Rios. ...Time for another shower.",
  "models": [
    {
      "name": "Marxel Rios",
      "person_id": 28050
    },
    {
      "name": "Tommy Defendi",
      "person_id": 28400
    }
  ],
  "release_date": "2012-07-04",
  "scene_id": 55027,
  "series": "Where's the Soap?",
  "tags": [],
  "title": "Where's the Soap?"
}