{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Van Wilder is back on ExtraBigDicks and we have our favorite Puerto Rican Ginger in the house to help handle all things Wilder. For those of you unfamiliar with Steven, he's now 32 years old and originally from San Juan. As a birthday gift, his parents took him sky diving for the first time and Steven enjoyed it so much he wants to make a hobby out of it. 'My parents told me that this would be a present I'd never forget', Steven beams, '...and they were right!' Van is 19 and a local commodity from right here in the 305. We wondered where Van would want to celebrate his big 21 when it rolls around if he could celebrate it with anyone. Van would want to go to Vegas and if he could party with anyone, it would have to be Charlie Sheen. 'He parties hard, so I want to see how hard he can party and see if I can live up to his level' Lets hope Van has a good bail bondsman on speed dial. We then wrapped it up by asking them what their wildest sexual adventure has been. Van had sex with his girlfriend on the roof of their old elementary school. Well this one goes to Steven who says 'A bathroom in Church.' We are not going there... lolVan is lying back on the couch flipping through a porn mag when Steven comes in and decides to take matters into his own hands. 'You won't need this anymore' he says as he takes the magazine out of Van's hands and grabs Van's boner with the other. What other way is there to spend a stormy day stuck indoors? The rain starts to come down just as Steven follows suit opening wide and going down on Van's huge cock. Van grabs Steven's head as he forcefully fucks his throat. Steven swallows every inch as Van enjoys the attention on his meat. Van can't help but buck that dick up into Steven's mouth wanting to get it in as deep as he can. He lies back and just watches as his pussy loving pole gets worshipped by Steven who is ablaze slobbering all over that dick unable to get enough of it. Steven pulls Van's foreskin to the tip, licking underneath it as Van moans and groans making him hornier by the second. Van then gets Steven in the chair before climbing on top of him so he can shove that dick deeper down his throat. Steven chokes and gags on it as Van fucks his face.Van needs more than a hot mouth at this point, so he suits up and watches as Steven sits on his thick dick. Steven's smooth ass slowly gives way as that cock starts to make its path inside. Van isn't one to wait and as soon as he has a few inches inside him he starts to slam that dick up into Steven. Steven's a trooper and not about to give up as he grunts and impales himself on that fat dick. Van then holds Steven still as he slams that cock deep him. Steven winces and groans as Van just pumps his ass. He takes Steven up over the chaise before bending him over and slamming back in. Steven is taking it like a man as Van punishes that hole with his massive dick. He grabs that ass and just power fucks into Steven as he slaps that ass over and over. Steven then gets on his back as Van fucks him missionary. Van's fat dick slides back inside with ease as Steven begs for more. Not one to disappoint, Van picks up the pace as he nails that ass. Steven can't hold back and explodes all over himself as Van fucks him. Van then pulls out and brings the party North as he strokes his monster cock inches from Steven's face as he gives him a belated Birthday Facial. Awww, how fuckin' thoughtful.",
  "models": [
    {
      "name": "Steven Ponce",
      "person_id": 27969
    },
    {
      "name": "Van Wilder",
      "person_id": 28816
    }
  ],
  "release_date": "2012-08-08",
  "scene_id": 55037,
  "series": "Van-tastic",
  "tags": [],
  "title": "Van-tastic, Scene #01"
}