{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Fort Lauderdale's responsible for the hottie we have this week. John Mac is in the house and this sexy 22 year old loves to spend his free time bowling, jet skiing, meeting beautiful women and getting his drink on at the club. On a typical Saturday night he likes to call his boys and hit Miami Beach, cruise around and see what clubs are going off. He's not picky when it comes to women as long as they're beautiful. They can be black, Italian, Brazilian or Latina as long as they got that booty rockin', Big Mac will come a'knockin'. He started early losing his cherry at the tender age of 12 and hasn't stopped making moves on the ladies ever since. When he has a special lady in his crosshairs he likes to take his time and massage her, give her a nice glass of wine and set the mood. He has to get them relaxed if they intend on taking all the meat he's brought to the buffet. Some women just aren't up for taking an extra big dick. Well sometimes you have to work with what you get...amateurs! lol Well, since there aren't any ladies around 'today' (or any other day) John has agreed to show off his big ol' dick and let us in on what we're missing...John is sitting back flipping through some porn mags as his pants seem to fit a bit tighter. He grabs his growing cock through his jeans as he starts to tug on it.  He knows it's going to need room to grow so he stands up and takes off some unnecessary layers. By 'unnecessary' we mean all of them as his tee, jeans and boxers all make cozy with the floor. His cock is about 8.5' and uncut and ready for some TLC. We can see why some women just say no. Heavy machinery shouldn't be worked on by just anyone. It takes a big dick aficionado to truly take what John's got to offer. He slowly jacks his meat as his foreskin glides over his throbbing knob. It isn't long before his cock is glistening as his precum coats the head of his fat dick. His balls are smooth just like the rest of him seeing as John trims his pubes way down to the skin. He's naturally lean and defined and at 5'10 is packing a pretty big package. Line forms to the left, boys.John jacks his meat using both hands as he takes his time servicing his large rod. He then turns around to show off his ass. He has a big booty butt that's just round and all sorts of perky. He grabs at his cheeks and bends over a bit wanting to tease us with the possibilities yet knows that sweet ass is way off limit. He then gets back to business and kneels at the chaise with his favorite piece of pussy spread out before him. He jacks off looking at all the pictures of a big booty Latina getting her snatch stretched wide. His cock is hard as a rock as he beats off fantasizing that he's the one inside her as he gets closer and closer to climax. He tugs on his smooth balls with one hand as he picks up the pace with the other. He focuses his stroking on the head of his dick and that does the trick. John starts to moan and groan as he passes the point of no return. His cock explodes sending his thick nut all over the centerfold, whitewashing that hot girl with his creamy load. One Adult Skin mag, slightly soiled, (pages may stick together), now available at the gift shop.",
  "models": [
    {
      "name": "John Mac",
      "person_id": 28866
    }
  ],
  "release_date": "2012-07-25",
  "scene_id": 55034,
  "series": "Big Mac",
  "tags": [],
  "title": "Big Mac, Scene #02"
}