{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have two of our favorites that haven't had a chance to work together. Well once East Coast meets West, we have a feeling that having this much dick in a room won't be a bad thing. All the way from the West Coast, from the city that brought us the fortune cookie and denim jeans, Cole Streets is in the house. For those of you unfamiliar with this taller than usual drink of water, 6'5' Cole is 33 and lives in the City by the Bay, San Francisco. Cole's partner hasn't been in the industry as long but his fan base of big cock aficionados is, shall we say, growing. Chris Cox is here representin' the 305. Once you've seen 26 year old Chris out of his clothes, it's gonna be hard to forget him or that thick 9' Cuban cock he's packin. Not that any of you are size queens, but we're sure you can be impressed. We asked these studs which country has the hottest men. They both agree on Brazil. We followed up that question with which country boasts the biggest cocks. Cole blushes, 'Wherever this ones from', as he points in Chris' direction. Cuba wins the big pinga competition. All this talk about big dicks has Cole restless; so it's best we stop the small talk and bring out the big guns. Chris is filling out his model application when Cole comes in and introduces himself and starts to fill out his own. Cole asks Chris which site he's shooting for and once he hears its EBD he gets curious about the equipment he's packin. 'So what constitutes an Extra Big Dick?' Cole grins as Chris leans back and shows off his growing bulge. Well Cole wasn't asking for a proper invitation-but that'll do. He grabs Chris' hard cock as he goes in for the kiss. They start to make out as Cole fumbles with Chris' pants wanting to get at that dick. He opens wide and deep throats as much of that dick as he can as Chris watches. Chris' cock is rock hard in no time as Cole chokes on it getting it nice and wet. He savors every inch of that Cuban anaconda getting it as hard as possible before getting up to give Chris something to chew on. Chris gets right to it as he swallows every inch of Cole's meat. 'It's not as big as yours, but it'll do, right?' Cole grins as Chris gets that clean-shaven face fucked deep. They take turns working on each others thick cocks til Cole's tongue discovers Chris' hot ass. He gets to work eating that hot ass out getting it nice and wet...and ready?Chris is moaning as that tongue gets replaced by Cole's hard cock. He slides that thick dick deep into Chris as Chris jacks his own. 'Fuck that ass' Chris orders as Cole starts to pick up the pace. Cole's smooth ass bounces in and out of that hot hole as he pounds away. 'I love a big dick bottom' he grins as he bounces Chris off his dick. What comes around goes around and now it's Chris' turn. He suits up and watches as Cole sits on his fat cock. Cole eases down on that pole as it stretches that chute wide. Chris immediately starts to slam his fat cock up into Cole. Cole grunts and moans as he begs Chris to fuck him harder. Cole can't get enough of that thick cock as he starts to ride that dick harder. Chris' fat dick is slamming into his prostate and he knows it's only a matter of time before that makes him cum. Cole jacks off faster as he announces he's gonna cum. Chris pounds that hole harder making Cole shoot all over himself. Chris then gets up and blows his hot batch all over Cole's face and tongue. Cole's face is dripping in cum as he grabs Chris' throbbing cock, aims it at his mouth and sucks the rest of that leche out. Chris' cock is just like Cuban coffee...its good to the laaaast drop.",
  "models": [
    {
      "name": "Chris Cox",
      "person_id": 28468
    },
    {
      "name": "Cole Streets",
      "person_id": 27983
    }
  ],
  "release_date": "2012-07-18",
  "scene_id": 55031,
  "series": "Street Cox",
  "tags": [],
  "title": "Street Cox, Scene #01"
}