{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Ridge Michaels is back on ExtraBigDicks and this 24 yo from Longboat Key, FL, on Florida's west coast, is looking better than ever. Ridge's costar this afternoon is a 28 years old, from Connecticut and goes by the name of Mason Coxx. Mason has definitely amassed a large fan base with the New England Nine of his. If you've never seen Mason in action before; you'll know what we're talking about soon enough. With the Olympics looming we wondered which sport, Olympic or other wise, had the hottest men once suited up. Mason is ALL about the swim team, figuring less 'is' more (...at least when it comes to covering your junk). Ridge however likes his men on the playing field. 'Well I'm a big 'TB' fan (...no, not Tuberculosis) football fan, Tom Brady!' Ridge confesses 'so, I'd have to say football, the roughness and everything'. Both of these studs would look just as good in any uniform; but today we're gonna focus on how much better they look out of them. Let's see what games they come up with donning their birthday suits- Oh goody!These two are going at it before we say 'action' as they make out and grope each other's growing cocks. Ridge undoes his shorts as he kicks them free and hauls out his hard cock. Mason needs no invitation as he goes to work. He sucks that cock deep into his hungry throat as Ridge writhes in ecstasy. Ridge holds Mason's head by a fistful of hair as he bobs him up and down on his swollen meat. Ridge spreads those creamy thighs wide open giving Mason all the room he needs to go at that cock of his. Mason's own dick is straining to get free as it tents his shorts. Mason then comes up for air as he goes back to making out with Ridge and decides it's time to put Ridge's mouth to proper use. He stands and frees his massive cock. Ridge opens wide, taking as much of Mason's cock deep into his throat. Mason's fat dick is finally getting the attention it needs as he watches Ridge slurp and worship his oversized manhood. 'Fuck, that's a big dick' Ridge coos as he keeps savoring every inch of meat he can handle. They stand and start to rub their boners together getting hornier for what's to cum...Mason then gets Ridge back on the couch so he can suck on that dick some more. He wants to get that hot cock nice and wet so he can slide it somewhere else. Once Ridge is rock hard and horny for some ass, Mason straddles that fat dick and eases his hot ass right down on it. Ridge moans as he watches Mason ride his cock like a seasoned jockey. He grabs Mason's tight waist and helps bounce him on that hard cock of his. Mason then gets put on all four on the floor as Ridge gets behind that hot ass and slams in for more. Mason is getting fucked hard as he takes it doggy style. Ridge's smooth balls slap away at Mason's ass as he pounds away. They have amazing chemistry and can't seem to get enough of each other. That being said, Ridge is pistoning his meat deeper into Mason as he gets caught up in the moment tapping that hot ass. Missionary is what's going to bring these two home as Ridge gets Mason on his back. Ridge starts to fuck that ass harder and deeper as Mason begs him for more. Ridge's cock is hitting Mason just right and it sends him over the edge. Mason blows his wad all over himself while Ridge is still pounding that hole. Ridge then pulls out and shoots his own batch all over one cum soaked Mason.",
  "models": [
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    },
    {
      "name": "Mason Coxx",
      "person_id": 28799
    }
  ],
  "release_date": "2012-08-01",
  "scene_id": 55036,
  "tags": [],
  "title": "Gimme Some Coxx, Scene #02"
}