{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "A new face for you this week as we welcome yet another hung hottie to the site. Darius Suave is a young 20 and hails from the Aloha State. Darius is the perfect mix of Hawaiian and Latin heritage. He admits he thinks Spanish girls are by far the hottest girls anywhere. His ideal girl would be short, with light brown eyes, long black curly hair, cinnamon skin, well dressed with a tight body and have to smell really good. Someone's been dreamin' bout this girl a while. Darius knew he had a larger than average dick from the first time he had sex with a girl back in junior high. Having a big, uncut dick has its perks but it has it's drawbacks as well since there are some girls that take one look and say 'Hell no!' lol It's more the girth that gets to them. Having a big dick we wondered if he had any advice for people who want to take a big dick like his. Darius suggests that you relax your jaw and if you want it inside just prepare for a bit of pain. Well, sometimes to get that dick that feels like it should; it's gonna...hurt SO good!Darius sits back in his boxers as he plays with his growing cock. He has a smooth upper body with a sexy happy trail that disappears into his briefs. His briefs are having trouble containing his large cock as he pulls it out the side. His heavy nuts spill out as he frees his massive dick. He tugs on his smooth balls with one hand as he strokes his cock with the other. We can see why Darius knew he was gifted early on; this kid's hung like a small horse. He stands up and towers over the camera to show off his equipment as he drops his briefs. He takes both of his hands, clasping them together as he uses them to stroke his fat cock. He slowly pumps into his hands like he's tapping some ass before spitting on his swollen member. He slicks that cock up some as he continues to play with his dick that's definitely in a league all its own. Darius spits on his big cock from time to time as he continues to tease that cock and foreskin until its rock hard and throbbing.Darius then decides to show off that ass you can admire but you just can't touch. His bubble butt is muscular and he spreads his cheeks apart knowing he's giving you a peek at the impossible. Darius then turns his attention back to his throbbing uncut cock as he lies back on the chaise; spreads his legs and takes all the time he needs to double fist and work that cock until his smooth balls start to pull up tight around the base of his meat. Darius then gets back on his feet as he goes back to stroking his fat dick and teasing us as he swings it from side to side. All the attention on his cock is getting him closer to climax as Darius picks up the pace. His hand works his meat focusing on his sensitive knob as his muscles begin to tense and writhe anticipating the impending boom.  Darius lets out a soft moan as his thick load shoots off and rains down all over the glass coffee table below. Stop licking the screen! (You know who you are!)  lol",
  "models": [
    {
      "name": "Darius Suave",
      "person_id": 28869
    }
  ],
  "release_date": "2012-08-29",
  "scene_id": 55043,
  "series": "The Spank Bank",
  "tags": [],
  "title": "The Spank Bank, Scene #01"
}