{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "After giving our members something to gawk at last week, Jacques LaVere is back to show us not only that fat uncut dick-but what he can do with it. For those of you who missed his solo last week, this 22 year old Parisian morsel of Middle Eastern and Nordic ancestry has a smooth frame, a muscular build and over 9 uncut reasons to stick around. On that note, we introduce a new face to our site Mr. Travis Irons. Travis is 24 and a native of the Lone Star State. Travis is from Texas so we're hoping he has experience with things grown a bit 'larger'. We asked these two what kind of music they liked to listen to and Jacques is all about dubstep. Travis' tastes differ depending on his moods; that being said, on a good day he loves David Guetta. Who doesn't!? When it comes to lightening the mood Travis likes Family Guy. Jacques prefers old skool classics like Bill Cosby to make him laugh. Well, enough chit chat about what makes them feel good and more hands on and dicks in action that will make them feel amazing-at least that's the plan. Shall we...'See what I got here? It's really big', grins Jacques as he plays with the huge boner in his loose fitting shorts 'Wanna feel it?' You don't have to ask Travis twice as he reaches over and grabs Jacques' junk. Jacques tells Travis he can stroke it if he wants to. That leads to a taste test and Travis' mouth stuffed full of French beef. Jacques cock gets even harder once Travis starts sucking on it. He glides his mouth up and down on it as Jacques just watches him worship that str8 cock of his. Travis shoves his face into Jacques' bush as his tongue laps at those hairy nuts. Jacques gets comfortable as his clothes come off while Travis works that dick. Travis can't get enough as he eventually gets on the floor; leans his head back on the chaise so that Jacques can slide his meat down his throat for more. Jacques is totally onboard as he slowly pumps his fat dick into Travis' mouth. Travis' own cock needs room as he pulls his shorts down to stroke it. Jacques then gets up and sits back down on Travis' face so he can eat that ass while he's at it. He reaches down; helps Travis out of his shorts and briefly gives him a hand (...job).The next thing we see is Jacques sitting back as Travis slowly impales himself on that fat dick. He grunts as his hot ass slowly concedes. He struggles a bit before he's able to accommodate everything Jacques has to offer. Once he does he starts to ride it taking more and more inside him until he's bucking back for more. Jacques just sits back as Travis starts to work that big cock with his tight ass. He leans back; steadies himself with one arm as he starts to bounce up and down on that meat. He's hooked and wants all of it as his hole gets stretched wide. Travis then holds still as Jacques starts to piston his dick up into his hole. He grimaces as Jacques slams his dick up into him. Jacques then has Travis get up and go forward on the floor assuming the next position, doggy. Jacques slides his fat dick back inside as he gets that cock milked. 'Oh my God, that's a tight ass' he coos as he watches Travis' hole take every inch inside. He fucks him doggy for a bit before going to the floor and fucking that ass some more on his side. Travis can't help but beat his dick as Jacques is hitting his sweet spot. It sends him over the edge as he cums all over himself. Jacques isn't far behind as he pulls out and blows his massive load all over Travis' chest and abs.",
  "models": [
    {
      "name": "Jacques LaVere",
      "person_id": 28077
    },
    {
      "name": "Travis Irons",
      "person_id": 28868
    }
  ],
  "release_date": "2012-08-22",
  "scene_id": 55042,
  "tags": [],
  "title": "LaVere Thought of You, Scene #02"
}