{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We are all about going Greene here at ExtraBigDicks; so it's always our pleasure to have Alexander Greene with us. This week is no different, as this hung 21yo hottie from the Garden State reminds us that Jersey Shore is responsible for things even bigger than 'The Situation's' ego. -Don't hate!  The only guy luckier than our members this week will be newcomer Hunter Van Heise. Hunter is 19yo and comes to us from the west coast shores off the Gulf of Mexico in Newport Richey, FL. This will be Hunter's first shoot and this bright-eyed cutie has brought along his sense of adventure. He's gonna need it! <evil grin>  We asked these two studs what the highlight of their Summer was. Alexander's favorite part of his summer is daydreaming of winter coming and the Music Winter Conference and lets face it Winter in Miami is amazing at 85 in the shade. Hunter's favorite part of his summer is getting to hang out with his friends. Bigger IS better and Hunter couldn't agree more. That's gonna come in handy since Alexander's packing a rather large cock measuring in somewhere around 9. Fortunately, he confesses it's never been too big for anyone. He seems to find ways to 'make it fit'. <sigh> Our Hero. Well, today won't be any different as we watch Alexander show us how it's done. ...So, pay attention, Betches!Alexander is cruising on his phone when he invites a hottie over. There's a knock on the door and its Hunter looking hotter in person than he did in his pics. <WINNING!> They start to make out the moment Hunter enters the door and it isn't long before Alexander nudges Hunter south to get a better view of the growing situation. Hunter is on his knees as he undoes Alexander's jeans and frees his massive cock. He opens as wide as he can and goes for it. Alexander moans as he slaps his fat cock on Hunter's face a bit before sliding it deep into his throat. He fucks that pretty face as his balls slap at Hunter's chin. Alexander loses his shirt leaving him in his birthday suit as he watches Hunter worship his throbbing cock. Hunter may be new to many things; but sucking huge dick is not one of them. He expertly grabs Alexander's smooth balls and tugs on them as he spit-shines his aching knob, running his tongue over every delicious inch of it. Alexander then pulls him up onto his feet as they get back to making out. It's Alexander's turn as he strips Hunter's shorts off to find a pretty impressive party club waiting for him. Alexander takes Hunter's thick dick deep into his throat as Hunter just moans his appreciation.Alexander works that cock and his tongue runs south to his nuts than finds something else to explore, that hot ass. Hunter whimpers as he gets that ass eaten out and fingered. It just makes him that much hornier as Alexander preps that ass for that dick he wants to put in it. Alexander gets Hunter bent over and slides his fat cock in doggy style. Hunter tries his best to accommodate that monster cock as Alexander picks up the pace. That sweet ass gives it up as Alexander just buries his meat inside. His big balls slap away at that hole as he fucks him harder and deeper. Alexander then just sits down and lies back as Hunter gets right back on that fat dick in a reverse cowgirl. Alexander has the best seat in the house as he spreads Hunter's hot ass open and watches his fat cock just disappear as Hunter bucks up and down on it. Hunter can't get enough and we can't say we blame him as he grinds away at that pole. Alexander starts to shove it up into him as he literally bounces that ass on his dick. Missionary is next as Alexander puts Hunter on his back for more. He holds his legs up as he slides that dick in. That monster cock's hitting Hunter in all the right places and it makes him cum as Alexander pounds him. Alexander isn't far behind as he pulls out and shoots his massive load all over one cum-soaked Hunter.",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 28463
    },
    {
      "name": "Hunter Van Heise",
      "person_id": 28873
    }
  ],
  "release_date": "2012-09-19",
  "scene_id": 55049,
  "series": "Ordering In",
  "tags": [],
  "title": "Ordering In"
}