{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'C'est Magnifique!' This week's update is nothing short of magnificent as we add quite a bit of French flavor to the circle. Jacques LaVere makes his debut this week and we're sure you'll love this handsome, athletic garcon even more-once he takes his clothes off. Jacques is 22 years young and was born in the gay city of Paris. His background includes Middle Eastern as well as Nordic lineage that gives him quite a unique look. We wondered what Jacques did on his free time and he grins as he says he likes to jack off a little. Can't be mad at him for that, considering he's got a lot to work with. He started playing with his uncut cock at about the age of 13 when he started taking girls panties. That's what helped him discover his sexuality. He still does that 3 to 4 times a day (jerk off, not take girl's panties) when he doesn't have a shoot to do. Jacques didn't realize he had a big dick 'til he started getting feedback from his sexual partners that gawked at the sight of the equipment. Luckily he's never had someone turn him down cuz it hurts so good. Well, we have over 9 reasons why we should stop talking and let him get started showing you all 9 of them...inch by inch.As the scene opens we find Jacques standing in front of the TV watching some porn as his hands start to roam. He slides his hand up beneath his shirt to feel his smooth abs and chest before peeling off his tee. His chest is naturally smooth and has a lean build. Due south of that is what appears to be a rather large tent in his black shorts. Hmmm. Jacques slides his hands inside as he starts to tug at his fat uncut dick. It strains against the confines of his boxers as Jacques teases it 'til it's rock hard and needing relief. Jacques drops his shorts and sits back on the floor in his blue and white striped boxers. His cock is rock hard as he plays with it. The boxers aren't able to hold it much longer as Jacques takes it out of the side. It's at full mast just over 9' and it needs room to breathe. Jacques concedes and hauls it out and starts to stroke his huge cock. He looks up at the camera and gives us a wink. He knows what he's packing and he knows you want it. Straight boys are just incorrigible. <evil grin> He flops his uncut dick around as he jerks it slowly pushing out some clear precum from time to time. Jacques then gets on his feet to keep playing with that cock and soon his boxers meet the floor. Standing with his pride and glory at attention, Jacques starts to stroke his fat cock with both hands. Jacques keeps his crotch au natural and his thick dick disappears into a furry bush at the base. Jacques playfully swings his cock from side to side showing off what he's got. His balls are smooth and close to the base of his cock as he fucks both fists in unison. Jacques then sits back; gets more comfortable and spreads his hairy legs apart. He watches the action on the screen as he beats that fat French dick getting it closer and closer to the climax it's craving. The camera then gives us an over the shoulder shot where we can better appreciate the equipment. He picks up the pace as his focus turns toward working the head of his aching meat. Jacques can't hold off any longer and moans as he announces 'Oh Shit, I'm gonna -ugh!' as his cock erupts sending load after load of cum all over splattering him from faint happy trail all the way up to his shoulders. Lucky for us someone was a bit backed up! Now to clean up...any takers?",
  "models": [
    {
      "name": "Jacques LaVere",
      "person_id": 28077
    }
  ],
  "release_date": "2012-08-15",
  "scene_id": 55040,
  "series": "Jacques Off",
  "tags": [],
  "title": "Jacques Off"
}