{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Latin Fever has hit the set this week as we welcome back Hispanic hottie, Steven Verano and his sexy Cuban charms. Obviously, by that, we mean his extra big uncut cock that has no idea what it's in for. (Who doesn't love a good 'surprise'?) From the largest Latin country, that also gave us the sultry Samba, is this week's find, sexy Daniel Le?n. Daniel is 24 years young and left his home in Brazil behind 5 years ago to move here. We wondered what these boys missed most from back home. Steven misses the girls and the sex. He says that Cuban girls are the hottest around. 'That's because you've never been to Brazil!' grins Daniel. Touche! Daniel misses Carnival back in Rio where the world stops to party for 4 days str8, 40 days before Easter. Daniel goes back as often as he can, not wanting to miss a single one. We asked Steven when he first discovered he had a larger than average dick. He was 14 when a girl told him he had a big one and he didn't believe it until he heard the same thing from girls that followed. 'It's too big for some girls' he says 'they can't put it in their mouths.' Well Steven, you can't send a girl to do a man's job. Steven's never thought about letting a guy suck his cock before...until today.-Surprise!'So, you've never gotten a blowjob from a man?' Daniel asks as Steven assures him he hasn't. 'I don't think it works with a guy', Steven tells Daniel who isn't about to let that stop him from trying. Daniel moves in as he grabs Steven's crotch and tells him there's only one way to find out. Steven lies back as Daniel rubs his cock that starts to come to life. Guess it works after all as Daniel asks Steven if he could check out his dick just to see what the hype's all about. He pulls off Steven's jeans and briefs as he finally gets his hands on the Cuban equipment. He opens wide as he takes his growing meat into his mouth. He laps at Steven's growing dick, sucking it deep as he strokes it with his hand pulling his thick foreskin back over the head. 'You're going to be my bitch?' Steven teases as he grabs Daniel by the head and starts to bob his head on his growing dick. 'Don't stop' Steven orders as Daniel gets caught up in the moment. Steven's fat dick is at full mast by now and stretching Daniel's mouth wide open. Steven stands to get a better angle at the mouth and throat.He starts to fuck Daniel's hot mouth as he strokes his fat cock in his face. Daniel licks at Steven's smooth balls as Steven gets into it, slapping Daniel's face with his thick cock. Daniel loves taking that dick and steadies himself as Steven fucks his face. Steven then sits back on the chaise to let Daniel worship that dick some more. He gets comfortable between Steven's thick thighs as he nurses on that fat Cuban cock licking inside his thick foreskin and sucking on his balls. Steven's in ecstasy as he gets that dick serviced by a guy. He is totally getting off knowing another dude wants his dick. Daniel then gets on his back as Steven kneels over his head and slides his dick in for more. Daniel just nurses on his meat like a hungry calf as Steven watches his dick disappear down Daniel's throat. 'You want my leche, bitch?' Steven taunts as he starts to jack his dick off inches from Daniel's mouth. Daniel is writhing with anticipation as Steven teases him about the load he's about to give him. Daniel opens wide as Steven unloads all over his face and tongue making sure Daniel tastes his Cuban cream. As Daniel laps it up, and Steven's warm cum runs down his face, Daniel shoots his own load all over himself.",
  "models": [
    {
      "name": "Daniel Leon",
      "person_id": 28531
    },
    {
      "name": "Steven Verano",
      "person_id": 28865
    }
  ],
  "release_date": "2012-09-12",
  "scene_id": 55048,
  "tags": [],
  "title": "In the Leon's Den, Scene #02"
}