{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Ho'olu komo la kaua or Please join us (for you non-speakers) this week as we welcome our latest Hawaiian import, Darius Suave.  Darius is 20 and this hung hottie left many mouths watering after appearing on our site last week. Well we wanted to see him put all that ?Hawaiian-ness? to good use; so we invited Matthew King along to see if he was up for the challenge. Matthew is 27, clean cut, naturally smooth and hails from the Washington, D.C. area. We asked these boys if they could donate to a charity, which charity would they choose. Matthew would make his donation to the International AIDS Fund. Darius would make his donation to earthquake-ravaged Haiti still recovering from its aftermath. Here on EBD we believe that bigger is better and Darius who is packing more than the average Hawaiian assures us that having a big dick definitely gives him a huge confidence boost. When if comes to sex, we asked these two what they feel doesn't get enough attention and they wish would get more consideration. Matthew wishes guys would spend more time on oral instead of rushing past it. Darius couldn't agree more and confesses he thinks more time should be spent on foreplay in general to help add to the build up and sexual tension. ?Is it getting hot in here? Darius is installing a TV on the wall for Matthew when they discovered a DVD already in it. When they hit play it's a porno. ?That guy's got a pretty big dick!' Darius muses 'but mine's bigger than that? Matthew gives him a look of disbelief as Darius feels the need to show him. He undoes his shorts and hauls out his dick. ?That's a big dick!? Matthew grins as he lands on his knees in front of it. Darius just grins as he gets that fat dick sucked. Matthew uses his hand and his mouth to service all 8? inches. Darius is pleasantly surprised with Matthew's oral skills as he worships his big dick and smooth balls. Darius the gets Matt over to the chaise; puts him on his back so he can feed him even more dick. Matthew starts to jack his own cock off as Darius slides his dick all the way down his throat. Matthew can't get enough as he turns over to suck that dick deeper. Matthew is naked by now and we get our first view of his stellar ass. His ass is amazing, perfectly smooth and round, the only thing missing is...a tongue or fat cock buried inside it and that's about to be taken care of. Darius reaches over and starts to play with Matthew's hole as he squirms with anticipation. Darius goes around the chaise to get at that ass already in position as he slides his fat dick inside. Matthew bites the chaise as he struggles to accommodate Darius' cock. Darius slides his dick deep and starts to fuck that hot ass as Matthew gives it up. He can't get enough as he starts to buck back against Darius wanting every inch of it inside him. Darius pounds that hot ass doggy style as his balls slap against Matthew's ass. Darius holds Matthew by the waist as he slows it down and starts to pull his fat cock almost out of his ass before shoving it right back in. He watches as that hole just swallows every inch of his throbbing cock. Darius then gets up and has Matthew sit on his fat dick in reverse cowgirl. His fat cock gets ridden hard as Matthew bounces up and down on his pole. He grinds his hot hole down on that thick shaft as it stretches his hole even wider. Darius just sits back and lets Matthew do all the work for a while as he revels in the sensation of that tight ass milking his pole. Missionary is next as Darius gets put on his back. His legs go up in the air as Darius shoves his fat cock right back in. This one brings them both home, as Darius' cock hits Matthew's sweet spot making him cum all over himself. Darius isn't far behind as he pulls out and unloads all over Matthew's cum drenched abs.",
  "models": [
    {
      "name": "Darius Suave",
      "person_id": 28869
    },
    {
      "name": "Matt King",
      "person_id": 28870
    }
  ],
  "release_date": "2012-09-05",
  "scene_id": 55046,
  "tags": [],
  "title": "Bigger Than That?, Scene #02"
}