{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "We know our members aren't really size queens; they just like to be impressed. Well this week 'impressive' is definitely one word that's been used to describe the fat, uncut cock that fan-favorite Mario Costa keeps in his shorts. Cuban born Mario is a Miami commodity and he's going to be sharing the wealth (so to speak) with another local hottie by the name of Antonio Kava. Antonio is 23 and a native Miamian. We wondered where these boys would want to spend their next birthdays and with whom? Antonio would want to spend it in Australia and would take his best friend with. Mario would want to spend his birthday back in Cuba surrounded by family. Mario is hung better than most so we've definitely brought the right playmate to the table. Antonio's biggest cock to date was about 12' and he took it like a champ. Antonio admits if he happen to find anything bigger than that he wouldn't be one to back down from a challenge. Well, putting the 'ass' in surpass, we can safely say he will definitely be surpassing Mario's expectations. Let's say we watch!? -Buckle up, Betches.Mario is a bit sore and Antonio is giving him a nice back rub. 'That feels really good' Mario moans as Antonio takes it one step further. He slides his hand down Mario's chest right onto his crotch and says 'this would feel even better-inside me' You don't have to tell Mario twice as he stands up to give Antonio access to his growing meat. Antonio buries his face into Mario's crotch as he feels that Cuban python come to life. He holds back as long as he can before lust gives in and he hauls out that dick for a better view. He opens as wide as he can before sliding that massive meat down his throat. Mario's cock is hard in seconds as it gets worshiped by Antonio. He takes his time sucking and lapping at that cock and smooth balls wanting to pleasure it as best he can. He then stands up and starts to make out with Mario who undoes Antonio's shorts so that he too can return the favor. He sits Antonio down on the chaise; leans him back and gets to work on that cock that had been feeling left out. Antonio's uncut cock is hard as a rock as Mario slurps up and down on it making Antonio even hornier. (...but wait. There's more!)Mario then bends Antonio over on the chaise and kneels behind him to get a taste of that ass. He slips his tongue inside as Antonio bucks that ass back on it. He eats that ass out wanting to get it nice and wet for what he's got in store. Once that hole is ready for more, Mario stands up and gets in position. He slaps his bare cock on that hole making Antonio all but beg for it. He then suits up and pushes his fat knob against that sweet hole. It gives in without much of a struggle as Mario sinks his thick 9' dick deep inside him. He starts to slide in and out as Antonio moans and groans with desire. Mario is getting that ass doggy style as he holds Antonio still and shoves that dick in deep. 'Aww fuck me, yeah' Antonio cries as he feels Mario's balls slap away at his hole. Mario then sits back and watches as Antonio impales himself on that dick for more. He rides that dick as his hot ass milks Mario's cock. Antonio is doing all of the work and Mario is definitely ok with that...for now. Mario then gets Antonio on his back and goes back to fucking that tight hole, missionary. That makes Antonio bust his nut as he shoots all over his smooth chest. Mario then pulls out and blows his cum all over cum-covered Kava.",
  "models": [
    {
      "name": "Antonio Kava",
      "person_id": 28874
    },
    {
      "name": "Mario Costa",
      "person_id": 28031
    }
  ],
  "release_date": "2012-10-03",
  "scene_id": 55054,
  "series": "You Know What Else Feels Good?",
  "tags": [],
  "title": "You Know What Else Feels Good?, Scene #02"
}