{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Today we have a hot Cubanito that's packing a big Cuban cock. For those of us that live down in the Tropics we know just what kind of packages many of the Cuban hotties pack between their thighs. Tony Tolete makes his debut with us today and at 19 this recent addition to the US admits he likes American girls. He can't say he loves them better than Cuban women though. When it comes to what he likes, he likes it all: big asses, big tits and he likes brunettes. The first time he had sex was at the age of 13. When we ask him about his big dick he admits he has a big one; but can't speak for the rest of the Cuban men. He is currently single but would love to have a girlfriend (...or 3!) When it comes to what he like a girl to do to him, he wants her to do everything. 'A Lady in the street, but a whore in the sheets.' Aaah, that never goes out of style does it? (You know who you are!) lol Wrapping it up, we asked him what his ultimate fantasy would be. He would want to have 3 girls at a time. A 'menage-a-four' with 3 little whores! Hmmm, that would explain the need for 3 girlfriends, huh? Any volunteers?Tony comes home and kicks back on his chaise. On it, he finds a new Fleshjack that he quickly unwraps and lubes up. His dick starts to stir as his fingers slide inside the fleshy contraption. He decides to get a better feel for it as he strips off his tee and starts rubbing his growing cock through his jeans. He drops his pants and keeps his tight briefs on that are getting tighter by the minute. He lays back on the chaise as he finally frees his massive uncut dick. He's rock hard as he starts to stroke it as his foreskin helps pleasure his throbbing meat. He keeps his big uncut dick just as smooth as the rest of him. His sun-kissed skin and cinnamon nips provide an endless canvas for your eyes...or tongue to admire. He is so turned on he forgets all about the Fleshjack as he gets to work spitting on his meat and making it throb. He stands up to give us a better look at that cock as he slaps it on his palm. He has to use both hands on his 9' dick to stroke it effectively. Some boys have all the luck. Tony then bends over on the chaise and tugs on his cock underhanded as he gives us a spectacular view of that smooth ass he knows you want. Hands off! His ass isn't an option. He teases us with that ass up in the air making you wish it came with a bib before sitting back down to stroke some more. His dick is aching for release as he jacks faster. Once he gets that familiar tickle in his smooth nuts he stands up and blows his hot load all over the chaise.  Got Leche? We do!",
  "models": [
    {
      "name": "Tony Tolete",
      "person_id": 28875
    }
  ],
  "release_date": "2012-10-10",
  "scene_id": 55056,
  "series": "The Cuban Sausage Crisis",
  "tags": [],
  "title": "The Cuban Sausage Crisis"
}