{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week, back by popular request, is Mr. Seth Haus. Seth made his debut with us on Valentine's Day of 2K11, when he gave that massive pole of his to one lucky Tony Royce. Well we got so many requests that we were glad to bring this 22yr old Colorado native back. Wanting to get this hung hottie a bit more personal we decided to ask a few questions. As for what his favorite comedy to watch on TV is Seth loves Tosh.0. We then wondered what he likes to do on his spare time. He loves to be outdoors and is very active and playing sports like golf. As for sports he likes to watch on TV it would have to be basketball. Seth was about 14 when he realized he had a bigger than average dick when he started fooling around with other partners. Seth considers himself to be str8 but admits there are things he can enjoy with men that he can't with women. As for where he loves his thick 9' cock he admits he prefers to be on top. Seth, having had experience on both sides of the fence, admits that one isn't better than the other; it all depends on age and experience. Well, today we'll get a chance to get a better look at that sweet equipment he's packing. So sit back and enjoy.Seth is sitting back groping his growing crotch as the outline of his massive cock starts to become visible. He teases and tugs at it for a bit before standing up to give his cock more room. It takes both hands to squeeze and grab his fat dick. He drops his shorts and continues to play with that fat dick until those briefs can no longer hold it captive. He lowers his underwear as his huge cock springs out. His cock is thick and juts out as it slowly fills out to its full length. Seth slowly strokes his meat dry as he plays with his smooth nuts with one hand and methodically strokes with the other. He takes his time as he strokes his thick dick and lubes it up a bit to make it easier to tease and tug. Seth has a naturally smooth chest and has a series of stars tattooed starting on his clavicle and running along his right arm ending near his wrist. It's nice to see Seth no longer shaves his pubes bare and keeps his huge cock looking more 'au natural'.  Seth then gets comfortable on the chaise as he sits back; spreads his legs and gets right back to stroking that fat cock. His cock is throbbing at this point and he's jacking it with both hands wanting to give every inch of it attention. He under hands the knob wanting to give it more attention with one hand as he holds his big dick steady at it's base. Seth's cock is feeling really good with all the attention it's getting and it won't be long before it wants to release its cargo. Seth stands up and goes over to the coffee table as the cam takes cover underneath it. We get a great shot of Seth stroking his hard cock faster as his huge nut sack pulls up tight to the base of his cock. Seth lets out a soft moan as his cock explodes sending wave after wave of hot cum raining down all over the glass top. Wave after wave of thick cream splatter all over the glass and our camera doesn't miss a single thick stream. Whew. We're definitely glad we brought back this hung Colorado native and his cocky mountain peak. -Experienced climbers always welcome.",
  "models": [
    {
      "name": "Seth Haus",
      "person_id": 28803
    }
  ],
  "release_date": "2012-09-26",
  "scene_id": 55051,
  "series": "Full Haus",
  "tags": [],
  "title": "Full Haus, Scene #01"
}