{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'The grass is always greener on the other side' they say; but we would disagree and offer up Alexander Greene as proof. Alexander is a Jersey transplant to Miami, 21, hung and delicious from any and ALL sides!  This week his costar, 24yo Brian Bonds who also just relocated to South Florida from Little Rock, Arkansas. We opened up with an odd question and asked what we would find in their refrigerators at home. 'A big long sausage' says Brian grinning ear to ear. Alexander admits what you'd find in his is the need to go shopping because it's probably empty. Wardrobe is next on our check list so we want to know what they wear when they want to look sexy. Why not!? Brian loves his leather pants and boots. 'It doesn't matter if you wear anything else with them' Brian says 'if you just wear those, you're good.' Alexander ponders the question before answering and confesses that if he's trying to be sexy he's going to be staying out of clothes. 'C'mon, 'Strippers': no clothes just shoes?that's sexy!' On other guys, Brian loves leather; while jock straps are a major turn on for Mr. Greene. Wrapping things up we asked Brian how he felt about our motto 'Bigger is Better'. 'What can I say? I'm a little size queen' he beams 'and I'm willing to prove it!'...Need we say more?The chemistry between these two wasn't hard to overlook so we left them alone. These two were all over each other by the time we hit record. Brian's hand slipped into Alexander's shorts eager to get a preview of what's on the menu as they made out. Brian quickly kisses and licks his way south on Alexander's smooth chest 'til he reaches that cock. He strips them off and gets comfortable before opening wide and swallowing Alexander's huge cock. Alexander sits back and enjoys as he watches his dick disappear down Brian's eager throat. His uncut cock is rock hard as Brian chokes and gags on it trying to take every sweet inch down his throat. Alexander then gets Brian up so he can return the favor. Brian's cock springs free as Alexander peels down his shorts. He licks up the length of that cock before bobbing up and down on it wanting to make Brian feel just as good. Brian moans as he helps shove Alexander's head deeper onto his throbbing cock. After working on that dick Alexander wants a taste of that ass and soon has his tongue buried up inside that smooth ass. Brian sits on that face and writhes in ecstasy anticipating that huge cock that will soon replace that skilled tongue.Alexander slides up on the chaise positioning his thick dick just below that wet hole as Brian lowers that ass on it. Brian groans as he tries his best to accommodate that huge cock up his ass. Alexander isn't about to wait as he slams that fat pole way up into his ass. Brian grunts and whimpers as Alexander just nails that ass deep and hard slamming his balls up against that hungry ass. Brian then twirls around on that dick and continues to ride it facing Alexander so he can make out with him as he gets that ass stretched wide. Alexander can't get enough of that hole on his cock as he continues to rail up into him practically bouncing him on his dick. He then leans Brian back until his shoulders are on the floor and his ass is up in position for more. He aims that cock south and slides back in as he rides that ass some more. He holds Brian's legs back as he buries his meat and slams against his prostate. Brian can't help but jerk off as his balls pull up tight before he explodes all over himself. Alexander then pulls his own cock out and shoots his cum all over Brian's cock and worn hole.",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 28463
    },
    {
      "name": "Brian Bonds",
      "person_id": 28078
    }
  ],
  "release_date": "2012-11-07",
  "scene_id": 55064,
  "series": "The Ass is Greener on the Other Side",
  "tags": [],
  "title": "The Ass is Greener on the Other Side, Scene #02"
}