{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Ty Lattimore makes his debut with us this week. Ty is 36yo and originally from Oakland. He moved here to Miami after living in Atlanta for a while. He misses the sex life he had back in the ATL. Well, he must be doing something wrong cuz the 305 is swimming with way hotter men. Not that we're biased. He does admit he loves the Latin and bi-racial men here in South Florida. Then there's the foreskin phenomenon he's found himself immersed in. Ty tends to like things on the wild side and admits he's never been a fan of vanilla. The kinky persona he exudes on film is reflective of who he is off cam. He started messing around at 13 and living so close to San Francisco he was exposed to many things. He started fisting at 20 then got into leather and hardcore water sports. He is all about the hardcore and today he's excited to debut the new hardware now that he's sporting his own Prince Albert. Well you can never have enough places to hang your car keys right? Ty assures us he's had no complaints so far.Ty is online showing off on cam for a buddy as he strips off his shirt and starts to flex his muscles. He then stands up and drops his jeans to show off his ass. He bends forward, slapping his ass as he asks if we like what we see. He gets up and starts to tug on his dick through his jock strap before sitting back and getting comfortable. He loses the jock and kicks back to stroke that dick. He gets hard as he strokes his hard cock as he shows off for his online companion. He strokes that dick 'til it's at full mast and tugs on his new piercing. He strokes his thick cock paying close attention to his knob as he holds the end straight up by his Prince Albert then stroked the shaft with his free hand. He then gets on his feet to show off more of that cock. His ass is next on the display parade as he bends over on the chaise and pulls on his hard cock. He arches his back and shows off that big ass. All this stimulation has his cock and balls begging for release as he flips over onto his back. He spreads his legs wide as he starts to jerk off again. It doesn't take long before he feels that familiar tingle in his balls. Ty picks up the pace as he feels his orgasm building. He gasps as his cock unloads his thick cargo as it oozes out from around his new piercing making its way down the shaft before pooling in his thick bush.",
  "models": [
    {
      "name": "Ty Lattimore",
      "person_id": 28876
    }
  ],
  "release_date": "2012-10-24",
  "scene_id": 55060,
  "tags": [],
  "title": "The Big Show Off, Scene #02"
}