{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "'If you can't stand the heat; then stay out of the kitchen' they often say. Well, here at ExtraBigDicks, we don't mind the heat cuz this week we have 2 Florida boys that know ALL about that. The first, a Boca Raton blast from the past and one of the original CJB alums, 'Cooker' Stevens is back giving us a 'Treat' this Halloween season. It's been a few years since we've had this 34yo well-equipped Sous Chef show off his tools. Lucky for Fort Lauderdale native Trey Turner, he's going to have to figure out the trick to handling every inch of it. We're sure he won't mind. Trey's been hitting the gym and looking better than ever and he's happy these days spending time with his partner. Cooker, who was totally str8 when he started with us soloing on CJB, progressed on to shooting for EBD. With those shoots his sexual resume expanded as he realized that men could handle his cock better than most women. With that realization he now considers himself to be bisexual and finds that he's still mostly attracted to women but he knows that fun can be had on both sides of that boudoir. Trey is all about his man, Jessie Coulter, with whom we had the pleasure of seeing him with on MenOver30. These two have a happy road ahead...Cooker is filling out his paperwork for his shoot when Trey comes in and introduces himself. Cooker tells him it's been a while since he's been here so he's a little nervous. Trey assures him there's nothing to be nervous about and that he will take really good care of him. He leans in and they start to make out as Trey gets Cooker to lie back as he turns his attention to that cock he's heard all about. He pulls out Cooker's dick and slides it all the way down his throat. Cooker gasps as he watches his monster cock disappear down Trey's hungry throat. Trey works that meat and heavy nut sack with his tongue getting Cooker hard and horny for more. Cooker pulls Trey up to his feet and sits up to get some dick of his own. He undoes Trey's shorts freeing his hard cock as he wraps his mouth around it. Cooker's own cock is standing at attention as he shows Trey what he can do with his hard cock. Trey moans in ecstasy as he tugs on his nips. They then go back to making out as they stand and rub their cocks together. Trey then wants to see what else Cooker's tongue can do as he gets on all four and gives Cooker something to eat. Cooker goes right to it showing off his oral skills while tossing a mean salad.With Trey bent over and begging for more, it's only natural Cooker would do whatever possible to make that happen. He gets to his feet, lines up that hard cock ands slides it ball deep inside Trey's wet hole. Trey arches his back wanting every inch of that dick inside him as Cooker starts to pound that ass. 'Oh feed me that cock!' Trey begs as Cookers slams his dick deep, pulling it almost all the way out before ramming it back in. His heavy balls slap away at Trey's ass as Trey bucks right back. Cooker sits back on the chaise as Trey straddles and sits on it. He glides on that big dick with ease as he milks that hard cock with his hole. Cooker just sits back and lets Trey do all the work as he rides his dick. Cooker then has Trey twirl around into a reverse cowgirl as he takes over for Trey and starts to slam his hard cock up into that ass. Trey is writhing with pleasure as Cooker's dick hits that prostate just so. 'Oh fuck the cum out of me' grunts Trey as his cock explodes all over his abs. Cooker then pulls out and gives Trey a massive facial blasting his creamy load all over Trey's face and neck. A tossed salad, a big piece of meat served up (...and down) perfectly and a creamy dessert: Cooker's still got it. <evil grin> Welcome back, Cooker!",
  "models": [
    {
      "name": "Cooker Stevens",
      "person_id": 28582
    },
    {
      "name": "Trey Turner",
      "person_id": 27927
    }
  ],
  "release_date": "2012-10-31",
  "scene_id": 55061,
  "series": "Cooking with Ass",
  "tags": [],
  "title": "Cooking with Ass"
}