{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "After making his debut on MenOver30, and becoming an overnight fan favorite bottoming our resident bad boy Brenn Wyson, we knew we had to share the love with our members here on ExtraBigDicks. By 'love' we of course mean sexy Sean Duran. Sean is 24 years young and hails from North Carolina. Well, who better than to give Sean a proper introduction to the Bigger is Better mindset than Drake Jaden. Drake is just one of the hot, hung locals driving them wild and at 27 this Floridian makes it look so damn easy. Both of these hotties have tattoos a plenty so we decided to ask them where it all began. For Drake it was the eye ball in the center of his tribal tattoo. That's what started it all but his favorite would have to be the Pi tattoo on his chest because he finds it fascinating. 'I was always a big nerd' Drake says, 'still am.' Sean's first tattoo was the wings on his back but his favorite would have to be the cat on his left bicep cuz it always brings him luck. When it comes to what feature in another man makes them weak their choices differ. Drake loves a hot ass where Sean finds forearms sexy. Well, lets get this party started shall we?Sean and Drake are looking through a magazine commenting on porn stars when Sean comments on a hot ass. 'I've been told I have a hot ass' Drake grins. Sean's not gonna miss out on the opportunity as he asks Drake to prove it. Drake stands up and pulls down his jeans showing off that ass framed in a tight jock strap. Sean gets on his knees and dives in face first as his tongue slides inside that ass. Drake moans as he gets that hot hole rimmed making his huge cock strain for release. He pulls down his jeans and lays back to let Sean have some dick. Sean immediately dives for it sucking that cock all the way to the hilt. He slobbers on that fat meat as Drake bobs his head up and down on it. Sean loves that thick meat but his own meat's feeling left out. He stands up and whips out his growing dick and slams it down Drake's throat. Drake chokes and gags on it as he latches on to that dick. He easily slides that dick down his skilled gullet. He spits on that meat and strokes his huge cock as he does. 'You like that dick' grunts Sean as he watches Drake choke and gag on his southern 'charm'.From there these two end up on the floor in a steamy 69 as each gets his fill of cock; bobbing their mouths on all the swollen meat they can handle. Soon a mouth isn't enough for Drake who needs a tight ass on his meat.  He sits back in the chair and has Sean sit on his dick in a reverse cowgirl. 'Fuck that's a big dick!' Sean groans as he impales himself on it. His own dick is rock hard as he starts to ride it. He bounces on that dick taking every inch of it deep inside him. He gets his feet up on Drake's knees and starts fucking himself silly on that thick dick. Drake grunts and groans, slapping that ass as he calls Sean a dirty little pig. Sean then gets on all four puts his face on the floor and that smooth ass in the air and orders Drake to fuck it. Drake immediately shoves his dick deep into that ass as he pounds that ass. 'Fuck me harder-Do it!' Sean orders as Drake rails into him even harder. From there they end up on the floor with Drake pounding that hole as he lays behind Sean. He holds his leg up as he buries that dick fast and deep. That does the trick and it sends Sean's load flying all over his thigh and area rug as Drake fucks it all out of him. Drake then pulls out and blasts his own thick batch all over Sean's face and tongue. Once the last of his cum is spent Sean greedily latches on to his knob sucking out every last drop. Mmm, Mmm, Goooo! ",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Sean Duran",
      "person_id": 28079
    }
  ],
  "release_date": "2012-11-21",
  "scene_id": 55066,
  "series": "Hot Ass",
  "tags": [],
  "title": "Hot Ass"
}