{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It's been over a year since we've had our favorite comrade here in the studio, so it is with great pleasure that we welcome back Valentin Petrov. Valentin is now 34 years old and this hung, uncut Russian can definitely heat up any chilly winter's eve. No blanket needed. Valentin took a break from the industry and he admits he missed shooting scenes and all the fun he had on set. He admits he doesn't make a lot of friends when he shoots. He likes to keep work, work. He's single at the moment and admits he's open to the right guy preferably a smooth guy with a big ass and a big dick. Here on our set he's been mostly a bottom but he assures us that in his personal life he's completely versatile. He's very affectionate and likes to kiss and cuddle if the chemistry is there. He's traveled extensively and he thinks Miami has the hottest men. The mixed hotties, Brazilians, & Latin boys keep him on point. Valentin is fortunate to be packing more than the average guy and admits it comes in handy when he wants to fuck a nice ass. Ultimately though chemistry always dictates what goes in where.Valentin is flipping through a mag admiring a hot blonde twink with a big dick when his own dick starts to stir. He starts to rub his cock through his denim shorts as it slowly comes to life. He peels his shirt off and as he does its obvious someone's been hitting the gym. Valentin's abs are ripped and his body is more defined. He undoes his shorts and starts to play with his cock that is now straining to be set free. He stands and drops his jeans giving us a show with his cock now fully engorged and demanding attention. He finally lets his tight briefs hug his ankles as he starts to pull on his massive dick. He strokes it and watches as his thick foreskin runs up and down his shaft. His balls are smooth and his chest is smooth as well to showcase his ripples. Valentin sits back; spreads those thighs apart and makes himself at home stroking his fat cock. He slows his stroking down and toys with his knob making it leak precum as he rolls it around in his foreskin. He takes his rigid cock and slaps it against his palm making it get even harder. He then takes the party south as he lies on the floor and goes to work stroking that dick off the way he likes to so he can cum. He runs his hand along his defined abs and chest as his right hand becomes a blur beating his Russian rod. It doesn't take too long before his abs tighten up and he lets out a grunt and sends hot load shooting out all over his hairy abs and navel pooling into a creamy mess. Clean up, anyone?",
  "models": [
    {
      "name": "Valentin Petrov",
      "person_id": 28033
    }
  ],
  "release_date": "2012-11-28",
  "scene_id": 55068,
  "series": "Welcum Back",
  "tags": [],
  "title": "Welcum Back, Scene #02"
}