{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a very special update as we reveal a rather delicious Cuban import by the name of Scott Anderson. Scott is 22 and like many other Cuban boys in the area brings something rather special to the party. You'll figure that out soon enough. Scott is a self-confessed horn dog and has been jerking his meat since he was about 12. He loves to watch porn and the kind he prefers is anything that has a girl with a nice ass. Yeah, he's Cuban alright. Scott figured out he had a big dick in middle school after he started messing around with girls. He's heard it from other guys in the locker room as well after playing football through high school. He likes girls to be freaky since he loves to get kinky with them. He would like a girl that gets into being roughed up and tossed around. His ultimate fantasy would be to have two chicks, tie them up and run a train on them. Well, he's definitely got the dick to do it and after you sit back and watch him haul it out, we're pretty sure you'll have your own fantasies about Scott, his uncut cock and all the ways you'd wanna....well, you know. Scott is kicking back watching some porn on his laptop and playing with his dick through his gym shorts. It isn't long before his cock starts to pop a tent in them wanting to come out and play. Scott peels off his tank top revealing his ripped abs and smooth chest. He stands up and by now his cock is at full mast wanting to come out of his shorts as it sticks out like a high dive board. Scott's body is amazing. The dedication is obvious as he runs his hands along his chiseled abs and chest. His other hand is still playing with his hard uncut cock; that is just waiting at the end of that sexy happy trail. Scott finally pulls down his black boxers as his massive cock springs free. Scott's thick uncut cock is a solid uncut 8' or more. He slaps it around as he moves his waist around making it bounce and bob in the air.  Scott keeps his pubes trimmed short and his balls are smooth and hug the base of his hooded playmate. Even when he's rock hard, Scott's foreskin can come up and cover his hard knob. He slowly strokes that dick showing off his 'pingon' and his thick foreskin to boot. He then kneels as he watches more pussy get impaled on his laptop. His cock is moist with precum as he strokes his rock hard cock. Scott then gets up and kneels on the couch to give us a view of that stellar ass of his we can look at but can't touch. Mmmm. He bends forward as he pushed that cock backwards to show off all his goods. His smooth ass is muscular with that fuzzy crack just out of reach. Scott then flips around and lays back to watch more hardcore video. He can't get enough of that fat ass on screen taking cock like a champ and it makes his cock throb. He picks up the pace wishing it was his meat pounding that pussy and that does the trick. Scott's balls pull up tighter and tighter and as his abs contract, he sighs with each torrent of cum that flies out of his cock over his shoulders, drenching his chest then the rest pooling on his lickable abs. Well, we were wrong. Scott brings more than just meat to the table. This dish cums with an extra large glass of milk. ...Drink up!",
  "models": [
    {
      "name": "Scott Anderson",
      "person_id": 28890
    }
  ],
  "release_date": "2013-02-27",
  "scene_id": 55077,
  "tags": [],
  "title": "Popping One Off, Scene #01"
}