{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a special surprise as we pair up EBD fan favorite Alexander Greene with sexy Alex Adams who finally comes home to the BIG leagues. Alex Adams is from Baltimore and he's 26 years young. Alexander grew up between Jersey and Miami and his hot, hung self is 22 years old. We asked these two if they had the same reactions from guys and girls when it came time to using their big cocks. They both concur that there are size queens on both sides of the sexual fence but guys are way worse. 'Some guys won't take it unless it's huge' smiles Alex. Apparently some girls aren't as willing when they have too much to work with. Alexander assures us that both can handle his big dick just fine. It all depends on the person doing it and not the gender at all. Having big dicks has its advantages and both of these studs agree that they prefer a big dick; or as Alexander put it: 'I'm not a total size queen or anything; but I prefer hung' he grins, 'It looks good.' Who can argue with logic like that? We sure can't. Alex and Alexander are shootin' the shit talkin about what girls they're doing and Alexander confesses he can't be tied down to just one. Alex tells him he's single too and that every time he sees a big cock he can't seem to control himself. Alexander grins and tells Alex he just happens to have a big dick. Alex wastes no time before investigating thoroughly. This of course means he's on his knees with Alexander's cock down his throat in no time. Who can blame him? Alexander moans as he watches his fat cock easily slide down Alex' throat. He bobs his head on that monster cock as Alex grasps for air unable to get enough of it. They get up and start to make out as Alexander helps Alex get out of his own pants. He wants to return the favor as Alex' fat cock springs free. Alexander gets down and swallows it whole as Alex moans his appreciation. Alexander fucks his throat with Alex' fat cock 'til its throbbing. This fat cock's gonna need more than that purty mouth. Alex bends Alexander over and slides his fat cock deep inside his jock ass. Alexander moans as he gets that ass owned by out Baltimore boy. His balls slap away at that ass as he fucks Alexander doggy style. Then they switch as Alexander sits back and has Alex sit on his dick. 'Fuck it's so big!' Alex grimaces as he does his best to take that huge dick inside him. Soon he's riding that cock like a veteran as Alexander revels in the sensation. Alex' own cock is bouncing as he rides that cock hard getting the occasional reach around from Alexander. The party heads south from there as Alexander gets Alex on his back and fucks him silly in missionary. He pounds away at that ass hard and deep and that cock batters that sweet spot just right. 'Oh fuck me' he begs as Alexander obliges. Alex blows his wad all over his smooth abs. Alexander pulls his own aching cock out and jacks his thick load all over Alex' cum-drenched cock.",
  "models": [
    {
      "name": "Alex Adams",
      "person_id": 28090
    },
    {
      "name": "Alexander Greene",
      "person_id": 28463
    }
  ],
  "release_date": "2013-04-03",
  "scene_id": 55079,
  "series": "They ALL Want The Big Dick",
  "tags": [],
  "title": "They ALL Want The Big Dick, Scene #01"
}