{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a special treat as we welcome back Valentin Petrov to remind us what we've been missing. Out of temporary retirement, Valentin is back, 34 years young and our hottest Russian import. We're glad to have him back and we decided to pair him up with some local flavor, Mr. Chris Cox. Chris is 27 years young and another Miami boy with Cuban heritage. Living in the tropics has it's privileges. Both of these studs have larger than average cocks so we wondered what the cut off would be. Chris says if it gets larger than 9' it gets to be too big. Valentin also agrees that 9' is the cut off. 'Ten inches' Valentin says, 'it probably doesn't exist.' Hmm. Out of the mouths of babes... lol Well, here at ExtraBigDicks we know better so we won't be the one to tell him there are much larger pythons waiting to be had. We asked these two when the last time they were with someone that surprised them when they whipped out their dicks. Well, both of them agree they are usually the ones that shock other guys when everything gets hauled out. Luckily these boys are the exception to the rule and are both perfectly happy with their huge, cocks as they are and wouldn't want to change them in any way. Well, we couldn't agree more...so, lets get these two naked!By the time we start the cameras these two are going at it. They kiss as their hands start to roam exploring each other. Valentin isn't waiting to see what's waiting for him in Chris' pants as he undoes those jeans and pulls out that massive cock. Chris moans as Valentin swallows that meat. Chris is rock hard as Valentin gets that mouth all over it and shoves it as far down his throat as he can. Chris is looking better than ever and his abs are ripped. Valentin goes back for more as he shoves his tongue into Chris' mouth and undoes his own pants. His dick could use some attention and Chris is more than willing to return the favor. Valentin's uncut cock is soon fucking Chris' face as Chris struggles to take his massive meat. It's not every day we get two true ExtraBigDicks on set and there is plenty of cock to go around. The chemistry between these two is obvious as they continue to make out. 'Lemme eat that ass' Chris teases as he starts to finger Valentin's tight hole while still making out. He slips his finger inside as Valentin moans with pleasure. That finger is soon followed by Chris' tongue as it darts deep into that hairy hole. Valentin knows what's next and he can hardly contain his excitement.Chris suits up and slaps that fat cock on Valentin's hole. He starts to shove it inside taking his time as Valentin's hole slowly concedes. His fat cock stretches that hole wide open as Valentin groans. Once Chris' balls meet that ass he starts to fuck that ass. Valentin struggles to accommodate Chris' fat Cuban cock as he rails it in deep. He holds Valentin's tight waist as he rams that ass doggy style. Valentin is in heaven as he gets that hungry hole stuffed. Chris then gets Valentin on his back on the chair and slides back inside missionary. He holds his leg up over his shoulder and pounds that ass hard and deep. They can't get enough of each other as they fuck themselves silly. Valentin's cock is rock hard as he gets that ass drilled. Chris then sits back on the chair and orders Valentin to sit on his dick. Valentin straddles that cock and sits right down on it as he bounces up and down on that fat cock. Chris holds him steady as he slams that dick up into Valentin as it hits his prostate making Valentin's balls start to tingle. It isn't long before he's ready to blow his load with Chris' cock stuffed up that ass. He moans as his cock explodes sending his load all over his abs and uncut cock. Chris isn't far behind and jacks his own thick load all over himself as he makes out with his sexy comrade. ",
  "models": [
    {
      "name": "Chris Cox",
      "person_id": 28468
    },
    {
      "name": "Valentin Petrov",
      "person_id": 28033
    }
  ],
  "release_date": "2012-12-05",
  "scene_id": 55070,
  "series": "Fuck Buddies",
  "tags": [],
  "title": "Fuck Buddies"
}