{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a special treat for you as we finally get to showcase one of Miami's own, Van Wilder. Van is 21 and has a lot more than the average guy swinging between his legs and figured that out at about 14 years of age. He always had competitions with his childhood friends and once they started competing for girls the truth became apparent. Once the girls started taking that fat cock of his, the grape vine did the rest. Van admits having a dick as big as his can be a blessing and a curse. Some people love it and others are terrified of it. 'Once some feel it, they don't want to be anywhere near that 'thing' they say', Van laughs. It doesn't matter whether it's a male or female, they're just not used to having a dick as big as mine. Van loves having a big dick and it gives his self-confidence a major boost knowing he doesn't have to over compensate for anything. Van takes good care of his equipment between sessions and admits he likes to jack off but won't do it everyday. Sometimes he'll go for days without touching himself and other days he'll jack off 4-5 times in a day. Hmmm, Lets see what that looks like...Van is asleep on the couch; but his dick isn't. He wakes up to find a tent in his loose fitting shorts. He grabs his cock through his shorts as he starts to tease his boner. His cock strains against his shorts as you see its massive outline wanting to be set free. He works it with both hands enjoying the sensation of the fabric against his growing cock. He pulls his shorts down as his uncut cock finally comes into view. He is hard in seconds as he kicks off his shorts. He spreads his beefy thighs giving his big balls room to breathe as he smacks his fat cock. Van's uncut cock is rock hard and at attention you could see why some would think twice before letting him slide it anywhere. He double-fists his massive cock as it throbs at his touch. He sits up as he continues to work his meat. His big balls are smooth and bounce freely as he works his horse cock harder. Van is naturally smooth and has light fur that starts with a happy trail that leads south to bigger pastures. His light fuzz covers his crotch and his inner thigh then dissipates as you reach those sexy thighs. As he strokes his meat, Van tugs and slaps his low hangers making his cock rock hard. He moves the party to the chair where he keeps stroking and slapping that fat cock of his as he gets closer to climax. He works that cock and all it's sweet spots and as he gets close he stands up to give us a better view of the fireworks. He moans as his balls finally give up their thick cargo. His busts his creamy nut as it splatters all over the glass top below. Whew.",
  "models": [
    {
      "name": "Van Wilder",
      "person_id": 28816
    }
  ],
  "release_date": "2013-01-16",
  "scene_id": 55071,
  "series": "Morning Would",
  "tags": [],
  "title": "Morning Would, Scene #01"
}