{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Well, today we get to see El Maximus and his huge schlong in action as we welcome Tristan Sterling to the mix. We knew Tristan would be perfect for the task since he's a firm believer in bigger is always better. El Maximus, for those of you who missed his stellar debut, starting off the New Year with his 11' uncut python, is originally from Chicago. This hung 24yo is now living in Louisville and driving the locals crazy with his 'charms'. By that we mean his...you know. Tristan Sterling is 22yo now and he's a Florida boy, hailing from Orlando, FL. This is their first sexual encounter of the year and they're both happy they had each other to ring that in. When we asked these two what the best sex they had all year was they both agreed a fuck session they had last October when EL Maximus fucked Tristan holding him up in the air then pinned against the wall. Tristan is not new to that massive cock and he confesses that with a dick as big as El Maximus' when it feels good it feels REAL good. The trick is being patient; since it takes a while to get used to it. El Maximus agrees it's both a blessing and a curse. 'When I fuck somebody I'm always the biggest' he says 'but not everyone can take it so it doesn't always feel good.'...amateurs!Tristan knocks on the door wanting to give El Maximus a package accidentally dropped off at his place. When the door opens, he's greeted by El Maximus who has his own package sticking out of his fly as Tristan lets himself in. 'Put that package right there,' he grins 'this is your package!' Tristan doesn't need to be told twice as he falls to his knees and wraps his lips around that monster cock. It gets harder by the second as Tristan struggles to take as much of it as possible. They move the party to the couch where Tristan continues worshiping that uncut meat sliding it down his throat. El Maximus just lays back and watches as his fat cock disappears into Tristan's eager mouth. Tristan then gets put on his knees so that he can get his face fucked for a while as El Maximus gets ready for that ass. He pulls Tristan to his feet and strips off his pants to see that sweet ass again. He slaps that ass as Tristan assures him he could slap him harder. El Maximus then sits back as Tristan straddles his fat dick and impales himself right on it. He holds that little ass in place as he shoves that fat cock right inside. Tristan's ass welcomes him in taking all of it to the hilt. Do not try this at home, Tristan is clearly a professional. Tristan moans as he gets that hot ass stuffed as El Maximus starts to slam that cock deeper and deeper. Missionary is next as Tristan gets on his back for more fucking. El Maximus pounds him deep and hard making Tristan blow his nut all over his alabaster navel. He then pulls his fat python out and unloads his own batch all over one cum-covered but extremely satisfied, Tristan.",
  "models": [
    {
      "name": "Tristan Sterling",
      "person_id": 28071
    },
    {
      "name": "El Maximus",
      "person_id": 28882
    }
  ],
  "release_date": "2013-01-23",
  "scene_id": 55073,
  "series": "The Package",
  "tags": [],
  "title": "The Package, Scene #01"
}