{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have a special treat for our new friend Damian Taylor, as we welcome back fan favorite Joe Parker. Since you're already familiar with these two hotties, we figured we'd dive right in. Hindsight is 20/20 and we wondered looking back, what was their earliest memory that they now realize would've been perceived as 'gay' even though they may not have seen it that way as a younger man. Damian remembers always wanting to grow up and have a family with Billy or Tom. It was never girls. Yeah, that'll do it. For Joe, his earliest memory was the first grade when all the other boys brought in GI Joe dolls to play with; Joe brought in his My Little Pony. <Awkward...yet, totally awesome!> This is Damian's first hardcore and admits after doing a couple of scenes he now watches porn differently and admits he now can see how things were achieved where before he had never given it much thought. Joe never really watched a lot of porn, he always preferred to have sex himself; instead of watching others having sex. Well, it's that kind of do it yourself attitude that's not helping our industry out one bit. LOL So, enough witty banter, Mr. Parker, and lets put that mouth, and thick cock, of yours to better use.Damian lay down on the couch in his sexy orange undies last night. Joe comes out to have some breakfast and discovers him instead. Hmmm. That ass looks irresistible as Joe kneels behind him; pulls them down; spreads that cinnamon ass apart and slides his tongue inside. Damian moans as Joe does his magic. 'You got such a pretty ass.' Damian gets up as Joe strips his briefs off altogether and bends him over for more. Damian arches his back giving Joe all the room he needs to eat that ass out nice and deep as Joe tugs on Damian's cock. Damian figures he could use that mouth on his cock too as he sits on the couch's arm rest and watches as Joe starts to suck his hard cock. Joe takes his time savoring Damian's cock. Joe hauls out his thick cock and starts to stroke it making Damian's mouth start to water. He leans forward as they get into a hot 69 as Joe nurses on Damian's dick and Damian gets to bob his head up and down on Joe's. Joe's fingers soon start to explore that tight ass and that cock of his knows what it wants. Joe suits up and sits back as Damian straddles and impales himself on that cock. He grunts as he takes that cock with Joe slamming it up inside him. He gets up and repositions himself into a reverse cowgirl giving us a better view of his sweet ass getting stretched by Joe who starts pounding that hole even harder. From there Joe gets him to stand fucking him doggy for a while before finally wrapping things up on the floor. Joe lies behind Damian and fucks his sweet ass deeper and harder as Damian strokes his cock. Joe rails away into that hole and it sends Damian over the edge as he blasts his load all over his sun-kissed abs. Joe's is next as he pulls out and shoots a huge wad all over Damian's cum covered cock and ass.",
  "models": [
    {
      "name": "Damian Taylor",
      "person_id": 28526
    },
    {
      "name": "Joe Parker",
      "person_id": 28044
    }
  ],
  "release_date": "2013-02-13",
  "scene_id": 55075,
  "series": "Nip it in the Butt",
  "tags": [],
  "title": "Nip it in the Butt"
}