{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "What's new this week you ask? Well we have two studs to introduce to our members. The first is Ayden Anderson. Ayden is from the Mississippi Gulf coast. He's 22 years old and has a compact and amazingly defined 5'8 frame. His costar is Evan Tanner. Evan, also 22yo, hails from Nashville. That subtle twang might've given him away. Who doesn't love a hot Southern boy? Evan is enjoying Florida and loves being near the beach. Having both grown up in the electronic age we asked these two what gadget could they not live without. Evan immediately says it would have to be his phone. He loves all the things he can do with it and couldn't live without his texting and multiple apps. Ayden on the other hand says his weakness would be his XBOX 360. He would die without his Call of Duty. Boys and their toys. <evil grin> They can never seem to get enough of them. Today we've decided they've spent enough time playing with their own toys and about time they play with each others instead. Evan is listening to his music when Ayden comes in with a change of plans. He starts rubbing his crotch as his mind lands in the gutter. Oh Goody! He bends over and kisses Evan as they begin to make out. They kiss passionately as they strip off their clothes. Once down to their briefs, Ayden lies back and watches as Evan goes to work on his thick cock. Once he's had his fill he sits back so Ayden can go to work on his. Ayden swirls his tongue around Evan's shaft as Evan moans. But wait-there's more. He then turns Evan around and puts that tongue to use getting that smooth ass ready for the fucking he intends to give it. He grinds his tongue up into that sweet ass and starts to play with that hole with his fingers. He slowly fingers that ass before going right back down to lick and suck it some more.Ayden moves into position and slides that thick 8' cock in without a problem as Evan's hungry hole takes it deep. The sound of Ayden's balls slapping ass and Evan's groaning fill the room as Ayden starts to fuck him harder. From doggy they move into a steamy missionary where Ayden finds new angles in which to bury that thick cock of his. Ayden's body is chiseled and good luck finding any body fat on his marble like abs. They then move over to the couch where Ayden fucks that ass hard as he bounces Evan on his meat some more. They won't be able to keep this up for long as Ayden's smooth balls are pulling up close to his thick cock. They dismount and lie back side by side as they cum all over themselves while making out. Evan explodes first followed by Ayden who shoots his nut all over Evan's spent cock..",
  "models": [
    {
      "name": "Ayden Anderson",
      "person_id": 28361
    },
    {
      "name": "Evan Tanner",
      "person_id": 28362
    }
  ],
  "release_date": "2013-04-10",
  "scene_id": 55081,
  "series": "Supersized X 2",
  "tags": [],
  "title": "Supersized X 2"
}