{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have two surprises for our members. First, it's the return of Damon Audigier. It's been a while since we've seen this hottie and we're really glad to have him back in the house. We also have a fan favorite from our brother site, ExtraBigDicks making his debut with us. Parker Brookes is back and we're sure you're in for a hot time with these two horny studs. Parker is originally from Mobile, AL and this sexy 22 year old with those pouty lips is a welcome site no matter what site he's on. Originally from Clinton, OK, Damon is 20 years old and a long way from Oklahoma. They are both connected with technology these days and both have their trusty cell phones, Droids and iPhones alike. We asked them what their favorite app was. For Damon, he loves his Twitter app; while Parker loves Facebook and networking apps. Fortunately they are both responsible cell users and neither of them text and drive. Damon is currently single so any of you interested better bring your ?A? game. Parker, on the other hand, is currently seeing someone. Some guys have all the luck. Well today he's all ours!These two get right to it and before we start filming they're going at it. Now there's commitment. LOL Damon kisses Parker as he helps Parker undo his shorts. A quick tug or two and Parker is left in his sexy boxer briefs. Damon starts to lick Parker's chest and nips as he makes his way south to the tent that's popping up. He teases that throbbing cock for a bit before pulling Parker to his feet. Damon then kneels before him and officially unveils that thick meat. He licks along the shaft before engulfing it inside his hot mouth. Parker has a sweet cock and Damon's putting it to good use. Parker slowly fucks Damon's face as Damon deep throats his aching cock causing him to gasp and groan. We get a sweet view form below as Damon works that meat showing off Parker's cock and naturally smooth balls. Parker then returns the favor as he pulls out Damon's 8? cock. He services that dick as Damon watches. Parker uses his hot mouth as he strokes Damon's thick meat. Damon's naturally hairless and keeps all his parts just as smooth. Parker's tongue doesn't seem to mind one bit.Parker is ready for more as he bends Damon over. Parker moves in for a closer inspection of that hot ass. He spreads open his beefy cheeks exposing that tight, smooth ass he'll soon get to dick. He fingers that ass which just makes Damon hornier. He runs his tongue around that sweet spot making Damon's head spin. Parker then gets Damon on his back and slowly slides his thick dick inside. Soon he's pumping away at that hot ass as Damon holds his legs up in the air. Parker's pole slices into that hot ass with ease as he starts to pick up the pace. Damon takes all the dick he's given like a champ. Parker pulls out and gets Damon on his feet. He bends him over and fucks him doggy. His balls slap away at that hungry hole as he pounds him deep. Damon grunts as he gets his ass fucked. Parker holds him by the waist while he jack rabbits into that ass. Parker then sits back and tells Damon to sit on his dick. Damon slides that hot ass back onto that dick and starts to ride that cock. Parkers cock hits Damon's prostate just right and as Parker pounds him from below, he explodes. Damon shoots all over himself with Parker still buried inside. Parker then takes care of his own dick as he unloads all over his sexy happy trail.",
  "models": [
    {
      "name": "Parker Brookes",
      "person_id": 28348
    },
    {
      "name": "Damon Audigier",
      "person_id": 30777
    }
  ],
  "release_date": "2010-07-30",
  "scene_id": 55088,
  "tags": [],
  "title": "Park & Ride, Scene #02"
}