{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "This week we have one of ExtraBigDicks favorite sons back in the house as we welcome back hung hottie Mario Costa. It's been a while since we've had this Cuban hottie and his anaconda with us and as lucky as we are to have him back, this week's costar, Isaac Hardy, is going to be even luckier. Isaac makes his debut with us and this 21yo from Malibu, California is definitely in for a good time. We started off by asking these two who the last adult performer they saw that got them hard was. Damian Cross was the last one that made Isaac hot enough to have to beat off and Mario's favorite is Rod Daily. I guess that dispels the myth that porn stars have so much sex they never need to jerk off. We asked Isaac how the reality of shooting porn was versus his expectations. 'It's a lot more work than I imagined' he admits. Mario concurs admitting sometimes it's easy but then other times a shoot can take 11 hours. Well we don't have 11 hours to spare so let's get this show on the road. Isaac is looking forward to that big dick he's heard so much about. Let's not keep the boy waiting...Isaac and Mario come back from a game and make themselves at home as they discuss plans for the night. Isaac takes off his tee as he says he may go for a beer later. Mario can't help but notice his defined chest and abs and tells Isaac he's looking good as he pulls off his own shirt. That just leads to a make out session as they both strip down to their briefs. Mario goes down to check out Isaac's cock as he pulls off his underwear and gets to work on that dick. Isaac moans as Mario swallows his cock to the hilt. After a while Isaac feels he needs to return the favor as he switches places with Mario. 'Holy Shit' he gasps 'it's huge!' Isaac opens wide and takes Mario's meat as far as he can. Mario just moans as he watches Isaac go to town on his thick uncut cock. Isaac swirls his tongue on the head of that fat dick, taking his time as he worships every inch Mario's giving him. From there they maneuver into a hot 69 so they can each get all the cock they could want. All this oral just gets Mario's dick ready for more. He suits up and sits back as Isaac slowly impales himself on his cock. Isaac takes it like a champ as he slides that tight ass all the way down until Mario's balls are up against his ass. He starts to ride that cock as his eyes roll back in ecstasy. He loves that big dick up his ass as he starts to bounce on that dick harder. 'That's huge!' he says over and over as Mario's cock stretches his ass wide open. Mario then bends Isaac over and fucks him doggy as Isaac just groans and begs for more. Mario's cock is buried deep inside that ass and Isaac can't seem to get enough. Missionary is next as Mario gets right back to tappin' that ass with Isaac still struggling to accommodate his fat cock. That fat dick does the trick as they both near climax. Mario pulls out and sits above Isaac's head and jacks his thick load all over Isaac's chest as Isaac blows his own wad all over his happy trail.",
  "models": [
    {
      "name": "Mario Costa",
      "person_id": 28031
    },
    {
      "name": "Isaac Harvey",
      "person_id": 28898
    }
  ],
  "release_date": "2013-04-24",
  "scene_id": 55084,
  "series": "Heavy Hitters",
  "tags": [],
  "title": "Heavy Hitters, Scene #02"
}