{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Brandon Lewis is back with us this week, here to help us welcome a new face to CircleJerkBoys. For those unfamiliar with Brandon, Brandon is a Southern son with a room-brightening smile, that Georgia twang in his voice and a thick dick to boot. Brandon is going to help us determine if it's true that they really do grow them bigger in Texas. Wayne Manley is 25 years old and from the Lone Star State. ?Steers and Queers? they say, so we're gonna have to figure out which category this young stud falls into. Wayne is a relaxed, laid back kind of guy. His favorite thing to wear is his vintage Mickey Mouse tee. Brandon is also laid back. His favorite article of clothing is a pair of tight blue jeans. He loves to see a pair of tight blue jeans on hot guys and girls. Even though they both work in porn, they both still use porn to get off to. We asked these two what the weirdest place was where they've gotten their rocks off. Brandon, grinning ear to ear, admits he is a proud member of the Mile High Club. Hmmm. That must've been a tight fit with all that country boy plus one shoved into one tiny bathrooms. For Wayne his list is topped by sex at a downtown bus stop... (We're not touching that one!)They get better acquainted as their hands begin to roam. Their lips meet as they begin to kiss softly. Brandon peels off Wayne's shirt as he begins to lick all over Wayne's chest and torso which has some impressive ink on it. Wayne has tattoos scattered throughout that sexy, naturally smooth body of his. Brandon starts to work Wayne's cock through his briefs as it grows and gets rock hard. Once Brandon hauls that thick dick out, we can concur that things really are bigger in Texas. Wayne gasps as Brandon goes to work on his throbbing cock. Brandon's own cock is rock hard and straining against his briefs. It won't be feeling left out for long as Wayne drops to his knees wanting a taste of the South himself. Brandon's thick dick comes out to play as we hear Brandon say 'Stick it in your mouth!' You don't have to tell Wayne twice, as he throws that cock as far down his throat as he can. Brandon's cock is finally getting the attention it deserves as he talks to Wayne, telling him how good it feels and just how to do it. Tall, hot and verbal?who IS this guy? He continues to fuck the new guys face before ordering him onto the couch. Wayne gets on all our as Brandon starts playing with that hot hole. He gropes and fingers that hairy hole making Wayne even hornier for it.'You want that big cock in your ass?' Brandon teases before getting Wayne on his back so he can slide that ass stretcher deep inside. Wayne's ass is as ripe for fuckin' as a Georgia peach for picking' as Brandon slides that cock in ball deep. Wayne just grunts as Brandon fucks that ass. An over head shot shows us the action as Brandon pistons that dick in and out of Wayne's hungry hole. Brandon then switches things up as he gets Wayne partially kneeling on the couch for a proper fucking doggy style. He pushes Wayne forward into position and slams that dick right back into that hot ass that can't seem to get enough dick. Brandon's heavy balls slap away at that hole as Wayne does his best to jack his throbbing cock and not lose his balance. Brandon is fucking that ass as he fronts and groans. He means business and he ain't messin' around. 'Wanna ride my dick?' he asks as he sits back and watches Wayne sit down on his thick cock reverse cowgirl. Wayne rides that dick like a pro as Brandon grabs his waist and helps him get that dick even deeper. 'You like that dick, don'tcha?' Brandon grunts as he gets closer and closer to climax. Once they are both close, they dismount and blow their wads all over themselves as they egg each other on.",
  "models": [
    {
      "name": "Brandon Lewis",
      "person_id": 27916
    },
    {
      "name": "Wayne Manly",
      "person_id": 28357
    }
  ],
  "release_date": "2010-06-18",
  "scene_id": 55098,
  "series": "Manly Love",
  "tags": [],
  "title": "Manly Love, Scene #02"
}