{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have two favorites back in town! We're happy to have Richie Sabatini and Danny Brooks. Richie is 22 years old and a home grown boy from right here in Miami. He's from Miami, Bitch! Danny, who's been gone for over a year, is 25 years old and from Arizona. Danny's back to show us more than just his papers this week and we can't wait to get reacquainted with this hot stud. Both of these studs are young, hung and in peak shape. We asked them if they were able to pick what animal they came back as in their next life, what animal would that be? Richie immediately said he'd want to be a bird or anything that could fly. He best be specific or he'll come back as Rocky, the flying squirrel. Richie wants to be able to fly high and look into condos where hot guys are fucking and get a bird's eye view?literally. Danny wants to be a Lion, '...because of the actual sophistication and the actual domination of the kingdom.' Riiiight. We think he just wants a pride of lionesses doing everything for him. We then asked them if there was any one person they would switch places with for 24 hours, and lead their lives. Richie wants to be Hugh Heffner. (...there's a fantasy totally lost on most of us); while Danny wants to be the President of these United States.They start to make out as they help each other out of their clothes. Both of these studs are naturally smooth and they have sexy defined bodies. Danny's tongue finds its way to Richie's nipple as it begins to explore his delicious chest. Richie then decides to take his own tongue on an expedition as he licks down Danny's abs heading for the growing bulge in his briefs. Richie teases him a bit before hauling out his growing cock as he pulls Danny's brief to the side. He swallows Danny's cock to the hilt as Danny moans and groans his appreciation. Richie knows just what to do on that rock hard cock and he soon has Danny exactly where he wants him. Danny then asks if he can return the favor. He drops to his knees as Richie obliges. Richie's cock is rock hard in anticipation as Danny start to lick his smooth low hangers. He takes his cock in his mouth as he looks up at Richie with lust in his eyes. ?Oh yeah, that feels so good? coos Richie as he watches Danny suck on his throbbing meat. Danny takes his time as he works all over Richie's hard cock and balls. Richie begs him to deep throat his cock unable to get enough of Danny's hot mouth. Can't say we blame him really.They then get into a steamy 69 so they can both get more dick to suck on. Danny takes top bunk as his head bobs up and down on all the Miami meat he can handle. Richie is on his back sucking dick and already exploring that sweet smooth ass he'll soon be plowing. ?I want that ass? he says as he playfully slaps Danny's ass. ?Oh, slow down? begs Danny as Richie starts fucking his sweet ass. Danny's bent over the couch arm and taking Richie's cock doggie style. Richie's cock feels amazing and it feels way to good to slow down as he continues tapping that sweet ass. Danny then wants that cock in another position as he moves over to the chaise and gets on his back. Richie's one step behind him as he quickly slides his dick back in for more. Danny grunts as Richie continues to stretch is ass wide and bury his meat deep. A shot from the back gives us a jaw-dropping view of Richie's own hot ass as he buries that dick into Danny's. Richie then gets Danny into a hot pile driver position as he slowly does squats into that hot hole. Richie's dick is rock hard and Danny looks insanely hot as he holds his legs wide open in a spread eagle. Soon they're both ready to explode as they sit back side by side and unload their hot loads all over themselves.",
  "models": [
    {
      "name": "Richie Sabatini",
      "person_id": 28328
    },
    {
      "name": "Danny Brooks",
      "person_id": 28350
    }
  ],
  "release_date": "2010-07-23",
  "scene_id": 55090,
  "series": "Brooks Gets Done",
  "tags": [],
  "title": "Brooks Gets Done, Scene #02"
}