{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Today we have a welcome blast from the past with us?Mr. Dallas Reeves. It's been a while since we've seen our favorite Texan. Dallas lives up to his name as the ?They grow 'em big in Texas? guy. Dallas has a fan following that can't get enough this 6'3 blond hottie. We can't blame them and this week Dallas is here to help introduce a new face to CircleJerkBoys.com. Hailing from Idaho, this weeks discovery is the epitome of the Midwestern corn fed hottie next door. Charlie Adams is a young 20 years of age and this hot ?ginger' is one of those str8 boys we all look forward to corrupting. Charlie is a slab of beef cake we can't wait to undress. They're both in great shape so we asked them what their guilty pleasures are when they aren't eating well. For Dallas, it is Blue Bell ice cream and for Charlie, it is Nutter Butters. Having had a chance to explore new things working in the industry we asked these two if there was anything they've discovered they were into now that they might've never considered otherwise. Much to our surprise the str8 boy loves the whole BD/SM scene. Something tells us this str8 boys not talking about ?Standing and Modeling?. Dallas on the other hand says he just loves it ALL!  lolCharlie's on the phone trying to get some but those plans fall through. He starts to tell Dallas how much his balls hurt after striking out with his girl. Dallas moves in for a closer inspection and as he grabs Charlie's crotch he discovers poor Charlie's already hard. Dallas makes his move as he softly starts to kiss the now curious Charlie. Dallas' hands grope Charlie's crotch and once he feels he's at full mast he goes down on him. Charlie gasps as Dallas starts to suck on his thick cock. Charlie's body is as hot as we imagined. His skin is pale and his thick cock has a light patch of ginger pubes. His chest and abs are naturally defined and his porcelain skin is awash with a light dusting of freckles. Dallas can't get enough of Charlie's str8 meat. Dallas then sits back and watches as Charlie does his best to return the favor. Charlie goes down on Dallas' throbbing cock. As he does, we get our first view of Charlie's smooth ass. Charlie's has muscular thighs and a beefy ass that just screams EAT ME?so Dallas does. He parts those beefy cheeks and dives right in tongue first. The look on Charlie's face says it all as Dallas continues to tongue fuck that hot ass and get it ready for much more.On his back, Charlie braces himself as Dallas begins to slide his dick inside him. It takes a bit but soon Dallas is steadily fucking Charlie's ass. Charlie's tight ass feels insane wrapped around Dallas' cock. Dallas fucks Charlie missionary kissing the newbie as he grimaces. Dallas then switches it up and gets Charlie kneeling and bent onto a chair. He moves into position behind him and enters that sweet ass for more. An aerial view shows us Dallas' cock pounding Charlie's hot ass. His broad shoulders tapering into that small waist and that beefy ass make for one intoxicating visual. Dallas has the best view in the house as he takes that hot ass. Dallas then sits back on the couch as Charlie straddles his cock and impales himself in a reverse cowgirl position. He starts to ride that cock as Dallas watches his cock disappearing into that hot ass. All the new sensation has our str8 boy in overdrive and he's ready to explode. They dismount and jack themselves off side by side as they both blow their wads all over their smooth chests and abs.",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    },
    {
      "name": "Charlie Adams",
      "person_id": 28353
    }
  ],
  "release_date": "2010-07-09",
  "scene_id": 55094,
  "series": "Adam & Reeves",
  "tags": [],
  "title": "Adam & Reeves, Scene #02"
}