{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Aiden Lane is back in the house and he's always a welcome sight! For those of you who aren't familiar with Aiden, he's 24, originally from California, but has called Florida home for a while. Aiden is just making the tropics that much hotter. Aiden is here this week to help us welcome a new face on our site, Micah Andrews. Micah is 21 and from Boulder, CO. It almost sounds believable if it weren't for that unmistakable southern twang. Micah is actually from Tennessee. After several moves now, he resides in Boulder. Both of these boys love to eat. They are both more into the meat vs. the sweets. They have both been with girls in the past. Aiden gets masculinity and aggression from having sex with men while Micah gets reliability. ?I can't lie I like to bottom and a girl just can't do that for me? Micah grins. Yeah, a strap on just isn't the same is it? (that was rhetorical) We asked them what the hottest sexual experience they'd had to date. Micah, whose already working the tent he's popped during the interview says it was a recent experience with another ?performer?. Aiden's was fucking some girl back home outside her house up against her Daddy's work van. Really, Aiden? ?here we were expecting something ?crazy?. lolThey start making out as Micah starts to explore Aiden's smooth chest. They both lick and suck each others pecs as they undress. Micah gets stripped by Aiden who can't wait to get into his pants. They continue to kiss as Aiden gets Micah where he wants him?naked and ready for action. Aiden starts to pull down Micah's boxers as his finger finds that ass he'll soon be inside of. He takes a quick dip in that pool before getting back to basics and getting his dick wet. Micah takes Aiden's rock hard cock in his mouth as he deep throats as much of it as he can. Aiden is rock hard. He loves the attention Micah is giving his cock. They make out some more before Aiden takes his time face fucking Micah. Micah does his best to take that dick as Aiden tries to force it even deeper. Micah spits on his cock as he savors every inch. ?I can't wait to fuck your tight little ass? Aiden moans under his breath as Micah works that dick with his fists and hot mouth. Aiden then preps that ass by shoving that tongue inside. Micah has one hell of an ass. Aiden knows it's gonna look even better wrapped around his thick dick.?You want this cock?? Aiden teases as he stands and starts to slide his cock inside. Micah's perfectly smooth ass concedes as Aiden buries his thick cock deep. Soon Aiden's balls are bouncing on that hungry hole as he starts fucking Micah doggy style. Micah grimaces as he tries his best to accommodate his new friend. Aiden slides that cock in and out with ease as he strokes Micah's cock. ?I'm gonna fuck the shit out of you? Aiden teases as he starts to fuck that ass harder. Aiden then moves the party over to the couch where he gets that sweet ass way up in the air making it easier for him to fill it full of dick. He grabs it and holds it still while he sinks that meat in for more. Micah can't help but jack himself off as he begs for Aiden to talk dirty to him; call him his bitch and do anything he wants to him. YUM! Aiden slaps that pretty face and pounds deeper making Micah even hornier. Aiden then sits back and watches as Micah squats on that cock of his and starts to ride it. After Micah rides his cock for a while, he leans back. Now it's Aiden's turn. Aiden starts slamming that cock up into Micah's ass. It's enough to send him over the edge. Micah shoots all over his smooth abs. Aiden then gets Micah on his knees and delivers an amazing pent up facial ALL over Micah's face and tongue. There's nothing better than an extra ?shot? of protein after an intense work out?and that was a double!",
  "models": [
    {
      "name": "Micah Andrews",
      "person_id": 28042
    },
    {
      "name": "Aiden Lane",
      "person_id": 28165
    }
  ],
  "release_date": "2010-06-25",
  "scene_id": 55096,
  "tags": [],
  "title": "Dick A Lane, Scene #02"
}