{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we've paired up two of our recent finds for some 'afternoon delight'. By that, we mean cock-filled fun of course. The first in the mix is 24 year old Phillip Heritage. Phillip first came to us for a simple solo. This sexually hesitant str8 boy has come a long way since we first met. Phillip eventually learned to explore new things. He now appreciates what another man bring to the tab?err Bedroom. He's mastered oral, fucked his first ass with us, and today is back to have that sweet ass filled again. Helping us out is a special hottie who helped kick off 2010 with a ?bang? literally, Mr. Cameron Marshall. Cameron is 23 years old and originally from Texas. Cameron is up for a real treat, tapping Hoosier hole. These two happen to have a lot in common. Seems both these studs enjoy partying and drinking whenever they find free time. How un-American, right? Pffff They both discovered their cocks at about 11. Neither of them have stopped jackin off since they discovered their pea shooter did tricks. When they're not beating off, their favorite way to cum varies. Cameron needs someone that can take dick for a long time cuz he's not a quick fuck while Phillip just wants a dirty visual to watch to send him over the edge. Well, we're hoping we can marry those two and get a long, hot fuck session that will give US something dirty to jack off to.They start to kiss as they peel their clothes off. Phillip takes off Cameron's shorts as he makes his move south. He starts to tease Cameron's growing cock through his briefs. Those briefs are short lived as Phillip pulls them off and gets that Texan totem wet. He goes down on Cameron's cock and sucks it deep before coming off of it to lick at Cameron's smooth balls. Cameron's thick cock is rock hard and being sucked and adored as Phillip makes himself gag on it, overcome with ?appreciation?. Cameron then gets Phillip up so he can get some dick of his own. Phillip's cock is already boned as his shorts come down. Cameron goes down next as he swallows Phillip's meat. Phillip is naturally smooth just like Cameron. Cameron's hands roam as his mouth continue to work on that thick cock. After a bit Cameron stands up against the wall and gets Phillip back on his cock. He holds Phillip's head as he fucks his face. He wants that dick hard enough to easily bury. Phillip doesn't mind one bit as he does his best to keep up with Cameron's desire.Phillip gets bent over on the couch as we see Cameron start to bury that thick dick into that hot ass. Phillip does his best to accommodate Cameron who isn't waiting around to get his. He's fucking that ass deep in no time. From that position, they switch it up, as Cameron sits back and watches Phillip sit on it. His ass slowly gives way as he takes as much of it as he can in that tight ass. He struggles to relax to take the last couple inches inside but decides a reverse cowgirl position might be easier. He remounts that hard cock while Cameron just watches him figure out how to take his meat. Phillip rides Cameron for a while before Cameron bends him over and fucks him doggy. In this position, Cameron can gauge just how deep he can get that dick in. Phillip grunts and moans as Cameron stretches that tight ass wider and wider. Cameron the puts Phillip on his back and slides back in missionary. More dick for Phillip whose ass is now loving the fucking it's getting. Cameron's cock is rock hard as he watches Phillips ass take it deep. Once they get close, they fall back on the couch together, stroking off their loads all over their cocks.",
  "models": [
    {
      "name": "Cameron Marshall",
      "person_id": 28354
    },
    {
      "name": "Philip Heritage",
      "person_id": 28360
    }
  ],
  "release_date": "2010-06-04",
  "scene_id": 55099,
  "tags": [],
  "title": "The Marshall Plan, Scene #01"
}