{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "What's new this week you ask? Well we have two new studs to introduce to out members. The first is Ayden Anderson. Ayden is from the Mississippi Gulf coast. He's 20 years old and a compact and amazingly defined 5'8 frame that packs an 8? cock. His costar is Evan Tanner. Evan is also 20 years old and hails from Nashville, TN. That subtle twang might've given him away. Who doesn't love a hot Southern boy? Evan is enjoying Florida and loves being near the beach. Having both grown up in the electronic age we asked these two what gadget could they not live without. Evan immediately says it would have to be his phone. He loves all the things he can do with it and couldn't live without his texting and multiple apps. Ayden on the other hand says his weakness would be his XBOX 360. He would die without his Call of Duty. Evan bloomed early and grew pubes by freshman year where Ayden was a late bloomer. Both of these studs had their first orgasms at about 16 or 17 with their respective girlfriends at the time. They both agree they appreciate a good tongue and while Ayden loves having his balls licked, Evan likes his balls or neck licked. Once they get bones up Evan loves to stick his cock in a hot mouth while Ayden wants a hot ass to stick it but his ?girlfriend won't let him?. Riiiiight.Evan is listening to his music when Ayden comes in with a change of plans. He starts rubbing his crotch as his mind lands in the gutter. Oh Goody! He bends over and kisses Evan as they begin to make out. They kiss passionately as they strip off their clothes. Once down to their briefs, Ayden lies back and watches as Evan goes to work on his thick cock. Evan swallows his thick dick to the hilt. Once he's had his fill he sits back and starts to rub his own growing cock. Ayden takes the hint as he goes to work on Evan's thick cock. Ayden swirls his tongue around Evan's shaft as Evan moans. For a boy whose girlfriend won't give him anal he sure sucks a mean dick. But wait?there's more. He then turns Evan around and puts that tongue to use getting that smooth ass ready for the fucking he intends to give it. He grinds his tongue up into that sweet ass and starts to play with that hole with his fingers. He slowly fingers that ass before going right back down to lick and suck it some more. Once that ass is spit lubed and ready to plunder; Ayden moves into position.Ayden slides that thick 8? cock in without a problem as Evan's hungry hole takes it deep. Evan is in for one hell of a ride as Ayden starts to pound his hole. The sound of Ayden's balls slapping ass fill the room coupled with Evan's moans and groans. From doggy they move into a steamy missionary where Ayden finds new angles in which to bury that thick cock of his. Ayden's body is chiseled and good luck finding any body fat on his marble like abs. He fucks Evan hard on a bean bag and he isn't letting up anytime soon. Evan just moans and takes it as Ayden fucks him silly. They then move over to the couch where Evan sits on that thick cock for more. Ayden fucks that ass hard as he bounces Evan on his meat some more. Ayden jacks Evan's thick cock off as he's fucking him and it's making Evan crazy. They won't be able to keep this up for long as Ayden's smooth balls are pulling up close to his thick cock. They dismount and lie back side by side as they cum all over themselves while making out. Evan explodes first followed by Ayden who shoots his nut all over Evan's spent cock.",
  "models": [
    {
      "name": "Ayden Anderson",
      "person_id": 28361
    },
    {
      "name": "Evan Tanner",
      "person_id": 28362
    }
  ],
  "release_date": "2010-05-28",
  "scene_id": 55102,
  "tags": [],
  "title": "7 Minutes In Evan, Scene #02"
}