{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we have two brand new faces for you on CircleJerkBoys.com. The first debutante is Justin Cox. Justin is tan and chiseled. He's 23 years old. He proudly tells us he's from Jersey, with that trademark accent. I think we got ourselves a 'situation'. Can't you just picture this ripped hottie shirtless at a bar, pounding the beats with a sexy fist pump remix session on an episode of 'Jersey Shore'? Justin would have all those girls drooling over this jaw dropping hottie. Well back off, Bitches-he's on our team-and you can't have him. Sean Adair is the second half of the delicious debutantes. Also 23 years old, Sean is from the West Coast. Justin's gonna have fun exploring the west coast, East coast style. They are as different as their hometowns. Sean would love to see Paramour given the chance, where Justin would love to see P!nk in concert. They both remember their first ventures into the adult video realm. Justin was about 12 when an older teen he hung out with brought over porn. 'It was interracial, and there were these big black guys railing these small white ladies' he giggles. Apparently no therapy will ever shake that footage from his mind. Sean's first was some military video that he still remembers fondly. Well, here these two are today about to film their own footage which may be the very video future hotties will remember as their firsts. Oh the pressure!Justin is sitting on the couch playing with a basketball when Sean walks in and decides to give him something better to play with. They start making out. They are soon in their briefs, as Sean goes south to discover just what Jersey's brought to the table. He's pleasantly surprised once he gets Justin's thick dick out. Justin is naturally smooth. He has an all over tan. Sean swallows every inch of his dick deep as Justin gasps and moans. He holds Sean's head as he helps guide his mouth up and down on his throbbing cock. Sean is worshipping that dick. Justin isn't about to stop him anytime soon. Justin is lean - the dedication at the gym has paid off. He also has a sweet tat on his right bicep that just adds to the bad boy factor. Sean then lies back as Justin gives him some of the same. Justin sucks on Sean's thick cock while Sean closes his eyes and revels in the new sensation. Sean also has ink scattered throughout his mostly smooth bod. Sean is soon ready for more of Justin as he gets on his knees and bends over so that Justin can have his ass. Justin doesn't need an invitation and is soon all over that ass.Justin spreads his cheeks wide before sliding that hot tongue of his deep inside Sean's hot ass. Sean can only moan as Justin eats out that hole, getting it nice and wet for the fucking he's about to give him. Sean winces in pain as Justin slides that thick cock inside all the way to the base. 'Fuck my ass' Sean begs, as Sean obliges. A view from above gives us an insane shot of Justin's rock hard cock slipping in and out of that hungry ass as they both moan and groan in ecstasy. Justin can't get enough of Sean's hot hole and soon switches it up. He sits back and has Sean sit down on him in a reverse cowgirl as Sean starts to ride that thick dick. Sean knows exactly what to do on that east coast bone as he slowly impales himself, then grinds his hot ass deep once his ass hits the base. Justin sits back in awe as he just watches that hungry ass milk his dick. Justin then puts Sean on his back and goes right back to fucking Sean's hole. Justin loves watching his dick disappear inside a hungry hole. Once he gets Sean on his back, he starts to fuck even deeper. This sends Sean over the edge as he blows his wad all over his own cock. Justin then pulls out and blasts his own thick nut all over his cum drenched consort.",
  "models": [
    {
      "name": "Justin Cox",
      "person_id": 28366
    },
    {
      "name": "Sean Adair",
      "person_id": 28367
    }
  ],
  "release_date": "2010-05-07",
  "scene_id": 55107,
  "series": "Justin Time",
  "tags": [],
  "title": "Justin Time"
}