{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have a double dose of pretty this week as we pair up a couple of hot jocks with slamming bodies... and pretty faces. Don't hate. The first is Ryan Raz. Ryan, the blond blue-eyed stud with the rippled bod and the thick dick, is back. We're always glad to see the naturalized New Yorker with the Midwestern roots. The second treat this week is one we haven't seen since last fall when he had his way with Cuban heart throb Christian Castillo who bottomed for the first time ever. We welcome back Alex Foster. He's looking better than ever. Alex has lost the boyish shag, sporting a more controlled look.  We now get a better appreciation of that handsome face of his. We asked this picture of jockish perfection, were they to make a biographical movie about themselves, who would they want to portray them. ?James Napier? of Power Ranger fame, is Alex' immediate choice. Ryan goes with Scottish Ewan McGregor, a bit better known candidate and we can definitely see the resemblance. As for titles to these runaway block busters, Ryan went with ?Now or Never? while Alex picked ?Go for it? as his title. Well in the spirit of Going for it I think we should let these two do just that...The chemistry between these two has been apparent from the start, and we're reminded of it once they start to kiss. They can't get enough of each other or get each other naked fast enough. Ryan's down to his briefs, sporting major wood in no time. Even before Alex can get his pants off, he has that dick in his mouth. Ryan isn't about to complain as he gets his rock hard cock swallowed. Alex makes himself comfortable on his knees, as he makes love to that beautiful cock Ryan has to offer. Ryan then begins to feel left out as he pushes Alex off his cock and gets him to stand up so he can have some dick of his own. Alex is rock hard as Ryan pulls off his briefs. He feverishly begins to savor that dick. Alex holds his head by a fistful of blond locks and fucks his face. Ryan doesn't mind at all, as he shoves as much of Alex' meat down his throat as he can. This is going to be intense. These two work each other up as they lick, suck, and continue making out. Alex is back on Ryan's cock again as both of their tongues continue to roam freely on their hairless canvases.They won't be able to contain their desire for long. Alex soon gets up and plops himself on the couch, looking at Ryan, who immediately knows what to do. He straddles Alex, slides on a condom before aiming that California cock at that hot ass of his, and takes every inch of it. Ryan finally has that thick cock where he's wanted it all along. Alex is only more than willing to let him have it. He grinds that dick of his up into that hot ass as Ryan works that magic. They make out as they fuck each other silly. Soon, Alex needs more control. He bends Ryan over and starts pounding that hot ass doggy style. Alex is soon slamming that thick dick deep into Ryan as Ryan just moans and begs for more. Alex holds Ryan still with one hand as he continues to fuck that sweet ass. They then migrate over into missionary position, as we see even more action involving Alex' throbbing cock plowing into Ryan's sweet ass. He fucks his ass harder and deeper as they both get closer to exploding. Once they are near climax, Alex pulls out, and they both stroke their cocks off. Alex is the first to nut as he blows his wad all over Ryan's cock and balls, causing him to explode once his fist gets a warm lube infusion as Alex explodes all over it. Whew.",
  "models": [
    {
      "name": "Ryan Raz",
      "person_id": 27995
    },
    {
      "name": "Alex Foster",
      "person_id": 28365
    }
  ],
  "release_date": "2010-05-14",
  "scene_id": 55106,
  "series": "Raz Bury",
  "tags": [],
  "title": "Raz Bury, Scene #02"
}