{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "You're gonna love these two brand new faces. The first is Leo Paige. Leo is a fresh, clean cut face with a brilliant smile and a bit of a twang in his voice. Leo is from Atlanta, Georgia. He's a ripe 18 years of age. To his right is a tall drink of YUM that hails from our neighbor to the north, Canada. This self-professed gypsy is 19 years old and goes by ?Novack?, Isaac Novack. Novack's energy is as hot as he is. We asked these two if they could pick a role to have on any TV show, who would they be? Leo wants to either be or have Eric Dane on Grey's Anatomy. Novack smiles and says he'd want to be a Sex Planeteer on Captain Planet. Hmmm, now there's a delicious inter-galactic treat. They are both horny studs and have even been caught getting off. Leo admits his dad busted him and his boyfriend doing the deed in the car. Apparently, Leo's been caught a lot, and has even had the cops catch him in the act. Isaac had never been caught in the act until a couple days ago, while rooming with Leo, who walked in on him as he was 'cleaning his pipes'. Leo 's favorite way to cum is getting fucked, while Novack's favorite way to cum is by fucking a guy doggy and having his thighs and pelvis hitting the ass he's pounding. Hmmm, we sense a bit of foreshadowing...Leo starts taking some modeling shots of sexy Novack. Once they finish up, Leo starts to flirt and compliment Novack on his pretty eyes and how cute he is. That does the trick, as he goes in for the kiss. They start to make out and lose articles of clothing. Soon enough, they're buck ass naked on the couch, with Leo getting much better acquainted with Novack's thick cock. Novack lies back and just watches as Leo goes to work on that Canadian meat. Novack just moans as Leo's tongue drives him crazy. While Leo's busy worshipping that thick cock, we get an amazing view of that ass Novack will soon be filling up. Leo has a smooth ass with a light coat of fur in-between those cheeks, but that's not the only thing this stud brings to the table. Leo's packing' an impressive 8' cock. Now it's Novack's turn to show a little love. He takes his time as he swallows every inch of that cock while Leo whimpers in ecstasy. Leo runs his fingers through Novack's sexy curls as he bobs his head up and down on that thick stalk. 'I've got something to show you' teases Leo, before getting up and moving towards the couch. Once there, he gets up on the couch and puts his foot on one arm rest before doing a complete spread eagle as his other foot lands on the opposite arm rest. Dinner is served, Sir! Damn.Novack doesn't need to be told twice as he dives tongue-first into that hot ass. He licks and sucks that sweet hole 'til he's ready for more. Novack then sits back; suits up, and waits for Leo to get onboard. He doesn't need to wait long, as Leo straddles his meat and takes all of it to the hilt. Leo is soon riding that thick cock like a pro, as his own boner bounces like a spring board. Novack grinds up into that ass, wanting to get it in as deep as possible. Novack's balls slap Leo's ass with every thrust he gives him. The harder he fucks that ass, the deeper Leo wants it. Novack then moves him over to the chaise where he can get that dick in him doggie style. Once he slides back inside, he really starts to give Leo the dicking he's been needing. He slams that thick dick deep inside Leo, who now grunts trying to keep up with his new friend. Novack grabs Leo and makes out with him as he pounds him deeper and harder. Once Novack is done with that position, he switches Leo over onto his back and fucks him missionary. Leo takes it as long as he can before he hears Novack say 'I want you to cum, buddy' Not a problem for Leo, whose only request is to get fucked harder. Leo soon shoots all over as Novack pounds it out of him. Novack isn't far behind him as he too explodes his thick load all over a little Georgia Sunshine. Nice work if you can get it, eh?",
  "models": [
    {
      "name": "Isaac Novack",
      "person_id": 28363
    },
    {
      "name": "Leo Paige",
      "person_id": 30759
    }
  ],
  "release_date": "2010-05-21",
  "scene_id": 55103,
  "series": "Turning Paige Over",
  "tags": [],
  "title": "Turning Paige Over, Scene #01"
}