{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have two new faces for the CircleJerkBoys stable. We know you're gonna like these studs as much as we do. These guys are both down here on Spring Break, so what better way to have a great time while in Miami Beach than on our set? Originally from Boston, MA, (as if the accent wasn't a dead give away) Ryan Buckley makes up the first half of these hell raisers. Ryan is 23 years old. While he's been out and about enjoying the beach and the weather, he will soon be enjoying something else. That ?something else? would be a Denver tourist by the name of Jacob Tyler. Jacob is 24 years old. Judging from his tan, or lack thereof, he might need some more time in the sun before he returns to Colorado. We asked these two what their favorite food was. ?Cheesecake? is Ryan's immediate response. Didn't have to think about that at all. Jacob prefers pizza hands down. They both admit to being horny all the time and are both avid jackers. Jacob admits the weirdest place he's stroked is while driving home. Ryan confesses he closes his eyes when he nuts so that driving thing wouldn't work for him. But he does enjoy it at the beach, where he can often get ?help?.Ryan wastes little time before kissing Jacob. His hands immediately start to roam all over Jacob's 6' frame. He squeezes Jacob's crotch as they kiss and slowly start to undress each other. Ryan's cock is the first out. Jacob sees to it that it gets a warm reception. He sucks on that cock while Ryan fucks his face, trying to bury his thick dick as deep as possible. After Jacob's had his fill of Ryan's Bostonian boner, he lies back and lets Ryan return the favor. Ryan grabs Jacob's thick cock at the base and swallows it to the hilt. He expertly licks and sucks on his cock while remembering to pleasure his smooth balls. Jacob is naturally smooth. With the exception of some bush above his bone, he's hair free. He just watches in awe as Ryan sucks that cock like a champ. Ryan is gonna want a lot more than Jacob's pretty mouth wrapped around his dick, so he gets Jacob to suck his cock some more so he can get it nice and hard for what's next. Jacob kneels between his legs and goes right back to swallowing that cock til it gets rock hard and ready for action. Ryan then suits up and gets ready for more.Suited up, Ryan watches as Jacob straddles him and sits on his thick dick. Ryan holds Jacob by the waist and watches his face as he starts to piston fuck that ass. Jacob is rock hard while he bounces on that cock. Ryan is loving every minute of it. Ryan is a skilled top and knows just how to shove that dick inside a tight ass. Jacob then gets up and switches to a reverse cowgirl position. In this position, it's easier for Jacob to jerk himself off while grinding back onto Ryan's hard cock. Ryan can now relax and watch while Jacob does most of the work as he grinds and bucks back on his cock. Ryan doesn't stay still for long, and is soon slamming that cock of his up into Jacob's eager hole. Ryan then pushes Jacob to the side so he can fuck him and jack his big dick at the same time. Ryan then hoists himself off the couch, still buried in Jacob, and continues to pound that ass. Ryan then puts Jacob on his back, where he gets more ass missionary style. His thick cock just sinks repeatedly inside that sweet hole. He pounds away at that hot ass. It's too much for Jacob, who ends up cumming while Ryan is still fucking him. Ryan then pulls out and unloads his own batch all over Jacob's smooth balls and spent cock.",
  "models": [
    {
      "name": "Ryan Buckley",
      "person_id": 28368
    },
    {
      "name": "Jacob Tyler",
      "person_id": 28369
    }
  ],
  "release_date": "2010-04-30",
  "scene_id": 55109,
  "tags": [],
  "title": "Taken For A Ride, Scene #01"
}