{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have our welcome mats out today as we introduce two delicious men on our site. The first is 19 years old Sebastian Keys  that comes to us from just outside Cincinnati, Ohio. There is nothing wrong with having another Buckeye in the house. The second half of this stud duo is Wade Wilder. Wade is 25 years old and from Atlanta, Georgia. We can't give Georgia any grief, we've had several hotties from the ATL gracing our sets lately. We asked these two if they had $500 to spend on anything where would it take them. Wade smiles and says Walmart while Sebastian confesses with his electronics fetish he'd take those smackeroos to Best Buy. We then asked them what part of their bodies they enjoy most. Sebastian says he likes his eyes a lot. ?Long eye lashes, sexy green eyes; I get a lot of compliments on them? and we can see why. Wade says his smile and his ?V?, as he points at that sexy V that his lower abs form that make most of us take a second look. Either way, both of these guys have a lot to offer and in a few minutes we'll be getting a much better view of what they each bring to the table. We'll have front seats to watch these two put them all to good use. ?INCOMING!They sit on opposite couches as they start to grope each other's cocks. Wade moves in closer and immediately grabs hold of Sebastian's foot as he takes off his sandals and starts to lick his toes. Someone has a foot fetish.  He then starts to kiss Sebastian as they start to strip each other. Sebastian stands as Wade pulls his jeans down, once on his knees, Wade decides to let his tongue do some exploring on the bulge tenting Sebastian's underwear. Sebastian then strips Wade who lies back as he gets his cock wet. Sebastian goes down on the Southern boy's uncut charm and feverishly works as much of it into his mouth as he can. ?Suck that dick.? Wade coos as he gets that cock swallowed. Sebastian works his meat and balls driving Wade crazy. Sebastian then stands to give Wade a mouthful of his own. Wade pushes him back on the couch once his cock springs free. ?You're such a good cocksucker? Sebastian groans as Wade deep throats his aching boner. Wade jacks and slurps at that throbbing bone while Sebastian just begs for more of the same. Wade's tongue piercing only heightens the sensation.Sebastian then straddles Wade's chest as he face fucks him some more unable to get enough of that mouth and cock hungry throat. Wade worships his meat and savors those smooth low hangers. Sebastian is in awe as he watches his cock disappear down Wade's throat. Soon it'll be Wade's cock disappearing into Sebastian's smooth ass. Wade bends Sebastian over and eases his thick cock into Sebastian's hungry ass. ?Fuck that tight ass!? Sebastian begs as Wade starts to do as he's told. Soon he's ball deep in that sweet ass and fucking away to his delight. Sebastian is on all four and can't get enough of that dick as he begs for more. Wade pounds away at that ass and has more in mind. He puts Sebastian on his back, lifts his legs and gets him into position before squatting down into a pile driver position. Once he's there he slams that cock in and starts to pile drive it home as he bounces on that hole shoving it in to the hilt repeatedly. Sebastian wanted to get fucked and that's exactly what he's getting. Wade then lies back on the couch and has Sebastian continue to ride his cock. Sebastian holds still as Wade fucks up into his hot ass. All that anal stimulation soon has Sebastian pumping out his load while Wade's still buried deep inside him. Wade then beats his own massive load all over his smooth chest and abs.",
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 27966
    },
    {
      "name": "Wade Wilder",
      "person_id": 28371
    }
  ],
  "release_date": "2010-04-23",
  "scene_id": 55112,
  "series": "Foot Ballin'",
  "tags": [],
  "title": "Foot Ballin', Scene #02"
}