{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Two fresh faces and friendly places. Today, we have two hot young studs with us. The first one is 24 year-old Zach Alexander. Zach admits to moving around a lot but calls Chicago home. To Zach's right is Ethan Storm. Ethan is 21. This charming Southern child is from Charleston, SC. We've heard rumors that Zach is an equal opportunity employer in the Horizontal department. To that he replied, ?You know what? I love to top, very passionate, very aggressive; but if I'm gonna bottom ?they better make me their bitch!? Any questions? Zach started with guys at 18 then got curious about women and tried it. He loves them equally with the only exception being that girls aren't big enough sluts. Ethan started with boys at the age of 13 and knew he wasn't bothering with girls. He hasn't looked back since. No pun intended. Zach loves whatever's clever. As long as he has an ass to fuck, he's happy. This will work out just fine since Ethan just wants to make sure he gets the dick. He doesn't care if Zach's into guys or girls. The fact that Zach bones chicks isn't swaying his interest meter one way or the other. Where's Shania when we need her? When it comes to impressing Ethan, he'll reserve his comments til after they're done. A storm's a cummin'.They start off with a friendly card game that goes nowhere but south?FAST! They tumble on to the couch as they begin to kiss and strip off their clothes. This is Strip Poker in speed mode. ?Yeah suck that nipple? Zach orders as Ethan goes to work on his pecs. They make out passionately as Zach dry humps into Ethan's crotch. He strips his jeans off before moving over to the chair to let Ethan have a go at his meat. Ethan tugs off Zach's pants before going to work on his thick uncut meat. Zach's cock is growing in its new environment. Ethan's making sure he's taking care of every inch. Zach then stands to give Ethan better access as he starts face-fucking his new friend. His cock is rock hard now as he rams the back of Ethan's throat. ?Take my cock!' he grunts 'you like when I choke you? Hot, hung and verbal?damn. Ethan is on his knees worshipping that dick, and Zach's loving every minute of it. We must admit the view is intoxicating. Zach then gets Ethan on the couch and discovers he's not the only one packing. Zach goes to work on Ethan's thick cock which by now is throbbing for attention. Zach pays special attention to Ethan's balls as he continues to suck and savor that Southern slab of meat.Soon it's Ethan whose face-fucking Zach as he pumps his cock up into Zach's hot mouth. They then stand and stroke their dicks together as they make out some more. ?Get over here and get down? Zach orders as he bends Ethan over. ?Fuck that ass? Ethan groans as he gets that ass tapped. Zach's smooth balls are bouncing on Ethan's hungry hole in no time. Ethan can't seem to get enough of it as he begs Zach for more. Zach slams his cock deep inside over and over as he fucks Ethan doggy style. Ethan then wants to ride that dick. Zach's not about to deny him anything that will get him more time in that hot ass. Ethan impales himself on that delicious uncut cock as he rides and grinds his hot ass as deep as possible driving Zach wild. Zach's doing his best to shove all of his meat deep. Zach then repositions Ethan getting him on his back where he can fuck him as hard and as deep as he wants. Zach pistons away at that hot ass and fucks it until he can't hold his load any longer. He pulls out and shoots his thick seed all over Ethan. Ethan then strokes off a massive nut with help from Zach who's fingering that sore ass he just had.",
  "models": [],
  "release_date": "2010-04-02",
  "scene_id": 55117,
  "tags": [],
  "title": "Asses WIld, Scene #01"
}