{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Today we have two brand new boys with us. We're sure the folks at home will be mighty pleased. The first is 23 year old Scott Adler who is from the Big Apple. A Manhattan boy up to no good in South Beach? Who knew.  Sometimes you just gotta leave the city. The second one on his very first shoot is Will Spur. Will is from Texas. He loves where he's from. He admits he'd miss his Green Chile Chicken Enchiladas if he were to ever move away from his home state. Scott grins when he admits his favorite comfort food is actually Fried Chicken. 'I'm not from the South, but I do love Fried Chicken'. Apparently Fried Chicken is a Manhattan delicacy. They are both horny studs. They admit they both love getting off. We asked them if they could have anyone they wanted there watching as they got themselves off whom would that be? Scott admits his might be a tad generic but he'd have to go with Brad Pitt. Will is a lot easier to please. He said he'd be open to having anyone present willing to watch him jack off. Well, we have a feeling there will be plenty of men that will soon fall under that category as he prepares to give Scott a lot more than just a piece of his mind. We're sure Mr. Adler won't mind one bit.They start with a game of show and tell as Scott lifts up his shirt and shows off his abs to Will. Will is willing to play along as he quickly goes in for a better look. 'This is all new to me' he confesses as Scott takes the lead. They start kissing as Will undoes his jeans. Scott goes to his knees and finishes what Will started, working on the grown bulge in Will's briefs. Then Scott stands up as Will returns the favor and helps him out of his jeans. Will is rock hard by now. Scott can't wait to wrap his crimson lips around that Texan pole. Will is in awe as he watches Scott work his meat. 'Who taught you this?' he teases as Scott continues to work that cock. Will teases Scott as he pulls his cock away and playfully slaps his face and tongue. Will then sits back and orders Scott to get his mouth back on his cock. Scott doesn't miss a beat as he gets right back to work on that thick cock. Will's cock is throbbing as Scott takes as much of it as he can down his throat. Will's smooth balls dangle below as Scott continues to worship that meat that has him completely mesmerized.Scott can't get enough of that meat. His mouth is readily available. Scott then kneels on the couch, offering that sweet ass up to our newbie. Will roughly slides in his finger testing out that tight ass. He doesn't have much experience fucking a guy in the ass, but one lubed finger in that ass and he knows that tight grip would feel much better around his dick. 'Why don't you come sit over here' Will grimaces as he strokes his fat cock. Scott quickly climbs aboard as he sits down on that meat. He rides our Texan in a reverse cowgirl as Will holds him by the waist, helping bounce him on his bone. 'You like that tight ass?' Scott teases as he rides that dick harder. Will then bends our Manhattan stud over and starts tapping that ass doggy style. He gets that throbbing cock in ball deep as he pounds away at that smooth ass. Scott is loving the dick he's getting as he moans his approval. For a first timer in the ass department, we can definitely give Will high marks in the breaking new ground area. He's fucking Scott's ass just like he has pounded girls before?on their backs and balls deep. He slams that dick in harder and faster in missionary. Scott won't be able to hold back much longer. Sure enough Will fucks the cum right out of the New Yorker before shooting his own load all over Scott's milk-coated frame.",
  "models": [
    {
      "name": "Will Spur",
      "person_id": 28372
    },
    {
      "name": "Scott Adler",
      "person_id": 28373
    }
  ],
  "release_date": "2010-04-16",
  "scene_id": 55113,
  "tags": [],
  "title": "The JIZZst Of It, Scene #01"
}