{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we're keeping things a 'little' wilde, as a certain California native joins us. Christian Wilde is back to give us more of what we love him for. It's ironic that we'd dare use 'little' and 'Wilde' in the same sentence; being that there isn't anything 'little' about this stunning 6'3 blue eyed dream who hails from a certain City by the Bay. Christian  was featured on our Brother site ExtraBigDicks.com last week after a 2 year hiatus. It more than reassured everyone that at 20 and already packing a thick 8' cock, a now inked Christian has grown up to be the kind of man you need 2 hands to handle. 'All hands on Dick!' His friend, also from the West Coast, is 23 years old and hails from Orange County. He goes by the name of Cameron Adams. Cameron is single and loves to mingle. Christian, on the other hand, left a bunch of 'fuck friends' back home of both persuasions. He likes the best of both worlds and considers himself 'Hetero-flexible'.  You gotta love that! We asked these two what the best blow job they'd ever had and who had given it to them. Cameron admits it would have to be his ex, who's the only guy to ever get him off by blowjob. Christian, of course, one ups Cameron as he blurts out 'Mine was from a drunk chick. Who my best friend kinda told her she should give me head...and she did' ?Enough said! lol The End.Cameron & Christian break the ice by kissing softly and allowing their tongues to get much better acquainted. Christian's shirt is off as Cameron's tongue starts to explore those hairy nipples just below his ink that runs across his chest and boldly declares, 'Stand in the Sunlight'. We definitely don't see a reason why we'd want to hide this hung hottie. Neither does Cameron, who by now has discovered new territory for his tongue to roam. His mouth works up and down on Christian's rock hard cock as his tongue dances around its shaft and knob. Christian just lies back and watches as his new buddy goes to work, deep throating as much of his delicious meat as he can. Christian then wants to have a go himself, as he puts Cameron on the couch and peels off his underwear. Cameron's meat is already rock hard, receiving the tongue bath it deserves. Christian sucks his cock like a pro as he bobs up and down on it and then has Cameron stand up so he can get better access to it. An overhead shot gives us the outrageous view Cam has of Christian going to town on that thick dick while looking up at him with those sexy blue eyes.Cameron then goes back down on Christian's thick 8' cock, unable to get more, and wanting to get it as hard as he can before he takes it in the ass. Once Christian is rock hard, Cameron straddles him and lowers his tight ass down onto Christian's waiting meat. His ass slowly gives way as he starts to take that thick dick. Soon, Cameron is riding that dick like a true cowboy as he grinds and bucks back onto that dick, driving Christian into a frenzy. Christian then gets Cameron up and bends him over so he can continue fucking him doggie style. Christian holds Cameron in place as he holds that tight little waist of his, as he slams away at that hungry hole. The sound of Christian's heavy balls slapping away at Cameron's ass fill the room. Cameron is in heaven as he gets that sweet hole stretched wide. Christian isn't stopping as he continues his anal assault. An aerial shot gives us a better idea of all that Christian's giving him as we see his thick cock working its way deep inside and back out again. Christian then puts Cameron on his back and starts pounding it in even deeper. Cameron won't be able to take this much longer, with Christian's thick meat working his prostate. Sure enough, Cameron blows, shooting his load all over his tensing abs. Christian isn't far behind as he pulls out and explodes all over Cameron, drenching him from his face down to his cum covered cock. DAMN!",
  "models": [
    {
      "name": "Cameron Adams",
      "person_id": 28380
    },
    {
      "name": "Christian Wilde",
      "person_id": 28481
    }
  ],
  "release_date": "2010-03-05",
  "scene_id": 55125,
  "tags": [],
  "title": "Ball Of The Wilde, Scene #01"
}