{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we bring you ?Aiden and Abedding? which means we've got sexy Aiden Lane back in the studio. After a five year hiatus, Aiden  made a comeback this year, helping make January a lot warmer with one very appreciative Krist Cumming. Aiden is boyish and sexy with a cock that doesn't stop. Today Aiden will be ?a-bedding? one hot recent discovery who has allowed us to help him push his sexual horizons. Originally started off with a just a solo for the gay boys, Phillip Heritage has come a long way. Phillip, our inked bad boy, admits that after spending time with us here at CircleJerkBoys he is still str8 but can't deny that a big dick up my ass does feel pretty fucking good. Well someone's getting a toaster oven! We flipped another one. It's hard to forget Phillip losing his cherry on cam with Tucker who buried his thick dick deep until Phillips grunts of pain turned into groans of pleasure. Today Phillip is back ready and more than willing to take one for the team. Who better than sexy Aiden to give that sweet ass a proper stretching? We couldn't think of a hotter stud to help us out. Aiden has grown since he's been in the business and has learned a lot. He's discovered it's made him an open book. He now goes with the flow and takes it day to day. This day, however, will be a special one for one Mr. Heritage. Shall we?After talking some smack on the couch they get to getting' as Aiden peels off Phillip and Aiden lose their shirts. Phillip's tongue starts to explore as these two begin wresting with each other to strip each other's clothes off. Soon Aiden is standing with his meaty cock sticking thru the fly in his boxers as Phillip starts to get a sample of it. He licks and sucks at it before going all the way down on it. Aiden loses the boxers and lets Phillip have all the dick he can take. Phillip kneels between his legs as he sucks and swallows Aiden's meat. Aiden then flips him back on to the couch as he strips off his boxers. ?Oh it's my turn?? Phillip teases as Aiden goes to work on his growing meat. Aiden starts sucking his cock. Before long, they both end up on the floor in a hot 69 as Aiden takes top bunk and has Phillip on his back nursing on his own meat. Aiden then stands to give Phillip more cock. Phillip kneels and swallows his thick dick all the way down. Aiden tells Phillip just how good his mouth feels on his cock, and that his dick wants to get in his hot smooth hole. All this talk is fueling Phillip who with big puppy eyes looks up at Aiden and begs ?I want you to fuck me!?Once Aiden has had enough of Phillip's mouth, he gets Phillip on his back and has a go at Phillip's meat as he services and even gags on his thick cock. He then gets into position between Phillips thighs as he starts rubbing their cock together. His meat is closer to it's intended target. Aiden jacks their dicks together in his fist. It's only making Phillip hornier. ?I want this cock? he begs. Aiden lifts Phillip's legs high and aims his thick meat at that pink ass. He starts to bury his thick cock slowly as Phillip grimaces in a mixture of pain and pleasure. Soon Aiden's cock is buried deep as Phillip struggles to take it. ?My girlfriend screams my name when I fuck her', Aiden grunts 'Say my name!? Phillip obliges as he screams out ?A mother fuckin AIDEN? Damn this is hotter than expected. Aiden then starts to coach Phillip to relax so he can take his dick all the way down to the base. ?That's what I'm talking about Bitch? Aiden groans. ?Don't worry; I'll do the same for you?. Aiden then gives his sweet ass up for Phillip who is more than happy to fuck Aiden til he makes him cum. Aiden watches Phillip pounds away at his ass and it sends him over the edge. Phillip fucks him harder making him shoot all over his chest and abs. Whew. Phillip then pulls out and shoots his own load, all over one cum-coated Aiden.",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Philip Heritage",
      "person_id": 28360
    }
  ],
  "release_date": "2010-02-26",
  "scene_id": 55128,
  "series": "The Bald & The Beautiful",
  "tags": [],
  "title": "The Bald & The Beautiful, Scene #02"
}