{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "tallIt's been almost a year since one of this week's studs made his debut on our site. After countless requests, we're proud to say we have just the ?razzle dazzle? you guys were begging for. Ryan Raz is back and better than ever. For those of you who hadn't the pleasure, Ryan is originally from St. Louis, MO, though he now calls New York City ?home?. The 6', 26 year-old blond boy from the Midwest is making quite a stir in the Big Apple. After having been under contract with a major studio for the past year, we're glad Ryan's back (...and back in Florida.) This week, we decided to pair up our sexy smooth alum with a recent blond discovery that's not only in Florida?but from Florida. Bobby Rail, who made the Christmas Holidays that much hotter, is back, and we have a feeling these two are gonna hit it off just ?swell? (pun intended). Bobby is from West Palm Beach. This 24 year-old has left a wake of drool in his path. He's shown us just how good a top and a bottom he can be. In fact, Bobby lost both cherries here at CircleJerkBoys, as we filmed both his first ever ?topping? as well as ?bottoming? scenes on cam. Who knew this sexy blond stud's favorite thing to do in bed is eat pussy? Well, there's no accounting for taste these days now is there?!Bobby joins Ryan on the couch and tells him he's sore from working out. Ryan offers him a back rub, which quickly escalates to a whole lot more. They start making out, as Ryan gets to work freeing Bobby's growing cock. Their shirts come off, and Ryan's hand is already buried in Bobby's briefs. Bobby helps him out by sliding his jeans off. Once they're both in their underwear, Bobby decides to get a better look at what's tenting Ryan's briefs. Bobby pulls down Ryan's briefs as his swollen cock springs free. He's rock hard, and Bobby immediately attends to him. He takes all of Ryan's thick 7? cock deep, as Ryan moans his approval. Bobby slides down and kneels between Ryan's legs to get better access at that sweet meat. He licks Ryan's cock from base to tip as he drives Ryan crazy. Ryan decides he wants some too, and gets Bobby to his feet, where he starts returning the favor. Bobby's cock is throbbing and finding relief in Ryan's expert mouth. As Bobby starts slowly face fucking Ryan, we get our first glimpse at that smooth bubble butt of his. Ryan takes his time and slowly works Bobby's meat all the way down his throat. Bobby just watches as he gets his meat worshipped by Ryan. It's making him want a lot more than that sweet mouth of his.nRyan then turns around and gets on all four showing Bobby that ass he wants fucked. Bobby immediately goes in for a closer inspection?tongue first. Ryan gasps as Bobby starts eating his hungry ass out. He's getting that ass wet so he can slide his cock deep inside. Bobby then suits up and starts pushing inside, giving Ryan the cock he's been wanting. Ryan's hot ass opens up for that thick dick. Soon, Bobby is boning his tight ass fast and deep. He holds Ryan's ass with one hand as he bounces him back onto his meat. Bobby then puts Ryan on his back and slides back in for more. He starts fucking Ryan missionary, and Ryan takes every inch of dick he's given. From just about every angle, we can see Bobby's bone sliding in and out of Ryan's hungry ass. Bobby then switches things up as he lies back and lets Ryan work for it. Ryan straddles his meat as he slides back down on to it. He starts to ride that dick as he bobs and bounces, grinding deep to get as much of it inside him as he can. This position proves effective, and soon they both are ready to bust their loads. They lie beside each other and jack off all over themselves, coating their smooth frames with their own seed. Whew.",
  "models": [
    {
      "name": "Ryan Raz",
      "person_id": 27995
    },
    {
      "name": "Bobby Rail",
      "person_id": 28379
    }
  ],
  "release_date": "2010-03-11",
  "scene_id": 55123,
  "series": "Saving Ryan's Privates",
  "tags": [],
  "title": "Saving Ryan's Privates, Scene #01"
}