{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have a blast from the past back with us. It's been almost 3 years since we first met Speedy Gonzalez. Speedy, the local Miami boy with the thug looks and the furry hole to boot, is back and finally giving his fans an update. Speedy is now 23 and he's been keeping busy and has brought along a hot buddy to play with that goes by the name of Luscious G. Luscious is also 23, Costa Rican and from Miami. Luscious got his name from his luscious ?booty?. Luscious is single and claims he doesn't have a steady fuck buddy. So that luscious booty is going without. Well that won't be the case in a few minutes.  Speedy has a girlfriend and they recently became proud parents to a baby girl. Speedy is now a ?Papi? for real. Luscious is a horny one and jacks off a lot. The last time he jacked off he was thinking about someone he works with. Speedy is never one to be outdone so he chimes in with ?It was last night?wait for it?in my sleep.? Apparently his girlfriend woke him up pissed off because he was jacking off in his sleep?AGAIN!  Where's John Waters when we need him? lol Well we better get these two going before this Q&A gets any weirder.Luscious sits on the couch as Speedy gets up in his face grabbing his crotch and asking him if he wants some ?Speedy Cock?. Luscious is game and in no time has Speedy's cock in his hands as he gropes it through his jeans. Luscious strips off his tee before sliding on to his knees and helping Speedy out of his jeans. Speedy turns around as Luscious lowers his boxers and starts to fondle and grope his ass. Speedy then turns around and drops his boxers as his dick is finally free. It isn't free for long as Luscious goes down on it. Speedy gasps as his home boy works on his swollen meat. He lies back and Luscious gets between his legs to continue nursing on his dick. As Luscious sucks his cock, Speedy lets down his hair?literally. His hair has grown out and now halfway down his back. Once Speedy's had enough on his dick he turns around and offers up that ass for Luscious to sample. Luscious starts to eat that now man-scaped hole with pleasure. Speedy moans and groans as Luscious' tongue hits all the right spots.Speedy then sits back with his dick boned up and again asks Luscious, ?You ready for Speedy Cock?? Hmmm... Luscious stands on the couch and squats down on Speedy's meat and in no time has him ball deep in that name sake ass of his. Speedy starts to fuck his buddy as he bounces him up and down on his hard cock. He slaps that ass as he gets that cock ridden. Speedy then has him hold still while he fucks up into his hole. Change is good and it isn't long before Speedy switches it up again and puts our hot newcomer on all four so he can pound him doggy-style. His cock slides in easily for more ball slapping action. Luscious moans as he gets that ass used; and he doesn't seem to mind one bit. Speedy's low hangers are slapping away at that hot ass he's pounding and its only adding to the sensation Luscious is feeling. Speedy switches it up again and puts Luscious on his back, lifts those legs in the air and buries his dick inside. He fucks him hard and deep and Luscious beats his dick off as he's getting that ass stretched. This position has Speedy's cock hitting him in all the right places and Luscious' moaning sends Speedy over the edge as he explodes all over Luscious G. Luscious then gets back on the couch and busts his own load all over his smooth navel. Booty Buddies: Miami style.",
  "models": [
    {
      "name": "Speedy Gonzales",
      "person_id": 28281
    },
    {
      "name": "Luscious G",
      "person_id": 28377
    }
  ],
  "release_date": "2010-03-26",
  "scene_id": 55120,
  "tags": [],
  "title": "Double Seedy Speedy, Scene #02"
}