{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we have a hot 22 year-old blond jock for you who comes from the great state of Ohio! Go figure. Everyone seems to be from Ohio these days. We're lucky to have Aaron Mason with us, who says he is only 'visiting' Florida. He'll soon be going back to those Indian Summers they have back home. He may love Ohio, but admits Florida has hotter women. 'They have a lot less clothes on,? he grins. ?I love the bikinis.' Yeah, we bet. Aaron loves to travel. Even though he's been abroad, he has French dreams in his future. France may not be ready for a horny boy like Aaron. (?C'est Vrai!)  He got a late start and had his first sexual experience at 16. It was his first orgasm as well. He had a girlfriend who decided to give him an underwater hummer in a hot tub. Well, if you're gonna wait til 16, it should at least be special. He's made up for lost time. This horny stud admits he jacks off as much as possible. Sometimes he jacks off 3 or 4 times a day. He isn't shy about liking his ass licked and played with; occasionally works his own EASY button while in the throes of autoerotic self-indulgence. Read it again?you'll get it.Aaron is playing with his basketball while hanging out in his room. He loses interest rather quickly and realizes he'd rather be 'palming' something else. He lets his hands start to roam as his shirt comes off. His chest is naturally smooth and his abs are front and center. He playfully poses for the cam and gives us a flexing pose. Hot. He then moves to the situation developing down south. As he undoes his shorts and his fly comes down, his massive boner springs out, still tenting his bright orange briefs. Aaron is rock hard, and that cock is going to need attention and soon. He teases it through his briefs as it gets rock hard and begins to ache for some skin on skin contact. After teasing and rubbing that cock that is now straining for its freedom, he turns around for us as he drops his shorts, giving us our first view of his spectacular ass. He spreads his cheeks apart, showing us that straight boy hole that has yet to be defiled. His ass is glistening as the light catches in his light blond body hair. As if this ass show isn't hot enough, Aaron takes it one step further as he begins to finger and tease that tight ass. Makes you just wanna dive in tongue first, but wait?there's more.Aaron lies back on the couch still in his jock strap, finally pulling it off. His aching cock gets some well deserved attention as he starts to massage his hairless meat. It seems Aaron loves everything smooth. His cock jets straight north when it's hard. This boy's meat is a definite stargazer. His smooth balls are compact and tight to the base of that cock that looks like it could explode any minute. He starts stroking his cock. We hear his soft sighs as his breathing starts to labor. He lubes up and starts to really have some fun on that cock as he strokes it underhand and then overhand as his cock pulses to his every touch. He then spreads his legs wide open as he sits way back and starts working that bung hole while he jacks his stiff meat. If this boy isn't careful, he'll end up with a dick in his ass on our set. It's been known to happen around here. Aaron's cock is glistening and aching for release as he goes face down to show us that ass again. He then sits back down, spreads those legs again, and starts jacking that meat again as he starts to finger that hole. This does the trick, sending Aaron over the edge as he leans forward and pumps his thick batch all over his trusty basketball. Double dribble can't touch this. ?Yum!",
  "models": [
    {
      "name": "Aaron Mason",
      "person_id": 28378
    }
  ],
  "release_date": "2010-03-19",
  "scene_id": 55122,
  "series": "Double Dribble",
  "tags": [],
  "title": "Double Dribble, Scene #02"
}