{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Bobby Rail is back in the house this week. We're always glad to have this hunky blond from West Palm Beach with us. Bobby  has quite the fan following. At 24, this laid back hottie is single and loving it. Also back with us is a Midwestern favorite we've had the pleasure of working with before, Mr. Clark Chase. Clark  is 21 and originally from Minnesota. He's a recent transplant to south Florida and has been down here for about 6 months. Clark hasn't got a steady girl down here, but judging from the grin on his face we're guessing he has plenty of options. We asked these boys if they could have any procedure to better their appearance what would it be? They both want some kind of hair removal. Interesting. We then asked them if they had an inner super hero, what would their super hero be called. Bobby grinned and said his inner super hero would be called ?Boner Boy?. We're guessing he would be a rather smooth Boner boy. Clark went with ?Silent Knight?. Feel free to run with that one. To wrap up our chat, we asked them what was new and interesting that they discovered in 2009, that they never thought they would never enjoy. Bobby blurts out ?Anal sex?. WOW?that might've been an over share. Clark answers he now really loves the Reverse Cowgirl position. Hmmm, that being said, we think we know where these two can best use their newfound loves. Saddle up, Bobby Rail; you're in for one hell of a ride. Yee?haw!Clark is watching porn and stroking his fat cock when Bobby walks in on him and catches him spankin' the monkey. Clark covers up as Bobby sits on the couch and coyly asks, ?What you got there?? Clark blushes as Bobby pulls away his cushion to reveal his boner. Bobby reaches over and starts to stroke his cock before going in for a kiss. They start to make out as Bobby pushes Clark's jeans south and starts to lick his chest as he makes his way down to that swollen cock that's aching for attention. Clark sighs as Bobby takes his cock deep. He swirls his tongue around his head before sucking his cock all the way down to the hilt. Bobby is making love to that dick with his mouth as he totally licks and sucks on it. Bobby then gets up and strips as his own aching meat is released. They stand and make out as their rock hard cocks rub together. Bobby slips south one last time to get that cock nice and wet before they take it to the next level. Bobby knows exactly what to do and Clark's cock is ready to go in no time.Clark suits up and sits back as Bobby turns around and sits right down on his dick in a?you guessed it?Reverse Cowgirl position. Who knew? Bobby slowly impales himself on that dick and is soon riding that cock with ease. Bobby then gets up and gets bent over the couch as Clark slides his thick dick back in for more. Bobby's sweet ass is getting stretched wide and he's loving every minute of it. His face tells us just how much he's loving the dick Clark's giving him. They then take the fun to the couch as Clark lies down behind Bobby; lifts Bobby's leg, and slides in for more. He fucks Bobby on his side for a while as we see Clark's once heavy balls slapping away at that smooth hole. Those nuts are pulling up closer and closer, and soon he won't be able to contain his load. Bobby bucks back, wanting to get as much of that thick dick deep inside him. Bobby's hungry hole is only adding to the mix and will soon have both of these hotties ready to blow. They both sit back side by side as they stroke their fat cocks off to completion. Clark is the first one to blow, sending his first shot firing over his shoulder and the rest of his thick cargo pools all over his navel. Bobby is next as he blows his thick load straight up as it splashes back down all over his cum soaked cock. Mmmmm.",
  "models": [
    {
      "name": "Bobby Rail",
      "person_id": 28379
    },
    {
      "name": "Clark Chase",
      "person_id": 28381
    }
  ],
  "release_date": "2010-02-19",
  "scene_id": 55130,
  "series": "Last Train to Clark-ville",
  "tags": [],
  "title": "Last Train to Clark-ville, Scene #02"
}