{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Cinq, cinco, cinque: no matter how you say it, it's how long we had to wait to have this week's stud back in our studios. After five long years, we finally have Aiden Lane back with us and we couldn't be happier. Aiden is looking better than ever. Even though when we first met Aiden, he had a girlfriend; we talked him into having a go at smooth Sebastian, who would later go on to porn infamy, becoming furry, dark and delicious Damien Crosse. He's someone the dreamy Scott Foley look-alike still communicates with from time to time. In order to make his debut spectacular, Aiden had a special request, and we were more than happy to provide him with his costar of choice. After seeing the toe-curling scene with all-male first timer, Phillip Heritage, Aiden knew he had to have Krist Cummings involved. Krist  is always happy to help us out, and could you blame him? Aiden had started off as a top with us years ago, but now he admits his horizons have expanded. Krist usually bottoms on cam, and for the most part, he likes that role at home as well. Today, art will imitate life as Aiden makes his much-anticipated debut, and he will be using the backdoor to do it! Krist's back door to be specific.  They break the ice, throwing around a basketball. But that's short lived, as Krist goes in for a kiss. They start kissing softly as they begin to undress. The chemistry between them is unmistakable as they slowly suck face and allow their hands to explore each other. Aiden is the first one in the buff, and Krist's lips soon find his rock hard cock. Aiden is smooth from head to toe, and even his balls and crotch are hair free. Krist goes to work on Aiden's meaty shaft as he laps and sucks his cock, swirling his fist on it before slapping his face with it. Krist loves sucking Aiden's fat cock, and Aiden loves the visual as Krist gets lost in his own lust. Then it's Aiden's turn, as he gets between Krist's legs and goes to work on his cock. Aiden blows Krist for a few, but the lure of that sweet ass is too much to resist. He flips Krist over and goes to work, exploring that hot hole he will soon bury his throbbing meat into. Krist moans as Aiden's tongue explores his back door. Aiden spreads his cheeks wide open as his love hole winks at Aiden, beckoning him to make himself at home. Don't you love when that happens!?Unable to resist its charm, Aiden suits up, lubes that sweet ass, and dives right in. He shoves his cock in and starts fucking Krist deep. Aiden buries his dick to the sound of Krist begging him for more. ?Ohhh, Pound me!?, he groans, as Aiden fucks him harder. Aiden then lies back on the couch and has Krist sit on his dick as Krist starts to ride his cock. Krist, an avid wrestler, easily grinds his hot ass up and down on Aiden's aching meat. The look on Aiden's face says it all as he gets his cock serviced by one talented ass. Aiden then wants his control back, and puts Krist on his back and starts to fuck him missionary. A view from behind these two gives us an amazing view of Aiden's own spectacular ass as it rises and falls, fucking the hell out of Krist's receptive ass. ?I want you to cum?, Aiden coos. ?I wanna see you shoot all over your chest.? Aiden picks up the pace and fucks Krist faster and deeper. That does the trick. Once Krist is close to cumming, Aiden hauls his own meat out and fingers Krist to orgasm as he splatters his hot load all over his smooth navel. Aiden isn't far behind, as he quickly straddles Krist's chest and orders him to turn his face as he coats his chest and face with his thick load. Krist got a fuck?and a facial! Some guys have all the luck.",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Krist Cummings",
      "person_id": 30770
    }
  ],
  "release_date": "2010-01-28",
  "scene_id": 55135,
  "series": "Aiden & Abetting",
  "tags": [],
  "title": "Aiden & Abetting, Scene #01"
}