{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We are really glad to have this week's new face with us, Mr. Spencer Reed. Spencer is 25 and from Washington, D.C. Spencer is tall, dark and hung. He spends a lot of time at the gym and it keeps him looking as hot as he does. He wishes he could spend less time at the gym so he could have more time to do other things but we guess that's the price you pay for looking so damn good. To entertain the likes of Spencer we brought back a recent gem we discovered by the name of Trent Diesel. Trent, who helped ring in the New Year on our brother site, was more than happy to help us out. Trent agrees with Spencer about wishing he could get the same results with less gym time and when we asked they both have similar downfalls. Trent loves sweets like cookies. He can't get enough cookies. Well Spencer loves candy and anything sour. He loves sour candies of any kind. Coming out for Spencer wasn't easy since he has the All-American jock look and everyone around him just assumed he was str8. We're glad he found himself and he admits he likes it all from jocks to twinks. There may be hope for you yet. You know who you are. Well, sit back and watch as Trent Diesel's Valentine's Day and New Year get better and better.Spencer is relaxing on the couch when Trent discovers the perfect opportunity to let his fingers do the walking. He starts to grope at Spencer's cock and after a few minutes Spencer wakes up to find his cock stiffening in Trent's hand. He leans in and starts to kiss Trent as they begin to take their shirts off and Trent fumbles with Spencer's pants wanting to get them off. Spencer sits back as Trent helps himself to his thick cock. His cock grows by the second and soon Trent's got a huge cock to work on as Spencer moans softly getting that thick meat of his worshipped. Trent runs his expert tongue all over Spencer's knob and throbbing shaft before taking it back into his mouth. Trent can't get enough of that thick dick and he's not coming up for air anytime soon. Spencer eventually wants to return the favor as he pulls Trent off and slides his jeans down to get some dick himself. He slowly sucks on Trent's growing meat as his cock springs to life. Trent sucks on that dick for a bit before they stand to continue making out. It isn't long before Trent's back on his knees sucking on more of that thick dick. He's got it bad! Spencer takes Trent's head and face fucks him while telling him to lick his balls and suck his cock.Spencer wants to get a better idea of what he's in for and he bends Trent over the couch and spreads that hot ass wide. The sight is too much to resist as he dives in tongue first and starts to tongue fuck Trent's smooth hole. Trent's hot ass gets a soaking as Spencer revels in the moment. Spencer's tongue is driving Trent wild and soon he'll be begging for more. Spencer fingers his ass a bit and Trent knows what's next. ''You like that finger in your ass?'' Spencer teases before replacing that finger with a much thicker digit. Spencer slides in and starts fucking Trent doggy style as Trent just moans and takes it deep. ''Your ass feels so good'' Spence groans as he pounds away at that hot ass. Trent's ass is taking a pounding and loving every minute of it. An overhead shot shows that thick dick easily stretching Trent's hole wide. Spencer hauls his fat cock all the way out before sliding it back in ball-deep. Spencer then sits back and has Trent ride his dick. Trent bounces on his dick with his own rock hard cock in hand. Spencer sits back and watches Trent pleasure himself on his meat. Spencer then fucks Trent some more on his side before they both sit back and explode all over themselves. If this isn't a Happy Valentine's fuck session, we don't know what is!",
  "models": [
    {
      "name": "Spencer Reed",
      "person_id": 28030
    },
    {
      "name": "Trent Diesel",
      "person_id": 28054
    }
  ],
  "release_date": "2010-02-11",
  "scene_id": 55131,
  "series": "Naptime Lovin'",
  "tags": [],
  "title": "Naptime Lovin', Scene #01"
}