{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It has been way too long since we'd seen sexy 22 year old Richie Sabatini. While we could just have our members keep begging us for more, it's easier to just give you guys what you want. Richie, who was here early last Spring doing a bit of 'Hunting', was more than happy to come back. A Tampa, FL native, he has been behaving and hitting the gym and looking damn good. We decided we'd get Mr. Sabatini a new playmate to introduce to our fans. This 21 year-old hottie comes from the Midwest and answers to the name of Jayden Grey. Iowa never looked so good. Both of these boys are well-connected, using their iPhones and laptops to keep in touch with friends and fans alike via tweets and Facebook accounts. In case you can't get enough of them onscreen; we're sure there's an App for that. Both of these guys love to party. While Jayden likes to just get drunk ; Richie likes to go out; have a nice dinner, then hit the clubs. We're sure these two are more than a handful, leaving a trail of madness and mayhem wherever they go. Let's see what madness ensues when these two hellions are left alone in a room....Richie is alone, flipping through a magazine trying to bone up, when Jayden finds him talking to himself wishing he could get that dick. 'Why are you looking at that mag when you got me right here?' Jayden grins as they immediately begin to 'erect-ify' the situation. They begin to kiss as they pull off each other's clothes. Richie's pants are stripped off. Once they come off, Jayden ends up between his legs as he gropes at that boner in his boxer briefs. 'I hear you can suck a mean dick' Richie teases, as Jayden pulls his thick dick free and goes to work, showing Richie just how well he can. Jayden licks and sucks on Richie's rock hard meat while Richie lavishes in the new sensation and verbally eggs Jayden on as he stands up to give our Iowa boy better access. 'Suck that dick!' he orders repeatedly, as he gets his cock spit shined. This Iowa boy must've been corn fed, because he knows just what to do on a thick stalk! (Yeah, we went there) Richie then gets up and kisses Jayden before getting himself a mouthful of Midwest Meat. Jayden lies back as Richie returns the favor, taking his thick dick throat deep. Tampa is in the house as Jayden's dick gets a balls deep Florida welcome. 'Wanna fuck me?' Jayden finally groans. We figure you know what's next...Richie suits up and sits back as Jayden straddles his cock and sits down on it as he impales his sweet ass on Richie's thick dick. His ass opens up to receive all Richie has to offer. In no time, Jayden is fucking that dick with ease. He rides Richie like a pro as Richie coos and moans with his dick buried deep. The look on Jayden's face tells us all we need to know as he revels in the fucking he's giving himself. Richie then switches everything up and wants a bit more control. He bends Jayden over before sliding his cock back in for more. Jayden grimaces as Richie starts to fuck his ass deep. Richie can look down and watch as Jayden's hot hole swallows his cock whole over and over. Jayden is moaning and whimpering as Richie pounds his ass and gets what's his. He holds Jayden by the waist as he continues to bounce him on his meat. Richie has one more position he wants to fuck this hot boy in. He gets him on his back, lifts those legs, and slams back into that worn hole. Richie fucks Jayden missionary. This position has his thick dick hitting all the right spots. Richie is the first to nut, exploding all over Jayden's smooth bod. Once he nuts?he bounces, leaving Jayden with a case of confusion, blue balls and a mag he would need to settle for. Prince Charming, cocky and generous, doth ride again....",
  "models": [
    {
      "name": "Richie Sabatini",
      "person_id": 28328
    },
    {
      "name": "Jayden Grey",
      "person_id": 30676
    }
  ],
  "release_date": "2010-02-05",
  "scene_id": 55134,
  "tags": [],
  "title": "Straight Boy Crush, Scene #02"
}