{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "?Made in China? is something we see from time to time, and today we have one of the hottest things we've ever seen that can proudly claim the same. Hong Kong is where 23 year old Rocco Giovanni is from. Even though his roots are in the Far East, his home is in the Midwest. That's where they'd been hiding this one. His costar today is Luke Riley, a familiar face with us, who is also from the Midwest. Having appeared on more than one of our sites, 20 year old Luke  is usually on the receiving end of the action. But this afternoon, he'll be driving. We asked them both what fantasy rolls they'd like to explore. Luke says he'd want to play a Sub (as in submissive roll) and Rocco blurts out Substitute teacher? Hmm. Luke just goes with it while Rocco stays in theme and wants to be the brooding student that sits in the back and eventually dominates everyone in the classroom. On that note, we asked them what the kinkiest thing they'd gotten themselves into. Luke grins, unsure which of his experiences to go with. ?I've been tied up in a work shed; been tazered; been a lot of things?. ?DO Tazer me, Bro!? lol We dared Rocco to top that, and he chimed in with ?I've been fucked by a machine?three of them! A valiant effort, but Luke totally wins this round.As the action starts, Luke's strumming on his guitar when he decides to work on his cock instead. He hauls out his cock and gets it rock hard. Rocco just happens to be in the neighborhood as he lets himself into Luke's room. Rocco peels off his tee and reveals his inked frame. Rocco has an impressive collection of ink all over, and has used his corn fed physique as the ultimate canvas. He joins Luke on the couch. His tongue starts to explore Luke's chest before heading south to get on that thick dick. Luke immediately starts to shove as much of his dick up into Rocco's mouth as he can. Rocco is happy to oblige as he works every inch of meat he's given. Luke then returns the favor after undoing Rocco's jeans. Rocco's cock, complete with his Prince Albert piercing, are soon bathed in spit as Luke sucks his cock. Rocco then wants more of Luke's dick. As he bends over to get some, we get an amazing view of that hairless ass. Luke is rock hard and loving the view of Rocco, unable to get enough of his dick. He knows it will soon be sliding into something even hotter than Rocco's attentive mouth. The anticipation is KILLING us!Rocco stands and makes out with Luke a bit before assuming the position. You know, the one where he's gonna take it like a man?yeah, that one. On all fours, Rocco grunts as Riley slides his thick dick deep. Rocco takes all 8? as he struggles to accommodate his new intruder. Luke's taking his ass hard as he begins to piledrive that dick deep. He braces himself on the couch and repeatedly slams that sweet ass full of dick. Luke's balls slap at Rocco's naturally smooth ass. The view from behind is insane. Luke can top like a champ. Who knew? Luke then has a seat in a chair and waits for Rocco to get back on his dick. Once he's impaled himself back on Luke's cock for more, Luke just watches and plays with Rocco's nips and chest as Rocco rides him hard. Luke bounces him up and down, wanting his cock even deeper as Rocco's ass gives way. Luke then picks Rocco up while still in him and takes him to the couch, where he continues fucking him missionary. Luke's cock is easily pummeling Rocco's receptive hole, and it won't be long before these two explode. Luke starts to pound Rocco's ass hard and deep and it sends him into a massive orgasm as he shoots all over his inked chest and abs. Luke pulls his meat out and also adds more glaze to the already cum soaked canvas. The bidding for this piece will start at...",
  "models": [
    {
      "name": "Luke Riley",
      "person_id": 27859
    },
    {
      "name": "Rocco Giovanni",
      "person_id": 28387
    }
  ],
  "release_date": "2010-01-22",
  "scene_id": 55137,
  "tags": [],
  "title": "Strumming & Cumming, Scene #01"
}