{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "e got something for everybody this week with three sexy studs. It's a cross-country bonanza starting in the East Coast with a blond, blue eyed Bobby Rail all the way to the West coast with sexy Jake Taylor. Representing the Midwest and middle states, adorable Damon Audigier. <>Bobby  is 24 and from West Palm Beach, FL and loves it here. Damon is 19 from Oklahoma and loves it here in Florida so much he's looking to move here A.S.A.P. Paradise has its appeal. Jake is 22 and from Los Angeles, which he now calls home. He loves Florida; but admits he's looking forward to getting home to the West coast. Well, ya can't please everyone. (says who?-Damon's about to) We asked these studs when they first discovered their pea shooters. Damon was 14 and he was exploring his body and playing with it when it went off. Bobby was about 12 when he first noticed he launched spooge out of his cannon. He'd been playing with it before, just nothing had come out. Jake was about 12 as well and getting advice from an older friend and was using shampoo in the shower. 'Eventually I came but it was burning; cuz I got soap inside me' he admits 'it was a good feeling...beside the burning part' Burning Sensation? -This is beginning to sound like a Public Service Announcement. lol Let's get these three better acquainted, shall we?Bobby and Damon begin to make out as Jake sits nearby and watches. Jake's cock is growing as he watches them kiss and undress. Bobby stands as Damon undoes his jeans and starts licking at his boner through his briefs. The briefs are short lived as Damon tugs them off and goes to work on Bobby's cock. Bobby bones up in seconds once Damon's tongue works its magic. Jake can't sit by anymore and undoes his jeans to get at his aching cock. He stands near Bobby who starts to grope at his cock. Jake strips and hauls out his thick cock where Bobby can get a mouthful. Bobby's lying back on the couch with Jake's dick in his mouth and his dick in Damon's. Daisy Chain! After some hot oral, Bobby and Jake turn their attention to Damon as they both strip him and put him in the middle. Jake goes to work on Damon's cock while Bobby's still feeding him his. Damon and Jake then begin to make out, kneeling on the floor as Bobby begins to explore Damon's outrageous ass. Jake then stands up and alongside Bobby as both feed Damon their cocks. Damon is in boner abundance with cock on either side as they take turns shoving dick down his throat. This all meat-diet this is definitely Atkins approved.Damon then gets put on all fours. While he continues to nurse on Jake's cock, Bobby eats his smooth hole out, getting him ready for the main event. Bobby soon lubes up and buries his dick deep inside him. Jake slides his throbbing meat into Damon's mouth as Bobby impales him harder. Damon's caught in a Chinese cuff and loving every minute of it as he gets that ass stretched. The chemistry is intense. Soon enough, Jake wants a turn. Bobby relinquishes his bone as Jake slides in that ass with his own anal invader. Damon is bent over the couch as Bobby fucks his mouth and Jake pounds away at that smooth bubble butt. Jake's balls slap away at his ass as he gets his deep one. Damon is taking dick like a champ, and his holes are being put to very good use. Bobby then wants more of that ass he got first dibs on, as he has Damon sit on his dick. Damon rides Bobby's cock as his hot ass continues milking that thick dick. Jake kisses and gropes Damon as he grinds that ass into Bobby's meat. Jake then gets his second turn at bat, putting Damon on his back and slowly fucking him while Bobby nurses on Damon's swollen cock. Jake fucks Damon missionary, and it sends Damon over the edge. 'Cum with my dick in your ass', Jake orders as he fucks him harder. Damon blows his nut all over his smooth abs. Bobby is next as he sits back and jacks his thick load all over himself. Jake is last, but certainly not least, pumping out quite the impressive load that pools on Damon's chest.",
  "models": [
    {
      "name": "Bobby Rail",
      "person_id": 28379
    },
    {
      "name": "Jake Taylor",
      "person_id": 28388
    },
    {
      "name": "Damon Audigier",
      "person_id": 30777
    }
  ],
  "release_date": "2010-01-15",
  "scene_id": 55139,
  "series": "Breeder Plus 2",
  "tags": [],
  "title": "Breeder Plus 2, Scene #01"
}