{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Kalleb Darko will be checking his cherry at the door this week when this 22 year-old New Jersey boy takes his first ride on the Man-Meat Express. Helping us with the daunting task of tapping Kalleb's insanely hot ass is Cameron Marshall. Cameron is 23 and from Texas, and admits he's loving the weather here since it's about 30 degrees back home. In an attempt to get to know these two a bit better, we asked each of them if there was anything they saw or read that had a lasting impact on them. Kalleb answered 'Forrest Gump'. He found that movie to be moving and it made an impact on him. Cameron's response is a book by American author Orson Scott Card named 'Ender's Game'. Ender's Game is a science fiction novel set in Earth's future, as an imperiled humankind struggles to survive different forms of alien domination. Hot and literate?that's refreshing. We asked them if they could have more time to do something they don't have enough time to do now with their hectic schedules, what would it be. They both answered the same: time off to do 'nothing at all'. We can relate; but today, we have plenty to do and cherry to plunder...and time's a-wasting!Kalleb's curiosity, that got him from filling out online applications, to straight porn and eventually our set, is gonna pay off for us as we get ready to watch that perfect ass finally get broken in. They break the ice, talking on the couch about the hickey Kalleb's girl gave him the night before, which leads to them making out.. As they make out, Kalleb undoes Cameron's jeans as they pull down his pants and get better access to his hardening cock. They strip down before Kalleb goes down on Cameron's meaty shaft. He teases Cam's knob with his tongue and tongue piercing. Cameron, who admits he's more romantic than portrayed, brings our straight boy back up so he can kiss him some more before he decides to give the straight boy some of what he was already giving Cameron. Cameron licks and sucks on Kalleb's hard cock and plays with his smooth balls as he samples his meat. Cameron then has Kalleb get on all fours so he can get a better look at that ass. Kalleb's ass is spectacular. This str8 boy has a compact bubble butt that just screams FUCK ME! Cameron begins teasing his hole with his fingers as he slides one then two digits up inside his eager hole. Kalleb is moaning like a bitch, loving the attention Cameron is giving him. I f he thinks Cam's fingers feel good?he's in for a treat.'You ready for my dick now? Cameron teases. Kalleb says 'Yeah' without hesitation as Cameron stands up and lets Kalleb get his cock as hard as possible. Cameron watches as Kalleb swallows every inch of his meat deep. Once Cameron's cock is throbbing, he sits back and watches as Kalleb straddles him and eases that virgin hole onto his meat. Once Cameron feels his knob push through that ass, he begins thrusting up inside him. Kalleb winces as he takes that cock inside for the first time. His sexy ass engulfs every inch, and is soon bucking back onto Cameron's cock wanting more inside him. Cameron bucks up into Kalleb as he bounces the virgin-no-more on his dick. Cameron then puts Kalleb on his stomach before sliding that thick dick back in for more. In this position, Cameron has all the control he needs and can bury his cock as fast and as deep as he wants to without a problem. Kalleb is taking it like a champ as he starts to buck back onto cam's dick. He can't get enough dick, and we have a feeling he won't hesitate to bottom again in the near future. Cameron's dick is now impaling its prize with ease, and Cameron is picking up the pace as he fucks Kalleb harder and faster. He then slows his thrusts til he's sliding it almost all the way out before grinding it balls deep. This does the trick sending them both over the edge. They both explode at the same time, coating Kalleb's sexy abs and cock in a blanket of cum.",
  "models": [
    {
      "name": "Cameron Marshall",
      "person_id": 28354
    },
    {
      "name": "Kalleb Darko",
      "person_id": 28390
    }
  ],
  "release_date": "2010-01-01",
  "scene_id": 55143,
  "tags": [],
  "title": "Little Big Horn, Scene #01"
}