{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The Joker's wild this week, and we ain't kidding. Kurt Wild is back with us to help us ring in the holiday. There are few things that could top finding a naked Kurt under your tree Christmas morning. Now, that's not to say we couldn't find a myriad of boys willing to 'top' Kurt  under a Christmas tree?but we're getting ahead of ourselves. Kurt, the unabashedly 'gay for pay' boy lives in Missouri with his wife and 3 toddlers. Yeah, he's done a lot for a baby faced 23 year old. This week, we decided to pair him up with some Hunter Vance. Hunter  also likes to play on both ends of the pool, so these two should get along fine. These are just two regular buds and much like the guys at home. Kurt loves Baseball, while Hunter says playing in bed is more his sport. We asked Kurt about the Mrs. at home and how she deals with his career path. He says she smacks him on the ass and says ?Go get some?. Kurt admits he gets horny for dick between shoots since he only bottoms on cam. Getting fucked is pretty addicting, so he definitely looks forward to those back door deliveries. Well, it's not really Christmas 'til something gets stuffed, and today Kurt will be doing the honors. So away we go...The start kissing softly as they begin to undress each other. Kurt's tongue begins to explore Hunter's smooth chest and nips as his hand make its way into his jeans. Their jeans come off next as they are left exploring the other in their underwear which is short lived. They stumble upon a box of fleshjacks and decide to have a little fun with them. Kurt is the first to slide his extra thick cock inside as he begins to fuck his. He pounds it up and down on his swollen meat before Hunter takes over for him jackin him with the fleshjack. Hunter then gives him the real thing as he takes his fat cock down his throat. Kurt teases Hunter as he shakes his meat around before slamming it back in his mouth. Kurt then returns the favor as he gets on his knees and starts to work on Hunter's thick dick. Kurt spits on his meat before going back down on it for more. Hunter loves the attention Kurt's giving his meat and knows soon enough Kurt will be giving other parts of his delicious frame some special ?attention?. All this oral action is getting Kurt's cock rock hard and ready for a lot more than just head.?You want me to fuck your ass?? Kurt teases, as we see Hunter begin to straddle his beer can cock. Hunter does his best to accommodate Kurt's cock that wants in. He whimpers as he impales himself all the way down to the hilt. Hunter than does his best to ride that thick dick, slowly getting used to its massive girth. Kurt just looks up at him with that baby face of his as Hunter's pain slowly turns to pleasure. Kurt then gets Hunter to kneel on a chair so he can fuck him doggy style. He slides that thick dick back inside him as Hunter's hole opens up for more. A view from below shows Kurt's cock and smooth balls as they slap away at Hunter's hungry hole. Hunter is taking his dick in stride now. The faster Kurt pounds him, the closer they both get to exploding. Kurt pulls his meat out of Hunter seconds before unloading a massive load all over Hunter's smooth ass. Kurt's load runs down his ass cheeks, splattering all over the chair below. Hunter than flips around, sits down, and explodes his own massive load that jets up into the air before cascading all over his own cock. Whew. This Christmas fuck came complete with early fireworks. Happy Holidays.",
  "models": [
    {
      "name": "Hunter Vance",
      "person_id": 28320
    },
    {
      "name": "Kurt Wild",
      "person_id": 28391
    }
  ],
  "release_date": "2009-12-25",
  "scene_id": 55145,
  "series": "Happy Hole-A-Days",
  "tags": [],
  "title": "Happy Hole-A-Days, Scene #01"
}