{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Two fresh faces join us this week as we bring you even more goodies for the Holidays. Bobby Rail is 24 and originally from West Palm Beach, FL. This blond hottie with the sun-kissed tan loves it here in Florida. His ideal Saturday night would involve lots of Techno, strobe lights, and a club where he can dance. Bobby likes to party. Today he'll be partying with an Arizona import by the name of Danny Brooks. Danny is also 24 and loves living out in the desert. He hasn't had as good an impression of Florida since it's been rainy the last few days. Well, his forecast calls for hot weather ahead. Danny is more of a home body and admits his ideal Saturday night would involve a relaxing evening at home. These two couldn't be further apart on the interests scale. Fortunately, we know that opposites attract. They are both sexual and Bobby admits he started suckin cock at about 12. Danny got his start a few years later at 15. They both like to jack off and both prefer using their imagination vs. porn or mags. We asked if there was something they've been fantasizing about that has yet to happen in real life. Bobby drew a blank; but Danny grinned and said he wants two dudes in him. A little DP never hurt no body (...watching). lol  Today, Bobby is going to bottom for the first time ever on cam; so he can at least check that off his fantasy ?to do? list.They start kissing as their hands roam free. Danny peels off Bobby's tee as his hands and tongue begin to explore his sexy chest. His tongue dances on his chest covered in a light coat of fur. Bobby then takes Danny's tee off exposing his naturally smooth frame. Danny's shorts come off and then Bobby loses his jeans. Now that Bobby is in the buff there's nothing stopping Danny from getting a better look at that meat of his. He goes down on Bobby's cock that is quickly awakening and growing by the second. Danny slowly sucks on Bobby's hard cock and it isn't long before Bobby wants to return the favor. Danny loses his briefs and sits back giving Bobby access to his boner. Bobby gets down between his legs grabs his aching meat and starts to slowly savor every delicious inch Danny has to offer. Danny then goes back down on Bobby as they exchange blow jobs. Danny slowly sucks on Bobby's cock that is now aching for attention. As we watch Danny go down on Bobby, we get an amazing shot of his smooth ass as he's bent over face first into Bobby's meat. Danny's cock is rock hard and will soon need a lot more than oral to satisfy it.Danny sits back on the couch with his rock hard cock pointing out the big dipper while Bobby starts to ease his hot ass down onto it. He's slowly getting comfortable to his anal invader as his ass starts to slowly give way. Soon Bobby is riding Danny's cock slowly as he gets used to its girth. He arches back and holds still as Danny starts to pump his dick up into him. Soon Danny's holding Bobby's beefy ass as he bounces it up and down on his rock hard cock. By now, the pain has turned to pleasure as Bobby stands up so that Danny can fuck him easier. Danny slides his cock back in, and as we get a shot from below, we watch as his cock impales Bobby's hot ass as his low hangers slowly slap that sweet ass. Bobby gyrates his hot ass back up onto Danny's cock, reveling in the moment. They then move to the couch where Danny slides his meat back inside Bobby in a missionary position. The over the shoulder shot is intense as we watch Danny slowly, methodically pump Bobby's hungry ass. The look on sexy Bobby's face says it all as he is getting fucked closer and closer to orgasm. Bobby's stroking his fat dick in time to every thrusts Danny's giving him. That ultimately does the trick as they lie side by side and stroke off until they explode each sending their thick and creamy cargo all over themselves. Damn. ?Ya gotta love that.",
  "models": [
    {
      "name": "Danny Brooks",
      "person_id": 28350
    },
    {
      "name": "Bobby Rail",
      "person_id": 28379
    }
  ],
  "release_date": "2009-12-18",
  "scene_id": 55148,
  "tags": [],
  "title": "Nailing The Rail, Scene #02"
}