{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we have two new faces for you on CircleJerkBoys. The first is 19 and originally from Cleveland, Ohio. This former Buckeye goes by the name of Jake Lyons and now lives in Orlando, FL. Jake admits that the best part of Ohio was leaving it. Next to Jake is another 19 year-old who didn't have to relocate to get to Florida. Jason Creed is from Pensacola, FL up near Alabama. They both love living in Florida and the bevy of men they find here. These boys keep themselves busy. We wanted to know what they watch on TV when they have some downtime. ?I don't watch TV, I watch porn and that's it? beams Jake. He admits his favorite kind of porn is DP; it's Double Penetration for this chiseled hottie. Interesting. Jason doesn't watch much porn at all but admits he loves watching ?Smallville? on his laptop. Fortunately there's nothing small about Jason. Even though he never measures his thick cock, he knows he's never been with anyone bigger. He loves to get rimmed. That's the one thing that drives him wild. ?My favorite position is actually in a car, you gotta sit in the middle, have them wrap their arms around the 2 front seats then they're stuck; and you can do whatever you want to 'em?. By the look on Jake's face, he's wishing ?he? was the one stuck in that car right now?so we better get started.They start making out. As Jason holds Jake's face ever so tenderly, Jake grabs his hand and shoves it south, right onto his growing cock. They kiss passionately as their clothes start to come off. Jake slides onto his knees as he unbuckles Jason's pants, eager to see just what he's working with. Jason lies back and watches as Jake eagerly engulfs his cock to the hilt. Jake swirls his head and tongue around Jason's thickening rod as it grows to its full length. Jake bounces his head up and down on Jason's rock hard cock and can't seem to get enough of that throbbing 8? cock. Jake then lies back and directs Jason south as he gets his first taste of Jake's thick uncut cock. Jason sucks his cock. Before you know it, Jake wants more of his. Jason straddles Jake's smooth frame as he feeds him more cock. Jake wants it bad that he uses Jason's rock hard cock to piston-fuck his face. Jason just watches as Jake goes to town on his cock that is aching for more. Jake then lies back pulling Jason down on top of him. Jason lets his tongue explore Jake's ass as Jake moans his appreciation as his smooth hole gets a proper rimming.Jake then goes back down on Jason one last time as Jason starts to finger his sweet ass. ?You wanna get fucked?? Jason coos before bending Jake over and sliding his aching cock deep inside that ass. ?Aww, Fuck yeah? is all Jake can say as Jason starts to fuck his ass. Jason doesn't wait long before slamming his cock deep as he fucks that hole. Jake is in heaven as he gets that sweet ass stretched wide. Jason then sits on the chair and has Jake sit on his dick. Jake rides that cock like a champ as he bounces on it, trying to get as much of it inside him. From there, these two go back to the couch where Jake gets to sit on Jason's dick again, only this time he's facing him. Jason knows what he's doing as he thrusts his cock deeper and deeper up into Jake's ass. Jason then puts Jake on his back and starts to pound his ass missionary. Jake has his legs above his head and Jason is doing whatever he wants with that ass. ?You got me so close to cumming? he moans, as Jason picks up the pace burying his cock in him even faster. This fuck scene is a scorcher as Jason eventually fucks the cum out of our young Buckeye, shooting his load all over his chest and face. Watching that sends Jason over the edge too, as he pulls out and moves up to shoot load after massive load ALL over Jake's pretty face. ?YUM!",
  "models": [
    {
      "name": "Jason Creed",
      "person_id": 28374
    },
    {
      "name": "Jake Lyons",
      "person_id": 30817
    }
  ],
  "release_date": "2009-12-11",
  "scene_id": 55149,
  "series": "Passive Aggressive",
  "tags": [],
  "title": "Passive Aggressive, Scene #01"
}