{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Florida is known for many things: Sunshine, palm trees, our beaches?and the Gators! This week we have a special ?Gator? that goes by the name of Cole Taylor. This green-eyed dream boy is into the beach and sports and anything he can do to enjoy the outdoors. He's currently seeing a girl and they've been together for about a year. He's 25, and even though he wishes he was better at studying, he's had his fair share of hands on Anatomy experiments specializing in the female form. He isn't hard to please in the bedroom. Just kissing him will get him fired up and ready to go. He is a lover and is all about the build up. He loves to please and likes to take his time and get them as hot as possible before they're ready to be plucked. ?I like to eat them out, finger them, I like to have intercourse obviously, but talking about foreplay I like to make out too? Damn baby! That sounds like the perfect menu. Cole's the perfect lover, and this selfless Gator boy is all about making sure both teams reach their sexual field goals. In a world of selfish jocks and bad one-night stands, Cole stands out among the crowd. He just grins and confesses that if you do it right, they'll always come back for more.Cole starts off by flexing his biceps for us and playfully smirking before taking off his tee with his back turned to us. As he does, we get our first glimpse of his muscular back. His back is well defined, like you'd find on a conditioned swimmer, and he's naturally just as smooth. He sits on the couch as he begins to grope his growing cock. His features are polished and chiseled. He has the face that could easily launch an A&F campaign and the physique to back it up. Cole's abs and chest are well defined. Once he stands and drops trou, we see even more of his ?ass?ets. His smooth abs disappear into his sexy boxers that house his cock and an outrageous ?Star Trek? ass. You know the kind?the kind where no man's been before. (Give it time, give-it-time.) lol He playfully pulls down his boxers to give us a peek at a cheek, then both as he shows us his backfield. Next thing you know, the boxers come off, and he's on the couch, covering himself with a cushion as this modest straight boy gets his cock hard and ready for it's unveiling. Once it is, he tosses the cushion and shows us his rock hard cock. This was definitely worth the wait. :)Cole starts to jack his cock as he sits back on the couch. We can now freely admire his physique. His chest and smooth abs are just some of the attributes this tight stud brings to the table. His thick thighs dusted with a light coat of hair, and his rock hard cock are equally delicious and on the ?must have? menu. Cole then flips around and kneels on the couch, giving us an all-access pass to that ass. His smooth ass cheeks part, showing us that furry forest wherein lies his tunnel of...well, you know! He strokes his meat as he under hands it, still letting us get our fill of his hot ass with the swim trunk tan lines. We get an amazing close up of Cole's face as he looks back at the cam to make sure you're paying attention. Those green eyes and sexy lips would make many swoon. Cole's cock is needing more than the occasional tug, and he gets on the couch and kicks back to get that cock off. Cole lies back and goes for gold as he jacks that pretty dick of his faster and faster. Without warning, his dick begins to fire off load after load...after load all over his contracting abs. Damn, this boy was seriously backed up. By the time he's done, his navel is glistening with his thick seed. What's a boy to do? Well, with any luck, we'll get the opportunity to show him exactly what we can do?to him!",
  "models": [
    {
      "name": "Cole Taylor",
      "person_id": 28389
    }
  ],
  "release_date": "2010-01-08",
  "scene_id": 55142,
  "series": "Straight Shooter",
  "tags": [],
  "title": "Straight Shooter, Scene #02"
}