{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we asked one of our fan favorites to help us welcome a special, new guest here on CircleJerkBoys. The familiar face belongs to none other than Dallas Reeves. Dallas  is always 'up' and willing to help out. The reason we thought it appropriate to ask our favorite Texan to help us out lies in the bright eyed face to his right. Visiting for the weekend is a fellow Texan who decided to give this whole man on man thing a try. What better time to try something than in a place like Miami where, lets face it, nobody knows your name (well, besides US ? and we'll never tell.) Casey Monroe is 21 and has the jock looks and the body to match. He claims to have left somebody back in Texas, and we guess what they don't know won't hurt 'em. We have a feeling Dallas is gonna enjoy his role as 'the' welcoming committee. We found a bit about Dallas last time he was here. We know he loves his pets, having an aviary at home. He loves to work around the house, and decorating is his thing. Casey is more into outdoor things and admits that, given the opportunity, he'd love to have a hot Maserati in silver under his control. Hot straight boys and fast cars are always a winning combination. Let's see what this Tall Texan combo will bring this afternoon....Dallas puts Casey at ease by giving him a back rub. It breaks the ice a bit, and Dallas is soon taking off Casey's shirt. He continues his massage as he explores the straight boy's defined pecs and biceps. Distracted by the massage, Casey is caught off guard as Dallas goes in for a kiss on the neck. He doesn't stop his advances, and from there, the two begin to explore each other. Casey is naturally smooth and has a large tattoo across his back. Bad boy with ink too, this just keeps getting better. Dallas pushes him back onto the couch as he pulls his jeans off to get at his straight meat. As his jeans come off, Casey's cock is already at half mast. His thick chubby is standing at attention as Dallas begins to stroke it, watching his hick foreskin play peek-a boo with his eager knob. Dallas goes down on him. Within seconds, Casey is rock hard. He bites his lower lip in ecstasy as Dallas licks and swallows his thick dick. Casey has a thick dick, and it doesn't seem to mind the new environment one bit. Dallas then gets up and gives him his first taste of man pole as he stands before him with his dick at eye level. Casey bravely opens wide and does his best to return the favor. He's a quick study, and soon working Dallas' cock with a passion.They then get into a hot 69 on the couch, with Casey on Top Bunk, bobbing his head up and down on Dallas' cock like he's bobbing for apples. Dallas is on the other end of this steamy scene with his throat full of straight meat and his fingers beginning to explore Casey's smooth, virgin ass. Casey's beefy ass is spread wide as Dallas' fingers begin to make their way inside. The next thing we see is Casey with a grimace on his sweet face. He is bouncing up and down, trying to accommodate Dallas' cock, which is now mostly buried up his once virgin ass. Dallas just lies back and watches as his cock gets buried inside Casey as he holds him by the waist, steadying him as he takes his first ride. Dallas gets him up and reenters him from behind. Casey slowly groans as he takes more dick. His cock and heavy balls swing free as Dallas keeps fucking him. The sounds of ball slapping and moaning now fill the room as Dallas picks up the pace. Poor Casey is still grimacing while Dallas has his way with him. It's not over yet, as Dallas gets our sweet Texan on his back and lifts those thick thighs in the air. Casey's ass swallows that dick deep again as Dallas starts fucking him faster and deeper. They both get close, and Casey jacks his thick load all over Dallas' ripped abs. The sensation sends Dallas overboard as he explodes all over himself as well.",
  "models": [
    {
      "name": "Casey Cox",
      "person_id": 28396
    },
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    }
  ],
  "release_date": "2009-11-13",
  "scene_id": 55157,
  "series": "Boys Night In",
  "tags": [],
  "title": "Boys Night In, Scene #01"
}