{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Well, we have the East coast/West coast connection known as Dayton O'Connor and his real life beau, Tory Mason back with us. Dayton  is 24 and from Pennsylvania while Tory is 23 and from Los Angeles. They've been together now for about 6 months and couldn't be happier. These two are quite the duo and with their A&F looks. With Tory's unique sense of humor these two will go far. We asked these two what they would do if they were to hit it big, what would they blow their money on. ?Lube? is Tory's immediate response. Classic Tory! These two are here to do their second scene with us. They don't get to do many scenes together, so it's a treat for all involved. When it comes to fantasy scenes or partners that they might want to invite into the mix, Tory says he would want a hot Latin boy. Blond cutie seeks dark Latin lover. That makes perfect sense since opposites do attract. Dayton, on the other hand, would want a ?big, muscular, bear, jock boy?. Dayton's reply just went multiple choice (as well as multiple partners). It's always healthy to fantasize; but these two aren't ready for that kind of action anytime soon. Looking at these sexy studs with their jock looks, great personalities and ever ready fun sticks, we don't see the need to be adding anything extra to the mix.They begin playing around on the bed before they begin their first ?private video?. Cam in hand, Dayton aims at his hottie who is slowly stripping his clothes off while trying to keep a straight face. Tory's loving it as he flexes his pecs and shows off his defined bod. He turns around to give the cam a better view of his ass, followed by the unveiling of his package. He starts to play with his cock, then all bets are off. Tory rushes the cameraman as they begin to make out. Tory then grabs the cam and gets a close up of his beau as he starts to strip off his shirt. Dayton's hands roam and find Tory's hot smooth ass. He wets his finger and slips it inside while Tory moans softly. His ass looks amazing as Dayton teases his hole. Tory then stands and kicks off his briefs. He straddles Dayton's chest and feeds him his cock. We get up close and personal footage of Dayton sucking Tory's jock meat. Dayton takes the cam next and zooms in as Tory goes to work on his thick dick. Tory spits on his knob and lubes it before going down on it. He strokes Dayton's cock and licks those balls, driving Dayton crazy. He licks the knob and jerks it, either holding out on the oral or just teasing him mercilessly. You decide.Dayton's had enough as he puts Tory on all fours and spreads that beautiful ass wide open. His smooth, hairless hole is in sight, and Dayton can't resist. He goes in and starts eating that pink hole out as he teases it with his tongue and fingers, getting it ready for his cock. He slowly slides his finger and orders Tory to back up onto it, which he does without hesitation. He slowly starts to rub his knob on Tory's bare hole, asking him if he wants that dick in him? Rhetorical questions can be SO hot! Tory's ready, and Dayton lubes up that sweet hole and slowly claims his prize. His cock slides deep inside him, and he's banging away soon enough. Tory is just as aggressive as he bucks that hot ass right back onto Dayton's throbbing meat. The chemistry is incendiary as these two fuck like animals. Dayton leans down and hugs Tory's chest as he continues to barrel into his hungry hole. The sound of his balls slapping that ass may fill the room, but Missionary is next. Day slides that dick back inside for more as Tory keeps giving it up. After he gets his fill he lies back as Tory sits on his cock. Tory rides his dick hard and it sends him over the edge. ?Are you ready?? he groans seconds before busting all over Dayton's chest. Dayton isn't far behind as he sends his own massive load all over himself. That's a wrap.",
  "models": [
    {
      "name": "Dayton O'Connor",
      "person_id": 27958
    },
    {
      "name": "Tory Mason",
      "person_id": 30491
    }
  ],
  "release_date": "2009-11-20",
  "scene_id": 55156,
  "tags": [],
  "title": "Dayton & Tory Make A Porno, Scene #02"
}