{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Two recent finds are back with us this week, as we pair them up and watch the fireworks. The first is one of Minnesota's finest, Clark Chase. Clark  is 21, and was last here tearing up some Kurt Wild. Our members were so impressed that we wanted to bring him back. This week, we decided to pair him up and add a bit of local flavor to the mix. By local 'flavor' we mean none other than Cubanito Nick Cross. Nick  is also 21, and has amassed his own fan-following. These two are into sports, but more of the watching them vs. playing them. Given a chance to pick the team they would want to win the Super Bowl, Clark picks the Miami Dolphins. Now there's a long shot! lol When we ask Nick, he confesses he's not into Football and is more into Basketball. He would route for the Miami Heat to win the NBA Championship. The Dolphins and the Heat? That's some serious ass-kissing 'Miami' style. We then asked these two studs if they had a fantasy career what would it be. Nick confesses he would want to be an actor in Spanish telenovelas (queue the dramatic overture). Clark would want to be an entrepreneur and own his own business. Well this would be actor and future mogul are both currently single and open to mingle. So it's not too late, fellas.They aren't sitting idle long before Nick's hands come exploring. He gropes Clark's cock as they begin to kiss. Their t-shirts come off, giving them more things to explore. Their jeans are next, as the kissing and groping escalates. Everything is going according to plan. Nick then goes down for a closer look. Before you know it, he has Clark's hard cock in his throat. He expertly bobs his mouth on Clark's throbbing meat. Clark reaches over and strokes Nick's uncut cock as he gets his own cock swallowed deep. Clark guides Nick's head up and down on his cock as Nick continues to worship his thick dick. Nick can't get enough of that dick as he strokes and sucks on it. He then slides onto his knees and spreads Clark's legs wide. He goes right back to sucking that meat, and in this position, can get even more down his throat. He slowly licks along Clark's shaft, teasing him before engulfing every delicious inch of it again. Clark is in heaven as he lies back and gets his cock serviced. No matter what position Clark gets into, Clark's cock finds its way back into Nick's hungry throat. Clark's cock is throbbing by now, and it's gonna need more than Nick's mouth in a minute.'You ready to ride this big cock?' Clark teases. You won't have to ask Nick twice, as he slowly sits on Clark's thick dick. He strokes his own tasty cock as he slowly impales himself on all that Minnesota meat. It isn't long before his tight ass has that thick dick deep inside and Nick starts to ride his cock with ease. Clark holds Nick by his tiny waist as he begins to hold him in place and fuck his dick deeper and deeper into him. Nick loves it. He can't get enough as he grinds back, wanting every inch buried inside him. Clark then bends Nick over and slides his meat back on for more. Nick's begging him for more the entire time he's getting that ass stuffed full of dick. Clark has a spectacular view as he looks down to see Nick's smooth ass making his throbbing cock disappear. Clark playfully slaps Nick's ass as he continues fucking him. Nick is moaning and groaning as Clark has his way with his ass. Clark then puts our Hispanic Hottie on his back so he can fuck him missionary. 'Yeah fuck my ass' Nick coos, as Clark slides back inside him. Missionary always does it, and soon enough, Nick is warning that he's about to nut. Clark fucks him harder as Nick explodes loads of 'leche' all over. Clark then hauls his meat out and blasts his load all over a now happier happy trail.",
  "models": [
    {
      "name": "Clark Chase",
      "person_id": 28381
    },
    {
      "name": "Nick Cross",
      "person_id": 28393
    }
  ],
  "release_date": "2009-12-04",
  "scene_id": 55151,
  "tags": [],
  "title": "Cut To The Chase, Scene #01"
}