{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we celebrate a milestone as we film our Centennial Duo Episode. One hundred episodes of hot, young men in hotter man-on-man action, have passed through these horny, hallowed walls, and some left much less straight then they walked in! Helping us out this afternoon is a face we haven't seen in a while, Tucker Forrest. Tucker  is originally from the Midwest; and now calls Fort Lauderdale, FL 'Home'. We're pretty sure all the hot men and beautiful beach weather here help make up for all those snow storms he's missing back home. Speaking of hot men, we have Phillip Heritage back in the house as well. Phillip  was first here in September as a perfectly str8 boy lookin' for a hole for his pole. But now that he's been back a time or two, he's expanded his horizons and now knows just what's for dinner on the other side of the buffet line. On his last visit, Phillip got to slide his meat into a hot piece of ass. This afternoon, we couldn't think of a more appropriate way for him to show us his gratitude than by giving up his own man cherry during our Centennial episode. Fuck, Forrest?FUCK! This is going to be a good one as we watch Phillip grin and bear it as Tucker invades that smooth, whore-loving ass. Mmmm.Sitting on the couch, they begin to get comfortable. Tucker keeps his cool as the str8 boy begins to explore on his own. They take off their shirts and Phillip licks and sucks at Tucker's smooth chest and buries his hands into his pants. Phillip slides down in between Tucker's legs as he pulls off his pants. Tucker's sexy briefs are short-lived as they hit the floor as well. Phillip goes to work on Tucker's cock as he sucks it down. Tucker moans his appreciation as Phillip goes to town on his new toy. He licks Tucker's balls and shaft before going back down on his cock repeatedly. Phillip has a new found appreciation for cock, and he's gonna get as much of it as he can. Phillip then gets up and wants a little in return. Tucker is more than happy to oblige as he sucks on Phillip's throbbing cock. He gets his face fucked by Phillip until Tucker directs him back onto the couch, where he can suck his cock easier and have easier access to that ass he'll soon get. Phillip groans as he lies back and has Tucker sucking his rock hard cock. Tucker's fingers soon find his intended target as he begins to finger his prize.Tucker gets into position between his legs and suits up before pressing his rock hard 8' cock up against no-man's land. He pushes in as Phillip's ass gives way. Phillip grunts as he takes his very first cock. Soon, Tucker's gliding that bone in deep without as much resistance and Phillip is getting into getting fucked. Once he's broken that ass in, Tucker flips him over so he can enter that smooth ass doggy style. 'Fuck, it's so big' grunts Phillip, as Tucker gets back to pounding his hole. Tucker climbs aboard for the ride of his life as he continues to impale that ass. 'It's SO big' Phillip repeats, 'it's killing me.' Phillip is taking it like a man, but is already begging Tucker to bust his nut. Tucker's in no hurry as he takes his time plowing that newly initiated hole. That ass feels amazing wrapped around his thick cock, and it feels too good to stop. Tucker then bends Phillip over the arm rest of the couch and glides that cock right back in for more. Phillip spreads his ass wider with both hands as Tucker goes back to fucking his tight ass. By now Phillip can only grunt and groan while Tucker has his way with him. Tucker's cock finally explodes all over Phillip's back. Phillip then gets his turn to shoot all over Tucker's smooth chest and abs as well, making quite the mess. Someone liked the dick more than we expected. He'll be back. Happy Thanksgiving from CircleJerkBoys.com!!!",
  "models": [
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    },
    {
      "name": "Philip Heritage",
      "person_id": 28360
    }
  ],
  "release_date": "2009-11-27",
  "scene_id": 55154,
  "series": "100 and Counting",
  "tags": [],
  "title": "100 and Counting, Scene #02"
}