{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we have a wild episode for all of you, with two new faces. The first is Kurt Wild. Kurt is from the Show Me state, and we are glad he's gonna be doing a lot of that in a few. Kurt is 23, and this Missouri boy is an active boy with jock looks. He likes to film Audubon scenes and wildlife. He likes outdoorsy stuff. Aside from porn, if it's rainy and he can't go outside, then he and his girlfriend find ways to keep themselves entertained. The second sexy face we have with us belongs to Clark Chase. Clark is also 23 and also an outdoors aficionado. He likes to play tennis, swim, surf... anything athletic that will keep him busy. We asked these two if they could have any car they wanted, what that car would be. Clark went for a classic black Bentley; while Kurt went for a baby blue Porsche Carrera. We then took it one step further and asked them if they were to make a movie about their lives, which actor would they want to cast to play their lead roles. Clark went for the sexy and chiseled Paul Walker. Not a bad choice when it comes to hot men. Kurt blushes and says Brad Pitt. He really likes his ?movies? a lot. riiiight! Well, for now, we're gonna have both of these hot men playing themselves playing with each other.Clark takes the lead as he leans in to start kissing Kurt. Kurt pulls off Clark's tee as he draws him closer. They continue to kiss as Kurt nudges Clark back onto the couch. Kurt is now on top. His tongue is exploring Clark's smooth chest and abs as he makes his way south. It isn't long before Kurt has a mouthful as he sucks on Clark's growing cock. His hands run up to feel Clark's pecs and abs, then head south to strip Clark's jeans off him completely. Kurt now has total access to that delicious dick before him, and he makes good use of it. He sucks on Clark's cock like a champ and takes all of his meat deep. He slowly works and sucks it as Clark looks down and enjoys the view. Kurt then gets up and lies back as Clark begins to return the favor. First he kisses Kurt, then licks down his fuzzy chest and abs and frees his meat. Clark takes Kurt's thick meat in his mouth and begins to work his magic. Kurt squirms around as Clark continues to nurse on his meat. Clark wants more of that mouth, and moves up to straddle Kurt's chest. He shoves his cock in Kurt's mouth as Kurt begins to finger his sweet hairy ass. ?You gonna fuck me?' Kurt taunts 'you gonna make that big cock throb in my pink ass?? ...Damn!The next thing we see is Kurt's hot ass slowly sliding down on Clark's rock hard cock. Kurt's moaning as he gives it up as he starts to ride that thick dick he wanted. His own cock is rock hard as he arches back on his toes to keep ramming that dick deep inside him. Kurt then gets up and straddles Clark facing him this time so he can keep continue getting more. ?Kiss me? he whimpers, as Clark keeps grinding his dick up into him. From there, Clark puts the pretty boy face down on the couch and gets right back in for more. Kurt's moaning and begging for more as Clark buries his dick deep in his insatiable ass. ?Put it back in? Kurt moans as he begs to be fucked. Kurt reaches back to feel Clark's pecs as he keeps getting pounded. After fucking his sweet ass doggy for a while, they switch things up and Clark puts Kurt on his back and holds his ass up in the air before pile driving his dick deep inside him. From there, Kurt wants to ride it again. When he does, he can't help but explode as he rides that dick harder and deeper. Kurt explodes, sending load after thick load all over Clark's thighs and the couch below. Clark then strokes off his own throbbing cock all over Kurt's fuzzy pecs. Fuck, that was hot.",
  "models": [
    {
      "name": "Clark Chase",
      "person_id": 28381
    },
    {
      "name": "Kurt Wild",
      "person_id": 28391
    }
  ],
  "release_date": "2009-11-06",
  "scene_id": 55160,
  "tags": [],
  "title": "Wild Thang, Scene #02"
}