{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we brought back Micah Matthews with the jock looks and the country charm. Micah is 25yo and from Memphis, TN. He swears it's not the country. Mmhmm. He says he's been gay for as long as he can remember. He dated girls in high school but he always knew it wasn't for him. We decided to give him a little local flavor this time so we got a hot little cubanito to show him some Miami flavor. Nick Cross is 20yo and originally from Cuba. He's been here for 9 years and admits he's been gay since he was little and even when he was in Cuba he was already fooling around with his friends. He admits he likes taller men and likes guys that are sweet and affectionate. He likes guys that keep it interesting: crazy, passionate or romantic but they have to be cute to get his attention. This boy wants it all. Well, next to him he's got the total package. Micah is relaxed and comfortable in his own skin. He has a very masculine energy and it has helped him seduce those boys teetering on the edge of curiosity's cavern. He gets guys that admit to wanting to know what it's like to fuck around with a guy but they don't want it to be with a ?girly? man. Well no girly men here just two boys about to get a whole lot hornier. They begin kissing as they start to get acquainted. Nick is ready to go as he undoes Micah's jeans and pulls out his soft cock. Once he goes down on it, Micah's cock instantly comes to life as it immediately bones up. Micah then flips things and puts Nick on his back as he kisses him and undoes his shorts. By the time his shorts come off, Nick's uncut cock is rock hard and throbbing for attention. Micah goes to work on it as he sucks it until his chin has met Nick's heavy nut sack. He takes his time as he sucks on Nick's cock as Nick softly moans his approval. Nick has quite the lean physique and has ink on his arms and his navel. Add to that his sweet 7? cock on his tight 5'6 frame, we'd say good things do come in small packages. Nick then wants more of Micah's meat as he has him lie back for more. Micah's head writhes back and forth as his cock disappears into Nick's skilled mouth as he swirls his tongue and lips around his thick cock. They then maneuver into a sweet 69 position as they continue to suck cock. Nick's on top while Micah is lying back nursing on Nick's uncut meat. Nick's deep-throating Micah with ease as Micah begins to explore Nick's tight ass as he slaps and begins to finger him. Already in position, Nick stays put as Micah slides out from under him and then buries his tongue up his ass. Nick's in heaven as he gets his tight hole reamed. Micah's getting his sweet ass ready for his fat dick as he licks it and fingers it, spreading his cheeks apart to get better access to it. He then slides his spit lubed finger inside as he teases his ass and continues sucking on his back door. Micah then puts Nick on his back; lifts his legs and slides his cock inside Nick's wet hole. It doesn't offer much resistance as he slides all the way into him and lies atop him kissing him while he starts to fuck him. ?Awww, Fuck me? begs Nick. ?You like that?? teases Micah as he begins to pick up the pace burying that cock deeper and faster as he holds on to Nick's compact ass. Micah begins to pile drive into Nick, holding him in place as he lays on him with his full body weight. He then sits back on his knees, grabs Nicks thighs and begins to impale our Cuban boy faster and faster as he bounces him on his dick. Doggie is next as he gets Nick back on all four and slides back inside him. Micah then pushes him down onto his belly as he starts to plow him harder. Lastly, Nick rides Micah as his own rock hard cock stands at attention, This one does the trick as Nick explodes all over Micah still burying his dick inside him. Then Micah, apparently overcome with emotion, jacks his own thick load all over his smooth abs.",
  "models": [
    {
      "name": "Micah Matthews",
      "person_id": 28397
    },
    {
      "name": "Nick Cross",
      "person_id": 28393
    }
  ],
  "release_date": "2009-10-08",
  "scene_id": 55167,
  "series": "Big Bang",
  "tags": [],
  "title": "Big Bang, Scene #01"
}