{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we have Phillip Heritage back in the house and doing his first shoot where he'll be trying the fruits from the forbidden tree. Phillip is 24 and from Valparaiso, IN. Totally straight, but willing to try new things, we never saw this coming. But Phillip  likes to try new things and has even jumped out of a plane, so even though this wasn't anything he'd ever anticipated, he isn't all that terrified to try it. Who knew!? -America needs more boys like Phillip Heritage. In the spirit of Halloween, his dick will be getting a treat, but we'll be tricking it as to what it's going to do.  Fortunately, we got the perfect 21 year-old boy for the job, Mr. Krist Cummings. Krist  is on the job and more than willing to help our inked lover lose his man cherry. You won't find those in your trick or treat goody bag. Today Krist, who has some experience with those straight boys that feel the urge to dabble, will boldly take Phillip's 'ship' deep into uncharted territory as it makes its maiden voyage into man to man sex land. This is sure to be an unexpected Halloween surprise...on so many levels. LolWearing their Halloween masks, these two ghouls begin to grope each other as they play around. Phillip unmasks Krist; knowing full well he'll need that mouth available for his growing meat. Krist wrestles a bit before freeing Phillips cock and going down on it. He bobs up and down on Phillips meat as it slowly grows inside Krist's expert mouth. Phillip then takes off his mask for a better view as he watches his dick being worshipped by a dude for the first time. He likes the view and stands up to give Krist better access as he leans over Krist's hungry mouth. Krist works his cock like a pro as Phillip begins to face fuck his sweet mouth. Phillip then strips Krist before sitting behind him on the couch and giving him more dick to work. By now, Phillip's cock has realized a mouth is a mouth, and it's at attention as it dives in and out of Krist's throat. 'Suck on it-suck my balls', Phillip orders, as he watches Krist on his knees submitting to his every desire. Phillip strokes his meat inches from Krist's face as he teases him saying, 'You want me to fuck you with that huh?' Who knew he had it in him as he slams his cock deep into Krist's mouth egging him on so that Krist will suck him even harder.Phillip suddenly takes Krist and throws him back on the couch before putting his mask back on him and teasing his ass with his knob. 'I'm gonna cum all over you' he says before slamming his straight meat inside his first boy ass. Krist's ass gives way as Phillip begins to fuck him. Once inside, he gets his rhythm, and he's pounding away at that ass like a champ. Phillip's pecs flex, as do his biceps, as he pummels his dick deep into his first piece of man ass. Krist then climbs aboard as he rides Phillips dick. As he bounces on his dick we see Phillip's balls begin to pull tight around the base as he continues to fuck that ass. 'Gimme MORE' Phillip grunts,' Look at me, Bitch!' This hottie is a verbal one as he impales Krist onto his throbbing meat. The chemistry is animalistic as these two go at it. Phillip can't seem to get enough of Krist's smooth ass. After he gets his cock ridden for a while, he puts Krist on his back and aims his meat south. He slides his cock deep into Krist and starts fucking him deep like an oil rigger digging for crude. Krist's shoulders on the floor and his ass in the air as Phillip piston-fucks that hungry ass. Phillip can't hold back any longer and pulls out before shooting his load all over Krist's freshly fucked hole. (Well, he did warn him that that was coming) The feel of Phillips hot load all over his ass and cock sends Krist over the edge as he too explodes all over himself. Trick or treat? ...You decide. Happy Halloween.",
  "models": [
    {
      "name": "Krist Cummings",
      "person_id": 30770
    },
    {
      "name": "Philip Heritage",
      "person_id": 28360
    }
  ],
  "release_date": "2009-10-30",
  "scene_id": 55161,
  "series": "Costume Balls",
  "tags": [],
  "title": "Costume Balls, Scene #01"
}