{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have a whole lot of jock to go round as we bring you two new faces on CircleJerkBoys. The first is Dayton O'Connor. Dayton is 24 and he's from Pennsylvania. At his side is Tory Mason. Tory is 23 and he's from Los Angeles. It is going to be an East coast/West Coast connection. There's actually a 'connection' between these two every night since these two studs with the chiseled frames and Abercrombie type features are, in fact, an item. They met on the beach and Tory admits he was stalking him for a while and eventually he just had to have him. They've been together for 3 months now and Tory admits his favorite feature that Dayton brings to the table is his thick cock. Woof! Dayton follows up with the fact that Tory's hole is the hottest thing Tory brings to the table. These two are incorrigible and while Dayton smiles and admits that Tory's sense of humor is a turn on. Tory professes he just loves how dumb Dayton is. Don't get them started. lol They both like watching porn together and like to explore new things as well. They even would even consider sharing a guy together but that has yet to happen. We'd love to be a fly on those walls when they decide to stray together. For now, we'll get to see what it looks like when they don't and the need to breed succeeds! Gentlemen, Start your engines!Tory starts off giving his beau a foot rub and as he rubs his hands moves north until it finds its way into Dayton's shorts. Dayton responds immediately getting up to kiss his better half. They start making out, their tongues dancing as they begin to grope and explore each other. Tory pulls off his tee exposing his ripped frame. Dayton kisses him and strips off his shorts to get at that cock of his which is already straining to play. His briefs can't hold it in as Dayton hauls it out and immediately goes down on it. Tory's cock is rock hard and he watches as Dayton sucks his thick dick until his nuts meet Dayton's chin. Dayton teases Tory's smooth balls as he gives his briefs one finial tug leaving him in the buff. He can't seem to get enough of Tory's meat and as he does his finger finds its way into Tory's sweet hole. We know where he's headed; but he's just not there yet. He gets up and strips so that Tory can get some dick of his own. Tory immediately begins to stroke Dayton's hard cock as he gets on his knees before him. Dayton moans as Tory swallows his cock and gets his dick spit lubed as well for the fun to cum. This has only begun and Dayton wants to get Tory ready for the main event.Dayton bends Tory over and we get an amazing view of his jock ass as he shoves his finger deep inside his tight ass. He needs support as he dives in tongue first. He licks and sucks on that sweet ass getting Tory hornier for that dick of his. Once he's primed, Tory straddles Dayton and climbs aboard as he takes every inch of that thick dick. He easily rides that dick as Dayton's balls start to slap his smooth bubble butt. Dayton's smooth balls are pulled tight as he fucks him and the view from above while Tory grinds his hole on Dayton's meat is insane. Now it's Tory who can't get enough dick as he holds on to Dayton's neck and chest, kissing him as he bucks his sculpted frame back and forth as he impales himself repeatedly. 'Turn around on it' Day orders as Tory gets off his cock only to sit back on it. In this position Dayton can bend Tory over and fuck him silly as he holds onto his waist. Tory arches his back and braces himself on Dayton's rock hard abs as he gets his ass pounded. In this position we get to watch Dayton's dick impaling Tory's ass as Tory's rock hard cock bounces airborne like a diving board. Dayton then gets Tory in a doggy position so he can fuck him and grind that dick as deep as he can bury it. That does the trick and in no time these two are busting their loads all over each other as they both shoot their loads all over Tory's delicious bod. Mmm. Got Milk...cookies anyone?.",
  "models": [
    {
      "name": "Dayton O'Connor",
      "person_id": 27958
    },
    {
      "name": "Tory Mason",
      "person_id": 30491
    }
  ],
  "release_date": "2009-10-16",
  "scene_id": 55165,
  "series": "More Than Friends",
  "tags": [],
  "title": "More Than Friends, Scene #01"
}