{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have two new faces on CircleJerkBoys. Krist Cummings is here for his first time; but he's not exactly a first timer. Krist has become a regular on our brother site, ExtraBigDicks. Krist has been paired up with many a hung hottie and we figured we should see his talents on our site. Krist, who is originally from Texas but now calls South Florida home, brought along a friend. The jock looks and the thick 8' cock Krist brought along belong to 25yo Micah Matthews. Micah is originally from Memphis, Tennessee. He's been down here for about 5 years and has no plans of leaving Florida anytime soon. We decided to ask these two what their guilty pleasures are on TV. That one thing we watch that we may not want anyone else to know we love to watch. Micah admits his guilty pleasure would be watching 'Xena, Warrior Princess' and Krist chimes in with 'Golden Girls' as his favorite. We then asked them to tell us which male actor they find attractive even though they may not be the conventional 'ideal'. Krist admits he's into Will Wheaton from Star Trek and for Micah he's into that guy from Juno. He loved the shorts he wore. Different strokes we guess. Speakin' of strokes we should probably get these two 'strokin' to say the least. :)They kick back flipping through dick magz which sets the mood for the fun to follow. Krist makes his move as he leans over to make out with Micah. Micah is more than willing as they begin to make out and get better acquainted. Their tees come off and Krist isn't stopping there. He slides off Micah's pants and goes right to work on his growing bone. Micah goos his approval as Krist bobs his head on his now hard meat. Krist strips off what's left of his clothes as they continue tasting and licking each other. Micah wants some and he starts by licking Krist's growing cock through his underwear seconds before yanking them off & engulfing his shaft to the hilt. He works Krist's cock with his fist up and down while he swirls his tongue around the shaft. Krist moans softly as he looks down to watch Micah, on his knees, going to town on his spit-shined cock. Micah can't seem to get enough of his dick as he repeatedly swallows Krist's cock all the way down til his chin meets Krist's smooth balls. 'Mmm, you taste so good' he says just as Krist pulls his meat out and puts Micah on his back. Krist wasn't done with Micah's thick shaft and he wants some more as well. All the oral action is getting these two hot and ready for more than just a little cock sucking. Krist continues to suck on Micah's cock as he licks on his sexy abs and nips. Krist wants more than a mouth fucking as he suits up Micah and readies himself for a fucking. Micah gets between his legs and readily glides his rock hard cock deep inside Krist. Micah's balls are soon slapping away at Krist's hungry ass as he fucks him harder and harder. 'Feels amazing' Krist groans as Micah continues to shove his cock deep inside his smooth ass. The chemistry between these two is intense and Krist wants more as he impales himself on Micah and begins to ride Micah's cock. 'Like riding my cock?' Micah teases as Krist fucks himself silly. Micah has quite the view as he watches Krist's sweet ass playing 'Now you see it; now you don't!' with his cock that's already begging for release. Micah's cock is hitting Krist in all he right places as he shoves himself deeper and grinds down on Micah's cock. 'Awww, I'm gonna cum' Warns Krist as his cock erupts sending his load all over the comforter. Micah then jacks his own massive load sending blast after thick blast all over his smooth chest and abs. What a (creamy) mess! <evil grin>",
  "models": [
    {
      "name": "Krist Cummings",
      "person_id": 30770
    },
    {
      "name": "Micah Matthews",
      "person_id": 28397
    }
  ],
  "release_date": "2009-09-11",
  "scene_id": 55176,
  "series": "Davey & Goliath",
  "tags": [],
  "title": "Davey & Goliath"
}