{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have Adorable Giovanni Summers back and he's brought a friend and props. Go figure! Today Gio  showed up wearing his original-wait for it-boy scout uniform. O-M-G. 'I've had it since I was 12, maybe younger', he grins 'but it still fits.' Yeah, we'll just go with that. With Gio is one sexy 22yo Texan transplant that goes by the name of Lee Stevens. Lee now calls Miami home and has been happily married for almost a year. Yeah he's a str8 one. He says he doesn't find anything too surprising about married life. 'Everybody tells you what you're in for before you actually get there.' He grins. He's still in the 'fucking like bunnies' phase with the missus but admits he still finds time to jack off when he needs to. We guess she does need to take a nap on occasion. This bad boy started stroking his cock at about 11 and we figure by that age Gio had acquired a merit badge or two in 'autoerotic combat'. It only got better when he realized he could actually add a friend. Today's friend is a nice married boy whose need for money lands him in all sorts of things. Today that thing will be Gio!  Lucky fuck.Eyeing up Lee, Giovanni sits perched and set to pounce beside the bed. It doesn't take him very long at all to make his move as he gets off the chair and climbs onto the bed. He slowly begins to rub Lee's crotch as he slowly explores up underneath his tee. Lee helps him along by peeling off his tee which gives Gio the permission he sought. As he licks and sucks on Lee's smooth chest, Lee pulls down his pants as his rock hard cock springs out. Apparently the party started in his pants way before we thought. Taking one good look at that meat Gio isn't about to waste any time on formalities. He positions himself between our str8 boy's thighs and starts sucking that fat dick like there's oxygen in it. He ain't coming up for air anytime soon either. Who could blame him as Lee slowly strokes his str8 meat wanting Gio to suck on his heavy nuts. Lee is soon buck ass naked as Gio continues working that dick in several angles. Lee slaps Gio's face and tongue with his cock that by now is aching and wanting even more. Lee stands up so he can get deeper access as he starts to face fuck our sassy scout.That mouth was good for starters but this breeder bone needs a hole to pound. Fortunately, Giovanni came equipped with a hole for just that purpose. (mostly) Lee bends Gio over on chair as he shoves his thick baby maker inside. Gio grunts as he takes every thick inch he's given. Lee starts fucking his ass the way he likes it; steadily mounting him. Gio takes it like a trooper as Lee puts him face down on the bed. He glides back in that sweet ass as he begins to fuck his ass bouncing up and down into him. From there he continues to fuck him doggie style. All Gio can do is moan and take it as Lee pounds away relentlessly. A view from above shows Lee's thick dick disappearing up inside Gio as he takes his prize. Lee then puts Gio back on his stomach; spreads his legs and goes back for more. In this position Lee can bury every inch of his cock deep. This str8 boy loves to be in control fucking Gio deeper and harder. Lee's hairy bush becomes a blur on his smooth frame as he impales our daring scout. He flips him over on his back and fucks him missionary. That does the trick. Lee pulls out and blows his load all over Gio. Once he's blown his nut he leans down and gives Gio a soft and unexpected kiss. Awwww.",
  "models": [
    {
      "name": "Lee Stevens",
      "person_id": 28403
    },
    {
      "name": "Giovanni Summers",
      "person_id": 30672
    }
  ],
  "release_date": "2009-08-28",
  "scene_id": 55179,
  "series": "Even Stevens",
  "tags": [],
  "title": "Even Stevens, Scene #01"
}