{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "A familiar Texan is back with us and we are more than happy to have ourselves a little a bit of Dallas?Dallas Reeves that is. Dallas  has been on our site a few times and shown us just what this lone star can do regardless of where he ?ends up?. Top, bottom, it's all good with sexy jock Dallas in the house. Dallas is now 25 and currently resides in Ft. Lauderdale. This week we delved deeper and asked Dallas to tell us something about him we hadn't discovered. Turns out our sexy Texan is quite the ornithologist. He has over 30 birds at home and can't seem to get enough of them. Luckily his partner doesn't mind one bit. This afternoon a slice of the West Coast will be served up in the form of James Kelly. James was born and raised in California and he's going to take one for the team today even though he prefers the company of the curvaceous kind that have a vagina to offer. Fortunately James is in it for the Benjamin's and admits that it's a love/hate relationship. Having sex with guys makes his pockets bigger but pursuing women makes them much smaller. Ass, gas or grass, James?no one rides for free! Speaking of ?rides? I think it's about we get these two started...Slowly breaking our pseudo str8 boy in, Dallas begins by licking and sucking on James' neck as he begins to undress. He rubs his shoulders and gets him relaxed before taking off his jeans. James is sporting a sexy jock strap which Dallas immediately pulls aside. His cock is already rock hard and wanting attention. Dallas expertly goes to work on his meat as he swirls his tongue all around his knob and takes his thick breeder meat all the way down his throat. James' cock is throbbing as he looks down and watches Dallas worship his baby maker. James slowly bucks his hips up into Dallas' mouth as Dallas gets comfortable hauling out his own meat as he suckles away at James'. Dallas is lost in the moment as he rubs James' spit shined cock all over his face as he laps up and down along the length of it. Dallas' cock is aching for attention and it's about time it gets some. Dallas stands and lets James go to work on his meat. James sucks on Dallas' cock as Dallas fucks his face with a steady pace.Dallas fingers James' ass for a few seconds before sliding his cock inside. James' eyes are closed as he is slowly rocked forward and backward as Dallas pounds his ass. Dallas holds on to James' jock strap like a reign as he rides his sweet ass. James is usually the one riding his motorcycle every chance he gets but not today. Today James is giving it up as Dallas buries it deep. James isn't saying much to the contrary as he gets his smooth ass stretched wide. Dallas then lies back and has James sit on his aching cock. James begins to ride Dallas' meat and starts to jack his own cock which is now throbbing and at full mast. James is as lost on Dallas' knob as Dallas was sucking on him. James' is in heaven as he bounces his ?str8? hole up and down on Dallas dick. He grinds his ass deeper wanting every inch inside him as Dallas fucks up into him. James begins to rock back and forth burying all of Dallas inside getting Dallas even hornier for more ass. He puts James on his side and slams his cock back in him and as he fucks him deep they end up in a hot missionary position as James jacks his meat faster and faster. James can't hold back and explodes all over himself as Dallas fucks him deep. Dallas then pulls out and adds even more protein to the mix. ...what a mess!",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    },
    {
      "name": "James Kelly",
      "person_id": 28398
    }
  ],
  "release_date": "2009-10-02",
  "scene_id": 55170,
  "series": "Hard For The Money",
  "tags": [],
  "title": "Hard For The Money, Scene #02"
}