{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "From the moment you lay eyes on this tall white boy with bad boy ink all over his defined arms, you tend to wonder where he's from. He's definitely not from Miami. No, our sexy bad boy this week comes from a small town literally named Valley of Paradise. We can see where getting this 6'1 morsel naked and alone would be considered as ?paradise? in its own right. Phillip Heritage is from Valparaiso, Indiana, yes Indiana. He has been living here in South Florida for the past 4 years. It must be our brutal winters?or lack thereof?that has kept him living in the tropics. He left everything behind to come down here and live the exciting lifestyle we enjoy down here in South Florida, where the Latinas are a-plenty. 'Ladies love me' he says. His ink has come about from all his travels and on occasion he's woken up hung over with a new tattoo. He lost his cherry at the age of 15 and he's been fucking everything in sight ever since. He's attracted to thick girls, shorter with big tits and fat asses. He loves a curvy lady & his favorite thing for them to do to him would be to sit on his face. Oh my! He isn't shy and if he runs into a girl that's a freak he'll easily run a train on her with his buds. As adventurous as Phillip is, the one thing he's been curious to try is multiple female partners at the same time. With a look like Phillip's, we're sure that wouldn't be too hard to orchestrate.Phillip is overdue and in need of cleaning his pipes, so he doesn't waste any time before getting started. He immediately stands and begins to feel his defined abs and chest. The next minute, we hear the rip of his tee as he rips it right off of him. He drops his gym shorts next as he's left in a pair of boxers that hug his junk. His cock is beginning to fill out as he continues groping his lean, muscular frame. He rubs his growing meat through his boxers as he humps into the air. It won't be long before his cock's gonna need more room and sure enough he soon prepares for the unveiling. Before he shows us, he decides to give us a better view of his smooth ass. He kneels on the couch and leans forward as he peels down his boxers giving us our first glimpse of that hairless ass. Talk about boldly going where no man has gone before; where can we sign up for that mission. His ass is naturally hairless and as Phillip thrusts and gyrates his hips we get a spectacular view of his off-limits ass...for now. He then flips over as he pulls his boxers back up. Once he sits back, his rock hard cock slips out of the side of his boxers. His cock is aching for attention; but his boxers are only getting in the way.His boxer briefs drop faster than Sarah Palin's hopes for the White House as he begins to groan, stroking his rock hard cock. His smooth balls are pulled tight around the base of his dick and we need but look on Phillip's face to see just how good his dick is feeling right about now. He handles his meat with both hands as he strokes his swollen shaft and glistening knob. There isn't an angle on this stud that doesn't showcase his lean frame and smooth musculature. His head reels back as he continues to work on his meaty cock. His hips are gyrating up into his fist as his fists continue to pump that cock. Phillip looks right at the cam as he licks and sucks on his fingertips. WOOF. This str8 boy knows exactly what he's doing. Next, he gets back on his knees and spreads that sweet ass wide, jerking his cock underhanded as we get another eyeful of that manhole of his. Corn-fed boys do have their advantages, and watching this corn husker definitely makes you wanna shuck it?DEEP! It won't be long before Phillip's cock is ready, so he sits back and jacks his cock off faster. 'Are you ready?' he asks seconds before his cock swells thicker and erupts. He sends his thick cream all over his chest and hairless frame.",
  "models": [
    {
      "name": "Philip Heritage",
      "person_id": 28360
    }
  ],
  "release_date": "2009-09-18",
  "scene_id": 55174,
  "tags": [],
  "title": "The Other White Meat, Scene #02"
}