{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Thrice: ('thr&#299;ce) adverb 1.) three times; 2.) in a threefold manner or degree; 3.) two fat poles and one very lucky hole. Yes, Gentlemen, this week we have not one but three delicious jock boys for you as they explore their lust in surplus fashion. Whoever said ?less is more? had never been in one of these before. Two new faces join us this week. The first is Jimmie Slater who boasts having been with several men but by far his favorite is the black, muscle boy he's currently ?talking? to. Mmhmm. Next to Jimmie is Zane Jacobs. Zane admits he has a weakness for Latinos. He considers himself very sexual and jacks off daily regardless of how much he's getting. Well horny seems to be the common denominator between these boys and the third is no exception. Much to Zane's Latino longings the third spice compliments of the Caribbean is Cuban import Christian Castillo. Christian  is no stranger to multi-tas-err?fucking. He's volunteered to plow a couple of hot asses before; so naturally it was a no-brainer to get this lean, hung and uncut hottie in on the action. These boys all prefer to top; but today lucky Zane drew the short straw. It's now time for some ?tag-team tail toss?. ?Take it like a man, Baby!?Three are on deck?or is it dick??as they start to explore each other. They begin kissing and then undressing each other as they switch partners tasting the bevy that lies before each of them. Jimmie is the first to get a taste as he pulls out Zane's growing cock and goes down on it. Meanwhile, Christian, whose sporting a large pop tent in his boxers, is getting a better view of Jimmie's ass that is in the air. They reconvene on the couch as Jimmie now goes down on Christian's thick uncut cock and starts taking turns on them both. Jimmie can't decide which one he wants and fortunately there's plenty to go around. Jimmie & Zane both go to work on Christian's cock next as he gets his cock and balls serviced. It's an oral free for all as they take turns on each other in every imaginable position. Jimmie ends up back in the middle as Christian and Zane get on each side of that hungry mouth and take turns feeding him all the dick he can service. He greedily laps and sucks on their cocks and they are only too happy to oblige. Christian and Zane both take turns stuffing Jimmie's mouth full of cock. Jimmie doesn't mind since he knows someone else will soon be getting ?stuffed??and it won't be him.Christian's had enough and it's time to bury his meat as he slowly pushes his thick cock inside Zane's ass. ?Fuck!? Zane grunts as his ass gives way. Christian starts picking up the pace as he fucks that ass faster and deeper. As he does, Jimmie moves behind Christian and begins to lick and kiss him as he gets a better view of the ass pounding he's giving Zane. Jimmie then moves around Christian and starts sucking on Zane's cock as Christian keeps slamming his Cuban cock deep into Zane. Zane is getting his ass fucked deep as Jimmie nurses on his meat. Watching these three go at it is insanely hot as they work over each others cocks and asses. Jimmie is still sucking on Zane's cock as he continues to get his ass impaled by Christian who is fucking him harder and harder. It won't be long before he blows and they know it. Sure enough, Christian pulls out his thick cock and strokes off all over Jimmie's smooth chest and abs. Zane is next as he gets sent over the edge watching that hot Latin load fly all over his buddy. Zane grunts as he dumps his own impressive nut all over Jimmie. Jimmie, now coated by both loads is last but not least as he too busts his thick nut all over his own cock?what a mess.",
  "models": [
    {
      "name": "Zane Jacobs",
      "person_id": 28029
    },
    {
      "name": "Christian Castillo",
      "person_id": 28258
    },
    {
      "name": "Jimmie Slater",
      "person_id": 28401
    }
  ],
  "release_date": "2009-09-04",
  "scene_id": 55178,
  "tags": [],
  "title": "Bottom Of The Ninth, Scene #02"
}