{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Today we have a special treat with us. With us is M.J. Taylor. M.J. has been in the news lately as he and his soon to be husband, Jason Pitt took on Prop 8 and protested in one of the largest gay protests in Downtown Atlanta when Prop 8 didn't pass. ?If it's to be; it starts with me? he says and if you want it you need to fight for your rights. Beside, MJ is Giovanni Summers. Giovanni  is 20yo, originally from Boston, MA and first graced our brother site, ExtraBigDicks.com last December. Well, we thought it was about time he was on CJB and here he is. He's currently seeing someone and blushes when he admits he likes him very much and things are going well. When we ask him what about him he really likes he grins and admits he has a really big dick. Now you know how he ended up on ExtraBigDicks to begin with.  M.J. and his porn star boyfriend, Jason Pitt are both in the industry but have agreed to never work together on cam. They feel like some things should remain personal and private. Giovanni agrees in the sense that what they do when they go to work and have sex with other hot guys they barely know is nothing but lust. What they have at home with their respective partners is love and knowing how to keep those two separate is what keeps the home fires burning.They're making out before we start rolling as they begin to explore each other's smooth bodies. M.J. and Gio lose their tees and the shorts follow suit soon thereafter. They grope and kiss each other and it isn't long before M.J. has Giovanni on his back and is pulling out his boner for an even closer inspection. He goes down on Gio's cock as Gio just watches his sexy face bob up and down on his meat. Both of them are naturally lean and defined and their bodies ripple as they lay atop each other. Giovanni then returns the favor as M.J. lies back and gets his cock swallowed to the hilt. Giovanni wastes little time with formalities and gets to the meat of the matter as he swallows his meat down to the hilt again and again sending M.J. into orbit as he watches the master at work. This master has his own agenda and where he wants this blond boner buried so he gets on all four and offers up his smooth ass for the licking. M.J. dives into his ass, tongue first and eats him out which just makes Giovanni hornier for the dick he's about to receive. M.J. knows exactly what to do on that sweet ass and soon enough his cock will be the one exploring.From there these two maneuver into a hot 69 as they each continue sucking cock and working themselves into a frenzy. Giovanni can't wait any longer as he straddles M.J. and impales his sweet ass on M.J.'s cock. He rides him for a bit before M.J. wants more control and puts him on all four. He then starts to really give him dick as he fucks away at Giovanni's sweet hole. M.J. fucks him hard and fast as his smooth balls bounce off that insatiable ass. M.J. teases his ass, pulling his cock almost all the way out before slamming it back inside him. M.J. is fucking him deep and then pushes him down onto his belly so he can fuck him even deeper. Giovanni is grunting with every thrust he's taking; but he is loving every delicious inch he's taking. Next is missionary as M.J. flips him on his back before sliding back in that hole he has at his beckon call. M.J. starts to power fuck that ass and hits Giovanni in all the right places. M.J. is sent over the edge as he pulls out and pumps his thick nut all over Gio who follows suit, sending his own load sailing as it splatters all over his toned frame that's already glistening with the fruits of his ?labor?.",
  "models": [
    {
      "name": "Giovanni Summers",
      "person_id": 30672
    },
    {
      "name": "MJ Taylor",
      "person_id": 28405
    }
  ],
  "release_date": "2009-08-07",
  "scene_id": 55183,
  "series": "Summers Lovin",
  "tags": [],
  "title": "Summers Lovin, Scene #01"
}