{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "?Tall, Blond and Boned? is the apparent theme this week here at CircleJerkBoys. Dallas Reeves is back this week and he's brought along another tall friend. Dallas is 6'3 and originally from Ft. Worth, TX. His sexy friend's a west coast surfer boy and answers to the name Shane Erickson. Shane  is a San Diego native, born and raised and made his debut last month. Shane has quite the following and with a face and body like his it's easy to see why. He's usually a top in his films, as is Dallas; but today Shane is going to concede and give Texas an in-depth tour of his private beaches. It's not every guy that gets to go there with Shane; but Dallas is tall, nicely hung and has beautiful eyes. Shane is a sucker for guys with sexy eyes. So Dallas lucked out. Dallas appreciated nice eyes as well; but he's more of a 'nice dick' kinda guy. If the guy has a nice dick he's more interested in the possibilities. Shane laughs and admits, regardless of what he wants, he ends up with guys opposite what he looks for. Well, to say the least neither of these two studs are lacking in the sex department as Dallas admits they (porn star) jack off to each other. Hmmm.Making a beeline for that sexy neck, Dallas starts to kiss Shane as Shane's eyes roll back. They begin to undress each other as they get better acquainted. They roll around as the clothes start to come off revealing their chiseled frames. Shane stands Dallas up against the desk before undoing his pants and going to work on that rock hard cock that popped free of his briefs. Shane fucks his mouth with Dallas' dick as those low hangers dangle below. He spits on his own cock so he can get the party started down below. He works Dallas meat and low hangers without missing a spot. Dallas is next as he gets Shane to lie back giving him access to that thick dick. Shane moans softly as he watches his meat disappear into Dallas' mouth. ?Take that dick? he orders as he bobs Dallas on his meat. They switch into a 69 position and while Shane is suckin' Dallas, Dallas discovers Shane's smooth back door. He immediately shoves his tongue inside which again sends Shane into overdrive. After a few minutes of rimming, Dallas hears those words he longed for: ?I want you to fuck me SO bad? Damn?that worked out quite well! Shane is primed and ready as Dallas begins to shove his cock inside. Wincing in pain, Shane holds still as his sweet ass gives way. His body is cut up and his muscles writhe just beneath his skin as he starts to get fucked. Dallas begins to ride the swell as he fucks out hot surfer boy. Shane slowly gets the feel of it as he starts to buck back for more. Dallas starts fuckin him harder and once he's got him loosened up he sits back in a chair and has Shane sit on his dick. Shane sits on it and starts to ride like a champ. He bounces up and down and grinds that hot ass deep feeling all of it lodged up inside him. Dallas then puts our pretty boy on his back before getting that dick back into him. On his back with his legs in the air, our top boy has totally given into Dallas who is now ramming his 7?? boner deep. Shane's abs crunch as he looks down to watch Dallas pound him. It won't be long before Dallas dick sends Shane over the edge. Sure enough as Dallas picks up the pace and fucks him harder Shane loses it busting his load all over himself while Dallas continues to give it to him. Dallas then jacks his own thick load all over Shane's soaked wash board abs.",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    },
    {
      "name": "Shane Erickson",
      "person_id": 28318
    }
  ],
  "release_date": "2009-08-21",
  "scene_id": 55182,
  "series": "Filled To Capacity",
  "tags": [],
  "title": "Filled To Capacity, Scene #02"
}