{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Two new, young studs are on deck, so to speak, here at CircleJerkBoys this week. The first of the studly pair is Kevin Martin. Kevin is 19yo and originally from South Carolina. He now lives in Miami; though he's lived many places. Kevin grew up a Navy brat and loves to travel. Beside Kevin is 23yo Hayden Grey who is nodding his head side to side making sure we know that he's not a ?brat?. Mmhmm. Hayden is originally a Midwestern boy and the Windy City is still home. He can't complain about the weather here and admits Miami has been good to him. Hayden lost his cherry at 16 and Kevin lost his at the same age. Kevin's experience might've been a bit more exciting since he lost it to his best friend's girl. What a dawg! Hayden now is squarely into boy?all types. Kevin is into whatever's clever. Kevin is now dating a girl who is not typical of what he's used to. He's used to complicated girls; but the girl he's dating now is totally chill and no drama at all. Both are horny guys and have been known to jack their meats even if they are in public. Hayden jacked off in school and Kevin tops him again by revealing his hottest was jackin off on a Greyhound bus, during the day with an audience. Anyone have Swamp land for sale? ?cuz apparently someone's a sellin' some. Mmmhmm     Kevin isn't wasting any time, peeling off his tee and undoing his jeans. This Southern Boy means business as he helps strip Hayden down to his briefs. Kevin then lies back as Hayden begins to work his cock through his boxers. Kevin's cock is hard in seconds and Hayden goes to work on it in no time. He works Kevin's knob as Kevin looks down and watches as the Chicago native swallows his shaft completely. Kevin's head rolls back in ecstasy as Hayden slurps and milks his meat. Hayden is out to prove to Kevin that guys really do give better head. Kevin isn't about to pass up the chance to get his knob shined so he's playin' along as best he can. He stands so Hayden can get better access to his dick and his balls are soon slapping Hayden's chin as he fucks his face. Kevin moans softly obviously enjoying the oral service he's getting. Kevin then sits back in the chair as Hayden kneels before him for more. Kevin then grabs Hayden's head as he begins to bob his head like a basket ball up and down on his rock hard cock. Hayden isn't missing a beat as he continues to work that thick dick with his mouth and fist. Both of these boys are gonna need a lot more of what they're getting?and soon!They then go back to making out a bit before Hayden straddles Kevin's rock hard cock. Kevin means business and he literally begins to bounce Hayden up and down on his cock as he holds him by the waist. Kevin's balls meet Hayden's ass with every thrust as Hayden just moans and grimaces accommodating the cock he's being given. Kevin then bends Hayden over the couch as he slams his cock back in. He holds him by the waist and taps that ass doggie style as he watches his lubed pole glide in and out of Hayden's cock-milking ass. Kevin bites his lower lip as he gasps his approval of the hole he's taking. He is relentless as he slams into Hayden's ass. His abs contract with every thrust and the sight of his lean chiseled frame as he fucks Hayden is incredibly erotic. Hayden can't take much more before exploding himself so they reconvene on the couch. Side by side they start jacking their cocks off faster and faster. Kevin is the first to explode as his cock erupts, sending its milky cargo cascading down his shaft and balls. His torso contracts with every wave as his cock sends up the goods. Hayden watches intently trying to catch his breath after having his own load fucked out of him before he wanted to. Those breeder tops while make you nut early every time. lol",
  "models": [
    {
      "name": "Kevin Martin",
      "person_id": 28344
    },
    {
      "name": "Hayden Grey",
      "person_id": 28345
    }
  ],
  "release_date": "2009-07-17",
  "scene_id": 55189,
  "series": "Oral Examination",
  "tags": [],
  "title": "Oral Examination, Scene #01"
}