{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have a free for all in the studio. The Hialeah Hotties are back and this time we have Mat?o Grande, Johnny Vino and Marcus Guitaro. For those of you unfamiliar with the 'Hialeah Hotties', they all, and by all we mean we lost count, went to high school together and have recently graduated. Hide your poodles and your daughters; cuz soon these man whores will be taking their gang bang tactics to college. If that's not a set up for a 'Boys gone-WHAT!?' feature length movie, we don't know what is! Infamous for their tall tales, Marcus  starts telling us about his latest 'adventure'. He was up in Gainesville and loving all the white girls up there. He ended up at a club, where oddly enough 'Girls gone Wild' was at and they ended up grabbin' asses all night and his friend ended up fingering some of the entertainment-SECURITY! Johnny's  story is a little different. By different, we mean plausible. (look it up) He recently went to a club with a bud and picked up some chicks. He got the back seat and started the party early with a blowjob and then that turned into a foursome when they did make it to his crib. Mat?o, who prides himself on fucking 'whores', went to the Keys to chill with friends. While out boating, he came upon some girls on a raft. He splashed around with them then cock slapped them and gave them each a lap dance. Some girls have all the luck.Left to their own devices, these studs take spray paint to the lockers as they begin taggin' up. Taggin' turns into 2 on 1 as Marcus and Johnny cover Mat?o in silly string. After that the boys are left excited and in need of something to wind them down. They clean off and as they do their clothes come off. They pop in porn and as they watch, they continue to strip until they are left in shorts then boxers. They each begin stroking their meat through the cotton containing them and each is popping a tent in no time. The boxers can only contain these 19yo boners for so long as each one of their baby makers finds its way out either through the fly or pulled out by the side. The camera gives us a view from below as these trouble makers tug on their 'disco sticks'. We're sure these sticks have made more than one lady gag(-gah)  That's for damn sure! Johnny even made one chick walk home when she wouldn't suck his dick in the back seat. His Parents would be so proud.  They lose their boxers and they each get comfortable as they continue stroking their swollen cocks. Mat?o is in the middle of the room stroking the biggest meat on campus today.Mat?o has the biggest dick but when we asked, the other two weren't that forthcoming with the fuckable facts. Mat?o smugly grins and says 'Check out the site for the stats after the video and you'll see it'. Mat?o just strokes his thick dick alongside and says his dick will be bigger in any unit of measurement Marcus wants to use. We wouldn't instigate Mat?o. Mat?o has perfected the art of busting his nut incredibly far and it wouldn't be the first time he's soaked a costar with his baby batter. All these studs are boned and rock hard as they slowly stroke their delicious dicks. They get on their knees and once they do, Marcus keeps insisting his dick is bigger. Big dick = bigger ego. Mat?o Grande is 'Grande' for a reason and no matter how Marcus insists he knows he's the one packin'. Johnny is quietly stroking his cock and isn't even going to get into the 'biggest dick' race. Once they turn around to show us the rest, Johnny definitely has the best ass! The bigger is better madness culminates as they each shoot their breeder spooge all over a plate. Johnny unloads first coating the plate with his hefty batch. 'Last one to nut licks the plate!' he grins as the other two pick up the pace. Mateo covers the plate with his own huge load most of which flies past the intended target. Marcus shot last droppin' his nut on the cum covered plate. Fortunately for Marcus, he has dibs on that fresh protein shake!",
  "models": [
    {
      "name": "Marcus Guitarro",
      "person_id": 28288
    },
    {
      "name": "Mateo Grande",
      "person_id": 28289
    },
    {
      "name": "Johnny Vino",
      "person_id": 28330
    }
  ],
  "release_date": "2009-07-31",
  "scene_id": 55185,
  "tags": [],
  "title": "Tag, You're IT!"
}