{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Today we have a brand new debut on our site from the West coast. He goes by the name of Noah River and he's originally from Los Angeles. He is quite the handful and even though he's enjoying Florida he's not a fan of the weather. It's too hot for the West coast lad. He's single and admits he's incredibly sexual and had his first sexual experience at the age of 18. It was with a girl and he wanted it to be ?special?. He ended up trying guys a couple years later and now is into both. Looking at Noah, we're sure he has no problem getting either or to play along. One flash of that Colgate smile and a twinkle in those light eyes, we're sure many would immediately ?stand? at attention. His partner in crime, who also lost his cherry to a girl, is originally from Texas and goes by the name of Dallas Reeves. Dallas has been living in South Florida now and after 6 years considers himself a ?native?. Dallas doesn't mind the climate at all and really likes the people down here. Dallas is also very sexual and got his groove on at a much earlier age. He was about 12 when he was seduced by an older girl. Even though these two boys lost it to girls early on, they both found their way to the meat market all on their own. Noah leans in for a kiss as they begin to make out. They slowly explore each other's bodies as their hands begin to roam. They end up in their boxers, dry humping like horny teens as Dallas thrusts into Noah whose legs are now wrapped around him. Noah moans as Dallas kisses his lips and neck. Dallas can't take it any longer and slides Noah's boxers off. He immediately goes down on Noah's cock and swallows it to the hilt. Noah groan with delight as Dallas works his entire shaft down his throat. Dallas goes from his shaft to explore his smooth balls and then figures he should continue further south until his tongue finds his moist hole. Noah is writhing as Dallas darts his tongue inside his smooth hole. Soon Noah wants some dick and it's Dallas' turn to sit back while Noah goes to work on his meat. After all, Dallas is from Texas and there's plenty of beef to go around. Noah bobs his head up and down on Dallas' cock as Dallas holds his head steady and bucks his dick up to meet Noah's sweet lips. The oral is getting them even hotter as Noah lays atop Dallas and can feel his hard cock resting on his smooth ass.Dallas puts Noah on his back and begins to slide his thick cock inside him. He takes his time as Noah's sweet ass begins to concede. Noah's a moaner and he's got reason to be as Dallas begins to fuck his ass. They kiss as Dallas gets his groove and starts to really fuck Noah. Dallas starts off missionary but soon lies beside Noah before lifting one of his legs up to get access to more of that ass. He slides back in and continues to send dick Noah's way. He buries his meat deep and looks up over at Noah so he can gauge by the looks on our young stud's face to make sure he's having as good a time. He definitely is because Noah has yet to stop moaning or groaning. Next Dallas lies on his back and watches as Noah straddles his dick for more. Noah sits down on it and proceeds to ride his cock. He's totally into it and is grinding his hot ass deep onto Dallas' cock. Dallas just watches as the West coast hottie uses his thick dick like a pogo stick. Fortunately for Dallas, this is one pogo stick Noah will not be falling off of anytime soon! lol Noah rides his cock harder and faster and in no time he's bellowing that he's gonna cum. Noah orgasms sending shivers down his spine with a small display of fireworks. Dallas then puts Noah back on his back and shows him how it's done as he coats his hairy navel with load after thick load.",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    },
    {
      "name": "Noah River",
      "person_id": 28406
    }
  ],
  "release_date": "2009-07-24",
  "scene_id": 55188,
  "tags": [],
  "title": "Two Bi Two, Scene #02"
}