{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Two new studs this week here on CJB. The first is 23yo Shane Erickson, originally from California, that has the A&F looks that would make most do a double take. He currently lives in the Midwest but travels all over the place. He has an evil grin that can only mean one thing??trouble?! When asked if he has a girlfriend or boyfriend he grins and says he isn't one to kiss and tell. He does admit he lost his cherry at 15 in the back of a car. He has his fair share of girls on his dick but now prefers men exclusively. His costar today is 22yo Alex Matthews. Alex is originally from Moscow, Russia. If you think Shane was a horny lad fooling around in cars at 15; Alex has him beat. Alex' first experience was at the age of 11 in his parent's basement with his babysitter's son. Well I guess a dick up your ass is better than any game boy and ?ouiiii? was only an expression back then. Once he got some, he never stopped; so he's had his fair share of dick. He's had it any way he can think of, mile-high club, while outside a plane and the fantasy he's working on now is getting fucked while in a moving car and no he doesn't want it in the back or passenger seats either. Shane, who's a power top, fantasizes about being in a mass orgy in a public place with a lot of people watchin' him do his thing. HOT and kinky...we like!Chemistry isn't going to be a problem in this shoot as the taller than average duo begin to make themselves comfortable. They slowly kiss as they begin to undress each other. They are both tall, and naturally defined. Shane is 6'3 and Alex even taller. These boys have no problem standing out in a crowd and for all the right reasons. By the time Alex undoes Shane's pants, Shane's 8? cock is tenting his sexy briefs. He lowers them to get at Shane's thick dick. He slowly begins to suck on Shane's cock as it throbs at his command. Shane then strips Alex and goes to work on his meat pole as he expertly bobs up and down on his shaft. Alex has several tattoos and piercings on his smooth, defined frame that give him an edgier look. They both take turns servicing each other as both of these blond titans give and receive as they work themselves into an even hornier state of being. They are slow and passionate and not in a hurry to rush through any of it as they lick, suck and suckle every inch of them that is exposed and accessible. Shane can't seem to get enough of Alex' meat; and sooner than later it'll be Alex who won't be able to get enough of Shane's cock.?If I don't fuck you soon, I think I might go crazy?, Shane coos as Alex playfully gets up to make that happen. Shane spreads his legs wide and sits back as Alex takes his place and slowly impales himself on Shane's thick dick. In seconds, he's sitting atop the Shane throne as he begins to ride his meat. Shane groans as he holds Alex by the waist and watches that hot ass bouncing up and down on his meat. He then has Alex turn around so he can see his face and once in position, he begins to bounce Alex up and down on his California cock. ?Your ass feels so fucking good on my dick!? Shane proclaims as he fucks Alex even harder. Shane then gets up and bends over the Russian boy fucking him doggie style. The look on Alex' face speaks volumes as Shane continues to 'mount' his anal assault. Missionary is next on the floor then followed by missionary with Alex on the bench & Shane on his knees. This position has that sweet ass at just the right height for a proper fucking. Shane pistons his cock deep over and over and it isn't long before Shane fucks the cum out of Alex. Just when you thought it couldn't get any hotter, Shane pulls out, stands up and jacks a huge load all over his 6'4 target. Shane's cock explodes repeatedly coating Alex' face and chest. DAMN!",
  "models": [
    {
      "name": "Shane Erickson",
      "person_id": 28318
    },
    {
      "name": "Alex Matthews",
      "person_id": 28319
    }
  ],
  "release_date": "2009-07-02",
  "scene_id": 55193,
  "series": "Copper Popper",
  "tags": [],
  "title": "Copper Popper, Scene #01"
}