{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We welcome back two of our recent finds to see what kind of trouble they can get into together. The first is a 25yo stud from just outside Ft. Worth, Texas that goes by the name of Dallas Reeves. Dallas  was last here to kick off the month of May with studly Ryan Raz. He got to the bottom of that frat boy in a lubed jiffy. May was good to us, bringing us another Florida boy by the name of Ty Tucker. Ty  is originally from Orlando, FL. Both of these studs call Florida home and it's no wonder why the boys all flock to Florida for the boys and the excitement. Since we last saw Dallas he was nominated and won an AVN award for the best group scene. Ty isn't as experienced as Dallas. See, Ty had his first male encounter a mere 6 months ago while hanging out at a bar with friends. He blames it on the party. Mmhmm. He met a guy he was oddly attracted to, they went to his car and he got blown and returned the favor-and here he is! Ty was last here with sexy Rocky who gave Ty some backyard stimulation during their hot oral scene that gave Ty a twinkle in his eye. Today we're gonna have Dallas give him more than a twinkle as he returns to further explore Ty's insanely hot ass. ...you'll see!Dallas pulls Ty's shirt off and as soon as his smooth naturally defined chest comes into view he goes to work, licking his nips and chest while undoing Ty's pants with the other. TY helps him out by stripping his pants off and as soon as they come off, Dallas goes down on his cock. Dallas is in 'overwhelm' unable to find a starting point. It all looks so damn good. Within seconds he flips Ty onto all four to get a better look at his beefy ass. Ty's ass is now open and ready for business-so is Dallas. He wastes no time before burying his thick tongue between Ty's smooth cheeks. His bubble butt gets lapped by Dallas who gets his hole nice and wet so that his fingers can go even further. He strokes Ty's cock with one hand while he fingers his tight ass with first one then two fingers. 'God I want that fat cock so bad' moans our recent convert. Hmmm. This boy's a quick study and we're not complaining. Dallas is finger fucking Ty and it's making him horny as hell. Dallas then peels off his own tee and undoes his fly to give Ty some dick to work. Ty goes for it immediately swallowing every inch of Dallas. Dallas teases him, slapping his cock on Ty's pierced tongue knowing he wants it back in his hungry mouth. 'You like that?' Ty moans looking up at Dallas for approval before shoving that cock right back down his throat.Dallas then lays Ty back on the bed so he can have at that cock some more and boy does he. He sucks and deep throats Ty's thick cock til it's throbbing and wanting to explode. 'Awww, suck my dick!' Ty grunts, as Dallas readily complies. Ty then gets up to go down on Dallas; but Dallas' fingers find his hole before he does. Change of plans for Ty who immediately knows it's not Dallas fingers he wants in there. He straddles his cock and slowly impales himself onto Dallas' thick meat. Dallas shoves inside and slowly begins to fuck his smooth ass. 'Fuck that ass is so tight around your thick cock' Ty moans as Dallas picks up the pace. Ty is a moaning and groaning machine as he gives his sweet bubble butt up to Dallas who is now bouncing him on his dick. Dallas then puts Ty on all four and slides his cock back in him, fucking him doggy-style bent over the edge of the bed. He can now watch his dick as it glides in and out of Ty's tight asshole. He starts to fuck Ty faster and harder. Ty is loving the fucking he's getting and he never stops begging for more. 'Do me missionary next' he moans and Dallas is more than willing to comply. Str8 boys always wanna get fucked the same way they pound their girlfriends back home. We guess, secretly, he's been wondering ...what it feels like for a girl. Ty is getting fucked like a bitch and the harder he gets fucked the harder he wants it making Dallas cum as he pulls out and unloads all over Ty's abs and chest. DAMN!",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    },
    {
      "name": "Ty Tucker",
      "person_id": 28325
    }
  ],
  "release_date": "2009-06-11",
  "scene_id": 55199,
  "series": "Rear Window",
  "tags": [],
  "title": "Rear Window"
}