{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have twice the meat packin madness this week as we bring a couple of recent discoveries to CirclejerkBoys this week. We say discoveries because we discovered them on our brother site ExtraBigDicks.com. (Attention all Size Queens...) The first of the two is 23yo Austin Grant. Austin  is a hung Tennessee native. He says all the boys from Tennessee have big dicks and big charm. This Southern boy is nothing but trouble. The other half of our gifted set is Panama City, FL's own, Dustin Michaels. Dustin  is ?half man half horse? so his shirt says. He packs a thick 8? cock that has a reputation which readily precedes it. Dustin was a jock in school and never experimented with other men but Austin always wanted to put popsicles in his mouth. Oh Snap! Hid momma ruined him early on. Austin sits smugly next to Dustin and isn't remotely fazed by his tee or what it reads. See, Southern boys always pack a surprise. In Austin's case it's a billy-club that measures in at over 8?? and drives the local boys crazy. Austin confesses having a big dick always puts him on 'top'?whether he wants to or not. Well, Austin, today's your lucky day because Dustin will be exploring the ?deep? South.They both begin groping each other's cocks through their jeans before finally leaning in to kiss each other. Their hands fumble for the other's belts as they explore further. The tees as next as their smooth chests come into view. Austin's cock is the first to spring free and Dustin immediately tends to it. He readily swallows it whole as he strips his jeans off. Austin closes his eyes in ecstasy as Dustin continues to work his growing meat. In no time Dustin has a thick 8.5' country cock going down his throat. Austin kindly returns the favor as he too goes to work on Dustin's growing meat. Both of these studs are defined and naturally smooth all over. Austin jacks his meat slowly as he continues working Dustin's dick which by now is awake and at attention. Dustin can't help but moan his appreciation as he holds Austin's head, slowly bouncing it on his thick meat. Dustin then gets back on Austin's as he kneels between Austin's legs and sucks his cock to the hilt. Austin moans and groans as he looks south and watches this thick stud work his cock then move south to explore his sweet hole with his talented tongue. Dustin's tongue is soon replaced with a finger or two and that's just a bit of foreshadowing. You know the fingers merely a warm up for his '21st digit'. Dustin works Austin's smooth ass with a few fingers til he's easily finger fuckin his sweet ass. After he has that ass ready and begging for more he gives it what it wants?dick! 'Aww fuck' Austin groans as Dustin begins slamming his thick dick deep inside him. Dustin is fucking him so hard he seems to have forgotten every other word in his vocabulary except 'Aww' and 'fuck'. Hmmm. Dustin is relentless and once inside Austin's sweet ass he doesn't let up. His thick dick repeatedly pounds away at his bubble butt. He slaps Austin's ass and continues fucking Austin on his side. He steadies himself by holding onto Austin's waist as he impales him back onto his dick for more of that sweet ass. Austin then wants to ride his dick and Dustin obliges as he sits back and watches Austin ride him reverse cow girl. Austin is riding Dustin hard and we see Dustin's balls bouncing and slapping at Austin's as he grinds his hot ass all the way down to the base of Dustin's thick dick. Riding Dustin's cock hits his prostate just right and soon Austin is unloading his load as he keeps bouncing on Dustin's throbbing dick. Once he unloads, Dustin jacks his cock off all over Austin's glistening abs and chest. ?whew.",
  "models": [
    {
      "name": "Dustin Michaels",
      "person_id": 28322
    },
    {
      "name": "Austin Grant",
      "person_id": 28323
    }
  ],
  "release_date": "2009-06-19",
  "scene_id": 55198,
  "tags": [],
  "title": "Blow N Go, Scene #02"
}