{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We couldn't get enough of the sexy boy from Tampa last month so we had him come back to give us enough Hunter Vance to go 'round. For those of you unfamiliar with this thick sex pot, Hunter  is 25, a native Floridian and an equal opportunity fucker. ?Any moist hole? are the words he lives by and with that defined body and boyish smile we're sure he gets plenty of 'takers'?literally. He is single, upbeat with a roar of a laugh that's just infectious. All these just add to his charm. The second half of this scenario is 33yo Alexander Garrett. Alexander  made his debut on MenOver30 recently and he was well received. Hunter had his first sexual experience at 14 and Alex a bit older at 18. He is 100% gay and blushes when he admits he loves to bottom mostly. Hunter was watching soft porn on HBO and experimenting with anything he could find in the fridge behind his mother's back. By the way, he cautions to stay away from carrots (kinda cold) and if you're gonna use a banana ?make it a green one. (...pause for a visual...) It's always the ones with the innocent faces that hide the darkest (and the most interesting) secrets. This should be a hot time with the late bloomer and the Randy Refrigerator Ranger! Hi Ho Silver?that was so gay!Hangin out in their dorm room these two get restless and one thing leads to the other. They begin kissing and as they do their hands begin to explore. They slowly start to strip each other and it isn't long before these two jocks are in their birthday suits. Alexander lowers his thick meat into Hunter's mouth who's more than willingly begins to nurse on it. He then flips around and gets on his knees to better swallow every inch of his uncut cock. He jerks Alexander's cock while working the end with his mouth and it's driving Alexander crazy. Both of these jocks are dedicated to their bodies and the lean definition they've acquired shows it. Hunter loves Alex's cock and takes his time working it over with his mouth and tongue. He licks and laps at it while working his balls as well. Alex doesn't mind the attention one bit. Then it's Alexander's turn as he gets on his knees and starts to suck on Hunter's growing meat. His hands reach up to explore Hunter's chiseled frame as he works and sucks on his meat. Hunter's eyes roll back as Alexander works his magic on his throbbing meat.The next thing we see is Hunter on all four, grunting as Alexander fucks his sweet ass deep. He's holding Hunter by the waist as he repeatedly rams his cock in to the hilt. 'Ohh fuck!' Hunter grunts as Alexander takes his ass hard. After Alexander pounds at his ass doggy style, Hunter wants to sit on it. He sits back onto Alexander's meat as he begins to bounce his thick beefy ass up and down on Alexander's Columbian cock. Alexander loves it as he gets his cock buried repeatedly inside Hunter's tight hole. Hunter spreads Alexander's legs apart and hold them up almost as if he's gonna get fucked and by doing so it shoves Alexander's cock deeper into him in this new position. Hunter knows exactly what he's doing and he's playing Alex' cock like a fine tuned (sexual) instrument. DAMN! Someone's been studying their Kama-Sutra positions. Nice work, Grasshopper. Alexander then puts Hunter on his stomach and slams his cock back into him as he takes his ass hard. Hunter grunts and groans in a mix of pleasure and pain which only makes Alexander want to pound him harder. After he power fucks him some more they're both ready to explode and they sit back, side by side, to blow their wads all over themselves. (No vegetables were harmed during the filming of this episode)",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Hunter Vance",
      "person_id": 28320
    }
  ],
  "release_date": "2009-06-27",
  "scene_id": 55195,
  "tags": [],
  "title": "Overdue For Entry, Scene #01"
}