{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Breathe in; exhale; breathe in again; now slowly exhale. Now that we've had a chance to drink him all in, we can better appreciate the morsel that has shown up on our doorstep this afternoon. Originally from Cuba, 21yo Alain Lamas gives us a ?not-so-little? reminder of just how lucky we are to have the Caribbean just across the Florida straights. We do so love our ?straights?, huh? He's currently taken and he's been with his girlfriend for almost a year. He's been working out for like 6 years and the last two he's been hitting the gym 5 or 6 times a week. He loves to work out and it gets him horny as hell. He even pumps out a load in the gym showers when he needs to. We're not telling you which gym either. He is proud of his discipline and when we asked he admits his favorite part of his body would have to be his legs. His quads are massive and measure in at a staggering 27'. (Your tongue could get tired just thinkin' bout it). On a female, Alain admits he loves a nice ass. That's not a surprise; after all he is Cuban. Caribbean men love a girl with curves. He is adventurous and isn't shy when it comes to getting his nut. He got busted fucking two chicks with a bud in a public Jacuzzi and even his Dad has caught him floggin' that uncut Cuban 'palo' (log). You gotta love that.Alain begins flexing his muscles while he tells us how hot he is. He's referring to the temperature in the room?or is he? He kisses his guns as he continues feeling up his massive frame. He pulls off his polo and we get our first glimpse of his anatomy. His chest is chiseled perfection and they are flanked by broad shoulders and huge guns. His traps are impressive and his torso vees into his small waist. He licks his biceps as he tells you how hot it would be to have you doing that for him. He winks as he slowly licks his lips. For a str8 boy this fucker sure knows how to drive a boy wild. He pushes his pants down over his massive thighs as he comments on how big they are. 'I love showin' them off' he teases. His sweet dimpled face, bedroom brown eyes and that rock hard body come together beautifully and make him one hard stud to refuse. His abs are rock solid and as he starts to tug at his bikini briefs we get a glimpse at his sexy bush. He leaves us wanting more as he stops short and lifts his arms over his head. His pits look edible as he shows off his lats and biceps. He then goes back to pulling his briefs off and as he does he turns to give us a better view of his spectacular ass. *Remember to breathe as needed. Go ahead.Alain slaps his muscular ass while he's on all four, slowly air humping away as we get to imagine what it looks like while he bones his girl. He looks back at the cam over his shoulder as he bites his lower lip. Once he's ready, Alain flips over and begins to play with his cock. 'Wish you were here playin' with it' he teases, licking his lips as he pinches his nips and strokes his growing 'ping?n' (Cuban for rather large cock) He spreads his legs as he jerks his cock and begins to tease his hairy hole with one finger. This should be filmed in scratch-n-sniff. Oops. We Digress, he then gets on all our and as his head is in the pillow he looks directly at the cam and sucks on his middle finger like it's a cock and then sends it into anal combat as he fingers his beefy ass which is now spread wide and screaming things we can't print. Just when you think you can't take any more, he switches it up and sits back in the chair and spreads his beefy thighs apart as he strokes his uncut cock. It's equally as impressive and thick from base to glistening head. He bites his lower lip as he pinches both of his pepperoni-sized nipples. 'Pinch 'em hard!', he orders, 'that makes me so horny.' His hands move back down to his fat cock and sweet ass as he again resumes stroking with one hand while fingering with the other. His legs are in the air as he whimpers. 'Yeah keep playing with that little hole', he coos, 'you're gonna make me cum.' O-M-G. He then lays back and jacks his dick off while working his nips, busting his thick cream all over his washboard abs. 'Que rico'",
  "models": [
    {
      "name": "Alain Lamas",
      "person_id": 28346
    }
  ],
  "release_date": "2009-07-10",
  "scene_id": 55192,
  "series": "Man, Muscle, Milk",
  "tags": [],
  "title": "Man, Muscle, Milk, Scene #02"
}