{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we have our favorite Virginian back to show us more of his sexy inked self. The signature locks are gone, but the classic country grin remains on Virginia Beach's own, Rocky Charles. Rocky was first here over the summer, making his debut with a sexy goatee and shoulder-length honey colored hair. This squarely bi-sexual 22 year-old is engaged and admits he's equally drawn to both sexes; though when we met him he hadn't quite explored as much as he has now. He topped for the first time on cam for us with one very lucky Tucker Forrest; opening the door for so much more. Rocky is back to help us welcome yet another Tucker. Ty Tucker is 20 and originally from Orlando, FL. He claims to be 'the last 20 year-old virgin in Orlando' but we're pretty sure had we been filming Pinocchio, his nose would've immediately taken out the camera crew! Both of these studs are huge jackers and admit they jack off 3 to 4 times a day. Ty boasts his record is 5 in one day. Rocky busts out laughing and comes back with, ?I could beat that at 13?any day!? Oh-no-he-di?unt. Regardless, these two horn dogs get it where they can. Ty's hottest romp was on the hood of some girl's car while she ride him. Rocky grins, confessing he only did cars when he needed a place to bang other guys' girlfriends. Trouble with a capital ?R? this one. Let's get these two jackin...and then some. The sounds of lip smacking are all we hear as the camera pans down to find these two who apparently started without us. They kiss slowly as they eventually start to undress each other. Ty's hands are fumbling at Rocky's cock as Rocky's pulling off his shirt and licking every inch of skin he exposes. He eventually pushes Ty back and gets to work on undoing his pants. Rocky may be bi, but he has a thing for oral when it comes to guys. Within minutes, Ty's flaccid cock comes into view, and it's gone in seconds as Rocky engulfs it in his hungry mouth. Ty's mouth gapes open, moaning at the sensation as Rocky works his magic on his growing dick. Ty's frame is smooth and defines, his sexy pits are on display as he lays back, hands behind his head and gets his thick cock spit-shined. His cock is ?Rock-y? hard (cheesy pun intended) in no time and Rocky is giving it the attention it needs as he slurps and gags on his meat. They go back to making out again as their tongue piercings dance a sloppy tango. Rocky's oral exploratory isn't done yet as he slides down and lifts Ty's legs in the air. TY groans and jacks his meat as Rocky eats his sweet ass out; his tongue piercing adding extra sensation on his pink bud. Rocky then offers Ty his cock which he readily works over as Rocky's dick stands at attention. Rocky, being the consummate giver, decides he wants more of that ass and lays Ty back, sucking his cock some more before burying his tongue, and a digit or two, back up that sweet ass. Ty may have grown up next to the Magic Kingdom, but he had to come to the ?Magic City? to get a Royal Rimming?Miami style. They then maneuver into a hot ?69? position with Rocky on top bunk, going right back to work on Ty's meaty shaft. Rocky is working Ty into a frenzy. Ty is lying on his back with Rocky's cock buried in his throat. He sucks Rocky as best he can 'under' the circumstances. Just when you think it can't get any better these two trade places. Ty, now on top, has much better access to Rocky's rock hard cock swirling his mouth all over Rocky's country cock taking it all the way down his throat. These two won't last much longer at this rate and in no time they erupt. Ty's the first to blow, moaning as he pumps out volley after volley of thick nut all over his smooth navel. A look of rapture comes over his angelic face as he enters a state of bliss. Seconds into his afterglow, Rocky grunts and moves his dick over Ty. ?Oh yeah, cum all over my fuckin' chest!? Ty begs, jacking his cum covered cock. Rocky obliges and blows his thick load all over his chest; coating an already milk-laden canvas. Whe?Wait for it?there's MORE?Ty grunts as he pumps out yet another load, seconds after his first. DAMN! Watching a flick of Rocky pumping his own girlfriend really did the trick (no pun intended).",
  "models": [
    {
      "name": "Rocky Charles",
      "person_id": 27956
    },
    {
      "name": "Ty Tucker",
      "person_id": 28325
    }
  ],
  "release_date": "2009-05-15",
  "scene_id": 55207,
  "tags": [],
  "title": "Who Needs A Girlfriend, Scene #01"
}