{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "?RAZZLE DAZZLE!? That's what they all yelled after taking one look at our recent discovery from the Gulf coast, Ryan Raz. For those of you who aren't familiar with Ryan, he's a 25yo recent New Yorker who has an infatuation with the nerdy boys. ?They always have hidden talents to offer? he grins. This week he clues us in on his recent off-color fetish. Ryan has become a fan of the fist. (literally) ?It's like going to a new restaurant and trying something you normally wouldn't order and you end up realize you kinda liked it? he confesses. Hmmm. ?Ass??it's not just for dick anymore! With an ass like Ryan's, we're don't know many willing to pass up on that entr?e regardless of what he wanted put in it. Along this week is another Missouri stud, who unlike Ryan, has yet to leave St. Louis behind in search of faster lights or bigger cities. Even though Scottie hasn't a dark a dark side as Ryan's, he is just as appealing. Tall with dark features and a brilliant smile, Jimmie turns his fair share of heads even in his clothes. The thick 8? cock does the rest once he's out of them. Last here, Ryan  gave up his sweet ass to one very lucky Texan by the name of Dallas. Today, we're gonna have Ryan give Scottie a role reversal and have him actually bottom for a change. This is gonna be good. J Hangin' out in their dorm room, these two find a more creative way to kill time. They begin kissing and making out quickly follows as they then begin fumbling to remove each other's clothes. As their shirts and jeans come off we see their smooth, defined frames come in to view. Both have their briefs tenting as their hard cocks strain to be freed from their cotton-clad confines. Each is stroking the other's cock through their briefs until they can no longer resist the anticipation. The briefs come off and as they do, Ryan is the first to move in for a closer inspection. He takes Scottie's thick dick in his mouth and begins working it over between those sexy full lips. Scottie doesn't mind one bit as he watches Ryan sucking down his cock. Ryan then swings his cock in Scottie's direction as they both begin to suck each other's cocks. Ryan playfully slaps Scottie's cock on his tongue before swallowing back down til Scottie's balls are resting on his face. Ryan is all about the attention to (oral) detail and once he's attended to Scottie's cock he moves his oral talents further south as he goes to work on Scottie's smooth hole. He laps and sucks on his puckered prize, fingering it to get it ready for what's next on the menu...DICK! Ryan gets up on his knees behind Scottie and slaps his thick dick on Scotties ass and spit lubed hole. Scottie's moaning in anticipation even before Ryan's knob begins pushing its way inside. It doesn't take Ryan long before he's buried and pounding away at Scottie's smooth ass. Ryan's cock easily glides in and out of Scottie's hole as he fucks away at him, grabbing his waist and impaling Scottie onto his throbbing cock over and over again. Ryan then lies back and lets Scottie straddle his rock hard cock before slowly lowering his ass back on it. Scottie slowly begins to ride Ryan as Ryan just lies back and enjoys the tight ass on his meat. Ryan's eyebrows furl as his mouth gapes open in a look of rapture that tells us way more then he could even if he tried to. Ryan then gets Scottie up off his cock and puts him on his stomach to fuck him deeper and get his cock inside the way he wants it. In t his position we get a spectacular view of Ryan's hot ass as it rises and falls into Scottie's ass. Scottie is biting the pillow by now as Ryan continues his anal assault. Ryan is grunting and fucking Scottie deep as he pounds away getting closer to giving up his load. Ryan goes for it and fucks Scottie hard and it isn't long before he pulls his cock out and explodes all over Scottie's back. Scottie then flips over and busts his own thick, creamy batch all over himself...Yum.",
  "models": [
    {
      "name": "Ryan Raz",
      "person_id": 27995
    },
    {
      "name": "Scottie Brooks",
      "person_id": 28327
    }
  ],
  "release_date": "2009-06-05",
  "scene_id": 55201,
  "series": "Filling In The Hole",
  "tags": [],
  "title": "Filling In The Hole, Scene #01"
}