{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Back for more madness are a few members of the 'Hialeah posse'. Huey, Louis and Screwy revisited as we have two of the boys back; who have, yet again, brought us even more straight latin dick for us to drool over. It's just not  right! We ain't complaining but where were these 'lets all whip out our cocks for shits and giggles? kind of buddies back in the 80's and 90's? You just gotta love it, circle jerks and running trains on hoes has replaced hangin' out at the mall and cruising down Ocean Drive checkin' out half naked girls. The tallest of the three, 20yo Peter Soma a 5'6?, self professed 'nice guy' gets more  than his share of 'punany'. Back as well is Mr. Johnny Vino, 18 who loudly boasts he's ?the player? of the bunch. No arguments were raised?at all!  He's a direct kind of guy and just tells girls he wants to hit it and knows they want it too. Damn! He says it works every time. Judging from the grin on his face as he shares his secrets, it would be hard not to believe him. Finally, the newbie on the menu, 19yo David Danger brings up the rear and has his own uncut Cuban cane to offer anyone who will hold still long enough to take it. Davis is a bit more reserved; but don't let your guard down. Foul of a feather fuck together. Lock up your daughters, the ?Pint-sized Militia from Platoon Ping?n? has arrived.'Her tits were perky, and I was just ramming her...' is how this session begins as Peter starts off the circle jerk talkin' smack about some chick he dogged and came on in public while a few guys watched. The talk is workin' as all three begin to tent their boxers. They each begin to play pocket pool with their hands in their boxers. Each one eyeing the other to see what progress is being made, David id the first to take his uncut cock out as he lubes his dick up. We see his knob peekin' out on occasion from inside his thick foreskin. By now, Peter and Johnny are both out and hard as they stroke their cocks watching porn. Peter's uncut cock is raging and as he pulls on his meat, his foreskin easily slides back revealing his fleshy knob. Johnny is also stroking away. They then stand up, and form a circle as they continue jacking. Their boxers come off and as they show off their tight bubble butts, Johnny decides to show off his mad ass skills. He starts shaking his ass like a 'black bootie girl'! Oh Snap! ?it's on! Peter starts shaking his own money maker as David, sensing the impending 'Danger' (pun intended) takes the booty high road and gets an eyeful. That competition was over before it started and Peter, wanting to compensate for his defeat, swings around and waves his thick dick in the air. Its ?Monkey see; Monkey do? with these three as a fencing match breaks out. Their naturally smooth, defined bods would make many do a double take on any beach. Fortunately we now know what that looks like on a nude one.They then sit back down and continue to watch the flick as they continue swapping fuck stories amongst themselves. No matter where you look, there are raging Latin boners to go 'round. Watching the camaraderie between these guys and knowing theirs a certain level of familiarity that comes from running trains on girls together just heightens the scene to a whole new level. They each kneel on the chaise as they begin jerking their raging boners together. All about the same height, their defined pecs and abs line up deliciously well as they beat their str8 meat inches from each other. It's like that str8 boy buffet you've always dreamed about?Cuban style. Camera angles from below give us a better appreciation of their pussy poles. They are all rock hard and even David's 'pinga' with the mad foreskin is at full mast and inching closer to a huge finale. As they get closer they reconvene on the floor and circle their milk tents around a lone, unsuspecting cookie who apparently believes she lucked out with priority seating on the lido deck. Stupid, stupid girl! LOL 'Last one to nut?eats it!' They all jack their meat faster; not wanting to be the last man stroking. Peter's the first to explode, aiming as he unloads thick strands of white jizz, Johnny is a close second as he unloads a torrent of milky cum, dousing the plate and making even the lactose intolerant take notice. (Ok, that was sooo wrong) hehe David cums in third (literally) as he unloads his own batch of thick 'leche Cubana' all over the milky target. ...We hope David's hungry!  ?Buen Provecho, Se?orito!?",
  "models": [
    {
      "name": "Peter Soma",
      "person_id": 28329
    },
    {
      "name": "Johnny Vino",
      "person_id": 28330
    },
    {
      "name": "David Danger",
      "person_id": 28331
    }
  ],
  "release_date": "2009-05-22",
  "scene_id": 55206,
  "tags": [],
  "title": "Cookie & Milk, Scene #02"
}