{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have two native Floridians here to show us what's good. The first is Sexy Hunter Vance. Hunter is 25 and originally from Tampa. He's sexy with a smooth defined bod, amazing smile and a sexy voice to go with it. About 2 hours away, by way of Alligator Alley, we discovered 21yo Miami native, Richie Sabatini. Richie has a Cheshire Cat grin that speaks volumes to his character. He considers himself bi and says he like both equally. For a female, he doesn't like an overweight woman. ?She has to be petite, with a nice butt, some boobs. Guys have to be in shape with a tan', he goes on '...both of them have to have?(get this)?good morals? In the timeless words of Joey Lawrence: ?Whoa!? Hunter grinning ear to ear admits he could care less  about ?morals?; he just wants someone fun. ?Everybody's good in bed depending on how crazy you can get them.? Now, we're talkin'. Hunter is also an equal opportunity fuck and his motto reads ?Any Moist Hole?. Who IS this guy? lol Hunter's craziest sex was with a married couple. He fucked her while he fucked him then they fucked her at the same time?two poles, one hole, after which they both came in her ass. FUCK. Richie's craziest experience was going to a Christmas party with a friend who owns a bar he often dances at; met some guy and hooked up, leaving his friend stranded.  Maybe Richie heard ?When were you the biggest dick ever?? instead of ?What was your best dick ever?? ...It happens. They start kissing softly as they slowly break the ice. Hunter takes off his tee revealing his smooth defined chest and abs with ornate ink running along his lats disappearing into his jeans. He then undoes Richie's shirt and as it comes off we see Richie's own defined frame. He's naturally smooth and has a sexy happy trail that leads your eye straight to his bulging briefs. Hunter begins to lick and suck his chest and nips, exploring the Miami hottie's assets. Richie then helps Hunter out of his jeans before lying back on the couch and having Hunter free his growing meat. Hunter lies on his stomach as he gets comfortable sucking on Richie's thick dick. ?just like that? is all we hear between moans as Richie revels in the oral madness he's receiving. His low hangers dangle below as Hunter continues polishing his spit-lubed knob, slurping as he works his meat. Hunter then sits back, puts his arms behind his head, showcasing his massive arms and shoulders as he watches Richie take his turn on his bat. Richie slowly sucks on Hunter's cock. Hunter loves the head he's getting; but soon he's back on Richie's meat getting it rock hard again. Hunter needs a good dickin'?and he's about to get one. The sounds of Hunter moaning are all we hear as the camera pans to find Hunter on his knees, bent over the couch with Richie fucking his sweet ass. Richie's low hanging balls gently slapping Hunter's ass with every deep thrust he gives him. Hunter's groaning and grunting as Richie continues his anal assault. Hunter then gets on the floor and Richie puts him on his side before sliding one of his legs up before sliding his rock hard cock back in for more of that ass. Hunter is in heaven as Richie pounds his smooth hole. A view from behind showcases Richie's own hot ass as it rises and falls, burying dick deep as it does. Next up is missionary on the couch as Richie kneels in front of Hunter whose legs are spread ready for the next delivery of wickedly delicious 'Richie Rod'. Richie goes back to fucking his meaty ass again. This time Richie gyrates his dick in and out as he does hitting all sorts of new spots inside Hunter's hole. Fucking Hunter in this position does the trick for Richie who, in no time, is on his feet baptizing Hunter with his huge load of local seed. He splatters his thick load all over Hunters defined chest and abs which in turn sends Hunter over the edge. Hunter too explodes sending volley after volley of thick cream airborne. This was one hot fuck! Florida?it's not just for beaches anymore!",
  "models": [
    {
      "name": "Hunter Vance",
      "person_id": 28320
    },
    {
      "name": "Richie Sabatini",
      "person_id": 28328
    }
  ],
  "release_date": "2009-05-29",
  "scene_id": 55204,
  "series": "Good Will Hunter",
  "tags": [],
  "title": "Good Will Hunter, Scene #02"
}