{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "?Meet me in St. Louis? would've  been appropriate...had he stayed there; but this week's discovery left his hometown in the rear view mirror. An addiction to traveling keeps this tall heart throb, with the classic jock features, on the move. It's a good thing since his travels landed him here with us. At 25, Ryan Raz has seen his fair share of the world and left a fair share of broken hearts in his wake. When asked if he missed or left a ?significant other? behind in St. Louis, his face lights up, grinning ear to ear as he unapologetically proclaims ??I left nothing!? Judging by the look on his face, he's not going back anytime soon. A smooth, defined frame, full lips atop a subtle cleft chin, piercing blue-grey eyes and a personality that outshines the aforementioned, Ryan has quite the arsenal at his command. We're sure his charms came in handy while studying abroad in Barcelona. Falling in love with the people and the Mediterranean culture; he would move there in a heartbeat. His eyes are set on South America next. Places like Argentina and Venezuela where he hopes to conquer that language barrier holding him back. We're sure once he does, Spanish speaking dorky boys across the globe will rejoice. Ryan isn't into model types at all and prefers cute little dorky boys. ?They always tend to pack a surprise.? Speaking of packin' a 'surprise'?it's about time he unwrapped his. Alone in his dorm room, Ryan has some time to kill and he knows exactly what he wants to do. He loses his tee as it hits the floor. We get our first glimpse of his smooth chest and abs. He lies down on the bed and undoes his shorts to get better access at his growing dick. He tugs on his balls and cock through his lime green briefs. He bites his lower lip as his cock sends shivers throughout his delicious body. His briefs can't contain his thick dick as it snakes out the side. He pulls them off and once he lays back and spreads his legs we get an amazing view of his ?charms?. His thick dick is at attention, throbbing and dancing to every touch of his hand. He explores his balls and ass with his free hand and we get to watch his facial expression as his sexy lips part, gasping as his fingers slowly penetrates his sweet smooth ass. He loses himself to desire as he slowly fingers himself with one finger then another. His aching cock is throbbing just above his lubed bud and Ryan is sure to please them in tandem. Ryan then gets on his knees, falling forward, burying that lust-filled face in a pillow leaving his amazing ass in the air, spread wide and on display. He then begins to stroke that thick dick of his underhand. ...OMG! Ok, if you ever wondered where ?Assume the position? came from?THIS has got to be it! His dick is rock hard as he pushes it backwards, reaching around to stroke his knob. His smooth balls are draped on either side of his meaty shaft as he pulls it up and continues to jack off. His puckered hole winces as his cock continues to send sexual shivers all over his body. Ryan then stands up to give us a better view. His chest, abs and naturally defined body tapers into a small waist only to vee out again once your eyes meet his muscular thighs. Ryan is more than just the cute dorky boys' wet dream. This boy could make anyone bust an unexpected cap in their skivvies. Clean up, Aisle 7! A view from below s he continues to stroke his meat is as delicious as his lips pit and his eyebrows furl as his state of rapture intensifies. Ryan then gets right back into ?position? face first, reaching between his legs this time, as he gives his meat the proper jerking its been patiently aching for. His hand jerks and tugs at his knob and in this position he actually isn't jackin his dick, but ?milking? it?literally! His strokes working his knob in reverse, stroking away from his milk-laden nut sack instead of towards them (like most of us mere mortals do it). lol Whatever the technique, it's working. His rapid milking comes to a sudden lull, his body contracting and tight hole clenching, as stream after stream of thick cum begin to splatter onto the hardwood floor below. Whew ...Enough said.",
  "models": [
    {
      "name": "Ryan Raz",
      "person_id": 27995
    }
  ],
  "release_date": "2009-04-24",
  "scene_id": 55213,
  "series": "RAZ-zle Dazzle",
  "tags": [],
  "title": "RAZ-zle Dazzle, Scene #01"
}