{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have sexy Justin Taylor making his debut with us this week. This 21yo Philadelphia native with the boyish charms is quite the package. Lean, defined with a sexy body and a thick surprise where it counts, Justin makes his fair share of guys take a second look when he struts into a room. He's down in Miami often; but doesn't stay down here for very long. It seems the local drivers prove to be too aggressive for him. Yeah Miami isn't known for its courteous drivers. We'll leave it at that. Justin is drawn to Italian or Latin men. He loves their features, the hair and they have the best bubble butts. Well, Justin is in luck because we brought along a sexy playmate for by the name of AJay Vance. Hailing from Lawrenceville, GA, this sexy cinnamon hottie, also 21, now calls Miami home. He misses the hospitality back home and finds the people here 'different' and it took some getting used to. He's attracted to A&F looking guys with All-American looks and light eyes. Hmmm, we think we might've outdone ourselves yet again, Ma! Opposites do attract. They're both horn dogs and haven't had any trouble exploring any desires: Latin AJay in a Disney bathroom (...on a very Gay Day) and Justin on a San Francisco bound flight, fucking in the 'rear' galley with a Sky whore who was apparently 'something special in the air'. In their room each doing their thing the two hang out together and it isn't long before Justin notices AJAy flipping through a porn mag. He stands up and walks over not wanting to miss out on the opportunity to get some relief. He stands inches behind AJay's head as he rubs his crotch. The bait works and AJay immediately scrambles for his fly. Justin helps him undo his pants and hauls out his thick dick. AJay latches onto it and begins slurping on his growing dick. Justin moans softly as his dick, now rock hard, gets the attention it was hoping for. AJay gets on his knees and continues to lick and suck Justin's dick working his knob as he holds his low hanging balls. AJay is moaning with a mouthful of Philly dick and it's music to Justin's ears. They then maneuver into a sizzling 69 so that Justin can get his share of dick. Their heads bob up and down on the other as they get their fill of meat. The view from below proves to be too tempting for AJay who lets his tongue wander north 'til it meets Justin's sweet ass. Justin's eyes roll back as he gets his ass licked and sucked. AJay needs better access and he puts our top stud on his stomach and gives his ass a tongue fucking that has him moaning and groaning, biting his sexy lower lip as he does. Rimming can only lead to one thing and that's a good fucking. We see Justin's sweet face, eyebrows furled in rapture, laying flat on his back, as he moans and groans. His head is being pushed back and forth on the couch and it looks like he's getting one hell of a fucking. As the camera pans back, we see that everything isn't as it appears. Justin's actually getting his thick dick ridden by AJAy who is grinding his ass onto his dick so hard that it has Justin sliding back and forth underneath him. DAMN! Justin holds onto AJay's smooth ass as he begins to fuck up into it?burying it even deeper. He throws his arms up over his head as he watches AJay enjoying the ride; giving us a peak at his sexy pits. From there, Justin bends AJay over the desk and pushes his thick dick back inside that tight Latin ass. AJay is groaning with every thrust of his dick as Justin continues to fuck his cinnamon-toned ass. It only gets better as Justin lays AJay face down before climbing aboard again. He lays on him as his dick sinks back in and begins slowly fucking him deep. AJay's ass rises up to meet Justin's cock as it slides in and out while Justin is laying completely on top of him fucking him slowly while licking his ear and neck. Is it getting hot in here? He then pulls AJay up into a doggie position and fucks him harder. That does the trick, and in no time they're both exploding all over AJay's sun-kissed abs.",
  "models": [
    {
      "name": "Ajay Vance",
      "person_id": 28333
    },
    {
      "name": "Justin Taylor",
      "person_id": 30894
    }
  ],
  "release_date": "2009-05-08",
  "scene_id": 55210,
  "tags": [],
  "title": "Doing Their Homejerk, Scene #02"
}