{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Anybody who's been with us here at CircleJerkBoys knows that, though for some 3 may be a crowd, here at CJB-3 is a party! Today we have three alumni each, in their own right, a 'fan favorite'. We start off today's smorgasbord with a Cuban 'papi' that's consistently made many men swoon with his bedroom eyes, latin accent and thick uncut dick. He goes by the name of Christian Castillo; and at 23, he's breaking lots of hearts-and asses-on both sides of the Florida straights. He recently returned from visiting his wife in Cuba and admits he does what he needs to; to keep him satisfied. The rest of our equation is lying intertwined on the couch a tad comfortable with each other. That happens when you've had the chance to get to 'know' each other. (Biblically) They are none other than Atlanta's own Justin Wells and the young and hung Troy Montgomery. These two were just here a few weeks ago and took turns honing their skills in both 'Pleasure Giving' as well as 'Oral dissertation'. Fun was had by all and now they're back to explore many subjects left unfuc-err  'untouched'. Throw in some extra Caribbean spice for good measure and we are guaranteed one intense session where more than the plantains will end up stuffed. Watch as Christian teaches our Southern boy how to play a game he used to play back on the Island called 'Esconde el Platano'. You'll soon see just where both these hung tops will 'Hide the Banana' Troy and Justin begin making out still intertwined on the couch as Christian gets up to get in on the action. Justin and Christian both help Troy strip down as they make themselves comfortable as well. Try gets his first taste of Christian's cock as Justin gets reacquainted with Troy's thick 8' dick. Christian is rock hard as Troy works the end of his thick knob. Christian and Justin then sit back on the couch side by side as Troy takes both of their cocks and continues to pleasure them. His head bobs up and down on one and quickly moves over to the other as they make out. Troy's mouth is working its magic and these studs can't get enough of his oral skills. Troy then gets sat down as Christian and Justin climb on the couch and take their positions on either side of him and feed him their thick meat. Troy's mouth is at their service as his sexy face gets fucked by both hung top studs. His chin bearing the brunt of a heavy barrage of ball slapping as they feed him their dicks. Troy doesn't miss a beat as he greedily chows down on all the dick they give him and it's only making him hornier for all the dick that is yet to cum.(pun intended) ...duh! While on all four and sucking on Christian's pole, Justin seizes the opportunity and begins to slide his thick dick in Troy's tight ass. Troy grunts as Justin gains ground burying his dick deeper and deeper. Troy does his best to suck Christian as he winces from the pounding Justin is giving him. Like a Chinese Cuff, Troy has both holes occupied and he's taking a pounding on both ends. Troy loves it and he takes every inch like a champ. It's Christian's turn as Justin moves back up to Troy's mouth for more oral while Christian slides his meaty baby maker inside his receptive ass. Christian's cock stretches Troy's ass even wider as he fucks away at his hungry hole. Justin is jerking his cock watching Christian get his nut as Troy laps and sucks his dick between grunts. Christian's balls slap at Troy's smooth ass and the sounds of sex fill the room. Balls slapping, cock sucking, and grunting all combine to create quite the aphrodisiac. Justin isn't done and he orders Troy back on his dick which he straddles and begins to ride as he grinds down on it sending Justin into orbit. Troy's not taking any prisoners as he rides Justin hard, slamming his ass all the way to the hilt repeatedly. The visual alone has Christian about to nut as they lay back and stroke off. Christian, kneeling on the couch is the first to nut sending his Leche all over Justin, jackin below him, who, in turn, explodes all over himself. Troy is last but not least with the most impressive load; sending geyser after geyser of thick cream all over his defined abs and chest.",
  "models": [
    {
      "name": "Christian Castillo",
      "person_id": 28258
    },
    {
      "name": "Justin Wells",
      "person_id": 27944
    },
    {
      "name": "Troy Montgomery",
      "person_id": 28334
    }
  ],
  "release_date": "2009-04-17",
  "scene_id": 55215,
  "series": "Taking Turns",
  "tags": [],
  "title": "Taking Turns, Scene #01"
}