{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "After leaving many of our members screaming for more, we've brought back one of New York's hottest additions, Mr. Ryan Raz. At 25, Ryan has already amassed quite a body of work in the year he's been doing this and we don't think anyone will get tired of watchin' him anytime soon. We also invited back a tall, small town Texan boy who's become a familiar face on our brother sites but is making his debut here on CJB. Dallas Reeves, also 25, has quite the fan following and we're hoping these two will make for a hot shoot this afternoon. Ryan, with the sexy A&F looks, is actually attracted to dorky, innocent looking boys. ?They're never as innocent as they seem?, he grins. Dallas has a wider gamut of men in his scope; from guys his age to older men, in their prime, like Troy Halston. When we asked these two what their hottest time on cam was, Dallas admitted his scene with Troy definitely topped his list. (No pun intended). Ryan however completely one upped him when he looks at us with those sexy blue grey eyes and says: ?Oddly enough, probably when I was getting fisted.? OMG! He goes on to say ?It was a really good time? before giggling and blushing like a school girl. It seems Ryan is even more sexual than we thought. There's nothing this stud hasn't done and admits he'd love to do it all?all over again. They finally get to kiss and as they do they lie back to get more comfortable. Dallas' hands run all over Ryan's smooth torso and his hands graze over his sweet ass. They lose their shirts as Dallas begins to undo Ryan's shorts and wake his thick cock as it begins to grow. Their shorts are next as these two now clad in their briefs begin to stroke and tug at their aching cocks. Dallas has Ryan's thick cock in his hands and it soon lands in his mouth as Ryan lies back and enjoys the oral he's getting. Ryan slides Dallas' briefs off as he then goes down for some cock of his own. Ryan takes as much of Dallas' cock as he can as he bobs up & down on his thick meat. They then flip and get into a sexy 69 position so that all parties are happy with the helpings. Ryan pulls Dallas up atop him so he can suckle on his meat for a few before Dallas begins to throat fuck him. On the other end, Dallas' head is bobbing on Ryan's meat like a champ. Dallas wants more than Ryan's cock to taste so he has Ryan lay down while his tongue finds new ventures to explore. He licks and rims Ryan's smooth ass using first his tongue then adding a digit or two. Getting his ass licked and fingered, his cock getting sucked, Ryan is in a state of euphoria. Already having Ryan's legs in the air while he tongue fucks his jock ass, Dallas moves into position between his legs as he gets his dick ready to plow Ryan's spit lubed hole. He enters him missionary as Ryan moans and groans. It isn't long before Ryan's ass is taking his thick cock with ease. Dallas lies behind Ryan and steadily impales him with his meat while Ryan looks back at him to kiss him. Dallas then lies on his back and has Ryan sit on his dick. In that position, Ryan only needs to hold his sweet ass still while Dallas fucks his ass hard, slamming his dick up into his welcoming hole. This position only gets hotter as these two get into it, Dallas bouncing Ryan on his dick while Ryan grinds his hot ass down onto Dallas. The chemistry between these two couldn't be any hotter as they continue to fuck each other senseless. Ryan gets off Dallas and turns around and gets right back on for more but in a reverse cowgirl position. He jacks his thick dick faster and faster as Dallas fucks his ass harder and harder. He begins to moan and groan and you know its cummin'. Cum he does as he unloads jet after jet of cum in time with every thrust of Dallas' dick. Ryan then begins to kiss Dallas as he jacks him off until he too explodes sending his own impressive batch airborne.",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 27903
    },
    {
      "name": "Ryan Raz",
      "person_id": 27995
    }
  ],
  "release_date": "2009-05-01",
  "scene_id": 55211,
  "series": "Doing Ryan's Privates",
  "tags": [],
  "title": "Doing Ryan's Privates, Scene #01"
}