{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have a hot local boy making his debut on CJB. He's a familiar face to those ExtraBigDick lovers who have made him quite popular on our brother site that goes by that very name. Yes, ExtraBigDicks can be a lot of fun and if nothing else serve as a constant reminder that 'less' isn't always more. That being said, who could ever get enough of Ft. Lauderdale's own Troy Montgomery? Troy has a smile that lights up a room and you wouldn't think you'd have much to worry about, until he hauls out his thick 8'. Being the hot 22yo boy he is, we figured that CJB would be as fitting a home for Troy and his 'package' Since we last saw him; he dated briefly but is single again. Troy's always up for trying new things. Don't you just LOVE that??wait for it? So then Troy blushes when he tells us he recently tried 'DP'...DP as in Double Penetration. You know, 2 guys fuckin the same (once) tight ass! ?that's hot. Turns out our lil trooper was on the accommodating end of that transaction. It turned out pretty well; but he's in no hurry to try it again. Hanging on his every word, is Atlanta's own Justin Wells. At 29 and having an extensive resume in the adult industry, Justin  is no stranger to 3ways or DP's himself. 'They can be fun, but they're a lot of work' he confesses. It seems it's not as easy to find the right position to have two cock sliding into the same hole without jockeying for position. It was tighter and everything but it was better in theory. Troy is just grinning ear to ear. 'I enjoyed it', he says; prompting Justin to ask, 'So, was it worth all the extra (work)...?' Troy smiles and says, 'It wasn't so strenuous for me; I just...kinda sat there.' Oh-no-he-di-unt! Well it looks like there was Troy had by all and that can't be a bad thing.     Sitting next to each other on the bench they begin to kiss. It isn't long before they each begin to strip. Troy leans Justin back down onto the bench as he leans over him and kisses him and lets his mouth wonder south. He pulls Justin's trunks off before pulling off his jeans. Left in their sexy briefs, they take the game to the wall as Troy leans up against them and offers his sexy ass to Justin who's on his knees behind him as he peels off his underwear. Justin kisses Troy's sweet ass a bit before standing back up and allowing Troy to take off his briefs. Troy goes down and as he slides off Justin's underwear goes down on the thick dick that sprung free. Justin helps Troy along as he grabs the back of his head and starts face fucking him. Troy doesn't miss a beat as he works his thickening rod. Justin moans as Troy spit shines his meat and it isn't long before Justin wants some too. Troy sits on the floor as Justin kneels over him and starts to suck his thick dick. Troy caresses his back as his eyes close with delight as Justin laps and swallows his thick 8' meat. Justin slowly swallows and savors his Latin dick as he holds it steady by its thick base. Troy's practically smooth all over with the exception of his short cropped pubes and some tufts peaking out from under his pits. Justin kneads his balls as he continues to tease Troy all the while working his knob with his mouth. Troy's mouth is half open in awe of the head he's getting from Justin and the chemistry between them is more than apparent.      Back to the bench they go as Justin straddles Troy's chest and aims his thick dick South?right into Troy's mouth. He slaps and teases Troy with his thick dick making him wont it even more. Troy opens wide as Justin begins to fuck his face. Justin's heavy balls slap Troy's sexy goatee and as Justin face-fucks him he reaches back and strokes on his thick dick which is throbbing and dancing in the air as it too seeks attention. Justin's ass looks hot as hell as he humps Troy's face. From there, these two land in a hot 69 position with Justin on the bench and Troy taking top-bunk as he feeds Justin his dick as well as goes down for more of Justin's meat. The 69 action is hot but short-lived and Justin is soon on the floor with a thick dick being shoved down his throat as Troy takes his turn face-fucking Justin. Justin swallows his swollen dick with ease as Troy gives him every inch of his fat dick. Justin's cock is throbbing as Justin strokes his dick while sucking on Troy's. His dick looks like it could cum at any minute and judging by the look on Troy's face it looks like they are both nearing their climax. They sit on the floor and side by side, just like they started, they stroke off until they can't hold back. Justin is the first to go, exploding with a series of short thick spurts that coat his navel and cock. Troy's the finale with a massive load that lands his first two blasts on his neck, then face. the remaining jizz lands on his smooth abs. Definite fireworks for these two and a warm welcome to Mr. Troy Montgomery!",
  "models": [
    {
      "name": "Justin Wells",
      "person_id": 27944
    },
    {
      "name": "Troy Montgomery",
      "person_id": 28334
    }
  ],
  "release_date": "2009-02-27",
  "scene_id": 55229,
  "tags": [],
  "title": "Oral Exams, Scene #01"
}