{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have two alumni here to give us some overdue updates. The first is Stefano Ricci  who was last on our site early last year in a hot scene with a certain Tony Michaels. Stefano, 22yo now had been featured a time or two on our site and has amassed quite the fan base with that sexy body and thick 7.5' dick. Sadly, we lost him to the West Coast where he relocated to California. The biggest difference between living there and here is 'traffic' he laughs. Over there he also gets a lot of ass. Florida has a lot of Latin ass but out West they have a little of everything, specially a lot of Asian ass. Stefano ain't picky so as long as it's hot he's good. Our partner in crime?and fellow alum of the 'As long as it's hot I'll fuck it' Club?Rocky Charles is back as well. Rocky  is 23 and originally from Virginia Beach, VA. He's looking a ?little? different. Apparently after deciding to dread his beautiful hair, the dreads proved difficult to sleep with and ended up buzzing off the signature locks we'd grown accustomed to on this Southern charm. Rocky hasn't noticed any difference having shorter hair and he's just been laying low and getting occasional 'relationship ass' from his steady girlfriend. 'Nothing new, nothing crazy...' he complains. Well, we're gonna get to change that for him this afternoon and Stefano is the perfect man for the job. They begin kissing as their hands fumble over their clothes. Rocky's tee comes off as Stefano begins to lick and taste his sexy chest. Stefano loses his wife beater as Rocky takes his turn tasting his nips as he gropes his meat. He lays Stefano back as he goes for his cock. Rocky is a bi-boy that can't get enough oral. He pulls down Stefano's jeans and as he does, Stefano's commando cock springs into view out of his pants right into Rocky's hungry mouth. Stefano can only moan his approval as Rocky licks and slurps his now throbbing meat. They both stand as they play a game of match up, comparing their thick dicks as they jack them inches from the other. Rocky never takes his eyes off Stefanos' uncut meat and as after both these inked studs kiss and grope some more, Rocky goes right back down to swallow more of that delicious cock. Stefano moans softly as Rocky worships his thick dick. He sucks his balls as Stefano just stares down at him doing his thing. Rocky easily takes his dick to the hilt and Stefano isn't complaining one bit! Rocky knows exactly what he's doing on his dick and it shows as he continues to shove Stefano's meat deep down his throat. The next shot we see is an eye opener as Rocky holds Stefano's thick dick up against his sweet ass and begins sitting on it. He slowly begins to give in as his ass starts to accept the intrusion. Rocky's come a long way since his last shoot where he got his mostly virginal str8 ass stretched wide by Peter Stallion. Someone's been practicing. lol Once Stefano gets his dick all the way up into our Southern Charm, he puts him on his back and slides back in. He then starts fucking Rocky without holding back. Rocky grunts and groans as he struggles to accommodate his meat and in no time he's taking Stefano's meat hard and deep. Seeing he has the go ahead, Stefano's pace builds and it only makes him want to fuck Rocky's tight ass even harder. As the camera shoots from overhead, these two look amazing as Stefano fucks away at Rocky whose pale thighs are spread wide getting the pounding of a lifetime. Stefano then switches it up again, putting Rocky on all fours before slamming his meat back into him and taking his ass doggie-style. He's pounding him harder than ever and Stefano's face says it all as his brows furl and his mouth gapes open. Without warning he pulls out and unloads his thick load all over Rocky's smooth back and ass. Rocky watches over his shoulder, trying to catch his breath as he feels the hot load pelt his skin, Rocky then flips over on his back and jacks his own thick load all over his inked navel as Stefano watches nearby. This was definitely one hot class reunion.",
  "models": [
    {
      "name": "Rocky Charles",
      "person_id": 27956
    },
    {
      "name": "Stefano Ricci",
      "person_id": 28225
    }
  ],
  "release_date": "2009-04-03",
  "scene_id": 55220,
  "series": "Back For More",
  "tags": [],
  "title": "Back For More, Scene #02"
}