{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Both of the studs here today have been featured on our site(s) more than once and each have an extensive following as well as impressive repertoire in the industry. So, today we decided to see what sparks would happen if we put these two together and just let things happen. Well, that's exactly what we intend to do as we let Atlanta's own Justin Wells have his first taste of the magic ass, who honestly needs no introduction, Mr. Tony Michaels  to be good. No seriously. Justin has no idea what kind of theme park we've just dropped him into and Tony had got to be the best ride by far. Tony has been up to the usual, hanging out and chillin' with his friends. He loves trouble and let's face it, trouble comes a'callin often. Tony loves dark Latin boys and if there's a NY thuggish air about him?even better. Justin doesn't have a set type though he does prefer bigger guys than him. These two are more than the average handful and they have several secrets the likes of which we'd never imagine. For example, Justin confessed he accidentally fucked his roommate's boyfriend?twice! Tony likes to relieve himself in odd places whenever the mood strikes. He grins when he confesses he at times will beat his meat in the bathroom at work due to his high sex drive. ...Poor, poor lad. If ever there was any doubt these two wouldn't have chemistry well the immediate make out session quickly dispelled those. It isn't long before Tony is down to his sexy briefs and he's helping Justin out of his. Next thing we see is Tony getting his first taste of the Georgian gent's thick dick as he bobs up and down on his meat. A sort of homecoming for the boy born in GA but raised in Florida; Tony's is getting reacquainted without a problem. They both lick and suck all over each other eventually landing in a steamy 69 session, laying side by side as each continues to service the surplus of cock before them. Tony can't get enough of Justin's meat as he straddles him to get better access as they continue to 69. Justin doesn't mind one bit and this new position gets Tony's throat deeper on his dick and also gives him easy access to begin exploring that ass he's heard so much about. He begins to finger fuck Tony's tight ass. It seems the more ass play Tony gets the more he's fueled to suck Justin's cock. Who could go wrong with that combination? ?Not I? said the goose. ?Oops! ...that's the wrong story altogether. We digress,Oral is merely the appetizer to the fucking Justin has in store for Tony. Oh Goody! Tony braces himself as Justin bends him over up against the wall. Tony's lip snarls as he gives us his signature grimace as Justin slowly invades his ass. There's no learning curve here and Justin's pounding Tony's ass right out of the starting gate and all Tony can do is try to keep up. The ever-consummate professional, Tony doesn't miss a beat. A shot from below gives us an insane view as Justin's sweet ass as it rises and falls burying his thick dick in and out of Tony's willing hole. FUCK! From there, Tony goes doggy and all Justin has to do is hold still while Tony backs up on his dick. Justin is in awe as Tony practically fucks himself with Justin's bone. Tony can't get enough and soon he straddles Justin and slides his hot ass back onto his meat, mounting him reverse cow girl. A close up of Justin's cock looks sinful as Tony bounces up and down on it unable to get his fill. The hottest part of that shot is the look on Justin's face, off in the background, as he just watches his throbbing dick get the ride of its life. He had it cummin'...and 'cummin' is what's in store for these two and soon as Tony, now facing Justin, continues to ride and ride hard. As they near climax, they both lay down with their cocks near the others and stroke off. Tony's the first to quietly spew as his thick nut cascades over his wrist onto his porcelain skin. Justin isn't far behind as he grunts and groans aloud blasting his thick cargo all over his tones abs. Our work here is done, Gentlemen.",
  "models": [
    {
      "name": "Justin Wells",
      "person_id": 27944
    },
    {
      "name": "Tony Michaels",
      "person_id": 27902
    }
  ],
  "release_date": "2009-03-20",
  "scene_id": 55224,
  "series": "Insert Here!",
  "tags": [],
  "title": "Insert Here!, Scene #02"
}