{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Thinking of leaving the states for a while in search of adventure and apparent mayhem, Rico Salazar is back to give us one last show before life calls. Rico is sexy local who has been on our sites a time or two and has quite the fan following. The only thing hotter than Rico's fan base are his friends. He was last here in a hot 3 way stroke off with two other hot, str8 buds. Where were all these horny and willing str8 boys ok with whipping it out and stroking off a nut without giving it much thought back in the day? Sign of the times I tell ya; it's a sign of the times. Well, whatever it is?we LOVE it! The more the merrier and in the spirit of friendship, we've paired him up with one of his many homies he chills with when he's out with the fellas. One look at that smirk on Marcus' face assures you that this boy is trouble. The kind of trouble that gets him in all sorts of predicaments; such as hiding buck ass naked and rock hard in a closet at a family reunion. The best part is his ?cousins? mom banging on the door knowing what he's up to. Good times! Marcus is also a member of the Posse Patrol and he too was last here and brought not 2 but 4 friends to play ?hold em? with. Watchin' these str8 studs talk bout trains they've run on females was incredibly hot...and rather insightful really. Who knew the mating tactics of young studs these days had gone from the smooth, stealthy calculated approach to a pack mentality? Well, the latter makes for hotter porn. Speaking of porn...Sitting on opposite sides of the locker room bench, Marcus and Rico begin to grope their crotches as they watch a fuck flick to get them in the proper mood. Their jeans begin to fill out as they rub themselves and soon enough Marcus in on his feet giving his uncut meat more room to grow. Rico follows his lead and also strips down to his boxers. Marcus is in a gold jock that hugs his thick Cuban dick and you are easily able to make out his fat knob as it pulses beneath the thin fabric. Things are getting hot for Rico who loses his boxers and is left in a white jock strap. His thick baby maker also strains against the fabric eagerly anticipating play time. In their jock straps we get a better appreciation of their bodies. Rico if thick and his sun kissed body has ink on his abs and biceps giving him a 'Bad Boy' look. Marcus is fairer and his body is leaner and naturally defined. He has more of a classic ?jock? body. Marcus' dick is the first out as he slides it out of the side of his jock. Rico sees his dick and instinctively loses his jock altogether before lying back on the bench to give his thick dick the attention it needs. His fist slowly slides up and down over his cock and as it does you can see his darker foreskin gliding over his pink knob. He's packing a thick dick and we're sure it's driven many a girl crazy....and a few boys wishing they could have it. (...you know who you are!)                                                        Bu now, Marcus is free balling too and he works his own thick dick, stroking his meat in short strokes focusing on his knob. Marcus has a permanent grin on as he strokes his Cuban ping?n and you can't help but wonder what he's thinking about. We may not wanna know actually. Marcus' thick thighs are spread wide giving him better access to his uncut love joy and its now throbbing as it feels the familiar tingle beginning to brew deep in t hose balls. Rico is seated on the floor a couple feet away as he slowly strokes his meat with a focused look on his face as he watches the flick in front of them. They both stand up in typical show off fashion as they size up each others package. In the wild, this would entail taking a series of steps back and then charging at each other full speed ahead before violently looking horns as their skulls collide. Fortunately, these two are actually Horny Goats?not Mountain goats. Whew. They both begin to wiggle their dicks about, laughing as they show off. Then almost as if it was understood they both eye the prize and see just who can spooge first. They both stroke their thick dicks with determined looks on their faces. Wel, it seems 18 really does cum before 20 after all as Marcus' abs clench and his cock explodes sending strands of thick cum rappelling down like glue. HOT! Rico is in no hurry and takes his time and pumps out his own thick load all over the bench. ...where's the towel boy when you need him?",
  "models": [
    {
      "name": "Rico Salazar",
      "person_id": 28273
    },
    {
      "name": "Marcus Guitarro",
      "person_id": 28288
    }
  ],
  "release_date": "2009-03-27",
  "scene_id": 55222,
  "series": "Right B4 Practice",
  "tags": [],
  "title": "Right B4 Practice, Scene #02"
}