{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have Mat?o Grande back this week and he brought reinforcements. Mat?o, the hot 19yo Cubanito, has brought along two of his best buddies along this week. The first is Johnny Vino who is 18yo and from Carol City, FL., The final component to the trifecta is 20yo Peter Soma from Hialeah, FL. When asked, Mat?o admits he may have the biggest dick; but, Peter IS the biggest dick. Peter grins ear to ear as he admits he gets off humiliating girls he fucks by nutting all over their faces and treating them like whores. He'll make a proud Daddy some day. We just know it. We all know Mat?o loves whores and we can easily deduce that 'fucks of a feather whore together'. Johnny Vino, the most innocent looking of the three, dashed our lingering traces for decency by admitting he too loves to treat girls like whores. They may have dreams of 'Grande-ure' -but no one does it as well as 'the Master'. Mat?o's latest adventure was taking his 'date de l'heure'(Fr. for date of the, or 'by the' -in his case- hour) to a public parking garage in order to fuck. He apparently needed a place to go and he remembered an open garage near a hotel. He drove up to the rooftop and when he couldn't get enough room for his 8.5' Cuban dick he dragged the girl buck naked out of the car, put her on his hood and kept right on fuckin! It wasn't long before he realized he had an audience of hotel guest cheering him on from the windows above them. He nut to the sounds of hootin' and hollerin' and she didn't even flinch. No wonder he loves whores.Sitting around the locker room, they sit back and start to watch a flick. They begin talking smack as they grope their crotches. Their young cocks immediately begin to tent their shorts as they slowly get comfortable. Mat?o's the first to start strippin' his clothes off as they follow suit. There's no question as to who the ring leader is here. Mat?o then undoes his shorts and begins to stroke his growing meat through his boxers. His 'compadres' flank him on either side as they too undo their shorts ad begin working their meat through their boxers. Mat?o begins to air hump and his thick dick easily flops around in his loose boxers. HOT! Once they sit back down, Mat?o is the first to whip out his dick and once his buddies see that his meat is out and proud they drop their boxers as well. They each begin to work their meat. Johnny lays back on the bench, Mat?o sits on a chair and Mr. Vino stands to give us a better view of his cock and 'ass'-ets as he gives us a view of his bubble but. They reposition and Mat?o takes the bench as he lies back and Johnny strokes his uncut meat on the chair and Peter lies on the floor as he works his thick meat as well. Their eyes are all glued to the pussy action onscreen.They then decide to get on the bench and take a basketball hostage. We're pretty sure it's against NBA regulations to have 7 balls in such close proximity-but we'll allow it. Johnny and Peter are on the bench as they lie back ass to ass, with their nuts inches from the same basketball. Mat?o is standing until Johnny moves to get more lube and Mat?o jacks his place on the bench. Snooze you lose. Watching these three schoolmates and str8 buds jack off together as they watch porn and stand, or lie, mere inches from each other is mind boggling. As the camera pans over these three studs we get a better appreciation for their smooth, compact and muscular bodies. They are each in their own world as they focus on the porn before them. If you pay close attention to Mat?o, the consummate prankster, you can see the devilish twinkle in his eye as he hatches his devious plan. While Peter is lost in Porn just a mere basketball away; he has no idea what Mat?o, who now has a look of focused determination, has in store for him. Mat?o beats his cock harder and faster. It isn't long before Mat?o's abs contract and once he grips his knob tight you know that loads gonna fly as soon as he releases it. Explode is more like it as it blasts right over the basketball and splatters Peter's thighs and nuts. Mat?o's face says it all as he sticks out his tongue like he just won the challenge. Johnny is laughing as he nuts all over the basketball while Peter who can't do much but laugh along in spite of his load covered legs as he too empties out his thick nut. Boys will be boys.",
  "models": [
    {
      "name": "Johnny Vino",
      "person_id": 28330
    },
    {
      "name": "Mateo Grande",
      "person_id": 28289
    },
    {
      "name": "Peter Soma",
      "person_id": 28329
    }
  ],
  "release_date": "2009-03-13",
  "scene_id": 55225,
  "series": "One on One on One",
  "tags": [],
  "title": "One on One on One, Scene #01"
}