{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Back from a fun-filled trip to the 'Big Apple', we have a wide-eyed Tony Michaels. He beams as he recounts his tales in the city. He was mobbed at the clubs when he went out and people recognized him by his neck tattoo. Yeah, we're suuure the neck tat is what got everyone's attention. With a face like that and an ass with its own reputation; he was oddly surprised to find how many people knew exactly who he was. Seriously? Hmmm. Along with Tony this week we have one Alex Charge. Alex is 22 and even though his white complexion and dark features might suggest he's from the great white north, he's actually a Florida native. In Florida, it's the pale ones that are the natives. When you grow up in the tropics you know enough to stay clear of the same sun others flock down to soak up. Third degree burns are NEVER attractive. You know who you are, Eh! Enough said. Alex is from a small town on the West Coast of Florida. He's pretty open sexually and he's into ?whatever feels good?. Ya gotta  love that. His first sexual experience was at 16 with a girl. ?It was a good? he says. The hottest sex he's had was with a girl into Water Sports. He admits he loved having her pee on him. . Tony has an odd smirk on his face hearing the sordid details and recommends we might need to do a shower scene. Ummm No, Tony?not that kind of site. Alex's ultimate fantasy would be a 3 some with either 2 guys or 2 girls. Tony on the other hand is more experienced and if you're familiar with Tony, you know this boy may not necessarily be a 'size queen' ?but he can certainly be impressed!  From what we hear, Alex has quite an impressive piece and Mr. Michaels has unselfishly volunteered to find out for us. That's our boy Tony for you, always willing to go the extra 8? for you.Tony is groping his cock as he watches himself on video as he rides hot Stefano in one of his earlier scenes. Unbeknownst to him, he has an audience as Alex stands at the doorway peaking in as he too begins to grope his growing cock. Alex can't help but barge in on Tony who is caught by surprise but doesn't flinch as Alex drops to his knees and begins to haul out his cock. Tony feels up on Alex's chest as Alex gets him hard as he strokes his thick dick. Alex gazed directly at Tony seconds before he goes down and takes Tony's thick dick into his mouth. Tony gasps at the new sensation as Alex begins swallowing more and more of his meat. Caught up in the moment, Tony stands up and begins to kiss Alex as they undress. It isn't long before Alex is back on his knees for more of Michael's meat. Tony grunts as he slowly gives Alex's mouth a slow fucking. Alex, mouth ajar, wriggles his tongue around as Tony teases him, waiving his thick meat inches from his face. Tony wants some dick himself and he stands Alex up seconds before going to town on our Floridian to show him how it's done. Alex gasps as Tony's warm mouth engulfs every inch of his thick dick. Tony can't complain. Not that he could with a mouth full of dick, but Alex has more than enough to keep him satisfied. Tony readily savors Alex's thick 8? dick which is as thick at the base as it is at the tip.The sounds of Tony slurping on Alex's dick fill the room as Tony slurps and suckles on his rock hard cock. He can't get enough and it shows. Alex is lost in ecstasy as his head writhes back and forth. These two then get into a hot 69 with Tony on Top Bunk as he licks and sucks on Alex's dick and balls as Alex lies back and works Tony's meat from below. Alex then holds his thick dick at the base as we see the painful look on Tony's face as he backs himself onto it. Try as he might, Tony just isn't accommodating Alex's entire dick fast enough and Alex isn't about to wait around. Tony grimaces as Alex grabs him by the waist and begins to impale him with his thick dick. Tony bites his pillow as Alex slams his sweet ass deep and hard. Tony's the consummate trooper and he takes the pounding he's given. Alex then puts him on his back opens his legs and eases back inside him as he plows him missionary. Alex's sweet ass rises and falls as his balls slap Tony's ass with every thrust. Tony has his legs spread wide and as he gives up his ass, Alex's dick is hitting all the right spots and in no time he explodes all over himself. Now it's Alex's turn and as he strokes his massive dick off, Tony gives him something to suck on and with a mouth full of dick, Alex explodes all over himself, glazing his naturally smooth abs and navel.",
  "models": [
    {
      "name": "Tony Michaels",
      "person_id": 27902
    },
    {
      "name": "Alex Charge",
      "person_id": 28336
    }
  ],
  "release_date": "2009-03-06",
  "scene_id": 55228,
  "tags": [],
  "title": "Cumming Home, Scene #02"
}