{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "'Where do we start?' we asked as we stare across a packed set '-With MY fat cock!' is the response we get from the infamous Mat?o. Mat?o is one of 5 locals bringing it today. Along for the ride are co-conspirators Angel and Marcus, two more 18yr olds who were all part of a hot 4 way a few months back. Also in on today's madness is 19yr old fan favorite, Jay. Jay  has been featured in a 3way of his own and today they brought along some new meat by the name of Stone. Stone is excited to be here and he hasn't stopped touching his dick since he walked in. (that could be a good or bad thing.) Stone, also 19, fell into their outfit recently. He was fucking a girl in public under the rain when these boys rolled up and caught the show. They've been BFF's ever since. These guys are always up to something and the new thing is getting a girl to sleep with each of them without catching on that they're being played. After she's had them all they ask her who the best lay was. So far: Angel 1, Marcus 1, the rest are still trailing. It's odd that they would be doing one-on-one madness when group sex seems to be the theme with these guys. Where were friends like this when we went to high school? Mat?o is an orgy waiting to happen. He recently was at a bud's barber shop after hours drinkin with his cousins when a 'whore' came in and got all tipsy. 'H-O-R-E! That's your favorite word, Mat?o!' our riveting reporter scoffs. 'W'-H-O-R-E!...' they all chime in. 'there's a 'W'! Just our luck-they aren't the remedial batch after all. Mat?o loves whores and apparently the whore then got all tipsy, was flashed Mateo's cock and it turned into an all out oral orgy when she ended up on her knees sucking off Mat?o, his 2 cousins and the 3 barbers. By the time they were through with her, her hair was definitely 'set'-eXtra firm hold.      Watching an amateur flick, they all start stroking their cocks talking smack. They are talking smack because it seems the video they are watching is one they brought themselves. It's one they made themselves too. These boys film their escapades and use them afterwards. They all begin to strip and sit back in their boxers as they haul out their dicks and stroke to the film before them. Stone, the newbie, fits right in as he bones up along with his crew. They all sit around the desk and as they get better acquainted, the boxers begin to come off. Stone is oddly the first one to strip as he stands up against the wall. Yeah, we wouldn't leave our asses exposed to the likes of those horny fucks either. They did say they were gonna break him in. We think he is wise to take that extra precaution. Though that would've made for a great shoot! Inno time they are all boned up and stroking their fat pingas. They are remarkable comfortable with each other as these pussy loving buds stroke their own equipment inches from their buds. Again, where were these guys when we were in High school?! lol This new generation is just too hot.As the camera pans around the room, we see each of the sexy Latin studs stroking their meat. Some cut others au natural but all hard as a rock and needing to release some pent up leche. Lined up like sperm donors at a wayward bank, they sit stroking away without a care in the world. We can only imagine what those girls they pull trains on must think when this much dick is waved in their faces. Oddly we don't think they would know what to do with them. You really can' t send in a girl -to do a man's job. Sadly these boys may never know what that's like. (...we jest!) As they get closer to climax they decide to get in a circle jerk and single out the weakest cusion as their prey. Alone and surrounded, the little red cushion awaits the inevitable. These boys have been practicing shooting their loads as far as they can and this afternoon we may just get our first view of that. As they circle the wagons and stroke off, Mat?o is the most focused as he races to be the first one to hit the target. The room is filled with the sounds of lubed dicks jackin' as they prepare for fireworks. Mat?o is the first to explode sending his first batch way past his intended target and hitting a live one instead. Oops. (Sorry, Angel)The rest of his nut tags the cushion. Jay is second as his thick cream coats the far side of it, followed by Marcus that adds his cup of cream as well. Stone and Angel get back on the couch and stroke their loads off all over themselves as the cushion breathes a sigh of mixed emotions. (just go with it) Now that all these studs have blown their loads there is a weird silence in the room. Nap time perhaps? Well that's a wrap for this shoot. The boys are on their way home and we're left to figure out what to do with that cushion.",
  "models": [
    {
      "name": "Marcus Guitarro",
      "person_id": 28288
    },
    {
      "name": "Jay",
      "person_id": 30391
    },
    {
      "name": "Mateo Grande",
      "person_id": 28289
    },
    {
      "name": "Stone",
      "person_id": 28340
    },
    {
      "name": "Angel",
      "person_id": 30331
    }
  ],
  "release_date": "2009-02-06",
  "scene_id": 55235,
  "tags": [],
  "title": "5 Guys Named..., Scene #01"
}