{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It's often said that when one has sex with another person, male or female; you are, in essence, having sex with everyone they've ever had sex with. That's one hell of a visual ...for the select few.  Regardless, if that is to be tried and true then today's sexy studs have already had sex a couple times. See, 24yo Austin Jacobs and 22yo Jherrad Lopez*, have one hot 21yo common denominator between them. That common denominator goes by the name of Logan Robbins. You do remember ?common denominators? don't you? That's the number at the bottom that goes into the numerators (*see above) on top. One usually doesn't go into 2 evenly; but, in this case it did. Sexy Texan, Austin  who's making his debut on CJB was featured on our brother site ExtraBigDicks.com where he got an ass-full of Logan. A few weeks later, Jherrad  woke up to find some of the same underneath his Christmas tree. Today these two will finally get the chance to go at it?without the 6th  degree of separation. Austin is a recent arrival to San Diego. He packed up his shit in 48 hours after his boyfriend asked him to move leaving the Lone Star state a tad lonelier. He loves the weather here and who can blame him? Jherrad, who's best remembered for that slammin'body and his bold idea to begin an ill-fated ?Str8 for Pay? porn movement, has been hanging out and enjoying the weather as well. He loves the beach, but was totally bummed out his last trip out when they had to close down the beach after a shark attack. See, that would never happen in Decatur!They start to kiss softly as they break the ice. It doesn't take Austin very long to unwrapping the goods as he pulls Jherrad's tee off, licking and sucking his defined chest. As he licks further South he undoes his jeans and out comes Jherrad's commando. Underwear is overrated. He bobs his head on the growing meat and as his cock gets to full mast, Jherrad wants to return the favor. He undoes Austin's fly and goes down for a slab of Texas, Austin's hard in seconds as Jherrad expertly works his thick dick with his full lips. The fun is just beginning and Austin has Jherrad assume the position for him. Once on all four, Jherrad awaits patiently as Austin moves in behind him. You can't really make a meal outta someone unless you kick things off with a bit of salad??tosses? salad, that is. Hell yeah! Austin dives deep into Jherrad's firm ass as he buries his tongue inside him. Jherrad's brows furl as he revels in the new sensation. Soon enough it's Jherrad's turn as he too gets into position to eat some ?Texas Tush?. (What!? ?it just works, ok) Jherrad gives it back as hot as he got it, lapping away at Austin's back door. All this rimming's gonna land someone on a pole sooner than later. Fortunately, we won't have to wait very long either.Austin suits up as Jherrad decides which position would be best to get that cock in him. He turns around and slowly sits on it. He grimaces as the thick cock begins to maje its way inside. Once his ass has engulfed Austin's meat, he lays back against Austin and begins to ride his cock. Austin's in awe as Jherrad does his magic. His cock's being ridden by a hot Latino that knows what he wants and exactly how to get it. The pair look incredibly hot as they melt into one another as Jherrad pistons his ass onto Austin who is sitting back and enjoying the ride. Jherrad gets up and switches up as he gets back on facing him. He latches his arms around Austin as Austin now begins to bounce him on his stick instead of the other way around. Jherrad is groaning as Austin shoves his thick dick even deeper. Austin will fuck him for a while more before putting Jherrad on his back, lifting his legs and slamming back inside. Jherrad just lays there, exhausted (or fulfilled?you decide) as Austin pounds away at his tight ass. They're both working themselves into a frenzy as Austin begins to pick up the pace. That does the trick and in no time these two are ready to explode. They sit back side by side and stroke their throbbing meat to what can only be a huge climax. Sure enough, Jherrad is the first to blow and when he does it blasts all over his thigh in a few thick spurts. Then the finale, Austin jacks his dick and unleashes his creamy fury as thick streams of load (six to be exact) blast into the air and splatter all over his smooth abs and happy trail. Texas was a bit backed up it seems. Not anymore. Excuse us ?We need to go clean up.",
  "models": [
    {
      "name": "Austin Jacobs",
      "person_id": 28337
    },
    {
      "name": "Jherrad Lopez",
      "person_id": 28338
    }
  ],
  "release_date": "2009-02-20",
  "scene_id": 55232,
  "tags": [],
  "title": "Mix & Swirl, Scene #02"
}