{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Back in the house is Mr. Tony Michaels. There's never a dull moment when this hottie is around. Tony  has been working, having fun, meeting new people and doing new things. He's has been spending his time lately with a new beau he met from New York. We're more than sure he's gotten the star treatment and tour from Tony with all sorts of perks included.  Today we brought back a latin lover we haven't seen in a while, Mr. Christian Castillo. Christian  just got back a month ago from visiting his wife and daughter down in Cuba. He was there for 2 months and he smiles when he admits the homecoming was an exhausting one. He didn't let his wife out of bed for a long, long time. He had some serious catching up to do. It's been a month now and this Cubano is horny so he's ended up at our door. We aren't complaining. Tony, a big dick aficionado, won't be complaining in a few when he gets to sample all 8? of Christian's Cuban 'palo'. His cock loves plenty of attention. Tony is looking smitten as he eyes his co-star. We let Tony ask Christian anything he wants to. This is how it went: Tony blushes and says, ?What's your favorite position?? Christian grins and replies ?...any one you like!? Tony volleys back, ?Well, I have a few.? This is gonna be Tony's best Valentine fuck ever. Sitting on the locker room bench these two begin to kiss. Softly at first and as they begin to undress the kissing intensifies. It isn't long before Tony is licking down Christian's sexy abs down to his sexy tighty-whities which are beginning to sport major wood. He licks and teases it but isn't looking to waste anytime on formalities. They both strip and Tony goes to work. Christian is in awe as he looks down at his cock which is now disappearing into Tony's talented mouth. Tony slurps and strokes Christian's fat ping?n as he focuses his attention on the uncut fuck stick before him. Christian stands and straddles Tony so he can give him better access to his dick. Tony takes it in stride as he deep throats every inch of his dick. Tired of straddling Tony, Christian moves the action to the floor as he sits on the hardwood floor and leans back onto the lockers. Tony takes his place between our str8 boys thighs and goes right back to worshipping his baby maker. Christian's head falls back n ecstasy as he gets his meat serviced. We're sure his wife in Cuba or any of the stand-ins in Miami have ever worked his dick this good and he's really glad he came in today. Duh! A few kisses finishes up the oral set and in no time the 'real' action begins.Tony straddles the bench again and leans up against the wall as Christian jacks his cock getting it even harder as he parts Tony's sweet ass a bit before burying his thick dick in one thrust. This str8 boy means business and in no time he's literally bouncing Tony's Cuban-Italian ass on his thick dick. DAMN. He's not here to make love ?he's here to fuck. If you want this str8 boys dick you need to take it hard and deep. Christian sits on the bench as Tony bends over a bit t find an easier position to accommodate all of Christian's 8' dick. Christian easily fucks up into Tony's ass not even skipping a beat as Tony bucks back to get every inch. From there they go into a standing doggie position as Christian keeps right on fucking him. The hottest position has to be when Christian, who's standing and fucking Tony, pulls him back into the corner still buried in him as he squats down and continues fucking Tony in that position. The overhead shot of Christian just fuckin' Tony as he holds onto him is insane. WOOF! This Cubanito can throw some serious dick and he ain't messin' around. Tony is squatting, taking a pounding as Christian braces himself on the floor and pile drives up into Tony's sweet ass. Tony can't help but jack off as he gets plowed. He starts to ride Christian once he holds still. Tony grimaces as his ass gets stretched deeper over and over. Once Christian realizes Tony's getting close, he goes right back to pounding him harder until he fucks a huge load out of him?literally. Christian then lies back and beats his own massive load out all over his sexy abs and cock. Now this is the kind of sex everyone should treat themselves to on Valentine's Day! lol",
  "models": [
    {
      "name": "Tony Michaels",
      "person_id": 27902
    },
    {
      "name": "Christian Castillo",
      "person_id": 28258
    }
  ],
  "release_date": "2009-02-13",
  "scene_id": 55233,
  "tags": [],
  "title": "Bump & Grind, Scene #01"
}