{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Derek Princeton is back this week, and he's got a new friend to play with. For those of you unfamiliar with Mr. Princeton, Derek is 22, and he is one of those str8 but not narrow boys. Even though he has a live-in girlfriend that keeps him plenty busy, he still has been finding the time to explore his sexuality on the other end of the buffet. He was even featured on our brother site, ExtraBigDicks.com, breaking in his thick 8' baby maker. Last Derek  was here he had his second ride on the cock trolley as sexy Logan Robbins got his chance at tappin' that str8 ass. Derek took it like a man. It was a definite scorcher as he accommodated every delicious inch. Enjoying the weather this week is Trystian Sweet. Trystian is 22 and is in San Diego dancing at a local club. He dances and he loves being able to travel and do what he loves. Who knew the life of a Go-go boy was so glam? Trystian is from San Francisco, so he's not used to the heat; but he admits it's a nice change of pace, and is actually considering moving here. Fortunately for us, after a petite snafu with a model we had booked previously, we were left short a circlejerkboy. We say 'fortunately' because it gave us the chance to work with Trystian, who is making his debut with us today. We appreciate him filling in at the last minute; so we decided to let him 'fill in' some more. He can start by filling in Derek (...literally).                                            Softly kissing as they break the ice, they seem almost tentative until we hear Derek ask, 'You willing to suck dick?', making sure he's getting some. Trystian quickly reassures he's willing as Derek bolts up on his knees, peeling his tee off, giving Trystian access as he licks his chest and abs. In no time, Derek is in the buff and his growing cock has found a new home in Trystian's nursing mouth as he hungrily swallows his uncut meat. All Derek can do is moan as he gets his dick worked. Trystian gets Derek's dick throbbing, sucking his shaft and playing with his low hangers. Trystian then gets comfortable as he undoes his shorts and starts bobbing Derek's head on his own meat. The little stud from the City by the Bay is packing some serious meat as his dick stands at attention. They both get to work on the all-you-can-eat buffet as they maneuver into a hot 69. Looks like there's oxygen in them balls as they both suck dick like it's going out of style. Derek then gets up and lies on his back, throwing his legs in the air as he spreads his cheeks and visually motions toward his hole. Trystian is a quick study and loses no time before diving into his smooth ass?tongue first. He spreads his cheeks wider to get in as deep as he can. This str8 boy loves getting his ass eaten, and we know what comes after a hot tongue bath. A good tongue fucking can only lead to dick?and plenty of it! First, Trystian eats his ass on his back. Then, he puts Derek on all four before diving in once again to get more of that sweet ass all over that sweet face of his. Derek is no longer giving orders; he is too busy moaning as Trystian has him under his spell.                                                         Playtime is over, and Trystian needs to bury his dick in the warm hole he's been prepping. Derek slowly straddles his cock as he lowers himself onto it. Trystian is rock hard and doesn't give Derek much time to adjust before he begins ramming his bone up into his tight ass. 'Awww Fuuuuck!' Derek moans as he gets his tight ass pounded faster. Derek is stroking his raging hard on as Trystian continues his anal assault. Trystian means business, and he's gonna take that ass on his terms. He gets Derek off his dick and puts him on all four before slamming back up his ass doggie style. He grabs Derek's sweet ass and fucks him like a bitch. He pounds away to the sounds of Derek's grunts and groans, which only help fuel him on. This little stud can throw some serious dick! 'OH GOD!' grunts Derek as Trystian impales his ass, sinking balls deep now that he has him back to where he started, on his back with his legs in the air. Trystian pins his thighs down, slamming into him as he watches his thick dick slide in and out of Derek's hungry hole. We hear another 'Oh fuck!', only this time it's Trystian whose balls are beginning to tingle. He pulls out and lays back to jack his sweet load all over himself. His sexy abs glisten under his load. Derek follows suit, pumping his own load all over his smooth navel. You just gotta love watching a 'str8' boy get pounded like a bitch and know he's going home to one very lucky lady!",
  "models": [
    {
      "name": "Derek Princeton",
      "person_id": 28293
    },
    {
      "name": "Trystian Sweet",
      "person_id": 28341
    }
  ],
  "release_date": "2009-01-30",
  "scene_id": 55238,
  "series": "Leading The Way",
  "tags": [],
  "title": "Leading The Way, Scene #02"
}