{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Six Degrees of separation refers to the idea that, if a person is one step away from each person they know and two steps away from each person who is known by one of the people they know, then everyone is an average of six \\'steps\\' away from each person on Earth. While you digest that, we're glad to say we didn't need all six. With a grin that only a blind man would trust, 23yo Texan, MJ Cash is back in the house. It seems MJ is our one degree this afternoon. When we went to introduce him to his co-stars, he was actually shocked that ?not only did he know them both?but he'd ?known? them both (Biblically speaking) as well. Imagine that! What are the odds? lol With over 80+ films to his credit, 28yo Atlanta son Justin Wells is back; and we brought back Virginia's finest, Kameron Scott  as he makes his second appearance on film. Both of these studs are in for more of the same; and by more of the same we mean MJ. All three claim that they've been nothing but angels since we last saw them but we'll leave that up to you to believe. Whether you believe that load or not, it's easy to believe that these guys love what they do. ?I love the network I've created and the friendships I've managed to build meeting guys all over the country.? Says Kameron of why he loves what he does. ?I love that I get to travel and I get to meet such a diverse (pronounced: die-verse ...He's from Georgia) group of people.? Then all eyes turn to MJ who is just laying there awaiting his turn; sporting the biggest shit-eating grin ever as he delivers his wide-eyed response ??I just love to show off!? ...C'mon, tell us something we don't know!       All hands on deck as both boys turn to Justin as they begin kissing either side of his neck. These boys have the familiarity that leads itself to hot sex. Nothing is stopping them from freely exploring each other. They kneel as they kiss each other, slowly stripping off their clothes until they are brief clad. MJ's ass is the first to get attention as they pull his briefs down to get a taste. Kam and Justin lap at his sweet ass a bit before turning him around to free his aching cock. Both hot mouths lap and suck on his throbbing knob. Justin then lies back to give the other two all the room they need to suck his thick dick. Tongues abound as they shower his bone with love. MJ then decides he isn't done with Justin's mouth as he straddles his chest and buries his dick deep. Kameron is busy working Justin's meat himself. Some things were not meant to be shared. The reposition themselves so that MJ is now servicing Justin as he gets face-fucked by his thick dick. Justin's face contorts in ecstasy as he watches MJ struggle to take the thick dick he's pounding into his throat. Kameron is busy shoving his tongue deep inside his other end. Kameron is prepping that sweet ass for the hard fucking he's in for. MJ's ass is getting a royal tonguing and it's only making our Texan even hornier for dick. We wonder if he's having flashbacks of his prison shower scene. Nah?there were 5 guys doin' him that time.Already in the neighborhood, Kameron suits up and pulls MJ up into position as he slides his thick meat inside. MJ moans with a mouth full of dick as he services Justin who has a front row seat as he watches Kameron start to pound his ass. MJ is caught in a Chinese cuff as he has two dicks locked on either end. Kameron, ball deep in MJ, falls forward onto MJ to help him suck Justin's throbbing meat. Next we see MJ's thick dick slowly pushing inside Kameron's perfect ass as he moans trying to accommodate him. Once he has a steady pace going, Justin moves into position behind him and easily slides his cock in for not-so-sloppy seconds. Justin and Kam hold still as MJ becomes the rapid-driving piston in a well-oiled fuck machine. His cock sinks deep into Kameron's ass as his own still holds Justin's knob almost gives up Justin's meat. Once buried, he pulls his shaft out of Kam's hot ass as his own gives way, welcoming Justin's shaft back in. Queue the Soundtrack ...It's the ?Circle of Ass?. MJ is driving as he ricochets between a rock and a tight place.  They can't hold back much longer and kneel on either side of MJ's face (the perfect landing pad for 2 thick loads.) Kameron is the first to blow, grunting as he coats MJ's face & lips followed by Justin who covers the rest of it in a ?Dual-layered Protein Facial?. (Available at a Spa near you?NOT!) The hot jizz drench sends MJ over the edge as well shooting his thick nut all over his taught abs. ?Anyone for Clean up?",
  "models": [
    {
      "name": "Justin Wells",
      "person_id": 27944
    },
    {
      "name": "Kameron Scott",
      "person_id": 28022
    },
    {
      "name": "MJ Cash",
      "person_id": 28245
    }
  ],
  "release_date": "2009-01-16",
  "scene_id": 55241,
  "tags": [],
  "title": "Southern Heat, Scene #01"
}