{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This afternoon we brought two recent local finds to join their flavors together and do some cooking together in the kitchen. Logan Robbins is a tall piece of San Diego delight. At 6'2, Logan is ?straight? 100%. We even found out Logan  has a wife, when he went over to our brother site ExtraBigDicks.com. After seeing Logan and that thick dick on our site, the boys on ExtraBigDicks wanted some of that and who can blame them? Logan has amazing dark features set against his pale skin and a hateful club of a dick he uses quite well. Logan is, as he says, 'straight' but...has  lived with a tranny and the more we see him, more sordid details seem to surface. He does ?Gay for Pay? because as long as he's doing it for money he's not ?gay? Whatever gets you through the night, Cutie. Today his ?wife?, one he finally admitted marrying for money & has only kissed once, is at Disneyland waiting for him and riding Space Mountain alone; while Logan is riding a hotter ride??Ass Mount'n?. Sorry, couldn't resist. Jherrad  got his start on EBD and is also from San Diego. He's compact, defined and a Latin hottie. He is ?gay? 100% and jokes about breaking into the ?Str8 for Pay? market even if he'd be the only one trying. Funny how that only works one way with str8 boys able to allow themselves their guilty pleasure for pay, justified in silver. Hmmm. Fortunately, just looking at Jherrad assures us he wouldn't stand a chance playing straight in a school play; let alone straight porn so we can all breath a sigh of relief, sit back and watch him in his natural element?an all male, all cock, pussy free one! Jherrad's about to get more than his stocking stuffed this Christmas. Making out these two begin exploring each other. Logan wastes little time before unwrapping his present, s he pulls off Jherrad' tee and undoes his shorts to free his thick cock. Jherrad has an all over golden tan that most would envy. Logan may be str8 but he loves oral and is usually the first thing on his list. Jherrad lets Logan suck his cock for a few before wanting a better look at what landed Logan on EBD in the first place. He kneels and undoes Logan's jeans and as he does, Logan's huge cock springs out and Jherrad swallows it without a second thought. Logan just moans as Jherrad spit-shines his thick meat as he swallows it to the hilt and comes back off it again to lick and tease it before sliding it back down his throat. Logan is getting hornier by the minute and finally pulls Jherrad off his 8?? meat and bends him over the counter. He gets down and spreads Jherrad's muscular, bronzed cheeks wide before diving in tongue first. Jherrad is in heaven as this straight boy begins to expertly toss his salad. All this tongue action is making Jherrad need a lot more and Logan is more than happy to oblige. After giving his sweet ass a few last licks, Logan stands up and grabs Jherrad by the waist as he begins sliding his cock deep into the spit lubed hole he just got through eating. Jherrad moans as his ass is stretched wide by Logan's baby maker. It isn't long before Logan is fucking Jherrad deep as he grunts with every thrust h e takes. Logan holds him down with one hand as he leans back and watches his thick white dick disappear into Jherrad's dark tanned ass. Logan can't get enough and lies on the floor to let Jherrad do the work. Jherrad bounces up and down on his fat cock as his face contorts in both pleasure and pain. Logan's heavy balls are slowly pulling up as Logan begins fucking up into out latin bonbon. Jherrad braces himself with the counter as he continues riding Logan's fat cock. From there Logan puts him on his back and pounds his ass deep and hard missionary. This position sends them both over the edge as Logan and Jherrad both sit on the floor seconds before exploding all over themselves. ?That was the best fuck I've ever had? pants Logan as he recovers. Kudos for Jherrad and it was definitely one of his hottest with us.",
  "models": [
    {
      "name": "Jherrad Lopez",
      "person_id": 28338
    },
    {
      "name": "Logan Robbins",
      "person_id": 30434
    }
  ],
  "release_date": "2008-12-26",
  "scene_id": 55248,
  "tags": [],
  "title": "Hidden Rush, Scene #02"
}