{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The hot country boy from Virginia Beach, Virginia is back to expand his horizons; his sexual horizons that is. Long haired, light eyed Rocky Charles is back. Rocky is 22 years old and truly bisexual. He has a steady girlfriend who knows what he is into and is still around. Rocky usually loves to do oral with guys and had mainly topped guys when they wanted him to. We were fortunate when Rocky  felt comfortable enough to bottom on camera on our brother site, ExtraBigDicks.com. Tucker Forrest was the first guy he fucked on our site, so he thought it only fair to return the favor. With a face like lil Tucker, who could resist? Well, that scene was insane, watching Rocky grimace while Tucker broke him in. So we decided to have him back on our site and we paired our all-American boy with one of the hottest imports we've had, Mr. Peter Stallion. Peter  was last here over the Summer and left many of his fans wanting more after he fucked Damon Phoenix's hot bubble butt. We figured we'd need to pony up a hot co-star to get Rocky to bend over again for some more back yard prodding. Much to our surprise, the chemistry between the Southern charmer and the European gang-bang porn star surprised us all from the start, putting Rocky at ease and making everyone and everything a little more comfortable ...well almost everything.                       Rocky begins to kiss Peter as he sits on the chair. They fall into each other as they begin to explore each other. Peter's shirt opens up, giving Rocky's tongue access as he begins to sample our stallion's chiseled chest. Peter is immediately drawn to Rocky's ass as he gropes at it in anticipation. Rocky, loving oral with guys, undoes Peter's pants and begins to suck his uncut cock. Peter's thick meat is hard in seconds as Rocky works his magic. Rocky strips, then gets up on the chaise and lies back so that Peter can feed him more dick. He kneels over Rocky's face and face fucks him a bit, then just holds still as Rocky suckles on it like a milk-starved calf. Rocky works his meaty shaft and sucks on his balls as Peter just watches in amazement at what he can do on his dick. The next shot we see is Peter's face in ecstasy. As the camera pans out, we see Rocky's face buried deep into Peter's thick bubble butt. The oral he's getting from Rocky is driving him crazy as he stands up and continues feeding Rocky his meat, slapping his cock on Rocky's pierced tongue. All this action is getting them both worked up, and Rocky knows what our top boy's gonna want, so he decides to give him a preview. He bends over and gives our stallion a show, spreading his sweet ass wide and fingering his tight hole as Peter watches, stroking his fat dick inches away.?Oh SHIT!? Rocky gasps in pain, as he tries to sit on Peter's massive meat. He grabs his thick meat by the base and tries to get his ass to open up for it. He is breathing hard and cursing as he tries to get it to go in. Peter is laughing as he sits back and watches Rocky struggle to take his dick. ?All the way down, C'mon.? he taunts, as Rocky is breathing like he's going into reverse labor. Peter just lies back as Rocky struggles to take his cock. Peter then decides to take matters into his own hands and puts Rocky on his back and starts sliding inside. Rocky grunts out for more lube as Peter continues his anal assault. Peter begins fucking him faster, regardless of Rocky's grunted objections. Peter then puts Rocky face down and slides back inside him; and really starts fucking him deep. Peter's sweet ass rises and falls deep inside as Rocky grunts and groans a combination of ?Awww Fuck?s and ?Unghhh?s. Peter puts a finger in Rocky's mouth as he fucks him to quiet him down. It's hot to watch Rocky immediately start sucking on it like a pacifier as he gets his ass pounded. Rocky can't take much more, and they sit back and beat their meat to climax. Peter is the first to cum, and that tight ass must've driven him wild because his first load hits him in the face. The rest of his boys follow suit as they splatter all over his smooth chest and abs. Rocky isn't far behind as he, too, unloads all over himself. When we asked Rocky how that felt, he laughs as his eyebrows meet with a puppy dog look and laughs out a ?That sucked?. lol We guess Rocky is still more into fucking than getting fucked. Lucky for Peter, he got to go where few men have gone before!",
  "models": [
    {
      "name": "Rocky Charles",
      "person_id": 27956
    },
    {
      "name": "Peter Stallion",
      "person_id": 28080
    }
  ],
  "release_date": "2009-01-09",
  "scene_id": 55243,
  "tags": [],
  "title": "Aww Damn!, Scene #01"
}