{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Trouble is indeed a five letter word. We spell trouble M-A-T-E-O. For those of you who aren't familiar with Mat?o, this 18yo is dually Habanero. He's as hot as the pepper and also from the Cuban city it was named for. Mat?o is back to get his alone time with us. We first saw him jackin together with his high school posse a couple months ago. At 5'5, He's definitely the firecracker at the rally. He's out spoken and undeniably loves being the center of attention. He knows he has the equipment necessary to keep him on the front page. He has been known to flash girls his thick 8? dick in public. Mat?o  lost his virginity at the age of 15. He was leaving the gym and noticed a girl waiting for a ride. He offered her a ride home and once he got her in the back seat of his cousin's car he made his move and she bought the Kool Aid. He got his first blowjob and then had his first train once his cousin realized what was going down behind him. They pulled over and went at it. Mat?o's eyes twinkle as he reports he got anal, too! Seriously! ?How cute is he? Mat?o's is a wild one and not the kind of guy you want meeting your sister. He has gotten into some kinky scenes and has no beef about them. The last girl he was with was loving his bone one minute then clawing him to death the next! ?This is NOT ?sexy??anymore!? he laughs remembering his harrowing ordeal as he confesses she raped him. He loved it! She had him spit in her face. It didn't faze our playboy. He has lots of experience with ?crazy?. One girl even asked him to fuck her toes and nut in her eyes. She wanted to see all hazy once she opened her eyes. Mat?o handled it in stride. ?She was a whore?I loved it!? This Party animal, which idolizes Porn icon Ron Jeremy, is a handful. ...well, he's actually enough for two. So, without further ado...     Mat?o lies back on the chaise as he begins to grope his crotch. His belt is undone as are his jeans to allow his hand to dive into his boxers and awake the beast. His tee comes off revealing his smooth chest and a pair of cinnamon nips that adorn it. Mat?o is naturally smooth and with a few exceptions every inch of his compact frame is tongue-ready. We definitely know Mat?o appreciates a well placed tongue from any willing female. He had a girl lick his ass before and said he'd definitely do it again. Hmmm. Mat?o loses his boxers and we get our first glimpse of his thick dick. Even soft his meat hangs low over his low hangin' nut sack. He takes his act back to the chaise where he gets on all four to tease us with that str8 boy ass of his. He knows that compact Cuban ass is the envy of some and the desire of many. He slowly dry humps into the chaise as we watch his meaty ass rise and fall exposing his furry crack on the upswing. He playfully slaps his ass and looks directly at you while doing it. This fucker's a tease and he knows just what he's doing. He crouches down a bit leaving his sweet ass in the air as he reaches back between his legs to plays with his low hangers. Then just when you thought you'd seen the best of it; he lets his fingers slowly graze his virgin hole. ?CHECK PLEASE!!Mat?o then flips over on his back to give his growing dick the attention it requires. He spreads his thick thighs apart as he begins to jerk off. IN this position we get a better appreciation of his compact frame. His creamy smooth thighs, the impressive 8? dick on him with a furry patch at the base and to it's north his smooth abs and defined pecs that flex and writhe just below his skin as he strokes his dick using both hands to get the job done. The looks on this Baby-faced trouble maker only add to his allure as he bites is lower lip and furls his brows. He swirls his now throbbing cock around like a Helicopter showing off his man meat. Mat?o has done this move many a time in public to get a females attention. We have a feeling it works just fine. Mat?o's dick is getting harder and harder and he knows it won't be long before his fat pinga needs to unload a couple days worth of leche. He sits on the floor and leans back to get comfortable and starts to beat his meat faster. Boys that are all talk never have much to say when they're dick is in their hands. Mat?o's abs and chest are tensing and his toes begin to curl seconds before he unloads. Jet after jet of thick jizz spray all over his smooth chest and abs. Mat?o lies back completely spent as he quietly catches his breath. Someone get the punch and cookies. Its about nap time for Master Mat?o.",
  "models": [
    {
      "name": "Mateo Grande",
      "person_id": 28289
    }
  ],
  "release_date": "2009-01-23",
  "scene_id": 55240,
  "tags": [],
  "title": "8 Gauge, Scene #02"
}