{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Two is company; but three is a party -CircleJerkBoys style! A couple of familiar faces and a new friend to boot is who will be showin it off for us this week. The first one needs no introduction, the 18yr old local Cuban boy, Marcus Guitaro is back. Marcus is back without his gang-bang squad he usually hangs out with. He's apparently expanding his lists of consorts to get into trouble with. The second face is a familiar one to us as well, Mr. David James. David  is 20 and originally from Honduras. He made his debut alongside Marcus last fall in a hot combo that left many wanting more. The third latin flavor in our latin buffet is newcomer Al Tremons. Al is 21 and originally from Cuba. He lives in Miami now and has that hot latin 'papi' look you can't help but take a double look at when you see 'em playin B-ball at the park or volley ball on South Beach. He's lean and smooth and definitely a sweet addition to the mix. Al lost his cherry at 14 to a 22 yr old girl and has been perfecting his craft ever since. He recently had a 3sum with a black girl and a white girl. David blushed as he confessed the hottest thing he'd done recently was fuck a girl on the Lifeguard tower at the beach. Then, Marcus, true to character had to top them all by telling us he got head from the cook at the Denny's where he works on the graveyard shift. At least someone's order was cumming right up! -Order up! Sitting on the locker room bench they each start groping their cocks as they watch a flick to get them going. After a few minutes they begin to slowly undo their belts and get more comfortable. David stands and unzips as Al and Marcus are groping through their pants as they get more comfortable. They slowly take off their clothes, each waiting for the other to go first. David has his jeans down and he's working his cock through his thin boxers as he bites his lower lip. By now all these boys have their hands full and much to our surprise, Al , the shy one is the first to haul out his Cuban cock to give it some air. He strokes his growing bone as his foreskin runs up and down over his shiny knob. David follows suit hauling out his own uncut monster through the fly in his boxers as well. Marcus has his rock hard cock out as well having pulled his underwear over to the side as his dick juts out along his thick thigh. Watching all these str8 boys slowly stroking their cocks is hot as they pleasure themselves regardless of who's inches from them. In no time these 3 are in their birthday suits and it's definitely a sight to behold. We couldn't think of a better way to kick off the year than with three sexy latin studs showing us their Ladies-only equipment only for us this time. They are all smooth and tone and have naturally lean bodies. It's hot knowing that these hot boys usually do this in the privacy of their bedrooms or bathrooms so no one ever needs to know they jack off. They all spread out across the room, some on the floor, on the bench, each stroking their now throbbing meat. Al is flat on his back, his defined body & sexy pit on display as he rests with his hand behind his head. There isn't an inch on this stud you wouldn't wanna taste and that sweet grin of his only makes it worse...in a very good way. Marcus is just above him, stroking his fat Cuban meat on the bench as he lies back and strokes his meat faster. He licks his sexy lips as he focuses on his aching meat. Davis is sitting against the locker inches from Al's head as he too strokes his meat while his smooth balls begin to tighten and pull up. Marcus is jacking faster and it won't be long before he blows. Sure enough, Marcus grunts and as he gasps quietly his thick knob begins to spew thick cum as it pours out of his thick dick onto his sexy tan line. 'I'm gonna cum!' groans Al as he looks down at his cock and slows his stroke to a firmer one bracing for the load that soon blasts all over his abs. David's last man up and he isn't far behind as he leans forward and strokes out his own thick seed. This has gotta be better than any resolution! .....Happy New Year!",
  "models": [
    {
      "name": "Al Tremons",
      "person_id": 28342
    },
    {
      "name": "David James",
      "person_id": 30589
    },
    {
      "name": "Marcus Guitarro",
      "person_id": 28288
    }
  ],
  "release_date": "2009-01-02",
  "scene_id": 55245,
  "series": "Throbbin' Angels",
  "tags": [],
  "title": "Throbbin' Angels"
}