{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have a new face in the studio along with a more familiar one. M.J. Cash, the infamous Texan is back with us. Only steers and queers come from Texas and well, M.J. doesn't really look like a steer at all. lol Twenty three year old M.J. is originally from Houston, TX. He was here a few weeks ago and M.J.  had a hot session with a str8 latin stud, Mario Truillo who was horny enough to let him taste his breeder dick for the first time. M.J. never disappoints no matter what end of the stick he lands on. We first met MJ when he was merely 19 and we can attest he's come a long way since then. He's had many experiences that have given him a better ?appreciation? for man-on-man sex (i.e. group sex in prison showers). That does it every time! lol Regardless, M.J. isn't the shy, somewhat curious str8 boy he was when we found him. ?Obviously! Kameron Scott makes his debut with us as we introduce him to MJ. The chemistry between the two was apparent even before the cameras started to roll. Kameron, however, is not a new face on our brother site ExtraBigDicks.com. The Virginia Beach, VA, native made his debut getting Chinese-cuffed by two hot str8 boys both needing of a warm hole to shove their thick meat into. When asked if he'd ever been with 2 str8 guys, Kameron grinned and said, ?...Not on camera.? We bet. He's tall, naturally smooth, Baby faced and equipped with everything you'd want in an All-American hottie. At 21, Kameron can only get better with time?and he's lookin' pretty damn good already. We can't wait to see a lot more of him.n        They begin sitting on the gym bench facing each other as they explore each other. Kissing passionately, their hands begin to roam and it isn't long before these two are pulling at their belt buckles wanting to get the party started. Kameron stands to help MJ out as MJ tries to pull off Kameron's pants. They both get up to undress and as they do, they begin to make out up against the lockers. Their stiffening cocks are beginning to tent their underwear as they slowly begin to tug on the other's briefs getting them lower and lower as they go. Once the briefs come off, M.J. wastes no time before going down on Kameron's thick jock cock. Kameron moans softly as MJ expertly devours his dick. MJ holds Kameron's hot bubble butt with one hand, his balls with the other as he bobs up and down taking every inch of his dick down his throat. Kameron wants to get a little himself so he kneels between MJ's legs as he goes for it as well. MJ spreads his legs wide open giving Kameron better access to his stiff wood. Kameron licks his balls and savors his meat, taking it all the way down til his bottom lip is pressed into MJ's nut sack. MJ watches in amazement as Kameron works his magic on his cock. These two are really enjoying their oral session and move into a steamy 69 so that they can both have what they want at the same time. Kameron is on his back with MJ's cock in his throat while MJ licks Kameron's cock and begins to explore his smooth ass.   MJ begins to explore more of Kameron's tight ass which is only making Kameron hornier for more than a finger or two. Sure enough, the camera cuts to Kameron's sweet ass as he steadies himself, impaling his tight ass on MJ's thick cock. He moans and groans as he tries to accommodate the massive intrusion. Once inside, Kameron begins to slowly ride MJ. They both moan as they begin to pick up the pace. As good as it's feeling on MJ's throbbing cock, he wants more control. He stands up and bends Kameron over before slamming back inside. Kameron grunts and braces as MJ begins fucking him deep. The view from below is intense as we see MJ's balls slapping Kameron's smooth ass. ?Fuck my ass!? Kameron grunts as MJ obliges with pleasure. The sounds of MJ's ball slapping his ass fill the locker room as they both grunt and groan . MJ can't get enough of Kameron's ass. He has them both straddle the bench and then slides Kameron's ass back onto his dick again. Kameron is bent over holding on to the bench as MJ bounces his sweet ass back and forth using his sweet ass. This does the trick and in no time MJ has to pull out b4 exploding. he busts his load all over Kameron's smooth ass. Kameron isn't far behind and jacks his own massive load all over the bench. Volley after volley of his thick cum shoot across the polished wood. Whew. Now it's definitely time for these 2 to hit the showers!",
  "models": [
    {
      "name": "Kameron Scott",
      "person_id": 28022
    },
    {
      "name": "MJ Cash",
      "person_id": 28245
    }
  ],
  "release_date": "2008-12-12",
  "scene_id": 55251,
  "series": "The Team Won't Know...",
  "tags": [],
  "title": "The Team Won't Know..., Scene #01"
}