{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Anyone in the mood for Cuban cuisine? This week we have much to be thankful for. Four sexy Cuban boys are here to stroke one off for us. These classmates are incredible. Angel Diablo is 18. He's sexy & has a trimmed hairy chest and bedroom brown eyes. His body is tight and defined and comes from Guantanamo Bay, Cuba. Mateo Grande, also 18, is firecracker of sexual energy. At 5'5, this Havana native is definitely the rowdiest in the bunch. He has a big mouth and an even bigger dick. He's not shy about it either and loves to whip it out in public. These two are 'really' good friends with 2 other 18 yr. old Cuban boys we've already met, Mr. Marcus Guitaro and his swarthy cousin, Manny Alvarez. Marcus and Manny were last on our site when they did a double jerk off session together while they recapped tagging a close family friend together. They love doing things together-all sorts of things. They all laugh as they announce that they are only 4 out of the six that make up the elite 'Gang Bang Squad' Marcus had a secret admirer that wanted him so bad she agreed to have sex with Marcus' friends in order to finally have him. 'Sucia!' She had a list of conditions but no matter the terms, the guys were all in. (literally) Angel went first and hit it and Mateo went second. Mateo was hittin' it so hard that it woke up Angel's older brother who was relaxing in the next room. He came out to investigate and to keep the peace they let him in on it. He jumped in right after Mateo. Marcus, the one she wanted finally got her fourth, followed by his cousin Manny bringing up the rear. There was one more willing participant but once he stormed into the room buck nekid and she got a look at his big black body builder frame she wigged. He was not on the guest list. After they were done with her, she had Marcus one more time all by himself. Where were these guys when we went to High School? -All Hail the Class of 2008! They begin groping their cocks through their clothes. Mateo's talking about some girls he jumped on buck naked when he was on a road trip and doing the usual talking horny boys do when they talk smack about their conquests. Angel's the first to slide off his shorts and the rest follow suit. In no time they are scattered around the room playing with their boners either inside their underwear or through their flies. It's hot watching these str8 boys talk about the girls they fuck. They talk about verbal girls and things some chicks have tried to make them do. Marcus wants to make dirty videos with him in them and the list of topics go on. Mateo and Marcus sit by each other up against the couch as they stroke their raging boners. They are making comments on the porn while Manny's throbbing uncut cock hovers overhead as he kneels on the couch. Angel is sitting back doing his own thing. It's those quiet ones you have to be careful with. Marcus and Mateo are talking up a storm while the other two are more reserved and focused on the task at hand. Angel's hairy nut sack bounces up and down with every quick stroke he gives his hard cock. Mateo's meaty dick has a set of smooth low hangers that dangle above his hairy ass crack. The rest of his thick frame is hairless. Marcus is beating his thick cock in short strokes as Manny is laying back completely stroking himself off while listening to the dick talk. They all get up to keep jackin their cocks. They line up and lube up. They laugh as they experience how slick the lube makes their dicks. Now all lubed up they are jackin their cocks in earnest. (as opposed to Ernest-Sorry, Ernest!) Once they get the feel of it and accommodate their throbbing cocks; they go back to jackin their dicks and they focus on the flick to help get their nut. It's hot watching these str8 boys jack their dicks right next to each other without hesitation. The fact that these guys play together in their day to day lives really makes for a comfortable jack off session. Something tells us these guys have done this before. We're thinking they were part of 'The Jack Off Squad' way before they graduated to the Gang bang one. It's now on and they are racing to the finish line. Their faces furl as they focus on being the first to bust a nut. Closest to the glass table, which is their intended target, Mateo unloads his thick cock all over the glass top. Four jets of cream splatter across as he taunts 'I won! I won you guys are slow.' Seconds later Manny is ready to blow as he stands on his tippy toes and unloads all over the table. His thick nut splatters and as the camera shoots from underneath the table we see as their loads hit the glass, splat by splat. Marcus is third as he explodes his batch all over the mess his buds made. Angel's the last to go and he needs to reposition himself in order to bust his nut. He ditches his buds and gets comfortable on the couch. He pumps his cock fast and hard as he bites his lip. His sexy 5 O'clock shadow and furry legs and ass are on display for us while he does. His cock gets harder as his nuts pull tight. In no time our boy Angel is shooting his load all over the place. 'Save the best for last', he grins. With these 4 Cubanitos, there's definitely something for everyone. Unless you're that lucky girl they banged in which case there's a whole lot of everything ending up in one. Ahhh, the visual.",
  "models": [
    {
      "name": "Angel",
      "person_id": 30331
    },
    {
      "name": "Manny",
      "person_id": 28291
    },
    {
      "name": "Marcus Guitarro",
      "person_id": 28288
    },
    {
      "name": "Mateo Grande",
      "person_id": 28289
    }
  ],
  "release_date": "2008-11-28",
  "scene_id": 55255,
  "series": "Everybody Is Cumming!",
  "tags": [],
  "title": "Everybody Is Cumming!"
}