{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Someone check on the status of the toaster cuz it looks like we landed another one. Looks like Jarrett Fox with his legendary cock did the trick in turning out our once ?completely? str8 stud, Derek Princeton. We all thought it was brave when Derek  wanted to lose his cherry in his on cam debut to one of the larger hotties on ExtraBigDicks. We all watched in amazement as Jarrett laid his 8?? pipe ball-deep and 'got it done'! It must've hurt so good because Derek's back...for thirds. He was back to top his first ass on EBD and now he wants more dick from us on CJB. We are more than happy to oblige. Derek is 22 yrs. old and has a live-in girlfriend and he does get laid regularly. His girl loves to put on stripper costumes and negligees to keep their sex life sizzling. The thought of Lingerie perks up our accomplice this week, Mr. Logan Robbins (...but possibly for all the wrong reasons). Logan is 25 and making his debut with us this week. He says he's ?str8 as an arrow??but there's (a lot) more to that story. When asked when he last got laid, Logan asks, ?If a girl is over 200 lbs. is that a whale?? Apparently, Logan's last lay was a full-figured ?friend? of his who he got drunk with. He now laughs in hindsight at his 5'2, portly 200 lbs faux pas; but, Wait for it... 3-2-1?? I did fuck her 2 more times.? Yeeeeah. He does claim ALL the rest of his lays have been beautiful women. That was the ?only? one that didn't meet his strict fuckable female criteria. It was a valiant effort for Mr. Robbins, who tried valiantly to recover from having just thrown his 'friend' under the 'Coyote Ugly' bus, but he never even saw it coming. ?Well, ?I? know you got a thing for transs!?......The look on Logan's face says it all  as our Investigative cameraman gets all up in his Kool Aid. Somewhere Camryn Manheim is screaming ?This one's for the fat chicks!? lol Logan flushes and admits he does get into transs and even lived with one; he's attracted to the female side of them and that yes he did have sexual relations with that him/her woman. ?We're not touchin' that one.These two waste little time before stripping off their tees and opening their pants. They begin to kiss as they explore the other burying their hands into their underwear. Derek Strips and hops on the counter and our ?str8? boy Logan goes right for his growing bone. Derek moans as he gets his uncut cock wet. Logan has done this before as he expertly bobs up and down on Derek's shaft. He swallows every thick inch to the hilt as he raises Derek's leg up to get better access. It's Derek's turn as he hops off the counter and finishes freeing Logan's own growing cock. He yanks down his underwear and goes for it. Logan's eyes close as he revels in the sensation. In no time he's rock hard and Derek is sucking him off. His thick shaft is spit shined as Derek bobs on his knob. Logan's heavy nut sack dangles below. Logan is getting hotter by the second and he pulls Derek up and leans him up against the counter raising one of his legs so he can get at that ass he wants to fuck. Derek can only m oan as his eyes roll back in his head. He grabs at Logans hair, shoving him deeper up his ass wanting every inch of his tongue inside him. Logan's eating his ass out while spreading his smooth cheeks apart. The rimming is insanely hot and it only spells trouble. ?You gotta lick it?so you can stick it.? Can you guess what cums next?Derek's hole needs more than a hot tongue and after Logan lays flat on the floor, Derek straddles him and impales himself onto Logan's massive meat as he begins to ride reverse saddle. Derek grunts and groans as he tries to accommodate Logan's thick dick with each descent. Logan steadies Derek as he holds his waiste and helps bounce him back onto his shaft. Try as he might, Derek can't seem to get all of it in him. Logan wants more control as he gets up and bends Derek over the counter. He slowly pushes his cock back inside as Derek grunts and takes it. In this position, Logan is able to bury his cock deeper and in no time his heavy nuts are slapping Derek's ass. He holds Derek by the waist with one hand and pushes him lower with the other to get a better position. Once in place Logan pounds him deep as he hunches over to fuck him faster. There's still one position that will get his dick even deeper and he's not through yet. He lays Derek down on the floor, kneels between his legs and enters him missionary. He slides his cock all the way inside and Derek is moaning with every deep thrust he gets. Logan's balls are now slapping his ass as his dick gets completely engulfed by Derek's hot ass. Logan leans forward and bracing himself with his hands begins to drive his cock in and out. Every muscle is defined and bulging in Logan's chest, shoulders and arms as he fucks away at Derek. The visual alone is insane. This position is hitting the spot for both boys and they can't hold back much longer. They sit back side by side to jack off their pent-up loads. Derek's the first to blow as his abs tense and he crunches forward, nutting all over his smooth navel. Logan follows suit as he leans all the way back and pumps out his thick load all over his now ?happier-than-hell? happy trail. Whew. That was some hot shit!",
  "models": [
    {
      "name": "Derek Princeton",
      "person_id": 28293
    },
    {
      "name": "Logan Robbins",
      "person_id": 30434
    }
  ],
  "release_date": "2008-11-21",
  "scene_id": 55256,
  "series": "Next Door Crush",
  "tags": [],
  "title": "Next Door Crush, Scene #01"
}