{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "When was the last time you begged for mercy? Well, hold that thought cuz after this week's webisode you'll be beggin us for mercy alright-Evan Mercy. Evan is a 21 yr old blue-eyed ginger import from the Bluegrass state of Kentucky. Apparently tobacco, horses and whiskey aren't the only things Kentucky's managed to get right.  Wait, there's more... His costar today is a blast from our not so distant past, Tony Douglas. Tony is 24 now and he was also born in Kentucky. KY is in the house. With all the lottery winning these days we asked these two if they were to hit it big what would be the first thing they'd get with their winnings. Tony would get a new car for sure; but while Tony was thinking locally Evan was thinking globally. 'My own clothing line' beams Evan. He'd want to launch a brand that would be recognizable world wide. In the spirit of a celebratory toast, we asked these studs what their drink of choice was. It's Jack for Tony who likes it neat; though a splash of Coke works too. Evan once again steals the show, 'Personally I like some stuff that's brewed in the hills; but legally I'd have to say Tequila.' Evan's getting ready to vacuum when he finds a titty mag under the couch. Boner break! He sits on the couch and starts to feel his crotch as he flips through the mag. Soon that cock needs more room as he hauls it out and starts to jack off. Sitting next to the vacuum gives Evan a good idea as he pulls out the hose and flips it on. He teases the head of his cock with the suction of the hose then rubs the hose along his shaft and near his balls. He aims that hard cock back towards the hose and is about to go for it when Tony walks in and takes over. He startles Evan who suddenly has Tony on his knees between his legs. 'You don't need this, Evan' Tony grins as he takes Evan's hard cock in his mouth. Evan just moans as he gets that country cock and balls worshiped. Tony swallows every inch of it as he pleasures his buddy. Evan's cock is rock hard as it disappears down Tony's throat. Evan can't get enough of that hot mouth. He knows girls can't do this anywhere near as well; so when he needs it done right it takes a man to do the job.Tony then slides a rubber on Evan's dick and sits back on it. He gets that dick inside him and then starts to ride Evan in a reverse cowgirl. Evan just gasps at the sensation of Tony's tight ass wrapped around his meat. He starts to slam his cock up into Tony's ass fast and hard making Tony whimper with delight. Evan's balls slap away at that ass as he jack rabbits into his hole. Tony then gets up and straddles that dick again but facing Evan as they go right back to fucking. Tony gets his groove going and gets that ass used to that meat as he grinds down on it sending Evan into orbit. 'Aw just like that' Evan moans as Tony bucks back and forth on that dick. Tony fucks himself silly riding Evan's dick. Evan then gets Tony to stand up and gets a taste of his cock. He works on Tony's meat for a few sucking that dick and licking those balls. Evan then gets Tony back on the couch where he holds his leg up and shoves his hard dick back inside. He lies behind Tony as he continues to rail into his tight ass. He picks up the pace as he slams back into that hole sending Tony over the edge. Tony bust a load all over himself and Evan isn't far behind as he pulls out and shoots all over Tony's ass and balls.",
  "models": [
    {
      "name": "Evan Mercy",
      "person_id": 28494
    },
    {
      "name": "Tony Douglas",
      "person_id": 30766
    }
  ],
  "release_date": "2012-04-27",
  "scene_id": 55252,
  "series": "The Hoover Maneuver",
  "tags": [],
  "title": "The Hoover Maneuver, Scene #01"
}