{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Mike Bollins is back this week and we couldn't be happier to see our new friend from the West Coast. For those of you unfamiliar with Mike, he made his debut with us a couple months back sending many of our members into a tail spin. Originally from Fresno, the 24yo, with an eerie resemblance to a certain singer who shakes more than his just his 'Bon Bon', packs a solid 185 lbs on a delicious 5'10 frame. He hasn't been up to much since we last saw him other than working out, chillin' with friends and fucking a LOT of girls. He finally met a girl who let him fuck her ass. The only problem is, Now that he's had it, he wants it to be a prerequisite for every girl he takes home. He loves petite girls with big tits, and a thick ass she can back up onto his thick 7?? dick. Now there's a visual. (?minus the short chick) Mike doesn't use pick up lines on girls at the clubs. His advice to guys is: ?If you're getting eye heat from a girl; don't be a pussy and go talk to her. Buy her and her friends a drink. Then tell her it was nice to meet her and then walk away. Be a gentleman and let her be with her friends. She'll be back.? Sounds easy?riiiight?!  Not that a ripped body, abs, guns like his, a jaw-dropping smile on that dimple-chinned, boyish face with that ?I'm gonna fuck you stupid? look doesn't help! Mike begins by giving us an idea of how he gets his body in the shape it's in. As he does curls, his biceps contract and flex while Mike's face is focused on his movements. He pulls off his tee and we see our first glimpse at his massive pecs and defined torso. He begins to apply moisturizer all over his smooth body, rubbing it in slowly showing off every delicious inch of his merits. His shorts come off as we see his massive quads and meaty thighs. He pulls his sleeping cock out of his briefs to give it a tug or two before losing his briefs altogether. He lies back on the bench and spreads his legs wide. As he does, his fingers caress his cock, balls and dip down between his beefy cheeks to feel his hole. It's not hard to truly appreciate the landscape on this boy. His body is flawless. Massive thighs that taper up into a small waist before it vees out again, as his defined lats lead your eyes up to his pecs. His chiseled chest is flanked by huge biceps and shoulders and aside from a cropped patch at the base of his now throbbing dick, he is hairless. There isn't an inch on him that doesn't scream ?TASTE ME!? Well, Alice may very well have gone to ?Wonderland??but she never had it this good! He strokes his cock and at full length, Mike's baby maker is a thick 7?? of pussy packing meat. He holds his rigid dick at the base while he works his knob. He decides to make us all sweat and stands up to show off what he knows we want most?his ass! Mike spreads his perfect cheeks for us and coyly looks back at us over his broad shoulders. That's not enough; he kneels on the bench, crouches down and spreads his beefy ass wide with both hands. His smooth ass and hairless asshole are on display as Mike slowly teases and fingers his virgin hole. How can something so hot be SO evil? lol Mike is a heavy breather, sighing and gasping occasionally as he pleasures his dick. He lies back and begins working his meat for keeps. Mike's brows begin to furl and his face contorts as he gets closer. His facial expressions begin to register a resounding ?OMFG!? on the hot scale as he jacks faster. His entire body begins to tense up as his body prepares for an orgasm three days overdue. His smooth balls pull up tight?locked and loaded; his massive pecs flex and squeeze together looking more like chiseled marble and his abs and biceps tense up as Mike grimacing and bites his lower lip. Mike can't hold back anymore. His fist becomes a blur and after a series of breathy grunts and groans signaling the inevitable?Mike explodes. His throbbing dick sends jet after jet of thick baby gravy all over his smooth navel and abs. Whew ...Go ahead. ...Drink it in. (We understand completely.)",
  "models": [
    {
      "name": "Mike Bollins",
      "person_id": 28297
    }
  ],
  "release_date": "2008-12-19",
  "scene_id": 55250,
  "series": "Caught At the Lockers",
  "tags": [],
  "title": "Caught At the Lockers, Scene #02"
}