{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Mario Truillo is back to do our bidding this week and it's gonna be good! Mario for those of you who haven't had the pleasure, was one of our original stable boys that helped launch our site 5 years ago. It seems like just yesterday. Mario never fails to disappoint. It seems he gets hotter every time we see him. Mario, now 25, was last here for a dual jerk off scene with a hot wake board instructor named Bobby Clark. It was hot watching these two str8 studs break the ice and pal around as they beat off side by side. It was definitely a new experience for both studs. Mario has been behaving since he now has a girlfriend back in Colombia. Mario's a horny fuck and admits he gets his fix on occasion and when he can't he'll jack off it but nothing regular. A Miami native, he's just one of the many reasons Miami is as hot as it is?Latinos! This afternoon we invited another familiar face, MJ Cash to join us. MJ is 22 and from Houston, TX. He is in Miami every once in a while and we're always glad when he drops by. MJ  was here a few weeks ago for a steamy fuck session with Justin Wells. It left many wanting more. On that note, ?more? is exactly what we're going to give Mario. Mario has finally agreed to let us give him a taste of what a guy can do on a thick dick. Woohoo?We got him! (Here's your one chance, Fancy ...Don't let us down.) Locker room scene, two hot studs one getting ready to shower the other getting ready to work out. As the clothes come off the initial plans change. MJ wraps his ass in a towel about to showers when he gets a glimpse of Mario's boxers straining to contain his semi erect dick. Mario turns around sensing the gaze and catches MJ staring at his dick. Perfect. No one around to see anything and Mario's got a week's worth he needs taken care of. This kid's mouth's gotta be better than his hand again. Mario squeezes his cock thru his briefs and that's all the go MJ needs. He grabs Mario's cock and goes down quicker than the 'Atocha'. Unlike the 'Atocha' that lost her treasure when she went down in a catastrophic hurricane in 1622; MJ actually found his. Mario's str8 boy cock, considered an unattainable treasure til now, will soon be in for a ?hurricane? of its own; and hoping it, too, will lose every drop of its cargo. Mario gives in, holding MJ's head as he begins to face-fuck him. MJ sucks Mario's throbbing cock like a hungry calf. Mario's in ecstasy as he bobs MJ on his aching cock. Mario then orders MJ to lie flat on the bench and straddles his face. ?Stay right there!?I'll give it to you.? he says hovering over MJ's face. He forces his rock hard meat south with his fingertips and holding it in place descends. He begins to pump MJ's mouth, doing shallow knee bends as he repeatedly buries his meat. ?This ain't so bad after all? he chuckles in amazement. MJ has more in store for our hot Latin fuck. Mario eventually lets go of his cock as he pumps MJ's mouth. It eventually springs free and as it does it springs up like a catapult, leaving Mario's smooth balls inches from MJ's mouth. Seizing the opportunity, MJ darts his tongue back behind his smooth nuts, burying his tongue deep into Mario's virgin ass. Mario gasps, trying to process the new sensation as the hot, wet tongue laps at his virgin ass. Whatever it is, it's making his cock even harder. Mario is now putty in MJ's mouth (so to speak). Mario stands and leans over against the locker giving MJ better access. Mario strokes his aching cock with one hand as he reaches around, shoving MJ's head deeper with the other. MJ sits back against the bench, tilts his head back and orders Mario to sit on his face. Mario backs that sweet ass up without hesitation, bending forward for more. As he does our str8 boy actually reaches down for MJ's cock and starts jerkin it for him. I mean, seriously, MJ can't eat his ass properly and jack himself off too, right? Mario is in heaven and we're assuming really glad he decided to give ?oral? a try. Someone order a toaster for MJ, we may have a new convert. They both sit back to get their off and Mario, a bit over stimulated, is the first to blow. MJ, seated a few inches away on the floor below, is eye-level with Mario's erupting cock as it shoots baby batter all over. The visual alone is enough to send poor MJ over the edge as he, too, busts a huge nut all over his chest. Mario's last words are classic: ?I guess a mouth is a mouth after all!?",
  "models": [
    {
      "name": "MJ Cash",
      "person_id": 28245
    },
    {
      "name": "Mario Triullo",
      "person_id": 28294
    }
  ],
  "release_date": "2008-11-14",
  "scene_id": 55259,
  "tags": [],
  "title": "No One Will Know, Scene #02"
}