{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "All we can say about this weeks stud is ?Whoa?. Hailing form the West Coast, 24 year old Mike Bollins is a fresh face worth getting to know. He's from Fresno, California and with a solid 185 lbs packed onto his delicious 5'10 frame, he's definitely the kinda guy that would easily cause some front end damage...if you drove past him walking down the street. Rubber necking does have its consequences. You know  who you are. He's a down-to-earth guy, loves to chill and works out regularly to stay in shape. A Chicago Bulls fan, he loves to play hoops with his buds on his spare time. This active hottie lost his cherry during P.E. class in a bathroom stall to a girl he ditched class with. ?She wanted to see if it would fit...and it did.? He laughs. What a whore! Lol ...we're not bitter. He has a great all around jock-next-door looks and a body that speaks for itself. He is a definite ass man and loves a nice ass. He laughs when he admits tits are ?extra credit?. Brilliant. He loves adventurous girls that aren't afraid to explore their backyards. He loves having a chance to take a girl from behind and fill em up with his jock cock...and then some. Some girls have all the luck. His best sex to date was fucking a date at a concert way high in the stadium with 15,000 fans watching. Now there's an adrenalin rush. He jacks off at least twice a day and his favorite place to choke his chicken is in front of his computer where all his porn is at. Fortunately for us, he will soon be the porn on our computers so let's get this bad boy nekid... Sitting back on the couch, Mike undoes his jeans and slowly lifts up his tee. As he does he grins as his sweet abs and a tad of the chiseled pecs come into view. He knows he has what you want. He takes off his tee and jeans and gets back on the couch in a pair of loose fitting boxer briefs. Mike's naturally smooth and his chest and abs are well defined. He shows off his thick ass as he slides down his briefs a bit before slapping his ass. Hmmm. Once the briefs come off we see Mike in the buff. All systems prepared for launch. He lubes his cock and within seconds he is at full mast. He spreads his legs wide open as he jacks his fat cock. We can see the lickable landscape he has to offer, As we gaze above his thick cock, we see his sculpted pecs and bulging bicep, as he strokes over hand, his sexy face with a scruffy goatee gazing down in awe of his own equipment lies just beyond them. Gazing to the south of his cock we see his thick hairless thighs, his low hangers and his hairy ass peaking out from its vantage point. There just isn't a bad angle on this boy. He stands up to continue stroking wanting to give us a better view of his cock. He's throbbing b y now and the views from below are mouth watering. His nuts hang below as Mike slowly tugs and caresses his shaft. His ultimate fantasy would be to have 2 mouths on that shaft, one on the tip, another on those smooth balls while a fifth girl rode his face. Mike bends over for us to show us the impossible dream. As he does he pushes his cock back so we can see it while he spreads open his meaty ass and teases his virgin hole. The view's insanely hot. Speaking of hot, all this stroking has our bad boy getting close to pay dirt. He lies back on the couch and starts to jerk his meat. As he lays there with a look of determination dipped in lust, we get a great view of his curvy physique. The sculpted chest, the abs that are now tensing in preparation, his muscular arms and that face. As he gets closer his abs tighten causing him to arch forward showcasing his perfect pecs. His cock is now throbbing as our stud's breathing begins to labor. His eyes close as his head goes back in ecstasy. He begins to moan just before releasing a massive blast of cum up all over himself. The rest of his boys splatter on the delicious canvas below. We need a serious clean up ...any takers?",
  "models": [
    {
      "name": "Mike Bollins",
      "person_id": 28297
    }
  ],
  "release_date": "2008-10-24",
  "scene_id": 55264,
  "series": "Newbie Haze",
  "tags": [],
  "title": "Newbie Haze, Scene #02"
}