{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "If there's any one thing that truly changes man it's time. Time is really the only measure we have with which we can stand back and see just how far we've come and the journey it entailed. Well time definitely changed one of this week's hot studs, Mr. MJ Cash. The last time we saw MJ  he was merely 19 years of age and chasing things with curves. He's now 23 and lots of things have changed. It seems MJ has had his sexual boundaries pushed a lot farther than when we found him. If you're asking yourself, what would bring about such changes in a young stud? Well, the answer, if you've been paying attention, is of course time. And by time we mean ?doing? Time. Seems after a brief stint with the law, MJ landed behind bars where he got a crash-course in the ?A hole's a hole? method of thinking. Those lucky inmates must've been howling the first time they caught a glimpse of his fine ass. Justin Wells, on the other hand, is an upright Southern gent. He's 28 yrs old and originally from Atlanta. He knew after having had his first sexual experience at 16 what he wanted. One try and he was hooked. Justin prefers muscular jock, bad boy types so we paired him up with MJ. Justin's hottest sexual encounter was his first year in college. He had an episode in his str8 frat where a little hazing led to some S&M and spanking. Beer + Str8 frat boys = Hella-HOT! MJ's hottest sexual encounter was coming back after working out with 6 other inmates and being made their bitch in the showers. FUCK Ok, ok ...time's a wasting so lets get these 2 naked. Wasting no time, MJ softly kisses Justin as they slowly begin to undress the other. The chemistry between them is unmistakable and now get to explore it. It isn't long before these two studs are rock hard and in their birthday suits. MJ goes down on Justin's fat cock as Justin softly moans his appreciation. Justin then sits MJ on the floor up against the chaise and then lowers his cock into his hungry mouth. He toys with MJ as he rubs his knob all over his sweet lips before burying it back down his throat. Justin's sweet bubble but looks delicious as he pile drives MJ's throat. MJ takes it ?like a man! (shameless prison pun intended) Sorry, couldn't resist. lol Justin loves the attention but hasn't had a chance to respond in kind. He bends MJ over the armchair and kneels behind him. In seconds Justin buries his tongue deep inside MJ's smooth cheeks. MJ's ass must've been the talk of Cell Block 6 cuz Justin couldn't resist. He laps at his ass like a bear in a honey comb as MJ just moans. The ass is delicious but let's face it, this ass was meant to be fucked. Justin suits up and lubes up MJ's tight hole and, in no time, begins his anal assault. Face buried in the chair, MJ just moans like a bitch as Justin begins using his sweet ass. It isn't long before his ass is slowly milking Justin's cock. Justin slides inside easily as he holds him steady with one hand. He then puts MJ on his stomach; he can bury his Southern Fuck Stick a lot deeper in this position. MJ is loving every deep thrust he's given. Justin slows down as he softly kisses MJ's shoulders. Just when MJ is getting used to the slower pace he begins pulling it out almost completely before slamming it all the way home. It's on again while MJ just lays there doing his best to accommodate all the dick he's given. Justin's fucks him faster, raising his sweet ass up in to a doggie position. Next he has MJ impale himself on his fat cock. Justin's eyes literally roll back into his head as MJ takes every last inch and begins riding him. MJ picked up a few tricks in the big house. DAMN! Justin needs to cum and wants to see MJ's face when he does. He slams back inside him missionary style and pounds him hard and fast. MJ can't hold it anymore and explodes all over. Justin's not far behind as he loses the rubber seconds before unloading a huge glob of hot goo all over MJ's soaked cock. Like a true Southern Gentleman, Justin leans down to kiss MJ even after he's done. End scene.",
  "models": [
    {
      "name": "Justin Wells",
      "person_id": 27944
    },
    {
      "name": "MJ Cash",
      "person_id": 28245
    }
  ],
  "release_date": "2008-10-17",
  "scene_id": 55265,
  "tags": [],
  "title": "Not My First Time..., Scene #01"
}