{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "You'll never guess who came back wanting more of the same? Rocky Charles is back and ready for more man love. At 22, Rocky is the Bi-sexual poster boy. Originally from Baltimore, MD 'Greatest City in the World!' he brags '...at least that's what it says on the benches!' He has a girlfriend who knows what he does and is accepting of his bi-sexual needs. He admits sex with girls or guys is all the same to him. 'A hole's a hole in my eyes' he explains. It's all about the pleasure and who you're with. He prefers oral with guys; but he'll fuck too if the guy wants it. He hasn't really been much on the receiving end; but loves a tongue or a finger in his backyard. Fortunately, Rocky admits he's open to trying a lot more when it comes to guys. It will all depend on who he's with and the chemistry between them. Last time Rocky was here a few weeks ago we paired him up with lil Tucker Forrest  for his first on cam oral scene with a guy. Tucker is from the Midwest and as irresistible as they come. Boyish looks and a man-sized dick; he's as hot a bottom as he is a top. Though he mostly bottoms on camera for us, he is mostly a top in his personal life. He loves masculine guys and admits he's turned on by Rocky being Bi-sexual. It makes him seem more masculine. Masculine guys really turn him on. He can't really say which position gets him off harder, giving or getting, but at the end of the day it all depends on who he's having sex with as well. Gr8 minds do think alike. They begin to get reacquainted, kissing softly as they begin to explore each other. Rocky kneels between Tucker's legs as they make out and commence to undress. As they undress, piece by piece, we begin to see Rocky's inked bod as Tucker begins to lick and taste every inch of it. It isn't long before Rocky's tuggin' at Tucker's shorts that are the only thing keeping him from getting more of Tucker's 8' cock. Rocky goes down on him like an oil rigger, bobbing up and down while Tucker just lays back and watches, moaning in awe at this Bi boy's oral skills. Tucker then gets up and stands Rocky up against the lockers before going down for some cock of his own. Tucker sucks and slurps on Rocky's cock which is growing by the second. Rocky gasps, his head turning side to side as he moans, his sexy locks caressing his face as he does. Biting his lower lip in pleasure, Rocky holds Tucker's head as he guides him up and down on his fuck stick. Tucker definitely knows what he's doing on Rocky's cock and it's driving him mad. He pulls Tucker off his cock and moves the fun to the bench as they begin to 69. Rocky goes back to what he loves doing and as he swallows more of Tuckers meat, Tucker takes his queue out of Rocky's own playbook and decides to give his backyard some attention, licking and sucking Rocky's ass. Rocky follows suit and goes south for a taste of Tucker's sweet ass as they rim each other in a hot 69. Tucker's eyes roll back as Rocky does his thing, licking and then fingering him. Tucker's in overdrive and is gonna need more than a tongue in those sweet cheeks. Tucker gets up, leans against the lockers, bends over and offers Rocky his tight ass. Rocky's all over that and immediately is spreading Tuckers cheeks with one hand and shoving his cock inside with the other. Tucker grimaces as he gets used to Rocky's meat making its way inside. It isn't long before Rocky's moaning and grunting as he fucks him deep. Tucker strokes his own aching cock while taking Rocky's. Tucker wants it deeper and has Rocky sit on the floor and then lowers himself until he's back on that cock again. Rocky moans as Tucker's tight ass engulfs his throbbing cock. Tucker begins to ride him hard as Rocky grabs his waist bouncing him even harder on his meat. This does the trick as they both move to the bench to bust their nuts. Rocky's the first to blow, pumping out load after hot load all over the bench. Tucker isn't far behind and soon blasts his load all over Rocky's mess. First oral, now some hot anal. We hope to get this Baltimore Bi boy to bottom. (say that 3 times when you're fast) We intend to leave him all 'tucker'd out! (pun intended) -keep your fingers crossed. ",
  "models": [
    {
      "name": "Rocky Charles",
      "person_id": 27956
    },
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    }
  ],
  "release_date": "2008-11-07",
  "scene_id": 55261,
  "series": "Long Time Cumming",
  "tags": [],
  "title": "Long Time Cumming"
}