{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We can all be thankful for Boise, Idaho this week, which produced this week's stud, Zack Cook. This is Zack's debut here on CircleJerkBoys but we recently had a taste of him on our brother site MenOver30 where he let us watch him and another str8 stud push their envelope trying their first all-male sexual encounter. Today we get this 20 yr old all to ourselves. His classic jock looks are reminiscent of an A&F catalog and he's an all around guy's ?guy?. He loves Basketball, watching sports with his buddies, anything outdoors and going to bars to pick up chicks that are out of his league. His favorite pick up line?believe it or not?is ?What up, Fool?? He smiles as he boasts it works like a charm. They love a kinda cocky, arrogant guy. It throws them off and they are suddenly the ones wanting to talk to you. Genius! Zack is an ass man and loves ass yet hasn't found a girl to let him do anal. ?No girl will let me do it? he confesses with a pout. We assure him it will happen eventually and he replies ?I hope so, be he a man or a woman? Hmmm. We like the way our young stud thinks. His hottest sex to date was a threesome he joined in on when he came home to find his workout buddy fuckin his girlfriend in his apartment. His buddy offered and he jumped in. He didn't do anything with his buddy though he admits he isn't one to knock a nice body and his workout buddy definitely had a nice one. Zack doesn't beat off regularly and does it about twice a week. He usually prefers to jerk it at home but today he's gonna give us an idea of what that looks like. ...Oh Happy Day! Zack wastes little time before burying his hand in his pants. He gropes himself for a few before he unbuttons his fly and gives his growing cock more breathing room. AS he lifts his shirt over his strong neck, we see his defined abs come into view. His smooth chest adorned by small cinnamon nips sits atop his well-defined abs. Zack's cock is now straining to be set free in his heather briefs. Zack is a moaner as he moans and groans as he feels up his delicious torso and cock. He stands up and loses his jeans and his briefs as well. His cock finally gets the room it's been begging for. He looks angelic as he looks down at his sweet meat and jacks it dry. His full lips almost pout as he pleasures himself. His smooth balls bounce up and down in tune to his beating fist. His fat cock is flanked with a sexy short cropped bush. He lubes his fat cock and sits on the bed and starts to really beat his meat. The view from below is incredible as we get a better view of Zack. His brows furl as he focuses on his throbbing cock. He rolls over on his side and continues pumping his cock into his fist almost as if he were fuckin a tight hole. His moaning and heavy breathing only heighten the already sizzling visual. He then goes on his belly as he continues fucking his fist beneath him. His sweet ass rises and falls as he shoves his cock deep. He comes back up into a doggie position and jerks his cock faster and harder giving us a great view of his virgin ass. His facial expressions are priceless as he beats his meat. From the side we see his definition: his triceps, his lats, his abdominals, they're all rippling beneath his smooth skin. The sight of him in this pose is insanely hot with that beautiful face buried in the bed and peaking out at you from beneath his sexy pit and that amazing ass of his wiggling in the air...schwiiiing! He then gets up and starts jerking off as he kneels on the bed. His face is focused and in a state of rapture as he strokes his now aching meat. ?God, it feels good? he groans. He works his fat knob in circles as opposed to jackin the whole shaft. Our boy has skillz. All this jerkin is getting Zack close to busting a nut and he lays back on the bed to get ready. He spreads those smooth thighs wide as he beats off faster and faster. The closer he gets the more he moans. His upper body begins to tighten and as it does he curls in tight as his fist becomes a blur on his knob. His abs clench and ripple as he nears orgasm. He holds is nuts and as he moans he unloads. His first load catches him off guard splattering across his nose and mouth. He instinctively turns his face as the second shoots past his chest up onto his shoulder. The remaining troops coat his abs. Zack's a shooter and just like before he ends up drenched. Got Milk? ...Zack does!",
  "models": [
    {
      "name": "Zack Cook",
      "person_id": 27884
    }
  ],
  "release_date": "2008-10-10",
  "scene_id": 55268,
  "tags": [],
  "title": "He's A Definite Keeper, Scene #02"
}