{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "?Families that play together, stay together? is the old adage that apparently still rings true. This week, we have Marcus Guitaro  back to show off more of his delicious self. He was featured on our site last month in a combo that left most of our fans screaming for more. This week, he's brought along his cousin Manny Alvarez. Manny is 18 and was born in Jacksonville, FL; but he grew up here in Miami as well. These two are inseparable. Wherever they are, trouble can't be far behind. Thick as thieves, these two finish each other's sentences. From what we hear, they finish a lot of each other's things. Wait for it... When asked what the hottest sexual experience he'd had since we last saw him, Marcus laughed. Apparently, while out on the West Coast for a huge family reunion, Marcus and the clan kids were all having fun at the beach when an Absolut bottle and a close family friend (or cousin) landed him in a pickle. When the alcohol went in, her true feelings came out, and Marcus didn't hesitate to bang her in her room. In the throes of passion, a loud knock was heard, which turned out to be her Mom. What a mess! Marcus hid in the closet while her Mom came in, caught on, bitch slapped her calling her a whore, then found him and gave him some of the same ...leavin' him with blue balls. Little did she know, a couple days later at a party, innocent little Manny would be the next to tag that ass on the ?keep it in the family? reunion tour, and actually go all the way and finish the deed!  Some girls have all the luck. These two begin roping their cocks as they go back and forth, teasing each other about the other's skills. Marcus teases Manny about waiting til his 19th to lose his cherry; but Manny has comebacks of his own. These two are comfortable in front of each other sexually because they've done girls together. Shocker, right? They keep talking about girls and sports as they strip down and work on their meat. In no time, these two are down to boxer briefs and both are tenting some serious wood. There isn't much ?boy? left in these 2 recent grads. Marcus is 6'3 and Manny a comparable 6'1. Must be the Puppy Chow. They strip naked and begin to work their meat. Marcus sits on the bench while Manny kneels and does the same. These two are hot to watch while they make comments about the chick in the vid and how they each would hit it. Calling her a 'Sucia' and how much Cuban ?leche? they have for her. They swap places and eventually end up facing each other, straddling the bench when Marcus teases Manny that his is bigger, as they proceed to mock measure their uncut latin pingas. What we'd give to be a lone tape measure on that set. lol We have a feeling these two are always competing against the other. First it was who lost what and when, then whose dick is bigger than the other. Now, Marcus makes it a race to see who cums faster. They kneel on the floor inches from each other and begin going for gold like there was a blond big booty girl with a French Pedicure across the finish line. Foot fetishes run in the family. Manny's rock hard cock is throbbing. As he gets hornier, his knob grows even bigger. Marcus' cock is getting some of the same as Marcus beats his meat faster and faster, not wanting to be outdone by his cousin. It's hot watching these two str8 boys less than a foot from each other beating their uncut cocks, racing to see who blows first. Am I the only one secretly hoping one's a power shooter?  lol (ok, that was bad!) Manny begins to moan and grunt louder as his cock begins to squirt. His thick seed pumps out and is followed by Marcus', which cums in second. (literally) ?I beat you, fool!? pants Manny as they both bust out laughing. This was a hot set: 2 delicious Cuban boys with no bitch to trick...but Oh what a treat! ?Happy Halloween from CJB.",
  "models": [
    {
      "name": "Manny",
      "person_id": 28291
    },
    {
      "name": "Marcus Guitarro",
      "person_id": 28288
    }
  ],
  "release_date": "2008-10-31",
  "scene_id": 55262,
  "series": "Team Effort",
  "tags": [],
  "title": "Team Effort, Scene #01"
}