{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we are making a little bit of history here on CircleJerkBoys. Today we have Peter Stallion, the 23yr old Czech gang-bang porn star, back in the house. Peter Stallion has made himself quite the name starring in str8 gang-bang flix where he, and a few other dancers, takes on over 150 horny women. Here we thought our workloads were heavy...Damn! He's been featured on our site several times and the last time he was here we talked him into letting another guy taste his uncut cock. Tony Michaels  was the lucky first to go there. ?It was nice...but, it was still not the best because I need to always fuck? he laughs. Well, we digress bringing us back to the cutie we have for Mr. Stallion today. Damon Phoenix needs no introduction. He's starred in over 100 movies at the age of 23. He's the complete package and when he's not dabbling in the adult industry he's actively pursuing med school. Damon  first started over on our brother site ExtraBigDicks and made the crossover to our site recently with?6 degrees of separation may have it?Mr. Tony Michaels as well. Hmmmm, some boys have all the luck. Well, today once Peter gets going and gets his cock wet; he won't have any complaints with Mr. Phoenix. Damon is well equipped to do the distance and the right horny boy is always better than 150 horny girls! Duh! Peter and Damon begin to kiss softly as they break the ice, Damon lifts off his tee as Peter gently licks and kisses his abs. Peter's next as he stands on the couch putting his crotch in position in front of Damon's face as he removes his shirt. Damon wastes no time as he begins to grop his cotton-clad cock and seconds later pulls them off to have his first taste of what the Stallion's packing. Peter lies on the couch to give Damon better access and the look on his face says it all as Damon begins to work his growing cock. Damon comes up after a few to playfully kiss Peter as their tongues intertwine. Peter needs more of that mouth as he gets Damon to lie back and straddles his chest. He slowly fucks Damon's face as Damon greedily bobs back and forth on Peter's throbbing meat. Peter slaps Damon's face with his cock, teasing him a bit before shoving it back down his throat. The chemistry between these two is undeniable. Damon is getting worked up with all the cock he's being fed and his fingers find their way to his ass as he gets his face fucked. Peter notices and bends Damon over to get a better look at that sweet ass himself. He slaps his bubble butt and slips a finger inside to get an idea of what's in store. ?You like that ass?? Damon grunts as Peter sinks his str8 meet inside. Peter grunts his approval as he fucks Damon doggie style. Peter couldn't have asked for a better bottom. Damon's ass is amazing and it's taking its toll on our str8 boy. He's fucking Damon from behind as he gently leans forward to make out with Damon as he takes him. Peter needs to get in deeper and puts Damon on his back, lifts his legs straight up and pile drives him deep. These two look amazing as they go at it. Peter is lost in his desires as he pounds Damon's ass. ?Fuck my ass!? Damon grunts as he's getting fucked silly. Peter leans forward and is now completely crouched over Damon as he fucks away at his sweet ass. ?Slap my ass...Fuck me!? Damon orders, taking it like a champ. Peter grunts and pounds away working up one hell of a sweat. Peter's not gonna be able to hold back much longer fucking at this rate. ?Cum all over me!? Damon pleads. This is enough to send our str8 boy over the brink. He sits back up and gingerly extracts his swollen cock from Damon's tight ass. Within seconds he unloads his hot load all over Damon's freshly fucked hole. WOOF! Damon then sits up and pumps out an impressive load all over himself.",
  "models": [
    {
      "name": "Peter Stallion",
      "person_id": 28080
    },
    {
      "name": "Damon Phoenix",
      "person_id": 28304
    }
  ],
  "release_date": "2008-08-29",
  "scene_id": 55276,
  "tags": [],
  "title": "Bouncing Back, Scene #02"
}