{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we bring you ?The Maine Event?. We have two sexy str8 studs ready to push their envelopes for our whimsy. The first of these two is an All-American, tousled-haired jock that answers to the name of Maine Rogers. For those of you unfamiliar with Maine, Maine Rogers was featured on our site in his first solo last December. If this guy isn't the kinda guy everyone wishes for on Christmas Eve?we don't know who is! He's 5'11 with chiseled features, a well defined bod and a thick 8? fuck stick to boot. After his solo, Maine came back more open minded and had his first all-male set where he got his first taste of the male anatomy. At 25, Maine's ready to explore more and wants to get into a bit of ass play. Who are we to judge? This should be interesting since Maine is a self-confessed Ass Man. Here to help is another San Diego native, Rusty Steele. Rusty is 22 and spends his day at the gym and then surfing on the beach. He's also single and says he's looking to date. He'll take em out on a date but one night stands only. He likes white girls or Latinas and Maine is into bigger girls these days. Just when you think all the hot ones are shallow...?This one's for the fat girls!? Rusty's latest hot experience involved Sex on the beach sans the mini paper umbrella. He was on the beach in the middle of the day, laying pipe when they were caught by the Fish & Wildlife Officer. They high-tailed it back to the car buck naked and made tracks in the sand before the officer could do anything. Now there's an adrenaline rush for ya! Laying on the bed as they start to get themselves hard watching a flick they start groping their cocks. Their tees come off and in no time they undo their jeans and pull them down enough to have easier access. These two studs sit side by side playing pocket rocket inside each of their sexy black boxer briefs. Rusty's hand wanders over to Maine's thigh as he slowly breaks the ice. It does the trick and in no time Rusty is kneeling beside Maine, fingers exploring Maine's ass as Maine strokes Rusty's massive cock. Rusty slides up and drops his cock in Maine's face. Maine can't resist and in no time has his lips wrapped around his new buds meat. Rusty loves the head he's getting and reaches back toward Maine's ass. He fingers it like it were a pussy as Maine just continues to nurse on his dick. Too fuckin hot! They kneel beside each other on the bed as they jerk each other off and grope each other's tight asses. Rusty goes down on Maine for a bit giving him what he'd already received. Maine's eyes close as he gets his meat sucked but it won't last long before Rusty wants more of Maine's mouth on his knob. Maine goes back down, and while lying on his stomach, takes Rusty's thick cock back in his mouth. Rusty again is free to explore Maine's sweet ass. He reaches down his back and ends up squeezing those hot cheeks and caressing his hole again as he plays with his cock. Rusty has plans for this ass as he pulls out a small vibrator. He is in heaven as Maine allows him to have his way. He invades Maine's virgin hole. As he slips his little friend deep inside only to pull it back out again. He gently bends over and laps at Maine's ass with his hot pierced tongue. The combination is overwhelming and it makes Maine want even more. Maine lies back as he lets Rusty work a second toy up into his sweet hole. Rusty gladly slides the even larger prod up his buddy's ass. He fucks him faster and faster hitting Maine's prostate just right. Maine doesn't stand a chance and it isn't long at all before his thick cock explodes all over himself. His first load gives him a thick pearl choker as his now cum-covered neck begins to drip. It's Rusty's turn as he sits back on the bed and start to beats off. Maine caresses Rusty a bit as he watches him beat his neat. Rusty won't be long and is shooting all over himself in seconds. His thick load spooges out, pooling on his smooth abs. C'mon, you just gotta love curious straight boys!",
  "models": [
    {
      "name": "Maine Rodgers",
      "person_id": 28276
    },
    {
      "name": "Rusty Steele",
      "person_id": 28300
    }
  ],
  "release_date": "2008-10-03",
  "scene_id": 55270,
  "series": "Craving More",
  "tags": [],
  "title": "Craving More, Scene #02"
}