{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Southern Hunk, Jason Talon has found his way back to our studios after his last ?episode? on CircleJerkBoys. Last time he was here, Jason was more than a little reluctant to let another guy suck his dick, so reluctant he picked up and walked off. In this case, hottie Kirk Cummings, eager to give it a go, was left behind wandering what was going on. After some strong words of ?encouragement? (i.e. put out ...or get out) he decided it was in his best interest to follow through with the deed. After all, it would be a long walk to the airport. Once things got started, Jason ended up fucking Kirk's face like a wet snatch and ended up busting his thick nut all over Kirk. He admitted it wasn't as bad as he thought. In the last few weeks he's been getting ready to go back to school. He's majoring in Biology with his mind set on one day becoming a doctor. After a few weeks to think it over he called us back wanting to do ?whatever?. He basically wants to give fucking a guy in the ass a shot. We figured to make the transition easier we'd get Kirk back to help out. Kirk loves taking str8 dick so he was all over that. Kirk, too, has been getting ready for school taking psych classes. He wants to be a Sex Therapist when he grows up. He's still single and hats all boys equally! Meanwhile, back in Virginia, Jason's trusting girlfriend thinks he's come back to Cali for yet another business trip. If only she knew...This shoot starts off with a lot less tension than the one before. They strip their tees off as they grope themselves. In no time the jeans come off and Kirk, who's already rock hard, immediately begins to fondle a now willing Jason. He peels off his underwear to get at that cock of his. Jason's in heaven as he fucks up into Kirk's expert mouth. His face tells us everything we need to know. From there as they go to switch positions, we encourage Jason to give it a shot himself?and he goes for it! Kirk's eyes light up in amazement as the str8 boy takes his first cock in his mouth. Kirk guides him through it as he does. ?Suck it harder...yeah like that? he coos as Jason bobs up and down on his fat cock. We tell him to suck on Kirk's cock the way he'd want his girlfriend to suck on his. That was all the direction he needed as he grinned and went right back to work. From there Jason gets Kirk on all four and starts eating his ass. His tongue dives in and out of Kirk's smooth ass while Kirk moans in ecstasy. He knows if he's getting his ass eaten out there's only one thing left to do to that sweet ass of his once he's done...FUCK IT! Kirk is on his back holding his legs up in the air as Jason aims his throbbing cock towards his wet hole. He shoves inside with the grace of a bull in a China Shop. He wants in. Kirk tries to brace himself and grimaces as our straight boy start fucking him hard. Jason's sweet ass looks hot as it rises and falls as he fucks away at Kirk's ass. Kirk is now grabbing at Jason's ass pushing him further inside him as Jason's heavy balls bounce on his ass. Jason is loving it as he just pile drives into our willing bottom boy. They change positions as Jason puts Kirk back on all four and enters him from behind. He holds both of Kirks ankles as he fucks his ass deep and hard. Jason's face is in rapture as he plows Kirk's ass, the sounds of his balls and cock slapping Kirk's ass fill the room co-mingled with their grunts and groans. Jason's holding Kirk down as he continues to use his tight ass. Kirk wants more control as he sits Jason down and rides his cock. He bounces up and down, grinding his sweet ass on Jason's fuck pole. It isn't long before this straight dick, hitting the right spot, makes Kirk blow his wad all over himself. Jason isn't far behind as Kirk, still straddling him, feels Jason's straight load blast all over his balls and freshly fucked ass. They're both spent when Jason comes out with ?It's just like fucking a girl!? he sighs. If that wasn't classic enough, the ?Oh HELL No!? look on Kirk's face was.",
  "models": [
    {
      "name": "Jason  Talon",
      "person_id": 28302
    },
    {
      "name": "Kirk Cummings",
      "person_id": 30504
    }
  ],
  "release_date": "2008-09-12",
  "scene_id": 55273,
  "series": "Finished Biz",
  "tags": [],
  "title": "Finished Biz, Scene #01"
}