{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have 'lil Tucker back in the house this week. Tucker Forrest, the hottie that proves that big things come in small packages is definitely a fan favorite. Last time he was here had a hot set with Malachi  that left our viewers wanting more. So, we brought him back to break in one of our latest finds, Mr. Rocky Charles. Rocky is 22 and originally from Baltimore, MD. He's tall and lean and has a great smile and a sexy goatee that just confirms he's trouble. His long honey brown locks and hazel green eyes would make anyone take a second look. He has a girlfriend that knows what he does and is accepting of his bi-sexual needs. His first experience with a boy was in the 10th grade when he lost a bet to his girlfriend's gay best friend. Who knew losing a game of pool would open his fly and then open his eyes to what the other boys were packin while in the showers after practice. ?It was the best blowjob I'd ever gotten' he admits '...then it evolved from there and now I need both? He doesn't have a set type but he's turned on by intellect. If they can't carry a conversation he's not sticking his dick in 'em. Tucker laughs as he admits he often prefers dumb boys cuz you can do what you gotta do and send them on their way. ?It's the smart ones you have to talk to!? he laughs. I guess Tucker's all about the big cock and the small talk. Well, who could blame him? Kissing softly these two begin their exploration as little by little they begin undressing the other. Rocky licks Tucker's chest as he begins to explore his smooth body. He has Tucker lay back as he kisses and licks down his torso til he reaches his jeans where he undoes them to get better access before dropping his own. They go back to making out in their underwear as Rocky slowly slides Tucker's brief down to get at his smooth ass. They lose their underwear as quickly as they did their jeans before relocating to the couch where Tucker begins working on Rocky's growing cock. Rocky has ink scattered all over his chest and arms: a sun on his shoulder, an Egyptian ankh on his forearm and a Chinese character on the small of his back are among them. Rocky moans as he fucks Tuckers mouth while straddling him on the couch. Rocky wants some too so he sits Tucker in the armchair and goes to town on Tucker's 8? bone. Tucker moans as out Bi-boy bobs up and down on his throbbing meat. That's getting Tucker hotter by the second and it isn't long before he has Rocky bend over the same armchair to give his sweet as a proper rimming. Rocky moans as Tucker buries his tongue deep. Rocky can only moan and reach around to push Tucker's head even deeper into his hole. Rocky wants some of the same so he has Tucker lay back so he too can have a taste of Tucker's bubble butt. Tucker moans at the feel of Rocky's hot tongue couples with the sensation of his tongue piercing. Rocky's thick tongue expertly laps out at Tucker's ass like he's been doing this his whole life. He darts in and out and runs his hot tongue the length of Tuckers ass causing Tucker to go crazy. They then reposition themselves into a hot 69 where Tucker's choking down Rocky's pole and Rocky is still eating ass. Rocky alternates between Tuckers well worn hole and his throbbing cock. They're getting close to blowing t heir nut so they lay back and jack their cocks off. Rocky lies back on the couch and jacks like a rabbit while Tucker is doing the same on the floor by his side. Rocky's the first to nut as his tone abs and furry chest begin to contract. He pumps out his thick cream in volleys landing on his hairy inner thigh and pooling at the base of his cock. Tucker isn't far behind once he sees Rocky explode. Tucker moans as he too explodes all over his smooth navel. These two are now spent but we have a feeling they'll be back on set doing a lot more than jackin...and soon!",
  "models": [
    {
      "name": "Rocky Charles",
      "person_id": 27956
    },
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    }
  ],
  "release_date": "2008-09-26",
  "scene_id": 55271,
  "tags": [],
  "title": "Orally Fixated, Scene #01"
}