{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we brought back sexy Jason Talon, the hot 26 year-old str8 boy from Virginia. He currently has a girlfriend who's been taking care of his needs, and last week was the first time he jerked off in 2 years. You see, last week, Jason  was featured in a hot combo in which we hinted we'd be putting him together with another guy to see what would happen -even if it's just jerkin off side by side. 'Yeah, We'll talk about it.' He replied with one eyebrow raised. They always fall for that one.  Well, here we are, and we just happen to have another guy to do a scene with our apparently hesitant str8 boy. Well, we felt bad making him jerk off when he's obviously used to having someone else take care of it for him. That 'someone' we brought to help us out is sexy Kirk Cummings. Kirk  is no stranger to our sites. He has been featured on both our brother sites ExtraBigDicks and BoyzParty. Those baby blue eyes and fat 8' cock make quite the combo. As they sit next to each other, Jason looks apprehensive as we get reacquainted. Kirk confesses every guy he's ever been with has been 'straight' so he doesn't believe straight men exist. If that's not an ice-breaker, we don't know what is! Sadly, Kirk, str8 men never wanna date, they just wanna fuck your mouth when they're drunk. 'I'm not drunk!' chimes in Jason (though he wishes he was at this point). We figure we got nothing to lose but a couple of loads, and we like them odds! We figure once we get these two jerkin' off side by side, things might take a turn for the better. Even Pasta's 'str8' ...til it gets hot! Step 1: Bring unsuspecting Str8 boy to a gentle boil, Step 2: Seduce. Step 3: Enjoy!As we start off and ask them to take off their tees, Jason already has a nervous grin on his face. Kirk immediately pulls his off, compelling Jason to follow suit. From there, we see Jason and Kirk shirtless side by side, groping their chests and crotches. Jason's eyes are glued on the titty porn in the distance as Kirk can't help but blatantly eye his str8 prize like a famished cheetah about to descend on a clueless gazelle. You just know any minute this is gonna get really good! Ugh ...Where's that voiceover guy when you need him? Kirk sticks to his 'Monkey see: Monkey do' tactic as he pulls off his jeans. Jason again has no choice but to do the same. Kirk's eyes are trained on Jason's every move. His tactic is working brilliantly, and soon he'll have Jason right where he wants him. They are now stroking their cocks through their underwear as Kirk hauls his out and plays with it where Jason can see it. Jason reluctantly pulls his boxer briefs down far enough to take his own cock out. Kirk is working his hard cock now while Jason, visibly nervous, is still at half mast. Kirk strips completely, making Jason do the same. He's got him. Now all he has to do is wait for the right moment to strike. Kirk angles into position, and when he has an opening ...he goes for it-only to have Jason bolt! 'I'm str8 I can't do that, man' as he literally picks up his stuff and heads out. After some strong coaxing from us and an ultimatum he wouldn't enjoy he begrudgingly agrees to let Kirk suck his cock.He heads back in with a defeated look as he drops his jeans and sits back to let Kirk have his way. Kirk wastes no time and immediately starts working on Jason's now-growing bone. Jason's initial look is vacant as he grins and bares it. That look, however, isn't long lived. In no time, his eyes are shut and his mouth gaping as he gets his cock worshipped. He repositions himself, kneeling to give Kirk better access, as he starts to face fuck our lean cutie. When asked how it feels, his heavy hangers never stop bouncing on Kirks chin, as he mumbles 'Feels alright'. Apparently Kirk was better than he expected. From there, Kirk flips over on his back and offers his mouth and throat up again to our first timer who wastes little time before going down on all four over Kirk in order to fuck his face deeper. His hot ass and taught waist rise and fall as he fucks Kirk's hot mouth like a twat. The oral proves hotter than expected as he pulls out and kneels over Kirk's face pumping his thick nut all over Kirk's face. Kirk's beaming, face-covered in load and Jason has a spent look on his face. He then reluctantly admits it was better than he expected. -No Shit!?",
  "models": [
    {
      "name": "Jason  Talon",
      "person_id": 28302
    },
    {
      "name": "Kirk Cummings",
      "person_id": 30504
    }
  ],
  "release_date": "2008-08-08",
  "scene_id": 55279,
  "series": "Oral Fixation",
  "tags": [],
  "title": "Oral Fixation, Scene #01"
}