{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "?Viva Italia! Roberto Carnivelle, our dark, swarthy Italian import is back. Since we last saw our Italian personal trainer and fashion model, he has gained a whole new appreciation for Miami and all it has to offer. ?The Best women are in Miami, I promise you? he beams as he tells us about his latest conquest. He met a hot black girl in the pool of his building and they ended up hooking up. She gave him the best blowjob?ever! ?I'm only 22 but it was the best blowjob of my life.? He blushes. Awwww. He has so much left to learn. Besides, we all know Boys do it better. Roberto  is all about the oral. That's his favorite thing to do. There's nothing better than getting his fat cock swallowed by a horny bambina. He got his first blowjob at 17 and says it was a memorable experience; mainly because the chick was all teeth. He's come a long way since then and in his world travels we are fortunate enough to have him back again while he's in South Florida to show us his chiseled, inked frame; sexy face; amazing ass and that thick money maker. Wearing tight jeans and a cut off tee, Roberto begins to strip. As he peels off his shirt we immediately see the definition in his smooth torso. A heavy silver chain adorns his neck as it draped between his defined pecs. He unbuckles his belt and slowly slides them down leaving him in a sexy pair of D&G briefs. A sexy tattoo of a kiss or ?bacci? is just above his waistband where we're sure many women have kissed. He pulls down his briefs to start stroking his thickening cock. His uncut meat is quick to respond as it begins to come to life. He turns around as he peels down his briefs showing us his sweet ass. Above his ass in bitch tag land, Roberto has an intricate tattoo of 2 sparrows in a field of stars holding a banner that reads ?Only God Can Judge Me? Makes you wonder just how bad a bad boy he really is. By the time he turns back around for us his cock is throbbing. He jerks it with one hand for a bit before double-fisting his meaty shaft. His naturally smooth balls are pulled up tight as they bounce back and forth to his stroking. He then takes his session to the floor as he leans back on the lockers. He massages his loaded balls as his cock, standing straight at attention, does circles in time with his massaging. He pulls his heavy nuts down as his cock bounces about freely. They immediately recoil back below that thick shaft of his. He stands up and continues stroking his cock as we get different angles of our Mediterranean model. His face, with his classic features, brooding eyes and pouty lips just adds to the visual experience as he focuses on the task at hand. He squats as he continues playing with his uncut cazzo. His facial expressions are a tell-tale sign of what's to come as his eyes glaze over in ecstasy. He lies back, propping himself on one arm as he jacks his cock faster and faster. His lean body looks amazing sprawled out in contrast to the dark wood floor. He moans and his breathing intensifies suddenly as we see his cock explode. Thick lava shoots way across the floor in 3 huge blasts. The rest of his creamy load lands on the floor beside him. Roberto lies there, glistening in sweat, as he strokes out the last remnants of his batch. It's a wrap. ?Ciao Bello!",
  "models": [
    {
      "name": "Roberto Carnivelle",
      "person_id": 28307
    }
  ],
  "release_date": "2008-08-15",
  "scene_id": 55277,
  "tags": [],
  "title": "Lunch Time Strokin', Scene #01"
}