{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "For many, ?3? is a magical number. Its importance in both Roman and Greek cultures is unquestionable. Its obvious effect on Western and Eastern cultures are apparent. Even mythology was influenced with triads of deities; the hydra with 3 heads and even modern day Christianity and its belief in the Trinity. Even when a celebrity kicks the bucket we say ?Wait for it?They all go in threes!? Wanting to conjure up a bit of ?magic? ourselves, we decided to create a divine triad of our very own. Three defined, young, sculpted lads have cum together (pun intended)  to make more than magic happen for us here on our set. They have all been with us before, and have each created quite the reaction when they were unveiled. Jay Martinez, the 19 year old Latin beefcake is our first, and he's back with his 19 year old buddy Rico Salazar. Makes you wonder what they're feeding boys these days? These two 6'1 papi chulos already have a hot dual jack-off session  under their belt, which hit the site a few months ago. To add the finishing cream to our already sweet treat, we've added one more latin flavor to the mix, 19yr old Loco Rios. Together, they make the key ingredients to the delicious dessert we've brought together for you this week: ?Tres Leches! (Three milks) ?Mind in gutter in ...3 ...2 ...1 Enjoy!     The grope session is off as they each begin to feel their cocks through their jeans. You can hear the str8 porn in the background as they begin to undress little by little. Jackets come off, and pants get undone, as they begin to get more comfortable. Rico's the first to drop his pants, and the others follow suit. It's amazing watching three totally straight boys sit side by side as they begin to grope their growing meat, almost as if they were the only ones in the room. In no time, the three are standing beside each other, playing with their tenting briefs. They all turn around and show us their forbidden ?ass?-ets. They each have nice meaty rears that would make many mouths water. By the time they turn around, their uncut cocks are swingin' freely. Jay playfully shows off his fat cock as he swings it side to side. His fat cock got him out of a ticket recently when he was pulled over by a lady cop that needed more than just his license and registration. ?Can't say we blame her! As they stand in all their glory stroking their cocks, you get a better appreciation of their cinnamon-toned Latin bods. They each take a seat and continue their circle jerk to the pussy flick before them. As the cam pans around the room, we get each one individually as they stare into the cam, almost as if they know what you're thinking as you watch them, probably doing the same thing they are. Each of their smooth nuts hang low, aching to be unloaded. Their glistening knobs are gearing up for the event as well as they lube up naturally. They swap positions and continue to jerk off their meat. They won't be able to last much longer, so we give them a dish to plate their ?dessert?. As they kneel and jack faster, their cocks are throbbing and they are focused on release. Rico is the first to bust his nut, signaling his nut with a playful ?Peace out, kidz!? The other two can't help but laugh as Rico leans in and pumps out his thick nut onto the plate below. Once he's done, the others jerk harder. Seconds later, Loco shoots his nut, having to lunge forward cuz his first batch missed the plate altogether, but the rest made it just fine. Jay is the last one to nut, and his first load shoots far enough to reach the plate, but the rest of his huge load went everywhere else. He was too caught up in his orgasm to care. There's always one in every kitchen that just doesn't get the whole ?presentation? thing. With boys this hot, who really cares? This ?magical? episode of Latin dessert making was definitely a Charmed one! ?Check Please!",
  "models": [
    {
      "name": "Rico Salazar",
      "person_id": 28273
    },
    {
      "name": "Jay Martinez",
      "person_id": 28305
    },
    {
      "name": "Loco Rios",
      "person_id": 28308
    }
  ],
  "release_date": "2008-07-25",
  "scene_id": 55282,
  "series": "Triple Crossed",
  "tags": [],
  "title": "Triple Crossed, Scene #02"
}