{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have an Italian import by the name of Damian Lazan. Damian is 25 years old and now lives in the Sunshine State. He loves blond girls, Cuban girls, Spanish girls, Italian girls and with such a vast variety of pleasures it's a good thing he is in South Florida where the hot women abound. He has sexy bedroom brown eyes and long dark locks that set him apart from the competition. He's definitely an ass man & that's what he loves most on a woman. He loves to lick it, finger it, fuck it you name it and says eventually most will let him tag their asses. He isn't selfish though and is willing to let a woman spank his ass and lick him all sorts of places. His ultimate fantasy would be to be with 5 women at a time and if some of those were porn stars he wouldn't mind one bit. Horny little Damian started jerking off at about 11 or 12 years of age and smiles when he admits he still needs it at least  once a day. Lucky for us, this long haired Latin lover has yet to stroke one off this afternoon; so we're just in time for the matinee. Damian slowly begins groping his crotch as he feels his smooth torso. He pulls off his t-shirt and lets down his hair. His long brown hair cascades around his neck resting atop his shoulders. With locks like these Damian reminds us of one of those swarthy romance cover models. He loses his jeans and sits back in his sexy black briefs to continue teasing us. He licks his finger and gently rubs his cinnamon nipples with a seductive look on his sweet face. His other hand is busy groping his growing cock as it slowly comes to life. He's had enough of the teasing and decides it's time to show us a little more. He lies on his back and, after a little more teasing and groping his cock, pulls off his briefs. His body is sexy, mostly smooth with light hair on his legs and near his navel. He loves to work the camera as he looks right at you and gives you his sexiest gazes. Damian then takes the show to the lounge chair where he throws one leg over the arm rest and goes to work on his cock. He settles in for a good wank as he starts jackin' his cock faster. His smooth balls bounce in time to the action upstairs and he continues licking his fingertips and working his nips. His cock is rock hard by now and he's moaning softly as his breathing begins to deepen. He looks erotic as he works his chest, his balls and that Italian cock working himself up to bust that sweet nut all over. His body begins to tense up from time to time and the looks on his face as his mouth opens wide in ecstasy signal the impending release isn't to far off. He begins to thrust harder as his sweet ass lifts off the chair, he begins to moan and groan and as he arches into the air he lets out his first of several volleys all over his happy trail. Load after load splatter below completely coating his happy trail. ...Happy, Happy trails to you!",
  "models": [
    {
      "name": "Damian Lazan",
      "person_id": 28313
    }
  ],
  "release_date": "2008-06-20",
  "scene_id": 55288,
  "series": "First Timer",
  "tags": [],
  "title": "First Timer"
}