{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Papa Bear is back! Coby Jones our 23 yr old, furry, married boy is back! Coby  was here a few weeks back needing to make some money to take out his new girl on their 1 month anniversary. He's 5'10 has an amazing smile and a quick wit to match. His personality is as hot as the rest of him. Last time he was here he confessed he had had an experience with another guy while he was in the Navy. One drunken night at port gave one lucky seaman the chance to get at his ?sea-men?. Coby grinned and said ?It was pretty good!?. Well, that left many of us wondering what that would've looked like; so we decided to have him get head from a boy for the first time on camera. Robby is a hot little small town boy from Ohio out in LA visiting friends and working a bit and trying his hand at porn. Robby was first featured on our brother site ExtraBigDicks.com where he did a lot more than oral with horse-hung Enrique. Today, Robbie's gonna be the second boy to ever taste Papa Bear's meaty str8 boy cock. We're sure Robby will do us proud and remind Coby who's not ?drunk? this time ...that you can't have a girl do a man's job! Coby pulls off his tee and begins to rub his furry belly and chest and within minutes undoes his jeans and pulls them off. He sits back down in his ?Get Lucky? shamrock boxers. ?Are you alright?? he asks Robby who seems a tad hesitant and still wearing his jeans. Well, there's a switch. Usually it's the gay boy asking the str8 boy if he's alright. Coby must have fond memories of that night he ?doesn't remember? because he is rock hard and ready to go. His boxers have come off and he's stroking away at his boner wondering what's next. Robby is playing catch up as he peels off his underwear and starts to play with his cock as well. Coby smacks his cock up against his hairy navel a few times almost as if he's taunting Robby to come get some. It works and a couple minutes later, Robby reaches over and grabs his throbbing cock. Coby just smiles that 'kid in a candy store' smile of his and lets Robby take the reigns. Robnby leans over and spits on Coby's meat as he strokes it sending Coby's eyes rolling back. ?it's feeling really good ...really good.? he says. That's all the permission Robby needs as he leans over and goes for it. Coby moans his approval once Robby starts bobbing up and down on his aching meat. Coby has his hand on the back of Robby's head as he bobs him up and down on his baby-maker. Robby gets on his knees in front of Coby to keep worshipping his cock. Coby is guiding his head all the while. ?Aww fuck, that feels good.? he moans as his cock gets swallowed to the hilt. ?Get on the floor!? Coby orders as Robby quickly obliges. Once on his back, Coby lowers his thick meat into Robby's mouth and begins to face fuck him; sinking his dick deep in Robby's throat. We get an amazing view of Coby's sweet ass in action as he fucks face. This is gonna get our str8 boy a little more worked up than he expected and after several minutes of bouncing his cum-laden nuts on Robby's chin he's ready to bust a nut. He gets Robby up on the couch and straddles his chest seconds before unleashing his huge load all over Robby's smooth chest. Robby smears Coby's hot load all over his chest as Coby catches his breath. ?Maybe it was pretty good, I don't know?? he chuckles sarcastically flashing that smile again. Oh the irony. Guess he won't be using the ?I was drunk? story any more. We now have proof to the contrary?some really hot proof!",
  "models": [
    {
      "name": "Coby Jones",
      "person_id": 28311
    },
    {
      "name": "Robby Woods",
      "person_id": 28312
    }
  ],
  "release_date": "2008-07-04",
  "scene_id": 55286,
  "tags": [],
  "title": "Under 1 Roof, Scene #02"
}