{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It's a CircleJerkBoys reunion this week with two of our favorite alumni back with us for one hot after-class fuck fest. Damon Phoenix, the thick, all-American muscle boy comes from the ExtraBigDick campus where he's been featured stud-stuffing with his thick tool. His baby face and rockin' bod have been featured in several movie titles he has under his belt. From our alumni, we brought the angelic faced Cubanito with a dose of Bad boy, Tony Michaels. Tony was last seen showing our str8 import, Peter Stallion, that boys do give better head. Both of these studs have been ?relaxing? since we last saw them; with either nothing new to report?or nothing they want to share! So, we decided to put Damon on the spot about his ?hobby? and blushed as he admitted to being a huge Star Trek geek. He loves the original series which had a message behind it about critical everyone working together as a people. Set in the 60's during segregation, the show pioneered the way & broke many racial and cultural barriers, aired the first interracial kiss and created pivotal roles for its day (i.e. the first black female in a supporting role, Lt. Uhura; an Asian (and then closeted) helmsman, Sulu; and a Canadian born Captain, James T. Kirk.) It was this kind of thinking that helped him decide to get into medicine which he's actively pursuing. Tony has no idea what he wants to be when he grows up; but we have an idea once he gets a look at what's in Damon's pants...he'll know exactly what he wants to do?right now! Enough said. Clad in towels, Damon and Tony start off kissing in the locker room. They slowly explore each other's bodies as Tony starts to kiss lower and lower. It isn't long before Damon's towel has come off and Tony's found something he wants to do more than kiss. Tony goes down on Damon as Damon playfully looks right at the camera and winks his approval. He's trouble this one! Damon's loving the oral he's getting but wants some himself so he and Tony maneuver into a steamy 69 on the floor. We get to see views of Tony's sweet ass as Damon nurses on his sweet Cuban cock. The chemistry between these two is obvious and sooner than later they're ready to take it to the next level. Damon playfully teases Tony's smooth ass with his thick cock a few minutes before suiting up and sliding his baby maker deep inside. Tony grunts and groans as Damon begins his anal assault. They're both very verbal as they continue their anal session doggie style. The looks on Tony's face say it all as he gets fucked hard by Damon. They move it to the lockers as Tony bends over this time and gives Damon access to more of his sweet ass. Damon doesn't hesitate to get back in as he slowly glides his throbbing meat home. In this position we can truly appreciate Damon's insanely hot ass. He has a meaty bubble butt that just screams ?You know you want me!? Both of these studs have great backsides. Tony arches his back, raising his ass higher to get more of Damon's dick in him. He's loving the fucking he's getting. From there they go to the floor as Damon sits back against the locker and Tony squats down on his big cock. Tony now has all the control and begins to ride Damon like its going out of style. His face grimaces in part pain, part pleasure as he takes every thick inch of meat he can get. Damon's eyebrows furl as his face is overcome in ecstasy. His smooth balls bounce just below Tony's as he fucks his tight hole. All this fucking has gotten them both worked up and it wont be long before they need to bust a nut. They sit back and start stroking their cocks. Tony's the first to bust creaming his milky white navel with even more cream. Damon is the next to blow as he stands up and jacks off all over Tony. His load blasts everywhere as he grunts and moans coating everything from Tony's face to his cum covered cock. Whew. ...Shower time!",
  "models": [
    {
      "name": "Tony Michaels",
      "person_id": 27902
    },
    {
      "name": "Damon Phoenix",
      "person_id": 28304
    }
  ],
  "release_date": "2008-07-18",
  "scene_id": 55283,
  "series": "After 8th Period",
  "tags": [],
  "title": "After 8th Period, Scene #01"
}