{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "?In Prague, it's cold right now, and that means too many clothes. I like to be naked as much as possible? is the declaration Peter Stallion makes as soon as he sits down. At CircleJerkBoys.com, we are always ready to make a stud like this as happy as he makes us. With that fitness magazine worthy body, piercing blue eyes, dazzling white teeth, and fat seven inch uncut missile of a cock, it should be against the law for Peter to ever wear anything more than a big smile. Hailing from Prague and well known in straight porn circles as the go to guy for the big Euro gang bang flicks, we have been uncovering another side of Peter that enjoys being alone in front of the camera. This time, he even shared that despite that always ready to fuck a slut side of his libido, there's a romantic side underneath. Peter just craves being watched and does not care who the audience is: ?I met a girl, and we had sex at a big party while everyone looked....I loved it.? What we love is how free he is when he is the center of attention, alone in front of our cameras. When we said it was time to start the show, he looked at us as if to say ?I thought you would never ask!?As soon as we said go, Peter ripped off his shirt and put that magnificent, sculpted chest into view over his sculpted, fat free abs ? though it was the tube of flesh tenting the center of his white pants that stole the our attention. Peter flexed his arms, made his pecs dance, and within 15 seconds, his pants were in the same condition as our mouths...wide open. Straddling the wall as if there was a glory hole carved into it, Peter ground his cock against it as he played peek-a-boo with some of the most perfect pair of glutes ever wasted on a straight boy. As he bends over to shimmy out of his pants, he turns to face us again, our eyes riveting up from the Sequoia-like quads, to the tent in those skimpy black briefs. Peter looks down as he rubs his torso, as if to take us along on the journey of exploring his body, right down to the excavation he does inside his shorts. He is ready to put himself, and us, out of our collective misery, and let the Pride of Prague - those seven thick inches of uncut majesty - come out of hibernation.With his trimmed pubes forming a crown over our favorite object of worship, and with but a casual rub or three, his skin snaps as his cock becomes as hard as steel. He stands up, beats his third arm on the arm of the chair, then moves to the wall, spits in his hand, and works up that meat to its longer and thicker than we have ever seen it before. It's so stiff that it points to the ceiling hands free. That hungry cock does not stay hands free for long, as Peter furiously strokes away, moving to the chaise and displaying those glutes as he pounds away on the imaginary lover underneath we all wish was us. Rolling over and sitting up, it is difficult to tell what is more pumped, his biceps or his cock. But when it comes to what is the most tight, no question there: it is his balls. All good things must cum to an end, and this time the end cums first on his pec then, leaves a trail of sperm down to his thigh. We have scheduled another shoot for Peter before he leaves the States, and we are working on getting him to try something we all have been dying to see: the working title will be ?Peter, Peter - find him an eater.? Stay tuned guys!",
  "models": [
    {
      "name": "Peter Stallion",
      "person_id": 28080
    }
  ],
  "release_date": "2008-04-25",
  "scene_id": 55299,
  "tags": [],
  "title": "Tight Grip, Scene #01"
}