{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "He'd been back for 4 days before stopping by to do more work. Christian Castillo just spent the last 4 months bangin' his baby momma in Cuba where he went to visit her and his now 2? yr old daughter. She is his ideal as far as women go. She's short, petite with big tits and long blond hair ...and she has no ass. What kind of Cubanita is that? Lucky for her, Christian is not an ass man by any means and he love to play with her huge knockers. It had been 6 months since this monster-cocked Cubanito had had the opportunity to see her so he had a lot of sex to catch up on. The freakiest sex he had with her this trip was banging her on the hood of a car in a park. Fortunately for us and our viewers here at CircleJerkBoys, Christian isn't opposed to resorting to somewhat ?unconventional? methods of keeping his str8 ?ping?n? satisfied. Cuban101, lesson 1 = Ping?n as in large ?pinga?. Pinga which is Cuban for a thick Caribbean cock!. Any questions? If so, those will all be cleared up as soon as he drops his pants. When he was here last, Christian agreed to do a steamy duo with Keegan  who did his best to accommodate Christian's extra thick meat. The looks on poor Keegan's face when Christian had his thick 8? cock shoved inside are hard to forget. Sometimes it just hurts soooo good. Ahhh, Good times.After his workout, Christian returns to the locker to get out of his gym clothes. He doesn't get far before realizing he has something that requires his immediate attention. As soon as his shorts drop you can clearly see the outline of his massive cock straining to break free. He sits down and begins teasing his massive meat thru his boxers as it gets harder and harder. He takes off his tee and we get to see his lean, defined torso. He's deliciously smooth with tufts of dark hair beneath his pits and that's about it. As he pulls his briefs off, you realize Christian keeps everything smooth. He pulls them down just far enough so that we see his fat uncut cock come into view. This boy's cock is thick as a can. His large nuts are smooth and heavy and he stands up to get naked and continue with his session. He dances around his sensitive knob with his fingers as he looks dead at you knowing he has what you want. He licks his luscious lips as he teases his fat cock. His low hangers are smooth and resemble 2 eggs hanging loosely in their sack. He drops to his knees and gives us an amazing shot of these danglers beneath his throbbing cock. His cock thickens as it approaches his knob. This is the kind of cock you'll not only feel ...but feel for a few days afterwards. Just the way it should be!He lays back and we can now see the view between those milky smooth thighs up towards his cock and his abs and sweet face provide the backdrop. Watching Christian play with is cock is an experience in and of itself. His features are amazing, the fair skin, the dark features his sensuous mouth and that ho tongue that keeps making guest appearances as he strokes all come together to create one hell of a visual. The way he plays close attention to his knob as he spreads his precum around is insane! His foreskin glides over his moist knob in tandem helping his cock build up a thick load. Christian is getting closer to releasing his load as he begins to work his massive shaft faster and faster. His abdominals begin to tense and he begins to groan and moan and within seconds he fires off. A huge volley of ?Crema Cubana? blasts into the air spraying his defined chest. That volley is followed by reinforcements that just keep coming as he grunts and groans. Hot little Christian has covered himself in baby batter and he looks spent too. After that show we can only hope Christian will need to come back again after his next out of town escapade.",
  "models": [
    {
      "name": "Christian Castillo",
      "person_id": 28258
    }
  ],
  "release_date": "2008-05-29",
  "scene_id": 55291,
  "tags": [],
  "title": "Alone By The Lockers, Scene #01"
}