{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we brought back one of CircleJerkBoys favorites, Stefano. Twenty-one year old Stefano was born in Palermo, Sicily; then raised in England; moved to Spain then Italy; and now calls the states home. Since we saw Stefano last, he's been a bad boy. Recently he was invited to a party at the Versace mansion and landed in a couple gang bangs that broke out late in the night. Stefano, with the kinkiest smile and that twinkle in his eye, had models all over him. Stefano is a horny boy and likes to jerk off once or twice a day on those rare occasions when he can't get laid. Mmhmmm. Today, we paired him up with another favorite, Tony  Michaels. Georgia born and a Miami raised Cubanito, Tony is 22 and is still keeping it single so he can be free to mingle. He has been featured on our site; as well as our other site, ExtraBigDicks. His sweet face and amazing ass keeps us wanting more. These two hot blooded Latinos will make quite a combination. Lucky for Tony, Stefano brought his infamous Italian salami for Tony's insatiable bottom. This is gonna be good! Bon Appetit, Monsieur Michaels.Stefano starts off watching porn as Tony showers. He undresses watching porn as Tony dries off and finds him rubbing his cock through his jeans. Tony spares no time and immediately leans over Stefano, rubbing his growing boner. He moves in front of Stefano, who by now is undoing his pants to give Tony full access. Tony goes down and swallows every inch of Stefano's growing meat. Stefano's eyes close as he enjoys the attention expert cock-sucker Tony is giving him. They move the fun over to the couch, where Stefano lays back and lets Tony work his cock as he continues to explore, licking him all over. Stefano then stands up to feed Tony more of his now engorged cock. His pubes are shaved and his nuts are smooth. Tony slurps on his meat as Stefano slowly fucks his face. Stefano is a sensuously hairless landscape, and his smooth body just screams, 'Lick me!'. Stefano sits back in a chair as Tony gets on his knees and continues servicing his cock. Tony looks up at Stefano as he slowly laps at his leaking knob. Talk about Dedication...DAMN!Tony can't take much more and needs to feel it inside him as he turns around and slowly lowers himself onto Stefanos rock hard cock. Stefano grabs Tony's waist as he guides him up and down while Tony leans forward and rides his cock like a champ. His deliciously smooth ass is on display as Stefano's cock is burying itself in and out. Tony lies on his side, and Stefano continues fucking his meaty ass. Tony's face says it all as he gets that cock pounded into him. Next, they flip over into a missionary position, as Tony's legs spread wide to accommodate Stefano's throbbing cock. Stefano's bubble butt looks hot as he thrusts in and out of Tony's hole. Stefano pins Tony's thighs down as he begins pile driving his Italian cock harder and faster. He's moaning and his breathing is getting heavier, and you know he won't be able to last much longer. Tony begins to jack off faster, sensing the coming climax. Tony pulls out as they both bust their loads all over Tony's navel. What a mess-Clean up on Aisle 6!",
  "models": [
    {
      "name": "Stefano Ricci",
      "person_id": 28225
    },
    {
      "name": "Tony Michaels",
      "person_id": 27902
    }
  ],
  "release_date": "2008-05-02",
  "scene_id": 55298,
  "series": "Lights, Camera, Sucktion!",
  "tags": [],
  "title": "Lights, Camera, Sucktion!"
}