{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Sometimes things come together in ways that make one wonder. This week we have the unison of two incredibly hot boys. Evan, the 21 yr old straight boy from Virginia who confessed he's willing to ?try anything  once? in order to get more acquainted with the adult industry, is about to get his chance. This inked white boy is sexy as all hell with a thick cock, too. His pierced lip and sexy tats give our x-military boy Evan a hot, bad boy look. This is gonna be the day that Evan realizes that boys really do ?do it? better! Tristan is 20 and from Connecticut. He, too, has ink throughout his lean bod; but unlike Evan has had several experiences in the porn world making quite a name for himself as Tristan Matthews. Tristan's a versatile hottie that prefers it a little on the rough side. Unfortunately for Tristan, he most often gets paired up with first time straight boys...Hmmm.... that he gets to break in. Like that's such a bad thing? Anyways, so we have a first time straight boy + Tristan equals...do you see where this is going? Good! In Tristan's experienced hands (...and mouth) Evan will be able to get a proper introduction to the joys of boy on boy sex.They both strip down to their jeans as they begin groping their crotches. Evan gropes his growing meat and it isn't long before hus hand slips inside to give it more attention. Tristan is groping his cock through his jeans when Evan's undone shorts get his attention. He slips his hands into Evans shorts and takes over for him as Evan removes his hand, placing it behind Tristan as he lets Tristan do the driving. It isn't long before they both have their swollen cocks out. Tristan strokes his own cock as well as giving Evan his first hand job from a guy. Tristan encourages Evan to touch his and he does with a bit of reservation. Evan strokes Tristan but as soon as they get up to take off their shorts altogether, Evan seizes the opportunity to just sit back and let Evan do the work. Evan's cock is rock hard and obviously having no problem getting help on his thick cock. Tristan eyes his meat and decides he needs more. He slips onto the floor and kneels before Evan seconds before he goes down on hiss cock. Evan's mouth opens in awe as he gets his first feel of Tristan's warm mouth on his throbbing cock. Tristan wastes no time and begins to swallow his cock with ease.He sits back on the couch and leans over to get more of Evan; who by now is guiding Tristan's head up and down on his cock, loving the attention. Evan's eyes are closed and his head is tilted back amazed at the blow job he's getting. Tristan isn't done and has more in store. He has Evan kneel on the couch so he can crawl beneath him and suckle on his fat cock like a calf working a teat for its' warm milk. Except this calf's working a stud instead! In this position Evan's cock glides deep into Tristan's hungry throat as he buries it home. Tristan has access to Evan's smooth balls which are now slapping his chin with every thrust. Evan's balls are getting tighter and tighter and Tristan knows what's cumming. He has Evan straddle his chest and has our str8 boy bust his nut on all over his face. Evan is more than happy to and within seconds begins shooting blast after blast all over Tristan's nose and mouth. Tristan's mouth is coated and dripping with breeder batter as he sits up and jacks off a huge nut himself. Once he busts, Tristan flashes that signature grin for us with his face still dripping with cum. No doubt these two got exactly what they were looking for ...and so did we!",
  "models": [
    {
      "name": "Tristan Matthews",
      "person_id": 28315
    },
    {
      "name": "Evan Greene",
      "person_id": 28316
    }
  ],
  "release_date": "2008-05-23",
  "scene_id": 55294,
  "tags": [],
  "title": "With A Little Help..., Scene #02"
}