{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Peter Stallion is back for more this week; and ?more? is exactly what he's gonna get. For those of you who may not be familiar with our stable stud, Peter Stallion  has gained recognition, and quite the following, doing str8 gang-bang films back in his native Prague. Peter and a few other studs vs. 150+ women = any man's fantasy right? ...well, mostly. Peter's been featured on CircleJerkBoys several times since we first saw him. With that face and chiseled body, it's no wonder he became an over-night fan favorite. At 23, he's charming, personable, hot as hell and willing to try new things. The latter is what we had in mind for our stud so this week Peter's gonna see just how the old (gay) adage ?It takes a Man to please a Man? pans out. Not wanting to overload his senses, we decided to start him off slowly. To do so, we recruited our secret agent, Mr. Tony Michaels who has a track record of turning out str8 boys with his charm & insatiable drive. Tony is so effective with that baby face and perfect Cuban ass of his that his services have even been put to use on our brother site, ExtraBigDicks.com, where he gave Blake the sexy exotic mate from London town his first all-male romp in the hay! Blake was never quite the same. We suspect once Tony works his oral magic on this stallion giving Peter his first hummer, Peter will be back and definitely ?UP? for more. ...You can read into that one. Tony immediately goes to work on Peter licking his nipples and groping his growing crotch. Peter doesn't resist as Tony fumbles with his belt and in seconds hauls out his growing uncut cock. Peter's cock finds a wet mouth in no time. Tony slurps and sucks on his foreskin as his cock begins to swell. Peter needs to free his boys so he pulls off his jeans and underwear to give Tony all access to his Prague piece. Tony loses his shirt and while he's doing that Peter's shaking his cock at Tony with a classic ?Get back on this bitch? look on his face. Tony, who had been undoing his belt, couldn't resist the look on Peter's face and instinctively went back down on Peter's growing worm faster than a Heron feeding in a shallow marsh. Someone's seems to be loving the new experience?we're just not sure which one's loving it the most? Tony strokes and sucks Peters growing cock paying attention to detail as he lathers Peter's smooth balls with his warm tongue. Peter then stands up to give Tony a better angle as he holds Tony's head with both hands and forces him to take his now throbbing cock all the way to its fat base. Peter loves it and in no time positions himself on all four over the arm of the couch and has Tony lay beneath him as he suckles on his cock like a milk-starved calf. The view of Peter's ass is amazing. Peter gets back up and stands next to the couch and goes back to using Tony's hot mouth. He holds his head and forces him to suck his dick. Tony can't get enough either; anxiously awaiting more cock as Peter serves it up hot. Tony then goes on his stomach as Peter begins face-fucking him deep. Peter's cock is throbbing as he strokes it inches from Tony's face. Tony, mouth gaping like a hatchling, seems cock starved. He laps at Peter's heavy balls while he waits for more. Peter throat fucks him hard while moaning with pleasure. Peter then sits back in the armchair as Tony kneels before him. He totally works Peters cock with ease deep-throating his str8 meat to the hilt. The looks on poor Peter's face are nothing short of amazement as Tony does his thing. Peter gets up again; standing and able to hold Tony's head securely in place, has total control of just how much Tony gets. Tony sucks his knob for a few until Peter takes it away, strokes it in his face then feeds him more. Suck, remove, tease, repeat. So simple, it's brilliant. Like all good assignments, this one will be cumming to an explosive climax ?and soon. Peter hovers over Tony's face as he strokes his massive meat. Tony's face is buried in Peter's balls as he jerks himself off. Tony's the first one to nut as he coasts his smooth navel with cream. Peter isn't far behind as he explodes his thick load all over Tony's chest. This stallion looks spent as he recovers from his climax. Another 'Mission Accomplished' for our Agent Michaels.",
  "models": [
    {
      "name": "Tony Michaels",
      "person_id": 27902
    },
    {
      "name": "Peter Stallion",
      "person_id": 28080
    }
  ],
  "release_date": "2008-06-06",
  "scene_id": 55290,
  "tags": [],
  "title": "Pleasure Playground, Scene #02"
}