{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have a hottie from the Lone Star state. Coby, one of Texas' finest is 23 and in now in San Diego. ?Steers and Queers!? we teased him as he laughed it off. When asked to tell us something about him he opens with. ?I'm a full on Steer!? He's a riot. He loves outdoor sports and snowboarding. He had a bad accident snowboarding a while back showing off doing back flips that landed him in the hospital. Now he still loves the sport but he sticks to straight up boarding?no tricks.  He's 5'10 and incredibly sexy. His smile is infectious. It lights up his entire face and he has the personality to boot. He's animated and has a great sense of humor. It's great to find a sexy masculine stud with a quick wit and a self-assured air about him. Coby's here to make some money to take out his new girl out to dinner on their one month anniversary; even though ...Coby's married!  It's a long story. Apparently it's one of those things that happen when you're in the Navy. Speaking of ?one of those things? that happen in the Navy...it seems our hot str8 boy, Coby had a drunken night at port and ended up with a lucky seamen going down on him for some 'seamen' of a different kind. ?It was pretty good? he says as he grins ear to ear. With any luck we might be able to talk Coby into getting that navy cock sucked off on camera. For now, we get to see just what that lucky sailor got to sample first.Coby begins by taking off his tee. His chest is deliciously furry and as he flexes his gun for us we get a shot at his furry pit. He laughs as he rubs his chest and says, ?They call me Papa Bear.? He assures us it's a very good thing when they're screaming ?Papa Bear, Papa Bear!? Yeah, we bet. On that furry chest is a tatt of Texas across his heart, a true Texan Homage. He slowly drops his jeans and is left in his loose fitting boxers. He pulls them down far enough to show us is deliciously smooth ass. He strokes his swollen cock and bends over as he playfully fingers his sweet ass. He has a sweet bubble butt that would make many-a-mouth water. He stands to continue stroking his throbbing cock. His furry chest and navel are sexy and when he lies back on the couch and spreads his legs we see yet another tuft of hair hidden away just beneath his nuts that are pulled up close to the base of his engorged shaft.He is solely focused on the task at hand like a good sailor. He stares as his cock as he strokes and thumps it against his hand. He holds it by the base with one hand while stroking it with the other. He is great to watch as he gets into what he's doing. His finger darts back to his ass as he strokes. Seems this str8 boy knows all about the hidden button many str8 boys are afraid to explore. His thick thighs and furry landscape are on display as he lays back and strokes his now aching cock. His nuts even tighter sadly signal the inevitable. Our boy Coby stands up and glass in hand strokes his cock harder and faster. His eyes squint and his sexy mouth opens a bit as he nears his orgasm. He begins to moan and groan and his breathing is getting heavier and h eavier and just as he's about to bust his nut he grunts out ?I'm gonna ?Awwww?and he blows! His thick load spurts out volley after volley most of it forming a thick creamy pool inside the glass. DAMN!...Protein Shot anyone? That's all we're saying.",
  "models": [
    {
      "name": "Coby Jones",
      "person_id": 28311
    }
  ],
  "release_date": "2008-04-18",
  "scene_id": 55301,
  "series": "Cocky Coby",
  "tags": [],
  "title": "Cocky Coby, Scene #01"
}