{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we brought together two of our str8 alumni to have a session together. Mario  was one of our original stable studs who helped launch CircleJerkBoys, and he's back to give us a refresher. Mario, now 25, is a Miami native. He gets hotter and hotter every time we see him. Mario is outgoing and gets himself into all sorts of trouble. Recently, he was in Antigua on a business trip, where he ended up hooking up with a girl he met at the bar next to where he was staying. He had noticed this girl at a strip club the night before. Lucky for Mario, she was with a friend, and they all ended up going home together. What he wanted was a 3-some, but her friend hooked up at the last minute, leaving Mario with the hottest one all for himself. Mario is up for anything, and he's in good company. Bobby Clark, the 23 year old Wake board Instructor from the West coast of Florida, is a horn dog himself. Recently, Bobby got the chance to hook up with a girl he always sees out at the clubs while tailgating at a UCF Championship Game. Luckily, she was alone without her cock-blocking friends; so he invited her over to tail gate with him and his buds. The game started, and the parking lot began to empty out, leaving them unsupervised. One thing led to the other, and he ended up scoring in the open bed of his truck! Both of these players have what it takes to score and today we get to watch how these two service their 'equipment' between games. Ready, set ...Hut!!Side by side, they begin groping their cocks inside their pants. Bobby's the first to lose his shirt as he gets comfortable. Mario quickly follows suit, taking off his shirt and tank. Soon, they're both at their feet, pants undone and stroking their growing cocks. Mario leans back on the couch as Bobby lies down. They are both in their underwear at this point as they watch a flick. Mario acts like he's shakin Bobby's hand and playfully tries to put it on his own throbbing boner! ?Whoa, Whoa ?that's not my date!? Bobby laughs. Mario is quite the prankster. He slips off his underwear and sits down to work his throbbing boner, is thick shaft finally getting the attention it needs. Bobby stands up and drops his briefs as his rock hard cock springs free. Bobby's body is defined and practically hairless. From here, they stand side by side as they continue stroking their swollen cocks. The camaraderie between these two is infectious. Mario turns around and shakes his money maker. His perfectly smooth ass is a sight to behold, and apparently hard to resist as well, as Bobby playfully slaps Mario's ass. Mario laughs as they both begin a small game of slap ass like giddy junior high school jocks. This must be what goes on in locker rooms unbeknownst to the rest of us.They both bend over on the couch and stroke their cocks with their asses on display. They both have impressive bums, and the view is remarkable. Like an all you can eat buffet! From there, they take turns stroking their cocks, Mario stroking his thick Colombian pole as All American Bobby strokes his frat fuck stick. You'd think these two went way back as they sit and make comments about the flick they're stroking to, inches away from each other. Bobby's smooth balls are pulling tighter as he strokes his cock and lightly teases his hole. Just behind him on the couch, Mario jerks his cock and begins to pick up the pace. Mario's heavy nuts dance in tune with the motion above. Watching these two straight boys jerk off side by side is quite the experience as they joke around with one another. But the fun can't last forever. They get closer and closer to blasting their loads. They both kneel in front of each other and go for it. Mario is the first one to nut. He moans as he unloads, spilling his wad on the rug below. It forms a thick puddle underneath him. Bobby isn't far behind as he begins to breathe heavier and soon unloads. His cock shoots his load in thick ropes that splatter on the same lucky rug. The camera pans up as you see these two defined studs, spent and laughing like they've just had the time of their lives. Ya gotta love it! It's always great to find str8 boys comfortable enough with who they are and willing to do what we want.",
  "models": [
    {
      "name": "Bobby Clark",
      "person_id": 28271
    },
    {
      "name": "Mario Triullo",
      "person_id": 28294
    }
  ],
  "release_date": "2008-04-11",
  "scene_id": 55304,
  "series": "Double Standard",
  "tags": [],
  "title": "Double Standard, Scene #02"
}