{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Peter Stallion is back. Peter Stallion is the Prague import who made a name for himself doing straight gang bang videos, and he is back to give us another show. This 22 year old horn dog is always ?up? for action. He laughs when we ask him if fucking on camera is any different that fucking in the privacy of his own bed. He just loves to fuck, and doesn't distinguish between his personal or professional activities. He just does his thing. An awful lot, too. Peter has anywhere from 3-7 lovers back home that constantly need his cock. ?Sometimes it's like work for me because I need to do it!? he laughs. Fortunately, he loves to do it, and with every new experience, his appetite for more and different experiences grows. Peter has amazing control. His gang bang videos, fucking over 100 women with 3 other dancers, take up to 4 hours to film and he has to hold his load til the end. ?I really like to try new things with innocent girls' he grins 'Sometimes they cry but I keep doing what I do like a machine?I fuck hard!? He loves pushing the sexual envelope with naive girls and making them do things they normally wouldn't. The rest of his lovers can't get enough of Peter, and he's always in demand. Well, we're not that naive or as easy to shock as those girls back home; but, we can't get enough of this ?Stallion? either!Dressed in white slacks and a CJB sleeveless tee, Peter begins teasing, running his hands up his defined abs before standing up to get more comfortable. His pants come off, and he sits back down and begins waking his swelling cock. Things are getting too hot, and he decides he needs to cool things off. He moves the show to the bathroom, where he walks in to the shower, and in seconds is ready for a wet t-shirt contest. His tee hugs every delicious curve of his defined torso. Peter takes out his fat uncut cock and begins jackin off. His smooth balls glisten as the water cascades off them filling the bathtub below. His tee and then his briefs come off, and Peter is ready for his bath. He lies back in the tub, staring at you as he continues pleasuring his throbbing Czech cock. The water laps at his sides and defined chest as he wriggles around, teasing us, almost as if he knows just how much we wanna be in there with him. Grrrrrr!Nice and cool, Peter takes his sweet assets back to the couch, where he begins by straddling the couch, giving us a spectacular view of his muscular ass. He grinds back and forth as his thick cock rolls in and out of his foreskin. If only this was filmed in ?Lick-o-rama??some of us would have cleaner monitors than others. LICK! Peter sits back, and the view pans out as he spreads his thick muscular thighs apart and starts jackin' his meat. He fists it and stops to wiggle it around for us to see just how much meat he's got. He sits back on the arm he was straddling minutes ago and starts going at it faster. From here, you can really appreciate his toned and defined body. His dedication at the gym is evident. Peter is working his cock faster, and his subtle moaning is signaling the impending explosion. Seconds before he nuts, he stands up and kneels in front of a black cushion, which unknowingly is about to receive a bath of its own. A soft groan followed by some moans, and Peter blows?shooting 7 or 8 blasts of Czech cream all over the cushion below. Some cushions have all the luck! Lucky for us, we keep getting more and more of Peter Stallion. We wouldn't be surprised if we had this thoroughbred back in our stables sooner than later.",
  "models": [
    {
      "name": "Peter Stallion",
      "person_id": 28080
    }
  ],
  "release_date": "2008-03-28",
  "scene_id": 55307,
  "tags": [],
  "title": "Mr. Perfect!, Scene #01"
}