{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Joshua is 21. At 6'1? and 185 lbs. he is soft spoken and comes across shy; almost uncomfortable talking about his sexual adventures. It was at the ripe age of 19 that he lost his virginity on a date where he landed his first kiss on a carnival ride. The kiss led to more and they ended up in bed and two cherries later?he was hooked! He shyly grins when asked how his first time went. ?...it was a little bit painful for her.? He confesses. That would seem like a normal thing it being their first time; until you get a gander at Joshua's massive cock. We're sure  it had to be painful for a first timer. His cock is 7.5? & the girth on that boy is quite impressive. Since his first night after the carnival he's made up for lost time. He loves girls with flat stomachs and admits he thinks his own abs are the best part of his body. We beg to differ!  He loves the thrill of getting caught and is open to not only having sex but jackin his thick cock anywhere he can. In a huge bed, outdoors and even in the forest, nowhere is off limits. He jacks off often depending on the week and sometimes does it several times a day. Lookin at that shy face & impressive meat we imagine it must be quite a sight watching him take care of that cock. Lucky for us, we won't have to ?imagine? for long...Tight jeans & a dress shirt are all that keeps us from what Joshua came to show us. He slowly unbuttons his shirt as he begins groping his growing cock through his jeans. His shirt falls open and reveal the impressive abs he spoke of. He undoes his jeans and lowers them enough to get his cock some breathing room. His chest is completely smooth but for a few hairs that trickle from his navel and disappear into his briefs. His hand slips beneath the black cotton that encases his awakening rod and as it does his uncut cock slowly emerges. He licks his full lips & closes his eyes enjoying the attention he is giving himself. One tug and his briefs come down far enough to get a glimpse at his growing cock. His cock fills out in seconds as he rolls his foreskin back and forth along the growing shaft. He stands to give us a better view and immediately turns showing off his sweet ass. He cups his round cheeks and plays with them, giving us a show, as he continues stroking his meat. When he turns back around you see Joshua in all his glory. His cock is massive on his defined frame that is reminiscent of others immortalized in marble. Michelangelo missed out on this one. ...but we didn't!He stands again and the camera gives us a view from below. The view is amazing as Joshua strokes his now throbbing cock. His heavy nuts are pulled tight and cling to the base of his cock. His furry ass crack exposed as he puts one leg up on the couch. Next he straddles the arm and uses it to jack his cock. He pushes his throbbing meat onto the fabric & strokes the top. His nuts are so tight that you know it won't be long before Joshua is ready to explode. He pins his cock at the base with one hand and uses the other to work his knob beneath his heavy foreskin. He needs two hands to stroke his monster meat and as the camera pans down across his body ending at his aching cock your mouth is watering. Wait for it?there's more! He begins to work his cock faster and as he does you begin to hear soft moans and gasps escape his lips. His body tenses as his breathing begins to deepen. A few gasps and as the camera zooms in for his show he lets loose. A small dribble opens the ceremonies and is immediately followed by 5 or 6 geyser blasts that soak his chest and abs. The more he squeezes his knob the more he shoots. Whoa. Somebody was a tad overdue. We're just glad he didn't waste this nut on a tree somewhere.",
  "models": [
    {
      "name": "Joshua",
      "person_id": 30518
    }
  ],
  "release_date": "2008-04-04",
  "scene_id": 55306,
  "series": "Nasty Habits",
  "tags": [],
  "title": "Nasty Habits, Scene #02"
}