{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Bobby is Back! The adorable 23 year old wakeboard instructor on Florida's west coast has returned to give us another show! Bobby  was first on CircleJerkBoys a couple months ago. It wasn't long before we started getting fan mail wanting more of this blue-eyed, sun-kissed hottie. 'Fun, Sun and Rum' is still his motto, and working on the water has kept him way too busy for anything serious other than the occasional booty call. He has long distance girlfriends back home in Seattle who have no idea they aren't exclusive. Bobby says he likes blondes 'They gotta be blonde!' he laughs. He likes girls who are outgoing and straight forward. He doesn't like girls who say  they're 'single' but they're actually talking to like 5 guys! They need to be honest about what they're up to! Double standard aside, we're guessing the Florida girls just aren't as naive as the ones he left behind on the farm. Since we last saw him, he had a wild group session with 4 guys and a girl. Bobby took the lead and orchestrated the bedroom scene that followed resulting in a hot group orgy! I guess our little Bobby Clark isn't as innocent as he looks! -Oh Goody!Bobby is ready to roll as his hand immediately dives into his growing crotch. Biting his lip, he looks right at you in a seductive stare that makes you wish you were in the room instead of just watching. He sighs softly as he plays with his cock. His pants are the first to go as he loses them seconds before he loses his sexy boxer briefs. His perfect ass comes into view as he slides them off. He sits back on the chair and begins to stroke his cock, which is already aching for attention. His sexy low hangers are heavy, with several days of backed up load he can't wait to unload. He stands up and bends over to give us a better view of his ass as he strokes his cock underhand. Everywhere you look, you see nothing but his smooth sun kissed skin. His crotch is also kept buzzed short, and his balls are naturally hairless. He kneels on the bed as he starts piston-fucking his palm with his fully erect cock. His mouth opens as his head falls back in ecstasy as he pleasures his meat. He fucks into the air, giving us an idea of what he'd look like were he behind you giving you his straight cock doggie style on a beach near you. This boy knows just how to tease!Flipping over, he sits back to continue stroking his swollen cock. The views from below are amazing as you see his smooth balls slowly tighten as they approach pay dirt. Bobby lays his head back as he continues beating his meat as he teases his sweet nips. He looks right at you as he strokes off. He goes from seated to leaning on the couch, and gives us new views of all he has to offer. He slaps his rock hard 7' cock up against his taught abs, teasing you with what he could give you. His sexy smooth thighs showcase the action as his balls bounce in tune to his cock slapping. He's getting closer, so he returns to the couch to blow his wad all over a very lucky cushion. He begins to moan, and his breathing deepens as his stroking increases. His face contorts as he bites his sexy lip, and you know it'll only be a matter of seconds before he blows! He definitely had been storing up a load for us because when he shoots-it explodes all over the cushion! His first thick jet splashes the far end of it almost two feet away. The rest of his creamy cargo coats the rest of it. Whew! I guess we should've known the 'Revolver' graphic on his sexy tee would've clued us in on what was to cum. Bad Boy Bobby was packin' a cum gun!",
  "models": [
    {
      "name": "Bobby Clark",
      "person_id": 28271
    }
  ],
  "release_date": "2008-02-21",
  "scene_id": 55313,
  "series": "Dicky Dearest",
  "tags": [],
  "title": "Dicky Dearest, Scene #01"
}