{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Back for more fun this week is Mario. From his first shoot here at CircleJerkBoys, it was obvious that this bedroom brown-eyed amateur boxer had plenty to offer. At 5'11, he is one hot piece of man with piercing brown eyes, a great smile and a raw sense of masculinity. Now 25, Mario has been hitting the gym regularly and it shows. He can't complain because he admits that a better body gets him better girls! No pain no gain! He isn't very shy at all when it comes to women, and told us all about a wild encounter he has over Christmas week. One of his ex-girlfriends took him to a swingers club where he got to experience his first ever all out orgy! He laughs like a schoolboy, telling how wild and hot it was getting it on with first his ex; then his ex and another girl; then having a couple and others watching and joining in! He hopes that if he's just as good this year, he might have that happen again! We bet that might be a struggle for this bad boy. All we know is that even though he sadly left his boxers on during his Christmas caper -He won't need them today!Mario pulls his sweater off and strips down to his tight fitting sleeveless tee that proudly bares our logo. Mario is ready to go as he rubs his growing cock through his loose fitting jeans. He has tatts on each arm, and the look on his face is one of mischief. It isn't long before the jeans come off, leaving him in a bright orange jock. He bends over to show us his beautiful ass. He does stretching exercises to give you time to really appreciate his assets! His shirt comes off next as he moves to the chair. Here he kneels on it, humping his firm waist as he gropes his cock in his jock. Mario can't keep it in his pants any longer and finally peels off his jock strap. He turns to show us his arsenal. His chest is muscular and deliciously defined. It makes your mouth water thinking of the possibilities-they're endless! His cock, now at full mast, is a thick 7' and he strokes it in different positions to give us a better appreciation of his meat!He lays back on the couch to continue working his swollen cock. His heavy balls that are shaved smooth hang low as he works his throbbing bone. Every inch of him screams 'Lick me!' His small cinnamon nips on those defined pecs, the full lips, the pits, he looks like a slice of the Mediterranean for all to behold! The tight curly hair, the sun-kissed skin, even the swarthy sense of sex that oozes out of every pore is exhilarating. He continues stroking his cock and playing with his heavy balls as he begins to stroke faster and faster. The look on his face changes as he obviously approaches his climax. He is at full throttle in no time, and just when he knows he's seconds away from busting his nut, he finds you, looking dead into the camera making sure you're paying attention as he explodes all over his smooth navel below! Mario is a knock out-and knows it! Here's hoping he'll be back for another round!",
  "models": [
    {
      "name": "Mario Triullo",
      "person_id": 28294
    }
  ],
  "release_date": "2008-03-14",
  "scene_id": 55312,
  "series": "Sinful Charity",
  "tags": [],
  "title": "Sinful Charity"
}