{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "One of the more popular saying between home boyz in the Latino community is the old adage: ?Bros before Hoes!? Today we have a latin treat, Jay & Rico, two of the hottest local Miami boys who not only grew up together; but are also known for doing ?other things? together?females!  The tourist-laden, Florida nightlife, places like South Beach, Kendall, the Grove, all afford many opportunities to find easy female conquests & with looks like these, not to mention the thick ?pingas? these 19 yr. olds are packing?it's no wonder these two lady killerz do it better than the rest! Rico  gave us quite the show when he was here several weeks ago & today we convinced him to do a duo shoot with his longtime bud Jay. Jay was featured a couple weeks ago on our bonus site, ExtraBigDicks, where his perfect ass & throbbing cock have made him a recurring fan favorite! Today we're putting these two in a room to create a twist on the same adage: we're calling it: ?All Bros ...NO Hoes!?Sitting side by side they begin groping their growing cocks. Jay moves to the floor as they both begin to undress. Down to boxers they both start to tug & stroke their swelling cocks. Jay & Rico have sexual history banging girls together so being in the same room buck ass naked isn't awkward at all. It's not always easy to find two straight guys willing to wank off together without feeling threatened or intimidated. Rico takes a seta as his bud stands inches from him as they both stroke on their engorged cocks. Both have thick pingas with foreskin galore. They both take care of their bodies & it shows! They both have incredible sex appeal: Bedroom brown eyes, kissable lips & smooth well defined bodies. Jay fists his fat monster cock using both hands to give all 8.5 thick inches the attention they require. Panning back to see these two bros stroking off together makes you wonder what these two must look like with a lucky female in the middle!Rico stands & gives us a better view of his delicious backside as Jay strokes his cock sitting on the floor. Then they switch it up & change positions giving you great angles in which to appreciate what they got to give?a LOT of dick! Rico lies along the floor with a leg up on the couch just below Jays rock hard bone. Jay's knob swells even larger than before as his stroking intensifies. It won't be long before there's ?cream a cummin'!? Jay stands on the couch & sits on its' back so he can drop his creamy trophy load on the black leather below. He is intense as he focuses on busting his nut & it tips Rico off who also picks up his pace. In no time, they are both racing to the finish line jacking feverishly, Jay is the first to nut; spewing his thick seed on the couch below. Rico isn't far behind & within seconds' grunts as he shoots his load all over his inner thigh as it slowly drips down to pool on the couch. These two have the right stuff to get the job done & we're glad they agreed to indulge us with a steamy ?All Bros?NO Hoes? session! WOOF!",
  "models": [
    {
      "name": "Rico Salazar",
      "person_id": 28273
    },
    {
      "name": "Jay Martinez",
      "person_id": 28305
    }
  ],
  "release_date": "2008-02-28",
  "scene_id": 55316,
  "tags": [],
  "title": "The Odd Couple, Scene #02"
}