{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week at CircleJerkBoys we brought back two of our favorites to see what would happen when these two horny studs share the same bed. The first of our alumni is 22 year old Malachi. The tall, 6'1? tattooed stud from Virginia Beach, VA has been featured a couple times, both solo and in action. His 9? monster cock made him an instant fan favorite for those who like their studs lean and well-inked! This week, we're putting him together with baby-faced Tucker. We last saw Tucker a few weeks ago when we paired him with our now infamous ?Top Chef? Cooker, who until then had never walked on the ?all-male? wild side. That made for one insanely hot first time session! Cooker and Malachi both have one thing in common that we know Tucker can appreciate?really huge cock. We knew Tucker would be perfect for the job. Tucker, the Northerner from Michigan, finds himself drawn to guys with nice eyes and loves to stick to his strict routines every day. Malachi is the opposite. This Southerner is more attracted to a guy with big legs, and isn't much on sticking to routines at all. He does what he needs to do, then likes to have the rest of the day to do as he pleases. Opposites tend to attract; so we have a feeling that once these two get naked and have a go, the chemistry will be...explosive!The cameras haven't started rolling, and these two have already started. They begin making out passionately as they kneel before each other on the bed. Tongues and hands are free to roam as they begin to undress. Malachi takes the lead and goes down on Tuckers swelling 8? cock. Tucker can't help but moan his approval as Malachi sucks his cock. Tucker's enjoying the help; but he wants what's in Malachi's jeans. Malachi, who showed up ?commando?, is more than happy to oblige. He undoes his jeans and pulls them down immediately, freeing his growing cock. Tucker takes it all the way down and begins milking Malachi's thickening meat. It isn't long before he's at full mast and fucking Tucker's throat with 9? of uncut, southern steak. These two can't get enough of each other as they start swapping blowjobs. Sitting, standing, and finally lying on the bed as they begin to 69. In this position, Malachi has unfettered access to Tucker's backdoor and begins to finger his sweet ass. Tucker moans in pleasure and anticipation still latched on to Malachi's cock. He knows exactly what's coming! ?So do WE!Tucker can't wait any longer and straddles Malachi. He grabs Malachi's monster cock and sits on it. He winces as his ass begins to accept the monster cock that by now is throbbing for release. Tucker takes all nine like a champ, and in no time is riding Malachi as they both grunt and groan in ecstasy. Malachi holds Tucker by the waist as he grinds his ass deep. The look on Tucker's face says it all! They flip positions, and Tucker is now riding Malachi with his back to him as Malachi begins bouncing him on his dick. Tucker's cock is aching as it bounces in the air from the sweet fucking Malachi's giving him. Soon, they get off the bed, and Malachi bends Tuck over the chair and slams back into him, burying his cock ball deep needing more of that sweet ass. No matter the position these two can't get enough! Tucker ends up in on his back as Malachi fucks his ass missionary. Tucker can't help but start jerkin' his cock. Malachi's pounds him harder and harder, and sure enough, Tucker moans and lets out a load guttural groan?and nuts! Malachi pounds him even harder, fucking the load right out of him! Malachi can't hold back either and pulls out his uncut monster and explodes his load all over Tucker's cum soaked navel. Whew! Opposites definitely DO attract!",
  "models": [
    {
      "name": "Malachi",
      "person_id": 28253
    },
    {
      "name": "Tucker Forrest",
      "person_id": 27965
    }
  ],
  "release_date": "2008-03-21",
  "scene_id": 55310,
  "series": "Under 1 Roof",
  "tags": [],
  "title": "Under 1 Roof, Scene #02"
}