{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "?Just a little bit!? is 21yr old Ryan's response to the t-shirt he showed up wearing which clearly puts it out there for anyone who need know: ?I Lie To Girls!? A Buckeye Boy, Ryan Walkin is originally from Columbus, Ohio. Clean cut 'Boy-next-door' looks, a brilliant smile that never seems to leave his face, and that twinkle in his eye can only mean one thing?Trouble! Soft spoken and polite, Ryan lost his cherry at the tender age of 16 to a much older girl; but don't let your first impression fool you. ?Still waters run deep!? Not one to jerk off a lot, Ryan prefers to save it up for that special one that comes along. He hates to waste it when it could be put to better use. Fortunately, He never has to wait too long before finding someone willing to help him out. He admits he's not into anything too fancy, and just loves good old-fashioned ?legs over my shoulders? fuckin. But he doesn't hesitate to say, ?I'm as kinky as can be!? He loves ass. ?I'll lick it, I'll hit it, I'll put my fingers in it. I'll do whatever it takes, I love me some ass!? Mmmm. Sadly, he doesn't need his efforts reciprocated and his ass ...is off limits! Ugh! ?Tease!!Lying back on the couch, Ryan begins to slowly feel himself up, running his fingers over his deliciously smooth chest and abs. At 5'9, and weighing in at a lean 125, his body is naturally cut up. Small cinnamon nips on his chiseled chest are the only thing amidst a sea of lickable definition: abs, chest, arms, thighs ...and why stop there? His shirt and pants come off, leaving him in a pair of tight boxer briefs that clearly show just how excited he is to be here. His cock grows by the second, as he continues to caress his defined bod, paying special attention to his bulging boxers. A quick turn, and he slowly peels his briefs down over his smooth arse - his heavy low-hangers clearly visible as he bends over to lose his briefs altogether. Pulling at his aching cock, Ryan is now ready to take care of the load he's been saving for us for over a week. This should be a great show with a fireworks finale! Lucky for you, we got you front row seats!Bending over, Ryan jerks his cock to give us another shot at that ass we can't have. His thick cock responds to his every touch. He stands with one foot up on the chair and jerks his thick meat as his balls swing below. He never stops feeling his rock hard bod as he works his swollen cock. He sits back, legs spread wide, and gives us a different angle at his equipment. He tugs on his huge balls as his cock keeps getting the attention it needs. Close ups of his face make you wonder what it would be like to taste those pouty lips or run your tongue along his sensual, long neck. We're getting carried away! The show goes from the chair to the floor as he lays down and gets ready to release the load he's been working on for us. He jerks his cock and plays with his balls as his breathing begins to deepen. His smooth muscles flex beneath his skin as he nears orgasm. He moans, and as he reaches his much awaited climax, he grunts and unleashes a geyser of pent up seed. Shooting a good two feet in the air, his first shot lands everywhere and is followed by more, which lands on his now coated navel. I guess he was right about one thing ?a load is a terrible thing to waste! We're glad we put this one to good use!",
  "models": [
    {
      "name": "Ryan",
      "person_id": 30334
    }
  ],
  "release_date": "2008-02-15",
  "scene_id": 55319,
  "series": "The Thin Loaded Line",
  "tags": [],
  "title": "The Thin Loaded Line, Scene #01"
}