{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This is Tony's firs time on camera & he lights up when he admits he loves it so far He seems to have a permanent smile on his boyish face & says you gotta be happy!! He debated for a while before doing this; but lucky for us he decided to. Originally from Naples, on Florida's sleepy, west coast, Tony enjoys it over here in Miami, where there's more action in the day to day. He's not picky though; he's ok wherever he is & is outgoing & friendly. On the other hand, he is picky when it comes to women. He loves Spanish girls. Doesn't matter what kind of Spanish ?He loves the culture! He loves that they all look innocent but are far from it! He was a late bloomer & didn't discover jackin' til he was 16; losing his cherry to an older girl 6 months later at 17. Once he discovered what his cock was meant for, he gave up on jerkin & rarely does it. He prefers a female to handle that for him. He's not one for booty calls because, as if it wasn't obvious, he's kinda shy! This must make him one extremely horny Italian boy with a set of heavy balls ready to blow a load 24/7! Well...they won't be heavy for long!Rubbing his abs, Tony begins to undress. He has quite the 6 pack on him & in no time his shirt comes off leaving him a sexy tank. A large silver chain and boxers is all he's left in as he undoes his pants & drops them to the floor. You get a better view of the sexy tatt of a pitbull, tongue waggin' on his right arm as he lays back and begins teasing his growing cock. Tony is smooth all over with lean muscles rippling all over the place. His smooth  nuts are bouncing in tune with his jacking. He has a slight happy trail that starts at his belly button & traces south; disappearing into a thick patch of hair he keeps au natural. He then gets up to give us a better view of his backside. He bends over while caressing his cheeks & even squats down for a better pose as he feels himself up. His heavy nuts hang low and when he stands up & bends over again you get to see all he has showcased wonderfully: his furry ass, the low hangers & the Italian club he's packing!Every inch on this 22 yr old makes you wanna taste him. He's shy, the kinda shy that makes him that much hotter; because he seems unaware of his own sex appeal. He looks totally focused as he continues working his fat cock and as the camera pans overhead you get a great view of his aching member getting closer and closer to unloading weeks worth of baby batter. He lies back on the couch, legs spread wide, and starts jackin his meat faster. Close up views of his balls & cock in this position really show off his package. His nuts begin to pull close as he gets closer & his jerkin intensifies paying more attention to his knob. You know he's getting ready to blow any second & then he moans & gives you a heads up ?Here it comes!? He isnt kidding! It cums alright, and cums?and cums! His pent up balls pump out 11 squirts of thick, creamy jizz that pools on his navel below! It really is the quiet ones you gotta watch out for! ...and Tony's obviously no exception!",
  "models": [
    {
      "name": "Tony",
      "person_id": 29322
    }
  ],
  "release_date": "2008-02-28",
  "scene_id": 55317,
  "series": "Nothing To Lose",
  "tags": [],
  "title": "Nothing To Lose, Scene #01"
}