{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week, we have some pickin to do?cherry pickin' that is! All-American Maine is back  with tussled hair, those chiseled features, and that mouth watering cock. At 24, he has the looks that could easily land his deliciously defined frame on a Parisian runway. Fortunately, he's back on CircleJerkBoys instead and this time, he is not alone! It seems that more than his hair's been growing since we last saw Maine, and he's here to do something about it! Twenty year old Johnny has darker features and a latin flavor that is more 'boy-next-door', but equally appealing! Both of these studs lost their cherries in their early teens to older girls, and we can only imagine what trouble these two have gotten into since! Both horny and avid strokers, Maine loves to take care of business in the shower. Johnny, who's been caught doin' the deed, prefers his bedroom. I guess Johnny will feel more at home as they prepare to stroke one off for us ...and then some. Neither has had any male-to-male experience, and both admit to being a bit nervous about it. I guess there's no sense in wasting time?these cherries are ripe for pickin!!Cautiously, they begin groping their cocks inside their pants. Maine eyes Johnny, who's taken the lead by pulling off his sweater, and has begun undoing his belt. It isn't long before Maine follows suit. The energy is electric as you see these two touching another guy for the very first time. Maine and Johnny timidly explore each other's chests and abs. In no time, these two have stripped down to their boxers. Maine holds still while Johnny begins rubbing his muscular thighs and growing cock. Johnny decides to jockey into a better position by standing on the bed and giving Maine unfettered access to his thick, uncut cock. Maine strokes the uncut cock inches from his face in awe, and it isn't long before Maine is ready for more. Lying side by side, Maine takes the lead this time as he leans forward and takes Johnny's uncut cock into his mouth. His curiosity is finally being satisfied, and Johnny's only too happy to help out! Johnny returns the favor, giving Maine's cock the attention it desperately needs. In no time Maine is throbbing at full mast!It's open season on cock by now as they begin trading blow jobs! The initial hesitation is gone, and the only thing left is the desire for more! Johnny hovers over Maine's face as he lowers his cock for more of Maine's hot mouth. If Maine's curious about cock?Johnny's happy to oblige! The action continues as Johnny wants more of Maine's mast! His uncut cock throbs as you pan up to see him swallowing Maine's meat to the hilt. Unlike Johnny who held still while being serviced; Maine is keeping a steady pace fucking Johnny's face, his heavy balls slapping his bud's chin as his ass rises and falls deep into Johnny's throat! I guess ?A hole is a hole? really does apply for horny straight boys. Maine sits back spread eagle, eyes rolling, and loving every minute of it as Johnny bobs up and down on his cock! You'd think there's oil in it! The extra attention works as they both prepare for fireworks. Johnny's the first to blow, jerking off as he creams all over himself. Apparently not having had enough of Maine; he quickly leans over and goes back to work on his jock cock. Johnny gives him a hand job until he gets what he was looking for. Oil that is, White gold, Man Tea! Maine grunts and moans as up from his pole comes a bubbling crude. He blasts jet after jet of jizz shooting way up in the air! Looks like someone got just what they were hoping for after all ?We know we did!!",
  "models": [],
  "release_date": "2008-01-18",
  "scene_id": 55327,
  "tags": [],
  "title": "It Happened One Day..., Scene #01"
}