{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "?At 5'11, 23 yr old Bobby Clark is the All-American poster boy. Dirty blond hair, dreamy blue eyes, killer smile, rockin' bod, and the sun kissed face might make you think he's one of those model types on his way to another Hollister shoot. Looks can be misleading. Bobby, originally from Washington, is actually a wakeboarding instructor in Orlando, FL. This lucky stud gets paid to run around in board shorts, work on his tan and get plenty of ?play? on and off the clock! ?Fun, Sun and Rum!?, he says, are the reasons he relocated to Florida. We bet! Bobby lost his cherry at 17 during class in a small town outside Seattle. After the class spent time in the barn learning about cattle in Agriculture Class; Bobby and his first lingered behind and found that the 'Birds and the Bees' were way more interesting! Bobby was a late bloomer, and he admits he's not as sexual as his friends. He loves the chase; it's the build up to the actual sex that gets him going. He laughs as he says he is ?single-ish?, and that even with a few girls he considers fuck buddies, he likes to consider himself ?Picky?. ?I like to wait for the right one to come along; court it for a couple of hours; then take it home ?and fuck it!? P to the L to the A ,Y ...AHH ?Boy you're a PLAYAH!This hot surfer stud wastes no time and immediately loses his shirt. His pecs are well defined, and the definition doesn't end there. The abs are next as the camera slowly pans down, following Bobby's fingertips as he runs them from his armpit, down around his pecs, across his abs, down his lats, and then dives into his crotch as he traces the natural V that disappears into his tight jeans. He pops open his pants and turns around to give us a better view of his backside. His bubble butt is perfectly smooth, and you can see the sexy tan lines that come from being on the water all day. He lays back and strokes his cock, which by now is at full throb. His sheer briefs hug his meat as he strokes and teases it. Bobby's cock is aching, and it's time to give it the attention it deserves. His cock is freed, and in no time, it's bobbing up and down on its own. His smooth balls and muscular thighs set the backdrop for the cock on display. ...and what a display it is!He stands and begins to stroke his swollen cock. Perfectly straight with a short cropped patch of fuzz; his thick 7? cock dances at his touch. He works his knob with one hand and tugs at his smooth balls with the other. A hot view from below gives you a great view of his ?ass-ets? as he continues jerking his meat. It gets better! He then goes face down on the couch and begins to hump away. His rock hard cock and balls are pushed back, and you can see what he's packin as his ass rises and falls! He looks right at you as he softly bites his lip. Makes you wish you were between him and that lucky couch! Grrrr This ride definitely looks better than any wakeboard we've ever seen! Bobby then flips over and starts stroking his cock to release. His balls pull tight as you hear this hottie start moaning, signaling the impending fireworks. Several ?Oh Yes!?s and a lot of heavy breathing come together to produce a huge blast! His first huge volley explodes into the air and lands everywhere, coating his chest and abs with cream. The rest of his load coats his navel. Whew! Seems like Bobby was a little backed up! Lucky for us, we were around to help out! Who knows, we may need to make ourselves available if he finds himself in ?similar straights?.",
  "models": [
    {
      "name": "Bobby Clark",
      "person_id": 28271
    }
  ],
  "release_date": "2008-02-01",
  "scene_id": 55324,
  "series": "No if's and's or BUTT's!",
  "tags": [],
  "title": "No if's and's or BUTT's!, Scene #02"
}