{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "At 6', 19yr old Miami native, Rico is quite an eyeful. Tall, sexy, muscular & unmistakably latin, Rico looks like one of those guys you'd see hanging out with buds on South Beach or Coconut Grove chasing the ?females?. This hot Columbian 'Papi' is packing broad shoulders, deep brown eyes & thick full lips. He doesn't have a preference when it comes to girls. Latino or white, it's all good; as long as they have some junk in their trunk. He loves the big booty girls. He was only 15 when he had his first sexual experience & he says it was unforgettable. The fact his mom walked in on them might've added to that; but, he didn't skip a beat ....& kept right on keepin' on! Now there's  dedication! His ultimate fatasy would be to have a crack at Halle Berry and if she's into anal ?he'd be all over that, too! Rico is a horny stud that's been working his cock regularly since he first discovered how to at 13. Lucky for us, we're about to get an idea of just what that looks like!Lying back in a tank with both hands behind his head, Rico begins by giving us a great view of his hairy pits. From the looks of his smooth torso, hair is a scarce commodity on this latin lover! Working the camera, like a consummate professional, he smiles & winks at you as he begins tugging his meat. A tatt in the form of Chinese script running down his stomach comes into view as he begins pulling up his tank. He peels off his tank & you can fully appreciate his smooth defined chest as well as the large tribal tattoo on his right shoulder. A few seconds later he's down to his boxers as he begins to tease his meat beneath the thin white fabric. His cock is rock hard & wanting more attention. Sitting on the floor, or on the chair, all the while stroking his swollen cock he continues to tease. He pulls out his thick uncut cock through his fly & just when you think its show time ...he grins as he puts it right back in! Ugh! This player knows just what he's doing!Standing up, he slowly turns as he peels off his boxers giving us our first glimpse of that forbidden ass. After giving us a few minutes to appreciate it; he turns around & shows us the main event?a thick 7? uncut meat! He proudly sways back & forth with a ?You know you want it? look on his face as his heavy cock swings to & fro. His dark foreskin rolls over his glistening knob as he begins to stroke one off. He squats down to give us a better view and rolls his finger around his wet knob, using his sweet juice as lube. From here he goes horizontal as he sprawls across the floor. Now we have a better view of the Columbian buffet he has to offer! The thick uncut cock, shaved balls & the hairy crack we had yet to see are now on display. He jacks his cock, lefty & you can see his smooth abs contracting as he nears orgasm. His shaved nuts are pulled tight as he gets closer & closer... ?I'm Cummin'!? followed by a few grunts & we have our much awaited finale. He grunts & moans as he shoots, sending volley after volley of cream just shy of his defined pecs. Mmmm?Que Rico!!",
  "models": [
    {
      "name": "Rico Salazar",
      "person_id": 28273
    }
  ],
  "release_date": "2008-01-25",
  "scene_id": 55325,
  "tags": [],
  "title": "Lean On Me, Scene #01"
}