{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Peter Stallion is a 22 yr old stud, measuring in at almost 6'. He has a body and face that scream for attention you could not get enough of and frankly, neither could we. We first brought you Peter a couple of months ago and know that his sinful looks, devilish smile and that accent which is just as thick as his lead pipe of a cock, aren't easily forgotten. Peter has made quite a name for himself back home in the Czech Republic, starring in many a straight gang-bang film. 'I love to be watched...' he beams after recounting some of his previous orgy experiences off camera where he and a handful of other lucky guys are left to service 20+ horny women a piece!  They do not call him Peter Stallion  for nothing: not only is he hung like a giant, he is as horny as the sole colt in a corral full of Phillies! Fortunately for us, there aren't 20 horny women around to satisfy his voracious appetite, so Peter's more than willing to strip down and stroke one off for us. Uncut, chiseled and buff-Prague perfection coming right up, CircleJerkBoys.com style!Leaning back on the couch, clad in his tight jeans and tight-fitting, mostly open shirt, Peter begins his command performance for us. He wastes no time as his hands are everywhere. Running under his shirt, feeling his rock hard pecs, and inside his jeans to greet the hardening piece of xxxtra thick cock he will soon unleash. His years performing really pay off, giving you one hell of a seductive strip tease! First the shirt, then the jeans, and finally the tighty-whities are all peeled off revealing everything he was blessed with. Moving to the couch, he gives us a perfect view of his back door as he begins humping into the couch. His perfectly round bum arches and falls relentlessly, making one a tad envious of all those girls back home that have him hard at work in the very same position. By the time our Czech stallion flips over on his back, he is at full mast and raring to go! -Giddy up!Peter strokes his massive cock slowly, humping into his hand. He uses his spit-slicked fingers to twirl around his knob, lubing it seconds before it disappears back into the thick foreskin that enfolds it. A close up of his shiny meat gives you a closer appreciation of all he's working with. The looks on this studs face are lust-induced. Everything from the erotic bare-all positions he gives you, to the light dusting of blond peach fuzz on his perfect ass, to the way his muscled pecs and abs flex and dance in tune to his stroking -all make your mouth water for more. An incredible aerial view helps you truly appreciate this stallion as he continues to work his bone. The seductive mouth, the smooth chest cascading onto his abs, past his navel and pooling into a short cropped fur oasis at the base of his engorged cock ...the scenery is breath taking! His heavy balls once swinging loose are now pulled up close so you know it won't be long before this show cums to an end. Never one to disappoint, Peter looks right at you as he unloads, coating his abs, creating a would-be pleasure trail of a power packed protein shake in a unique kind of cum-back offer that looks to be good to the last sticky, white drop!",
  "models": [
    {
      "name": "Peter Stallion",
      "person_id": 28080
    }
  ],
  "release_date": "2008-01-11",
  "scene_id": 55329,
  "series": "The Quick Fix",
  "tags": [],
  "title": "The Quick Fix"
}