{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Back for some more ?other side of the fence? man-to-man action is one of CircleJerkBoys fav's, Rex. This 25 yr. old x-marine has a natural way of attracting 3 things : ?Girls, Girls & Girls!? Sadly, most turn out ot be a lil crazy! After having Rex work you over with his thick 9? fuck stick?WHO could blame 'em?! Seriously! He loves dark haired girls with dark eyes & a nice bootie (i.e. Latin girls, basically!). Lucky for us, we happen to know that this horn dog doesn't mind the occasional walk on the wild side. So we've been able to get him together with the next best thing, sexy latin boys! Last time he was here, a couple months ago, we paired him up with bad boy, Speedy; which turned out to be an explosive session. This week we brought back sexy 24yr old Eli. Last time we had Eli here this Cuban cutie half a latin twosome that was muy  caliente! Eli, currently in school, has been too busy to do much other than the routine jack off to keep him from going crazy. Eli is versatile, but admits he loves giving head the most. So, if he loves 'giving' head & Rex loves 'getting it'...Why are we still talking? Let the games begin!!Together on the couch, Rex is already hard by the time Eli reaches over to inspect what's for dinner. Rex lays back & gives him full access & wastes no time in losing his shorts. Eli toys with the massive meat for a few minutes through Rex' boxers but he has sights on more than copping a feel. His boxers lose the coin toss & disappear; followed by Rex' thick cock?down Eli's throat! The looks on Rex' face tells you everything you need to know. BLISS! Eyes closed & moaning as Eli sucks his cock to the hilt like a starved calf. Rex bobs Eli's head up & down as he enjoys the servicing he's getting. Rex can't pass up reaching over to sample the sweet ass that will soon be his for the taking! Eli doesn't flinch as he works Rex' slick cock. No matter the position Rex fucks his face in; Eli is on it! Lying back as he strokes his own fat uncut cock; Eli nurses on Rex' cock as it dangles inches from his hungry mouth! Eli wasn't kidding?He LOVES suckin' cock ...and from the look on Rex's face he's damn good too!It's go time as we see our x-marine use his battering ram to gain access. Like any straight boy ?He wants IN! Eli grunts & groans, cringing as Rex continues his assault. It isn't long before Eli is taking his fat cock to the hilt. Rex h olds it by the base as he pulls out & slams back inside. It isn't til he flips slim Eli over that he's able to get his deep one. His heavy balls slap against Eli's smooth ass. Eli can't contain his moans & the look on Rex' face now buried ball deep says it all! 'We done good, Ma!' Eyes rolling back & at full speed, Rex plows into Eli missionary style. Eli submitting to Rex' desires, bites his lip & moans his complete approval. The chemistry between these two is unmistakable. The action works them into a fuck-frenzy & like unexpected credits in a great movie they stop fucking to lay side by side to finish off by hand. Rex is the first to explode & he does just that ?explode! His load sprays high into the air scattering his smooth body with jizz. Eli, who had just had Rex playing Prostate Pool deep inside him, unleashes a geyser of seed. The first two blasts hit his smooth chest and the other five land on his abs. Whew! We need to watch that again!",
  "models": [
    {
      "name": "Eli",
      "person_id": 27817
    },
    {
      "name": "Rex",
      "person_id": 28167
    }
  ],
  "release_date": "2008-02-08",
  "scene_id": 55322,
  "series": "Boys Just Wanna Have Fun",
  "tags": [],
  "title": "Boys Just Wanna Have Fun, Scene #02"
}