{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "CircleJerkBoys.com believes in truth in advertising, as apparently so does Tony as this 22 year old walked into the studio in a red shirt with ?Sinner? spelled out across the front and just the look in his dark brown eyes lets you know immediately that the word is far from honorary.  He lost his cherry at 15 a to horny 20 year lady, and just talking about that first time caused his shorts to go from flat to tented. ?I'm addicted to jacking,? Tony told us, ? once to three times a day since I was 13? and went on to share he has a bit of an exhibitionist streak. ?Not in front of a lot of people, but if a few want to watch me have sex, I would not mind at all.? It was final exam time when we filmed this, and cramming for exams left Tony no time to do any cramming of any kind, even his own fist, as he said he had a seven day back up of sperm ready to be released.  When we asked him what his biggest fantasy is, he said it would be a three-way with not two girls, but a couple.  That gave us a few ideas of what to do with Tony next time but for now, Tony has the same thing on his mind as we did, his cock.With a heavy lidded, lustful gaze, Tony stares into the camera as he rubs his crotch, licking his lips. He juts his hand inside his pants to work the pole which is getting harder by the second.  In less than a minute, his shorts are open, his shaft is in his hand, and from one look at how heavy those balls are, saying its been a week since he unloaded them was as true as the ?Sinner? emblazoned on his shirt. Tony has the slight bad-boy attitude mixed with a ?watch if ya want ? I don't give a fuck? vibe that makes him one sexy package. Even though Christmas is over, that package is what Tony is ready to open next, and he wants to do it while you watch.We get a glimpse of his hole as he takes to the chair, spreads his legs wide, and works that pole while he gives those bloated balls the breathing room they command. That sack is so full; you can feel the ?blue balls? just by looking at it. If you had been wondering why Tony keeps biting his lip, that's why!  When he takes a seat on the arm of the chair, unless we're mistaken, he seems he was enjoying a little rear stimulation as he bends over and continues to work that pole. As he shows off his hole, he does not have to say a word to let you know he is aware that his backside is far from strictly decorative.  As he moves to the chaise, he reaches back and grabs onto the cushion as if he is afraid the velocity of the upcoming explosion will send him flying across the room. But what he sends flying is an assault of sperm ? the first three jets fired well past our camera while the last few continued to ooze down his shaft onto his fist long after we stopped rolling.  We will be seeing more of Tony soon, and it is our goal to make it happen that, before he leaves, a shirt with the word ?bottom? will be as true as ?sinner? is today.  On that note, bottoms up guys ? Happy New Year from all of us at CircleJerkBoys.com",
  "models": [
    {
      "name": "Tony Michaels",
      "person_id": 27902
    }
  ],
  "release_date": "2007-12-28",
  "scene_id": 55334,
  "series": "Irresistable",
  "tags": [],
  "title": "Irresistable, Scene #02"
}