{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "From the minute he first opened his mouth here on CircleJerkBoys.com a few months ago, it was obviously that Nino  was from the Big Apple with an attitude to match. And as his cock sticking out of the hole in jeans showed even more clearly, he had a cock that never sleeps either.  Nino dreamed of making an adult video, and we were too glad to help him make that a reality. But it was when we paired him up with Malachi that they made all of our dreams come true as Nino's cock, that thick, pierced spear of penile perfection, was so irresistible, that even straight Malachi  had to give it a taste test.  We do not blame him, as that is what we had been dying to do from the instant we saw that thick pole snaking its way out of his pants. Apparently Nino did not mind the oral attention either, as he lived to tell the tale and came back for more.  Nino has a brand new girl and a brand new tongue ring. While having a hard cock is nothing new for this guy, he promised he had saved up a load just for us; and we were more than ready to make a withdrawal.Nino stripped off his shirt like someone just poured itching powder down his back. Since the sooner we got to see his smooth, etched, six pack abs and the hard nips on his rounded pecs, the better. His hands find their next destination quickly - the buttons of his fly - and once open, the sheer hardness of his bloated fat Italian sausage trapped in his shorts causes the fabric to explode out of the opening. Not able to wait one more second to get his hands on that magic pole, rather then shucking the rest of his clothes, Nino fishes his cock out the fly of his shorts. He works it with both hands before losing his jeans, rolling over on the bed, and offering the golden view his snowy white ass cheeks, the dark hole in the center and long, throbbing, dripping cock hanging down below. After a casual, then not so casual digital hello between his hole and his fingers, his cock was ready to resume its rightful place as the center of his universe.Nino moves to rest his upper body on the bench as he uses both hands to pull his cheeks apart as he drags his drooling cockhead back and forth on the carpet below. The rough texture supercharges his desire, causing him to roll over and work the puddle of precum back into the head before he bolts to take a seat on the headboard. This allows him free access to both his pleasure zones, which he pounds away at with the fury that causes him to fall to his knees on the bed and fire off a load that shoots out so far, the first two jets come in for landing well over the mattress, and the remaining three form a white lake of special eggnog on the comforter that could serve a party of 12. Guess what is being served at the CircleJerkBoys.com holiday party this year, guys? Bottoms up!  ",
  "models": [
    {
      "name": "Nino",
      "person_id": 28254
    }
  ],
  "release_date": "2007-12-21",
  "scene_id": 55335,
  "series": "Holy Hand Job",
  "tags": [],
  "title": "Holy Hand Job"
}