{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Fresh off the plane from Prague, Peter Stallion brought his thick accent, and even thicker dick, and headed for the CircleJerkBoys.com studios just in time spread a little holiday cheer. Well, come to think of it, there is nothing little about Peter, and it was not exactly egg nog he ended up serving, but something even higher in protein. This 22 year-old, with 187 pounds of muscle packed onto his almost 6' frame, has the sculpted face usually found in Greek sculpture ? and a body to match.  ?I need sex five times a day,? Peter said matter-of-factly, ?I can fuck very hard for a couple of hours but nothing turns me on more than people watching.?  That would explain why this veteran of straight gang bang films has a world wide fan base of with members of both sexes, but Peter has never been alone in front of the cameras - until today that is - and we can think of no better way to usher in the spirit of the holidays than with this Ghost of XXXmas Hot!Undoing his belt with all of the panache that opening the gates of heaven deserves, Peter continues with his shirt, cops a feel of the smooth rounded pecs underneath, then stands up, letting his pants ride low on his lean hips, just under a world class set of abs. After further, careful exploration of his own chest and shoulders, Peter's hand makes a dive right into the massive bulge in his pants before doing a quick turn around to show off an ass that, even though his pants, you can tell is so firm and rounded you would need the jaws of life to get to the creamy good parts at the center. Standing on the bed, with a shake of those trim hips, his pants puddle around his ankles. Getting our first look at his legs, it is a wonder the trousers slid so easily down over a set of the most magnificent legs, the tear drops of his quads visible from across the room. As for that bulge in the middle that one could see from a mile away, we are about to get up close with it as Peter gets very personal. Peter mounts the bed, bends his knees, and ceremoniously sends his briefs flying as his full hard cock lands with a thud back against his abs. Looking right into the lens with the hungriest, horniest primal challenge that asks ?how bad do you want this?? without saying a word, Peter pumps his cock with one hand as his big, wide sack does its ?Xmas is cumming and soon so will I? dance below. Bolting up onto the mattress, Peter does an about face, flexes his glutes, and pulls his cock back between those Sequoia-like thighs and squeezes his dick so tightly, the remnants of his foreskin kiss the base of the big head. Falling back down, Peter furiously hammers away, his balls going to pink and loose to crimson and tight right before your eyes. Looking down at his cock with a worshipful gaze, one final tug and it's a blizzard of cum all over his sweaty abs ? well, not just his abs: if you want to see where the first splat landed, look at the wet spot on his upper pecs. You can bet we are going to get Peter back before he returns to Europe, and it's our mission to find out just how wild this wild man will get. Stay tuned, guys!",
  "models": [
    {
      "name": "Peter Stallion",
      "person_id": 28080
    }
  ],
  "release_date": "2007-12-07",
  "scene_id": 55338,
  "tags": [],
  "title": "Viva Miami!, Scene #01"
}