{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We love the holidays here at CircleJerkBoys.com, as everyone needs to make some extra cash for gift giving. When the guys in need are none other than Rex  and Speedy, they may make the extra dough, but it is the rest of us who get the present of seeing a couple of straight guys fuck. The only thing better than seeing Rex's fat, cut, eight inch slab of cock in his own fist is seeing it invade the tender territory of a hairy hole. And holes do not come much hairier or hotter than Speedy's. It is not often we can get Rex to play ?hide the sausage?, and it required a huge pile of cash to get Speedy to lift his legs ? but we had the time and the dime. With Xmas just around the corner, our mission was to get these guys cumming before Santa.Lying back on the bed, they are both grabbing at their cocks, and it was not long before they each had a handful of meaty cocks that needed to be taken out to play.  Their shirts went flying, their zippers went down, and laying shoulder to shoulder, the twin trouser tents soon appeared as both their hard cocks strained against the fabric of their boxers. Before they came down, the lube went across, and soon both those poles were rock hard and leaking.  There is no rubbing, caressing and kissing here ? there are two guys doing what they have to do to earn their pay day. After seeing just how thick and fat Rex's cock is, Speedy makes sure that long slab is well lubed as he knows where that fat throbbing cock is going next...right up his ass.Rex cops a quick feel of Speedy's hairy cheek like a man kicking the tires of a new car ? to make sure it is solid enough for the punishment about to be inflicted.  Speedy plants his ass on the blunt head of Rex's gloved cock and bites his lip as he slowly feels the huge helmet force open the tight ring of his hole, wincing in pain as he lowers himself inch by inch down Rex's pole.  Bending Speedy over the chair, Rex grabs his thick cock by the base and stuffs it back and forth, in and out of Speedy's ass before taking a seat and having Speedy climb on one more time. Something is a little different this time as Speedy does the breeder bounce ? his cock gets hard ? and stays hard as his balls being to tighten up. Did Speedy learn that maybe his hole is not just decorative after all? We are not sure about that, but there is no denying the evidence that soon is a puddle on the floor below in the form of a thick white load. Yes ? Rex literally fucked the cum right out of Speedy before depositing a huge load of his own.",
  "models": [
    {
      "name": "Rex",
      "person_id": 28167
    },
    {
      "name": "Speedy Gonzales",
      "person_id": 28281
    }
  ],
  "release_date": "2007-12-14",
  "scene_id": 55337,
  "tags": [],
  "title": "Like A Virgin...KINDA!, Scene #01"
}