{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "'Slam, Bam, Thank you Ma'am!' were the words 22 year-old Steve used to describe his first sexual experience. I guess the girl that made the moves on him, while his parents were 'away', saw early on just what this hot ex-military stud had to offer! Steve comes across rather shy as he talks about his interests and sexual experiences. Hesitant to make eye contact, this dreamy 'boy-next-door' type, with squinty eyes reminiscent of the clean cut Wally Cleaver, is anything but. He recalls one of his experiences while on deployment in Malta with what turned out to be a very horny European girl he met on the net. A bar, ditched friends, and a bowling alley's bathroom stall later, he laughs as he confesses: 'I just wanted to have a piece off ass so I got it and I left her!' You can't help but be drawn in by his disarming charm and down-home accent. He blushes as he admits that according to everyone he knows his best asset is his butt! We'll soon see about that! What you see is what you get with this 'tits and ass' man. When asked if he'd done anything special with asses-he was at a loss for words! You gotta love the way taboo subjects will often times throw straight boys for a loop. When we asked poor Steve if it's something he'd consider doing in the future, the best he could give us was '...maybe, possibly, I don't know ...depends!' Classic!Trusty skateboard by his side, Steve leans back against the lockers as he begins to grope his rock hard cock. Apparently, this straight boy's more than ready to show us what he's packing in those jeans. He begins pulling his tee up, giving us glimpses of the more than happy trail that runs ever-so-slightly up his navel and nestles in between his perfectly smooth pecs. A tat of praying hands adorn his left pec as it peeks out from underneath his white tee. Steve doesn't waste any time and is soon undoing his jeans and giving his meat some much needed breathing room. His cotton clad cock throbs at his touch, and in no time it's released from its boxer brief confines. Steve kicks off his shoes, the jeans are next, and then his tee as he gets comfortable to lay back and stroke his cock. This must be what he looks like laying on his couch where he admitted he jerks off two or three times a day watchin' porn! Steve goes at his cock as if he's the only one in the locker room, massaging and tugging at his balls, giving us a great view of his thick, muscular thighs.Moving from the bench to fully upright, this soldier stands at ease while his cock remains at attention. Steve then turns around, showing us his best 'ass'-et! Well, '1000 flies can't be wrong about @*#!!' He rubs and flexes a smooth, round, bubble butt for us. The kind of ass you wanna bounce more than a quarter off of! Standing, on all fours, leaning over on one knee... no matter what the angle, you get an appreciation for all that Steve has to offer. The subtle sounds of his exhale, and the sound of his hands on his dry cock as he jacks it 'sans lube', fill the room. I'm sure this only made things a lot easier while on deployment in Malta, or anywhere for that matter - needing to rub one off in his bunk without anyone noticing. Steve then sits back on the bench and picks up the pace, jerking his meat. In no time, you can hear sporadic breathing, signaling the impending release. He moans, once, twice and then grunts as his weapon of choice discharges-unloading its creamy content on the sole patch of dense bush below. Makes you wonder just how many of our boys at home and overseas are up to the same exact thing as you're watching Steve service his! ",
  "models": [],
  "release_date": "2008-01-04",
  "scene_id": 55331,
  "series": "The Anywhere Man",
  "tags": [],
  "title": "The Anywhere Man"
}