{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Pretty common in real life, your bud gets a girlfriend and seems to drop off the face of the earth. Well, the same thing happens here at CircleJerkBoys.com, and when the bud in question is a guy like Sean,  18 years old, killer smile, smoking body and a new found appreciation that his own world class ass is not just decorative, but a source of untapped pleasure as well, absence sure makes the heart grow fonder ? and the dick grow bigger too. It was almost a year ago we first had the chance to be awestruck, watching him in his very first stint on any camera that ended with a load that literally spayed across the room. Out of the blue, he called us, saying he was back in town before leaving on a trip, then off to college and would love to make a little extra cash for the journey - if we were still interested, that is. Sean is one of those guys whose picture never left the bulletin board of studs we were dying to film again, so of course we jumped at the chance. When he walked in the door, it was clear he had spent a good portion of the last year in the gym, as his arms were about to rip the fabric of his sleeves open. His waist was so trim, his pants were riding low and sexy on those made-for-fucking hips. As we were getting set up, Sean told us he had just split with his girlfriend, and she was the reason he never returned our calls ? she wanted him all to herself. We cannot blame her for that, but he really enjoyed rubbing it off in front of our camera and had been looking forward to this as much as we were. Not sure if that makes us bad people, as we are not one to come between a guy and his girl, but the fact that Sean is single and back, well ? the hell with pumpkin pie, now that is really something to be thankful for. As Sean raises his shirt, it is like the curtain going up on perfection; his abs are so cut, they could be used to sand the point off the top of Washington Monument.  His biceps are the size of golf balls, his body fat is so miniscule that his pants can barely stay up, and as he turns around, the muscular symmetry continues across his v-shaped back that flares into expansive, powerful shoulders.  He looks right into the camera with a modest, ?this ain't' nothing? smile, but with just the right amount of confidence too. He has worked his ass off for a hard body like this, and having it appreciated is making other things hard too: his dick and yours. Following the single line of hair from his navel down, as Sean arranges and rearranges that growing meat inside his boxers, we get a peek or two of his thick, dark bush before he turns around and liberates one perfect ass check, then the other. Next, in a move that almost made us drop he camera, he bends over as he steps out of his boxers, flashes us a fleeting glimpse of that perfectly puckered rosebud between his cheeks, staying in that position to give us a nice long, lustful look, before pulling his cock down between his legs to work the pre dripping from his head to use as lube. All greased up and no where to go? Hardly! He took to the bed, spread his legs wide and let his hand do what we wish ours could; give that hard, hungry cock the stroking it needs.Laying there, stroking away and staring right into the lens, Sean looked like a vision of absolute perfection. As he rolled over, showing off that dark hairy hole in the process, he redefined what magnificence really means. He then stands up on the mattress, bends over to grab the headboard with one hand while he reaches around, pulls down his shaft, and resumes his stroking with the other. That hand continues to go down his shaft, over his balls, and up to his cheeks, making a pass right over his hole on its way back. That is all it took for his cock to throb visibly, so swollen it was bobbing up and down in the air hands free. Moving to the chair, he resumed his one handed beating, but his other hand found a new home, right under his sack to rest on his ass lips.  Suddenly moving to sit on the back of the chair, giving him great access to the love button underneath perhaps, we lost sight of his finger right before we gained site of white explosions that he covered the pillow under the seat below with.  There's no better way to mark Turkey Day than we can think of. Happy Thanksgiving from all of us at CircleJerkBoys.com",
  "models": [
    {
      "name": "Sean",
      "person_id": 27941
    }
  ],
  "release_date": "2007-11-23",
  "scene_id": 55342,
  "tags": [],
  "title": "No Co-Pilot Needed, Scene #01"
}