{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Angel is equal parts Brazilian, Portuguese, Irish and Israeli, and so damn hot, we had to take the batteries out of the smoke alarm. His arms look like they are about to rip through his shirt, his teeth are so big and bright it looks like the ?after? in a tooth whitening ad, and his smile will just make you melt.  ?I'm all about the butt,? Angel told us ?Lick 'em, smack, toss 'em, throw 'em and fuck 'em? is what I like to do to a fine ass and what a coincidence, we are having the same thoughts about Angel's own ass, but only after we got to see what was making the healthy bulge on the front side. When most guys say they get so much sex, they do not need to jack off, we know that it usually wishful thinking. But with Angel, as fine, sexy, charming and gently masculine that he is, coming from him, we do not doubt it for a second. ?I want to be so cut, it will hurt your eyes? he says as he flexes his is big arms. It was not our eyes that are hurting; just looking at him fully dressed has us blue balled and fortunately for all of us, he does not stay fully dressed for long.By the time we got the camera rolling, like an early holiday gift, Angel had already lifted his shirt and proudly displayed the marble smooth abs so etched to perfection and a stomach so flat, if it can not be in your bed, it deserves to be in a museum. Tugging off his shirt, the sheer expanse of his rounded pecs keep his wife beater up around his shoulder, flanked by inked arms and shoulders that are bookends of strength and virility. But it is those lower abs, so tight and hard, they keep your eyes firmly on the prize - just on the other side of those jeans as you watch his hand trail down the center of his chest where those magnificent planes of muscles meet with perfect symmetry. As his fingertips slide below the waist band, the zipper comes down, and those snowy white briefs explode with promise, you know it will not be long before Angel shows us where he came from...heaven. And this is one time that heaven can not wait ? and neither can we.His six pack just as shredded even as he lays down, Angel grabs that bulge and slowly rubs the growing flesh underneath, until the thick, blunt, cut head pops out over the waistband like the tower of strength befitting a guy of this stature. Stepping out of his boxers and standing there, stroking that dark fat pole, Angel is like a buffet of everything that is sexy on a man; even another straight guy would get a boner checking out the view. After a few minutes of, well, pleading, Angel answers our prayers and climbs on the couch on all fours, pulls his cock between his legs, and offers up a brief glimpse of an ass wet dreams are made of. Turning over onto his back, his attention returns to where ours has been all the time; his cock. It is not just because his waist is so narrow that his dick looks so thick, that fucker is that fat. And what a mouth, or ass full it would make. His slow steady rhythm soon has a back beat of low, near primal moans as that cock explodes out a torrent of white jizz. At the end, that is not a smudge on the camera about a third of the way from the right of the screen, it is a bead of cum that flew right on the lens, because a man like Angel is good to the last drop indeed.",
  "models": [
    {
      "name": "Angel 1",
      "person_id": 1
    }
  ],
  "release_date": "2007-11-09",
  "scene_id": 55347,
  "series": "Time Shared",
  "tags": [],
  "title": "Time Shared, Scene #02"
}