{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "His name may be Maine, but this blonde haired, hard bodied, stunner looks every inch the California hottie that he is ? right down to those eight inches between his skateboarding legs.Maine lost his cherry at 14 to his best friend's cousin. He has not stopped fucking ever since, and nothing makes him as hot as a lady's ass. ?Whenever I see a hot, fat, juicy ass ? I will do anything she wants me to ? but not always everything I want to,? he told us in a laid back West Coast attitude that makes him all the sexier ? as if he needed any help in that department.  Maine headed to Hollywood with dreams of being a star. While he has yet to make it to the big screen, the monitor right here, logged into CircleJerkBoys.com, is a great beginning to his body of work since his body is one you only wish you could work over.Maine is one solid hunk, and the strength of his frame shows through even in his baggy clothes. As he unbuttons his shirt with his toned, tempting arms, his smooth chest and flat abs come into view under his well rounded pecs. When he undoes his fly, the white fabric that explodes out of the opening, like a can of pop-and-fresh biscuits just cracked against the counter, indicates that just like his upper half, there is something sizeable inside of those baggy boxers. The lump steals Maine's attention as well, and he starts immediately playing with the precious cargo inside - with his jeans still puddled around his ankles. His hand starts moving farther and farther out to the side as he flogs his still trapped log. His waist band dips down far enough to expose a dark gold thick bush. Yes ? Maine is a natural blonde, and perhaps the only guy in California who does not go overboard with the trimmers, which makes for the perfect crown for Maine's man vein just below.As he stands up, holds onto his sack with one hand, and grips his fist with the other, every etched muscle starts to glisten as he works up both a sweat ? and ? his dick. As his cock swells to eight throbbing beautiful inches, Maine moves to the floor, his heavy hanging sack hitting the carpet before those delectable, creamy white ass cheeks. As good as he looked standing erect, he looks even better on the floor, with his dick and the rest of his body working like a well greased machine focused on the sole purpose of getting off. We wish his fellow breeders would follow his lead: Maine's pubes are untouched, and the most expansive we have seen in a long time. That does anything but detract from the size of this long schlong. Moving over to the bed, Maine got comfortable enough to finally put his ass on display and damn, in a move we never saw coming, not only does he open his cheeks to show off his hole, he lets his fingertip doing the walking right into his hole on a journey he has clearly traveled before.  That is all it took for his cockhead to swell like a mushroom cap, his balls to bloat in their sack, and the jets of white rain to pour out ? the first splat landing up by his nipple and the remaining jets leaving a trail back down to his pubes.",
  "models": [
    {
      "name": "Maine Rodgers",
      "person_id": 28276
    }
  ],
  "release_date": "2007-12-01",
  "scene_id": 55340,
  "series": "The Good Samaritan",
  "tags": [],
  "title": "The Good Samaritan, Scene #01"
}