{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Thanksgiving is a holiday when people make the pilgrimage home. When the people in question are none other than Stefano and Miguel,  and the casa they are returning to is the CircleJerkBoys.com studio, all we can say is, let the holidays begin! Though Miguel looked like a wild stallion with his hair down, it was when he really let his hair down and gave Eli's ass a solid pounding, that this long-locked Puerto Rican really captured your attention. Stefano, that exotic Sicilian and English mix with that killer, lean, smooth bod and always hard, thick 8? dick, was an instant star from his first appearance. It was his last, when he played touchy-feely with Commando,  that we wanted to know the same thing you did...just how far will Stefano go? Today we have the answer, and when we share it with you, it will definitely be one you will give thanks for!They may have come dressed like straight guys, Stefano in his 'do rag and Miguel in his hat, but once the cash came out and the porn went on, they went straight for each other.Headgear, footwear, and everything in between came off in a flurry until Stefano rubbed his bulge against Miguel's ass and let out a nervous giggle as if he could not believe what he was about to do.  Stefano's dick was rock hard from the word go, and after he swung his around Miguel and guided that mouth to where he wanted it, right on his dick, Miguel's own bone came immediately to life. After Miguel grabbed the luscious curve of Stefano's ass to pull his own mouth deeper, then got a taste test of Stefano's dick, the two faced each other and jacked their cocks together until Stefano pushed Miguel face down on the mattress and started rubbing his cock where it was going next...Miguel's ass.Stefano has no sooner put on the condom before it disappeared, as Miguel climbed over him, lowered his hole on his bud's gloved staff, and pushed himself down in a fast steady push before immediately riding that cock like a pony while he fisted his own meat furiously. Miguel is clearly most used to being on the giving end, and his tight ass did a number on Stefano's thick meat, causing Stefano's usually long hanging balls to contract almost immediately. Flipping Miguel over onto his back, he grabbed Miguel's thighs, spread him wide, and gave that hole the hungry-for-cock like a bitch filling it is demanding. In response, Miguel's hole inhaled every inch and soon exhaled a load of jizz all over his belly. With Miguel's hand running up and down Stefano's sweaty chest, Stefano soon adds his own jizz to the cum pile on Miguel's stomach, his cock never softening and the grin never leaving his face. So, we learned something today guys: you really can cum home after all. From Stefano, Miguel, and all of us at CircleJerkBoys.com, Happy Thanksgiving.",
  "models": [
    {
      "name": "Miguel",
      "person_id": 27783
    },
    {
      "name": "Stefano Ricci",
      "person_id": 28225
    }
  ],
  "release_date": "2007-11-16",
  "scene_id": 55344,
  "tags": [],
  "title": "Just A Lil S&M, Scene #01"
}