{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Caden is a twenty-one-year-old construction worker on the night shift who looks like a good boy, acts like a bad boy, and in his pursuit of getting off in every possible place he can think of, he has gotten caught jacking by Mom, walked in on by his dad while fucking the neighbor girl, and has spilled loads at his job, on airplanes and in ?every Mickey D's in Lubbock.? We learned long ago here at CircleJerkBoys.com that when it comes to horny heteros, the more innocent they look, the dirtier they really are. With his toothpaste ad smile, precious dimples, tight body, and tousled mop of hair, Caden may look like kind of guy a girl loves to take home to meet the folks, when in reality, the only thing he wants to do is take down his pants and get off as many loads as possible. Would we stand between a breeder and his ambition? Not on your life!Standing 6' plus, Caden is a cool, tall drink of water, and as he stretches, he reveals a glimpse of the happy trail growing up from his jeans, and we are immediately getting thirsty to see what is growing a little further south. As he pulls off his shirt, we are treated to two dark forests of hair under each arm and a swirl of fuzz around each nipple. We can also see what looks like a name tattooed on his upper right hip, but we cannot quite make out the name. But do not worry, we'll be coming in for a closer look soon. Caden turns to the side, undoes his belt, and lowers his boxers in the back, showing off the rounded white globes of an ass as white as the rest of him before turning his attention to where ours is already focused?that tasty looking seven inches on the flip side.Getting a bird's eye view down his tight torso, we see that cock coming to life under something that is an endangered species: a 100% untrimmed, thick, natural bush. As if he could read our minds, he soon turns around, bends over, and cups his balls, allowing that furry crack to take center stage before having a seat and working that bloated sack again with his cock joining in on the fun. As Caden massages his shaft with just his thumb and forefinger, his dick is pointed directly at the lens, looking like he is getting ready to feed it right down a hungry throat. When he wraps his fist around it next, we know he means business, as if that tightly-coiled sack was not a clear enough indication of the pressure building rapidly to the point of no return. Eyes closed, head back, and moaning loudly, Caden spills a thick load that collects on his palm before dripping down into his bush. The only question at this point is which dirty boy needs to clean up more...him or you?",
  "models": [
    {
      "name": "Caden",
      "person_id": 28286
    }
  ],
  "release_date": "2007-09-28",
  "scene_id": 55358,
  "tags": [],
  "title": "The Bridges Of Stroking County, Scene #01"
}