{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Fred boarded his way up Laguna Beach to our temporary California studio with his cap on backwards, a beer in one hand, a messenger bag filled with porn over his shoulder and a bulge in his shorts. They do not get much more ?skater? than this 22-year-old. One look at those dimples on a face that redefines ?adorable?, and he will skate his way right into your heart as well. Fred has a laid-back manner on just about everything except getting laid. He lost his cherry to his sister's babysitter when he was 12 and has not stopped humping since. The mattresses on display in the bedding showroom at any big department store are used to being taken for a test drive, but Fred used them to give his girlfriend a test drive of his cock while the lucky shoppers cheered him on. It flattened the tires on his party bus when someone called the store guards, but Fred assures us he came before security did. As for today, he is raring to go. And when it comes to public displays of self-affection, the CircleJerkBoys.com liberal policy, especially with studs this hot, can be narrowed down to 3 words: bring it on!Fred flips his lid to remove his shirt. Looking at that smooth, tight, naturally-hairless and perfectly-toned torso, we do not notice that he puts his hat back on like it is his uniform for what is going to happen next. Grabbing his favorite magazine from his stash, he opens it to the centerfold before opening his belt and kicking off his shorts and boxers. Immediately afterwards, he produces a thick, mouth-watering slab of breeder bone that is as stiff as the skateboard next to him. His abs are coiled, lean, and featuring a thin treasure trail in the middle as the only hair to be seen from his nips to his thighs. Ordinarily we prefer a little grass in the infield, but Fred's cock is so stiff, so long, and so fat that for once it is actually like a gift to have no fur obstructing the view of a dick this perfect. He grabs the lube, spreads his legs, and leans back against the lockers. Greasing his pole, he flips his hat around and stares into the lens?it's game-time and he is ready to play.We have seen 200-plus guys doing for us what they have only done in private before, but never have we come across a guy that looks as hot in just black and white socks before. His cock, now glistening in an alchemist's pre-cum and strokin' lotion, is a feast for the eyes. Though like you, we have other body parts we would like to use on Fred to show him just how much we appreciate every inch he so freely offers. Standing up, his thick arms ripple as he begins to stroke his way home, his balls contacting as he covers the bench in a heavy load of white rain. Glancing down at his pool of jizz, he looks at the camera and tips his hat to the imaginary ladies he just performed for. Most straight guys are not so polite once they cum, though we resist the urge to ask him if he wants to cuddle. But we did thank him for giving the term ?stiff as a board? a visual we will never forget.",
  "models": [
    {
      "name": "Fred",
      "person_id": 29905
    }
  ],
  "release_date": "2007-10-05",
  "scene_id": 55357,
  "series": "The Magic Bullet",
  "tags": [],
  "title": "The Magic Bullet, Scene #02"
}