{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We last saw Deklan  on the eve of a bodybuilding competition where he showed you can indeed improve on perfection. That chiseled, brooding face is still leading-man worthy, but his already fine physique had been honed into a lean, beefy symmetrical slab of muscular perfection, while the endorphins released as he bulked up elevated his already legendary sex drive into the stratosphere. As if he needed any help in the cock department, those fat-free abs made those eight, thick, cut inches of breeder bone appear even larger. And just as in his third appearance here  at CircleJerkBoys.com, Deklan has certainly come to terms with the beauty of his ass and his relish at showing it off.  Deklan is back for a fifth time, and we think that it's pretty fitting since he has kept our hands busy since the first time we saw this hottie.Deklan has his jeans open and his hand inside his underwear, working his bone before we even start the camera: ?I am so horny today, I couldn't wait? he explains. Of course, no explanation is required on our behalf?getting up close and personal as soon as possible with a dick this big and juicy on a man this hot is our favorite way to spend an afternoon. He makes history of his shirt, of course showing off that inked, buff chest as he moves to the chair for some more stroking, before standing up and letting those glorious glutes appear once again. Settling back in the chair, he resumes tending to the object of our mutual affection: his dick. Fisting it through his shorts before tugging it out of the bottom hem, when he stands up and grabs the lube, we know he is getting ready to serve up something delicious, and damn, our appetites, amongst other things, are wet with anticipation. His cock stands out, hands-free against his body, oiled for action and stiff as steel. Not one to let a good greased cock go to waste, Deklan grabs the pocket pussy and proceeds to take it for a test drive. From the look on his face, he is definitely enjoying the ride, but decides nothing is better than his own hand, though that does not stop him from plunging his penis inside the fleshlight once more for good measure. Of course, the best measure of all is now found on the ruler, as his cock is now throbbing hard and lands with a thud against his abs. As he moves to the floor, he spreads his legs and immediately resumes his stroking with a double-fisted, hand-over-hand attack that soon propels a heavy load that lands all over his chest. We are not sure when he will be back from California again, but when he comes back, we will make sure he cums back here!",
  "models": [
    {
      "name": "Deklan Connors",
      "person_id": 28224
    }
  ],
  "release_date": "2007-10-12",
  "scene_id": 55355,
  "series": "Members Only",
  "tags": [],
  "title": "Members Only, Scene #02"
}