{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It has been over a year since Rex whipped out that legendary, fat baseball bat of a cock outside at the pool, producing a load as thick as his Boston accent. Though we have seen Rex pound Antonio's hole into submission, prior to his last solo, Rex kept his hands, and everything else, to himself during the ?Four Handed Jizz?  though Aiden, Damien and even Anthony threw caution to the wind and got lost in the moment. What was never lost is the CircleJerkBoys,com rule # 69: the only thing that is better than seeing Rex's thick cock being fisted by his own hand is seeing it being inhaled by a tight man hole. Rex needed the cash, and as for Keegan, after discovering just how enjoyable having Christian's fat pole excavate the lower regions of his throat was, he was ready for Rex's cock to play hide and seek in his other hole. When the ladies find his cock too big for them, Rex looks directly at the camera and says ?I can always make it fit...well almost always.? Keegan's eyes go right to Rex's crotch as he declares ?I am up for the challenge. ? As a matter of fact, up is a very accurate statement for the condition of both of their cocks; and when you see what happens next, it will apply to yours as well. In an effort to move things along, Keegan helps Rex out of his shirt. We can immediately see that despite what good a shape he was always in before, Rex's fine body has never looked better. His arms are huge, his pecs full and rounded, and his wide, expansive chest tapers into a tight, trim waist that had never been so narrow. But as he stands up, even in his baggy shorts, his bulge is huge, and Keegan's mouth goes right to the meat through the fabric.  Removing the shorts and now resuming his taste test one step closer to the entr?e, through just Rex's underwear now, Keegan seems intent on exploring with his tongue every inch of the fat cock that is not only having an oral layover, but making in final stop ? right up Keegan's hungry hole.Rex is not quite done with hole number one yet. Giving Keegan a solid skull fucking while standing over him, he keeps his cock firmly in place as they both settle down on the bed. Keegan spreads wide and rests his ankles on Rex's shoulders. Rex grabs his own cock by the base and, with no ceremony or pretense, rams it all the way home in one solid steady push.  Keegan's face is contorted in that ?careful when you wish for a big dick? look as you can practically feel the pain as his hole stretches out to try and accommodate the thickness of Rex's cock.  The combination of this much penile real estate proved to be a lethal one for Keegan, who reluctantly surrendered to the pressure in his balls by dumping a huge load that continued to stream out of his cock as Rex stood over and him and added a massive serving of jizz that mixed with the considerable lake of sperm Keegan has just contributed. As Rex rubbed his cooling cock head against Keegan's, in what we are now calling the ?straight guy's good bye kiss,? we learned that at time like this, it is ok to kiss and tell after all.",
  "models": [
    {
      "name": "Rex",
      "person_id": 28167
    },
    {
      "name": "Keegan",
      "person_id": 28259
    }
  ],
  "release_date": "2007-10-19",
  "scene_id": 55352,
  "series": "Stale Mate",
  "tags": [],
  "title": "Stale Mate, Scene #01"
}