{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "When we were in California, Shawn responded to the ad we placed - but not the one for models, the one for a production assistant. Proving more than capable behind the lens during our week there, this 25 year old has a shiny smile in the center of his handsome face, an ass that fills a pair of jeans like no one's business, and a 6'3? frame that we thought belonged in front of the camera rather than behind. Since he had done such a good job for us, we left him with a few of the DVD's we used during our stay to help with the occasional shy erection of nervous models. He wasted no time in popping in the disc, and immediately thereafter, popped some wood. Walking back in the room as we were starting to collapse the lights, Shawn had the most mischievous leer on his face and his hat covering his crotch. Then we noticed his hands were free and when he asked if the fans might want to see what he was using to hold his hat ? we knew this trip to the sunshine state was going to end with a bang ? or should we say, a pop.He put his hat back on his head but it did not stay there long, and neither did his shirt. Despite the thick fur under his arms, his chest was virtually hairless save a small, thin, sexy trail coming from his navel and disappearing into his pants below. Under his jeans were the typical baggy ?straight guy? boxers, but within a minute, they too joined the rest of his clothes on the floor. Grabbing two handfuls of lube, Shawn greased not only his cock, but his balls as well. With his index and finger only, he slowly massaged his shaft until all seven inches were at attention as his low hanging balls danced in their sack underneath.Taking a seat, his cock seemed to have taken on a new life of its own, growing an additional inch in length and just as much in diameter. His fat shaft, the thick vein on the underside bulging out, tapered to a streamlined, torpedo shaped head, perfectly designed to slip into tight spaces. When we asked him to turn around and show off his ass, his face turned bright red from blushing so hard. But the view of his round white cheeks and hairy crack was well worth the wait. When he turned around to face us after, the blood had drained from his cheeks and gone right to his dick as it seemed to get even fatter. Falling back in the chair, a breathy ?I'm going to cum? escaped from his lips as a thick white load escaped from his balls.  This was Shawn's first time in front of the camera but will it be his last? We're headed back to California in the spring, and we'll keep you posted.",
  "models": [
    {
      "name": "Shawn",
      "person_id": 28284
    }
  ],
  "release_date": "2007-09-26",
  "scene_id": 55350,
  "series": "The Jerk According To Sean",
  "tags": [],
  "title": "The Jerk According To Sean, Scene #01"
}