{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Before he was even done with his interview a few weeks ago, Nino's eight-inch Italian cock was rock hard and sticking out of a hole in his jeans, leaking a steady of stream precum. On the opposite end of the spectrum, the very next week Malachi teased us by showing off the bulge made by his nine-inch dick, until we were ready to pull down that zipper with our teeth and get that big slab of beef out in the open where it belonged. Malachi was not playing around when he attended a recent fetish party and ended up on the stage, fucking the hostess while the crowd cheered him on?Nino relates he has fucked girls in front of all of his brothers and most of his friends. Let's do the math: add two exhibitionists, three new porn dvd's, a six pack of beer, and a pile of cash, and what do you get? A red hot episode of CircleJerkBoys.com where not having any women in the equation definitely works for us, but for Malachi and Nino?well, they pass this oral arithmetic lesson with flying...colors!Nino is studying to be a massage therapist and comes dressed in his working clothes right from class. Nino straddles him and works his magic up and down Malachi's back until he winds up in his underwear on the floor with a now shirtless Nino working Malachi's legs and moving up. As he moves to sit across Malachi's thighs, his cock starts to snake out of the top of his pants as his fingers slide into the waistband of Malachi's shorts, before tugging them off and giving Malachi's freshly-unveiled ass a good slap. Nino completely ignores the beauty of those buns and instead locks his sights on something else?Malachi's mouth.Malachi is on his knees on the bed with Nino standing over him, bouncing that fat eight inches in and out of Malachi's mouth, leaving long glistening strands of spit as he pounds his meat again and again, pushing the metal beads on the underside of his shaft into Malachi's tongue. Malachi is far from a deep throat expert, but he grabs that meaty pole by the base and proceeds to chow down like a champ, aided by Nino grabbing him by the hair to help speed along the process. Practice does make perfect, and Malachi seems to be much more at home a bit later as they lie on the bed. The further down he goes on Nino's cock, the harder it gets, until it is a double-fisted stick much too big for Malachi's inexperienced mouth. Malachi is too polite to talk with his mouth full to complain, nor does it stop his cock from growing to its full nine inches. Sitting next to each other, the battle of breeders moves to the finish line as they both pound away at their big dicks until twin, thick, white heavy blasts cover both of their bellies?and a wide swatch of the rug.  Not a bad math lesson at all. Next time, we will come up with a new equation, and though they do not know it yet, the magic answer will be sixty-nine! We will keep you posted!",
  "models": [
    {
      "name": "Malachi",
      "person_id": 28253
    },
    {
      "name": "Nino",
      "person_id": 28254
    }
  ],
  "release_date": "2007-09-21",
  "scene_id": 55361,
  "series": "Kindred Spirits",
  "tags": [],
  "title": "Kindred Spirits, Scene #02"
}