{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "'This girl was licking my ass while  she had my dick down her throat and I taught my girlfriend to do that too' is how Nino describes his favorite sexual activity. As far as describing Nino, this 23 year old serving of breeder has his native New York attitude coming out of his mouth, muscles coming out of his shirt, and a bulge snaking down the legs of his pants, indicating there would soon be a big, fat dick about to be coming out his jeans. Nino has wanted to do porn since he first discovered what it was for, and even though he had jacked off twice already because he was so excited at finally getting the chance to live out his dream, he could not contain himself. With his pants barely about to contain a fresh throbbing bone, it was clear that today at CircleJerkBoys.com, three times is definitely the charm.Nino peered over the top of his shades before leaning back in the chair, dropping his hand deep into his jeans, and working that fat lump with one hand as he rubbed his smooth chest with the other.  Shucking his shirt to reveal a naturally smooth, naturally toned chest flanked by meaty arms, he pulled his cock out of a hole in his jeans, using his belt to spank that shaft before his dick filled completely and pointed at the ceiling, showing off two silver balls on the underside of his shaft, just under the head. 'I like it when a good girl swallows my load then spits it back on me,' he told us as he unzipped to give his cock the breathing room it was craving before he turned around and flashed a rock hard, milky white set of ass cheeks. Unlike most straight guys, Nino was well versed that his hole is an often overlooked pleasure zone, and we got to see that dark opening close up as he moved to the couch and started humping away, using the valley between the cushions like a pussy he had waited for a long time to nail. Rolling back over, his cock was now dripping and ready for a solid pounding. He began by slamming the top of his shaft into his open palm loud enough to echo across the room. Pulling his leg up and back, he jacked off with one hand while spreading his cheeks open, offering up a view he hoped would look hot - and we though looked like lunch. Standing up, in a technique we had never seen in 275 episodes to date, he reached in from behind to pull his balls back with reaching over the front to work his shaft with a vise like grip that made the head go from red to purple and his balls go from low-hanging to coiled and tight. Falling to his knees, every muscle flexed, his face contorted in pleasure and he fired off a load that landed all over his sweaty abs. Not bad for his third squirt of the day to say the least. Nino said if it feels good, do it. Stay tuned guys, we already have plans for him to come back - and we are going to see just how true those words really are.",
  "models": [
    {
      "name": "Nino",
      "person_id": 28254
    }
  ],
  "release_date": "2007-08-31",
  "scene_id": 55366,
  "series": "Popped Cherry",
  "tags": [],
  "title": "Popped Cherry, Scene #01"
}