{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Making an unprecedented sixth solo appearance at CircleJerkBoys.com, Anthony has reached almost cult status. And as the founding Captain of the All-Star team, no one receives more fan mail than he does. It makes perfect sense: from top to bottom, and especially in between, Anthony is the living version of the straight guy you have always lusted after: handsome, smart, muscled, beefy, open, hung and oh yes, even a world-class booty on the flip side. It has been more than a year and a half since Anthony's pool side jack-a-thon elevated masturbation into an art form, and today he returns to cook up an even hotter encore. We have seen Anthony give Antonio the fucking of his life, we have seen him lead the pack in Four-Handed Jizz with Aiden, Sebastian and Rex and even saw him give Cody's cock a taste test, but today we have Anthony the way we like him best: all to ourselves.Those eyes shining, the smile beaming between those dimples, and his guns pumped and flaring, Anthony is the most edible dish in the kitchen. With that starched white cotton serving as the only barrier between us and that smooth chest with those bite size nipples that, like his cock, never seem to go down, Anthony sheds the apron and immediately gives us what we want: a view of that world-class, wet dream inspiring, ball churning backside. Inching down his back and exposing that succulent crack, Anthony gives his exposed cheeks a couple of slaps before mounting the counter, spreading wide, and showing off the main course: all eight, cut, thick inches of 100% prime choice breeder beef.Anthony gets on the floor on all fours and with an ?I have a surprise for you? look that has launched a thousand loads, leaves us speechless as he reaches back and inches his finger where we have all wanted to go since we first saw those buns of steel?right up his hole. It takes one secure man to finger himself on camera, and the display leaves us wishing the camera did not require two hands to hold steady. Standing up, he continues to play hide and seek with his ass, with his cock ballooning up and leaking steadily as his sack contracts into a tight round ball of promise. Allowing the cool stainless steel of the fridge to provide yet a new sensation for a cock that we thought has felt it all, he finally turns around, grabs that leaking missile with one hand, a dish from the counter with another, and covers it with just the kind of signature thick, copious white load that has made him the legend he is with a Black Plate Special that you will want to eat every day. Bone appetite, guys!",
  "models": [
    {
      "name": "Anthony",
      "person_id": 27804
    }
  ],
  "release_date": "2007-09-14",
  "scene_id": 55363,
  "series": "Top Chef",
  "tags": [],
  "title": "Top Chef, Scene #02"
}