{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "With his inked arms, tight jeans, bad-boy bed-head and a devilish soul patch, Malachi looks every inch the sinner he appears to be, despite the more pious origins of his name, which means ?my angel? in the Old Testament?although it is that nine inches of hissing cock he also sports that might just be something you have been praying for. Malachi has that laid-back manner that is always on the ?cool? setting, though that all changes when he enters the bedroom. ?I am very aggressive sexually, and I need a woman who can keep up,? he says with an evil glint in his eye. What we have our eye on is that bulge in his pants; does it contain a cock of near-biblical proportion his name alludes to? Of course, unwrapping the package is half the fun, and we don't want to be a flat tire on the party bus, but here is a little hint guys ?get out the lube and select the largest size screen on your media player?Malachi has a lot to put on display.As he stands up and raises his shirt, some additional ink comes to view across his well-rounded pecs, though the real scene-stealer is how sexy those second-skin jeans cling to his narrow hips and flat, smooth waist. He licks his fingers, rubs his nipple, and likes the way it feels?he goes back for seconds. With a smoldering look that says, ?Come get me if you dare,? our languid Lucifer stares into the camera before turning around to display his most ironic ink of all: a pair of angel's wings between his shoulder blades. Facing us again, the mound in his pants has definitely increased in size. He snaps his thick leather belt, producing an evil echo that resonates through the room before dropping his jeans to show off a pair of tight, white, creamy ass cheeks. They say the devil finds work for idle hands, and when you take in the view as Malachi turns around, we know your hands will not be idle for long.Turning around, our little angel is definitely ready to go down the road of sin with his pitchfork leading the way. The shaft is long and lean, like the man himself with his cockhead still partially covered by remnants of his foreskin, indicating that despite already being a two-hander, there is still more growing room. As he spreads his legs wide, it is like an invitation to heaven that we are powerless to refuse. With his hands behind his head, as if by sheer will, Malachi makes his cock point up towards the sky with the now exposed head landing back against his flat abs, well above his navel. As he settles into the chair, his sack contracts into a tight, hard ball of red flesh as he gets down to the business of getting off. With the ink on his arms now a blur as he fists double-time, he embodies the fantasy of every skater, punk, and bad-boy you have ever lusted after, as he bites his lip and delivers a load that drips down the shaft, crosses his fingers, and puddles on the floor below. Malachi says when it comes to sex he is up for anything, so stay tuned guys, we have a special CircleJerkBoys.com test to find out just how true that is!",
  "models": [
    {
      "name": "Malachi",
      "person_id": 28253
    }
  ],
  "release_date": "2007-09-07",
  "scene_id": 55365,
  "tags": [],
  "title": "Caught On Tape, Scene #02"
}