{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It is a long and winding road that leads guys to CircleJerkBoys.com, and no matter what path they take to get here, they all have the same final destination: the bank. The need for cold hard cash is the only reason a straight guy will enter the ?man-to-man? arena. So today, Christian, a 23-year-old Cuban hottie, is looking to get the funds together so he can get home to see his girlfriend and daughter. Close cropped hair, a brilliant smile, and a naturally lean, smooth body, Christian has just the kind of engaging personality that draws you in before you even realize it. He is desperate to get home as soon as he can, and when we tell him there is only one way he can make the kind of ducats he needs, he opens up his empty wallet and says ?bring it on!? Next we show 19-year-old Keegan?a bisexual Brazilian cutie with dark ?I-will-suck-you-till-your-knees-buckle? eyes and an ass that belongs in a thong on the beach?into the studio to have a seat next to him. There is an instant ?well-this-might-not-be-sooooo-bad? look in Christian's eyes that tells us what we already know: neither his wallet, nor Keegan's ass, will be empty for long.By the time we have the cameras rolling; Keegan has already gotten both himself and Christian out of their shirts and has sucked Christian's tongue down his throat. The lump in Christian's pants tells the rest of the story, but Keegan finds he wants a closer look. When his fishes out Christian's cock, it is a rock hard, lead pipe-thick, uncut tower of beauty that soon finds itself in the warm, wet confines of Keegan's mouth. Even though he grew up in the land of Amazon cocks, Keegan is having a difficult time fitting a cock this fat down his throat, and the damn thing just keeps getting fatter and fatter the more Keegan tries. Christian even reaches over and gives Keegan's own uncut meat a few tugs before standing up and feeding his own cock back into Keegan's mouth. Keegan keeps stroking away at his own cock as Christian tries to get as much of his into Keegan's mouth, until he sets his sites on a new path: he grabs a condom, leaves the drive through window, and positions himself for a rear delivery.Grabbing the fat sausage firmly by the base, Christian steadily pushes forward, inch by inch, until he is buried to the hilt in Keegan's hole. Though Christian's balls kissing Keegan's cheeks is a pretty good indicator how deep he is driving, the look on Keegan's face, a constant wash of waves of pleasure mixed with a touch of pain, is the best dip stick of them all on how far Christian is dipping his stick. Christian fucks in slow, steady, deliberate strokes as if he is revisiting what it felt to lose his cherry all over again. Keegan takes every thick inch Christian has to offer, keeping his ass high and tight for each waiting thrust. Settling back on the chair, Christian works his pole with both hands and soon shoots a load that flies up over his head and lands with a thud on his abs with Keegan's explosion just a minute later.  We do not care what road leads them to CircleJerkBoys.com, as long as this is where they decide to get off! Well done guys!",
  "models": [
    {
      "name": "Christian Castillo",
      "person_id": 28258
    },
    {
      "name": "Keegan",
      "person_id": 28259
    }
  ],
  "release_date": "2007-08-17",
  "scene_id": 55368,
  "series": "Easy Riders",
  "tags": [],
  "title": "Easy Riders, Scene #01"
}