{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Rocky lost his cherry when he was a freshman to the captain of the varsity cheerleaders, making his rite of manhood the reality that most straight guys just fantasize about. Seeing this handsome, twenty-two-year-old football star not just pull off his clothes in the locker room, but pull on that beautiful fat cock until a huge load covers his abs is a fantasy for most gay guys and one that will become a reality here on CircleJerkBoys.com today! Dark spiky hair, deep-brown eyes, a sexy low voice, and a body packed with muscle, Rocky is like a big bruiser from the frat house with a sexual appetite to match. 'I am all about a girl's ass,' he declares, 'first I lick it, then I stick it.' As for Rocky himself, first licking him, then sticking him sounds like a fine plan to us. But as he loosens his belt, grabs a skin mag and bottle of lube, some ideas of his own, along with something causing the crotch of his jeans to bulge, were also taking shape. And we were more than happy to see what developed next.His arms seem to be battling with the fabric of his sleeves just to contain them. We are glad when he surrenders that shirt and shows off a spectacular chest with strong pecs that dance as he moves some deep ink that stretches across those wide guns and up over his wide shoulders. His whole upper body is a massive expanse of hard-worked muscle with very impressive results that take your breath way. The ladies on the glossy pages have the same effect on Rocky, as he undoes his fly and starts working a tube of flesh that is as thick, meaty, and strong as the rest of him.First working the lube into the hungry muscles on his chest, Rocky then massages the hungriest muscle of all, that fat seven inches that is standing at attention and demanding it receive more of the same. Unlike most straight guys, Rocky has no problem putting his glutes on display and even offers the camera a close-up of that hairy hole in the middle as he bends over and strokes away at his favorite toy. Leaning back against the lockers, he pounds away with a new intensity, yet seems as comfortable as if he has jacked in this setting a million times before. Rocky tunes everything else out but the need to have the best orgasm of his life, and it seems like he is having an out of body experience. The only thing that really leaves his body, of course, is a huge white load that he spills all over his abs. He cannot resist the urge to play with one of the ropes of cum on his stomach. And while playing with your food is generally discouraged, in Rocky's case we are glad to make an exception.",
  "models": [
    {
      "name": "Rocky",
      "person_id": 28122
    }
  ],
  "release_date": "2007-08-10",
  "scene_id": 55370,
  "series": "Time Out",
  "tags": [],
  "title": "Time Out"
}