{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The combination of the dark hair, deep-brown eyes, and light skin, along with a sexy accent that we later learn is as thick as that beautiful, uncut seven inches of joy between his legs, make it easy to guess exactly where Cuba, the latest Latin lover to join the CircleJerkBoys.com roster, was born. Bling in his ear, ink on his arms, and his country's flag hanging on a chain around his neck, Cuba also has one of the most charming ear to ear grins we have seen in a long time. Never having jacked off in front of a guy before, much less on camera, Cuba has an irresistibly charming bit of first time jitters, blushing as he talks about how much he likes to look down and see a girl's ass as he is fucking her doggie style. From the muscles spilling out of his tank top, we know that what is underneath will be hotter than anything we have seen yet from this guy who is flat-out sexy as hell just sitting there. He will not be resting there for long, and when you see him start to move and strip off his clothes to reveal the masterpiece below, your cock will not be resting for long either. Flexing his arm and flashing those baseball-sized guns, Cuba teases us, lifting up the bottom of his shirt just long enough to see the top of the whittled obliques, then letting it fall just as quickly. Hoisting it up again, this time in addition to his flat abs, we see just the hint of the trail under his navel before he finally sheds his shirt for good. Picking up speed, he undoes his belt, then darts his hand inside his fly. We are not sure if he is working up his cock or working up his nerve to whip that bad boy out, but as he spreads his legs wide and sprawls back on the couch while continuing to play ?hide-n-seek? inside his boxers, we learn the answer is yes to both. Kicking off his shorts, Cuba stands with both hands over the goods, then, finally, flings his arms behind his back. What is now in front is seven inches of heavy meat that will make your mouth water. Where there is water there is fire, and in this case, at the base of his cock is a flame-colored bush. Running right from those red pubes is a thick vein that goes all the way down a thick heavy shaft to the edge of a heavy crown of skin that covers the very tip of a cock that is now in the same state as yours...throbbing.He tells us about how much he loves to see the curves of his girl's butt as he is taking her from behind, and after watching him as humps away on the couch, we understand just how fucking hot that view of seeing the curves of tight, white, muscled cheeks in motion can be. As he rolls over, totally oblivious to how hot the site of the red pubes coming from that ass up over his balls is, his cock is now so hard that the skin has totally snapped back. The fat, helmet-shaped head is prominently in view, and the cum tube on the underside of his shaft looks fat enough to move a year's supply of oil, much less a day's supply of cum. Along with his cock, his comfort level under the lights and camera is growing as well. Looking right into the lens now, even giving a wink and flashing a smile now and then, his cock has grown into a two-fisted tower. Opening a few porn mags to his favorite centerfolds, Cuba gets right in the middle of the floor and places the black pillow right under his throbbing meat, opens the flood gates of his balls, and unleashes a white flood of jizz that not just covers the pillow, but shoots past it all together. He says he will come back for an encore, but after a load like that, it is going to take him a while to recharge!",
  "models": [
    {
      "name": "Cuba",
      "person_id": 28262
    }
  ],
  "release_date": "2007-07-27",
  "scene_id": 55374,
  "series": "Super Cum!",
  "tags": [],
  "title": "Super Cum!, Scene #01"
}