{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Noting how tall Riddick  is, checking the incredible circumference of his biceps, or seeing how his bubble butt and always ready cock is barely able to be restrained by his shorts; any way you slice it, this is whole lot of man. As if he did not make it clear enough last week when he shot his load clear up to those massive pecs, our Mr. Clean has one of the dirtiest minds and a silver tongue that renders you powerless to say anything but ?oh yes? to whatever he might propose ? that is of course, if you are capable of saying anything at all. When it was us doing the proposing, and the offer was for big bucks for going down on a big dick, he not only took us up on our offer, Riddick also took all eight inches of Commando's cock right down his throat, in an afternoon that redefined what ?straight but not narrow? really means when a man has more confidence than shame and the balls to do whatever job comes along to the best of his ability. We paid the fee, Riddick paid his dues, and today we get to see with our eyes Riddick doing what we have been picturing in our minds since day one: fucking some man's ass and loving every minute of it.Despite offering up a king's ransom, we could not find another straight guy who would let a testosterone machine like Riddick go gonzo on their ass, so we immediately called Cole, who took one look at Riddick and was ready to pay us! ?I like it doggie-style,? Cole says, as he stares right at Riddick's crotch and then drops his face down and begins a taste test of the meat he knows is destined to redefine just how much pleasure his ass is capable of delivering. Riddick kicks off his shorts, hangs his heavy arm over Cole's neck to steer that open mouth on a cock that we have never seen this hard. Taking Riddick's cock right down to his balls, Cole keeps that meat all the way down his throat as he pivots himself to his knees and begins to lick the head like an ice cream cone until Riddick decides he wants a little dessert himself. He gives an admirable job trying to suck down the wrist thick, eight-inch slab of Cole's, but is happy to give his jaws a rest and put Cole's tongue back to work by spreading his legs to expose the hole between those perfectly-round tan cheeks and letting Cole go to town. Moving to the bed, Riddick feeds Cole his cock once more. And after a sixty-nine on the floor, Cole's ass takes center stage; and Riddick's cock is ready for its starring role.His butt out and his back arched, Cole hungers to be filled with that dick that just minutes ago was in his mouth. His hole inhales Riddick's cock with a hunger and a desire so infectious, it would even make a strict top want to switch sides just to feel the overwhelming bliss that is radiating from every pore of his body. After reaching back to pull Riddick even closer, they move to the bed, where Cole sits down on Riddick's cock and proceeds to ride that meat like a jockey coming in for the home stretch. Lying on the floor, Cole once again plays ?pole on one,? facing Riddick as Riddick grabs Cole's cock with a tight grip. With every motion of Cole's hips, Riddick's fingers jack that fat cock until Cole explodes with a massive load all over Riddick's chest. Riddick spews off a huge dose of sperm that mixes with Cole's, covering his tan chest with enough white icing to decorate a wedding cake. We are not sure what else Riddick is up for, but whatever he proposes, you can bet we will say the same thing you will: ?We do!?",
  "models": [
    {
      "name": "Riddick",
      "person_id": 28263
    },
    {
      "name": "Cole",
      "person_id": 28264
    }
  ],
  "release_date": "2007-07-20",
  "scene_id": 55376,
  "series": "Nobody Does It Better",
  "tags": [],
  "title": "Nobody Does It Better, Scene #01"
}