{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Perfection means a lot of things to a lot of people, and here at CircleJerkBoys.com, there has been the occasional exceptional stud who is as handsome as he is horny, and as hard bodied as he is hung. Some of these have even been as perfect as Johnny Castle, but more perfect...never.  We only had the chance to work with Johnny once before, and even though he arrived directly at the studio from a red-eye flight the night before, the fact that he had not yet had the chance to unpack his bags did not stop anyone from deciding immediately that this was the man you needed to pack your fudge. His smile lights up a room, his strong arms could use you to bench press with, his irresistible manner is the result of perfect gentility, and of course, that cock is big enough to make even the most well-worked hole tight all over again:  Johnny Castle is the wet dream straight guy come true.  Even better, he is here today for you with one singular purpose; to show off every inch of that incredible body and mouth-watering cock in a way that will make you feel he knows just how badly you need it - and there is no one else who can deliver it to you like Johnny can.'I get turned on being by myself and just doing my thing,' Johnny says into the camera with a sexy, heavy-lidded smile as he lazily rubs the head of his cock right through his jeans. Those lips form the perfect 'I-will-give-you-the-ride-of-your-life' pout as his face shines between those perfect guns as he raises his big arms up over his head, allowing the trail on those chiseled abs to peek over the waistband of his jeans. After flashing that wide, well-worked back, Johnny's cock is already so hard, he barely hoists it out of his fly. With all thick, eight inches at attention, the head gleaming, and his balls hanging heavy, he kicks his jeans off, spreads his legs wide, and invites the lens in close as he works that pole with one hand, then two and finally hands-free, allowing every throbbing inch to stand tall under its own power and in a way that will have you powerless to do anything but beg for more.The deep cuts of those chiseled abs become like channels for water as Johnny moves and cools off under the shower while you heat up just watching as shower spray clings to every curve on that hard body, especially the eight throbbing inches in the front. With the beads of water still dripping down his pecs, Johnny moves back to the bedroom, takes a seat on the back of the chair, and proceeds to work his pole like it's the steering wheel that will take him to a sexual nirvana he only gets to when he is alone and able to enjoy you watching him do what he does best: work his own body into an instrument capable of delivering the most intense sexual release known to man. When Johnny gets into his zone where everything else but the pleasure he is getting from his cock seems to disappear, he has a way of seeming like he is totally unaware of the camera while still making you feel like he is doing what he is doing only for you. Johnny delights in giving you exactly what you need to see and exactly how you need to see it: perfectly, with balls to the wall confidence and any shame replaced tenfold with sheer primal joy.",
  "models": [
    {
      "name": "Johnny Castle",
      "person_id": 28261
    }
  ],
  "release_date": "2007-08-03",
  "scene_id": 55373,
  "series": "The House Always Wins",
  "tags": [],
  "title": "The House Always Wins, Scene #02"
}