{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Even though the tag on the back of his shirt said XL, it could barely stretch over the expanse of muscle this 23-year-old has packed on every part of the perfectly smooth, flawlessly symmetrical and honed to perfection canvas that Riddick has transformed into. From the first time we learned that his cock is just as thick and meaty as the man himself during his CircleJerkBoys.com debut last year, Riddick immediately distinguished himself even on the elite list of fan favorite uber-jocks like Deklan, and Anton. With a manner as easy-going as his big body is imposing, Riddick is not just the kind of guy you lust after, he is the kind of guy you develop a crush on. And the more you get to know him, the stronger the attraction goes as there is no shame in his game. What you see is what you get and that is one handsome, hung, built and incredibly sexy package that he is balls to the wall happy to put out there for whoever wants to appreciate it. And for Riddick, appreciate proved not to be a one way street, as we learned over Valentine's Day when he not only watched some homemade porn with another CJB guy, Riddick bent right over and sucked Commando's eight inches down to the base with no arm twisting before and no regrets after. Our only regret was that he had to get back to school in Seattle before we could get him back into the studio, but happily the wait is over.Riddick's massive arms are spilling out of the sleeves, and in less than 30 seconds, his rock hard cock is spilling out of the fly of his jeans. He wastes no time showing us that he is as glad to be back as we are to have him here. Though he remains fully dressed, all seven inches are rock hard and sticking straight up as he sits there stroking. It is like getting a glimpse of the dessert tray while you are still ordering your entrees, but damn, it looks good and fuck yeah, we are hungry. The helmet head of his cock flares away from a shaft that is as hard and big as we have ever seen it. As he begins to pound away, he never breaks his long gaze right into the lens, as if he knows exactly what we are thinking...that he is stroking as much for his benefit as for ours. Under a close cropped bush making its overdo first appearance, his cock is curiously as tan as the rest of him. Tugging off his shirt, that golden-brown perfection of a body is even leaner and more built than before. His body is as sperm-inducing as it is awe-inspiring, as Riddick embodies every dirty desire we have ever had about being able to follow an athlete into the locker room after a match for a very personal post-game show. The glorious celebration of beefiness continues as Riddick turns around, shows off those rounded, golden orbs of man-ass before humping away at a pillow with a power and lust in his hips we only wish we were experiencing and not just watching. Then on his back, our gentle giant builds to critical mass and fires off a load that first lands on his sweaty pecs and then turns the cuts in his abs into a new home for heavy white rivers in an extra large explosion of sperm that is, just like his shirt, sized XL. As hot as Riddick looks today, we also think he looks a little lonely, so check in with us next week when Riddick will back, and this time we have a friend for him!",
  "models": [
    {
      "name": "Riddick",
      "person_id": 28263
    }
  ],
  "release_date": "2007-07-13",
  "scene_id": 55379,
  "tags": [],
  "title": "The Five Finger's of Riddick, Scene #02"
}