{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Blessed with the face of a soap opera hunk, the sex drive of a fleet of Marines, and an always-hard cock any porn star would be proud to call his own, Deklan makes his triumphant return with that body ripped to shreds and that jaw-breaking dick ready for action. It's not often we have someone worthy of making a fourth appearance here at CircleJerkBoys.com, but then again, it is not often we run across a guy like Deklan.The reigning poster boy of breeder wet dreams, your emails wanted to know more, so during his interview Deklan answers some of questions you posed. These go from his disarming shyness during his first shoot to his third shoot, when he seemed to discover his ass was not strictly decorative. As for today's installment, filmed just days before he was preparing to compete in a physique competition, Deklan is at the top of his game and ready to play.His muscles are so primed that they seem to spill out of the armholes of his shirt and the legs of his shorts, with a big fat lump in the middle indicating those mouth-watering eight inches are just as pumped. There is a look of sheer bliss in his eyes as he works that tent as if it is the center of his universe. As he pries the tank off his torso, he shows off real estate worthy of a fitness magazine cover model. Grabbing his dick and shaking it underneath his shorts, that cock is now so massively engorged that you can see the sharp outline of the over-sized ridge head right through the fabric. As Deklan gets down to his jock, the straps cling to perfectly worked orbs as his cock responds to the excavation he does in the center. He says he is ?ready to rock & roll with the hole!? And that rock-hard cock he has achieved in the process is ready to come out and play.Flexing his glutes as his now-undeterred cock points straight down between his legs like a mighty stalactite in a cave of masculinity you will never want to be rescued from, Deklan then stands, turns around, and displays all eight dripping inches. They stick out, hands-free at a perfect ninety degree angle that says, despite how honed to perfection every fiber is on his entire body, this is the muscle he is most proud of out of them all. Usually playing right to the camera, this time Deklan is acting out the porn flick inside his own mind. You can almost feel that cock inside you as his thrusts his hips up and down off the couch, riding the hell out of a hole and riding the crest to orgasm at that very moment. With a thick white covering his heaving abs and a leerful smile that says it all, Deklan may look like he belongs in a soap opera, but he is one dirty boy - and we would not have it any other way!",
  "models": [
    {
      "name": "Deklan Connors",
      "person_id": 28224
    }
  ],
  "release_date": "2007-07-06",
  "scene_id": 55381,
  "series": "Standardized Stroker",
  "tags": [],
  "title": "Standardized Stroker, Scene #02"
}