{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "When our two conquering heroes, Antonio from the soccer field and Anthony from the battlefield, return for a clash of the titans that has been two years in the making, you know it is going to be a no-holes-barred-fuck-fest where the rubber meets the road paved inside the private wet dream of a breeder's jock hole. Antonio was back in town for spring break and scored a big goal in Speedy's tight, hairy hole, but it has been a agonizingly long year since we last saw Anthony's eight-inch cock, bubble butt, and muscled body here! The founding member of our All-Star Team, Anthony remains the undisputed king to this day: something Anthony knows first hand. It was a couple of years ago that Antonio decided he was ready to test the boundaries of his sexuality, so we enlisted Anthony who pushed Antonio's limits by pushing that battering ram of a cock up Anthony's hole without mercy in what became one of the hottest, raunchiest and most downloaded episodes ever. That encounter proved to be as unforgettable for them as it is for us, and as you are about to see, lightning really does strike twice as the electricity of seeing each other again is apparent from the moment they walk in the room.A reach inside Anthony's shirt, and Antonio learns that those pecs are just as round and powerful as ever, and Anthony spared no time in getting Antonio out of his shirt and onto his knees. From the first contact of Antonio's lips, Anthony's cock goes from half hard to performing a stiff salute. Anthony just lays back and allows Antonio's hungry mouth to worship his cock. The vacuum pressure alone seems to makes Anthony's cock extend out an inch further than we have ever seen it before. Grabbing Antonio's long locks like a handle to guide that hot mouth exactly where he wants it, Anthony picks up the speed until he is giving Antonio a solid skull fucking, during which Antonio manages to work his way out of his boxers. With his cock and his ass in the air, it is clear they are both craving more fucking, but with a darker, tighter destination.Almost like a favorite dessert that's been two years in waiting, Antonio postpones the fucking to give Anthony a deep throating that results in the head of Anthony's cock becoming very well acquainted with every inch of the interior of Anthony's windpipe, until Anthony's other pipe centers on being reacquainted with the interior of Anthony's posterior. Flipping Antonio on his back, Anthony gloves up and proceeds to make a single focused, tactical assault on Antonio's now quivering hole. This war game of anal invaders moves to the chair, where Antonio grounds down to take every inch of that cock and gets a few slaps across his cheeks with a resounding thwap that echoes across the room, but fails to drown out the moans of carnal delight that fill the room. Antonio still on his back, and Anthony standing just in front of him, Antonio's stomach soon becomes the landing strip for a heroic white blitzkrieg of combined sperm. ",
  "models": [
    {
      "name": "Anthony",
      "person_id": 27804
    },
    {
      "name": "Antonio",
      "person_id": 29262
    }
  ],
  "release_date": "2007-06-22",
  "scene_id": 55385,
  "series": "Confidentially Yours",
  "tags": [],
  "title": "Confidentially Yours"
}