{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "With a lady killer smile shining on a face that is both adorable and handsome at the same time, Stefano first appeared a year ago like the great white hope. Then, he seemed to fall off the face of the planet, and damn, we missed him as much as you did. That tight body, decorated with a touch of ink, a manner so overtly sexy he could barely contain it, and eight fat inches of cock is something we could not wait to see again. As it turned out, Stefano's whereabouts were not as mysterious as they appeared: he was not abducted by aliens, but rather fulfilling the final leg of his stint in the armed service. While the military policy is technically don't ask, don't tell, this surely is not the Pentagon - so we asked, and boy, did Stefano ever tell. In fact, being a civilian again allowed Stefano to share like never before. Just when we think we have heard it all, hearing Stefano tell us that a locker room provided the opportunity for his father to bemoan that his 12 year old son was already better hung than he was was one for the record books. But it was the inside scoop of the reality of man to man sex in the military that read like a torrid tale ripped from a stroke magazine and sure helped explain why his encounter with Commando was not done at gun point, just with a big smile and ending in even bigger loads.Having traded his government issue uniform shirt for an official CircleJerkBoys.com issue tank top, Stefano is as happy to be back in the studio as we are to have him. As his hand immediately starts massaging the hungry lump in his jeans, we noticed a fresh band of ink around bicep and a look in his eye that dripped with hunger. Stefano unbuttoned his jeans and began a game of peek-a-boo with his cock that started in the front and continued to the back with where he treated us to the glorious view of that ass which, before, he had been pretty shy to give the air time it deserves. With his dog tags still around his neck, as the camera pans down his totally smooth body, it is like when we were kids and stripped our G.I. Joe dolls naked. But this time, the mission is not so secret as Stefano has the same thing on his mind as we do. As for what is in his hand, however, that is where the playbook turns to a brand new page.His fingertip runs across the slit, stretching out a strand of pre from that leaking head before his fist returns to the shaft for a few strokes that leave it rock hard and pointing directly at the ceiling. That was a pole that was aching for a hole if there ever was one, and accommodating guys that we are, we tossed him a pocket pussy without missing a beat. That phrase has seldom been as true as it right now. He grabbed it one hand, the lube with other, and wasted no time in filling that opening. For some one who jacks off as much as Stefano does, it has been awhile since there was something new in that arena to try, but working that make believe twat up and down that very hard pole made everything old brand new again. A few more minutes and that faux vagina went flying and soon a thick creamy load took flight and used his abs as a landing strip. Welcome home, Stefano, Well Cum Home!",
  "models": [
    {
      "name": "Stefano Ricci",
      "person_id": 28225
    }
  ],
  "release_date": "2007-06-15",
  "scene_id": 55386,
  "series": "Lonely Cock",
  "tags": [],
  "title": "Lonely Cock, Scene #01"
}