{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have seen less-developed bodies on the cover of a fitness magazine than Johnny Castle's. We have been dazzled by smiles that are only half as bright. We have longed to kiss lips that are not nearly as sensuously pouty as his, and have called cocks a couple of inches smaller than his ?big.? Just from the view of him relaxing on the couch, it is impossible to think the view is anything less than sheer perfection in a tank top and a pair of jeans.  Johnny is one of those rare actors in the industry that the hottest porn nymphet's demand to have as their costar; but today, away from the trappings of the big west coast studios where Johnny has spent the last two years making some of the best selling straight films of the new millennium, Johnny unplugged is a smoldering hot California stud who found a way to make a living off the one thing he has in more abundance than good looks and charm: a sexual appetite that would give credit to an entire platoon of soldiers after a year-long deployment. ?No one can take care of myself better than I can,? he said directly into the camera. He went on to reveal, with a disarming shyness that still has us wishing we were adding his initials to our monogram, ?I love to rub off a load before I go to the gym, especially.? One look at that body and you know he goes to the gym a lot. When he arrived at the CircleJerkBoys.com studio, he had not been to the gym yet, and for the perfect location for his pre-work ritual, he has certainly come to the right place.With eyes that are both heavy-lidded - yet wide open at the same time - in the center of a face with a profile last found on a Roman coin, Johnny raises the bottom of his shirt, revealing a flawless anatomy lesson in what a perfect six-pack should look like. Rubbing his baseball-sized upper arms with an appreciative reverence that echoes exactly our sentiments as well, his hand snakes its way under the open tab of his jeans and into the nirvana waiting below, like a well-orchestrated ballet of seduction ripped from our fantasies and being brought to life right in front of our eyes. With just a whisper remaining of his sandy-brown pubes, the shiny pink knob of that already fully-hard cock snakes over the undone top button of his jeans while the rest of the waistband clings to those chiseled obliques like a welcome mat of promise. Stripping off his jeans and laying still for the camera, his cock dances as if inviting us in for a close-up - and we surely do not need to be asked twice.With the kind of effortless, passive seduction we have never seen before, Johnny periodically looks into the camera as if he is making sure not only if we are still there, but if we can sense of the apex of pleasure only he can produce by working every flawless inch of his body like the fine instrument it is. When he rolls over and begins to grind onto the couch, there is a graceful power in every thrust that makes whoever is lucky enough to be on the other end of expert lovemaking feel anointed afterwards by the gods themselves. Standing up, laying down, from any angle and every angle, Johnny works his cock. As his balls begin to contract, the playful smile melts into a primal mask of a man on the crest. Soon, a load that seems to have a spent a week in the making covers his chest and abs. We told you Johnny had cum to the right place, and oh yes guys, he will be back!",
  "models": [
    {
      "name": "Johnny Castle",
      "person_id": 28261
    }
  ],
  "release_date": "2007-06-08",
  "scene_id": 55388,
  "series": "Sense & Sensuality",
  "tags": [],
  "title": "Sense & Sensuality, Scene #01"
}