{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It has been 6 months since James first showed off the wet-dream cum true beefy ass and thick club of a cock here at CircleJerkBoys.com. And like his dick, the emails about him are still cumming. ?Fuck - he's hot-even his hands are beautiful - and that dick - awesome !! I want to be his BJ slave and would swallow that cock with great pleasure? is pretty much the gist of your messages, and we could not agree more. It took half a year, but we jumped at the chance to film him again, the day before he left South Florida for good. James likes to take a walk on the wild side when it comes to sex. The more the girl takes charge, the more he likes it. Just talking about when he was tied up last made his cock twitch in his jeans. And when he started telling us about his latest outdoor conquest, which started on the beach, moved to the water, and eventually concluded on the pier, there was not a soft dick in the room, including ours. To make sure his last stint on camera would be one for the record books, James managed to put his ravenous sexual appetite in check for three days. From the look on that beautiful face, he could not wait for one more moment and frankly, neither could we!In fifteen seconds, we were looking at the dark tufts under his arms as he flung off his shirt, ripped out his belt, kicked off his shoes, and undid his jeans. Moving to the couch, he sets his cock and balls free by tugging them out of the leg of his boxers. He stands up, letting the camera connect the dots from that briar patch of sparse hair in the center of his chest to the single line of fur that runs from his navel down into his trimmed bush. Spreading his index and middle finger wide enough to stroke that now leaking meat, the more he rubs it, the thicker it gets, until that seven inches of white meat hangs low and heavy, mimicking the state of his baby makers in their smooth sack. James must have gotten used to the camera on his first visit with us, as this time, not only does he hold his cock, he also makes just the kind of eye contact with the camera that rivets your attention and begs the question of if he would be able to say ?no? if someone offered him a hand right then and there. The look on his face and the state of his leaking cock support the conclusion that his own hand is certainly getting the job done ? but that job is not over yet.Lying there naked, cock throbbing, lip quivering with a deep hunger and longing desire resonating from every pore, James seems plucked from a fantasy and transported down to make your dreams come true as you stroke along with him, matching every stroke. The mixture of ?innocence lost? and ?paradise found? in his devilish smile reach right into your soul: you can almost feel the tidal waves of pre-orgasmic current running though his body. Lying down on the carpet, we look down over his body to his cock, sticking up in the air like a factory's steam stack, and know that it will soon be delivery time on the loading dock. Moving to the couch, James grabs his shaft and fists it with both hands. His balls rise up as we watch, moving steadily ahead until they are flanking either side of base of his shaft. Soon, they spew white smoke all over his cock and abs below. When will James be returning to pick up where he left off today? The only thing we know for sure is that it will not be soon enough!",
  "models": [
    {
      "name": "James",
      "person_id": 29482
    }
  ],
  "release_date": "2007-05-04",
  "scene_id": 55397,
  "series": "Habeus Cockus",
  "tags": [],
  "title": "Habeus Cockus, Scene #02"
}