{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "With his ability to use that incredible body, compelling face, and brooding sexuality with the skill of an world class sharp shooter to reach the desired target of our ultimate satisfaction with guaranteed precision, Riddick's first appearance last week accelerated his ascension to the CircleJerkBoys.com's All-Star list, joining the ranks of Anthony, Antonio and Sebastian. Joining is really the operative word this week, as today Riddick is joined by another recent addition to the site, Commando. We met Commando up close and personal a few weeks ago, and his cocky demeanor, rough around the edges manner, and of course, that fat, uncut cock earned him a following of his own. That was actually Commando's second appearance as we originally met him when Stefano joined him on the couch for a crash course in the buddy jerk off. A duo stroke is usually the first baby step the select breeder will take with another guy if they are willing to tread into man-land at all. Every so often, we (or more often, their landlord or the bursar's office of the local college) are able to persuade them to take a second step. Today, Riddick and Commando join that very special list.Hard as we try to arrange the perfect match up, sometimes fate does a better job: turns out Riddick and Commando had been at the same club the night before and both of them had eyed the same prize: namely a tall girl with a fine ass. Commando had been the lucky one that night and not only took her home, but also took some video on his cell phone of the exploits that happened later on. He is sharing that video with Riddick on the couch and she has the same effect on the guys today: within 30 seconds of watching the video, they both have their hands down their pants. Before a minute's time, Riddick is shirtless and Commando has hauled out that fat 8-incher from his jeans. Riddick's shorts soon join the growing pile of clothing on the floor, and Commando's jeans are not long behind. Both guys are now hard and naked and standing up, still watching the not-so-private home movie of the action the night before. Fortunately for us, the screen on a cell phone is very small and the guys have to stand close together to share the view and that serves our purposes beautifully. After all, an old slogan for the phone company is ?reach out and touch someone,? and that is exactly what Riddick does.Without a flinch on either of their parts, Commando is still holding the phone, and Riddick is now doing some holding of his own cock as well as Commando's. All it takes is a few stokes and Commando is at full mast, throbbing in Riddick's hand. By now, the guys are ready for some new porn on the big screen so Riddick takes a seat. Rather than plopping down on the coach next to him, Commando stands on the cushion, aims his cock right at Riddick's mouth and damn, if Riddick does not open wide and begin to swallow his buddy's pinga inch by very fat inch while he jerks away at his own pole, never missing a beat. Commando must have passed the taste test, and soon Riddick is on his knees and his chin is soon getting acquainted with Commando's quickly tightening sack.  Holding onto Riddick's head, Commando guides that hot mouth exactly where he needs it, and soon they move back to the couch as they both need the same thing we do: to shoot those loads, and they do?one right after another. We know you are not done with Riddick yet and neither are we: we are working on someone to join him again, but this time we want to see what happens when Riddick comes out on top... literally!",
  "models": [
    {
      "name": "Riddick",
      "person_id": 28263
    },
    {
      "name": "Commando",
      "person_id": 28268
    }
  ],
  "release_date": "2007-04-27",
  "scene_id": 55398,
  "series": "Just Say Yes",
  "tags": [],
  "title": "Just Say Yes, Scene #01"
}