{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "From those geyser-like, over-the-shoulder semen explosions Antonio has sent barreling into the stratosphere from his debut here at CircleJerkBoys.com three years ago, to the sperm launch he did today, Antonio has cum a long way baby...literally! Three years of varsity soccer have honed his body. From those bulging pecs, to that washboard stomach, the world class ass, to that 8-inch, thickly curved, uncut tube of joy, he is a specimen that transforms your fantasy of a young stud in his prime into real life. Antonio has lived out some of his fantasies as well, and even better he did so on film here, like when Anthony the Marine went gonzo on that perfect bubble butt, or when he turned the tables and played top to the about-to-be-married Tinman's bottom. Fast forward to today and Antonio is not just looking better than ever, that massive bulge in his pants told us what we already knew...he is hornier then ever as well.Antonio does not have to dig deep into his jeans to reach his dick, he is so hard as he looks into the camera and proclaims, 'I am so fucking horny' that the head of his cock is poking above the waistband. It could only be a cock that is not just as long as Antonio's, but one with that same wrist-like thickness that causes his crotch to be so packed, it looks downright painful. But not to worry guys, Antonio soon puts himself, and us out of harms way by unzipping and revealing the not-so-well-hidden prize under the scarlet red jock pouch: eight inches of very hungry dick that is more than ready to come out and play. Play is the operative word as our showman plays a little peek-a-boo, letting that pouch hang off his dick before squatting down spinning that mighty branch like a propeller in the breeze, then moving to the couch, bending over and treating us to a back view of his bountiful booty as he twists back and gives himself a much needed reach before moving to the couch and finding a position to stroke in a way that even after 300-plus episodes, we have never seen before.Hooking his legs over the back of the sofa and laying his head on the floor, Antonio begins stroking upside down, both of his ends now crimson red. His already big cock seems downright gigantic as it towers above his magnificent body like the crown of all things horny. Antonio stops working that meat only long enough to ask, 'How badly do you want this in your mouth?' before making up for that little pause by stroking twice as fast and using both hands. Sitting back on his knees, his hips gyrate back and forth, sticking his cock into his fist with an urgent insistency of a man who needs to breed or die. Moving to the ottoman, we see that dark hole quiver and his upper lip tremble as old faithful erupts with a pent up blast that ultimately comes in for a landing well beyond camera range. This was just the first day of spring break, but not to fret guys, we have not seen the last of him yet!",
  "models": [
    {
      "name": "Antonio",
      "person_id": 29262
    }
  ],
  "release_date": "2007-05-11",
  "scene_id": 55395,
  "series": "Top Banana",
  "tags": [],
  "title": "Top Banana"
}