{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "At 6'3? and 222 pounds of well-worked muscle, Lex is exactly what we love here at CircleJerkboys.com: a strapping serving of breeder meat that is more than ready to strut - and who has the stuff more than worthy of being on display. 21-year-old Lex's exotic look is due to a unique mix of having a Columbian mother and a British father. But that fine, f-i-n-e physique is due to something much more usual: hitting the gym four times a week. Guys that pump a lot of iron tend to have sexual appetites as large as their biceps?Lex has very big arms. The bulge in his jeans, the international symbol of hot and horny, indicates he is packing plenty below the belt as well. ?I've got to hit every day,? he told us, ?either by myself, with my girl or both.? He left his girlfriend at home and that suits us just fine: being alone, up close and personal with Lex and the one muscle we have not seen yet is exactly the game plan we have in mind. His long, coal-black hair pulled back and his green t-shirt greedily stretched by the wide expanse of muscle, Lex has the same thing on his mind as we have on ours: his cock. He digs into his jeans, leaving the zipper down before stripping off his shirt to reveal a landscape of flesh that approaches the apex of perfection in a fusion of expertly-worked symmetrical planes of flawless muscle. He slides the waistband until the top of the dark triangle of his bush whets our appetite for more. By the time we see the outline of his meat clearly defined by the clinging cotton of his shorts, we are practically salivating. And when he displays a rock-hard, marble-smooth pair of glutes, we envy those thin elastic straps of his jock being able to cling to something so magnificent. As he turns around and lies down on the couch, the pouch of his jock stretches to the breaking point, clearly showing the outline of the thick, cut cockhead. It is not clinging we have in mind any more. The object of our affection is about to be revealed - and he has us weak in the knees in anticipation.Giving his meat a two-fisted grab, his cock slaps back against his abs like a spring-loaded lock that has just opened, exposing a pointed head that lands just under his navel and gets wider and wider with every inch until it dead-ends into a heavy pair of low hangers. It takes quite an impressive slab of meat, and bull-sized balls, to be dwarfed by those Sequoia nut-cracker thighs, but just like the rest of his muscles, his love muscle is sized to perfection. With the supreme control of an elite athlete, sexual and otherwise, he moves his cock back and forth in the air like a metronome without the use of his hands, playing the ultimate love song. A cock this hungry on a guy this fine is just the kind of meat that can even make the ankles of a strict top go up on the air and the knees of a bottom immediately to the ground. Moving to floor with slow, purposeful strokes and to the backdrop of a chorus of low moans, seven surges produce a thick pool of even thicker cum on his abs, giving the term ?working it out? a meaning we will never forget.",
  "models": [
    {
      "name": "Lex",
      "person_id": 28266
    }
  ],
  "release_date": "2007-05-18",
  "scene_id": 55393,
  "series": "In The Moment",
  "tags": [],
  "title": "In The Moment, Scene #02"
}