{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Antonio had just turned 21 when he was here for spring break last year. But this time around, he was back at CircleJerkBoys.com exactly on his 22nd birthday, and we arranged a celebration to make a day of it and pull out all of the stops?as well a new bottle of lube and a jumbo box of condoms. While Antonio's solos, with that hard, tight body honed from hours of soccer practice, that world-class bubble butt, and that fat eight-inch cock have become legendary, his unique ability to shoot a load farther than any guy we have ever filmed is nothing short of an orgasmic opportunity. We knew that after being pounded by Rex, Antonio wanted his turn on the business end of another straight guy, and we could not imagine a more fitting birthday present than that. Speedy is a pint-size player with a big mouth, a big attitude, a big cock, and a big need for cash. Initially, we were not sure just how far Speedy would be willing to go, but as it turns out, helping out our birthday boy blow out the candles was just his opening act.?I'm up for it? Antonio announces directly into the camera, though that fabric-stretching throbber in his jeans spoke even louder. Both Speedy and Antonio are out of their shirts almost instantly, and Antonio immediately opens his pants and starts rubbing that big dick as Speedy drapes one leg over Antonio's to show off a bulge just as hard, and from the outline, just as large. Antonio wastes no time fishing that thick, uncut eight-inch pole out of Speedy's pants before Speedy spots a target he likes better than Antonio's fist?his mouth. Antonio practically inhales Speedy's big meat right down to his hairy bush as Speedy grabs the back of Antonio's head and gives the birthday boy the skull fucking he is clearly craving. Before Antonio flips Speedy over the bed and rubs his throbbing dick up and down Speedy's very furry, round ass as a reminder the party games have ended...it is time to unwrap the presents and the condoms.Slowly working his finger in Speedy's hole while he rubs his cock up and down those cheeks, Antonio moves into position. Inch after inch, he gives Speedy a taste of what his girlfriend must have felt this morning when he was home giving her his eight inches. As Antonio finds his groove, as well as Speedy's prostate, it is impossible to tell which one of the guys is moaning louder. When Speedy yells out ?fuck me? more than once, we are not sure who is more surprised: him, us or Antonio. But Antonio takes the call to heart and proceeds to give Speedy's hole a deep, slow drilling until his balls are rubbing against Speedy's cheeks and no doubt, doing an impromptu realignment of Speedy's lower-digestive tract. Speedy climbs on top of Antonio's cock, riding him to the upper crest of total bliss and gets off just in time for Antonio to get off and spew a load that hits him in the chin and continues on down in a white trail all the way to his pubes, while Speedy's spills his own nut all over Antonio's knee and calf. Now that he's had a piece of straight ass, Antonio is ready for a piece of cake, and we are ready for a cigarette!",
  "models": [
    {
      "name": "Antonio",
      "person_id": 29262
    }
  ],
  "release_date": "2007-05-25",
  "scene_id": 55391,
  "tags": [],
  "title": "Teach Me, Scene #02"
}