{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Julian is a 24-year-old Italian charmer with a ripped, lean body, a killer smile, and an oh-so-incredible face right at the crossroads between teen dream and handsome man. The combination of olive skin, pearly whites, and deep-brown eyes seems to radiate an intense sexuality in such an effortless way. It just grabs you by the balls and makes you want to drop to your knees and start snacking on his. Whether he is just brimming with confidence in what he brings to the table, or being totally unaware of just how sexy he is, we cannot say for certain. How he managed to keep his hands off his cock until he was 16 and hold onto to his cherry until he was 19 is something else that does not quite compute. But since he already has a 37-year-old ex-wife on his 'been there' list, once he found out what that seven-inch pleasure stick was for, he had as many ideas of what to do with it as we did.Already shirtless by the time we start rolling, the deep cuts of Julian's obliques form twin ridges that move your eye across the sculpted planes of his sinewy torso right to the prize: that lump in his jeans. He plops down, spreads wide, and digs right into his shorts, determined to be at full mast before he unleashes the beast. And as we expect; it does not take long before that perfectly tapered, cut cock is flopping back against his abs and those heavy-hanging balls do their happy dance underneath. His thick, dark bush encircles the base, and the gentle arc of his cock has the head depositing its first drops of pre into a pool on his navel. As he drums away, that cock does two of the things we like best... it gets longer and thicker, and it shows there is growing room left!We get a telltale view of his furry crack as his balls swell and spread his legs apart. Julian squirms in the chair, furiously working his shaft, pausing occasionally to reach down and rub that tender skin between his sack and his hole before accelerating to a double-fisted grip. His smile gives way for the first time, replaced with the sneer of desire as his babymakers travel up. In five rapid fire blasts like a firing machine toy at the height of the battle, those washboard abs are glazed with a thick coat of breeder batter.",
  "models": [
    {
      "name": "Julian",
      "person_id": 29272
    }
  ],
  "release_date": "2007-04-06",
  "scene_id": 55404,
  "series": "HeartBreak Stroking",
  "tags": [],
  "title": "HeartBreak Stroking"
}