{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "With that clean-shaven head, extremely well-worked body with muscles boarding on the massive side of the scale, 23-year-old Riddick may resemble ?Mr. Clean,? on the outside, but on the inside, this stud is as dirty as they come. Riddick surrendered his cherry a decade earlier to a crafty older woman six year his senior and has been jacking off and having sex ever since, whenever the opportunity presents itself. Riddick has the ?Gentle Giant? act down pat: he is friendly, easy going and, despite his expansive frame, remains the opposite of intimidating, but down right inviting. And part of what makes that invitation so compelling is the possibility, or perhaps the hope, that he could pick you up and toss you across the room and into the sack as easy as he could fling a dirty sock into the hamper at any second. Riddick was visiting us just a few weeks after the end of his quickie 3 week marriage. He told us he was the one to apply for the pardon and we have no doubt at all that is the truth, as who would ever let a stud this hot get away?With eyes locked straight into the camera, and with every part rippling even as he gently rubs up and down his body, Riddick brings to life the fantasy of what a star linebacker should look like when it is not the padding creating the imposing silhouette, but a framework of solid muscle. Stretching the armhole of his tank top to rub his nipple, Riddick soon bares that sculpted chest and directs his hand across his flat abs and into the Promised Land inside the waistband of his gym shorts. As they slide down and his briefs come into view, the clear outline of the ridge around his cockhead also clearly comes into view right through the stretched white fabric. His cock and balls lay tightly coiled like a serpent. The crotch of his briefs looks painfully tight. But fortunately they are soon removed, putting both Riddick and us out of our misery.He starts by exposing two of the most luscious, mouth-watering and perfectly-formed globes that together comprise one of hottest asses we have ever seen. As he humps away at the couch with the grace of cheetah doing a mating dance, we even catch a glimpse of the dark hole in the center of those tan line-free cheeks. A pity that there is no action allowed in this backfield, but then again, the goal post around front more than makes up for it. Starting with his shoulders and down to his toes and back, all of his muscles flex in a total body undulation committed to achieving a two point conversion, and soon a trio of thick, white splats criss-cross the tan playing field of still heaving abs. Do not worry guys; this is just the out of town tryouts. Riddick will be back next week for a special exhibition scrimmage that you will not want to miss.",
  "models": [
    {
      "name": "Riddick",
      "person_id": 28263
    }
  ],
  "release_date": "2007-04-20",
  "scene_id": 55400,
  "series": "Don't Leave Me Hard",
  "tags": [],
  "title": "Don't Leave Me Hard, Scene #01"
}