{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "If you called central casting and wanted to audition 'heart throb' types, as soon as Deklan walked in the door, you'd know there is no reason to look any further. The square jaw and piercing eyes on 24-year-old Deklan are the living definition of handsome. His body is the goal that drives most guys to the gym, and that 8-inch fat cock is the real American idol. Despite having it all on the outside, one of his most charming qualities is the one discovered in his debut here at CircleJerkBoys.com: he was as shy and nervous about dropping ?trou? on camera as anyone we had filmed before. It was a bolder, much more confident Deklan who returned to the studio for his second shoot. But that pales in comparison to the stud who came back in today?that big bulge pointing the way. Deklan has now not just embraced his inner porn star, he has unleashed the beast as well as?that mouth-watering cock in a one man show that packs all of the punch of a three-act play and enough sperm to open a fertility clinic.Deklan starts off with a few push ups and that definitely got his blood flowing?flowing right to his cock, as his hand immediately makes a crotch dive to rearrange that bloated fuck-stick to keep it from poking right through his pants. A few more stretches, and Deklan rolls over and does not just show off that pile driving ass, he gives a good slap and tickle right in the center. We know we are looking at a straight guy who has been introduced to the idea that his hole might not be strictly decorative after all. With that potent cocktail of testosterone and endorphins coursing through his veins, he strips off his shirt, mounts the bed, and begins to hump away as he works his jeans and underwear down until those snowy-white glutes are unwrapped like a much hoped for holiday gift. And damn, he was more than ready to start playing.A slap on his open hole is all it took, and while Deklan must have been born with a full-blown hard on and never gone totally soft, even for this walking erection, that huge meat has never reached this proportion before. With long strokes that often start at his hole and work their way over every throbbing inch, Deklan's need for speed eclipses the volume of grease the dispenser's pump can produce. So he pulled off the top and poured the lube all over his cock and ass, rubbing it up into his chest until his entire body was one sweaty, gleaming shrine to masturbation. Laying back, clearly lost in a wave of sensation so powerful he seems to be having an out of body experience, we know it will not be long before his sperm will have an out of body experience of a different kind. With moans so loud and deep they make your own balls tickle, his eyes roll back in his head. And, despite being across the room, Deklan unleashes a rapid fire artillery blast of sperm that uses the lens of the camera as a target; and boy, he does he ever hit the bull's-eye.",
  "models": [
    {
      "name": "Deklan Connors",
      "person_id": 28224
    }
  ],
  "release_date": "2007-03-30",
  "scene_id": 55406,
  "series": "Str8's Are Wild",
  "tags": [],
  "title": "Str8's Are Wild, Scene #01"
}