{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It usually takes weeks of planning, a lot of persuading and even more cash to arrange a duo here at CircleJerkBoys.com, but for the first time, we hit the jackpot on the very first play. We had just finished filming an episode with a horny and hung 21-year-old named Commando, and before we he had even turned off the lights, he had the eight-inch beauty up again and was ready for more. As we went to get fresh tapes for the camera, there was a knock at the door: unannounced guests are generally not allowed when we are filming, but when we saw it was Stefano on the other side of the door, there is no time a stud this fine ever has anything but a welcome mat out for him. It was over a year ago that Stefano first appeared here and gave his thick, eight-inch slab of pepperoni the glorious showcase it deserves. Stefano was missing in action for almost a year, but then he took us by surprise and simply turned up one day, just as he has today. We responded the only way possible: we immediately got out the camera and he immediately got out his dick. Also like that day, we express our happiness at seeing him again by making a trip to the ATM and introducing him to a pile of Benjamin Franklins and someone we hope he is about to get to know much better: Commando. We decide to roll the dice, and before they have a chance to connect the dots, we connect the DVD player, open the beer, and hope that will not be the only connecting that will be going on.The interview was the usual banter of pussy tales and conquests, with two young bucks both jockeying to be the biggest stud. They have no way of knowing that soon enough, despite having gotten used to being complimented on the size and width of their big fat dicks, when it comes to the cock department, this is now an even playing field. Soon enough, the combo of cold beer and hot porn has the desired effect, and both guys are rubbing the prominent bulges in their jeans. They are paying attention to the camera and definitely not each other, even when they strip off their shirts. Commando's jeans are not long to follow, and almost instantly, he is pulling open the leg of his briefs to reveal a cock that is growing before our eyes, until a good couple of inches are exposed on his thigh. He has kept his eyes riveted to the porn, but we see Stefano steal a glance at that now fully-hard cock when he thought no was looking. It was not long before Stefano moves and stands out of Commando's view before opening his own jeans and revealing a very hard cock of his own. We are not sure why he positions himself that way; is he a little shy wondering how his own equipment matches up? Is he a little freaked out at being so close to another man's dick? Or maybe, is this his sleuthy way of getting a better view of those eight thick inches of Commando's that are pointing toward the ceiling? The answer to that question is one we cannot wait to find out, and we do not have to wait long.Stefano comes down and sits on the floor next to the couch until he and Commando are both stroking away, their shoulders almost touching. They both stand up, allowing us a glorious view of those two big fat, drooling cocks swaying over our heads that is worth a million bucks. The only way they could both be on opposite ends of the couch at the same time and still have the room to do the deed in their quest to seed was to lay their legs over each other?oh yes, contact at last! With the impish look of someone doing something he is not supposed to do, Stefano, oh-so-tentatively lets his hand wonder over to Commando's cock and takes over the stroking. In a most ironic display of 'anything-you-can-do, I-can-do-it-better' machismo, Commando grabs Stefano's cock: both of them sporting big grins and even letting out a giggle as they looked right in the camera. Seeing both of these guys, touching a cock other than their own for the very first time, and being the ones to record the moment for posterity, made us vow to never quit our day jobs. And despite the initial jitters, it does not get in the way of a massive load Stefano soon dumps all over his abs. Then he gives Commando's balls a little good luck rub and the second explosion soon follows. So did our gamble pay off? Well, what happens in Vegas may stay in Vegas, but this is Miami, baby and damn, did it ever get hot!",
  "models": [
    {
      "name": "Commando",
      "person_id": 28268
    },
    {
      "name": "Stefano Ricci",
      "person_id": 28225
    }
  ],
  "release_date": "2007-03-23",
  "scene_id": 55408,
  "series": "Love Thy Neighbor",
  "tags": [],
  "title": "Love Thy Neighbor, Scene #01"
}