{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "laiming ownership of 8-inches of thick, uncut dick packed on his compact 5'6', 135-lbs. frame and going by the name Commando, it is no surprise that this 21-year-old produces jizz at a rate that would bring a sperm bank to capacity. Likewise, it did not come as a total shock that this is just the kind of over-sexed breeder who answered our ad for models and was more than eager to make a few bucks for something he does at least a couple of times a day anyway: namely, milking that big pole. Of course, normally he is doing his jacking in private, but for Commando, not only was rubbing off a load in front of the CircleJerkBoys.com camera something he would do to get the job done and get paid, he is just the kind of cocky man that finds being watched a turn on. We had just started to film his episode when a rival in both the big dick and exhibitionist departments, that sexy half-Italian, half-British and total stallion, Stefano, stopped by. Though we usually ease a model into trying a duo scene, we let the beverage, porn and the almighty dollar do the talking and put Stefano and Commando together for a buddy jerk off that led to a little mutual exploration. That proved to be only the first chapter of the surprise party that day. After Stefano left, Commando announced that since he had come to do a solo, he was ready to do his solo and cum.Giving a sly wink and furtive leer, Commando lifts his shirt to show off the ridges of his abs before looking away as if to give us the stealth crotch rub as he digs inside his jeans and does the same. He gets down to his boxers and gets down to business, working that big piece of meat inside. He gives a shout out to the imaginary homey he is making his own very personal dirty video for, but this is not about you-tube, it is about his tube. Elevating teasing to an art form, he flashes us that round, tight ass, then plays a game of peek-a-boo with his pinga. Finally, all fat eight inches are sticking straight up in the air and ready for some serious TLC.Rising to his knees, his long and thick cock swings back and forth with the heaviness of a wrecking ball and looking capable of doing just as much damage. After swirling it around like a helicopter propeller, his dick leads the way as he moves to the chair and slows a bit, softly stroking up and down, allowing the skin to pull up and kiss the shiny pink head. He then just sits back and lets that meat pierce the air, no hands required, giving us the perfect view to imagine that pole all ready to slide in to whatever opening you want. Though his opening is definitely off limits, he turns his back, spreads wide and shows off that dark hairy hole and dripping meat all at the same time. He then sits on the floor, rubbing off a thick, white load that puddles down his palm, shaft and onto his balls, completing his second withdrawal from the sperm bank in a single day!",
  "models": [
    {
      "name": "Commando",
      "person_id": 28268
    }
  ],
  "release_date": "2007-04-13",
  "scene_id": 55403,
  "series": "Horny & Helpless",
  "tags": [],
  "title": "Horny & Helpless"
}