{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We had the equipment packed, the suitcases zipped and were just about to leave the apartment we rented in California when Brad knocked at the door. This 6'3', 175-pound serving of straight man has smoldering good looks, an easy but very sexy manner, and two of the most kissable, soft, pouty lips we have seen in quite some time. With the solid frame of a stud who was blessed by the most desirable end of the gene pool, one knowing gaze from those big brown eyes, and it seems like you are looking at Dean Cain's naughtier little brother. But the bulge that is packed into those jeans says our Brad also qualifies to be called a Man of Steel. While unwrapping the package is half the fun, in less then 30 seconds, Brad has his shirt off, his pants open and that 7' at full mast and pointing toward the ceiling. Brad is soon lost in a Zen-like nonchalance, as if jacking off in front of us was the most natural thing in the world.His hand clings to his cock and steadily strokes that shaft with slow purposeful strokes: Brad is clearly in no hurry, and seems like he is a guy enjoying his favorite hobby and happy to have us along for the ride. As beautiful as his cock is, his balls are nothing short of spectacular. Rather than the two orbs of a mere mortal, each one of Brad's over-sized nuts seems like a planet in its own right with a low hanging sack to keep them in a parallel universe. From the moans of pleasure from those succulent lips, to the occasional wink from those piercing eyes, it is difficult to tell who is having a better time, him doing the deed or us watching: we decide to call it a draw! The vein on the underside of that shaft becomes deeply pronounced as Brad spreads his thighs to allow those bloated balls the room to make their journey up as the precum begins to stream from the tip. Still as relaxed and composed as ever, his dick adds a good inch-plus as he begins to use his own juice for lube and polishes his knob until the head is gleaming. With one hand stretched out to keep him for sliding off the couch, he begins fisting double-time until a thick, white frothy load covers his hand, his shaft, and then begins to form a puddle on his dense, dark bush. Fee for changing our return reservations, $200, two rooms in the airport hotel for the night, $363.50, the charge to film one additional handsome, hung, horny breeder before we left the west coast: Priceless! See you next week!",
  "models": [
    {
      "name": "Brad",
      "person_id": 29260
    }
  ],
  "release_date": "2007-03-09",
  "scene_id": 55414,
  "series": "Thanks For Cumming",
  "tags": [],
  "title": "Thanks For Cumming, Scene #01"
}