{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "21-year-old Jon is a Puerto Rican-born, Miami-raised equal opportunity employer when it comes to the ladies: when he says ?All women are beautiful,? he does so in a way that means he knows of what he speaks. Jon is a self-professed tit-man with a ?the-bigger-the-better? attitude, and one of the few guys who will freely admit that size to him is much more important than being natural. Jon loves getting head, and he has a beauty of an uncut dick at the base of a naturally-lean, very sexy, deep set of abs. Though it is his first time in front of the camera, Jon wastes no time in shedding his shirt and showing off that marble-smooth skin, totally devoid of any hair, except for that pale, sexy line that begins under his navel. While he has been going at a pretty rapid clip?as if by instinct, and more likely, reinforced by a few years of personal experience?when it comes to his belt, Jon begins to undo it with a ceremonial ease that almost seems to be in slow motion. But once he stands up, and the growing bulge in his boxer biefs pushes the zipper the rest of the way down, we know it is definitely show time.He locks his penetrating eyes with the lens as if to dare us to look down at the prize in his hands. As he continues to rub the awakening prize in his shorts, that mound is rapidly growing into a mountain that we are more than ready to climb. With the characteristic reluctance of most straight guys, Jon is hesitant to show off the fine, white, round twin globes of his ass. But once revealed, they are well worth the wait. Moving to the couch, he overcomes that shyness as he starts grinding against the cushions, that flawless ass undulating like sheer poetry in motion. With yet another glance packed with lustiness well beyond his years, Jon flips over and offers up that hard as steel cock like the ice cream man extending a cool, creamy dick-sicle just begging for a slow, long, hard lick.Jutting out from a thick, dark-brown bush, Jon shows us that, despite being at full mast, he can still ease his skin up over that perfectly arrow-shaped, deep-red cock head with the same deliberate reverence he displayed at the beginning. This is pure straight guy jerking off, but this is also one who appreciates being appreciated: the longer he is on camera, the longer his cock seems to get. Going from the chair to the back of the couch and finally onto the floor, Jon is determined to make the most of his stint as a sex object. And the way his balls are tightening up, we also know it will not be long before he is making a big fat load as well. With his eyes closed as he enters the land of bliss, a thick serving of batter soon covers his abs as a huge smile takes over his face.",
  "models": [
    {
      "name": "Jon",
      "person_id": 29290
    }
  ],
  "release_date": "2007-03-16",
  "scene_id": 55411,
  "series": "Deep Down",
  "tags": [],
  "title": "Deep Down, Scene #02"
}