{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Three has become a lucky number at CircleJerkBoys.com. And all you have to do is think of Vinnie and Mauricio acting as bookends for horse-hung, sexy-as-they-come Sebastian, or Motor City Boys; Diamond Dick, TinMan and Brad Pitt Jr., Dirty Harry, or the time Aiden and Damien rear-ended Shane to know why. Lady Luck has smiled on us again today as Zack and Ganador act as the playground for breeder-bone-loving Devon. Zack oozes an intoxicating sex appeal from every pore on that ultra-lean, chiseled, tight body?from the top of that ?I am the answer to your fantasies? look in those big brown eyes, over those washboard abs, across that perfect cock, all the way down to the tips of his toes on the other end of those well-worked calves. Ganador is a wonder from down under with a look as distinctive as his accent and a cock that is as thick as his Aussie brogue to boot.Zack and Ganador keep their eyes riveted on the porn playing across the room. And the very visible bones between their legs indicate they like what they are seeing. Devon is sitting between them with his head bobbing back and forth between their crotches, his red face and his own massive bulge laying testament to how much he is enjoying what he is seeing as well. Zack moves over to the bed and hauls out that thick slab of meat through his fly, but you need to look fast to see it as within seconds, that plum cockhead is tickling the back of Devon's tonsils. Zack apparently is enjoying that test drive as he strips off his shirt and offers those etched abs as a road map for Devon's hands to explore pounding away at Devon's hungry mouth. At the same time, Ganador finds the live show they are putting on is even better than the porn. As he removes his own shirt and opens his pants, that fat slab protrudes from his snowy briefs, pointing the way for an encounter that is getting more interesting and more unexpected by the second when he moves over and joins the action on the bed.Zack and Devon slip into something more comfortable, namely their birthday suits. But when Zack's hand slips off Devon's back and starts exploring the tent in Ganador's briefs, we stifle our gasps as all bets are off on what will happen next. Zack hauls out Ganador's cock and Devon quickly chows down on that thick meat all the way to his pubes. It is a stroke and suck fest from here on, with Zack ending up on his back and Ganador straddling his thighs and blowing his load all over Zack's belly with Zack's own load soon to follow. Zack even reaches over to give Devon a helping hand, and Devon's cock responds with an explosive thank you all over Zack's chest. Three is indeed our lucky number and damn, did we hit the jackpot once again or what! Till next time, Guys!",
  "models": [
    {
      "name": "Ganador",
      "person_id": 28172
    },
    {
      "name": "Zack",
      "person_id": 28223
    },
    {
      "name": "Devon",
      "person_id": 29206
    }
  ],
  "release_date": "2007-02-23",
  "scene_id": 55418,
  "tags": [],
  "title": "A Lil Bit Of Ecstasy, Scene #01"
}