{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The saying is that everything is bigger in Texas, but our trips to California have proven the Golden State has some well-deserved bragging rights of their own with the 6'2?, 210-pound linebacker Troy and the 6'1?, 195-pound stunner Wade as prime examples of straight guys at the top of their sexual game. On the opposite side of the size spectrum is today's West Coast serving of breeder, Johnson. While this 20-year-old army brat measures but 5'6? and weighs in at a buck-fifty, that 7? pole is more than just regulation equipment. Having already jacked off twice before he arrived at the studio, his sexual appetite seems bigger than all of the Cali boys that have cum before him put together. When he first arrives, Johnson has already stripped off his shirt by the time the door closes behind him, putting well-worked arms, a nice set of pecs and a trail of freaky ink running down his left side on eager display. As he settles back in the bed, the charisma pours out of those dark, adorable eyes and his thick, meaty solid frame lets you know this is no 90-pound weakling, despite what the scale and the tape measure may say. Johnson says he loves to jack off, and from the moment he starts to rub the bulge in his jeans, he is a man in his element. The reverence in which he begins to massage his cock screams that this is not a guy who seeks to squirt out a load as quickly as possible, but one who views masturbation as divine joy, to be savored and enjoyed. And he sets out to do just that. He opens his pants and reaches down with deep, purposeful strokes, enjoying the sensation of the rough denim on his tender cock head before hauling out a beautiful, rock-hard, cut cock into the air, signaling the real war games are about to begin.As he slides his jeans down to ankles, Johnson spreads wide, and we get our first glimpse of a round, hairless ball sack already bloated to the size of an orange. He starts with his eyes transfixed on his own crotch, then the porn we have playing for him, but now, hard and throbbing, he looks into the camera with a soulful gaze and keeps it there. Moving to his knees, we are treated to the clear line of his dark, wide bush, and we follow him as he strokes that cock from every angle and every spot in the room until he settles back on the bed and begins pumping for the home stretch. With total control over his own sexual destiny, we get a flash of the dark swirls under his arm as Johnson puts one hand back behind his hand; and, with the other, squeezes out his third load of the day with all of the enjoyment of the first.",
  "models": [
    {
      "name": "Johnson",
      "person_id": 28221
    }
  ],
  "release_date": "2007-03-02",
  "scene_id": 55417,
  "tags": [],
  "title": "Stroking With The Enemy, Scene #02"
}