{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "From the first time we meet the TinMan, his 'I-will-do-anything-once' attitude is put to task and he passes every test. He proves to be a man of his word-from the three-way buddy jerk-off, to getting sucked off by the luscious Dirty Harry, to even being in the middle of a fuck-sandwich with Taz and Sean. With a wannabe-thug demeanor from the other side of the tracks, long-haired Miguel likewise first appears solo; and when he tells us there is no shame in his game, we take him at his word and pair him up with Ely for an oral exploration that leaves him, and us, ready for more. After learning that the TinMan is about to become a father, he calls up and says that he's up for one last visit to 'Boy's Town' before he starts answering to 'Pops.' We also recall a desperate plea from Miguel to see if we have anything available to help him pay those holiday charge bills. His cherry is what we want and we're prepared to pay the price, though by the time the TinMan is finished with Miguel's hole, Miguel is practically ready to pay us; but we let him keep the money; he has earned every penny. The macho posturing at the start is quickly tossed aside along with their clothing. In record time, the TinMan is on his knees and Miguel's cock is as hard as we've ever seen it before. While that can be written off to 'a mouth is a mouth,' it is when the TinMan leans up and kisses Miguel, and Miguel kisses him back, that we know things are definitely crossing into the land of shared satisfaction. They continue with the slow, tentative-yet-hungry kisses used to perpetuate the feelings inside for a bit, before the TinMan resumes an oral exploration that has Miguel move up off the bed and sit on the headboard to allow the TinMan total access. That opens up the point of entry for the TinMan's finger, and after it disappears, Miguel takes over and continues to finger his own hole. The TinMan grabs a condom and stares up in amazement, never taking his eye off the prize. With his cock at full mast and his hole lubed, Miguel squats over the TinMan and lowers himself down, not stopping until he has it all. Miguel's cock stays rock hard as he grinds up and down, working the TinMan's pole into every nook and cranny before he gets on all fours and pushes back into the TinMan's meat as the TinMan slams forward. The TinMan fucks him with enough strength until we can see and hear TinMan's balls slap against Miguel balls before they fall back breathless on the bed and fire off massive loads one after another. Not bad for a couple of straight guys, eh?",
  "models": [
    {
      "name": "Miguel",
      "person_id": 27783
    },
    {
      "name": "Tin Man",
      "person_id": 28200
    }
  ],
  "release_date": "2007-01-26",
  "scene_id": 55427,
  "series": "The Tinman Cometh",
  "tags": [],
  "title": "The Tinman Cometh"
}