{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Half Sicilian, half English, with a tight delicious body, a smattering of sexy ink, a delectable ass, a face to drool over and, oh yes, a fat eight-inch cock that is always ready for action. These are just some of the many, many horny reasons why you all have been clamoring for a return visit from the time Stefano appeared here on CircleJerkBoys.com over 6 months ago. We're not sure if it took him half a year to get over that first initial explosive debut on camera, or it took that long to work up his nerve to admit to himself how much he liked being filmed and knowing he had become the object of a zillion fantasies and countless wet dreams that was responsible for his absence. But when he showed up again out of the blue, we could not get him back in the studio fast enough. His eyes are just as piercing, his body as hot as ever, and the vision of that already hard cock packed into his jeans alone is worth the price of admission. But Stefano also shows us how his early promise of burgeoning sexual magnetism has blossomed into a full garden of commanding sexual delight. And we are more than ready to cultivate this harvest.The shirt is history almost immediately and Stefano works his hands over every inch of that tight, toned chest and down into the packed crotch of his jeans like his body is a sexual theme park one hour before closing time and he wants to make sure he hits every attraction before the lights go out. The dark swirls of pubes spill out of his open zipper, and he sprawls back and rubs and caresses that package inside with a masterful hide-and-seek technique to ensure you are as turned on by what is inside as he is. We are treated to a rear view of that cute little butt as he steps out of his jeans. As he falls back on the sofa, he grabs a pillow and grinds it against his cock before moving to the bed and humping the mattress. From the look in his eyes and the moans from his lips, you can almost see the vision he has in his head of him reliving his last fuck with some lucky slut. But when he rolls over, it's clear this is a guys-only feature. And from the way that cock sticks right up in the air, that does not seem to be a problem for Stefano at all. His balls are already tightening as he spreads his legs wide to invite us in to see that tower of dick in all of its glory. His grasp is so tight on that fat shaft, it almost seems like it will topple over on its own weight. As he lets the shaft go, it lands with a loud thud on those fat-free abs and does that hand-free cock dance, creating a memory you will want to save in your personal fantasy safety deposit box and revisit often. Taking a seat on top of the headboard, he splays his legs and looks down with a commanding gaze like a general on a mountain top inspecting his troops down below. His cock is now twitching with a life of its own; his hands are almost optional at this point as the long cum strands he makes when he places his fingertip on the drooling cockhead illustrates in the ultimate visual aide of breeder guy arousal. The need to seed becomes uncontrollable and to the chorus of heavy breathing and loud moans, Stefano releases a thick load over his abs, shaft and thighs and keeps milking that still hard cock even after we stopped rolling.  If you are wondering what he would do if another guy was in the room jacking along...we are too! Stay tuned guys...we hope to be back with some visual aides of our own!",
  "models": [
    {
      "name": "Stefano Ricci",
      "person_id": 28225
    }
  ],
  "release_date": "2007-02-09",
  "scene_id": 55423,
  "series": "Cafe Con Leche",
  "tags": [],
  "title": "Cafe Con Leche, Scene #02"
}