{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "he minute you saw them, you let us know how you felt; and now all you need is to say their names for the CircleJerkBoys.com All-Stars to make you want to grab your mouse with one hand and your dick in the other: Anthony, Antonio, Sebastian, Dirty Harry. A little while ago, a new name joined that roster; Deklan. It took us a while to get him back here from California just in time for Valentine's Day.  We have an encore command performance for the man who brought in an avalanche of email with words like ?magnificent, my ultimate fantasy, and perfection in briefs? running though many of them. Leading-man handsome and porn-star hung, this 6'2? strapping hunk of straight stud has a thick 8?-cock that never quits and balls that must work overtime to produce that much cum. Despite having the face, body and cock many of us dream we had, not just to ourselves, but on ourselves, one of the most endearing things of his first foray under the camera was his case of first-time jitters that had him so nervous he was afraid to get completely naked, much less show the magnificent ass. Today is a whole new story, guys, as Deklan struts his stuff like never before.Looking like an actor caught watching porn in his trailer in between takes, Deklan already has his hand stuffed deep into pants, working that fistful of dynamite from even before we have the camera going. Brazen enough to lose his shirt this time, he sprawls back on the arm of the couch and appears lost in the dirty movie playing inside his horny brain. That is, until he stands up and is so hard, the sheer weight of his meat pushes the tightly stretched fabric out of the open fly, showing off the ridge of cock head right through the material. Taking a seat, the view of this hunk stroking away right through his boxer briefs is permanent jack off material. Then he stands, kicks off his shorts, and does something we never expect to see. He moves to the couch, gets on the cushions and spreads wide, allowing the camera an unobstructed view of his meaty ass and no man's land of the hole in the center, even winking right at us. That cost us to pony up a big pile of extra cash, but money well spent! Ahh, to be that couch as he mounts it and grinds away like he was really fucking, but the view gets even better when he straddles the arm once again, this time spreading wide and allowing us total access. From the sexual leer in his eyes, the precum starting to drop from his cock, the dancing of those low hanging nuts and the darkness of that hairy hole below, he is on the cusp of sexual Zen. He is now firmly in the stroke zone and fists that throbbing meat while sitting on the back of the sofa, crouching down on the floor, standing up over us until he can stand it no more and lays down and just in time for Cupid to shoot his bow, Deklan shoots one of his now signature epic loads all over his pecs and stomach.",
  "models": [
    {
      "name": "Deklan Connors",
      "person_id": 28224
    }
  ],
  "release_date": "2007-02-16",
  "scene_id": 55421,
  "series": "A Porn Star Is Born",
  "tags": [],
  "title": "A Porn Star Is Born, Scene #02"
}