{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "He came up with his name, ?Jack Me Hoff? all by himself, and after you see the thick eight-inch pole on this guy, jacking him off is just what you will want to do...for starters. The 22-year-old Jack showed up not just eager, not merely anxious and much more than excited about showing off his goods on camera, he seemed he could not go on one more day without releasing his inner porn star and as always, CircleJerkBoys.com does what it can to help a guy out. Jack is but a good hair cut and a few months at the gym away from lead singer in a band or a heart throb on a new MTV sitcom. But those lips; soft, thick, luscious and oh-so-kissable are definitely ready for prime time. He quickly made history of his shirt; showing off that home-made ink on his pec and began to flex his arms for the camera. His jeans were riding so low that they also fell to floor. And, despite a last second bout of the first time jitters, one look just under his navel at the swollen pink cockhead sticking over the waistband of his shorts was the best indicator of all that there was more to Jack than meets the eye... a good eight-inches more.A little quality time with a porn video was all it took to get Jack back on his feet and out of the rest of his clothes. Under the dark, untrimmed natural jungle of bush, Jack's cock was sticking straight up, pointing towards the ceiling and featuring a wicked bend that looks like it could be both dangerous and powerfully enjoyable...or both. His balls are like two clearly separate hemispheres hanging low in their sack under a shaft that is very thick and sporting an over-sized cum tube that we are sure will be getting a test-run later. Perhaps because of the way it curves, but as he swings that meat back and forth hands-free, that big cock looks like a boomerang slicing through the air. Coming to a stop, we focus on that pole as he makes it dance hands-free, demonstrating the ultimate control he has over that quite formidable slab of breeder meat. This might be his first time on camera, but Jack has clearly been practicing for the opportunity. And in this case, practice does indeed make perfect.Settling back in the chair, his cock once again pointing at the ceiling like a mighty torpedo, we see the stream-lined cut head hitting back against his belly well above his navel, beginning to leak a bit. Rubbing his balls with one hand and the shaft with the other, we finally get Jack to turn around and put one leg up on the chair, getting the perfect view of that fat drooling meat, swollen balls and that never-seen-before hairy hole in the middle. He would have turned around quicker if he knew just how that view is, with those creamy white cheeks with that shaft in the center. Back on the chair, pounding away until his face is red and the sweat is dripping down his chest, Jack finally lets the prize go and his entire stomach is covered with a massive thick load. Not bad for a first timer, eh guys? See you next week.",
  "models": [
    {
      "name": "Jack",
      "person_id": 28228
    }
  ],
  "release_date": "2007-01-19",
  "scene_id": 55428,
  "series": "Just The Goods",
  "tags": [],
  "title": "Just The Goods, Scene #01"
}