{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Our tour of sexy, 18-year-old Jerry goes right past his color-blocked t-shirt, over his board shorts, and down to the sole of his flip-flops to reveal, in one glance, this hot guy's story. Jerry is a horny skater kid we met during our last trip to the Sunshine State who has two main goals in life: getting drunk and getting laid. Before the day is done he adds 'showing off' to the list. This is one breeder who played our camera like it was a violin, producing some sexy tacks and one hell of a load in the process. A tousled mop of dark-brown hair, deep dark 'fuck me' eyes, a sexy nose and gleaming skin all act as the perfect setting for the real jewel on his face: some of the fullest, most perfectly formed, deeply crimson and plump, kissable lips ever put on a man's face. As those lips start moving and Jerry begins to speak, we almost melt when instead of the lazy California valley slang we were expecting, a low, seductive vibrato laced with the masculine tones of a Bavarian accent fills our ears and starts causing other things to immediately fill as well.Jerry eyes are tightly shut, the heavy breathing starts immediately and as he raises his shirt, oh so slowly. You can almost see the images in his mind of a centerfold doing the undressing rather than his own hand. He explores every inch of his chest as if still getting used to the feeling of those few, sparse dark hairs that are just starting to sprout. His other hand ventures south, opening his shorts, reaching into his underwear, and we get a glimpse of his golden brown pubes which are as thick and bushy as that hair on his other head. Unlike most American guys, Jerry is not reluctant to expose his soft cock to us and plays a game of peek a boo with his boxers before standing up, giving us a glimpse of his ass, then losing his shorts for good.Settling back on the couch, a few tugs is all it takes until Jerry is rock hard and that wet cock head peeks through its crown of foreskin. His profile is simply stunning-so much so that, although he seems reluctant to give much eye contact to the lens, he looks so good in the lens, we keep on going. Then all of a sudden, he finds his courage and not only gets on all fours on the couch, he reaches back with one hand to spread his cheeks so we can see the no man's land of his definitely untouched hole. With the other hand, he strokes his cock and points it down so we have a clear view of it between his legs, then he tucks his face down as well. And like winning the Triple Crown, Jerry gives us a view of his face, his ass and his cock-all at once! Sitting back down, with a strong one-handed grip, Jerry's moans get louder as his nuts begin to contract and our Spermin' German lives up to his name!",
  "models": [
    {
      "name": "Jerry",
      "person_id": 28226
    }
  ],
  "release_date": "2007-02-02",
  "scene_id": 55425,
  "series": "The Milking Hour",
  "tags": [],
  "title": "The Milking Hour"
}