{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Many guys head to Florida for spring break, but few come from as far away as Italy. Fabio definitely seems to find his way around town, and while here for only a week, he manages to find our studios as well. Though his sun-kissed skin give him the coloring of a local guy on the make, his Roman nose, mop of wavy-brown hair and perfectly-formed lips spoke of his Euro roots just as loud as that oh-so-sexy accent. Fabio wastes no time in making history of his shirt and immediately begins to rub up his smooth chest while holding a beckoning gaze dead into the camera that drips with a man in desperate need of sexual release. And did he ever come to the right place for that.He is soon down to a pair of skimpy black briefs, and it does not take much time for something to start stirring inside. Fabio pulls the waistband down low enough to show the shock of white, untanned skin below and the top of his sable brown bush. Apparently shaving pubes is not as popular overseas as we say a silent prayer of thanks for that. He reaches down and hauls out that meat, the thick, uncut head already starting to leak above a pair of furry balls that are definitely overdo for an emptying. As he stands and pounds away with one fist, he looks like a sexy race car driver caught in the locker room, going for a checkered flag of a different kind.nSettling to the chair, the sweat gluing one curl to his forehead, his cock seems to have doubled in thickness and is now a fat tower of hungry meat sticking straight in the air and begging for attention. Moving to the floor, we get to take a close-up view at the dark, hairy no-man's land in the center of those milky-white cheeks. He bends over, displaying his assets while fisting that pole before settling back, spreading wide until his cock is so filled with blood it develops a wicked curve and stands straight up like a hands-free monument to horniness. Slapping his meat back against his belly so loud it echoes like a gun shot through the room, he lays back one final time, then gushes out a load in a massive steady stream that does not stop pumping until a trail of cum criss-crosses his abs to his stomach and forms a deep puddle on the cushion after it drips down his sides.",
  "models": [
    {
      "name": "Fabio",
      "person_id": 28229
    }
  ],
  "release_date": "2007-01-12",
  "scene_id": 55430,
  "series": "Italiano Valentino",
  "tags": [],
  "title": "Italiano Valentino"
}