{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Kicking around a soccer ball in the great outdoors can build up a sweat, as well as a hell of a boner on any guy. When the guy in particular is Antonio and the equipment is over-sized like his, even in its ?off season? state, the combination is down right explosive for all parties concerned. We all know from his first appearance it does not take much to get Antonio horned-up, and with an 8-inch cock like this and a body honed to a graceful example of what a fine college athlete at his prime looks like, it seems impossible that he could get any hotter. But as we saw from his encore, he does. Did all the running on the field prepare that very fine, muscled butt for the fierce pounding Anthony gave him? Did all of those residual endorphins give him the drive to turn the tables and top the TinMan like a sex-starved convict? Antonio answers the question with his actions: he is just a horn dog with an appetite for constant release. Home from school, visiting us on a little break from academia, this time we did not just hear about his prowess on the soccer field, we get to witness his considerable skills and get invited along for a post workout cool down that will keep you warm all winter long. As if Antonio's chiseled body, glistening with sweat and gleaming under the sun, was not already a postcard from heaven, seeing him in his soccer uniform, kicking that ball around with precision footwork, sending it high in the air, catching it in the crook of his neck and keeping it in place while he does push-ups, sends his status as a prime stud into the stratosphere and will take your cock to new heights right along with it. He leaves the door open as he showers off, giving us a tour of a body that's leaner, harder and hotter than ever. By the time his shorts hit the floor, and mercifully it does not take long, we are reminded that as sexy as the wrapping is, the package inside is definitely championship material. That fat, thick, uncut 8-inch goal post is quickly at full-mast, swinging back-and-forth like a mighty pendulum under the steady stream of water as he steps in the shower. Working that pole, and himself, into a lather, he turns around and serves us another reminder: Antonio has one of the finest backfields in the league! Seems the warm water trickling on that hot hole had the same effect on Antonio as it did on us, because when he opens that towel after moving to the bedroom, that legendary slab of meat is throbbing hard. Following one more ass flash, done as much for his benefit as for ours, he flips around once more, whirling that cock around like a propeller blade, then settling back for the real exercise he has been dying for?working that meat! The expressions on his face and the moans from those full, pouty lips lay testament to the incredible sensations he is feeling as he works that cock with one hand, then the other, stopping to slap it against his belly, moving down to his swollen balls, then finally back to that now leaking head, peeking its way from the fold of skin. Hopping on the bed and humping against the mattress like the Energizer Bunny of sex that he is, with a last turn onto his back and a few final strokes, that legendary meat ushers out a legendary spurt that lands over his shoulder and leaves a trail all the way down that heaving chest. We cannot wait for him to cum home for spring break!",
  "models": [
    {
      "name": "Antonio",
      "person_id": 29262
    }
  ],
  "release_date": "2007-01-05",
  "scene_id": 55433,
  "tags": [],
  "title": "Antonio's Soccer Balls, Scene #02"
}