{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "With his spiky hair, devilish grin, playful eyes and a sexy lean body, 21-year-old Zack looks like the guitar player from a boy band, as proud to show off his new facial hair as he is to brag about what he does with groupies. In short order, he begins working up his t-shirt, exposing that flat stomach and that sexy trail of hair that begins under his navel and dead ends into nirvana just below those dark blue boxers. Zack makes history of the shirt, tossing it over his shoulder and, owning the moment, relishes the chance to be the very object of desire to the fullest. His chest is marble smooth, his nipples hard, and as he flexes his chest, the tight musculature of his body gleams like a living anatomy chart of what a hot college guy in his prime can look like if he was blessed from the right end of the gene pool. His is naturally lean, effortlessly defined and possesses a set of abs that wet dreams are made of. Wiggling out of his shorts and giving a good solid grasp to that growing mound in the middle, it is clear Zack now has something else on his mind...and in his fist.Like a gigolo beyond his years, Zack works the nuance of every pose, letting the waist band fall so seductively on his lower abs. He lets us appreciate the defined arch of his obliques before turning around, showing off those well-toned arms as he works the boxers down, and revealing inch after inch of rock hard, creamy white, jock butt cheeks as round as they are tight and just as hot as they come. Keeping his meat covered, he works the anticipation to the fullest until we are almost afraid that what is below might be the fly in this otherwise perfect ointment---but fret not! He pulls his hands away and what appears is a solid, thick, cut, bona-fide two-fisted boner of delight.Thankfully bucking the trend and letting his dark brown bush grow free, Zack's cock is unlike the rest of him in one respect: his body is thin as can be and that cock is as thick as they come. Not just thick, it is veiny, meaty and long. With a set of heavy hanging balls, his shaft is almost as wide around as both of those nuts are together. When he grabs the shaft low at the base, it becomes a throbbing red tower with a flaring head that threatens to spread precum on his own nips. Working up a bit of sweat with the intensity of the feeling he is creating, he looks right into the lens to make sure you know this is no act on his part; that cock is making him feel that good and oh yes, he is glad you are along for the ride. On the floor, in the chair and finally sprawled back on the couch, Zack hammers away at that nut until he finally explodes like a geyser all over that still heaving chest and belly. Wonder how much he would shoot if a mouth worked that pole instead of just his own hands? Stay tuned guys. We will be back with a visual!",
  "models": [
    {
      "name": "Zack",
      "person_id": 28223
    }
  ],
  "release_date": "2006-12-01",
  "scene_id": 55439,
  "series": "Sexy Is What Sexy Does",
  "tags": [],
  "title": "Sexy Is What Sexy Does"
}