{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We begin the New Year here at CircleJerkBoys.com with a bang...a gang bang, that is! While these hotties are not new to our cameras, having them all together, up, hard and ready, definitely is. We begin with Taz: that lean, inked, sexy devil with a bad-boy sneer and perpetually hard cock. Taz inspired a ton of emails from his solo debut, but that was nothing compared to the avalanche we received after pairing him up with Sean. Laying back and getting sucked was not such a surprise, and even fucking Sean's hole did not shock us; but, seeing a guy as straight as Taz give Sean a reach around and deep, tonsil-licking kisses sure was. The TinMan is something of a sexual adventurer. We have seen him alone, we have filmed him jacking with his bud, and the visuals of him with oh-so-sexy Dirty Harry will forever reign as some of the most memorable, sexually-charged footage we have ever captured. Taz and the TinMan together were like two sticks that needed a spark to ignite the flame, so we imported over sexy Angel from our brother site, ExtraBigDicks.com, to do the honors--- and what an honorable job he did!Within 30 seconds, everyone was shirtless, Taz was opening his zipper and Angel was reaching over to get a preview of the Tinman's growing bulge. As generous as before, Taz gives Angel a good grope as Angel gets a handful of the straight meat on the guys flanking him. Taz and TinMan are naked first, with Angel slowly licking Taz's very hard meat as TinMan pulls off Angel's shorts. Making sure he does not miss any of the fun, TinMan moves to the middle to lick Taz's balls. Even though we invited Angel to play the ?center square,? it proves to be a perfect fit for the TinMan who takes that spot, swallowing Taz's meat like an expert as Angel sucks the TinMan down to his pubes. This daisy chain moves upright with Taz standing in the center, feeding his cock to the TinMan while Angel explores the uncharted territory of Taz's hole with his tongue. The look on Taz's face and the moans from those lips let us know immediately that this is the first time he had been rimmed--- it sure will not be his last. His cock is harder than we have ever seen it before and we know it won't be long before that throbbing meat does a little anal exploring of its own.With the hungry, wide-eyes of a frisky puppy in a dog food factory, Angel greedily sucks both guys at once before lying on his back and offering his pouty lips as drums to be beaten at the same time by the very stiff sticks of the boys in the band. Taz moves to squat over Angel's face as TinMan gets behind and start giving Angel the fucking he has been dying for. Before long, Taz takes the position of being the fucker as the TinMan watches the show while working a vibrator into his own hole. Taz takes his time making love to Angel with some slow deep strokes as TinMan, craving some attention, decides to sit Taz down and go for a ride, with Angel playing tour guide. This is a first in CJB history: Triple penetration. TinMan fucking Angel as he is getting fucked by Taz! Soon after, both hotties give Angel a massive facial, and Angel soon unleashes a huge load of his own. Talk about starting off 2007 with a bang!!!",
  "models": [
    {
      "name": "Tin Man",
      "person_id": 28200
    },
    {
      "name": "Taz",
      "person_id": 29525
    },
    {
      "name": "Angel 1",
      "person_id": 1
    }
  ],
  "release_date": "2006-12-29",
  "scene_id": 55435,
  "series": "Hide & Seek Times 3",
  "tags": [],
  "title": "Hide & Seek Times 3, Scene #02"
}