{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Who didn't fear the locker room for the sake of not getting a hard-on around the other guys? We all did! But with a guy like Anton, blessed like a walking statute of masculine perfection with the face of a movie star and a body of a physique champion, the temptation far outweighs the risks. Just to get a chance to see him naked and discover once and for all what makes those tight football shorts bulge so incredibly, it would be worth a black eye for 15 seconds of joy that would last a lifetime. Today is where the fantasy becomes reality and that reality is more then you ever dreamed it could be. We do not just get to catch a peek of Anton naked in the shower; we catch him right after football practice, when the endorphins have headed right to his crotch. He does not just get naked. Anton gives that massive Italian boner the attention it deserves as he strips off the jock strap in favor of a jock stroke. The result is a dance in the end zone that will make you a life-long sports fan...or at least, a bona fide athletic supporter!  Stripping down to his football shoulder pads and shorts, Anton reaches down inside to rearrange that growing meat, then bares his chest to work his pumped pecs before reaching down the center of one of the most etched, leanest midsections ever on a man made of flesh and not carved of stone. The definition of the deep cuts on his traps, delts and biceps are like valleys between solid planes of muscle as he strips down to a straining white jock strap. And, as he lifts those equally solid and defined legs to toss the strap aside, we are treated to our first glimpse of a pair of glutes that wet dreams are made of. As he lowers his legs and lets his fingers graze through the jet black bush, that cock engorges with blood over heavy hanging balls, reminding us the best half time show is that goal post rising in the center and this is one time you are praying the game will go into overtime. Anton locks eyes, flashes us that brilliant white smile, then gets back to the action, working his cock with one steady hand, allowing us in close enough to appreciate each meaningful caress of that throbbing shaft. Towering over ass, he lets that cock flap from side to side, then taking a move from the playbook of our fantasies, turns around and bends over far enough to shows off those glorious glutes and that now dripping cock in a vista of manhood that will forever be burned into our memory banks! Laying back down, he stokes that fist deep, hard and fast, like the clock is ticking on the last seconds of the game, and before the whistle can blow, his balls do, spreading a thick white load all over his torso in a Super Bowl half time show that will never make prime time!",
  "models": [
    {
      "name": "Anton",
      "person_id": 28237
    }
  ],
  "release_date": "2006-11-03",
  "scene_id": 55446,
  "series": "Locker Room Releasing",
  "tags": [],
  "title": "Locker Room Releasing, Scene #01"
}