{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "His tight, lean body, sexy ink, smoldering eyes and that ?oh yeah, I am a bad boy? attitude made Taz the object of many fantasies right from the start. Of course, that steady stream of dirty talk that flows so effortlessly off that silver tongue and his ability to not just appear on camera, but literally make love to it, increase his appeal right through the roof. Wanting some extra cash for the holidays, we figured this would be a good time to see if his limitations were as rigid as his cock, and used a big pile of cash and one lucky fan named Sean. Sean literally emailed us everyday for almost three months to be the lucky vessel to break in a breeder for his first time at the ?All-Man Rodeo.? Timing is everything after all, so we called them both in and, as you will see, while Taz's bone was as rigid as ever, the same can no longer be said for his boundaries. From the very moment the cameras started rolling, it was clear that while he was doing this for the money, he was going to do it with no shame in his game. Sean immediately gets down to business, removing Taz's clothes. Within thirty seconds, Taz is standing up, feeding that rock hard cock to Sean who gives it the licking of Taz's life. Sean nibbles his way over Taz's lean abs, across those smooth nips and up to Taz's neck. Without so much as a heart beat of hesitation, Taz grabs the back of Sean's head and feeds his tongue down Sean's throat in a move that left us almost as stunned as what he does next. Not only did he notice the bulge in Sean's tighty-whitey's, and not only did he help Sean out of them, he grabbed Sean's 7.5? thick pole and did not just give it a good feel, he kept stroking it while going in for another round of kisses before moving Sean back down to his knees. Sean worships that meat with adulation and reverence, licking every inch before moving to Taz's balls and finally back to that throbbing meat. When he could finally get his eyes back into the center of their sockets and look down, Taz's gaze was riveted to the creamy white, round, tight vision of Sean's ass as the next event in this rodeo.After a liberal shellacking of lube, Sean climbs on top for the ride he was been craving from the minute he walked in the door. Taz's cock is thicker and longer than we have ever seen it before and Sean's ass soon makes that pole disappear as he lowers his hole on it until his cheeks land on Taz's thighs and he begins his gallop. Keeping Taz's cock firmly in place, Sean spins around and rides him from the front and, without any direction from us, Taz reaches around and strokes Sean's leaking cock as if it was the most natural thing in the world. Maybe too natural for a guy like Taz who quickly moves Sean for rear entry doggie-style, then flipping him on his back and fucking him like a chick as Sean clearly clucks in delight with some of the most intense moans of ecstasy we have ever heard. Sean busts a huge load all over his abs, and within seconds, Taz adds a huge blast of his own. As we say on our CJB shirts, ?100% Straight, but we're working on it,? we now add ?Mission Accomplished!? Happy Thanksgiving, Guys!",
  "models": [
    {
      "name": "Sean",
      "person_id": 27941
    },
    {
      "name": "Taz",
      "person_id": 29525
    }
  ],
  "release_date": "2006-11-24",
  "scene_id": 55441,
  "tags": [],
  "title": "The Tazmanian Spin, Scene #02"
}