{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Mauricio & Vinnie, Aiden & Sebastian, and Dirty Harry and the TinMan are some of the CircleJerkBoys.com favorites, and they have come a long way from their first nervous solos to the full-on sexual odysseys they have allowed us to document as they lived them. Today we go back to our roots with two guys so straight it took a lot of coaxing to even get them in the studio together. They are both hot-bodied, big-dicked perpetually-horny Latino studs. Mario and Kris, who aside from sharing a mutual interest in skirt chasing, are both amateur boxers. How ironic we banked on such a macho thing to get them to agree to go a round in our ring where the gloves were coming off along with their shorts. Enticed by a pile of cash, a few shots of tequila and some nasty new porn, the macho posturing began right from the start and it just kept getting better from there. This is the real deal guys; two bona-fide breeders stripping, stroking and shooting together for the very first time.Mario is one handsome man with deep brown eyes, a chiseled jaw and a gentle nature which he seems to think is better kept hidden, but he does let it free in small doses when he feels comfortable. That makes his hard, defined body, the sexy tats and that extra thick and meaty seven inches of dick all the more impossible to resist. He can also deliver a line of dirty talk that reaches right into your balls until your own cock is begging for more. Kris's body is a bit beefier, his eyes just a bit more brooding, his sexual energy a bit more overt.  But when it comes to a hot, hard piece of meat that is just begging to be tasted, Kris is clearly packing all of the elements to go ten rounds with Mario, and just the balls to do it and do it right.It starts out like backstage at the fights with both Kris and Mario stripping down and flexing hard. These guys both have carefully-honed, well-worked bodies and we are as glad to appreciate them as they are to show them off. There begins an easy patter between the two; the early protest have given way to just the right kind of chemistry to cause those bulges on both guys to swell at the same time. Although he's the shyer of the two, Mario kicks his shorts off first and Kris soon follows. Did Mario's leg inch over until it was touching Kris's thigh? When they were standing face to face and swinging their cocks from side-to-side, were they relieved their swords never crossed...or secretly disappointed? Was their anything more to that slap on the ass then a sportsman-like, harmless gesture? We really do not know for sure, but they soon cover themselves with equally impressive, thick servings of vanilla-- and the proof, as they say, is in their pudding!",
  "models": [
    {
      "name": "Mario Triullo",
      "person_id": 28294
    },
    {
      "name": "Kris",
      "person_id": 29631
    }
  ],
  "release_date": "2006-11-10",
  "scene_id": 55445,
  "tags": [],
  "title": "Double Devil Delight, Scene #02"
}