{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Grab the Kleenex, guys and do not say we did not warn you that a star is born here at CircleJerkBoys.com and his name is Deklan. This 6'2', square jawed, hot bodied and big dicked heart throb has a face that belongs on a soap opera and we were tempted to call this episode the 'Gays of Our Loves' but there is nothing light in the loafers about this hunk of man; this is the real deal. As straight as they come, but you know us, we are working hardddddddd on this one, but as long as he works that fat eight inch pole of his and lets us watch, we can learn to deal. Just when you thought he was too good to be true, there is one thing that makes our super man just as real as we are: despite all of his charms, and they are considerable, he was as nervous as the new guy on his first day of school, though did he ever figure out how to get to the head of the class and fast!Looking like a marble statue of an ancient Roman while deeply tanned like a modern playboy, Deklan fidgets in his seat: we bet a man like this is not nervous and frankly, seeing a guy like this squirming was all the more endearing. He opens his shirt, unzips his pants and his dick spills out in a flash of stretched white cotton: his nerves did not get in the way of 'Operation Boner' as he is at full mast with what looks like two handfuls of joy desperately seeking attention. Gaining confidence by the second, he stares deeply into the camera, giving a face that almost locks your eyes from looking down and seeing that massive cock stretching the fabric to its breaking point. When he turns to the side, the profile, with the ridged outline of his leaking head about to pierce those boxers, is enough to make you want to get on your knees and rip them down with your teeth, but fortunately, after one last game of peek-a-boo, he takes all eight inches out to play and the real games begin.   With the camera directly at crotch level, he double fists that cock between those nutcracker strong thighs, offering the perfect viewing of that flat stomach, dark line of lubes and a cock as near to perfection as we have seen in a long time: fat, long and looking like it needs a tight wet home and quick with heavy hanging smooth balls to match. We get a quick peek at those sculpted glutes before he sits down and that pole rises up high all on its own, like a tree trunk on a mountainside. At this point, it was a dead even heat who could hold back any longer, Deklan or us but thankfully, with his legs spread, his sack tight and his sweaty abs heaving, he pumps out a load high in the air that falls down in heavy white splats all the way up to those deeply tanned pecs, then marks a shiny trail back down to ground zero. A 'Star in Porn' here at CircleJerkBoys.com and stay tuned: we can not wait to get him back.",
  "models": [
    {
      "name": "Deklan Connors",
      "person_id": 28224
    }
  ],
  "release_date": "2006-10-27",
  "scene_id": 55448,
  "series": "Massive Meat",
  "tags": [],
  "title": "Massive Meat"
}