{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The only thing thicker than Rex's Bostonian accent was that eight-inch slab of meat that made him a CircleJerkBoys.com favorite right from the start, and he has a come a long for a guy whose favorite saying is ?Girls, Girls, Girls.? We were shocked when he let Antonio eat that untouched ass. We were impressed when he matched up with Damien to double dip Ryan. And we were thankful he stroked right along with Anthony, Sebastian and Aiden during the infamous ?Four-Handed Jizz Jack-Strava-Ganza.? But boys will be boys, and what they have done does not change who they are. As typical as it sounds, Rex got a shiny new Porsche and wanted to show it off. We knew he would be all cocky, and after all, that's the way we like 'em around here. So we invited him over, gathered the car wax & the camera, and just happened to have his favorite porn starlet's new DVD playing as he arrived. We did something we have never done before. We gathered some of your emails to Rex and let him respond to them during his biography video. So if you've ever wondered what can persuade a straight guy to fuck another dude, here is your chance to get it right from the horse's mouth. Right from the start, we can tell Rex has been hitting the gym and his always great body has never looked better. After his new ride is squeaky clean, our dirty-minded Rex checked out the video and then stripped down under the outdoor shower. As he rinses off, we get a view of that perfect backside of his. Like the rest of him, Rex's ass is harder and more muscled and nearing the perfection stage of what the ideal man's butt should be like---but rarely is. He stops in a chair on the deck, and within three strokes that legendary meat is throbbing in his fist; all eight inches at full attention and ready for more.Jumping into the pool, doing a couple of laps, and sneaking in a dick dance right over the lens, Rex climbs on the raft and gives us one more teasing glance as those wet buns drift by before he rolls over and that bloated meat sticks straight out, ready for some serious stroking. Rex heads to the lounge chair, oils up, and gets down to business. Giving that serious meat a double-handed grip, he furiously fucks his fist until he sends a white arc high in the air that comes crashing down all over his arms and abs as he stares right into the camera in a one-of-a-kind cum shot that only Rex could pull off!",
  "models": [
    {
      "name": "Rex",
      "person_id": 28167
    }
  ],
  "release_date": "2006-11-17",
  "scene_id": 55442,
  "tags": [],
  "title": "Ride It Like A Ford, Scene #01"
}