{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Between that accent, that bright smile between those cute dimples, those dark eyes, that brown skin, that killer, slim bod etched in lean muscle, and oh yes, that fat, curved, uncut slab of Brazilian dick steak, JJ become an instant favorite and joined the CircleJerkBoys.com all star team of incredible guys with not just the look, not just the charisma, not just the body and not just cock, but one of those rare birds that has it all and all of the horniness to put it all on display with a smile that never leaves their faces...or ours for that matter! With the neighbors away, we got JJ out back to the pool, and the warm Florida sun must have reminded him of being back home on the nude beaches in Rio, as he could not wait to strip off his shirt, shuck off his pants and let that big meat flop back and forth in the breeze, making a bee line to the camera to make sure you get a good look. That tight body, the beautiful white ass and that heavy meat in the open sun is such a sexy sight. JJ's cock could have been used for a thermometer as, like the temperature outside, it was rising like the second.The view of his heavy hanging soft meat was just an appetizer though the sight of that tight white ass as he flexes his glutes tight could be a main course even a life long vegan would want to devour. As he shimmies into a pair of tight blue Speedos, JJ starts oiling himself up while he stares into the camera with puppy dog eyes. He pours the water down to cool his brown skin but nothing could keep that meat from exploding beyond the confines of his bathing suit until he has to haul it out, hold it off and show it off like the prize zucchini at the fair. Shoving it back inside, making for a bulge so obscene, you want to drop to knees and rip it off with your teeth; he hops in the pool and quickly tosses his suit away for good. After taking a few laps, JJ climbs onto the raft. The water gently pushes him across the pool as all eyes focus on his beautiful ass reflected in blue water, his cock and balls bunched up between his legs in a postcard of what a perfect male rearview is all about. JJ works his way back to the beach chair, the camera locked on those apple cheeks until that swollen meat takes center stage and, stroking with passion, JJ lets his nut land right on his stomach. Feeling like he needs to be rinsed clean, JJ showers off, for what you think would be the end of the video but no; seems our Brazilian sperm bank can not fight the urge to make a second deposit and who were we to stand in his way!",
  "models": [
    {
      "name": "JJ",
      "person_id": 28238
    }
  ],
  "release_date": "2006-10-20",
  "scene_id": 55451,
  "series": "Sir Swim-A-Lot",
  "tags": [],
  "title": "Sir Swim-A-Lot"
}