{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Seeing Miguel's sable brown hair swing as he got his nut a few weeks ago was like seeing the mane of a wild pony caught in the breeze as he galloped down a mountain. As hot as Miguel looked when we first met him with that hair braided up, seeing that crowning glory hanging free was even hotter. Or maybe it was the way his tight body is covered by a light dusting of brown hair across his chest, onto his abs, into his thick pubes and down to his strong legs that is so irresistible. Or could it be that seven inch cock that never seems to go soft? Or the way he looks at the camera, almost daring you to join him? Perhaps it's that rough on the edges bad boy thing that hooked us or not knowing if those home made tats were inked during some time in jail that reels us in? Whatever it is, he has something that sets him apart and we wanted more. Eli is a 24 year old with an ass that even a straight man would want to tap and we decided to test that theory on Miguel with results that prove a hole may be a hole, but even for a straight guy, a hot ass is a fuck!When Eli first reached over to explore Miguel's crotch, Miguel looked like he was not sure whether this was really happening but at the same time, his cock responded instantly and seemed to take him along with for the ride. Eli could not wait to get his hands on that cock, but teased until his knees almost gave out. Standing face to face, Miguel reaches tentatively over to Eli, actually pausing in mid air for a moment before he made first contact with the male flesh. The charge must have been electric as rather than pull his hand away, he gave us one of those moments so unexpected, we still have to watch the tape to believe it, as he leaned down and planted a rock solid kiss on Eli complete with that dirty talking tongue. Gently feeding Eli his cock, which has swollen longer and thicker than we had ever seen it before, Miguel adapted quickly and served Eli his cock like a prized vintage from his own private cellar.Eli's cock was rock hard just in anticipation of where that cock was going next and it seemed in the blink of an eye, the condom was gone, Eli was bent over the head board, and Miguel was pounding Eli's ass like a freight train, slapping those cheeks as he gave that ass the riding it was begging for: steady, hard and deep. Miguel moved him to all fours on the bed and picked up right where he left off, offering us the picture of that long hair dancing on his back, that ink shiny with sweat and Eli's face contorted in the expression of sheer bliss from the sensations he was receiving on the opposite end. Eli took the lead for a quick second, riding Miguel's cock and Miguel even reached around and gave Eli's thick meat a stroke or two before tossing him on his back, hoisting Eli's legs on his shoulders, and ramming away for the final assault. Rolling back on the bed and breathing like athletes who just completed a marathon, Miguel rubbed Eli's leg as Eli fired off a load that blasted all the way to his shoulders and Miguel soon followed. Our next mission is to try and get the tables turned and let Miguel find out of it is as good to receive as it is to give. Stay tuned!",
  "models": [
    {
      "name": "Eli",
      "person_id": 27817
    },
    {
      "name": "Miguel",
      "person_id": 27783
    }
  ],
  "release_date": "2006-10-13",
  "scene_id": 55452,
  "series": "Pop In & Press Play...",
  "tags": [],
  "title": "Pop In & Press Play..."
}