{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "On one hand, the idea is almost counterintuitive, but in reality, it is amazing how a thick head of long, flowing healthy hair can make a guy mysterious, compelling and not usurp his masculinity, but add to it. The coal black locks of Eduardo are a prime example, as was the shoulder length carrot top of big dicked Red and who can forget the essay of perfection that is Henrique. Miguel was a recent entry to the 'CircleJerkBoys.com Hair Club for Straight Men' and with his home made tats and braids that went well to his lower back, Miguel brought a gritty, bad boy just out of 90 days in jail vibe, and a raw sexiness that had you clamoring for more. Well more is what we have for you today and this time, Miguel sure let his hair down...literally.Out of the confines of his braids, his thick sable brown hair is a luxurious mane that frames that light skin and sets off those crystal blue eyes to perfection. He said a lot of people love it when he wears his hair loose and he wore what he called his ?preppy look? just for the occasion. That didn't stay on long as the only thing Miguel likes better than getting dressed up is how fast that means he will be getting naked - and today was no exception. Miguel is a guy who knows just what we want to see and makes seeing it an erotic odyssey. When he lays back on the bed and you follow the trail of hair from his head, down to his shoulders, across his tats and down his stomach to the bulge in his white boxer briefs, legs spread wide and slightest sheen of sweat covering those tats, this is just the start of the epic journey you will never want to end.The soft brown fuzz covers his calves and rubs down his tight abs that fade out over a pair of round nuts that are already hiking their way up. He almost looks like those depictions of horny ancient warriors on ancient pottery come to life. He stands up. Spread wide on the headboard, he sways his dick back and forth like a pendulum before turning around to show off something he kept hidden last time, his tight little white ass. Sitting in the chair, down on the floor, back on the bed, Miguel works his pole from every angle possible, determined to put on the best show we have ever seen and at least, we have never seen anyone with as much blood in their face as they do in their cock as both his heads were bright red. He kept a firm grip on his balls as if he was jacking so hard, they might fly out of the skin. With a final moan, he oozes out his load onto a body so sweaty, the cum almost immediately slid right off his slick skin. Will he be such a showman if there was another guy naked and boned with him? There is only one way to find out so stay tuned, guys!",
  "models": [
    {
      "name": "Miguel",
      "person_id": 27783
    }
  ],
  "release_date": "2006-09-29",
  "scene_id": 55456,
  "tags": [],
  "title": "Let It Hang, Scene #01"
}