{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Every so often, when the moon is in the 7th house and Jupiter aligns just right with Neptune, a guy appears at the door who is so perfect, it seems he must not be from this planet. Stefano is one of those guys: a tight bodied, big dicked, idol face serving of straight stud who wanted to follow up his just completed tour of duty by giving us a tour of his booty. And as incredible as that just out of uniform ass is, that 7.5' branch of service in the front is nothing short of stellar. His thick, heavy hanging meat under a dark trimmed bush on an ultra lean body is edible from every angle, from every inch. This 20 year old told us he was half Sicilian, part English and just enough Greek thrown in to make him one exotic looking hottie with a dazzling smile and killer dimples. He was down to his wife beater before we had the camera loaded and the dark ink on both of his biceps told us better than his words that despite a touch of shyness at first, there was a dirty man inside and we spared no time in letting Stefano express his inner porn star. Staring deeply into the camera with seductively brown bedroom eyes that could make you cream without a touch, Stefano just stands there for a moment, letting us admire with the lens his tight, flat hairless abs, the ridges of his obliques, and his cute little navel as he disposes of his belt like the rip cord of a parachute. Letting the waist band slide down below those dark and curlies, he begins to stroke while still in his boxers, rubbing his nipples with one hand, working that meat with the other, and his eyes making love to you the entire time. He pulls that tube of flesh out of the leg of his shorts and with a few strokes, the grow-er becomes a show-er and one with an awful lot to show for himself at that: not just long and not just with a perfectly shaped head, but so impossibly thick, it almost looked out of place between those narrow fuck-machine hips of his. Moving his hands under his balls to massage a spot that he loves showing attention to, he bends over far enough for us to get the complete view of his ass, his balls, and right down to the tip of that now throbbing cock. At one point, he actually spread wide and let his fingertip go walking right across those ass lips in a move that still takes our breath away. That seemed to be his ignition button as well as soon after, he fires a heavy load into orbit and while still jacking that drooling meat, he winks at the camera as if to say he had as much fun as we did.",
  "models": [
    {
      "name": "Stefano Ricci",
      "person_id": 28225
    }
  ],
  "release_date": "2006-09-22",
  "scene_id": 55459,
  "series": "JarHead",
  "tags": [],
  "title": "JarHead"
}