{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Having just turned 18 two months ago, Tibo left Tennessee like a bat out of hell and came to test his skills as a D.J. here on the South Beach club scene. Since we did not have a turn table here at the studio, we had him spin something else. What shook loose from this fresh from the farm cutie were his inner porn star and a massive load, both of which had obviously been pent up for way too long. Naturally blonde and pale, the Miami rays turned his skin fiery red but the real fire he could not wait to put out was the one in his pants.Soon as he starts to unbutton his shirt, however, all thoughts of a guy who just ran away vanish and are replaced by a confident man who exposes that fine smooth chest like a total player fingers the chassis of his newly delivered Ferrari. He works that belt out inch by inch before tossing it aside like a mere obstruction of what he knows you want you see. As he quickly dips down the waistband of his now exposed shorts just quickly enough to get a quick look at that dark blonde bush, he reminds you he is firmly in charge of this display. If that bugle, visible from across the room even in his dark boxers is any clue, what Tibo has to show off is definitely man sized and ready to party!All good things come to those who wait and soon those shorts are history, revealing that now throbbing uncut cock long enough for the head to hit his flat abs well above his navel with its foreskin intact. His cock is just like the man himself: slender, aerodynamic and with its spear shape at the top, designed for easy entry into whatever hole he chooses. With a heavy hanging sack that would be more at home on a man twice his size, the vista of those bull balls with his twitching cock dancing by itself on top is one to be committed to memory forever as was the site of that totally untouched ass as he grinds on the pillow. But when Tibo bent over and spread his cheeks, offering the first ever glimpse of his hole on camera or off, we could not hold back much longer, and fortunately, neither could he. The first blast landed on the pillow up over his head with the others hanging in heavy globs of both hands. His red face now an even deeper shade of crimson, the heaviness of the load left him, and us, breathless!",
  "models": [
    {
      "name": "Tibo",
      "person_id": 28240
    }
  ],
  "release_date": "2006-10-06",
  "scene_id": 55455,
  "tags": [],
  "title": "DJ Push Pull, Scene #02"
}