{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Antonio was a sensation from the minute we put his pictures up about a year or so ago. He has naturalness in front of the camera that is so seldom seen, especially when this bundles with a face this handsome, a body this ripped, an 8? uncut bonanza of a cock that never goes down, and a sexuality that leaps from every pore. The TinMan is another guy we have known for a while. His square jaw, ?fuck me? eyes and I will try anything once attitude lead him to mess around with a 3 way jerk with his buddies, then tasting the dick of Dirty Harry. About the same time, Antonio got his pipes cleaned by CJB's resident stud Anthony in one of the dirtiest encounters we have ever filmed. The one thing we have not witnessed yet is Antonio serving up that big club of a cock rather than just being on the receiving end and today is the day that changes. Antonio has that Latin heat you would expect from a college jock on a soccer scholarship and Tinman, who has just gotten hornier and hornier as status changed from expectant father to new dad was up for anything. First with a soft tender kiss; slowly massaging each others' tongue and then pulling gently on each others' lips. For a couple of pussy loving straight guys, these two have come a long way and by the end of this, will have gone even farther!Tinman takes his time licking Antonio from face down to nipples down to abs down to inhaling Antonio's cock in his mouth. The words of ?suck that dick!? are spoken from Antonio's mouth commanding him to do his job. However Antonio is no newbie any longer. Stripping off Tinman's clothes, they transition to the bed to continue the show! Antonio climbs on top of Tinman, kissing him, rubbing their cocks together and then a quick swing around to get into a 69 position. They are both as rock hard as we have ever seen them and Tinman dresses Antonio's eight incher up in latex, he says ?Oh Boy? with an appropriate amount of reverence mixed with fear: he knows how big that meat is, he knows where it is going and with the glove on, he knows just what the rather inexperienced back side of his is about to filled with.Tinman's ass is perched and waiting to be fed and for the first time ever, we see Antonio's big meat inch by inch disappear with a slow steady push. Tinman's face turned crimson red as he bit his lip and tired to keep a stiff upper lip and take it like a man, from a man. As Antonio does push ups over him, his slow steady motions allow us the perfect view of that big thick piece of man meat doing a disappearing act inside his buddy's hole. Liking how it feels, Tinman takes the lead getting on top for a ride. By the expression alone on Antonio's face, you can tell he is enjoying the heat coming from his hole! A new yoga position is created as the guys work their way over to a standing doggie position, where we get to see Tinman pump his ass against Missionary in the final position claimed by these guys. Antonio continues to pound Tinman's ass dick to dick, then they fire loads all over each other as one good blast sure deserves another!",
  "models": [
    {
      "name": "Tin Man",
      "person_id": 28200
    },
    {
      "name": "Antonio",
      "person_id": 29262
    }
  ],
  "release_date": "2006-09-15",
  "scene_id": 55460,
  "series": "Cumming Out On Top",
  "tags": [],
  "title": "Cumming Out On Top, Scene #01"
}