{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Close cropped hair, hard bodied, caramel skinned, blinged and inked, Kris is just the kind of 23 year old exotic Latin mix that Miami is famous for. There is an effortless sexiness to Kris; there is a powerful seductive quality of a man so comfortable in his own skin he is supremely confident without an ounce of conceit. Though clearly not unaware of his appeal, he owns it with the quiet restraint of a man who has it going and has nothing he feels he has to prove. Slowly and deliberately, he rids himself of his clothes to display his shaved smooth, deeply tanned chest and flat stomach. Kris then slides one leg up, one leg down and peels apart his jeans as if he is offering us a private invitation to come just a little closer to where no man has gone before.The ridges in his abs are sharply defined as he kicks off his jeans and runs a fingertip up and down the length of the swelling bulge in his boxer briefs, almost as if he's accepting our dare to wake the sleeping giant within. The gaze from those deep brown eyes is almost hypnotic and as he brings a finger to his mouth then down to his nipple, we can see his lips are full, deep, soft and incredibly kissable; not what you ordinarily associate with the mouth of a straight guy at all. When he rolls over and starts humping the bed, offering us a glimpse of that fine athletic ass flexing, clearly he's back in his element. When he rolls over and that cock sticks straight up in the air, he presents the element we are more than ready to get more acquainted with and once again, Kris does anything but disappoint.Working his nips once again, he stands and the camera pans up, seeing that now throbbing cock dance on its own between those deeply etched angel wings formed by the outline of his oblique's. Squatting on the ground, his balls sway between his thighs with a strand of precum stretching out from the head of his cock to his fingertip as if he has his thumbs on a gun ready to fire. Standing up on the couch, his sack not tight and cock fully engorged, he lays down again, spreads his legs wide and with a nipple in one hand and that throbbing meat in the other, he lets out a blast that comes in for landing up between his pecs and trails back down to that dark bush, leaving thick white footsteps all along the way.",
  "models": [
    {
      "name": "Kris",
      "person_id": 29631
    }
  ],
  "release_date": "2006-08-25",
  "scene_id": 55467,
  "series": "Karamel Heat",
  "tags": [],
  "title": "Karamel Heat, Scene #02"
}