{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The skies are usually not ablaze on Labor Day, but anytime Mauricio and Vinnie share their unbridled passion and sheer lust here at CircleJerkBoys.com, the exploding chemistry in every kiss, every touch and every over the shoulder load rival any firework display seen anywhere. Vinnie is now a ripped, lean and chiseled fuck machine. While he did surrender the center of those legendary glutes up to Mauricio's epic 8 ?? uncut prized pole for a one time only diversion of the norm last time, today they are back in the roles they love to perform and we love to see: Vinnie giving Mauricio the passionate, condom free pounding that only a lover can. We have followed them for almost 3 years now and the journey from just out of high school and freshly sprung from the army neighborhood buddies who played basketball together to the now living together, monogamous couple who share the most intimate details of their lives reaches a new chapter for them and us when they usher themselves and us into another first for us all: the great outdoors.It is not unusual for the lovers to begin with a tender kiss but seeing them bathed in rays of the sun shed a freshness as if we are discovering them for the first time. With both of their tongues licking each other neck to their ears as they undress themselves and each other, it seems an effort for Mauricio to let Vinnie's tongue out of his mouth, but one handful of that throbbing meat of Vinnie's, Mauricio soon found something he liked in his mouth even better and proceeds to swallow his lover's pole right down to the base. Vinnie returns the favor, making his way down to Mauricio's hole before they move to the pool. Vinnie's cock is throbbing now, as hard as we have ever seen it as he moves to the edge, spreads wide, and the oral fest resumes and then quickly progresses into a 69 taking place on the raft. Pivoting once again as if they could not go any longer without kissing, Vinnie's finger is soon replaced in Mauricio's ass by his cock. We have seen them fuck in just about every position before, but seeing Mauricio's ass inhaling Vinnie's pole as he rides Vinnie as they float around the pool is as much a new experience for them as it is for us.Nothing gets that huge cock of Mauricio's as hard as a good pounding from Vinnie and they are both throbbing as they walk out of the pool and over to the massage table. Vinnie swallows that pole down to Mauricio's balls before flipping him over and making a feast of that once again quivering hole as Mauricio lays his head down and moans in nothing short of sheer bliss. Standing up, the muscles in Vinnie's strong arms rippling as he mounts Mauricio again, pounding their way up on the table until their lust eclipses like wild animals in heat. Then, side by side as they started, they are kissing again as their sacks tighten. First Vinnie covers his abs in a thick white load and like the cum geyser we know him to be, Mauricio soon follows with an explosion that covers his chest and beyond to even Vinnie's arm. For them, this was a labor of love and from Mauricio, Vinnie and all of us at CircleJerkBoys.com, a Happy Labor Day to All of you!",
  "models": [
    {
      "name": "Mauricio",
      "person_id": 28130
    },
    {
      "name": "Vinnie",
      "person_id": 28131
    }
  ],
  "release_date": "2006-09-01",
  "scene_id": 55465,
  "tags": [],
  "title": "Something Deep This Way Goes..., Scene #02"
}