{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It was a little over a year ago when we first met Mario, a sexy amateur boxer with a couple of tats, a sexy smooth body and a thick delicious slab of cock. Mario is that rare kind of Latin heart breaker that is effortlessly macho and is blessed with the ability to deliver some of the nastiest dirty talk we have ever heard as if it is the most casual of conversations. That is one thing that remains unchanged over the last year and while the face is just as handsome and that cock just as big and thick and hungry, the body in between has been transformed into a pumped, ripped canvas of what perfect muscularity is all about: perfectly balanced, incredibly lean and built to prominence without being over developed. He opens his shirt, showing off the deep ridges of his abs, as his hands continue and grab that already swollen cock in his pants in testimony to the fact that our Man Mario is far from just all talk, but ready for action.Our Latin Casanova stares directly into the camera with those deep brown bedroom eyes, reaching inside his shorts and rubbing that spot right under his balls, commenting on how good his own touch is making him feel. Bending over, he steps out of his shorts and lies back on the couch, his cock beginning to swell under that sexy dark bush. His balls are dark and hairless and hang low between those meaty thighs. A few hand over hand purposeful caresses and Mario is rock hard, slapping his meat against his stomach. With deep, lusty moans, he rubs his pecs and nips while keeping a tight stroke on his dick. ?Pump it...ya got to pump it hard!? This is one man who knows how to coax every ounce of pleasure out of his cock and as he spreads his legs wide and rubs once again under his balls, we can not help but wonder if he does not have some untapped pleasure zones on the flip side as well. Lying on his stomach, lifting up as if he was fucking a girl, his ass is a sight to behold. Mario even reaches back and slaps his own ass cheeks, and ever so quickly spreads them open, letting his finger tip quickly graze across the opening as if he was not sure we would notice or more likely, most deliberately, knowing how much it would turn us on to see a straight guy flirting with the sensation of his own hole. He stares directly into the camera, flashing his tongue, then begins to pound furiously away at his cock, until the head is blood red, his balls are bloated and with his legs visibly trembling, he explodes a load all over that heaving stomach.",
  "models": [
    {
      "name": "Mario Triullo",
      "person_id": 28294
    }
  ],
  "release_date": "2006-09-08",
  "scene_id": 55462,
  "tags": [],
  "title": "Varsity Blues, Scene #01"
}