{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Was it just because he had such a sculpted face? Or perhaps it's those abs you could use for a washboard and clean your towels with? Or could it have been that set of buns that was almost too perfect for words? Or just maybe it was the fact that not only is he 25 years-old and married that caused Dizzy to have a rapport that seemed to reach right through the camera and cause so many to open their pants and rub off a load watching him? Perhaps the biggest reason was the confidence he showed, as in his own words, ?I want to live out my wild side and that journey starts right here on CircleJerkBoys.? It must have been as good for Dizzy as it was for us as not only did he agree to try a little experimenting with Mike Hawk, though there was definitely some first timer fumbling and awkwardness associated with two guys having their first male-male experience, once he got used to the sensations coming from that vibrator Mike worked into Dizzy's hole, he started raising up and riding that pocket rocket. There was definitely not a gun to his head, just a smile on his face.This time around, Isaac took the lead. And far from the first tentative smooch Dizzy tried with Mike before, this time he opened his mouth and eagerly ushered in Isaac's tongue with the real smoking gun of where this was going being the bulge in Dizzy's shorts which went from ?condo? to ?condominium? as soon as their lips met! Isaac takes notice and then takes a hold of Dizzy's throbbing meat and then begins the suck fest by taking Dizzy's meat to the balls and undressing him at the same time. Isaac lies on his back while Dizzy goes down for a taste until Isaac's hips begin to pump with anticipation until he stands and grabs Dizzy's head as he fucks his mouth as a prelude to what Dizzy can expect next!Both of their cocks are rock hard and throbbing now, the veins on the underside visibly bloated with what promises to be a hell of blast. Peppered with the long stares into the camera as if looking directly into you, neither Dizzy or Isaac make you feel like you are intruding, but seem to be inviting us along for the ride. Moving over to the night stand, Dizzy turns his attention to Isaac's ass, signaling that the riding is about to begin and no little starter toy this time; Dizzy is getting a man's cock up that hole and Isaac is only to glad to pop that cherry. Licking and eating it as if he knew exactly what he is doing, Isaac then throws Dizzy's legs behind his head and takes a lick and that is all the delay Dizzy could take. Now in control and ready for his first ride, Dizzy climbs onto Isaac's cock and, gritting his teeth and wincing a bit, he takes it all. Moving into doggie position, Dizzy moans begging for a good fuck and Isaac is more than happy to oblige! Dizzy must have had one tight hole as Isaac covers his own abs with one of the biggest loads we have ever seen. Dizzy shows Isaac his appreciation by giving Isaac a facial that covers him from forehead to chin.",
  "models": [
    {
      "name": "Dizzy",
      "person_id": 28193
    },
    {
      "name": "Isaac",
      "person_id": 28241
    }
  ],
  "release_date": "2006-08-18",
  "scene_id": 55468,
  "series": "Goin' For A Ride",
  "tags": [],
  "title": "Goin' For A Ride, Scene #01"
}