{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Galloping in from the ranches of Oregon and leaving the wife at home, 23 year old Chris looks every inch the corn fed cowboy he is, with a lean body from hard work, not pumping iron, and with strawberry blonde hair and the requisite farmer's tan. When we saw the ink peeking out of the sleeves of his t-shirt, it was just a small hint that there is more to Chris than a simple country bumpkin, but a wolf in sheep's clothing, not afraid to express his sexuality and share a freaky sexual resume. Chris is a man on a mission and could not wait to get out of his clothes. Any worries about him getting to the winner's circle too quickly disappear almost immediately as you will soon see; he cums across the finish line three times.One hand disappears into his black boxers, the other grabs the lube and instantly that ?Awww shucks? grin is replaced by the look of sexual Zen only achieved by a man who knows how to turn himself on with every touch. Grinding against the pillow before rolling over to hump it, he is the classic straight guy showing off what a hot fucker he is, oblivious to the fact that the view allows us the perfect lingering look at a round, white muscled ass that definitively has done some pumping. He works his way all the way up the bed until he is sitting on the headboard, letting that now hard dick move by itself as those tats dance on an arm that is as pumped up as his cock. Using that erection to play the slats on the back of the chair like a pick on guitar strings, he works that pole like a solo virtuoso; one handed, two handed, no hands, short tight strokes, long dramatic ones, until those nuts tighten into the shape of ripe peaches. Moving to the bed with an intensity fueled by need, he grabs his shaft with such force, the veins on his bicep become visible and soon his lower abs are dotted in spooge while a look of sheer satisfaction covers his face. Since one good turn deserves another, with his cock never going soft in between, Chris suggested we keep the cameras rolling as he produced load number two as the reason why. Less than 5 minutes later, he proved that three times is the charm as a third and final eruption completed the Triple Crown!",
  "models": [
    {
      "name": "Chris Burg",
      "person_id": 28243
    }
  ],
  "release_date": "2006-08-04",
  "scene_id": 55473,
  "tags": [],
  "title": "Triple Header, Scene #02"
}