{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Sporting a dark Mohawk with a few blonde streaks, a shiny eyebrow ring, a dirty smile, sneakers, black shorts and a snowy-white wifebeater that clings to a lean frame that you can tell is totally fat-free, even through the fabric, you have taz2, a 23 year old skater kid that looks like just the kind of trouble you want to get into. Despite his thin frame, his arms are well muscled and covered in sexy ink. He gives us a tour of his tats, the sexiness just dripping off his tongue as he talks, one hand reaching into his pants and playing with his favorite toy that he knows we want to see, but enjoying the tease of making us wait.The big buckle opens and we follow down those dark dots of his nipples and past that hairless stomach to a pair of tight black shorts. He goes deep fly fishing, occasionally offering a glimpse of that pink meat inside until he finally makes history of those briefs, stroking his meat under a sexy dark bush until all seven inches stand up over a visibly bloated ball sack. Fisting that meat with one hand, we see the cuts of his six pack dance, so well-defined, like a live motion anatomy chart. He stops midstroke, looks down at his cock, then back at the camera and tells us ?I want a tat on my dick of a hundred dollar bill cause I like to play with my money!? Only someone as sexy as Taz could take a cheesy line like that and make it seem to true; this is one guy who owns his sexuality and clearly delights in putting it on display.With a great view of that sexy ass as he humps the couch before sprawling out on the chair and fisting that now throbbing meat, he offers a living flesh version of every boarder who skated by that you ever wanted to see naked and hard. Standing up, his cock looks thick and heavy between those narrow hips as he jumps on the couch, bends over and strokes that meat while offering another look at that sexy ass, totally free of any tan line. Swinging that meat back and forth and then grabbing it tight, he looks like the ultimate go-go boy, but this time he's doing a very private show. Laying down on the touch, the curl in his toes and the tightening of his sack let us know he can hold back no longer. With a steady stream of dirty talk from his lips, a steady stream of cum oozes out of his cock at the same time. Wonder what happens if you bring a buddy for taz2 next time?",
  "models": [
    {
      "name": "Taz",
      "person_id": 29525
    }
  ],
  "release_date": "2006-08-11",
  "scene_id": 55470,
  "series": "The One And Only...",
  "tags": [],
  "title": "The One And Only..., Scene #01"
}