{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "More handsome, more ripped, just as hung as even hornier, all hail the Home Cumming King back to CircleJerkBoys.com, the one and only Antonio! Returning to our sheets after his first semester at college, we welcomed Antonio back like the conquering hero is he: anyone who had their ass pounded by the military man himself, Anthony, and lived to tell about, has earned the title and then some. The only thing that has decreased in length is his hair and his % of body fat has gone from slim to almost none - being up at the crack of dawn to work out with the varsity team would do that and this is one student's body all of the student body would be dying to get a piece of. The ass of this man simply takes your breath away and the 8.5? uncut salami would turn the most ardent vegan into a carnivore!Giving his glutes a spank like any guy this naughty guy deserves, he shimmies out of briefs, bends over and flashes us an insider tour of that tight hairy hole before rubbing those rock hard abs until that fat cock dances in anticipation. Standing up, he flexes those muscles, his triceps like hammers and his biceps like baseballs, as his cock flops and throbs without ever a touch from his fingers. Watching as those balls bounce up and down as he still fists his meat with a passion and force of a man lost in the pleasure of his body, it is almost too much to take when he spreads his legs wide and works his pole from behind, offering for that the most perfect view of a perfect man; we can see the sexual lust in his eyes, the width of his shoulders, the triumph of butt, the girth of that shaft and the length of his pole in single image that your mind will etch into your permanent archive of what a stud in his prime of his sexuality should look like.With the moans of a man on the edge, Antonio's deep breathing as speaks louder than words to let us know he is riding the crest of the sensations in a battle of self control and endurance. He actually stops and seems to massage the thick vein on the underside to force the cum back into his balls, before leaning back on his hands and with that cock jutting so far ahead of his body, he looks like the lunar module with its antennae up just before coming in a for a landing. The groans got louder, the stroking got faster and Antonio reached critical mass with such force, the first three jets of long pent sperm actually flew right over the head of the camera man. Will Antonio be back? You bet! And oh yes...he brought a friend too!",
  "models": [
    {
      "name": "Antonio",
      "person_id": 29262
    }
  ],
  "release_date": "2006-07-14",
  "scene_id": 55479,
  "tags": [],
  "title": "The Campus Cassanova, Scene #02"
}