{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "appy as we were to hear from Antonio again, the rest of you were just as glad and with every right to be: seeing our favorite varsity college stud return to ?our? campus, even leaner, just as horny and more muscled than before was more than worth the wait. From the size of that load, with the ropes of jizz packing the velocity that literally propelled the cum over the top of the cameras. Antonio displayed just how happy he was to be back in a way we are still cleaning off the far wall of the studio. Since one good ?home cumming? deserves another; another one of our favorites; too long absent from the cameras, was none other than Rex. Like his soon to be playmate, Rex was leaner and more muscled than the last time we saw him in ?Four Handed Jizz,? where he did not take part in much of the action and seemed to have missed out. Despite his signature chant of ?girls, girls, girls,? the bulge in his pants showed that 8? ultra fat club of a cock was ready to slip into something warm and Antonio's hot hole was a target he could not take his eye off of.Antonio wasted no time in getting Rex out of his clothes, praising every pumped body part as he uncovered it. Antonio begins sucking on Rex and despite the size of Rex's cock; he was hungry for even more. Moving Rex against the wall, getting on his knees in a position of worship, he began to spread those untouched perfect glutes of Rex's and swirl his tongue into the formerly ?no-man's? land of that tight hole. While that was the sight we never thought we would see... Rex yelling, ?eat that fucking ass!? were words we never expected to hear. Spreading Rex's legs a bit for even deeper licks, we get to see every nook and cranny of Rex's ass while his cock throbs so hard just from being eaten out. It was as if we were there, sharing in the exact moment he discovered his hole was not just decorative. Rex uses the resident CJB vibrator to open Antonio up. Despite the pounding he taken from Anthony before, a cock as fat as Rex's required all the available preparation leading to the moment Antonio climbs on for a ride on Rex's cock, spreading his cheeks to show us that while not on the football team, he's learned to be a wide receiver. Rex plays with his own balls while getting the ride of his life. Rex turns Antonio over into doggie style position and begins fucking him hard then turned and slid it in deep. Rex pulls out his dick and begins to double fist, pumping it until he shoots all over Antonio as Antonio finished up with his own 21 gun salute: the opening salvo landing on his cheek and the rest shooting up over his shoulder.",
  "models": [
    {
      "name": "Rex",
      "person_id": 28167
    },
    {
      "name": "Antonio",
      "person_id": 29262
    }
  ],
  "release_date": "2006-07-21",
  "scene_id": 55476,
  "tags": [],
  "title": "Time OUT!, Scene #01"
}