{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "While we are pretty sure the CircleJerkBoys.com studio is not part of the welcome packet from the Immigration office, JJ managed to find us within 90 days of arriving here from Brazil and we are only sorry it took him that long. This 23 year old hottie has a smile that lights up a room and one of those tight little bodies that you want to just pick up, bend over and have your way with. Dotted with just a few small tats and barely any hair save a few tufts under those toned arms and a surprisingly lush, sable brown bush, JJ is also packing just the extraordinary kind of 8? rock hard inches of uncut, curved Brazilian beef that gets your mouth watering and can put the helium in ankles of even the strictest of tops!His accent will make you melt as he shows off that deeply tanned body, his hands immediately going to the center of attention; a thick cock so hard it already shows a hell of a basket even in his baggy jeans. The mega watt smile with just a touch of an ?aww shucks? look in those brown eyes shows what a fine time he seems to be having: Being away from his girlfriend back home has definitely fueled his need to seed and we told him to pretend he was making this video just for her. All we can say is from the size of that schlong that could barely be contained by his briefs, that is one lucky girl back home though today, we are the ones that get the view and that is not all.A starch white stretch of skin is the perfect backdrop when he unleashes as prime a piece of meat as we have ever seen. Long, thick, a perfect head, a wicked bend and a natural bush to top it all off. Seeing those 8? stand and throb as they jut out with no need for his hands to assist even a cock this thick from pointing at the ceiling. He blows a kiss right to his imaginary sweetheart then gets on the couch and shows off an ass that wet dreams are made of, bending way over to stroke with one hand and spread his cheeks with the other. At one point he even stops and pours water on that throbbing pole, but nothing could cool down anything that hot. He jacks that hammer, flexes his abs and as if by sheer will, rope after rope of cum hurls out of that cock until his abs look like coffee cream frosted in puddles of vanilla. JJ told us he loves to jack off outside and stay tuned; we are meeting him at a secluded little spot tomorrow!",
  "models": [],
  "release_date": "2006-07-28",
  "scene_id": 55475,
  "series": "Brazilian Heat",
  "tags": [],
  "title": "Brazilian Heat, Scene #02"
}