{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Jail house tats, shoulder length braids and the pearly white smile of a guy who is up to no good, Miguel is pure bad boy to the core. His naturally lean frame is dotted with ink and devoid of hair with the exception of a nice thick patch under his arms and a single dark line right down the center of those flat abs. It is not unusual for a CircleJerkBoy to get excited by the idea of being filmed and begin showing some trouser tent early on, but Miguel is not just showing a bulge, his cock is like a pipe of denim he has no problem grabbing two handfuls of. Every glance seems so powerfully provocative, like Miguel is a sexual prodigy well beyond his ears. Perhaps it's the braids, which would ordinarily be out of place, that accentuate the knowing glances as he rubs the bulge in his black shorts with a leering smile, demonstrating he knows full well just how much he is turning you on. Finally pushing the waistband down to show his close trimmed bush, we see the heavy thick base of the cock and then, finally, all 7.5' of curved meat snap into view. Moving to the couch, we see that ink dance on his arms as he humps away, giving his imaginary girlfriend a ride that you will want to be next in line for with those furry, round tight buns moving in a passionate harmony guaranteed to deliver bliss. Settling back, the cuts of his abs like a pillow of arches, he slaps his cock back on them with a loud echo as dark braids cascade down his shoulders. Spreading wide and offering a glimpse of that hole, he rubs his meat with increasing intensity, gripping it strongly and stroking faster and faster until he gets up, moves to the floor and settlers into position for taking a victory lap. His eyes wide open, the determination turning his face bright red, sweat covering that body, he beats down on his cock with the determined strength of a man who needs to nut badly and then leaves us breathless afterwards. We have a feeling he might look just as hot with those brown locks let loose and flowing...we'll see what we can do to make that happen!",
  "models": [
    {
      "name": "Miguel",
      "person_id": 27783
    }
  ],
  "release_date": "2006-06-17",
  "scene_id": 55485,
  "series": "Miguel #1",
  "tags": [],
  "title": "Miguel #1, Scene #02"
}