{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The profile from a Roman coin and an incredibly chiseled, ultra ripped body that would make sculptures of the physiques of ancient athletes seem underdeveloped by comparison, Anton is a straight from Italy, and we mean that literally and in every sense of the word. With an accent as thick as his muscles and a cock just as fat and juicy, Anton is a buffet of masculine perfection and all we can say is 'manga, manga!' With a knowing glance from those soulful eyes, Anton knows just how sexy he is but keeps it ratcheted to the perfect apex of intoxicating confidence without an ounce of conceit. Stripping off his shirt and opening those jeans, the bulge that spills out of the zipper says that, oh yes, Anton is more than just a little cocky, and we could not wait for the next course.Strong corded thighs come into view, and you wish they were locking around your neck for a taste of what is dancing on just the underside of the fabric of those sexy, low cut, high leg briefs. With a passionate stare directly into the camera, Anton finally hauls out that slab of meat, just as magnificent as we knew it would be: thick, uncut and already approaching seven inches while still semi soft and spongy. Anton is a fan of the slap, wiggle and jerk movement. He spanks that now fully hard slab of pepperoni against his abs while still wearing his Calvin's. Finally removing his underwear, Anton works his way up to the bed, showing off every angle of his body and then, as if answering a secret prayer, rolls over to show you the first class ass in a fly over all to brief but oh so memorable.Lying on his side on the bed, his body is like great planes of carved muscle converging on a blessed frame, moving with perfect symmetry. Deep breathes escape from the pearly smile curled in delight, matching a twinkle in those eyes almost boyish in their exuberance. With a six pack that does not start near his navel, but directly under those pecs, his balls begin to tighten as he strokes with a gentle grip that shapes that strong arm into an anatomy chart of muscle and tendons working overtime to produce three dollops of heavy cream. Viva Italia, guys...Viva Italia!",
  "models": [
    {
      "name": "Anton",
      "person_id": 28237
    }
  ],
  "release_date": "2006-06-10",
  "scene_id": 55486,
  "series": "The Perfect Man",
  "tags": [],
  "title": "The Perfect Man"
}