{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "With a closer crop than even the most serious army recruit, dark eyes that scream trouble and the ink dotting his lean skater punk body, BadBoy more than lives up to his name from the very first glance. Making quick history of his shirt, his tanned smooth chest tops fat-free abs with a bunny tat right under his navel, standing guard over the real estate below. It will definitely require every square foot of the Playboy Mansion to house something this big: Badboy's \\'bad boy\\' measures in at 9.5? inches of thick uncut meat and from the looks of the bulge in his pants, that huge meat is at full mast and stretching his boxers to their breaking point, rubbing what looks like a salami-thick slab of meat that stretches well beyond the outer edge of his hips.Keeping one eye on the porn and one hand on his cock, we look down the ironic choice of angel wings inked in the middle of his back to ass crack before moving to the front. Hanging out the leg of his shorts, the fat head being tickled by the hair of his mid-thigh, we get our first glimpse of that mammoth cock. Heavy, dark, thick, with massive bull-sized balls to match, he looks down, giving an LL Cool J lick to his lips to show us he is as proud as anyone sporting this much dick has a right to be. The tribal band around his biceps dances in rhythm as his fists that cock, now jutting out impossibly far in front of that close-trimmed bush. Giving his hard nips a tweak; he rolls over and gets into his favorite position, ready to fuck.Badboy's glutes flex and release in perfect unison. This is a man who knows how to work every inch of that huge dick into a lucky hole, then pump it for broke once he is inside. Like any horny guy, breeder or otherwise, the head below may call the shots for the head above, but BadBoy manages to flex that 9 ?? pole hands-free, showing just how much control he has over even something this big and this heavy. Going from nip to nip, spreading his legs wide and switching hands back and forth as if the sheer weight and length of his cock is giving his palm cramps, with a stare down directly at the head of his dick, BadBoy curls his toes, and spills his load. Good job, Badboy; Good job!",
  "models": [
    {
      "name": "Bad Boy",
      "person_id": 28244
    }
  ],
  "release_date": "2006-07-07",
  "scene_id": 55481,
  "series": "Parental Advisory",
  "tags": [],
  "title": "Parental Advisory, Scene #02"
}