{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "MJ's claim to fame is that he has received the golden globes in terms of the real estate that makes up one of the finest asses we have ever seen. We could not blame Talon for trying to finger a target that tempting during their oral fest a few weeks ago, but we had to get them together one more time to see if we could get those ass cheeks the internal exploration that anything that round, tight and perfect was just begging for. The fact that MJ not just gave Talon's cock a few strokes, but even took a lick or two, gave us the hope that MJ would be open to explore some further man on man action, but we never expected it to play out the way it did. If you think you can guess who played the ?Ministry of the Interior,? keep reading!Without even a glance to acknowledge each other's presence, MJ pulls Talon down by his tee-shirt to his dick and Talon, being eager to please, swallows it all. Yet there is a palpable feeling that there is some unfinished business between these two. AT first, MJ lays almost motionless, as if he is doing Talon a favor simply by offering his dick forth for sucking. When Talon lifts MJ's leg and tongues under his balls, MJ is like a kid with a new toy...sliding further onto Talon until he turns around and moans like a horny bitch as Talon's finger doesn't get slapped away this time, but invited in and even backed up on, signaling that while this rematch is on, the rule book, along with a condom wrapper, is about to be off.Taking a few more licks off Talon's cock, MJ seems to seize the moment, throughing his inhibitions out the window as he sits on Talon's meat in a move that even after editing the footage, we still never saw coming. Even later, sneaking in a kiss that lasts only for the blink of eye, MJ shows that while he might only do this once, but he is going to give it everything he has. Working his own cock while grabbing Talon's legs to work the meat in deeper, it's when MJ leans back, causing Talon's head to rub against his prostate, that MJ totally surrenders reality, bending over for more dicking before getting on all fours and moaning like a man on the brink of ecstasy before both guys roll on their backs and fire a 2 gun victory salute.",
  "models": [
    {
      "name": "MJ Cash",
      "person_id": 28245
    },
    {
      "name": "Talon",
      "person_id": 28246
    }
  ],
  "release_date": "2010-01-01",
  "scene_id": 55482,
  "series": "Duo 23",
  "tags": [],
  "title": "Duo 23, Scene #01"
}