{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Like the All-American boy with the killer smile, ripped abs, and 9? cock that gets hard when the wind blows, we could not wait to get Kody back for an encore! Even leaner than before, with a bit more hair on top, those lips curled into a devilish smile as he makes history of his t-shirt, he shows off that marble-smooth chest, those pumped arms, and an ultra-lean torso above the deep ridges of his obliques which, looking like angels' wings, draw your eyes to the promised land in the middle. His boxers fall low on those trim hips, and that heavy hung lump promises that big meat is ready to come out and play. Looking at that neatly trimmed patch above that beautiful pale spear of a cock, we said a private prayer of gratitude in seeing it was not just the locks on top of his head he had let grow out since his last visit. That smooth sack is already tightening, causing that now full nine incher to bob and weave over those bloated balls in a profile shot of what the perfect man is all about. Bending over, the vision of those perfectly smooth, impossibly rounded and granite-hard ass cheeks, with that illusive but oh so tight hole in the center before us, Kody shows us a vista that would make any meat lover drop to their knees and toss that boy's salad until he begged for mercy. Leaning back, stroking that hard cock with one hand and working his equally hard nips with the other, he looks directly into the camera and flashes those ?I wanna fuck you silly? eyes with the power of ultimate seduction. Spreading one leg out to the side, giving the perfect view of the valley between his ass right up to that double hander of a cock, Kody allows the camera to drink him like a wine and worship every perfect inch of flesh, especially those nine throbbing inches in the middle. As his body begins to tense, his chest and stomach looking like an anatomy chart of muscle, with a low, guttural, toe-curling moan, his lip quivers and immediately after ?I'm gonna cum? leaves his lips, a torrent of sperm leaves that cock, the first jet landing in the middle of his pecs, the second almost hitting his chin and third filling in the middle. Oh Kody, he's so fine...he can do us anytime!",
  "models": [
    {
      "name": "Kody",
      "person_id": 28197
    }
  ],
  "release_date": "2006-06-03",
  "scene_id": 55489,
  "tags": [],
  "title": "Casanova Kody, Scene #02"
}