{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "One thing about the guys who come to Florida for spring break is how quickly they empty their wallets, which makes them eager to replenish their party fund.  We were not surprised when we got a call from MJ, and while this smooth 20-year-old hottie may have an ass and sex drive that never quits, his ATM card did.  We met him in the park and with the lure of enough green backs, convinced him that a mouth is a mouth.  The mouth this time belongs to Talon, another college kid high on libido and short on cash.  Like a synchronized swimming show, the guys peel off their shirts at the same time and while MJ worked hard keeping his eyes fixed on the porn, Talon glanced at the growing bulge in MJ's pants, and it was all he could do to keep from licking his lips in anticipation.MJ's first glance at Talon's meat was priceless - as if he was seeing an erect penis for the first time.  He was tenting his own tighty-whiteys and pulling all seven inches out the side. It sticks straight up in the air as he hooks one hand around Talon's neck and brings that mouth right down to an awaiting meat.  Avoiding looking down at first, the swelling of his sack spoke better then words about just how good Talon's oral attention felt. Kicking of his shorts to give Talon unfettered access to a now throbbing pole, he fed that cock and even reached around for a tentative grasp of Talon's dick, which was aching for some attention of its own. It must not have been as bad as he expected as he went back for another grab and in a move we never saw coming, actually leaned over and made Talon's cock disappear into his own mouth. The two sword fight with their cocks, now lubed with each other's spit, before Talon drops to his knees and services MJ's cock again. Stroking side by side, MJ turns and unloads all over Talon's thigh and Talon soon covers his chest in a white storm of his own.  MJ seemed to have second thoughts about swimming in fishless water, but pretty soon he decided the water was just fine. This guy does have a world class backside and who could blame Talon for trying to give it some well-deserved attention, though MJ quickly pushed his hand away...this time.  As for next time, we'll see if a few extra Ben Franklin's will entice him to invite some deeper exploration. ",
  "models": [
    {
      "name": "MJ Cash",
      "person_id": 28245
    },
    {
      "name": "Talon",
      "person_id": 28246
    }
  ],
  "release_date": "2006-05-20",
  "scene_id": 55493,
  "series": "Spring Breaking and Entering",
  "tags": [],
  "title": "Spring Breaking and Entering"
}