{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The most beautiful reminder that summer is around the corner is when the college crowd makes its annual pilgrimage to Florida in search of fun, sun and sin during their vacation.19-year-old MJ is a southern boy with that straight cockiness we love and an ass that wet dreams are made of.  The apple-bottomed backside on that lean, smooth body with gymnast legs, sexy dimples and eyes that scream ?fuck me? with every glance were just for starters, and that very hard, cut, and ready-for-action cock let us know he had some business to finish, and we could not wait to let him get to work.Stripping off his shirt, rubbing his nipples and flashing that pierced tongue, MJ knows how sexy he is and just how to show it off to his full advantage.  He does not just slide his shorts down, he lowers them inch by inch, exposing that round, oh so fuckable ass wrapped up like a present in a pair of white briefs. Turning around, his cock makes a mound in the pouch that looks like it will rip through the fabric before lying down, humping a pillow and finally showing off the perfection that is his backside in undulations so sinfully erotic, so inviting, so powerfully seductive, it tugs at your primal core - and you will be tugging on something else.Moving to the chair, spreading wide, it's as if he is offering both his cock and his hole for close-up inspection, and our lens loved capturing it as much as he delighted in showing it off. While he definitely has mowed the lawn above his cock, he thankfully bucks the trend of removing all of his pubes and leaves a sexy patch of dark brown hair as the perfect playground between those heaving cuts in his abs and that leaking meat down below before all is finally decorated with a nice blast of cream.  We named this episode ?Texas Hold'em? and we will see what we can do to get him to hold those legs up for a hot tongue before he goes back to campus.  Stay tuned guys...vacation isn't over yet!",
  "models": [
    {
      "name": "MJ Cash",
      "person_id": 28245
    }
  ],
  "release_date": "2006-05-13",
  "scene_id": 55495,
  "series": "Texas Hold Em",
  "tags": [],
  "title": "Texas Hold Em, Scene #02"
}