{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Bathed in the sun's rays, showered in the reflection of the water of the pool, what could possibly still shine above Mother Nature other than the much requested return of CircleJerkBoys' favorite and horniest ex-marine, Anthony.  Those pecs stretching his t-shirt, that bulge unmissable even from across the yard, sprawled out next to a statue of a Greek god, it's Anthony and his legendary body and wet-dream-inspiring 8 inches of always hard meat that inspire the worship this time. Seeing how much he enjoyed being back in front of the camera a few weeks ago in ?Four Handed Jizz,? we wondered if his new found fondness for showing off what is arguably the most perfect straight ass in history was something that would show itself today and damn, did it ever.The sun beams off of his thick marine build as the water from the pool gives him a reflection that turns him on....himself. With a face that handsome, a physique that toned and a dick that hard, who can blame him! As he walks around to the other side of the pool, we couldn't take our eyes off his ass spilling out of the black straps of that jock like two orbs of perfection on display to behold. Removing the rest of his clothes and making history of that jock strap, he jumps in for a dip and emerges moist and wet. Raising himself out of the pool to show off his ass one more time, Anthony spreads his cheeks and gives us a glimpse of the hidden no-man's land that we have never seen before. Anthony swims across the pool to the stairs and begins working on unleashing his milk.Winking at the camera as he strokes, he reminds us that this man loves being watched and reaffirms all of the reasons we love watching him. In one sweeping motion, Anthony bends over, strokes his meat and then, in a move we never expected to see, he fingers his ass, showing us what he learned from his girlfriend. Can't help but wonder what else she might be teaching him ? rest assured we'll dig deeper next time! We could tell by the swollen red nut sack that this session was soon cumming to a finish. Lying on a beach chair to make himself more comfortable, Anthony reaches climax and than hops in the shower for a rinse off, but we know there's no amount of water in the world that could wash the dirt out of this dirty boy and Anthony, we wouldn't have you any other way!",
  "models": [
    {
      "name": "Anthony",
      "person_id": 27804
    }
  ],
  "release_date": "2006-04-22",
  "scene_id": 55498,
  "series": "Underwater Fantasy",
  "tags": [],
  "title": "Underwater Fantasy, Scene #01"
}