{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It must have been fate that drew Vinnie, the smoldering ex-soldier with the chiseled face, thick legs and one of the most desired asses, to the set one day a couple of years ago, along with Mauricio, the freshly graduated, teen idol-faced hottie with 8' of uncut meat and a powerfully electrifying sexuality. That unlikely beginning has steadily blossomed from lustful beginnings to a full-fledged love affair, and they have allowed us to follow along, peer in and record without censor, each tender, fiery step of the way. Our favorite favorites, Vinnie and Mauricio have returned once again to provide the fireworks to kick off your summer with all of the passion and chemistry you have come to expect - and they do not disappoint.  They prove life is truly the ultimate reality show and, just as you would expect from any reality show worth its time slot, this episode has a twist...for one of the few times ever, on screen or off, Vinnie takes his turn on the receiving end of that incredible piece of real estate, better known as Mauricio's pipe-thick, jumbo-sized, dick.Shocked, are you?  So were we! The idea sprang about during that torrid afternoon when they were being watched by Sebastian.  Mr. Vinnie said yes to us being a fly on the wall for this extravaganza; this is a couple that knows how to keep the spice in their relationship and with role reversal on the menu, we made sure we were first in line on that reservation list.  The phrase 'an ass to die for' could have been coined after seeing Vinnie's glorious twin orbs that together form one of the most perfect backsides on the planet, and we have been trying forever to convince him to let us see it in action.  Vinnie takes Mauricio's cock in his mouth, inhaling it, but it's not long before Mauricio takes the lead again, fingering Vinnie's ass after priming it with his tongue. With the ungloved insertion that only lovers this committed can enjoy, the look of pain and pleasure on Vinnie's face lets you know that he doesn't play this position often, but what a sight it is to finally behold.  Moving from the bed to standing against the wall, the passion reaches the boiling point when Vinnie slides off, swallowing Mauricio's tongue and pushing him back on the bed.  Taking control of his man, there is no question Vinnie is Dean of this 'Ride 'Em Long and Hard Academy' and Mauricio would not have it any other way.His tongue drinking in Mauricio's ass like a thirsty man securing the last bottle of water in the desert, Vinnie's tongue quickly moves to Mauricio's mouth as Mauricio's hole inhales Vinnie's cock with a fierce, toe curling hunger, as if his body could not be deprived of being filled by that cock for one more second. The way their arms completely engulf each other, Mauricio's legs wrapping around Vinnie's waist to pull him in tighter, deeper, closer as Vinnie's cheeks flex and tighten while he gives Mauricio the pounding only he can, it is not long before twin explosions soon erupt, leaving Mauricio's heaving stomach covered in a white monument to what making love is all about. We cannot think of a more memorable way to wish you all a Happy Memorial Day. ",
  "models": [
    {
      "name": "Mauricio",
      "person_id": 28130
    },
    {
      "name": "Vinnie",
      "person_id": 28131
    }
  ],
  "release_date": "2006-05-27",
  "scene_id": 55491,
  "series": "Happy Memorial Daze",
  "tags": [],
  "title": "Happy Memorial Daze"
}