{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Troy is a strapping 6', 210 lbs serving of jock meat.  We all went to college with a guy like Troy who has seemingly more going on below the neck than above it, with more muscles than brains and a body so well built it can barely be contained by clothing.  Troy was used to being naked around guys from countless hours in the locker room, though his physical charms went unnoticed by the oblivious eyes of his straight team mates, but this time we have him all to ourselves and, with his shirt already off before the film even began, we knew we were in for a show from a big stud of a man who was as eager to get naked as we were to see it. You do not need to be a football fan to know Troy's a linebacker.  Massive shoulders, football-sized biceps, forearms like Popeye the Sailor and a thick neck that slides into a v-shaped torso.  Rubbing his bulge, he makes history of those jeans and in between those thick legs he is a giant; there is a one-eyed wonder inside that is at full mast and ready to come out and play. Pulling it out of the fly, Troy's cock is everything we hoped it would be and more: 7' inches of leaking meat, cut and just as thick as the rest of him, and resting on a big set of balls in a wide, low hanging sack.  Getting on his knees, he works his cock with a gentle hand as if to prolong the session as much as possible, which gives us plenty of time to admire the lower half of his body and those flat abs, beefy thighs and yet another chance to appreciate just what a fat fuckpole he is working with.  His ball sack begins to tighten and you can almost feel the size of the load that is beginning to brew.  The white jets rain down on the stubble of his bush as he flexes his cock like a good jock, never forgetting the importance of cooling down.",
  "models": [
    {
      "name": "Troy",
      "person_id": 27788
    }
  ],
  "release_date": "2006-04-29",
  "scene_id": 55497,
  "series": "Muscle Beach",
  "tags": [],
  "title": "Muscle Beach"
}