{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "His shoulder length hair is the color of a dark red merlot framing a face with a polarizing stare.  It is easy to see where he got his name. What we did not know at first is that he should have been called ?Big Red!? Red is a color with a lot of meanings: passion, rage, desire and most intoxicating of all, forbidden lust.  Another man's eyes have never seen Red's red hot boner until we persuaded him to drop trou for us. This sexy 21 year old breeder boy is packing nine inches of thick, uncut meat in those boxers; those fruit of the looms are packed with a bumper crop.His skin is sand simmering under the desert sun and while he has a head of hair worthy of a shampoo commercial, short of a few auburn tufts under his arms, Red is smooth from head to toe.  Red runs his hand over his chest, demonstrating this is one man who has learned that his nipples might not be just decorative, but a source of pleasure as well. Sliding those shorts off, just a few strokes and that beauty is fully engorged, so hard it is flexing on its own and so filled with blood, it looks like that staff has been dipped in wine. The look on his face is of a man lost in total joy and the pleasures his own body can produce. We wondered if he forgot we were there when he even reached below his balls and gave his hole a rub that was more than just a casual encounter.With a slight upward arc, the vein on the underside of that long shaft is so thick and pronounced, you can almost see the sperm bubbling up from a set of nuts as bloated and tight as we have ever seen.  Yet he keeps on going, air fucking his fist, rubbing his cock with both hands from the top, the bottom, up the sides, prolonging the pleasure with a calculated restraint.  His eyes roll back as he cups his sack, almost as if he needs the extra pressure to keep it from exploding.  Fisting in double, then triple time, he finally uncorks a load of fine white vintage of the very best kind. Cheers!",
  "models": [
    {
      "name": "Red",
      "person_id": 27814
    }
  ],
  "release_date": "2006-03-18",
  "scene_id": 55509,
  "series": "Red-dy For Something Huge!",
  "tags": [],
  "title": "Red-dy For Something Huge!, Scene #02"
}