{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Looking just as at home on an Army recruiting poster as in the role of the clean-cut collegiate side kick of a superhero, 21-year-old Hank is an ultra smooth, freckle-faced comedian. Proving you can't judge a book by its cover, at first glance you would expect Hank to be in a comic book. But the show he puts on is strictly X-rated almost from the start. His shorts were off in record time, showing off a lean body, and within the first minute he was opening his pants and the head of his rock hard cock was poking right through the fly in his boxers, demanding attention. Our football player from Breederville was raring to have a scrimmage match with his throbbing bone and all we could say was ?bring it on!?He stared at that thick, cut cock as he lovingly caressed it from the top down, the bottom up, and on both sides...as if he was discovering the pleasure for the very first time, yet at the same time with the mastery and skill of someone who has spent many a quality moment working his favorite toy. Dropping his shorts and fucking the mattress, the flexing of that snow white, perfectly round and very tight ass, it's obvious he has used that stick for the pleasure of others as well. Rolling over and working that considerable stick with both hands, his fuzzy balls already start to tighten with the promise of more to come.Though the Apollo Wings inked on the top of his feet didn't get his ankles in the air, Hank sure enjoyed spreading wide and showing off those creamy ass cheeks with a ?go ahead, you can look at what you can't touch? smile. His cock didn't just stay hard the entire time, it kept growing thicker until the shaft was swollen to the diameter of his leaking cockhead. He fires off his load without his cock even beginning to soften, and nothing but a cum-splotched belly and a smile to tell the tale.",
  "models": [
    {
      "name": "Hank",
      "person_id": 27819
    }
  ],
  "release_date": "2006-04-01",
  "scene_id": 55504,
  "series": "First Time's A Charm",
  "tags": [],
  "title": "First Time's A Charm, Scene #01"
}