{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "From the moment we first met Apollo, every glance from his dark seductive eyes said ?I will send you to places no one ever has? with such sexual authority, you do not doubt his ability to make good on that claim for even a nanosecond. Just perhaps he's under-reporting the expansive skill set at his disposal to deliver your total delight. It is difficult to even begin to define a physique this fine with a word or two with the reality of so many perfectly honed planes of muscle assembled in perfect symmetry on a 6'3? frame of agility and drenched with a burning sexuality just beginning to explore the topic at hand.  We last saw him when he stopped in to celebrate Yuletide with Aiden and today is another holiday: Apollo's 25th birthday. We commissioned a piece of music a little snappier than ?Happy Birthday? for him to shake that money maker to and the name ?Porn Stroke? gives you a good idea of the present he unwraps.The clothing begins to fly off that body in movement, revealing a soul for sin that, like his crotch, is bursting at the seams.  Apollo is lost in a zone of endless movement that is as graceful as it is sexual. Still with his tight shorts packed to the breaking point, the sheer thrusting power of perhaps the world's most perfect ass moving to the beat of the music propels you to do some beating of your own. Then he turns around. The eyebrow arched, the tongue out and beckoning, and the oil sliding down that olive skin reminds you that the view on the front is a sheer essay on the primal male.Crawling on the floor, his penis like a sleeping giant ready for display, Apollo builds the  anticipation to a crescendo when at last, bending, twitching, and twisting his body, he presents that rock hard cock from every possible angle. Those balls so swollen, that shaft thicker than we have ever seen it before, the flaring head leaking steadily in the center of that glistening six pack, he looks straight into the camera with fist over fist on that perfect pole.  We trip the light fantastic as several ropes of extra thick cream gyrate from the tip, overflow his grip and puddle down onto the floor below, blowing out his birthday candle in a style we can definitely get accustomed to!",
  "models": [
    {
      "name": "Apollo",
      "person_id": 28189
    }
  ],
  "release_date": "2006-03-25",
  "scene_id": 55507,
  "series": "Dance Trance",
  "tags": [],
  "title": "Dance Trance, Scene #02"
}