{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "With a quartet of hunks hung over 8? in ?Four Handed Jizz? a few weeks ago, we were not surprised to see it end in so much sperm, nor shocked that all inhibitions went out the window, and we did not even raise an eyebrow when a bone disappeared into a willing mouth, and then the favor returned.  However, when the cocks in question belong to Aiden and Sebastian, there is nothing ordinary about it.  It was when Sebastian grabbed Aiden, those movie star faces colliding as Sebastian's tongue found its way down Aiden's throat, that we knew we had to get them back alone and let this spark ignite into the inferno we could see was smoldering.  It is only this very rare, spontaneous chemistry that ignites the hidden desires that compel a CircleJerkBoys straight guy to test his limits and go beyond them. We have followed Aiden's boldness through duos and trios here at CircleJerkBoys, but this was new for Sebastian.  Just how far would Sebastian go, even under these ideal circumstances?  As you will see, if you can hold back your load long enough, he went all the way to heaven to back. A piece of candy becomes a shared chocolate kiss, producing an immediate mound in Sebastian's jeans. The way he and Aiden caress each other drips with a sexual hunger which grabs your soul and revels in the nuances of tender passion at the same time.  Sebastian is the aggressor, stripping Aiden of his clothes and claiming an oral victory over that 8 ?? spear of Aiden's that has never seemed so hard before.  It got even harder when Sebastian grabbed Aiden's ankles and shoved his tongue in Aiden's hole, breaking new ground in what has until now been known as no-man's land. Where breaking goes, entering follows, and soon that tongue is replaced by Sebastian's cock as he fills Aiden with that fat 8? sausage, giving Aiden the ride of his life.With life being the ultimate reality show, and with every reality show having a plot twist, even we could never have conjured up what happens next.  Maybe he was lost in the moment of eagerness to experience the unbridled bliss Aiden was feeling, but Sebastian pulls out, turns around and proceeds to lower that perfect jock ass slowly and steadily down Aiden's pole until the rubber meats the road...literally! Sebastian's uncut sausage flops up and down as he rides the look of surprise right off Aiden's face until it is replaced by a leer of pure lust. Flipping Sebastian over, Aiden takes him from behind and finally stands up and launches an epic nut on Sebastian's head until that handsome face is dripping.  Aiden's pecs soon get their share of the same treatment.  As Aiden takes a lick across Sebastian's scalp, cleaning away a few remaining drops of his own cum, things end where they began as they share the moment in a kiss that leaves them, and us, breathless.",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Sebastian",
      "person_id": 30166
    }
  ],
  "release_date": "2006-04-08",
  "scene_id": 55502,
  "series": "Scared Straight",
  "tags": [],
  "title": "Scared Straight, Scene #01"
}