{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "For every guy in our past, we all have a Sebastian, the sports hero and Campus Romeo we secretly feared and had a crush on at the same time. We also had a guy like this week's CircleJerkBoy, Rico; a little shy, a little nerdy on the surface, but with a tight little body, a perfect ass, a quietly handsome face and basket that would not quit who was like a secret indulgence; we didn't want to admit we liked him, but we couldn't help ourselves.  This week, we got the chance to get up close and personal and frankly the closer we got, the better he looked. Those naturally firm pecs, that sexy happy trail on an otherwise smooth chest,  the butt that filled the seat of his pants too perfectly for words and the bulge in the front that show so much promise. Under Clark Kent's glasses was a super man and under Rico's clothes was a porn star just dying for the opportunity to seduce and produce just once. After you what he produced and how he seduced with it, you will never look at the quiet guy in the accounting department without seeing our own numbers grow.Without the slightest hesitation, he started peeling off his clothes and under those jeans was a pair of camo patterned boxers that held his secret weapon and the tent he sported right from just street said he was battle ready before the camera even started rolling.  He worked that gun right through the fabric, showing it off like a much desired prize sausage and dragging down the waistband down to reveal a dense, thick sable brown jungle of hair.  He had a look in eye like a man who was the champion of his own dare, the trobber in his hand showing exactly what was on his mind. Then he turned around and revealed that world class ass, so firm and tight with a dusting of almost invisible hair as he fucked the mattress, we started thinking up some dares of our own!He didn't just stroke that beautiful uncut, perfectly straight cock, he used it like a handle, taking the rest of him along for the ride. He was lost in the power of the freedom he had pent up for so long and worked his dick like a reward after being victorious from an epic battle. Like his in inhibitions, that load could not stay pent up forever and without so much a word, a look or a sound, he releases his load in total silence...glad we are there to see it, but keeping the audible part of joy for a private badge of honor. ",
  "models": [
    {
      "name": "Rico",
      "person_id": 28192
    }
  ],
  "release_date": "2006-02-25",
  "scene_id": 55513,
  "series": "The Book Worm",
  "tags": [],
  "title": "The Book Worm"
}