{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "When we first saw Mike Hawk and that big cock come to life as his strummed his guitar, we were impressed.  Then a couple weeks ago, presented something pretty rare, Dizzy, a young married guy with a fashion model's face and fitness model's body, who had a burning desire to bust a nut on camera. Seems like the Christmas bills and winter semester tuition payments were due at the same time as they both called us looking do another shoot. Hitting the ATM machine for a few extra Ben Franklin's for enticement, we knew Mike would bite; getting someone who has a wife into a duo scene was uncharted territory for us but damn, did we ever arrive at the promised land: two straight guys touching and being touched by another guy for the very first time and our cameras to bring it all home to you!Young, dumb and full of cum, we figured Mike we be first at bat but damn, it was Dizzy, the married guy, who wrestled the game controller out of Mike's hands to get to Mike's dick. We knew Mike has a respectable hard on but in Dizzy's grip, that thing swelled to a good inch bigger then we had ever seen it before.  Being his first time, Dizzy could not take much of it in his mouth. This is the real deal, not supposed virgins who become deep throat experts in 30 seconds. Dizzy savors Mike's cock head and slowly strokes the shaft with a quality of quiet reverence. When Dizzy took a swig of his beer after afterwards and Mike leaned in to suck the brew right out of his mouth, we hauled out a small ?starter? sized vibrator and it did not take long for the guys to find a home for it.With a few tentative licks on Dizzy's rock hard pole, even a straight guy like Mike could not help but notice the creamy white goodness that is Dizzy's world class butt. A back rub that dead ended into Dizzy's hole with lotioned fingers that were quickly replaced with sex toy. When Mike turned the vibrator, Dizzy's ass went up, his back arched as he started humping floor and backing more into the toy, hungering for more. Eager to bust a nut, the guys sit back on the couch for a double jerk off session, helping each other out. Dizzy is the first to come letting it go into his hand, however Mike ups him one by busting right on to Dizzy's chest. They may still be straight when they left that day, but damn, sure was fun watching them bend in the afternoon!!!",
  "models": [
    {
      "name": "Dizzy",
      "person_id": 28193
    },
    {
      "name": "Mike",
      "person_id": 29801
    }
  ],
  "release_date": "2006-02-18",
  "scene_id": 55516,
  "tags": [],
  "title": "Big Boys' Toy Box, Scene #02"
}