{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "When a married man discovers his urge to call our studio after he has already said ?I Do?, what's a boy to guy to do but say how yes! As far as getting straight guys to jack off for our camera, they do not cum much straighter then Vince, no pun intended!  With those smoky blue eyes and a skater boy feel to him, VInce looks less like a twenty-something husband then a horny skater boy in his freshman year at college!  This white boy from the wrong side of the tracks has a thing for the dark meat...not men though; he is actually married! So the question remains; does wifey know what her man is doing on his day off or about the one time thought of being with a guy? Who knows...all we know is that this boy had a nut that he wanted to bust and we weren't going to stop him.With him already stripped down for the camera, Vince begins working up his meat through his undies...teasing the camera as he grabs a pillow so you can't see his love meat just yet. Building up the courage to show us everything, Vince drops the pillow and begins showing his dick some full attention. With his inner freak dying to come out and play, but with the good angel on his other shoulder, Vince is a little cautious of how much to let go but once he got into that exhibitionist zone, he let it all hang loose, especially those balls dangling in the wind under that precious, untouched breeder butt!As our camera guy lays on the floor and Vince straddles over him...I'm guessing this must have excited him due to the fact of how he started showing off his ass like one of the rap starts girlfriends in the video. Soon after we he the words ?I'm gonna cum,? Vince lets out that nut all over the black pillow with some dripping onto his thigh and the carpeting, and the camera! This Hubby Chubby might not be has fattening as the ice cream of the similar name, but it is definitely higher in protein!",
  "models": [
    {
      "name": "Vince",
      "person_id": 28195
    }
  ],
  "release_date": "2006-02-11",
  "scene_id": 55517,
  "tags": [],
  "title": "Hubby Chubby, Scene #01"
}