{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Vinnie and Mauricio, an ex-soldier and fresh high school graduate we first presented a couple of years ago, are the ultimate example of Cupid hitting a bull's-eye.  More than just realizing they didn't prefer girls anymore, they discovered with our cameras as silent but grateful witnesses that they preferred not just guys, but each other. From their first tentative reach over in the Three Way, to that explosive first kiss when we invited them back alone, to the legendary semen volcanoes Mauricio's 8.5' cock erupts with when being royally rammed by Vinnie's thick stick, we are sure more loads have been spilled in front of monitors the world over while watching the electric mix of primal need and overwhelming passion this blessed pair always delivers. For Valentine's Day this year, rather than simply offer another viewing of their incredible chemistry, we wondered what would happen if we knocked down the third wall between subject and audience and invited an onlooker to enjoy the action as it happened, rather than after the fact at home.  The onlooker we chose was the well-hung, ultra-buff and heart-breakingly handsome Sebastian. Our experiment was a success and the result was a triple explosion of epic proportions.Any worries about their chemistry being thrown off went out the window immediately and from the first kiss it was obvious from the way they ripped each other's clothes off, without their tongues leaving each other mouths, that Vinnie and Mauricio appreciated a live audience. While far different than the straight porn he has stroked to on his previous two visits, Sebastian was soon massaging a mammoth bulge in his jeans and hauling that fully hard, eight inch cock out as Vinnie fingered Mauricio's tight hungry hole and then engulfed the famous huge Mauricio meat to the base.  Treating Vinnie to some equally fine oral excitement, Sebastian tossed them a condom and settled on the bed for a ring side view of the main event as Mauricio lowered himself onto Vinnie's cock and began to ride him with a hunger, need and passion we have never seen or judging from the moans coming out of Mauricio's mouth, like tidal waves of pleasure he almost could not weather, heard from them before.Sebastian stood and stroked, taking it all in as Mauricio followed suit, slapping Vinnie's ass to fill him even deeper. Crouching over Vinnie's dick, Mauricio's huge cock echoed as it thwacked against his abs and then his thighs as he worked Vinnie's cock until Vinnie literally fucked a load out of his lover's cock that even Mauricio, who has shot loads over his own head and up his own nose before, reached a new record of semen explosion. Vinnie was always a normal shooter but not his time; he exploded like a geyser and covered the bed and Mauricio's still leaking cock with a load the size of which far exceeds any load he has ever shot before. Without missing a beat, Sebastian emptied his balls with a sizeable addition of his own right between their legs. With this trifecta of smiles and jism, Happy Valentine's Day from CircleJerkBoys.com",
  "models": [
    {
      "name": "Mauricio",
      "person_id": 28130
    },
    {
      "name": "Sebastian",
      "person_id": 30166
    },
    {
      "name": "Vinnie",
      "person_id": 28131
    }
  ],
  "release_date": "2006-03-11",
  "scene_id": 55510,
  "series": "Cum One, Cum All",
  "tags": [],
  "title": "Cum One, Cum All"
}