{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The voice was hushed and very sexy and belonged to 25 year old named ?Dizzy.? He flatly proclaimed it was the day for some self-discovery of his wild side. Just from his tone, we knew we had a hottie on our hands and it seemed he couldn't wait to explore his porn star destiny - or at least, the chance to show off for a camera,  that had been bottled upside and couldn't stay that way one more day. In person, he was all that he sounded to be and then some. A tight, fit body, wash board abs, a mop of tousled hair, a boyish twinkle and a bulge in his pants he couldn't keep his hand off even as he waited for us to open the door.He came in contraction clothes but carrying a duffle bag too. We later found out he told the Mrs. he was going to work on a new job site for the day and while we had not bricks for him to lay, he proved to be able to build a flag pole like a master craftsmen!. The idea of being an exhibitionist on the down low seemed to make him ever hotter and all we could say was ?bring it on!?Dizzy has the body and looks of a fashion model and he really knows how to work his stuff. His beautiful smooth skin and spiked hair really looked great. The way he knew how to show off his ass in those white boxers had us breathing so heavy you might be able to hear it in the video.  Once the boxers were off he showed his hot ass then proceeded to fuck the mattress.  We made sure we got plenty of close ups of his virgin breeder hot ass. Then came the time for him to turn over and expose his beautiful hard dick.  His balls full of cum as he tempted our camera to go down on it.  He puts the head of his cock right up to the lens.  Oh how we wish we could film 3D for you.  As he strutted along the room and straddling the camera, we knew he was getting close.  Dizzy walked over to the corner sat down and began to play with his ass which soon sent loads of white stuff spiraling into the air.  We're cooking up an encore for this guy so stay tuned as we'll be getting Dizzy again soon!",
  "models": [
    {
      "name": "Dizzy",
      "person_id": 28193
    }
  ],
  "release_date": "2006-02-04",
  "scene_id": 55519,
  "tags": [],
  "title": "Hitch-cocks Vertigo, Scene #01"
}