{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Very few guys have ever caused an avalanche in our email box like the debut Sebastian a couple of months back. This 21 year old heart breaker is impossibly handsome, incredibly buff, and incomparably hung with just the kind of fat, eight inch slab of straight meat that wet dreams are made of. What is not to fall in love with in a stud like this! He is truly a super man who had no shame in showing us what was under his tights. If Sebastian was any more edible, he would be an adult sized happy meal but make no mistake about it...he is way too fine for fast food. This buffet of all things breeding and bountiful is a meal you want to savor slowly and in the end, make sure you are royally stuffed! Ever the strong and silent type, one tasty tidbit Sebastian did reveal at the end of his first biography chat is that he works out 6 days a week to and yes, it has gotten him so horned, he had rubbed off a load in gym late at night when it was deserted and he had some privacy. We knew that would be a great place to start this episode, only this time, he would not be alone for long!  We took him outside the studio for a run to get him all hot and sweaty, then giving him a quick rinse off in our showers, and letting him handle the rest. It was not long before he reminded us there were two fistfuls to handle and then some.The elastic of his jock was stretched to the breaking point as his cock lead the way to the shower and back to the bed, where be grabs the baby oil and rubs that ultra fine body until he glistens like a living statute. The head peeking out and starting to leak, the smooth bull sized sack, so heavy with a load pent up for too long, you could literally feel the sheer weight of his balls just by looking at them. Even more confident that before and riding the crest of an endorphin high, he rolls over and humps the mattress slowly, deliberately, putting that magnificent ass on display. Seeing the sweat follow the cuts of his six pack, the vein in his biceps twitch and the his pecs dance as he worked that huge meat was as close to masculine perfection as we have ever seen. The intensity and determination on his face as he hammered that meat was electrifying. This was not a man that just wanted to get off; Sebastian had reached the point of no return where his only choice was to surrender to a primal need to spill his seed. The first rope of cum sprays so far forward, it lands on his on his triceps and there were a few more good blasts to follow. When we watched the tape closely afterwards, right before that tremendous nut, seems our boy gave his own ass more then just a causal fly over and got us to wondering if our Super Man is keeping a secret? Just like Lois Lane, and apparently his own fingers, we intend to dig deep. Stay tuned boys...we'll let you know what we can turn up!!!",
  "models": [
    {
      "name": "Sebastian",
      "person_id": 30166
    }
  ],
  "release_date": "2006-03-04",
  "scene_id": 55511,
  "series": "Sebastian's Encore",
  "tags": [],
  "title": "Sebastian's Encore, Scene #01"
}