{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Kody has us at ?hello? when he told us on the phone he was a personal trainer who got into exercise to build up his legs to make his dick look smaller so it didn't scare so many girls off. This was just the sort of BIG finish we were looking for before we left California and ended up wanting to grab that thick, cut, thick and meaty 9? inch cock on this handsome, lean, chiseled hunk and drag him back to Florida with us!With a twinkle in his eyes and a toothpaste ad smile, Kody is the charming All American right off the Wheaties box and stepping right into your wet dreams with that etched, flawless smooth body.  He brought his girlfriend with him to the photo shoot, which is not usually something we encourage, but hell, with a guy like this, you would never let him out of your sight either. While she knew what was happening behind that door of the studio, what came out of his mouth and what went into his ass would shock her and sure sent our jaws dropping too.Right off the bat he revealed without the slightest hesitation or shame that his first sexual encounter was some adolescent experimentation with a buddy and how they spent some times jacking together in the car, though his encounters since have been of the female kind. He stood, his biceps bulging out of the sleeves of his shirt, to reveal a set of pecs right from anatomy class.  Just recalling old times seems to have stirred up more then just memories as he dropped his jeans, that cock was at full mast and even through the baggy gray boxers, we could see this was one thick club of meat with a helmet head that was begging for attention! When that massive meat stood straight out and bobbed and weaved like a palm tree in a hurricane, we knew we had finally found the perfect storm! Lying back like a lion in his den, he spread his legs wide and that meat stayed rock hard as his fingers not just rubbed his hole, but spread those cheeks and began to explore inside.",
  "models": [
    {
      "name": "Kody",
      "person_id": 28197
    }
  ],
  "release_date": "2010-01-01",
  "scene_id": 55527,
  "series": "All American Cream",
  "tags": [],
  "title": "All American Cream, Scene #01"
}