{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Sometime you just can tell...Pierce even sounded sexy on the phone. This 24 year old told us he had a wife AND two girlfriends and with a body this fine and 9 thick inches of meaty, heavy hanging, succulent breeder meat, its a wonder they didn't kill each other fighting for the right to get that magnificent bone!In just jeans and work boots, right from the job, we can tell he didn't just hit the gym, but trained hard in his quest to develop the perfect body as every muscle was in perfect symmetry, his arms cut and his pecs spilled out of the side of his wifebeater. As he raised that undershirt, it was like he was unwrapping a present as that treasure trail to Nirvana came into view, smack dab in the middle of a flat stomach and oblique so well formed, their ridges started almost at his rib cage and dead ended in the waistband of those jeans. We followed that smattering of hair up his chest, across his nips and with the wink of an unmistakably dirty boy, noted the silver in his brow and thought we had figured out where his nickname came from. The mound in his boxers was more like a mountain and as he slide them down, he turned to reveal a set of glutes as tight and hard as the rest of them. To our great joy, this is one straight guy who doesn't mind showing off his ass and what a prime example of anal perfection it is. That thick club of a cock towers well in front of him as he faces up and from the underside a gleam of metal showed he had a hidden surprise on the underside of that shaft...four silver balls at the base of that nine inch love rocket. Not just long, but think and so meaty and so heavy, it hung down like the bell from a tower and damn did we want to ring it. Fucking the mattress, his fist and putting that dick and his fine body on display, he squeezes out some sperm so thick it looked like glue with one stand as reluctant to let go from that massive meat as you would be too!",
  "models": [
    {
      "name": "Pierce",
      "person_id": 28196
    }
  ],
  "release_date": "2006-01-14",
  "scene_id": 55526,
  "tags": [],
  "title": "14-gauge, Scene #02"
}