{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We all had a guy like Sebastian in high school; incredibly handsome with the ripped body of an Olympic athlete, a slightly distant, brooding demeanor that made you hang on the few words he spoke and a basket in his pants you could not take your eyes off of. This is the guy we all had a crush on back then but this time, we get to see him strip down, bone up, stoke off and shoot his load. We get one other great addition, in reality his dick isn't the size you thought it was it your fantasies at all; Sebastian's eight inch, salami thick joystick is bigger then you ever dreamed!!!The biceps spilling out of his shirt are not just rippling, but down right undulating the a ship's flag on a choppy sea, with a telltale line of ink on the underside that reveals that this shy guy has a hidden freakier side too. All of this and more soon comes into view along with the rest of that incredible body as his ripped, lean abs and ridged obliges come into view along with Sequoia sized quads to match. And smack dab in the middle of all of this magnificence is a one pouch, packed to the breaking points,  that sits like the gates to the promised land where your wet dreams are born!Sebastian seems to love being in front of the camera and at the same time, he was seemingly unaware of it; not so much putting on a show allowing his body to be bathed by the lens and captured in all its glory. He dripped with an almost primal sexuality while being totally devoid of one drop of conceit. The sight of the arc of that perfect ass as he humped the mattress only got better as his strong hand reached around and in between, seemingly brushing the hidden center before rolling over and working that shaft. The head, well above his navel, was glistening with its own juice as his nut sack bulged a little bigger with every stroke.  When he could no longer stand the pressure, and quite frankly, neither could we, he stood up and fired off a load that dripped down the mirror and puddled on the floor while the last few drops continued to steadily drip off the tip of that still hard, fat pole.  We could think of no better explosion to ring in the New Year with! Have a great 2006 from all of us at CircleJerkBoys and oh yes...Sebastian will be back!",
  "models": [
    {
      "name": "Sebastian",
      "person_id": 30166
    }
  ],
  "release_date": "2006-01-28",
  "scene_id": 55521,
  "tags": [],
  "title": "Smooth Operator, Scene #01"
}