{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "G Mack greeted us with a handshake and wardrobe right from the Brooks Brother's catalog and we almost thought he was in the wrong place but it sure was the right time.  But by the time we turned around from closing the door, he had pulled off his belt, opened his pants, pulled down his zipper and had his hand inside the black mesh of his jock peeking out of those preppy pants. This 21 year old red hot serving of afro-latin fusion cuisine had a twinkle in his eye, a lean, well worked body and more then enough hormones to go around. For guys like G Mack, they have been a simmering pot of sexuality, just ready to let it boil over in front of the camera and we're damn glad he picked ours!His smooth athletic body and a luscious booty that could compete and win in a match up with Jose Canseco paid homage to one side of his family while the dark thick swirls covering every inch from the waist down gave a nod to the other. Baby has junk in the trunk all right and a fat old tree branch on the flip side too.  We asked how he got the name ?G Mack? and he whipped out that thick sausage and said he had the fat jock stick that always hits a lady's G-Spot and he was not kidding. A round packed set of balls made the picture complete. Still sporting that jock, he dropped trou and got into position to hump the mattress, those glorious ass cheeks dancing in their fur before sending jock flying across the room and getting down to the business of working that meat and stopping every now and then to throw us a wink. Some guys try to forget there is a camera there, G Mack reveled in it! Seemingly lost in the moment, he grabbed the bottle of oil and didn't just lube up, he rubbed his body until it glistened and he just couldn't hold back any longer, forcing out one thick load of ?Dulce de Leche? that is destined to become a food group all by itself!",
  "models": [
    {
      "name": "G Mack",
      "person_id": 28198
    }
  ],
  "release_date": "2006-01-07",
  "scene_id": 55529,
  "series": "Hidden Jock",
  "tags": [],
  "title": "Hidden Jock, Scene #01"
}