{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It was in the summer when an 18 year old straight guy named Aiden first walked through our doors and it was the Holiday gift you has always wanted, teen idol handsome, a strong lean body, a personality just draws you in and an 8?, extra thick, always hard cock with a never ending supply of precum dripping from that perfect helmet head. It seemed like the perfect time to repay the favor and give Aiden the gift of his choice. To our shock, and definitely your delight, his choice turned out to be a private encounter with Apollo. Apollo is another breeder, this one with the body of a Greek statue, the hormones of entire football. We raided the treasury and stocked the bar and hoped for the best. What we got was not just Aiden's fantasy, but a very special triple load of hetero spunk for this very special CircleJerkBoys' Holiday Jack-Strava-Ganza!While it might started out and good way to make some extra cash, it wasn't long before Apollo was definitely in the spirit of the season of giving as he was giving that long wet tongue of his deep into Aiden's mouth. Apparently years of opening bras with one hand had Apollo in good practice as was able to single handedly undo Aiden's belt, reach inside those tight white briefs and haul out Aiden's fat 8? cock, already poking well above his navel and drooling juice down that tight belly.  Before long, without breaking a lip lock as tight as we have ever seen, Apollo rolls over onto op Aiden, that magnificent ass and bull balls looking so perfect, so delectable; they are begging for your tongue as he and Aiden grind their cocks together with such friction, we're surprised they didn't start a fire.There was a gasp in the room as we saw Aiden's knees start to cradle around Apollo's hips and Apollo licked straight down from Aiden's neck, across his nips, over his abs, down to his balls then to the tip of his cock before swallow that big bloated beauty as Aiden's eye rolled back in his head. Apollo then stood up and straddled Aiden's face and got his pole smoked right down to the base of those short and curlies. Guess what folks, we're just getting started, as you will see inside, the name CircleJerkBoys' Holiday Jack-Strava-Ganza if far from simply an honorary title.  From all of us at CircleJerkBoys.com, have a wonderful, safe, sexy and a Happy Holiday!",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Apollo",
      "person_id": 28189
    }
  ],
  "release_date": "2006-01-21",
  "scene_id": 55523,
  "tags": [],
  "title": "Ho, Ho, Hoe, Scene #01"
}