{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Aiden's cock, all throbbing 8?, ridiculously thick, perennially dripping is a two handful joystick that wet dreams are made of and best of all, we're just getting started with the merits of this all time knock out.  As incredible as that mouthwatering spear of man meat is, the 22 year old with the rock star face, twinkling eyes, surfer boy body and easy, warm smile makes him perfect from head to toe.  In the year plus when since Aiden's first visit, his is just as lean, just as chiseled and not only has he gained some new ink too. We saw him take his first tentative lick of a cock when we paired him with Rex and while he wasn't converted to the pole slurping fan club, we did manage to lure him back to join Damien and Shane for the infamous Valentine Three-Way then he sadly announced his retirement though his fan mail continued to pour in. We were thrilled to when he said he felt like making a ?cum back? and he said he had a surprise for us which we thought was that new, thin patch of chest hair. Before the pants are open, the shoes are taken off or even the belt is unbuckled we can see Aiden hard piece with a grab thru his jeans and without hesitation, his one eyed wonder is popped out thru his boxers as fat and hungry as ever. In fact, the only part of his body that did not grace our lens in record time was the one part he had never shown, he was always a guy with ?look but don't even think about touching? as the motto for his backside and it seems a crime that such a perfect set of vanilla delight was never touched. With a knowing smile and a commanding stance, two fingers...count them...2 fingers, went from his mouth to his and we soon buried deep in the ?no man's land? of his ass. We're not sure if he's ready for more, but stay tuned...any guy who says good bye with cum dripping from spit soaked hand is one we're about wave off to easily!",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    }
  ],
  "release_date": "2005-12-10",
  "scene_id": 55537,
  "tags": [],
  "title": "Aiden & A Bettin', Scene #01"
}