{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We knew that Diamond Dick, with 8? of bad boy dick and The Tin Man, an ever horny devil with a constant need to seed, had done more then their share of tag teaming a girl together. Of course the stakes went up a notch when they brought Dirty Harry in for the Breeder Three Way and they all dropped trou, piled into bed together and and jerked their balls dry. Diamond Dick and the Tin Man said when they get horny enough, they would fuck anything that moves and we set out to find out if that was true when it was just the two of them. Diamond Dick was very nervous at first and even as the Tin Man was chowing down on his buddies bone, without a girl there, that cock stayed limp and we wondered if miss calculated the chemistry between the two of them when all of a sudden, Diamond Dick lived up to his name with that throbbing eight inch pole standing straight up as it came to life in the Tin Man's grip and The Tin Man's own dick was standing at attention as it had been all along.  The Tin Man took one look at decided to use his friends pole at a ?Sit and Spin,? take a seat and grinding down on Dick's dick all the way to the pubes, bouncing and riding before they sprawled out next to each other, aimed their cocks at each other's crotches and blasted each other with an avalanche of jizz.  We had started to put the tapes away, happy with the footage we had captured when we looked up to find not only were they were both standing up' both their cocks were standing at attention as well. They pulled the mattress off the floor and fell onto each other and surprised us once again, a tentative kiss turned into an out and out session of tonsil hockey. Watching some porn, the Tin Man slipped on a condom and without so much as a word, Diamond dick got up and leaned against the wall as the Tin Man went slowly but steadily inside his beer buddy's backside before moving onto all fours where Diamond Dick jacked his own cock while riding the Tin Man's cock.  Then, settling back side by side on the mattress, looking at each other this time instead of the movie, we prepared for the second cum shot but in a move that left us speechless, Diamond Dick moved over, grabbed his knees and took every inch of the Tin Man's meat like hungry hole and passion turned to action as they both worked up a sweat then worked out a load, leaving the Tin Man spent and Diamond Dick covered a double helping of gravy. Thanksgiving came a little early that day in the studio and from the Tin Man, Diamond Dick and all of us at Circle Jerk Boys, best wishes for a Happy Thanksgiving.",
  "models": [],
  "release_date": "2005-12-24",
  "scene_id": 55534,
  "tags": [],
  "title": "Double Toppings, Scene #02"
}