{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "One look at this tall, slim 19 year old California boarder with that olive skin, sitcom star face and rock star hair, we were already smitten and that was before we knew that lump in his baggy, low riding jeans wasn't just a cell phone, but a long, hungry bone that any porn star would be proud of. Like any skirt chasing college guy, Ethan is more than ready for any chance dip his stick, but there was a hunger to get in touch with his inner-porn star in record time. Even in his jeans, we could tell he was boned almost from the start and he set out to make the most of this opportunity, turning the camera lens from a mere piece of equipment into an object he showered with complete seduction.With Ringo's hair, Olive skin like Paul and his body shaped like John's, he's like having three of the fab four right in front of us with that dripping dick a more then acceptable stand-in for George.  He doesn't just take off his wife beater, but rather peels it off slowly as if he is unveiling a smooth, fine present and then teasingly pulls his belt open as if he knows we think it is the Gates to Heaven! He slides down those grey briefs, his cock already hard before looking down with reverence at his favorite toy jutting out under a thick coal black bush and resting on top of two swollen eggs, already heavy in anticipation. There is a curious mix of initial shyness that quickly passes and he offers the prized cock forward before standing up, turning around and giving us a glorious view of those untouched, golden ass cheeks with that cock hanging heavy down in the middle like a thick tree branch dripping sap. he fists his cock so furiously, the camera almost can't capture the rhythm of his hand as his ultra lean abs ripple like ocean current in a storm, putting the push from the top and pressing down to seeming his toes and he finally leans back and uncorks a tidal wave of sperm that covers his stomach and drips off his nipple as it still oozes from the quivering head.  ?We Can Work It Out? may have been written for a quartet but Ethan's solo version definitely has its charms!",
  "models": [
    {
      "name": "Ethan",
      "person_id": 28199
    }
  ],
  "release_date": "2005-12-31",
  "scene_id": 55532,
  "series": "Beetle Juice",
  "tags": [],
  "title": "Beetle Juice, Scene #02"
}