{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "All we have to do is say their names and you'll be grabbing the lube, opening your jeans and setting the video player to full screen size:  Aiden, with an 8.5? cock and a teen idol face. Anthony, our serviceman with the biggest artillery in the platoon. Rex, with an ultra fat fuck pole that never goes soft.  And Sebastian, the jock with the fuck-me eyes, fitness model bod and world class dick that is a ticket to paradise. It has been a few weeks since we have seen Sebastian, a few months since Aiden was here and more than a year since Anthony or Rex dropped trou. There's only one thing that could top getting them back ? we have them all back at the same time in the first ever CJB All Star Jack-Strava-Ganza. This is the ?guy's night out? you have only dreamed about ? until now!Anthony's fans will not be disappointed; he is even beefier than before, broader and more pumped, and his 8? inches are swollen and sticking out in the air while everyone else is still fumbling with their pants.  In contrast, Rex is a leaner, even sexier version but with the same old hormones.  Sporting the biggest tent in his boxers, he is the second one naked, and with that trimmer midsection, those angel wings make a perfect ?v? and his massive cock has never been so hard or looked so long.  Ever the helpful citizen, Aiden couldn't resist helping Sebastian out of his shirt and certainly a body that perfect should be obscured as little as possible.  Anthony passes the lube down the line and the stroking party begins in earnest. Aiden couldn't resist giving Sebastian's cock a helping a hand, but when our ?I will only watch? jock reached over and returned the favor, we hoped maybe our quarterback might be willing to try out a few plays from the other team's playbook...and we were right!Sebastian's cock found its way into Aiden's mouth, and damn if Aiden didn't take the huge spear right down to the balls.  After some rubbing of Aiden's still untapped ass, Aiden goes back for seconds on Sebastian's cock while Rex and Anthony stroke away. The site of those guys laying in bed, their biceps flexing as they stroke their meat, was only eclipsed by something we never expected to see. Sebastian leans over and gives Aiden's dick a good lick, and then another, using that big cock for some serious tonsil hockey before standing up and planting a good solid kiss on Aiden's mouth - and our mouths fell open.  All the guys line up and, to a chorus of the baritone moans times four, they each fire off one after another like a precious drill team's Independence Day salute! While all good things must come to an end, very seldom does the ending have this much good cum!PS: We're not waiting for the Fourth of July to see what happens when the fireworks flybetween Sebastian and Aiden when they are on their own.  Stay tuned and we promise. . .we'll keep them cumming!",
  "models": [
    {
      "name": "Anthony",
      "person_id": 27804
    },
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Rex",
      "person_id": 28167
    },
    {
      "name": "Sebastian",
      "person_id": 30166
    }
  ],
  "release_date": "2005-12-03",
  "scene_id": 55540,
  "series": "Four Handed Jizz",
  "tags": [],
  "title": "Four Handed Jizz, Scene #02"
}