{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We met first the Tin Man a few weeks ago when the handsome face, always hard dick and that ass that wet dreams are made of rocked our world.  He sent our way Dirty Harry, a Brad Pitt look alike - strike that, we just wish Brad was this hung. We then got them all together with their pal Diamond Dick for a nervous, restrained Breeder Three Way. They all seemed to be holding back, not wanting to be the one to seem to be getting into too much. I knew getting them back two at a time might cure that stage fright and lead to the fireworks we so wanted to see and will you even be glad I was right! There's nothing we love more at CircleJerkBoys.com then when the planets align just right and a breeder guy, or two, or three happen to just land in our lap and we can get 'em naked, put them together and see what happens when the call of cash and hormones alter that little voice in their heads saying ?no way it's a dude? to ?Fuck yeah...Mikey Likes it!?They started out a little nervous, giggling a bit as they undressed each other before the Tin Man's fingers went to work giving Dirty Harry a rub down that sent lightening bolts to both of their crotches as soon their boxers were down, there dicks were up and damn if the Tin Man wasn't chowing down on Dirty Harry's thick 7 1/2 inches like a convict savoring every morsel of his last meal before facing the electric chair.  Dirty Harry returns the favor, rubbing that bloated leaking dick over those quivering white mounds of the Tin Man's ass cheeks before getting on his knees smoking his buddy's pole.  It was obviously this was the first time his lips ever touched another cock - but he didn't seem to mind.  The Tin Man rewarded his buddy as his hand made his way to Dirty Harry's own equally delectable untouched ass before they stop, look at each other and do something we almost never see...THEY KISS!  As much out of curiosity as passion but they went back for seconds before settling in as Dirty Harry cums right on the Tin Man's chin and down his chest and he soon erupts in a load of his own that leaves his whole body frosted like a birthday cake. There are more stories in the Motor City folks so stay tuned, you ain't seen nothing yet!",
  "models": [
    {
      "name": "Dirty Harry",
      "person_id": 30577
    },
    {
      "name": "Tin Man",
      "person_id": 28200
    }
  ],
  "release_date": "2005-10-22",
  "scene_id": 55551,
  "series": "Babes In Boyland",
  "tags": [],
  "title": "Babes In Boyland, Scene #01"
}