{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Not long after the Tin Man showed off his amazing ass and rock hard cock, he said he had a friend who looked like Brad Pit and he sent Dirty Harry our way. He called back a second time to say he also had a buddy with a huge cock and untapped wild streak and that's how we met Diamond Dick.The it was our turn to make a call and see what would happen if we rounded up a pile of cash, a mountain of beer and the hottest porn we could find and get all three of them to jack off together. With plenty of persuading, more so from the land lord then us no doubt, they finally agreed for a trio whack! There is a playful innocence and a more then just a touch of boyish curiosity as they slowly undressed each other, peeling each others shirts off and exposing three muscular, smooth chests.  Then they actually tugged each other's boxers off. There was a chorus of nervous giggles as clearly this was the first time they had been boned in front of each other but there's no faking a boner and damned if all three of them didn't have wood right the jump street.  See the three of them laying back, three solid bones rock hard, throbbing, and leaking and three swollen, bloated nut sacks and each of them sneaking glances what their buddies were packing when they thought no one could see was a sight to behold.  The Tin Man was the first to but, his thick white jets shooting high in the air, followed by Diamond Dan who rolls on his said and lets loose a mega load from that mega dick all over his friends thigh, making Dirt Harry live up to his nickname in more ways then one. Wasn't long before Dirty Harry let his nut go like a fire cracker. We followed them as they all hoped in the shower together and there cock were half hard by the time they were done, yet they were rinsing and soaping up just like the team after the game.We're going to see what happens when get them together two at a time so stay tuned folks...there are at least a couple of chapters left in this story!",
  "models": [
    {
      "name": "Diamond Dick",
      "person_id": 28138
    },
    {
      "name": "Dirty Harry",
      "person_id": 30577
    },
    {
      "name": "Tin Man",
      "person_id": 28200
    }
  ],
  "release_date": "2005-09-24",
  "scene_id": 55560,
  "series": "Breeders Of The Pack",
  "tags": [],
  "title": "Breeders Of The Pack, Scene #02"
}