{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We started with two of our your favorites; the always horny, ever hard and very hung Rex and Damien and called our lucky hetro hoping pal Shane to see, when the beverage is that cold, the porn is that hot and the cash is tempting, if the breeder's mantra of a 'hole is a hole' applied even when we made a last minute substitution to playing field. The result, we took these straight guys to their limits, and beyond!With his military haircut & tight smooth body as the perfect frame to showcase that flashlight, thick eight inches and that meaty 5'7' frame, we knew he was horny enough to let Aiden suck his mighty meat, but was he man enough to fill a hole if there was a pole on the flip side? Dark and brooding Damien was an instant favorite who rocketed to the CircleJerkBoys's Hall of Frame when he explored uncharted waters with Aiden and Shane in 'Three's CUMpany' and knew he was the ideal choice to rude shotgun with Rex.It wasn't long before Shane was on his knees, fishing those twin eight inch towers out of their pants and into his hot, eager mouth. He took those throbbing pole and rubbed them together, looking up to see the expression on Damien's and Rex's faces as they went dick on dick for the first time. That seemed to change the light to green as soon Shane was licking their flexed biceps, flat abs, pumped pecs while they yanked down his boxers to get to the business end of this horny boy. Each one smacking his cheeks like a prized catch at a fox hunt, even letting out a nervous laugh as they prepared to try something brand new, Shane sucked down that huge pole of Rex while Damien gave him that pole like a wild stallion then Shane hoped on Rex's cock and gave that breeder the ride of his life.  But don't worry, Shane was able to cash in his frequent flyer bonus in the form of heavy duty twin facial as Rex and Damien knelt at his head and covered every inch of that baby face with the hottest souvenir of all....straight sperm!!  ",
  "models": [
    {
      "name": "Damien",
      "person_id": 30043
    },
    {
      "name": "Rex",
      "person_id": 28167
    },
    {
      "name": "Shane",
      "person_id": 29547
    }
  ],
  "release_date": "2005-05-28",
  "scene_id": 55592,
  "series": "Three On A Snatch",
  "tags": [],
  "title": "Three On A Snatch"
}