{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Ganador is an unusual name, and this 26-year-old wonder from down under is an unusual guy. Looking like the star-crossed son of Adam Ant from the 80's, mixed with the bone structure of a male model in a perpetual-living infomercial for the latest edgy music gadget, Ganador proves to be as wild as his hair and just as off the beaten path. This Aussie did a quick change as we adjusted the lights, grabbing a CircleJerkBoys.com tank top and pulling on some green gym shorts very high, which in combination with that Einstein 'do, may just establish a new trend called ?geek heat.? Just as quickly, and seemingly moving in slow motion, he strips them right off to reveal a tight, naturally-defined torso & abs, and quite the round-hard butt in a pair of tighty-whities. Apparently, Ganador likes being naked as much as possible, as those shorts are history just as quickly. Suddenly, we are face-to-face with a very thick, tall jungle of dark pubes and a cock that while still soft, is one fat slab of meat.Looking like he has a cockscomb on his head, he begins to gently massage the cock down below as he does a round of seated Yoga. Working every muscle from his neck to his toes, he uses his body as a vehicle to feed his hungry fist more and more cock with each movement. Ganador then piles up the pillows and begins to go for a ride, his hips undulating back and forth with the precision of a man on a very well-planned mission. Ganador doesn't just dry hump, he literally makes love to those cushions, drawing pleasure as if he was really deep inside a hole. We move in to get a closer view of that very fuckable butt of his, dusted in brown hair and just begging for some attention of its own. As he catches us, he flashes a wild look into the lens that says, ?look all you want, but don't touch,? or was that really a dare?Standing up, Ganador stretches to pump up the lean line of every one of his muscles and lets us enjoy the show of a very well-honed body, devoid of any fat. He moves in a Zen-like sexual trance all his own where he is both the charmer and the snake at the same time. Moving to the couch for the final assault, his cock now becomes the center of his universe as he pounds away at his tool with a fierceness that is almost primal. Grabbing the shaft so hard it seems like the head will go flying across the room, what does go flying instead is a very thick load of jizz that slithers down his pole while he stares right into the camera with one of those smoldering looks from a Dolce and Gabbana cologne ad. We are wondering if he was thinking he could use some help next time.",
  "models": [
    {
      "name": "Ganador",
      "person_id": 28172
    }
  ],
  "release_date": "2005-02-26",
  "scene_id": 55622,
  "tags": [],
  "title": "Einstein Jr., Scene #02"
}