{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Bobby Rail is back this week and he's looking better than ever. His hair's getting longer and frankly there isn't a look this bad boy can't rock. For those unfamiliar with this sexy Florida native, Bobby is 24 years old and comes to us from West Palm Beach. We also have another familiar face for you this week. Chicago's own Ryan Middleton, now 19 years old, is also back for more. Bobby is still with the same girl he was with last time we had him here. In fact, that 'special' girl is a few blocks away from our studios on the beach. She's waiting for her man to finish. That's one understanding girlfriend. Ryan doesn't have a special lady in his life (other than his Mom.) Awwww. They both have future travel plans and both have New York in their sights as well as the West Coast. They're both adventurous and we asked them where they would want to have sex that they haven't yet. Bobby wants to be able to fuck on a rooftop. 'It would have to be a really tall building' Ryan one ups that scenario and says he wants to be able to fuck on a roller coaster. Hmmm. Now there's a visual and a possible 'Just in-Breaking Story' once they discovered where the two crazy kids eventually land. lol Well, we're not sure when Ryan will get a chance to ride that ride; but today Bobby will prove to be a hotter and more exciting ride than any rollercoaster. ...ALL ABOARD!Ryan is sitting on his laptop surfing for porn and getting a chubby while Bobby is relaxing on the couch. Idle hands are the devil's playground and soon his cock isn't enough. He walks over to Bobby and lets his hands do some exploring on his cock instead. He rubs Bobby's cock till it starts to wake up. Bobby isn't far behind, waking up a bit startled but not against the idea entirely. Bobby takes off his shirt as they start to kiss. They help each other out of their shirts as their hands start to roam their muscular bodies. Once their pants come off, Bobby gets Ryan's boner out and goes to work on his woody. Ryan sighs as Bobby takes his hard cock deep in his throat. He swirls his tongue around the throbbing shaft as Ryan's hand helps guide him up and down. Ryan stands up to give Bobby better access to his meat. Bobby kneels before him as Ryan starts to face fuck him. Bobby then gets up and drops his briefs and watches as Ryan returns the favor. He sucks that thick cock into his mouth and does his best to accommodate every inch of it. Bobby groans as he finally gets some attention on that aching cock of his. Ryan's only getting started and there's more in store for Bobby.Ryan gets Bobby on all four so he can explore that sweet ass he'll soon own. He spreads those smooth cheeks apart and teases that tight ass with his fingers. He slips his digits in and makes Bobby that much hornier for the fucking that's coming. Ryan then sits back and watches as Bobby sits down on his thick cock. Riding that meat in a reverse cowgirl; Bobby starts to ride faster as his ass gets used to its intruder. He then swings around and rides it facing Ryan so he can watch his face as he takes that hole. The chemistry between these two is on fire and soon Ryan has Bobby bent over the couch. Ryan slams his cock back inside that hot ass. 'Take my dick' he grunts 'take all of it!' Bobby just groans as he begs for more. Ryan rams that dick hard and deep. Ryan isn't playing around and he is fucking Bobby's hot ass with everything he's got. Bobby is bent over and taking every deep thrust like a champ as he gets his ass railed. Ryan's balls slap away at that ass and soon these two are ready to explode. They sit back, side by side, and jerk their loads all over their furry happy trails. Whew. Damn that was some hot fuckin'. <evil grin>",
  "models": [
    {
      "name": "Bobby Rail",
      "person_id": 28379
    },
    {
      "name": "Ryan Middleton",
      "person_id": 28351
    }
  ],
  "release_date": "2010-08-13",
  "scene_id": 55735,
  "series": "Riding On Rails",
  "tags": [],
  "title": "Riding On Rails"
}