{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have the ambiguously hot duo. The first is a recent find that our members can't seem to get enough, Mr. Gavin Waters. Gavin is 'in his twenties' and from 'the South'. Hmm. How mysterious. Ok. His co-star this week is none other than Aiden Lane. Aiden is 'also in his twenties' and from Fort Lauderdale. Florida is 'the South' geographically; but if you've ever been here?it's really not. We asked them what their favorite holiday was. Aiden answers 'Halloween.' Gavin concurs that happens to be his favorite as well. What are the odds? We then asked these guys if they could enroll in continuing education courses what would they be. Aiden blurts out 'Sex Ed!' ...Ah, that's our Aiden. Gavin thought about it for a while and wouldn't mind taking some massage therapy courses. Aiden reconsiders and says he'd like to get his pilot's license after having taken a helicopter ride through the Grand Canyon. Aren't you glad he didn't say massage therapy? Finally we asked these two what their fort?s are sexually. Gavin without hesitation answered he loves to bottom. That works out really well; since Aiden says his favorite thing to do is to fuck a hot ass. Foreshadowing perhaps? ?ya think!They start to kiss passionately as Aiden's hand starts to explore Gavin's defined chest. Aiden's tongue is next as he starts to lick and suck on Gavin's nips. Gavin then helps Aiden out of his pants as he frees Aiden's rock hard cock. Aiden gasps as Gavin sucks his cock to the hilt. Gavin takes his time as he slowly savors every delicious inch that Aiden has to offer. Gavin is on his knees suckin' cock with his sweet ass on display. They get back to kissing as Gavin stands up to let Aiden get some dick too. Aiden pulls down Gavin's pants and starts to work on that thick, uncut cock. Gavin groans as Aiden sucks on his balls and works his throbbing cock. Aiden is rock hard as he sucks Gavin's cock. He looks up at him as he licks his knob and twirls his tongue around Gavin's shaft. ?Ahh, suck that dick? Gavin moans as he watches Aiden kneeling before him. Aiden strokes his hard cock sending him into orbit as his dick pulses at his touch. Aiden then gets Gavin on all four as he spreads that hot ass open and slides his tongue inside. He rims that hole and slowly fingers it getting it ready for more.Gavin's eyes are rolling back into his head as he gets that hot ass tongue fucked. Aiden strokes Gavin's cock while he eats his ass. When Aiden is ready for that hole he moves into position and slides his hot cock into that spit lubed hole. Gavin's ass is hungry for a good dicking and that hot ass gives way for Aiden's rock hard cock. Aiden is soon bouncing his nuts off that hot ass. Gavin wasn't kidding that hot ass of his was made for fuckin and Aiden's cock is reaping all the benefits. Gavin moans in ecstasy as Aiden pounds away at that ass. Aiden then moves the party to the couch where he gets Gavin on his side; lifts his leg and slides that cock in for more fucking. He fills that ass as he jacks off Gavin's uncut meat. Gavin's abs look amazing as they flex as he's getting that ass stuffed. ?Want me to ride it?? Gavin groans as they reposition themselves on the chair. Gavin sits on that thick cock for more and his own cock bounces like a trampoline as he rides Aiden's cock hard. Aiden has an amazing view of that sweet ass taking his dick deep. Gavin's getting close and Aiden orders him to cum on his face. Gavin obliges and as he unloads on Aiden's face, Aiden latches his mouth around his knob and milks out the last of it. As he rubs that uncut cock all over his cum covered face, Aiden explodes his own load all over his smooth navel.",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Gavin Waters",
      "person_id": 28347
    }
  ],
  "release_date": "2010-08-06",
  "scene_id": 55733,
  "tags": [],
  "title": "Waters Runs Deep, Scene #01"
}