{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It's hot in the house this week with Tucker Vaughn back for more. Tucker isn't alone; he's brought along an adorable newcomer. For those of you unfamiliar with Boston's own, Tucker Vaughn, Tucker is 19 years old and is making himself quite the name in the adult world. His costar today is Connor O'Reilly. Connor is 24 years old and from Tennessee. He still lives there and tries to be the personification of the perfect southern gent. We asked these two what if anything would they need to work on getting under control. Well, we were hoping for dirt but all we got out of Tucker is ?Ice Cream, I eat too much of it? and Connor says he needs to get better at not spending money as much. We asked these two how they felt about cocks. Is bigger better? Connor immediately says bigger is better. ?I like bigger, but if they have a regular size and really knows how to use it it can be just as good as a big dick?or better!? Tucker chimes in. ?I agree? concurs Connor with a rather interesting grin. Hmm... We then asked these two if they'd ever tasted their own jizz. Connor says he has but it was kinda by accident. Tucker then says?wait for it??I've tasted it on purpose. I did one of those where my feet back...right into my own mouth? as he laughs aloud. Well, our next question was about going green; but...These two start off playing around as they Indian wrestle their way into a heap of trouble. They land in a ?heap? on the couch as they give themselves ?that? look. You know the one. They start to kiss slowly as they both give into their desires. Connor stands and takes off his shirt and Tucker can't help but touch his defined abs. Connor pulls him up off the couch so they can continue making out. Their chemistry is playful and infectious as they continue in the dance. Back on the couch, Connor takes Tucker's cock out through his boxers and finally gets to briefly taste it. Then it's his turn to Show & Tell as he hauls his own massive cock out. Tucker immediately goes for it, wrapping his lips around Connor's thick dick. Both of these studs are naturally smooth and deliciously defined. Connor has his hand on Tucker's head as he coaxes him to take his big dick all the way. ?I love your cock? moans Tucker as he continues to work that meat. Tucker then lies back so he can get some more appreciation on his own dick. Connor gladly kneels and gives his playmate's cock another spit shine.Connor's ready for more as he fingers Tucker's hole with lube. He places his rock hard cock at Tucker's pucker and slowly slides inside. His thick cock is soon buried inside Tucker's smooth ass. He slowly fucks away as Tucker moans and watches him fuck him. Connor slides his dick deep inside Tucker causing him to gasp before beggin him to do it again. ?You like that?? teases Connor as he continues to pound his ass. Then Connor switches things up and bends Tucker over. He slides his cock back in that sweet ass doggy style as Tucker groans for more. An overhead shot shows us just what the view is from Connor's perspective as he watches his thick dick disappear inside that hot ass. Tucker can't get enough of this country cock and he begs Connor to ride his dick. Connor, not one to disappoint, obliges. Sitting back on the chair he watches Tucker sit down on his dick. Once that hot cock is buried deep, Tucker starts to ride that meat like he's in a derby. Connor just sits back and gets his pole ridden as Tucker grinds away on his dick. ?Aww, I'm gonna cum? grunts Tucker as Connor pounds up into him even harder. He unloads his thick load all over himself. Connor then sits back and double fists his meat 'til it too unloads its content on his faint happy trail.",
  "models": [
    {
      "name": "Tucker Vaughn",
      "person_id": 27982
    },
    {
      "name": "Ryan Middleton",
      "person_id": 28351
    }
  ],
  "release_date": "2010-08-20",
  "scene_id": 55737,
  "tags": [],
  "title": "Tucker In, Scene #01"
}