{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We knew 23-year-old Brad was a stock broker in training by day, but even in his dress shirt and grey flannels we could tell there was the lean, well-worked body of an athlete underneath. Even in his baggy work pants - the way the fabric flowed in two perfect arcs on the back - we could only image just how perfect those glutes would be and from the bulge in front, clearly Brad was packing some hidden assets that were multiplying even as we watched.  As he unbuttoned his shirt and that flawless, butterscotch-colored skin came into view, it wasn't like he was getting undressed so much as he was unwrapping a piece of candy - and we definitely had a sudden sweet tooth!Naturally broad shoulders and an imposing set of pumped arms flank a chest that epic poems should be written about. Two finely honed slabs join together for a perfect valley in the center of his chest, while two hard nipples encased in a single ring of black hair dot the landscape before heading down over a set of abs so tight and chiseled, they are like a treasure map of muscle with the real holy grail popping open the buttons of his boxer briefs.  Hauling that meat right out of the leg of his pants, he could not wait one more second to give that dick the attention it was craving.With every muscle at attention, he looked like an amateur boxer rubbing off a load right before a fight.  Standing up, we could sense his excitement at being so hard and naked in front of a camera.  His cock was swollen to the maximum, yet his nuts were hard and tight and his hands even enjoyed a little touchy feely right in the center of those perfect glutes.  He works that cock like a man on a mission. You can tell by the look on his face that he is his riding the crest of sensations so powerful that, much as he would like to prolong them, the need to seed wins out, and he squeezes his out in a round of cream filling that lands between his pecs and drips down those abs.  Apparently no one told Brad not to play with his food, because that white stuff gets rubbed into his chest before he gives it a good long taste while staring into the camera with a look that still makes us tingle.",
  "models": [
    {
      "name": "Brad",
      "person_id": 29260
    }
  ],
  "release_date": "2003-05-10",
  "scene_id": 55739,
  "tags": [],
  "title": "Gym Dandy, Scene #01"
}