{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Crank up the A/C Fellas; it is going to be a scorcher this week. As if summer wasn't hot enough; we're bringing you one hell of a Holiday update. Hot and Hotter are in the house, as Aiden Lane and Parker Brookes share a set. Aiden Lane, for those of you who don't know, is 22 years old and originally from Los Angeles. He now calls South Florida home. Parker Brookes is also 22 and from Alabama. We've wanted to get these two together for a while now; and it looks like stars will fall. Who knows? They may even write a song about it. Thinking along the lines of 'hot', we asked these two if there was any particular fantasy they hadn't had a chance to explore but wanted to. Parker said he's never had the chance to get into that Mile High Club. That's something he's like to do. Aiden would love to find a really hot girl and a really hot guy and make an Aiden Sandwich. Now there's a visual. We asked these two what the biggest turn on for them was on, as well as off camera. ?Biggest turn on for me is chemistry; you gotta have chemistry? says Aiden. Parker concurs and says chemistry is everything. Well, chemistry won't be a problem this afternoon; so let's turn up the heat and give summer a what for!Parker starts off doing sit ups when Aiden walks in and offers to spot him. It isn't long before they're giving each other the look. You know the one. They start making out as Aiden starts to undress Parker and explore his smooth chest. Aiden picks Parker up and takes him over to the couch, where he can better explore all that Parker has to offer. He undoes Parker's jeans and tugs them off. Parker then returns the favor as Aiden moves back to the incline bench. Parker slips Aiden's rock hard cock out of his briefs and goes down on him. Aiden gasps as Parker wraps those sexy full lips around his throbbing pole. Parker takes Aiden's cock all the way down. Aiden loves the attention he's getting. They go back to making out for a bit before Parker wants some help on his own meat. Aiden gladly obliges as he goes to work on Parker's pole. Parker's cock was already aching with anticipation as Aiden gets that skilled mouth on it. Parker watches as Aiden worships his rock hard cock. They both want more cock, so they get into a hot 69 on the bench as Parker sucks Aiden's cock and Aiden tastes the sweet ass he'll soon be inside of. Parker's writhing in ecstasy as Aiden tongue fucks his hole. Aiden's tongue + Parker's hole = Trouble!Parker straddles Aiden's cock as he slowly impales himself on that hard cock. It takes a few, but he finally gets all of Aiden's cock in him. Once he's ready, Parker starts riding that dick as Aiden helps bounce him on his cock. Aiden jacks Parker's cock as he watches him ride his. An over the shoulder shot gives us a spectacular view of Aiden's thick cock sliding in and out of Parker's tight ass. Aiden then bends pretty boy Parker over and takes him doggy. He slams away at his ass as Parker takes it like a champ. Aiden means business as he continues to rail that hot ass. Aiden then moves the party back to the bench where it all began. He lays Parker back so he can get that cock in him and fucks him missionary. Parker strokes his cock as Aiden pounds his ass. Aiden's thick cock continues to stretch Parker's hole. It's getting them both closer and closer to climax. ?You gonna cum for me?? Aiden coos. Who could refuse such a request? Parker jacks his cock faster as Aiden pounds him deeper. It doesn't take much with Aiden impaling him to explode all over his sexy happy trail. Aiden then pulls out and sends his own batch flying way over Parker's head and coating the rest of him in the process. ...Happy Labor Day, Boys!",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Parker Brookes",
      "person_id": 28348
    }
  ],
  "release_date": "2010-09-03",
  "scene_id": 55813,
  "series": "The Big Cum On",
  "tags": [],
  "title": "The Big Cum On, Scene #02"
}