{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The sun always shines brighter when we have our very own Golden Boy, Bobby Rail in the house. Yes, we have our local 24 year old hottie back to give us more of what this blonde stud with the surfer locks brings to the table. Today Bobby brought along more than just his delicious self; he brought along a friend?a hot one! Krys Perez is joining our ?collection?. Originally from Austin, TX, Krys is 21 years old. Krys is a sexy hottie with looks that scream ?trouble?. We like! They both agree they wouldn't mind learning a second language; and both think Spanish would be their choice. We then asked these two if they could have 2 front row tickets to any concert, what concert would it be and whom would they bring with. Bobby would want to go see Peter Frampton with his Mom. Awwww. Krys follows suit and says he'd like to get tickets to a Cher concert and take along his grandmother. Makes sense, Cher and his Gram are probably about the same age.  We digress. We wondered what sexual act these studs felt they were best at. They both affirm their best talents lie in the oral department. As far as which sexual act they prefer receiving, Bobby likes getting head. When it comes to Krys, he said it best as he grinned and announced, ?I just like to FUCK!?...Enough said.Bobby is working out at home getting that bod of his in peak condition. He strips his tank off and starts to admire the results. As he lays back to do another rep, Krys walks in and offers some help. Krys slowly starts to rub his dick which seems like it too could use a work out. Bobby is definitely game as Krys undoes his jeans and pulls out his cock through the fly of his boxers. Bobby takes to that growing cock like a calf and nurses on Krys' cock til he's rock hard. Krys bites his lower lip as he revels in the new sensation. Bobby swallows every inch of it with ease as Krys runs his fingers through Bobby's locks. Bobby then gets up and pushes Krys back onto the couch where he helps him out of his jeans. They start kissing and soon Bobby finds his way south to work on Krys' boner some more. Krys' head is in a whirl as Bobby services his throbbing cock. Krys pulls him off his cock so he can kiss Bobby some more before having him stand up. He undoes Bobby's shorts and gets some cock of his very own. He takes Bobby's thick cock in his mouth and gets to work. Bobby just groans as he sees this sexy stud on his knees, sucking cock looking up at him with those bedroom eyes.Krys sucks Bobby's meat till he's ready for more. 'Let's see that ass' he grins as Bobby bends over. Krys spreads his smooth cheeks before diving in tongue first. Bobby goes wild as Krys tongue fucks that hot ass he'll soon be fucking. Krys licks that hole and teases it with his fingers. Bobby is rock hard in anticipation. He can't wait to give that ass up. He won't have to wait long as Krys stands into position. That hot ass is more than ready as it immediately gives way. Krys' thick cock slides in deep and starts to pound away at that spectacular ass. He fucks him doggy till he gets that hole used to his meat. He then gets Bobby on his back so he can slide back inside missionary. Bobby strokes his aching cock as he watches Krys fuck him deep. Krys slowly buries his cock inside as he gets the attention his thick cock needed. Krys isn't done though and he has one more thing he wants to try. He pulls out and sits back on the couch so that Bobby can ride him. Bobby impales himself on that cock again unable to get enough of that dick. He rides it hard getting them both closer and closer to climax. They then sit back side by side and jack off, exploding massive loads all over themselves.",
  "models": [
    {
      "name": "Bobby Rail",
      "person_id": 28379
    },
    {
      "name": "Krys Perez",
      "person_id": 28413
    }
  ],
  "release_date": "2010-08-27",
  "scene_id": 55811,
  "tags": [],
  "title": "Taking It On The Chin, Scene #02"
}