{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Texas is in the house today as we add a new face to the CircleJerkBoys roster. Brian Summers is here today. We're certainly glad to have this sexy 20 year old, San Antonian with us. Helping us welcome Brian onboard is a familiar face whose lean frame, thick dick and bad boy appeal keeps us wanting more, Mr. James Hamilton. James is 26 and he's originally from Kansas City. They're both enjoying Florida and they're both electronically addicted. Brian couldn't live without his computer while James prefers his cell phone. ?You can do everything on your phone these days?. He has a point. Brian lost his cherry when he was 11. Talk about adventures in babysitting. His older baby sitter had to have some Brian. James was a bit older at about 14. Thinking back it was the worst experience ever. ?If I could go back and do it over I'd put it in? he laughs. These days James likes kinky fetish sex: hand cuffs, restraints, etc. Brian loves eating pussy more than anything. Well, we're not sure what the Soup du Jour is and we don't have any 'Snapper Supris' on the menu either, but we do have plenty of Beef Hamilton. Bon Apetit.Brian sits back tugging at his cock; James does the same thing on the couch. These boys are horny and in need of some relief. ?Come over here and check out what I got in my pants? teases James as Brian obliges. He starts to grope James' cock through his jeans as James stands and strips off his tee. His jeans are next as we get our first glimpse of his rock hard cock tenting his loose fitting boxers. Brian pulls them down and frees his massive 8?? cock. He licks the head before taking it into his mouth. James moans as Brian starts to blow him. Brian slowly savors that meat as he does his best to accommodate all the dick James has to offer. James teases Brian by slapping his boner up against his rock hard abs. Brian strokes his rock hard cock as he sucks on James' smooth nuts making James groan. Brian then sits back on the couch and spreads his legs wide to give James room to return the favor. James strokes his massive cock as he deep throats Brian's 8? bone. James sucks that dick like a pro and Brian's cock is rock hard and will soon want a lot more than that pretty mouth wrapped around it.James lies back on the floor as the sexy str8 boy slides that 8? cock home. James grunts and groans as Brian starts steadily pumping that ass missionary. The look on Brian's face says it all as his brows furl with a look of rapture that would make anyone want some of that ass. James is grunting with every deep thrust he's taking. James has a tight ass that is rarely given up. That tight ass is making Brian wanna fuck him deeper. He then switches it up by getting James to bend over. He pushes his thick dick back inside. Soon his balls are slapping away at that hot ass. A view from below gives us the perfect vantage as we watch that Texan cock stake its claim. Brian's hot ass moves in and out as he fucks James and this hot str8 boy looks delicious doing it. His cock is relentless as he continues stretching James' tight hole wide. He starts to pick up the pace fucking James faster as he holds his tight little waist. These two won't be able to hold off for much longer and as they near climax they stroke off side by side. James sends a heaping helping of baby batter all over his smooth navel while Brian cums in at a close second. (literally!)",
  "models": [
    {
      "name": "James Hamilton",
      "person_id": 27947
    },
    {
      "name": "Brian Summers",
      "person_id": 28412
    }
  ],
  "release_date": "2010-09-10",
  "scene_id": 55814,
  "series": "Straight Shooters",
  "tags": [],
  "title": "Straight Shooters, Scene #01"
}