{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have a special treat for you so grab your junk cuz this one's gonna wear you out. Richie Sabatini is back with us this week; and he's not the only one that's gonna make your blood pressure (among other things) ?rise?. Making his debut on CircleJerkBoys this week is Hunter Ford. We're excited to have Hunter here and in a few you'll see exactly why. Hunter is 22 and from Texas. You know what they say about those Texan boys. Richie is also 22 and he's from the 305. Miami is in the house! We asked these studs what they like to spend their money on when they get to shop. Richie is all about GUCCI. It can be shoes or wallets as long as it's GUCCI. Hunter is into sunglasses. He looks great in his Oakley's; but loves his Costa del Mar pair better for everyday use. We then wanted to know what their dream lover would look like. Richie wants a man: 5'8, about 175 lbs, nice arms, broad shoulders and chest, six pack abs with some hair cuz he likes men. Hunter wants a toned, tanned man preferably blonde. He likes some hair unless it's a girl then no hair. He likes girls better but he likes to spice things up and we're really glad he does. Speaking of ?spicing? things up, these two got a lot of that in their immediate future...Richie is hammering away as he does some redecorating. Once he's done he takes off his shirt so he can start his work out with Hunter. Hunter immediately notices Richie's new tattoo. A bold scorpion now adorns his navel. Apparently while out on South Beach with friends he got a friend to draw it out and he got it done. ?I'm a Scorpio. My birthday is in November so I always wanted to get one done?. Hunter asks if he could get a closer look. Once Richie gets closer Hunters hands roam elsewhere as they start to make out. Richie undoes his shorts as Hunter goes to work on his cock. He sucks it down his throat as Richie moans in appreciation. ?How does that taste?? he coos as he watches Hunter worship his thick cock. He then lies back on the bench as Hunter kneels to continue sucking on that rock hard cock taking every delicious inch of it. Hunter then stands so that Richie can return the favor. Richie pulls out Hunter's aching cock which is in need of attention. Richie gets almost 8? of Texan cock shoved down his throat as Hunter face fucks that sexy mouth of his. These two can't get enough of each other as they maneuver into a hot 69. As Hunter bends over Richie to suck that dick we get our first glimpse of that stellar ass of his. Damn! Richie's about to be one lucky guy.Richie sits on the couch as Hunter sits on his dick. Riding that Miami meat, Hunter starts to grind his hot ass while in a reverse cowgirl position. Richie reaches around and jacks his cock while he gets his own ridden. Richie then gets Hunter face down on the bench and slides his dick in for more. Hunter moans and groans as Richie taps that ass. Hunter can't get enough of that dick as he reaches back to spread his beefy cheeks. Richie then flips him over and takes the party to the floor. He slides back inside that hot ass missionary. He starts to fuck that hot ass deep and it's making Hunter rock hard. He starts to jack that thick dick off as Richie starts to fuck him using shorter and quicker strokes. That's gonna do the trick as these two start to moan and groan. ?Awww, you're gonna make me cum? moans Richie as he fucks Hunter faster and harder. Richie pulls out and unloads a massive cumfest drenching Hunter's smooth body with his seed. Hunter jacks his cock now covered in cum faster as he too is sent over the edge. He unloads his own healthy addition to the splatter all over his smooth canvas. Welcum to CJB, Hunter!",
  "models": [
    {
      "name": "Richie Sabatini",
      "person_id": 28328
    },
    {
      "name": "Hunter Ford",
      "person_id": 28415
    }
  ],
  "release_date": "2010-09-24",
  "scene_id": 55819,
  "series": "Scorpio Rising",
  "tags": [],
  "title": "Scorpio Rising, Scene #02"
}