{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Turn down the thermostat, fellas; it's about to get hotter in here. Back with us this week is none other than Gavin Waters. Gavin is looking as hot as always and this 23 year old never fails to please. He's the epitome of Southern charm. Speaking of charming, we have a new face to add to the circle today that comes from the west coast. Dylan Roberts is here and we can't wait to welcome him into the fold. Dylan is 21 and from that City by the Bay - San Francisco. We asked these two what drink would best describe their lives. Dylan says he just loves shots of soda str8 up. Guess this one hit the ground running as soon as he hit 21. <hick-up> 'He likes quickies' laughs Gavin. Gavin says he would go with Sex on the Beach or just add more beverage and make it an Orgy on the Beach. Now there's a drink worth looking into. We asked these if there was anything our viewers would be surprised to know about them past the usual assumptions. Dylan feels if guys take the time to know him he's very personable. So, don't assume just cuz he's hot he's got nothing to offer. Gavin just wants people to know he's just a laid back kind of guy and that he doesn't take himself too seriously. Well, we'll go with that and let's get this party started...Gavin is lying in bed and is tugging on his cock when Dylan comes knocking wondering what's taking him so long? Apparently there's more than basketball on Gavin's mind and he blushes as he confesses he wants to play with something else as he pulls Dylan into bed. They start to make out as they get this game going. This is a much better game regardless since everybody wins. Dylan licks at Gavin's pecs and smooth body as his own clothes get peeled off. Gavin's body is defined and Dylan pulls his uncut cock out of one of the holes in Gavin's jeans. Not just fashionable, these jeans are functional as well as Dylan gets a mouthful of cock to work. He sucks on Gavin's rock hard cock as he licks and savors that cock and foreskin. Dylan deep throats that meat while Gavin just moans in ecstasy. They then get on the bed and into a hot 69 so that Gavin can return the favor. He works Dylan's rock hard cock while Dylan continues nursing on his. All this foreplay is just getting these two hornier for a lot more than just oral.Dylan suits up and sits back as he watches Gavin ease himself onto his rock hard cock. Gavin's sweet ass soon envelopes his rock hard cock and the real fun begins. He helps Gavin as he bounces him on his cock. Gavin loves every inch of it as he grinds away at that California cock. Then they switch as Gavin bends Dylan over and delivers some southern hospitality. He fucks that ass doggy style as he slams that thick uncut cock deep inside out newest discovery. Gavin then moves Dylan back to his bed where he starts to fuck him missionary. Dylan holds his legs up in the air as he gives up that sweet ass to Gavin. Gavin pounds away at that hole as his balls pull tight. The chemistry between these two is obvious and at the rate their going it won't be long before they explode. Gavin fucks Dylan some more before pulling out and moving up to Dylan's chest to unload all over him. Dylan's chest becomes the target as Gavin drenches it with his thick load. Dylan then jacks his own thick load out all over his delicious frame as Gavin eggs him on. Mmmm. Fuck Basketball, that's the way to spend a lazy afternoon. ",
  "models": [
    {
      "name": "Dylan Roberts",
      "person_id": 28414
    },
    {
      "name": "Gavin Waters",
      "person_id": 28347
    }
  ],
  "release_date": "2010-09-17",
  "scene_id": 55817,
  "series": "Waters' Edge",
  "tags": [],
  "title": "Waters' Edge"
}