{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Well once again All Hallows Eve is upon us and this week we have two ghoulish little morsels that land us back in that ageless quagmire: Is he a trick?or a treat? Well, fear no more, for with that Southern drawl, those dimples and that thick country cock, you know Brandon Lewis ain't nothin' more than the Devil in a Sunday hat. One look at this fine 27 year old stud and you're tempted to do ALL sorts of things your Momma would not be too proud of. Go ahead, Live a little. Well, this week, Brandon is helping us welcome another treat to CJB, Michael Dora. Michael is originally from Orlando, FL. He is quite the package with a great smile, perfect hair and?wait for it?a thick 8' cock. Big things really do come in small packages. Michael made his debut on video on our brother site ExtraBigDicks and we know you'll love this insatiable 21 year old just as much. These studs both loved trick or treating as kids. Brandon loved the rich candy bars and Reese's cups; while Michael was more into sours. As for Holidays, Michael loved Christmas more so than Thanksgiving. He loves the cold weather. 'Does it get very cold in Orlando?' Brandon teases. 'Trouble' this one. lol Brandon prefers Thanksgiving because he loves to eat all the food he normally doesn't throughout the year. Well opposites attract and this afternoon we're gonna get to see just how much.Michael is reading a book when Brandon sneaks into the room wearing a skeleton mask. He scares Michael, who isn't sure what to make of the situation, half to death until the mask comes off. They kiss as Brandon begins to unwrap his ?treat?. Michael stands so Brandon can have better access to his growing crotch. When his jeans hit the floor we get our first glimpse at that sweet ass of his framed nicely in his orange jock. He then kneels to return the favor as he helps Brandon take it all off. Brandon's cock springs free as Michael goes to work. Brandon can only moan as Michael begins to swirl his tongue along the shaft. He takes as much of that big dick deep in his throat launching our Georgia boy into orbit. Brandon then feels left out as he unwraps Michael's thick dick. Brandon has plenty to work on as he opens wide for Michael's thick cock. Michael's cock is rock hard as Brandon nurses on it like a starved calf. He savors every inch of it before he lays Michael back on the weight bench and lifts those legs up. Michaels' hot ass?it's what's for dinner. Brandon dives in tongue first as he starts to rim that ass. Michael moans as he gets his hot hole ready for a good fucking. Brandon spreads Michael's beefy cheeks apart as he French-kisses that hole.Once that hot ass is nice and ready, Brandon stands and aims his raging cock at its intended target. He slowly pushes his thick dick into Michael's tight ass. Once it concedes Brandon starts to fuck that ass. His balls are pulled tight up against his cock as he repeatedly sinks his dick into that hot hole. Michael's own cock is rock hard the entire time he's getting fucked. Brandon looks down and watches as his cock disappears in and out of Michael's muscular ass. They then move over to the couch where Brandon sits back and has Michael sit on his cock. Michael obliges as he grins and bares it. His ass is getting stretched wide as he rides that dick and he loves every minute of it.  Michael then gets bent over as Brandon starts to fuck him doggy style. He holds Michael by the waist as he buries that dick deep. This position gets Brandon so hot that he suddenly pulls his cock out and unloads his thick load all over Michael's smooth back. Michael then sits back and jacks his own load all over his now happier, happy trail. whew. Trick or Treat? Halloween, both these boys are good 'nuff to eat.",
  "models": [
    {
      "name": "Brandon Lewis",
      "person_id": 27916
    },
    {
      "name": "Michael Dora",
      "person_id": 28420
    }
  ],
  "release_date": "2010-10-29",
  "scene_id": 55829,
  "series": "HalloWeenie",
  "tags": [],
  "title": "HalloWeenie, Scene #02"
}