{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have two hotties back in the house this week and with the likes of dreamy Christian Wilde and Sebastian Keys we know it's gonna be a scorcher. Blue-eyed and inked, Christian is 21 and originally from San Francisco. Christian is back after taking some time off from porn land. We're glad he missed the adventure and entertainment that is our industry; because he's on our couch today. Sebastian Keys is 20 and from Cincinnati, OH and these days he's rockin' it solo. He is a free agent and no longer with the girlfriend. We asked these growing boys what their favorite pizza is. Sebastian likes it supreme. More IS More. Christian likes artichoke hearts while they both concur their least favorite is anchovies. When they step out to strut their swagger, Sebastian has a sweet black pin stripe shirt he likes to wear. Christian on the other hand, keeps it casual in a black hoodie that he finds himself irresistible in. We're sure he's not the only one.  Being that they've both been in this industry a while, we asked them if there were any misconceptions assumed by many once they discovered what they did for work. ?All porn stars have STDs and every porn star does lots and lots of drugs? nods Christian. Sebastian laughs as he concurs. Well, reality is one thing and perception is quite another.Left to their own devices these two are just looking for trouble as they sit across from each other rubbing themselves. Christian stands up and moves closer to Sebastian and brings him over to the couch where Sebastian undoes Christian's jeans. Left in sexy black briefs, Christian's already poppin' a tent. Sebastian rubs his aching cock through them before setting that thick dick free. Christian's cock is dancing at the touch of Sebastian's hand as he caresses and strokes it. He licks that dick before taking it in his mouth. Christian moans as he watches Sebastian worship his meat. He holds it by the base as he nurses on that pole. He takes his time as he swallows every inch of his cock. Sebastian then stands as Christian kneels to return the favor. Christian readily sucks on Sebastian's low hanging balls before going down on his dick. He shoves that dick down his throat as he strokes it with his hand and works that knob with that pretty mouth of his. Sebastian's cock is rock hard as he watches Christian working him over.Christian then gets up and hauls Sebastian up with him as he turns him around and bends him over the weight bench. He gropes that sweet ass and slaps it with his dick before suiting up. He smears some lube on the hole he's about to fuck and he's ready to go. Sebastian braces himself as Christian starts to slide inside. Christian then takes his shirt and uses it as a blindfold and a bridle on Sebastian as he starts to fuck that ass. He grabs that tee like the reigns on a horse and uses it to impale Sebastian back onto his dick over and over. He's pounding that ass deep as Sebastian has to rely on his ?other? senses as he gets nailed. Christian means business as he mounts Sebastian with his thick dick. Christian then releases Sebastian and sits back so that he can get his cock ridden. Sebastian sits on that cock and starts to ride that cock with ease. ?Awww, such a big dick? he moans as he continues getting that ass stretched. He grinds that hot ass back onto Christian's dick wanting every inch of it?but wait there's more! Christian puts him on the bench again and fucks him missionary. He pounds that ass that as he's fucking him, Sebastian can't help but explode all over himself. Christian then pulls out and unloads all over our cum-soaked Buckeye.",
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 27966
    },
    {
      "name": "Christian Wild",
      "person_id": 28310
    }
  ],
  "release_date": "2010-10-08",
  "scene_id": 55822,
  "series": "Sebastian Gone Wild",
  "tags": [],
  "title": "Sebastian Gone Wild, Scene #01"
}