{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Dayton O'Connor is the flavor of the week and everyone knows that this sexy, smooth 25 year old San Diego native never fails to please. Joining Dayton this week is Logan Drake. This is Logan's first shoot anywhere. A VIRGIN?! How often do you hear that on a porn site? Logan is 21 and from Virginia Beach, VA. With his clean cut looks and room brightening smile he's in for quite the career. Dayton is a seasoned veteran and admits he remembers his very first scene. If he had to do it all over again he would've been more of a champ about it. We asked Logan what he was most nervous about on his way here. Logan blushes as he admits wondering who his co-star was going to be. Mostly Logan was excited to get out in front of everyone and start a new chapter in his life. We then asked these boys to pick 3 adjectives they want people to think about when they ponder their careers as adult film stars. Dayton wants to be thought of as aggressive, hot and desirable. Logan would like to become the kind of film star that people know as amazing, sexy and fun. Well, we are pretty sure that Dayton can figure out how to have an amazing and fun time with Mr. McSexy sitting right next to him.Dayton is kicking back on the bench flippin' through a gay porn mag and groping his dick when there's a knock on the door. Logan walks in needing a place to crash for a bit. As Dayton goes to get him a pillow, Logan finds the magazine he's hidden under a cushion. ?What's this?? he asks. Dayton blushes and does what anyone would do when cornered, he makes out with him... SCORE!! They pull off each other's tees as they start to explore each other's bodies. Logan leans back on the weight bench as Dayton starts to grope his growing cock. Both of these studs are naturally smooth and defined. Dayton hauls out Logan's cock and starts sucking on it. Logan is rock hard in seconds as he gets his balls licked and cock swallowed. Dayton bobs his head up and down on that dick while letting his fingers roam south getting a sneak peak at that hot ass he has his eyes on.Logan then gets on his knees as he strips Dayton's briefs off. He licks his lips before sliding that throbbing cock inside them. Dayton's eyes roll back as the newbie shows him just what he can do on that thick dick of his. Dayton loves it as he holds Logan's head and face fucks him. He impales his cock all the way down Logan's throat. ?Look at me when you do that? he coaches as he watches Logan swallow every inch of dick he's given. Logan effortlessly deep throats that huge cock at will. The new kid got skillz, yo!Logan then gets on the couch as Dayton gets a better taste of that sweet untapped ass. He licks and fingers that hole as he jacks his dick. ?Yeah, put your ass in my face? he grunts as he gets that hot hole ready for a proper fucking. His fingers open that sweet ass up making way for a much larger digit. He lays Logan on his back as he lubes up that ass and pushes inside. Slowly that hole concedes as Dayton starts to fuck away at that ass. Logan is taking that dick like a champ as Dayton picks up the pace. He slams that cock deep as he holds Logan's legs up. Dayton then starts to have at that ass as his hot little waist gyrates sending that cock deeper into Logan's ass. Dayton then bends Logan over on all four as he slides in for more doggy style. A view from below gives us a spectacular shot as Dayton's cock slams in and out of Logan's ass. Missionary is next as Dayton continues the fuck fest. This position usually does the trick and as Dayton's thick cock is hitting Logan's prostate it sends him over the edge. ?I'm gonna cum, fuck me hard? Logan grunts as Dayton obliges railing his ass deep. Logan explodes all over himself with Dayton pounding him. Dayton then pulls out and unloads another huge load all over Logan.",
  "models": [
    {
      "name": "Dayton O'Connor",
      "person_id": 27958
    },
    {
      "name": "Logan Drake",
      "person_id": 28418
    }
  ],
  "release_date": "2010-10-15",
  "scene_id": 55824,
  "series": "Cum Logan Cum",
  "tags": [],
  "title": "Cum Logan Cum, Scene #01"
}