{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Two brand new faces this week and we know you're gonna love these two. Our first debutant is Tyler Andrews. Tyler is 21 and originally from the ATL. Jake Steel is the second half of our duo and this 22 year old, tall stud hails from Philadelphia. We asked these two if they could have a walk on role on any TV show, what show would that be? A Vampire show is Tyler's response which quickly gets seconded by Jake. 'I'd have to agree, it's one of my favorite shows' Well now that Ruben's gone, maybe Jake could be the next tall, dark and hot werewolf? YUM. Fang banger or Supernatural, as long as they end up half naked we'd be ok with that. We then wondered if they had to choose between a pretty face or a big dick which would it be. Tyler goes with a pretty face. Jake tops that by saying, 'personally I appreciate substance'-wait for it-'but if you turn the lights off it doesn't really matter.' It's a toss up apparently. As for romance on a scale of 1-10 they both fall at about an 8 on a good day. Well we're glad that when they're not romantic they like to have fun on cam. Well, its time we let these two get better acquainted...They're headed to the beach as Jake is running down the wardrobe possibilities. Between shirt changes, Tyler starts to feel Jake's smooth chest. Then the wardrobe game takes a whole new turn. They start to explore each other's smooth bodies as Jake runs his tongue south along Tyler's smooth pecs and abs. Their shorts come off next and as Jake's shorts drop, Tyler gets a closer look at his cock. He feels his rock hard cock through his briefs for a few before setting it free. He opens wide as he takes in all of Jake's meat. Standing at 6'2, Jake is a tall drink of water and he's naturally smooth as can be. Tyler takes his time working his cock as Jake moans his appreciation. They switch as Tyler lies back on the weight bench and gets his cock worshipped by Jake. Jake easily swallows every inch of Tyler's cock sending Tyler's eyes rolling into the back of his head. Jake then straddles Tyler and starts to face fuck him. Straddling Tyler is exactly where he wants to be.He sits down on Tyler as he grinds his hot ass against Tyler's cock. They kiss passionately and soon enough that hard cock has found its home. Jake relaxes as he slowly takes every inch of that dick inside. He starts to slowly bounce up and down on that dick waiting for his ass to ease up. Tyler is fucking up into that hot ass trying to get that cock as deep as he can. Once Jake's used to that dick, Tyler starts to fuck him harder and deeper. Tyler's smooth balls slap away at that hot ass as he fucks Jake's hot ass. Next they go doggy as Jake gets bent over the weight bench. Tyler slides back in for more as Jake strokes his aching cock. Jake wants every inch inside as he reaches around and pulls Tyler in even deeper inside him. Tyler starts to pound Jake at an even pace as Jake revels in the sensation. They then finish up the trifecta with a steamy missionary. Tyler fucks Jake faster and hits all the right spots as Jake starts to moan and groan. Jake can't hold back as Tyler fucks the cum out of him. Tyler then pulls out and explodes all over Jake leaving him a glistening sight.",
  "models": [
    {
      "name": "Jake Steel",
      "person_id": 28084
    },
    {
      "name": "Tyler Andrews",
      "person_id": 28416
    }
  ],
  "release_date": "2010-10-01",
  "scene_id": 55820,
  "series": "Bending Steel",
  "tags": [],
  "title": "Bending Steel"
}