{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Today we have a special episode as we finally get to welcome Ridge Michaels to CircleJerkBoys. This sexy 22 year old Sarasota native with the chiseled frame and pretty boy looks has been on our brother sites; but we hadn't had a chance to share him with our members. Well, fortunately we invited another Florida boy, from right here in the MIA, Richie Sabatini to help us out. Richie will be doing the ?sharing??but hey, we get to watch. We asked these two, since they're both electronically connected, what celebrity would they most want to stop by their Facebook page to leave them a hello. Ridge would love to get a hello from Matt Damon; while Richie would love to hear from Hulk Hogan. We then asked them what the kinkiest thing they'd ever done is. Ridge answered fuckin' Diesel Washington. Yeah, we remember that episode but how will that stand up in the kinkiest category? Richie grins and answers, ?I was fucking somebody while sucking somebody's dick while they were getting fucked.? And the Kinkiest scene award goes to... lol. They both got started wanking their willies in grade school; and from what we can tell they've come a long way. This afternoon they're gonna show us a few things they've picked up along the way. Buckle up.They're sitting on the couch discussing what they like to do on Saturday nights and Ridge tells Richie he prefers to stay home. Well, staying home can be fun too as Richie moves over to show him some fun things to do. He starts to unbutton Ridge's shirt before leaning in to kiss him. They make out as Richie undoes Ridge's jeans. As he pulls them down, Ridge's boner springs out. Commando has never looked so good as Richie immediately goes down on Ridge's thick 8? cock. Ridge is lean and defined and hung. Richie works his cock as his tongue runs along the shaft and smooth balls. Ridge loves the attention he's getting but soon gets curious about what Richie may be packin'. He lays Richie back on the couch as he gets to sample the goods. Goods they are as Richie gets his rock hard cock spit polished by the new kid. Ridge swirls his tongue along his shaft as he takes that dick deep inside his mouth. He tugs on Richie's balls as he sucks that dick making Richie groan with pleasure. The dick's so good they both want more; and get into a hot 69 to better meet their needs. Richie takes top bunk as he sucks on Ridge while Ridge has Richie's cocked lodged deep in his throat.Richie then lies back on the weight bench and watches Ridge sit on his hard cock. Once Ridge gets his ass wrapped around Richie's cock he starts to ride. His tight waist gyrates as he grinds that delicious ass back and forth on Richie's bone. Ridge is rock hard as he takes that dick and all Richie can do is just moan in ecstasy. Wanting more control, Richie gets Ridge kneeling on the floor and bends him over the weight bench. He slides that cock back inside so he start to fucking him doggy style. Richie's low hangers slap away at Ridge's ass with every thrust he buries. Ridge is in heaven as he gets that hungry hole stretched wide. Richie then gets Ridge on the bench and puts his legs on his shoulders. Missionary is next as he slides his cock back inside. ?Awww, fuck!? is all Ridge can repeat as he writhes and moans with pleasure. Richie's nuts are pulling up tighter as he continues to pound that sweet ass. Ridge can't hold his load any longer and explodes all over himself while Richie's still fucking him. Richie then pulls out and nuts all over ...?The Cum Covered Ridge.? Now there's a Hardy Boys title waiting to happen.",
  "models": [],
  "release_date": "2010-10-22",
  "scene_id": 55826,
  "tags": [],
  "title": "Ball Play, Scene #01"
}