{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Have we got a hot episode in the making this week as we welcome back Hunter Vance. Hunter couldn't have come at a better time as we introduce recent discovery Cliff Jensen to the site. Cliff, the hot 21 year old Florida boy made his debut last week on ExtraBigDicks.com and we figured that at 6'3 there would be more than enough of him to go around. Trust us. For those of you not familiar with Hunter, Hunter is now 27 and is originally from Tampa, FL. We asked these two what their fantasy cars would be. For Hunter it would have to be a Lamborghini. It would have to be white with a black interior. Cliff keeps it simple and just wants to kick it with a sweet JEEP Wrangler. ?I don't care what color it would be?it's gonna be dirty!? he grins. Gotta love that. We then asked them if they had $1K in their pocket and had 3 days off where they would take their car on a trip. ?I'm pretty sure he's gonna pay his car insurance for the week' laughs Cliff 'and I'm going to the beach, maybe California to go surfing? Vance is grinning ear to ear and admits after paying his car insurance he'd probably head to Vegas. 'Trouble' this one. We then asked what the biggest difference between being with a guy vs. a girl is being as they're both bisexual. ?The smell.? answers Vance before cracking up. The smell! Really!? How do you follow that? ??you don't. lolCliff is chillin with Hunter and tells him it's been hard to deal with the cast on his broken arm. There are so many things he can't do alone. Hunter offers to help out any way he can. Cliff asks him to help him out of his clothes cuz he'd love a shower. As his shorts come off Hunter notices Cliff does need help?on his growing dick. Hunter squeezes it and takes it out of his boxer briefs. Cliff is throbbing by the time Hunter goes down on him. He sucks on his thick cock finally giving Cliff the relief he's needed. Hunter kneels and goes to work again. He shoves as much as he can down his throat without gagging. Cliff groans as he helps bob Hunter's head on his cock. Hunter then stands to kiss Cliff a bit before sitting on the couch and giving Cliff access to his own aching cock. Hunter can only moan with pleasure as Cliff deep throats every inch of his cock with ease. Some one's done this before.  ?Your mouth feels so good? coos Hunter seconds before he bends over on the weight bench. Cliff moves into position as he starts to tease that hot ass. He fingers that smooth hole getting Hunter horny for his thick dick.Hunter grimaces as Cliff starts sliding his thick 8??? cock deep inside his tight ass. ?Oh my God, that dick's SO big? grunts Hunter as Cliff starts giving him the dick he needs. It isn't long before Cliff has all of his massive cock buried deep inside Hunter. Cliff latches onto Hunter's broad shoulders as he starts to impale him even deeper. Cliff then sits back on the couch as Hunter sits on his cock in a reverse cowgirl position. Cliff licks Hunters nips and lats as he watches him ride his cock. Cliff then moves to the floor as Hunter squats right back down on that dick. Cliff's cock is rock hard and sliding deep into that hole as Cliff slams his cock up into Hunter's tight ass. Hunter is in ecstasy as Cliff fills that tight ass up. Cliff slams his cock deeper and deeper inside Hunter who does his best to steady himself. Cliff's cock is hitting Hunter in all the right spots and it doesn't take too long before Hunter is on the verge of creamin'. Hunter explodes all over his cock as volley after volley of thick jizz fly up into the air and splatter back all over it. Cliff isn't far behind and once Hunter's done he too jerks his cock off all over his defined frame.",
  "models": [
    {
      "name": "Hunter Vance",
      "person_id": 28320
    },
    {
      "name": "Cliff Jensen",
      "person_id": 28423
    }
  ],
  "release_date": "2010-11-12",
  "scene_id": 55833,
  "tags": [],
  "title": "Bone Breaker, Scene #02"
}