{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The last time we saw Logan Drake, he was on the receiving end of a Dayton O'Connor fuck session. That scorching scene was so hot that we just had to have him back. Considering that had been Logan's first shoot ever, we knew then that this 21 year old Virginia Beach native had wonderful things in store. Among those wonderful things, in his much nearer future, is a compact hottie named Santos Dumas. Santos is 23 and at 5'6 packing a thick 8? cock, this Miami boy reminds us that big things really do come in small packages.  We asked these studs if they could see anyone in concert and get front row seats who would it be. Logan wants Cher hands down and he wouldn't care who went with him. As for Santos' choice, ?It's a flamenco band called the Gypsy Kings. Yeah, that's my favorite?. We then asked them where they would go after the concert. ?I'd have a huge party at my house with a bunch of naked people and plenty of alcohol? beams Santos. ?I'm going to his party? laughs Logan. Yeah, plus one Logan cuz we're comin' with. Well for now it will be Logan that'll be 'cummin' with' so lets put the after party on hold ...and start our own party!Santos comes in totally frustrated about not being able to get laid because his girlfriends are all on the rag. Fortunately, Logan doesn't have that to worry about as he moves in to offer some much needed relief. They start to kiss as Logan pulls off Santos' wife beater. Santos has ink on his compact, defined frame. He's naturally smooth and has a tribal tattoo on his chest as well as a series of Chinese characters running down his delicious, abs we're sure translate into ?You know you want this!?  Logan pulls off Santo's briefs to free his rock hard cock. He sucks on his cock for a bit before standing up to let Santos return the favor. Logan's cock is growing by the second as Santos wraps those full lips around it. Santos swallows every inch of it as Logan watches his dick disappear. Logan then gets on his knees as he gets more of Santos' cock. He nurses on this cock getting it rock hard so he can put it to better use. Soon Santos is more than ready to upgrade to that hot ass Logan has for him.Santos sits back on the weight bench as Logan straddles him in a reverse cowgirl position. He impales himself on that dick as Santos guides him all the way down. Once he gets that dick deep inside, Santos starts to grind his meat up inside that ass. Logan loves it as he bucks back wanting to get every inch of that dick in him. Santos then gets Logan on his back as he slides back in missionary. This puts Logan in the perfect position for a proper pounding. He nails that hole good as his balls slap away at that ass. Santos' defined muscles writhe just beneath his skin as he gets quite the work out. They then move the fun over to the couch where Santos goes right back to fucking Logan on his back. Santos' cock slides in and out of that tight ass, unable to get enough. Santos starts to pick up the pace as he watches Logan writhe in ecstasy at the end of his fuck stick. Santos' fucking is getting Logan close to cumming. Logan starts to jack his cock faster and he won't last much longer. He grunts and starts to cum as Santos fucks a massive load right out of him. Santos then pulls out and unloads all over Logan. Now that's the way you handle a case of the blues...blue balls that is.",
  "models": [
    {
      "name": "Logan Drake",
      "person_id": 28418
    },
    {
      "name": "Santos Dumas",
      "person_id": 28424
    }
  ],
  "release_date": "2013-05-31",
  "scene_id": 55835,
  "series": "Blue Ball Special",
  "tags": [],
  "title": "Blue Ball Special, Scene #02"
}