{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Today we have two Floridians in the house as we welcome back Ridge Michaels and Michael Dora. Ridge is 22 and originally from Sarasota. Michael is 21 years old and originally from Ft. Lauderdale, FL. We asked these boys if they could have a walk on role on their favorite TV show, which show would that be. ?GLEE!? was Ridge's immediate response while Michael would want to appear on ?The A List?. They both have Facebook pages so we wondered what historical figure they would want on their page. Ridge would love to have Marie Antoinette as his Facebook BFF. Michael, apparently failed History, so he settled on Shakespeare. They both got into sex toys later on and Ridge used his first vibrator on the set of his first porn shoot. Michael's first sex toy was a Flesh Jack. Both of these studs are packing and Ridge realized he was bigger than the average guy in high school. Michael wins the prize since he realized it at the age of 6 in a locker room; when he realized he was bigger than everyone there. ?Awkward? lol Feel free to visualize that Kodak moment; on second thought, let's get these two better acquainted.Ridge and Michael make it home and Michael is freezing. Ridge takes off his jacket and puts it over Michael. Ahh, chivalry is not dead. They start to kiss as that jacket and a whole lot more start to come off. Ridge takes his shirt off revealing his smooth defined chest and abs. Michael licks at his nips while his hands explore the rest of him. Ridge then helps Michael out of his tee and starts to rub his hot chest. It seems Michael is letting his sexy hair grow back in on his chest and happy trail. Oh Goody! They kiss as they lose layer after layer until Ridge is standing in front of Michael who finally pulls off his briefs. His hard cock springs free as Michael wraps those sexy lips of his around them. Ridge is rock hard as Michael sucks on his dick. While he does, his own cock is tenting his briefs and he'll need some help himself. Michael then sits back and watches as Ridge kneels before him and discovers just what had everyone a flutter in that locker room. He hauls out Michael's thick 8?? cock and goes to work. He swallows as much of that thick cock as he can while Michael just moans his appreciation.They then maneuver into a hot 69 as Michael dangles his head off the chair to get at more of Ridge. All this oral attention's only gonna lead to one thing. (...which is what we want?so we ain't complaining!) Ridge needs more than Michael's hot mouth as he suits up and watches as Michael sits on his hard cock. Ridge immediately starts to fuck into that hot ass as Michael starts to stroke his own aching meat. ?Feels so good? Ridge coos as he gets his cock deep inside. Ridge then gets Michael on his back as he slides back in that hot ass missionary. Michael writhes as he gets that hole stretched and that prostate tickled. Ridge picks up the pace as he makes out with Michael and slides in and out quicker. If you see this chair a'rockin' lol Ridge then pulls out and bends Michael over and goes to work tapping that ass doggy style. He holds Michael by the waist as he slams in that ass. Michael winces as he gets that ass fucked. They then dismount and stroke their cocks off side by side. Michael is the first to blow shooting his load all over himself. Ridge is a close second as he aims and unloads all over Michael's cum covered abs.",
  "models": [
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    },
    {
      "name": "Michael Dora",
      "person_id": 28420
    }
  ],
  "release_date": "2010-12-03",
  "scene_id": 55839,
  "series": "Exploring Dora",
  "tags": [],
  "title": "Exploring Dora, Scene #02"
}