{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Mr. Chad Davis is in the house and we are so excited to have this hung Sarasota native with us. Chad made his debut on our brother site ExtraBigDicks.com. Fortunately there's more than enough of 21 year old Chad and his thick 8? dick to go around...so start lining up. A second debut is underway as Tony Douglas joins the circle. Tony is 22 years old and from Kentucky. Both of these studs have those washboard abs we love to hate; so we wondered if they ever indulged on fast food. Apparently, Chad had some McDonald's on his way here. Tony said he pigged out last night and again this morning on McDonald's. Lucky Bastards. They both like fast food on occasion; but Tony's favorite is the Ultimate Whopper with cheese while Chad prefers Chick-fil-A. They also love to cook and Tony's specialty is Chicken Divan with some mashed potatoes and some yams and wine. Chad would cook up a nice filet with a side of asparagus and some mixed vegetables and some red wine. These boys are making our mouths water and they're still dressed. Wait a minute, why are they still dressed? Chad shows up to pick up Tony and finds him chillin' and not even dressed. Chad grabs a tee out of Tony's duffel bag and tells him to put it on. As he reaches into the bag for more he finds a huge dildo. ?What's this?? he laughs as Tony pulls him down on to the couch and starts rubbing the dildo on Chad's crotch. Oh THAT'S what that's for!? We knew that. They start to kiss as their clothes come off. Chad stands so that Tony can get at his growing cock. Tony's eyes open wide when Chad's meat comes into full view. He wastes no time before wrapping his lips around it. Chad moans as Tony worships his cock. Tony loves oral play and it shows as he licks Chad's smooth balls and deep throats his meat. Tony then stands to let Chad return the favor. Chad continues jackin his fat cock off as he starts suckin on Tony's beefy dick. That's short lived seeing as Tony hadn't had enough of Chad's dick. Chad lies back on the weight bench as Tony swallows his meat again. Then they take the party back to the couch where Chad starts teasing Tony's ass with that dildo of his. Tony's moaning like a bitch as Chad starts to fuck his tight little hole with it. ?You should make that your cock? Tony begs but not before Chad makes him fuck himself with that dildo. Tony's more than happy to; getting his hole hornier for cock.?So you want the real thing, huh?? Chad taunts before sliding that thick dick inside. Once he gets his thick cock inside that ass he immediately starts pounding his hole. Tony grunts and moans as Chad plows that ass. Chad likes it a little rough so Tony has to adjust to that huge cock sooner than expected. Chad then puts him on his back and goes back to stretching that ass wide. It seems the louder Tony whimpers the harder Chad fucks him. We love a man with a plan. Tony's lying on the incline bench and is sliding up and down right onto Chad's pole. Chad loves that ass wrapped around his meat. He then moves over to the couch where he sits back and has Tony sit on his cock. He rides it while Chad plays with his cock. Tony rides it for a bit and once he stops to catch his breath, Chad takes over slamming that cock of his up into his worn hole. Tony is grinding that hot ass on Chad's thick dick and it's getting them both closer to climax. They sit back on the couch and jack off side by side. Tony's the first to cum as he shoots all over his abs. Chad shoots next sending his a massive load all over his own face and chest.",
  "models": [
    {
      "name": "Chad Davis",
      "person_id": 28421
    },
    {
      "name": "Tony Douglas",
      "person_id": 30766
    }
  ],
  "release_date": "2010-11-05",
  "scene_id": 55831,
  "tags": [],
  "title": "The Toy Box, Scene #02"
}