{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "For all of you out there wondering just what it is you have to be thankful for this year, well we're here to help. Richie Sabatini is back and just in time for Thanksgiving. We can never get enough of Miami's own Richie; and to make this holiday even spicier we're happy to have Noah Springs making his industry debut. Noah is 20 years old and hails from Seattle. He's finding Florida a bit warm for his tastes but we like him just where he is. As the New Year approaches we asked these hotties what their highlight of 2010 was. Richie's highlight hasn't happened yet but will soon. His Mom comes down for his birthday and spending time with her will be his highlight. Awwww. For Noah, his highlight was coming down here to Miami Beach. That's a win/win there. We then asked these two what their ideal bed buddy would look like. Richie wants someone about 5'8, big dick, tan complexion with dark features, maybe Puerto Rican to have fun with between the sheets. Noah just loves 'em taller than him. He wants to have a big, strappin' guy that can throw his hot ass around in bed. Noah blushes as he adds, ?...and they'd have to be attractive, of course.? Well, yeah. We knew that. ...Fortunately, Richie's got that under control.Richie comes out as he's dressing to leave and finds Noah hanging out on the couch. Turns out, Noah has nowhere to go on Thanksgiving; so he's staying home. As Richie goes to kiss him goodnight, Noah pulls him back down and plants a kiss on him that immediately changes everything. ?I guess I am staying home tonight? he grins as he takes his shirt off. They strip each other and soon Richie has his lips wrapped around Noah's growing cock. Noah is naturally smooth and his cock is throbbing as Richie slowly starts to work his knob. They start to make out as Noah then kneels between Richie's legs to get at that cock of his. He undoes his jeans and pulls down his pants. As he does, we get our first glimpse at his stellar ass. He slowly pulls down Richie's briefs setting his hard cock free. ?Mmm, how's that dick taste?? Richie teases as Noah licks it from base to tip. Once the briefs come off Noah goes down on him as he takes as much of that cock deep into his throat. He looks up at Richie with those bedroom eyes as he swirls his tongue all over that cock. Richie then bends Noah over and gets a taste of that hot smooth ass. Noah groans in ecstasy as Richie's hot tongue finds its mark. ...but wait?there's more.nNoah flips over on his back as Richie slides his thick cock inside. Noah's ass gives in as Richie starts to fuck him. Richie soon picks up the pace making Noah moan and beg for more. Richie's thick cock stretches Noah's hole as he rams inside. Richie then gets Noah to bend over so he can fuck him doggy style. Richie's smooth balls slap away at that hot ass as he continues to bury his boner deep inside his roomie. ?I'm gonna nut so bad', Richie groans 'it ain't even funny!? Noah just moans as he gets his hole bounced back onto Richie's throbbing cock. ?I'm gonna nut all over you? he teases as he watches his thick dick disappear inside Noah's tight ass. Richie then moves the party to the chair where he has Noah sit on his dick. ?Ride it!? he orders as Noah quickly obliges. Noah grinds that hot ass on Richie's cock getting him dangerously close. They dismount as Richie explodes all over himself. He soaks his delicious face and chest in a batter bath. Dessert!? already? Noah is next as he strokes his own rock hard cock and busting all over his smooth chest and abs. Well, they have definitely worked up an appetite; we're hoping they aren't the only ones. Happy Thanksgiving from all of us at CircleJerkBoys.com. ?Bon App?tit!",
  "models": [
    {
      "name": "Richie Sabatini",
      "person_id": 28328
    },
    {
      "name": "Noah Springs",
      "person_id": 28425
    }
  ],
  "release_date": "2010-11-26",
  "scene_id": 55837,
  "series": "Turkey Jerky",
  "tags": [],
  "title": "Turkey Jerky, Scene #02"
}