{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Today we have a special treat or two as we get ready for the Holidays. A familiar face on our brother site ExtraBigDicks, Connor Maguire makes his debut with us. Connor is 19, hung and home grown hailing from right here on Miami Beach. We have another debutant as well, Mick Gibson who is a hot 20 years old from Anderson, Indiana. We asked these two whether they preferred pizza or burgers for comfort food. Burgers it is for Mick whose ultimate burger would consist of 2 pounds of beef, a few toppings on a sesame seed bun. It's pizza for Connor who likes to keep it simple with one topping on his pizza, barbecue chicken. We then wondered who they would spend their New Year's with and where they would want to. Mick wants to spend it in Times Square in the Big Apple with his other half. Connor wants to spend New Years on South Beach with whatever creatures of the night there may be at the time. Anyone that's been out and about on SoBe knows that's always a good time. Connor was off and running at 6 years old when he discovered his pecker. Mick discovered jackin at 13. ?I wasted 3 summers doing that? he laughs. Well, 3 summers is enough, we needn't waste anymore time. Let's get these two naked!Mick gets the bad news that he'll be spending Christmas Eve alone since his girlfriend won't drive through a little snow. Ugh?women. lol Connor reassures him they'll be fine without her as he coaxes Mick into getting a massage. Hmmm... He pulls off Mick's shirt to get a better look at the muscles he's feeling thru his tee. They start to kiss as Connor's hands continue to roam all over Mick's tattooed frame. ?What do you say we open up our presents now?? asks Connor as he fumbles with Mick's belt. Christmas will cum early alright as Connor grabs Mick's huge boner. He kneels to better appreciate it as he wraps his lips around Mick's Yule log. Mick moans softly as he gets his cock worshipped. Connor then gets up to free his own throbbing cock. They jack each others dicks for a bit as they continue making out. We don't need no stinking girlfriends! Connor then lies back as Mick gets to work returning the favor. Connor's thick, uncut cock is soon at full mast as Mick spit-polishes it. ?Now this is a candy cane? beams Mick. A hot 69 is next as they continue to get each other hotter for more.Connor can only grunt as Mick starts to fuck him. His hard body slams up inside Connor's as he shoves his thick dick in and out of that hungry hole. As Mick fucks Connor missionary we get a great view of his compact frame as his muscles writhe beneath his pale skin. Mick then sits back on a chair and grins as he delivers his next gem, ?Why don't you come sit on the North Pole?? Seriously!?who could resist? Connor sits on that dick in a Miami minute as he leans back and gets bounced on that Midwestern cock. Connor can't get enough of that dick as Mick slams up into him. Mick then pushes Connor forward so that he's bending over in front of him. It's the perfect transition into some good old fashion doggy. He grabs Connor's waist as he watches his thick cock disappear inside Connor's smooth ass. ?That's a good little elf? he coos as he pounds away at him. Santa never had it so good. They both get close and lie back side by side as they jack themselves off. Connor's the first to explode all over himself. Mick is a close second as he too blasts his cream all over his happy trail.",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 28024
    },
    {
      "name": "Mick Gibson",
      "person_id": 28426
    },
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    },
    {
      "name": "Tylor Mansfield",
      "person_id": 28435
    }
  ],
  "release_date": "2010-12-17",
  "scene_id": 55842,
  "series": "Bonus Poke-Us",
  "tags": [],
  "title": "Bonus Poke-Us, Scene #01"
}