{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have two new faces on CircleJerkBoys today and you're in for a hot one as we welcome 25 year old Nikko Alexander to the circle. This sexy Orlando native made quite the debut on our brother site MenOver30 last month in a steamy scene with Matthew Rush. We knew the minute we saw him in his birthday suit he'd fit right in here on CJB. The second face belongs to Seth Roberts. Seth is 23 and claims to live in London. (...though the accent seems suspect at best) Moving right along... We asked these two boys what was the nicest thing they did for someone this past year. Neither could come up with an answer. Hmmm... we like these two. When it comes down to getting themselves off when they are on their own, we wondered what they watch since they are now in the industry. Nikko doesn't even watch porn he just jacks off. ?It's all mental to be honest with you.? We then were curious to know what they excelled at in between the sheets. Seth thinks that guys like his ass a lot. ??Well, you know everyone loves my balls!? interjects Nikko. We can dress him up; but we can't take him out. lol Fortunately, Nikko loves it all and in a minute Seth will get to see why we all love Nikko... Cheerio, Old Chap!It's Christmas Eve and Nikko and Seth are talking on the couch when Seth hands Nikko an unexpected present. ?I didn't think you were gonna get this for me? he blushes as he holds his new football. ?I don't have anything to give you.? Oh contraire, mon frere, Seth knows exactly what he wants. They start to kiss as Seth starts to unwrap his present. He peels Nikko's' tee off and fumbles with his belt. Nikko's cock is ready for action as Seth teases it a bit before setting it free. He strokes that growing cock and opens wide. Nikko moans as he gets that cock sucked on. This is the best present he's ever given anyone. Seth shoves that dick way down as he struggles to take all of it. ?Suck that dick like a candy cane, Bitch!? Nikko grunts as he grabs Seth's head and dribbles it on his dick. Seth then gets up and lets Nikko return the favor. Nikko pulls Seth's nuts out of his briefs and licks them before freeing his own aching cock. Nikko looks up at Seth with those bedroom brown eyes and starts to suck on that dick. He spits on that dick as he works it all the way down until Seth's nuts meet his chin.Seth gets back on Nikko's bone for some more fun which leads to some backdoor exploration. Seth teases that hole getting Nikko even hornier. That hole has Seth rock hard and he suits up for more fun. Nikko backs that ass up and sits on it. Once his ass concedes he slowly starts to ride that dick. Nikko struggles to take Seth's cock in him as he bounces on that dick. ?You like that?? he grunts as Seth fucks up into his tight hole. Nikko holds up his massive balls so we can watch that ass get nailed. ?Merry Christmas, Mother Fucker? he grunts as he gets railed. Seth switches it up by bending Nikko over for more dick. Nikko is a trooper and is taking the dicking he's getting like a champ. He holds on as Seth pounds him doggy style. Seth locks him in place holding him by his tight waist as he impales himself deeper and deeper inside his hungry hole. Missionary is next as Seth climbs on between Nikko's legs. His cock slips back inside as Nikko grabs his ass wanting every inch of dick buried inside him. That does the trick as they dismount and jack themselves off all over themselves. Damn, that had to be one of the hottest Christmas presents ever. Here's hoping your holidays are just as hot.",
  "models": [],
  "release_date": "2010-12-24",
  "scene_id": 55844,
  "tags": [],
  "title": "Reindeer GAYmes, Scene #01"
}