{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It's been far too long since we've seen this week's morsel, Kurt Wild. Kurt needs no introduction and it's nice to see him back after taking some time away to do the husbandly thing and help raise his brood. At 24, Kurt gets to have his cake and eat it too; having the wife and kids at home & all the dick he could want on set. We also have another blast from the past this week, Mr. Kirk Cummings. Kirk, now 23, is from Denver Colorado and we had the pleasure of shooting him in several scenes on the West Coast a couple years ago. Fortunately for us, he's in Florida now; and by the way Kurt's eyeing him up we're sure he's gonna get a warm reception. We asked these studs if they preferred cats or dogs. Kurt likes dogs because they are loyal. He doesn't think cats have that in them. Kirk laughs because he actually has a cat. Meow! We then asked if they could have any exotic pet what that would be. Kurt wants a wolf while Kirk wants a tiger. Kirk is now exploring a new look after returning to porn. He's no longer that twink we met and has become quite the college jock. We wondered if he'd always play the receiving role or explore other options. ?I go with the flow and do whatever...but I do like taking it!??So, how long has it been since you've had some man on man sex?? asks Kirk as Kurt tells him it's been over a year. ?You sure you like it?? Kirk asks seconds before Kurt moves in to show him just how much. They start to make out as their clothes start to come off. The chemistry between these two is on fire as their hands roam all over each other. Kirk licks at Kurt's happy trail before getting his pants off. He licks at Kurt's thick cock through his briefs for a few minutes before hauling out to give it the attention it deserves. Soon Kurt's extra thick cock finds a new home as Kirk shoves it all the way down his throat. Kurt groans as he starts to fuck Kirk's hot mouth. Kurt bounces Kirk's head up and down on his cock furiously. Kirk doesn't miss a beat as he spit polishes that dick. Kurt then gets Kirk up so he can check out the equipment. They compare cocks as they rub them together. Both of these boys are packing serious meat and Kurt wants to return the favor. Kurt kneels between Kirk's legs and goes to work on his fat cock. Kirk can't get enough of Kurt's hot mouth and it's making his eyes roll back. Kurt's interests move south as he gets Kirk on all fours so he can eat that smooth ass. He licks that hole out good before asking the rhetorical question, ?Do you wanna get fucked?? ...duh!He moves into position and glides his thick cock inside that spit-lubed hole. He holds both of Kirk's hands back as he uses them to impale him repeatedly back onto his throbbing cock. He's riding him from behind so furiously that it looks like he's in the final stretch of a chariot race. Kirk's ass is getting a pounding and he wouldn't want it any other way. Kurt fucks that ass harder as he smacks that ass. His heavy balls slap away at that ass doggy style before he switches things up. He sits back and watches as Kirk sits on his dick. Kirk grinds that hot ass onto Kurt's cock and it just makes Kurt slam his dick up into that hot ass even harder. . Kirk wraps his arms around Kurt's neck as he holds on and starts to ride that dick like a pogo stick. Kurt grabs him by the waist and starts to slam him down on his cock faster and harder. Daddy likes it rough! We like. Kirk then gets put on his back as his ass gets filled to capacity as Kurt shoves back in. Kirk holds his legs up so that Kurt can pound his hole. Kurt knows he's hitting Kirk in all the right spots and as Kirk gets closer to cumming, Kurt fucks him harder making him explode all over himself. Kurt isn't far behind as he pulls out & dumps a massive load all over one already cum-drenched Cummings. Yeah, Kurt was right... it had been WAY too long.",
  "models": [
    {
      "name": "Kirk Cummings",
      "person_id": 30504
    },
    {
      "name": "Kurt Wild",
      "person_id": 28391
    }
  ],
  "release_date": "2010-12-10",
  "scene_id": 55840,
  "series": "Cumming and Blowings",
  "tags": [],
  "title": "Cumming and Blowings, Scene #01"
}