{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Today, we welcome AJ Banks to CircleJerkBoys. After the impression he made last week on MenOver30, we're sure he'll be well received. AJ is 20 years old and from Daytona Beach, FL. Helping AJ feel at home is Denver's own Micah Andrews who is back in the area enjoying the 'harsh' winters here in the tropics. It's been a while since we've seen this 22 year old hottie. This season we wondered what they secretly wanted for Christmas. Micah wants a 12' penis; but we're not sure if that's 'ON' him -or IN him! Apply as needed... AJ doesn't really like Christmas since he lives on his own and doesn't really have anyone to spend it with. Awwww. So we went in another direction. We asked if they were planning 'special' holiday dates and decided to cook a romantic dinner; what dish they would cook for their significant other? Green Bean Casserole for AJ with French rolls. Micah would make Filet Mignon. Put these two culinary giants together and we might have something. To wrap things up, we wondered who they would want to wake up to find on Christmas morning. AJ would love any hot girl and he wouldn't mind if she was a bit chubby. He loves a girl with some meat on her. Micah wants a hot guy that's 6' tall and packin a 9' cock, maybe Latin. Not that he gave any thought to that... lolWearing his Santa hat and a frown, AJ sulks as he tries to find something better to do. The party he's at blows. Micah comes in asking what's wrong and has no trouble remedying his boredom. He licks AJ's neck rendering him defenseless. AJ holds still as Micah strips him down to his briefs which by now are sporting a major boner. 'You want me to suck your cock?' teases Micah before taking his throbbing meat. AJ moans softly as he watches Micah savor every delicious inch he has. Micah orders AJ to his feet so he can really go to work on that cock. AJ is a quick study and soon has his balls slapping away at Micah's chin as he fucks that face. 'Like my cock?' AJ teases as he watches Micah worship his tool. 'Now this is a fuckin' party!' he snickers as he shoves his thick dick down Micah's skilled throat. As he gets that cock milked, the cam pans around behind him giving us a great view of that str8 boy ass of his. AJ then gets down to business and gives back. He sucks on Micah's meat getting him hard. 'Now get that dick out of your mouth and fuck me!' orders Micah. Well...you heard the man-FUCK HIM!Micah bends over and shows off his smooth ass. AJ gets a look at all that awaits him. He slaps that ass a bit as he spreads those smooth cheeks. Micah's ass is ready as AJ slides in. He slams deep inside and has no problem fucking him hard. Micah loves that thick cock in him and begs him for more as AJ gives it to him harder. AJ watches as his rock hard cock disappears inside that tight ass he's using. AJ then switches it up and sits back while Micah sits on his dick. Micah starts to bounce on that cock driving AJ crazy. He holds Micah by the waist as he slams that dick up into that hungry hole. 'Oh your cock feels so big' groans Micah as he grinds that hot ass as far down as he can. He wants every inch of AJ inside him. AJ's eyes are rolling as Micah does his thing. AJ then gets up and gets Micah where he wants him-on his back. He slides back inside and starts fucking that ass hard like he would his girlfriend. He holds Micah's legs up as he slams harder and harder into him. That does the trick. Micah explodes all over himself as AJ literally fucks the cum out of him. AJ isn't far behind as he pulls out and sprays his thick load all over Micah's cum and sweat-drenched frame. ..Now THAT'S a party, Fuckers!Happy New Years from all of us at CircleJerkBoys.com ",
  "models": [
    {
      "name": "AJ Banks",
      "person_id": 28005
    },
    {
      "name": "Micah Andrews",
      "person_id": 28042
    }
  ],
  "release_date": "2010-12-31",
  "scene_id": 55847,
  "series": "New Year's Ball",
  "tags": [],
  "title": "New Year's Ball"
}