{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We couldn't be happier with the two studs we have sitting before us this afternoon as we kick off 2011. Mr. Gavin Waters is back in the house; but wait-there's more. Sebastian Keys is also here to help spice things up. We're setting the bar high as we welcome back Gavin who feels like he's 'getting old' in his mid twenties. Oh boy! We're hoping this hottie from upstate New York may have a few good years left in him. Sitting to his left is 20 year old Sebastian who lives in Boston, MA. We wondered if they had any hobbies as a young man that they still enjoy today. Gavin's hobby is working out but that kicked in later as he became interested in his appearance. Sebastian, on the other hand, has been interested in Martial Arts and is still very much involved with the craft. They are both anal about their environments and keep everything tidy. Sebastian also loves to cook whereas Gavin is better at baking. These two are poster boys for the happy middle. They both believe that everyone is free to love whomever they want without labels. Unlike many who feel you're either one or the other, they beg to disagree. They enjoy the pleasures on both sides of that fence. Well, lets get an idea of what they can do when left to their own devices...Gavin comes over looking for his friend to find Sebastian home alone. Sebastian invites him in to hang. Sebastian starts to complement Gavin's bod and that leads to a show and tell of sorts. They start to kiss as Sebastian peels off Gavin's shirt and licks his nips and chest. He works his way south until he gets to Gavin's rock hard cock. He pulls out Gavin's uncut cock through his fly and starts to nurse on it. 'I hear you got a big ol' dick' teases Gavin as he positions himself to find out. He pulls down Sebastian's briefs and goes to work on his growing meat. Gavin's mouth waters as he starts to suck on that cock. Sebastian moans in ecstasy as he slides that dick home. He can't get enough of Gavin's hot mouth. Sebastian then wants to give more back as he kneels between Gavin's legs. He slowly works every thick inch of Gavin's uncut pole. As he does, we get a great view of Gavin's chiseled frame. Sebastian then gets under him and nurses on that meat like a hungry calf as we get a stellar view of that ass. Sebastian has a plan as his fingers find their intended target. He wets his finger as he teases that hot ass.Sebastian then gets up and gets in place behind Gavin as he pushes his thick dick inside. 'Fuckin' tight hole' coos Sebastian as his cock starts to stretch that hot ass. Gavin just moans as he gets that ass fucked. 'You like that big dick?' teases Sebastian. An over the shoulder shot shows Gavin's hot ass as it gets stuffed by Sebastian. From doggy the party moves over to the chaise where Gavin suits up and watches as Sebastian sits on his meat. Gavin strokes Sebastian's cock as he gets his dick ridden. Sebastian is rock hard and takes over jacking his rock hard cock as he bounces on Gavin's thick meat. Sebastian's hairy hole is getting stretched wide by Gavin as Sebastian rides that dick. Gavin then moves him over to the couch where he slides his meat back in for more. He holds Sebastian's legs up as he fucks that hole missionary. Sebastian jacks his cock as Gavin slams deep inside him faster and faster. Sebastian jacks his cock and explodes all over his chest and abs as Gavin pounds him. Gavin then pulls out and shoots all over Sebastian's cum covered frame.",
  "models": [],
  "release_date": "2011-01-07",
  "scene_id": 55848,
  "series": "The WATERing Hole",
  "tags": [],
  "title": "The WATERing Hole"
}