{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It's been far too long since we've seen our first stud, Cameron Adams. Cameron is 24 and currently lives in Los Angeles. California is the common denominator as we also welcome back sexy Dylan Roberts. Dylan is 21 and from Northern California. Getting reacquainted with these two, we asked them if they had 5 minutes to talk to anyone in the world who they would talk to. ?Hmmm? was the unison response. lol ?Does God count?? asks Cameron. He seems to have a few questions up his sleeve for the Guy in the Sky. Dylan wouldn't mind asking God a few questions himself; but more practically would pick his Grandfather that passed away before he was born. We then asked if they've ever been caught ?handling? their business. ?Never!? gasps Dylan who apparently learned how to lock a door. Cameron admits he's been busted a couple times by his roommate jackin off in front of the big screen TV. We then wondered what their favorite thing to do in bed. ?Eat ass? is Cameron's favorite even if he's bottoming. ?I love cuddling? confesses Dylan almost apologetically. Awww. Team Dylan all the way! lol ?On that note...Dylan is sitting back on his workout bench and playing with his rock hard cock through his jeans. Cameron comes in and finds him rubbing himself. ?We need to get going we're going to be late? Cameron says before realizing Dylan's not going anywhere til he takes care of his morning wood. They strip as they tumble onto the couch. Dylan has Cameron's rock hard cock down his throat in seconds as he starts to work that dick. Cameron can only gasp as Dylan devours his raging boner. Dylan is hungry for that cock but he can't be the only one having fun. Cameron gets up and kneels before Dylan so he can return the favor. Dylan's uncut cock is aching as Cameron wraps his lips around it. Cameron has no trouble deep throating that dick making Dylan moan and groan in disbelief. You can't learn that disappearing trick in just any magic book. Cameron then picks Dylan's legs up to get at what he really wants?that ass. He licks that hot ass like a lollipop. Dylan's eyes roll as Cameron eats that ass shoving his tongue deep inside.?You wanna fuck it?? teases Dylan as Cameron suits up and gets ready to ride. He slides his thick cock deep into Dylan's smooth hole. He's fucking him missionary and as he does, we get an amazing view of Cameron's ass. He leans forward and makes out with Dylan as he continues to give him the fuck he's needed. Cameron's smooth balls are slapping away on Dylan's ass as they continue their fuck session. Then its time to change it up as Dylan suits up and lies back on the couch. Cameron's gonna get some of that dick after all as he straddles Dylan and sits right down on it. Cameron's tight ass is making Dylan nuts as he starts to slam his dick up into that hot hole. ?Fuck up into me? Cameron begs as Dylan obliges. Dylan's cock is hitting Cameron in all the right places?but wait, there's more. Dylan then gets Cam on his back as he starts to fuck him missionary. Dylan can't believe how hot that ass feels on his dick. He picks up the pace literally fucking the cum out of Cameron. Dylan is next as he too unloads sending his own troops splattering all over cum-covered Cameron.",
  "models": [
    {
      "name": "Cameron Adams",
      "person_id": 28380
    },
    {
      "name": "Dylan Roberts",
      "person_id": 28414
    }
  ],
  "release_date": "2011-02-18",
  "scene_id": 55858,
  "tags": [],
  "title": "Roberts' Rules Of Orgasm, Scene #01"
}