{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "AJ Banks is back in the neighborhood and we are always happy to see the hot 20 year old from Daytona Beach. That evil grin speaks volumes and this week AJ helps us welcome a new face to the circle, Jersey's own, Jarred King. Jarred is 24 years old and new to the scene. We asked these studs if they had any favorite teachers they remembered from high school. They both went with hot teachers as the ones that stuck in their minds. We then wondered now as young adults if there was a class they wish they'd paid better attention in. Math for AJ and Jarred wishes he'd paid better attention in financial management classes. We then turned toward more 'personal' matters and wondered what part of their bodies is hard wired to their dicks. AJ laughs cuz he has nothing that triggers a boner other than just seeing a naked girl. lol This one's for the fat girls, Bitches! Well, AJ has admitted to liking his women meaty. For Jarred licking the bottom of his ear and hot breath on his neck will do it. Well, maybe we can get down and dirty and find AJ's sweet spot. Shall we...The two get right to business as Jarred moves in for a kiss. His hands are all over AJ's growing cock as they start to explore each other. Jarred takes off his tee as AJ licks and sucks down his pecs and abs. Curiosity gets the better of Jarred who quickly strips AJ's pants off to speed things up. He drops his own pants as well as AJ kneels to get at his cock. AJ moans as he gets his mouth stuffed full of meat gagging on it as he tries to take it all down his throat. 'Yeah take that dick... just like that' encourages Jarred as he watches AJ go. Jarred's thick dick is throbbing as he gets that cock worshipped. AJ then stands and pulls his out so that Jarred can return the favor. Jarred gets on his knees and wraps his lips around AJ's meat as he fucks his face with it. He swirls his tongue around that throbbing cock as AJ moans. Jarred works his hot mouth on AJ's knob and strokes his own rock hard cock while he does. From there they move over to the couch and get into a hot 69 as AJ climbs on board, sinking his dick back into Jarred's mouth as he nurses on more of that Jersey meat.AJ then sits back as Jarred has a seat-on his cock. Once Jarred gets that hot ass all the way down on his pole AJ starts to buck up into him as Jarred matches every thrust. AJ quickly switches positions as he gets Jarred on his back. He lifts those long legs up in the air and slides that str8 dick back inside. 'You like that big cock!?' he grunts as he pounds away at that hot hole. AJ's balls slap away at that ass as he grunts and groans. Jarred is taking that dick like a pro as AJ drives it in deeper and deeper. AJ then moves the party south as he gets Jarred on all four. He slides that dick back inside that hungry ass as he starts to pound away doggy style. AJ watches as his dick slides in and out with ease. Jarred can't get enough as he gets that tight ass stretched. AJ picks up the pace fucking him faster and it sends him over the edge. 'Aw, I'm gonna cum!' he grunts as he pulls out as Jarred flips over to get it shot all over him. Jarred is right behind him as he too unloads all over himself.",
  "models": [
    {
      "name": "AJ Banks",
      "person_id": 28005
    },
    {
      "name": "Jarred King",
      "person_id": 28428
    }
  ],
  "release_date": "2011-01-28",
  "scene_id": 55854,
  "series": "BANKing Deposit",
  "tags": [],
  "title": "BANKing Deposit"
}