{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Trouble is up in the studio today as we welcome back Nikko Alexander. Nikko, for those of you not familiar with this compact hottie is 25 years old and he's originally from Orlando, FL. Nikko is here to help us welcome a fresh face to the circle as well as the industry, Lucas Vitello. Lucas is 18 and has only been in Miami for a couple hours and he's already ready to get busy. Both of these strappin' lads are horny most of the time and Nikko says he doesn't have to jack much cuz he fucks a lot. Lucas is a bit more modest. He admits he's just as horny but he doesn't have sex a lot. We wondered where these boys would like to use their tongues on the body of their partners. Nikko likes to lick stomachs. Navels can be quite enticing. Lucas loves to lick on a neck. Mmmm. Oddly enough they both readily agreed that their favorite place to have a tongue on their bodies would have to be their dicks. As for ultimate fantasies, Lucas wants to join the Mile High Club although Nikko admits it sucks. This one has done it ALL. lol Well fortunately by the end of this shoot, it will be Lucas that'll have done it all. (...and by ?all? we mean Nikko.)Nikko asks Lucas if the rumors that he has a huge cock are true. Lucas tells him to find out for himself. Don't ask Nikko twice cuz he's all over that request. He whips out a handy measuring tape as he starts to measure Lucas' growing cock through his pants. They start to make out for a few before Nikko strips off Lucas' clothes. Nikko ditches his clothes to before shoving Lucas' head into his growing bulge. ?Stop teasing me and suck my dick? Nikko orders. Lucas grabs his hefty balls and slams that cock down his throat. Nikko moans in pleasure as the new kid polishes his knob. Nikko is hungry for some dick himself so he gets Lucas to sit back so he can finally have a go at that thick, uncut cock. Lucas' eyes roll back as Nikko goes to town on his meat. Nikko slurps and swallows every inch of it as Lucas helps bob him on his cock. Nikko loves that dick but wants Lucas' mouth back on his. Lucas obliges as he kneels to service that cock some more. Once he's had his fill, he turns Nikko around so he can eat that hot bubble but of his. ?I don't even want you to breathe?just eat it!? Nikko orders as he shoves Lucas' head into his ass. Lucas gets his tongue deep inside that hot hole getting it ready for more.Nikko grimaces as Lucas starts to slide his thick dick inside. Nikko's hole gives way and soon Lucas is pounding that hole. ?You have a fuckin' nice ass? Lucas moans as he watches his thick dick disappearing into Nikko. Nikko doesn't talk as much smack when he's impaled on a thick cock. Who can blame him for wanting to revel in the moment as Lucas takes that ass. Lucas is giving it to him doggy and hitting him in all the right places. From here Lucas switches things up and has Nikko sit on his cock. Nikko eases himself onto that meat again and once his ass meets those balls, he starts to stroke his own uncut cock. He groans in ecstasy as Lucas starts to bounce him on his shaft. Nikko slowly grinds his ass on that cock. He reaches down to feel Lucas' hard cock as it slides into his hungry hole. Nikko can't get enough dick as he braces himself on the chaise to gyrate that hot ass deeper on that cock. Lucas then gets him on his back and goes right back to pounding him missionary. Nikko has his legs in the air and his ass full of cock. ?You like that?? he groans as Lucas pounds away at his hairy hole. Missionary does the trick as Lucas pulls out and explodes all over Nikko. Someone was a bit backed up... Nikko then jacks his own load out all over his cum drenched abs.",
  "models": [
    {
      "name": "Nikko Alexander",
      "person_id": 28001
    },
    {
      "name": "Lucas Vitello",
      "person_id": 28430
    }
  ],
  "release_date": "2011-01-21",
  "scene_id": 55852,
  "tags": [],
  "title": "Balls To The Wall, Scene #01"
}