{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Another exciting week on set as we welcome two new faces to the circle. The first, Matthew Singer, is a 23 year old from San Diego. Ty Benton makes up the second half and is a hot 22 year old from Phoenix, AZ. We wondered if these two happened to be marooned on a hot desert island with a DVD player (...just go with it ) and they could only have one DVD to watch over and over, what DVD would it be? ?Hot Rod? is Ty's winner. He cracks up every time he watches it. Matthew is a Die Hard fan and wouldn't mind having the last installment and Bruce Willis there to keep him company. Having all that time alone on that island we imagine they'd have lots of time to perfect certain activities. So we asked them if they were to end up in the Sexual Olympics,?I know, right??what would they each bring home individual gold medals for? ?Well I'm pretty good with my mouth' grins Ty 'I'd have to say Oral Talent? ?I'm a pretty good top' starts Matthew, 'I always scare everybody off at first but they're always down to take it.? Well, alright then. Well we know 8 reasons why Ty won't be scared of Matt's thick cock?and he's gonna take them all.Matthew starts off by giving Ty a back rub which leads to more as his hands roam Ty's smooth chest. Soon Matthew's tongue joins in as it finds Ty's neck. They stand and start to make out as Matt drops his jeans to show Ty what he's in for. Ty gropes at the tent in Matthew's briefs for a bit before hauling out that thick dick. He goes to work sucking on that dick as Matthew moans his approval. Matthew holds Ty by the back of his head as he starts to fuck that pretty mouth of his. Matthew then kneels and helps Ty out of his jeans. Ty's cock is growing by the second as Matthew strips off his briefs and starts to return the favor. Matthew licks along the shaft before engulfing that cock all the way to the hilt. Matthew is just getting into it when Ty pulls him off of his dick wanting more of Matthew's. Matthew sits back and watches as Ty worships his meat, shoving it all the way down his throat. Ty can't get enough of that California cock and we can't seem to blame him. Lucky for Matthew, Ty is in no hurry and he takes his time sucking and lapping at his cock and smooth balls getting him hard and ready for more.They move the party to the couch where they lie back cock to cock, stroking their horny cocks together. Matthew's thick meat is now aching for much more than a hand job. ?You want that dick, huh? Matt teases as he watches Ty sit on his thick cock. Ty is groaning in pain as his ass struggles to accommodate its intruder. Matthew slowly starts to slide that dick in and out of him and it isn't long before Ty's groaning turns into begging. ?Awww, FUCK ME?, Ty moans as Matthew quickly obliges. Ty then switches things up as he gets on all four and has Matthew fuck him doggy style. That dick isn't any easier to handle in this position as Ty grunts and groans. Matthew starts fucking that ass deep and giving Ty the fucking he needs. An under shot shows Matthew's thick cock sliding deep inside that tight ass. Matthew then bends Ty over a chair and slides back in for more. He fucks him harder as he stands behind him and gets closer and closer to climax. Once he feels that familiar tingle, Matthew pulls out and unloads all over Ty's ass. Ty then gives Matthew his load, shooting all over Matthew's sexy furry navel. YUM!",
  "models": [
    {
      "name": "Matthew Singer",
      "person_id": 28436
    },
    {
      "name": "Ty Benton",
      "person_id": 28437
    }
  ],
  "release_date": "2011-02-04",
  "scene_id": 55857,
  "series": "The Jizz Singer",
  "tags": [],
  "title": "The Jizz Singer, Scene #02"
}