{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Today we have two new additions to the Circle. The first is a Caribbean delight by the name of Christian Ray. Christian is Cuban born and has been living here in the US for 2 years. Jacob Ryan is present to represent the US in this international tryst. Jacob is 22 and hails from North Carolina. We wondered what these two studs liked most when they were back in school. Math was Jacob's favorite subject; while foreign languages topped Christian's scholastic interests. They both started early when it came to sex. Christian's first experience was at 13 though he didn't have sex with another boy til he was 19. Jacob was hornier than hell his 16th year and unwrapped both sides of that buffet over the summer. Whoever said ?Less is more? must've been starving. Lol Christian loves Burgers while Jacob prefers pizza. We then asked them who their fantasy picks would be if they could fuck any one they desired. Brad Pit for Christian; and, seriously, who could argue that? lol Jacob wants some Freddie Prinze, Jr. on his to do list. Guess opposites really do attract. With that in mind, we are pretty sure that there will be sparks a'flyin as these two opposites cum together. Shall we?Christian comes in to find Jacob on the couch. Jacob notices he's hurt and asks to check out Christian's foot. As he starts to massage his foot, Christian starts to do some massaging of his own. They start to make out as things get interesting. They start to peel each other's clothes off as they explore one another. They stand and continue kissing as their hands dive into each other's pants. Jacob gets Christian on the chair before stripping him completely. His thick uncut cock springs free ready for some much needed attention. Jacob takes his rock hard cock down to the hilt as Christian starts to bob his head up and down on his thick shaft. Jacob licks and sucks at that cock before getting up to let Christian return the favor. Christian takes Jacob's cock in his mouth and is more than happy to oblige as Jacob slowly fucks his face. Christian licks all along his cock and balls as Jacob's cock throbs at attention. Christian then gets on his knees so he can better work that thick cock and soon they are entangled in a hot 69 on the couch giving them all the cock they can swallow.Christian then sits back and holds his thick Cuban cock by the base as Jacob straddles it and sits down. His ass is stretched wide as Christian's cock makes its way in. ?You like that?? Christian moans as Jacob starts to ride his cock. Jacob grunts in ecstasy as he grinds his hot ass down on Christian's cock. Christian is more than happy to help as he grabs Jacob by the waist and starts to slam his dick up into his ass. Christian then gets Jacob on his back and starts to fuck him missionary. Jacob's cock is throbbing as he gets fucked. ?Feels so good? coos Christian as he repeatedly asks Jacob if he likes it. Hot, hung and attentive. We like. Christian starts to slam his thick cock deep as he picks up the pace driving Jacob nuts. Jacob's cock is throbbing as he gets his hole pounded. As Christian nears climax he starts to fuck faster. They are both at the edge of no return as Christian pulls out, unloading his thick nut all over Jacob. Jacob is seconds behind Christian as he too shoots all over his cum soaked navel.",
  "models": [
    {
      "name": "Christian Ray",
      "person_id": 28431
    },
    {
      "name": "Jacob Ryan",
      "person_id": 28432
    }
  ],
  "release_date": "2011-01-14",
  "scene_id": 55850,
  "tags": [],
  "title": "Soldier Onward, Christian, Scene #01"
}