{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Hunter Vance is back in the house and we're always happy to have him back. Valentine's Day has set us in a mood for some lovin' and with that in mind we brought along a hot 20 year old to help set the tone. Alex Andrews is from Tennessee and he's making his big debut with us here at CJB. Who better than a sexy 27 year old Floridian to help welcome him? We wondered what these two would wear when they were to hit the clubs and wanted to turn a few heads. 'Depends on where I go,' says Hunter 'but usually a velvet sports coat' Sexy and suave-can ya stand it? Alex ponders the question for a few before chiming in with 'My wife beater'. <awkward pause> We debate whether to offer a lifeline or maybe he could phone a friend? Hunter busts out laughing as Alex defends his wife beaters. He apparently wears them everywhere. Who knew? lol Tennessee, redefining Haute couture-or is it hot cooter? Hmmm. They both love clothes shopping and while Alex hates shopping for shoes; Hunter loves shopping for everything. Both of these boys got an early start sexually and now as adults are putting those skills to good use. Alex says he does more outside of his porn work while Hunter gets so much sex on set that by the time he gets home he just wants to rest. <sigh> We should all be so lucky...They're sitting back watching porn together and tugging on their dicks when Alex says 'I wish someone would do that to me'. Say no more as Hunter decides he might need to help a brother out. Alex takes his thick uncut cock out as Hunter does the same. Alex is the first to crack as he offers Hunter some head. Hunter's more than happy to oblige as he spreads his thighs to give Alex better access to his dick. Alex goes to work on his meat taking as much of it as he can down his throat. Alex looks up at Hunter as he services his cock, licking it along the shaft before taking it right back into his mouth. Alex then gets up on the chair and slides his thick meat into Hunter's mouth. Hunter knows exactly what to do with all that country cock as he strokes and slurps on it. Alex moans his appreciation as he watches Hunter nursing on his meat. 'You like how my dick tastes?' Alex coos as his rock hard cock throbs inside Hunter's mouth. Hunter then sits Alex back so he can really go to town on that thick uncut cock. Hunter lays there in a zone with only that thick cock to focus on before his own cock reminds him he has 'other' options to consider.Hunter then gets Alex bent over the chair as he starts to slap his hard cock on that hairy hole. 'You wanna fuck my tight ass?' teases Alex already wanting that thick cock inside him. Hunter slaps it on his ass some more getting him even hornier for that meat as Hunter spreads that hole open. Alex's face grimaces as Hunter slides his thick cock inside. Hunter gets to work slowly giving Alex the dick he needs. Alex just begs for it as Hunter picks up the pace. Alex is getting that ass plugged as Hunter continues to give it to him doggy style. Missionary is next as Hunter switches positions and slides his dick back in for more. Alex is still struggling to accommodate that dick as the new position enables Hunter to bury his meat deeper. 'Aww, you know just what my asshole wants' moans Alex as Hunter steadily fucks his tight hole. There's a Valentine's Day card waiting to happen. Hunter then sits back and has Alex ride his dick. Alex grinds his hot ass on Hunter's pole as they both approach climax. Alex bounces on that dick harder and it sends them both over the edge. They lie back side by side as Hunter explodes all over his smooth navel and cock followed by Alex who also white-washes his own abs. Nothing better than some sweet sweet cream on Valentine's Day!",
  "models": [
    {
      "name": "Alex Andrews",
      "person_id": 28438
    },
    {
      "name": "Hunter Vance",
      "person_id": 28320
    }
  ],
  "release_date": "2011-02-25",
  "scene_id": 55861,
  "series": "The Booty Hunter",
  "tags": [],
  "title": "The Booty Hunter"
}