{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Two new faces this week as the circle gets larger. A warm CircleJerkBoys welcome is in store for both Logan Ryder and Cole Harvey. Logan is 21 from Alabama and Cole is also 21 and from Georgia. There will be plenty of Southern Charm this afternoon as these two get better acquainted. We asked these two growing boys what their favorite sandwiches are. 'B.L.T.' for Cole and he's wash that down with some Root soda. Logan is more of a ham kinda guy. He loves a ham and cheese sandwich and he prefers Coke to help him get his down. We recognize boys can't live off sandwiches alone so we wondered what kind of mischief they have gotten themselves into. Cole has ventures into the multiple partner end of the table while Logan has never had sex with more than one person. Cole has also had sex in public which he thoroughly enjoys. Logan is in awe of Cole's repertoire but we assures him he needs to live a little before he can make up his mind on anything involving a good fuck. With that in mind...Cole is stringing on his guitar and Logan says he'd love to learn how to play but can't afford to pay him for lessons. Cole asks him what he does have to pay for lessons as Logan shows him. They start to make out as their clothes come off. Both of them are popping wood by the time their pants hit the floor. Logan drops to his knees to make his first installment on his guitar lessons as he opens wide and takes Cole's thick cock deep. He sucks on that meaty dick getting as much of it as he can down his throat. Cole loves the payment plan as he starts to fuck Logan's face. Cole then wants some cock of his own as he lays back and starts to nurse on Logan's growing bone. He takes his time nursing on that cock for Logan as Logan just moans his approval. They then maneuver into a hot 69 as Logan takes top bunk, bobbing his head up and down on Cole's cock as Cole nurses on his from below. Logan then moves across the room and shows that sweet ass off for Cole. He teases and fingers his hot hole making Cole's cock throb at the chance to get some of that.Logan then moves over and slides a rubber on Cole's swollen cock and straddles it. He sits right down on that cock and slowly takes every inch of it. Logan's thick cock is now at full mast as he jacks that dick. His tight ass is getting stretched wide by some Georgia hardwood. Cole is in ecstasy as he gets that cock ridden. Logan bounces up and down on his thick cock taking every inch inside. Cole then switches things up as he bends Logan over and gets back in that hot ass as he starts to pound that hot ass doggy style. Logan's head is buried in a pillow as he gets his tight ass railed deep. Cole's cock is hard as a rock as he continues to take that ass. Cole's smooth balls slap away at Logan's furry hole as Logan takes that dick like a champ. Missionary is next as Cole flips Logan over onto his back. He spreads his legs before shoving his country cock back in that hot, tight ass. 'Aww yeah Fuck my ass!' Logan moans as Cole picks up the pace. That does the trick sending Logan over the edge. He blows his load all over himself with Cole still buried inside him. Cole pulls out and unloads all over one cum soaked Logan. Anyone else wanna sign up for guitar lessons?",
  "models": [
    {
      "name": "Cole Harvey",
      "person_id": 28440
    },
    {
      "name": "Logan Ryder",
      "person_id": 28441
    }
  ],
  "release_date": "2011-03-11",
  "scene_id": 55864,
  "series": "Logan's Eros",
  "tags": [],
  "title": "Logan's Eros"
}