{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Back with us this week is Jarred King and today he'll be helping us welcome a hot 19 year old from Cleveland Ohio that goes by the name of Eddie Blake. Jarred is a hot 24 year old Jersey boy. When we last saw him he was living overseas but he's back in Florida now. We asked these two if we were to take them to the hardware store what ?tool? they would handle the best. Eddie says he's best with a hammer while Jarred likes a nail gun. Pounding and nailing things are both important virtues to have but we were gearing towards what they did best with their own tools. They both discovered their power tools at about 12 or 13. Before getting into this wacky world of man on man fun neither had ever thought much about having sex with another str8 guy. We get that ?A LOT! We then wondered if they had discovered any new pleasures that came from the sex that they weren't expecting to enjoy. Eddie can't say he has and rarely gets any pleasure from it. Jarred has had more experience and knows that only having 2 scenes under his belt like Eddie has now he had yet to find his flow. So basically Eddie needs to log more miles on that cock of his. The Admiral's Lounge is now open...Jarred and Eddie get home from a crappy night out. They couldn't find any play and now they're both horny with no relief in sight. They start rubbing their boners through their jeans as curiosity takes over. Jarred reaches over and grabs Eddie's cock to find he's rock hard. ?Maybe we should take care of each other?? Eddie grins. Eddie strips and stands before Jarred who starts sucking on his throbbing boner. Eddie moans his approval as he gets his shaft swallowed. Jarred peels off his shirt and pants as he continues to nurse on Eddie's thick cock. Eddie's naturally smooth and as we get a view from the back we get a great view of his muscular ass. Eddie grabs Jarred's head as he starts to face fuck him slapping his smooth balls against his chin. Jarred then stands to give Eddie the chance to give him a little. Eddie drops to his knees and gladly goes to work on some of Jersey's finest meat. ?You like that?? coos Jarred as he watches Eddie sucking on his rock hard dick. Jarred slaps his cock on Eddie's face as Eddie continues to worship his meat.Jarred then assumes the position on the ottoman as Eddie starts to play with his hot ass. He spreads those cheeks open as he gets a better view of the ass he'll soon be tappin'. Eddie then sits back as Jarred straddles him and sits on his dick. Eddie grabs that hot ass and starts to bounce it on his cock. With buddies like Jarred who needs a drunk chick? He pounds at that tight ass as Jarred grinds his ass all the way down on that cock. Jarred takes control fucking himself silly as Eddie sits back and watches. Jarred then moves back to the ottoman as he gets on all four so that Eddie can bury that dick doggy style. Eddie is more than happy to oblige as he goes back to fuckin' that ass. He grabs Jarred by the waist and nails him deep. After some doggy style fucking he flips Jarred over onto his back for some Missionary. He slides back inside and watches his cock pumping in and out of Jarred's hot ass. Eddie's thick cock is hitting the sweet spot and it isn't long before Jarred's cock is ready to explode. He jacks his throbbing cock off as Eddie fucks the cum right out of him. Eddie is next as he pulls out and unloads his own batch all over Jarred's cum soaked abs.",
  "models": [
    {
      "name": "Jarred King",
      "person_id": 28428
    },
    {
      "name": "Eddie Blake",
      "person_id": 28442
    }
  ],
  "release_date": "2011-03-18",
  "scene_id": 55867,
  "series": "Lube Job",
  "tags": [],
  "title": "Lube Job, Scene #02"
}