{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Parker London makes his debut with us this week and we can't wait to get this tall hung hottie naked. Parker is 26 and originally from Ohio. Ridge Michaels is also here helping us welcome Parker onboard. For those of you unfamiliar with Ridge, Ridge is 23 and a home grown boy from Bradenton, FL. We asked these two if they were to win $1,000 in a scratch off what they would do with it. ?Save it? is Parker's response. Somehow we figured Ridge would have a different response and sure enough he'd blow it all on a laptop. We then asked them what it is about a guy that catches their eye first. They both agree the face is what seals the deal. You gotta be able to look at him if you're gonna go there. We then asked them if they had a choice to be either a bottom or a top for a year what they would choose. Parker would opt for the top spot. Not because he dislikes being a bottom it's just all the prep work involved. No merit badge for this scout. Ridge wants to bravely forge into unchartered waters and be a bottom only because it would be something new. Well the only way to know if you truly like something is total immersion. With that in mind let's get these two ?immersed? in each other...They're both hauling in a dumpster find when Ridge asks Parker why they're bringing this ottoman in to begin with. ?It's perfect for just about anything' Parker grins, 'sitting, fucking...? Parker reaches for Ridge's crotch as they start to make out. They fall onto it as they start to strip each other. The clothes come off as the party moves to the couch where Ridge gets his hands on Parker's thick cock. He pulls it out of his briefs and starts sucking his cock. Parker moans as he gets his throbbing cock spit shined. Ridge is rock hard as he nurses on Parker's pole. Parker teases Ridge as he slaps his face with his hefty cock before sliding it back in that hungry mouth of his. Parker then switches and sits on the floor so that Ridge can feed him some dick of his own. Parker goes to town on Ridge's thick 8? cock. Ridge pays him back as he rubs his dick all over his face, slapping him with it before fucking his throat. Parker does his best to take it all down his throat 'til it makes him gag. Ridge then goes back down on Parker giving him access to that hot ass. Ridge fingers that hot hole as he licks it getting Parker horny for a proper fucking. Ridge has Parker with his legs spread and waiting for dick.Ridge can't wait any longer and slides his thick cock inside. He starts fucking Parker missionary on the ottoman which affords him the perfect perch. Parker is going nuts getting that hot ass stretched open. Ridge looks down to watch his thick meat effortlessly disappear into Parker's beefy ass. Ridge then flips him over and gets back to work, tapping that ass doggy style. He picks up the pace as he fucks Parker faster and deeper. Parker takes it like a champ as Ridge continues to deliver all the dick he can handle. What's good for the goose is good for the gander as Parker sits back and has Ridge sit on his cock for a change. Ridge sits on that thick corn fed cock and starts to ride as Parker's eyes roll into the back of his head. Parker grabs Ridge's waist and starts to bounce him on his pole. Ridge responds by grinding his tight ass deeper as he kisses Parker. Parker's cock hitting Ridge's sweet spot just right and it sends his load flying all over his smooth abs. Parker then pulls out and unloads his own thick batch all over Ridge's cum covered cock.",
  "models": [
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    },
    {
      "name": "Parker London",
      "person_id": 28439
    }
  ],
  "release_date": "2011-03-04",
  "scene_id": 55863,
  "series": "London Ridge",
  "tags": [],
  "title": "London Ridge, Scene #02"
}