{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have two familiar faces back with us this week as we welcome back Cliff Jensen and Logan Drake. Both of these hotties are Florida natives and we're glad to have them both in Miami. Keeping with the local Oscar buzz, we asked them if they could walk down the red carpet with anyone who would they want on their arm. Cliff would want Jesus on his arm. Logan couldn't decide on just one date; so he wants to bring along Rod Daily, Britney Spears and throw in Cher for good measure. Now that's an entourage. We then asked these studs if they had any special techniques when it came time to pleasuring themselves. Cliff has an odd way of getting himself off. He likes to lie on a tee shirt and grind his dick into it until he nuts. Apparently that was the way he had his first orgasm as a young guy and just went about perfecting that technique to this day. Logan says he discovered his left hand after hearing that if you sit on your left hand til it goes numb then rub one out with it, it feels like it's a totally different person doing it. Apparently it worked. Lol Well fortunately none of these studs will be needing to jack off this afternoon so lets get these two started.Playing a game of poker, these two get bored as Cliff wonders what game they could play next. 'Fuck the cards' smirks Logan, -fuck ME!' That's all the invitation Cliff needed as they start to make out. Their clothes come off piece by piece as their tongues intertwine. Logan kisses Cliff's smooth pecs and abs as he makes his way south to his growing crotch. He tugs on Cliff's boner through his briefs a bit before hauling it out. He grabs his smooth balls and opens wide as he wraps his lips around Cliff's thick cock. Cliff's eyes roll back in ecstasy as Logan worships his dick. Logan licks and sucks on that meat, taking his time making sure to drive Cliff wild. Logan then stands and goes back to making out with Cliff as he drops his own drawers. Cliff pulls down Logan's boxers freeing his rock hard cock. They stroke their cocks together before Logan lies back and offers Cliff some cock. Cliff kneels between Logan's legs and goes to work swallowing that cock to the hilt. He savors every inch as Logan fucks his face on the chaise. He services Logan for a while before they reconvene on the couch in a scorching 69 so that they can each get as much dick as they want.Logan is horny and ready for that fuck he asked for as he gets on all four on the ottoman and offers up his sweet ass. Cliff suits up and slides his thick cock inside Logan's tight ass. Logan groans as he accommodates Cliff's thick meat. Cliff's smooth balls are soon slapping away at that hot ass as he pounds that hole. He fucks him doggy style burying that dick deep for a while before they switch positions. Cliff the sits back and spreads his legs to give Logan all the room he needs to sit on his meat. Logan straddles his club and impales himself on it. Once he gets all that cock back inside him he starts to ride that dick hard. He can't get enough of Cliff's dick as he grinds his tight ass all the way down to the hilt. But wait-there's more. Cliff then gets Logan on his back as he shoves his meat back inside missionary. Cliff can bury his dick as deep as he wants in this position and as he does he's ramming into Logan's prostate. Logan can't help but jack his throbbing cock as he gets nailed. 'Awww you're gonna make me cum' grunts Logan as Cliff fucks him harder. Logan blows his wad all over himself as Cliff fucks him. Cliff is next as he pulls out and unloads all over one load-coveredLogan.",
  "models": [
    {
      "name": "Cliff Jensen",
      "person_id": 28423
    },
    {
      "name": "Logan Drake",
      "person_id": 28418
    }
  ],
  "release_date": "2011-03-25",
  "scene_id": 55869,
  "series": "Ace in the Hole",
  "tags": [],
  "title": "Ace in the Hole"
}