{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have two new faces joining the circle this week as we welcome Kyle Quinn and Aiden Cole. Aiden Cole is 24 and from Boston. Kyle is 25 and from Washington, D.C. We wondered what these two liked to have when having some ice cream. Mint chocolate chip is Aiden's favorite while Kyle sticks to a more traditional strawberry. We then asked these two hotties to go way back into their mental archives to recall their favorite year in high school. Aiden's favorite school year was his senior year because he got to coast through. Kyle's favorite was quite the opposite. Kyle loved his junior year because he found it the most challenging and he loves a challenge. Aiden is single while Kyle has a partner at home. We wondered if they jack more than they fuck. Aiden, our str8 boy says he jacks a lot while Kyle does both a lot. Having a partner at home has its advantages. Aiden is somewhat new to the backdoor adventure and he admits after getting used to it finds it quite enjoyable. Well, that's wonderful news to Kyle who gets to tap that str8 ass for the third time ever. Third time is the charm. Kyle comes back after surfin' to find Aiden on the couch. Aiden comments on the hot little physique he's developing from all his water sports. Kyle says it's nothing and starts to admire Aiden's hairy chest and happy trail. One thing leads to another and soon Kyle's hands are in Aiden's pants. They strip down to their briefs as they each tug on each other's cocks. Their briefs fall by the wayside as Kyle moves in for a closer look. He wraps his lips around Aiden's cock as he starts to give him head. Aiden moans as he watches Kyle suckin' on his dick. Kyle nurses on his meat for a while before sitting back on the couch's armrest and pulling out his own boner for Aiden. Aiden doesn't miss a beat as he gets right to business blowin' Kyle. Go str8 boy! He wraps his fist around Kyle's cock as he jacks and sucks on Kyle's thick cock. Kyle can't get enough of that sweet mouth on his dick. ?Keep that going; cuz I wanna stick that thick dick in that ass of yours? teases Kyle. Aiden's not sure about that but Kyle isn't about to give him any other option.Kyle bends Aiden over and starts to tease that hairy ass with his fingers. ?Can I fuck you?? he teases as he sits back and watches Aiden start to get that hole loosened up with a dildo. He slides that dildo into that tight ass, grimacing all the while as Kyle watches patiently knowing he's going next. Aiden's hole is soon accommodating that dildo easier and Kyle doesn't wanna wait anymore. He gets Aiden on all four and starts fucking him doggy style. He rams deep into that ass over and over as Aiden does his best to take it. ?Take that fuckin' cock!? Kyle orders as he rides that hot ass. Aiden's face says it all as he struggles to take the deep fucking he's getting. Kyle loves that tight ass wrapped around his meat and is soon sitting back watching Aiden ride it. Aiden holds still as Kyle slams his cock up into that tight ass. It's not every day he gets access to a str8 boy's ass and he's taking full advantage. Kyle bounces Aiden on his dick for a while before moving the party to a missionary position on the couch. He pushes that thick dick deep into Aiden who can't help but beat off as he's getting nailed. That does the trick as he explodes all over his furry navel while Kyle is still pounding his hole. Kyle is next as he pulls out and shoots his thick load all over Aiden.",
  "models": [
    {
      "name": "Kyle Quinn",
      "person_id": 28443
    },
    {
      "name": "Aiden Cole",
      "person_id": 28445
    }
  ],
  "release_date": "2011-04-08",
  "scene_id": 55873,
  "tags": [],
  "title": "Drilling for Cole, Scene #02"
}