{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Aiden Lane is back in the house after way too long and we're definitely glad to have him back. Aiden's in for a special treat as he meets his 22 year old co-star, Captain Smirk who hails from Lakeland, FL. Aiden himself grew up here in Florida just up the way in Ft. Lauderdale. There's nothing like 2 hot local boys to show you how it's done. We wondered if these boys had any preference on whether a guy was cut or uncut. Captain Smirk saw his first uncut cock at 17 while Aiden saw his first glimpse in a porn magazine at 14. We then wondered how important kissing is to these two on the scale. They both agree that kissing is extremely important. We couldn't agree more. When all is said and done people will get to watch and enjoy or criticize. Aiden wanted to thank all of those who leave him praise and for those that sit back and hate he had a special message. ?I'd like to see you guys go to the website and click Become a Model. Let's see what you guys got to show.? It's not as easy as it looks. Leave the hate at home. Aiden comes in after playing a few rounds of B-ball and realizes he could really use a shower. He heads to the john where he strips and starts to soap up. The warm water running all over his body makes his thick cock come to life. Suddenly Captain Smirk comes in to the bathroom and tells Aiden he really needs to shower and jet so he's gonna have to join him real quick. Aiden is totally cool with that (?well, wouldn't you be!?) Captain steps in and as he starts to soap up their cocks start to rub together which leads to a lot more rubbing together as they start to make out. 'In a hurry'?riiiiight! That party heads back to the bedroom where Aiden goes down on Captain's rock hard cock. He bobs his head up and down on that cock as he fists it in a sensual combination. Captain loves the head he's getting and wants to give his hot buddy some in return. Again, Aiden is totally cool with that. (...cuz HELLO?wouldn't YOU be?) Captain opens wide as he takes Aiden's thick cock between his full lips. He looks up at Aiden as he worships that cock only to have Aiden hold his head and help dribble it on his meat. Captain leans his head back giving Aiden perfect access as he feeds it to him right down his throat leading perfectly into a steamy 69. But wait?there's more. These two go at it nursing on each other's cocks, taking their time as they build up even more sexual tension. Soon enough Aiden's attention wanders south of the equator as his fingers start to play with Captain's hot ass. He teases that sweet hole before sliding his tongue inside. He can't wait any longer as he kneels in position and takes that ass doggy style. He holds Captain by the waist and pounds that ass. He pulls that hot ass back onto his dick over and over as Captain grunts and groans still trying to accommodate the intrusion. Poor Captain might've bitten off more than he can chew,; but that hot ass feels way to good to pull out of. Aiden then kneels on the floor as he gets Captain to lay on his back. He aims that meat at the sweet hole that has his name on it and slides Captain right back onto it. That tight ass still tries to resist but Aiden's not taking no for an answer. He picks up the pace as Captain's cock swells to full mast. He starts to jack that throbbing cock as Aiden starts fucking him deeper and faster. Aiden slows it down for just a few before opening her up full throttle. He rides that ass as his smooth balls slap away at Captain's ass. To finish his buddy off he gets him to sit on his dick. Captain doesn't stand a chance as Aiden rams his ass full of dick hitting him in just the right spot. Captain soon explodes all over Aiden's happy trail. Aiden then busts his own hot load all over his face and chest making one hell of a mess. 'Who's smirking now, Cap-i-tan?'",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Captain Smirk",
      "person_id": 28447
    }
  ],
  "release_date": "2011-04-22",
  "scene_id": 55876,
  "tags": [],
  "title": "Doing Down the Lane, Scene #01"
}