{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Hunting season is in full swing this week on CircleJerkBoys as we welcome back Hunter Ford. It's been a while since we've seen this 22 year old native of the Lone Star State and he's looking damn good. Fortunately for Hunter, he will not be hunting alone seeing as the hunter becomes the hunted. Hunter Vance makes a much anticipated return this week and this Orlando heartbreaker is in for a wild ride (?and we don't mean Mr. Toad's!) We asked these studs if they could pick another city to live in aside from their hometowns where they'd want to go. Hunter F wants to live in South Beach for a year since he loves the water. Hunter V would venture west and live in Los Angeles for a year. We asked Hunter V. about his ass at an early age and even though he usually has girlfriends he admits at times he has dabbled with ass play with his girl. Just last week he had his girl strap one on and ?peg? him. Hunter F has never had a girl ?peg? him anywhere. He is mostly str8 so he's leaving his ass out of the equation. Well sounds like some foreshadowing to us so lets get this party started shall we? Vance is interviewing for a new roommate when Hunter Ford comes in for the available room. Seems his current roomies don't appreciate the fact that he and his girlfriend are swingers. ?What's a swinger?? Vance asks. Hunter decides it would be easier to show him as he moves in for a kiss. They make out as their clothes come off. Hunter strokes at Vance's cock through his briefs a bit before he takes them off and gets to work on that cock. If he's going to show him what a ?swinger? is, Hunter's going to have to pull out all the stops. Hunter F sits Vance back on the couch's armrest as he goes for it. Vance moans softly as he gets his pole worked. Hunter is hard as a rock as he gets his cock shined but soon he wants to return the favor. Hunter F lies back as Vance starts to nurse on his thick cock. Both of these studs are naturally smooth and as Vance sucks dick on all four we get a spectacular look at that hot ass of his. Hunter then straddles Hunter F as they make out and Hunter F is afforded access to that hot ass. He teases and caresses his smooth hole with his fingers making him want it even more.?Are you ready?? Hunter Ford asks as he has Hunter on all four before him. Once he gets the go ahead he starts to push his thick cock inside. Hunter starts to slowly tap that ass as Vance gets used to his cock. He slowly picks up the pace as he starts to ride that ass. That tight ass wrapped around his meat is driving him wild and he just can't get enough. After fucking that ass doggy style, Hunter flips Vance over on his back and slides back in for more. ?Dude, your ass feels good? he moans as he continues to bury his meat. He grabs onto Vance's thick thighs as he pounds away at that ass. An over the shoulder shot shows his thick cock disappearing deep into Vance's hole. Hunter then sits back and watches as Vance sits on his cock. Vance starts to ride on that cock as he bounces up and down on it taking every inch of dick he can get crammed up his ass. Vance is rock hard as he gets that prostate tickled and it's making his balls start to feel that familiar tingle. Soon his balls can't hold back any longer and as Hunter's cock is still buried deep he comes all over himself. Hunter then jacks his own thick load all over Vance's smooth pecs as his load dribbles down over his chest and abs.",
  "models": [
    {
      "name": "Hunter Vance",
      "person_id": 28320
    },
    {
      "name": "Hunter Ford",
      "person_id": 28415
    }
  ],
  "release_date": "2011-04-01",
  "scene_id": 55870,
  "series": "Ford Cumtry",
  "tags": [],
  "title": "Ford Cumtry, Scene #01"
}