{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have Christian Ray back with us this week and it's always a hot time when we have this ?Isle?o? (or Islander) with us. Barely 21, Christian lives here in Miami and feels at home in the Cuban community. Today we have a special friend here that we know Christian is gonna love, Mr. Nick Toretto. Nick is 27 years old and from Trenton, NJ. Nick is a thick piece of Jersey that would make anyone do a double take. He has it all: killer looks; a built bod; huge guns and a hot uncut cock. We wondered if they had a choice on vacation destinations what it would be. Nick would want to cruise to Alaska since he's lived in Hawaii and has lived in the tropics for the past 3 years. Christian would want to go to Italy and probably explore all that Italy has to offer (i.e. Italian men!) Nick is straight but admits he has enjoyed fun on both sides of the table. Doing so has taught him to be less judgmental and accept people for who they are versus what they do. We then asked these two where they love to shoot their nut the best. Christian loves to give a guy a hot facial busting his nut all over it. Nick trumps that admitting he loves to dump his load in his girls mouth then snowball it as she feed it right back to him as they make out. He just gets hotter and hotter. ?SEIZE HIM! lol Christian shows up for his personal training session with Nick only to admit he left his gym shorts at home. Nick hands him a pair and as Christian changes into them Nick realizes one of Christian's muscles is already swelling?his cock. Nick moves in for a kiss as he grabs Christian's cock. They tug at each others cocks as Nick sits Christian down so that his cock is in his face. Christian plays with it through his briefs before hauling out his thick uncut cock and going down on it. Nick moans as he watches his cock disappear down Christian's throat. Christian pulls back Nicks meaty foreskin as he runs his tongue along his knob. Nick sits back on the couch giving Christian all the room he needs to better service his cock. Christian licks all over Nick's massive frame ending up back on his meaty shaft. Christian slips down onto his knees as he goes to town worshipping Nick's thick cock. Nick can't get enough as he stands to continue feeding Christian. Nick then pulls Christian to his feet and bends him over checking out that hot ass he'll soon be inside of. Christian moans softly as Nick starts fingering his sweet hole.Nick runs his hands all over Christian's hairy ass. Nick spreads his ass wide open checking out that sweet hole he'll soon own. His cock is throbbing as he runs his fingers along Christian's ass crack. Nick can't wait any longer as he suits up and slides that cock inside. Christian can only moan as he gets his ass mounted. Bent over the incline bench, Christian holds on as Nick pounds him doggy style. Nick watches as his cock slams in and out of that hungry hole. Nick then pulls out and sits back on the futon pulling Christian into position. Christian catches on quickly as he straddles that cock and sits back down on that dick. ?Ride my cock? he groans as Christian proceeds to bounce on that dick. As Nick lays back we get a great view of his massive chest, huge biceps and his massive quads as Christian keeps riding that meat. Christian's cock is rock hard as he impales himself over and over on that Jersey dick. Nick then gets him on his back and slides back in missionary. This will do the trick for sure as Christian watches Nick's defined torso slap into him over and over. That cock hits just the right spot making Christian shoot a massive load all over himself. Nick isn't far behind as he pulls out and adds his own batch all over Christian's cum coated cock.",
  "models": [
    {
      "name": "Christian Ray",
      "person_id": 28431
    },
    {
      "name": "Nick Toretto",
      "person_id": 28446
    }
  ],
  "release_date": "2011-04-15",
  "scene_id": 55875,
  "tags": [],
  "title": "Nick at Nite, Scene #02"
}