{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Twenty one year old Johnny Johnes and nineteen year old Pauly Pomano make their respective debuts with us this week as we welcome these two Ft. Lauderdale natives. We asked these two if they won some money in the Lottery what they would do with that money. Pauly would want to take a cruise somewhere in the Caribbean. Johnny would want to go out and have a great dinner. We can assume there would be lobster, caviar and some bottles of Cristal at that table. We hear that Johnny has a big dick but this humble hottie keeps it on the down low. Bragging isn't sexy but we have a feeling that python he's packing is. Summer is coming and we wondered where these two would want to vacation if money6 were no object. Johnny would be getting ?leid? in Hawaii; while Pauly would be heading out to New Zealand. We asked them to describe their perfect blowjob. Johnny likes having his cock stroked while he likes getting his balls licked. Pauly likes when he gets his nuts tugged and no teeth. We can all agree on that one. Well let's hope they're taking notes cuz they're about to be put to the ?Help a Buddy Out? Test.Pauly is sitting back kickin' it, tossin' the ball around when Johnny walks in all pissed off at his girlfriend that won't put out. He starts to grope his growing cock trying to get Pauly's attention as well as some help on his growing cock. He undoes his jeans and hauls out his growing cock. ?Can you imagine Angela not wanting this?? he grins. Pauly can't see why she wouldn't as he starts stroking it. As it gets harder he opens wide and slides Johnny's thick black cock into his mouth, getting a taste of exactly what Angela's missing. Johnny grins ear to ear as he starts to fuck his buddy's face. He got just what he wanted and his dick is finally in a warm hole for a change. ?C'mon get that, Bitch? he taunts as he watches Pauly gag on his thick cock. Pauly then gets up and sets his own throbbing cock free. Johnny's not all that interested in that cock and turns him around to get a better look at that ass he wants. He slaps his thick cock up against Pauly's smooth ass before they start fencing with their cocks. They're both rock hard as Johnny goes in for the kiss. They kiss as they get hornier for more grinding their hard cocks and bodies together.Pauly isn't done on Johnny's cock as he sits down to get more. He worships that black cock and takes his time as he kneels between Johnny's legs to savor every inch. Once they're ready for more, Johnny suits up and watches as Pauly takes his cock. It takes Pauly a few tries to get that thick cock inside; but once it's in he goes to work taking every thick inch deep inside. With friends like Pauly who needs Angela? Pauly rides that thick cock while Johnny slams his meat up into his hole. Johnny then switches it up and bends Pauly over and slides back inside doggy style. Johnny grabs his cock by the base as he pummels that hot ass. He fucks Pauly faster and deeper as that ass gives way to his meat. Pauly is bucking his hole back onto that dick wanting all of it inside him. They then flip into a hot missionary on the ottoman as Johnny goes back to giving him dick. Johnny isn't far behind at all as he pulls out and explodes. Johnny blows a huge wad all over Pauly's cum soaked abs and chest. Whew! Who says 2 horny str8 guys can't find something mutually gratifying to do? ...wasn't us, that's for sure! lol",
  "models": [
    {
      "name": "Johnny Johnes",
      "person_id": 28448
    },
    {
      "name": "Pauly Pomano",
      "person_id": 28449
    }
  ],
  "release_date": "2011-04-29",
  "scene_id": 55878,
  "tags": [],
  "title": "Johnes' Crown Massacre, Scene #01"
}