{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Jake Steel is back on CircleJerkBoys and is helping us welcome Mr. Dant? Escobar. Dant? is 19 years old and he is from Los Angeles. Jake is up to 22 candles on his birthday cake and though he is originally from Maryland he currently lives in New York City. We asked these two studs where they would land on a diet scale if #1 meant a healthy diet and #10 meant a junk food junkie. Dant? says he'd be an 8 or 9 since he never eats what he should. Fortunately he has a fast metabolism. Jake considers himself a 5 since he usually eats healthy but eats just as much junk as he does good foods. For entertainment we wondered what they watch at home. Jake loves HBO and Showtime and is Happy 'True Blood' is coming back; as well as others new shows like 'Shameless'. Dant? prefers more outdoorsy type stuff. He likes hiking, camping, fishing and specially loves paintball. They are both self admitted exhibitionist and Jake has even done the Black Party in NYC where he was basically having sex in front of a roomful of people. Porn not only helped him discover his exhibitionist side; but also helped him explore it. Dant? loves to show it off and let's face it dancing around in his underwear is fun. Well, we're all about fun; so...Dant? is blushing because at 19 he doesn't know how to rollerblade as Jake helps him strap on a pair. He stands up in them completely unsure this is a good idea as Jake holds him steady.  Dant? loses his balance as they both land on the couch with Jake already in position to land a hot kiss. They start to make out as Jake's hands start to explore Dant?'s smooth frame. Rollerblades! ?what rollerblades? lol Jake starts to lick on Dant?'s nips and pecs and it isn't long before these two studs have stripped down to their briefs as they explore each other's toned bodies. Their cocks strain against their briefs and soon Jake's cock finds itself in Dant?'s warm mouth as he lays back on the weight bench. Dant? licks Jake's chest before getting back on that swollen meat. Dant? then stands giving Jake a chance to help him out. Jake sucks on his cock as Dant? helps bob his head up and down on his rock hard dick. They move the party back to the couch where Jake gets comfortable so that he can continue to stroke and suck on Dant?. Dant? is rock hard and ready for more than just Jake's warm mouth.Jake straddles Dant? as he lies back on the weight bench and slowly impales himself on his meat. Dant? groans as his cock sinks deep into Jake's hot ass. Jake starts to grind his ass down on to that throbbing cock. He then slides his hole all the way up Dante's shaft almost completely out before sliding all the way back down that pole again. Dant? wants a bit more control as he bends Jake over and slides his cock back in doggy style. Jake's tight ass resists as best as it can; but Dant? isn't about to take no for an answer. Jake is in ecstasy as he gets that hot ass fucked. Dant? holds his tight little waist as he slides his meat into him over and over. Dant? then moves the party south as he gets on his back. Jake straddles him on the floor and slides that cock back inside. Jake holds still as Dant? starts to piston that hot cock up into his hole. Dant?'s balls slap away at Jake's ass as he jack rabbits that dick deep; slamming it into him until his balls are a blur slapping that hole. Jake's groaning as Dant? hits his sweet spot and within seconds Jake is sent over the edge. He unloads all over Dant? who keeps fucking that tight ass until Jake's shot his last drop. Jake then dismounts and gets right to work helping Dant? bust his nut. Dant? jacks his cock off sending jet after jet of thick cum all over his smooth navel. See all the fun you can have without dancing around in your underwear?",
  "models": [
    {
      "name": "Jake Steel",
      "person_id": 28084
    },
    {
      "name": "Dante Escobar",
      "person_id": 28451
    }
  ],
  "release_date": "2011-05-27",
  "scene_id": 55887,
  "tags": [],
  "title": "Jake OFF, Scene #02"
}