{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Open the windows cuz it's gonna get hot in here as we welcome back Ridge Michaels and Cliff Jensen. Ridge is 22 and from Orlando, FL and Cliff is also 22 and from South Florida. We wanted to have a little fun with these two and asked them to describe each other if they were cartoons. Cliff thinks Ridge looks like a Go-go gadget character. Well Ridge thinks Cliff looks like a character out of an Archie comic strip. We then asked them to describe the perfect cock. Ridge likes the cock to be 7?-9? long, thick but not too thick. Basically what he's working with today. Cliff does have a rather nice cock. For Cliff even though he's str8, he likes cut cocks because they look cleaner. He also likes girls with clean snatches without the drapes. We won't get into too much detail on that topic. Cliff has a wild side and depending on who he's with it either comes out to play or keeps it on the DL. Ridge is looking forward to the fun today. They've worked together before so he's already familiar with Cliff's ?tool? set and loves how he uses it.Cliff and Ridge are on the couch as Ridge starts to comment on his body looking so much better. Ridge attributes it to working out and a good diet as Ridge lifts Cliff's shirt up to get a better look. Cliff is a-la-natural and we get to see his sexy furry chest. Ridge starts to lick his nipples as Cliff moans. They stand and continue kissing as they lose their jeans and play with the tents each is sporting in their briefs. They kiss and explore some more before setting their cocks free. Ridge drops to his knees as he gets a mouthful of cock. He licks and savors every inch as he shoves Cliff's cock all the way down his throat. Cliff groans in ecstasy as Ridge sucks that cock and plays with his smooth nuts. Ridge then gets on his back so that Cliff can fuck his face and tease him by running his cock all over Ridge's face. Cliff straddles Ridge's head as he points his cock south as it gets nursed on. He leans forward; burying his dick in Ridge's throat as he starts to play with Ridge's leaking cock. We weren't kidding when we said Ridge was excited about today, he's apparently dripping with anticipation!Ridge is ready as he straddles Cliff's cock. He holds it by the base, pushing Cliff's hand away. He's got this as he sits on that thick cock. His hungry ass gives way as Cliff's cock slides home. Ridge starts to grind his hot ass back onto that dick driving Cliff wild. Cliff just lays back and watches as Ridge works his magic. Cliff doesn't want to seem selfish so he starts to slam that dick up into that tight ass as his smooth balls bounce against Ridge's ass. Then Cliff gets Ridge off his cock and lies behind him so he can slide that cock back inside from behind. Ridge is so hungry for more dick that he bucks that ass back onto that dick as Cliff pounds away at his hole. Cliff then slides onto the floor and slides his thick cock back into that ass missionary. He grabs Ridge by the waist and impales him on his aching cock over and over. Ridge can't help but stroke his aching meat as Cliff stretches that tight ass wide. Cliff hits Ridge's sweet spot and it sends him over the edge as he coats his chest and abs. Cliff isn't far behind as he pulls out and blows his own wad all over Ridge.",
  "models": [
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    },
    {
      "name": "Cliff Jensen",
      "person_id": 28423
    }
  ],
  "release_date": "2011-05-06",
  "scene_id": 55880,
  "tags": [],
  "title": "Fall for a Cliff, Scene #01"
}