{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have hung hottie Chad Davis back in the studio and we have a special treat for our 21 year old West Florida coast native. We can thank Georgia for Chad's treat du jour, Mr. Cole Harvey. Cole is a hot 21 year old blond haired, blue eyed cutie with a charming drawl. We asked these boys how they felt about politics. Cole doesn't care one way or another. Chad admits it depends for him since he's a Republican; but does see the Democratic agenda worth considering. ...Well he couldn't be perfect. We then asked these two what they wish they were better at sexually. Chad wishes he was better at slowing down instead of rushing things when he gets horny. All we get from Cole is a blank stare. ?I can't think of much I could be better at? he grins. Aww, charming and cocky?where has this one been hiding? Luckily both agree their finest sexual qualities is endurance; so we might be here a while, fellas. On that note we better get this party started... Chad and Cole are sitting on the couch as Chad thumbs through his pics on his phone and comes across a pic of his dick. ?What's that?? gasps Cole. ?That's a picture of my dick? blushes Chad. Cole doesn't believe him and after Chad reassures him it is; he asks Cole to show him his. Cole undoes his shorts and hauls out his thick cock that's already at attention and not at all tardy for the party. Chad strokes it a bit before going down on it for a true taste of the South. Cole moans as Chad works his meat swirling his tongue around his throbbing knob. Cole then reaches for Chad's cock that is straining to be set free. He immediately gets to work returning the favor as he sucks on Chad's thick cock. Chad stands to give Cole better access as Cole deep throats that dick with ease. Both of these studs are lean and naturally smooth. The chemistry between them is steaming up our lenses as they trade off blow job after blow job. Just think this is just the oral portion of our talent contest. Hmmm.Chad sits back and suits up as Cole straddles his thick cock. He impales himself on that cock and starts to bounce on that disco stick. Cole came to play because he's giving ass and taking cock. He grinds that hot ass down on Chad's dick with everything he's got as Chad just moans and tells Cole how hot that ass feels. Chad's smooth balls are slapping up against Cole's hungry hole as Chad thrusts up into him. They then move over to the futon where Cole gets bent over and fucked doggy style. Chad slams that cock back inside as his low hangers continue to slap away at that hole. Chad grabs him by the waist and slams inside over and over. Then Chad gets Cole on his back on the ottoman and starts fucking him missionary. This one always does the trick and sure enough Cole shoots his nut as Chad impales him. Chad's nowhere near done as he continues to slam his thick cock inside. When Chad does get that familiar tingle he pulls out and shoots his massive load all over Cole; the ottoman; the rug and the camera crew. lol",
  "models": [
    {
      "name": "Chad Davis",
      "person_id": 28421
    },
    {
      "name": "Cole Harvey",
      "person_id": 28440
    }
  ],
  "release_date": "2011-05-13",
  "scene_id": 55883,
  "series": "Cole in One",
  "tags": [],
  "title": "Cole in One, Scene #02"
}