{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "AJ Banks is back this week and he's here to help us welcome Junior Verde. Junior Verde is 20 years young and he is originally from Akron. For those of you unfamiliar with AJ, AJ is from Daytona Beach and finally 21. He can finally drink (legally anyway). lol We asked these two studs what they like to wear when they want to dress to impress. AJ likes to wear his Ralph Lauren suit when he wants to impress a girl. Junior would just throw on some skinny jeans and a tight shirt. WORK! We then wondered if they had to name their penis, what that name would be. ?It already has a name', giggles AJ, 'it's funny but his name is Junior.? Ouch. Junior blushes and since his pecker has no name decides on ?Jim?. We then asked them to tell us about their first blow jobs. AJ was 16 when he got his first blow job from his manager at Wendy's who was gay. His manager drove him home after work and ended up blowing him in AJ's driveway. We guess someone was up late so he could eat great. Mmhmm. For Junior, giving head was more memorable when he first experimented with his best friend. You know what they say, it is always better to give than to receive. Ever wonder who came up with that $@?!#??  AJ and Junior are ready to go to the beach so AJ asks Junior to put some sun tan lotion on his back before they go. Junior lathers lotion all over his back and when he's done AJ asks him to do his front as well. As Junior rubs AJ's chest and abs AJ leans in for a kiss as they start to make out. Beach! What beach? Their shorts drop as they start to play with their hard cocks. AJ pulls Junior's cock out and goes down on him. He bobs his head up and down on that meat so deep he gags. Junior just lies back and watches as he gets his dick sucked. ?You like suckin' that cock?? Junior groans as AJ moans his answer with a mouthful of cock. AJ gets off Junior's cock for some attention on his own. The lotion trick wasn't meant to get Junior off. ?HELLO! lol Junior takes to AJ's throbbing cock like a starving calf and AJ ain't complaining. AJ slowly fucks Junior's face wanting to get as much of his dick inside his wet mouth. ?Play with my balls? AJ moans as Junior tugs on his hairy nut sack. AJ then gets on his knees between Junior's legs to get some more of that cock. He slobbers all over that dick for a bit before moving up to make out some more. The next thing we see is AJ's cock as it breaches Junior's hairy hole. Once inside AJ starts to fuck that hole deep. ?You like that?' AJ grunts as he slaps Junior's ass, 'I love that tight little ass.? Junior takes it like a champ as AJ pounds his ass doggy style. Junior can't get enough of AJ's meat as he bucks his hot ass back for more.  AJ then gets Junior to flip over onto his back to get some more missionary. He spreads Junior's hairy legs apart and rams his dick back in. Junior is writhing in ecstasy as he gets that hole stretched. AJ looks south as he watches his cock sliding in and out of Junior's tight ass. ?Aww, you like that dick?? AJ grunts as he keeps fucking the Ohio out of Junior.  AJ's hot ass just slams away against Junior's as he keeps burying that cock deep. AJ then sits back on the couch as Junior straddles him in a reverse cowgirl position. Once he gets back on, he starts to ride it. AJ tells him to take that dick as he holds Junior's by the waist and helps bounce him on his meat. Junior grinds his hot hole down onto AJ's shaft and it's hitting him in all the right places. ?Fuck, I'm cumming!? Junior moans as he jacks out his loaf all over his furry happy trail. AJ is next as he too unloads jacking himself off all over his well oiled abs. NOW they're ready for the beach, Biatch!",
  "models": [
    {
      "name": "AJ Banks",
      "person_id": 28005
    },
    {
      "name": "Junior Verde",
      "person_id": 28018
    }
  ],
  "release_date": "2011-05-20",
  "scene_id": 55884,
  "tags": [],
  "title": "AJ Banks It In, Scene #01"
}