{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Surprise, Surprise! Two hot, horny boys make their debut this week as we welcome Ryan Lynch and Trevor Bridge. Ryan is 19 years young and from central California. Trevor is 22 years young and he's from Ogdensburg in northern New York. Both of these studs love going on vacation, in fact Trevor's on one right now, we asked them to describe their perfect vacation. ?Definitely somewhere tropical, I like beaches and sunshine? says Ryan. ?I want three things: I wanna be naked; drunk; on the beach? chimes in Trevor. Well, they're both basically arrived. This summer they will be busy already. Ryan wants to relocate to San Diego and Trevor wants to take a cruise to Greece. We asked them whether they would prefer a nice ass or a big dick. Big dick gets the resounding nod even before we finished the question. Along those lines we thought we'd wrap up our recon by asking this horny duo what they wanted to try in bed that they had not yet had the opportunity to. ?I want to try an open 3 way with another guy and a girl? says Ryan. Trevor then steals the ?Ms Congeniality? sash by uttering the following?: ?I want to be triple-penetrated!? Really?! ?Where do you go from here? (...the E.R. perhaps)Ryan is on the weight bench as Trevor helps him stretch. As Trevor tests Ryan's flexibility by helping him with legs then arms he then pulls off Ryan's tee. He starts to massage Ryan's shoulder which leads to some kissing as their hands starts to explore the other. The chemistry is sizzling as these two kiss passionately unable to get enough of the other. Their gym shorts are both sporting tents as they lose them. Trevor then drops to his knees wanting to know what Ryan's cock tastes like. Ryan moans as Trevor goes to work on his thick cock. Trevor takes good care of Ryan's meat remembering to lap at his smooth nuts before going back down on him for more. Ryan is pleasantly surprised as he gets his cock spit shined. Then it's Trevor's turn as he sits back on the weight bench to give Ryan access to his swollen cock. Ryan is more than willing to return the favor as he makes himself comfortable on his knees sucking on Trevor's cock. Trevor then goes back for some more cock as Ryan starts to explore his outrageous ass. Trevor's ass is up in the air as Ryan's fingers start to slip inside it getting a preview of what's cumming. Ryan can't wait to get in that ass and decides to tease it with a dildo. He opens that ass up a bit as Trevor grimaces as he takes it deep. Enough foreplay as Ryan suits up and loses the dildo. He slides his hot cock deep into Trevor's smooth, beefy ass and starts to pound him deep. ?Pound that ass?, he grunts as Ryan fucks him deeper. The sounds of Ryan's balls slapping that ass and their moaning fill the room as they continue their fuck fest. Ryan then sits back on the bench as Trevor rides his cock. He bounces up and down on that hard cock as Ryan just sits back and watches his meat disappear. ?That's the way I like it? coos Ryan encouraging Trevor to take his cock deep. Ryan spreads Trevor's cheeks apart so he can see his cock sliding in and out. Trevor is rock hard and jacking his cock making sure not to cum too soon. Ryan then flips Trevor over onto his back and slides back inside for more. He slams that dick in faster and harder as Trevor jerks off. Ryan picks up the pace and it makes Trevor lose it. ?Aww fuck, you're gonna make me wanna cum? Trevor grunts as he gets the cum fucked out of him. Ryan is next as he pulls out and adds his own thick batch to the warm mess.",
  "models": [
    {
      "name": "Ryan Lynch",
      "person_id": 28452
    },
    {
      "name": "Trevor Bridge",
      "person_id": 28453
    }
  ],
  "release_date": "2011-06-03",
  "scene_id": 55889,
  "tags": [],
  "title": "Playing Bridge, Scene #02"
}