{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Someone crack a window cuz it's gonna get hot up in here as we welcome back Parker Brookes and Cole Harvey. Parker Brooks is 23 years old and originally from Alabama while Cole is 22 from neighboring Georgia.  We asked these boys what their dream car would be. Parker wants a black Maserati Spyder and Cole just wants a BMW he doesn't care which model as long as it's black. We then asked these boys where they would go if they had a week off and money was no object. Parker would take his dream vacation to Costa Rica while Cole would take his days off laying out in the Bahamas workin' on his tan line...or lack thereof. Both of these studs are ruff and ready and on a horny sex drive scale of 1-10 we asked them where they fall on that scale. Parker admits he's always horny and has a really high sex drive. Cole says he's about a 7 on that scale. Cole prefers his men cut while Parker doesn't mind some foreskin as long as it doesn't become a mission to uncover. There's a visual for ya. Lol Well, fortunately, we will not need any more visuals this afternoon as these two horny boys get better acquainted... Parker is sitting in his room with his hand in his pants when Cole walks in and decides to get in on the action. He takes over groping Parker's cock as they start to make out. Their clothes start to disappear as they stand and make out while their hands explore the other. Their briefs are the last to come off as their boners starts to rub together as they continue kissing unable to get enough. Parker can't wait any longer as he heads south (pun intended) to get a taste of Cole's cock. Cole moans as he gets his cock worked by one hungry Alabama boy. ?That's pretty big? muses Parker before going right back down on his thick cock. Parker's own cock is throbbing as he sucks on Cole's meat; but his meat won't go unattended for long. Parker lies back on the couch and spreads his legs wide giving Cole all the room he needs to return the favor. Cole goes to work swallowing every inch he can as he looks up at Parker. Parker is rock hard as he watches his throbbing cock disappearing into Cole's hot mouth.Parker then sits back on the chair as Cole straddles him as they go back to making out. Parker's fingers start to explore Cole's hot smooth ass. Cole is so ready for that dick he's growing restless. He takes hold of Parker's cock and aims it home as he sits on it taking it all the way to the hilt. Parker gasps as he slides all the way in as Cole starts to ride that meat grinding on it, wanting every inch buried inside him. After Cole bounces on that dick for a while, Parker switches it up by bending this Georgia peach over for more. He gets Cole on all four and slides his long cock back in for more. ?Aww, FUCK ME!? grunts Cole as he gets that hot ass of his stuffed. ?It's so tight? coos Parker as he slams that meat home. He pounds that ass getting closer to climax. Cole then gets put on his back for the grand finale. Parker takes that ass missionary and Cole gets to finally jack that aching cock as he gets rammed. Parker picks up the pace, hitting Cole's sweet spot and it's enough to send Cole over the edge. He busts his nut as Parker pulls out getting ready to explode himself. Parker then shoots his load all over one spent Cole adding his own batch to the mix.",
  "models": [
    {
      "name": "Parker Brookes",
      "person_id": 28348
    },
    {
      "name": "Cole Harvey",
      "person_id": 28440
    }
  ],
  "release_date": "2011-06-10",
  "scene_id": 55890,
  "series": "Cole Mining",
  "tags": [],
  "title": "Cole Mining, Scene #01"
}