{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Christian Ray is back with us this week and he's brought along a friend by the name of Ryan Matthews. Ryan, a Michigan native, is 21 years old and hails from Grand Rapids. For those of you unfamiliar with Se?or Ray, he is Cuban and this sexy 20 year old now calls Miami home. We asked these two studs what they were planning on doing for their next birthday. Christian wants to take a cruise with his family for his 21st birthday. Ryan would want to go out to dinner to celebrate at his favorite Italian restaurant up in Boca Raton. He loves Italian and their pizza hits the spot. Summer is just around the corner so we asked these studs if they won (2) tickets to see the concert of their choice; whom they would invite along. Christian says he would take himself; so we guess he'd want the extra seat in case he gets stuck behind anyone taller than 5'7. Ryan, on the other hand, would definitely take his fianc?. Smart man.  Lol Then, just for fun, we asked if they could be totally invisible and spy on anyone they want having sex who would they want to watch doing the deed. Ryan has a crush on Zac Efron so he would love to see him getting' his nut. Christian tops that easily with Lady Gaga. Even though we're pretty sure that answer will be hard to top?Christian won't be!  Shall we...Christian starts playing with Ryan's crotch as it begins to tent from the attention. He struggles with the belt as Ryan offers to help him out. Christian's got this as he pulls down Ryan's jeans. Ryan moans as Christian teases his cock through his briefs. Christian then stands and drops his own pants as they grope each others cocks. Ryan licks Christian's chest as he heads south to get a closer look at that uncut cock. He starts to suck on that cock as Christian moans his approval. Ryan savors every inch of that dick as Christian helps bob him on his cock. Ryan is in no hurry as he worships that dick. Ryan then leans back as Christian moves in to return the favor. He is denied! Puzzled he asks why not. Ryan grins and says ?Lemme show you? before doubling over and taking his own knob into his mouth. With a gift like that, Saturday nights at home could never be boring. Ryan bobs up and down sucking his own cock as Christian watches in amazement. Christian's not gonna be left out as he takes over sucking on Ryan's spit shined cock. Ryan lets him have his fill before getting him on all four to inspect that sweet ass.Ryan fingers that hot hole for a bit teasing him before asking him if he wants to get fucked. We're pretty sure that was rhetorical. Christian is soon moaning as Ryan delivers the goods deep and hard. The sound of Ryan's balls slapping that ass fill the room as he takes him doggy style. ?You like that dick?? he grunts as Christian takes every inch. Ryan then pulls out and sits back as Christian turns around and sits on it. He impales himself for more as he starts to bounce on that dick like he's on a mission. Christian's own cock is rock hard as he rides that thick cock. Ryan loves just being able to sit back and get that pole ridden. Ryan loves that hole but he wants to take back control as he flips Christian over on his back; picks up his legs and slams that dick in for more. He's taking this ass to the finish line as he pounds harder and harder. Christian's cock is aching as he gets his prostate battered. Ryan rams away getting them closer and closer to climax. When he feels that familiar tickle he pulls out and jacks off all over Christian who has already busted a huge load all over himself. Ryan's splatters all over Christian's cum covered chest and abs.",
  "models": [
    {
      "name": "Christian Ray",
      "person_id": 28431
    },
    {
      "name": "Ryan Matthews",
      "person_id": 28455
    }
  ],
  "release_date": "2011-06-24",
  "scene_id": 55895,
  "tags": [],
  "title": "A Ray of Sunshine, Scene #02"
}