{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Nikko Alexander is back in the house and looking better than ever. He is giving ?chiseled? a run for its money. Nikko is from Orlando, FL and recently turned 26 years young. Fortunately for Nikko, one of those stars that fell on Alabama hitched a ride south cuz sexy Parker Brookes is in the house as well. Parker is 23 and now lives in Fort Lauderdale. We asked these two studs what subject back in school did they wish they'd paid better attention in. Math for Parker while Nikko wishes he'd paid better attention in anatomy. Looking at these two we wonder if they were pet people and if so what kind of pets did they have. Parker has a female schnauzer named Tootie. Nikko laughs when he hears that; but then blushes admitting he has a Pit bull named Snizzles, cuz he sneezed all the time. We then asked these two to tell us what they would win Gold medals for in the Sexual Olympics. ?Everything under the sun? is Nikko's humble response. Parker would win 3: Rimming; Fingering and Topping. Well now that we know their boasting r?sum?s are packed?we should find something else to ?pack?. ...Any suggestions?Parker is kicking back looking through a dude mag when Nikko barges in on him. He quickly covers up with the mag but Nikko is on to him. ?You need to learn how to lock the door if you're gonna be jacking off on my couch? He pulls the magazine away to discover Parker is rock hard. ?What are you gonna do with that thing?? Nikko asks. What I'm gonna do with it?' asks Parker 'it's what you're gonna do with it.? This just got interesting as Parker stands up and whips out his thick oversized cock. Nikko is a quick study as he gets that cock fed to him. Parker is rock hard as Nikko starts to suck on his meat. Nikko uses his mouth and fist to swirl around Parker's aching cock. Nikko looks up at Parker with those bedroom brown eyes as he deep throats every inch. Parker than sits back and strokes as Nikko gives him a strip tease showing off his hard cock and sweet ass. ?You want that ass huh?? Parker is definitely onboard for that as Nikko bends over and hangs his boxers on his rock hard cock making it dance in circles. Nikko starts to dance for him as he shows off his sculpted abs and that ass as he moves over to feed Parker his hard cock.Parker opens wide as Nikko slaps his dick on his face and tongue. Parker grabs Nikko's huge nut sack as his finger slips up into his tight ass. He deep throats Nikko's cock making him moan like a bitch. Parker then turns Nikko around as he jams his Gold medal winning tongue deep inside his smooth bubble butt. ?Eat that fucking ass!? Nikko begs as Parker drives his tongue deep. Nikko shoves Parker's face deeper in his ass wanting that hot tongue all the way inside him. Parker moves him over to the ottoman where he spreads that ass open and goes down to toss more salad. Now that that hole is wet and ready, Nikko then suits Parker's cock up before impaling himself on it in a reverse cowgirl. Parker loves the feel of that tight ass wrapped around his cock as Nikko starts to ride him hard. Nikko then twirls around so he can watch Parker's face as he continues slamming that meat deep inside his muscular ass. Parker then switches it up by bending him over and pounding him doggy. That pounding leads right into missionary where Parker slams it home. He fucks Nikko so hard it makes him cum, pulling out and exploding all over Nikko. Nikko then jacks his own uncut pistol off all over his cum soaked bod.",
  "models": [
    {
      "name": "Nikko Alexander",
      "person_id": 28001
    },
    {
      "name": "Parker Brookes",
      "person_id": 28348
    }
  ],
  "release_date": "2011-07-08",
  "scene_id": 55899,
  "tags": [],
  "title": "Parker Around Back, Scene #02"
}