{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Aiden Lane is back on CircleJerkBoys and we're always happy to have this 26 year old Ft. Lauderdale native with us. Aiden is in for a real treat as we welcome back another familiar face. Back representing the Lone Star State of Texas is 22 year old Hunter Ford. We asked these two to take a good look at each other so that they could cast a leading man to play the role of each other's autobiographical movie. Aiden nominates Dwayne ?The Rock? Johnson to play Hunter in his movie. Hunter thinks Ryan Phillippe could definitely do the role of Aiden justice in the Aiden Lane Story. We then asked them when the last time they really laughed out loud. Hunter says he laughs all the time because his family is a bunch of pranksters. Aiden gets high so much and laughs he's all about the ?lol?. We then asked them if there was anything sexual that they were asked to do that they didn't think they'd like to do but did. Aiden giggles when he admits that he had a request from a costar way back when who asked him to pee in their mouth. He did and admits it was hotter than he thought it would be. Well, Hunter prefers clearer skies to Golden Showers; so he's more on the str8 and narrow ?yet still ?open? minded.Hunter finds Aiden's phone and when he picks it up he notices a picture of a big dick on his phone. He confronts Aiden on why he has a cock pic on his phone, Aiden tells him it's his and that he was sending that to an X. Hunter is in disbelief so Aiden tells him to check it out for himself as he pushes his head into his growing cock. Hunter licks at it before pulling his shorts off. ?That might be your dick!? Hunter beams as he gropes it through Aiden's boxers. Aiden leans down and starts to kiss him as he positions himself between Hunter's thighs. He goes for Hunter's cock that is already rock hard and pulls it out of his tight boxer briefs. He swallows it to the hilt as Hunter gasps from the sensation. Aiden savors every inch of that dick as Hunter watches him pleasure his cock. As Aiden swallows his cock deep, Hunter starts to explore Aiden's beefy ass as he gets a quick preview. Hunter then wants to return the favor as he goes to work sucking on Aiden's thick 8? cock. Aiden sits back in ecstasy as he finally gets the attention he's needed on his throbbing cock.Hunter takes his time servicing Aiden and before they realize it, they've managed to end up in a steamy 69 on the floor. They lay on their sides as they continue to suck on each other's rigid cock. Hunter then sits back on the couch and watches as Aiden straddles his meat before impaling himself on it. He grunts as that smooth ass slowly gives way. Hunter grabs his ass and slowly rocks him back and forth on his swollen meat. Aiden's doing his best to take that cock as he starts to ride it faster. That cock is beginning to feel good up his ass and he's ready for more. Hunter gets him on his back as he slowly slides his cock in for more. In this position he can get it in much deeper and is soon sliding his dick in all the way to the hilt. Aiden is still groaning trying to accommodate Hunter's thick intruder. Aiden's own thick cock is throbbing and getting fucked in this position is getting him close to climax. Hunter picks up the pace and literally fucks the cum out of Aiden who loses it all over his smooth abs and chest. Hunter then pulls out and blows his own wad all over cum covered Aiden.",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Hunter Ford",
      "person_id": 28415
    }
  ],
  "release_date": "2011-07-01",
  "scene_id": 55897,
  "tags": [],
  "title": "A Ford in the Lane, Scene #02"
}