{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Hunter Vance is back in the house and looking better than ever. Hunter is here to help us welcome Camden Christianson. Camden is a sexy, inked 21 year old from South Georgia but currently splitting his time between the Tampa Bay area and Los Angeles. Hunter, for those of you who aren't familiar, will be 28 this summer and he's from the Tampa bay area himself. We asked these two if they could nominate anyone to grace the face of a postal stamp; whom they would pick. Camden nominates his middle school teacher who made a lasting impression on him growing up. She really gave him the bearings to get to where he is today in his profession outside the porn world. Hunter took a more conventional approach and nominates himself to be on a stamp. He'd definitely get around then, huh? lol We then wondered if their sex lives were made into miniseries what would they call it. Camden would call it ?Gays of Our Lives? and it would need to have 8? parts to it. . Hunter's sex life would have to be a long running series like 'Friends'?he'd call it ?Drama?. Nice. Well there's nothing like a good trailer to get an ?idea? of what we'd be in store for; so lets sit back and get an idea...or two.Hunter asks Camden to help him out by filming a personal ad for him. Camden agrees and starts to film Hunter as he starts to pose and flex for the camera; showing off his ripped abs and defined pecs. Hunter gets turned on as he feels himself up and starts to grope his growing cock. ?Looks like you're getting excited there? Camden grins as he asks Hunter to show him just how excited he is. Hunter hauls out his hard cock that he keeps trimmed smooth. Camden is grabbing at his own crotch trying to accommodate the growing cock in his own shorts. Camden leans forward to get a closer look and before Hunter realizes it he has Camden's mouth working his cock. Hunter's not about to complain as he gets his cock sucked. Camden strips off his tee showing off his numerous tats as he asks Hunter if it feels good.  Hunter loves the attention he's getting and pulls Camden up so they can make out for a bit. Hunter then slides down to see what Cam's got to work with. He's pleasantly surprised as he takes Camden's thick cock out to play. He wraps his lips around it and tries to cram all 8?? of it deep down his throat. He goes to work licking and sucking on his hairless nuts while swirling his hot tongue around that shaft making Camden moan in ecstasy. Camden then gets on his knees and gets back to work sucking on Hunter's cock. He uses that position to his advantage as he pushes Hunter's legs up and goes to town on that sweet ass. He licks and sucks on that sweet hole, shoving his tongue as deep as possible making Hunter squirm with anticipation. Hunter is getting horny for cock and Cam's got just what he needs. He gets up into position and slides his cock inside. Hunter moans as his hot ass gives in. Camden fucks Hunter missionary as he holds his legs in the air. Camden has an amazing view as he watches his thick cock disappear into Hunter's hole. Camden then switches things up and sits back to get Hunter ride his cock at his leisure. Hunter straddles him and sits on that cock before bouncing on it some more. Camden sits back as Hunter does all the work. Camden then lies on the floor and lets Hunter ride his cock some more side saddle. Hunter is all in as he grinds that dick deep bouncing up and down faster and harder as Camden's cock stretches his ass open. That cock is pounding his prostate and as he gets closer to busting his nut they lay back side by side. Hunter is the first to blow creaming his load all over his smooth navel. Camden is next as he unloads a massive load sending load shooting everywhere.",
  "models": [
    {
      "name": "Hunter Vance",
      "person_id": 28320
    },
    {
      "name": "Camden Christianson",
      "person_id": 28454
    }
  ],
  "release_date": "2011-06-17",
  "scene_id": 55892,
  "tags": [],
  "title": "Shooting Stars, Scene #01"
}