{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "A slice of Havana is in the house this week as Vinn Deisel makes his debut. Vinn was born in Cuba and has been in Miami for the last 10 years. He's now 21 and loves living in Miami. He has a girlfriend that keeps him busy. He gets attention from men as well and he doesn't mind them staring. He's a stripper at an all male club so he's used to people staring. He has a great physique and the dedication at the gym has really paid off. He admits he loves girls that have it all: big tits, big ass-the works. Fortunately he's got that taken care of seeing as hes been with his current girlfriend for 4 years now. He admits he doesn't get it as often as he used to; but he's not one to complain. Vinn is a horny one and admits he has to jerk his dick off whenever he gets the urge between sessions with his girl. He lost his virginity at the age of 12 to a girl while they were just 'playing around'. Mmhmmm. What's that game called and how can we sing up for it? lol The good thing is that he hasn't stopped fucking or stroking since and today he's gonna give us a front row seat to one of his warm up sessions...Vinn starts to give us a sizzling strip tease as he peels off his tee. His abs are the first thing we see as he starts to run his shirt behind his neck. Vinn is naturally hairless and makes sure everything else follows suit. He starts to flex his huge biceps as our eyes feast on an endless array of drool worthy manscape. He's rockin tight jeans that have tears in them giving you an idea of what's just beneath the surface.  He undoes his belt and removes it slowly before running it behind his neck. He then slides it between his massive quads and gives us a little dance as he teases us wanting us to want more. It seems to be working since our eyes are glued to our monitors. He undoes his jeans and starts to play with his cock inside his tight orange briefs. He pulls them down some as we admire the scorpion tattoo just above his... you know. Vinn is dark and defined. His left shoulder, shoulder blade and bicep have a large tribal tattoo adorning them that give this bad boy a look all his own. His sun-kissed skin and cinnamon nips are a sight to behold as he dances and shows off his muscles writhing beneath his skin. He finally loses the briefs throwing them at the camera.Vinn is rock hard now and using both hands to stroke his cock. His cock is shaved smooth like the rest of his body. A view from behind gives us an amazing view of that hot ass of his as he continues stroking his Cuban cock. He then goes face down on the couch and starts to dry hump it. His bubble but rises and falls as he mock fucks one lucky futon. Vinn finally flops over and gets to work on his throbbing, uncut cock. He holds it at the base and proudly shows it off as it oozes with anticipation. He looks at the camera with those bedroom eyes knowing very well he has something you want. He slowly licks those full lips of his making you want him even more. His cock is getting really close to cumming as his balls begin to pull up tight around the base of that cock. He gets on his knees and goes for it as his hand becomes a blur. He jacks off faster and faster and as he does his breathing begins to labor. Next thing we see is Vinn shooting his thick load. He groans softly; shooting load after load of thick cum all over the couch below; finally giving his cock the release it's been begging for. Well, If anyone needs some Cuban Leche for their coffee today?we got you (...& that couch) covered!",
  "models": [
    {
      "name": "Vinn Diesel",
      "person_id": 28462
    }
  ],
  "release_date": "2011-08-12",
  "scene_id": 55909,
  "tags": [],
  "title": "Smoking a Cuban, Scene #02"
}