{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we gladly welcome back Alex Andrews. It's been 6 months since we've seen this 20 year old dimpled hottie who now calls Colorado home. Fortunately for us, Alex has brought along a fresh face with him and you're all in for a treat as we welcome Cody Weaver to CircleJerkBoys. Dirty blonde; eyes of blue and a smile that lights up any room, Cody is 21 years young and from the Sin City known as Las Vegas. We asked these two when they went out and partied late leaving them a tad hungry what hits the spot and who makes it. ?I make it the best' beams Alex 'I'm a pretty damn good cook in my opinion? This one's a keeper favoring either Steak or Sushi. For Cody his late night fav is a green bean casserole with all the fixings. When it comes to favorite TV shows and guilty pleasures, Alex loves watching Scrubs. For Cody he loves to watch a show that makes him feel like a neat freak, Hoarders. Mess!?What mess? lol We wondered what kind of guys these boys like. Alex likes guys that are shorter than him and they can't be an asshole. Cody likes a level headed guy, has to be fit and wants a guy that will push him to be better.Alex is kickin' it in his room watching some porn on the laptop and stroking his hard cock through his loose shorts when there's a knock on the door. Cody walks in asking about the laptop that Alex is selling on Craigslist. Cody grabs the laptop off Alex' lap as Alex tries to stop him. When he opens it up he finds gay porn as Alex blushes and blames it on his ?girlfriend.? Cody ain't buying that excuse and soon discovers the boner in his shorts. He grabs it and when he does Alex pushes his head down on it giving Cody all the permission he needed. Alex hauls out his thick cock and puts it into Cody's hot mouth. Alex moans as Cody goes to town worshipping his meat. Cody is no stranger to cock it seems as he swirls his fist around the base while working the head with his mouth and tongue. Reap what you sew they say as Alex moves to strip Cody's jeans off and start returning the favor. Cody is rock hard as Alex wraps his lips around that thick cock. Cody loves the attention he's getting but after a while he wants more of Alex' throbbing meat. He wants to get that bad boy rock hard for things to cum...These two are into each other and flip flop back and forth feeding each other cock until they can't stand the build up anymore. After an intense 69 on the chaise Alex tells Cody he needs that cock in his ass. Cody isn't one to disappoint as he suits up and watches as Alex impales himself on his dick. Once he gets it in he starts to ride that meat hard; grinding that hot ass all the way down wanting every inch of it inside. Alex' own cock is bouncing like a trampoline as he takes that dick. But wait?there's more. Alex then gets up and bends Cody over on the chaise and slams his thick cock deep into that tight ass. He isn't wasting any time and is soon pounding away at that ass. Cody moans as he gets his ass stretched wide as Alex' balls slap away at that hot hole. Missionary is next as Alex gets Cody on his back and slides back in for more. He holds Cody by his legs and rams away as they both near climax. Cody is the first to bust his nut all over himself as he watches sweaty Alex beating his meat seconds from blowing all over him. It that visual doesn't make you wanna shoot what will? Alex then busts his nut all over Cody after which he grins and says, ?...turns out the computer is not for sale after all. Would you rather have an iPad?? Bait & switch never looked this good. lol",
  "models": [
    {
      "name": "Alex Andrews",
      "person_id": 28438
    },
    {
      "name": "Cody Weaver",
      "person_id": 28456
    }
  ],
  "release_date": "2011-07-15",
  "scene_id": 55900,
  "series": "Love @ First Byte",
  "tags": [],
  "title": "Love @ First Byte, Scene #01"
}