{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Two new faces grace your monitors this week and we can't wait to introduce you. Sean Evans is 21 and though originally from New York he currently lives in Savannah, Georgia. Apparently he already picked up a Southern twang to his voice. Matthew Keading is just 18 and he's from the west coast from Northern California. We asked these two what they considered a perfect Saturday night. Sean likes hangin with his friends, having fun and staying out of trouble. Matthew's idea of a perfect Saturday night would include playing video games with one of his best friends. As for education, we wondered if they could get free classes what would they want to sign up for. Matthew would sign up for either Astronomy or Physics class while Sean would pursue Mathematics or Law. We then wondered if they preferred to jack off wet or dry. Matthew likes it dry while Sean prefers it wet. We then decided to ask them one last question before the swimsuit competition and that was what they felt they were best at in the bedroom. Survey says they both feel they are great in the oral department. Well, let's put their best assets to work... say Aahh! lol           Sean is hangin at home and not by choice when Matthew walks in umbrella in hand. Definitely not beach weather either apparently as they start to bitch about the weather. Sean notices the bulge in Matthew's pants and discovers there may be life without cable. He starts to rub his crotch as they start to strip each other as they kiss and make out. Matthew starts to lick on Sean's chest as he makes his way down to his cock. Sean pulls off his jeans giving Matthew all the room he needs to play. Matthew all the room he needs. Matthew isn't wasting any time and is soon deep throating as much of that cock as he can. He bobs up and down on that thick cock while Sean just kicks back and enjoys. They make out a bit as Sean strokes Matt's cock. Matt gets up so that Sean can return the favor as Sean gets his mouth on that cock. Matthew stands up as we watch Sean sucking on that thick cock and low hanging balls. Matthew watches as he gets his dick serviced by his hungry friend with benefits. Matt then gets on his knees to suck some more dick before turning Sean around to eat that ass and get him rock hard and ready for more. Matthew then bends over and braces himself as he gets that dick pushed inside him. Sean grabs that hot little waist of his as he slides his thick cock in and out of him enjoying that tight ass wrapped around his meat. Sean's balls slap away at that tight ass as he pounds away as they both moan and groan. Matthew is taking that thick cock like a champ. They then take the party to the couch where Sean lays next to Matthew who is on his back and slides his thick dick back inside for more. They start to make out as Sean fucks away into Matthew's defined frame. Matthew's cock is rock hard as he gets that hot ass filled. Pile driver is next as Matthew gets on the floor and Sean holds his legs up. He aims south as he slides that cock home. He bounces in and out of that sweet ass as Matthew moans in ecstasy. Sean's thick cock is hitting Matt in all the right places and it soon sends him over the edge shooting his load all over himself. Sean then pulls out and kneels over Matthew as he unloads his thick cum all over Matt's naturally smooth frame. Matt is glistening and cum covered-but he's not about to complain.",
  "models": [
    {
      "name": "Matthew Keading",
      "person_id": 28460
    },
    {
      "name": "Sean Evans",
      "person_id": 28461
    }
  ],
  "release_date": "2011-08-05",
  "scene_id": 55906,
  "tags": [],
  "title": "Meating Keading, Scene #01"
}