{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have two new faces for you the first of which is a 19 year old Windy City native by the name of Brycen Cox. Chicago's own will have the pleasure of savoring the laid back flavor of San Diego's lover boy Justin Hawk. This sexy 20 year old is happy to be here in Miami. We asked these boys if they had the chance to have dinner with anyone they wanted to who it would be. Jake Gyllenhaal is Brycen's immediate response. Justin would want to have dinner with Usher. We then asked them what their favorite fast food restaurants were. Brycen loves In-N-Out Burger. ?I'm a huge fan of cheeseburgers and they're my favorite. Justin loves him some Zaxby's and their 20 piece chicken strips. Mmm, now who doesn't love some chicken from time to time. We asked Brycen to describe the perfect cock. Brycen isn't a size queen but he can be impressed so he likes them 8? or above and cut if possible. We then asked Justin to describe the perfect ass. ?The bigger the better and the deeper I can get in there? Well, with those things in mind, lets get these two boys started... Justin is on his PDA when Brycen walks in sporting wood after his work out. He's startled as he realizes Justin's in the room and asks him for a minute alone to take care of his ?problem?. Justin smiles and assures him he could just help him out as he reaches out and grabs Brycen's bone. Justin starts to work that cock, licking it through his shorts before pulling them down to get his mouth on the real deal. Brycen moans as his cock slips into Justin's hot mouth. He bobs Justin's head up and down on his hard cock finally giving it the attention it's been craving. Justin savors that uncut dick as Brycen climbs on the chair to fuck his throat even deeper. Justin the lays back as Brycen finally strips him and goes down on him to return the favor. He swallows Justin's cock to the hilt as he looks up and runs his tongue all along his shaft. They start making out as they rub their hard cocks together. Brycen then gets bent over on the couch as Justin gets to work doing what he loves to do?eating ass. Brycen moans as he gets that hole fucked by Justin's hot tongue getting it ready for what's to cum.Once that hot ass is nice and wet, Justin gets up into position and slowly shoves his cock inside. Brycen moans as his hole gives way. He is soon getting fucked doggy style as Justin takes that ass. Justin's smooth balls slap harder and harder against Brycen's beefy butt as Brycen grunts and whimpers in a mixture of pleasure and pain. ?Yeah you like that?? Justin teases as he grabs his waist and rails him deeper. Justin loves to give it hard and he's fucking Brycen like a horny jack rabbit. He pulls out and sits back as Brycen straddles his cock and impales himself on it. Justin just watches as Brycen rides him like a seasoned jockey. He wants every inch of that cock in him and he's not shy about it.  Justin then gets up and puts Brycen on his back so he can fuck that ass missionary. He lifts those legs up and slams back inside to deliver more hard cock. Justin picks up the pace and fucks Brycen faster and deeper sending him over the edge. He explodes all over himself as Justin continues to pound him. Justin then pulls out and shoots his load all over Brycen's cum covered cock.",
  "models": [
    {
      "name": "Justin Hawk",
      "person_id": 28459
    },
    {
      "name": "Brycen Cox",
      "person_id": 30872
    }
  ],
  "release_date": "2011-07-29",
  "scene_id": 55904,
  "tags": [],
  "title": "Just-in Sidehim, Scene #01"
}