{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Conner O'Reilly is back this week and it's been far too long since we've seen this cutie. Conner is 25 and originally from Tennessee and he's in for a treat this afternoon as we borrow one of our studs from ExtraBigDicks, Shane Frost. Shane is 26 years old and this Windy City native is always a sexy sight for sore eyes. We decided to get an idea on where these boys have their hearts these days. We asked them if they had $1K to donate to any charity of their choice which charity would it be. Conner would send his money to St. Jude's which is striving to end pediatric cancer. Shane offers his to the Trevor Project spreading their ?It Gets Better? mission to help gay teens find the support they need to get through the difficult adolescent years. We then asked them to tell us something they heard about recently that caught them off guard. Schwarzenegger's divorce caught Conner by surprise; for Shane it was reading about a whole family being beheaded in the Middle East. Current events can make you appreciate what you do have. Good news is what we have is 2 insanely hot boys about to get into some very hot action. (...you're welcome!) Shane and Conner are sitting back as Conner bitches about not having been able to pick up a guy he was after. ?That's on you' Shane laughs 'you have no game? Conner is thrown back by that and asks what Shane would have done differently. Shane doesn't hesitate and moves in for the kill. ?Something like this? he says as he grabs Conner's junk and goes in for a kiss. Conner tries to avoid his lips but eventually gives in as they start to make out and lose articles of clothing. Shane stands so that Conner can get a better feel of his cock as Conner smells and rubs his boner through his tight red briefs. Shane drops them and sits back and waits for Conner to come over and suck on his fat cock. Conner's a quick study as he gets between Shane's legs and gets to work sucking on that thick cock. ?Get it nice and wet? Shane moans as he watches his ass stretcher disappear into Conner's hungry throat. Conner then stands to give Shane a chance to give something back. Shane is game as he wraps those lips around Conner's cock and starts to nurse on that aching cock. He runs his tongue all over the shaft and smooth balls making Conner hornier for more.Shane then gets Conner to bend over on the couch where he spreads that smooth ass wide open and gets to work eating that hole. He teases that hot ass with his fingers and shoves his wet tongue deep making Conner moan with anticipation. Shane then fingers that hole a bit before moving it up into position so he can shove his thick dick inside. ?Fuck me!? Conner moans as Shane starts pumping his thick cock all the way inside. Conner is rock hard as he gets that hole stretched open. Shane then pulls out and moves from missionary to doggy as he bends Conner over again so he can slide inside for more of that hot ass. Conner can't get enough Chicago cock as he bucks his sweet ass back onto Shane's meat. Shane doesn't mind one bit as he continues to shove his cock in as deep as it will go. What goes around comes around as Conner then lays Shane on his side and gets behind him so he can get some ass too. They spoon as Shane takes Conner's throbbing cock. Conner gets so close in Shane's tight hole that he ends up pulling out and blows all over Shane's abs. Shane then gets up and returns the favor, kneeling as he unloads all over Conner.",
  "models": [
    {
      "name": "Conner O\\'Reilly",
      "person_id": 28409
    },
    {
      "name": "Shane Frost",
      "person_id": 28457
    }
  ],
  "release_date": "2011-07-22",
  "scene_id": 55903,
  "tags": [],
  "title": "The O'Reilly Factor, Scene #02"
}