{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "The str8 boys are in the house as we have a double feature for you. Making his second appearance is Johnny Rock. Johnny is 21 and from Ft. Lauderdale. Our second playmate by now needs no introduction but in case you've missed out on one of the 'original' CJB studs, Mr. Aiden Lane is back. Aiden, who is also from the Ft. Lauderdale area, is 26 years old and makes looking 'FINE' look remarkably easy. We asked them what their favorite late night munchie is when the urge strikes. Bacon egg and cheese bagel for Aiden who makes them for himself whenever he needs a grease fix. Johnny prefers a cigarette over food. As for drinks, Aiden loves a str8 shot of Jack Daniels and a beer. Johnny loves beer any kind he can get his hands on. We then went a bit more in 'depth' and since they both have spent a considerable amount of time in bed with women as well as with several men here with us, we wondered if after getting fucked if that changed their approach to fucking women. 'Not at all' grins Aiden. Johnny wins this category hands down with, 'No, I still shove it right in!' A regular 'Prince' this one; Mr. Rock may just find that what comes around often times comes around. Aiden's on the phone trying to arrange a play date with a hot girl for a three-way; but things are not looking too well. They get stood up but now they're both sitting there boned up with no relief in sight. Well, not necessarily. They are each stroking their boners through their jeans when Aiden just says 'Fuck it' and goes for it. He grabs Johnny's boner and goes in for the kiss. They start making out as they fumble trying to get at each other's cocks. They start to undress each other as they get more and more turned on. Johnny finally gets Aiden on the couch and takes his throbbing 8' cock in his mouth. Aiden moans as he watches Johnny go crazy for it sucking as much of it as he can in his cock hungry mouth. He swirls his fist on Aiden's shaft as he nurses on his knob. Aiden then wants to return the favor as he too gets busy sucking cock. He tugs on Johnny's smooth balls as he bobs his head up and down on Johnny's thick meat. Aiden then decided his tongue needs to get something else ready as he bends Mr. Rock over and tongues his hole in preparation for some cock. That kinda rhymed...Aiden aims his thick cock at that hole and starts to push inside as Johnny's hole clenches up. 'Relax' Aiden coaxes as Johnny winces in pain, his ass slowly conceding and taking Aiden's throbbing cock in bit by bit. Taking a page out of the 'Johnny's Rule Book to Gr8 Sex', Aiden shoves his cock right in and just starts to pound that ass. Johnny winces and groans as his str8 hole gets mounted 'You like that?' Aiden teases as he slams that dick in harder and faster. Johnny does his best to take the pounding he's being given as Aiden humps away like a horny jack rabbit. Aiden then gets Johnny on the couch and lays behind him as he gets that cock ready for more ass. He holds Johnny's leg up as he slides back in for more. Johnny's ass is till trying to get accustomed to it's intruder as Johnny begs Aiden to keep it in there. Aiden starts fucking that hole again while Johnny starts stroking his cock. Aiden's cock loves the tight ass wrapped around it and it won't be long before he shoots. Johnny beats him to it as he dismounts and jerks off all over Aiden's face. Aiden then busts a huge load all over his sexy abs and chest. Well, so much for it's not gay if it's in a three-way! ...Oops!",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Johnny Rock",
      "person_id": 28466
    }
  ],
  "release_date": "2011-09-02",
  "scene_id": 55915,
  "series": "Get a Piece of the Rock",
  "tags": [],
  "title": "Get a Piece of the Rock, Scene #02"
}