{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Georgia's favorite son is back with us this week as we gladly welcome back Cole Harvey. Cole is 22 and with the blond hair, blue eyes and that Southern twang we just can't get enough. His costar this week, JT Knightley, is also 22 but isn't from these parts. No, this week's d?but?e hails from the cradle of western civilization, of democracy, philosophy, the theater and so much more, Greece. We asked these two growing boys when they go out late and get the munchies what hits the spot. Cole likes anything hot and greasy. For JT, he loves to hit Peter Pan Diner in Broward where he can chow down on hot things like their fried calamari. Speaking of hot, we asked these two what their X-boyfriends would miss most of all. Cole says his ass is the one thing all of his past exploits miss. JT is more of a romance man and confesses that his kissing isn't anything that anyone who's had it would forget. Pucker up! Both of them admit to jacking off all the time but only one of them has ever been busted doing it. JT was stroking in a parking lot when an officer happened upon his person. That's all he would tell us. Hmmm. To wrap it up we asked these horny boys if they could watch anyone jacking their meat off who would it be. Brad Pit for Cole, while JT would rather watch hottie Ashton Kutcher. Cole is sleeping when JT walks in to wake him. When Cole wakes up he flips over trying to wake up as JT gets a load of what Cole's packing. We're not sure what he was dreaming about but judging from the boner in his briefs it must've been a scorcher. JT tells him that he'll make sure that dream has a happy ending as he grabs that hard cock and goes down on it. Cole moans as JT works his thick cock. Cole then strips JT to see what's in this for him. He hauls out JT's rock hard cock as he gets on his knees to suck on it. JT looks down to see his throbbing cock sliding into Cole's full lips. Cole works that cock with his hand as well as his tongue. JT then gets Cole up so that he can get some more of that country cock for himself. He takes his time worshipping Cole's thick dick making it throb with anticipation. They then get on the couch and start to make out as Cole gets a closer look at JT's smooth ass. Greek boy has a hot ass and Cole wants some of that ass on his raging boner.'Ride my dick!' Cole orders as JT straddles his cock and slowly impales himself on it. He takes that cock all the way in and starts to ride it. Cole is in awe as he sits back and watches JT sit and bounce on his meat in a reverse cowgirl position. He strokes his hard cock as he fucks himself on it. Both of these studs are naturally smooth and defined. JT owns that dick as he grinds that hot ass deeper and deeper wanting to get every inch of Cole's cock inside him. But wait-there's more, as Cole gets bent over and gets that spectacular ass crammed full of cock. JT starts to pound that ass deep and hard as he reaches around and grabs Cole's boner. Cole loves that dick as he arches his back wanting to give JT the best position to bury his bone. Missionary is next as Cole gets that ass plowed deep. JT fucks him faster and it sends him over the edge as Cole explodes all over his abs and chest. JT is next as he hauls his throbbing cock out and blows his wad all over Cole's cum drenched cock and abs as well.",
  "models": [],
  "release_date": "2011-08-26",
  "scene_id": 55913,
  "tags": [],
  "title": "A Knight at Cole's, Scene #02"
}