{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Chris Cox who made his debut on our brother site, ExtraBigDicks makes his debut here on CircleJerkBoys and we're sure you guys will love him and that thick Cuban cock just as much. Chris is 25 for a few more days and he is from Miami. Chris' playmate this week is a sexy son of the South by the name of Jacob Durham. Jacob is 21 years old and from South Carolina. Jacob is a smooth delight and has a face that's only rivaled by that sweet ass of his... but we're getting ahead of ourselves. We asked these two what they do when they wake up in the morning. They both admit that they jack off first thing in the morning when they're greeted by morning wood. Chris jacks off about once a day while Jacob does it 3 or 4 times a day. On the kink meter we wondered where these two fell. Chris admits he's like an 8 or 9 depending on the person. Jacob is like a 10 if it involved physical kink things but he's not into getting crazy out at sex clubs or bars. Well, what else would you expect? He is from South Carolina and you know there's only so much those Southern gents will do... or admit to. Well let's get this party started while Chris is still 25 shall we?'Make a wish, Birthday Boy' Jacob grins as he lights up a small birthday cake for Chris. Chris blows out the candle and goes in for a kiss. We're pretty sure what he's wished for as Jacob slides down to get at that Cuban cock. He undoes his jeans and out pops Chris' 9' cock. Jacob wastes no time before going down on it trying to get as much of that cock in his mouth as he can. Chris stands up giving him better access as he holds Jacob's head by a handful of locks. Jacob tries his best to take it down his throat making himself gag on it. They move over to the couch where Chris gets to return the favor. He swallows Jacob's hard cock to the hilt as Jacob moans in appreciation. Chris takes his time wanting to please Jacob before standing up to get more in return. Jacob readily takes more of that dick as he worships every inch working himself into a frenzy that only that dick will soothe. Chris then sits back on the couch and as Jacob gets back on that meat Jacob bends over and spreads that ass wide. Chris slides his hands all over Jacob's stellar ass as he teases that hole with his fingers. Chris can't wait any longer as he suits up and sits back. Jacob straddles that dick and slowly impales that smooth, beefy ass onto Chris' rock hard cock. Jacob winces as he struggles to take it inside. 'Your dick is so big' he grunts as he picks up the pace pushing through the pain. Chris loves it as Jacob bounces on his cock. Jacob finally gets used to that thick cock and goes to town grinding that hot ass all the way down to Chris' balls. Jacob then flips around and continues to ride it in a reverse cowgirl position where it's easier for him to stroke his own throbbing meat. Jacob leans back as he starts to pull that dick almost all the way out before sliding all the way back down onto it. Chris then has Jacob hold still as he jack hammers his cock up into that hot ass. Pile driver is next as Chris puts Jacob on the floor and flips him over so that his ass is reaching for the stars. Chris aims that meat south and hammers that dick deep as Jacob begs him to stretch that ass of his wide. Chris obliges and eventually they end up missionary as Chris fucks the cum out of him. Jacob shoots all over himself seconds before Chris pulls out and shoots his own massive load that blasts all over Jacob's cum splattered bod.",
  "models": [
    {
      "name": "Jacob Durham",
      "person_id": 28467
    },
    {
      "name": "Chris Cox",
      "person_id": 28468
    }
  ],
  "release_date": "2011-09-16",
  "scene_id": 55919,
  "tags": [],
  "title": "Feliz CUMpleanos, Scene #02"
}