{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Cum on in, the waters fine this week as we welcome back Gavin Waters. Gavin tells us he's 'from the south and he's 'in his twenties'. Other than the fact he's feeling 'old' today (Oooh, boy); that's all he's willing to give up this afternoon. Well... that's not entirely true; but let's not get ahead of ourselves, shall we? Ridge Michaels is also back. Ridge is now 23 and excited to have made the move to Orlando from Florida's sleepy west coast. We hope they know what they've gotten themselves into with this chiseled hellion. We asked these two if they were going to open a restaurant what they would serve and what they would call it. Gavin would open an ice cream shop named Plush. Ridge would open an eatery that would whip up some of the best barbecue in the area. He's still not sure what he'd call it but we bet, like him, it would be a hot time. Ridge learned his ass was meant for more than the obvious back in college when he began to experiment. Gavin didn't realize the pleasures of the posterior until his first film at the age of 20. We then asked if they use any aids to help them jerk off. Gavin uses porn often when he beats his meat. Ridge doesn't use phones or porn and would really prefer one on one contact. Sexting just doesn't compare to a 'real' man. Fortunately we happen to have one of those in his twenties that we're sure would appreciate the attention...Gavin is reading the paper when Ridge walks in and notices he's hard. His curiosity gets the best of him; as his hand lands on Gavin's knee making its way to his hard cock. He starts to tug on it through his shorts before undoing them and taking Gavin's cock out. Gavin finally decides there's something better going on than reading the paper as he puts the paper down to see just who's playing with his private. Pleasantly surprised they start to make out as their clothes come off. As they make out they stand to strip naked. They are both rock hard as they start to rub their cocks together. Gavin decides he needs a closer look as he kneels to get at Ridge's dick. Ridge starts to face fuck him as Gavin greedily swallows every inch. Gavin takes his time as he nurses on Ridge's meat. Ridge loves the attention his cock is getting but decides he wants to get some of Gavin's uncut dick. He lays Gavin back on the couch as he crawls between his thighs to suck that dick. He teases his knob before swallowing his shaft. Gavin is in awe as Ridge works his magic. They can't get enough of each other and eventually end up on the floor in a steamy 69 giving them both what they want. But wait, there's more...Ridge then flips Gavin's legs back towards his head as he gets dibs on that sweet ass. Gavin moans as Ridge spits on his hole and buries his tongue inside. Ridge can't wait to get inside that hole as he suits up and sits back on the couch. Gavin eases himself down on that cock in a reverse cowgirl position. His ass slowly concedes taking Ridge's cock inside. He then starts to ride it as Ridge helps shove his dick up into him. Ridge then pulls him over so they he's now laying behind him on the couch. Ridge still has that dick buried inside him and continues to pump his hot cock into Gavin's tight ass. Gavin moans as he continues to get that asshole stretched by Ridge's thick cock. Missionary is next with a bit of a twist as Gavin takes the lead. Ridge gets it on his back as his legs are up in the air. Gavin slides his dick deep into his ass and returns the favor. 'Ooh Fuck Me!' Ridge begs as Gavin fucks him harder and faster making him explode all over his smooth abs and chest. Gavin is next as he pulls his cock out of that hot ass and unloads all over Ridge's cum covered cock and navel.",
  "models": [
    {
      "name": "Gavin Waters",
      "person_id": 28347
    },
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    }
  ],
  "release_date": "2011-09-09",
  "scene_id": 55917,
  "series": "The Waters Edge",
  "tags": [],
  "title": "The Waters Edge"
}