{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Alexander Greene is making his debut on CircleJerkBoys and he's not the only one here to show off all his mother gave him. Ricky Larkin is also making his CJB debut and if nothing else we can assure you we have plenty of cock to go round. Alexander is 27 years old and from New Jersey. Ricky is 24 years young and a local commodity. He was born and raised right here in sunny South Florida. We asked these two studs what makes them happy and gets them in a good mood. Ricky loves blow jobs; especially receiving them. Alexander just likes just kicking back and chillin' with friends lying out on South Beach. Next we asked how long they fantasized about experimenting with a guy before they acted on it. Alexander always had fantasies. He always knew it turned him on. For Ricky he ended up fooling around with a guy that led him to have jack off fantasies about guys. Ricky actually first experimented with guys when a girlfriend wanted to see him with another guy and actually set everything up-DAMN, Gurl! He played along and not only was he pleasantly surprised; but claims she unleashed the 'freak' in him. Well, we might just have to send that girl a toaster oven. Ricky is kickin' back and horny as fuck when Alexander walks in to find him covering up on the couch. He notices the 'vase' on the desk. He admits whenever he uses one of those things it makes him horny as hell. Ricky tells him he can relate as he shows Alexander what he's covering up. Alexander doesn't see that as a problem at all as he starts to grope Ricky's boner. They start to make out as Ricky undoes his shorts to give Alexander access to his throbbing cock. He kicks off his shorts as Alexander goes south to see what he can do to help a buddy out. He opens wide as he takes Ricky's throbbing cock in his mouth. Ricky groans as he gets that cock worked. Ricky's curiosity gets the best of him as he pulls Alexander off his cock and strips his shorts off to get an idea of what Alex is working with. He hauls out Alexander's 9' uncut cock as they stroke their cocks together. Ricky licks his way south along Alexander's smooth chest til his tongue reaches his intended target. He takes that cock as deep as he can as Alexander watches his head bobbing on his meat. Ricky then lies on the couch and orders Alexander to fuck his face. Alexander obliges making him repeatedly gag on his thick meat. Careful what you ask for, str8 boy. They take turns worshiping each other's thick cocks until Ricky needs more on his dick. He suits up and sits back as Alexander straddles him and slowly impales himself on that thick cock. Ricky's meat slides deep inside until it's completely buried. Alexander loves it as he starts to ride that cock. He leans back and lets Ricky take the lead as he shoves his cock up into his tight hole. Ricky loves getting that dick ridden and Alexander is doing one hell of a job. Ricky then pulls out and bends Alexander over to get more of that sweet ass doggy style. Alexander's hard cock swings in time to the pounding he's getting. Ricky can't get enough of that hot ass as he holds Alexander tight and rails that big dick of his into him. Alexander loves it and reaches around to grab that ass and pull him in even deeper. Missionary is next as Alexander gives it up on the couch. Ricky slides his thick cock back inside. 'Yeah, gimme that ass!' he grunts as he pounds away at that tight manhole. He starts to fuck him faster hitting Alexander's sweet spot as he begs him to fuck him right there. Alexander explodes as Ricky jack rabbits that dick deep inside him. Ricky is next as he shoots his own load all over Alexander's cum-drenched abs. ",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 28463
    },
    {
      "name": "Ricky Larkin",
      "person_id": 28464
    }
  ],
  "release_date": "2011-08-19",
  "scene_id": 55911,
  "series": "Little Ricky",
  "tags": [],
  "title": "Little Ricky"
}