{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Two new faces greet us this week as we welcome Jackson Klein and Jordan Pierce. Jordan is 23 and a native Floridian hailing from Vero Beach. Jackson is 25 and a Midwesterner originally from Michigan. We asked these two if they were to win $500 on a scratch off Lottery ticket, what would they spend their winnings on? Jackson would spend the money on bitches. Bitches it is. Jordan would spend it on cigarettes. Not the healthiest of pursuits on either side; but we all have our vices. We then wondered what they had in their refrigerators at home. Jackson has beer and some health food. Jordan has eggs and ham in his. We won't go there. We heard a rumor that Jackson is packing more than the average boy. He didn't realize he was hung til he started hanging out with gay people. Go figure! Jordan isn't mad at Jackson for having a big dick though he admits bigger isn't always better. We then asked them if they were nominated for Porn Awards what category would they sweep. Jordan wants to win 'Best Supporting'; while Jackson- and that cock of his- feel they'd be perfect for 'Best Over All'. Yeeeeeeah, 'bout that. lol Jordan is studying when Jackson walks in demanding a band-aid. Jordan doesn't have one so Jackson tells him to kiss it to make it better. He gives in and one kiss won't due as Jackson's cock grows with every kiss on his imaginary booboo. Jordan undoes his pants and gets a closer look at Jackson's hard on. Nothing a few more kisses won't fix. He kisses it through his briefs as Jackson's cock struggles to get out. 'Whoa, that's huge!' is Jordan's reaction once he frees it from its cotton confines. He opens wide as Jackson shoves it inside. Jordan savors that dick, taking his time to pleasure Jackson's throbbing meat. Jackson holds on to Jordan's head as he starts to fuck that pretty face of his. Jackson then pulls his meat out and bends to kiss Jordan. They make out a bit before switching as Jordan watches Jackson suck cock. Jordan moans as he watches Jackson on his knees taking his dick all the way. Jackson holds still as Jordan gets to fuck his face in return. They take turns sucking on each other before Jackson gets Jordan's legs up and goes to town eating that smooth ass out. He laps at that tight hole getting it ready for more as he slowly teases it with his skilled tongue that's burrowing inside.'Fuck me' Jordan begs as Jackson slides his thick dick inside missionary. Jordan grimaces trying his best to accommodate Jackson's cock. Jackson just goes for it taking that ass at his own pace. Jordan grunts and groans in a combination of pleasure and pain as he gets that ass used. Jackson then gets Jordan on all four as he gets back in that ass doggy style. Jordan yelps as he Jackson slams his dick deep inside him. Jackson is all about fucking ass as hard as possible as Jordan struggles to keep up. Jackson slows it down for a bit but it isn't long before he's back to slamming that dick deep inside Jordan's hole. Pile driver is next as Jordan gets on the floor and presents that sweet for more pounding. Jackson aims his meat south as he slides his dick into Jordan's worn hole. He fucks his hole slowly as Jordan jerks his meat off. Jackson's fat dick is hitting him in all the right spots for a change as Jordan shoots all over himself. Jackson then pulls out and unloads all over Jordan as well.",
  "models": [
    {
      "name": "Jackson Klein",
      "person_id": 28471
    },
    {
      "name": "Jordan Pierce",
      "person_id": 28472
    }
  ],
  "release_date": "2011-10-14",
  "scene_id": 55926,
  "series": "Kiss It And Make It Better",
  "tags": [],
  "title": "Kiss It And Make It Better, Scene #01"
}