{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Hunter Vance and Ricky Larkin are in the house this week and proudly representing the Sunshine State. Ricky is one of our newest additions and this 24 year old was born and raised in South Florida. Hunter is now 27 and from Tampa over on the west coast. We wondered what these boys love best as comfort food and who makes it the best. Ricky loves pancakes and loves them anytime. He says his mom makes the best pancakes. Hunter eats everything so he doesn't have a specific favorite. He admits he does love a nice fillet, medium rare. He doesn't care who cooks it; as long as they know how to do it. Both of these boys spent a long time in hetero land before discovering that fun could be had in man land. Both agree that girls could learn a thing or two from gay men specially how to suck cock. No teeth, Ladies and don't ask if they're done. You'll know when they're done-trust us. To wrap things up we asked these two if we wanted to make them cum super hard what would that require. Ricky admits he's open to trying freaky things that usually turns him on while Hunter just needs a really good blow job to get him to shoot an impressive load. Hope these two were paying attention...Hunter is busy trying to hang some artwork on the wall. When he's done it's all crooked. 'Great job there Einstein,' Ricky taunts 'I think I'm hung better than that frame' Hunter grins and calls him on it. Ricky gets up on the couch so that Hunter can have a closer look. Ricky's cock is rock hard against his briefs as Hunter goes in for an up close and personal. He strokes it a bit before hauling it out and tasting it. Ricky groans as Hunter takes his cock deep inside his hot mouth. Hunter laps at that throbbing shaft before sliding that thick meat home again. He pays special attention to Ricky's smooth balls as he worships Ricky's thick meat. They start to kiss as Ricky strips Hunter. He doesn't want to be selfish as he gets on his knees and starts to return the favor. Ricky shoves Hunter's cock so deep that he gags on it. Hunter lays back and enjoys the view as Ricky sucks and savors his straight meat.Ricky starts to lap at Hunter's smooth nuts and goes further south getting his tongue all over that tight ass. Hunter groans as he gets that hot ass rimmed. Ricky fingers that ass as he eats it out making Hunter horny for more. Ricky then suits up and sits back as Hunter slowly impales himself on his cock. He starts to ride that dick once his ass gets accustomed to it. Ricky just sits back and watches Hunter's hot ass sliding up and down on his thick pole. He takes that dick like a champ as Ricky starts to bounce him on that meat of his. Doggy is next as Ricky bends Hunter over on the couch and shoves that meat back inside. Hunter grunts as Ricky gets to shove that dick even deeper. He pounds that hot ass over and over wanting to get that dick in as deep as possible. Ricky slaps that ass as he picks up the pace fucking Hunter harder. Missionary is next and it's enough to send Hunter over the edge. He busts his nut all over himself as Ricky pounds his ass. Ricky isn't far behind as he pulls out and sends his own batch flying all over Hunter's cum-covered cock and navel.",
  "models": [
    {
      "name": "Hunter Vance",
      "person_id": 28320
    },
    {
      "name": "Ricky Larkin",
      "person_id": 28464
    }
  ],
  "release_date": "2011-10-21",
  "scene_id": 55929,
  "tags": [],
  "title": "Getting Ricky with It, Scene #02"
}