{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Connor Maguire comes home after way too long and he's looking better than ever. Connor is now 20 and he's originally from Washington. Connor is in luck as he helps us welcome a new stud to the CircleJerkBoys' stable, sexy Reed Royce. Reed is 24 and comes to us from Sand Mountain, located at the southern tip of the Appalachian Mountain chain. Alabama never looked so good! We asked these boys if they were on a deserted island (that somehow had electricity) and you could bring one CD to listen to forever which would it be. Reed would bring anything by Adele; while Connor would bring 'The Golden Age of Grotesque' by Marilyn Manson. Obviously they would not be on the same island. We then wondered what they love to eat most. Reed loves sushi while Connor loves Italian cuisine. Following that up, we wondered if their tastes in food reflected their taste in men. Connor would be just fine with Italian men; but Reed's more into boys like Connor-hot white boys. Both of these boys admit they're not as picky when it comes to banging girls; but when it comes to other guys they have standards. Imagine that! Well, fortunately, so do we. All standards aside, let's get this party started!Connor and Reed are spent on the couch, still drinking after Southern Decadence. Connor tells Reed that he's all bloated as he notices Reed's abs still seem hard. He moves his hands over Reed's abs and south to his crotch. He realizes Reed's hard somewhere else too. They start to kiss as they slowly begin to undress each other. Connor stands to give Reed access to the bulge in his jeans. Reed undoes his jeans for him, freeing his hard on before standing to let Connor do the same for him. They rub their boners together as they continue to make out. Connor's curiosity gets the better of him as he drops to his knees to get a taste of Alabama. Reed groans as he gets that cock worked. He is rock hard as Connor savors every thick inch. After working Reed's meat for a while he wants some attention on his own cock and stands to let Reed return the favor. Reed runs his hot tongue all over Connor's smooth balls, up under his shaft then engulfs his aching cock. He strokes his shaft as he nurses on Connor's swollen knob sending him into a very happy place. From there they fall on the couch together to make out some more.As they lay next to each other kissing and stroking each other's cocks, Connor's finger finds Reed's smooth ass and he slips it inside. Reed's legs are in the air as Connor starts to finger his tight ass. Connor needs more as he slides south; gets Reed's thick legs up in the air and dives into that sweet ass tongue first. Reed strokes his hard cock as Connor eats that ass out. Legs in the air and a spit lubed ass give way to Connor's dick as he slowly slides it inside. 'That's a big cock' Reed grunts as Connor continues to bury his meat. Once inside he picks up the pace fucking that ass deep. Reed's so turned on he's afraid he'll cum any minute. Connor tells him to hold off as he starts fucking him even harder. Reed obliges and it's a good thing because soon enough it's his cock deep inside Connor's tight ass as Connor rides his cock. Reed slams his dick up into that hot hole as his balls slap away at that ass. Reed loves that ass but wants Connor back inside him as they flip again. This time it's Reed sitting on Connor's cock as he takes that dick all the way inside his sweet ass. That does the trick as Connor's cock hits his sweet spot sending wave after wave of thick load all over Connor's chest and abs. Connor is next as he too unloads all over his cum covered self. There's a whole lot of cum everywhere!",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 28024
    },
    {
      "name": "Reed Royce",
      "person_id": 28038
    }
  ],
  "release_date": "2011-10-07",
  "scene_id": 55925,
  "tags": [],
  "title": "Poles Royce, Scene #02"
}