{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Aiden Lane is back this week and we love to have this native Floridian in the house. Aiden is going to help us welcome a new face to the circle Mr. Jordan Foster. Jordan has a bit of Southern swagger with a slight accent. Jordan is 20 years old and originally from Bowling Green, KY. We asked these boys whose fan club they would want to be a member of. Aiden would want to be a member of Taylor Lautner's fan club while Jordan would be in Kathy Griffin's. If they had more time to do anything Aiden would spend it fishing while Jordan would use it to catch up on rest. Jordan is a self-admitted power bottom and he confirmed that bigger dicks are better though it's not always about the size. If you have an average dick and know how to work it, it can be truly amazing. Aiden loves a tight ass and also admits he's really into a bubbly butt. The perkier the ass the better it looks but that doesn't really mean it will feel better 'on' his cock. He just loves the way it looks but once you get inside that ass it's all about 'technique'. Well, let's see these two bring their skill sets to today's shoot. Buckle up, Boys...Jordan comes into Aiden's room wondering if he has a cigarette. Apparently he's in need of an oral fix; so when Aiden tells him he quit, he asks Aiden for something to eat. He needs to put something in his mouth. <light bulb> Aiden suddenly realized he does have something that could go in that mouth of his. 'I do have something for you to eat' he grins as he turns around and pulls Jordan's head into his crotch. That did the trick as Jordan starts to lick at the growing bulge before moving north to make out with Aiden. He licks at Aiden's nips and chest as he makes his way back south to free Aiden's swelling cock. He takes it in his mouth as Aiden gasps in appreciation. Jordan savors every inch as he works that cock all the way down to the hilt. He laps at Aiden's smooth balls as Aiden gasps at the sensation. Aiden then gets between Jordan's legs as he checks out the equipment. Jordan moans as Aiden willingly returns the favor and nurses on his throbbing cock. Aiden isn't one to rush as he takes his time sucking on that cock and taking special care of those balls and ass.He then gets Jordan on all four so he can get a taste of what's to come. He shoves his tongue inside that smooth ass and helps himself to that hot hole. He fingers Jordan's tight ass getting it ready for more. When he's ready, Aiden suits up and slides his thick cock inside. He is soon tappin' it doggy style as his balls start to slap away at that ass. Aiden grabs Jordan's waist as he pounds away wanting to get it in deep. Aiden then sits back and has Jordan sit on his thick cock. Jordan leans back on Aiden's chest as he goes to town riding that thick meat. Aiden pushes his dick up into Jordan's hole as Jordan bounces on it. Aiden kisses Jordan passionately as they fuck and mesh together. Missionary is next as Aiden gets back inside that hot ass for more. Jordan ends up on the floor with his legs up and Aiden deep inside him. Aiden picks up the pace sending Jordan over the edge. He unloads all over his smooth chest and abs. Aiden is next as he too unloads. His hot load erupts flying way over Jordan's head then coating his chest, abs and now even happier ",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Jordan Foster",
      "person_id": 28469
    }
  ],
  "release_date": "2011-09-30",
  "scene_id": 55923,
  "series": "Foster Care",
  "tags": [],
  "title": "Foster Care"
}