{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "CircleJerkBoys has a native overload this week as we welcome two fine Floridians. AJ Banks is back and we're always happy to have this 21 year old Daytona Beach boy with us. AJ is in for a treat as we pair him up with none other than hung hottie Ricky Larkin. Ricky is 24 and from right here in South Florida. To start off our interview, we asked these two what they would do if they suddenly had $500 to spend at the mall. Ricky would buy new shoes, a new watch and then put the rest towards bills. AJ would spend his on new clothes and shoes and probably something to eat. Eat is good. We then asked them who they would love to see in concert. Ricky would love to watch Drake who he didn't like initially but has been warming up to him. AJ would want to see A Tribe called Quest. Ricky's first time with a guy was in front of his ex who got him into it. She knew what she was doing when she coaxed him into giving guys a shot and we are all grateful. AJ was also surprised at how good it felt and how quickly a dick in his hot little ass took him to orgasm. Well, with that in mind let's get this party started...These two start before we do as they get right to making out. ?So you think you're gonna be able to suck that thing?? coos Ricky as AJ gropes his boner through his shorts. Ricky stands to give AJ all the access he needs. AJ is in awe of how big and think it is while Ricky just wants to see what AJ can do with it. AJ gets right to it as he shoves that thick cock in his mouth. Ricky grabs his head and helps him get it even deeper into his throat making AJ gag on it. AJ gets on his knees to worship that dick as Ricky gets to work fucking that face of his. Ricky is rock hard as he watches AJ eat his meat. He then pulls AJ up as they start to rub their dicks together. AJ then sits back and lets Ricky give his dick some TLC. Ricky get down to business sucking on AJ's dick as AJ buries his cock deep into his throat making him gag on his meat as well. These gag prone hotties can't get enough of each other's throbbing cocks and soon a wet mouth won't do.AJ is ready for more as he kneels on the couch and arches his back sending that perky ass up in the air. Ricky can't ignore that hot ass and gropes it a bit before suiting up and sitting back. That's all the permission AJ needs as he straddles that thick 9? cock and impales himself on it. Ricky groans as AJ starts to ride his meaty shaft. He holds AJ by the waist as he helps bounce him up and down. From there Ricky bends his new friend over and slides his fat dick inside doggy style. ?Tell me you like that!? he grunts as AJ readily obliges. He picks up the pace as he makes that tight ass a lot looser as he slams that fat dick all the way in. He grabs AJ by a fistful of hair as he continues to mount his hot ass. They move back to the couch where AJ gets fucked on his side. AJ can't help but stroke his throbbing cock as Ricky slams inside that ass. Ricky's cock hits that sweet spot and AJ won't be able to take much more without busting a nut. Ricky isn't far behind as he pulls out and busts a thick nut all over his happy trail. AJ cums in second, busting his own nut all over his smooth abs.",
  "models": [
    {
      "name": "AJ Banks",
      "person_id": 28005
    },
    {
      "name": "Ricky Larkin",
      "person_id": 28464
    }
  ],
  "release_date": "2011-09-23",
  "scene_id": 55920,
  "series": "Taking it to the Banks",
  "tags": [],
  "title": "Taking it to the Banks, Scene #01"
}