{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Aiden Lane is back with us and looking hot as always. Today Aiden's gonna help us welcome 25 year old New Yorker, Calvin Koons. Aiden is now 26 and he's from Ft. Lauderdale. We asked these hotties what the last compliment they paid to someone was. Calvin complimented a girl on her shoes while Aiden gave props to his favorite bartender for an awesome cocktail. We then wondered what the kinkiest thing these two had ever done. Aiden had a scene with Damien Crosse who in order to cum asked Aiden to pee in his mouth. He did and Damien blew his load as promised. For Calvin, the kinkiest thing he's ever done is to be bound and collared. He really got into it. Then we wondered what the kinkiest thing that they would like to try. Aiden's had this answer lined up for a while. He's always fantasized about being sandwiched between a hot man and a woman. For Calvin it would be more bondage stuff. We then asked these studs what, out of 3 choices, was their favorite methods for personal satisfaction whether giving or receiving. Aiden answers that with fucking followed by blow jobs then rimming. Calvin couldn't think of a better line up. Now let's see how they line them up...Calvin is looking at a few DVDs he's come across and looking at all the dick on the cover when Aiden walks in. Caught up in the covers, Calvin isn't aware he's not alone until Aiden comes up behind him and grabs him by the waist. As Calvin turns to see who it is Aiden goes in for the kiss as they start to make it out. Calvin's ass was what drew Aiden over to him like a moth to a flame and he wants to get a better look at that. He goes down and pulls Calvin's underwear down and reveals that tight bubble butt. He spreads that smooth ass and dives in. Calvin moans as Aiden gets all up in that hot ass squirming his tongue deep inside. Aiden can't get enough as he shoves his face deep into those cheeks. Aiden then gets up and goes back to making out with Calvin for a few making his cock stand at attention in his boxers. Calvin then gets down and releases Aiden's cock and goes down on it. He swallows as much of Aiden's thick cock as he can trying to get it all the way down his throat. Aiden moans as Calvin takes his time lapping and nursing on his throbbing cock. Calvin's a trooper letting Aiden throat fuck him making him gag on that dick. Calvin can't get enough of that dick and he's in luck. There's more...They reconvene on the couch where they continue to make out for a bit before Calvin straddles Aiden's cock and lowers his hot ass onto it. His ass takes that dick deep and once he's accommodated every inch he leans back on Aiden and starts to ride that dick. He grinds his hot hole down on the dick, moving it around and driving Aiden wild. They make out as Calvin works that fuck stick to his advantage. He uses the couch to buck off of as he bounces up and down on it. Aiden then helps Calvin spin around on his dick so that he's facing him. Sit and spin anyone? Once he is facing Aiden, Aiden lowers him until his shoulders meet the floor. Now Calvin's hot ass is in the perfect position to pile drive. Aiden grabs his dick by the base aims south and starts to do squats in and out of that hot ass. Calvin is in ecstasy as he gets that tight ass stretched wide open. Missionary is next as Aiden gets Calvin on his back. He kneels and gets back between those legs and carries on as he fucks Calvin harder and faster. That does the trick as Aiden's knob hits all the right spots. Calvin loses it busting his nut all over his smooth navel. Aiden isn't far behind as he pulls out and blows a huge wad all over Calvin's chest and abs. Got Milk? We do!",
  "models": [
    {
      "name": "Aiden Lane",
      "person_id": 28165
    },
    {
      "name": "Calvin Koons",
      "person_id": 28476
    }
  ],
  "release_date": "2011-01-01",
  "scene_id": 55936,
  "series": "Calvins Klein",
  "tags": [],
  "title": "Calvins Klein, Scene #01"
}