{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "his week we have 23 year old Ridge Michaels back in the house. Ridge is originally from Florida's west coast and a definite fan favorite. Ridge might be more excited to be here than usual since he's going to help us welcome new comer, J Kohl. J is 21 years old and has a well-stocked arsenal for seduction. He is tall, hung, handsome, has dark featured and slate blue eyes. Oklahoma got it right when they put this package together. We asked these studs what the last purchase they treated themselves to. Ridge bought himself a new iPad and loves it. J bought himself a new phone. We then turned to matters of a more graphic nature and asked them if their past lovers could nominate them in a sexual category what they would win an award for. Ridge says he would take the 'Most Romantic' category while J says he would sweep 'Best Oral'. (Dually noted) In closing we asked them in their opinion what distinguishes good sex from great sex. 'Connection' answers Ridge. A great connection can really make things pop. <pun intended J agrees and says 'passion' is important too. Seems like we have both of those covered this afternoon, so let's let these two put them together...Ridge is groping J's crotch as they make out and get better acquainted. His curiosity gets the better of him as he slides south to see just what the fuss is about. J sits back and watches as Ridge strips off his shorts and starts to play with the tent in his briefs. J gets hard and gets up to give Ridge all access to the 9' cock he has to offer. 'Suck that dick' he coos as Ridge gets to work on his meat. He holds Ridge's head as he fucks that face. Ridge loves it and does his best to pleasure his new buddy even though J's cock makes him gag when it hits the back of his throat. They go back to making out before J's curiosity lands him on his knees exploring what Ridge has to offer. Ridge moans as J hauls out his thick cock and gets to work on it. J wasn't kidding about his oral abilities and Ridge isn't about to complain. J deep throats Ridge's cock with ease as he swirls his hot tongue along the shaft and remembering to pay attention to Ridge's smooth balls. He gets Ridge horny as hell sucking on that meat but then turns it up several notches as he gets Ridge on his back and goes to town tongue-fucking that ass. Ridge's tight, smooth hole is soon spit lubed and ready for more than just a tongue fuck...J suits up and aims his fat dick at that tight hole. Ridge is already on his back with his legs in the air and J uses that to his advantage. He slides his thick dick all the way in as he starts to pound that ass missionary. J holds Ridge's legs as he powers into that tight ass. J then gets on the couch and has Ridge sit on his dick for more. Ridge rides that huge cock as J spreads his smooth cheeks apart wanting to get as deep as he can. 'Aww Fuck me!' begs Ridge as he rides that big dick. J just lays back and watches as Ridge pleasures himself on his throbbing cock. Ridge's own 8' cock is rock hard as he gets fucked and its inches from J's face. Ridge gets close and gets off J's meat and shoves his dick down his throat. 'Suck my dick!' he orders as he jacks his load off all over J's face and tongue. Once he's done shooting his load all over J's face he bounces leaving J with the age old question...Trick or Treat? Looks like someone hadn't gotten all of the Halloween spirit out of his system. But judging from the huge messy treat on J's sexy face, we're guessing that was probably the last of it...",
  "models": [
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    },
    {
      "name": "J Kohl",
      "person_id": 28474
    }
  ],
  "release_date": "2011-11-04",
  "scene_id": 55932,
  "tags": [],
  "title": "A Ridge to No Bear, Scene #01"
}