{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Ricky Larkin is back with us this week and looking better and bigger than ever. Ricky's efforts at the gym are really paying off. His costar today is another fan favorite by the name of Connor McGuire. We wondered if these two liked shopping for anything in particular. Ricky loves shoes and watches. Connor likes getting computer stuff. Connor bought himself a monitor recently. It was on sale and he couldn't resist. For Ricky, he loves to over stock at the vitamin shop on supplements. Well those have come in handy. Both of these hung studs have lucky ladies in their lives and Ricky admits had someone told him 6 months ago that he'd end up doing gay porn he would've had a violent reaction. Connor knew it might happen at some point. 'I figure at some point I'd be broke enough to try it'. Well, when we asked them what they would tell other str8 boys that can't fathom having sex with another man could possibly feel great; Connor suggests they just close their eyes. A hard cock truly has no conscience. Ricky is all about the Benjamins and offers up his words to live by, 'Just open your eyes and look at the paycheck!' Cha-CHING!Ricky and Connor are both on their PDA's with their girlfriends telling them they are busy running errands. The truth is they're really gonna be busy fucking each other. Ricky grabs at Connor's pants and frees his bone. He drops to his knees and starts to suck on it, shoving it so deep he makes himself gag. Connor moans as he watches his fuck buddy service his dick way better than his girl could. They strip off their tees and shorts as they continue making each other even hornier. Ricky twirls his head on Connor's meat wanting to give him the best blow job ever as he laps at Connor's smooth nuts. Ricky then drops his shorts to let Connor return the favor. Connor kneels between his legs and hauls out his thick cock. Ricky wastes little time before fucking Connor's mouth. Connor bobs up and down on Ricky's fat dick with ease as Ricky makes him go down on it even further wanting to get it down his throat. Ricky then lifts his legs up as Connor starts to eat that hairy ass. Ricky is moaning his appreciation as he strokes his hard cock. Connor tongue fucks that ass making Ricky's eyes roll back and his cock throb.They then reconvene on the floor in a hot 69 so that they can each satisfy their cravings for more dick. Ricky then gets Connor bent over on a chair and gets a taste of that ass he'll soon have wrapped around his cock. He laps at that ass and eats that hole out making Connor squirm and want more. Once that ass is ready Ricky stands up and slides his meat inside. Connor grunts and groans as he tries to accommodate Ricky's thick cock. Ricky fucks that ass deep, burying his dick all the way to the hilt. Ricky then switches it up as he sits back and has Connor sit on his dick. Connor adds some more lube to that cock and impales himself on it. Connor takes every inch of it and gets to work riding that meat. His own cock is rock hard as he bounces up and down on Ricky's. Ricky helps him out and jacks Connor off as he slams his cock up into him. Missionary is next as Ricky gets Connor's legs up and slams back in for more. Ricky pounds him hard as Connor starts to jack himself off. Ricky stretches that ass open and hits Connor's buttons as he buries his dick over and over. Connor is the first to blow all over himself as Ricky jacks his as well. Ricky shoots his fat load all over Connor's cum-covered chest and abs. Cha-CHING, Gentlemen.",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 28024
    },
    {
      "name": "Ricky Larkin",
      "person_id": 28464
    }
  ],
  "release_date": "2011-11-25",
  "scene_id": 55938,
  "series": "What Did You Tell Her?",
  "tags": [],
  "title": "What Did You Tell Her?, Scene #01"
}