{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Bryce Starr makes his debut with us here on CircleJerkBoys and we're glad to finally have this classic featured, inked hottie with us. Bryce is 24 years old and a west coast boy originally from Los Angeles. Returning for his second appearance with us and eager to help welcome Bryce to the club is Reed Royce. Reed is 24 years old as well but he's a Son of the South from just a ways up the street in Alabama. We wondered what these two growing boys considered their favorite meal. Bryce's favorite is Fettuccini Alfredo; and no one makes it better than his Mom. Reed also went with his favorite Mom made dish Chicken Noodle soup. Turning the topic to sex we wondered what their earliest sexual memory was. It was 7th grade for Bryce and Elementary School for Reed. Two sexual prodigies are in the house. lol We wrapped up our tawdry chat asking them to describe the perfect cock. Bryce wants it thick, but not too thick and wants it a decent size as he holds up his hand and points at the distance between his outstretched pinky and thumb. For Reed, he's girth-friendly; wants 'at least' 8?' or 9'; nice head on it and as for manscaping, it just depends. Well, we know Reed's in for a real treat...Bryce is listening to music working on homework with Reed sitting next to him feeling a bit neglected. Reed reaches over and grabs Bryce's cock as Bryce realizes maybe there are other things that need working on as well. He stands up to let Reed play with the growing bulge in his pants. Reed undoes his jeans and starts to work Bryce's growing cock through his briefs a bit before freeing it altogether. Bryce's thick cock springs free as Reed wraps his lips around that thick 9' tool. Reed shoves as much of it as he can down his throat as Bryce just gasps his approval. Reed nurses on the swollen knob as Bryce starts to fuck his face. Bryce is naturally smooth and even keeps his pubes trimmed. Reed takes his time worshiping that thick cock, eager to please his new buddy. After he's had his fill, Reed gets up and makes out with Bryce; who's about to head south to return the favor. Just what the doctor ordered, thick but not too thick. Bryce slides Reed's dick down the hatch as he gets to work spit shining Reed's throbbing meat. Bryce then moves the party over to the chair where he bends over and offers that ass up. Reed readily begins to explore that smooth ass as he slips a finger inside.Fingering Bryce's ass only makes him want it more and he won't have to wait for long. Reed suits up and slides his thick cock inside. Bryce groans as he struggles to accommodate the intrusion. Reed holds him by the waist and starts to slam hiss dick in deeper as he pounds his stellar ass. 'Such a tight ass' Reed coos as he revels in the sensation. Bryce bucks back wanting to get every inch of that dick buried inside him. From here they switch it up as Reed sits back on the couch and Bryce impales himself in a reverse cowgirl position. Reed has the best view in the house as he watches his meat disappear in and out of that smooth ass as Bryce bounces on his dick. Bryce's cock is rock hard as he bobs up and down pleasuring himself on that dick. Missionary is next as Reed gets Bryce on his back. He slides his thick cock back inside and fucks that ass some more. Bryce is in ecstasy as he gets that tight ass stretched wide. He can't get enough of it as he begs Reed for more. On his back and with Reed's cock hitting his sweet spot Bryce can't hold back any longer. 'I'm gonna cum' Bryce groans, 'I'm gonna burst!' He shoots a thick batch all over his smooth navel. Reed is right behind him as he pulls out and unloads all over Bryce's glazed navel.",
  "models": [
    {
      "name": "Bryce Star",
      "person_id": 28475
    },
    {
      "name": "Reed Royce",
      "person_id": 28038
    }
  ],
  "release_date": "2011-11-11",
  "scene_id": 55935,
  "series": "Shooting Star",
  "tags": [],
  "title": "Shooting Star, Scene #02"
}