{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It's Halloween weekend and keeping in the spirit we decided to bring our members a treat by the name of Richie Sabatini. It's been a while since we've seen this 23 year old Miami boy; but we're always happy to have him. Tyler Shields is here as well and making his debut. This 22 year old Indiana native may be enjoying himself here in Florida; but things are about to get even better. We asked these two after all their bills were paid what was the last thing they treated themselves to. Tyler recently bought himself a crotch rocket. For Richie it was clothes from Armani Exchange. We then asked them if money was no object what they would want to acquire. Richie would want a jet ski. For Tyler he would just spend the money on more parts for his new bike. We then decided to wrap things up by asking if they could be in the middle of a hot fantasy three-way who would they pick as their partners. Richie has a partner so he would be behind him and in front he isn't sure at the moment. For Tyler, he also has a partner that would be bringing up the caboose. As for who would be in front of him, he wouldn't mind Johnny Hazzard to slide into. Well, get in line, who wouldn't?! Well, enough talk- let's get these two naked...Two demons walk into a bar with a bottle of lube in one hand and a boner in the other... well, not exactly; but somehow they make it home together. Richie and Tyler are back from a night of trick or treating and start to explore each other still wearing their masks. They are short lived as they join Richie's pants on the floor. Tyler hauls out Richie's thick cock as he gets to work sucking his dick. Richie moans as he gets his cock worshiped. Tyler takes his time as he savors Richie's rock hard meat. Tyler then gets up to make out with Richie for a bit before Richie gets on his knees to return the favor. Tyler gasps as Richie wraps his lips around his aching cock. Richie slowly services Tyler's dick as he runs his hot tongue along the length of Tyler's shaft down over his smooth balls. An amazing shot from below shows off Richie's oral skills as Tyler orders him to suck his dick. Tyler and Richie go back to making out as their hard cocks rub together. They haven't had enough of each other so they reconvene on the floor in a steamy 69 where each can get as much cock as they want before moving on to bigger and better things.These two studs are rock hard and Richie's cock needs more than Tyler's sweet mouth. He sits back and watches as Tyler straddles him in a reverse cowgirl. Tyler's stroking his hard cock as he impales himself on Richie's. He takes it like a champ as Richie's cock claims that ass. Tyler starts to grind that hot ass up and down on that dick driving Richie nuts as he moans in ecstasy. Tyler wants every inch of it as he leans back and bucks that hot ass back onto Richie's dick. Tyler then gets up and gets right back on that dick only facing Richie this time. Richie grabs Tyler's taught waist as he helps bounce him on that dick of his. Tyler has a hot ass and knows how to use it as he bounces up and down on that dick. Richie then gets on the couch and braces as Tyler gets behind him and gives him some of the same. Tyler slides his cock into Richie's hungry hole as he grunts and takes it deep. Richie does his best to accommodate Tyler's fat dick as he gets that ass stretched open. Tyler slowly fucks that ass and soon they are both ready to blow. They stand opposite each other and bust their loads all over a very lucky jack-o-lantern and themselves. Mmmmm Trick...Or treat?-you decide!",
  "models": [
    {
      "name": "Richie Sabatini",
      "person_id": 28328
    },
    {
      "name": "Tyler Shields",
      "person_id": 28473
    }
  ],
  "release_date": "2011-10-28",
  "scene_id": 55930,
  "tags": [],
  "title": "Pumpkin Seed, Scene #01"
}