{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "It's always a great day when we have Richie Sabatini on our couch. Today he's brought along a friend we haven't seen in a while, Micah Andrews. This being the season of giving we asked these two studs what the last compliment they paid someone else. Richie's last one was about an hour ago walking to the studios here on the beach when he gave a guy a shout out as he drove past him in a Ferrari. Micah's last compliment was at a club recently when he noticed a guy with a huge cock in his pants and felt the need to let him know. We then wondered if they could go on a cruise for two who they would bring with them. Richie would bring porn star Cody Springs. If this cabin is a'rockin', don't bother knockin'! Micah would just bring his girlfriend. ...Really!? Why bring sand to the beach? In closing we asked if their roles on cam reflected their sexual roles at home. Richie admits he's mostly a top in his personal life though at times he gets the urge to get fucked. Micah who generally bottoms on cam is mostly a top at home with his girlfriend (for anatomical reasons.) He has tried 'pegging' with her; but she only straps one on to spice things up. Well, no strap on required today. Richie's totally got this.Micah is on the phone making plans for later. Richie comes in and tells him to hurry up and get off the phone so they can get going. Micah turns around sporting a huge boner in his shorts. 'I can't go anywhere with this!' Richie grins as he grabs Micah's 'problem'. Richie knows exactly what to do. Micah gets up on a chair leaving his cock at mouth level for Richie to take care of. It isn't long before Richie has Micah's cock down his throat. He laps at Micah's smooth balls as he services his hard cock. Micah's dick is finally getting the attention it's been begging for. Micah then jumps down off the chair as Ricky sits in it so Micah can give him some of the same. 'Suck that dick' Richie orders as Micah gets on his knees and does what he's told. He swallows Richie's cock to the hilt as he looks up for his approval. Richie just watches as Micah goes to town on that hard cock. Micah swirls his tongue around Richie's knob before shoving it down his throat. Micah then has Richie lie on his back and flip his legs up so he can get at that ass. Micah eats that ass out shoving his tongue deep inside Richie's hot ass making his squirm. Richie's own cock is throbbing by now and soon wants more than just his hand. Micah wants that ass he's been eating so he suits up as Richie sits on his dick. Richie groans as his ass gets used to that dick. Soon Richie's tight ass is riding Micah as he rides him in a reverse cowgirl. Micah just sits back and watches as Richie struggles to accommodate his thick cock. Richie then gets up and decides it's his turn. He bends Micah over and slams his hard cock right up that ass. Micah groans as he gets that cock-loving ass filled. Richie wastes no time as he pounds away at that hungry ass. His smooth balls smack against Micah's hole as he continues to mount that ass. Micah just takes it as he gets that ass owned. Richie moves that dick in and out driving him wild for a while before switching it up and getting Micah on the floor then flipping his legs up so that he can pile drive more meat home. He starts to squat up and down into that hot ass as his cock gets milked by Micah's hole. Richie is rock hard as his thick dick slams into Micah's sweet spot over and over. That does the trick as Micah busts his nut all over his face and chest below. Richie isn't far behind as he pulls out and unloads, sending his own batch splattering all over Micah's cum covered cock and abs.",
  "models": [
    {
      "name": "Micah Andrews",
      "person_id": 28042
    },
    {
      "name": "Richie Sabatini",
      "person_id": 28328
    }
  ],
  "release_date": "2011-12-23",
  "scene_id": 55947,
  "series": "Switchy Richie",
  "tags": [],
  "title": "Switchy Richie, Scene #02"
}