{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Bryce Star is back with us this week and he's brought along an inked hottie from Daytona Beach named Sebastian Young. Sebastian is 26 years old. He's buff, ripped and looks like trouble. (just the way we like em) Bryce, for those unfamiliar with that face and amazing ass is 24 and he's a west coast boy from Los Angeles. We asked these two if they were to win $500 in a scratch off game what they would spend it on. Bryce would blow it on a couple of high top sneakers. Sebastian would spend his on clothes. We all get horny unexpectedly and end up having to take care of things one way or another so we asked if they'd ever been busted doing it. Sebastian loves getting caught so that isn't anything he'd be ashamed of. One of his more memorable ones was wanking at a Publix restroom. Bryce knows how to lock a door but confesses he loves having sex in public places so he's sure plenty of people have seen him messing around. To wrap it up we asked these lovers of public affairs where's the weirdest place they've ever jacked off. Bryce did it at a car dealership. Sebastian did it on Bourbon Street. Hmm. ...For rates to New Orleans: Press '1' now.Sebastian is hanging out watching Bryce's ass as he reads something in a book. Sebastian's dick is growing just thinking about getting inside that hole as he reaches out and grabs Bryce's firm ass. Bryce is caught off guard and when he snaps at Sebastian and asks him why he grabbed his ass, Sebastian stands up and pulls out the reason why. Seems like a sound argument to Bryce who immediately gets on his knees to service him. Sebastian's cock is rock hard in seconds as he slowly pumps Bryce's mouth. 'Suck my fuckin' dick!' he orders as Bryce gags on his fat dick. Bryce runs his tongue along the length of that dick then holds him tongue still as Sebastian jacks his cock off while rubbing his knob on that hot tongue of his. He pulls Bryce to his feet as they start to make out. Bryce has his own tent to contend to but Sebastian isn't done with that mouth yet as he straddles his chest and fucks that throat some more on the couch. Sebastian then pulls his cock out of Bryce's mouth and heads south to give Bryce a little of the same. Sebastian goes down on Bryce taking really good care of his aching cock. Bryce just gasps as he watches his dick get the attention it needs.Sebastian then gets up and bends over onto the chair and asks Bryce if he'd eat his ass. Do bears shit in the woods? Bryce's tongue is up that ass faster than Herman Cain can get accused of sexual misconduct as Sebastian writhes in ecstasy. Bryce spreads that muscular ass apart and eats that ass deep making Sebastian's cock rock hard and in need of more than just that pretty mouth of his. Sebastian then turns his attention to that smooth ass he'll soon be inside of. He sits back and has Bryce ride his dick. Bryce sits on that meat in a reverse cowgirl as we watch that hot ass take every inch it's given. Sebastian holds Bryce by the waist and helps to impale him on his throbbing meat. He then bends Bryce over and takes that ass doggy style. Bryce holds on as Sebastian rails that hard cock in and out of that tight ass. Bryce can't get enough of that dick as Sebastian takes what's his. Sebastian then gets Bryce on his back so he can pound him missionary. The feel of that thick dick hitting his prostate sends Bryce over the edge as he shoots a huge load all over his smooth abs. Sebastian then pulls out and unloads all over himself and Bryce as his load shoots everywhere.",
  "models": [
    {
      "name": "Bryce Star",
      "person_id": 28475
    },
    {
      "name": "Sebastian Young",
      "person_id": 28480
    }
  ],
  "release_date": "2011-12-30",
  "scene_id": 55949,
  "series": "Young and the Breastless",
  "tags": [],
  "title": "Young and the Breastless, Scene #02"
}