{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we paired up two familiar fan favorites to see what kind of fireworks would happen between them. Ridge Michaels and Dylan Roberts are back and we're looking forward to seeing what they got. Dylan is 22 and currently lives in Northern California. Ridge is 23 and originally from Long Boat Key, FL. Dylan is looking better than ever and says that diet is 75% of it and the rest is the lifting part. It's a whole mind set and definitely admits it's easier when you feed the body right. Ridge is also looking good and fortunately has good genes and isn't really worried about having to worry about his diet. All diets were meant to be broken and around the holidays Dylan likes to gorge on pumpkin pie and Honey Baked ham is Ridge's weakness. We then wondered what is their proudest sexual accomplishment. For Dylan it was doing the Police Academy Gang Bang which went really well. For Ridge, his proudest sexual accomplishments was going to New York and getting the chance to have sex with one of his favorite stars. Some boys have all the luck...These two start before we even hit record as they make out and let their hands roam. Dylan's shirt comes off as Ridge starts to lick his rock hard abs. His shorts are next as Ridge gets a closer look at the tent in Dylan's briefs. He hauls out his rock hard cock and goes to work on it. Dylan moans as he gets his dick worked. Ridge savors his meat licking inside Dylan's foreskin making him squirm with pleasure. Ridge grabs that shaft and shoves it as deep as he can wanting to please his new buddy. Dylan gets Ridge on his feet as they go back to making out. Dylan then gets Ridge on the couch to give him some of the same. Ridge gasps as Dylan wraps his lips around his 8' cock. Dylan goes for it as he shoves that dick deep. He strokes Ridge's cock with one hand as he swirls his mouth around his knob. 'Oh, you suck dick so good' moans Ridge as he watches Dylan go to town on his dick and smooth balls. Ridge's ass is next as Dylan bends him over and goes in tongue first. Ridge can't get enough of that hot tongue inside his hole and soon wants to have more than just Dylan's tongue up in there.Dylan suits up and has Ridge straddle his dick and sit on it in a reverse cowgirl. Ridge grinds his cock down on that cock before starting to ride it. Dylan helps by slamming his meat up into that hot ass. Ridge finally gets that dick he's been wanting as Dylan continues to bounce him on his dick. 'Oh fuck me!' Ridge moans as he gets his hot ass stretched. Missionary is next as Dylan gets Ridge on the couch. He spreads those legs and slides inside. Ridge holds still as Dylan goes to work pounding that hole. Dylan rams up into him as Ridge bucks back wanting it all the way inside him. 'You like me inside you' Dylan coos as he bounces that hot ass up and down on his dick. He then moves Ridge over to the other side of the couch for more as he goes back in missionary. Ridge starts to jack his dick harder and faster feeling that familiar tickle in his balls. Dylan picks up the pace wanting to make Ridge cum hard. That does the trick as Ridge loses his load sending it all over his own cock and balls as Dylan fucks him even harder. Dylan then pulls out and unloads his huge cum load all over Ridge's abs and chest.",
  "models": [
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    },
    {
      "name": "Dylan Roberts",
      "person_id": 28414
    }
  ],
  "release_date": "2011-12-16",
  "scene_id": 55945,
  "series": "Oral Roberts",
  "tags": [],
  "title": "Oral Roberts, Scene #02"
}