{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have a brand new face to add to the Circle and his name is Anthony Price. Anthony is a native Floridian and at 19 just starting out in the industry. We wanted to make sure we paired him up with someone who knew the ropes well and who better than Alexander Greene to make that happen. Alexander has become a fan favorite on a couple of our sites. We wondered what TV shows each of these studs felt was the best TV series ever. For Anthony he loves 'Law & Order'. He loves them all. Alexander agrees but he loves 'The Wire' on HBO & if he just wants to kick back and get a good laugh he loves to watch 'It's Always Sunny in Philadelphia'. We then asked when they jack off today what sexual encounter from the past still creeps into the repertoire. For Alexander it would be a hot 3 some he had with a girl and another guy. Anthony also has a hot 3-some memory that involved him with 2 girls. To wrap things up we asked them if they could have a fantasy hook up in a hot tub for New Years who would they want to be with. Anthony wants be with his current girlfriend. (YAWN!) while Alexander isn't telling us details other than he knows who he is and they may not end up in a hot tub; but that's how he wants to ring in the New Year. Anthony is pissed cuz he just got fucked by his phone company hitting him up with bogus charges he can't afford. Alexander reaches over and lifts up Anthony's tee exposing his abs. 'Yeah, I can definitely see why they'd wanna fuck you' Alexander grins throwing Anthony off his game. Alexander assures him that if he fucked him he wouldn't be this stressed out. Anthony isn't objecting as he reaches over and grabs hold of Alexander's thick cock now tenting his shorts. Alexander stands up and drops his shorts giving Anthony all access to his cock. Anthony's eyes open wide as he sees what's in store for him. He hauls out Alexander's schlong and starts to suck on it. Alexander moans as he watches his fat cock disappear into Anthony's mouth. Alexander grabs his head and helps bob him up and down on his thick cock as Anthony struggles to keep up. Anthony strokes that big dick from time to time giving his jaws a rest. He licks all along the uncut shaft and knob as he looks up at Alexander for his approval. Alexander then gets Anthony on the couch and returns the favor. Anthony lies back and closes his eyes in ecstasy as he gets his own cock serviced. They go back and forth sucking each other's hard cocks.Once Alexander's cock is rock hard and needing more, he bends Anthony over and shoves his oversized meat into that tight smooth ass of his. Anthony grimaces as takes that dick all the way to the hilt. 'Awww shit' he groans feeling like he's being punched in the gut from the inside as that huge cock has its way with him. Alexander's smooth balls slap away at his ass as Anthony's hole gets used to his cock stretching it wide open. Alexander then gets Anthony on the couch and drags that ass up to the edge of the armrest so that it's at the perfect height to pound. The sounds of the couch creaking back and forth fill the air as Anthony gets fucked deep. Alexander holds Anthony's legs as he drives that cock deep inside. Anthony is taking that dick like a champ as Alexander switches it up on last time. They lie on the couch together with Alexander lying behind Anthony. Alexander slips his throbbing cock back inside. Anthony lies back as Anthony fucks his tight ass. He rams his cock in deeper and harder as that hot ass just takes every thrust with ease. Once Alexander gets close to shooting he kneels between Anthony's legs as they both unload all over Anthony's smooth abs.",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 28463
    },
    {
      "name": "Anthony Price",
      "person_id": 28478
    }
  ],
  "release_date": "2011-12-09",
  "scene_id": 55943,
  "series": "The Price is Tight",
  "tags": [],
  "title": "The Price is Tight, Scene #02"
}