{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Plenty of sunshine this week as we welcome back Daytona Beach's favorite 21 year old son, AJ Banks. AJ isn't the only Florida boy today as Tristan Sterling makes his debut. Tristan, also from the Sunshine State is 21 and from Orlando. We decided to ask these two about some of their favorites. Favorite color for AJ is neon green while Tristan loves blue. Blueberry ice cream makes AJ come running while chocolate is Tristan's weakness. When it comes to TV shows, It's 'GLEE' for Tristan and 'How I Met Your Mother' for AJ. When it comes to pizza toppings, sausage is AJ's favorite; while Tristan prefers a fungi. (Well, who doesn't?) They both love reality TV and AJ would want to be in a series of the 'Real World'. Tristan would want a part in his favorite show 'GLEE'. We then turned the topic to the nitty-gritty and asked what the naughtiest things they've done at home. AJ blushes and admits he's tried some water sports. Tristan confesses to having a bit of a leather fetish that he's slowly cultivating. We then wrapped it up by asking them their favorite way to cum. AJ loves cumming on someone while Tristan prefers to cum while on his back. Feel free to visualize amongst yourselves.Tristan is hungry and found some old marshmallow peeps from Halloween. AJ walks in and asks him why he's eating those? 'I'm just really hungry and I need something in my mouth' Tristan whines as AJ decides to save the day. 'I got something for your mouth' he grins as he stands and gropes his dick. Tristan's onboard instantly as he drops to his knees in front of AJ and gets to work. AJ moans as he gets his hard cock serviced. AJ holds Tristan's head as he bobs him up and down on it wanting to get it in as deep as possible. Tristan's not about to complain as he shoves that hard cock even deeper, wanting all of it down his throat. AJ then gets Tristan on his back; straddles his chest and starts to fuck his mouth. Tristan just looks up at AJ as he gets his face fucked. AJ then returns the favor as he takes out Tristan's cock and opens wide. AJ shoves it so deep he makes himself gag on it as he tries over and over to deep throat that meat. Then they take the party south and get into a hot 69 on the floor so that they could get as much of each others cocks as they want. Tristan then straddles AJ's cock and teases him a bit as they make out. When Tristan is ready, he arches his back; aims that dick home and sits on it. AJ moans as he gets that throbbing cock buried all the way in. Once he gets used to that dick inside him Tristan starts to ride that dick with ease. 'Aww I love riding that big cock!' Tristan groans as he bounces on it. AJ then stands Tristan up and bends him over so that he can tap that ass doggy style. Tristan just begs for more as AJ slaps that ass and fucks him even harder. Tristan moans and begs for it wanting to get that dick as deep as he can. He bucks back onto it making sure he gives it up completely as AJ's smooth balls slap away at that hairy ass. AJ grabs Tristan's shoulders, giving him the leverage he needs to shove it in even harder. Missionary is next as AJ gets Tristan on his back; lifts up his legs and gets to work pumping that ass with his hard cock. Tristan starts jacking his cock off faster and begs AJ to make him cum. AJ slams it in harder wanting to get him off on his back the way he likes it. Tristan blows all over himself and once he does AJ pulls out and empties his thick batch all over Tristan's cum-covered cock and abs. Careful what you wish for...you might just get it.",
  "models": [
    {
      "name": "AJ Banks",
      "person_id": 28005
    },
    {
      "name": "Tristan Sterling",
      "person_id": 28071
    }
  ],
  "release_date": "2011-12-02",
  "scene_id": 55940,
  "series": "Onward Tristan Soldiers",
  "tags": [],
  "title": "Onward Tristan Soldiers, Scene #01"
}