{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have two brand new faces for you on CircleJerkBoys and we have a feeling you're gonna like what you see. The first to join the circle is Brad Foxx. Brad is 22 years young and originally from Southern California. West coast meets east coast as we pair him up with 26 year old Marxel Rios from just up A1A in Fort Lauderdale, FL. We asked these two if they had $500 to donate to any charity which would it be. Marxel lost his Grandma to breast cancer so he'd donate his to breast cancer research. Brad would donate his to the Walt Disney Foundation affording many under privileged youth's financial scholarships to further their studies. Both of these studs play on both sides of the buffet table and we wondered when they first tried the man to man fun. For Marxel it was during an 8th grade slumber party when he woke up next to his friend that had a boner. He got hard and then they just started sucking each other off. Sounds like quite the sleep over.  For Brad, he waited a lot longer before getting into that scenario. He was 21 and out with friends at a bar where they all got hammered. They went home and someone ended up straddling the bar. (& by 'the bar' we mean...you know!)Brad is looking at a DVD cover commenting on how ugly the chick is, 'I'd rather stick my dick in your mouth than have her suck my dick' Brad tells Marxel who looks over the cover and agrees he'd rather suck his dick than watch that skank do it. That's all the permission Brad needs as he stands up to take Brad up on his offer. Brad undoes his jeans and once they drop he sees brad's huge boner tenting his boxers. 'Holy Shit, that's HUGE, Bro' Marxel says before shoving Brad's hard cock down his throat. Brad moans as he watches his buddy worshipping that dick for him. Brad's smooth and defined and his cock is thick and points straight out and sliding down Marxel's throat with ease as Marxel worships that dick. Brad has heavy low hangers that are as smooth as the rest of him and sway back and forth as Brad starts to fuck Marxel's face. Brad then gets on his knees to return the favor and is pleasantly surprised with Marxel's meat. Marxel is tight & inked with a bad boy look to him. He holds Brad's head as he helps bob him on his aching meat. Marxel then gets on his knees as they start to make out and rub their cocks together. They take turns sucking on their cocks, edging each other as they get hornier for more.Marxel finally turns that ass around and gives Brad the access he's wanted. Brad starts to finger that sweet hole as he gets that tight hole ready for more. He finger fucks Marxel as that ass gets hungry for Brad's dick. Brad sits back and Marxel climbs on board. He straddles that chair and sits on Brad's meat. He doesn't waste any time before riding that dick. Marxel's ass looks amazing. He has perfectly round cheeks on a bubble butt that's smooth, glistening and looks even hotter with Brad's fat boner buried inside. Brad loves that hole as it pleasured his hard dick. Brad then gets Marxel bent over that same chair and starts to tap that sweet ass doggy style. His thick cock pushes back inside as it stretches that hole wide open. Marxel braces as he gets that hole fucked deep. Brad then takes the party south as he lies back and watches Marxel sit back down on his meat. Marxel braces himself on the floor as he pumps that ass up and down on that dick before leaning forward and squatting on that dick making it hit harder and deeper in all the right spots. That sends Marxel over the edge as he just sits on Brad's dick and unloads all over Brad's navel. Marxel then gets off that dick that by now is aching to blow. Brad jacks and unloads a massive nut that catches everyone by surprise. Brad sends his thick cum blasting over his own head...and everywhere else. Hmmm, someone was a tad overdue...",
  "models": [
    {
      "name": "Marxel Rios",
      "person_id": 28050
    },
    {
      "name": "Brad Foxx",
      "person_id": 28485
    }
  ],
  "release_date": "2012-01-27",
  "scene_id": 55957,
  "series": "Getting Foxxed",
  "tags": [],
  "title": "Getting Foxxed, Scene #02"
}