{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Ty Tucker is back at CircleJerkBoys.com and he's here to help us welcome Rex Wolfe. Rex is 22 years old and from Wisconsin. Ty is a local Florida boy and also 22. We asked these two what their favorite as well as their least favorite when it comes to fast foods. Rex thinks McDonalds is his least favorite but his favorite is Wendy's. Taco Bell is the worst according to Ty but agrees with Rex that Wendy's is also his favorite. We then asked these two what their favorite beverage is when out at a bar. Grey Goose tops Rex's list which he has with some 7-UP. 1800 Tequila margaritas hold the salt please for Ty. We then turned the topic to something a bit more personal and asked them what their most memorable sexual experience was. Ty's involved sex in a movie theater and even though he wasn't able to finish he still remembers it fondly. Sex on a rock by the beach under moonlight is what comes to mind when Rex pondered that one. We took it home by asking what they think their strongest talent would be. Ty says anything with his tongue and Rex says his cock sucking skills are definitely top notch. Well let's see how we put those strengths to good use...Ty is sniffling and in need of some tissue and Rex brings him some toilet paper cuz he went through all his tissues. ?My head's all clogged up? Ty moans as Rex grabs his cock and tells Ty he has something else that's ?clogged up?. Ty reaches over and grabs his boner that's straining to get out of his gym shorts. Rex stands up to give Ty better access as Ty grabs his growing meat and starts to suck it through his shorts. Rex strips off his tee as Ty slides down his gym shorts releasing his uncut 8?? cock. Ty opens wide and takes as much of that thick dick into his mouth as he starts to suck that dick. Rex just moans as he watches his aching cock disappear into Ty's hungry mouth. Ty slaps his tongue with it before shoving it back down his throat. Rex can't help but start to fuck that pretty face as his balls slap at Ty's chin. Ty doesn't mind and is more than willing to service his huge cock. Ty then gets up on the couch as Rex strips his shorts off to return the favor. Ty's cock is soon throat deep in Wisconsin real estate as Rex swallows his dick to the hilt. He strokes and laps at that cock driving Ty wild as he works his knob and smooth balls. Ty then goes back to working Rex' fat dick wanting to get it hard for what's to come...Rex then bends Ty over as he starts to explore that tight ass he's about to fuck. Ty arches his back giving Rex an all access pass as he gets his ass fingered and teased. Rex' cock is aching by now so he suits up and gets into position, sliding his thick dick inside. Ty moans as his tight ass gives way taking that uncut cock deep. Rex wastes little time before he start to fuck that ass full of dick. Ty is rock hard as he gets that hole stretched and is loving every inch of it. He picks up the pace as Ty struggles to accommodate his hard cock. Soon Ty is bucking back onto that dick wanting Rex as deep as possible as he gets that ass railed. Rex then sits back and watches as Ty takes his meat in a reverse cowgirl bouncing up and down on that dick with ease. He leans back onto Rex' chest as Rex takes over slamming his huge cock up into that tight hole. Ty groans his approval as Rex continues to stretch his ass open. Missionary is next giving Rex the perfect position to slam his cock in deeper than before. That tight ass sends him over the edge as he pulls out and busts his nut all over Ty's chest and face.",
  "models": [
    {
      "name": "Rex Wolfe",
      "person_id": 28482
    },
    {
      "name": "Ty Tucker",
      "person_id": 28325
    }
  ],
  "release_date": "2012-01-13",
  "scene_id": 55952,
  "series": "Pipe Fitter",
  "tags": [],
  "title": "Pipe Fitter, Scene #01"
}