{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have two new faces to introduce to the CircleJerkBoys fold. The first is Bryce Jones. Bryce is 20 and a Kentucky native. Everyone can use some KY from time to time. Leon Knight makes up the second half of our duo. Leon is also 20 years old; he is from Washington, D.C. We asked these guys whether they prefer popcorn or candy when they go to the movies. Leon prefers popcorn if he had to pick just one. Bryce prefers his Raisinets over popcorn any day. Movies are a great place for a date but we asked where they would take a date if they wanted it to be more romantic. Bryce would take his date to the beach. Wasn't a bad plan 'til Leon said if money was no object on this hypothetical date... Italy would be incredibly romantic for a date. Leon = 1 : Bryce = Hmm. lol Wrapping things up, and hoping to give Bryce a chance to redeem himself, we asked these two studs what their ex-boyfriends would give them gold stars for under sexual performance. Leon says everyone raves about his head. He finds it funny since he doesn't really get into it that much. Bryce grins and says he deserves a gold star from all of his ex-boyfriends for ?Kissing in the Crevices?. ...Hmmm. We're not sure if that's a sexual category or Garth Brook's latest CD. ?Go ahead and discuss amongst yourselves.Bryce is chillin reading up on stock investments when Leon comes in answering a posted add for a roommate. Unfortunately that room's been filled and Leon is bummed and wishes there was something he could do. Apparently there is, as Bryce leans in for a kiss. They start to make out as they stand and start to feel each other up as their clothes start to hit the floor. Bryce's knees follow suit as they hit they floor so he can get a better taste of Leon's thick cock. Leon moans as Bryce sucks that cock down to the hilt. He strokes on Leon's meaty shaft as he swirls his mouth around his throbbing knob. Leon moans as he holds Bryce's head and slides it back and forth on his meat. Leon is naturally smooth and keeps his bush neatly trimmed showcasing his cock nicely. Leon then pulls Bryce to his feet as he starts to make out with him and get at that hot ass. He slides down those briefs and gives us a view of Bryce's beautiful ass. He spreads those cheeks apart and runs his finger along that hole. ?You like that ass?? Bryce moans as Leon strips off those pants and gets him on the couch to get some dick of his own. Bryce just moans as Leon gets to work on his meat as he runs his tongue along his shaft and knob. Leon sucks that dick deep as they take turns pleasing each other's throbbing cocks.Leon then bends Bryce over and gets that hot ass ready for more as he shoves his hot tongue deep into that hole. Bryce shoves his head in deeper wanting that tongue as deep as possible as his toes curl and his ass gets hungry for a lot more than a rim job. Leon is on board with that as he stands and gets into position. He pushes his cock inside and gets to work tappin' that hot ass doggy style. His smooth nuts slap away at Bryce's furry hole as Bryce struggles to accommodate his thick intruder. Leon rams his meat deep inside that ass as he holds Bryce by the waist and continues to impale him harder and deeper. Bryce then switches it up as he sits back and has Leon ride his cock in a reverse cowgirl. Bryce's cock stretches that tight hole open as it slams into Leon's prostate as he bounces up and down on that hard dick. Bryce's boner does the trick as Bryce jack-hammers that dick up into that tight ass. Leon gets off that ride quickly and spins around seconds before exploding all over Bryce's chest. Bryce isn't far behind as he jacks his own throbbing cock until it explodes all over his cum soaked chest and happy trail. Happy trails to you, my friend. ...Happy Trails indeed.",
  "models": [
    {
      "name": "Bryce Jones",
      "person_id": 28483
    },
    {
      "name": "Leon Knight",
      "person_id": 28484
    }
  ],
  "release_date": "2012-01-20",
  "scene_id": 55954,
  "tags": [],
  "title": "Knight Rider, Scene #01"
}