{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Today we welcome a new face to the circle as Jimmy Fanz makes his debut. Jimmy is 20 years old and a hottie from the 305-Miami, Baby. With a handsome face, killer smile and a furry chest we're sure you'll love this guy. Helping us welcome him aboard is Gavin Waters. Gavin is just being Gavin today and on hyper coy mode. He tells us he is 'in his twenties' and was born 'up north'. Hmmm. Well we're all about being vague and totally understand fearing you're over the Gay Hill in your twenties; but when this one turns 30 in 5 years this New Yorker's gonna be in for a rude awa-oops, we're rambling. We then asked what their perfect 3-course dinner would entail. Gavin's answer was all-encompassing, 'Vagina for Breakfast; dick for lunch & vagina for dinner'. If Gavin's dining accompanied, that's gonna be one crowded table. No sharing please. Jimmy would order a salad; followed by a Chicken entree and, being a Florida boy, he'd top it off with some Key Lime pie too. Mmmm, Key Lime pie.  We then turned the topic to sex; what could go wrong as we asked what the last thing they masturbated to was. 'Gavin Waters getting fisted' was Gavin's quip; though he assured us he was only 'joking'. (Exit to moral high road ahead) Jimmy, who up until now had been the voice of reason, chimed in with 'Squirting' (WTF!?) reminding us that that was all the time we had left. -whew!Gavin and Jimmy are talkin sports when Gavin brings up the Tim Tebow kiss everyone's talking about. Jimmy is curious about how the kiss actually was that it would make people think he might be gay. Gavin comes over to show him the difference as they start to make out. Yup, plenty gay. Jimmy gropes at Gavin's growing cock as he undoes his pants and pulls out his uncut cock. He wraps his lips around it and gets to work sucking on that dick as Gavin moans his approval. Gavin's naturally smooth and he keeps everything else hair free as well. Jimmy caresses his smooth balls as he slides that dick down his throat over and over. He looks up at his friend to make sure he's doing it correctly as Gavin starts to fuck that pretty face of his. Gavin then gets Jimmy on the floor; strips off his pants and takes his turn at bat. He strokes Jimmys dick as he swirls his hot tongue around his knob. He swallows it deep as Jimmy lays back and enjoys the special attention. Jimmy's so horny from the head he's getting he gets an urge to taste some ass. He bends Gavin over and dives into that hot ass tongue first. Gavin just moans as he gets that ass eaten out and fingered before Jimmy gets back on that dick for more.Gavin is rock hard as he sits back and watches Jimmy straddle his dick.  He holds it in place as he impales himself on it as Gavin revels in ecstasy. Jimmy is horny for that dick as he starts to ride it hard. He bounces up and down on that pole steadying himself on Gavin's thighs as he takes that dick as deep as he can get it. Jimmy's own dick is rock hard and slapping at Gavin's abs with every thrust he's given as Gavin starts to slam that dick up into that hole even deeper. Jimmy moves his leg over and rides that cock side saddle for a bit getting it to hit new ground. Gavin then gets Jimmy on his back and flips his legs up and pile drives his meat down into his ass. He bobs up and down as his dick stretches Jimmy's tight hole. Jimmy grunts getting that cock shoved deeper than before as Gavin takes that hole as he pleases. Doggy style is next as Jimmy gets on all four as Gavin taps that ass some more.  Jimmy gets so turned on, he nuts while Gavin's pounding him. He gets up on his knees and beats off all over before resuming the position for Gavin. Gavin slides his meat back into Jimmy until he's ready to nut blowing his huge load all over Jimmy's hairy ass.",
  "models": [
    {
      "name": "Jimmy Fanz",
      "person_id": 28056
    },
    {
      "name": "Gavin Waters",
      "person_id": 28347
    }
  ],
  "release_date": "2012-02-24",
  "scene_id": 55964,
  "series": "Getting Jimmy With It",
  "tags": [],
  "title": "Getting Jimmy With It, Scene #01"
}