{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "AJ Banks is back this week and he's here to help us welcome Devin Adams to the circle. AJ is 21 and from Daytona Beach, FL and who better to show this sexy 23 year old from Baltimore, MD how it's done here in the Sunshine State? Both of these boys are rather easy on the eyes and we figured we'd ask what the most recent complement someone had paid them was. For AJ, it would be a complement on the Coney Island High Detention shirt he's wearing. Devin has a more interesting answer, 'It was you, Harlan, you said I have big balls' Well who doesn't love big balls? Speaking of balls we then asked how these guys like to keep their bush. Both prefer to keep their own trimmed and prefer their partners trim as well. AJ has a follow up since he bats for both teams. He likes his men trimmed but loves his girls shaved clean. AJ is a bit more experienced than his costar today so we asked Devin about his first time with a guy. Devin's first was at the tender age of 18 when he was a lifeguard on the beach. We asked him if it was everything he'd hoped for. 'Yeah...it was' he beams as his face literally lights up, 'and more!' Awww.Devin is workin' on his homework when AJ walks in and asks him for a Band-Aid. When Devin asks him what for AJ blushes a bit before admitting he sorta cut himself trimming. Devin isn't following his lead so AJ pulls down his shorts and shows Devin exactly where he cut himself while trimming his pubes. Devin sees the small nick at the base of AJ's cock and tells him he doesn't have a Band-Aid but he could kiss it to make it better.  We LOVE this guy! AJ grins as Devin goes in for a kiss and makes it a French one as he starts to suck on AJ's growing cock. AJ moans as he gets that dick sucked on, holding Devin's head as he slowly fucks that handsome face. Devin takes his time on that meat until his own dick is screaming for attention. He hops up on a chair and hauls out his own dick for AJ to savor. AJ spits on that dick and goes to town on it as he shoves that dick so far down his throat it makes him gag. 'Yeah, you like that big dick?' Devin coos as AJ worships his meat and smooth nuts. They take turns sucking on each others cocks until Devin gets horny for more than that dick in his mouth.AJ suits up and sits back as Devin straddles his dick and starts to ride it. He takes that cock to the hilt and goes for it, grinding that hot ass of his all the way down on it. AJ moans as Devin fucks himself silly; until he starts to get that tingle and tells him to take it slow. Devin's own thick dick is springing up and down as Devin rides AJ. AJ then wants to take control and gets up and bends Devin over the same chair. 'Fuck my ass, yeah' Devin begs with that sexy voice of his as AJ delivers. He fucks that sweet ass doggy style as Devin just begs for more. AJ's balls slap away at Devin's ass as he continues his assault. The sexual chemistry is off the charts as these two go at it. Devin then gets on his back so he can watch as AJ pounds his ass harder and deeper. That cock slams into his prostate until Devin can't hold off any more. He starts to nut as AJ pounds him harder. He coats his smooth chest and abs as AJ pulls out and goes for his. AJ jacks his throbbing cock until he shoots a huge load all over Devin drenching everything from his shoulder all the way down to his cum-coated cock. Anyone else need a Band-Aid? lol",
  "models": [
    {
      "name": "AJ Banks",
      "person_id": 28005
    },
    {
      "name": "Devin Adams",
      "person_id": 28488
    }
  ],
  "release_date": "2012-02-10",
  "scene_id": 55961,
  "series": "The Nicks Game",
  "tags": [],
  "title": "The Nicks Game, Scene #02"
}