{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have sexy Chris Tyler back in the house to ride the ridge, Ridge Michaels that is. Chris is 26 years young and originally from the Lone Star State. Ridge is 23 and a Florida boy born on Long Boat Key to our north. We thought we'd get an idea on what makes these boys tic and asked if they could be anybody for a day who they would be. Chris would want to be the President for the day while Ridge would want to be the gay Hugh Heffner. Hmmm. Chris tried man-on-man fun about 3 years when he tried taking dick for the first time. It was more work than he thought it would be but admits there's a pay off. Ridge has also experimented with women. He started off with women and is still attracted to women. Ridge has mostly been more of a bottom for us and we wondered if that was what he mostly was into off camera in his personal life. Ridge assures it isn't but that it also has a lot to do with who wants what and the chemistry between them both on and off set. He also admits he's been able to take a lot of what he's learned on cam and applied it to his moves at home. For Chris, it's the opposite. What happens at work stays at work and he doesn't want the two worlds to ever collide. On that note, buckle up boys...'Man, you still got your pants on' laughs Chris 'you got a fucking morning wood, bro!' Chris then pants Ridge, yanking his PJ bottoms and underwear down around his ankles. Ridge's hard cock springs free as Ridge grabs Chris' cock to find he's in the same boat. Chris admits he's always excited as they start to make out. Ridge pulls down Chris' shorts as he gets down on his knees and starts sucking on Chris' thick uncut dick. Chris' nut sack is huge being born with a bonus nut making all the difference as his huge nuts slap away at Ridge's chin. Ridge has Chris moaning and totally impressed with his oral skills as Ridge flips around so he can get that tongue up inside Chris' beefy ass. Chris moans in ecstasy as he gets that hole licked. Ridge then stands to let Chris give him a little of the same. Chris shoves that dick as deep as he can as he sucks on Ridge's smooth nuts and chokes down as much dick as he can take. Ridge moans as Chris uses his hot mouth and fist to pleasure that dick. Chris is hungry for that dick as he savors every inch fucking his face with it as he tugs on Ridge's balls. From there they end up in a hot 69 with Chris taking top bunk sucking more dick as Ridge eats that ass getting it nice and wet.Ridge eats that smooth ass making Chris horny for more than that tongue of his. He slides a rubber on Ridge's thick 8' cock while he's still riding his face then announces he's gonna sit on that dick. He gets off Ridge's face and straddles that thick dick as he holds it steady before slowly sliding it into his ass. 'You like that?' he coos as he starts to ride Ridge's thick cock. Chris starts to ride that dick like a pro bouncing on that dick hard and fast taking every thick inch as deep as he can get it. Ridge then starts slamming his dick up into that ass getting it in even deeper as Chris whimpers in delight. Ridge then gets into position as Chris gets into a push up position with his feet on the couch and his hands on the floor to give up more ass. Chris can't get enough as Ridge slams that dick back inside for more. 'Ride that ass' Chris begs as Ridge pounds him even harder. Ridge easily gets that dick deep by sitting on Chris' thick thighs and having that ass at the perfect position to fuck in and out of. Missionary is next on the menu as Chris gets his ass served up as Ridge holds his legs in the air and slams back into Chris' hole. He fucks him hard and fast sending him over the edge as he pulls out and drenches Chris with his massive load. Chris then jacks his own cock to completion adding more load to the mix.",
  "models": [
    {
      "name": "Chris Tyler",
      "person_id": 28492
    },
    {
      "name": "Ridge Michaels",
      "person_id": 27913
    }
  ],
  "release_date": "2012-03-02",
  "scene_id": 55967,
  "series": "Breakfast Sausage",
  "tags": [],
  "title": "Breakfast Sausage"
}