{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have two hung hotties that have become fan favorites. The first is a local stud that is from Ft. Lauderdale, FL. At 23, Trey Turner has an awful lot going for him. Trey is tall, charming and packs an impressive 8' dick. The second charmer is tall, dark and handsome, 25 years old and hails from Wichita, KS. He goes by the name of Jason White. They both figured out they were packin' more than the average bear when they were in middle school. 'Never underestimate the white boy' laughs Jason. They both love having big dicks and Jason and Trey love the initial reaction to it when they aren't expecting it. 'It's hilarious', Jason says, 'some people get up and run from it and others say 'Let's GO!'-and those are the ones I love.' They both agree the down size is all the hot ones that just flat out refuse to do anything with their beefy adages. Pfff. Well we could judge, but Jason does have a thick Midwestern fuck stick that measures in at a rock solid 9'. <sigh> They're both versatile but prefer to top and today Trey's taking one for the team. We're pretty sure he'll take all nine for any team that Jason's on. We'll all be cheerin' him on...from a safe distance.They start kissing as they undress each other. They land on the futon and continue pulling off each others clothes. The passion is definitely not going to be an issue for these two lip-locked lovers. Trey undoes Jason's pants and as he's fumbling to get them undone we can already see Jason's thick 9' cock at full attention sticking str8 out of his briefs and almost completely out of his shorts. Trey finally gets them open and just when he's getting a mouthful, Jason flips the script and has him on his back and goes to town on Trey's own thick dick. He bobs his head up and down on Trey as Trey moans at his every bob. Jason then sits back and lets Trey have more of that dick he wanted earlier. He spreads his legs wide and Trey takes his place on his knees so he can worship on that rock hard altar that is Jason's mammoth cock. Trey engulfs it and swallows it to the hilt. He can't get enough as Jason uses his hand on the back of Trey's hand to get his dick deeper and deeper into Treys' throat. After some dick attention, Jason goes right back to work on Trey as they switch off back and forth servicing each others thick dicks.The sounds of slurping and sucking fill the room and just when you think they can't get enough we get a shot of Trey's hot ass being spread wide by Jason. Jason slowly shoves his thicker than average cock deep and once it hits cock bottom he slowly pulls out and slides it back inside. Trey grunts 'Aww, fuck my ass' as he gets his ass fucked. Jason is bouncing his smooth balls off Trey's hungry ass in no time as all he can do is whimper like a bitch. He spreads his legs wide once Jason puts him on his back before slamming back in him for more.  He goes from missionary to giving it to him lying down behind him. His cock is so big he can maneuver him into different positions all-the-while buried inside Trey's hungry ass. 'Your ass feels so good' coos Jason. Trey then sits atop his thick cock and begins to ride his dick. Jason is in awe as Trey grinds his hole all the way to the base. Jason gets so turned on he begins to jack-hammer his cock up into Trey. This boy can fuck in ANY position he's in. DAMN! Jason then puts him on his back and fucks the hell out of him missionary. He fucks him so hard and fast that Trey gets his load fucked out of him as Jason follows suit almost immediately. He pulls out and shoots his massive load all over Treys' defined chest and face. ",
  "models": [
    {
      "name": "Jason White",
      "person_id": 28490
    },
    {
      "name": "Trey Turner",
      "person_id": 27927
    }
  ],
  "release_date": "2012-02-17",
  "scene_id": 55963,
  "series": "The White Stuff",
  "tags": [],
  "title": "The White Stuff"
}