{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have a special treat today as we finally have sexy Jake Steel back in the house. It's been a while since we've seen the 23 year old from Maryland and we have a special surprise for him as he gets to help welcome a newcomer to the CircleJerkBoys brotherhood, Blake Savage. Blake is one of those Midwestern boys we love so much down here and this 20 year old Buckeye is in great hands. Well, he'll be in more than that soon enough.  We asked these two lookers what the last complement they each received was. Jake flashes us his pearly whites and says someone complemented him on his smile. Awww. Blake just grins and tells us his last compliment was someone telling him he had a nice dick. TEAM BLAKE!! We wondered what these two felt about their first time in the sack. Jake recalls it being a good experience but if he could change the setting he would've wanted it somewhere other than a trailer. Don't judge y'all! For Blake who is grinning ear to ear he says his first time was in middle school with a girl who wasn't exactly 'luscious' but judging from the grin on his face-she did something right. Blake is looking through some DVD covers getting hard when he hears Jake come home. He quickly hides behind the curtain as Jake sits down and starts looking at the DVD covers & wonders why there's one on the floor. As he notices Blake's shoes he also notices a half hard cock start to slide out through a hole in the panel. He grins and knows exactly what to do as he starts to suck on that thick dick. Blake moans as he gets that cock worked and soon pulls back the curtain to watch Jake in action. He loves that mouth on his cock so he gets out front and center to give Jake all the room he needs. Blake strips down and Jake has all the access he needs to worship that Midwestern meat. Blake lies back as Jake continues to nurse on his pole. He can't get enough of that dick but soon Jake needs some attention too. They start to kiss and then Blake hauls out Jake's cock to return the favor. Jake slides his cock inside and starts to fuck that pretty face deep as Blake takes every inch he's given. Jake then gets on the floor as Blake sits on his face. That leads to a hot 69 with Jake's tongue up Blake's ass while his dick is down Blake's throat.The next thing we see is Jake moaning as Blake taps that ass. On all four Jake's giving it up doggy style as Blake rams that dick deep. The louder Jake moans the harder Blake delivers it. Blake's balls slap away at that hungry ass as Jake strokes his own boner. Blake holds Jake by the waist and goes to town mounting that hot ass. Then he pulls out and sits back as Jake sits on it in a reverse cowgirl. We have the perfect view of that dick sliding in and out of that ass as Jake rides it. He grinds his hole all the way down wanting every inch of it buried deep inside him. Then Jake gets off it and sits back down on it facing Blake as he makes out with his new buddy. Blake then turns it up as he starts to slam that meat up into Jake who's already busy bouncing on it. The chemistry between the two is on fire and it won't be long before loads fly. Jake grinds faster as Blake pumps that hole deeper and faster. As Blake's getting ready to cum Jake gets off him and watches Blake blow his wad all over his smooth abs. Jake then gets to give his pretty boy play mate a hot facial as he jacks his own load all over Cleveland! Shame tha dick is oy good!",
  "models": [
    {
      "name": "Blake Savage",
      "person_id": 28497
    },
    {
      "name": "Jake Steel",
      "person_id": 28084
    }
  ],
  "release_date": "2012-04-13",
  "scene_id": 55978,
  "series": "Savage Steel",
  "tags": [],
  "title": "Savage Steel, Scene #01"
}