{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "'You make a grown man cry' Six simple words sung over and over by the Rolling Stones that seem to be a fitting theme song for this week's episode. Oh yes, the 25 year old Florida native that packs a beer-can thick 9' monster cock and goes by the name of Jessie Alan is back! For those of you unfamiliar with Jessie, he's a fan favorite on our brother site, ExtraBigDicks.com and really embodies what having a big dick is all about. Jessie is every size queen's wet dream and this hung top boy's been known to make several grown men cry.(...for all the right reasons) Jessie tops 98% of the time with rare exceptions made when in a committed relationship and even then it's not a given. Today to do a LOT more than swoon at the sight of that big dick is a baby-faced hottie with a following all his own, Jake Lyons. Jake made his debut here on Circle Jerk Boys and this Ohio boy now calls Miami home. Jake has boyish, classic features, a fat uncut schlong and a smile that could light up any room. He's 22 and eager. We all love 'eager'. Both of these studs are currently single and enjoying their freedom. Well, these two studs will soon be enjoying each other. Shall we? Jake is reading in the couch when Jessie walks in and decides he has a better idea. He takes the book out of his hand and undoes his jeans and shows Jake just what he has planned. You don't have to ask Jake twice as he starts tonguing Jessie's tight red briefs. His crotch is growing by the second and it won't contain his cock for long. Sure enough one minute he's licking cotton the next he's licking uncut Florida meat. Jessie's cock is still growing as Jake starts suckin and tuggin' at it with his hot mouth. Jessie's cock doesn't take long to get ready. Jake is soon getting that pretty face of his fucked by Jessie and that monster meat. Jake isn't one to complain. Jessie then strips naked as he helps Jake out of his own clothes. Jessie then returns the favor as he starts sucking on Jake's uncut cock. He expertly licks and sucks on the foreskin before taking it deep into his mouth. Jake just watches as Jessie services his cock for a change. Jake bites his lower lip as he revels in the new sensation. He gets so turned on he's soon back on his knees with more than a mouthful of Jessie to savor. He looks up at Jessie as he slowly runs his tongue up along the length of his massive shaft.The sound of Jake slurping and sucking fill the room as he continues to service Jessie's fat cock. All this attention is getting Jessie horny for more than that beautiful mouth. He gets up and puts Jake on all four as he samples what's next. Jake groans in ecstasy as Jessie starts to eat that sweet ass of his. He gets that tight ass wet and ready for a proper fucking. Jessie then dry humps that ass for a few before shoving that meat home. Jake's ass is ready and is soon getting pounded. Jessie fucks him doggie as Jake scrambles to accommodate every delicious inch he's taking. Jessie then puts Jake on his back and slides back inside missionary getting that dick even deeper. He pins Jake down, holding him in place by the back of his knees. He ain't going anywhere. WHY would he? Jessie is loving it as he continues to pound the new Floridian. Jessie then gets him up and bends him over and dicks him so hard it hurts. Jessie is fucking Jake hard and deep and he can't seem to get enough of that tight little ass. It won't be long before that ass milks his load right out. Soon Jessie starts to feel that familiar tickle and pulls out as they stroke off side by side. Jessie is the first to nut as he pumps his load out all over his inked navel; Jake's not far behind as he too coats himself in white.",
  "models": [
    {
      "name": "Jake Lyons",
      "person_id": 30817
    },
    {
      "name": "Jessie Alan",
      "person_id": 28496
    }
  ],
  "release_date": "2012-04-06",
  "scene_id": 55977,
  "series": "A Lyon in Wintour",
  "tags": [],
  "title": "A Lyon in Wintour, Scene #02"
}