{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we're gonna have you down on your knees, begging please, begging us for 'Mercy', Evan Mercy that is. At 21 Evan makes his debut with us this week and he's a long way from home in Lexington, KY. We know you're gonna love some Mercy as much as we do. Helping us welcome Evan to the circle is another 21 year old from up the coast in Daytona Beach, Mr. AJ Banks. We asked these two whom they would love to get a text message from saying that they think they're hot. AJ would love to hear that from Megan Fox-who wouldn't? Evan wouldn't mind getting that text from sexy Keri Hilson. We then asked these studs when they actually lost their virginities. Evan was 14 while out with an older brother at a party. It was his first time drinking and he met a girl there and he blushes when he admits it was a mess and only lasted a few strokes. AJ lost his at the age of 13 with a younger girl...that is now a stripper. We're guessing there's a lesson in there somewhere. A year ago neither of these boys would've imagined actually enjoying sex with another guy; but things change. So we thought we'd asked them what they've learned about themselves when it comes to having sex with guys. 'I know dick in the booty feels good!' beams AJ; while Evan admits he's never met a girl that can suck dick better than a guy. Sounds like we're off to a great start, huh? (evil grin)</br></br>Evan is sitting on the couch looking through porn DVDs when he comes across an all male one. AJ walks in just as Evan realizes its AJ on the back cover with a dick in his mouth. AJ blushes and says it's not that bad. 'I think you'd like it, honestly.' Evan's on the fence about it but his cock is saying something else. AJ reaches over and coaxes Evan into trying it. Evan concedes and pulls down his pants as AJ goes for it. He takes Evan's cock out and goes down on it as Evan gasps at the new sensation. AJ swallows every inch of that hard cock and soon Evan's protests are all moans for more. AJ gets on his knees and just goes to town on Evan's sweet country meat.  Evan gets up to give AJ better access as AJ continues to swallow his meat. Evan is naturally smooth and he keeps his pecs and abs defined. AJ has Evan so horny he decides to return the favor as he kneels and takes AJ's hard cock into his mouth. AJ groans as Evan strokes his cock and works his knob with his mouth. Evan doesn't seem to mind a dick in his mouth either. Wonder what else he won't mind trying now that he's had AJ's hot mouth on his meat?</br></br>Evan sits back as AJ straddles him and sits on his hard cock. AJ loves that dick up his ass and starts to ride that dick like a seasoned jockey. 'Your ass feels so good' groans Evan as he gets that cock worked. Evan slams his meat up into AJ's hungry hole as AJ begs for more. 'You like that?' AJ moans and orders Evan to slap that ass of his as Evan bends him over and starts fucking him doggy style. Evan slaps that hot ass of his as he continues to ram that hard dick deeper and deeper. AJ is cock crazed as he orders Evan to fuck him and slap that ass harder. Evan slides that dick deep and moves it around hitting AJ's sweet spot before going back to railing that ass fast and deep. Evan's smooth balls slap away at AJ's hairy hole as they get closer to climax. Evan then pulls out and gets AJ on his back so he can take that ass missionary. AJ strokes his dick as Evan slams inside for more. AJ is rock hard as Evan's cock slams against his prostate making AJ shoot his nut all over the place. Evan then pulls his hard cock out and blasts his thick nut all over AJ's cum covered cock before bending over and kissing AJ. Awww, it looks like someone's getting a toaster oven after all. ",
  "models": [
    {
      "name": "AJ Banks",
      "person_id": 28005
    },
    {
      "name": "Evan Mercy",
      "person_id": 28494
    }
  ],
  "release_date": "2012-03-16",
  "scene_id": 55970,
  "series": "Have Mercy",
  "tags": [],
  "title": "Have Mercy"
}