{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Leon Knight is back in the house and we're glad to have him back with us. Leon is 21 years old and he's originally from Washington DC. Leon is in store for a real treat because Sebastian Keys is making his return and looking hotter than ever. For those of you unfamiliar with this West Coast fan favorite, Sebastian is 21 and though he's originally from Colorado, he now calls San Francisco home. We wondered when the last time these two party animals got loaded. Sebastian got hammered just last week when he went out to a bar and spent a lot more time there than he wanted to. Leon recalls the last time he tied one on was New Year's Eve down here on South Beach. Fortunately these two are pretty grounded and it's not all about partying. Leon has a boyfriend back home that he's still getting to know and he's excited to see where that goes. Sebastian isn't dating the same girl he was with last time we saw him, she's long gone. It gets better. ?Currently I'm seeing a lovely gal out in San Francisco,' Sebastian confesses. 'She's actually married but they're swingers and it was her husband's idea that we start dating. So we're all one big happy family.? Hmmm. Did he say ?gal?? That's kinda odd. Well, no gals on set today and the only swinging going on will be an awful lot of cock. So let's get to it...Sebastian and Leon make it back to Leon's place and as they drop on the couch Leon suddenly realizes he's sitting on something. He reaches under him and pulls out a butt plug. ?Your girlfriend lets you fuck her in the ass?' Leon beams. 'Mine won't let me anywhere near hers.? Sebastian blushes and tells Leon that's not his girlfriend's. Leon seems confused so Sebastian tells him he loves getting his ass played with. Leon is in disbelief but before time to process the intel, Sebastian stands up and pulls his jeans down showing off that sweet ass. He grabs Leon's head and shoves his face up into that ass. ?Believe me now?? he grins as Leon starts to eat out that hot hole. Leon buries his tongue deep making Sebastian moan as he gets tongue fucked. Sebastian then pushes Leon onto his back so that he can ride his face. He squats over Leon's eager tongue and starts to grind that ass on Leon's face. ?Eat that hole!' he coos before falling forward to get at Leon's thick dick. In a perfect 69 these two go at it each with their own mouthful to work on as they swallow each other's meat. Leon's thick dick is rock hard as Sebastian goes up and down on it like there's oil in them balls. Meanwhile Leon is back to eating that ass as he spreads those cheeks wide and helps himself to more ass. Sebastian then gets a taste of Leon's ass as Leon finds that butt plug and starts to use it on Sebastian's hole. Sebastian gets up and bends over to give Leon better access to that ass. Leon shoves that plug deep inside and starts to fuck it. Sebastian takes it deep before turning around and shoving his cock back into Leon's mouth. Leon then gets to play with that ass some more as Sebastian pulls out an even bigger butt stick?the night stick. Leon teases that hole before sliding that massive pole inside. Sebastian can't get enough as he writhes in ecstasy while Leon shoves that night stick deep inside. Leon then pulls it out and replaced it with his own cock as he starts to fuck Sebastian's ass. He kneels on the couch and get in a push up position over Sebastian as he continues to bury his meat. Then they flip as Sebastian bends Leon over and gives him some of the same, pounding away at that hot ass. Sebastian takes multi-tasking to new heights as he slides that fat night stick back up his own ass while drilling Leon's. He's giving and getting as they work each other into a sexual frenzy. Sebastian gets sent over the edge as he pulls out and unloads all over Leon's back. Leon then strokes his hard cock off all over Sebastian's face drenching it with a hot facial.",
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 27966
    },
    {
      "name": "Leon Knight",
      "person_id": 28484
    }
  ],
  "release_date": "2012-03-30",
  "scene_id": 55973,
  "tags": [],
  "title": "Knight's Stick, Scene #02"
}