{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have two new faces for you this week on CircleJerkBoys and we're sure you're gonna enjoy watching these boys as much as we did filming them. The first, Johnny Murad, is a lean, dreamy-eyed 21 year old from Monroe, LA. His costar this afternoon is a Colorado import by the name of Brenden Pierce who at 24 proudly represents the Mile High City. These studs are young and eager so we wondered what their first time was like. For Brenden he was 17 and was with a girl. He had a great time but hasn't been back to that side of the buffet table. Johnny was 16 when he lost his cherry. It was awkward and he didn't know what to do but the guy he was with was experienced and knew what to do. He has no regrets. Mmhmm. Both of these boys have come a long way since their awkward beginnings and we wondered if there was anything they hadn't had a chance to try but really wanted to. Brenden's always wanted to experiment with a bisexual couple which would suit any desire that might 'come up'. Shameless, we know. Johnny, however, takes this category hands tied with 'I would say having some really aggressive sex like choking, throwing (me) around, slapping maybe?  ...Any takers, gentlemen?Brenden comes home to find Johnny's drank all his liquor. Johnny assures him it's not a big deal and that he'll pay him back. He sure will and Brenden knows just how to collect. He walks over and shoves Johnny's face into his crotch. Johnny isn't about to struggle as Brenden moves in for a kiss. They make out for a bit before Brenden realizes Johnny's rock hard. He pulls off his pants and goes to work on that hard cock. Johnny just moans and watches as Brenden swallows his thick dick. If this is the price for a drink in these parts-make ours a double! Brenden tongue roams north as he licks and sucks on Johnny's chest and neck. 'Suck my cock' Johnny orders as Brenden goes right back down on his cock wanting to get every inch of it down his throat. He bobs up and down on it wanting to get it in as deep as possible. Brenden loves the meat course but soon decides his own aching cock could use some attention. He straddles Johnny's chest and feeds him some cock. Johnny is happy to oblige and gets to work milking that throbbing cock. He tongues all over the shaft and smooth balls making Brenden horny for more... They start to make out and soon Brenden is checking out that sweet ass he wants to tap. He starts to slap that ass as he teases that hole with his fingers. 'I bet your ass tastes good' he grins 'nice and sweet.' Brenden then dives in tongue first and starts to eat that hot hole out. Johnny is in heaven as he gets that hot hole spat on and tongue-fucked. But wait-there's more. Brenden takes out a thick dildo and shoves it inside that spit lubed hole. He crams that dildo in anyway he can as Johnny just moans for more. Brenden is getting that hole loosened up for more. The dildo just may be the main event as the next thing we see it that they've both reconvene on the floor as they lay hole to hole to share a ride. Sharing is caring as Brenden's holds that lucky dildo inside his own ass as Johnny's writhing back and forth on it. Brenden's cock is throbbing as he moves to feel that hard rubber up against his sweet spot.  That dildo is on double duty as it plunges into both of their hungry holes. They sit up and start to make out as they continue to fuck themselves silly. Brenden is the first to nut as he shoots his thick wad all over his cock and balls. Johnny's still going at it as he too leans back and sends his own thick batch shooting up all over his fuzzy navel. Well it seems two is company; and in this case three is a party!",
  "models": [
    {
      "name": "Brenden Pierce",
      "person_id": 28506
    },
    {
      "name": "Johnny Murad",
      "person_id": 28505
    }
  ],
  "release_date": "2012-06-15",
  "scene_id": 55988,
  "series": "Make Mine a Double!",
  "tags": [],
  "title": "Make Mine a Double!, Scene #01"
}