{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Back with us this week is the Man, the Myth, 'The Legend': Jessie Alan. Jessie is a sexy, inked, 25 year-old from Tampa.  For those of you who are not familiar with this native Floridian, he's packing a lot more than his toothbrush. Jessie who first landed on our brother site a while back, had members going crazy over his smooth inked frame and all 9' of his extra-thick, uncut cock. Jessie first discovered he had a bigger dick than most at about 12. He was an early bloomer and even started getting tattooed at 14.  Jessie has never been with a guy that has a bigger dick than his.  When it comes down to settling down, Jessie is into guys who have a good head on their shoulders. That wouldn't be the case for his sidekick Troy Montgomery. That's not to say Troy doesn't appreciate a good 'head' on their shoulders; BUT (comma, pause) We've realized he has a soft spot (literally) for guys with big dicks. He can't say exactly what it is about a guy with a big dick that makes him weak, he just knows they do. Troy is 26 and originally from Ft. Lauderdale, FL. Troy not only brings his appreciation of big dicks to the table, but he's packin' a sweet 8' cock himself. All this dick talk is makin' us antsy; so let's get this party started!They start kissing as Troy immediately begins to explore his larger than life playmate. Jessie's tee comes off, and soon enough, each is scrambling to get the other's pants off. Now in their skivvies, Troy kisses his way south til he reaches the South...you know! He claims the pole as his own and goes for it. Jessie's massive meat is coming alive as Troy opens wide and shoves as much as he can down his throat. He spit-shines Jessie's cock as it gets even thicker. Jessie loves the attention he's getting and wants to do his part. He has Troy get up so he can suck his dick as well. Troy jacks Jessie's rock hard cock as he gets his worked. Jessie then stands up so Troy can sit before him and worship that uncut meat the way Troy's been dreamin' of. He plays with Jessie's smooth balls as he shoves his head down on his throbbing meat. Jessie holds Troy's head, helping him out by bobbing his head faster on his baby maker. Jessie needs more than that mouth and soon has Troy on his back with his legs in the air giving Jessie's skilled tongue access to that sweet ass he will soon be stretching wide.He bands Troy over as he gets a better look at that sweet hole his cock will soon call 'Home'. He fingers it a bit before going right back to eating it out as he buries his face in it. His meat's next, as we see Jessie slowly push his meat inside. Troy is a trooper as he takes every thick inch with ease. Jessie is soon bouncing this hot Latin ass on his dick as his balls slap away at Troy's hungry ass. Jessie then puts Troy on his back and slides that massive meat back inside. He holds Troy's leg up as he begins to pound him deep. Troy isn't phased as his ass gets pounded swallowing every delicious inch. Jessie's cock has met his match. Other takers before would've been squealing by now. Jessie is fucking Troy deep and he can fuck without worrying about being too rough or going too deep. Troy's ass is molded around his mammoth cock and slowly milking that load out. Troy's eyes are somewhere in the back of his head as he gives it up. All this deep fucking has Jessie's cock ready to blow as he pulls out and unloads his cargo nearly hitting Troy in the face. Here's cum in your eye! Jessie then goes down to suck Troy's balls as Troy jacks his own cock. Troy then explodes, sending at least 5 massive jets of cum blasting over his shoulder. Got Leche?  We got a-plenty.",
  "models": [
    {
      "name": "Troy Montgomery",
      "person_id": 28334
    },
    {
      "name": "Jessie Alan",
      "person_id": 28496
    }
  ],
  "release_date": "2012-06-01",
  "scene_id": 55987,
  "series": "Alan's Wench",
  "tags": [],
  "title": "Alan's Wench, Scene #02"
}