{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Sit back and give yourselves some leg room. Your pants may be getting tighter by the second as we introduce this week's newest member to the family, Mr. Josh Long. Josh is here making a special appearance on CircleJerkBoys after wowing all of our members on our brother site MenOver30.com a couple weeks ago. This str8 top boy put that dick to good use adding boxer Brenn Wyson to his list of conquests. Josh is 24 years young and it's no surprise this furry stud has broken his fair share of hearts along the way; specially since he hails from the very place Elvis recorded his own ?Heartbreak Hotel? back in 1956. Nashville, 'the Buckle of the Bible Belt' has outdone itself when it produced this baby faced hottie with a glimmer of naughty in those eyes. Josh loves to spend money on nice clothes to always look his best; but clothes aren't everything. His prize possessions are his 2 pit bull puppies, Bonnie & Clyde. Awww. This hottie lost his cherry in junior high with an older girl and has been perfecting his craft ever since. He jacks off regularly and as long as they're hot he'll use them as reference for example Jessica Alba. Mmhmm. Well today we plan on giving our members something to jack off to. Josh comes home after a long day and decides to slip into something more ?comfortable?. He peels off his tee as we get out first glimpse at his sexy hairy chest with a happy highway that disappears into his boxers. His jeans are next to hit the floor as Josh's hand disappears into his briefs. He starts to tug on his growing cock as he lies on the couch. Josh has a sexy beard he keeps cropped short that frames that baby face of his. He has full lips and bedroom brown eyes you can't help but notice and he sighs softly as he plays with his growing cock. He decides to give his dick some breathing room as he finally pulls it out of his boxers. It's hard as a rock as he starts to jerk that dick. He waves it around showing it off as he uses both hands to stroke and tease it. He pulls his heavy nuts out as well as they bounce in tune to his stroking. Josh then stands up to jerk off and to give us a better view of his cock and furry ass. His ass is furr-fection, perfectly round hairy bubble butt you just wanna explore. Don't get too excited this str8 boy ain't about to let that happen...He groans as he continues to jerk off as we get a great view from below. His balls rock back and forth as he jerks faster. Josh then sits back on the couch; spreads his legs and starts to play with that furry hole. He teases his ass with 2 fingers just outside his hole before finally slipping a finger inside. He lets out a soft moan as he fingers that hot ass and strokes his cock that by now is throbbing. It feels too good to stop as Josh gives in to his desire. He strokes that dick harder as he lies back. All this stimulation has josh horny as hell as he slides halfway off the couch and gets ready to bust a nut. With his back on the floor Josh throws his legs up towards his head as he jacks his cock off faster. ?Oh, I'm gonna cum!? he moans as he aims his rock hard cock at his open mouth and is about to say ?Aaah? when he shoots his thick wad all over his face, furry chest and that sexy tongue sticking out hoping to catch some cream.",
  "models": [
    {
      "name": "Josh Long",
      "person_id": 28070
    }
  ],
  "release_date": "2012-09-07",
  "scene_id": 55999,
  "tags": [],
  "title": "Taking Care of Business, Scene #02"
}