{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have a new face for you today that belongs to 19 year old Brad Cambell. Brad is from the south side of Tampa and this sexy jock spent a lot of time playing sports in high school. Football, wrestling and lacrosse all helped to keep him in shape and he still loves to watch football to this day. Speaking of football, Texas has the hottest cheerleaders in case you were wondering. When we asked Brad if str8 guys compare dicks in the locker room, he says he would say they 'compare' more than they check out each other's junk. When he was on the wrestling team everyone knew who had the biggest dick. We asked Brad what he likes best on his cock. Brad says he loves head almost better than sex. He loves it if she swallows but he's given a girl a facial not too long ago and it was pretty awesome as well. His hottest sexual memory to date was when he had sex with his girlfriend just before a game when he ended up with her in the locker room. He fucked her wearing only his shoulder pads and her in her cheerleader uniform. We're guessing more than her pom-poms got...we better take the high road on this one. lolBrad is watching some porn on his phone and his shorts seem to be getting tighter by the minute. He starts to rub his growing crotch as he gives that dick some attention. He stands up and gets more comfortable as he pulls off his black tee. He keeps watching porn as he strokes his cock through his shorts. He undoes his shorts and lets them fall to the floor before sliding his hand inside his black boxers. His cock needs some room to grow as he pulls it out through his fly. His boner makes it's entrance as Brad strokes his hard on. Brad is naturally smooth and has a sweet 'MOM' tattoo etched into a heart, over his own, on his left pec. He's defined and has a face that would make most do a double take. He loses the boxers to give his balls some space and he's finally able to pleasure his hard cock. He strokes his dick dry as his smooth balls dance below. He tugs on them with one hand as he strokes with the other making his cock as hard as he possibly can. Brad then decides to tease us as he bends over and shows off that hot ass we won't get any of. His ass is slightly hairy and rather inviting. It's the ones that persist that we most want to...stick something inside! We may have embellished on that saying a bit. Brad's cock is rock hard as he stands and strokes his meat. The images of pussy have his dick throbbing as he continues to pull on his smooth cock. Brad keeps his pubes trimmed and it makes that dick look inviting. He sits back and gets comfortable as he continues to play with that dick. He strokes it underhand then overhand switching it up to keep things interesting. As he gets closer he focuses his attention on his aching knob knowing that will do the trick. He picks up the pace as his muscles start to writhe and flex just beneath his skin. His smooth balls pull up tight as we hear Brad's breathing deepen. He softly gasps as he starts to shoot his thick, creamy load all over his smooth chest and navel.",
  "models": [
    {
      "name": "Brad Cambell",
      "person_id": 28516
    }
  ],
  "release_date": "2012-08-24",
  "scene_id": 55995,
  "series": "Mmmm Mmmm Good",
  "tags": [],
  "title": "Mmmm Mmmm Good, Scene #02"
}