{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Chris Tyler and Ty Tucker are back in the house and it's never a dull moment with these Sun Coast boys around. Chris is 26 years young and from Tampa and O-Town boy, Ty is 23 years young. Orlando has more to offer than the Magic Kingdom? Who knew! With the Summer Olympics looming we wondered what event these studs would go to if they had their pick. Chris would want to see men's gymnastics, 'Cuz the boys are SO hot' Chris says in his best effeminate voice. Mmhmm. Ty would want to go see Swimming. (surprised?) When it came to playing sports in high school, Chris played football, baseball and did wrestling. Ty was an avid weight-lifter, played football and ran track as well. If sex was an Olympic event we wondered what category they'd win gold in. 'Tea-bagging!' grins Chris, packing more balls than the average smart ass. He's definitely qualified. Ty would win gold in the fucking category cuz he's a 'Grade-A Cock Star'. Ty, given the choice, would love to have a hot orgy scene with beautiful women. Chris's fantasy scene hits a little closer to home as he admits his secret fantasy is to find someone that can fit all three of his balls in their mouth... Jaws of Life coming right up.Ty and Chris are chillin' when Ty starts to tease Chris about his recently shaved chest. 'Doesn't that itch?' he says as Chris gets up to show off what doesn't. He peels off his tank to reveal his washboard abs. Ty starts to run his hands all over Chris' pecs and abs and his hands roam south to the bulge in his pants. 'What's going on here?' he grins as Chris undoes his pants and gives him the chance to find out. Ty pulls out Chris' massive nuts as he gets to work lapping at those huge nuts. Chris just moans as he gets his nuts then his uncut cock serviced. He holds Ty's head as he starts to fuck his face. 'Suck that cock, Boy!' he grunts as Ty slobbers all over his throbbing meat.  Chris then straddles Ty's face fucking his throat so deep he repeatedly makes him gag on it. Not one to be deterred, Ty goes right back to swallowing that meat and licking those meaty balls. Chris then gets on his knees to return the favor as he swallows Ty's dick. His hot little ass is in the air as he blows Ty on all four. Ty's cock is rock hard as he watches Chris savor every inch of his thick dick making it all wet and ready for more.Chris is getting horny for more as he straddles Ty's cock and eases himself down on it. 'Tight little ass' Ty teases as Chris' hot hole continues to take his cock. Chris struggles to take it all but soon he's riding that dick like a champ. Once he gets used to it inside he starts to bounce up and down on Ty's dick. 'I bet you love that fuckin' ass, don'tcha!' Chris grunts as Ty begins to slam his cock up into him. Ty then turns Chris around and fucks him in a reverse cowgirl as Chris helps himself to as much cock as he can take in that tight ass. Chris' own cock is hard and bobbin' like a trampoline as he grinds that hot hole down wanting to get every inch Ty has to offer in his str8 ass. Fortunately, what comes around goes around. 'Fuck that hole feels so good' Chris groans as he bends Ty over and fucks that ass doggy style. Ty whimpers as he tries to accommodate the pounding he's getting. Chris spanks that ass as he owns Ty's tight hole. Chris' balls slap away at that sore ass as Ty just whimpers and begs for more. As they get close they stand side by side and bust their loads all over the glass table each one impressed with the other's huge load. Whew. Str8 boys!-Go figure.",
  "models": [
    {
      "name": "Chris Tyler",
      "person_id": 28492
    },
    {
      "name": "Ty Tucker",
      "person_id": 28325
    }
  ],
  "release_date": "2012-06-22",
  "scene_id": 55991,
  "series": "Itchin' & Scratchin'",
  "tags": [],
  "title": "Itchin' & Scratchin', Scene #02"
}