{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Brad Cambell is back after quite the warm welcome from our members who got a chance to feast their eyes on this sizzling South Carolinian with a permanent 5 o'clock shadow and sexy blue eyes. At 19, Brad has a long career ahead of him; and we're just glad we get to help him get started. Back after way too long is Lucas Vitello who last appeared on our site in a steamy duo with Chris Tyler. We asked these two growing boys what their favorite food is and who makes it best?  ?For me it's my girlfriend. She makes a dish called ?Pollo Pi?a?', Brad confesses, 'it's chicken marinated in pineapple. It's really good.? Typically Peruvian and it does sound delish! Lucas loves Mexican food and he can't get enough enchiladas.  As for who makes the best enchiladas, that would have to be Mom. Awww. We then asked them what their sweet spot is sexually. They both love to get their necks licked. Well, there's two have more than that in common as we ask them what their own sexual forte is. Lucas prides himself on giving really good head. Brad also loves oral and claims to eat a girl out pretty well. Well, now there's a visual we'll save for a rainy day,  while we focus on getting these hot fucks naked. Shall we?Brad's filling out some paperwork as Lucas waits for him to finish. He's there to do a shoot with Lucas. They start off as Lucas asks him to flex his muscles as Brad peels off his shirt and shorts. As his shorts come off it's apparent by the tent growing in his boxers that it's turning Brad on. ?You got a pretty big dick' Lucas says 'looks rather tasty!? Music to Brad's ears who asks Lucas what he's still doing across the room. Lucas reports to his post on his knees, front and center, ready to taste some Southern goodness. He wraps his thick lips around Brad's throbbing cock as Brad starts to fuck his face. Brad's smooth balls slap away at Lucas' chin as he tries to get his dick in as deep as possible. Brad's solo video has turned into an action one as Lucas strips and joins him on the couch. He gets right back on Brad's pole as he starts to stroke his own uncut dick. Brad is writhing in ecstasy as he gets that dick worshipped. He then leans forward to check out what's next on the menu?Lucas' hot ass.Lucas braces himself as he gets that ass fucked deep. Brad slides his dick inside and immediately gets to work fucking that ass doggy style. He looks down to watch as his cock slides in and out of that hungry hole as Lucas just moans for more. The sound of Brad's balls slapping away at that tight hole fill the room as Brad takes what's his. Brad then pulls his cock out and sits back on the couch so that Lucas can work for it. Lucas sits back down on that hard dick in a reverse cowgirl. He can now stroke his fat dick as he rides Brad to his heart's content.  Brad doesn't mind one bit as he just sits back and watches Lucas pleasure himself on his pole. Glad to be of service, Brad then decides to take back control as he get Lucas up off his dick and onto his back. Brad holds Lucas' legs up in the air as he slides his aching cock in for more. Missionary's gonna bring them both to climax as Brad pounds that hot ass. Lucas can't hold back any longer and explodes with Brad still fucking him. Brad then pulls out and jacks his hard cock off as he unloads the thickest load of sweet Carolina Cream available anywhere.",
  "models": [
    {
      "name": "Lucas Vitello",
      "person_id": 28430
    },
    {
      "name": "Brad Cambell",
      "person_id": 28516
    }
  ],
  "release_date": "2012-08-31",
  "scene_id": 55997,
  "series": "The Casting Couch",
  "tags": [],
  "title": "The Casting Couch, Scene #02"
}