{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Everyone could use a lil' KY on occasion so today we have our favorite KY native hailing from Lexington, Mr. Evan Mercy. Evan has become a fan favorite with that sexy twang and ginger accents and at 21 he has a long career ahead of him. Evan is going to help us welcome a new face to the circle. Aged 18 years and from the Big Apple, Luke Whyte makes his debut today. We wondered what these boys eat when they get the munchies. Luke loves cold pizza and Evan prefers a bowl of fruit. He's picky about his fruit though, it has to be assorted with pineapple, mangos, and some kiwis. We then wondered what they like to sip when they're out. We then wrapped it up by asking these two when they got their first blowjobs. Luke got his first blow job at 13 during lunch in the janitor's closet. 'It sucked!' he laughs. Evan was having a field party with a bunch of his cousins when they all decided they were gonna get lil' cousin laid. It all happened that night getting head then losing his cherry. He still thinks about that when he jacks off. Let's get these two naked and give our members something to jack off to as well...'What you got there?' Luke asks as Evan toys with a new Fleshjack. He'd seen them online but had never tried one out. Evan lets him have it as Luke immediately pulls it out of the box to see what it feels like. 'You've never used one before?' grins Evan 'Lemme show ya'. Evan undoes his pants as he frees his dick that's already rock hard with anticipation. He slides it inside and starts to stroke his cock with it. Fortunately it's one size fits all assures Evan as Luke looks on with amazement. Evan is moaning as he works his cock with the jack. Luke's own dick is feeling left out as he takes his cock out and asks for some help. Evan hands over the fleshjack to get Luke going. Luke lubes up his dick and slides it in. He asks Evan if he's doing it right as Evan takes over for him and starts to pump the jack up and down on Luke's cock. Luke lies back as he gets his cock jacked by Evan. As Luke puts his head back and closes his eyes Evan makes his move and replaces the fleshjack with his own mouth. He starts sucking Luke's cock which is way hotter than any toy. Evan plays with Luke's balls as he swallows his dick deep. Evan sucks his cock for a while before getting up to let Luke return the favor.Luke slides onto his knees as he slides Evan's dick down his throat as he slides his own back into the jack. He fucks the jack as Evan fucks his face. These two can't get enough dick as they switch off using each other's mouths just as much as their new toy. Soon Evan's dick needs something a lot tighter as he gets Luke's legs in the air and his cock up inside that hairy ass. On his back, Luke groans as Evan fucks him missionary. 'I love this better than the fleshjack' Evan moans as he picks up the pace burying his hard, country cock inside. He holds Luke still as he pounds away at that ass. Luke is hard as he watches Evan take that ass. Evan then lies on his side beside Luke as he continues to feed that hole. His balls slap away at that ass as Luke jacks his own cock faster. Evan's cock is hitting Luke in all the right places and Luke loves the new experience. Evan bends Luke over and taps that ass doggy style. Evan's cock slides deeper and harder as they both near climax. They then lie back, cocks together as they share the fleshjack making it even tighter. That warm sensation wrapped around both their dicks does the trick as they both explode all over themselves leaving them a cum-drenched mess. Just the kind we like. <evil grin>",
  "models": [
    {
      "name": "Evan Mercy",
      "person_id": 28494
    },
    {
      "name": "Luke Whyte",
      "person_id": 28515
    }
  ],
  "release_date": "2012-08-17",
  "scene_id": 55992,
  "series": "Fleshing It Out",
  "tags": [],
  "title": "Fleshing It Out"
}