{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We are fortunate enough to have some alone time with one of our fan favorites, Mr. Chris Tyler. Chris is 25 now and originally from Houston, TX. Chris works out religiously but says he doesn't really watch his diet. Out of the mouth of babes! Lol Chris was very active athletically in high school. 'I played football, baseball, basketball, soccer, did wrestling-I was active' he grins '...and now I do porn,' All those short sprints have done wonders for that outrageous ass of his. He admits it wasn't til last week when he actually had a girl want to play with it even though we've had the pleasure of watching that hot ass take a dick...or two. He admits he's never had a 3way and if he could have a fantasy 3way it would be with Vin Diesel and Carrie Underwood. He'd probably be in the middle getting and giving since he loves to do both. He's convinced Vin's gay so that might make that whole fantasy thing easier should he find himself in his company. We wish him the best of luck with that. lol He is a horny one and has a high sex drive and even though he's str8 and has grown to appreciate things in his outrageous ass,  he's never really played with his own. Well, we're here to change all that. ...Shall we?As the camera finds Chris, he's in front of a full length mirror inspecting his progress as he poses and flexes his triceps and biceps. He is pleased with his progress (...and he ain't the only one) as he pulls up his tee to inspect those abs. The abs are kickin and looking hotter than ever. His dedication is really paying off as he strips and admires his defined cum gutters that frame those delicious abs as they disappear into his tight briefs. It's getting hot in here as Chris drops his jeans and starts to admire that ass. He pulls his briefs down giving us a sneak peak as he gropes his bubble butt before turning back around to grope at his cock. He tents his briefs as his dick strains for more room. Chris was blessed with a bit more than most and when it comes to balls he was born with a spare one already installed. You could say his massive nut sack always runneth over. He rubs on his cock through his briefs a bit until he can't stand it anymore. He pulls down his briefs as his rock hard cock spring out. It is definitely at full mast and happy to play as Chris starts to stroke his uncut cock.Those balls are naturally smooth and appear massive as we get a shot from below of him stroking that cock. He tugs on his cock pulling his entire foreskin over his knob before stroking it all the way back. The more he strokes his hard cock the hornier he's getting as his attention wonders elsewhere. He gets on the floor and spreads his legs getting a great view of his ass and balls that are a few inches from the mirror. He gets a small toy and runs it up inside that furry hole teasing his ass with it as he continues to stroke his boner. He gasps a bit as he pushes the dildo inside his tight hole. One deep grunt is all we hear as he shoves the rest inside. He can't help but moan as he starts to shove it in deep, gyrating that hole around as the sensation heightens. He holds the toy in place as he lifts his hot ass up off and then right back down on it over and over. Chris then gets up to keep jacking his meat while admiring it in the mirror. His cock is straining for release as his massive nuts pull up tight around the base of his cock. He gets that cock closer to the mirror as he feels the impending orgasm coming over him. 'I'm gonna fucking cum!' he grunts as he blasts his hot load all over one lucky mirror. His hot nut splatters all over it as it slowly drips south towards the floor. ...Clean up, anyone?",
  "models": [
    {
      "name": "Chris Tyler",
      "person_id": 28492
    }
  ],
  "release_date": "2012-09-21",
  "scene_id": 56003,
  "tags": [],
  "title": "Mirror Mirror On My 3 Balls..., Scene #02"
}