{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Dylan Roberts is back and turning up the heat this week as he helps us welcome a new face to the circle. We can never get enough of 23yo Dylan who is originally from Northern California; but it's Brandon Ford who makes his debut with us this week. We're pretty sure you're gonna love this smooth, 24yo southern boy that hails from Mobile, AL. He even has a slight twang to his voice. Oh goody. With the elections looming, we wondered how these two felt about all the campaigning. Brandon is over it and tired of hearing about it. Dylan has been too busy to follow all the drama but figures that Ryan Paul guy doesn't seem all there. (Out of the mouth of babes.)  We then asked these boys what the last thing they splurged on for themselves. Brandon treated himself to some nice clothes while Brandon splurged on a really nice steak dinner. Turning to topics of the sexual kind, we asked these horny boys what the last thing they jacked off to. Dylan grins as he admits the last thing he used for inspiration as he stroked off was his own hot self during one of his cam shows. Brandon, blushes as he confesses that the last thing he jacked off to was a hot scene featuring none other than  Dylan Roberts. ...How conveeenient! Brandon and Dylan are filling out there forms and start to break the ice over the questionnaire. 'So, do you have any special talents?' Dylan laughs as Brandon coyly teases him about waiting to find out. Dylan is still intrigued that he was the last thing Brandon jacked off to so he asks him about it. 'It was a really hot scene, I kid you not' Brandon blushes, 'I've wanted your dick in my mouth ever since.' Dylan can't pass that up as he undoes his pants and hauls out his growing cock. Brandon gets on his knees as Dylan stands up and drops'em. He moans as he gets that dick worshiped by his new play mate. Brandon shoves that dick deep down his throat as he works that thick cock from knob to base. Dylan can't get enough of that mouth on his meat as he helps bob Brandon's head on it. Brandon then gets up and drops his own to give Dylan something to work on. Dylan sits down and gets to work taking every inch of Brandon's meat down his throat. Dylan loves his thick cock and latches on to it sucking it hard and getting Brandon rock hard. Brandon's definitely gonna have a lot more to jerk off to next time he beats off!Brandon then gets Dylan bent over the chair as he spreads that hot ass and goes in for more. 'You got a hot ass' he groans before ramming his tongue inside. Brandon knows exactly what he's doing as he tongue fucks and fingers Dylan's tight hole, making it wet and Dylan hornier for more. Dylan then returns the favor as he gets Brandon on the couch; holds his legs up and shoves his face into that ass. He sucks on Brandon's hot hole and rams his tongue inside it. Brandon squirms as he gets that hole worked. 'I want you to fuck me!' Brandon begs while Dylan's tongue is still buried deep. Dylan is more than happy to oblige as he slides inside missionary. Dylan is fucking that hot ass deep in no time as Brandon groans with ecstasy. He slams his dick inside as his balls slap at that ass. Dylan then switches it up by getting Brandon to bend over so he can take that ass doggy style. His cock glides back inside that hole as he picks up the pace. Dylan then sits back and has Brandon ride his dick to bring them home. Dylan's hard dick makes Brandon shoot all over himself as he rides it. Dylan then gets Brandon to lie on the floor so he can sit on the couch and straddle his head. He beats off inches above Brandon's face and when he finally blows his wad he aims south shooting all over Brandon's face and chest.",
  "models": [
    {
      "name": "Dylan Roberts",
      "person_id": 28414
    },
    {
      "name": "Brandon Ford",
      "person_id": 28520
    }
  ],
  "release_date": "2012-09-28",
  "scene_id": 56004,
  "tags": [],
  "title": "Ford Explorer, Scene #01"
}