{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Sound the Big Dick alarm as we welcome a new face to the CircleJerkBoy family, Monsieur Jacques LaVere. Jacques is as French as the Statue of Liberty (She's totally French-look it up!) and packing a colossal cock. Just ask any of our members on our brother site ExtraBigDicks.com where the sexy 22 yr old made his debut last month. Tall, uncut, hung and Parisian: what else could you ask for? lol This week Jacques going to put his charms to good use as we also welcome Andrew Austen to the circle. Andrew is in for a wild ride as this 20 yr old Dallas native gets some French infusion one way or another. We asked these two if they could have front row seats to any artist's venue; which venue would they choose. Andrew would love to see Beyonc? or Nicki Minaj. Jacques would rather see the life of the hip hop party himself Rick Ross. We then wrapped it up by asking these two horn dogs what their fantasy fuck was at the moment (cuz you know we like to change our minds, often) Andrew wants to land a hot Brasileiro he could dance Samba with (horizontally, of course) For Jacques, he's had his heart set on fucking an Asian girl and he won't stop 'til he does. We wish him the best of luck. You know what they say: Once you go Asian-you never go Caucasian!  Jacques makes it home after being out in the heat and decides to take a quick shower. He strips off his clothes and heads for the john. Andrew comes in and sees Jacques clothes on the floor and can't help but pick up his boxers to get a good whiff. Just as he has his face full of Scent of Jacques' cock, Jacques returns and busts him doing it.  'I'm sorry' Andrew blushes as Jacques assures him it's ok. He kinda figured what he was into. With that, Jacques drops his towel and orders Andrew to get on his knees. Andrew takes one look at Jacques 9' uncut cock that's standing at attention and his knees buckle for him. Jacques quickly slides his meat into Andrew's mouth as he gets that fat dick worshiped.  Jacques loves to fuck face and he goes to town as he slides his thick cock in and out of that wet mouth wanting to get it in as deep as Andrew can take it. Jacques then decides to get comfortable as he kicks back on the couch with Andrew on his knees between his legs sucking on that massive cock as if there was oxygen in them balls. Jacques is writhing in ecstasy as Andrew feverishly works that dick but takes his time savoring every moment he gets on it.Jacques hand starts to roam south as he starts to play with Andrew's ass. His shorts come off to give Jacques better access as his dick starts to want more than just that mouth on it. Jacques gets on the incline bench as Andrew straddles his thick cock. He impales his hot smooth ass on it as he takes that fat dick deep. Once he gets that dick up inside him, he starts to ride it. He is in bliss as he grinds on that fat cock. Jacques just sits back and lets Andrew do all the work for a bit before taking over and slamming his cock up inside him. 'You like that dick?' Jacques grunts as Andrew gets that ass stretched wider. Jacques then gets up and repositions the bench so he can fuck Andrew on it doggy style. Andrew groans as Jacques starts to really deliver the entire length of his oversized cock inside him. Jacques takes what's his as he piston-fucks that tight ass hard and deep making Andrew moan for more. Jacques then gets Andrew on his side as he goes right back to pounding that hole and slapping that ass. That does the trick as Jacques pulls out and moves to straddle Andrews face just in time to shoot his huge load all over it. French facials are ALL the rage. With that, he hands Andrew a towel (str8 boy move in...3...2...1)- and dips! Andrew, covered in cum, is left to take care of his own nut; while Jacques goes for a quick cigarette. ?Que romantico!",
  "models": [
    {
      "name": "Jacques LaVere",
      "person_id": 28077
    },
    {
      "name": "Andrew Austen",
      "person_id": 28519
    }
  ],
  "release_date": "2012-09-14",
  "scene_id": 56000,
  "tags": [],
  "title": "Ride and Prejudice, Scene #01"
}