{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We are bringing you a special update this week that just screams Double Trouble. Devin Adams is back with us and we are always glad to see this tall drink of water from Ft. Lauderdale. Devin is 24 and he's amassed quite the fan following with that sweet body and a smile that can brighten any room. Devin is helping us welcome a new face to the circle Duncan Black. Duncan, a baby faced cutie from Minneapolis, is just 22 years young. The leaves are changing and autumn's in the air (everywhere but here in the tropics where it's scorchin') so Halloween can't be too far off. We asked these two what their favorite costume to date was. Devin was a Genie last year and he really loved that costume. Make a wish anyone? Duncan was going to be a vampire last year but a wardrobe fang malfunction made him morph into a vampire hunter instead. To wrap it up we asked these two if they still jerk off despite having so much sex on set. Devin admits sometimes it's just easier to jerk off and get it done than to have to go out and look for things to work out. Dustin takes this category with his casting couch confession: 'Not really. I normally just get laid a lot!' Devin is kicking back on the workout bench while Duncan keeps staring at his dick. 'You got something for me?' Duncan grins admitting he's kinda hungry at the moment. He reaches over and starts to grope Devin's growing cock. He unzips his jeans and takes out Devin's cock. Devin gasps as Duncan swallows his dick. He glides his hot mouth up and down on Devin's throbbing cock as Devin moans his appreciation. Duncan is on his knees worshiping that cock and taking it as far down his throat as he can. He takes his time savoring every inch of that hard dick as Devin stands to give him better access as well as allow him to slide it in even deeper. Devin pulls Duncan to his feet and gets behind him to undo Duncan's jeans and help get him out of them. He peels down Duncan's tight boxer-cut briefs that are struggling to contain his boner. Duncan's thick cock is standing at attention and needing some of the same. Devin kneels and goes to work returning the favor as he swirls his tongue along the underside of Duncan's cock. He slides that cock into his mouth getting him horny for more. He then spins Duncan around to get a taste of that smooth ass. Devin shoves his face inside as his tongue starts to fuck that hot hole. Duncan is writhing in ecstasy as he gets that ass rimmed deep. 'I'm gonna fuck that ass' Devin teases 'you ready for it?' He stands up and gets that dick in place as he slides it inside that spit lubed hole. Duncan groans aloud as Devin starts fucking that ass deep. He slaps that ass as he buries his fat meat deep into Duncan's tight ass. Duncan can't get enough as he bucks that ass back onto Devin's meat, begging him to fuck him harder. Devin is getting that ass doggy style as his smooth balls slap away at Duncan's hole. Devin then gets Duncan on his back as he kneels on the floor for more. He holds those legs up as his cock finds its way back inside that hot hole. Devin picks up the pace slamming his dick deep into Duncan's ass as Duncan gets exactly what he was hoping for. The deeper Devin shoves it in the louder Duncan moans with joy. Devin's pelvis is on overdrive as he slams into that hot ass that's milking his sweet dick. The incline bench is doing its best to hold Duncan as Devin intensifies his anal assault nearing his own climax. His thick cock hits Duncan's sweet spot over and over until he can't hold off any longer. 'I'm gonna cum!' he moans as Devin fucks him harder sending his load all over his smooth abs. Devin is seconds behind him as he pulls out and shoots his own load all over Duncan's cum-drenched navel.",
  "models": [
    {
      "name": "Devin Adams",
      "person_id": 28488
    },
    {
      "name": "Duncan Black",
      "person_id": 28522
    }
  ],
  "release_date": "2012-10-12",
  "scene_id": 56009,
  "series": "Devin Intervention",
  "tags": [],
  "title": "Devin Intervention, Scene #02"
}