{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Aaron White is making his debut with us this week and we're glad to have this sexy 21yo from Santa Rosa, CA. Aaron is a cute jock lookin' morsel who has been doing competitive gymnastics since he was five. He no longer competes but maintains his defined body by working out on the mat and the high bar. Aaron lost his cherry at the age of 17 and he admits it was a good experience. He's currently single and into older guys that take care of themselves. If they can also 'help' and take care of him he's all for it. We bet! He's also drawn to guys that have a good sense of humor and a work ethic as well. When he does have time to spare and up to watch some TV, Aaron loves to laugh watching Family Guy. He's a huge Seth McFarlane fan. In closing we wondered when he gets horny the most and he confesses that after working out there is that possibility. He blushes and admits that he's seen guys going at it in the locker rooms. He's never been one to pass up a free show, but Aaron' not about to go about getting his rocks off in public. Lucky for us, we're about to get a front row seat as Aaron doing just that...in private.Aaron starts checkin' himself out in the reflection of his phone, he decides to start taking pics of himself. First his face, then his abs and after pulling up his shirt he starts playing with his sweet nipples. He takes off the shirt and shorts as he snaps away taking more pics. Aaron is naturally smooth and the years of gymnastic have sculpted his tight body into a delicious work of art. He holds out his boxers as he takes one last pic before losing them altogether. His hard cock is aching to be released as he drops his drawers. His hard cock springs out as Aaron wraps his hand around it and starts to stroke it. It is at full mast as he teases and tugs on it wanting to give it the pleasure it needs. He sits back and plays with his dick as he takes turns stroking it with both hands. As the camera heads south to give us a better view, Aaron shows off his smooth nut sack and hard cock. Aaron then sits back to continue working his rigid boner and give us all a better view. He then sits back on the couch, spreads those legs out and keeps working that dick a bit more. Aaron knows exactly what he's doing as he gets on the incline bench face down and arches his lower back putting that smooth, muscular ass on display. He spreads his cheeks apart as he slaps and shows off that hot ass. Aaron then flips over onto his back and gets back to work on that hard cock of his. He picks up the pace as he gets closer and closer to climax. His cock throbs as Aaron beats off and with a grunt signals the inevitable. His hard cock shoots its cargo sending jet after jet of hot load all over Aaron's smooth abs and chest.",
  "models": [
    {
      "name": "Aaron White",
      "person_id": 28521
    }
  ],
  "release_date": "2012-10-05",
  "scene_id": 56007,
  "tags": [],
  "title": "I'll Show You Mine, Scene #02"
}