{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Fur is all the rage these days and this week we've got plenty. Josh Long is back and au natural not having trimmed his sexy chest. Josh is 24yo and though originally from Tennessee, he's since relocated to Florida's west coast and now calls Tampa home. His costar this week is making his debut with us, Mr. Joey Cooper. Joey is 23yo and is from Portland, ME. We decided to stray into the sexual arena and asked these two when they first started jerking off. Both of them got off to an early start at about the age of 10. DAMN! Idle hands are definitely the Devil's playground. When it comes to what they use to get off when they have to depend on just their imaginations, Joey just thinks about some hot guy pounding his ass. Josh blushes and says that wouldn't exactly work for him. Str8 boys! Pffff! He just likes to think of the first beautiful person that comes to mind and fantasizes about doing dirty things to them. We then brought it home with what they'd been asked to do in the sexual arena that they flat out refused to do. 'Pee on me' scoffs Joey who admits he's just not into that kind of stuff.  Josh isn't as shy when it comes to sex but the one thing he won't do is bottom for a really big top. (...amateurs.) lolJosh is telling Joey about getting picked on by his friends for having so much chest hair. 'They were telling me to take off my shirt', he says pulling off his shirt 'even though I was shirtless.' Joey reaches over and feels his chest and tells him he likes his hairy chest before pulling off his own shirt to show Josh his is completely smooth. Joey then moves in for a closer look as he licks Josh's nipple. One thing leads to another and soon Joey is on his knees with Josh's rock hard cock in his mouth. Josh moans as he slides his dick deep into Joey's mouth. Josh's furry frame looks delicious with his hairy chest and abs sporting a very happy trail leading down to his sexy bush-sporting cock. Josh then gets Joey on his feet so that he can give him some of the same. He slurps on Joey's cock slobbering all over his rock hard cock. After getting his fill he stands up as they start to make out while rubbing their hard cocks together. Josh's cock still needs some attention so he gets Joey on his floor so that he can fuck that mouth some more. His hairy ass is on display as he straddles Joey's face and as his cock slides down Joey's throat his hairy nut sack slaps against Joey's chin.Josh is ready for more as he gets Joey on all four. He kneels behind him and slides his hard cock up that tight ass. 'You got such a nice tight ass' Josh groans as he starts to fuck that hole fast and deep. Joey loves it as he begs for more. Josh watches as his thick cock slides in and out of Joey's hungry hole. They stand up as Josh bends Joey over and keeps tapping that smooth ass doggy style. His low hanging balls slap away as he buries that dick deeper and deeper. Josh slaps that ass as he pounds him harder. The chemistry between these two is on fire. Josh then switches things up and lies back on the floor as Joey straddles that dick. He starts to ride him in a reverse cowgirl as he leans back and bounces that tight hole on Josh's rock hard cock. The only thing in the room not getting a workout is the incline bench they're fucking right next to.  lol Josh then gets Joey on his back and gets right back in that ass missionary to bring it home. He fucks him faster and hits Joey's sweet spot. That does the trick and sends Joey over the edge as his cock explodes all over him. He shoots wave after wave of cum all over his smooth chest and navel. Josh isn't far behind as he pulls out and jacks his own thick load all over Josh's cum-covered cock and abs.",
  "models": [
    {
      "name": "Josh Long",
      "person_id": 28070
    },
    {
      "name": "Joey Cooper",
      "person_id": 28095
    }
  ],
  "release_date": "2012-10-19",
  "scene_id": 56011,
  "tags": [],
  "title": "Super Cooper, Scene #02"
}