{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "CircleJerkBoys has a scorcher on set as we help Rhode Islander Eddie Cambio make his debut. Eddie is a sexy 25yo Italian addition to the eye candy we enjoy down here and we're sure he's enjoying South Florida's harsh winters which make those New England ones look like a walk in the park-NOT!  Eddie is a hot compact morsel that takes very good care of his body and admits 80% of it attributes to diet more so than dedication to the gym. Eddie is handsome, articulate with just a hint of bad boy in him that just makes him that much hotter. On his left arm, Eddie has a tattooed sleeve that represents his family. His first tattoo which is the one that originated things is a nautical star tattoo with a banner across it that reads 'Established 1980'. That was the year his parents married so it was the year his Famiglia came to be. Well, who doesn't love a Mama's boy? This one was a handful, no doubt, losing his cherry at 12 even before he knew how to jerk off. We'll have to keep an eye on this one. His wildest sexual adventure was an argument with a girlfriend while driving that ended up with him banging her on the hood roadside while other cars zoomed by. Exhibitionist much? Well, it's about time he show us a thing...or two.Eddie comes home hoping to get lucky when he gets a call his girlfriend has to work late. He decides he doesn't need her anyway as he pops in a DVD. There's all the pussy he'll need as he sits back and starts to grope his chiseled frame. His cock grows as he watches the screen and slips his hand into his jeans. Eddie is naturally smooth and his body is deliciously defined. He has a large tattoo along the right side of his torso as well as a sleeve on his left forearm. He gets comfortable as he pulls off his jeans and takes out some lube which he uses to massage into his abs and skin. The light dances on his muscles as he turns his attention to the one muscle growing in his jock strap. As he massages his upper body we get a great view at his massive pecs and shoulders as well as the gun show. His biceps are quite impressive and it's about to get a lot hotter in here as Eddie releases his growing cock. He stands and strokes it as we get a glimpse just beneath his low hangers swing in tune to his cock as he jerks off. Eddie then gets on the couch to continue to work that cock while putting that stellar bod on display. He puts his arm behind his head, showing off his sexy pit as he works that cock. Every muscle writhes as he lies on the floor working his cock closer to climax. It isn't long before his body starts to tense up as Eddie's nuts pull up tight around the base of his shaft. Eddie grunts as his cock unloads blast after thick blast of cum allover his cock and abs. How will we ever clean this mess up? ...Any volunteers?",
  "models": [
    {
      "name": "Eddie Cambio",
      "person_id": 28524
    }
  ],
  "release_date": "2012-10-26",
  "scene_id": 56013,
  "tags": [],
  "title": "Me, Myself & I, Scene #02"
}