{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Leave it to Halloween to stir up the caldron and bring about unexpected delights. Well, that's what happened this week discovering none other than Miami hottie, Richie Sabatini at our door. He said 'Trick or Treat' but, like hymens everywhere we were torn with that decision. So, we called on our sexiest ginger devil to make that call for us. Evan Mercy was more than happy to oblige and we're so glad this 21yo Kentucky stud did. Having just survived another All Hallows Eve, next on the list is Thanksgiving. We asked these two what they enjoy most about it. Socializing is what Evan enjoys the most while Richie enjoys stuffing the turkey. In all honesty, we can't be sure he means the actual bird. If they were asked to bring a favorite dish, Richie would bring Sweet Potato Pie and Evan would bring zucchini and squash. We then threw a curve ball at em asking if they had to choose between either, lasting longer in the sack or delivering a bigger orgasm. They both confidently opted out of the endurance challenge and both prefer bigger loads. Who doesn't? We then wrapped it up by asking them to describe the taste of their loads in a word.  Richie chimes in with 'Bitter-Sweet' for his load. Evan then unwittingly steals the show. 'Well, as long as we don't have to use words we can spell' he grins 'I'm gonna say immaculate... flawless.' Awww...Bless his heart! Richie and Evan are playing strip poker when Evan lays down his winning hands and orders Richie to get naked. Richie stands and drops his shorts. To the victor go the spoils as Evan gets on his knees to inspect his prize. He pulls out Richie's growing cock and gets to work sucking on it. Richie moans as he gets that dick deep inside Evan's throat. Evan knows just what to do to make Richie's cock hard as a rock as he spits and slobbers on his hard cock. After working on that dick a while, Evan gets up and starts to make out with Richie as he drops his own shorts. If he won the game he may as well get his own dick wet as he sits on the couch and has Richie return the favor. Richie gets on his knees and gladly engulfs Evan's hard cock as he swallows it to the hilt. He runs his tongue all along Evan's throbbing cock as his mouth literally waters tasting that dick. He can't wait to give it up as he gets on all four and shows off that ass Evan will soon claim. Evan gets on his knees behind him and takes a closer look tongue first as he eats that ass a bit getting it ready for more.Evan takes out a butt plug and slowly slides it inside wanting to open that tight ass a bit before sliding his own dick inside. Richie groans as he gets that ass stretched. 'Enough of that' he orders 'Fuck me already!' Evan is more than happy to oblige as he suits up and slowly slides his dick in that wet hole. He slides his meat all the way inside until his balls meet that hole. Richie is grunting as he struggles to accommodate that dick in his hole. He's not one to give up so he begs Evan to fuck him harder. That does the trick as Evan gets to work railing his cock deep into Richie's ass. Evan slaps that ass as he fucks his friend doggy-style. He can't get enough of that tight ass so he sits back and has Richie ride him in a reverse cowgirl position. Richie's cock is rock hard as he squats on that dick making it bounce like a trampoline. Evan slides his dick up into that ass wanting to get it in as deep as possible. Missionary is next as Richie gets put on his back. Evan gets back in that hot ass and slams it home. He pounds that hole faster and harder hitting Richie's sweet spot repeatedly. Richie can't hold off any longer and blasts his load all over his abs and chest. Evan isn't far behind as he pulls out and unloads his own batch all over an already glazed Sabatini.",
  "models": [
    {
      "name": "Richie Sabatini",
      "person_id": 28328
    },
    {
      "name": "Evan Mercy",
      "person_id": 28494
    }
  ],
  "release_date": "2012-11-02",
  "scene_id": 56015,
  "tags": [],
  "title": "Str8 Flush, Scene #02"
}