{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "This week we have a familiar face with us, Mr. Marxel Rios. Marxel, for those of you unaware of Marxel's reputation, is 27 years old and from Ft. Lauderdale. A definite fan favorite, Marxel is going to help us welcome a new face to the circle Jacobey London. Jacobey is 20 years old and from Virginia. They say Virginia is for lovers, but as far as we know that's hearsay. We're from Florida-we'll need proof!  The holidays are fast approaching and we wondered what these two would wish for in their stocking. Jacobey is going to need a rather large stocking to fit the Range Rover he'd like. We think that's what he said; while Marxel would want tons of $100 bills wrapped up in a nice wad. Well the holidays aren't all about receiving, they're also about being thankful for the things you do. Marxel is very proud and thankful for his Cybersocket nomination as Best Newcomer for the 2013 Awards. Jacobey is thankful for his...uhh, roommate. <cricket> We then put these two to the test to determine how they like to distribute the goodies. Would they prefer more foreplay or more action? Jacobey thinks most people would agree with him, prefering 80% be foreplay and the remaining 20 be getting it. Marxel with a twinkle in them there eyes disagrees and likes his fun 50/50. 'Share and share alike', imagine that!Marxel's horny today and by the time we start filming he's already groping Jacobey's crotch. That dick is hard anticipating that mouth as Marxel undoes his fly. Marxel knows just what he wants as he wraps his mouth around Jacobey's hard cock. He looks up at him with those pretty eyes as he services his meat, easily taking every inch of it down his throat. He spits on it getting it nice and sloppy before going back down on it. 'Suck that dick' Jacobey orders as he grabs Marxel's head and helps bob him on his dick.  Jacobey then stands up and drops his pants as he gets right to fucking that mouth. Marxel gags on that dick as he gets his face fucked deep. He loves that cock and soon is on the floor so that Jacobey can kneel over his mouth and feed him some more. Marxel's own dick is hard and needing attention and once he takes it out Jacobey goes down on him landing in a hot 69. Marxel sucks that dick while his fingers explore Jacobey's smooth hole. That gets Jacobey horny for more as he repositions to get Marxel's hole wet and ready for more. Marxel moans as he gets that ass rimmed and ready. Once that ass is ready, Jacobey slides inside and gets right to burying that dick. Marxel just moans as he gets that ass fucked. Jacobey's low hangers slap away at that hole as he slams inside over and over as he holds one of Marxel's legs over his shoulder. He knows just how to fuck that ass pounding it hard and deep making Marxel moan for more. Jacobey then gets up and sits back on the incline bench and just watches as Marxel straddles his dick and takes a seat. Once he's back on that dick he gets right to riding that cock. He bounces up and down on it until he can no longer ride it. He then just holds still as Jacobey takes over slamming that dick up into his hole like a well-oiled piston. Marxel is rock hard as he gets that ass railed hard. That tight ass sends Jacobey over the edge as he stands over Marxel and unloads all over his face leaving his hot load dripping all over Marxel's face. Jacobey just admires his handy work as playfully slaps his dick on Marxel's face as he splatters his thick load everywhere.",
  "models": [
    {
      "name": "Jacobey London",
      "person_id": 28525
    },
    {
      "name": "Marxel Rios",
      "person_id": 28050
    }
  ],
  "release_date": "2012-11-09",
  "scene_id": 56017,
  "series": "Gimme That Dick",
  "tags": [],
  "title": "Gimme That Dick"
}