{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Damian Taylor makes his debut this week. Damian is 26 years old and a native Chicagoan. Having since relocated, we're sure he's missing those brisk winters back home. Then again, this is Miami, where as soon as the temperature dips to 70 degree- the faux fur comes out. Brrrr! Well, fortunately it's mostly summer weather year round down here so we get to see Damian walking around in next to nothing showing off that ripped body of his. Damian's dedication to the gym is really paying off and working out 6 days a week has given him one hell of a body. Diet makes up a lot of that. 'It mainly consists of chicken, fish and vegetables' he smiles 'I eat like a rabbit sometimes.' When he does stray from his strict diet he ends up in the Ben & Jerry's aisle looking for some American Dream ice cream. Caramel and waffle cones are his weakness. Take note, Gentlemen. The first time Damian had sex with a man was during his first year of a 6 year stint in the Army. 'It was kinda crazy, we were partying and started wrestling around. He was on top of me...then I got a hard on!' We're not gonna ask though we're sure he's be willing to tell. But we'd rather get a little less reminiscing...and a LOT more 'get the fuck naked'! <evil grin> Damian comes home after a long day and strips down to take a shower. Damian's compact frame is smooth and well defined. He turns on the shower and peels his briefs off finally showing us that hot bubble butt. He steps in and starts to lather up as the soap dances across his pecs, shoulders and runs down over his cock and ass. His cock comes to life as he soaps it up, stroking it a bit. The soapy water runs over his sun-kissed skin, washing away the day's cares. Once he's done, he towels off and gives his skin some conditioning as he rubs cream all over his body. He sits on the couch rubbing the last of the cream all over his cock as he gets his thick dick rock hard. He strokes his cock as it stands at attention. His furry legs spread apart as he shows off that Midwestern mouthful. As Damian sits back we get a great view of his body as he focuses his attention on his rock hard cock. Damian then stands up to show off that dick by swinging it around a bit then bending over to give us a stellar view of that hot little ass of his. It's muscular and oh so inviting. He puts one leg on the incline bench and leans forward putting that ass on display. All the stimulation on that meat is making his smooth balls pull up tight around the thick base of his cock. Those balls are getting ready to blow as he straddles the bench and strokes that cock harder. His fist becomes a blur and within seconds his cock spews jet after jet of thick load all over the bench coating it with cum. Normally we'd insist you clean up after yourself when you're done on the bench... but we could always make an exception. #dirtydirtyboy.",
  "models": [
    {
      "name": "Damian Taylor",
      "person_id": 28526
    }
  ],
  "release_date": "2012-11-16",
  "scene_id": 56019,
  "series": "So Fresh and So Clean Clean",
  "tags": [],
  "title": "So Fresh and So Clean Clean"
}