{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Good Morning, Baltimore! This week we get to thank Maryland's gem for more than the national anthem as we welcome sexy Alex Adams. Alex is 25 years young and is a proud native of Baltimore. He has a great build and he attributes that to a lot of dedication. He was heavier when he was younger but started slimming down about 5 years ago before joining the military. Alex was in the Marines for 4 years and admits that it was hard taking care of your dick without getting caught bunking in such close quarters. It was hard not to walk in on someone trying to get off. First time he fooled around with a guy he was about 18. He met a guy online that was older and he fooled around with him several times. That experience opened his eyes to the fact that his cock was equally interested on both sides of the fence. He considers himself to be bisexual and likes being honest about that without any qualm. Wrapping up we asked horny Alex what or whom his ultimate 3 way would consist of. Alex would want another guy about his build and he'd want a petite girl...probably a blonde. Oh those lousy blondes-they have ALL the fun! Well, it's time we get this hunk undressed and have a little fun of our own. Batter up? ...Let's find out!Alex gets the green light and immediately gets comfortable. He drops his shorts and peels off his tee shirt as he stands groping his growing cock through his boxers.  His body is naturally smooth and has a well defined frame. Alex' is hairless from the neck down trimming everything off. He lubes up his growing cock and gets to work on that dick. He's at attention in seconds as his fist becomes a blur. His smooth nut sack rests heavily on the couch's arm rest as he straddles it to beat his meat. The porn he's watching has Alex' cock throbbing for attention and Alex has no intentions of denying his desires. He strokes that dick slapping it up against his abs to tease it as it throbs at his touch. Alex then decides to show us the backfield as he kneels on the couch and puts that hot ass of his up in the air. He reaches around and spreads that ass open to show us his tight hole. His low hangers dangle below bouncing to and fro as Alex continues stroking his raging hard on with his other hand. He moans softly as his finger slips inside. He is dripping as he fingers that hole a bit to show off that hot ass he knows you want.  But wait, there's more. As Alex gets closer to climax he decides he wants to switch it up a bit and lays on the floor and uses the couch as support as he flips his legs over his head. Now h has his hard cock inches from his face as he jacks off faster. 'I'm about to cum!' he groans as he unloads his load all over his face and tongue. He pulls his cock down a bit more and easily laps up the rest of his load using his tongue to clean off his own cum-covered knob. Hmmm. Alex has definite reason to be proud and we can't deny he is among a select few. Not just for being a Marine; but also for being limber enough to suck his own thick cock. ...Lucky!",
  "models": [
    {
      "name": "Alex Adams",
      "person_id": 28090
    }
  ],
  "release_date": "2012-12-13",
  "scene_id": 56027,
  "tags": [],
  "title": "Special Sauce, Scene #02"
}