{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Well, last week after having Chicago's own Damian Taylor give us a private strip, shower and stroke-off session, we couldn't help but have him back for more. Our members may have loved watching this chiseled morsel get all cleaned up; but this week we intend to watch him get all hot and sweaty. For those of you who missed his debut last week, Damian is 26 and a recent transplant to South Beach from the Midwest. Damian is in good hands this afternoon as we welcome back Dylan Roberts. Dylan is a familiar face to us here and this 23yo hottie is from Northern Cali. When it comes to hot men we asked these two to tell us their thoughts on where to find the most. 'For me, I recently moved here, Miami' says Dylan 'you have a big pool of different ethnicities and all exotic beauties both male and female. It's like a cesspool of Beautiful.' Can't say we've ever heard that before; but, we'll take it. Damian confirms Miami but also has to throw Chicago in the mix. There are definitely a lot of hotties in the Midwest. Both being melting pot cities, it affords them a large variety of features and 'things' to lust after. Well, today we have two hotties right here to lust after so...who wants to go first? Damian is showing Dylan pics of Chicago and his Ex back home. Dylan thinks the Ex is 'alright'. Damian balks that Dylan doesn't think his Ex was all that hot. 'Well you're way hotter than that' Dylan says as he goes in for a kiss. Worked like a charm as they start to make out. Damian peels of Dylan's tank and jeans as he slides south to take care of that cock. Dylan lays back and moans as Damian goes to work on his hard cock. Dylan's au natural this time and his chest fur looks sexy. Damian can't get enough of that meat and no matter what position Dylan gets into, Damian remains latched on to his cock. Damian then stands to make out with Dylan some more as Dylan takes down his pants to get at that tight little ass. His cinnamon complexion contrasts Dylan's nicely, as Dylan gets down between those legs to suck some dick. He runs his hands up Damian's smooth, tight abs as he worships that hard cock. Dylan looks up at Damian making sure he's doing a good job as he continues to slobber on that thick meat. Damian loves the attention he's getting on that dick and leans back to give him more to eat. Dylan instinctively slides his tongue up inside that hot little ass making a meal out of it. Dylan laps and sucks on that hole getting it nice and wet as Damian squirms. 'I'm gonna fuck this ass' Dylan announces as he gets up and puts that dick at Heaven's door. (...back door, that is!) He slides his thick dick deep into Damian's hole as Damian spreads his legs apart to give Dylan more access. Dylan pounds that hot ass hard and deep as Damian moans his appreciation. Dylan leans down and kisses Damian as he takes that ass on the incline bench ramming every inch of dick he can up inside him. Then they take the party to the couch as they lay on their sides with Dylan spooning Damian as he keeps drilling that dick inside that ass. Damian can't help but stroke his meat as Dylan's balls slap away at that ass. Damian then straddles Dylan so he can have more control as he rides that cock at his own pace. He bounces that hot hole up and down on Dylan's cock with ease before maneuvering into missionary. Dylan takes it home as he pins Damian's thighs down and fucks him silly. Dylan's cock hits that spot just right making Damian's thick cock start to spew cum even before he's ready to. Damian starts to jerk off faster wanting to cum and as he does he blows his load while Dylan is still fucking him silly. Dylan pulls out just in time and shoots his load all over Damian's chest, abs and cum-covered cock. Oooooh, what a little lust can do!  lol",
  "models": [
    {
      "name": "Dylan Roberts",
      "person_id": 28414
    },
    {
      "name": "Damian Taylor",
      "person_id": 28526
    }
  ],
  "release_date": "2012-11-21",
  "scene_id": 56021,
  "tags": [],
  "title": "You're Way Hotter, Scene #02"
}