{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have a new face for our members this week as we welcome Mr. Eric Ryan. Eric has been down here in Miami for about a month. He says that the girls here have a lot more plastic surgery; but are definitely hotter than the girls he left back home in Fayetteville, NC. In case that twang in this voice hadn't given him away. When it comes to women he loves blond girls and is both an ass and a tit man-they need to have both. Well that makes sense. As to where the hottest girls from, Eric believes they come from Europe. This is Eric's first time in front of the camera and he admits it's not as bad as he thought. If Eric could architect the perfect fantasy three way he would choose Jessica Alba and Rihanna. He'd be all over Jessica first and save Rihanna for dessert. Well it sounds like this one knows what he likes and he's not alone in that department. We'd like to see a lot less clothing and a lot more cock on this hottie. And since Eric's been slowly undressing throughout the interview we're already well on our way to getting what we want. So lets wash him off and have ourselves some fun...Shall we? Eric soaps up as he takes a cooling shower. It's been hot on the beach and he's ready to kick back and get some relief from more than just the sun. The soap suds caress his body as they run down his mostly smooth chest all over his cock and balls as they head for the tile below. He starts to fondle his chest and arms as he soaps up and washes his locks giving them a final rinse. He towels dry and goes back to his room where he finds some porn to watch. He sits back and lubes up as he gives that dick some much needed attention. His cock gets hard as he watches his str8 porn. 'Man, she's sexy' he mumbles as he watches in awe of the blond on-screen. His cock is rock hard as he jacks off, slowly teasing his knob before sliding up and down the length of his shaft. He uses his free hand to massage his big balls making sure not to leave them out. Eric then lies back on the couch as he continues to pulls on his nut sack and jacks that sweet dick. He plays with the precum pooling at his knob and the sensation just makes his dick throb harder. His dick is getting the stimulation it needs and he knows it won't be long before he has to nut. He gets on his feet to give us a better view of that str8 dick and make it easier for him to beat off. He picks up the pace as he feels his big balls start to pull tight around the base of his hard cock. His dick is throbbing and with an 'Oh Shit!' Eric's cock explodes. He sends blast after rich blast of thick cum spraying down towards the camera like a fire hose. He coats the glass that separates them with about 10 overflowing geysers of concentrated southern seed. The Cavalry doth cometh...and cometh...and cometh.",
  "models": [
    {
      "name": "Eric Ryan",
      "person_id": 28527
    }
  ],
  "release_date": "2012-11-30",
  "scene_id": 56022,
  "series": "Get a Load Off",
  "tags": [],
  "title": "Get a Load Off, Scene #01"
}