{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Back in the house is our recent discovery from Miami, Mr. Brett Staley. Brett made his debut with us last week for those of you who missed this 25yo str8 Boys sizzling solo. He's in for a treat as we welcome Brazilian cutie, Daniel Leon to CircleJerkBoys. We wondered how these two horny boys achieved their last orgasm. Brett got his rocks off from head while Daniel's last nut was complements of 'Peter Palm.' When it comes to what these two fantasize about when they jerk off, Brett loves to think about a big ass. He's not a big fan of big tits but they should be proportional. For Daniel he loves to think about a really big dick. His first blowjob was at the age of 17 and once he got a taste of cock he knew that's what he wanted. Brett is smiling as we ask him whether he's heard the rumors that guys give better head than girls. Daniel is looking forward to dispelling that myth for out str8 boy this afternoon and by the end of today's shoot, Brett and his str8 boy boner will know what head was meant to feel like. Yes, gentlemen, we're about to ruin another one.  Well, lets not keep the hot boys waiting...Brett is filling out his paperwork as Daniel hands him his paperwork and asks him if he's nervous. Brett's a little nervous, so Daniel tells him he's going to help him out as he starts to massage his inner thigh and crotch. Brett sits back and lets Daniel have his way. Daniel compliments Brett on his abs putting the str8 boy at ease as his clothes start to come off. He runs his growing cock through his boxers. 'You're going to be fine' Daniel assures him as he stands Brett up and pulls down his boxers. He compliments him on his cock and nice balls as he starts to stroke his dick. Brett's flattered and at ease by the time Daniel goes down on him. Brett's cock is growing by the second as Daniel starts to worship his str8 cock. He slowly savors his hard cock as he tugs on those smooth balls showing him what he can do on that boner. Brett can't help but start fucking Daniel's face wanting to bury his cock deep. Brett then sits back on the couch as Daniel, still complimenting him on his cock, goes right back to servicing his throbbing cock. Brett bobs Daniel's head on his cock as he moans with pleasure. Daniel then strips his own jeans off and gets naked so he can play with his own thick cock. He jerks off as he nurses on Brett. Daniel ends up lying back on the couch as Brett sits on the arm rest and feeds him more dick. Daniel busts his nut as Brett fucks his mouth. Brett then jacks his own load all over Daniel's face and smooth chest. Brett's still gasping as he slowly rubs his knob on Daniel's lips. Daniel licks that cum-covered cock and tells him just how sweet it was. Always a class act, Daniel gets the mission accomplished and starts off Brett's New Year the right way. Happy New Year, Boys!",
  "models": [
    {
      "name": "Brett Staley",
      "person_id": 28530
    },
    {
      "name": "Daniel Leon",
      "person_id": 28531
    }
  ],
  "release_date": "2013-01-04",
  "scene_id": 56029,
  "tags": [],
  "title": "Cold Feet, Hard Cock, Scene #02"
}