{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have a hot scene this afternoon, fur real, as we welcome back Josh Long.  Josh is 20; furry and, if that wasn't hot enough, he has left Tennessee and moved down to Tampa. Florida just gets hotter and hotter. His costar today is another fan favorite, Mr. Devin Adams. Devin is 24 originally from Maryland and also a recent addition to the Sunshine State. These studs are hot, so we asked them what makes them feel sexy. For Josh, a good haircut makes him feel sexy. He doesn't know why but he loves looking nice. For Devin, he loves running on the beach and having guys check him out. Well we can see how watching this 6'3 hottie running anywhere half naked would be a show stopper. When it comes to watching porn we wondered what kind of porn they like to watch since they are in the industry. For Devin he loves watching amateur porn since he likes seeing a newbie all nervous on set. For Josh he loves to watch porn just to watch porn. 'I watch porn like other people watch TV,' he laughs, 'it's fun when I catch them looking right at the camera and I know they have to be new at this.' Was it not Shakespeare who penned, 'All the world's a stage, and all the men are merely porn actors'...or were they critics? lol Well-he was probably thinking it. lolDevin is horny for dick so he lines up a booty call via text with his hot friend Josh. It doesn't take long before he hears a knock on the door. Lunch is served. He lets Josh in and pins him against the wall as he goes in for a kiss. 'You are hairy, huh?' he teases looking at Josh's furry chest in that tank he's wearing. He drops to his knees, hauls out his cock and goes to work. He swallows that dick to the hilt as Josh just watches his cock disappear. 'I bet that ass is hairy, too' Devin smiles as he turns Josh around to check out that ass. He isn't disappointed as he spreads Josh's furry cheeks apart and slips his tongue as deep as he can into that follicle forest. Josh just moans as he gets that ass eaten out. Devin then gets on his feet and drops his briefs finally freeing his own throbbing cock. He sits back and directs Josh's head to his cock as he helps bob Josh's hot mouth up and down on it. Josh swallows Devin's cock with ease getting Devin super hard and horny for more; which is just what Josh wants.Devin is soon in position on the couch as Josh's cock slowly makes its way inside his tight ass. 'Aww yeah, Fuck that ass' Devin moans as Josh picks up the pace. Josh is fucking that ass nice and steady as Devin jacks his fat cock. Josh gets that cock of his nice and deep fucking him doggy style. Devin then takes control as they take the party to the floor. Devin straddles Josh and impales himself on that hard dick. He gets right to work riding that cock as he bounces on it.  Josh jacks Devin's cock as he watches his own getting swallowed up by that hot ass. Devin can't get enough as he leans back and mounts that cock like a seasoned jockey. But wait, there's more. Missionary is next as Josh gets Devin on his back and slides his rock hard cock back inside for more. He holds one leg up as he pounds away at that ass. Devin's cock is rock hard as he gets that prostate prodded. That's gonna do the trick and Devin can't help but explode all over himself as Josh literally fucks a huge load out of him. Josh isn't far behind as he pulls out and busts his nut all over Devin's cum-covered cock.",
  "models": [
    {
      "name": "Devin Adams",
      "person_id": 28488
    },
    {
      "name": "Josh Long",
      "person_id": 28070
    }
  ],
  "release_date": "2012-12-06",
  "scene_id": 56024,
  "series": "Beary Furry",
  "tags": [],
  "title": "Beary Furry, Scene #01"
}