{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Dylan Drive is finally on CircleJerkBoys and we're glad to have him welcome Peter Carney. Dylan Drive, for those of you who haven't had the pleasure, is 19 and he is originally from Chicago. Peter is 21 and he hails from Colorado. We're sure he's enjoying a respite from Denver's 'mild' winters. When it comes to taking care of one's own needs we wondered when they each started jerking off. Peter didn't start til he was 16 which is like whaaaat!? Lol Dylan started at about 12 which is about the time most boys discover their built in pocket rocket. When it comes to jacking off we asked who their go-to fantasy is when they wanna bust a nut for sure. Dylan admits his is Christian Wilde. Well, we're very familiar with Christian and why that hung, blue-eyed hottie could make anyone's fantasies THAT much hotter. Peter has someone special in mind that he uses to bust a nut. He's not willing to say whom just yet; but hopes he may soon be watching today's fun. To wrap it up we asked them to describe their fantasy sex scene they wanna check off this year. 'Sex on a Jungle Gym' for Dylan who must be pretty limber; while Peter wants handcuffs and whip cream involved. Dylan and Peter are playing a good old fashioned game of Rock, Paper, Sci-SUCK IT! When Dylan triumphs and hauls out his cock to claim his reward. Peter doesn't waste anytime as he wraps his lips around Dylan's thick uncut cock. Dylan groans as he gets that cock worshiped. He strips off his clothes as Peter continues to service his meat. Peter eventually gets up so that he can get some help on his own boner that's been straining to get out of his jeans. Dylan pulls down his pants and briefs and starts to return the favor. He slowly sucks on Peter's cock as is grows 'til it's completely hard inside that warm mouth. 'You like that?' he coos as he starts to fuck Dylan's face. They take the party south, as they maneuver into a hot 69, getting all the cock they want. Peter then sits back on the chair and watches as Dylan sits on his cock. Dylan starts to ride that dick as his own boner bounces in the air like a trampoline. Peter grinds that ass around on his cock wanting to get it in as deep as he can. Peter then bends Dylan over and slides that cock in doggy style as Dylan begs him for more. His balls slap away at that hole as Dylan orders him not to stop. Missionary is next as Peter gets Dylan on the futon. He spreads those smooth thighs apart and fucks that sweet ass some more. His ass rises and falls as he buries that dick over and over into Dylan. Dylan moans as he sends his own load shooting all over his cock and happy trail. Peter isn't far behind as he pulls out and shoots his thick load all over Dylan's smooth chest and abs.",
  "models": [
    {
      "name": "Dylan Drive",
      "person_id": 28538
    },
    {
      "name": "Peter Carney",
      "person_id": 28539
    }
  ],
  "release_date": "2013-02-15",
  "scene_id": 56034,
  "series": "Rock, Paper.... Start Sucking",
  "tags": [],
  "title": "Rock, Paper.... Start Sucking"
}