{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Christian Ray is in the house this week and we're always happy to see this hot, hung Cubanito. Christian is 21 years old and he's here to heat up our set with Windy City native Chase Lyon. Chase is 22 and enjoying a warm break from the frigid Chicago temperatures. We asked these two scholars if they had the opportunity to ask President Obama anything they wanted what that would be. Christian would wanna know if Barrack had ever hit it with another guy; while Chase would want to know what the President plans to do with taxes and about job creation in his second term. Both of these studs are packing some impressive bulges and we asked them if they could add 1' to their cocks would they add that inch length-wise or to its girth. They both agreed they'd want to split that inch half and half. These studs are relatively new to the scene and we wondered if all the fucking they've been doing on cam has influenced their sex lives at home. 'It makes it feel weird' says Chase, 'towards the other half'. Christian hasn't noticed any difference at all. He's comfortable with all the sex he can get. Well this Cubanito Caliente better hold on tight cuz he's about to get a Midwestern meat injection, Chicago style.They sit back admiring each others jeans as Christian comments on the hole in Chase's. He slips his hand inside the large hole in his pant leg as his hand discovers Chase's growing cock. They start to make out as they slowly strip off their clothes. Chase stands as Christian starts to play with his meat through his boxers. He lowers them to discover Chase's fat cock. He opens wide as he starts to suck on that thick 8' cock. They stand as they stroke their cocks together as they make out. Christian then lets Chase return the favor as Chase works that uncut Cuban cock. Christian helps bob his head up and down as Chase spit shines his cock. 'You like my cock?' coos Christian as he watches his dick disappear. 'You wanna fuck me?' teases Christian, which is all the invitation Chase needs. He gets Christian on all four as he spreads that bubble butt. He slowly teases that hot hole with his fingers before sliding his thick cock inside. He's soon fucking that sweet ass as Christian struggles to accommodate his thick cock. Chase fucks Christian doggy style as his smooth balls slap away at that ass. Chase then gets Christian on his back as he slides back inside missionary. Christian starts to stroke his throbbing cock as Chase gets back to fucking his tight ass. Chase pumps in and out of that ass as Christian's legs sway in the air. From there they switch it up as Christian sits on Chase's cock. He starts to bounce on that cock as Chase sits back and lets him do all the work. Christian can't get enough dick as he grinds his tight ass all the way down on his meat. As they near climax they lie side by side and unload their massive loads all over themselves.",
  "models": [
    {
      "name": "Christian Ray",
      "person_id": 28431
    },
    {
      "name": "Chase Lyon",
      "person_id": 28537
    }
  ],
  "release_date": "2013-02-08",
  "scene_id": 56032,
  "series": "The Lyon King",
  "tags": [],
  "title": "The Lyon King, Scene #01"
}