{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We can thank Florida's west coast for one hung hottie by the name of Chad Davis. Chad is 21 and lives in Sarasota FL and is here to help us welcome a hot Hispanic hottie from an island 90 miles off Florida's east coast, Christian Ray. Christian is 20 and mixing in just fine with the Cuban community here in South Florida. We asked them if they could take a cruise anywhere in the world, where would they want that to be. Christian would take a Mediterranean cruise to get to see Italy and Italian men. Chad would rather stick closer to home and just cruise around the Caribbean. As for pets, Chad has 3 birds that he felt he should adopt as a family. Awww. Christian's response took the cake hands down. 'I don't have pets?just my sister' ...Moving right along, we wondered what specific trigger made each of them go from 0 to 60 in 5 seconds. Christian loves kissing and sucking. Chad loves it when a guy is hands on 'down there' and not afraid to explore while they're kissing or sucking. Chad has had issues in the past with a few that were hesitant to take the party favor he's packing but if you know what you're doing and do it right it's never a problem. We couldn't agree more, since we agree bigger is always better.These two start before we get the camera going as they make out and peel each other's clothes off. They stand to rub their cocks together as they continue kissing. Both have tents in their briefs as Christian slides south to get a better look at the tent in Chad's boxer briefs. He pulls out that thick cock and opens wide. He starts to suck on that thick cock as Chad moans. Soon Chad joins him on his knees as they continue to kiss. Chad then lies down as they maneuver into a hot 69. Christian takes top bunk as he bobs his head up and down on that hard cock. Meanwhile Chad has a mouth full of 'Carne Cubana' as he nurses on that thick uncut cock. Chad bucks his cock up into Christian's throat trying to get it in as deep as he can. As he does, Chad's fingers find a tight ass he will soon be tapping. Christian moans with a mouthful of meat as he gets that tight ass explored. Christian then kneels to get more of Chad's cock as he goes back to savoring every delicious inch he's given. 'Chupe me pinga' Chad moans in his best Spanish. Incorrect?yet incredibly effective as Christian shoves his hard cock even further down his throat. Chad then sits back as Christian straddles his hard cock rubbing his hot ass up and down against that boner. 'Somebody wants something' Chad grins. ...ya think?Chad then suits up and gives Christian just what he's wanted. Christian slowly impales himself on Chad's thick cock. That Cuban ass slowly gives way and once it does, Christian starts riding his cock. Chad's brows furl as he gets a wave of erotic sensation washing over his body. Christian's tight ass has his hard cock in its grip and Chad's not complaining. Chad then switches it up and gets Christian on all four on the floor as he gets back to fucking that hot ass doggy style. Christian grunts in pain as Chad can now bury his thick cock even deeper. Christian is taking it like a champ as Chad continues to pound that hot ass. Chad then gets Christian on his back so he can sink that dick deeper. Christian is rock hard as he gets that hot hole fucked. He starts to jack his uncut cock faster as Chad picks up the pace. Chad's defined abs tense and flex as he shoves his cock into Christian's hungry ass. Chad's cock is hitting that prostate just right and it won't be long before it sends our Caribbean Cabana Boy over the edge. Christian groans as his cock explodes sending jet after jet of leche all over his smooth chest. Chad isn't far behind as he too unloads a massive load sending his own milk flying, splattering all over Christian's cum soaked chest and face.",
  "models": [
    {
      "name": "Chad Davis",
      "person_id": 28421
    },
    {
      "name": "Christian Ray",
      "person_id": 28431
    }
  ],
  "release_date": "2011-02-11",
  "scene_id": 56039,
  "series": "A Chad, Chad World",
  "tags": [],
  "title": "A Chad, Chad World, Scene #02"
}