{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We've got two new faces for you this week on CircleJerkBoys. The first is Kemer Diaz who is 20 years old and a homegrown Hottie from Miami. Hailing from the volunteer state of Tennessee is 24 year old Jesse Bryce. Jesse volunteered to help welcome Kemer since it's his first trip to the man's table. We hope Jesse brought his appetite; cuz Kemer's packin'. It didn't take long for Kemer to realize he had a larger than average dick. 'Basically, ever since I was 12 and had some fun with a girl' he beams, 'it's been going on since then'. Rest assured, everyone in his family always told him he had a big dick since he was little; so...they kinda ruined his surprise, huh? Fortunately, Jesse isn't slacking in the dick department, packing a big thick cock too. We've got cock a plenty today. Jesse admits he thinks bigger is always better. We couldn't agree with him more. We asked Kemer what the best sex he'd ever had was. 'Whenever they take the whole thing' he grins. Poor Kemer has only had a few girls managed to take every inch of his thick, Cuban cock. Silly Rabbit, Dicks aren't for Chicks-they're amateurs!  Well, Kemer's in good hands with Jesse; whom soon enough will be saying, 'Look guys-NO HANDS!'  Jesse has gay porn on trying his best to seduce Kemer. 'You can't tell me that isn't hot' Jesse grins. Kemer isn't amused by the all-dick scene. 'I'm used to jackin off to girls' he says. Jesse decides to offer a more hands on approach and moves closer. He starts to grope Kemer's cock which slowly starts to come to life. Kemer's eyebrows raise as a confused, but consenting, look washes over his boyish face. Jesse has him stand up so he can get better access. After tugging at it for a few through his boxers, Kemer's cock is now throbbing and at attention. Jesse opens wide and swallows Kemer's str8 cock to the hilt. Kemer gasps as he watches his dick disappear. Kemer immediately starts to face fuck his new buddy. Kemer's smooth balls are pulled up tight as Jesse continues to slurp on his thick 8.5' cock. Jesse then stands and strips, hauling out his cock for Kemer to play with. Kemer reluctantly starts to stroke Jesse's cock as it gets rock hard in his hand. That's as good as it gets for Jesse so he goes back down on that thick cock again. Kemer's in awe as he gets his thick cock deep throated. 'Are you ready for this ass?' beams Jesse as he gets that thick cock slapped on his face. 'Lets see if it fits' teases Kemer before bending him over and sliding that dick into his hot ass. Guess taking it all won't be a problem this afternoon as Jesse's hot hole is taking every delicious inch. Kemer then sits back on the floor as Jesse squats on that thick cock and starts to ride it. Kemer starts to fuck that ass like a champ; repeatedly bucking up into that hot hole. The sound of Kemer's balls slapping against that hole fill the room. Missionary is next as Kemer slams back in for more. That thick dick is hitting Jesse's prostate perfectly as Jesse explodes shooting his load all over himself. Kemer isn't far behind pulling out and jacking off all over Jesse's cum covered abs.",
  "models": [
    {
      "name": "Kemer Diaz",
      "person_id": 28533
    },
    {
      "name": "Jesse Bryce",
      "person_id": 28534
    }
  ],
  "release_date": "2013-01-18",
  "scene_id": 56030,
  "series": "Cumming Around",
  "tags": [],
  "title": "Cumming Around, Scene #01"
}