{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We have Leo Castro in the house this week. Leo made quite the splash a while back as this 28yo, 6'4 'Brasileiro' made his debut and we were only too eager to help. Tall with dark features and a chiseled frame this stud could give the infamous girl from Ipanema a run for her money. Originally from Sao Paolo, Brazil, he currently lives in the UK. Leo first discovered he was hetero-flexible while attending his brother's wedding. He not only met the woman he would marry; but also got the chance to explore a rather interesting tryst into Man's land. ( Ummm...No, his wife was not involved.) Paul Orson is 22 and moved to London to attend university. He's open to try 'anything' as long as it's not 'dirty' (Brit for 'safe'). He lost his cherry with a bloke he went to school with at 16; and he's never been with anyone who isn't English. So this will be a first for the British boy who packs an impressive 'wanker' easily measuring up to Leo's 8 1/2' boner. This afternoon the steamy tropics of Brazil will collide with the not-so-proper side of Britain. These two are in for more than a mouthful as they 'sample' their wares (...and by 'wares' we mean meat) ...duh. Paul takes charge as he begins to kiss Leo passionately. His hands begin to explore Leo's crotch as their shirts come off. We get a glimpse at Leo's impressive washboard as Paul licks his way past them, unbuckling his jeans and going right to work. Leo's thick uncut cock is growing by the second as Paul expertly works it down his throat Leo's appreciative but he wants some too. He undoes Paul's pants, and begins to work his growing bone through his briefs. Once he's ready he hauls out Paul's thick cock. GOSTOSO! This 20 yr old boy has a giant attractive cock. Leo's mouth stretches wide as he does his best to accommodate every thick inch of Paul's meat. Paul's in awe of this sexy Brazilian's oral skills. But wait there's more as they maneuver into a hot 69 to keep it going. Leo is all over Paul's meat when he decides he needs to sample more than just his cock. Paul is too busy moaning to say no. He puts Paul on his belly before going back down on him. He greedily laps at his smooth ass and sends Paul into a frenzy. Paul's smooth ass soon wants a lot more than a proper rimming. Leo pulls him up into a doggie position and backs him onto his thick cock. Paul is taking Leo's cock like a trooper, grimacing as he gets that ass pounded hard. 'Ohh, fuck me' he groans as he revels in the ecstasy he's being given. Leo at 6'4 leans forward and easily kisses Paul's neck and sexy lips. He continues to fuck away at his ass as he gets more and more aggressive. His balls are soon slapping away at Paul's ass; and all Paul can do is brace himself. Paul isn't one to slack off as he aggressively fucks back, bucking his much smaller frame back up onto Leo's 'pica dura'. The chemistry couldn't have been any hotter for this international fuck fest. Leo then gets Paul to kneel on the couch before entering him again from behind. This position hits Paul in all the right places and within minutes he's close. They sit back and each pump out their diplomatic pleasantries one thick blast after another. Whew. ...tea will now be served in the study.",
  "models": [
    {
      "name": "Leo Castro",
      "person_id": 28546
    },
    {
      "name": "Paul Orson",
      "person_id": 28547
    }
  ],
  "release_date": "2013-04-05",
  "scene_id": 56036,
  "series": "Bangers & Mash",
  "tags": [],
  "title": "Bangers & Mash"
}