{
  "collections": [
    "Cody Cummings"
  ],
  "description": "Officer Cody Cummings sees a lot on his beat. Making sure the streets are safe for Joe Public is often no picnic.  That's why a hard working man of the law needs to blow off steam once in a while. That's why Officer Cummings has decided to stop in at a known porn house to do some poking around. </br></br>Upon entering, Cody finds a few folks talking in the kitchen. He finds out one of them, Max McQueen is in charge of the property for the week. Officer Cummings likes the shape of Max's mouth, so he orders him to take him to a private room to discuss how things will proceed. After taking some time to understand exactly what kind of activity Max engages in at the house, i.e. sucking cock, getting fucked, etc., Cody gives him two options. Max can either receive a citation and possibly end up downtown in cuffs, or he can lay down and accept Officer Cummings's big, hard dick in his mouth. Max has no problem going with the second option. In fact, as he tells the nice police man, he's probably going to like it...a lot. Officer Cummings runs a tight ship when he's on duty and nobody gets off easy. He's doling out stiff consequences to Max, and making sure he gets his point across. Watch him go from slowly dipping his thick cock into this sweet boy's mouth, to face fucking the kid like a no-nonsense enforcer. Cody's not letting this dick fiend off the hook until the officer gets off himself. </br></br>Enjoy!",
  "models": [
    {
      "name": "Cody Cummings",
      "person_id": 6195
    },
    {
      "name": "Max McQueen",
      "person_id": 27643
    }
  ],
  "release_date": "2013-06-19",
  "scene_id": 56057,
  "series": "CC - 6315 - Cody Cummings & Max McQueen",
  "tags": [
    "Amateur",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Climax",
    "Cum swallow",
    "Dark Hair",
    "Facial",
    "Facial Hair",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Twink",
    "Uniform"
  ],
  "title": "Strict Enforcement"
}