{
  "collections": [
    "Raging Stallion"
  ],
  "description": "A bearded, ripped D.O. in leather wrist and arm bands and Remy Delaine clad in a leather vest are in the back room of the leather club, making out and getting heated up. Unknowingly they have an audience, namely hairy Brock Keller who watches as Remy goes down on what might be the hottest dick in the world. He swallows it well and D.O. acknowledges his capabilities by grabbing onto his head and ramming it down Remy's throat. Behind his aviator glasses, Brock's eyes are fixed on the action which stirs his loins to the point he can't keep his leather gloved hands from stroking what's underneath his jeans. D.O. notices the onlooker from the corner of his eye and really gives him a show driving his cock deep into Remy's mouth. Brock can't get enough as he tweaks his nipple and pulls out his long, thick meat. D.O is on his knees quickly, getting his fill of foreskin and thick meat that Remy has to share. Voyeur, Brock lets his leather suspenders down and leans back stroking, using both gloved hands to stroke his generous helpings of man meat ? this is one huge uncut cock to behold. But even more worthy of watching is Remy bending over and pushing his ass back on D.O.'s super cock. With so much cock in his ass, Remy's facial expressions show how much pleasure the prodding is giving him. D.O.'s hard body is now wrapped around Remy as D.O. mounts his hot bottom fucking him like an animal holding his mate and delivering thrusts. Brock strokes his cock and milks it for precum which he tastes, as the fury of D.O. grows. He's hitting Remy's spot and it turns Remy on so much that he strokes his cock harder and faster until he lets out a shower of cum spraying from his veil of foreskin. Brock can't hold back any longer and stokes his long member producing streams and globs of man milk as D.O. looks down at Remy and asks him if he wants it, with a grunting ?Yeah!? from Remy, D.O. shoots a load on Remy's chest.",
  "models": [
    {
      "name": "Remy Delaine",
      "person_id": 19593
    },
    {
      "name": "D.O.",
      "person_id": 19666
    },
    {
      "name": "Brock Keller",
      "person_id": 22677
    }
  ],
  "release_date": "2011-07-22",
  "scene_id": 56098,
  "tags": [
    "Anal",
    "Big Dick",
    "Boots",
    "Foreskin",
    "Hairy",
    "Leather",
    "Oral",
    "cum shots",
    "masturbation"
  ],
  "title": "Animus, Scene #04"
}