{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Dak Ramsey removes a tire and heads to the back to get a new one, passing Justin Christopher and Martin Mazza on the way. As they undress under the car, Justin's dick pops out of his pants and Martin swallows the huge tool. Justin's pole is massive and Martin gives it all the attention it deserves. After sucking and swallowing the big shaft, Martin wants it up his ass. Martin is a beautiful man with a heavy accent, tattoos, and a nice hairy chest, and he's a voracious bottom. Justin's huge cock is the perfect solution to Martin's need. Justin bends Martin over and fucks him, pushing all 10 inches deep. Justin fucks like a pro, pounding away, pulling all the way out slowly and then all the way back in. As the fuck energy builds, Martin blows a load all over the floor and Justin quickly follows. Dak returns not with a tire, but with a big Francois Sagat dildo. ?You want a piece of Francois?? asks Dak. Martin quickly throws his legs up in the air and his ass swallows the huge latex cock. Dak loves fucking Martin with the dildo but once he's worked up, he wants to stick the real thing in there. Dak whips out his cock, suits up, and plows away at Martin's loose hole. Martin's cock is rock hard as Justin holds Martin's legs up for easy access. Dak probes deep inside of Martin, filling his hole as Martin jerks himself off. Dak has a long fat cock and Martin loves feeling every inch as it pushes deep inside of him. The fuck energy builds and Martin can't hold off any longer. He covers himself with cum. Justin and Dak climax together and Martin's abs are covered in seed.",
  "models": [
    {
      "name": "Justin Christopher",
      "person_id": 19594
    },
    {
      "name": "Dak Ramsey",
      "person_id": 19798
    },
    {
      "name": "Martin Mazza",
      "person_id": 19828
    }
  ],
  "release_date": "2007-09-16",
  "scene_id": 56106,
  "tags": [
    "Anal",
    "Dildos",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Tattoos",
    "cum shots",
    "masturbation",
    "spitting"
  ],
  "title": "Tailpipes, Scene #04"
}