{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Making your way in the world today takes everything you've got. Brandon Lewis is helping Justin Chase take a break from his worries down at a little watering hole where a night of raucous drinking and partying is about to begin.  But before the crowd shows up to laugh and carry on, These sexy boys are going to have a little fun of their own!Justin's been occasionally bar backing at Sweet Karl's Scottish Lounge for a couple of weeks. He's made some good pals and seen some wild nights. He ended up going to an after-hours party last weekend with a fun-loving patron.  Word of their late-night antics reached veteran Sweet Karl's bartender Brandon a few days after. Brandon heard some very hot action went down and wants to know a little more right from the source. Justin is a little shy about the whole crazy experience, but Brandon can tell Justin did indeed engage in something sexy. He decides to act on his instincts and make a move on the young, fresh-faced bar back. Justin is definitely game. Without hesitating, he plants his lips on Brandon's, and then pulls out Brandon's cock for some passionate sucking. He's slurping down Brandon's enormous dong and turning him around for a thorough ass licking. Justin's letting Brandon enjoy some dick as well. Brandon is a fiend for hard cock and can't get enough of Justin's throbbing member. But that's not all Brandon was after. Watch Justin take a stiff fatty deep as Brandon slams his tight, warm hole. It's an exclusive pre-party that will have everybody knowing their names!Enjoy!",
  "models": [
    {
      "name": "Brandon Lewis",
      "person_id": 10277
    },
    {
      "name": "Justin Chase",
      "person_id": 19198
    }
  ],
  "release_date": "2013-06-27",
  "scene_id": 56164,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Loads",
    "Blonde",
    "Caucasian",
    "Climax",
    "Condom",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Bar Boys"
}