{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Vin is home alone when his buddies Manuel and Sergio Anthony stopby. These three studs use the large, spacious loft not as a bedroom,but as a sex club: sweating testosterone on every wall. In front of thewindows across from a huge construction site, the three men workthemselves up into an all-out oral orgy. Sergio serves as the bottomas he takes turns choking on Manuel's and Vin's competing cocks.Whose cock is bigger? Sergio doesn't care! He goes straight for themboth! Filmed with an eye that sees both beauty and raw sexuality,these boys stand over Sergio as he brings them to climax with theskills of his mouth, finishing himself off as Vin and Manuel cum.Sergio Anthony is a hot little Latin fucker. He might look cute andinnocent, but underneath it all he is a pig. He wants dick on both endsand Vin and Manuel sure deliver. This scene begins on one side ofthe room and moves all the way to the other. It is an all-out wall-towallsexcapade and these three men are the players. Sergio firsttakes Manuel's dick up his ass, then Vin's, with the alternating dick inhis mouth. Vin powerfucked Ford in scene 2 and Manuel bangedMario in Scene 1--now we get to see them both taking turns with abottomless bottom and Sergio takes it with enthusiasm. Every inch ofthe room gets used as Vin and Manuel tear up Sergio'seager assholefirst on the couch in multiple positions and then on the bed. As witheverything in Manhattan, this movie needed to end big and it does!Three beautiful studs shoot three beautiful loads, leaving Sergio witha cum-covered chest and a large smile.",
  "models": [
    {
      "name": "Manuel Torres",
      "person_id": 19529
    },
    {
      "name": "Sergio Anthony",
      "person_id": 29050
    },
    {
      "name": "Vin Nolan",
      "person_id": 29049
    }
  ],
  "release_date": "2006-07-18",
  "scene_id": 56360,
  "series": "Manhattan",
  "tags": [
    "Anal",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Tattoos",
    "cum shots",
    "jockstraps",
    "latinos",
    "masturbation"
  ],
  "title": "Manhattan, Scene #06"
}