{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men presents Rich Kelly and Steven Ponce in RETRO SEX. This is our first in a series of scenes that pay homage to the classic porn films of the 70's & 80's that have paved the way for us to shoot the porn we do today. In those old classics the film was a little off color and grainier than today's slick HD and the actors rarely spoke a word before getting down to action. It was about the connection and the hot sex! Well, that is exactly what we are about here at HPM! Confident Men - No Scripts - Real Sex, is our motto. In our first RETRO SEX scene, Rich and Steven are found cruising each other pool side and ready for action. Rich approaches Steven and the two share a much needed cool refreshment on this sultry hot day. Soon their tongues are intertwined and their cocks are throbbing to be released from their swimsuits. Steven drops to his knees and deep throats all of Rich's rock hard cock. Rich then does the same and proves that he is just as talented in the deep throat department. Steven them jumps in the pool and positions Rich's beautiful ass right on the edge so he can get it nice and wet. He spits pool water into Rich's tight hole, uses his tongue and fingers to get him ready for some fucking. Steven then fucks Rich doggie style and drives his hard cock in deep and hard.  Rich then bends Steven over for some deep ass rimming before driving his hard cock deep inside Steven's ass. Steven then climbs on top of Rich and rides his cock like a champ as his own cock remains hard as a rock and throbbing. Unable to hold back any longer, Steven shoots one of the biggest loads of cum all over Rich's hairy chest. He then bends down and licks some of it up as Rich pounds his own cock readying himself for a powerful orgasm. Rich shoots a nice thick load all over Steven's face and into his mouth. The two then swap some come before falling into each other's arms spent from some hot sex. Enjoy!",
  "models": [
    {
      "name": "Steven Ponce",
      "person_id": 27969
    },
    {
      "name": "Rich Kelly",
      "person_id": 31592
    }
  ],
  "release_date": "2013-06-04",
  "scene_id": 56442,
  "series": "Rich Kelly And Steven Ponce",
  "tags": [],
  "title": "RETRO SEX"
}