{
  "collections": [
    "Raging Stallion"
  ],
  "description": "John (Antton Harri) is busy bounding horseshoes on the anvil whenDillon (Damien Crosse) enters. John is irritated that Dillon is late forwork, but Dillon is about to make up for it. Dillon declares that it is toohot to work clothed, so he begins to strip. John cannot help but noticeDillon's incredible ass and John decides to join in. After undressing,John begins to work again, but the sweat is building up and Dillon ismore than happy to lick it off. Dillon begins to work on John's muscledback, moving closer to his beautiful ass. Dillon begins to feast onJohn's ass, licking it good and getting it wet. Dillon begins to rub hisuncut cock on John's hole. John turns around and Dillon begins tofeast on the cock facing him, taking it all the way in, getting it wet withspit. Still in work gloves, John gets on his knees and returns the favorof cock worship. Dillon begins to pump John's face, shoving his cockinto the open mouth. John gags on the huge uncut meat. Dillon bendsJohn over the anvil and begins to pound his eager hole. Dillon attacksJohn's hole without mercy, making John take the huge meat all theway in to the balls. John wants more control of the situation, andstarts to ride Dillon's dick. Riding feverishly, John easily takes Dillonall the way inside. Dillon enjoys the view of John's muscled back andeager asshole taking his uncut cock. Soon, John is on his back on theworkbench while Dillon continues to pound away. Dillon pumps harderand faster until John explodes with cum all over his abs. Dillon pullsout and strokes his meat until he shoots his load on John's legs.",
  "models": [
    {
      "name": "Antton Harri",
      "person_id": 20012
    },
    {
      "name": "Damien Crosse",
      "person_id": 19793
    }
  ],
  "release_date": "2010-01-01",
  "scene_id": 56488,
  "series": "To The Last Man: The Gathering Storm",
  "tags": [
    "Anal",
    "Boots",
    "Foreskin",
    "Hairy",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "rimming",
    "western"
  ],
  "title": "To The Last Man: The Gathering Storm"
}