{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Life is hard on the inside.  That's why Cody Carter has made friends with the prisoner in the next cell, Slate Steele.  They've been locked up next to each other for a couple weeks now and worked up a pretty decent rapport.  Sometimes when it's quiet Cody can hear Slate jerking his cock.  This afternoon, Cody has a plan.When Cody hears Slate tugging his meat over there, Cody decides to fatten up his own dick.  Then he calls over to see if Slate would like to take a look at some porn Cody's had stashed away.  Of course, Slate can't wait to feast his eyes on some explicit magazines.  Cody tells Slate about more dirty mags he wants to show Slate.  Good thing Cody has a secret key they use so Slate can join Cody in his cell!  They just need to keep watch for guards.  As Slate looks at one of the porns, Cody pulls off his underwear.  Before Slate can protest much, Cody is grabbing Slate by the back of the head, burying his face in cock, telling him to 'take it!' Slate gives in and indeed does take Cody's growing erection into his mouth.  Once it goes in, Slate remembers the last time he tasted dick.  It's a memory he's been dying to relive.  Cody can't believe how good Slate's lips feel locked around his throbbing member.  Then, when Slate's not expecting it, Cody wrestles Slate against the cell bars and jams his hard cock into Slate's ass!  Slate was NOT ready to be fucked, but it's too late now.  And it feels too good!  Watch Cody and Slate make the most of their time in the clink in this hot, jailhouse romp.Enjoy!",
  "models": [
    {
      "name": "Cody Carter",
      "person_id": 30966
    },
    {
      "name": "Slate Steele",
      "person_id": 27718
    }
  ],
  "release_date": "2013-07-25",
  "scene_id": 56484,
  "series": "NDB - 4455 - Slate Steele & Cody Carter",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Jailhouse Cock"
}