{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Back at the Double K, RJ Danvers warns Dan Rhodes not to wastehis piss; they are having a water shortage after all. Dan follows RJ tothe work shed and makes RJ start working on his ripe pits. The twohairy men begin to explore each other's bodies with their tongues andhands. RJ is a total bottom boy who immediately begins to suck onDan's fat uncut cock. RJ bends over the wheelbarrow and Dan beginsworking on RJ's hairy hole with his tongue. RJ spreads his cheeksapart so that Dan can dive deeper with his tongue. Dan starts fuckingRJ doggie style over the wheelbarrow. RJ then gets on his back to letDan take more control by pushing more of his uncut cock inside hisfuzzy ass. RJ cannot get enough in his hairy hole and begins to puthis own fingers in too. Scott Tanner walks in and without missing abeat begins to rub his crotch and Dan's ass. Scott puts his cock inRJ's mouth and watches as Dan keeps pounding RJ's hole. Scott alsowants some of RJ's hole so he and Dan start having a sword fight inRJ's willing asshole. But Scott is the one who gets the cum out of RJ.After he covers his furry stomach and tasting his own cum, RJ leavesto get back to work. Scott and Dan still have some work of their ownto take care of. Dan then gets the pleasure of having Scott's hot cockin his hole. Dan gets on his back and lets the ranch owner get someof his prime beef ass. Scott's low hanging balls bounce against Dan'sass as he pushes in deep. Scott's huge cock brings Dan to the brinkof ecstasy and he covers his hairy stomach with hot cum. Scottquickly follows with a shot all his own.",
  "models": [
    {
      "name": "Scott Tanner",
      "person_id": 19758
    },
    {
      "name": "RJ Danvers",
      "person_id": 19778
    },
    {
      "name": "Dan Rhodes",
      "person_id": 32024
    }
  ],
  "release_date": "2010-01-01",
  "scene_id": 56490,
  "tags": [
    "Anal",
    "Boots",
    "Foreskin",
    "GroupSex / Orgies",
    "Hairy",
    "Oral",
    "Tattoos",
    "masturbation",
    "rimming",
    "western"
  ],
  "title": "To The Last Man: The Gathering Storm, Scene #04"
}