{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Scott Campbell sneaks down to the neighbor's creek to steel more water. Perhaps he does not remember that this is what got his buddy, Jake, lynched. He fills his jug then decides that the water is too inviting to pass up. He strips off his clothes and goes in for a much needed swim. Vance (Antonio Biaggi) wanders along and spots this hairy nude ranch hand in his creek. Vance watches as he strokes his cock and drinks Jack Daniels. It's too good of an opportunity to pass up. When Scott sees Vance's massive dick (it's the biggest Dick in Porn, by the way), his eyes open wide. Scott goes down on Vance, trying to fit as much of that cock as he can. Vance returns the favor, sucking down Scott's dick before getting to his ass. When Scott bends over and offers his ass Vance sticks his tongue deep inside and warms it up for fucking. Once the fucking starts Vance gives Scott one hell of a fuck, pumping in and out with all 11 inches of that cock. Vance lifts Scott up and pounds into him until Scott is pushed almost over the edge. Vance pulls out and gets on his knees to swallow Scotts load and then Vance does the same, getting a huge load in his mouth. This scene must be scene to be believed?two of the hottest men fucking under the western sky. After they exhaust each other, they jump back into the creek to wash of their cum soaked bodies. Even though Vance has just fucked Scott silly, he will not allow his water to be taken back to the Tanner ranch. The two men struggle in the water thrashing around pumped and with adrenalin. Somehow Scott gets the upper hand and pins Vance underneath the water. Vance goes limp, dead. Traumatized by what he has just done, Scott flees the scene of the crime. Little does he know that when he killed Vance he signed his own death warrant and that of all of his friends as well.",
  "models": [
    {
      "name": "Antonio Biaggi",
      "person_id": 19618
    },
    {
      "name": "Scott Campbell",
      "person_id": 31109
    }
  ],
  "release_date": "2008-11-11",
  "scene_id": 56498,
  "series": "To The Last Man: Guns Blazing Part 1",
  "tags": [
    "Anal",
    "Foreskin",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "butt play",
    "masturbation",
    "rimming",
    "solo scene",
    "western"
  ],
  "title": "To The Last Man: Guns Blazing Part 1, Scene #04"
}