{
  "collections": [
    "Raging Stallion"
  ],
  "description": "While taking care of the horses, Jake worries about the watersituation when out of the blue John (Antton Harri) shows up withwater from his ranch. Jake realizes the dangerous situation that Johnhas put himself in and loves him for it. The two passionately kiss.Jake asks John to meet him at the Indian Ruins later that evening...Jake anxiously waits for John at the Indian Ruins that night. Johnappears and the two begin to kiss and hold each other. The passionbuilds as Jake takes John into his arms. Jake gets on his knees tosuck on John's waiting cock. Jake takes John all the way down histhroat effortlessly. John gets on his knees to return the cock worship.Jake backs John onto a hay bale and places him on his back to get tohis hole. Jake licks John's opening hole slowly, deliberately. John'shole opens and closes with each passing lick. Jake navigates his hardcock into John slowly, feeling his hole take him in. Jake loves John'shole and starts to build his intensity. He turns John over on hisstomach and continues the fucking. The two are still dressed, workingtheir way out of their clothes during their lovemaking. Lying on theground the two exchange knowing glances that they are about tocum. John shoots first, followed by Jake. Using the handkerchief fromearlier, Jake cleans up the cum and they fall asleep in each other'sarms. They have not noticed they were being watched by Lee(Damian Rios in a non-sexual role) from the Flying V Ranch...",
  "models": [
    {
      "name": "Antton Harri",
      "person_id": 20012
    },
    {
      "name": "Jake Deckard",
      "person_id": 19577
    }
  ],
  "release_date": "2010-01-01",
  "scene_id": 56494,
  "series": "To The Last Man: The Gathering Storm",
  "tags": [
    "Anal",
    "Hairy",
    "Oral",
    "Outdoor Sex",
    "Tattoos",
    "butt play",
    "rimming",
    "romance",
    "tit play",
    "underwear"
  ],
  "title": "To The Last Man: The Gathering Storm, Scene #08"
}