{
  "collections": [
    "Boyz Party"
  ],
  "description": "The sixth and final scene starts with Carson doing photos of John, Ray and Robert. A sudden power outage leaves all of them in the dark. Carson joins the electrician, Tommy Gent, at the circuit box and starts to play with him. With only a small flashlight to guide him, Carson starts to suck on Tommy's massive cock as he works to restore the power. Meanwhile, Ray, Robert and John are feeling romantic from the candlelight on the set. Kissing turns to sucking with their moans of pleasure resounding. Tommy and Carson go to check this out and join the action upstairs. Before long, all 5 of these perfect boys are swapping spit and taking huge cocks down hungry throats.  Gerry and Taylor were also caught in the dark. They were just about to check in at the studio when the lights had gone out. They enter and are shocked to see the entire crew engaged in complete carnality. Taylor cites, 'Boys will be boys!' and so they both quickly disrobe and join in the action. A feast for the eyes ensues as these 7 incredible specimens change positions and activities until the fucking pairs are chosen. Ray fucks John as John sucks Robert's awesome 8-incher. Gerry plows Taylor on the floor and Carson delivers a standing fuck to Tommy. John swings around to receive Robert's thick, bone-hard prober deep and bareback. Robert fucks him hard and deep. All 7 studs fuck until they cannot hold back any longer and spill their pent up juices.",
  "models": [
    {
      "name": "Ray Renfro",
      "person_id": 29585
    },
    {
      "name": "Taylor Hill",
      "person_id": 29819
    },
    {
      "name": "Robert Driveman",
      "person_id": 29605
    },
    {
      "name": "John Pepper",
      "person_id": 29834
    },
    {
      "name": "Tommy Gent",
      "person_id": 29735
    },
    {
      "name": "Carson Michaels",
      "person_id": 29836
    },
    {
      "name": "Gerry O'Connel",
      "person_id": 29812
    }
  ],
  "release_date": "2004-11-03",
  "scene_id": 57132,
  "tags": [],
  "title": "DJK Productions: Catalog Shooters, Scene #05"
}