{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men presents Episode 2 in our RETRO SEX series called BLUE HANKY starring CJ Parker and Jeremy Stevens. Do you remember the hanky codes from the early days of gay sex and cruising? In this episode, we find CJ Parker hanging out in the warehouse with a dark blue hanky in his right back pocket (passive bottom) and Jeremy Stevens is cruising him. The two stare each other down for a bit like two dogs in heat before circling each other and sizing each other up. Jeremy pushes CJ to his knees and and CJ wastes no time in getting to work on his hard cock begging to be freed from his jock-strap. CJ deep throats and gags on Jeremy's huge cock as he eagerly sucks. Jeremy then pulls CJ up and yanks his jeans down and returns the favor by sucking his cock deep and hard. Jeremy then takes the belt from CJ's jeans and puts it around CJ's neck as he leads him over the ladder and orders him to climb up to give him better access at his bubble butt. Jeremy buries his tongue deep inside CJ's ass getting him all wet before pulling him back down as he thrusts his huge cock deep inside CJ. CJ is so taken by Jeremy's massive cock that he let's out many guttural grunts and groans every time Jeremy drives his cock deeper inside him. Jeremy then bends CJ over like a dog and pounds his ass long and deep. He then pulls CJ up by the neck and pushes him on top of an electrical spool where he drives his cock all the way to the hilt as CJ groans in pleasure. Soon CJ cannot hold back any longer as he let's his cum flow. Jeremy forces CJ to his knees and shoots a large load all over CJ's face and then leaves CJ in the dust as he walks away satiated. Enjoy!",
  "models": [
    {
      "name": "CJ Parker",
      "person_id": 31291
    },
    {
      "name": "Jeremy Stevens",
      "person_id": 31078
    }
  ],
  "release_date": "2013-06-11",
  "scene_id": 57439,
  "series": "CJ Parker And Jeremy Stevens",
  "tags": [],
  "title": "RETRO SEX EPISODE 2: BLUE HANKY"
}