{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "If you looked up 'straight stud' in the dictionary, you could easily find a picture of Cooper Reed. With 150 pounds of muscle packed onto his 5'7' frame and spilling out, practically tearing the fabric of his t shirt, you could almost forget the way he was tending his jeans or that his piercing sapphire colored eyes would turn the 'Man in Blue' green with envy. Those when it comes to envy, the lions hare of that today has to belong to Andrew Collins, the 19 year old who was about to give that hunk a unforgettable serving of man flesh. Cooper Reed's charms start at his head and work down to his toes. This stunner is dripping in confidence and oozes a natural masculinity that was both intoxicating, and nerve racking to Andrew who seemed to think he might just 'get his lunch money taken by the big guy from the football team.' A little taller, a little lighter, it looked as first like Cooper would use Andrew as his personal barbell, but soon discovered Andrew's other talents might help him work off tension that is not relived in the gym.Even as he sat on the couch, the mass that makes up Cooper's biceps left most skin exposed than was covered by the fabric, leaving the dark ink of his latest tattoo in full view and the perfect conversation starter for Andrew. As Andrew's fingertip every so lightly hovered over the new tat, Cooper stripped off his shirt to display the marking on his other arm. As Andrew reached over, his hand came in for a landing on Cooper's big pec and in a move that took everyone by surprise; Cooper's tongue came in for a landing somewhere around Andrew's tonsils. Breaking the kiss to stand up, Cooper opened his jeans, pulled down his boxers to reveal his heavy, thick, uncut veiny throbber that was rock hard by the time he put his hand on the back of Andrew's head. Andrew stripped off his shirt and Cooper sat back down and as Andrew's head bobbed up and down on Cooper's pole, Andrew rubbed the bulge in his red jock. Andrew got up, pushed the fabric of the punch to the side to let his own cock breathe as Coopers took the hint, the bait and that cock in his mouth. As Cooper fisted his own still hard dick, he powerful gaze commanding Andrew's attention as he looked up into Andrew's very wide eyes and sucked away with conviction of a guy hell bent on doing something right. Next, he bent Andrew over on the couch, straddled him, spread those cheeks wide and found an additional place to put his tongue.Cooper ate away at Andrew's hole seemingly forgetting this wasn't his girl's pussy or at the least, no longer caring. He had the fever for the flavor and soon gloved up, got behind Andrew and placed the business end of his cock at Andrew's hole followed a steady push into awaiting globes of pleasure. He used the strap of Andrew's jock as a handle to rock Andrew back and forth on his cock; he leaned forward, grabbed Andrew's head and practically swallowed Andrew's tonsils before having a seat back on the couch and invited Andrew to take a seat as well. Andrew RSVP'd to that invitation but sitting on Cooper's cock, raising himself as high as he could before lowering himself down again, working in every inch with depth and speed. Positioning himself now between Andrew's legs, he started plowing away with renewed strength as Andrew took but a few strokes before his body shuddered and released his load. With Andrew still trying to catch his breath, Cooper knelt beside him and let his own load loose, cumming in for a landing on Andrew's already jizz covered stomach and chest before he ended things the way it started: with a kiss",
  "models": [
    {
      "name": "Andrew Collins",
      "person_id": 31008
    },
    {
      "name": "Cooper Reed",
      "person_id": 31009
    }
  ],
  "release_date": "2013-05-24",
  "scene_id": 57738,
  "series": "CJB - 265 - Andrew Collins & Cooper Reed",
  "tags": [],
  "title": "Nice Ink Dude"
}