{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "It's been two and one half years since ExtraBigDicks.com had the pleasure of presenting one of our favorite schlong masters, Mr. Ricky Larkin. Now 26, he spent a good deal of that time on his body which has finally caught up with his cock: thick, oversized, hair covered and pumped. Heavy browed, scruffy faced, Ricky's has grown into an open-minded, fetish loving big cocked Neanderthal with a need to seed to match. On the opposite end of the spectrum is the debut of 19 year old Mark Jameson. Barely over one hundred pounds, Mark needs to build some muscle and Ricky teaches him the basics of strength training, endurance the importance of receiving the proper amount protein in a way they don't show at the health food store. As Ricky lends a hand to support Mark as he struggles to lift himself up from the weight bench, Ricky's big paw almost extends over the sides of Mark's tiny little waist. As Ricky looks down at Mark, his thought bubble says 'lunch' and he decides it time for Mark to eat. He takes Mark by the head and grinds it all over his bulge. Shucking his shorts, hauling his bone, he grabs Mark by the hair and uses his mouth, ordering him to open wider & go deeper until he finally cradles his skull and fucks his face, pulling out only to slap the big pole across his cheeks, force feeding more dick then he ever thought he could handle. After dragging him over to the chair, Mark's mouth strains to engulf the still hungry pole. Ricky yanks down Mark's pants, spreads his cheeks goes deep sea diving with his tongue in Mark's tight, pink hole, eating away like a man possessed. While he slurps on that hole, Ricky's cock throbs hand free in anticipation...and that cock will not be visible for long.",
  "models": [
    {
      "name": "Ricky Larkin",
      "person_id": 28464
    },
    {
      "name": "Mark Jameson",
      "person_id": 31066
    }
  ],
  "release_date": "2013-06-05",
  "scene_id": 57744,
  "tags": [],
  "title": "Working it Out"
}