{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "That handsome face would have been enough, the tight, lean body, bedroom eyes and sexy accent would have been enough, but are those fat eleven inches belonging to Mario Costa 'too much?' Not here on ExtraBigDicks.com and definitely not too much for Hunter Paige either. 19 year old Hunter has a southern twang and a big ole wang himself. At 5'11' and 140 pounds, Hunter has the fresh faced, wide-eyed appeal of a connoisseur of the penis colossus and was he ever in the right place today. He's used to his 8.5' making him the top dog in the room, but Mario's double hand full pole relegated him to the bottom this time around and that seemed to suit everyone just fine today. Mario doesn't have to reach very far down to give that big ole dick a rub under any circumstances, but sitting there and seeing Hunter's purty 'lil ass cheeks outlined in his tight fitting boxer briefs, the circumstances became very clear, and so did both of their bulges. When Hunter turned around, Mario tugged down the underwear, unbuttoned the shirt and quickly engulfed Hunter's cock while Hunter removed the rest of his clothes before guiding Mario's head up and down on a pole that was growing by the lick. Mario licked his way up and down every square inch of Hunter's fat, cock meat until Hunter pulled him up, stuck his tongue in Mario's throat and hauled out Mario's joy stick. With a gasp as he laid his eyes and hands on Mario's massive meat, and with a thud, he landed on his knees and began to feast on big Cuban missile, stopping only when Mario pulled his head away for some remedial tonsil hockey now and then. Mario enjoyed the view as Hunter's cock throbbed as he fed him more cock before he bent over initiated a sixty-nine until his throbbing pole, and Hunter's puckering hole, told them both it was time to initiate something else.",
  "models": [
    {
      "name": "Mario Costa",
      "person_id": 28031
    },
    {
      "name": "Hunter Page",
      "person_id": 28535
    }
  ],
  "release_date": "2013-05-29",
  "scene_id": 57742,
  "tags": [],
  "title": "Dude Where's My Pants"
}