{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "With a sparkle in his eye and a twang his voice, 20 year old Shane Jacobs makes his debut on CircleJerkboys.com. A good ole southerner with a big ole smile, Shane kept glancing at 23 year old AJ Sylvester. Looking like he mistakenly walked onto our set instead of the local recruitment office, this close cropped tall, cool customer was visibly nervous and visibly excited. AJ shared he'd gotten head from guys before and admitted with a smile they make better cock suckers then the girls he had been with. He also revealed the last piece of porn he jacked off was 'straight anal,' Shane immediately knew he was going to make sure that before AJ left, he would know the only hole better on a man was not just the mouth. With the awkwardness of a boy showing his buddy a Playboy he stole from his old man before someone came home and caught them, AJ plays that video he mentioned earlier for Shane and Shane immediately starts rubbing his own bulge, looking at both the screen and AJ, who took off his shirt to reveals a strong chest, well worked biceps and flat stomach complete with etched gum gutters flaring out of his jeans. As they both get down to their boxers, it AJ now stealing glances at Shane's bulge. Now both naked and hard, AJ leans back and closes his eyes as Shane reaches over and helps him stroke then quickly leans over and begin to slurp on AJ's throbber. AJ looks down in amazement, rubbing Shane back and neck as Shane licks and sucks every inch of AJ's cock and balls before AJ straddles him and gives him a fast skull fuck before moving Shane to his knees. Deep throating every inch of AJ's pole, Shane pulled it out of his mouth and stroked it, and as they locked eyes, they both knew where they cock was going next.With rock hard AJ sitting on the couch, Shane lowers himself onto AJ's pole, his own cock sticking straight out. They started moving in unison almost immediately, AJ pushing up as Shane pushed down, his willing hole taking in every inch of AJ's dick. Shane's quads flexed as he got his feet onto the cushions and bounced up and down before holding himself steady and letting AJ raise up and piston fuck him from below. Standing up and leaning over the chair, AJ retakes Shane from behind. The round smooth curves of Shane's ass have fueled AJ's lust as he fucks harder and deeper, grabbing onto Shane's hip and working in every inch of his cock. Back on the couch, he slides behind Shane and continues his rear assault as Shane fists his own cock, getting bigger and bigger as AJ continues to pummel away before getting on his knees and offering his face for cum shot target practice. AJ doesn't miss the target and Shane's face is soon covered with spooge that drips off his cheeks and chin onto the floor and Shane seal the deal with a load all over himself. ",
  "models": [
    {
      "name": "AJ Sylvester",
      "person_id": 31045
    },
    {
      "name": "Shane Jacobs",
      "person_id": 31046
    }
  ],
  "release_date": "2013-06-07",
  "scene_id": 57740,
  "series": "CJB - 266 - Shane Jacobs & AJ Sylvester",
  "tags": [],
  "title": "A Helping Hand"
}