{
  "collections": [
    "Men Over 30"
  ],
  "description": "'Opposites attract' is something we have proven here many times on MenOver30.com but today we add a new moniker, 'Similarity leads to passion' as Brett Bradley and Tristan Sterling finally pair up an a sizzling big dick take all sex fest that was destined in the cards to be a ball churner. Barley breaking 250 pounds between the two of them, both of these lean, nimble fuckers have a high sex drive and weak spot for their fellow feather weights. Tristan would love to be known as 'such a hot bottom,' and the way he handles the salami sized slab of cock on Brett, he want a long way to advance his career aspirations today. Brett also showcases something we have learned over the years, 'never underestimate what a skinny guy may be packing,' and from the first time he unleashed his hose here back in January, we could not wait to see that pole in use and luckily for us all, neither could Tristan. After taking one look at Brett standing looking back at him, Tristan didn't seem too upset that his friend David wasn't at home to say the least. As Brett took one step towards him, Tristan's open seemed pulled into the snake running across Brett's jeans like it was guided by a tractor beam of desire. Brett goes in for a kiss before Tristan drops to his knees, opens his jeans nuzzles his face across the bugle in Brett's underwear that outlined the full girth and length of that pole that practically extended beyond his thigh. Taking out that massive pole, Tristan feast on the big mushroom head and begins to power suck that fat cock, shoving as much of it into his mouth before sliding his knees to open his throat to try and take even more. Looking up at Brett with his mouth bloated with dick, Tristan bangs it on his tongue, licks his balls then stands up and allows Brett to liberate a cock ready for its turn. Brett proves to be quite the cocksmith himself, slurping on Tristan's meat before standing up and filling Tristan's mouth again. Arching his back and turning around, Brett's tongue invades Tristan's hole, getting it warm and wet for the big task it will be tackling next. Facing Brett on the chair, Tristan reaches down and holds Brett's cock by the base he is pressed his tight, smooth ass downward as that hole tries to accommodate the girthiest piece of meat he had ever encountered. With Brett's hands massaging his back, Tristan slowly raises and lowers himself up and down, taking more and more of that massive cock, moaning louder and louder and after a good hard smack on his ass, he licks Brett's face as he bounces up and down on that pole, his own hard cock leaving a trail of pre on Brett's pecs and abs. Now on his back 'fuck, yeah!' Tristan growls as Brett pushed back on Tristan's thighs, opening him up for as he pressed forward and drives his cock back home. 'You like that hole?' Tristan asks and Brett replies by fucking him even faster and deeper. With bit a stoke or two on his cock, Tristan releases his nut on his belly then Brett pulls out and seals the deal with a big oversized load worthy of the piece that produced it. ",
  "models": [
    {
      "name": "Brett Bradley",
      "person_id": 28087
    },
    {
      "name": "Tristan Sterling",
      "person_id": 28071
    }
  ],
  "release_date": "2013-06-06",
  "scene_id": 57748,
  "series": "MO - 233 - Tristan Sterling & Brett Bradley",
  "tags": [],
  "title": "Dave's Not Here"
}