{
  "collections": [
    "Next Door Twink"
  ],
  "description": "In a humid locker room, around late afternoon, Blake Stone returns from track practice.  Tyler Morgan is already there, relaxing after his shower.  Blake's seen Tyler out on the field before, and certainly noticed his sexy body.  Now they're alone together, sweating, smiling, and exchanging sexual energy.Blake's towel 'accidentally' falls off and Tyler laughs, but also becomes very erect.  After a seductive dance of expressions, Tyler decides to make a move.  He begins caressing Blake's wet, oily body.  Blake tries several times to land a kiss, but Tyler teases, moving in and out of lip reach, eluding Blake's advances.  But then their hardening dicks touch from underneath their jock straps.  And that's when Tyler can no longer tease.  They kiss deeply and passionately, with lots of tongue.  Then Blake goes down and takes Tyler's cock in his mouth.  He sucks excitedly while Tyler enjoys the incredible feeling.  Tyler bends Blake over a bench and plunges his tongue into Blake's sweet ass.  After a while, he slides his dick inside and fucks Blake hard but with care too.  Blake lays down after taking the nice slamming, and licks Tyler's hole.  Tyler has a surprise for Blake in his locker.  It's a large dildo, just the right size for a ride.  Tyler takes it for a go while Blake slurps a little more on Tyler's dong.  Join these amazing, sexy Twink boys as they steam up the locker room like you won't believe.Enjoy!",
  "models": [
    {
      "name": "Blake Stone",
      "person_id": 31372
    },
    {
      "name": "Tyler Morgan",
      "person_id": 31264
    }
  ],
  "release_date": "2013-07-23",
  "scene_id": 58713,
  "series": "NDT - 8190 - Blake Stone & Tyler Morgan",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Brunette",
    "Climax",
    "Dark Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Toys",
    "Twink"
  ],
  "title": "Towel Boys"
}