{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Brent Brandt is on his phone making plans to go out with some friends one afternoon, when Jackson Wolf comes out of the bathroom and finds him stretched out on the bed texting. Jackson has some other ideas of what to do with the afternoon, and they do not involve leaving the bedroom. Making his appeal to Brent, he takes off his shirt and inches closely to Brent on the bed. Brent can smell him, fresh from the shower, and a sensation grabs ahold of him in his pants. Oh wait, that's not a sensation grabbing Brent in the crotch, that's actually Jackson's hand, getting a paw full of cock and doing his best to keep Brent from going out. Relenting, Brent embraces Jackson and the two of them take off their clothes. Jackson is getting pretty firm in the shorts there, so Brent drops down and begins sucking on the head, downing the shaft and tonguing Jackson's balls. Jackson returns the favor and then Brent climbs on top of Jackson for some 69 action, with Jackson moistening up Brent's hole. Brent mounts Jackson from behind, riding him while he jerks his dick, and Jackson pumps away from behind. Brent is getting harder and harder, and has to refrain from cumming as Jackson bends him over from behind. They fuck doggy style for a while but it is obvious that Brent is not gonna be able to last much longer, so he mounts Jackson frontwards and jacks his load all over Jackson's chest, as Jackson pulls out and busts his nut all over Brent's ass. With both guys shagged and sated, going out is now the last thing on Brent's mind.Enjoy!",
  "models": [
    {
      "name": "Brent Brandt",
      "person_id": 31191
    },
    {
      "name": "Jackson Wolf",
      "person_id": 31114
    }
  ],
  "release_date": "2013-07-30",
  "scene_id": 58842,
  "series": "NDT - 8191 - Jackson Wolf & Brent Brandt",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Stay In & Play"
}