{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men is pleased to bring you Marc Dylan and Brian Bonds in WET DREAM: THE PHANTOM FUCK.  Did you ever have a wet dream when you were younger that was so vivid you could not believe it wasn't real?  HPM Founder Gio Caruso did and he never forgot it.  So, he thought, why not take two of the hottest men in gay porn and have them recreate it so that everyone could enjoy it as much as he did!  The scene opens with Marc Dylan in a deep slumber and finding himself someplace in between R.E.M. sleep and hopeful reality.  Soon a hand is stroking his growing cock and as he opens his eyes he discovers the object of his desire and soon to be Phantom Fuck is Brian Bonds.  The two stroke each other for a while before embracing in a deep kiss as they partake in some classic frottage as their cocks grind against each others hard bodies.  Marc is soon on his knees as he deep throats Brian's 8' cock and strokes his own at the same time.  Brian then returns the favor as he devours Marc's cock and then lifts his legs over his head as he eats Marc's ass and gets it all wet and ready for his cock.  Marc begs Brian to fuck him and although Brian starts out slow he soon increases the intensity while Marc approves of every deep thrust into his beautiful ass.  The two then find themselves in a hot 69 and before too long, Marc has his tongue buried deep in Brian's ass.  Marc then has Brian on all fours as he drives his cock deep inside Brian's beefy ass.  Marc fucks him long and hard before Brian says he wants to ride Marc's cock.  Brian climbs on top of Marc and rides his cock for all it's worth while Marc strokes Brian's cock.  Brian then shoots a thick creamy load of cum all over Marc's stomach.  He then dives between Marc's legs and as Marc strokes his cock, Brian sucks on his balls releasing a nice load of hot creamy cum from Marc's thick shaft.  Brian then sucks out the remaining cum as Marc lies back, eyes closed and breathing heavy.  As Marc opens his eyes, he looks down to discover that he is alone and with a smile on his face he rolls over and drifts back off into a deep sleep.",
  "models": [
    {
      "name": "Brian Bonds",
      "person_id": 28078
    },
    {
      "name": "Marc Dylan",
      "person_id": 31439
    }
  ],
  "release_date": "2013-07-30",
  "scene_id": 58901,
  "series": "Marc Dylan And Brian Bonds",
  "tags": [],
  "title": "RETRO SEX EPISODE 3: WET DREAM: THE PHANTOM FUCK"
}