{
  "collections": [
    "Next Door Twink"
  ],
  "description": "In a little county jail, somewhere out West, near the desert, Brock Mason and Matthew Keading have been locked up for three weeks now.  The Sheriff caught 'em kissing and grinding on each other behind the general store and didn't take too kindly on it.  Now the pair is sweating it out in the clink.  At least they're together. On hot afternoons like this one, the boys like to strip down to their undies and fool around.  The only thing keeping Matthew from going insane has been Brock's luscious dick.  Matthew knows how to fatten it up just right for licking and sucking.  Today Brock's having his way with sweet Matthew, like he always does.  They like to play and wrestle and tickle a lot.  It's fun and it usually turns into kissing, which leads to hot, sexy action.  After a bit of this frolicking, Brock removes Matthew's shirt and begins kissing and licking all over his chest and stomach.  It feels so good to Matthew.  When Brock sees that Matthew's cock is swollen and pulsating intensely, he decides to put it in his mouth.  He goes deep, letting the enormous thing touch the back of his throat.  Then he tastes Matthew's tight hole.  Matthew returns the favor by slurping Brock's meat passionately.  Soon Matthew is bending over so Brock can insert his erection into Matthew's beautiful ass.  This time they fuck hard.  They fuck like it's the only thing they have on the inside, besides steel bars and cinder blocks.  Maybe it is the only thing.    Enjoy!",
  "models": [
    {
      "name": "Brock Mason",
      "person_id": 31263
    },
    {
      "name": "Matthew Keading",
      "person_id": 17604
    }
  ],
  "release_date": "2013-08-06",
  "scene_id": 59057,
  "series": "NDT - 8192 - Brock Mason & Matthew Keading",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Hard Time"
}