{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Johnny Torque sees you over his shoulder, watching him as he looks in the mirror. He doesn't mind the extra company, provided that you don't mind if some of his friends join in. Ricky Thicke is the first to arrive, Johnny scopes him as he takes off his shirt and makes his way over to Johnny. Next on scene is Brandon Bronco with is fresh new cock. Meaty and undiscovered, the guys look on as Brandon slowly disrobes down to his underwear before joining them as well. Now all reduced to skivvies, they paw and grope at each other as Ricky falls to his knees and takes Johnny's hard cock into his mouth, slurping and gagging on it as Brandon watches. Ricky shifts over to Brandon and tongues his shaft up and down, as it grows bigger literally right in front of his eyes. With both guys hard as Chinese arithmetic, Ricky has his pick of the dicks, and so he bends over and lets Johnny have his way with him as he continues to suck on Brandon's throbbing member. Johnny flips Ricky over and continues to fuck him hard, and while Ricky tongues at  Brandon's balls and strokes his own dick. Ricky cums all over himself as Johnny keeps pounding, and the sight of it sends a rush of blood to Brandon's cock, swells him with lust and explodes all over Ricky's face in a giant messy load, before Johnny pulls out and shoots a cumshot so far it goes over Brandon's shoulder and hits the wall behind him. Enjoy!",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Brandon Bronco",
      "person_id": 31339
    },
    {
      "name": "Ricky Thicke",
      "person_id": 31475
    }
  ],
  "release_date": "2013-08-08",
  "scene_id": 59145,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Condom",
    "Dark Hair",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Three's a Charm"
}