{
  "collections": [
    "Men Over 30"
  ],
  "description": "Al Carter makes his debut with us this week on MenOver30 and we're happy to have this sexy 31 yo from the Bronx. Back home in the Big Apple, Al is quite the popular bar tender and prides himself on making some evil drinks. Al started messing around at an early age and Sunday school had a different effect on this one. Al likes girls hem for wanting a piece of that. He loves girls with dirty blond hair, nice natural perky tits. They don't have to be big and a nice booty. He considers himself very sexual and the kinkiest thing he's talked a girl into doing is some toy play fucking her while he plugged the other hole. Having done a few scenes with a guy we wondered what effect that had on his sex life off cam. 'It opened doors a lot more, made me understand the other side' he says 'I was never against it.' He admits ass play was a nice thing to discover and has done that with the females and it definitely makes him cum harder than just dick play. Well, let's let this native New Yorker get naked and take care of business. We wanna watch...Al is kicking back watching some porn on his laptop and can't ignore the growing bulge in his pants any longer. He lays back and starts to feel up his chest as he gives us our first peek at his lean, defined torso. He slowly caresses his abs a bit before undoing his jeans. He peels off his shirt showing off his smooth chest that has a tribal tattoo covering most of it. He stands up and begins to tease us as he plays with his cinnamon nipples with one hand while squeezing his growing cock with the other. His pants slide off as he gets rid of them leaving him in his black boxer briefs that are doing their best to contain his growing boner. He strokes that dick a bit more before finally pulling it out. He takes his time revealing his cock as he slides his briefs down inch by inch giving his hard cock the breathing room it so badly needs. Al lubes that dick up and starts stroking.The cam gives us a hot view from below as we watch his cock and smooth balls get worked. Al uses both hands on the dick as he plays with his balls before double fisting his rock hard cock. He grabs his balls with one hand and tugs on them making his cock even harder. Al then lies on his stomach pushing his cock back towards his ass so we can get a view of the backfield. His ass has another large tribal tattoo that runs from just above his ass across the top of both cheeks. He humps that dick into his fist as he pretends he's fucking a nice piece of ass. The moaning on cam is working him up and making those balls start to tingle. He sits back on the chair and spreads those thighs wide showing off that ass as he beats that meat faster. His balls pull up tight around his cock. Al then gets up and watches that laptop as he pumps that dick faster and harder. Just as the girl onscreen start to moan her loudest, Al grunts and moans as he starts to shoot his own thick load all over the place.",
  "models": [
    {
      "name": "Al Carter",
      "person_id": 28006
    }
  ],
  "release_date": "2013-04-25",
  "scene_id": 59258,
  "series": "Whackin' & Jackin'",
  "tags": [],
  "title": "Whackin' & Jackin', Scene #01"
}