{
  "collections": [
    "Men Over 30"
  ],
  "description": "The hunter becomes the hunted today on MenOver30.com as freshly thirty and oh so sexy Jace Chambers picks up the camera instead of posing for it but if you had the strapping Columbian import that is Alexander Garrett in the room with you, you would every moment of that encounter captured for total recall as well. Thirty-seven year old Alexander is just under six feet of chiseled lean muscle with a dazzling smile and a nine inch pole that rose to the occasion as he gazed at the handsome stud behind the lens, noting the size of the his package would indicate the two are well matched in the pinga department as well. As Alexander stripped off his tank top, they were both sporting swollen bulges that seemed to gravitate towards each either even through their pants, and those pants would not be on for long.Well worked arms, a full chest and flat abs came into view and as Jace walked over to adjust Alexander's pose, he put the camera down as something more pressing had come up. Alexander took off Jace's shirt as mouths melded together. You could hear the echo of their wet, passionate kisses as Alexander worked his way down, stopping to tug on Jace's nipple ring with his teeth as his licked his way down, starting to suck on Jace's cockhead is as it poked over the top of his waistband, then kept going until he was deep throating the considerable length of Jace's no exposed pole. He kept sucking, using Jace's balls as a handle, as they moved to the bench where the oral fest continued. As Alexander sucked away, Jace began exploring the muscular curves of Alexander's backside with more than just a causal interest. As Alexander raised himself to his knees, Jace hauled out Alexander's cock and returned the favor, his mouth sliding up and down as Alexander pivoted his hips, fucking his buddy's mouth with an even bigger cock. Knees to knees and face to face, they stole one more kiss before Jace bent Alexander over and found someplace else to put his tongue: Alexander's hole.As Alexander pushed his dripping cock back and continued to jack it along with Jace, Jace worked his tongue like a cork screw deep inside Alexander until the audible moans of pleasure filled the room. Then raising over and lowering himself onto Jace's waiting cock, Alexander's freshly eaten hole seemed in inhale every inch of Jace's dick. As he rode Jace's cock, he rotated his pelvis and worked his cock to produce every possible sensation for them both until Jace knew he needed some of that internal pleasure of his own.  With Alexander on his back, it was Jace's turn for pole riding with a liberal dose of making out and jacking off mixed in and both he and Alexander tugged on Jace's cock as it bounced up and down on Alexander's tight, flat abs.  Flipping Jace on his back, Alexander increased the pace two fold and literally fucked the cum out of Jace with so much force the cum came in for a landing all over Jace's own upper pecs and chin then Alexander added a heaping helping a his own jizz.",
  "models": [
    {
      "name": "Alexander Garrett",
      "person_id": 27914
    },
    {
      "name": "Jace Chambers",
      "person_id": 28094
    }
  ],
  "release_date": "2013-05-23",
  "scene_id": 59265,
  "series": "The Photo Shoot",
  "tags": [],
  "title": "The Photo Shoot, Scene #02"
}