{
  "collections": [
    "Men Over 30"
  ],
  "description": "David Chase is back on MenOver30 after a while away and is now 32. Jacksonville has been his home is whole life and he's surrendered himself to the fact that he'll never be able to escape. That sentiment seems to resonate throughout Florida for one reason or the other. Yet the boys keep a'comin' lol. This week we have a special treat for David as he helps us welcome back sexy, Sean Duran. Sean is a recent addition to our sites and has amassed quite the fan following. Tall, lean and tattooed, Sean is only 24yo and hails from Charlotte, North Carolina. You'd never know it from his sexy southern drawl. We asked these two what celebrity they would want to make a sex tape with. For David it would be Christian Bale; while Sean would rather jump on Bruno Mars. Sean started getting his tattoos at the age of 18 and doesn't have any favorite in particular. Sean confesses not all tattoos were as painful. It really depends on who's doing the work and how deep they go with the needle. The chemistry between these two is evident so we should be in for a great scene. So, let's let these two naked and see what develops...shall we?Sean is showing off his tattoos to David who's curious about what it must be like to get one. Show and tell leads to some groping as they start to make out. Sean loses his tee shirt as he gets comfortable and gives David's tongue more to explore. Sean's lean and defined and David licks his way south as Sean undoes his jeans and pulls out his cock. He moans as he lies back and watched David suck his hard cock. David pulls his pants off so he can get on the floor between his legs and really go to work on that cock. He shoves it down his throat til he gags and licks Sean's smooth balls as well. Sean then decides to return the favor as he gets on his knees and goes down on David's cock that by now is throbbing for attention. He works that dick with his mouth taking it all the way to the hilt. David just gasps as he watches his dick disappear down Sean's eager throat. David then pulls Sean up on his feet and gets him on all four on the chaise where he starts to eat that sweet ass. He devours that hole as he tongue fucks him deep. Once that hole is nice and wet, David stands up and slides that fat dick home. \\'Aw fuck, yeah!\\' Sean groans as David rails that hole. He climbs up on the chaise as well as he pile drives that fat cock in deeper and harder. Sean is doing his best to accommodate David's cock and loving every minute of it. They then switch it up as David lays back and Sean sits on his cock in a reverse cowgirl. Sean just fucks himself silly as he bounces on that meaty dick. David then stands Sean up against the wall and slides that cock back in for more. That cock hits Sean's prostate just right and in no time Sean is busting his load all over the carpet below as David's fat cock stretches his hole wide open. David then pulls out and gets Sean on his knees for a sizzling facial, dumping his fat load all over that pretty face.",
  "models": [
    {
      "name": "David Chase",
      "person_id": 27963
    },
    {
      "name": "Sean Duran",
      "person_id": 28079
    }
  ],
  "release_date": "2013-05-02",
  "scene_id": 59261,
  "series": "Tattoo'd and Screwed",
  "tags": [],
  "title": "Tattoo'd and Screwed"
}