{
  "collections": [
    "Men Over 30"
  ],
  "description": "MenOver30 is glad to welcome back 24yo Brian Bonds from Little Rock, AR. Brian is going to help us welcome sexy scruffy daddy CJ Parker. CJ is from a little town outside of Philadelphia called Downingtown and is 39 years young. We asked these two what the longest period of time they've been able to not bust a nut. Brian can hold out for 5 days but CJ can hold out for a whole week. Both of these guys have fur on them and the management definitely approves. Both of these guys like hair on their partners as well. When it comes to how kinky these boys get CJ blushes and admits he's about a 5. Brian considers himself a 9.5 on that kinky scale. Nail down the furniture! Well, opposites attract apparently. We have Mr. Vanilla and Mr. How do you want it? This should be an interesting shoot so let's get these two started and see where this combination takes us once those clothes come off.CJ is fixing the sink for Brian and when he's done he gets ready to go. Brian is thankful he has such a \\'handy\\' neighbor and asks if there's anything he could do to repay him. Friendly neighbor goes from handy to handsy in 2 seconds flat. They start to make out as Brian starts to strip CJ. The shirt comes off revealing CJ's hairy chest. The chemistry between these two is electric as Brian licks his way south to CJ's cock. He undoes his tight jeans and shoves that cock down his throat. CJ moans as he orders Brian to swallow his cock all the way to the hilt. Brian greedily complies sliding that fat cock so deep he gags on it. Brian soon wants some of the same as he stands up and shows off the tent in his own briefs. CJ kneels at his feet as he frees that boner. He slides his mouth on that cock as Brian starts to fuck his face. \\'Spit on it!\\' he grunts as CJ does what he's told before going back on that white boy dick. Brian then bends CJ over and goes to town eating that manhole. CJ squirms as that ass gets hungry for more than a tongue sandwich. Brian then stands and gets into position before sliding his fat cock right up that hairy ass. CJ gives it up as Brian pounds that pussy doggy style. He rails into that horny hole pulling his cock almost all the way out before ramming it back in. He takes that ass doggy then missionary then sits back and has CJ ride his cock in a reverse cowgirl as Brian hammers that dick up into that sore hole. All that cock makes CJ blow his load all over his hairy crotch. Brian then jacks his own massive load all over his chest and abs.",
  "models": [
    {
      "name": "Brian Bonds",
      "person_id": 28078
    },
    {
      "name": "CJ Parker",
      "person_id": 31291
    }
  ],
  "release_date": "2013-05-09",
  "scene_id": 59262,
  "series": "Lick a Good Neighbor",
  "tags": [],
  "title": "Lick a Good Neighbor"
}