{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Bigger isn't just better, it's everything has always been our motto here at ExtraBigDicks.com and today we add \\'it's all in a name\\' as those names are Angel Rock and Adam Wirthmore. Adam is indeed 'wirth more' and then some as this 23 year old slice of perfection packs 165 pounds of fur dusted studliness crowned with the smoldering face rarely seen outside the covers of a romance novel. Mr. Rock is likewise nothing less of a celestial gift commanding an accent so sexy that would even turn on his native Cubano's and a fat, 8.5\\' hair covered unclipped missile of manliness that wet dreams are made of. It wasn't just that the chemistry between these two was off the charts, it was beyond the periodic table but fortunately for us, they shared their formula with us, and a hole lot more. Adam took one look at the muscled physique of 21 year old Angel and practically forgot his own name, much less what he was reading. Angel snatched away the book as Adam lifted the bottom of Angel's shirt, exposing a treasure trail that dead ended into a bulge packing two handfuls of promise. Angel watched the curves of Adam's ass as he followed him inside. Adam closed the door as he reached over and faced Angel. Angel went in for a kiss and took off Adam's shirt at the same time. Angel was soon shirtless as well as they explored every inch of each other's strong hairy pecs. As their hands wandered south, they found each other not just hard, but the kind of throbbing that is visible even through fabric. Angel made quick history of Adam's shorts and dove his big strong hands inside the back of Adam's boxer briefs, kneading Adam's tight, round ass cheeks before liberating from Adam a cock so hard, it pointed hands free at the ceiling. Angel knew just what to do; hit the floor and give a dick commanding that much blood the expert oral service it demanded. As Angel continued his cock feast, he unbuttoned his jeans and his fat overstuffed chorizo of a cock exploded over the top of his waistband. Losing his jeans on his way up, their big dongs crossed before Adam slid to his knees and swallowed almost every inch of Angel while never breaking his gaze. His cock began to leak even as he struggled to take it all in his mouth as Angel slid to the floor and initiated a sixty-nine that was hot enough to be called a one-thirty-eight. As he inhaled Adam down to the balls, he looked at awaiting curves of Adam's ass and they would not be waiting for long.Spreading Adam's cheeks and teasing that hole with his fat head, Adam braced himself against the wall and arched his back as Angel began to work his impossibly fat cock inside.  Licking Adam's back as he continued his drive deeper, Adam gave way to the pleasure with a primal gasp as his hole gave way to the last inch of Angel's cock. Pulling Adam back against him, Angel kept fucking as he duck his head around to suck on Adam's nipple and extending his other hand for a reach around, he discovered that wasn't necessary; Adam's cock was still pointing toward the sky all by itself. The harder Angel fucked, the deeper Adam craved it so Angel put him on his back, grabbed his ankles, pecs and fucked away like steam engine while exhaling a litany of words so sexy you didn't need to speak Spanish to clearly know they were both dirty and hot. \\'Fuck yeah, give me that cum\\' Angel commanded and both Adam and his cock obeyed, sending jet after jet all over chest and abs before standing up and as Adam rubs his balls, Angel added ropes of cum to Adam's white lake. If you ever wondered what is better than being touched by an Angel, Adam can tell you...it's being fucked by one. ",
  "models": [
    {
      "name": "Adam Wirthmore",
      "person_id": 31518
    },
    {
      "name": "Angel Rock",
      "person_id": 31517
    }
  ],
  "release_date": "2013-05-15",
  "scene_id": 59275,
  "series": "An Angel at the Stable",
  "tags": [],
  "title": "An Angel at the Stable"
}