{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Chris Cox is finally back. It's been a while since we've seen this 27yo Cubanito from the MIA. Chris' playmate this week goes by the name of Ryan King. Ryan is 20yo and comes to us from Little Rock, Arkansas. We asked these two what the farthest they've ever shot while either jacking off or fucking. \\'I would say probably a good 10ft' says Chris, 'I hadn't jacked off in a couple days; and I'd been edging for an hour.\\' For those of you unfamiliar with the Cuban gift of gab, you need to divide by 2 and round way down to get an idea of what they actually mean. Ryan laughs and says the farthest he's shot has been about 3 feet realistically. He's catching on. Ryan's relatively new to the industry and is a definitely a Lady's man in his personal life. We asked them what they do best in the sheets if they had to pick their top category. For Ryan it would be eating pussy. For Chris it would be for his stamina cuz he can definitely fuck for a long time. We then wrapped up this doozy by asking them what porn they jerk off to most. Ryan looks for vids with girls with big asses. Chris goes for str8 porn too and looks for big dicks. Well, let's make some porn of our own. We have a couple of big dicks so let's get this show on the road...There's a box of Magnum XL on the end table and Ryan wonders why the hell anyone would need a magnum XL when the Magnum's fit him just fine. Chris laughs and tells him he has a really big dick. So, they decide to compare as they strip off their clothes and start getting their cocks hard. Ryan starts jacking his growing cock as his huge set of low hangers bounce up and down. \\'Dang, you got me beat!\\' he awes as Chris' cock just gets bigger and bigger. Soon they're both hard and stroking each other's dicks. Chris can't help but wonder what this str8 boy's dick tastes like as he goes down to find out. He swallows Ryan's meat with ease as Ryan gasps and moans in appreciation. Ryan bobs Chris' head on that hard cock, finally getting the attention it needed. Chris then gets up and lies back on the chaise and points his fat cock at Ryan. Ryan gets on his knees ans opens wide, \\'Damn, I didn't know they came in this size\\' he says before going down on Chris' hard dick. Chris just watches as Ryan does his best to accommodate every inch he can in that mouth of his. Ryan's already in position between Chris' legs so he decides he might as well get some ass on his dick. He picks up Chris' leg and slides that dick inside that ass. Chris moans and begs for it as Ryan starts to fuck his tight ass. He pounds that ass missionary for a while before they switch it up. Chris bends Ryan over and fingers that ass a bit before sliding his Cuban cock inside that ass. Ryan moans as his ass slowly concedes and takes that dick deep. Chris fucks him doggy as his balls slap away at that str8 ass. Chris then gets Ryan on his back and gives it to him missionary. This gets that dick even deeper inside that ass. It's hitting Ryan's prostate and it isn't long before that cock blows its thick wad all over Ryan's smooth navel. Chris isn't far behind as he pulls out and shoots his own batch of leche all over an already glazed Ryan.",
  "models": [
    {
      "name": "Ryan Keene",
      "person_id": 31430
    }
  ],
  "release_date": "2013-05-01",
  "scene_id": 59271,
  "series": "Battle of the Bulge",
  "tags": [],
  "title": "Battle of the Bulge"
}