{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Joey Cooper is a man on a mission. He had a half hour lunch break and it would take that long to devour an 8.5\\' cock that Jadyn Daniels brought to the lunch room. Joey Cooper is in possession of the one of the finest sets of globes on the planet: round, tanned, tight and willing. With his platinum hair smattering of ink, Jadyn might look try to look like a bad boy, but his sweet dispositions peak for himself though that fat, uncut clobber of a cock does a lot of his talking for him and boy does it have a lot to say. Just ask Joey's hole which summed it up in two words; blissful surrender.Joey told Jadyn to hurry over and he barely got in the door before Joey started opening Jadyn's jeans to unleash the beast of his desire. In a frenzy, Jadyn's jeans were down, the shirt was off and that mighty cock was up.  Those skinny one will surprise you sometimes and Jadyn's surprise was not just big, it was eight inches plus, thick as a wrist is covered in a criss cross of veins that kept it rock hard from the first moment we saw it. Joey leaned over and starting at the top, he circled his tongue around the head, licking down the shaft down to Jadyn's matching oversized balls before he got himself out his shirt and pants, slid to the floor and starting up into Jadyn's eye, he kept swallowing till he conquered his pole. Taking one look at the aforementioned vista that is Joey's ass now framed in the white straps of his jock, it was Jadyn who was now hungry and proceeds to feast on Joey's hole like a man who hadn't eaten in a week before flipping Joey on his back and having that cock for dessert. Finally coming up for air, Jadyn asked Joey if he was ready to be fucked and he didn't have to be asked twice. As Jadyn bent Joey over, Joey's cock was rock hard in anticipation. Aiming that fat head right at Joey's pucker, he begins sliding in a long steady push that must have dead ended in Joey's pleasure center as Joey raised up on leg for leverage and began to move back as Jadyn pressed forward, until the entire length was buried deep inside and that cock and Joey's ass played a game of push-me, pull you, until they moved over to chair for a different game: ride'em cowboy.  Joey lowered himself on the colossal cock beneath and now open and ready, he proceeded to bounce his way to heaven and back again and again and again. His quads may have needed a rest, but the hole was raring to go as he got up, took a seat and did the crab walk on that cock, leaning back for deep kissing while the fucking was going even deeper. Joey's cock remained rock hard as well, swinging around like a helicopter blade as Jadyn began thrusting up and Joey pressed down. Finally on his back, Joey said \\'take that dick\\' and Joey's hole was happy to oblige. Jadyn increased the speed until his now tight balls slapped against Joey's worn in cheeks and fucked a load out of Joey that went at first over his head and then the second blast landed right on his own upper pec as he continued to spray a white shower all over himself before Jadyn took a seat and worked out a load of his own. As for this half hour, they definitely made the most of their time, and each other!",
  "models": [
    {
      "name": "Jadyn Daniels",
      "person_id": 31515
    },
    {
      "name": "Joey Cooper",
      "person_id": 31516
    }
  ],
  "release_date": "2013-05-08",
  "scene_id": 59273,
  "tags": [],
  "title": "Make It Quick I Got a Half Hour, Scene #02"
}