{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We've got quite the hottie for you guys this week as we welcome a local Cuban hottie that answers to the name of \\'The Joker\\'. He's a \\'big\\' boy measuring in at 6'3 and this 19yo Miami native seems to have that as a recurring theme. Let's not get ahead of ourselves. <Bwuahaha> The Joker's single and at the moment and has plenty of horny \\'amigas\\' with benefits. Who could blame them for wanting a piece of that. He loves girls with big asses, slim waists, light asses and \\'character\\'. Yeah, that last one stumped us too.  His favorite part of a girl's body is her pussy and loves big tits too. The tits don't even have to be real. They just have to be big. He has never had a girl go anywhere near his ass and has no intention of letting that happen, EVER! He does, however, love eating out and fucking a girl's ass if she's down to let him have it. He gets pussy regularly so he doesn't have to jerk off but once about every two weeks. To wrap this one up, we asked him to tell us what he usually thinks about when he does jack off that makes his fat uncut cock blow. \\'A girl on her knees with her tongue out\\' he grins with that a maniacal grin. A real Joker this one! <that was puny, riiiight?> A sea of pussy awaits The Joker as he purveys a couple of magazines open to their centerfolds with hot girls baring all. \\'Look at that fat ass pussy\\' he grimaces as he starts to tug at his growing crotch. His dick isn't wasting any time and soon enough the Joker needs to get up and drop trou to give it more breathing room. He drops his jeans as we get a better view of the tent in his boxers. The Joker keeps playing with his cock and balls until his cock is throbbing at attention. The Joker is hot one, naturally smooth with subtle definition with an interesting tattoo of the Joker on his chest. He finally pulls out his thick uncut cock through his fly as we get our first glimpse at his fat hooded side-kick. His thick 8\\' cock is rock hard and still has enough foreskin to cover most of its head. He peels it back as he starts to give that cock what it needs. His boxers are the next to hit the floor as the Joker continues stroking to the bevy of pussy laid out before him. The camera gives us an over-the-shoulder shot as he strokes that cock slowly. The Joker then kicks back on the chaise, making himself more comfortable so he can stroke with one hand as he turns the pages with the other. He plays with his big dick using both hands to keep it interesting and as he does his smooth nut sack starts to pull up closer and closer to the base of his Cuban cock. He lifts his legs up on the chaise giving us a limited peak at that off-limits furry hole. On occasion, the Joker looks up at you with those sexy jade green eyes nestled beneath those dark eyebrows and grins; making you wonder just what he's got in store for you. His plans come together when he stands and towers over our cameras and picks up the pace. He jacks that cock faster and harder until his balls release their cargo. He groans as he sends his thick cum flying as it rains down on the glass beneath him. The Joker and his uncut sidekick have done their evil deed for the day; and we wouldn't mind watching him do it again. <evil grin> ",
  "models": [
    {
      "name": "The Joker",
      "person_id": 31505
    }
  ],
  "release_date": "2013-04-19",
  "scene_id": 59284,
  "series": "The Joker is Wild",
  "tags": [],
  "title": "The Joker is Wild"
}