{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Having made quite the impression on our brother site, ExtraBigDicks we decided to share the wealth over here. Kip is 6'3, has shoulder-length hair and is a South Florida native. He is attracted to athletic girls that have a great ass. He's open to both American girls and Latinas and in Miami we're sure he has plenty to choose from being single. Kip has sex often and gets it as much as he can anywhere from 3-5 times a week. He rarely has to take matters into his own hands. When he does have to jack that big dick he likes to watch hardcore porn to get him going. He's sexually open to whatever comes his way. He likes it one on one, three ways, orgies you name it. He's had sex while driving he says \\'I was never against it.\\' He admits ass play was a nice thing to discover and has done that with the females and it definitely makes him cum harder than just dick play. Well, let's let this native New Yorker get naked and take care of business. We wanna watch...Kip finally makes it home after a day at the beach. He throws his beach towel on the couch and starts to feel himself up. All that sun and half naked girls on South Beach got his dick going. He slowly pulls up his tee showing off his naturally smooth and defined abs and chest. He has classic features and long hair that just add to his charm. His hands work their way south as they start to tug on his cock that is starting to tent his shorts. He undoes them and as they slide off he's left in a sexy black jock strap that makes his ass look edible. It's off to wash off the salt and sweat as he strips naked and gets in the shower. He soaps up his larger than life frame as the water and suds cascade down his defined body, his fat cock and huge low hangers. He starts to play with that dick as he washes it and it's hard as a rock in no time. We can see why he was such a hit at ExtraBigDicks. He holds his cock firmly at the base as he strokes it with the other as he finishes rinsing it off. He goes back to the bedroom to finish what he started. His cock and huge balls are fresh and ready for some fun as he gets that cock hard again.  He lubes up and starts stroking for the camera. He bites his lower lip as he loses himself in the sensation he's getting stroking his big cock. Everything about Kip is large. His stature, his massive thighs and broad shoulders all come together to make one hot str8 boy. Kip sits back on the couch and takes his time playing with his cock that by now is throbbing. Kip then gets on his knees and bends over to show off that spectacular ass of his we can look at but can't touch. His smooth hole is just ready to be eaten; but just slightly out of reach. Kips balls are on overdrive with all this attention and he's ready to bust his nut. He sits back and goes for it stroking his thick dick faster until it explodes. Volley after volley of thick cum splatter all over the couch and his chest leaving him a wonderfully glazed mess.",
  "models": [
    {
      "name": "Kip Johnson",
      "person_id": 31506
    }
  ],
  "release_date": "2013-04-26",
  "scene_id": 59287,
  "series": "Water Sport",
  "tags": [],
  "title": "Water Sport, Scene #02"
}