{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Alex Adams is back with us this week and he's brought along a friend. Well, we can thank Arizona for this week's new addition, 24yo Vance Crawford who hails from Scottsdale. For those of you who aren't familiar with Alex, Alex is 26 and is a Baltimore Boy. We know these two horny jocks need to masturbate from time to time so we asked them who was the first person they remembered jerking off it. Vance remembers jerking off to Punky Brewster who oddly enough grew up to be quite the stunner. Alex jerked off to some random pictures of cheerleaders in the locker room. As for the last person the y jerked off to, Vance wanked it to the thought of Susan Sarandon while Alex beat off to some brunette with a hairy snatch. There's just NO accounting for taste. We then wrapped it up by having them telling us their proudest sexual moment. Alex' proudest moment was a three-way he had with his best friend and his friend's girlfriend. Vance steals the show when he grins and says \\'Nailing my 7th grade teacher while I was still in High School\\' ...and he looks SO innocent. A Keeper this one! Alex is seconds from lighting up a cigarette when Vance catches him in the act. \\'Hey you don't wanna do that, I thought you were quitting', he teases 'if you want something to smoke I got something for you\\'. Vance grabs his crotch as his visibly hard cock comes into view. Alex is on his knees in no time as Vance feeds him his thick cock. He slides it all the way down Alex' throat as he starts to fuck his face. Alex can't help but gag on Vance's cock as he gets that head bobbed up and down on that cock. Alex then gets up and drops his jeans before moving over to the chaise to let Vance return the favor. Vance gags almost immediately on Alex' thick cock as he tries his best to swallow it. \\'It's so thick it's making my eyes water\\'. Alex makes the best of it as he orders Vance to suck on his meaty balls. Alex then wants to taste that breeder ass as he gets Vance on all four before sliding his tongue up inside that furry ass. Vance grinds Alex' face deep inside that ass; wanting that tongue as deep as he can up inside his hot hole. That tongue just makes Vance horny for ass and turns the table on Alex getting him on all four before slamming that cock deep into his hole. \\'Fucking cigarette whore' Vance grunts 'let me catch you smoking again you cock smoker.\\' Vance fucks Alex rough and deep as he pulls his hair and fucks away as Alex begs him to fuck his pussy. That just makes Vance pound him harder as he fucks him like a dirty whore. Vance then gets Alex on his back and slams that cock back inside that worn hole for more as he calls him every name in the book. Vance pounds that man hole hard missionary as Alex' ass just milks that load out for him. As he gets close to coming he pulls out and lies next to Alex as they both blow their massive loads all over their chiseled bodies. Leave two str8 boys alone and you never know what can happen.",
  "models": [
    {
      "name": "Vance Crawford",
      "person_id": 31504
    }
  ],
  "release_date": "2013-04-12",
  "scene_id": 59282,
  "series": "Oral Fixation",
  "tags": [],
  "title": "Oral Fixation, Scene #01"
}