{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Jack King is back with us on CircleJerkBoys and he is not alone this time. Jack made quite the impression when this 26yo Florida boy did a solo for us. This week his playmate comes from Boston and goes by the name of Casey Phillips. Both of these boys have healthy libidos and jack off often. Jack loves to watch young petite girls getting fucked while Casey likes watching blowjobs to get off. Jack lost his cherry at about 14yo and Casey about the same at 15yo. Casey started fooling around with guys by the time he was 17. Jack's perfect girl would have long dark hair, blue eyes, tick hips and waist with a nice ass. For Casey, who likes both sides of the buffet, he likes girls that are fit and tone. For guys he likes them with short blond hair if possible, blue eyes and a big dick. Well, that's always a good thing. Well that's enough chat for now, let's get these two studs naked and see what happens. Jack is home and gets horned up. So he takes out his cock and starts to jerk off. He lubes up that sweet cock and gets it rock hard hoping to get some relief. Casey comes out of his room and walks in on him and offers to help him out. Jack drops his jeans and spreads those thick thighs wide as Casey goes down on his hard cock. Casey swallows that cock til his nose hits Jack's pubes wanting every inch of it. Jack loves it and helps bob Casey's head on his aching dick. Casey gets on his knees as Jack stands up to give Casey better access to that dick. Jack fucks his face as Casey undresses. Once he does he gets on the chair and lets Jack return the favor. Jack gets to work sucking that uncut dick as he jacks his own. Casey's getting hornier by the minute and is soon bent over that same chair as Jack fingers his tight ass. Jack's cock needs some of that. He sits back on the couch and has Casey sit on his meat. Casey grimaces as he takes that hard cock up that ass. Jack can't get enough as he pumps that dick up into that hole. From there, Jack gets Casey bent over the chair again and gets back to fucking that ass doggy style. Casey just whimpers as Jack buries his cock even deeper. He pounds that ass harder and deeper and soon he's ready to bust his nut. He pulls out and jacks that hard cock off all over Casey's back. Once he's done he gets up and goes to shower leaving Casey with a boner and a glazed back. Casey slowly picks up Jack's underwear and claims it as his own.",
  "models": [
    {
      "name": "Jack King",
      "person_id": 28545
    },
    {
      "name": "Casey Phillips",
      "person_id": 31507
    }
  ],
  "release_date": "2013-05-03",
  "scene_id": 59289,
  "series": "Fappin' & Fuckin'",
  "tags": [],
  "title": "Fappin' & Fuckin', Scene #02"
}