{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "We heard it before a zillion times; \\'I have sex three to five times a week and rarely jack-off.\\' But when that was said by Kip Johnson, we believed him as 26 year old tall drink of water with the rock star hair, move star face and porn star dick would make even the straightest man rethink his sexuality & before Kip departed the studio, his sexuality was updated to 'hetero-flexible' thanks to the charms of one Hunter Paige. 18 year old Hunter is 5'11\\' of Southern charm with a face to match and big 'ole 8.5\\' pole that never seems to go soft...especially when he took one look at Kip. But it is the way Kip returned his gaze that lead to one of the hottest straight guy goes gay encounters ever with the rules and roles out the window. Kip was waiting at his girlfriend's place when her roommate, Hunter, returned home and finally got to see what his roomie said \\'was the hottest piece of man flesh on the planet\\' sitting right there on the couch. Almost tongue tied looking at this A&F fantasy, \\'it's too bad you're not gay\\' came out of his mouth...but it's what went into his mouth next that we never saw cumming.We expected if anything, is Kip would be thinking of his girl while he let Hunter service him but what went into Hunter's mouth was not Kip's tip, but his tongue. He reached over, pulled Hunter close and proceeded to passionately kiss him complete with running his fingers through his hair, feeling his smooth, tight body and spreading his legs as Hunter's hands explored the bulge you could see from across the room. As Kip stood, he opened his pants and Hunter got on his knees, licked down Kip's six-pack, lowered his underwear and began to feast on that rapidly growing tower. With his hand on the back of Hunter's head, he guided that hungry mouth up and down his cock until Hunter took all eight inches to the base, stopping only for some remedial ball licking before returning to the prize. They took a seat on the couch and before Hunter had Kip's cock back in his mouth, Kip's hand reached over to Hunter's belly and quickly moved to a bulge that was even bigger than his own. Hunter's cock spilled out as Kip opened those jeans and wrapped those perfect lips on the throbbing pink head of Hunter's cock. He banged Hunter's cock on his tongue as he slid to his knees and looked up into Hunter's eyes. Seeing the untouched, inviting curves of Kip's ass, Hunter gave that hole a deep tongue drilling a chorus of moans emanating from Kip as he discovered his ass was more than just decorative, but a source of pleasure he had never dreamed of and I am sure Hunter never dreamed of what happens next.Rather than push him away, he handed the astounded Hunter a condom and immediately surrendered his hole as Hunter steadily worked in the tip, the shaft and by the time Hunter got down to the short and curlies, Kip was resting his moaning face on the floor and with one hand, reaching back and spreading his cheeks to Hunter could go even deeper. Flipping over onto their sides, Kip's balls were already tightening as Hunter laid behind him, raised one leg and buried that bone to the hilt again...and again...and again, leaning over for a nip suck here and quick kiss there before a final move to the chair as Kip rode that dick keeping a firm grip on his own rock hard cock. Raising himself up and down as Hunter lifted up, this fantasy turned reality fuck moved into over drive as Kip leaned back and fisted himself to a load that landed all over Hunter's chin and chest before Hunter added his own massive blast.",
  "models": [
    {
      "name": "Hunter Page",
      "person_id": 28535
    },
    {
      "name": "Kip Johnson",
      "person_id": 31506
    }
  ],
  "release_date": "2013-05-17",
  "scene_id": 59293,
  "series": "Just a Little Curious",
  "tags": [],
  "title": "Just a Little Curious, Scene #02"
}