{
  "collections": [
    "Circle Jerk Boys"
  ],
  "description": "Alexander Greene enlisted the help Isaac Hardy for his 'Laws of Attraction' survey but the evidence of the attraction was in the air, not on paper. Twenty-two year old Alexander has piercing blue eye, a mischievous grin and a lean 5'10' frame packing a veiny, uncut nine-incher. One year younger, a couple of inches taller, dark haired Isaac's eight and one-half inch pole rounds today's slabs of beef. Isaac is making his debut here on CJB today, bringing his big cock with him and fans of the site already know of the legendary pole between Alexander's legs so with two cock this big, who is going to be the top? The answer is both in a flip fuck session that left them with sore asses, empty balls and even bigger smiles.Isaac was already rubbing his crotch as Alexander asked him what kind of guys he is most attracted to. What came out of Isaac's mouth could have been of description of Alexander himself and soon something went into Isaac's mouth, Alexander's tongue.  They explored each others bodies as they kissed deeply, managing to pry their mouth apart long enough to get each others shirts off before Alexander stood up. As Isaac undid Alexander's shorts, he wasted no time dropping his knees and sucking on that cock which grew exponentially until Isaac could seemingly suck it from across the room. Isaac eagerly slobbered over every inch of Alexander's cock before Alexander pulled him up, fished out that throbbing pole and worked it like a size hungry dick-meister before pulling him out for a bonus make out session. After their big cocks staged a sword fight, Alexander took a seat on the couch and Isaac soon found something else to sit on.Isaac lowered himself like a crane onto the waiting tower of cock and with a steady pressure downwards, kept going until all nine inches was inside. Alexander reached under Isaac's cheeks to keep the up and down motion escalating until Isaac turned to the side, put on leg on the floor to brace himself for a second session of pounding, the creaking of the couch and moans from his mouth offering testimony of the deeper excavation taking place. Turn about being fair play, Alexander raised up one leg, looked back at Isaac and with a wink, took it right in the stink as Isaac pressed forward, grabbed onto Alexander's head for leverage and fucked away at eager hole as Alexander's cock grew again and his heavy balls swung back and forth until he grabbed Isaac for another kiss, then traded places with him. 'Do you like that dick' Alexander asked, those Isaac's now tight nut sack and drooling dong said yes even better than his lips, though the best reply of all were the ropes of cum that soon shot out of his cock and landed on that sexy, dark treasure trail. In a flash, Alexander pulled out, degloved and fired off his own load, the first blast hitting his shoulder and rest covering his belly. We learned something today When it cums to cases like this, can 'flipping out' be a good thing? Survey says...fucking yes!",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 28463
    },
    {
      "name": "Isaac Hardy",
      "person_id": 31341
    }
  ],
  "release_date": "2013-05-10",
  "scene_id": 59290,
  "series": "The Survey",
  "tags": [],
  "title": "The Survey"
}