{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men presents Joe Parker and Ricky Larkin in HARD HAIRY & HORNY.  Joe and Ricky are embraced in a hot and heavy make-out session wearing nothing but their jock-straps as the scene opens.  Both are groping each other's hard bodies as their cocks strain to be released from their jocks.  Soon both hard cocks are out and both are stroking each other as their tongues explore each other's mouth.  Ricky Larkin stands up to feed Joe his thick cock and Joe waists no time in doing his best to deep throat all of Ricky's hard cock.  As Joe sucks his cock, he runs his hands through Ricky's furry chest and plays with his nipples.  Joe's cock is hard as a rock as he sucks Ricky and noticing this Ricky pushes Joe onto his back and he works his way down to Joe's massive cock where he works his tongue all over the shaft before sucking it deep down his throat.  Ricky goes back and forth from Joe's cock to his balls and he even sucks on the hair on Joe's nut sack.  He then flips Joe's legs over his head and begins licking Joe's eager ass with gusto.  As Ricky works his tongue all over Joe's ass, you can hear Joe moaning in pleasure.  The two then find themselves in a very hot 69 devouring each other's cocks.  Ricky finds his way back to Joe's ass where he gets it all wet and ready for his large hard cock.  As Ricky drives his cock deep into Joe's ass, you can tell Joe loves every moment as his cock is throbbing with every stroke of Ricky's cock.  Ricky pounds Joe long and hard for a while on his back and then flips him to his side before Joe decides to climb on top of Ricky and ride his cock.  As Joe rides Ricky's cock, Ricky sees the pre-cum oozing out of Joe's cock and says 'let me taste that cock' and he begins licking the head of Joe's cock as he continues to fuck him.  Ricky then grabs Joe's cock and starts stroking him as he drives his cock deeper up Joe's ass.  Joe cannot hold back any longer and Ricky strokes out a nice big load of cum from Joe's cock all over his hairy chest.  Joe then works over Ricky's nipples and plays with his balls as Ricky strokes off a nice thick creamy load of cum.  Exhausted, the two kiss each other deeply as they relish in the hot sex they have just shared.  Enjoy!",
  "models": [
    {
      "name": "Joe Parker",
      "person_id": 28044
    },
    {
      "name": "Ricky Larkin",
      "person_id": 28464
    }
  ],
  "release_date": "2013-08-13",
  "scene_id": 59318,
  "series": "Joe Parker And Ricky Larkin",
  "tags": [],
  "title": "HARD HAIRY AND HORNY"
}