{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Dylan Knight slowly rubs his stomach as he lay back on his bed, lifting his shirt to expose his chest as he runs his hands down his body, playing with the hairs on his stomach as he surveys the room. Damien sits on the other side of the room, reclined on a red easy chair, his legs spread as he works his hands down into his pants, his eyes fixed on Dylan as his urges grow. Dylan makes his way across the room, and the guys are united on the chair, as Damien kisses Dylan's neck and then works his way down Dylan's body, pulling out his cock and working it with his tongue, as Dylan fantasizes about what he'll do once he gets Damien's shorts off. Minutes later, fantasy becomes reality, as Dylan, fully hard, switches places with Damien and sucks him off, before flipping him over and spreading his ass wide open for a good tonguing. Damien closes his eyes and enjoys it as Dylan moistens him up for the plunge, finally relenting, but only long enough to replace his tongue with his firm cock. Sliding it in, Dylan pumps back and forth, as Damien clutches the armrest of the chair, trying to brace himself against the ecstatic pressure of Damien's thrusts. Moving over to his side, Damien strokes his cock as Dylan thrusts back and forth, and the rhythmic pounding sends Damien off the deep end, causing him to explode his load all over himself and the chair, as Dylan pulls out and then blasts him with a super nut of his own.Enjoy!",
  "models": [
    {
      "name": "Damien B",
      "person_id": 31578
    },
    {
      "name": "Dylan Knight",
      "person_id": 31577
    }
  ],
  "release_date": "2013-08-15",
  "scene_id": 59363,
  "series": "NDB - 4458 - Dylan Knight & Damien",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink",
    "Uncut cock"
  ],
  "title": "Room for Two"
}