{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Poor Austin Storm! Freshly dumped by his girl and heartbroken, he's been sulking more than usual lately. Lucky for him he's got friends like Brandon Bronco, who is just the sort of buddy to take a personal interest in his friend's state of mind. Brandon brings Austin up to another friend's house for a Bro filled weekend with just the guys. Gonna drink some brews, ride the ATV a little, maybe play in the mud, whatever strikes their fancy. Liam Magnuson, Christian Cayden and Corbin West are already up at the house, prepping wood for the cookout and they have the keg already on ice. With a twist and a splash, Christian taps the keg and the party is underway, as the guys lift their guest of honor for some inaugural keg stands, and Brandon notices Austin's bulge in his jeans. After riding on the ATV for a while, then cooling off with the hose, the guys get in a little wrestling in the mud pit, then shower off as the afternoon sun starts to peak. A little tired and a whole lot of horny, the guys file back to the keg and before he knows what's going on, Austin finds himself naked surrounded by his friends, stripped and doused with beer, as Liam runs the tap down his spine and laps up the suds while tonguing Austin's hole. Corbin begins to suck him off from the front, while Christian and Brandon begin to remove their clothes. Making their way over to a clearing, Liam pumps Christian from behind as Austin watches, noting the absolute pleasure contained on Christian's face. Deciding that he wants some of that, Austin and Christian switch places, and Liam's magic cock takes a turn pounding Austin, while Christian backs up onto Brandon's 9' dick, while Corbin splits the difference between both parties. But Brandon has a special interest in Austin, and so before he climaxes, the guys switch once again, lifting Austin up and lowering him onto his best bud, as Brandon thrusts and fucks up into Austin, and Austin moans in disbelief at what he's been missing all this time. As the guys circle around Austin and then, one by one, shower him with cum, Austin forgets all about his girl and learns the true meaning of the phrase, 'Bros before Hos.'Enjoy!",
  "models": [
    {
      "name": "Austin Storm",
      "person_id": 31631
    },
    {
      "name": "Brandon Bronco",
      "person_id": 31339
    },
    {
      "name": "Christian Cayden",
      "person_id": 31546
    },
    {
      "name": "Corbin West",
      "person_id": 31632
    },
    {
      "name": "Liam Magnuson",
      "person_id": 31305
    }
  ],
  "release_date": "2013-08-29",
  "scene_id": 59364,
  "series": "NDB - 4460 - Gimme Five",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Blonde",
    "Brunette",
    "Facial Hair",
    "Fraternity",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Orgy",
    "Outdoor",
    "Tattoo/Piercing"
  ],
  "title": "Gimme Five"
}