{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Johnny Torque is minding his business in the bathroom stall, contemplating what to do with his afternoon when all of a sudden he hears the footsteps of someone approaching. Slate Steele is no stranger to the routine, and he spies through the glory hole to see if the stall is occupied. Seeing Johnny's cock getting hard through the hole, Slate drops to his knees to get a better look. Johnny can feel Slate watching him, and the thought of a stranger eyeing him turns Johnny on, so as his cock grows in his hand, he decides to do something about it, standing up to shove his cock through the hole where Slate is waiting with his mouth wide open. Slate nibbles on Johnny's head as Johnny emits a soft groan of pleasure, which turns to a full on ecstatic gasp as Slate deep-throats the full shaft of Johnny's member. Johnny comes out of the stall and they meet face to face. Not at all displeased to meet this new stranger, Johnny drops to his knees and returns the favor as Slate leans back against the stall. Slate's cock grows and gets rock hard, but it's his ass that is really in need of service, and sensing this, Johnny bends him up against the stall and enters from behind, as Slate closes his eyes and eases it in. Johnny grabs Slate by his shoulders and begins to pound relentlessly as his balls slap up against Slate, and he soon pushes Slate onto the ground, continuing to thrust and pump as Slate strokes his load all over the floor, before Johnny pulls out and blasts him with a load of his own.Enjoy!",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Slate Steele",
      "person_id": 27718
    }
  ],
  "release_date": "2013-09-05",
  "scene_id": 59466,
  "series": "NDB - 4461 - Johnny Torque & Slate Steele",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "Glory Hole",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Hole End Theory"
}