{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men is pleased to present Hunter Vance & Jake Jennings in SOUNDING IT OUT.  Jake is alone in bed and playing with his new sounding rod.  He slowly inserts the metal rod all the way down his shaft as he strokes his uncut thick cock up and down.  He manipulates the sounding rod for maximum pleasure just as Hunter enters the room.  Hunter is a bit shocked at first by what he sees, but shock soon turns into fascination as Jake helps guide his hand so he too can push the rod in and out.  With a little nervous laughter it is obvious that this is turning Hunter on and he soon pulls out his cock and Jake is soon deep throating it as it grows inside his mouth.  Hunter then starts sucking Jake's thick cock and the two share a nice hot 69 for a while.  Jake then throws Hunter's legs over his head and buries his tongue deep in Hunter's ass and you can tell Hunter loves every moment of it as he moans with gusto.  Jake then flips Hunter over and puts him on all fours on the bed as he continues to eat his ass and get it nice and wet for his fat cock.  He slowly puts the huge head of his cock into Hunter's tight ass and then begins a nice slow steady fuck.  Sensing that Hunter is ready for more, Jake increases the speed and he is soon fucking Hunter deep and hard.  Hunter loves every moment of it and grunts in delight with every thrust of Jake's cock.  Jake then has Hunter on his side and then his back as he drives his cock deeper and deeper inside Hunter's gorgeous hole.  He then pulls out and shoots perhaps one of the biggest cum explosions our cameras have ever seen.  It just continues to spray and spray and the first shot goes directly into Hunter's mouth.  Jake then licks his cum off Hunter and kisses him before asking him to shoot his load all over his face.  Hunter strokes off a huge load of his own which coats Jake's face and the two, exhausted, embrace in a deep kiss.  Enjoy!",
  "models": [
    {
      "name": "Hunter Vance",
      "person_id": 28320
    },
    {
      "name": "Jake Jennings",
      "person_id": 31734
    }
  ],
  "release_date": "2013-08-27",
  "scene_id": 59563,
  "series": "Hunter Vance And Jake Jennings",
  "tags": [],
  "title": "SOUNDING IT OUT"
}