{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Fresh from their instructive class, Austin Storm, Dante Martin and Jaxon Colt are eager to put what they've learned to practice. Jaxon is a little unsure, but Austin and Dante are very studious when it comes to this sort of thing. Dante runs through his instructor's check list, and Jaxon disappears into the restroom to douche while Austin and Dante move on to some advanced techniques, disrobing each other and beginning to grope at each other. Interrupted by Jaxon coming out of the stall, Austin and Dante shift their focus to Jaxon's instruction. Sitting him on a chair, they both finish undressing, their cocks now at perfect chin level for Jaxon to 'double major'. With a dick in each hand, Jaxon pulls them closer and begins to nibble on the head of each, mashing the heads together and tonguing them with a teasing hesitancy. Dante grabs the lube and bends Jaxon over the table, moistening him up as Austin grabs a dildo off the desk and begins to work it in. Jaxon moans from the penetration as Austin rams him with the dildo, but Jaxon, now adjusted and more comfortable, wants the real thing. So Austin and Dante flip him over on top of the desk and take turns pumping him full of hot hard cock. Dante pounds him as Austin slaps his cock against Jaxon's chest, then they all move down to the floor as Austin takes his turn, before both guys shower Jaxon with a bucketful of cum that coats Jaxon's face and sends him rushing with new found excitement, causing him to spray his own load all over his stomach. Teacher would be so proud!</br></br>Enjoy!",
  "models": [
    {
      "name": "Austin Storm",
      "person_id": 31631
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Jaxon Colt",
      "person_id": 27717
    }
  ],
  "release_date": "2013-09-12",
  "scene_id": 59860,
  "series": "NDB - 4462 - Bottoming 101",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Toys"
  ],
  "title": "Bottoming 101"
}