{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men is pleased to present Logan Vaughn and Zeb Atlas in WORSHIPING ZEB.  Logan has been working very hard on his physique, but he wants to get bigger and he decides to check out Zeb Atlas's gym to train with the best.  When he enters the locker room, he finds Zeb waiting for him.  Logan admits he is excited, but you can tell it is a nervous excitement as to what might be happening.  Zeb flexes his massive muscles and encourages Logan to feel them so he can get a sense of what he can achieve.  Logan wastes no time in worshiping Zeb's entire body as he flexes and poses.  From the biceps, triceps and lats, Logan lets his hands and tongue explore the huge body of Zeb.  Soon Zeb is in his briefs as he bends over and has Logan eat his ass through his underwear and then he lowers them to allow Logan and his tongue inside his beefy ass.  Logan goes to town on Zeb's ass and then Zeb turns around and feeds him his thick 8' cock and Logan does his best to take the entire thing down his throat.  Zeb pulls him up and envelopes him in a massive bear hug as the two rub their worked out physiques all over each other.  Zeb then tells Logan to bend over as he drives his hard cock deep inside Logan's hairy ass.  Logan loves every inch of Zeb's giant cock and with every thrust he groans with pleasure.  Zeb then lies down on the bench and has Logan climb on top and ride his cock for a while.  Zeb then bends him back over, grabs both of Logan's arms and uses him like a pin cushion as he pounds Logan's succulent ass until he cannot hold back any longer and shoots a nice thick load of cum all over Logan's ass and back.  He then embraces Logan as he strokes out a nice big load of cum all over the locker room bench.  Sweaty and sticky from the hot sex, both get in the shower where Logan continues to take care of Zeb's massive body as he washes him off.  Enjoy!",
  "models": [
    {
      "name": "Logan Vaughn",
      "person_id": 28501
    },
    {
      "name": "Zeb Atlas",
      "person_id": 31851
    }
  ],
  "release_date": "2013-09-24",
  "scene_id": 60005,
  "series": "Logan Vaughn And Zeb Atlas",
  "tags": [],
  "title": "WORSHIPING ZEB"
}