{
  "collections": [
    "Next Door Twink"
  ],
  "description": "It's another hard day on patrol for Officer Oli Gold.  He's a very by-the-book young cop who's aiming to impress and make a name for himself on the street.  The only problem is the beat he's been assigned.  It couldn't be a more demeaning assignment.  The Chief has ordered Oli to keep an eye on his nephews, Andy Taylor and Alexx Thomas, while they're visiting.Oh well...at least Oli gets to relax in a nice, air conditioned bedroom while the Chief's nephews frolic and play.  Even though Oli, fresh out of the Academy, is about the same age as Alexx and Andy, he's not letting them get the better of him.  When the nephews begin roughhousing a little too hard, Oli intervenes, threatening to use his nightstick.  But the boys just laugh!  The fun turns out to be contagious.  Oli can't help but join in, wrestling and pillow fighting.  Before Oli realizes exactly what's going on, all three boys have lost their shirts and pants!  Oh well, it's all in the spirit of playfulness.  And...oh my goodness!  Now they're rubbing each other's dicks!  Wow, the Chief's nephews sure do have fat cocks.  Oli figures it wouldn't be TOO far outside the rules if he let Andy suck his hard boner while Alexx services Andy.  And as long as that's cool, Oli's willing to share Andy's fat dick with Alexx for a double-suck session.  And why not let Andy lick Alexx's sweet hole for a bit while Alexx slurps Oli's knob some more?  And as long as Alexx is having horny Andy fuck his tender ass, Oli should get some of the action.  Watch Officer Gold get banged nice and hard on his very first day on the job.  Welcome to the Force!   Enjoy!",
  "models": [
    {
      "name": "Andy Taylor",
      "person_id": 31860
    },
    {
      "name": "Oli Gold",
      "person_id": 31861
    },
    {
      "name": "Alexx Thomas",
      "person_id": 31862
    }
  ],
  "release_date": "2013-09-24",
  "scene_id": 60011,
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Brunette",
    "Condom",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Twink",
    "Uncut cock",
    "Uniform"
  ],
  "title": "Penal Code 3"
}