{
  "collections": [
    "Cody Cummings"
  ],
  "description": "His mind was like an empty swimming pool that afternoon.  He knew if he could find a source from which to fill it, a new world of wonderful sensations would open up.  But until he did, Anderson Lovell would lay in bed, filling the emptiness with sexual fantasies about the one for whom he'd lusted for so long: Cody Cummings.Although it felt good to rub his hard dick and imagine, Anderson wanted to go much deeper.  He had heard stories where Zen masters had learned to trick their own brains into believing fantasy bad become reality.  Anderson knew if he could harness whatever ancient technique these old sages used, he could manifest Cody to appear right there with him, seeming as real as the pillows upon which he rested his delicate head, covered in tousled, auburn hair.  He felt like getting up for moment to see if the overcast sky had allowed any light to peek through.  When he looked out toward the garden, plain as day, he saw a man standing nude, apart from his white sneakers, with his back to Anderson.  Of course the sight was unexpected, but Anderson was not alarmed at all.  As he looked, the man slowly turned.  It was him.  It was Cody Cummings, naked in Anderson's garden.  Was he dreaming?  How could it be?  Anderson opened the door and walked outside to where he had seen what he thought must be a living dream.  He lost sight of the image for a moment, then saw him again, standing a bit further up the hill.  As he headed toward Cody this time, Anderson felt suddenly tired and slightly dizzy.  He stopped to gain his composure but as he did, he felt strong hands touch his back and warm breath on his neck.  He knew it must be real, it must really be Cody, here in the garden with him.  Anderson realized his eyes were shut.  The moment he opened them, it was if he had roused from a dream.  He was alone again.  Confused and a bit disoriented, he walked with racing thoughts back to his room and laid on the bed.  Moments later the image of Cody appeared again, this time walking into Anderson's room, toward him on the bed.  Anderson didn't move.  He let this Cody come to him and touch him.  This still nude Cody bent down and sensuously kissed Anderson's neck.  The next half hour or so seemed to float by in only a matter of brief moments, but Anderson remembered everything.  He remembered the way Cody's hard cock felt sliding between his lips, going deep, all the way to the back of his mouth.  He remembered the way Cody's warm hand felt as it tucked it's way under the elastic of Anderson's underwear and gripped his throbbing erection.  He still knew the melting-sensation he had as Cody jerked his boner.  He could still taste the sweet flavor of Cody's inviting lips.  But had it really happened?  Or had Anderson found a way to erase the very line between fantasy and reality?        Enjoy!",
  "models": [
    {
      "name": "Anderson Lovell",
      "person_id": 26648
    },
    {
      "name": "Cody Cummings",
      "person_id": 6195
    }
  ],
  "release_date": "2013-09-25",
  "scene_id": 60050,
  "series": "CC - 6323 - Cody Cummings & Anderson Lovell",
  "tags": [
    "Ass Play",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Feet",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Living Dream"
}