{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For these guys, it's not whether you win or lose, it's how you run the race! That's because winning has its privileges but losing has its advantages as well. Just ask Christian Cayden. Sure, he runs this 'race to the bottom' with an heir of competitive interest, but it is pretty obvious he's done everything he can to ensure his team will not be on top. Partner Slate Steele likewise does not seem too upset at the hands of defeat, most likely because he's been trying to get his hands on Dante Martin since the guys took their opening warm up laps. And now that things have been settled, it seems that all concerned have gotten what they deserve. Brandon escorts Christian over to an opening and proceeds to bend him over and fill him full of hard cock as Dante watches them, leaning back while Slate pounds his ass back into him over and over again. Dante takes Slate around back and they find a shady spot on the course to continue, as Christian backs his ass up against Brandon's stomach so he can feel every inch of Brandon's massive cock inside him. Reconvening for the final leg of this relay, all four guys gather at the mouth of the slide in a cum-flying frenzy befitting such a wild event, with Brandon and Dante sharing a moment of victory together before Christian, cum-covered face and all, offers rather sheepishly, 'Anyone for a rematch?'Enjoy!",
  "models": [
    {
      "name": "Slate Steele",
      "person_id": 27718
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Brandon Bronco",
      "person_id": 31339
    },
    {
      "name": "Christian Cayden",
      "person_id": 31546
    }
  ],
  "release_date": "2013-10-03",
  "scene_id": 60158,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Condom",
    "Cum swallow",
    "Facial Hair",
    "Fraternity",
    "Hardcore",
    "Oral",
    "Orgy",
    "Outdoor",
    "Tattoo/Piercing"
  ],
  "title": "The Naked Challenge"
}