{
  "collections": [
    "High Performance Men"
  ],
  "description": "HighPerformanceMen.com brings back fan favorite Drake Jaden and introduces Isaac Hardy to the site in the fourth installment of the Retro Sex series called GRITTY FUCKERS.  The scene opens in a warehouse where we find Drake and Isaac undressing each other with their eyes as their cocks strain to be released from their jeans.  They pull out their cocks and stroke for each other before coming together in an intense kiss.  Their clothes come off pretty quick and Drake wastes no time in deep throating all 8.5 inches if Isaac's beautiful cock.  As he chokes and gags on the massive cock, Isaac continues to spit down on his own cock and into Drake's mouth.  Isaac then takes his cock and starts fucking Drake's armpit as Drake laps at the head of the cock with each thrust.  They then get down on the floor and go to town on each other's cocks in a very dirty 69 with lots of choking and spitting.  Isaac continues to suck Drake's cock as he leads him over to the ladder and turns him around and buries his tongue deep into Drake's needy hole.  As Drake begs for more, Isaac continues to eat his ass with gusto.  Soon, Isaac is thrusting his huge cock deep in Drake's perfect hole and the two fuck hard and deep.  Isaac then sits down on a crate as Drake lowers himself down on his cock and rides it long and deep.  Needing a break for his legs, Drake climbs off and bends Isaac over and begins eating his ass and spanking it, all to the delight of Isaac.  After getting the cherry ass all wet, Drake drives his huge cock deep inside Isaac's hairy ass and fucks him fast and hard.  He then flips Isaac over onto his back and continues to fuck him until he cannot hold back any longer and he pulls out and shoots his load all over Isaac's chest.  He then laps up all his cum with his tongue and the two then do some hot cum swapping in a deep kiss.  Isaac then is ready to blow his load and Drake goes down between his legs and lets Isaac shoot all over his bald head.  Isaac then laps up his own cum off Drake's head and shares it with some hot snowballing.  Enjoy!",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Isaac Hardy",
      "person_id": 31341
    }
  ],
  "release_date": "2013-10-08",
  "scene_id": 60284,
  "tags": [],
  "title": "RETRO SEX EPISODE 4: GRITTY FUCKERS"
}