{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Sometimes sex is spooky. Deep in a dream state, big daddy Jake Deckard is haunted by desire. And desire finds him, crawls into bed with him, and wakes him with a start. In this case his desire is Logan McCree and he's hungry for some loving. When Logan's advances are not returned, he takes what he wants. Licking Jake's pits, chewing his nipples, and seducing him, Logan is such an otherworldly stunning beauty that it doesn't take much to convince muscle beast Jake to see things Logan's way. The deep affection between these two shines and glints. First Logan fucks Jake's throat with his huge tattooed piece. Jake is quite a cocksucker and takes the intense throat fuck with rapture. Jake then moves onto Logan's sweet fleshy asshole. He sucks and licks on it like he wishes he could turn Logan inside out or crawl inside of him. As they move into a solid round of 69 dick sucking, Logan's amazing body of art is shown fully. You can tell it was methodically planned and executed. Jake moves onto fucking his pretty ass. For those of you who think real sexual passion between men is missing in porn, you shouldn't miss this. The spark is clear and the heat is intense. Especially when these two flip. Logan drives his cock into Jake with fiery abandon. Jake is more than up to this pile-drive and howls in hunger and torment. Jake delivers one more solid fuck to our tatted intruder and pumps the jizz out of his swollen pecker. Shot with the romance and fervor reminiscent of old horror films and Edgar Allan Poe, this is hardcore fucking in satin sheets. Beauty and Fear. Logan's incredible performance as a manly vampire makes this a scene you will not forget!",
  "models": [
    {
      "name": "Jake Deckard",
      "person_id": 19577
    },
    {
      "name": "Logan McCree",
      "person_id": 19752
    }
  ],
  "release_date": "2010-01-01",
  "scene_id": 60409,
  "tags": [
    "Anal",
    "Boots",
    "Hairy",
    "Oral",
    "Tattoos",
    "butt play",
    "cum shots",
    "rimming",
    "sixty nine",
    "spitting"
  ],
  "title": "Ink Storm, Scene #04"
}