{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "WARNING!  All park goers be aware of 'cruisers.' Reports have come in regarding two men, initiating contact with individuals in the park, and escalating the nature of the exchange to be sexual.  So far, reports have only come from well built, sexy men.  The most concerning account has come from a man named Damian Brooks.  He's named these 'park cruisers' as Jay Black and Jordano Santoro.  The following is a description of the affair: On a warm afternoon, Brooks was approached by Black and Santoro.  The two had lust in their eyes.  Brooks offered information that revealed he lived close to the park.  The three men walked to Brooks's residence where they engaged in passionate kissing in the elevator on the way to the apartment.  Once inside, Damian sucked the other men's erect cocks.  Santoro subsequently licked Brooks's asshole, then slid his fat dick in and pounded Brooks's tight, warm pocket.  Black indeed face fucked Brooks during this time.  Santoro and Black switched sides and continued the banging.  Eventually, Brooks rode Santoro's stiff meat pole while simultaneously enjoying a good oral cock invasion from Black.  These events culminated into incidents that were described as 'explosive.'  This is the current extent of known details.  Please watch the attached film for more information. Enjoy!",
  "models": [
    {
      "name": "Damian Brooks",
      "person_id": 31593
    },
    {
      "name": "Jay Black",
      "person_id": 30932
    },
    {
      "name": "Jordano Santoro",
      "person_id": 21259
    }
  ],
  "release_date": "2013-10-18",
  "scene_id": 60515,
  "series": "NDE - E130 - Jay Black, Damian Brooks & Jordano Santoro",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Black",
    "Dark Hair",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Latino",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Park Cruisers"
}