{
  "collections": [
    "Raging Stallion"
  ],
  "description": "Sexbombs Rik Jammer, bald and achingly hot, and Jeff Allen, hairy and hunky to the hilt, are tied up and flogged. None of that light whipping, they are each pummeled by a whip, reddened and welted to freaky color and size. Rik is a screamer so intense that I'm sure the neighbors wondered what kind of South American prison had invaded their neighborhood. Once the two are appropriately taken care of, ever-sexy Robert Black, armbands showing how big his arms are, enters the action. He brings the pleasure after the pain, kissing the two men and then the boys, with their hands tied behind their backs, blow Robert. It's not a sharing thing, but a greedy pull for dominance, with Robert the lucky recipient. After a lusty three-way kiss, Robert gets all the fucking chores. As Rik and Jeff snarl and rage throughout the rest of the scene, it's quiet unassuming Robert who will steal it. Robert's first lucky victim is Rik. He takes him on his side and then doggy-style. Robert works up some great steam and then he and Rik literally wrestle Jeff to the floor. Rik sits on his face to get an angry not-fair rim from Jeff while Robert takes over his butt. Jeff is an animal tamed by not only the fuck, but by the big drools of spit Rik drops into his mouth so sexily. Rik then teases Jeff by kissing Robert inches away from Jeff, so he doesn't forget to return to Jeff now and then to calm him down. The fucking takes on a very interesting spin when Jeff literally picks up Rik, deposits him on Robert's cock and forces the ride. Very hot. With energy and nastiness that's off the charts. Jeff and Rik switch places again, Jeff's Prince Albert swinging in time to the pound he's inflicting on himself. Rik is then places on his head for Robert, backwards, to sink a fuck into him. This is especially interesting considering Robert's cock curves the opposite way, so Rik must be in heaven. Jeff and Rik cum on Robert's chest and then each man holds one of Robert's legs, bend him upside down until he cums right into his own mouth.",
  "models": [
    {
      "name": "Jeff Allen",
      "person_id": 19819
    },
    {
      "name": "Rik Jammer",
      "person_id": 19841
    },
    {
      "name": "Robert Black",
      "person_id": 21710
    }
  ],
  "release_date": "2010-01-01",
  "scene_id": 60570,
  "series": "SexPack #09 - Fire In The Hole",
  "tags": [
    "Anal",
    "Boots",
    "GroupSex / Orgies",
    "Hairy",
    "Leather",
    "Oral",
    "Tattoos",
    "bondage",
    "jockstraps",
    "masturbation"
  ],
  "title": "SexPack #09 - Fire In The Hole"
}