{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "This hot three-way encounter has been a long time coming!  The sexual tension is palpable among these lean, chiseled dudes who casually, kinda know each other from the gym.  Luke Adams is a former trainer at this place.  He's super hot and always very horny.  Brandon Bronco is what one might call a 'gym rat.' He likes hitting the bag, goofing off a little bit, but maintaining his incredible bod.  Dylan likes the attention he gets from guys while working out.  He's seen both Luke and Brandon checking him out before.  They've briefly each been introduced to one another, but today they're taking it to the next level, right on the weight room floor!When Dylan realizes the tension is at a snapping point, he goes to his locker, removes his shirt and drops his shorts.  Before he can even turn around, Luke and Brandon have sidled up next to him and are getting super friendly!  Squeezing Dylan's soft ass, Brandon moves in and plants a hot smooch.  Luke joins and three are making out passionately.  Dylan takes advantage of the opportunity  right away and gets both hard cocks in his mouth.  Wow, Dylan knows how to manage a couple nice fatties quite well!  Luke and Brandon can't believe how good it feels.  Just look at their faces!  Luke wants a taste of Dylan's meat, so he takes his fat, swollen dick in his mouth.  Then Brandon helps position Dylan on top of Luke for a nice ride.  After bouncing on Luke's hulking erection for a while, Brandon bends Dylan over and slides his massive dong into his warm pocket.  Luke sucks again, while Brandon fucks.  Check out his firing hot, three-way, weight room blast!  Enjoy!",
  "models": [
    {
      "name": "Brandon Bronco",
      "person_id": 31339
    },
    {
      "name": "Dylan Knight",
      "person_id": 31577
    },
    {
      "name": "Luke Adams",
      "person_id": 31698
    }
  ],
  "release_date": "2013-11-07",
  "scene_id": 60917,
  "series": "NDB - 4470 - Luke Adams, Brandon Bronco & Dylan Knight",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Cum swallow",
    "Facial",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Workout Buddies"
}