{
  "collections": [
    "Next Door Twink"
  ],
  "description": "It's another day in after-school detention for Tyler Morgan.  But for goodie two-shoes, Alex Love, it's a shameful, traumatic experience.  Alex's mom already told him that if he doesn't use the time in detention to finish his math homework, he's in big trouble.  Tyler knows Alex has never been punished at school before.  In fact, Alex has a reputation for being the teacher's pet.  Tyler's decided to make good use of his time today too...by trying to hook up with Alex! <br/><br/>Tyler's the type of guy that never gives up after an initial rejection.  Even though Alex fends off his first advances with scowling dirty looks, Tyler doesn't let up.  He knows the key here will be making Alex laugh.  Sure enough, when he goes to the front of the room and tries on the teacher's glasses, Alex chuckles.  Tyler turns up the sexiness by lifting his shirt up and showing his midriff.  Alex can't help but pop a minor chubby.  Tyler removes his shirt completely and invites Alex to join him at the front of the classroom for some sensual fun.  Alex does and Tyler can't get Alex's sweet cock in his mouth fast enough.  Alex can't believe this is happening!  The hottest guy in school, sucking his cock in detention!  Is he dreaming??  Then something so epic and crazy happens, you won't believe your eyes.  Right there, on the teacher's desk, Tyler lets Alex fuck him!  Alex is blown away by how good Tyler's tight hole feels on his swollen dick.  Pounding that tender, class clown ass definitely makes getting in trouble worth it! <br/><br/>Enjoy!",
  "models": [
    {
      "name": "Alex Love",
      "person_id": 32108
    },
    {
      "name": "Tyler Morgan",
      "person_id": 31264
    }
  ],
  "release_date": "2013-11-05",
  "scene_id": 60950,
  "series": "NDT - 8205 - Alex Love & Tyler Morgan",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Twink",
    "Uncut cock"
  ],
  "title": "Detention Suxx!"
}