{
  "collections": [
    "High Performance Men"
  ],
  "description": "HighPerformanceMen.com is very happy to bring Alex Adams and Jake Jennings together in this highly charged sexual romp in our photography studio.  We were contacted by a popular regional gay magazine and asked to shoot Alex and Jake wearing 'sporty clothing' for a cover shoot. From the moment these two got in front of Gio Caruso's camera, it was apparent that there was some hot chemistry between them.  So, with very little persuasion, these two jumped at the chance to film with each other and almost before our camera was rolling they were embraced in a deep kiss.  Jake wastes no time in getting Alex out of his shirt revealing his muscular body as he works his way down and lowers his shorts.  He works his tongue all over Alex's jock-strap and soon we see the head of Alex's huge cock throbbing and straining to be released.  Jake pulls out his cock and soon has it buried down his throat as he gives Alex one hell of a blow job.  Alex then pulls Jake up and gets him out of his uniform and starts out sucking Jake's hairy nipples as he works his way down to Jake's fat cock.  He sucks Jake deep down his throat before ordering Jake to eat his ass.  With Alex bent over a bench, Jake buries his tongue deep inside Alex's eager ass.  Alex then puts Jake on his back and returns the favor by driving his tongue deep inside Jake's hairy ass.  Alternating between his tongue and fingers, he gets Jake all wet and opened up for his massive cock.  He pulls Jake up, bends him over, and drives his hard cock deep inside as Jake moans in pleasure.  He starts out slow at first and once Jake tells him to fuck him harder, he begins pounding Jake's hole harder and faster.  He then flips Jake onto his back and continues driving his cock harder and harder into Jake's eager hole.  While fucking, he grabs Jake's sock-covered foot and smells and licks his foot which seems to turn him on even more. Jake cannot hold back any longer and shoots a nice load all over his hairy stomach.  Alex is so turned on that he pulls out and also shoots a nice thick load over Jake's hairy body.  This is what we call a great COVER SHOOT!  Enjoy!",
  "models": [
    {
      "name": "Alex Adams",
      "person_id": 28090
    },
    {
      "name": "Jake Jennings",
      "person_id": 31734
    }
  ],
  "release_date": "2013-11-05",
  "scene_id": 60969,
  "series": "Alex Adams And Jake Jennings",
  "tags": [],
  "title": "COVER SHOOT"
}