{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "It's time for a party, and all the guys are dressed down for the event. Throwing it back to a time when things were wilder & crazier, this party doesn't stop til everyone has gotten what they want! The good times are here again, and the guys are ready for whatever goes down. As they get into the mood and step out of their inhibitions, some cope better than others. For Kayden Hurley, Taylor Wolf and Gabriel Cross, the party is just beginning. Kayden and Gabriel enter to find Taylor on the bed, trying to rest up from his party activities. With dicks out and libido's raging, they decide to undress Taylor and have a little fun with him. He doesn't resist, and once undressed, Gabriel spits in his crack and fingers his exposed butthole as Taylor lays ass up in the air. Kayden watches Gabriel slip his cock inside Taylor, and he follows suit, jamming his dick into Taylor's mouth as Gabriel continues to pound away, until they switch positions and do it all over again. Taylor reflects more and more that he kind of likes it a lot. That suspicion is confirmed when Gabriel and Kayden blow their loads all over him, and the act gets him so hot he jacks off to the thought of it once the guys have left the room. For Gabriel and Kayden, it was a pretty cool party, but for Taylor, it's a party he'll never forget.</br></br>Enjoy!",
  "models": [
    {
      "name": "Gabriel Cross",
      "person_id": 32093
    },
    {
      "name": "Kayden Hurley",
      "person_id": 32012
    },
    {
      "name": "Taylor Wolf",
      "person_id": 32094
    }
  ],
  "release_date": "2013-10-31",
  "scene_id": 60966,
  "series": "NDB - 4469 - Retro Party",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Dark Hair",
    "Deep throat",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "Retro Party"
}