{
  "collections": [
    "High Performance Men"
  ],
  "description": "High Performance Men presents Ray Han & Steven Ponce in MISTER SOCIAL MEDIA HOOKUP.  Steven is in his office when he gets a message on his MISTER AP from Ray Han.  They chat back and forth, share naked photos and discuss what they are into.  Discovering they are both versatile, they begin to make plans for a hookup when Steven gets out of work.  Ray lets Steven know he is not into Bareback and to Steven's delight, he is also into safe play only and the two move forward with their plans.  Steven shows up, still wearing his full suit, and Ray cannot keep his hands off him as they embrace, kiss and Ray started undressing Steven.  With Steven's cock out of his suit pants, Steven asks Ray to undress for him while he strokes his own cock.  Ray, very seductively, takes off his clothes for Steven and as he bends down to take off his pants, Steven cannot help himself as he gives Ray's ass a lick.  Ray then goes down on Steven's hard cock and takes it to the hilt.  He then lies back on his bed and asks Steven to undress for him while he strokes his big 8.5' uncut cock.  Once undressed, Steven then blows Ray and takes his massive cock all the way down his throat.  He then pulls Ray up on the bed as he buries his tongue deep inside Ray's eager hole.  After getting the hole loosened up, Steven grabs a condom, puts it on and fucks Ray doggie style while Ray moans in pleasure.  After being fucked for a while Steven tells Ray he wants him to fuck him.  Without much hesitation, he grabs a condom and soon has Steven on all fours as he drives his big cock deep inside Steven's eager ass.  He fucks Steven long and hard and then flips him onto his back where he pounds him so deep that Steven cannot hold back and he shoots a nice creamy load of cum all over his hairy stomach and chest.  Ray pulls out and shoots a nice load onto Stevens cock and balls.  Exhausted, the two embrace in a deep kiss.  Enjoy!",
  "models": [
    {
      "name": "Steven Ponce",
      "person_id": 27969
    },
    {
      "name": "Ray Han",
      "person_id": 32580
    }
  ],
  "release_date": "2013-11-26",
  "scene_id": 61189,
  "series": "Ray Han And Steven Ponce ",
  "tags": [],
  "title": "SOCIAL MEDIA HOOKUP"
}