{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Elliot Vance has a taste for exotic sex.  But there are a few kinky things he hasn't had a chance to try.  Through a friend in his World Geography class, he's recently made an appointment to meet with a stranger who also would like to engage in some less-than-conventional activities.  The stranger just happens to be cute Twink boy, Jacob Wolf.Both Elliot and Jacob are a little nervous.  Jacob's done a few things with whips before, but taking a look at what Elliot has laid out for them to use on each other, Jacob is a bit reticent.  Elliot chooses to use a cat 'o' nine tails to start things.  Jacob likes the feel of the leather on his bare skin, and can just barely tolerate the sting each time Elliot snaps the whip on his ass and thighs.  When it's Jacob's turn to pick from the sexy table, he goes with a classic, leather paddle.  He's taking his time, letting the paddle tickle Elliot at first, then SMACK him good.  But Jacob isn't only about slapping, he's also here to enjoy Elliot's cock.  To ease the stinging from the leather, Jacob takes Elliot's pulsating erection into his eager mouth.  It's so big and hard, Jacob can barely believe it.  Then Elliot give Jacob a nice sucking.  Jacob can tell by the way Elliot slurps that he wants to be fucked, right there in house.  Watch Jacob slide his nice, firm dick into Elliot's tender hole.  This is a hard pounding, experimental adventure into a kinky wonderland.   Enjoy!",
  "models": [
    {
      "name": "Jacob Wolf",
      "person_id": 31970
    },
    {
      "name": "Elliot Vance",
      "person_id": 32062
    }
  ],
  "release_date": "2013-11-19",
  "scene_id": 61190,
  "series": "NDT - 8207 - Jacob Wolf & Elliot Vance",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Brunette",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink",
    "Uncut cock"
  ],
  "title": "Whipping Boys"
}