{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Damian West wonders why he even bothers sometimes. Sure, Noah & Josh will pretty much do whatever he says, but what good is it if he has to tell them what to do all the time? He feels like he's constantly carrying their extra weight, whether its out on the field, back at the gym, whatever... and quite frankly he's starting to wonder what he even sees in them. Well after practice one day, back at Damian's pad, they remind him. Fresh off a rigorous afternoon on the field, Damian's shoulders are tight, and so Noah begins to massage them. Damian's feet are sore, and so Josh begins to rub them. And when Damian's cock starts to swell up and rise beneath his shorts, Noah and Josh fight over who gets to take care of that. Josh starts, pulling down Damian's shorts, and taking the head of Damian's cock between his lips, nibbling and teasing it before plunging down on top of it. Noah watches with jealous envy, sure that he can do better, and when Damian gives him the chance, he shows his skill and proves his claim, deep throating Damian and tickling his balls with the tip of the tongue. Damian gets all worked up, and decides he wants a show, so Noah and Josh get down on the floor and put one on for him, each taking the other's cock into his mouth as Damian watches on, stroking from the sofa. Noah grows more horny by the second, and at Damian's request, he plunges his cock deep inside Josh while Damian continues to watch. Noah gives Josh a post game injection, while Josh begins to suck Damian off. Before too long, all three guys are ready to blow a super sized load on the sofa, which they do, one after another, drenching the couch and reminding Damian of the meaning of teamwork.Enjoy!",
  "models": [
    {
      "name": "Damien West",
      "person_id": 2533
    },
    {
      "name": "James Huntsman",
      "person_id": 16691
    },
    {
      "name": "Josh A",
      "person_id": 32155
    },
    {
      "name": "Noah Rods",
      "person_id": 32203
    },
    {
      "name": "Tyler Torro",
      "person_id": 13869
    }
  ],
  "release_date": "2013-11-21",
  "scene_id": 61226,
  "series": "NDB - 4472 - Tight Ends",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Condom",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Tight Ends"
}