{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Late at night, Tyler Morgan begins his workday.  After every last student has packed up and gone home, Tyler mops the floors, tidies up the periodicals, and dusts off the Dewey Decimal drawers, among other things.  He's usually content being alone in the school library at night.  He knows he's making money he needs.  Tonight's a little bit different though. Around midnight, as Tyler enters the first floor bathroom, he hears a shuffling.  It comes from the stall. Tyler finds fellow student, Casey Rae, groping himself.  Tyler also discovers Casey has disabled the security camera that Tyler strategically positioned to catch hot guys using the toilet.  Tyler immediately deduces that Casey is horny and down to fuck right then.  They exchange no pleasantries, only fiery, passionate looks.  Tyler goes right into sucking Casey's fat cock.  Casey can't believe the hot custodian he'd been seeing was actually slobbering and bobbing on his dick!  For Tyler, this was turning out to be exactly the right kind of distraction.  Casey gets a taste of Tyler's throbbing erection too, as Tyler sits on the 'upper deck' of the toilet.  When the intensity builds to a boiling point, the boys move outside the stall and Tyler allows Casey to slide his giant dong into Tyler's tight, waiting hole.  Casey doesn't hold back.  Watch him pound his new library friend hard, just the way he fucks all other strangers.  No library card needed.   Enjoy!",
  "models": [
    {
      "name": "Casey Rae",
      "person_id": 32206
    },
    {
      "name": "Tyler Morgan",
      "person_id": 31264
    }
  ],
  "release_date": "2013-11-26",
  "scene_id": 61227,
  "series": "NDT - 8208 - Tyler Morgan & Casey Rae",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Slim",
    "Smooth",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Passion and Porcelain"
}