{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Shawn Allen sat nervously on the weight bench.  It was only a day ago that he found the crumpled flyer in his pocket that offered 'FREE wrestling lessons!' A voice on the other end of the line told him in a breathy affect where to be and when. The voice was Kip Ryker's.  Kip and a boy by the name of Ben Daniels were already waiting for Shawn when he showed up.  Ben had read about the meeting on Craigslist.  The three remained silent for a while.  Finally, Kip motioned with his head for Shawn to come closer to him.  Shawn did and the sexual chemistry became too much to continue ignoring.  They embraced and kissed with tongues.  Ben watched and rubbed himself for a few moments, enjoying the unexpected eruption of sensual energy between these two.    Shawn had come to the mysterious, out-of-the-way gym to learn some grappling moves that might serve him well in a street fight.  He was tired of the bullies behind the skating rink yelling embarrassing, insulting remarks at him on his way home from school.  Ben's motivation was a little different.  He thought it would be a chance to roll around with some hot guys in tights.  Ben was certainly pleased when he realized the meeting was turning into a sexual, three-way hookup.  He joined Shawn and Kip, taking time to kiss them both.  Then Shawn sat down and took Ben's large dick out.  As he did this, Kip pulled out Shawn's cock and began sucking it deeply.  Shawn worked his mouth around Ben's wang, slurping and bobbing.  Shawn decided he wanted both fat cocks inside his holes at once.  He laid down and allowed Instructor Kip to slide his mammoth erection into his tight ass.  Ben fucked Shawn's face while Kip slammed the other side hard.  Before it's all over, witness Shawn take a warm, cum facial.  Goodness knows what next week's lesson will bring. Enjoy!",
  "models": [
    {
      "name": "Ben Daniels",
      "person_id": 31971
    },
    {
      "name": "Kip Ryker",
      "person_id": 32256
    },
    {
      "name": "Shawn Allen",
      "person_id": 32063
    }
  ],
  "release_date": "2013-12-03",
  "scene_id": 61352,
  "series": "NDT - 8209 - Shawn Allen, Kip Ryker & Ben Daniels",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Twink",
    "Uniform"
  ],
  "title": "The Wrestlers"
}