{
  "collections": [
    "High Performance Men"
  ],
  "description": "HighPerformanceMen.com is pleased to present Rich Kelly & Zack Taylor in DEEP PLEASURE.  Zack thinks he is all alone in the shower as he lubes up his favorite dildo and slides his beautiful ass all the way down on it.  As he rides it in pleasure, Rich Kelly walks in and begins watching Zack as he strokes his own cock.  He reveals his rock hard cock from underneath his towel and then Zack notices he is being watched and this turns him on even more as he gestures for Rich to bring his hard cock closer.  Zack begins sucking Rich's cock as he continues to ride up and down on his toy.  Rich then walks over and helps Zack get the ultimate penetration as he starts to drive the toy in and out of Zack's eager ass. Zack is obviously enjoying every moment of this attention on his ass and by the guttural sounds he makes with every thrust, you know he loves every second of it.  The two then embrace in a deep kiss before Rich gets on his knees and takes Zack's cock all the way down his throat.  Soon, Rich has Zack bent over as he drives his hard cock deep inside his eager ass.  He starts out slow, but soon the rhythm increases and he is fucking Zack deeper and harder with every thrust.  Zack then climbs up on Rich, wraps his legs around him and continues riding his cock deep.  Rich then sits down and Zack rides him and matches every thrust of his cock with gusto.  He is so turned on at this point that he cannot hold back any longer as he shoots his hot creamy cum all over.  Rich then orders Zack back on his knees as he rubs out a nice load all over Zack's face and mouth.  He then bends down and the two kiss and share Rich's creamy load before showering each other off.  Enjoy!",
  "models": [
    {
      "name": "Rich Kelly",
      "person_id": 31592
    },
    {
      "name": "Zack Taylor",
      "person_id": 32505
    }
  ],
  "release_date": "2013-12-10",
  "scene_id": 61727,
  "tags": [],
  "title": "DEEP PLEASURE"
}