{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "After a raging night at the clubs, Cole Christiansen and Derrick Dime aren't ready for the party to end. Luckily for them, Cole's friend, Dante, throws the best after-parties. As they pull up, Dante has a surprise waiting for them. He's converted his basement into a party palace, complete with lights, paint, and plenty of room to get as rambunctious as need be. Cole and Derrick paint a little, but walls are much less fun to paint than balls, so quickly the guys let their artistic inclinations run wild on each other. Dante runs the brush down Derrick's chest, all the way down to his waistband, when Derrick gives Dante a look that says, 'Why stop there?'So Dante pulls down Derrick's shorts and finds Derrick's cock ready and waiting. Dante wraps his lips around Derrick's glow stick, and Derrick grabs him by the back of the head and pushes him further down on it, choking him as Cole looks on enviously. Dante switches and gives Cole a little taste, before he climbs up on a table between them as they take turns gaping his hole, readying it for what comes next. As Dante moans from the feeling of Cole's index finger plunged deep inside him, Derrick lubes up and approaches Dante from behind, his eager cock ready for satisfaction. Sinking his cock deep into Dante's hole, Derrick begins to thrust as Dante bobs on Cole's cock. Then the guys switch and it's Cole's turn to have his way with the host, flipping Dante over and spreading his legs wide to accommodate the repeated thrusts. They switch again, and Dante strokes his cock as Derrick pumps away, causing Dante to gush his load all over his sweaty chest, before Derrick pulls out and he and Cole both blast Dante with a double load to the face. Funny fact: did you know semen glows in a blacklight?Enjoy!",
  "models": [
    {
      "name": "Cole Christiansen",
      "person_id": 29120
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Derrick Dime",
      "person_id": 32560
    }
  ],
  "release_date": "2014-01-02",
  "scene_id": 62030,
  "series": "NDB - 4478 - GLOW",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Facial",
    "Facial Hair",
    "Fraternity",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "GLOW"
}