{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Nooooow, here's a little story I got to tell about three bad dudes you're about to know so well: Jay Black is the gnarliest wrestling trainer the City's ever seen.  They say he wrestled against five men in the dead of night, in a pitch-black alleyway one time.  Legend has it two of the guys were ninjas, two others used to be on the show American Gladiators, and the other guy?  Well, you might know him best as the guy who was the inspiration for the movie Rudy, so you KNOW he had heart!  I'll spare you the gritty details, but I will say that all five men ended up with jizz all over their faces before the fight was over...and it all came from Jay's healthy dick.  </br></br>Today he's coaching a couple star wrestlers, Tyson Tyler and Sam Swift.  Sam just bumped up in the league, from Junior squad, to the pros.  Tyson's been a hard working wrestler for a long time, but still needs guidance from time to time, especially from greats like Jay.  Jay wants to work on strengthening the core this time.  He's showing the guys a few techniques when he notices Sam has something growing beneath his tights.  Sam can't believe he's popping a boner during the session he's been so nervous about.  It's ok though, Jay's well experienced in taking care of problems like this.  Tyson actually has one too.  Jay's starting out by having the guys remove their outfits and insert their large, swollen cocks into his mouth.  Jay's taking special care to really suck these dicks good.  After that, He's having Tyson fuck him, while Sam slides his meaty cock in and out of Jay's mouth.  The wrestlers switch after a while and Jay flips on his back to endure more pounding and fucking from these strong athletes.  In the end, Jay takes serious cum blasts to the face and chests.  Now they can focus on some core strength!  </br></br>Enjoy!",
  "models": [
    {
      "name": "Jay Black",
      "person_id": 30932
    },
    {
      "name": "Sam Swift",
      "person_id": 21212
    },
    {
      "name": "Tyson Tyler",
      "person_id": 30933
    }
  ],
  "release_date": "2013-12-27",
  "scene_id": 62203,
  "series": "NDE - E140 - Jay Black, Tyson Tyler & Sam Swift",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Black",
    "Dark Hair",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Interracial",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Uniform"
  ],
  "title": "Team Effort"
}