{
  "collections": [
    "Next Door Twink"
  ],
  "description": "For a couple of hoodlums out for a good time, a desolate alleyway with a perfect wall for graffiti is the place to be.  Nicholas Reed and Asher Hawk met in a diversion class the county court made them attend.  They bonded over talk of cigarettes in the boys room, huffing paint fumes, and of course, vandalism with spray paint.   They've met up tonight at a cool place Nicholas has sprayed before.  Asher likes it!  A fresh, urban canvas is just the right medium through which both boys can express their creativity.  After getting a little warmed up with the paint, Asher notices Nicholas looking at Asher's package.  A few glances exchanged with each other and the boys are smooching as they take a break from tagging (spray painting).   But then, suddenly, out of nowhere, a grown-up busts them!!!  The last thing either of them need is to go back to diversion classes; the instructor's breath was horrible!  Charlie Harding is groundskeeper for the Shriner's Senior Facility, the building the boys were just vandalizing.  Charlie is a no-nonsense type of dude, but he has a soft spot for reckless youngsters like Nicholas and Asher.  The fact is...Charlie used to be a crazy neighborhood boy himself once.  That's why he's teaching them a lesson himself, the old fashioned way, just how he learned.  Instead of ratting them out, Charlie's having the boys start out by turning his 'soft spot' into a massive, pulsating hard cock.  He's shoving his dick into each of their mouths to show them that graffiti doesn't pay.  But he's such a nice guy, he can't help but make it fun for all three of them.  He's having Nicholas suck both his own AND Asher's fat dongs at the same time.  Then Charlie's taking control of the situation by sliding his incredibly large cock into Nicholas's tender hole.  Nicholas isn't used to this, but he's enjoying it and certainly learning a valuable lesson.  Then it's Asher's turn.  While Charlie pounds Asher's sweet ass, Nicholas is allowed to slide his dick in and out of Asher's mouth.  It's a session of serious punishment.  But in the end, Charlie teaches the boys a way they can spray WITHOUT getting in trouble! Enjoy!",
  "models": [
    {
      "name": "Charlie Harding",
      "person_id": 19088
    },
    {
      "name": "Nicholas Reed",
      "person_id": 32515
    },
    {
      "name": "Asher Hawk",
      "person_id": 32585
    }
  ],
  "release_date": "2013-12-24",
  "scene_id": 62205,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Beefy",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Condom",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Threesome",
    "Twink"
  ],
  "title": "Sprayed and Punished"
}