{
  "collections": [
    "High Performance Men"
  ],
  "description": "HighPerformanceMen.com presents Christopher Daniels and porn newcomer Rikk York in FEET, SOCKS & JOCKS! Christopher and Rikk are in the locker room after their workouts and it does not take long for them to realize they both have the same dirty thoughts running through their minds.  Lips locked together, the two explore each other's bodies with their hands and tongues.  Christopher buries his face in Rikk's smelly armpit and takes a deep sniff before licking the sweat off all the hair.  He then works his way down and pulls Rikk's shorts off revealing his jock-strap.  First he works Rikk's cock through the jock-strap and then pulls it out as he deep throats every inch of his cock.  Rikk cannot get enough of Christopher's mouth and tongue as he thrusts his cock deeper down Christopher's throat.  The two then find themselves in a 69 as they deep throat each other's cocks.  Soon, Christopher has his tongue lapping at Rikk's hairy ass.  Rikk then rolls Christopher up and returns the favor as he spits and buries his tongue deep into Christopher's ass.  Christopher has Rikk bend over the bench as he eats his hairy ass some more and then has him sit down on the bench as his tongue travels down his leg to his foot.  Christopher removes Rikk's shoe and begins sucking and licking his foot with the sock on at first.  He removes the sock and then goes to town on Rikk's foot.  Licking the foot from the heel all the way to the toes.  He begins sucking on Rikk's toes and one-by-one he inserts all of them into his mouth.  Christopher is now sucking all of Rikk's toes in his mouth all at once and both are loving every moment of this foot worship. Christopher then sucks Rikk's cock some more before putting a condom on it and opening up his ass for Rikk to fuck.  Rikk drives his cock deep into Christopher's ass and fucks him hard and deep.  Rikk then finds himself on his back as Christopher drives his cock deep up his hairy ass.  As Christopher fucks Rikk deeper and deeper he also pulls Rikk's foot to his mouth as he does his best to deep throat every single toe.  Christopher then pulls Rikk up and fucks him Doggie style until he cannot hold back any longer and pulls out and shoots a nice load all over Rikk's hairy chest.  He then bends over and laps up his own cum and shares some with Rikk in a deep kiss.  Rikk, who has been jacking his own cock, cannot hold back either and Christopher positions himself under Rikk's cock as a huge load of white creamy cum goes into Christopher's mouth.  He then bends down and licks up some of his own cum and the two share some cum swapping in a deep kiss.  ENJOY!",
  "models": [
    {
      "name": "Rikk York",
      "person_id": 32679
    },
    {
      "name": "Christopher Daniels",
      "person_id": 32932
    }
  ],
  "release_date": "2013-12-24",
  "scene_id": 62212,
  "series": "Christopher Daniels And Rikk York",
  "tags": [],
  "title": "FEET SOCKS JOCKS"
}