{
  "collections": [
    "Next Door Twink"
  ],
  "description": "In a dank locker room, behind the old community gym, Jacob Wolf has broken into Jay Cloud's locker and is sniffing and licking Jay's socks and jock strap.  He knows this is around the time Jay comes in for a workout, but he can't keep himself from getting into the goods. </br></br>As Jacob hears Jay approaching the gym door, he scrambles to put back the items.  He hides the evidence of his raid just as Jay enters.  Jay gives a friendly head nod, but can tell something is amiss.  When he sees the jock strap Jacob overlooked when putting things away, he knows exactly what this little dick lover has been up to.  If it's dick he wants, that's exactly what Jay's gonna give him!  Jay sits down in front of Jacob and buries the boy's face in his undergarment, letting him lick it a bit.  Then they kiss deeply.  Jacob removes Jay's workout shorts and gets down to some seriously hot cock sucking.  Jay's giant erection is a lot for sweet Jacob to handle, but it tastes oh so good going in and out of his warm mouth.  Then Jay is taking Jacob's cock as deep as he can.  Jacob can't believe the hottest guy he's seen at this gym is blowing him, right on the dressing bench!  But when Jay bends Jacob over the bench and plays with Jacob's tender hole, Jacob thinks it MUST be a dream.  Watch Jay push his enormous cock into Jacob's sweet, eager ass, and pound him like he deserves.  Imagine the boldness...sneaking into someone ELSE'S locker!!  Let the punishment fit the crime. </br></br>Enjoy!",
  "models": [
    {
      "name": "Jacob Wolf",
      "person_id": 31970
    },
    {
      "name": "Jay Cloud",
      "person_id": 10696
    }
  ],
  "release_date": "2013-12-31",
  "scene_id": 62339,
  "series": "NDT - 8213 - Jay Cloud & Jacob Wolf",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Jock Raider"
}