{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As a photographer, Conner Hastings has developed quite and eye for beauty in all of its forms, so when Christian Cayden comes sauntering onto his set, Conner is giddy with expectation. With the leathers all laid out, Conner can envision Christian stripping out of his everyday get up and slipping into something a little more adventurous.To his credit, Christian is willing and able to take direction, offering no resistance to any of Conner's promptings, and so Conner can't help but wonder just how willing and flexible Christian might be.A short time later, as Conner bends Christian's naked ass over the bike's seat, Conner gets his answer. Turns out, Christian has been thinking the same thing since they met, just wondering when it would be that Conner would make a pass at him.And now that Christian has this hot photographer all to himself, he intends on making some lasting memories. Christian swallows all of Conner's shaft, as Conner fucks his mouth, running his hands through Christian's hair. Gagging on Conner's meat is a nice warm up, but what Christian really wants is that hard injection of Conner's main vein, so Conner bends up against the bike and goes at Christian's ass raw and without abandon, pumping Christian hard from behind, then flipping him over onto his back and dive bombing his ass from above, before losing his load all over Christian's face, as Christian swallows any evidence of any of it ever happening. Luckily they have the pictures.",
  "models": [
    {
      "name": "Christian Cayden",
      "person_id": 31546
    },
    {
      "name": "Conner Hastings",
      "person_id": 31904
    }
  ],
  "release_date": "2014-01-09",
  "scene_id": 62416,
  "series": "NDB - 4479 - Christian Cayden & Conner Hastings",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Cum swallow",
    "Facial",
    "HD Movies",
    "Hardcore",
    "Leather",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "MOTOCAYDEN"
}