{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Here's a sneak peek into the world of Gay for Pay, as Ryan and Austin Storm both outline their sexual proclivities as well as their reservations about the adult industry. For Austin, this is nothing new, as he has made adjustments in his personal life to accommodate his onscreen double-life. But for new guy Ryan, a surprise is in store. Thinking he is only here to jerk-off, he finds out during his interview he'll actually be fucking Austin, and the screws tighten from there. Initially worried, he is eased somewhat when he meets Austin, as their vibe seems to mesh. But it's not until Austin lays Ryan back and begins to suck him off that Ryan realizes his preconceptions are way off. Growing hard in Austin's mouth, Ryan pushes Austin's head down harder, ramming his cock into the back of Austin's throat, before moving to the bed where Austin runs his hands up and down Ryan's body. Ryan is visibly turned on and Austin is willing and able, so Ryan bends Austin over the side of the bed and begins to pump him from behind. Austin reaches back and pulls Ryan in closer, as Ryan continues to thrust, turning Austin and continuing as Austin jerks his dick in motion. Ryan fills Austin up with high hard meat and it is too much for Austin to bare, and he loses his load all over his stomach and Ryan just keeps plowing. Fucking Austin's hole with reckless abandon, Ryan is ready to spew his load as well, so he pulls out and drenches Austin. No longer a newbie, Ryan realizes there might be something to this after all.Enjoy!",
  "models": [
    {
      "name": "Austin Storm",
      "person_id": 31631
    },
    {
      "name": "Ryan Knightly",
      "person_id": 32051
    }
  ],
  "release_date": "2014-01-23",
  "scene_id": 62444,
  "series": "NDB - 4481 - Ryan & Austin Storm",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Smooth",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Q&A"
}