{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Gunnar Marx and Kyle Blake have been fooling around with each other for a few weeks now.  They might right here in the gym locker room.  It's usually just the two of them, but the whole affair started when a gym staff member dared them to kiss on afternoon after their workouts.  Since then, the two have naturally been very sexual with each other.  As they strip down and begin feeling frisky, Gunnar Marx, a new gym member enters the locker room.  Hayden can sense right away that something is unusual about the vibe.  He can feel Kyle and Gunnar checking him out.  Without much hesitation, Hayden pulls down his shorts and exposes his large, swollen cock.  Hey, it's a normal thing to do in any locker room.  Kyle and Gunnar follow suit, letting their own massive erections flop out in the open.  When all three boys begin stroking their pulsating, hungry dicks, Hayden realizes just what type of gym this really is!  Kyle and Gunnar go right in for a taste of Hayden's fresh meat.  They're so excited to share this new, hot guy's fat dong together.  After some serious slurping and bobbing, Hayden decides he wants to stick his face in Kyle's ass.  While Kyle enjoys this, Gunnar lets Kyle suck his firm cock.  Then they switch so Gunnar can fuck Kyle's ass for a while, while Hayden gets some sweet sucking from Kyle.  After some nice, hard pounding, Hayden is ready to slide his dick inside Kyle's tight hole.  Watch Kyle gently ease himself onto Hayden's giant, erect dick and take it for a seriously hot ride!   Enjoy!",
  "models": [
    {
      "name": "Gunnar Marx",
      "person_id": 32731
    },
    {
      "name": "Hayden Anders",
      "person_id": 32651
    },
    {
      "name": "Kyle Blake",
      "person_id": 32732
    }
  ],
  "release_date": "2014-01-21",
  "scene_id": 62516,
  "series": "NDT - 8216 - Hayden Anders, Gunnar Marx & Kyle Blake",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Dark Hair",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "That Type of Gym"
}