{
  "collections": [
    "High Performance Men"
  ],
  "description": "HighPerformanceMen.com presents Brian Bonds and Drake Jaden in 2 BOTTOMS NO TOP.  What happens when two bottoms hook up?  Can they actually have a hot sexual experience with each other?  Of course they can!  Brian and Drake begin by watching each other masturbate in their jock-straps.  They talk dirty to each other which turns each of them on even more as their cocks are rock hard.  Drake then asks Brian to turn around and show off his ass.  As Brian bends over the spreads his ass wide, Drake tells him to make his hole throb.  Brian does by making his ass hole pulse with each stroke of his cock.  Brian then has Drake bend over and finger his own hole while he talks dirty to him.  Drake strokes his own cock as he fingers and slaps his beautiful ass hole. They then pull out two blow up black runner balls that have large dildos attached to them.  Drake holds the ball as Brian lowers himself deeper and deeper onto the ball.  He then bounces up and down riding the dildo deep inside his eager ass.  Drake loves every moment of watching Brian enjoy the action.  Not wanting to be left out of the fun, Drake lubes up his dildo and Brian holds it as Drake impales himself deep with the dildo.  He too rides the ball by bouncing up and down for a while loving every inch of the dildo going in and out of his ass.  The two then both begin riding the balls together and when Brian says he is about to cum, Drake tells him that he better hold back because he is not ready to cum yet.  He slaps Brian's arm away from his cock forcing Brian to edge himself.  Drake then is about to cum and Brian forces him to also edge his cock.  The two edge for a while before they cannot hold back any longer and shoot ample loads of cum all over the place.  They then clean off themselves in a nice hot shower.  Enjoy!",
  "models": [
    {
      "name": "Drake Jaden",
      "person_id": 27955
    },
    {
      "name": "Brian Bonds",
      "person_id": 28078
    }
  ],
  "release_date": "2014-01-14",
  "scene_id": 62549,
  "series": "Brian Bonds And Drake Jaden",
  "tags": [],
  "title": "2 BOTTOMS NO TOP"
}