{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Down at the club, the daytime shift for barkeep Marc Williams is about to end.  When Marc closes shop in the early afternoon, the place doesn't open again until 10pm.  Brandon Jones has been Marc's only customer today.  As Brandon sips his drink, he makes small talk with Marc.  As they lightly chit chat, Jay Black warms up for his go-go routine he'll perform that evening.  Brandon has become quite aroused watching Jay dance on the pole.  He tells Marc how sexy Jay looks to him and Marc agrees that Jay has a special, sensual quality to his moves.  </br></br>When Marc goes in the back to straighten up, Brandon takes advantage of the situation and sticks his face right in Jay's crotch.  The smell is heavenly and the hard cock inside the underwear feels nice against Brandon's face.  Brandon takes out Jay's fat dick without asking and sucks it deep.  Jay can't believe it.  </br></br>When Marc returns, he sees the action happening and joins right in.  Brandon handles both large erections like a champ.  As Brandon works Marc's behemoth dong with his lips and tongue, Jay moves around and sucks Brandon's solid cock.  Soon he's licking Brandon's ass, enjoying every second.  Then Jay stands up and slips his dick into Brandon's tight ass.  After some pounding, Marc moves around and takes his share of Brandon's warm hole.  Sit back and join this serendipitous trio as they let inhibitions go and allow pleasure to flow. </br></br>Enjoy!",
  "models": [
    {
      "name": "Brandon Jones",
      "person_id": 20071
    },
    {
      "name": "Jay Black",
      "person_id": 30932
    },
    {
      "name": "Marc Williams",
      "person_id": 9334
    }
  ],
  "release_date": "2014-01-17",
  "scene_id": 62575,
  "series": "NDE - E143 - Marc Williams, Brandon Jones & Jay Black",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Black",
    "Climax",
    "Dark Hair",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Three to Get Lucky"
}