{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Poor Anthony Romero is still recovering from a pulled leg muscle.  It's a good thing his physical therapist, James Jamesson, is willing to make him feel better by pulling on another one of Anthony's muscles!As Dr. Jamesson inspects the injured area, Anthony grows horny.  James is probably the hottest doctor Anthony's ever seen.  During their last checkup, it seemed to Anthony that James was a bit more touchy than would have been necessary.  Anthony decided then that at the next visit, he'd tell James how attractive he finds him.  So this time he told him.  The outcum couldn't have been better!  From James's reaction, Anthony felt like it was the right moment to make an even bolder move: he grabbed the back of Dr. Jamesson's neck and planted a passionate kiss.  Without hesitation, James grabbed Anthony's already bare cock and began stroking.  Soon, both dudes were naked, enjoying each other.  James let Anthony lay down with his head all the way back, and inserted his enormous dick into Anthony's mouth.  It felt so warm and soft around James's meat.  Then they moved into a 69 position where James licked Anthony's beautifully tight hole and Anthony slurped James's cock on the other side.  Then James took his patient down from the table and worked his swollen dong into Anthony's hungry ass.  Watch this good doctor pound Anthony's sweet bottom in a manner you'd expect from medical professional.Enjoy!",
  "models": [
    {
      "name": "Anthony Romero",
      "person_id": 16627
    },
    {
      "name": "James Jamesson",
      "person_id": 9526
    }
  ],
  "release_date": "2014-02-06",
  "scene_id": 62588,
  "series": "NDB - 4483 - James Jamesson & Anthony Romero",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Deep throat",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Oral",
    "Red Head",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Medicinal Cock"
}