{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Brandon Bronco and Conner Hastings have had the tables turned on them. Waiting in the hot tub expecting a woman to arrive, the boys have prepared a little game of Truth or Dare and wait hornily for her arrival. But it seems this lass has pulled a fast one on the guys, sending instead her brother Addison, who arrives ready to play and eager to please. Brandon & Conner are surprised, but their lust is apparent and their temperament tells them to make the best of the situation, so they begin playing anyway. Midway through, it occurs to Brandon what a nice ass Addison has, and the game has revealed that Conner gives absolutely no fucks where he puts his dick, so the guys move from the tub to the bedroom where Brandon and Conner take turns using Addison like a fuck slave. Addison is willing and able to accommodate, taking Brandon's huge cock all the way down his throat as Conner plays with his ass, tonguing at Addison's hole as Brandon's cock swells full and thick. Turning Addison around, Brandon inches his cock deep into Addison, while Conner bends over and lets Addison taste his sweet, freshly cleaned ass. Brandon pumps away as Addison strokes himself off, losing his load as Brandon thrusts with reckless abandon. Conner, who has never had a cock inside him, becomes envious at the sight and allows his friend to try it just this once as Addison looks on, very pleased at the situation he has created.Enjoy!",
  "models": [
    {
      "name": "Brandon Bronco",
      "person_id": 31339
    },
    {
      "name": "Conner Hastings",
      "person_id": 31904
    },
    {
      "name": "Addison Graham",
      "person_id": 32786
    }
  ],
  "release_date": "2014-01-30",
  "scene_id": 62655,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Condom",
    "Facial Hair",
    "Fraternity",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Truth or Dare"
}