{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Brodie and Jessie were killing some time together the other day while waiting for their ride to a local photo shoot. Being the cock-lover that he is, Jessie decided to see if he could get into Brodie's pants. He slyly asked the muscled, dark haired stud if he wanted to pass the time by watching a porn flick. Brodie wondered to himself if there was a hidden agenda with that question, but since he didn't have anything else to do at the moment, he said sure anyway.As the two sat and watched a hot couple fuck on the TV, Jessie wanted to get things going on, and so he started rubbing his cock through his shorts. Just as he hoped, Brodie followed suit and started touching himself as well.Jessie then got risky and reached over and grabbed Brodie's hardening cock. Looking into his buddy's eyes to see if he was crossing the line, but getting no response, Jessie then slides Brodie's swim trunks down his legs and onto the floor, fully revealing the hunk's hard, thick cock.After blowing his friend for a moment, Jessie wanted to push the limits a bit more by ripping off his own clothes and putting his ass in the air, silently asking for a big cock to slide into him. Brodie figured that he's gone this far already, might as well go the full distance, so he gets behind Jessie and slowly sinks his dick into the waiting hole.These two go at it good, with Brodie slamming Jessie's ass from all sorts of positions. When it's time to get off, Brodie chooses to dump his load all over Jessie's chest, and Jessie gets so turned on by that, that he shoots off too, spilling his seed all over himself.Enjoy this kinky scene.",
  "models": [
    {
      "name": "Brodie",
      "person_id": 5090
    },
    {
      "name": "Jesse Cox",
      "person_id": 36307
    }
  ],
  "release_date": "2007-07-05",
  "scene_id": 6283,
  "series": "4136 Next Door Buddies",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Brunette",
    "Fraternity",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Brodie & Jessie Cox"
}