{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For this weeks update, we have a special scene for you to indulge yourself in.You may recognize Kenny, the 22 year old stud that, until now, has only done solos and straight scenes. Then we have Wolf Hudson, a manly looking 22 year old who loves cock and anything to do with hot, young guys.<BR/><BR/>We thought this would be a perfect matchup...and it is!This is Kenny's FIRST man-on-man scene. Not only does Kenny get his pecker sucked on, he ALSO does a bit of sucking, and not too bad for a straight guy.<BR/><BR/>These two were lounging around the pool naked, enjoying the warm sun shining down on their gonads when Wolf noticed Kenny was stroking himself. Wolf liked what he saw, so he began tugging on his big member to promote the sexual energy. Wolf thought of how good it would be to taste that straight cock, so he decided to take a chance. Without saying a word, Wolf Hudson walked over to Kenny, got on his knees, removed his buddies hand from his cock and proceeded to suck the daylights out of the throbbing hard-on.<BR/><BR/>Kenny got so excited by the quality of the blowjob that he, to everyone's surprise, offered to suck his friend.We're glad we had the cameras rolling.<BR/><BR/>Not only do these two studs play by the pool, they take the action inside and do a 69 on the bed before laying on one another and stroking themselves to a creamy conclusion.<BR/><BR/>Don't miss out on this once in a lifetime opportunity to see Kenny go where he has never gone before. A truly smokin' scene with plenty of action, even for the most critical porn viewer.<BR/><BR/>Enjoy!",
  "models": [
    {
      "name": "Kenny",
      "person_id": 4364
    },
    {
      "name": "Wolf Hudson",
      "person_id": 5688
    }
  ],
  "release_date": "2007-07-05",
  "scene_id": 6287,
  "series": "4137 Next Door Buddies",
  "tags": [
    "Amateur",
    "Brunette",
    "Fraternity",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Softcore",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Kenny & Wolf"
}