{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "It's smooth, sensuous enjoyment when PD Fox shows up in Astengo's hotel room to administer a hot, oily rub down.  Is this sexy massage legit, or has unassuming Astengo been duped?   PD is a logistical technician in the field of pulling tricks to fuck attractive dudes.  He's been staking out the switchboard room at the downtown Sherman-Belmont Grand Tower Hotel for the last 3 months.  He's been faithful and vigilant.  Every night, he had been monitoring the comings and goings of the phone operation staff, plotting his execution.  PD never makes a move until he's absolutely positive he can maneuver the entire score blindfolded if he has to.  Well that time has come, and so has a sexy young man.  When PD sees Astengo checking in, he switches into action mode.  He disables the main receiving wire to the switchboard room, and patches it with a phony that mimics the real one.  After he climbs down from the roof, he distracts lobby security with a fake domestic dispute call from a room on the opposite side of the hotel from Astengo's.  He also manages to cause a brief power outage so the entire building goes dark for 3 minutes, just enough time for PD to disorient, sedate, and disrobe the real masseur on duty.  PD knows he'll need to show up wearing the usual garb or Astengo will ask questions.  He's had Astengo's room number from the moment he checked in.  PD hacked the hotel's computer mainframe weeks ago.   Everything worked like a well-greased setup of the board game Mousetrap.  PD was in.  Astengo lay on the bed in his towel, waiting for PD to put hands on him.  PD escalated the rub from not-unusual to sexual, very quickly.  He knew he had to get down to the naughty business quickly.  In under a few minutes, Astengo was sucking PD's fat cock and loving it.  PD got on the bed and used his hips to work his throbbing dick in and out of Astengo's tender mouth.  When PD asks Astengo if he'd like to be fucked, he of course says 'yes.' See PD make the big score when he slams this unsuspecting hotel patron's tight hole in this hot, intense sex caper.         Enjoy!",
  "models": [
    {
      "name": "Astengo",
      "person_id": 21255
    },
    {
      "name": "PD Fox",
      "person_id": 32813
    }
  ],
  "release_date": "2014-02-05",
  "scene_id": 62907,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bald",
    "Big Dick",
    "Big Muscles",
    "Black",
    "Climax",
    "Condom",
    "Dark Hair",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "For a Good Rub, Call"
}