{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Life of the varsity squad can be stressful...but lots of fun too!  Just ask Team Captains, Rex Maddox, Evan Stone, and Dirk Wakefield.  They're the coolest, hottest boys on the team this year, that's why they stick together.  But when they meet up at Dirk's house after a tough practice, a simple back rub turns into a situation that's bringing them closer than these three ever thought they'd be! Dirk offers to massage Evan's sore shoulders, and Evan gladly accepts.  Rex chimes in, of course, asking when he'll get a turn from strong-handed Dirk.  Dirk's happy to rub Rex too, but he has no idea the type of massage Rex has in mind!  When Rex pops his hard cock out of his shorts, Dirk gets the picture quick!  He has no problem planting his 'twolips' in Rex's garden!  And while Dirk works on Rex's stiffy, Evan is enjoying Rex's mouth.  Rex can't believe he's getting a mouthful of dick from one of his best friends, but why not?!  Dirk knows how to suck properly, but he wants the other boys to share his own fat dong.  So Evan and Rex take turns slurping his behemoth cock.  Then the two boys get on their knees simultaneously to serve Dirk both dicks at once.  Dirk can't decide which thick, meaty erection feels better in his mouth!  It's not long before Evan offers his tight asshole to Dirk for fucking.  Dirk doesn't hesitate to slide his pulsating cock into his pal and repeatedly slam him hard.  Evan takes it well, slobbering and slurping on Rex's bulging boner all the while.  Rex decides he wants to be pounded too.  He lets Evan dip his hard-on into his mouth, while Dirk fucks his sweet hole.  Before it's all over, watch these hot, rambunctious guys erupt in hot, creamy delight.   Enjoy!",
  "models": [
    {
      "name": "Dirk Wakefield",
      "person_id": 32832
    },
    {
      "name": "Evan Stone A",
      "person_id": 32833
    },
    {
      "name": "Rex Maddox",
      "person_id": 32834
    }
  ],
  "release_date": "2014-02-11",
  "scene_id": 63017,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Threesome",
    "Twink"
  ],
  "title": "Cream of the Crop"
}