{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For Addison Graham and Dante Martin, work is kind of a mixed bag. On one hand, the guys like what they do, the environment, and the industry. On the other hand, their boss is kind of a sadistic cock. Seems like he gets his rocks off just inventing embarrassing things for them to do on camera, and today is no different from any other. Upon entering, the guys discover a set of instructions and a table full of weird objects laid out with no rhyme or reason. That is, until Dante reads the instructions and reveals the relation: the boss wants the guys to have a deep throat competition and film it for all the world to see.Reluctantly, the guys agree, copping a squat and trying their best to down the various objects in front of them. It's pretty clear that Dante has some talent in this particular arena, and Addison is feeling a bit inadequate as Dante ribs him a little. Addison counters that he's just not motivated enough, and with that, he pulls Dante's shorts down and immediately gorges himself on Dante's meaty cock. Showing much more acumen with the real thing, Addison gags and chokes on Dante's rod until he has redeemed himself, and then the guys switch and it is Dante's turn. As Addison gets harder and harder inside Dante's mouth, the thought of fucking him pervades, so he flips Dante over and begins to moisten up his asshole with his finger, before slipping his hard cock inside of him as Dante bends over the sofa. Addison puts his hand on Dante's shoulder and slams into him repeatedly, as Dante strokes his cock while being pounded, before mounting Addison and riding him, letting his hot batch fly while Addison thrusts and pumps away.Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Addison Graham",
      "person_id": 32786
    }
  ],
  "release_date": "2014-02-20",
  "scene_id": 63114,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim"
  ],
  "title": "Head to Head"
}