{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "They're a couple of sexy wolves on the loose, looking for a hot hookup with somebody who's ready for action.  Tyson Tyler and his fuck buddy, Sam Swift, have ducked into a popular nightclub to find what they want.  But it's the middle of the day and they're hoping to spot a prime specimen who's casually enjoying his Saturday.  The last guy they figured would join them is sexy bartender, Astengo.  But this barkeep is always down to get wild!</br></br>When Astengo returns from the back room, he finds Tyson and Sam getting warmed up with some deep kissing.  When their large dicks come out, Astengo goes right in for a taste.  Both Sam and Tyler are very well hung men, just how Astengo likes his random bangs.  The fat cocks these guys pump into Astengo's mouth is a lot to handle, but just the thing to break up his usual bar routine.  Tyson moves around to Astengo's ass and flicks his tongue around the tight hole.  Then Tyler slides his stiff cock into Astengo's delicious hole.  Sam loves the feeling of Astengo's mouth slurping his erect dong while he gets fucked simultaneously by Tyson.  Sam switches to the other side and Astengo takes to his back to allow Sam to pound his sweet ass.  Even in the middle of the day, one never knows what kind of interesting situations can be found in the City downtown.  Join this steamy threesome as they explore the excitement of a random, public hookup.  </br></br>Enjoy!",
  "models": [
    {
      "name": "Astengo",
      "person_id": 21255
    },
    {
      "name": "Sam Swift",
      "person_id": 21212
    },
    {
      "name": "Tyson Tyler",
      "person_id": 30933
    }
  ],
  "release_date": "2014-03-05",
  "scene_id": 63120,
  "series": "NDE - E150 - Tyson Tyler, Astengo & Sam Swift",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Black",
    "Dark Hair",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Interracial",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Swing Shift"
}