{
  "collections": [
    "High Performance Men"
  ],
  "description": "HighPerformanceMen.com brings back two of our favorite Uncut Latino Men - Angel Rock and Ray Han in DEEP MASSAGE.  Ray Han's strong hands glide sensually and deep over Angel's body as the two begin this massage journey.  Ray starts out slow and deep at first and teases Angel as his hands brush up gently near his taint and cock without fully touching at first.  It is obvious with every stroke that Angel is getting turned on as we see his cock begin to grow and throb as Ray strokes Angel's body.  Noticing this, Ray reaches between Angel's legs and slowly plays with the foreskin on Angel's thick cock.  Angel rises up off the massage table, almost like a cat being petted, as Ray kisses and licks Angel's beautiful ass.  Angel rolls over on the table revealing his large uncut cock and Ray begins stroking it before he bends over and takes it deep down his throat.  As Ray sucks, Angel eagerly reaches into Ray's pants and pulls out his massive uncut cock and the two share a nice deep 69 on the massage table.  Wanting to offer Angel and even deeper massage experience, Ray puts a condom on Angel's cock and climbs up on the table and straddles Angel.  At first it is a slow deep penetration and soon thereafter the energy increases with every thrust of Angel's throbbing cock.  The fucking gets very intense as Ray begs Angel to fuck him deeper and harder.  Angel climbs off the table and puts Ray on his back as he drives his cock harder and deeper into Ray's eager ass.  The intensity continues to grow as they both get louder and fuck harder until Ray cannot hold back any longer and he shoots a nice thick creamy load all over this stomach.  Angel then returns the favor and shoots all over Ray's hard body.  Exhausted, the two collapse onto each other as their cocks swim in each others cum.  Enjoy!",
  "models": [
    {
      "name": "Angel Rock",
      "person_id": 31517
    },
    {
      "name": "Ray Han",
      "person_id": 32580
    }
  ],
  "release_date": "2014-02-11",
  "scene_id": 63128,
  "series": "Angel Rock And Ray Han",
  "tags": [],
  "title": "DEEP MASSAGE"
}