{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For Riddick Stone and his employee Ryan, it's been a really slow day at their garage. Barely a customer all day. As it nears the middle of the afternoon, neither of them have done much anything, and so they're growing understandably restless. So they decide to break the monotony and have some fun with their next customer.</br></br>Austin Storm thought he was taking his car in to fix a knocking sound in the engine, but once his car is up on the lift, he realizes the engine isn't the only thing making a knocking sound. Riddick and Ryan bend him over the front of the car and slowly caress him from head to toe, stripping him out of his jeans as they unzip their coveralls, letting two meaty cocks spill out in front of Austin. He takes one of them in his mouth and the other in his hand, sucking and stroking on these two hot rods right there in the middle of the garage. Riddick's shaft is ready full of torque, and so he strips off Austin's pants and penetrates him from behind, putting a little junk in Austin's trunk as Ryan looks on poised and pleased. Riddick drives Austin like he stole it, tearing up that ass and talking to him throughout, and as they all blow their loads on the hood of Austin's car, he doesn't even remember the fact that his car is still in total disrepair. Not that it matters... he knows a couple of guys in the business.</br></br>Enjoy!",
  "models": [
    {
      "name": "Austin Storm",
      "person_id": 31631
    },
    {
      "name": "Riddick Stone",
      "person_id": 32103
    },
    {
      "name": "Ryan Knightly",
      "person_id": 32051
    }
  ],
  "release_date": "2014-02-27",
  "scene_id": 63244,
  "series": "NDB - 4486 - Riddick Stone, Ryan & Austin Storm",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Climax",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Workers"
  ],
  "title": "Dipsticks"
}