{
  "collections": [
    "Next Door Twink"
  ],
  "description": "When Tyler Morgan has a good idea, he runs with it.  Aiden Summers is a hot boy Tyler's made friends with in French Class.  They've been assigned a team report that's due next week.  Since the weather ain't great, Tyler decides to invite Aiden over to work on the project.  Aiden has no idea Tyler's cooking up a fresh batch of digital seduction!Before Aiden arrives, Tyler records a very sexy video on his laptop, which includes Tyler stroking his bare, stiff cock.  When Aiden comes into Tyler's room, Tyler tells him to chill on the couch for a few minutes and open the project file on his laptop.  But right there in plain view on Tyler's desktop is the hot video!  As Aiden watches the video, after making sure no one else is around, he plays with his own growing erection.  Tyler watches him quietly, without Aiden realizing.  Just when the moment is right, Tyler surprises him!  Aiden apologizes, embarrassed to be caught.  But Tyler reassures him it's ok, and the two engage in some red hot kissing.  Soon both boys' clothes are on the floor and Tyler is sucking Aiden's big, pulsating dick.  Aiden does the same for Tyler and then has a taste of Tyler's tight, warm hole.  After getting it nice and ready, Tyler climbs on top of Aiden for a ride.  Watch Tyler bounce on Aiden as he jerks his own meaty dick.  See the intense pleasure in the faces of them both as Aiden fucks into Tyler hard.  Then watch them switch positions on the couch, just before Aiden literally pounds the cum out of sweet Tyler.  It's a super hot, crazy passionate hookup!   Enjoy!",
  "models": [
    {
      "name": "Tyler Morgan",
      "person_id": 31264
    },
    {
      "name": "Aiden Summers",
      "person_id": 32906
    }
  ],
  "release_date": "2014-02-18",
  "scene_id": 63314,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Condom",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Twink"
  ],
  "title": "Digital Seduction"
}