{
  "collections": [
    "Next Door Twink"
  ],
  "description": "As a Real Estate agent, life pushing properties around in the market can become lonely and difficult.  Asher Hawk is feeling that pain.  Today he's holding an open house for a very expensive piece of property.  It's in the hills, a bit out of the way.  A few hours in, he hasn't had anyone drop by.  Until now.</br></br>Ian Ticing walks in as Asher is going over some legal forms for his client, the seller.  What Asher doesn't know is that Ian's been watching Asher.  He saw Asher's profile on a Realtor website, and liked what he saw.  He knew Asher would be here today.  Asher politely gives Ian the standard tour, remarking on the original tile and restored fixtures.  When they arrive in the junior suite bedroom, Asher takes an opportunity to ask Ian how old he is.  Asher needs a sale and doesn't want to be wasting his time with someone who appears to be too young to possess assets enough to seriously consider purchasing the property.  Ian doesn't directly answer his question, but instead kisses Asher.  After a few moments of deep smooching, they move to the bed to let the passion continue to spill from their souls.  Ian removes Asher's shirt and his own.  He pushes him on the bed and removes Asher's pants.  Ian sucks Asher's swollen cock for a while before Asher sits up and sucks Ian's erect dick.  Ian then takes control, sliding his cock into Asher's tight ass, and pounding him slow at first, then hard and fast.  They reposition so Asher can climb on top and ride.  Watch this open house tour go from business as usual to pleasure like never before as these incredibly hot Twinks ravage each other in one of the nicest homes on the market.",
  "models": [
    {
      "name": "Asher Hawk",
      "person_id": 32585
    },
    {
      "name": "Ian Ticing",
      "person_id": 32954
    }
  ],
  "release_date": "2014-02-25",
  "scene_id": 63444,
  "series": "NDT - 8221 - Asher Hawk & Ian Ticing",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Red Head",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "High-End Property"
}