{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Today is the day that Markie More learns to never underestimate someone based on appearances. As Markie admires his absolutely shredded physique in the mirror, he is unaware that a stranger is plotting, aiming to use his vanity against him. Drake Tyler may look a little gangly, but his strengths sneak up on you, as Markie soon discovers when he finds himself struggling to best Drake in a bench press contest. As he tries in futility to outdo his adversary, he wishes he hadn't been so bold as to offer his challenger such confident odds, as he now finds himself on the losing end and his position compromised, which was exactly Drake's plan all along. </br></br>Drake claims his prize, pulling Markie's shorts down to his ankles and immediately pouncing on his cock, tonguing it up and down the shaft. Markie gets much more turned on than he ever would have expected, and so when Drake turns him around to eat his ass, Markie obliges, even though he's never done anything like that. Drake strokes himself as he flicks his tongue in and out, as Markie grabs the barbell and grips it tightly. With his dick fully erect and his curiosity piqued, Markie is down for whatever at this point, so when Drake bends over, Markie doesn't even think twice, and immediately shoves his raw cock into Drake, pounding him relentlessly on the bench from behind, then they switch up and Drake rides Markie, with Markie grabbing his legs and thrusting into him as Drake strokes himself off in an exploding mess on Markie's ripped chest, just as Markie pulls out and shoots his own hot load. </br></br>And as lessons go, this one wasn't that tough to endure: Markie may have been beaten... but in the end, he still feels like winner.  ",
  "models": [
    {
      "name": "Drake Tyler",
      "person_id": 32530
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2014-03-13",
  "scene_id": 63741,
  "series": "NDB - 4488 - Markie More & Drake Tyler",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Performance Incentive"
}