{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "You may remember this classic Next Door Buddies scene from a while back! This was one of Markie's first scenes and one that made us first take notice of his star power. We hope members will appreciate the extra focus we're putting on this classic clip!Markie More is caught between a rock and his hard on. In his bed, Drake Tyler's naked ass lays exposed, begging for the high hard one, but at the door, his knuckle-head friends are here to watch the big game. Markie has to save face, but would much rather lose his nut.It's true, Damien West and David Stone came over to watch the game, but now that they have arrived, they can sense that some kind of game is already at hand, judging by the guilty looks on Markie and Drake's faces.After some light ribbing and investigation, Markie and Drake's secret is exposed, but rather than persecute the two for it, Damien and David decide to exploit the situation, and milk it for everything it's worth. And speaking of milking: Markie and Drake immediately start sucking off the two hockey fans, Drake deep throating Damien and Markie going down on David. Moving to the bed, Drake becomes the centerpiece as the other three guys take turns face fucking him, smacking his supple ass, and generally having their way with him, until Markie moves around back and enters Drake from behind, slipping his throbbing head into Drake's hole as Drake continues to service the other two guys. Rotating positions, the guys run a train on Drake with no regard, raw-dogging Drake's hole until they are all satisfied, then busting their nuts all over his sweaty chest, as he lay beneath them like the cum dumpster that he is. Enjoy!",
  "models": [
    {
      "name": "Damien West",
      "person_id": 2533
    },
    {
      "name": "Drake Tyler",
      "person_id": 32530
    },
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "David Stone A",
      "person_id": 32992
    }
  ],
  "release_date": "2016-01-26",
  "scene_id": 63772,
  "series": "NDB - 4491 - David Stone & Markie More & Damien West & Drake Tyler",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Cum swallow",
    "Deep throat",
    "Facial",
    "Fraternity",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Orgy",
    "Tattoo/Piercing"
  ],
  "title": "Caught in the Action"
}