{
  "collections": [
    "Next Door Twink"
  ],
  "description": "It's a triple threat that'll make you sweat! Get ready for three hot, sexy boys and an afternoon that's only got one thing in store: some crazy, hard fucking!Trent Ferris is the coolest guy in school and Lucas Owen and Ace Adams heard he loves cock. Lucas and Ace decided to follow Trent home and see if they can convince him to have a little fun. Trent's parents are away on vacation, so Trent invites them in. Soon, they're down to their undies and feeling frisky. Lucas suggests they play a coin-toss game to see who has to suck Trent's dick. Trent just laughs and plays along, thinking the guys are joking around. But when Ace loses and follows through, Trent finds himself right in the middle of an awesome three way! Lucas slides his massive boner in and out of Trent's supple mouth, while Ace bobs on Trent's knob. Before long, Ace is sharing Trent's throbber with Lucas, taking breaks so they can all kiss, of course. Then Ace climbs on Trent's dong and goes for a hard-pounding thrill ride. But Lucas wants to feel Ace's tight hole too. That's when Trent face fucks Ace while Lucas slams his sweet ass. The session's not over, though, until Lucas takes Trent's meat deep. Get yourself geared up, fatten up your slab, and join these fun-loving, inhibition-free sweethearts as they explore each other to the max!Enjoy!",
  "models": [
    {
      "name": "Ace Adams",
      "person_id": 33083
    },
    {
      "name": "Lucas Owens",
      "person_id": 33182
    },
    {
      "name": "Trent Ferris",
      "person_id": 33181
    }
  ],
  "release_date": "2014-03-25",
  "scene_id": 63923,
  "series": "NDT - 8225 - Trent Ferris, Ace Adams & Lucas Owens",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Condom",
    "Dark Hair",
    "Hardcore",
    "Interracial",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Twink",
    "Uncut cock"
  ],
  "title": "Lucky on the Flip"
}