{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Cole Christiansen is a little nervous. Slated to film his first scene with a guy, he sits at the shoot house taking in the environment, and is getting sort of freaked out. Worried that he might not be able to perform, Cole is glad to see Drake Tyler come through the door the day before they're scheduled to shoot. Drake's been through this before, so his experience immediately soothes Cole's worries, and when Cole asks him for some pointers, Drake is more than willing. Retiring to a private room, Drake walks Cole through the process, slowly unzipping his pants and uncovering Cole's nice cock. Falling to his knees, Drake immediately begins to work it up, and Cole responds, growing thicker and thicker with each stroke. Cole realizes that this isn't going to be as tough as he thought it would, and begins to even get turned on, so much so that he pushes Drake onto the bed and tears his clothes off, massaging his ass before plunging his hard cock deep inside Drake. Drake screams a little upon insertion and then reaches back to grab his cheeks, spreading them wide to accommodate Cole as he pumps and pounds away. Cole fucks Drake all over the room, from behind, beneath, then dive bombing from above, before wetting Drake with his milky load. Drake, sated and exhausted, remarks that if Cole performs like that in front of the camera, he'll have no problems. Ha.Enjoy!",
  "models": [
    {
      "name": "Cole Christiansen",
      "person_id": 29120
    },
    {
      "name": "Drake Tyler",
      "person_id": 32530
    }
  ],
  "release_date": "2014-04-10",
  "scene_id": 64315,
  "series": "NDB - 4492 - Cole Christiansen & Drake Tyler",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Undressed Rehearsal"
}