{
  "collections": [
    "High Performance Men"
  ],
  "description": "HighPerformanceMen.com is pleased to be the 1st to present Porn Legend Jon Galt and his life partner Vic Rocco in their initial return to porn performance. These two men are the epitome of what a High Performance Man is all about! Masculine, Confident and Sexy as Hell! The two embrace in a deep passionate kiss as their hands explore each other's hard bodies. Soon their tank-tops are off revealing their ripped physiques as each explores the other with his tongue. They bury their tongues into each other's ripe arm pits which intensifies their desire for each other. Soon their jeans are down around their knees and their cocks are struggling to break free from the confines of their jock-straps.  Jon is the first on his knees as he does his best to take all of Vic's enormously long and thick cock down his throat. Vic then returns the favor by deep throating every inch of Jon's big cock. Vic then bends Jon over and drives his tongue deep into Jon's eager hole. Jon begs for more as Vic begins to finger his hole deep and hard. He then spins Jon around and sucks his cock some more getting him all worked up before fucking him. The two then grind against each other as they spit on each other's cocks and stroke each other. Vic then bends Jon over and drives his massive cock deep inside Jon's muscular ass. At first the rhythm is slow and steady and then he drives his cock harder and deeper as Jon begs for more. Next Jon is laid out on his back as Vic pounds his hole long and deep. Unable to hold back any longer, Jon shoots a thick load all over his hairy stomach as Vic bends over and sucks out the last few drips of cum which is causing Jon to squirm in joy and laughter as he is very sensitive. Jon then drops to his knees as Vic shoots a thick creamy load all over Jon's chest and then Jon sucks out the last remaining drops of Vic's cum. </br></br>Enjoy!",
  "models": [
    {
      "name": "Jon Galt",
      "person_id": 34090
    },
    {
      "name": "Vic Rocco",
      "person_id": 33907
    }
  ],
  "release_date": "2014-05-02",
  "scene_id": 64412,
  "series": "Jon Galt And Vic Rocco",
  "tags": [],
  "title": "Passionate Couple"
}