{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For Markie More, the big day is here. The first day of the rest of his life. As he dresses nervously for his wedding, something seems amiss. Perhaps it's just the standard wedding jitters, or maybe it's something more. As his groomsmen, Cole Christiansen and Steven, come to grab him to go, they can sense something is not quite right, and so they sit him down to hash it out, and that's when Markie drops a secret on them. Turns out he's having second thoughts because he can't stop thinking of a liason back in college with a couple of guys. He tells them he's been having dreams about getting fucked by a guy, and he's not sure he wants to get married afterall.Sensing the gravity of the situation, Cole & Steven decide to help out their best friend, so they simultaneously begin to undress. Confused, Markie watches them a little puzzled, until Cole assures him they are here to help. With that, Steven shoves his cock into Markie's mouth, slamming it down his throat as Cole takes off his pants. Once disrobed, Cole stands on the other side of Markie, and Markie trades off, first with Steven's dick, then moving to Cole's, then just shoving both cocks in his mouth at the same time. As good as this feels, this ain't no pleasure cruise, so Cole quickly gets down to business, penetrating Markie's virgin ass from behind, as Steven continues to feed Markie cock on the front end. After flipping Markie over, Cole and Steven switch, and Steven gets behind Markie, pumping him hard and fast. Markie strokes himself as Steven continues to pound away, losing his load as he sucks on the head of Cole's dick, before Cole also explodes all over Markie's face, leaving only Steven, who pulls out and blasts Markie with his third load. Quite the introduction for Markie, and one that could have a lasting effect on his future.Is that bride still waiting at the chapel? She might be going home disappointed today.Enjoy!",
  "models": [
    {
      "name": "Cole Christiansen",
      "person_id": 29120
    },
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Steven B",
      "person_id": 33417
    }
  ],
  "release_date": "2014-04-24",
  "scene_id": 64411,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Beefy",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Condom",
    "Facial",
    "Hardcore",
    "Oral",
    "Straight Men",
    "Tattoo/Piercing",
    "Threesome",
    "Uniform"
  ],
  "title": "Wedding Jitters"
}