{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Johnny Diesel picked the wrong day to come cruising the alley for Johns. Sure, Damien West seems like the perfect mark, but unfortunately for Johnny, Damien is working undercover and has busted him red handed. When Officer Diesel White shows up on scene, Johnny realizes the severity of the situation, so when the two cops offer to settle this without paperwork, Johnny is more than willing to accomodate their demands. Almost immediately, both Damien and Diesel pull out of their clothes and shove their cocks collectively into Johnny's face. Johnny takes Damien into his mouth, downing his shaft as Diesel looks on, then Johnny switches and Damien fucks his throat as Damien watches. As Johnny sword fights with both cocks in his mouth, he strokes his own cock, not at all put out by all this 'cop dick' in his face. But Damien looking for more than just a simple beej, so he pulls Johnny's pants off and leans him up against a barrel, bending him over and entering from behind, punishing Johnny with his thick cock as Johnny continues to suck Diesel off. Spinning Johnny around, the two guys switch places and it's Diesel's turn to ram the perp, and they trade off like that until they've both had their fill, spewing their loads all over Johnny's waiting back. '2 good busts,' says Damien, and Diesel has to agree.Enjoy!",
  "models": [
    {
      "name": "Damien West",
      "person_id": 2533
    },
    {
      "name": "Diesel White",
      "person_id": 32662
    },
    {
      "name": "Johnny Diesel",
      "person_id": 33257
    }
  ],
  "release_date": "2014-04-17",
  "scene_id": 64465,
  "series": "NDB - 4493 - Damien West, Diesel White & Johnny Diesel",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock",
    "Uniform"
  ],
  "title": "Deep Undercover"
}