{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Where there's smoke, there's fiery hot sex.  When Scott Bridgeton and his friend Zander Williams return to Scott's place after a leisurely day at the county fair, Scott notices an unfamiliar pair of shoes left by the entryway.  He's suspicious, but the two head into the kitchen to relax.  It's not long before they experience something even more unusual. A lamentation from the bedroom rings into the kitchen, 'Shove that cock in my mouth!' Scott creeps over to the bedroom door to investigate.  Sure enough, when he gently nudges the door open a bit, he spies his boyfriend, Tyler King, sucking the long, hard dick belonging to Tyler's 'friend,' alleged straight boy, Jake Tyler.   Infuriated, but strangely aroused, Scott bursts in the room, with Zander following him.  Tyler, shocked, begins to apologize.  But as he does, Zander takes the opportunity to do something he's dreamed of for a long time.  Grabbing Scott, Zander plants a passionate kiss.  Scott kisses back with equal intensity as Tyler and Jake watch with surprise and confusion.   'You guys continue.  We're gonna watch,' Scott says to his boyfriend and Jake.   Scott and Zander strip their clothes off and soon Scott is sucking Zander's swollen cock.  Jake makes a move and licks Tyler's sweet ass for a while before standing up and pushing his erection inside Tyler.  As they fuck hard, Scott leans over and kisses Tyler, as if to say, 'This sure is fun!'  The foursome then switch things up when the professed straight Jake acquaints himself with Zander.  He pounds him hard as Tyler rides Scott right next to them.  Join these incredibly hot boys for this very emotionally charged scene where straight boys push their limits, friends indulge deep desires, and a couple expands their sexual horizons.    Enjoy!",
  "models": [
    {
      "name": "Scott Bridgeton",
      "person_id": 33430
    },
    {
      "name": "Tyler King",
      "person_id": 33431
    },
    {
      "name": "Zander Williams",
      "person_id": 33433
    },
    {
      "name": "Jake Tyler 2",
      "person_id": 2
    }
  ],
  "release_date": "2014-04-22",
  "scene_id": 64479,
  "series": "NDT - 8229 - Scott Bridgeton, Tyler King, Jake Tyler & Zander Williams",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Condom",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Latino",
    "Masturbation",
    "Oral",
    "Orgy",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Cheating Boyfriend"
}