{
  "collections": [
    "Next Door Twink"
  ],
  "description": "It's just a chill-back type of lazy afternoon over at Trevor Spade's house for Trevor and his friend Sam Truitt.  It's too hot outside for much activity, so the boys are watching some daytime television.  When Trevor notices Sam is squeezing and playing with something chubbing up in his pants, Trevor asks Sam if he needs any 'help.' Sam's not one to turn down some sexy action, so Trevor dives right in and pulls out Sam's incredibly large cock.  It's already pulsating, ready to be sucked.   As Trevor enjoys Sam's thick meat, they notice a camera-mounted remote control vehicle cruising the room.  Trevor knows it belongs to his roommate, Trent Ferris.  Trevor and Sam aren't trying to put on a show, so they find Trent and make him pay!  First Trent is pulling some sucking duty on Sam while Trevor fattens up Trent's big dick.  Soon Trent is facing even harsher consequences as Sam slides his bare cock into Trent's sweet, tender hole.  While he gets fucked, Trent enjoys a face fucking from his roomie, Trevor.  Next it's Trevor's turn for serious revenge.  Sam sits down on his firm, uncovered dick and takes a hot ride.  Watch Trent bounce with pleasure while Trevor pounds upward into his beautiful ass.  And it's not over until Sam gets another turn.  Catch this explosively fun, spontaneous three-way bang session as these pals take a relaxing afternoon at home to a whole 'nother level! Enjoy!",
  "models": [
    {
      "name": "Trent Ferris",
      "person_id": 33181
    },
    {
      "name": "Trevor Spade",
      "person_id": 33495
    },
    {
      "name": "Sam Truitt",
      "person_id": 33496
    }
  ],
  "release_date": "2014-05-06",
  "scene_id": 64798,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "Under Surveillance"
}