{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "All Jaxson Colt has to do to become a Next Door Exclusive is make it through the day. Seems simple enough until you realize that Johnny Smash and Ryan Knightly are not going to make it easy for him. Charged with the task of breaking in the young Colt, the guys have a plan to haze, bully and generally make Colt's life hell. But what they don't realize is that Colt kind of gets off on that treatment, so when they begin ripping off his clothes, spanking, pinching & choking him, he protests just enough to let them think they're getting the best of him, but not enough that they have any thoughts of stopping. After hazing them together, Ryan leaves Johnny to finish the initiation, and Johnny immediately shoves Colt's head down into his cock, where Colt takes it in his hand and then into his mouth, gagging on it as he bobs up and down. Johnny throws his head back and enjoys Colt's attention to detail, as Colt flicks his tongue all around Johnny's head and works it up and down his shaft. Johnny can't wait, so he flips Colt over and begins to moisten up his hole, tonguing it and then plunging his finger deep into Colt slowly, as Colt closes his eyes and inhales deeply. Johnny then replaces his finger with his hard cock, sliding it into Colt as he lay on his back. All pretense lost, Colt grabs him by his ass and pulls him in deeper, and Johnny thrusts back and forth pounding Colt every which way, until they are both ready to shoot their loads all over each other.Enjoy!",
  "models": [
    {
      "name": "Jaxon Colt",
      "person_id": 27717
    },
    {
      "name": "Johnny Smash",
      "person_id": 32794
    },
    {
      "name": "Ryan Knightly",
      "person_id": 32051
    }
  ],
  "release_date": "2014-05-01",
  "scene_id": 64817,
  "series": "NDB - 4495 - Johnny Smash, Ryan Knightly & Jaxson Colt",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Condom",
    "Facial",
    "Facial Hair",
    "Fraternity",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Initiation"
}