{
  "collections": [
    "Next Door Twink"
  ],
  "description": "After a grueling practice where Coach was less than lax, Johnny Maxim and Santiago Figueroa take a serious chill out moment to recount the training session.  Johnny has seen his wrestling teammate check him out recently in the locker room and even make some unorthodox 'grabs' on the mat.  Now Johnny will test exactly how far Santiago is willing to push post-conditioning activity.Johnny recalls to him how Coach had mentioned he wants the wrestlers to get in some 'extra practice.' Santiago takes this as a cue to goof around a little and grapple with sweet Johnny right there on Johnny's parents' bed.  Before too long, Santiago notices Johnny is packing a totally nice erection under his tights.  Santiago wants to take a look at this massive hard on, so he peels Johnny's singlet off and licks the strong boner.  Soon Johnny is enjoying Santiago's soft lips slurping his large thang, taking it deep, using plenty of slippery juiciness from his mouth.  Then it's Johnny's turn to taste Santiago.  Santiago can't believe how good a cocksucker Johnny is!  It's enough to make Santiago's ass hungry for stiff dick.  Watch Johnny insert and pound his fat, hard dong into his friend's tight hole in every way they can before they both explode in a hot, ecstatic frenzy.  This is the type of routine every good, young wrestler should engage in when approaching an important meet...or meat? Enjoy!",
  "models": [
    {
      "name": "Santiago Figueroa",
      "person_id": 33346
    },
    {
      "name": "Johnny Maxim",
      "person_id": 33357
    }
  ],
  "release_date": "2014-04-29",
  "scene_id": 65001,
  "series": "NDT - 8230 - Johnny Maxim & Santiago Figueroa",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Condom",
    "Dark Hair",
    "Hardcore",
    "Interracial",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink",
    "Uniform"
  ],
  "title": "Training Tight"
}