{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Sam Truitt is a bit nervous.  It's his first day on the job and he's filling in for another pool boy who's taken ill.  Sam's just hoping to do good work and hang on to this job.  But as he's walking around the poolhouse, gathering toys to throw back in the water, something very interesting catches his eye.  He spies Aiden Summers, the young resident of the poolhouse, lounging in a brightly colored pair of underwear, stroking his own clearly swollen cock.Sam unconsciously begins rubbing his own chubbifying dick.  Suddenly, by accident, Sam makes a loud noise against the window.  Aiden looks over and sees him.  But surprisingly, he motions for Sam to come inside.  Sam enters through the nearest door, walks into Aiden's room, and sits on the loveseat next to him.  Without exchanging many words, the two begin passionately kissing.  Soon Sam has removed Aiden's cock from the delightful undies and is stroking it.  Sam comes out of his clothes and Aiden takes Sam's raging-hard cock into his mouth.  He bobs deep on it, twisting his head up and down, back and forth for the pleasure of his new friend Sam.  Then it's Sam's turn, as he wraps his tender lips around Aiden's firm erection.  He slurps and sucks while looking into Aiden's eyes.  Then Sam stands up, positions Aiden, and inserts his throbbing dick into Aiden's tight hole.  He fucks him hard while jerking Aiden's large, stiff boner.  Then they switch things; Sam climbs on top of Aiden for a ride.  Sam can't believe he's fucking the client on his first day!  But nothing has ever felt as good as Aiden's fattie slamming in and out of his ass.  And the encounter isn't over until both boys erupt on a hot, gooey explosion of passion.Enjoy!",
  "models": [
    {
      "name": "Aiden Summers",
      "person_id": 32906
    },
    {
      "name": "Sam Truitt",
      "person_id": 33496
    }
  ],
  "release_date": "2014-05-13",
  "scene_id": 65108,
  "series": "NDT - 8232 - Sam Truitt & Aiden Summers",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Poolhouse Playmates"
}