{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Stepbrothers Zander Williams and Jake Tyler have been getting along very well together, ever since Jake's dad married Zander's mom a few months back.  They share common interests and love to joke around.  It doesn't hurt that Zander thinks Jake is really, really hot!Today as Jake retires to his bathroom to take a shower, Zander decides to do a little snooping to find out what kind of sexual habits Jake has.  To his chagrin, he finds in Jake's drawer a glass dildo and a lifelike, girthy cock.  He doesn't hesitate to give the glass toy a try.  As Zander works the pleasure tool in and out of his tight, virgin hole, Jake spies him from the bathroom door.  Naked and with a fully throbbing erection, Jake quietly approaches, startling Zander when he reaches the bed.  He reassures Zander by telling him of the amazing pleasure he's had with that particular item.  Zander reluctantly lets Jake take control of the dildo for a while.  'WOW!' Zander thinks.  Jake sure knows how to use this thing.  It doesn't take long before Jake is slurping on Zander's incredibly hard dick.  Then, with a little coaxing, Jake convinces Zander to try sucking some cock.  Jake is amazed by how well Zander fellates for his first time.  But it's not the only first-time experience Zander's having today.  Jake gets Zander to climb on top of his bare cock and take it for an exhilarating ride!  After getting used to Jake's large cock, Zander lays on his back so Jake can slam his virgin ass even harder.  You won't believe how explosively sexy this incredible encounter becomes when these two outrageously hot boys cum together for the first time. Enjoy!",
  "models": [
    {
      "name": "Zander Williams",
      "person_id": 33433
    },
    {
      "name": "Jake Tyler 2",
      "person_id": 2
    }
  ],
  "release_date": "2014-05-27",
  "scene_id": 65479,
  "series": "NDT - 8234 - Zander Williams & Jake Tyler",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Toys",
    "Twink"
  ],
  "title": "Unexpected Sleepover"
}