{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "With his wife out of town on a business retreat, Connor Maguire is loving his free time at home. No nagging, no bullshit arguments... just peace and quiet and a few cans of beer. Only thing is, he'd sort of like to get some action while she's away. After running into Dante Martin at the gym, the two guys are watching a game and recounting sexual frustrations with their respective significant others, when Dante just says 'Fuck it,' and starts rubbing his cock right there on the sofa. Connor is both shocked and a little intrigued by his friend's frank display, but reasons that it might be the only action he gets, and before you know it, both the guys are on Connor's bed, with Dante ripping off Connor's jeans and immediately gorging on his stiffening cock. </br></br>Connor takes a deep breath and then exhales, slowly coming to the conclusion that Dante sucks him off better than his wife ever could, and before he knows it, Connor is consumed with the act, turning Dante over on his knees and plunging his tongue deep into Dante's waiting hole. Dante clutches the bed covers Connor's tongue darts in and out of him, until he can wait no longer, begging Connor to fuck him hard. </br></br>Connor obliges, thrusting his hard cock in and out of Dante from behind, before turning him over and pounding him missionary as Dante strokes himself off. Connor throws Dante's legs over his shoulders, pointing Dante's cock straight back towards him, as Dante launches his load all over his own face, before Connor pulls out and wets him with a load of his own.</br></br>Enjoy!",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 26412
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    }
  ],
  "release_date": "2014-06-05",
  "scene_id": 65532,
  "series": "NDB - 4500 - Connor Maguire & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Climax",
    "Dark Hair",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Latino",
    "Masturbation",
    "Oral",
    "Red Head",
    "Straight Men"
  ],
  "title": "Bromance"
}