{
  "collections": [
    "Next Door Twink"
  ],
  "description": "You know when it's your boyfriend's birthday, and you wanna get him the perfect gift?  Well take a tip from Lucas Owens.  His boyfriend, Trent Ferris, is celebrating a very special birth anniversary and Lucas has planned for a super hot, hard-bodied stud to show up and get naked.  Trent would've never expected to see the incredible Johnny Diesel show up, ready for hot action! But before Johnny arrives, Lucas is sucking Trent's cock in the morning to wake him up and prepare him for the treat.  Lucas knows Trent's dick is always pretty firm in the morning, and with some nice, passionate licking and bobbing, it'll be just right for Johnny.  When Johnny finally enters Trent and Lucas's bedroom, he removes his shirt immediately and allows Trent to pull out his throbbing dong.  Trent is so surprised and elated, all he can do is slurp on Johnny's big, thick member.  Lucas trades off with him, sharing the hot stud's boner.  Then Trent lays back to enjoy a blowjob from their guest, while Lucas smooches Trent, giving lots of birthday love.  Then Trent gets in doggy position, letting Johnny insert his man meat into Trent's tight, eager hole.  Lucas continues kissing and caressing both guys while Trent takes a hard pounding.  Then it's Lucas's turn to get fucked.  Trent lays his boyfriend down and slides his pulsating cock into his warm ass.  Lucas sucks Johnny while being slammed nice and proper.  It's a very unexpected, very hot birthday party. Enjoy!",
  "models": [
    {
      "name": "Johnny Diesel",
      "person_id": 33257
    },
    {
      "name": "Lucas Owens",
      "person_id": 33182
    },
    {
      "name": "Trent Ferris",
      "person_id": 33181
    }
  ],
  "release_date": "2014-06-03",
  "scene_id": 65749,
  "series": "NDT - 8235 - Johnny Diesel, Trent Ferris & Lucas Owens",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "Birthday Boy Toy"
}