{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Justin Visic is a successful young man that prefers to keep his home immaculately clean.  This afternoon, he's noticed some serious smudges on his windows.  They must be from the party he threw a few days ago.  Being a very busy dude, Justin usually hires a service from the paper to do his house cleaning.  A window cleaning service catches his eye while reading the paper.When the boy from the service arrives and meets Justin, some sparks instantly fly.  His name is Caden Brooks, and he's exactly Justin's type.  With a muscular build, Caden is very cute and looks like a bad boy.  Justin decides to relax in his living room and watch this hot guy work on the windows.  As he looks, Caden throws lustful glances at Justin.  When the moment feels just right, Justin bounces up, walks to the window in front of Caden, and pulls out his large dick.  Caden smiles and plays along, pulling down his pants to show his plump ass.  It's not long before Justin opens the door and pulls Caden inside.  They remove their clothes while kissing passionately.  Justin gets on his knees for a nice taste of Caden's sweet hole.  Then Caden turns around and sticks his hard cock into Justin's warm mouth.  Caden can't believe a client is slurping on his throbbing meat!  They move to a chair where Caden reciprocates by bobbing on Justin's thick boner.  Then Caden decides to take full advantage of the situation.  He climbs on top of Justin's dick and rides it good.  Then Justin moves them both to an ottoman where he continues pounding sweet Caden's amazing ass.  Join these tasty guys as they turn a simple window cleaning appointment into a hot, steamy sex encounter.  Enjoy!",
  "models": [
    {
      "name": "Caden Brooks",
      "person_id": 33983
    },
    {
      "name": "Justin Visic",
      "person_id": 33982
    }
  ],
  "release_date": "2014-06-17",
  "scene_id": 65879,
  "series": "NDT - 8237 - Justin Visic & Caden Brooks",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Condom",
    "Facial",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Window Tease"
}