{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Pro-tip: Do not challenge James Jamesson to a dick measuring contest unless you are prepared to accept the consequences of losing. Jaxon Colt learned this lesson the hard way... the very hard way. After their run together, Jaxon notices James' unit flopping around in his shorts, and devising a plan to get him some of that, he proposes a wager that James cannot refuse. Whipping their dicks out, it's pretty obvious this was all just Jaxon's ruse to get James' meaty cock out into the open, and now that it's out, it's only polite to take care of it, so Jaxon falls to his knees and takes James deep into his mouth, deep throating the entire shaft and then licking his balls before tonguing James all the way out to the head, then gagging himself on it all over again. James throws his head back as Jaxon works his dick, and then he situates Jaxon on a bench, ass up in the air, and begins to tongue his hole. As Jaxon holds onto the bench, James plunges his cock deep into Jaxon and begins to pound his ass in a sunlit veranda, as Jaxon closes his eyes and feels every inch of James thick cock. James flips Jaxon over and continues to pound away. As Jaxon strokes himself off, James pulls out and douses him with a gigantic load that makes an utter mess of Jaxon's stomach as Jaxon explodes all over himself. Laying there, fucked and cum-covered, it's hard to know who really 'won' this bet.Enjoy!",
  "models": [
    {
      "name": "James Jamesson",
      "person_id": 9526
    },
    {
      "name": "Jaxon Colt",
      "person_id": 27717
    }
  ],
  "release_date": "2014-07-03",
  "scene_id": 66157,
  "series": "NDB - 4504 - James Jamesson & Jaxon Colt",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Run Chubby"
}