{
  "collections": [
    "Next Door Twink"
  ],
  "description": "In an empty bathroom, Silas Gray pulls out his penis and feels warm urine stream out into a urinal.  He'd been waiting to go for a little while and the relief is nice.  As he pees, another young man, by the name of Danny Forest, enters the bathroom and notices Silas's exposed ass cheeks.  Silas wants to stare, but knows he shouldn't.  He goes into the stall and notices a hole in the wall, perfect for spying on Silas as he continues to pee.  <br/><br/>Danny can't let an opportunity like this slip away with making some effort to at least get one little taste of this hot boy's cock.  'Pssst! Hey,' Danny says through the hole while looking still at Silas.  Silas turns and realizes exactly what those hungry, peering eyes mean.  He gladly sticks his erect dick through the hole, allowing Danny to suck it.  Danny can't believe this is happening!  He keeps his cool while slurping and enjoying the nice, stiff erection poking through.  Silas has no idea who's on the other side, but whoever it is, he thinks, sure knows how to give oral pleasure.  <br/><br/>But Silas is satisfied with just a hot blowjob.  He wants to taste cock too.  Danny slides his boner through this time and lets Silas handle the throbbing member.  This makes Silas crave hard cock in his tight hole.  After sucking for a while, he aligns his ass with the hole and Danny fuck him from the other side of the wall.  The hot pounding rocks the entire stall.  Then Silas lays on the bathroom floor to let Danny fuck him even deeper.  <br/><br/>It's an insanely hot, impromptu encounter, but all good things must end.  Will Danny and Silas actually meet each other before they part ways?  Will they even get a look at each other's faces?!  Find out here.<br/><br/><br/>Enjoy!",
  "models": [
    {
      "name": "Danny Forest",
      "person_id": 34093
    },
    {
      "name": "Silas Gray",
      "person_id": 34092
    }
  ],
  "release_date": "2014-07-08",
  "scene_id": 66232,
  "series": "NDT - 8240 - Danny Forest & Silas Gray",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "Glory Hole",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Slim",
    "Smooth",
    "Twink"
  ],
  "title": "Missed Connection (Part 1)"
}