{
  "collections": [
    "Next Door Originals"
  ],
  "description": "James is showing Dominic his private hiking trail on a blistering sunny day. It's a long walk to the destination but it's James' private place where you can lay out and be naked all day long without any worries. They finally reach their resting area and take off their heavy backpacks. They are shirtless already and Dominic has taken notice of James' ripping abs. James can tell he wants to touch them so he grabs his hand and lets Dominic explore his sexy body. His hands run up and down James' chest and back down to unzip his pants where his big fat uncut cock flops right out into Dominic's face. He takes it deep into his mouth so James' balls are resting on his chin as he fucks Dom's eager mouth. James loves to bring his buddies out here and he pulls this same trick on all his friends without fail. Dominic can feel his own cock coming to life so he gets out of his pants thinking James will blow him. James just wanted him naked so he could bend that sweet tight ass over and get balls deep in Dominic. James mounts him slowly and takes it easy on such a tight little ass. The pumping is almost too much for him to bear so he flips him over onto his back for more comfort. With legs spread wide Dominic is taking that fat throbbing cock all the way in like a champ. It's super-hot and they are both sweating like pigs so they decide to jack off on one another. Using their spit as lube they both blow creamy loads all over Dominic's chest. </br></br>Enjoy!",
  "models": [
    {
      "name": "Dominic Reed",
      "person_id": 31461
    },
    {
      "name": "James Huntsman",
      "person_id": 16691
    }
  ],
  "release_date": "2014-07-11",
  "scene_id": 66326,
  "series": "NDW - 112 - James Huntsman & Dominic Reed",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Outdoor",
    "Tattoo/Piercing"
  ],
  "title": "Bro Hike"
}