{
  "collections": [
    "Men Over 30"
  ],
  "description": "Sean is staying at a luxury hotel for his first vacation in a very long time. It's all about relaxing for him and only paying attention to himself and leaving the outside world behind. He's sitting on his couch rubbing on his cock watching some porn and just when he's about to pull out his cock the doorbell rings. In comes Diesel who is hired to change the sheets and bedding plus any other special accommodations. Diesel notices that Sean is watching porn and it becomes very awkward when Sean stands up to give him his tip. Diesel thanks him and heads off to his daily duties. Now that he has been interrupted Sean decides to take a quick shower. While in the shower Diesel sneaks back into the room very quietly as he tiptoes around looking for Sean. He can hear the shower going and he peeks in to see Sean fully naked soaked in water rubbing his manly body. Diesel is licking his lips with joy while rubbing his hard cock through his thin pants. After a few minutes of watching Sean shower so gracefully he steps out of the shower and notices Diesel standing in the doorway with towels for him. Sean is stunned that he is in his room let alone the shower but Diesel reassures him that everything will be alright. He takes Sean by his dick and brings him into the bedroom where he starts to suck on his throbbing cock. Sean loves the service as he feels Diesel's tongue licking his shaft up and down. Diesel manhandles Sean in every way possible as he pushes his legs up high over his head and licks his ass cleaner than a shower ever could. His cock now enormous and throbbing in his white pants, Diesel takes it out and fucks Sean's tight hole. His cock is thick and hard as he pushes slowly into Sean and at times pumps fast, making him love every inch of it. Eventually Diesel leaves a hot creamy load all over Sean's eager face. Service with a smile is Diesel's motto.  Enjoy!",
  "models": [
    {
      "name": "Diesel Washington",
      "person_id": 28049
    },
    {
      "name": "Sean Duran",
      "person_id": 28079
    }
  ],
  "release_date": "2014-07-29",
  "scene_id": 66485,
  "series": "MOT - 433 - Diesel Washington & Sean Duran",
  "tags": [],
  "title": "Room Service Part 1"
}