{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "It's a beautiful summer day and Jaxon Colt has some pretty sweet plans: having already cleaned the pool, Jaxon has all the fixings for a nice ice cream sundae, but no one to share it with, so he calls his old friend Kaydin Bennett over for some sun and fun. Sitting outside, Kaydin helps himself to a nice soft serve treat, but what he really wants is something a little harder. Shooting a look over at his friend, Kaydin realizes that Jaxon is down with the program, so the guys set their bowls aside and Kaydin moves on Jaxon right there on the patio. Climbing on top of him and working his way down Jaxon's sun-kissed body, Kaydin opens Jaxon's fly and pulls his cock out, taking it into his mouth as he runs his hands along Jaxon's chest. Jaxon throws his head back in appreciation, then sits up to undress Kaydin, returning the favor and gagging on Kaydin's stiff member. Kaydin, now hot, hard and horny, bends Jaxon over the recliner and plunges his cock deep into Jaxon, as Jaxon clutches the legs of the chair while Kaydin pumps from behind. The sun beats down as Jaxon lays ass up in the air and Kaydin continues to pound from behind, then the guys switch, and Jaxon rides Kaydin, grinding his body on Kaydin's pole as he strokes himself off, spewing his dripping load all over Kaydin's chest. Jaxon dismounts and Kaydin bust his nut all over Jaxon's face. Sure it's a different kind of cream, but it makes for a sweet ending nonetheless.",
  "models": [
    {
      "name": "Jaxon Colt",
      "person_id": 27717
    },
    {
      "name": "Kaydin Bennett",
      "person_id": 34230
    }
  ],
  "release_date": "2014-07-24",
  "scene_id": 66566,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Climax",
    "Condom",
    "Facial",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Outdoor",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Double Dipping"
}