{
  "collections": [
    "Next Door Twink"
  ],
  "description": "They had what they thought would be a one-time fling...until Silas Gray became hungry for more.  He became too hungry to let it just fade into a distant memory.  The dick that Danny Forest anonymously pushed inside his sweet ass was too good.  The faceless boy on the other side of that bathroom stall at the gym felt like none other he'd experienced.Silas posted an ad in the Missed Connection section of Craigslist.  To his surprise that mysterious, well hung guy replied.  He had a feeling the chemistry was too strong for both to forget.  Danny agreed to meet Silas at Silas's house, as Silas had explained his parents were out of town.  Danny showed up told Silas he was the first guy he'd ever had sexual contact.  This fact made Silas's cock even harder than it already had been since the experience.  They wasted little time before Silas ripped Danny's shirt off and began sucking and licking his nipples.  Soon after Silas was sucking Danny's erect dick fervently.  Danny could hardly believe the intense rush of sensual feeling.  Danny then reciprocated with a passionate blowjob.  Then Danny did something he had only fantasized about.  Silas bent over the couch and let Danny taste his tight hole.  A little later, Danny slid his rock-hard cock into Silas, feeling the incredible tightness and warmth.  They fucked hard.  Danny moved around to the back of the couch where he continued to slam Silas's cute, plump bottom.  Come watch these two, no-longer-anonymous boys let their hunger for raw, unrestrained sex run free.Enjoy!",
  "models": [
    {
      "name": "Silas Gray",
      "person_id": 34092
    },
    {
      "name": "Danny Forest",
      "person_id": 34093
    }
  ],
  "release_date": "2014-08-05",
  "scene_id": 66647,
  "series": "NDT - 8244 - Danny Forest & Silas Gray",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Blonde",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Missed Connection (Part Two)"
}