{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Tyler Morgan wants to learn to dance.  He was referred to an instructor by a good friend.  Not only does Marco Russo come with an excellent reputation, he also is supposedly extremely hot.Sure enough, Tyler sees that the latter is true upon Marco's arrival.  They get right into the lesson after Marco explains that he won't tolerate less than full effort from a student.  As they work with each other, Marco takes liberties that make Tyler a bit hot and bothered.  He keeps coming in close and placing his hands on Tyler's hips, moving Tyler's ass right up against Marco's own dick.  Eventually, Tyler realizes Marco's cock has become hard.  The music and the rhythm take over and Tyler makes a crazy, improvised move.  He spins around, unbuttons Marco's shirt, and goes to his knees, feeling Marco's boner.  Marco doesn't stop him, so Tyler proceeds to take out Marco's fat erection and suck it.  Marco's face shows how incredible it feels to him.  He's never had a student slurp his hard dick.  After, they move to a bench where Marco returns the gesture by taking Tyler's nice, large cock into his mouth.  Marco stares deeply into Tyler's gorgeous eyes while sucking him.  Then, Marco decides to see if Tyler will let him fuck his ass.  Indeed, Tyler accepts Marco's pulsating dick.  He pounds him hard as the sun shines through the glass windows and doors into Tyler's makeshift dance studio.  Join them as they work up to an incredible explosion of rhythmic energy.  Enjoy!",
  "models": [
    {
      "name": "Marco Russo",
      "person_id": 34329
    },
    {
      "name": "Tyler Morgan",
      "person_id": 31264
    }
  ],
  "release_date": "2014-08-12",
  "scene_id": 66816,
  "series": "NDT - 8245 - Tyler Morgan & Marco Russo",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Dirty Dancing"
}