{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For Mark Long and Colt Rivers, life on the run is proving to be an adventure. Finding temporary refuge in a random pool house, these two fugitives have to stay alert and aware, lest they be captured and returned to the Big House. And maybe it's the excitement of the situation or just the notion of going back to jail, but Mark is getting that sensation in his pants and looking to satisfy his urge. Colt sees him fondling himself and can't believe Mark's instatiable sexual voracity in such a tense moment. Mark appeals to Colt to 'take care of him' one more time, for old time's sake, and Colt reluctantly agrees, taking Mark's already stiff cock into his mouth as Mark unzips his jumpsuit and strips out of his prison issued uniform. Colt gags on Mark's meat as Mark grabs him by the back of the hair, shoving his cock down Colt's throat and eye-balling Colt's sweet ass. Colt bobs up and down on Mark's dick, getting it nice and hard, then crawls up Mark's body and straddles him, ready to mount his partner in crime. <br/><br/>Mark slides his cock deep into Colt as they both moan a familiar sigh of pleasure. Colt begins to ride and grind on Mark's cock before Mark turns him over and pounds him from behind. Throwing caution to the wind, Mark and Colt become consumed in their act, pumping each other in anticipation of that sweet load, which both guys launch simultaneously all over Colt's stomach, as a passer-by startles their attention. They may or may not be headed back to the pen, but Colt has already had his fair share of the slammer for one day.<br/><br/>Enjoy! ",
  "models": [
    {
      "name": "Colt Rivers",
      "person_id": 34306
    },
    {
      "name": "Mark Long",
      "person_id": 18862
    }
  ],
  "release_date": "2014-08-07",
  "scene_id": 66997,
  "series": "NDB - 4509 - Mark Long & Colt Rivers",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Dark Hair",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Oral",
    "Rimming",
    "Straight Men",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Fugitive Fuckers"
}