{
  "collections": [
    "Next Door Twink"
  ],
  "description": "As the boys return to the locker room after a hard-fought game on the diamond, they each breathe a sigh of relief now that playoffs are over.  Landon Terry, unofficial team leader in the morale department, issues a verbal invitation to his three teammates, Nick, Jake Piper, and Kaiden Haskins.  They all heartily accept the invite to Landon's house for a BBQ.  Who doesn't love a good, old-fashioned burger after playing hard?  When Landon asks how his friends want their burgers cooked, he can tell their responses suggest they're all in the mood for some fun, sexy action.  Landon and Kaiden begin making out while Nick and Jake work on their growing dicks.  That meat looks so good being sucked under the warm sun.  While the burgers continue to cook on the grill, the boys move to some patio furniture where the pace picks up.  Jake lets Nick slide his stiff cock into his ass.  Simultaneously, Kaiden licks Landon's sweet hole.  Jake uses the opportunity further by having a nice taste of Kaiden's hot dick.  Landon moves around to have a turn slamming Jake's tight hole.  Then the guys pair up for a while so Nick can fuck Landon hard and Jake can ride Kaiden.  Kick off your cleats and come along.  It's summertime and these boys are hungry for your tasty load!   Enjoy!",
  "models": [
    {
      "name": "Jake Piper",
      "person_id": 34221
    },
    {
      "name": "Kaiden Haskins",
      "person_id": 34347
    },
    {
      "name": "Landon Terry",
      "person_id": 16702
    },
    {
      "name": "Nick B",
      "person_id": 34220
    }
  ],
  "release_date": "2014-08-19",
  "scene_id": 66993,
  "series": "NDT - 8246 - Landon Terry, Nick, Jake Piper & Kaiden Haskins",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Brunette",
    "Condom",
    "Deep throat",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Orgy",
    "Outdoor",
    "Red Head",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Well Done, Boys"
}