{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Drake Tyler is caught between his sense of duty and his desire for booty. Charged with the task of painting a house, he just can't help his perverted curiosities, so when Mark Long, his employer, steps out for job, Drake seizes the opportunity to rummage around in Mark's drawers a little. And as much as he likes sniffing Mark's underwear, what he'd really like to do is come face to face with the real thing, so when Mark comes home and accuses Drake of going through his stuff, Drake realizes he'd better do something to change the subject before he gets fired. Thinking quickly, he tears Mark's shorts down and shoves Mark's cock into his mouth, gagging on it instantly, deep-throating it in hopes that Mark will have mercy on him. And even though Mark is not a tyrant, he's also not in the mood to let Drake off lightly, so he ups the ante on Drake, moving him into the bedroom and telling him to take off his clothes. Mark's boner is raging and Drake can sense what is about to happen, offering no resistance and doing everything Mark asks of him. Mark bends him over the side of the bed and plunges his cock deep inside of Drake as he grabs the bedsheet, clutching it as Mark's gigantic cock penetrates him. Mark pounds Drake from behind, below and above, putting Drake through a gamut of positions before wetting Drake with a gigantic load before Drake cums all over himself, promising to never mention this in polite company.Enjoy!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Drake Tyler",
      "person_id": 32530
    }
  ],
  "release_date": "2014-08-21",
  "scene_id": 67230,
  "series": "NDB - 4511 - Mark Long & Drake Tyler",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Outdoor",
    "Slim",
    "Tattoo/Piercing",
    "Workers"
  ],
  "title": "Nasty Paint Job"
}