{
  "collections": [
    "Next Door Twink"
  ],
  "description": "There he was, Ian Levine, pounding again at his laptop keyboard, hoping the damned contraption cooperate finally.  But nothing was working.  Ian picked up the phone and called the IT office.  Usually, the IT geeks that show up to fix tech problems are quite unattractive.  However, this time, a young man by the name of Rob has shown up to help Ian get back on track.  Ian cannot believe how gorgeous he is.  With his nerdy glasses and button-up IT garb, Rob looks scrumptious.  Rob can tell Ian is turned on.  He asks Ian if he's considered doing a 'full reboot.' Ian knows what's coming next.  Rob places Ian's hand on his cock to show him how fast it's already growing.  Before Ian can even catch his breath, Rob is sliding his nice, fat dick in and out of Ian's mouth.  An important executive assistant like Ian should NOT be engaging in explicit sexual acts at work, especially right in his own office!  But he doesn't have the will power to stop.  Next, Rob bends Ian over the desk and eats his sweet ass, enjoying ever bit of that tender hole.  When Rob pushes his swollen cock into Ian, Ian feels it throbbing.  He pounds Ian hard for a while before Rob lays on his back on the desk and lets Ian insert his own thick member into Rob.  Ian let's all inhibition fly out his corporate office window while banging this hot, geeky stranger.  And before these two young professionals blow their warm, sticky loads, Ian is riding Rob's boner, still while wearing his tie.  Even in moments of intense sexual passion, professionalism among employees is a must.Enjoy!",
  "models": [
    {
      "name": "Rob",
      "person_id": 34467
    },
    {
      "name": "Ian Levine",
      "person_id": 34468
    }
  ],
  "release_date": "2014-09-09",
  "scene_id": 67440,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Twink",
    "Workers"
  ],
  "title": "RAM Session"
}