{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For Luke Milan, it's just a typical weekend: wife is off running errands, and Luke has just finished some yard work outside. As he comes in to shower, a ring of the door bell distracts him and he opens the door to find his wife's brother, Mike Gaite. Mike comes over all the time, since he and his sister are pretty close, but lately Luke gets the sense that Mike's interest is not entirely familial. As Luke showers, Mike waits in the living room, and when Luke joins him fresh and clean, Mike's strategy goes into effect, as he begins to seduce Luke. Luke is pensive, but curious. He's never been with a man but there's something about Mike that has him considering it, and as Mike begins to gag on his cock, Luke realizes he's made the right decision. Luke pushes Mike's head down deeper onto his rod, choking Mike with his meatstick as he fingers Mike's waiting ass. Mike strips out of his shorts and perches himself on the sofa, clutching it's back as Luke slowly enters from behind, a look of satisfied pleasure on Mike's face as Luke's cock slides inside him. Luke, rumored to be a fucking machine, pounds Mike from behind, beneath, on top and every way in between as Mike just closes his eyes and takes it in, before falling to his knees and taking a blast from Luke's cock straight to the face, confirming for himself what his sister has told him about Luke's prowess.Enjoy!",
  "models": [
    {
      "name": "Luke Milan",
      "person_id": 27174
    },
    {
      "name": "Mike Gaite",
      "person_id": 34509
    }
  ],
  "release_date": "2014-09-04",
  "scene_id": 67543,
  "series": "NDB - 4513 - Luke Milan & Mike Gaite",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Straight Men"
  ],
  "title": " My Sister's Husband"
}