{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Old ranch hand, Cameron Foster, is used to working undisturbed under the hot, California sun most days.  He didn't expect Deputy Tyler Torro to come riding up in his cruiser that day.  Cameron hid behind some grape leaves while he watched what the Deputy began doing.  Officer Torro swung open his car door, pulled out his fat, hard cock and stroked under nothing but the beating sun.  Cameron watched with delight.  It made his own dick stiffen up a bit, so he pulled it out and tugged it, just like old Torro was doing.  But then Cameron caught hold of a wild idea.  So he snuck up on the Deputy and surprised him, just to see what would happen.  He figured he wouldn't get in any trouble if the Officer had his boner out too!  Just like Cameron figured, Officer Torro wasn't upset to see another fine cock, but was thrilled.  He let Cameron go in for a good, long taste of his own bulging erection.  Torro stood up out of the cruiser after some initial sucking and let Cameron go to town even more.  All this deep slurpin' and jerkin' got to Officer Torro pretty quick.  Before he knew it, he was sliding his stiffie inside Cameron's tender asshole, right there on his lunch break.  Cameron wasn't gonna argue.  He just enjoyed the nice, strong cock pounding him good.  And before either boy went back to work, they both got what they were hoping for from the start of the whole thing.  Funny stuff like that happens sometimes out here in Next Door County. Enjoy!",
  "models": [
    {
      "name": "Tyler Torro",
      "person_id": 13869
    },
    {
      "name": "Cameron Foster",
      "person_id": 16727
    }
  ],
  "release_date": "2014-10-09",
  "scene_id": 67730,
  "series": "NDW - 121 - Tyler Torro & Cameron Foster",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Tattoo/Piercing",
    "Uniform",
    "Workers"
  ],
  "title": "Farmer and the Fuzz"
}