{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Ryan Knightly loves sleeping in late on his days off.  Today, he's still in bed around noon, when FedEx delivery man, Conner Maguire, shows up at Ryan's place to drop off a package.  On his way to the front door, an open bedroom window catches Conner's eye.  He stops to take a peek and catches a few quick glimpses of a sleeping Ryan.  Conner is very turned on by what he sees, but narrowly escapes being discovered peeping in.  <br/><br/>He makes it to the front door where Ryan answers the doorbell in his underwear.  Conner now gets a full view of the sexy resident.  He asks Ryan if he can use his bathroom, and Ryan agrees.  As Conner pees with the bathroom door wide open, Ryan stands by the open door, touching himself, thinking of what Conner's dick might be like.  As Conner walks out of the bathroom, Ryan grabs him and kisses him in the hallway.  Ryan then leads him to a bedroom where clothes come off as they kiss, grab, and lick.  Soon Ryan is sucking Conner's large cock.  Conner can't believe an incredibly hot guy is servicing him in the middle of his work day! <br/><br/>Ryan pulls out a Fleshjack and the guys fit both cocks in at once to fuck it side-by-side, simultaneously.  What a wonderful experience, Ryan thinks!  Just when he doesn't think it could get any hotter, Conner agrees to let Ryan fuck his tight hole.  Ryan rubs his throbbing erection on Conner's ass crack for a while before pushing his cock into Conner's tight pocket.  After some nice fucking, the guys finish each other off with the Fleshjack.  Be a part of this impromptu work day break as Conner makes sure this package is hand delivered!<br/><br/> Enjoy!",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 26412
    },
    {
      "name": "Ryan Knightly",
      "person_id": 32051
    }
  ],
  "release_date": "2014-10-23",
  "scene_id": 67893,
  "series": "NDW - 122 - Ryan Knightly & Conner Maguire",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Climax",
    "Facial Hair",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Red Head",
    "Tattoo/Piercing",
    "Toys",
    "Uniform"
  ],
  "title": "Special Delivery"
}