{
  "collections": [
    "Next Door Male"
  ],
  "description": "We're sure you'll love 21 year old Jonny T. This stud of a young guy has it all. The body, the look and...THE cock.<BR/><BR/>We're glad Jonny T chose to break into the adult industry through NextDoorMale; meaning, this is his first scene ever. He's a virgin to the camera, which makes everything that much hotter.<BR/><BR/>We caught up with Jonny T the other day as he was playing a bit of tennis. After smacking the ball back and forth with his bud, he decided to take a break and douse himself with a bit of water. As he lay next to the net dripping wet, cooling off, he surprised us when he started to rub on his huge cock through his athletic shorts. Boy, that thing is monstrous, we were thinking. Once he was a bit hard, he took the thing out and began stroking himself right there on the court! We love this guy already!<BR/><BR/>That was just a tease though. Jonny T then put his big hog away and wondered off to go do some work in the vegetable garden. Here, after turning some mulch with the pitchfork, he again surprises us by yanking out his large member and tugging on it. This time, he pulls his pants all the way down and ducks out of sight from his friends as he continues to masturbate in the garden.<BR/><BR/>Since he didn't want to deal with cleaning up his cum while outdoors, Jonny T pulls up his drawers and runs into the house so he can finish himself off; and that's exactly what he does after grabbing an ice cold brew from the fridge. He plants his ass on the sofa and beats his meat until it's launching cum into the air and all over his cock and balls. After expelling his load, Jonny T dozes off for a mid-afternoon nap.<BR/><BR/> Enjoy Jonny T as he enjoys himself!",
  "models": [
    {
      "name": "Jonny T",
      "person_id": 5625
    }
  ],
  "release_date": "2007-09-10",
  "scene_id": 6795,
  "series": "2201 next door male",
  "tags": [
    "Amateur",
    "Big Dick",
    "Brunette",
    "Fraternity",
    "Outdoor",
    "Softcore",
    "Solo",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Jonny T"
}