{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Damian Black is super stoked that his parents are out of town, even though they didn't bring him with them on vacation to Hawaii.  He's taking advantage of the situation by calling up one of his favorite pals to party with, Tripp Townsend.  He knows the two of them will definitely 'turn up,' as they say, but Damian has another idea up his sleeve too.When Tripp arrives, the two boys crank up the music and let the drinks flow.  During some funky dancing around the guest house, both guys end up taking off their clothes, down to the undies.  When they sit down for a few minutes to chill out, Damian suggests they go skinny dipping in the pool.  Tripp agrees it's a good idea and the undies come off.  They jump into the pool and horseplay around for a while.  When Damian realizes the perfect opportunity to make a sexy move on his friend, he seizes it, moving in close and kissing Tripps legs, eventually working up to his mouth.  The boys make out for a while before going inside to a bed, where Damian wraps his mouth around Tripp's stiff, pulsating cock.  All he wanted was a thick boner to suck, and now he's bobbing on his own friend's large meat pole.  Tripp likes boners in his mouth too.  He lays Damian down on his back and takes Damian's cock between his lips, then deep past them.  The intense sensation makes Damian crave Tripp's ass.  They reposition and Damian slides his throbbing dick into Tripp.  Tripp watches himself intermittently in the bedroom mirror as his friend pounds his sweet, tight hole.  Come join these boys as they work together toward a passionate explosion.     Enjoy!",
  "models": [
    {
      "name": "Damian Black",
      "person_id": 34655
    },
    {
      "name": "Tripp Townsend",
      "person_id": 34656
    }
  ],
  "release_date": "2014-09-30",
  "scene_id": 68017,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "My Folks Are Out (Part One)"
}