{
  "collections": [
    "Next Door Twink"
  ],
  "description": "A sensibility for elegance is required when throwing a dinner party like the one JT Stryder's been planning.  He's invited 3 friends over to enjoy a delicious, four-course meal, including a surprise dessert.  Although all three invited confirmed they'd be there, only one, Seamus O'Rilley, has actually shown up.  Seamus and JT have only met once before, but JT decides this could be an opportunity to get to know sexy Seamus better.<br/><br/>JT shows Seamus to the dining table where he pours him a glass of wine.  JT goes back into the kitchen to put some finishing touches on his surprise dessert.  They continue talking from the separate rooms, but after a few minutes, JT stops responding.  Seamus thinks this strange, so he walks toward the kitchen to investigate.  As he looks around a corner into the kitchen, he sees JT near the sink, stroking his large cock fervently.  Seamus stays quiet, but keeps peeking around the corner.  He gets excited, so he pulls out his own growing erection and tugs it, still remaining quiet.  When the time is right, he walks out from around the corner, cock in hand, to see how JT will react.  JT likes what he sees.  The two walk to each other and kiss deeply.  JT begins jerking Seamus's enormous dick.  He works his way down, finally wrapping his lips around the stiff member and sucking it good.  They move to the kitchen counter where Seamus gets his mouth around JT's fattie.  JT can't believe he's getting a hot blowjob right in his own kitchen from this hot, new friend.  Seamus gets a taste of JT's asshole, readying it for his cock.  They switch positions and JT mounts the huge boner, sitting on it and riding hard.  Join these two in the kitchen as they work up to an intense, creamy surprise dessert that's sure to please. <br/><br/>Enjoy!",
  "models": [
    {
      "name": "JT Stryder",
      "person_id": 34661
    },
    {
      "name": "Seamus O'Rilley",
      "person_id": 34684
    }
  ],
  "release_date": "2014-10-25",
  "scene_id": 68160,
  "series": "NDT - 8258 - Seamus O'Rilley & JT Stryder",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Deep throat",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Red Head",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Surprise Dessert"
}