{
  "collections": [
    "Next Door Twink"
  ],
  "description": "After an amazing day of dancing, partying, and splashing around the pool, Damian Black and Tripp Townsend snuggled tight together in Damian's parents' bed for the night.  The next morning, Tripp was up with the sun.  He carefully slid out of bed and made himself a hot cup of tea with Mr. and Mrs. Black's fancy timer-equipped kettle.  Still glowing from the incredible time he'd had with Damian the day before, Tripp opened the double doors to the backyard, felt cool outside air embrace his fully nude body, and sipped his hot, orange eucalyptus tea.  Damian had very quietly risen too.  He crept gingerly over to Tripp by the open doors and kissed his neck, surprising him just a little bit.  He grabbed Tripp's cock and pulled him over to the bed.  The two laid back down on the bed, over the sheets, and kissed.  Tripp worked his way down, eventually taking Damian's swelling cock between his lips.  He worked it slowly, feeling it grow bigger and harder in his mouth.  After sucking for a while, Tripp moved so the two could assume a 69 position.  They pleasured each other for a while this way.  Then Tripp took Damian from behind and put his hard dick into his ass.  It was even more exhilarating than the day before.  It felt tighter, but easier to fuck.  Experience this extremely romantic, incredibly hot morning with two gorgeous Twinks as they explore each other...again.    Enjoy!",
  "models": [
    {
      "name": "Damian Black",
      "person_id": 34655
    },
    {
      "name": "Tripp Townsend",
      "person_id": 34656
    }
  ],
  "release_date": "2014-11-01",
  "scene_id": 68660,
  "series": "NDT - 8260 - Damian Black & Tripp Townsend",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Deep throat",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "My Folks Are Out, Part Two"
}