{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Damian Brooks has heard interesting things about a particular massage therapist.  A man whose operation lies on the outskirts of town, this masseur is said to have 'magic hands.' Hands so magic, in fact, they've allegedly made grown men cum at first touch.  Damian payed a visit to find out exactly what's been going on at the private studio, owned by a man known as XL.XL seemed happy to make Damian's acquaintance.  His eyes gleamed just a little bit when they first fixed upon Damian.  Damian explained that his glutes had been feeling tight lately, along with his hamstrings.  He asked XL if he could perhaps 'loosen him up' a bit.  XL calmly said he could, while staring at Damian's firm-but-plump behind.  Damian came out in only a towel and laid down on the massage table face down.  His legs spread slightly while the towel draped over his luscious bottom.  XL began rubbing.  He worked in oils and kneaded them deeply.  Finally, he flipped the towel away from Damian's ass and went hard into the glutes.  He would occasionally spread the cheeks, exposing Damian's tight hole.  After moving around to the front of the table, where Damian's mouth was, Damian pulled down XL's shorts and gently licked his growing dick.  When the moment felt right, XL climbed on the table and spit on the hole.  He lowered himself further and licked the puckered opening.  Damian was in ecstasy from the start of this.  Not much later, the two were engaged in a hot 69 formation, sucking each other like sex-starved wildmen.  Then the time came for XL to take this session all the way.  Sliding his fat, hard, erect cock into Damian, XL thought just how lucky he was to be a masseur in this part of town.  Join these delicious men and watch Damian get even more that the massage he had heard about.      Enjoy!",
  "models": [
    {
      "name": "Damian Brooks",
      "person_id": 31593
    },
    {
      "name": "XL",
      "person_id": 34727
    }
  ],
  "release_date": "2014-10-07",
  "scene_id": 68683,
  "series": "NDE - E179 - Damian Brooks & XL",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Black",
    "Climax",
    "Condom",
    "Facial",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Muscle Stiffness"
}