{
  "collections": [
    "Next Door Twink"
  ],
  "description": "It's another classic story: the boys on the neighborhood block getting the old gang back together for some old fashioned fun.  Adrian Rivers, Jessie Kale, Dakota Wolfe, and Tyson Stone make up the 'Next Door Nookie Club,' and each member has an integral role.Even though they haven't cum together for a good time in a while, not one of the boys doesn't think often of the raucous sexual adventures the foursome would have together.  It was a pleasant surprise when Tyson Stone received the call from Jessie Kale, telling him that sexy Dakota Wolfe was outside, looking unoccupied.  When Jessie suggested they get ahold of Adrian Rivers to get the Nookie Club back together for the day, it was the beginning of a brand new adventure.They all met up at Jessie's, where he and Dakota had already started kissing and rubbing each other.  Tyson and Adrian joined the makeout session right away.  Soon clothes were off and the boys were enjoying the feeling of nude flesh pressed together again.  The glances, the touches, and the oh-faces were familiar, but all felt so good to re-experience.  As Dakota fucked his friend's tight ass and Jessie felt his good pal's hard cock go in and out of his eager hole, the four boys let their inhibitions fly away for the afternoon.  Adrian smiled and breathed deep as he slammed his pulsating dick into Tyson.  There was no better feeling than knowing you and your good friends are enjoying something together.  Enjoy!",
  "models": [
    {
      "name": "Adrian Rivers",
      "person_id": 34769
    },
    {
      "name": "Jessie Kale",
      "person_id": 34770
    },
    {
      "name": "Dakota Wolfe",
      "person_id": 34771
    },
    {
      "name": "Tyson Stone",
      "person_id": 34772
    }
  ],
  "release_date": "2014-10-18",
  "scene_id": 68989,
  "series": "NDT - 8256 - Adrian Rivers, Jessie Kale Dakota Wolfe & Tyson Stone",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Orgy",
    "Twink"
  ],
  "title": "Next Door Nookie"
}