{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Trent Ferris is the type of boy that gets what he wants.  A wunderkind, Trent made a fortune at a very young age.  Now, he's living the high life, letting his penchant for sexy guys drive him forward.  He's arrived home a bit early from working at the firm today, and has some relaxation in mind.  His usual butler, Cody Walker, is in the driveway waiting to park the car in the garage, as usual.  Trent goes inside and calls for refreshments to be brought to his room, but changes his request when he gets a load of the hot, new pool boy.  He strips down and walks out to the backyard.  Laying down on a lawn chair, he asks the pool boy, Sam Truitt, to come lather him with sunblock.  Sam obeys orders immediately.  While rubbing on the lotion, Trent tells Sam to suck his cock.  Sam doesn't hesitate, as he's eager to please this wealthy young man, and also because the sight of his beautiful dick was making Sam's mouth water.  As Sam enjoys the hard boner, Cody drops off the refreshments.  Sam comments to Trent that the butler is very attractive.  Trent agrees and the two go after him in the house.  When they find Cody, Trent orders him to suck both his own and Sam's fattening erections.  Cody likes this type of chore.  After some nice sucking, Trent decides he wants to enjoy being filled at both ends.  He has Cody fuck him in his tight hole, while Sam stuffs his face full of cock.  Then they switch things up, Trent climbing on top of Sam's behemoth dong for a ride as Cody jerks himself, and sucks and licks on Trent's body.  You're invited to be part of Trent's illustrious staff for the day.  Be ready to work hard and enjoy yourself.  Trent's a fun guy to work for.  Just be prepared to squirt a nice, hot load when you're told to! Enjoy!",
  "models": [
    {
      "name": "Cody Walker",
      "person_id": 34773
    },
    {
      "name": "Sam Truitt",
      "person_id": 33496
    },
    {
      "name": "Trent Ferris",
      "person_id": 33181
    }
  ],
  "release_date": "2014-11-15",
  "scene_id": 68992,
  "series": "NDT - 8264 - Sam Truitt, Trent Ferris & Cody Walker",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "Fully Staffed"
}