{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "So the big game has turned out to be predictably unexciting, but during a timeout, a truck commercial reminds Alexander of his biggest current headache: his piece of shit ride. Damn truck is just a money pit, so when Joey offers to take a look at it, Alexander is more than appreciative, and he shows his approval as he presses Joey up against his driver's side door, pulling off his pants and shoving his cock into his mouth. Back in front of the TV, Jason and Brock are wondering what's taking so long, and so they head out to the garage to investigate, only to find Alexander on his knees with Joey's hard cock gagging him. Jason and Brock are pissed off that they weren't invited, but more turned on by what they see, so they invite themselves to join, and moments later, all four guys are in the bed of the truck- Joey and Jason on their backs while Alexander and Brock service them. Then they all switch places, and Brock shoves his cock down Jason's throat while Alexander face-fucks his mechanic friend. Happy with the pair-offs, Brock mounts Jason's hard cock and rides him in the back of Alexander's truck, while Joey does the same with Alexander. Brock moans in ecstasy as Jason pumps him full of hard dick, then they all switch places, and Jason bends Joey over the side of the truck as Gustavo and Brock fuck in the bed, grinding on each other and pounding away until they all shoot their pistons' load in a four way explosion of jizz and sweat and motor oil.Enjoy!",
  "models": [
    {
      "name": "Alexander Gustavo",
      "person_id": 27416
    },
    {
      "name": "Brock Avery",
      "person_id": 34726
    },
    {
      "name": "Jason Maddox",
      "person_id": 34755
    },
    {
      "name": "Joey Rico",
      "person_id": 34817
    }
  ],
  "release_date": "2014-11-07",
  "scene_id": 69101,
  "series": "NDB - 4522 - Jason Maddox, Alexander Gustavo, Joey Rico and Brock Avery",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Orgy",
    "Slim",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Spark Plugged"
}