{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Jordan Evans calmly sips his wine on the veranda awaiting his guest, he takes in the majesty and beauty of the estate resort he's created. The sun is warm and the breeze is blowing, just as Arad joins him at the table. Jordan takes Arad on a tour of the grounds, and Arad is impressed, but truth be told, the only thing he really wants to investigate deeper is what's inside Jordan's pants, so when Jordan shows him the inside of one of the cabana suites, Arad seizes the opportunity to make his move, grabbing Jordan by the belt and throwing him onto the bed, ripping his clothes off and pushing Jordan down his perfectly sculpted body. Arad is built like a Greek god, a fact that is not lost on Jordan as he inches his way down his companion's body. Jordan takes Arad's cock into his mouth, getting it nice and hard, flicking his tongue on the head and teasing Arad, until Arad can take more, and bends Jordan over the side of the bed, plunging his rock hard cock deep inside of Jordan. Jordan pushes back and Arad runs his hand along Jordan's back, flipping him over onto his back as he continues to pound away, then mounting Jordan and letting him go for a ride. Jordan puts his hands above his head, grinding and riding Arad's cock until he's ready to explode, which he does all over himself as Arad simultaneously blasts him with a healthy load of his own. 'Quite the rewards program your resort has,' Arad thinks to himself as he quivers in the aftermath.Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Jordan Evans",
      "person_id": 34583
    }
  ],
  "release_date": "2014-11-27",
  "scene_id": 69393,
  "series": "NDB - 4523 - Jordan Evans & Arad",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "First Resort"
}