{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "When you know it's time to get into a good gym routine, the best way to go is with a personal trainer.  Brock Avery is looking to incorporate some new weight exercises into his workout, so based on a few recommendations, he decided to make an appointment with Derek Maxum.Upon arriving, Brock is quite impressed with Derek's space.  It's a converted garage, well equipped with everything necessary to achieve a good swell.  Derek is also impressed, but his eyes are on Brock's physical assets.  As Derek begins showing Brock a few nice, easy compound weight lifts, he can't stop staring at Brock's amazing bubble ass.  Soon, Derek can no longer hide the erection growing under his pants.  He can tell Brock is noticing the bulge.  When his urges push him to a breaking point, Derek pulls down Brock's tights, exposing his plump ass cheeks.  Brock is completely shocked...at first!  But it's not long before the two are kissing hard and deep.  Brock goes to his knees and unleashes Derek's massive cock.  It's pulsating and begging for Brock's tender attention.  Brock devours it, feeling every powerful inch slide in and out of his warm mouth.  Then Derek takes a turn sucking.  After slurping on Brock's knob for a while, he lifts Brock's legs into the air to get set up for a nice hole tasting.  Once Brock's tight ass is ready, Derek eases his big dick inside and pumps away.  The ecstasy on Brock's face tells Derek how much his enormous boner is appreciated.  You're invited to join this gym-room session, so get ready to get swollen! Enjoy!",
  "models": [
    {
      "name": "Brock Avery",
      "person_id": 34726
    },
    {
      "name": "Derek Maxum",
      "person_id": 34949
    }
  ],
  "release_date": "2014-11-04",
  "scene_id": 69500,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Black",
    "Brunette",
    "Condom",
    "Cum swallow",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Getting Yolked"
}