{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For Andrew Fitch, returning from military service is going to take some adjustment. Having been away, Andrew has developed some habits that are sort of peculiar to the life of a serviceman, but one thing he can count on is that his old buddy Sean Blue will be around to help ease the transition, and sure enough, as Andrew arrives on his doorstep, who should he find waiting there for him but Sean himself?  The two guys reunite and then head inside to catch up over beers. Laughing and reminiscing, Sean lets slip that he's been thinking about joining the service, and asks Andrew what he should expect. Without hesitation, Andrew grabs his crotch and unzips his pants, falling to his knees as Sean's cock falls out of his shorts. Sean protests but Andrew assures him this is Standard Operating Procedure, and so Sean obliges as Andrew tongues his shaft and spits on the head, gagging on Sean's as Sean rolls his eyes back into the top of his head. Feeling completely at ease now, Sean returns the favor, pushing Andrew back against the counter and stripping him out of his camo fatigues, smacking his face with Andrew's hard cock before bending over and letting Andrew make a tactical invasion. Sean bends over the kitchen counter as Andrew pounds away from behind, then they switch up and Sean mounts Andrew's dick, riding it as he strokes his own cock to submission, losing his load as Andrew pulls out and drops his ammo all over Sean's waiting chest as Sean flashes a gigantic smile, realizing he's really going to enjoy military life after all.Enjoy!",
  "models": [
    {
      "name": "Andrew Fitch",
      "person_id": 27504
    },
    {
      "name": "Sean Blue",
      "person_id": 35597
    }
  ],
  "release_date": "2014-12-18",
  "scene_id": 69715,
  "series": "NDB - 4528 - Andrew Fitch & Sean Blue",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Blonde",
    "Climax",
    "Condom",
    "Dark Hair",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Military",
    "Oral",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Home Cumming"
}