{
  "collections": [
    "Active Duty"
  ],
  "description": "I've said it before, and I'll say it again, one of the most popular models in the Active Duty stable is PVT. Zane Lee Thomas. We get letters almost every day from people who want to know all of the videos that Zane has appeared in and we're always happy to help them out. In case you're wondering, here's the list of videos. Zane made his first appearance in Battle Buddies #1, then he was in Extra Duty #2 and Extra Duty #3. After a brief hiatus Zane appeared in SGT. Suck'em and in Seducin' A Sailor and a tape of Zane's live webcam performance is an added bonus on Commando Cum #2.So, why all this whoop-la about Zane? Well, he's cute, he's sexy, he's horny, and he's leaving on a duty rotation to Korea. Yup, that's right, this is the last tape we're going to see with Zane in it for a while and Dink decided that as Zane's last video he wanted to pair him up with Zack. Zack & Zane have been friends ever since they were in that oil wrestling match in Extra Duty #3 but they've never gotten it on by themselves. That's going to change right here...right now!Zack arrives at Dink's place and is stunned to learn that his buddy is leaving for Korea in three days. Zack heads for the bathroom where Zane is showering and shaving and after chatting for a bit Zack leaves him alone to finish his shower. Zack cuts us a little with Dink and we get to admire Zack's muscled body. He's obviously been pumping some iron lately. Zane finally finishes his shower and the boys sit around for a moment before their animal magnetism brings them together in a deep lip-lock. The ice broken, it's no time at all before they're totally naked and kissing and sucking up a storm. They are both great cock suckers, even if they really are straight. Zane has a little surprise in store for his buddy.Zane pulls a box of butt toys from his duffel bag and shows them off before he and Zack pick one out...a purple beaded anal probe...to use on Zane's cute bubble butt. Zane has never been into getting fucked, even though he did lose his cherry right on that very same futon in Extra Duty #2, but now he wants Zack to play with his butthole.After Zack has some fun with Zane's ass, it's time to turn the tables and Zack's ass is on display as Zane pokes and prods it with a small vibrating dildo. Zack is just as tight as Zane was and it takes a lot for him to relax enough to get even this small dildo up his hole. These straight boys can only go so far.All this butt play has gotten these guys hot and they're eager to bust their nuts. They sit side by side pulling their puds getting harder and harder and closer and closer to creaming. Zack pops first, spurting his sperm on Zane and then Zane climaxes, shooting off on himself. Whew, they're spent. Stay tuned though, there's a few cute little bloopers to make you laugh.",
  "models": [
    {
      "name": "Zane",
      "person_id": 35167
    },
    {
      "name": "Zack",
      "person_id": 35249
    }
  ],
  "release_date": "2001-11-27",
  "scene_id": 69877,
  "series": "Love Always, PVT Zane",
  "tags": [
    "Gay"
  ],
  "title": "Zack & Zane"
}