{
  "collections": [
    "Active Duty"
  ],
  "description": "My Straight Roommate<br />You remember Sgt. Suck'em, right? Sgt. Adam Wolfe from Ft. Polk made the trip up to see Dink and found out how much fuckin' fun it is to be a naked grunt on video. Well, now Dink is the one travelling down to the Deep South to check out Sgt. Suck'em's straight roommate.<br /><br />When Brad gets home from his afternoon jog he's confused by this strange guy with a camcorder is in his living room. Adam tries to explain it all, but Dink lays it on the line for him. He tells Brad that he's a hot fucker and he wants to make a video of him naked and jacking off. Brad thinks this bastard's crazy and leave to take a shower.<br /><br />Dink's not that easy to get rid of though and he follows Brad into the shower and almost challenges him to do a better solo session than Adam did. Well, that does it. Brad's straight boy honor is at stake so he strips down to reveal his muscled body and long fat uncut cock. Wow, this dude has it all, including a little self-suck talent that no straight-boy should be doing.<br /><br />While The Cat's Away...<br />Dink needs a beverage, so he leaves Brad in the shower and on his way to the kitchen he gets a big surprise. Adam and yet another grunt, Ryan, are sucking face on the sofa. Dink watches as face sucking becomes cock sucking and ass hole eating. Wait until Brad hears about this!<br /><br />Just Don't Touch Me...<br />Brad tells Dink that he's no homo-phobe...just don't touch him, but when Dink starts to tell Brad about the hot ma to man sex going on in the other room he really seems to get off on it. He has Dink tell him more about it and soon Brad is over the edge and spilling a big wad of cum from his uncut cock.''",
  "models": [
    {
      "name": "Adam Wolfe",
      "person_id": 35203
    },
    {
      "name": "Brad",
      "person_id": 35231
    }
  ],
  "release_date": "2001-01-01",
  "scene_id": 69875,
  "series": "SGT Fuck 'Em",
  "tags": [
    "Gay"
  ],
  "title": "Adam & Brad"
}