{
  "collections": [
    "Active Duty"
  ],
  "description": "Mike Lowry's GangDink's travels take him many places and wherever he goes he is always on the lookout for hot military men ready to take that proverbial walk on the wild side. So, when he hooked up with Sailor-boy Mike Lowry he thought he's found his next catch. Little did Dink know that Mike Lowry had connections. When it came time for the session Mike brought along three of the hottest young squids with him. These guys were all hand-picked from Mike's squad and he knew they could be counted on to deliver the goods.After a bit of male bravado while they watch a straight fuck flick, these guys get down to business. Mike is the first one to whip out his cock but the others are close behind. After a lot of jerking and stripping and looking it finally comes out that the Alex, the sexy Filipino, is a cock sucker. Dink eggs them on and these straight boys find out some new things about themselves. Mike takes Myers' finger up his ass and Alex gets Mike's cock in his mouth. It's a fun time as they experiment with male-male sex.Alberto gets a little freaked out by the sex going on (he thought this was only a J/O) so we don't see much of him, but that just leaves more time for Alex to suck Mike's cock and then turn his attentions to Myers. While Alex is sucking on Meyer's, Mike Lowry pops his nut and shoots his load all over himself. The sessions ends with Alex, flat on his back, getting face fucked by Myers. The skinny squid pumps in and out of Alex's mouth until he can't hold back any longer then he shoots his load all over the Filipino's face and chest. Alex sucks out every last drop of cum from Myers' cock and then spurts out his own load.",
  "models": [
    {
      "name": "Alex Chicago",
      "person_id": 35191
    },
    {
      "name": "Alberto",
      "person_id": 35415
    },
    {
      "name": "Mike Lowry",
      "person_id": 35416
    },
    {
      "name": "Myers",
      "person_id": 35417
    }
  ],
  "release_date": "2001-09-01",
  "scene_id": 69872,
  "tags": [
    "Gay",
    "Rim"
  ],
  "title": "Alberto, Alex, Mike, & Myers"
}