{
  "collections": [
    "Active Duty"
  ],
  "description": "Grunts In Heat...Brad really doesn't believe that Adam, his roommate, is gay, so he's got to see it for himself. He and Dink sneak into the living room and they find Adam and Ryan still going at it. Adam sees them though and puts on a good show of face fucking Ryan before inviting Brad over to get his dick sucked.Fuck'em SGT. Fuck'em ...Adam's been working Ryan over pretty hard, putting his cock deep down his throat until he gags, shoving his fingers up the grunt's ass, and just generally dominating the dude. Now, as Brad joins in poor Ryan hasn't got a chance!Sure, Brad is straight, but he needs sex and this is the best thing going right now. He moves over to Ryan and feeds his big uncut cock into the dick-hungry dude's mouth. Brad is a foul mouthed man he tells Brad exactly what he thinks of him. Adam's right there to egg them on and to enjoy his roommate's walk on the wild side.Brad gets into things in short order. He's pounding his cock deep into Ryan's throat and talking up a storm. Adam is sucking Ryan's cock and eating Ryan's ass, getting it ready for the fucking that's coming soon. With Ryan in the middle these three guys get into a chain with Brad plugging Ryan from the front and Adam plugging him from behind.Adam is relentless as his slams his cock into Ryan's ass and Ryan is a loud fuck. He's almost screaming as his ass gets hammered. Dink is right there egging them all on, telling them what to do and how to do it.The biggest surprise of this session is when Brad actually tastes his roommates cock...the first cock he's ever had in his mouth. He is not to agreeable at first, he's no fag! But that dick is right in his face and he's gone this far, so maybe, just a quick suck, or a longer suck, or a vacuum powered blow job!Brad finally spits out Adam's cock and plants his own dick deep into Ryan's butt. Ryan's still yelling every time he gets plowed and I think that's turning these two guys on more and more. Finally, they both can't take it anymore and one at a time they empty their loads of cream all over Ryan's face. Then Brad gets those guilty after sex feelings and he storms off in an indignant straight boy huff.",
  "models": [
    {
      "name": "Adam Wolfe",
      "person_id": 35203
    },
    {
      "name": "Brad",
      "person_id": 35231
    },
    {
      "name": "Ryan I",
      "person_id": 35418
    }
  ],
  "release_date": "2001-01-01",
  "scene_id": 69876,
  "tags": [
    "Gay"
  ],
  "title": "Adam, Brad & Ryan"
}