{
  "collections": [
    "Active Duty"
  ],
  "description": "AJ and Chip's First TimeA lot of you have followed our man AJ through several solo videos. In fact, he was one of the very first twelve models ever to pose for Active Duty in Third Platoon. As we learned in Cocked And Loaded #2, AJ has been experimenting a little. He's had his cock down my throat more than once and I jerked him off on that video. But the true video debut with another guy is here. The evening that chip made his third visit, AJ came over for his usual weekly blowjob and I showed him a tape of Chip and some pics from the pic session. For the first time ever, I seen an interest in AJ's eyes to be on video with another man. I told him that Chip would be arriving a little later that evening and that he should stick around and think about doing a video with him. AJ immediately asked what would be expected of him and I said all you have to do is let him suck your cock. Well, just getting sucked didn't prove enough for AJ. Instead, he went all the way and took his first cock down his throat during the session. This scene is much the same formula as the Battle Buddies series: Two straight, horny military guys exploring gay sex for the first time on video. They start out with a bit of banter about the video that is playing and quickly move into stroking each other and then exchanging blowjobs and cum. From first site it is clear that Chip is fascinated with the size of AJ's tool and can't wait to get it in his mouth. And boy does he ever work that huge cock over. You'd have thought he learned from me.The passion that Chip has for sucking that big cock is fascinating to watch and gives an instant rise to anyone watching. The two go from exchanging blowjobs to a 69 position, then they shoot their huge wads all over each other's chest as the other is on his knees in front of him begging for the hot, sloppy completion. This is a milestone for AJ (who obviously liked it since he asked me just a few days ago what guy he was shooting with next.) I think I not only found my Dream Marine, but AJ's as well.",
  "models": [
    {
      "name": "Chip",
      "person_id": 35059
    }
  ],
  "release_date": "2001-11-01",
  "scene_id": 69889,
  "series": "Dream Marine",
  "tags": [
    "Gay"
  ],
  "title": "AJ & Chip"
}