{
  "collections": [
    "Active Duty"
  ],
  "description": "Jordan Sage ReturnsI got an email a few weeks back from Jordan saying that he'd ETSed from the Army and was living back in Upstate New York. He'd spent the last two years of his enlistment in Puerto Rico and we'd somehow lost contact for about a year. Very excited about putting together a reunion, I invited him to come for a visit that very weekend. Three days later he was in front of my camera again....we talked about old times as he played with his hard cock through his shorts and talked about all the boys that used to hang out at my place. We're very candid about our relationship and all the while he's stroking his cock in front of the computer and smoking a cigarette. I get him to stand up and give us a tour of his body.....showing all his new tattoos and teasing the camera with his cock and ass.The ChallengeIn the midst of him stroking his hard-on and our conversation I slide in a challenge to him. I challenge him to seduce me. I tell him I want him to seduce me to the point that I throw the camera down and jump his bones. He laughs and says that should be easy. He moves over to the couch and slowly undresses from his shorts, already having taken off his shirt. He strokes his long, thick cock with both hands as he talks to me, teasing me and asking me if he's making me horny. He comes up on his knees and plays with his tight ass and slaps it as he asks me if I'd like to fuck it. He tells me only if I'm a good boy. Panting behind the camera, I promise to be extra good. He tells me to get ready and he pops his nut. The excitement of all this ass play has caused me to pull out my cock and start stroking it as I watch. Seeing this, Jordan gets even more into teasing me. After the cum shot, I position the camera and go over and stroke his freshly milked cock and play with the last oozes of cum dripping from the head. I begin playing with his tight hole, fingering it and slapping his ass. I ask him if he wants to get fucked and he comes up on his knees, positioning his ass for my cock to slide in. But first, I eat his ass really good, getting it nice and lubed and hot with my spit before I enter. Now, you can't see me on camera, except for my head as I tongue his hole and my arms and legs as I plow him from behind, but you can see Jordans face very clearly and see how much he's liking this fucking as I talk really dirty to him and fuck him hard from behind. He eggs me on to cum and I grunt out a load into the condom wrapped around my cock deep in his ass. Shew!A Final SaluteJordan has grown a nice little goatee (which actually looks really hot on him) since he's been a civilian again. But, he did as I asked and brought his old uniform with him for this visit. In this scene, I ask him to shave his goatee and do one last scene in uniform for me for old time sake. As he's shaving, I am talking to him and talk him out of his underwear and get some nice ass shots while he shaves. Cleanly shaven, he begins to dress in his uniform, putting on first his army undies, then his brown t-shirt, black socks, BDU pants, boots and finally his BDU top! He stands at attention and gives me what he calls The S.F. salute which is his middle finger. I shut down for a moment to take a phone call and when I come back he is lying in my bed with another raging hard-on as he squeezes it through his BDU pants. I ask him to show it to me and he asks me if I am sure I can handle it. This leads to him slowly stripping out of uniform, leaving on his black socks and brown t-shirt and working up that monster cock to another hot load of jizz. This is a very hot scene for all you uniform lovers and lovers of socks!",
  "models": [
    {
      "name": "Jordan Sage",
      "person_id": 35263
    }
  ],
  "release_date": "2001-09-01",
  "scene_id": 69883,
  "series": "Tour of Duty",
  "tags": [
    "Gay"
  ],
  "title": "Jordan"
}