{
  "collections": [
    "Active Duty"
  ],
  "description": "Poke A Bloke<br />Our British Navy boy, Neil, (Commando Cum #3) is as much of a slut as I am. In fact ... he learns very quick! Neil expressed his interest to me in doing what I love to do, seducing straight men. In this video he and I plan to lure Mike (our American Navy boy) from the nearby San Diego beach and get him over for a couple of beverages. I explain to Neil how to approach Mike and send him on his way as I head back to the house to get things set up....you know, (straight porn in the VCR, cold beverage in the fridge, etc).<br /><br />Once the two arrive I tell Mike about the videos, and so forth and ask him if he would be willing to do a double jack-off scene with Neil (no touching of course). Reluctant at first, he finally agrees, re-emphasizing the no touching part. The two start off in a slow jack-off session while watching the straight porn (Neil's really watching Mike though). Finally, curiosity gets the best of Mike and he too starts watching Neil. The two of them have equally beautiful uncut cocks. <br /><br />I leave the room for a smoke break outside and leave the camera running. To my surprise when I get back Neil has edged his way over to Mike and begun rubbing his leg and jerking his cock. Neil wastes no time and at my suggestion starts sucking off the new find right there on camera. I assure Mike that none of this will be on the actual video The heat builds and before you know it they are exchanging blow jobs. The blow jobs are intense and passionate. Mike does such a good job in fact, that Neil is carried over the edge and blows his load all over the side of Mike's face.<br /><br />Then I egg Mike on to try fucking his first piece of boy pussy and he obliges by going at the Brit bareback. This scene will blow you away. Mike is sitting on the couch and Neil stands up over him and lowers his ass onto Mike's hard dick. Neil is bouncing up and down on Mike's cock and I get some great close ups for you. Then they change positions and Mike bends Neil over the couch and fucks him again from behind. Mike works the Brit over really well thrusting his thick, uncut cock into the blokes hole, long stroking him until he can't take any more. Mike pulls out and shoots off on Neil's buzz-cut head.<br />Neil is now an official straight boy seducer and is very proud of himself. Mike is all hyped up and wants to do more videos. He really like pokin' the bloke!",
  "models": [
    {
      "name": "Mike",
      "person_id": 35411
    },
    {
      "name": "Neil",
      "person_id": 35412
    }
  ],
  "release_date": "2001-09-01",
  "scene_id": 69881,
  "series": "Allied Troops",
  "tags": [
    "Gay"
  ],
  "title": "Mike & Neil"
}