{
  "collections": [
    "Active Duty"
  ],
  "description": "PVT. Pillow-Biter In ActionFlash back to earlier in the year, Dink and Brian are spending a lazy evening together and having a few brews. Chris flashes a moon at Dink then heads to the guestroom and before you know it he's flashing a whole lot more. This is Chris' first time on video and this blond recruit is beer-brave and feeling no pain. Then we find out that there's a third person in the house, Lukas. He out ranks Chris by a stripe or two on the shoulder and an inch or two in his pants. Lukas is definitely looking for a fucking good time and Dink throws them together to see what happens.After jacking off side-by-side for a bit they grab at each other's cock and continue tugging, and then sucking each other. Lukas finds every opportunity to finger Chris' ass and to work his tongue deep into his puckered hole. Lukas eats that ass in a hot 69 and with Chris sitting right on Lukas' face. When Chris' hole is nice and slick he works his fingers in and spreads the hole wider, preparing it for the glorious fuck to come. Chris tells Lukas who much he likes being tongued and pushes his ass onto Lukas' eager face while Dink urges them on. Suddenly Chris spins around and tries to plant Lukas' cock into his ass but the spit isn't quite slippery enough.Chris is not a quitter, and as soon as Lukas slips on a rubber and lubes it up he's back in place and ready to ride some cock. With Chris on all fours and Lukas climbing on behind, they finally get the rhythm going and Chris is moaning up a storm. Dink called Chris his little crier because whenever he gets fucked he cries like a little baby. To hold back his cries while being fucked, Chris bites the pillow and earns a new nickname, PVT. Pillow-Biter. Chris is loud and vocal as he's getting slammed and his cock is rock hard while Lukas hammers his ass with loud slapping, squishing, sexy sounds. Lukas creams on Chris' bubble butt and Chris dumps his load on the bedspread.",
  "models": [
    {
      "name": "Chris",
      "person_id": 35238
    },
    {
      "name": "Lukas",
      "person_id": 35414
    }
  ],
  "release_date": "2001-08-01",
  "scene_id": 69886,
  "series": "PVT Pillowbiter",
  "tags": [
    "Gay"
  ],
  "title": "Chris & Lukas"
}