{
  "collections": [
    "Active Duty"
  ],
  "description": "Grunt 'n' FuckDuring my last visit to Chicago I met Scott at Union Station. He came over and did a solo (which is featured in Major Mansex) and during the solo guess who shows up? That's right, Adam Wolfe! Adam (SGT. Fuck'em) was also in Chicago that weekend and hunted me down. He tells me that he's home on leave and trying to find some action while he's there. He's kind of hoping I have someone for him to fuck. I tell him about Scott (who at this point is still in the shower) and he's VERY interested.Scott comes out of the shower and much to his surprise the promise I made to put him with another guy just five minutes earlier (and in a different video) is about to come true, way ahead of schedule. Once introduced, Adam and Scott do a little chit-chat, making eyes at each other and touching each other. Adam is hot for this sailor-boy, for sure, and judging by Scott's boner, he's just as excited. They got at it fast with hands and dicks everywhere, fingers probing eager asses and Adam's mouth plunging down onto Scott's hard cock. Scott is just as intense as he too goes for Adam's crank. Adam forces the squid's face all the way down on his long hard cock over and over again.Adam is working the boy up to a fuck, you can tell by the way he fingers his hole and then dives in for a first class rim job. The two of them do a tremendous fuck scene. Adam breaks our new bottom boy in SGT Fuck'em style--hard and loud! Scott is begging for Adam's cock in his ass and almost giving our famed fucker a true run for his top dollar. Adam takes Scott from behind first, plowing his hole repeatedly and Scott is moaning to beat the band. Then they flip over and Scott is riding Adam's rubbered cock. Adam actually manages to suck on Scott's dick while he's fucking him.There's tons more fucking in more positions that you can shake a cock at and by the time it's nearly over both Adam and Scott are out of breath and panting. They keep going at it though. Scott talks the Sgt. right out of his man juice and begs for Adam's load of hot soldier cum on his face. Adam gives the Navy recruit just what he asks for and drowns him with his load. Scott sucks the last drops of cum from Adam's cock then Adam kisses him and licks the remainder of his own load off Scott's chest.",
  "models": [
    {
      "name": "Adam Wolfe",
      "person_id": 35203
    },
    {
      "name": "Scott",
      "person_id": 35232
    }
  ],
  "release_date": "2001-09-01",
  "scene_id": 69882,
  "tags": [
    "Gay"
  ],
  "title": "Adam & Scott"
}