{
  "collections": [
    "Active Duty"
  ],
  "description": "Sam and Lorenzo BondThis scene starts out with me telling both of the guys that we are about to do something different and that they are going to help each other experience something new. I leave the room (with the camera recording) and the two guys begin laying down the law about what they will and won't do. Lorenzo says he aint sucking no dick or fuckin' no ass and Sam agrees. They then explore the options of what they will do if a whore is brought into the picture, but Sam quickly dispels this possibility by telling Lorenzo that a whore would not come to the house because there are too many guys there. With this option dead, Lorenzo returns to his lines of how he won't touch a cock, etc. He even says at one point that the bottom line here is I aint leaving this house gay and then as the two lay there on the bed together in their boxer shorts, Lorenzo says In fact, I don't even know what I'm doing laying next to you on this bed in my underwear.To the viewer it quickly becomes apparent that all this talk back and forth is a classic example of one's scared and the other one is glad of it syndrome. Here you have two friends that have been hanging around with each other for about a year now. They've gone out together, done all the normal guy things together and have now found themselves in a situation quite new to the both of them. Before I return to the room, Sam decides to go into the bathroom to allow Lorenzo to jack off and then Lorenzo is supposed to return the courtesy, but I come back into the room just in time and coax Sam back out of the bathroom and next to Lorenzo who is holding a very large hard-on. The two of them finally get into doing what guys do when they watch porno. I tell Lorenzo to watch Sam jerk off and I leave the room again. And boy does Lorenzo watch (even at one point comparing the size of their cocks). Writing a description for this scene is very hard so I'll leave it to your own judgment when you watch it of how much of a bonding scene it was.Sam, later that nightAfter Sam and Lorenzo complete their double jerk-off/bonding session, Lorenzo and I go back out and join a buddy of theirs in the bar while Sam stays behind still watching porn, this time playing with a jock-strap. Amazingly, while left alone he puts on another very good show for the camera (it's obvious he's enjoying being the star). Someone is standing outside the door peeping through the crack watching Sam. Sam notices this and at first covers himself. Then the mystery of who it is overtakes him I think and he goes for it full strength as if he is doing it for an audience and blows another load. Who was outside watching? Was it Lorenzo? We'll never know and neither will Sam.Dink jerks off Lorenzo while Sam mans the cameraSam and Lorenzo have returned for another visit. This time I bring Lorenzo into the room where I have several spanking devices laid out on the bed. Riding crop, leather paddles and restraints. I tease him and tell him tonight we are going to do something extremely different. Lorenzo smokes his cigarette fast as he looks the stuff over and says hell no I aint doing that shit. I just laugh at him and tell him I am playing with him. I get him in position on the bed and we start bantering back and forth. He pulls out a nice hard-on and starts teasing me with it. Showing it proudly to the camera and asking me if it's big enough and if I want to touch it. I pull out a dildo from the drawer and give it to him to compare with his. He asks me which one I'd rather play with and I quickly tell him his. I call Sam into the room (almost at Lorenzo's suggestion) so he can film the scene and I jerk Lorenzo off to a nice explosion as his best friend films the whole episode.",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 35114
    },
    {
      "name": "Sam",
      "person_id": 35409
    }
  ],
  "release_date": "2002-03-27",
  "scene_id": 69891,
  "series": "A Night in the Army",
  "tags": [
    "Gay"
  ],
  "title": "Lorenzo & Sam"
}