{
  "collections": [
    "Active Duty"
  ],
  "description": "Granger comes to the mainlandBy the time I met Granger we'd exchanged a few emails and had several phone conversations. Since I didn't want to blow Jordan's cover, I told Granger that I made straight videos and that I wanted to meet with him for a try-out. It actually ended up taking us several months to connect once he was back locally (he was going through a messy divorce) but we finally did. He came over and me and this Louisiana native hit it right off like any two good country boys would. I had him over for a steak on the grill and some beers. By the time we'd finished our steak and several beers I had the nerve up to show him what I really did. I took him in the house and put in Tour Of Duty where Jordan first got busy with another guy (Stefan) on video.I wasn't quite sure how Granger would react, but I was relying on the beer to set him at ease. At first he just gazed at the TV in awe, not saying a word. Then he said What the fuck? I thought he was going to get up right there and stomp out of the house, never to be seen again, but he kept watching in silence with a few oh my God's from time to time. It wasn't very long before I was spying Granger from the corner of my eye squeezing a massive hard-on in his shorts. Eventually he put his hand in his pants and I could clearly see that he was stroking himself. Well, to say the least, our first night together didnt lead to this first solo that kicks off Tour Of Duty 2, but it kicked off Granger's first blow job from another man and the rest of what follows.After our first night together and the heated action that followed Granger's hard-on as he watched his long-time buddy Jordan suck cock and get fucked, I had Granger back for a solo session in his BDUs. Even during this session he is pleading for help from the camera man, but I refuse except to give him a hand in cleaning up his hot load of cum.Two soon-to-be fuck buddies cum together after two yearsIt's been two years since Jordan and Granger seen each other and after what Granger has seen Jordan do on video he's more than anxious to see his long lost pal. But the twist here is that we don't tell Jordan who the suprise guest of honor is. In fact, I get Jordan on the couch beating his big cock before I even let him know that Granger is in the house. I even tell Jordan that it's someone that he told me to contact via e-mail while he was stationed in Puerto Rico, but Jordan can't remember. Enter Granger stage left ... Granger comes down the stairs from hiding and the look on Jordan's face is both excitement and relief. They hug and talk small talk about their time in the Army together and then they compare tattoos and talk about the work they've had done since they were hanging out together in the hot 'Rico sun. The conversation quickly goes back to Jordan's fat cock and how Granger can now understand why all the girls made such a fuss about Jordan after he left. It isn't long before they go back to watching the video that Jordan was stroking his huge tool to before Granger came on the scene. Granger can't keep his eyes off of Jordan's cock though and before you know it the sligh old Sage has coaxed the boy into playing with his massive meat. This is is what Granger has wanted all along. He grips the dream dick like a pair of plyers and jerks it like a champ. Jordan is loving this. Probably something they'd both wanted in Puerto Rico all along.They start jerking each other in unison and the heat rises, passion levels boil over and some of the hottest cocksucking I've ever filmed evolves. Jordan kicks off the suckfest first taking Granger in his hot mouth for some teasing just enough to get Granger worked up to return the favor. And does he ever return the favor. Granger latches on to the monster cock and gives his sucking skills a crash coarse in quick learning. You'd think he was a snapping turtle waiting on lightening to strike before he'd dream of letting go of Jordan's huge tool. It's obvious that Granger is in love (at least with Jordan's big cock if nothing else) and Jordan is loving the attention. The suckfest goes on until Granger can't stand the thought of Jordan's tight ass not having his cock inside it. While Jordan sucks him, Granger is lubing up Jordan's ass from behind, Jordan grunts a few times as if it's painful, but his cocksucking intensifies as he gets more and more turned on by the anal action.All in harmony Jordan put's his ass in the air and Granger rolls the condom over his rock-hard cock and commences to fuck Jordan silly. Jordan strattles Granger's manmeat and slides it deep in his tight fuckhole and Granger (being the gentleman that he is) reaches around and grabs Jordan's cock and jerks him off as his cock slides in and out of his ass. Not long afterwords, Jordan erupts with one of the biggest and best cumshots I've ever seen. Amazing! And his cock never goes soft. Granger then bends him over the ottoman and continues to plow his ass until he shoots his own hot load all over Jordan's back and he grinds his hot, sweet ass in circles, teasing the camera and Granger as well. What a reunion!",
  "models": [
    {
      "name": "Granger",
      "person_id": 35252
    },
    {
      "name": "Jordan Sage",
      "person_id": 35263
    }
  ],
  "release_date": "2002-07-01",
  "scene_id": 69898,
  "series": "Tour of Duty 2",
  "tags": [
    "Gay"
  ],
  "title": "Granger & Jordan"
}