{
  "collections": [
    "Active Duty"
  ],
  "description": "Parker and Corrin become Enlusted<br />I've gotten tons and tons of emails about our sexy man, Parker who first appeared in Live Ammo 1. Parker and I had been friends long before he appeared in any videos. He's just the type of soldier that you want to keep locked up in your bedroom. Well, our new star Corrin had been on me to put him in a video with another guy. He was very anxious to try something different than just spanking the monkey on camera. So, I invited him over one afternoon (knowing that Parker was supposed to make an appearance that day as well) and told him I had someone in mind but that he would have to help me persuade the other guy.<br />This was just the challenge that Corrin had been looking for. We talk for a bit on video as we await Parker's arrival and I give Corrin the scoop. Parker arrives shortly afterwards in full uniform! The sight of this strapping GI in those sexy BDU's is more than most can handle and our friend Corrin was eyeing the goods. Corrin just happened to be sitting in the living room watching a porn (wink) and invited Parker to join him. Slowly, Corrin starts chatting Parker up as he pulls out his own cock to Parkers surprise.<br />Parker asks, What are you doing?. Corrin replies, It's a fucking porno, I'm going to enjoy it! Parker just laughs and looks at me (with the camera rolling) and says So are we doing a double jerk off video or what? I mumbled Mmm hmmm and just kept filming -- depending on Corrin to break the ice and move in on Parker. Then, no sooner than you can whistle Dixie, Corrin has Parker's cock in his hand and is jerking him along with himself. This leads quickly to the two of them getting on the living room floor and giving each other some great head. Seeing full well that this is heading for some hotter action I move them into the bedroom to get more acquainted and comfortable.<br /><br />Getting to know you<br />And do they ever get acquainted! Absolutely no direction was needed from me to keep these two boys going. They keep exchanging deep head and talking shit to each other. Parker takes Corrin's cock in his mouth as he gets down nestled between his thighs. You can tell that Parker is determined to give as good as he gets. He works on Corrin's cock until it explodes a nice big juicy load right into Parkers face. Parker just keeps sucking and enjoying the moment. Corrin then takes our studly GI and returns the favor. Parker is moaning as Corrin handles his cock like a professional. It isnt long before Parker's cock is gushing hot, thick cum all over Corrin's hungry mouth.<br /><br />They shoot! They score!<br />By this time, Parker (never having been one to go soft after shooting his wad) decides that just head isnt enough for him. He wants more and so does Corrin. I give them some lube and Corrin lubes up his tight asshole for Parker. What happens next is one of the most intense fuck scenes I've ever shot. Parker puts his willing partner in three or four positions as his hot fat cock pounds the soldier's tight ass. Eventually, like all good things it comes to an explosive end with Parker blowing his wad all over Corrin's cock. The momentum is great and the action is well paced as we watch these two Enlisted soldiers become Enlusted.",
  "models": [
    {
      "name": "Corrin",
      "person_id": 35408
    },
    {
      "name": "Parker",
      "person_id": 35329
    }
  ],
  "release_date": "2002-07-01",
  "scene_id": 69897,
  "series": "Enlusted Soldiers",
  "tags": [
    "Gay"
  ],
  "title": "Corrin & Parker"
}