{
  "collections": [
    "Active Duty"
  ],
  "description": "It's a platoon party folks. <br />Everybody is cumming and you're invited too. What happens on a lazy Sunday afternoon when you get four hot and horny GIs in one spot? A platoon party Active Duty style.<br />Cowboy, Granger, Britt and Craig show up in no particular order to my house one Sunday afternoon while I'm busy doing my weekly updates and just kinda hang around. Once all four of them are here they get a little bored and pop in a porn. Go figure. I turn on the camera and continue with my updates not knowing what is going to happen. Well, we all know what happens when you put four straight boys in a room together with one hot porn ... somebody pops a woody and before you know it a circle jerk emerges right? Well, that's just the start of this 4-way fuck-fest. Our man Granger (always the instigator) gets things going along with our beefy Britt and before you know it they've got the other two soldiers naked and jerking their meat as well.<br /><br />What starts out as a common circle jerk turns into hot oral action and from there the four heroes try each other's cocks for size and sucking. Granger sucks cowboy, cowboy sucks Granger, Britt sucks Craig, Granger sucks Craig, Britt sucks Cowboy and Granger and Craig sucks everyone.<br />It's an oral fiesta and mouths and cocks are everywhere. These boys wanna taste each other and you can tell. The sucking continues and things get all heated up. It isn't long before our sneaky little Granger is lubing up Craig's ass for a three man tag team fucking that is about to break out all over Craig's ass.<br />Once Granger has the boy's hole nice and lubed, he puts a condom on Britt's cock and guides Britt over to the waiting pucker. But before Britt can get his rod in Craig, Granger pushes him aside and takes the first plunge. He plows into Craig's willing ass and fucks him while Cowboy and Britt look on in anticipation, each stroking their cocks and lubing themselves for their turn at this tight manhole. For all you Granger lovers you're gonna get to see some very nice shots of his tight asshole in this fuck scene as his sweet hole winks at you while his big cock plows the taker.<br /><br />Next up is Britt the banger as he guides his slick cock into the primed and watering hole. He fucks Craig just like he fucks every other boy -- hard, fast and rough. Craig is loving this treatment as he moans and whines in ecstasy. Taking every inch of his giver and begging for more cock. Cowboy quickly comes in for the tag and plows in deep with his nearly nine inches (fitting very nicely) and puts Craig into grunt mode. Even after taking two other dicks, it's a challenge for Craig to handle all of Cowboy, but he does and just like a trooper while Craig sucks and moans on Granger's hard cock.<br /><br />After the fuck session our three heroes begin feeding their bitchboy their cocks ... standing over his face and fucking it like they did his ass and boy is he loving it. He's the focus of attention and he couldn't be in a better place. The three fuckers pop their wads then play with Craig and urge him on as he pops his. The party cums to an end but you've got it all on video so you're invitation is good again and again.",
  "models": [
    {
      "name": "Britt",
      "person_id": 35348
    },
    {
      "name": "Cowboy",
      "person_id": 35388
    },
    {
      "name": "Craig",
      "person_id": 35347
    },
    {
      "name": "Granger",
      "person_id": 35252
    }
  ],
  "release_date": "2003-05-01",
  "scene_id": 69908,
  "series": "Platoon Party",
  "tags": [
    "Gay"
  ],
  "title": "Britt, Cowboy, Craig & Granger"
}