{
  "collections": [
    "Active Duty"
  ],
  "description": "Granger, Marcus and BrittWhat starts out as a workout session doesnt last long before our golden boy Granger starts feeling up the SGT. Britt is determined that his concentration won't be broken, but with the help of our new comer Marcus, Granger gets Britt all hot and distracted. Trying to break up what Granger has started, Britt tries moving to another weight machine only to find that his spotter (Marcus) has his cock right in his face and Granger has Britt's cock in his hand. Forget about the workout folks, this is where the thrill begins. Marcus feeds Britt's face with his hot cock, shoving it down his throat while Granger works on Britt's other end, getting him hard. Britt forgets about the workout at this point and goes with the flow. Marcus and Granger switch places and Granger feeds Britt his cock while Marcus munches on Britt's balls. Granger wants some of Marcus' action so he moves over and feeds his cock to Marcus as well. Our newcomer doesn't miss a beat, he bobs on both cocks like a pro, jerking one while he sucks the other and switching off quick enough to keep them both rock hard. To the matThe three of them move over to a wrestling mat where a nice three-way oral scene starts out, the three of them are milking each other's cocks like feeding puppies. It's hard to keep up with the action here with each guy deciding he wants to taste a different cock. Everyone sucks everyone and by this point our mischievous Granger decides it's time to break in the newcomer with a cock in his tight ass. Granger starts fingering Marcus and getting him ready for his hard, throbbing cock. Marcus is liking this new attention and becomes very responsive, getting up on his knees, assuming the position and Granger gets behind him and starts pushing the head of his 8 incher into Marcus' tight hole. At first, Granger looks at me and says it aint gonna fit and I say yes, it will.....push. Granger doesn't give up and Marcus doesn't give in and eventually Granger is banging our boy with all he's got. Marcus starts moaning as he sucks Britt's cock. Each time Granger slams it in Britt's cock shoves deeper down Marcus' throat as the boy thrusts forward. Marcus is sporting a huge boner so our man Granger grabs on to it and gives him a hand job while he pumps Marcus full of his hot cock. Britt is watching as Marcus works his cock over good with his hungry mouth and gets slammed by Granger. It must have been evident to Granger that Britt was ready for some of the boys' tight hole because he pulls out and tells Britt to come hit this good ass man. Britt does what he's best at ... Anyone who has watched Britt fuck a boy knows that he's pretty damn good at it. He stands flat footed and plows Marcus for all he's worth. Granger (never one to sit idle) gets beneath the action and starts sucking Marcus' hard prick and playing with Britt's tight balls. You can hear Marcus as he moans in ecstasy. Marcus sucks Grangers cock and Granger blows a handsome, well deserved load as Marcus continues to milk his cock. Britt stands over Markus and blows a huge load all over his back. Britt quickly gets dressed and tells the boys that he has to go before my girlfriend wakes up and realizes I'm gone and he's out the door. Marcus and Granger hit the showers and Granger being the thoughtful guy he is realizes that Marcus has not gotten his load yet, so he drops to his knees and services his new buddy to an explosive cumshot that lands all over Grangers chest. Marcus kisses Granger on the forehead and the two continue showering as the scene ends.Ó",
  "models": [
    {
      "name": "Granger",
      "person_id": 35252
    },
    {
      "name": "Britt",
      "person_id": 35348
    },
    {
      "name": "Marcus",
      "person_id": 35389
    }
  ],
  "release_date": "2002-12-01",
  "scene_id": 69907,
  "series": "Thrill SGT",
  "tags": [
    "Gay"
  ],
  "title": "Britt, Granger & Marcus"
}