{
  "collections": [
    "Active Duty"
  ],
  "description": "Britt enlists a new Enlusted Soldier.Britt is quite the crafty fellow. He's forever calling me at 3 AM asking what I'm doing as he drives home from the bar. Well, this particular night, he has another friend with him as he did before and I tell them to come on over. When they arrive we have a few beers and I talk to Britt alone about his buddy and about the possibility of them doing an all out sex video. Britt isnt sure, but he's willing if his buddy is willing so the talk begins. After much convincing, I finally get the two of them on the bed together and leave them alone to watch the porn as they slowly get undressed. I come back in the room and they are naked so I leave again.This time, I happen to look back sneaking a glance through the conveniently positioned mirror over the bed and see Britt Cajoling our new recruit. They're laughing but in no time Craig is going down on Britt's cock like it's nobody's business. And let me tell you, the boy makes love to Britt's cock like it's the first and last he'll ever taste. This is some of the most erotic cocksucking I've ever filmed. Craig is clearly hungry for this and it's super hot to watch as he tastes every inch of the cock he's servicing.Britt's First TimeThe tables change for a bit and Britt (our big guy that we never thought we'd see man handle a cock) is down between Craig's legs giving the return favor in healthy deep throating strokes. Just seeing this masculine boy put a cock in his mouth is enough to send you over the edge.Britt Bangs his boyAfter the extended cocksucking swaps, it's time for the fucking. Britt positions Craig on top of him and slowly the two of them work Britt's hot, extra hard cock into the boys tight hole. This is clearly tough at first for Craig who has to stretch out his arms and gain the nerve and the strength to take all of Britt inside him. But once he does, watch out. A hot riding session is in play here as Britt latches on to Craig's ass cheeks and slams his throbbing cock deep in the boys ass. This is hot stuff as the two catch a rythmn and get into some serious lovemaking.After Craig's ass has adjusted to the thrusting of Britt's dick, Britt gets on top of him and really gives it to him hard and deep. Britt is one of the best tops I've ever filmed. It's unbelievably hot to watch as he stands flat on his feet and delivers his cock deep in craigs hot, red hole. I've never quite seen a guy that can fuck a nice deserving ass as good as our man Britt. He's into it. He's breathing heavy and grunting and his boy is grunting with him. Just as you are about to blow your load, Britt snatches his cock out and blows his along with you all over Craig's furry ass. The cum just oozes down Craig's crack and into his fuckhole. You'll want to rewind this part over and over and cum again and again. This is one hot fucking scene!Britt gives it the old soldier tryBy this time, Britt is hotter than a two-dollar pistol and decides to give Craig some more deep head to help his buddy get off. At my urging he decides to try letting Craig fuck him. The fucking is going good at first and Craig is able to get his cock in Britt's ass at least long enough to get it all the way to the nuts, but it slips out and our boy Britt can't seem to muscle up the ability to take the pain again. He says it HURTS! But he gave it his best and I'm sure you'll appreciate it as much as Craig and I did. This is too hot. Britt takes his first cock. Can we persuade him to try it again?This is one of the hottest scenes I think I've ever shot. The two boys are so into each other that it's unreal. Kinda makes you wonder if they've done this on their own before. If not, we're witnessing something extremely hot and special here, Troops.",
  "models": [
    {
      "name": "Craig",
      "person_id": 35347
    },
    {
      "name": "Britt",
      "person_id": 35348
    }
  ],
  "release_date": "2002-11-01",
  "scene_id": 69903,
  "series": "Enlusted Soldiers 2",
  "tags": [
    "Gay"
  ],
  "title": "Britt & Craig"
}