{
  "collections": [
    "Active Duty"
  ],
  "description": "Britt front and centerOnce I finally got Wolf to agree to trying a video with another guy I had to decide who was best to match him up with. Didn't take long for me to pick up the phone and call our hero Britt and enlist him for the job. I told Britt, I've got a 19 year-old newbie that wants to try something with another guy ... man he's so fucking cute. You gotta see this guy. Britt got all excited on the phone and said You know I'm your man ... tell me when, and I'm there. I continued to tell him about Wolf just to see how excited I could get him. It worked.Wolf gives in to a real manBritt arrived ahead of Wolf and I was able to show him some pictures of the new recruit and managed to get him all lathered up before the boy arrived. I could just see the gleam in Britt's eyes as he contemplated plowing the badboy's virgin hole. Wolf arrives and the two of them settle down to a video in the living room. I left them alone and went to put on a CD. I had the camera positioned so that I could watch them through the LCD viewfinder without them knowing I was watching. Britt was the first to strip out of his clothes and start getting his tool ready for what he knew was about to happen.Wolf threw several glances over to his suitor's cock and then he just leaned over and started sucking on Britts muscled pecs and chewing on his nipples. Britt is loving this action and helps the boy strip out of his clothes so he can play with the new recruit's cock. Before you know it, Wolf is wolfing down Britt's hard dick and working it over nicely with his tongue. Britt stands up and starts fucking the newbies face.I get some very good angles of this action as Wolf both sucks cock and looks at the camera with inviting eyes. The tables turn and Britt gets on his knees and returns the favor. Just watching him caress and play with Wolf's ass as he deep throats the boys prick is enough to send you over the edge. Britt has become quite good at sucking cock and really gets into it. Wolf obviously likes his new found hobby as well because he tells Britt to get in the 69 position so I can work on you too and the two do a 69 that's hot as fire.Britt can't take it any longer. He's been checking out the boy's tight little asshole during the 69 and he's ready to fuck! Wolf gets behind Britt and rubs his muscles while Britt puts on the condom and prepares to take his virginity. This part is classic as we watch the young Wolf grunt and take it. He's so determined to take Britt inside him, he bites down on the arm of the couch (nearly biting a hole in it) and just moans as Britt works his cock into the tight virgin hole. Once he's in, Wolf starts to like it and starts yelling yeah fuck that ass ... fuck me, fuck me. It's clear that he's crossed the line when even pain feels good at this point. Our stud Britt tops the boy like there's no tomorrow. Gosh that man can fuck an ass. Finally the tight ass gets the best of him and he pulls out and blows a huge load all over his newbies back. Lord, somebody give me a fan, I'm about to faint.",
  "models": [
    {
      "name": "Britt",
      "person_id": 35348
    },
    {
      "name": "Wolf",
      "person_id": 35407
    }
  ],
  "release_date": "2003-01-01",
  "scene_id": 69905,
  "tags": [
    "Gay"
  ],
  "title": "Britt & Wolf"
}