{
  "collections": [
    "Active Duty"
  ],
  "description": "Cowboy and Jax return and guess what?<br />Well, as promised the two called me as soon as they returned from the field and came over that Saturday night. Like all good Saturday nights, we decided to party a little before getting to work. By the time the clothes came off I'd told Jax about the spanking videos that I'd been doing and he seemed interested. So, this scene starts out with me spanking Jax while Cowboy does the filming. Interesting thing is, I notice that while I'm spanking Jax he is looking at the camera (or Cowboy) and giving very seductive poses. I also notice that Cowboy is fumbling with his cock as he video tapes the spanking. I tell Cowboy to take off his pants and jerk his cock while he films. Not suprisingly, his cock is rock-hard.<br /><br />Cowboy takes the reins<br />Once it's established that Cowboy is hard, I tell him to come take the riding crop and give me the camera. I give him control and Jax starts begging Cowboy to spank him. Cowboy is getting into this as his face gleams. His cock is still rock hard, too. I begin to cajole Cowboy to move in closer so that his hard cock touches Jax fire red assÉwith a bit of hesitance, he does as asked. The next step is to get him to fuck Jax. Earlier I'd talked to Jax and told him that I thought Cowboy would fuck him if he'd be willing to let him. Jax isn't too sure I'm right, but he's willing to play along. So, now all I have to do is talk Cowboy into it. I continue to gently insist that Cowboy move even closerÉcloserÉhis cock is now between Jax cheeks and hard as a brick. With a little more pleading, he enters his cock into Jax tight waiting ass and from there on, it's raw, hot fucking. He fucks Jax with long hard strokes, grabbing on to the jock-strap and pulling Jax back on his long hard cock. Jax is having a hell of a time taking Cowboy's big cock, but he's a trooper and determined. At one point he says You just wait until you're turn. Cowboy just laughs, but he does not protest, so I take this to mean that he's willing to also take his turn and take it like a man. He shoots his load all over Jax as Jax begs for his hot cum all over his ass. <br /><br />Cowboy gets as good as he gives<br />Never one to let an opportunity slip by, I tell Cowboy that Jax was rightÉit's his turn now. Cowboy doesnt argue, he gets on his hands and knees (with his cowboy boots still on) and raises his cute, hot ass in the air for his buddy to plow. This is classic and I almost came all over myself at this point. After the fucking he just got, Jax is more than ready to let loose on Cowboy and give him as good as he got. Cowboy scoots back and positions his cute little bubble butt right in line with Jax hot, pierced cock. Jax lays it to him like a pro as cowboy just grunts and takes it. Jax isnt playing around, he's fucking Cowboy deep and hard and you can hear Cowboys muffled moans as he buries his face in the bed. After a long hard fuck, Jax pulls out and cums all over Cowboys ass then sticks it back in for good measure.",
  "models": [
    {
      "name": "Cowboy",
      "person_id": 35388
    },
    {
      "name": "Jax",
      "person_id": 35413
    }
  ],
  "release_date": "2002-11-01",
  "scene_id": 69901,
  "series": "Bareback Barracks Buddies",
  "tags": [
    "Gay"
  ],
  "title": "Cowboy & Jax"
}