{
  "collections": [
    "Active Duty"
  ],
  "description": "Jake shows his new little buddy his softer sideAfter Jake blows his huge load in Cheyenne's mouth, he tells Cheyenne to come sit beside him on the couch so he can help his little buddy get his load. This scene is so sweet as our big hero shows us his sweeter side as he helps his little buddy stroke his cock and plays with his balls while Cheyenne works himself up to a nut. Jake is too much of a man (at least for now ... wink) to suck another man's cock, but he rubs Cheyenne's body and whispers in his ear as he watches his boy bust his nut. By this time Jake is hard again and ready for more action. Jake takes his boy's virgin hole barebackAt this point the only thing that's ever been in Cheyenne's ass is a dildo but Jake is about to change all that. Get back down here and suck my cock boy so I can fuck that tight ass of yours, Jake tells Cheyenne. Our little sex pig obeys and works his daddy up for his ass. Jake tells his boy to get on his knees so he can fuck his tight hole. Jake plunges into the virgin territory causing Cheyenne to grunt and exclaim fuck man. Jake doesn't stop though and he works his huge bent cock into his boy's ass and begins to fuck the living daylights out of our little pig boy. Cheyenne is moaning and struggling to handle this big man's large tool as he gives off some grunts of satisfaction. Jake gets animal-like and fucks Cheyenne hard as he tells him yeah, I've been waiting to fuck this ass boy. Cheyenne brings up the rearJake flips Cheyenne over on his back and uses the arm of the couch as leverage as he re-enters his boy's hot, watering hole for the second time. This time we get to see some priceless face shots of Cheyenne and some deep penetrating shots of Jakes huge cock plowing the boy's hole. Jake fucks him for a good round and works up a sweat from the pounding he's giving his boy. Finally, Jake says he's gonna cum again and asks his boy if he wants to eat it again and Cheyenne moans a yes. Jake straddles Cheyenne's hungry mouth and fills it with a second load as Cheyenne gulps it up and lets it spill out of his mouth all over his face and chest. A twist with some pissAfter his second load, Jake really has to piss and since I know Cheyenne is a little sex pig, I suggest that Jake piss on his boy. Cheyenne is all for it and they head for the bathroom where Jake lets his hot, long piss splash all over Cheyenne's naked body. This is one of the longest pisses I've ever seen as Cheyenne gets soaked by his daddy's hot stream of manpiss. This is a new thing for Active Duty videos, but I think you're gonna like it. If not, it's at the very end of the tape so you can just skip the scene. But I know you'll wanna watch it.",
  "models": [
    {
      "name": "Cheyenne",
      "person_id": 35058
    },
    {
      "name": "Jake (Big Jake)",
      "person_id": 35199
    }
  ],
  "release_date": "2003-10-01",
  "scene_id": 69912,
  "tags": [
    "Gay"
  ],
  "title": "Cheyenne & Jake"
}