{
  "collections": [
    "Active Duty"
  ],
  "description": "Zane gets a wish from High SchoolZane returns to the Active Duty fold and finds a surprise waiting in the stable for him. A few months previous to his return I met Pratt. A hot, new recruit that I met about two months after he got stationed here. I'd been saving him for something special. Little did I realize (I tend to forget details about specific towns that guys are from) Zane and Pratt had attended high school together. And they'd often fantasized about one another but neither had the nerve to make the first move. (Seriously!) Well, in this first scene we get to hear all about those high school fantasies and see them acted out. The passion between these two is so hot, so precious.Enter Jordan's cock stage rightAfter Pratt and Zane get reacquainted in a new way, I call in Jordan to share his huge cock with the two hungry boys. Zane has missed this action and it shows as he shares Jordan's cock with his high school fantasy. The two of them make love to that big cock and kiss deeply in between shoving it down their throats. This scene is one of the hottest. I usually don't go back and watch the videos and jack off but watching this scene I had no choice. Zane and Pratt are really getting into servicing Jordan and Jordan is really enjoying all the attention as he rubs the heads of his two cock-suckers and moans and throws his head back in ecstasy. Zane trains his buddy in the way to suck a big cock, but it doesn't look like Pratt needs much direction as he swallows the monster and handles things on his own. Rush in the red-headRush is another new hottie that I've recently discovered and just like all sexy red-heads he has a really nice body, concrete ass and nice fat cock with bushy red pubes. He's new to this and his excitement is obvious. He's just happy to be part of it all. He stands over Jordan and feeds him some cock while Zane and Pratt work on Jordan's cock. We get some good shots of Rush's tight bubble butt and then I decide to move things to the bedroom. Zane's first fucking in nearly two yearsIn the bedroom, Zane starts fucking Pratt with a dildo to prime his tight ass for Jordan's big 10-incher, but somewhere in the midst of this prep, Zane decides it's time for him to get fucked again. (Pratt will get his next time!) It's been awhile and he's mesmerized by Jordan's huge cock so he throws his nice bubble ass in the air and eggs Jordan on to give him the fucking of his life. Jordan comes through and eases the monster into Zane as Zane taunts him and talks shit to him. Jordan finally works all of his tool into Zane's ass and it's a slam dunk fuck. Jordan puts his huge cock in Zane all the way to his low hanging balls as Zane tries hard not to pass out. He slams in and out of Zane's 2-year-tight hole for a long time and slaps his ass until it turns blood red, all the while Zane is yelling both in pain and in pleasure. Rush wants someWatching all this is Rush and Pratt. I start egging Rush on to try taking Jordan's cock like a man. Rush positions himself on the bed beside Zane and taunts Jordan with his nice, firm ass. Jordan plows right in and bangs the boy good. Fucking him hard and long stroking into his virgin ass. The video ends with a circle jerk focused around Jordan's huge cock as the others kneel around him and wait for his cum to fly. Next to cum is Zane, then Pratt and Jordan cums again.",
  "models": [
    {
      "name": "Rush",
      "person_id": 35139
    },
    {
      "name": "Zane",
      "person_id": 35167
    },
    {
      "name": "Pratt",
      "person_id": 35176
    },
    {
      "name": "Jordan Sage",
      "person_id": 35263
    }
  ],
  "release_date": "2003-06-01",
  "scene_id": 69910,
  "tags": [
    "Gay"
  ],
  "title": "Jordan, Pratt, Rush & Zane"
}