{
  "collections": [
    "Active Duty"
  ],
  "description": "Landon Comes For His Second VisitLandon is a new recruit that I found recently, and what a cute find he is. He's such a sweet guy -- and so, so adorable with those precious baby brown eyes and that killer smile. Landon came for a solo and pics (featured at the end of this tape) a few days prior to making this second visit. Once he gets here I tell him that we will be doing a double jack off session with he and Big Jake. Landon doesn't seem to have a problem with just jacking off with another guy so I bring in Jake and the two of them bullshit a little before getting naked and hard and jacking off.Jake Tells Landon 'The Scoop'Just as we did in Crossin' The Line 1 I tell Jake that I have to leave for a bit and that it's his duty to tell Landon all about the other videos we do. Jake assures me that he'll be very thorough and leave out no detail. While I'm gone Jake starts telling Landon that we also do gay films and that he has done them before and it's not that bad. He then starts to quiz Landon about his curiousities of being with another guy. Landon reply's that everyone has thought about it at some point and Jake continues to fish for a cue that Landon might go for it. Landon isn't that easy of a sell though and Jake has to put on his thinking cap for this guy.Jake Meets A Perfect MatchI'm still gone and Jake is still trying to fish for the cue with Landon as he tells him that sucking a cock really isn't that bad. At this point, Landon comes back with a reply that I think intially shocked the shit out of Jake (I know it shocked me when I watched it). Landon looks at Jake and tells him that since he knows so much about sucking cock and that it isn't that bad that Big Jake should suck his cock...what aætough cookie! This really catches Jake off guard at first, almost making his job way too easy. But Jake is smart enough to make a deal with Landon. He tells Landon that he will suck his cock first if Landon will return the favor. Landon doesn't give Jake the answer he wants to hear right away, but thinks about it for a minute. Finally he agrees that if Jake will do the deed first he will follow. I return to the two of them jacking each others cocks and begin to help Jake ease Landon on to the next step. The Line Is Crossed, And The Action Is OnJake goes to town on Landons cock, giving him a great, slow and easy blowjob. Landon starts to keep his end of the promise by grabbing onto Jakes cock and jacking it while Jake gives him a blowjob. Landon is not going to back out at this point and Jake raises up on his knees after sucking Landon for awhile and Landon gazes at Jakes cock for a few moments almost if he's not sure if it's his turn or not, but the anticipation during these few minutes is priceless. You can tell that Landon is just waiting for the cue that it's his turn. Finally, without having to be told, he goes in for the kill and takes Jake into his mouth. Landon isn't scared by any means and holds his own in the blowjob arena. He's giving Jake as good as he got. The two of them switch back and forth giving each other head and then Landon suggests a 69 and they get into a 69 and go at it that way.Jake Lays Back And Gets Ready For Landon's Young Virgin AssAfter a little 69 action, Landon tells Jake to lay back and relax on the bed while he gives him some more head. Jake at this point starts playing with Landon's cute, hairy ass. He puts in a finger and talks about the suction and how tight it is. Landon doesn't seem to mind this at all so Big Jake keeps fingering and playing with Landon's hole. You can tell that Jake is getting excited at the thought of possibly fucking him and I start asking Landon if he'd let Jake fuck him. Eventually Landon agrees and Jake gets behind him and eases his long, bent cock into Landon's waiting ass. It's on like a pot of neck bones now folks, Landon is ready to take it and Jake is ready to give it. I get excited and start doing some really dirty talk in the background asking Landon if he likes it as he moans and groans in pleasure. It takes a few minutes for him to relax and accomodate Jakes big cock, but once he does he does it like a champ. Landon is so cute, and I get some very good close up shots of that beautiful face as Jake plows him from behind. I get involved in talking Landon through it and he really starts to get into it, responding to my questions of is it good? You like that cock in your ass? It's clear that this is his first time and it's clear that he's loving it.Big Jake Works Up A Sweat And A Big LoadLittle Landon is giving Big Jake a run for his money as Jake starts to pour sweat. Jake is loving this newbies hot ass and it isn't long before he's going to explode. He cues us that he is going to cum and Landon turns around and positions his mouth on Jake's cock and takes his cum into his hungry mouth. Just like a true champion, he takes the load and lets it ooze out of his mouth. Jake lets out a few grunts and moans and says how good it feels. After Jake has blown his load he tells landon to lay back on the bed and he sucks him off to an explosive cumshot and Landon blows before Jake can get his mouth around his cock. But Jake goes down to Landon's belly and gets the goods after the explosion is over. By this time I think I was laying on the floor waiting on the paramedics to come revive me, I don't remember. But I know this is one hot video that moves very quickly without a lot of bullshit time. Landon is a trooper and he's just proved it.",
  "models": [
    {
      "name": "Landon",
      "person_id": 35111
    },
    {
      "name": "Jake (Big Jake)",
      "person_id": 35199
    }
  ],
  "release_date": "2003-03-01",
  "scene_id": 69919,
  "tags": [
    "Gay"
  ],
  "title": "Jake & Landon"
}