{
  "collections": [
    "Active Duty"
  ],
  "description": "Big Jake gets tired of waitingThis visit was Jake's third and by this time he is anxious to move forward and try some new shit. As Jake says, Life is short .. live it up. When I first met him on our drive back to my house he said This ain't no fag shit is it? I told him that I was offended by the remark and he quickly apologized and said that he really wasn't homophobic but that he just couldn't get down like that. Well, you guys know me well enough by now to know that I don't give up that easy. So, by his third visit Jake has changed his whole outlook on the mansex issue (with a little help from me of course). He tells me in the beginning of the tape to quit bullshitting and get somebody over here to suck this fucking cock. I start scrambling to find a quick mate for our new hero and who would answer the call but our other new recruit and absolute gorgeous little sex pig, Cheyenne.Cheyenne answers the call of dutyCheyenne arrives about 20 minutes later and wastes no time dropping to his knees and servicing Jakes huge curved cock. He licks and sucks the manmeat while Jake directs his cocksucker with verbal abuse, Suck that dick boy, don't play with it. Yeah, suck daddy's big dick. Our little sex pig is loving this direction as he moans and slobbers on his newfound daddy's tool. Jake moves over to the couch and sits down to enjoy his new boytoy as he continues to direct him. Lick the shaft boy, you know you like it. Yeah, daddy likes it too. You're makin' daddy feel gooood boy. Jake is starting to really like what's happening as his big gun gets cleaned by his little private. He tells Cheyenne to stand up and take off his fucking clothes so he can see his cock. Cheyenne obeys his commands and strips off his BDU (Battle Dress Uniform) bottoms and combat boots. Cheyenne drops right back to his knees with his now hard cock in his hand as he strokes himself and continues to service his daddy Jake. Big Jake starts moaning and talking more shit to his boy as his nuts tighten and he gets ready to blow his huge load. You gonna let me cum in your mouth boy? Jake groans and Cheyenne replies with a moaning uh huh and suddenly the huge load starts pouring out of Cheyenne's hot little hungry mouth. Jake shoots a large load and his hungry cocksucker tries his best to gulp it all up but it just oozes out all over his face. Cheyenne is loving this and continues to lick and suck the cum-covered cock as Jake tells him how fucking good it feels.",
  "models": [
    {
      "name": "Cheyenne",
      "person_id": 35058
    },
    {
      "name": "Jake (Big Jake)",
      "person_id": 35199
    }
  ],
  "release_date": "2003-10-01",
  "scene_id": 69911,
  "tags": [
    "Gay"
  ],
  "title": "Cheyenne & Jake"
}