{
  "collections": [
    "Active Duty"
  ],
  "description": "Cheyenne's Jockstrap FantasyThe video starts out with the Jamie, Kody and Cheyenne chilling out on the bed and watching a straight video that I made of a soldier and his wife a few weeks back. I start talking to the boys about their fantasies and tell them to each come up with their own fantasy. When I return to the room it's obvious that Jamie and Kody have come up with a fantasy of fucking the soldiers wife that they are watching. Cheyenne has his own fantasy though and it doesn't involve a woman, but three jockstraps and the two hot guys on the bed with him.I get to Cheyenne last and we talk about this fantasy he has of having Kody and Jamie in jockstraps and sniffing and smelling their jocks and sucking and biting on them. Kody and Jamie are a bit surprised by their new buddy's fantasy, but they agree to help him fulfill it if I promise them their fantasy of fucking the chick on TV. Naturally I agree and issue the three boys their jockstraps (worn by many, many other models in the past since their last washing) and the jockstrap fantasy begins. Cheyenne has the two boys stand on the bed above him while he buries his face in their jocks and sniffs and smells and licks and bites on them. Kody is really into this and is helping Cheyenne all he can.The Cocksucking Fantasy BeginsJamie and Kody lay on the bed side by side and our boy Cheyenne begins the next part of his fantasy and starts sucking and licking on their balls and cocks. Kody is really getting into this as he watches Cheyenne's every move even when the attention is on Jamie's cock. Cheyenne gives the two cocks a good working over and the scene changes up to the three boys on the bed and Kody in the middle. Jamie and Cheyenne start servicing Kody's cock together. It's a cockfight here folks as the two boys wrestle over Kody's cock in their mouths. It's obvious as he grins from ear to ear that Kody is loving all this attention and at just 18 years old it's probably the most he's ever had at once.Cheyenne gets up on his hands and knees begging for Kody to finger his hole as he continues to wrestle Jamie for Kody's cock. Kody slowly slides his hand back and starts playing with Cheyenne's hot, watering hole as the two boys continue to share his cock. It's not long before Cheyenne is begging at the camera for someone to fuck his hot ass. At this point, Jamie gets up and puts his cock in Kody's mouth (supposedly getting it ready to fuck Cheyenne) and Kody grips his lips around the cock hungry for his first experience. Kody isn't playing around with sucking cock as he tries his best to get Jamie's cock ready for Cheyenne's hot and bothered ass.",
  "models": [
    {
      "name": "Cheyenne",
      "person_id": 35058
    },
    {
      "name": "Jamie",
      "person_id": 35095
    },
    {
      "name": "Kody",
      "person_id": 35098
    }
  ],
  "release_date": "2004-02-01",
  "scene_id": 69916,
  "series": "Bareback Barracks Buddies 3",
  "tags": [
    "Gay"
  ],
  "title": "Cheyenne, Jamie & Kody"
}