{
  "collections": [
    "Active Duty"
  ],
  "description": "The Call Comes And Jamie Has To Leave Cheyenne's Hot Ass To KodyEarlier, Jamie and I had talked about a fake call coming in that would make him have to exit the scene just as Cheyenne was ready to get fucked. Hey, what else was I to do? I knew that Kody didn't want to fuck a guy in his first video and as long as there was someone else to do it, that he probably wouldn't. So, Jamie exits the picture and Kody is left with his finger up Cheyenne's hot boyhole. Cheyenne doesn't know the trick that Jamie and I have pulled, but he wants his ass fucked by someone and Kody is the only person left. The two of them get into a sixty-nine for a bit then Kody gets down between Cheyenne's legs and sucks his cock good and long, bringing Cheyenne to an explosive cumshot. After Cheyenne is done blowing all his wad, Kody takes his cock back into his mouth and takes the last few drops of cum into his throat. Mmm ... mmm.Cheyenne Eats Kody's Ass Before The FuckingAfter he's blown his load, Cheyenne gets Kody up on his hands and knees and starts eating his ass good and long. I get some really good shots of this from beneath as Cheyenne munches away at Kody's beautiful young, pink hole. Kody loves to get his ass eaten and he's getting into this backside attention. Cheyenne is doing an exceptional job at this as I guide him through the ropes of eating a fine boy's ass. The shots are great here and you get to see Cheyenne's hungry tongue plow in and out of Kody's tight ass as he tongue fucks the hole.After some sweet-talking on my part and some begging on Cheyenne's part, Kody decides to do the deed and save the video by fucking Cheyenne's hot hole. Cheyenne gets on his hands and knees and assumes the receiving position. Kody (with jockstrap still on) inches up behind Cheyenne and buries his hard, throbbing manmeat into Cheyenne's hot, wet boypussy. Kody gets into this more than I thought he would and really starts to give our bottomboy a good hard fucking. I get some good shots of Kody's cock plowing into the hot hole as Cheyenne screams out in pleasure. Kody gives Cheyenne more than he bargained for as he grabs onto Cheyenne's jockstrap and snatches his ass back onto his cock, fucking Cheyenne into a hot sweat. Sweat pours down Cheyenne's back as his ass is getting fucked good and hard. Kody isn't playing with this assignment and doesn't give up too quickly. He's fucking his first ass and he's doing a great job at it and having fun along the way. Finally he gets ready to shoot his hot load and our pig Cheyenne turns around and takes the load into his mouth as it runs down his chest. It's at this point that I think seeing Cheyenne spit the load back into Kody's own ass and lick and eat it out would be hot, so I tell Kody to get back on his hands and knees and Cheyenne spits the hot load into the ass of its bearer. This is totally fucking hot and raunchy folks as Cheyenne spits the load into Kody's ass and licks and plays with it, even jabbing a finger into Kody's ass putting his own load inside him. Somebody get out the fan, cause if you aint sweatin' along with Cheyenne and Kody by this point then something is wrong.A Quick Shower To Get The Sweat OffKody and Cheyenne get in the shower with their jockstraps still on and strip them off. They wash each other down and play with each other in the shower. This is a cute scene as the two boys appreciate each other and clean each other up.",
  "models": [
    {
      "name": "Cheyenne",
      "person_id": 35058
    },
    {
      "name": "Kody",
      "person_id": 35098
    }
  ],
  "release_date": "2004-02-01",
  "scene_id": 69917,
  "series": "Bareback Barracks Buddies 3",
  "tags": [
    "Gay"
  ],
  "title": "Cheyenne & Kody"
}