{
  "collections": [
    "Active Duty"
  ],
  "description": "Dirk and Shane come over for a few beverages<br />After a long afternoon at one of the local strip joints playing volleyball, taking soda and watching girls bounce around topless in bikini's Dirk and Shane decide to stop by my place for a few more beverages and I'm sure Shane was thinking about having just a little more than a few beverages. But, once they get here, it's obvious that Dirk may be thinking the same thing. Dirk says he's horny as fuck and is ready to do whatever to get off. After his double jerk off session with Kody a few nights before he must have been giving more thought to the whole situation and what better time to take that next step than today when he's all horned up and had a few cold ones?<br /><br />The two of them start watching a video and having their beverages as they reach inside their sports wear to fumble with their cocks. Dirk is hard before the camera ever comes on and it doesn't take Shane long to follow his lead. Shane cuts those adorable glances of his over at his buddies cock and they start talking about the possibility of getting it on.<br /><br />Strip Joint Athletes Clean Up<br />I start getting the shower ready for our two strip joint athletes to clean up a bit. Once in the shower they start washing up and Shane decides that Dirk's cock could use a little polishing so he drops down on the shower floor and starts giving the huge cock a good working over. Dirk doesn't know what to think about this hot mouth around his cock and he gives the camera some looks of surprise. But he's not complaining as he gets into the service he's being given and starts telling Shane what a fucking pro he is. After a good slobbing of the knob, Shane turns Dirk around and starts licking and munching on Dirk's beautifully rounded, smooth ass. It tickles a little but Dirk just giggles and spreads his cheeks and grabs Shane's head and pushes it in as his tongue twirls around the virgin territory. The soap just runs all over the two hot GI's and Shane gives his best at eating the wet, freshly washed ass.<br /><br />Back To The Beverage and Blowjobs <br />The two dry off and head back to the living room where Shane continues to work on Dirk's huge fuck stick, licking and giving the camera his famous little grins as he laps on the big cock in front of him. Dirk is still in la-la land and loving every minute of it. Then Shane flips him over and starts eating his ass again while Dirk jerks his own cock. Once he has Dirk close to the edge, Shane switches up the action and takes advantage of Dirk's hot mouth as Dirk puts his first cock between his lips. He's not shy though and must have learned a little from watching Shane works his meat over. Dirk is doing his duty and then the action turns back to Shane as he stands Dirk in front of him so Dirk can fuck his face. And fuck his face he does. Dirk throws one foot up on the couch, grabs his cheek and the back of Shane's head and starts fucking away as his big cock sinks deep in Shane's throat as Shane strokes his own cock and builds up a load. Once he's close, he stands up over Dirk and blows a huge load all over Dirk's chest.<br /><br />Dirk Uses Bareback Tactics on Shane's Ass <br />After Shane has shot his first load (he shoots two in this video) Dirk is all horned up and ready to fuck something. Shane is fine with offering up his ass for Dirk's pleasure and Dirk suits up with a condom. But once he see's that the condom is causing him problems he decides to use some bareback tactics and give it Shane raw and rough. Shane straddles the cock and starts slowly taking every inch of it deep in his ass as Dirk humps to help him out. Once Dirk is deep inside, Shane starts riding cowboy style and you'd think they were at a rodeo. Shane flips around so he can face Dirk and continues riding the cock cowboy style, reaching back and playing with Dirk's balls as he grunts and moans and takes on the big cock. All this ass play has got Shane all pumped up and full of another hot load and he blows another load all over Dirk's chest as he keeps the big cock deep in his ass and riding it hard.<br /><br />Dirk Feeds Hungry Shane a Tasty Load<br />After he blows his load, Shane hops off Dirk's cock and positions himself between his legs and starts begging for his cum in his face. Dirk is ready to blow and when he does it hits Shane's waiting mouth and Shane just laps up the hot jizz gurgling it and swishing it in his mouth then spitting it back out. Two horny troopers have reached their goal and ended out a very physical afternoon with hot, raw, unrehearsed mansex.",
  "models": [
    {
      "name": "Dirk",
      "person_id": 35078
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2004-04-01",
  "scene_id": 69928,
  "series": "Rear Formation 3: Bareback Tactics",
  "tags": [
    "Gay"
  ],
  "title": "Dirk & Shane"
}