{
  "collections": [
    "Active Duty"
  ],
  "description": "Kane Is Able... <br />He's been progressing pretty steadily with his comfort levels and finally agreed that he would do a double jerk-off video and possibly let another guy jack him off and he might fuck another guy with a dildo. Well, that was enough commitment from him for me to move things just a step further. So, I invited Landon and Cheyenne to help me cajole our boy Kane into going from jacking off to sucking and fucking. I wasn't sure how things were going to turn out, but I was pretty sure with two horny little devils like Landon and Cheyenne that something much more than jacking off was going to go on and I was right.<br /><br />The three horny soldiers start out on the bedside by side with Kane in the middle and thinking the three of them were going to be jacking off. It isn't long before the cocks come out of the underwear and suddenly, out of nowhere, Kane reaches over and grabs Cheyenne's cock. Then, he reaches over and grabs Landon's cock with the other hand and the look on his face is priceless. He's like a young man in a candy store at this point as he strokes the two big cocks. So, the three hotties start jerking each other.<br /><br />Not one to waste any time, Cheyenne is the first to go in for the kill on Kane's cock and gives it a few good sucks and licks and turns things over to Landon. The two of them go back and forth sharing Kane's cock as Kane jerks the two of them off. Eventually Cheyenne moves over and latches on to Landon's cock for a different taste. They then get Kane on his knees and Landon starts working his cock while Kane rubs on Cheyennes body. Cheyenne then turns Landon's cock over to Kane and gets behind Kane's beautiful ass and begins to tongue it long and hard<br /><br />Cheyenne is really into eating this pretty ass and gives it plenty of attention with his tongue. Kane is new to this experience and it takes a minute for him to get used to the feeling, but once he does, he welcomes all the tongue attention that Cheyenne can give it as he continues sucking and slurping on Landon's hard meat. The three of them do a postion change and Kane squats over Cheyenne's face and rides his tongue while he continues to service his new buddy Landon. This is some hot action here troops as that perfect ass bounces up and down on Cheyenne's hungry tongue.<br /><br />Kane Goes In The Backdoor, Bareback <br />Pretty soon, Cheyenne is all hot and bothered and makes it clear that he wants some cock in his ass. Kane agrees that he'll give it a try and so Cheyenne gets on his hands and knees with Landon's cock in his mouth and Kane puts his hard cock deep into Cheyenne's hot hole and begins to fuck him for everything he's worth. Cheyenne is bouncing back and forth as Kane slams in and out of his ass, giving him a good fucking and all the while taking Landon's hard, hot cock down his throat and working it over as good as Kane is working his ass. They switch positions on the bed and I get some really good shots of Kane banging Cheyenne's ass as his balls slap against it hard and loud. We also get some really good close-up shots of Kanes nice asshole as he fucks Cheyenne. After a good long fucking, Kane pulls his cock out and cums all over Cheyenne's ass. <br /><br />Cheyenne Gets Some Bareback Payback <br />After he's taken his good fucking for the evening, Cheyenne gets Landon bent over on his hands and knees and starts plowing him bareback like a madman. This is Cheyenne's first time fucking a guy on video and boy we should have done it sooner cause he's quite the fuck machine. Landon is taking it like a man and enjoying every minute of it as Cheyenne thrusts his hard, fat cock in and out at a rapid pace, barely letting up to take a breath. Landon keeps with the pace and sucks on Kane's cock as he takes his fucking. Kane blows another load and this time all over Landon's back. Then, Cheyenne is about to blow his load so Landon turns around and takes the hot jizz in his mouth. This is so hot to watch as he takes the load and we watch it ooze out all over his hand and the bed. Mmm. Mmm.",
  "models": [
    {
      "name": "Cheyenne",
      "person_id": 35058
    },
    {
      "name": "Kane",
      "person_id": 35101
    },
    {
      "name": "Landon",
      "person_id": 35111
    }
  ],
  "release_date": "2004-04-01",
  "scene_id": 69921,
  "series": "Bareback Recruits: Raisin' Kane",
  "tags": [
    "Gay"
  ],
  "title": "Cheyenne, Kane & Landon"
}