{
  "collections": [
    "Active Duty"
  ],
  "description": "Nervous as a whore in church ...Cameron is one of those soldiers that finds little interest in much else besides sky diving and things that most people consider living on the edge so I knew from the beginning that if I stuck it out and waited long enough that the call would come and he would finally decide to cross that boundary and give something else new and exciting a try. Being a man that spends all his money on his adventures and leaving little for anything else, he doesn't own his own car. So, I had to do what I've done many times before and play taxi and make my journey onto base to retrieve him for this shoot. Only now, since 9/11, everything has changed and you now have to stop, get out of the car at the base gates, be searched, have your car searched as suspicious MP's (military policemen) hoover around you giving you the once over like you might be part of some terrorist plot. It's a good thing, but it leaves you feeling as nervous as a whore in church, still shaken up well after you're through and inside the gates.Cameron is nervous but still willing to jump ...I arrive at his barracks and pick him up. Cameron gets in and starts asking me all kinds of questions about what is going to happen. Well, being that I never really know what I'm going to do until the camera is turned on and recording, I had few answers for him. He accepted my sketchiness and we rode on.The camera is rolling and Cameron and Shane are side by side on the bed watching a video and it isn't long before they are stripping out of their clothes to play with the wood that has formed in both of their pants. Shane is excited and anxious to see the cock that awaits him. It's all he can do to keep his eyes off of Cameron's crotch. Finally, the fat, long and curved monster emerges and Shane smiles a huge smile of relief. If there is one thing Shane enjoys it's a big cock. And as I always say ... everyone loves a big cock so why should Shane be any different. The two of them shoot the shit back and forth and Shane talks to cameron about sucking a cock. He tells him that it's really no different than sucking your finger. Eventually, the two of them start jacking each others cocks and Cameron is coming along quite nicely.I'm out of the room for a few minutes and come back to find Cameron has left the room. Shane says he had to go to the bathroom. When he returns he takes the other side of the bed and I start the camera again.Cocksucking at its best ...Not long after the camera is rolling again, Shane suggests that Cameron might need some help and Cameron is more than willing to accept. Shane makes the dive down between Cameron's legs and latches on to the rock hard monster and takes it in his mouth, savoring the moment, taking full and complete pleasure in his big prize. Cameron is taking the same pleasure in his new comrade's hot mouth. The two of them are really getting into this and it shows as Shane tries his best to swallow the whole thing and Cameron lets out several sighs of ecstasy. Shane doesn't waste any of the precious time he's spending on Cameron's cock. He laps it up and loves every minute of it. This is one of the hottest blow-job scenes I've ever filmed as the two of them keep in pace with the action.The anal retreat ...After enjoying one long and sensual knob job from his buddy, Cameron says to Shane, Do you like to get fucked man? Shane responds with, Sometimes, it just depends on the mood I'm in. and Cameron shoots back, Well, is this one of those times when you are in the mood? Hell yeah Shane replies. But before he gets ready to fuck him, Cameron starts talking to Shane and asking him how bad he wants his big cock in his ass and if he thinks he can handle it and gets Shane all worked up over the thought of it.Once it's established that Shane is all worked up over taking the monster, Cameron positions himself behind Shane and starts his entry (which at first is very painful for Shane) pushing into Shane's tight, hot hole with his huge manmeat and eventually hitting bottom. Once he's in it's on folks and our wonder boy Cameron fucks the living shit out of our trooper Shane. And when I say fucks, I mean FUCKS! The fucking that Cameron gives Shane is as long as the blowjob that Shane gave him, but it's nowhere near as slow and succulent ... it's much more fast and hard and banging.Cameron talks to his bottom boy as he slams his huge cock in and out of his tight, torn hole. He says, you like that big fucking cock in your ass? Fuck yeah! comes the yell. Fuck me hard and Cameron does. He fucks Shane harder and better than he's probably ever been fucked then as I'm filming from above Shane's shoulder, Cameron pulls out and blows one of the biggest loads (something that is standard for him) that I've ever seen. It covers Shane's back, hits me, hits the camera lense and hits Shane in the head as well. By this time, Shane is dripping sweat and out of breath and so am I and you will be too. To end his own frustration and horny state, Shane starts jerking his cock as Cameron moves in close and wraps his arm around his shoulder. It isn't long before Shane is gonna blow and Cameron offers his chest as the drop zone. Shane spits out a huge load all over Cameron's chest, covering his dogtags in hot, gushing cum.",
  "models": [
    {
      "name": "Cameron",
      "person_id": 35055
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2004-04-01",
  "scene_id": 69925,
  "series": "Rear Formation 2: Anal Retreat",
  "tags": [
    "Gay"
  ],
  "title": "Cameron & Shane"
}