{
  "collections": [
    "Active Duty"
  ],
  "description": "Brennan and MattBrennan brings over his buddy Matt without telling Tuffy that they are coming over. Kind of a covert operation on Brennan's part. The two of them get settled up in the living room and I put in a porn for them to watch. They bullshit back and forth for a minute about the hot bitches on the porn and it isn't long before our newcomer Matt starts really getting horny and passing glances over at Brennan's crotch to see if there is anything rising. When Matt starts fumbling with his cock and trying to pull it out, Brennan locks his eyes on the prize to see what Matt is packing. Out comes the monster and Brennan gives the once over and a huge look of awe. Brennan tells Matt that he's packing a pretty big dick as his mouth waters and he tries to maintain his masculine image.Matt is loving the eyeballing that Brennan is giving his cock and finally asks if Brennan has ever sucked a cock before. Brennan admits to having sucked cock once and Matt admits to having sucked one as well. Matt tells Brennan to reach over and touch his cock. Brennan says he's thinking about it and Matt calls him a pussy. Matt tells him he's not scared to touch his and reaches over and starts rubbing his leg. Then, he moves on up to Brennans cock and pulls it out of his boxers and starts some serious CPR on the dick. He's giving Brennan a mans blowjob as Brennan rubs his head guiding him on. The tables soon turn and Brennan is on his knees in front of Matt worshipping his huge cock, giving it all the TLC it can handle. Just like he learned on Tuffy's cock. He's not playing around troops, he's swallowing the huge dong whole, bouncing that head and kneck to give his buddy the ultimate in pleasure.Tuffy busts in and gets involvedTuffy bangs on the door and comes in catching the two in the act and asks what the fuck is going on. He said he rode by when I didn't answer my phone and seen Brennans car and new something was up. The three of them start bullshitting and Tuffy tells them that they can't leave out the king. Tuffy pouts for a few minutes and then tells the two of them that he's in on the shit. So I move the three of them to the bedroom.Three buddies get down to business In the bedroom Tuffy tells Brennan and Matt to continue on with what ya'll was doin'... hell don't mind me dawg Matt and Brennan ask him if he's scared to get involved and he says hell no, but I want to watch ya'll a little bit. It isn't long after Brennan starts working on Matt's cock again that Matt is down on Tuffy's cock, giving it the same love that Brennan is giving his. Tuffy isn't satisfied with just one mouth though and wants both of his buddies on his cock at the same time. Matt and Brennan are more than willing to appease their king and start sharing the cock. Brennan takes Matt's hat and puts it on his head as they share Tuffy's fat cock, licking up the shaft with tongues gently touching.Tuffy winks and grins at the camera like the star he is. He's feeling like the man right now and takes the hat off Brennan's head and places it on his as he gives the camera those sexy shit eating grins of his. He's in control. He grabs his cocksuckers by the head and says, these my boys right here and at that moment Brennan and Matt lock lips in a tonguing kiss. Tuffy seems surprised but freaked out in a good way. He aint believing this shit. Matt then moves up and puts his big cock in Tuffy's mouth to shut him up a little. Matt starts facefucking Tuffy and Tuffy is trying his best to keep up with the thrusts.Tuffy tells Matt to eat their buddy's ass for him Tuffy takes charge and tells Matt to get back behind Brennan and tongue his ass. Matt isn't hard to convince and listens to his instructions. He starts tonguing the hell out of his buddies ass, eating, licking, slurping and enjoying every minute of it then slapping his cock all over Brennan's beautiful ass. Then it's back to eating as he spreads Brennan's cheeks apart and tongues his tight, pink hole. Tuffy asks Matt if that ass tastes good and Brennan arches his back and says that Matt sure knows what he's doing.Tuffy wants in on the ass action Tuffy can't stand it anymore and has to see what's going on back there as he straddles over Brennan, sitting in the small of his back and starts slapping his cock on Brennans ass too as Matt keeps licking and eating. Matt then starts sucking on Tuffy's cock as he continues eating Brennan's ass, going back and forth between the two. This is some hot stuff troops as Brennan enjoys having his ass be the center of attention.Brennan takes his first cock in his ass barebackMatt and Tuffy switch places and Matt starts spreading Brennan's cheeks apart and fingering his tight hole as Tuffy lubes up to go in for the kill on his buddies virgin boypussy. tuffy starts slow and once he's in he gives Brennan a good pounding. Brennan throws his ass back and enjoys the ride. Matt stands up and starts feeding Tuffy his long cock as Tuffy plows into Brennan and sucks away on Matt. Tuffy then stand flatfooted on the bed and bangs down into Brennan's ass. Matt moves around and slaps Tuffy on the ass and then starts eating Tuffy's ass as Tuffy thrusts in and out of Brennan.Matt gets it bareback from Tuffy and Brennan After a good long and hard fucking, Brennan tells Matt it's his turn. Brennan puts his cock in Matt's mouth as Tuffy positions himself behind Matt and starts craming his hard cock deep into Matt's mouth and Brennan instructs Matt to keep sucking his fucking cock. Tuffy shows Matt no mercy as he takes out all his agressions on Matt's hot ass. I mean Tuffy is banging this boy like there is no tomorrow, giving it to him deep, all the way down to the balls and slamming harder and harder. Matt just whimpers as he tries to keep sucking Brennan's cock and take a good man fucking at the same time.Then, Tuffy and Brennan switch places and our boy Brennan gets his revenge on Matt's already hard fucked ass. He bangs and pounds Matt just as hard and long as Tuffy did as Matt works over Tuffy's cock. All of us start yelling and screaming as Matt gets all excited. Tuffy says he likes that shit and he does. Tuffy tells Matt to say his fucking name as Brennan keeps pounding away. Matt gets into it as we all yell and starts yelling at Brennan to sink his cock deep in his ass. Put it in me bitch...come on...put it deep in me Tuffy tells him to shut the fuck up and suck his dick.Even Big Jake gets in all all the yelling telling Brennan to make the bitch arch his back and fuck his ass. Brennan grabs ahold of Matt's dog tags and chokes him with them as he rams him from behind. All the while Matt is working over Tuffy's big cock and soon Tuffy blows his load in Matt's mouth and all over his face as Brennan starts nearing his cumshot as he keep plowing Matt's ass. When Brennan finally blows his load all down the crack of Matt's ass he then takes his cum-drenched cock and rams it back into Matt, putting his hot cum deep in Matt's ass. And as they say in show business troops, that's a wrap. Brennan and Matt have both been fucked long and hard and the party is over.",
  "models": [
    {
      "name": "Brennan",
      "person_id": 35045
    },
    {
      "name": "Tuffy",
      "person_id": 35163
    },
    {
      "name": "Matt",
      "person_id": 35419
    }
  ],
  "release_date": "2004-04-01",
  "scene_id": 69927,
  "tags": [
    "Gay"
  ],
  "title": "Brennan, Matt & Tuffy"
}