{
  "collections": [
    "Active Duty"
  ],
  "description": "Three Soldiers Greet and Meet Each Other... What happens when you throw three hot soldiers together on a bed with a porno playing in the DVD player and plenty of lube? Not to mention that our boy Kody was very hungry for his next video adventure. I'd spoken to him just a couple of days before and he told me he was very excited to get back to work and couldn't wait to see who I had lined up for him. Well, you know me, always trying to outdo what we did last and I think Kody was very pleased with the co-stars we lined up. In fact, the kiss that appears later in the video might have been evidence of a bit of happiness.The action doesn't take long to kick off as our new golden boy Shane gets things moving pretty quickly since he's eager to see the cocks he's about to suck. As soon as Shane sees that Tuffy and Kody are hard and waiting, he goes in for the attack and grabs onto their cocks. He says, Looks like you boys need some help and from there ya'll it's all slober and sweat and hot mansex. Y'all pay attention now as I try to give it to you play-by-play.Tuffy Trains With The Pros... Tuffy is new to all this man-love stuff and is a little nervous, but with the help of Shane, Kody and yours truly it doesn't take long for this little man with a huge tool to jump right in the mix and tackle the hard things. Shane jacks on Tuffy and Kody and he and Kody talk Tuffy into helping Kody work Shane's cock. Tuffy (not one to be outdone) hops in there with Kody and literally makes love to shanes nice, fat uncut piece of manmeat. The two of them swap spit and slobber as they hungrily feed on Shane's cock, giving it a working hardly matched by any he's ever had. Shane can't stand it any longer and wants a nice cock in his mouth so he get's Tuffy to feed him his nice long cock while Kody keeps going on Shane's cock. After making love to Kody's cock, Shane wants another taste so he tackles Kody's cock while Tuffy goes back to Shane's cock. Then they switch again and Tuffy tackles Kody's cock while Kody gets another taste of Shane.The action switches quickly as the hungry heroes want to taste each other and then some. Shane stands up and makes his uncut prize easily accessible to both his buddies and the two boys share the cock again. The troop trio does another switch up and Tuffy takes the standing position as Kody works on his big cock and Shane sneaks in the back to put his tongue in Tuffy's ass. Tuffy is ticklish and laughs a little at first, but then Shane gets him to squat over his face and feed him his beautiful pink man hole. Then they switch things up and Tuffy gets on his hands and knees with Kody's cock in his mouth and Shane's tongue in his ass. Tuffy is really taking a shine to this as he talks to Shane telling him to eat that asshole man. Shane tries to sneak his thumb into Tuffy's hole, but Tuffy isn't quite ready for that yet.The Line Forms at the Rear for a Bareback Attack... Shane decides it's time for a some cock in his ass and gets Tuffy to lay in front of him as he gets on his hands and knees and takes Kody's cock in his tight ass as he slobs Tuffy's knob. Kody gets in and starts pounding Shane's ass as Shane grunts on Tuffy's cock. Kody gets Shane all opened up for Tuffy's large tool and then Shane moves up to sit on Tuffy's cock as Kody positions himself above Tuffy and feeds him his cock as he feeds his ass to Shane's tongue. This is one steamy scene as Shane takes the large piece in his ass, slowly sitting all the way down on the cock as he tongue-fucks Kody's ass.Tuffy wants more control of the fucking and gets behind shane to plow him deep and hard as Shane starts working Kody up to a nut with his cocksucking skills. But before he makes Kody cum he moves up his chest licking and sucking his nipples then moves right to Kody's lips and they engage each other in a long, wet kiss that is just amazing. Then he goes back and finishes the job on Kody's cock, taking his hot load into his mouth as Kody explodes, swishing it around in his mouth a bit then he spits it back onto Kody's chest and plays with it there with his tongue while Tuffy keeps banging him from behind. This is some hot shit as Shane goes back and licks the load back off Kody that he just spit onto him.Watching all this while he's banging Shane's hot ass has Tuffy ready to blow and Shane doesn't miss a beat as he turns around and lays beneath Tuffy and takes his hot load into his hungry mouth as well. Talk about getting every last drop, our boy Shane aint one to leave any left-overs.Shane has the Final Explosion... After all this hot fun, Shane is the only one left to blow his wad and his two partners in crime come to the rescue as he pumps his load out, the two hungry helpers scuff it up as Shane blows a huge load, giving them both plenty to lap up. Are ya'll still breathing out there? If so, you need to go ahead and add this one to your collection. An Active Duty classic has just been described.",
  "models": [
    {
      "name": "Kody",
      "person_id": 35098
    },
    {
      "name": "Shane",
      "person_id": 35144
    },
    {
      "name": "Tuffy",
      "person_id": 35163
    }
  ],
  "release_date": "2004-04-01",
  "scene_id": 69924,
  "series": "Rear Formation: Bareback Attack",
  "tags": [
    "Gay"
  ],
  "title": "Kody, Shane & Tuffy"
}