{
  "collections": [
    "Active Duty"
  ],
  "description": "The Muddy Battle ... Big Jake referee's the mud wrestling match between Kane, Luke and Shane. All you Big Jake fans will be glad to see him and know he's still alive and well. But the real fun will come as you watch Kane, Shane and Luke battle it out in the deep mud and eventually pull each others clothes off revealing hot jockstraps beneath. Once the clothes are off we get to see these three heroes slip and slide and really kick each others asses as they pull, grab and throw each other around in jockstraps. Once the battle is over and the winner is determined Big Jake showers the boys off with the garden hose and we see those tight, hot bods glisten in the wetness of both the water and their sweat. What a hot way to begin what turns into hot sex later in the house.The Next Step in The Battle ... Back in the house the boys nestle together on the couch and start right out playing with each others cocks. Luke is the first to start out sucking on Shane's thick, uncut cock. Once his cock is in a hot mouth, Shane invites Kane to use his mouth so Kane stands up and feeds Shane his rock hard cock. Shane and Luke are going at it, Shane giving Kane some good, deep head and licking and slurping on the tool as Luke gives Shane his best lip service we've seen out of Luke yet. It's obvious he's enjoying the uncut wonder. Just so he doesn't feel left out, Shane and Kane drop down on their knees in front of Luke and share his gun. It's a battle of tongues and hot mouths here troops as the two soldiers shine their buddies weapon. Luke watches intently as his brothers in arms service him good. Shane wants more of Luke's hot mouth so he leaves Kane to keep working on Luke as he moves up and feeds his cock to Luke, standing over Luke and fucking his face, filling his hungry mouth with hot, uncut military meat.The First to Bottom in the Battle ...Shane standing over Luke feeding him his cock puts him in a perfect position just to squat down and ride Luke's hard gun. So, Kane rolls on the condom and lubes up Lukes dick and gets it all ready for Shane to sit down on it. Once Luke's gun is in Shane's holster, he starts jacking Shane's cock as he slams his cock in and out of him and Shane rides the tank cowboy style. After a bit of this postion, Luke puts Shane on his knees and plows him from behind. Then, he switches off to Kane and Kane begins his entry and starts banging Shane hard and fast as Luke goes around and starts feeding Shane his cock. By this time Shane is sweating his ass off as always so Luke feeds him some beer then tells him to get back to sucking.A Little Dessert Break Between Battles ... Shane postions Luke and Kane on the couch side by side with their asses in the air and squirts a little whip cream on their hot, sweaty assholes and commences to licking them clean then licking them some more. He's slyly getting the boys hot asses ready for the fucking he's about to give each one of them.Virgin Asses Battle for Bottom ... Kane is the first to get Shane's fat cock shoved up his ass and this is his first time ever being fucked folks. Pay close attention here troops as our boy Kane gets a little lesson in taking his first cock and what a big one it is. But he's a trooper and he doesn't complain. In fact, I think you'll agree that he takes it like a champ and we all know what a beautiful ass Kane is sporting and to see it get banged good for the first time is an extra sexy treat. I get some really good close-ups of all the insertion and balls deep penetration. Kane has got to be packing the absolute most perfect as I've ever filmed and Shane is giving it one of the best fuckings it'll probably ever get as he reaches over and fingers Lukes ass and gets it ready to be fucked next.Luke Loses his Virginity ... Next up is Luke's virgin ass and boy does Shane ever fuck this boy silly. He's giving it to Luke as hard and fast as Luke gave it to him and Luke is riding out the storm as he sweats and moans and even yells out a couple of times, Holy Fuck Man. As he's plowing Luke's tight virgin hole, Shane is sucking Kane up to a nut that he takes in his mouth and spits back out on Kane's cock. Once he's had the taste of hot cum it isn't long before Shane blows his own hot, huge load all over Lukes sweaty back. This is one explosion folks. It covers Luke's back and drenches our freshly fucked virgin in hot man juice.Lickin' Up Luke ... After they've shot their loads, Kane and Shane help our boy Luke pop his. And once he does our hungry hero Shane laps up the load and gets himself a taste. Our three heroes are worn out by this point and just kick back and lay on each other and relax. The battle is over and two virgins are virgins no more.",
  "models": [
    {
      "name": "Kane",
      "person_id": 35101
    },
    {
      "name": "Luke",
      "person_id": 35116
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2004-06-01",
  "scene_id": 69934,
  "series": "Battle of the Bottoms",
  "tags": [
    "Gay"
  ],
  "title": "Kane, Luke & Shane"
}