{
  "collections": [
    "Active Duty"
  ],
  "description": "Tuff Gets Hold Of Some Newbies<br />Dink says, I so Love Cock! and tells Tuffy, These are privates, newbies, show them the ropes. Tuffy checks the others for tattoos as the shirts come off. Dirk comes out of his pants hard, and says as the others watch, Ever seen a dick this big? Can you get your shit this high 'bro?' He keeps holding his dick up straight so Luke and Tuffy can't avoid Looking at it. Don't you guys want to touch this big dick? Luke says it's the second largest he's ever seen and starts to jack it off. Tuffy reaches over and cups Dirk's balls. (wantin' his turn bad).<br /><br />Dirk says to Tuffy Why don't you stroke on it a bit. Tuffy just smiles and takes over. Dirk says to both boys why don't you see if you can get two hands around it? The double-hander takes far longer than it should with both Tuffy and Luke admiring the glistening shaft. Dirk says,You stroke a good dick, let's see if you can do anything else.<br /><br />Luke starts trying to get more of the dick in his mouth and finally says, I need a breather, I really mean I can't breathe on this thing! Tuffy takes his turn, but Luke wants to try again. Five minutes later we hear I can't breathe, you take it Dirk just laughs and smiles, He's been there before with both men and boys trying to take charge of the monster dick.<br /><br />Tuffy trys to suck Dirk too, but gets back to the task at hand. He has only been able to get about three inches in his mouth. Luke keeps flexing his big beefy shoulders, wanting to get down to business with that hunk of flesh and feel it down his throat.<br /><br />Tuff Takes His First In The Ass<br />When Luke can't get all of Dirk's dick down his throat, he decides to put his own as far up Tuffy's ass as it will go. Tuffy says, Wooa man, not so fast ... easy on my butt! Dink says, just relax as Luke plows it all the way up into Tuffy. Luke easily moves his dick in and out of Tuffy and we can see that before long there's a tight little ass pushing back.<br /><br />Tuffy is making faces and groaning, but you couldn't pry him off of Luke's dick. Watch as the dick slides easily in and out of Tuffy's little round ass. If truth were known He is probably getting the fuck of his life. And we were there for every stroke!<br /><br />Tuffy sucks Dirk's dick as Luke works up a sweat. Luke pulls out and Dirk sucks his dick slow and easy, really making love to it. Suck that dick pretty boy, Luke says as he watches Dirk on his meat. Luke and Tuffy stand up and Dirk switches back and forth between the two dicks in front of him, softly sucking and caressing them with his eyes closed. Beautiful stuff!<br /><br />The cumshots are the sweetest we've seen lately, with Dirk kneeling on the bed and Luke and Tuffy in front of him like acolytes on an altar. The difference is mostly the pint of spooge on the bed. Dink says I call that hot mansex fellas. Did you know that sex between men is animalistic by nature, not romantic. Animalistic achieves one goal, that is to get off! And I think that you all were getting a little romantic over there. Tuffy what about your first time? Has life changed for you forever? Tuffy says, I think so, let's see what happens. Dink says,'Appreciate you playin' guys. I swear, so much hot sweat.",
  "models": [
    {
      "name": "Dirk",
      "person_id": 35078
    },
    {
      "name": "Luke",
      "person_id": 35116
    },
    {
      "name": "Tuffy",
      "person_id": 35163
    }
  ],
  "release_date": "2004-06-01",
  "scene_id": 69930,
  "series": "Rear March 2",
  "tags": [
    "Gay"
  ],
  "title": "Dirk, Luke & Tuffy"
}