{
  "collections": [
    "Active Duty"
  ],
  "description": "Beach Boys Bummin' Around ... <br />Swedish, Cole and Shane are at the beach house for the weekend. With Swedish and Cole being the two newest additions to the Active Duty family, I thought it would be fun to throw the two in with a certified veteran like Shane and see where things went. Swedish has been hanging out quite a bit lately and has really taken to his new surroundings of other hot and willing soldiers so I know he's in for the ride and so is Shane. And, surprisingly enough it doesn't take Cole long to join in on the fun.<br /><br />I joke with Swedish for a few minutes about all his newfound friends and how much he's lovin' the cock and he just flat out tells it like it is. He's happier than a pig in shit and ready to get some cock. Cole agrees with Swedish's suggestion of getting down to business and the three of them pull out their hard cocks and start beating off. Not one to waste any time, Swedish latches onto the the cock to his right and sucks on it for a bit then grabs onto Cole's massive tool and toys with it for a bit. A royal beach house suck fest begins.<br /><br />Sexy Soldiers Sucking ... <br />Our three heroes start sucking each other in every direction. Shane sucks Swedish, Swedish sucks Shane, Swedish and Cole switch places so Shane can get some of Cole's monster then Cole returns the favor to Shane while Swedish works on Cole some more then moves up and lets Shane suck him while Cole continues to suck Shane.<br /><br />It's a cocksucker's dream come true as three of America's hottest soldiers settle in for some serious oral action. You'll need your rewind button at your fingertips just to keep up with all the switch ups. It isn't long before our super sexy little eighteen year old smart-mouthed blonde baby boy tells his comrades that he's ready for some cock in his ass.<br /><br />Swedish Get Stuffed Bareback in the Backroom ... <br />Once they're in the bedroom it's right down to the business of getting our boy Swedish just what he wants and that's cock in his ass troops. Swedish is quite the trooper and ready to take on whatever cock you throw his way, but they decide that if he's gonna take Cole's cock that it might be best to prime him up with Shane's fat uncut cock first. So, Shane goes in for the initial drilling as Cole holds baby boys legs back and stuffs his cock in Swedish's mouth to keep him quiet. But, with the loud, smart mouth Swedish was born with, he can suck cock and cuss and yell at his fucker at the same time and that he does as he is primed by Shane.<br /><br />Talk about a mouthful? Swedish has got more than his little mouth can handle with Cole's cock shoved between his lips. Shane plows our little blondie bareback as Cole feeds him plenty of cock to keep his mouth busy. Shane glides in and out of the tight hole and Swedish is lovin' being the center of all the attention his two sexy sidekicks are giving him. Now that his ass is opened wide it's time for the king of cocks to makes its entry.<br /><br />Cole Puts His Monster Balls-Deep Inside Swedish ... <br />Cole steps up to the plate as our boy Swedish begs him to fill his hole with his huge tool. And, the wish is granted troops. Cole hits a deep homerun in baby boy's already dripping ass and buries it balls-deep in Swedish as our mouthy blonde just yells fuck yeah! Fuck my ass with that big cock! Talk about no-holds-barred. Swedish is taking it like a champ as he sucks on Shane's cock. We get a few looks of pain and surprise from Swedish, but it doesn't stop him from running his mouth and continuing to beg for the Cole's huge cock as deep as he can give it. Cole shows our boy no mercy as he pounds the sweet young ass for a long while.<br /><br />Finally, Cole can't take it any more. With Swedish yelling and his tight ass wrapped tight around Cole's cock, Cole pulls out and blows his huge load all over Swedish's gaping hole. Once he's covered the sweet pink and widely opened hole in hot cum, Cole shoves his dripping cock back into Swedish's hungry ass once more just for good measure. Ten and a half inches of thick, good measure at that troops!<br /><br />Cole Takes a Barebacking as Good as He Gives One ...<br />After giving Swedish the fucking of his life, Cole is ready for a good plowing and trades places with Swedish for Shane to bang him. Swedish assumes the position Cole filled as Shane plowed Swedish and starts sucking Swedish off while Shane makes the entry into Cole's ultra tight virgin ass. This is never before touched territory folks. Cole has never had a cock in his ass and you can tell by looking at it. But, he's as much of a trooper as Swedish and more than willing at this point to give it a try. Shane slowly stuffs his naked cock into Cole as Cole gives Swedish some great head.<br /><br />It isn't long before Shane is balls-deep in Cole and Swedish is screaming at the both of them the whole way through. Swedish is all about being very verbal and makes sure there's no dead air while the action unfolds. Shane continues to bang Cole good as he longstrokes the tight virgin ass ... going all the way in and slowly coming almost all the way back out then repeating the process several times over until he can no longer hold his long awaited cumshot and pulls out slowly to splash a huge load all over Cole's hole as Cole reaches around and spreads his ass cheeks so he doesn't miss a drop of Shane's load from landing on his freshly fucked pink pucker.<br /><br />Swedish Gets His Revenge on Shane's Ass ...<br />After being banged hard by both Shane and Cole, Swedish is ready for some revenge and he decides it's Shane's turn to take it like a man. Shane slurps and sucks on Cole's pole while Swedish gets Shane from behind and buries his cock in Shane as he yells at him and tells him to bend over and take it like he gave it. Shane is loving what's between his lips and what's between his ass cheeks as Swedish plows him hard. Swedish blows the last load of the day all over Shane's ass and our three heroes lay back on the bed and catch their breath. After all the action they've just given us, we should all be exhausted by now. But, you won't want to turn the video off.<br /><br />Swedish and Cole have just become part of the Active Duty Hall Of Fame and they don't even know it. You're gonna love these two. Cole with his huge cock and his beautiful smile and his eyes that grab you and dance with you as he gives the camera those playful and inviting looks and Swedish with his no nonsense, let's fuck attitude and his loud, smart mouth that keeps you going as the action heats up. These two are keepers folks and that's exactly what you'll want to do with them.",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2004-06-01",
  "scene_id": 69933,
  "series": "Bareback Recruits 2: The Cole War",
  "tags": [
    "Gay"
  ],
  "title": "Cole, Shane & Swedish"
}