{
  "collections": [
    "Active Duty"
  ],
  "description": "Kody, Cole, Shane and Cheyenne ... <br />Our four troopers come over to hang out and things take an interesting twist. Kody had agreed to get fucked, but not by Cole. Little does he know that I've already got it all planned out that he will do just that. So, I let him think that Shane will be the only one topping him in this video and that Cole will be topping our pig boy Cheyenne. And, Shane does top Kody and Cheyenne but Kody also gets topped by Cole and Shane also tops Cheyenne and Kody also tops Cheyenne and it's a fuckfest galore folks. So, Both Kody and Cheyenne get topped in this video. Kody getting it from both Shane and Cole and Cheyenne gets it from all three soldiers.<br /><br />Our four heroes get down to some serious blowjob action and start slobbin' knobs. Shane and Kody start on the couch while Cole and Cheyenne get their own action going down on the floor in front of them.<br />Cheyenne latches onto Cole's king size cock and you'd think lightening would have to strike before he'll let go, but then the four soldiers get things going with Cole sucking Kody while Cheyenne keeps sucking Cole and Shane starts eating cheyenne's ass, asking him if he's ready to have that ass tongued. Shane gives Cheyenne a good eating out before he starts his entry into Cheyenne's tight ass that is long overdue for a good fucking. Little does Cheyenne know but by the end of this video he will have been barebacked by every cock in the room so Shane's cock is just the first cock that's gonna get it all started. Cheyenne doesn't miss a beat sucking on Cole's cock while Shane begins to plow him good. Cole is enjoying Kody's cock and giving it a good working over. It's hot to watch from the angle that I'm shooting from as Cole sucks Kody as you can see Kody's big, muscled thighs flexing and the looks that Cole is so famous for giving the camera will make you wish you were right there on the floor with them.<br /><br />Kody Takes His First Cock in the Ass ... <br />After eating and fucking Cheyenne and getting his ass all loosened up for Cole, Shane gets behind Kody and starts playing with his ass and getting him worked up for his first fuck ever. Meanwhile, Cole gets behind Cheyenne and gives him his long cock deep and hard. Cheyenne takes a deep breath as Cole plows balls deep into his ass, but he isn't complaining. Once Shane has Kody bent over the couch he starts fingering his ass and opening his cheeks so we can see the virgin ass that is about to be fucked. Once he's fingered and lubed the tight hole he makes his entry. Kody grunts and moans and starts to sweat, but he's bound and determined to take Shane's cock like a man. Once Shane is in and Kody has relaxed the fucking is on And Kody finally relaxes and starts to enjoy the feeling of a mans hard cock in his ass. While this is going on, right beside them on the couch Cheyenne is sitting on Cole's huge meat and riding it hard, taking every last inch of it and you hear Cheyenne and Kody moaning and groaning together almost in harmony. Kody is starting to like Shane's cock in his ass and he let's him know by yelling out Yeah man fuck my ass. Fuck it hard. And that's exactly what Shane does as Cheyenne rides Cole like a cowboy at a rodeo.<br /><br />The Plot Twist of Kody Taking Cole's Cock ... <br />After Shane has gotten Kody all loosened up and hungry for cock in his ass, I make the suggestion that he just go ahead and try taking Cole. Kody's eyes get as big as apples as he first refuses. With a little cajoling and reassuring from me and the other boys, Kody decides to give it a try. What a royal fuck this is folks as Cole gets every inch of his huge cock deep in Kody's ass and Kody starts to sweat even harder. But he's taking it like a good bottom should and it's very impressive to watch him take it balls deep. Our boy Kody has proven he's a bottom after all. In fact, you'll be as turned on as I was by the fact that Kody's cock is as hard as a rock with Cole buried balls deep in him. So, I suggest that Kody jerk himself off while our hero Cole power slams his hungry hole.<br /><br />Kody jerks his dick as he yells out things to Cole and really gets into the fucking he's getting by the largest cock in the Active Duty stable. This is one for the Active Duty history archives here troops. Kody jerks his cock as he moans loud with pleasure and tells his fucker to give it to him good and it isn't long before he Kody pumps out a huge load all over the couch as Cole continues slamming deep into his ass. And, we get to view the damage that two cocks have done to Kody's ass that has just been fucked hard and hung up wet for the first time ever. The up-close and personal view of Kody's used hole is something else -- it's just that jaw-dropping. Thanks to Shane and his inquisitive nature, he spreads Kody's cheeks to reveal his freshly ravaged ass. Shane seems to like this kind of stuff and I'm guessing you will too.<br /><br />Everybody Fucks Cheyenne and Cums on his Face ... <br />After Kody has taken the fucking of his life (and Cheyenne has been being banged out by Shane) Kody and Cole join Shane in plowing out Cheyenne one last time. Everybody gets their cock wet in Cheyenne, taking turns plowing it hard then tag-teaming and switching up. They go through a couple of rounds then the three troopers end it out by cumming all over Cheyenne's face and mouth. Kody even buries his load of cum right in Cheyenne's mouth. Even though the focus of this video was Kody getting fucked for the first time we have to give a standing ovation to our boy Cheyenne for taking on all three cocks and all three loads of cum. He's a real trooper and his performance in this video is just as hot as anything else.",
  "models": [
    {
      "name": "Cheyenne",
      "person_id": 35058
    },
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Kody",
      "person_id": 35098
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2004-08-01",
  "scene_id": 69938,
  "series": "Bareback Recruits 3: Toppin’ Kody",
  "tags": [
    "Gay"
  ],
  "title": "Cheyenne, Cole, Kody & Shane"
}