{
  "collections": [
    "Active Duty"
  ],
  "description": "Swedish is quite a fellow. This 18 year-old soldier standing only 5'7 and weighing a buck forty (140 lbs.) has the attitude of a giant. He's bold and decisive about what he wants and he doesn't mind telling you. We first got a glimpse of this trooper in Bareback Recruits 2: The Cole War. But, Soldiers Prefer Blondes was actually his very first video here at Active Duty. What? You think we'd throw the little sport onto Cole's cock without a little training first? We're not that cruel. But after watching the performance of Swedish along with his hot, veteran comrades in Soldiers Prefer Blondes, I'm sure you're gonna be as in awe of this soldier's ability and absolute joy in grabbin' the bull by the horns and going the extra mile. WHOAH! Big Jake was also around for this shoot and helped with the production and it's pretty hot to hear him helping me direct the four horny soldiers in the background as he yells out yeah, boy, fuck that ass, yeah boy take that cock in his hot southern accent.Swedish Catches On Quick ... Swedish comes over one Saturday when I've got a few of the other guys over, namely, Shane, Landon and Luke. The other guys are in the kitchen bullshitting with each other and having a few beers while I corner Swedish alone in the living room and turn on the camera. The conversations goes straight to his curiosity about all these other soldiers that he's seen around my place on his last two visits, one to do his solo video and one to just hang out. Since he'd visited a few times before, he'd already gotten clued in to the fact that more might be going on than drinking a few beers and I think he's been visiting just to see if he's right. But today is different. Today seems a little more organized and I've got a camera on him as I start to chat him up and I think he realizes that he's about to find out what else goes on at Camp Flamingo.Landon Starts the Bareback Banging with a Kiss ...It isn't long before we're talking about hard cocks and possibilities and his eyes keep shifting towards the noise of horny soldiers coming out of the kitchen. They're laughing and carrying on knowing full well that they are about ten minutes from fucking this blonde little cherry's brains out. When I suggest the scenario to Swedish that I have one of the other soldiers come join us, he's all for it. In comes Landon since I'd personally fantasized about seeing the two of them together and it was the perfect first union needed to get Swedish opened up to the idea of Shane and Luke joining them. After Landon and Swedish have gotten comfortable and Landon has thrown a lip lock on him as well as the two of them sharing some great head and Landon tasting the new troopers ass, Landon goes in for the kill to fuck the rookie bareback. Once he's started his entry, we call in Luke and Shane to distract the soldier with their cocks in his mouth. And what a great diversion it proves to be for our hungry little blonde who slobs the knobs of his new playmates as he takes a good plowing from the cock being driven into his tight ass by Landon. Shane is the first to stuff a mouth-load-full of cock and the little trooper latches on and goes for the ride. Everyone is into the action as all the soldiers moan and groan and Shane does quite a nice job of directing his little cocksucker and getting some great responses from him as he hums on the big uncut monster. Luke jerks Swedish as he helps Shane cheer him on.Shane and Luke Bring Up the Rear ... Literally ... Once Landon has fucked the blondes ass raw for a bit and gotten it all opened up and Shane and Luke have cheered Swedish into ecstasy and enjoying what's going on, Landon hands the reigns over to Luke and Luke gets his piece of the freshly fucked cherry ass. Luke flips Swedish over on his back and Shane holds his socked feet back for Luke to plow the boy good as Landon slings his hot mouth onto Shane's tool and gives him some head. This is one hot scene troops as our soldiers engage in some serious fun and Swedish is loving all this attention from his fellow troopers as he eggs Luke on to fuck him harder. All the loud mouth pleading from Swedish is more than Shane can handle and he's ready for his turn at the helm. Shane scoops our baby boy up from the couch and drapes him over the arm of the sofa so his hot little open ass is at bulls-eye level. Shane goes in deep with his naked cock and barebacks Swedish while Luke jerks Swedish's cock and Swedish sucks on Landon's cock. This is hot young soldiers fucking at its best folks and you will not want to miss a second of the action.Luke Fucks Shane While Shane Fucks Swedish ... For the first time ever troops, we've got a double fuck on video for you. While Shane was fucking Swedish and Swedish was sucking Landon, Luke decides to go behind Shane and get in his ass while Shane was still deep in Swedish's ass. This is kinda awkward at first, but our troopers manage to pull it off and we get to see Shane being plowed by Luke as he plows Swedish. Very Hot!! After they've enjoyed this position for a bit, Landon comes in to enjoy a bit more of Swedish's ass before the boys move things to the floor.The Fuck Squad Repositions for Some Hot Cock Riding and Cum-eating ... Down on the floor, the action kicks off with Landon and Shane laying on their backs kissing each other wildly as Swedish postions himself over Landon's cock and starts the ride of his life as he reaches over and jerks Shane's hot uncut meat and sucks on Luke's hard gun. What a view we have here as this goes on for a few minutes then Swedish decides to switch ponies and starts riding Shane's cock. It's like musical cocks for our sweet little blonde bottom boy as he gets more cock shoved in him than a glory hole at some hot rest area. And what a sight it is to behold this beautiful young, hungry and horny soldier enjoying it all safely on the living room floor along with his fellow recruits. Watching all this hot mansex has put Luke over the edge and he gears up to blow his huge, saved up load into Swedish's hot, waiting mouth. The other soldiers urge him on as he takes his first load of hot man juice into his tender virgin mouth. Extreme (the way we've come to know Swedish) is just how he reacts, taking the hot load in his mouth, swishing it around, playing with it and then spitting on Shane's chest just beneath him.The sight of this surprise gets the best of Landon and he positions himself above Shane and jerks out his hot load all over Shane's face and mouth as our enthusiastic blonde beauty holds Shane by the face and moves it around to catch the hot load as Shane takes it into his open mouth and Landon fills him up. Then, Landon takes it a step further and kisses Shane, tasting his own cum along with his comrade as the two of them lock tongues. Shane goes last as Swedish lays between his legs, licking his balls and Luke, Landon and Swedish cheer Shane on to a fantastic eruption that lands all over his stomach. And it's not over yet folks. Luke and Landon Get Double-Teamed by Shane and SwedishAfter the last scene and all the sweat and cum-eating, our troopers still aren't done. Shane and our little trooper Swedish get Luke and Landon up on the couch for their turn at taking some cock. Swedish and Shane are knee-to-knee as Shane bangs Landon bareback and Swedish bangs Luke. Landon is taking his fucking like a champ as he makes his faces a lot like those he made when Big Jake took his virginity in Crossin' The Line 3. What a hot fuck Landon is and Luke is right up there with him as Swedish bangs him good as well. Swedish is the first to cum as he blows his hot load all over Luke's back. Shane keeps fucking Landon and grabbing him by the neck and pointing his grunted face at the camera. Then, he announces his cock is getting ready to explode.Landon takes this que and postions himself below Shane to prepare for the hot load. Landon takes the huge load into his mouth and all over his face like a hungry cumsucking champ then kisses his buddy Shane the same way they'd kissed when Shane ate Landon's cum earlier. Exhausted and drained, our three soldiers kick back on the couch and put their newfound blonde boytoy Swedish across their laps and the video fades. What a hot four-way fuck we have just witnessed. I'm sure you'll rewind it and watch it over and over again. Just the site of little Swedish taking all that hot soldier cock like a true trooper is enough to send anyone over the edge and I'm sure you'll want to watch it much more than once.",
  "models": [
    {
      "name": "Landon",
      "person_id": 35111
    },
    {
      "name": "Luke",
      "person_id": 35116
    },
    {
      "name": "Shane",
      "person_id": 35144
    },
    {
      "name": "Swedish",
      "person_id": 35041
    }
  ],
  "release_date": "2004-08-01",
  "scene_id": 69936,
  "series": "Soldiers Prefer Blondes",
  "tags": [
    "Gay"
  ],
  "title": "Landon, Luke, Shane & Swedish"
}