{
  "collections": [
    "Active Duty"
  ],
  "description": "Ryan, Brennan, Shane and Swedish ... Ryan, Brennan and Shane line up for inspection as Swedish reviews his troops. Red, white and blue never looked so good as Sgt. Swedish samples what these guys have under their towels. One by one, Swedish works the dicks over and can't wait to get them into bed. My bed at the beach house is getting almost as much as the rack at home. Ryan sucks Brennan as Shane sucks Ryan and Swedish works on Shane all in a nice chain. The boys switch links so that all of the cocks stay at (and get!) attention. Ryan asks his sergeant if it's time to put some of the cocks in assholes.Swedish and Ryan are first up with Shane and Brennan at the back door. Sgt. Swedish is real clear about Shane's cock in his ass and calls for more. Fuck me, fuck me soldier and fill up my ass with your cock. Doggie doesn't do it well enough so our heroes get their soldiers legs in the air and cocks in hand. Shane lends his Sgt. a hand while he plows the south 40, slowing down to an easy pace so Swedish can cum all over his chest. Then, Shane adds his spooge to the mix. Brennan's cock looks like a big dill pickle wrapped in a bright green condom as it slides in and out of Ryan's ass. Brennan shoots his load and smears it on Ryan's face.He pumps Brennan like a jackhammer hanging onto the bedframe to give him optimum leverage. Swedish shouts show him your war face soldier! as Ryan squirts all over Brennan's back. Ryan and Brennan soap-up one another in my shower and discover that slapping a wet ass hurts a hell of a lot more than a dry ass. The sexy twosome salute in their flag towels and get ready for another roll in the hay.Ryan takes a turn at Brennan's pretty butt and fucks him balls-deep. He pumps Brennan like a jackhammer hanging onto the bedframe to give him optimum leverage. Swedish shouts show him your war face soldier! as Ryan squirts all over Brennan's back.Ryan and Brennan soap-up one another in my shower and discover that slapping a wet ass hurts a hell of a lot more than a dry ass. The sexy twosome salute in their flag towels and get ready for another roll in the hay.",
  "models": [
    {
      "name": "Swedish",
      "person_id": 35041
    },
    {
      "name": "Brennan",
      "person_id": 35045
    },
    {
      "name": "Shane",
      "person_id": 35144
    },
    {
      "name": "Ryan",
      "person_id": 35233
    }
  ],
  "release_date": "2004-08-01",
  "scene_id": 69941,
  "series": "Rear March 3",
  "tags": [
    "Gay"
  ],
  "title": "Brennan, Ryan, Shane & Swedish"
}