{
  "collections": [
    "Active Duty"
  ],
  "description": "Shane, Kent, Zarek and Craig ... Zarek has a Flamingo Tale to tell about his first night at Active Duty. The story begins with who pissed on whom and ends with Dink running for President and Zarek as First Lady. Personal secrets fly and Kent relates his tale of Dink threatening to string him up from a ceiling fan by his nipples and fuck him with a giant dildo.Kent admits to being intrigued by thoughts of a man's cock in his ass and old favorite Craig has come back to Active Duty after two years to suck cock and bottom big-time in his trademark red baseball cap.Shirts and pants come off as Shane leads the way to more serious pleasures. Craig worships Zarek's cock in his slow and easy style, not leaving an inch of skin unattended to, as the boys line up for attention. Not to be out-done, Zarek lovingly works Kent's cock as Craig switches to Shane for his slow slurp. There's face fucking at both ends of the sofa and balls get licked in unison with Dink directing the action.The boys joke about being in a Chap-stick commercial from all the cocksucking and get the order to get your cocks as hard as you can. Shane fluffs Craig and then Zarek gets the full treatment. Three of the platoon line up on Dink's bed and start pretending to watch a fuck flick, but end up with a chain of tallboy Craig getting sucked by Zarek, and Kent returning to Shane's favors.Previous fantasies fade as the boys take to the sucking and teasing like pros. There's some pretty feet flying around in the camera's face, too. We get a quick first kiss of Zarek and Shane, and then a suck-face session for the two before they both take on Craig's cock. Kent sucks Shane's cock in his first-ever cluster suck -- which Dink calls a pretty picture.Craig shows Kent how it's done, sighing and growling for his fans. You Craig fans don't want to miss this! Dink re-positions the boys to get a better view of Shane fucking Kent's virgin mouth, but he can't wait to get his tongue up that tight hole. One finger, two fingers, three fingers ... four. All opening Kent's beautiful ass and slicking it up for his first real man-fuck.Shane climbs on and before long is pounding butt and slappin' ass. Dink directs the stroking as oh fuck yeah, oh fuck yeah comes out of the other end of Kent's super body.Craig and Zarek get so hot that kissin' and tongue teasin' keep them flat on Kent's back as Shane sprays everyone with his cum. Craig doesn't miss a drop and then licks his way up to Shane's face, followed by some hot tongue action between the two. Let's survey the damage to that ass, says Dink as he gets the boys to open Kent's pink pucker. Hell, that's no damage at all. We gotta get something else up in here. Get that big dildo up there. Ass expert Shane fucks Kent with the dildo as it slowly disappears up his hole. Craig (far right with red cap) is up next and adds his beautiful ass to the Flamingo Hall of Fame. Kent fucks his first man's ass. Craig's trademark groans and growls drift back, as Shane directs the ass-attack. Fuck me man, fuck yeah, fuck yeah, is the background noise when Shane pokes the big dildo up Craig. An inspection shows the hole opening up as Shane tells him not to run from the fuck stick. Craig turns over on his back so he can see what's fucking him, but then flips back over for Zarek to plow him next.Kent paints Craig's cheek with hot cum and then thrusts the dripping cock down his throat. Shane hugs Craig's ass and then sprays it with his own cum. Zarek laps at what's left and folks, that's all I could take. Back in a few ... (keep reading down below) Five Cocks and an Unknown Soldier...We never gave our little bottom boy a name that night, so we just call him the unknown soldier, or Unks for short. (He's the fresh faced guy to your bottom right.) Unks arrives and is propped up on Dink's bed for inspection. Naked and with his ass cheeks in the air, Unks gets the order to arch your back and show your mangina ... put a finger in your ass ... now two ... boys, I'm leavin' for awhile, do not let this boy off the bed until he has six fingers up his ass. His whole hand and one finger from someone else. If you let him get up before I get back, I'm going to fire all of you. When Dink gets back, Unks figures he'd better find out what's next and what the terms are going to be, now that the plot has thickened. How much am I gonna get paid for this? Dink jokes, $25 per scene, which will amount to about $225, lay back and jack your cock. And Kent adds, ... and (you also get) a stuffed animal. Well the only animal stuffed in this scene is Unks, and he's stuffed royally. Dink directs the boys to take their clothes off and a really hot scene ensues. Shane, Luke, Kent, Zarek and Joe shed their shirts and pants exposing a variety of hot underwear, except for Zarek who's going commando. The boys fool around, getting worked up for the fuckfest. Unks is saying that he won't suck cock and Dink tells him he will suck everyone's cock before he leaves. Dink then gets all of the boys around the bed to suck Unks' cock in order to get him hard. The directing comes hard and fast as Unks is told to get his ass in the air for someone to eat it out. Shane jumps in and greedily does his thing. After the prepping, the boys line up to fuck Unks. The boy who wasn't going to suck cock or have anyone even near his ass is now getting tag-teamed by five hot soldiers! Bareback, sidesaddle, raincoat on and off, the fuck is on! Kent climbs up on the bed and sinks his cock balls-deep in Unks' virgin butt. His hole is getting wider and our boy is loosening up. Kent fucks fast and Unks moves his back to take the cock deeper. Funny how that works! Shane ends his turn with a rabbit fuck, and then turns the butt over to Joe, Luke and Kent. The platoon's newest pretty ass is now open for business!",
  "models": [
    {
      "name": "Craig",
      "person_id": 35347
    },
    {
      "name": "Kent",
      "person_id": 35105
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2004-10-01",
  "scene_id": 69943,
  "series": "Platoon Party 2",
  "tags": [
    "Gay"
  ],
  "title": "Craig, Kent, Shane & Zarek"
}