{
  "collections": [
    "Active Duty"
  ],
  "description": "Two New Recruits Meet up with King Cole ...Jimmy had his first taste of cock in his scene with Shane (see further down the page) but he returns for another go at it and little does he know that this time he'll be up against the biggest dick in the Active Duty stable. Better yet, he has no idea that he's gonna be expected to take all that meat up his tight little pucker. Gabriel, our flyboy angel from Friendly Fire 1, joins in the fun for his first exposure to guy on guy sex and what happens next is a sight to behold. The three soldiers kick back on my bed for some of the usual. They pop in a porn and get positioned on the bed with Cole egging on the action as he helps me prepare our two newbies for what is about to unfold. They shoot the shit for a few minutes and play with their cocks and strip out of their clothes for a good jack off session but the tables quickly turn as Gabriel and Jimmy catch a glance of the monster between Cole's legs.The eyes are all over it and it's hard to tell whether their jealous or just plain curious to play with it. As I always say, everyone loves a big cock. Even if a guy is totally straight he has an urge I think to at least play with a cock bigger than his even if he never goes any further. Well, first up to play with Cole's snake is Gabriel who doesn't waste any time getting the monster tamed with his hot lips and mouth wrapped all over it. Once he's got his mouth adjusted he latches on and starts to enjoy the ride. Cole later told me in private You better keep that guy around. He sucks a mean cock. I almost came like three times while he was going down on me. Well, it's plain from the video that Cole is enjoying his new playmates attention and he starts jacking on Jimmy's cock as Gabriel works his tool over good.Jimmy Says Gimme ...Jimmy has stood back about as long as his taste buds will allow him to and he has to get his hands and mouth wrapped around the monster himself. He's determined that since he's already been down this road once that he's not gonna let a complete newbie (Gabriel) outdo him. He licks on the huge manmeat, spits on it and gives it as good a shine as he'll ever give his boots. But Cole is feeling frisky and he wants to share more with the group so he tells Gabriel to take it for another spin. Cole stands up on the bed so he can feed his hungry comrades the cock of their lives.He feeds more to Gabriel then more to Jimmy then Cole decides feeding them both simultaneously might work better so the two soldiers share the cock while once sucks the rod the other licks the balls and shaft. Cole grabs the ceiling and hangs on for the ride. Jimmy and Gabriel jerk each others cocks while they wrestle the monster. Then, leaving his duty station, Gabriel goes in for the kill on Jimmy's cock. It's cocksucking 101 folks as our heroes cover every cock and ball in the room. Jimmy decides it's time to kick back and get his due servicing as he lays back and lets Gabriel work his magic on his cock while Cole comes around and feeds Jimmy more of his dick. Gabriel is a total natural at cocksucking and his fellow soldiers are taking full advantage of his venture into the unknown. Jimmy gets the blowjob of his life while he gets fed the cock of his life.Gabriel Gets His ... Gabriel switches places with Jimmy and gets his cock serviced by Jimmy while he latches back onto his favorite dick and gives it a final salute. And what a salute it is. Cole stands over our flyboy and feeds him his mule dick, fucking his face hard, long and deep as Cole spreads his ass cheeks to give us a peek of his pretty pink hole. What a show off. Gabriel is handling his newfound duty like a true soldier. He's crossing all the T's and dotting all the I's and working Cole up to the fuck he is about to put on Jimmy. Jimmy is in the dark as he thinks we're about to get the cumshots, wrap up the shoot and call it a night. But hold that thought!The Order Is Given and Jimmy Follows It ... I tell Jimmy to get on his hands and knees and get ready to take Cole's cock up his ass. He just gives me this blank look like I'm kidding but when Cole jumps in and says...He ain't joking boy...get up there. Jimmy does as told and Cole lubes up the virgin pucker and prepares it for his huge meat. This is priceless folks as we watch our determined soldier take Cole slowly at first. Cole has learned exactly how to probe a tight ass and get it opened up to receive his large tool. He slowly starts in with the head then works it slow until the hole gives just a little and his receiving end thinks he's accomplished his mission. Then, suddenly and without warning, he rams the rest of his rod up the takers ass. Jimmy is no exception to this technique and Cole works it on him like a charm. He gets the head in and Jimmy thinks he's home-free then BAM... the rest of the rod goes following. Once he's in and deep stroking Jimmy's tight ass, Cole thinks he needs more leverage to do the job right so he stand up on the bed over Jimmy's ass and plows down deep into Jimmy as he stands flat-footed on the bed. At times it's hard to tell if Jimmy is in tremendous pain for nearing ecstasy as he moans and pleads for a good fucking. It's obvious though that he intends to meet the call of duty as he arches his back and throws his chest down on the bed to give Cole as clear a shot down into his tight hole as possible. What a hot fucking scene to watch Jimmy with his muscled back and nice round ass submitting to the rod and taking the fucking of a lifetime and it's all bareback just like our boy Cole prefers folks. Cole must be liking the tightness of Jimmy's ass cause it isn't long after all that ass pounding that he pulls his long, thick cock out and blows a huge, gushy white load of manjuice all over the open wound. This is very hot to see as the cum lands perfectly on the gaping hole and Jimmy just kinda uses his ass muscles to suck it in. Mmm. Mmm. The Final Lap ... After blowing his huge load all over Jimmy's pink pucker, Cole takes Gabriel's cock in his mouth and sucks it for awhile. Then Cole and Gabriel go down on Jimmy and work him up to a nice cumshot. Then, Gabriel pumps out the biggest cumshot of the evening (maybe one of the biggest I've ever seen) and lands it all over himself and the comforter. Hot stuff! Our three soldiers have completed their mission and at least two of them (Gabriel and Jimmy) will be forever changed.",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Gabriel",
      "person_id": 35181
    },
    {
      "name": "Jimmy",
      "person_id": 35406
    }
  ],
  "release_date": "2004-11-01",
  "scene_id": 69944,
  "series": "Open Ranks: Bareback Initiation",
  "tags": [
    "Gay"
  ],
  "title": "Cole, Gabriel & Jimmy"
}