{
  "collections": [
    "Active Duty"
  ],
  "description": "Cole, Cowboy, Cameron, Swedish, Luke, Kody and Marcus Come Over to Hang Out<br />All the guys show up to my house on a hot day towards the end of summer and end up hanging out all day long. And the way the day unfolds is truly hot to watch as our seven heroes start things off in the garage working out on the Smith Machine, doing push-ups, bench presses and just shootin' the shit. It's hot to watch as they flex their muscles and try to outdo one another on the weights. All the guys get into a hot, sweaty workout and work their muscles for each other and the camera. They all get to admire Kody's new motorcycle too as he revs it up in the garage and shows it off.<br /><br />A Cool Dip in the Pool<br />After their sweaty workout all seven of our sexy soldiers head out to the pool to take a dip, do a little swimming, lounge by the pool, wrestling in the water, playing ball and just having fun. This is a sight to behold as we rarely get to see our fellows do anything but have sex (not saying that's a bad thing) so the change of pace is nice and to see them interact with one another as they bond and act naturally in a natural setting is really a treat. Once they've gotten all cooled off in the pool, they head over to the hot tub and get their body temps back up for what's about to happen next.<br /><br />A Circle Jerk Unfolds in the Gazebo<br />After getting all warmed up, the seven heroes head over to the screened-in gazebo where the stereo is blasting some Bob Marley and there's fresh porn playing on the TV. Well, we all know what happens when you put horny soldiers, beer and porn all in the same place. Eventually someone is going to get a hard-on and before you know it they're all gonna jack-off. Well, that's exactly what happens in this gazebo scene as our hotties loosen up and start losing the bathing suits. Before you know it, we've got seven of Active Duty's hottest guys butt-ass naked in the gazebo passing around the tube of lube.<br /><br />After getting all warmed up, the seven heroes head over to the screened-in gazebo where the stereo is blasting some Bob Marley and there's fresh porn playing on the TV. Well, we all know what happens when you put horny soldiers, beer and porn all in the same place. Eventually someone is going to get a hard-on and before you know it they're all gonna jack-off. Well, that's exactly what happens in this gazebo scene as our hotties loosen up and start losing the bathing suits. Before you know it, we've got seven of Active Duty's hottest guys butt-ass naked in the gazebo passing around the tube of lube.<br /><br />The Seven Soldiers Move to the House for Some Hot Sex<br />After they've blown their first load in the gazebo, we move things to the house where the guys pile up three to a couch (Swedish, Cole and Cameron on one couch and Cowboy, Marcus and Luke on one couch) and Kody takes the ottoman. The six soldiers on the two couches start off with a little sucking action and from there it's on. Marcus starts sucking on Cowboy, and Swedish starts sucking on Cole. Kody moves over and latches onto Cameron's huge tool and Cowboy gets ahold of Luke while he's getting his cock worked by Marcus. Cole gives Swedish a little lovin' while Luke switches up and gives Cowboy's cock a working over while Cole gets Kody to come feed him a little cock. Then, I have Cole and Cameron stand up side by side so all the other soldiers can share their two huge cocks and a circle of sorts starts out. All the other soldiers take their turns on the two huge cocks as they try their best to swallow them whole. And from here it's hard to keep up with all the cocksucking. The boys just move all over the room tasting each and every cock in sight. I'm just thereÉtrying to capture it all for you to enjoy.<br /><br />Bareback Brotherhood<br />With all this cocksucking there's bound to be some ass-fucking and who better to go to the plate first than our little hero Swedish? All the boys grab Swedish up and throw him on his back over the ottoman and hold his little legs high in the air by the ankles so he can get Cole's naked cock deep in his ass. It isn't long before someone decides it would be hot to see Cole getting fucked while he bangs Swedish bareback so Cowboy answers the call and gets behind Cole and begins his raw, bareback entry into Cole's tight, hot ass.<br />The other soldiers get horny watching this and start feeding Cole their cocks while he takes Cowboy's cock deep in his ass and shoves his own cock deep in Swedish. This scene goes on for awhile as we get a lot of hot shots of Cole's cock in Swedish and Cowboy's cock in Cole and both at the same time. Cole puts on a great performance too as he shows off his cocksucking skills for the camera while plowing and being plowed.<br /><br />Next up to take some cock in his ass is Luke. Kody goes in for the tight, near-virgin ass, and gives Luke a good fucking while Luke wraps his hands and mouth around the two biggest cocks in the room and sucks on Cole and Cameron as Kody gives him a fucking. When Kody is ready to blow his load from banging Luke's ass, little Swedish steps in and takes Kody's load in his mouth and spits it out all over Luke's stomach.<br /><br />Then, Cowboy takes up where Kody left off and bangs Luke with his big cock for awhile until Luke says he's ready to return the favor and Cowboy assumes the position on his hands and knees on the ottoman and all the other soldiers surround him. Luke slides his cock in Cowboy and it's a yee-haw ride from here folks. Luke doesn't let up on Cowboy and keeps the reins tight as he plows him long and hard.<br /><br />All the other soldiers stand around jacking off over Cowboy's back until each of them blow their long awaited wads all over his tattooed back. All the while as he's getting fucked and has guys shooting their loads all over his back, Cowboy (in his classic yeah manÓ style) smokes his Marlboro cigarette as it hangs from his mouth. This is priceless and surely a classic Active Duty moment.",
  "models": [
    {
      "name": "Cameron",
      "person_id": 35055
    },
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Kody",
      "person_id": 35098
    },
    {
      "name": "Luke",
      "person_id": 35116
    },
    {
      "name": "Swedish",
      "person_id": 35041
    }
  ],
  "release_date": "2004-11-01",
  "scene_id": 69946,
  "series": "Band of Lovers",
  "tags": [
    "Gay"
  ],
  "title": "Cameron, Cole, Cowboy, Kody, Luke, Marcus & Swedish"
}