{
  "collections": [
    "Active Duty"
  ],
  "description": "Shane And Jimmy ... No Hitting! ... This scene actually starts the video off but we thought it was best to save its description for last. Jimmy shows up at my house having agreed to give messing around with another guy an honest try. Some very interesting things come to light as he and Shane lay side by side on the bed and talk about their past. Jimmy tells us some shocking stuff about things that were done to him by other men in the past and Shane can relate. The two start to hit it off and Jimmy seems to trust Shane enough to go the next step. But it's still unclear to Shane after hearing Jimmy rant and rave about his past experiences if it's safe to suck Jimmy's cock without getting his skull cracked. So, Shane asks our roughneck soldier if he's gonna bust his head if he tries to suck his cock to which Jimmy replies I can't make any promises. We'll just have to wait and see. Well, Shane is cock hungry enough at this point to give it a shot and if he gets hit, he gets hit. He figures he's jerked on Jimmy's cock enough without getting smacked that it might be safe to go the next step. Shane goes down on Jimmy and gets a good response. Jimmy is liking the hot mouth wrapped around his dick after watching the hot porn on the TV in the background. Will Jimmy Return The Favor? ... Shane looks at Jimmy as he strokes his own cock and looks down at it. Jimmy takes the cue and takes a deep breath and goes down on Shane's cock. He's starting to have fun but Shane is still hungry for cock so he takes Jimmy's back into his mouth. Then, Jimmy is ready to go at the uncut cock again so Shane stands up and feeds his hungry mouth. Jimmy Has To Think Before He Leaps ... After the two soldiers share some awesome sucking action Shane asks Jimmy if he's ready to fuck him... Long, long pause as Jimmy scratches his head and smiles. Then, finally... I guess. Shane decides to make it easy on the new guy and positions himself over Jimmy and starts to ride his cock bareback. Yeehaw. Jimmy is liking this as Shane sits down on his hard cock and rides it like a pony. Jimmy gives Shane a reach around and strokes Shane while he rides off into ecstasy. It isn't long before Jimmy wants more control so he gets Shane up on his hands and knees to finish the job. Soon, Jimmy pulls his naked cock out of Shane's ass and blows his load all over his back. This is how the West was won folks. Shane then positions himself above Jimmy and jerks out his own impressive load all over Jimmy's face.",
  "models": [
    {
      "name": "Jimmy",
      "person_id": 35406
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2004-11-01",
  "scene_id": 69945,
  "series": "Open Ranks: Bareback Initiation",
  "tags": [
    "Gay"
  ],
  "title": "Jimmy & Shane"
}