{
  "collections": [
    "Active Duty"
  ],
  "description": "Cameron Calls Me From A Party With An Idea Of His Own ...One quiet Friday night around my place Cameron calls me up at 2 in the morning from a GI house party that he was at and said 'Dink, I've got someone here I think you should meet.' I could tell he'd been drinking and I was as sober as a judge. I was about to call it a night and crawl in bed. But the urgency in Cameron's voice and my own curiosity wouldn't quite let that happen. At first I said 'Man, can I meet him tomorrow?' and once I heard the disappointment in Cameron's voice I could tell that if I didn't get in my car and go and get him and his new friend I might regret it forever. So, I told him to give me directions to this party and that I'd be right on my way. Well, Cameron was either lost or had one too many drinks to tell me how to get there so he put his friend on the phone to give me directions. I made a thirty minute venture out into BFE to find this party nestled way back in the woods at another soldier's double wide trailer. The music was loud and the place was packed but Cameron and his buddy were standing by the road ready to be whisked off to the adventure that was about to unfold.Cameron's Plan Takes An Interesting Turn ... Once back at my place, Cameron was all about showing his new friend the back yard and the pool and waterfalls and I suggested that the two of them get in the pool together naked. The friend had been telling me the whole ride back to my place that he had a pretty big cock and I kept teasing him and saying I was sure it couldn't match what Cameron was packing. So the naked swim was just his chance to prove me wrong or to at least satisfy both of their curiosity about what the other was holding. Wasn't long and we were back in the house, porn playing on the TV and Cameron and his friend laying on my bed naked together. Out of the blue the friend comes up on his hands and knees and throws his ass in the camera's face. As he'd turned away I motion for Cameron to get behind him. 'Get up there and rub your cock on his ass' I told Cameron. Cameron said 'I'm not sure if he'll go for that' and all the while the friend isn't making any moves to return to his back so I say 'Sure he will. He hasn't changed positions.'So Cameron jumps up and gets behind his buddy and grabs the riding crop and starts whipping his buddy and humping on his back side but not going inside. Just about when Cameron is going to go in for the insertion after I've gotten his attention without the friends knowledge and coaxed him to do so, the friend jumps up, slams Cameron face down on the bed and tells him that he's gonna be the one doing the fucking if there's going to be any. And, strangely enough, our boy Cameron didn't jump up and run ... but rather kinda just submitted. And the wild and raw bareback fucking that Cameron takes is out of this world. His party buddy gives him no mercy as he takes Cameron's virgin hole like a man and fucks our boy almost retarded. The way it all unfolds is so hot to watch as we witness the usually very 'in control' Cameron become submissive and let his buddy have his way with his ass. I thought I was dreaming as I stood there with the camera away from my eye just watching the action. I couldn't believe what I was seeing.Cameron Is In Rare Form ... After the friend has fucked him hard and raw for a few minutes he lets Cameron catch his breath but I keep the action going by telling Cameron without the slightest bit of hesitation to suck his buddy's cock. Cameron doesn't hesitate and takes the fat cock that has just been in his virgin ass and sucks it likes he's dreamed of sucking a cock all his life.Never have I seen someone go from 0-60 in one night like Cameron did this night. And he doesn't just lick and suck on the head sheepishly ... he takes it balls deep down his throat and works it over until he's red in the face. This is one hot moment as you see our previously totally in control soldier go from man to bitchboy in no time flat. And he fits the position well. Watching Cameron be so obeying and submissive will be enough to send you straight over the edge just wishing you were there with your cock in his mouth. The two boys get in a sixty-nine and share blowjobs then Cameron reassumes the position and takes some more fucking before he returns the favor to his buddy. The scene ends out with Cameron fucking his buddy and we don't get cumshots. I'm not sure if they were too drunk to cum or my camera battery died that night without a back-up but that's OK. You'll get more than enough cumshots for both of them over and over as you witness the evolution of our boy Cameron as he lets his guard down and submits to the rod. I could not resist putting this scene out on video even with the lack of final cumshots because I know how many of you have begged to see Cameron go the next step and get fucked and I thought it was more than fitting to add it to a tape that is the beginning of the process for another hottie like Brock. The contrast is striking, but it also gives us hope that every man we want to see go further ... eventually will.",
  "models": [
    {
      "name": "Cameron",
      "person_id": 35055
    }
  ],
  "release_date": "2005-01-01",
  "scene_id": 69951,
  "series": "MIA: Men in Action",
  "tags": [
    "Gay"
  ],
  "title": "Cameron & Erin"
}