{
  "collections": [
    "Active Duty"
  ],
  "description": "Third Time is a Charm ...The following morning Kody stopped by on his way to pick up his girlfriend for lunch. Kody had met Brock briefly the first night Brock was in town but Kody didn't get to go out with us that night because he had plans with his girl. So, I told Kody... 'Since you couldn't hang out with us the other night maybe you can hang out with us some today'. I called Kody in my bedroom and told him what my plans were and that if he could help me pull it off I'd be forever grateful. So, the plan was in order and the girlfriend was ditched for what unfolded next. I made breakfast and let Brock and Kody talk and get to know each other better and once breakfast was over I knew it was now or never to try to get Brock to go that next step.I told Kody to tell Brock just how reluctant he was when I first met him about doing something with another guy and how the experience had been for him after deciding to take things further. Kody poured it all out to Brock like a poem and I was quite surprised to hear just how he articulated it all. Once he'd given Brock the low down on how he came to take that next step and how it wasn't anything nearly as bad as he'd ever imagined, I called Brock in the other room and sat down with him and said, 'Brock, it'll be a shame if you leave here without at least trying something new that you've never done. I can hear the Active Duty fans now saying, 'Dink how did you let him slip away?' and I'll be left with nothing to say.' Brock said, 'What do you want me to do?' I said, 'I'd like for you to at least try something other than just jacking off. I'd like to see Kody worship your body because I know he dreams of being in as great shape as you are someday. Then, I'd like to see him slowly move in and take hold of your cock and caress it and make love to it.' Brock laughed, 'Wow! That's asking a lot.' 'Please, for me?' I said. And with a big smile Brock agreed to give it a try.It's hot as fuck to watch our muscle pup worship the body of our manly Brock who has reached a bit higher level than Kody in his body sculpting goals. I imagined a younger jock in a gym looking at the big guy next to him and wishing he could be more like that ... and maybe even secretly wishing he could worship the bigger guys achievement by feeling, rubbing and just admiring his body. So, I conveyed the idea to Kody and Brock and Kody seemed all too familiar with the scenario and once the camera started recording it was interested to see how Kody took the idea and just naturally ran with it. And Brock didn't mind the admiration one bit as he allowed Kody complete access to his body while Kody rubbed and licked and nestled next the our big guy and gave his body a total worship.While all this rubbing and licking is going on, Brock gets a major hard on in his boxers and Kody simply moves down to the excitement and takes matters in his own hands. Out of the boxers and into his little muscle pups mouth is right where Brock's wood goes and the rest is just a steady stream of jack off material for whoever is watching. Now, we would have all loved to see things take a bigger turn and have Brock bend Kody over and plow his muscle butt like there was no tomorrow. But in sensitive settings I've found sometimes it's best to take things slower. Eventually (and hopefully not too long from now) Brock will return for another visit and maybe he'll be ready to take another step. The next scene in the video goes to prove my belief that time and patience and the right moment can bring about more than we'd ever hoped for.",
  "models": [
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Kody",
      "person_id": 35098
    }
  ],
  "release_date": "2005-01-01",
  "scene_id": 69950,
  "tags": [
    "Gay"
  ],
  "title": "Brock & Kody"
}