{
  "collections": [
    "Active Duty"
  ],
  "description": "Cole, Joe and Luke Hanging out and Getting It Up ... Cole, Joe and Luke are all at the house one Saturday hanging out and looking at porn on the computer while they bullshit back and forth. Before long the boys are all horned up and ready to take things to the bed and pop in a DVD. Once the porn is playing Cole's pants are the first to come off as Joe and Luke look on in amazement at the huge tool between their fellow soldiers legs. Joe is the first to take the bait and latch onto the monster, stroking it and playing with it while he grins and his mouth waters. Luke latches on next and shows Joe how it's done as he takes Cole's Cock in his mouth and sucks it good. Joe catches on quick and soon has his mouth wrapped around the rod and works his magic a little before turning it back over to Luke.Joe Rides The Horsey First And Bareback And Shares With Luke ... Joe jumps on the horse dick first and tries to ride it but can only get about 1/3 of Cole's cock up his tight hole. Luke jumps in and takes the cock and tries the same thing, but it's just not possible to get such a big piece of manmeat up a tight ass that's not been fucked in awhile so Luke bends over and assumes the doggy-style position and let's Cole do the entry. Luke is sweating as Cole's cock penetrates his tight ass and makes its way deep inside him. Once Cole has it in good and has Luke's ass worked up and ready Luke tries riding it once more and ends up taking almost all of it up his ass this time.He rides the beast for a little while in this position then flips over on his back and throws his legs in the air for papa Cole to do the job right. Joe feeds Luke some cock to keep his moans and yells controlled as Cole plows into Luke taking it all the way to the balls. After his good fucking Luke turns the huge cock back over to Joe who is more than ready by this point to take it on for size. Joe assumes the position and throws his beautiful plump ass high in the air and eggs Cole on to fuck him hard. Cole obeys his wishes and shoves his cock deep in Joe's ass as Joe gasps for breath. Joe takes it like a man and all the while yells and cusses at Cole 'Fuck me you big dicked motherfucker ... come on ... fuck me hard.' Joe is determined that this cock won't get the best of him and he seems to have found his dream of having the biggest cock around as far up his ass as he can get it.As Cole pounds Joe's well lubed ass, Luke stand over Joe's back and feeds Cole his cock. After Cole gets his cock all nice and wet with his hot mouth, Luke goes behind Cole and slides his cock in Cole's ass as Cole continues to tear deep into Joe's ass. It's a two way fuck troops as Luke achieves his goal and lands balls deep in Cole's ass while Cole is balls deep in Joe's ass. The three soldiers ride this position out as the two cocks fuck the two holes until they cum. Cole is the first to shoot his hot load all in between Joe's cheeks and Luke shoots his all over the tattoo on Cole's back. Talk about some hot fucking action. The three of these soldiers really go at it in this scene and watching Luke and Joe take on the massive dick is a sight to see but the view we get of Cole taking Luke up his ass while banging Joe's ass is one we won't soon forget. It's been a bareback invasion folks and you've been right there to witness it all. But I'll bet money that you never make it to the end of this video without having to take a few breaks (after shooting your load) and come back to it a few times before your cock will let you make it to the end.",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Luke",
      "person_id": 35116
    }
  ],
  "release_date": "2005-02-01",
  "scene_id": 69955,
  "series": "Open Ranks 2",
  "tags": [
    "Gay"
  ],
  "title": "Cole, Joe & Luke"
}