{
  "collections": [
    "Active Duty"
  ],
  "description": "Cole And Bryce Break The Ice ...I get Cole and Bryce in the bedroom together on the bed for a little porn and some chit-chat. It's been a lot of work to get Bryce to this point and he's still a bit nervous, but Cole helps make him feel comfortable as the two of them talk a little and get to know each other. Bryce has already agreed that he'd give things with another guy a try, but he has no fucking idea that Cole is packing one of the biggest pieces of meat he's probably ever seen let alone thought he was going to have to take up his tight virgin ass. Once the clothes come off, it's apparent that Bryce is very enticed and interested in what Cole is playing with. The two continue to chat as Bryce glues his eyes on Cole's cock. Cole notices the glances and asks Bryce if he's up for giving it some attention with his hot virgin lips. Bryce doesn't hesitate for one second in fact he's all smiles as he grabs onto the huge rod and takes it in his obviously hungry mouth. This is the type of cock that straight boys' secret fantasies are made of. Just to see, touch, play with and feel a huge cock between their hands is every man's dream no matter how straight he is. There's something about a huge cock that fascinates everyone. Bryce Takes Matters Into His Own Mouth ...Bryce's fascination is evident in the way that he makes love to Cole's cock, sucking, slurping and jacking it all the while admiring what such a fine piece of manhood feels and tastes like. He tries his best to deep-throat the huge cock as he licks it trying to get it lubed enough to go down his throat. Cole is loving breaking in this hot new twink as he fucks the newbies face and watches him give it his best. Cole moves down on Bryce and gives him some oral lovin' for a few minutes but then it's back to fucking the twink's face as he stands up on the bed grabbing the his head and letting Bryce have all the fun he can with his cock. This is a very hot scene to watch as Cole films from above catching all the hot looks his cocksucker Bryce is giving him as he works magic on the huge tool. Bryce seems very eager to please Cole's cock by the looks in his eyes and wants very much to satisfy his suckee and those watching. These are some of the hottest looks I think we've ever captured of a cocksucker talking to his cock holder with his eyes as his mouth does its duty. Just to watch this cute young thing try to master such a huge piece of meat for his first time is enough to send you over the edge.Cole Puts The Bridle On Bryce And Rides Him Bareback ...After he's worked Cole's cock up to a massive hard-on, it's time for the next challenge and that's to take it all up his tight, never-been-touched ass and Bryce meets the call of duty. Bryce lays on his stomach across the bed and spreads his cheeks to reveal a sweet, pink pucker surrounded by lush, downy hair. What a hot fucking virgin hole ready for invasion and Cole is more than ready to do the deed. Cole starts his ascension down into the pink glory slowly as Bryce raises his hips and ass to push it further up his own ass. Bryce has suck a plump beautiful little ass that it looks like it was especially made to be in the air and once Cole is balls deep between those tight cheeks, it's obvious that we've got ourselves one hell of a trooper in Bryce. He takes a fucking like few I've seen as he keeps up with Cole's pounding and slamming until he slides off the side of the bed, but Bryce doesn't let his new position get in the way and Cole keeps up with the changes as he continues to slam the virgin ass deep and hard as he uses his foot on the floor for leverage while he stands above and plows down into the unchartered territory.Once it's established that our newbie can handle the massive cock and take it all up his ass we switch up the position and put Bryce on his back with his legs thrown over his head as Cole stands above him and delivers a hardcore slamming down deep into the twink's opened hole. Cole takes full advantage of this position and starts slow stroking as he goes in the tight hole as far and deep as he can and pulls almost all the way out and then slowly all the way back in again. All the while Bryce is grunting and doing his best to keep his composure as he makes faces at the camera of both sheer ecstasy and pain. But he never complains ... no sir! Once he's been rode hard and hung up wet in this position, Cole stands Bryce up beside the bed with one foot up on the ottoman as he comes in from behind and deep strokes his well-fucked ass. Bryce grabs the bed rail and hangs on for dear life and he takes the hardest fucking I've ever seen a newbie take. It isn't long before Bryce starts creeping slowly across the bed trying to withstand the deep plunges of Cole's huge cock but Cole isn't having any of that as he chases the little hot ass all the way across the bed finally latching his thighs around the bubble ass and clutching it down so Bryce can't get away. From here he continues to slam deep in our newbie and break him in like a world class stud. The two soldiers move to the chair in the bedroom where Bryce hops on Cole's cock and starts riding it like a winning bareback jockey. He's taking all the cock up his ass as he bounces up and down.Bryce Bends Over And Takes Cole's Load ...After taking Cole's cock in several positions along with the fucking of his life, Bryce bends over the chair in the bedroom and finishes off his hardcore adventure into male/male sex with an awesome twist. Once he's bend over Cole starts pounding him good once again and then pulls out and Bryce reaches back and spreads his ass to reveal a dark red gaping hole that was a pretty pink pucker just an hour earlier. Cole loves the site of his own damage and shoves it back in once more for good measure and to shoot his load. He pulls out leaving in just the head and shoots his wad in Bryce's ass. Once he pulls out, Bryce uses his newfound ass muscles (as relaxed as they are by this time) to push the load out. This will no doubt go down as one of our hottest fuck scenes ever between two of our hottest finds.?",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Bryce",
      "person_id": 35050
    }
  ],
  "release_date": "2005-02-01",
  "scene_id": 69954,
  "series": "Bryce & Cole",
  "tags": [
    "Gay"
  ],
  "title": "Bryce & Cole, Scene #01"
}