{
  "collections": [
    "Active Duty"
  ],
  "description": "A Note From Dink ...<br />Hey Troops, Hard Corps 2 is the long-awaited return of our boy Granger -- who people just fell in love with when he made his Active Duty debut with Jordan Sage in Tour Of Duty 2. They'd been friends in the Army while stationed in Puerto Rico and luckily Jordan put me in contact with Granger and the rest is, as they say, history! Granger went on to keep us hot and bothered in other scorching videos like Thrill SGT and Platoon Party. We just never seemed to be able to get enough of him and then ... he was gone. Granger and I have stayed in contact over the years and his life as a single parent (he's now married) had kept him busy. We were never quite able to make things work out for him to visit. But now he's back with us in Hard Corps 2 and he's as excited about Cole's cock as he was about Jordan's way back when. His passion for grabbing onto a big cock and swinging from it reminds us of ourselves -- and maybe that's why we love him so much. The night before we shot this video me, Granger, Cole, C.J. and a couple of other guys went to the strip clubs and got pretty drunk. That night, Granger eased up next to me at the club and said 'You know what you're doing. I gotta give it to ya. This is gonna be a good film' as he gazed at Cole and smiled. He'd seen pics of Cole already at my house and had already set his eyes on that huge cock.<br /><br />Granger, Cole And C.J. ...<br />The next day after a long night out partying together, Granger and Cole and I agree it's time to get it on. But everyone needs a shower first, so we grab up C.J. (who'd spent the night) and headed for the bathroom. Granger and Cole have never worked together but since they'd both worked with me they knew the deal and were able to help coax ol' C.J. into having some fun with them. I bring the laptop in the bathroom and throw a straight porn in to help ease the nervousness and get their attention. The boys wash each other down really good with C.J. getting to feel on Cole's pretty ass and Cole on Granger's and everybody on everybody. Once they've rinsed off the boys pull up a seat along side one another on the shower bench and commence to gettin' horny.<br /><br />It isn't long before the hands and eyes start wandering over to the cocks next to them and wouldn't you know it -- Granger's eyes and hands are the first to start movin'. He gives Cole's cock a long, pleased look and latches onto it while reaching over and grabbin C.J.'s cock with his other hand. In a minute or two all the boys are helping themselves to feeling each other up. When you've got three hard dicks, a willing mouth is bound to be in the room and it just so happens we've got one for every dick in this one. The boys move from feeling to tasting about as quick as they showered and Granger gets a taste of C.J. while C.J. tries his best to master Cole's cock.<br /><br />Granger gently pushes C.J. aside so he can test his skills out on the likes of Cole's big meat. Granger and Cole are hitting it off nicely and they start to flirt with each other as the water streams down their bodies, making them look better than ever. Granger starts whispering in Cole's ear and before you know it he's up behind him and Cole is smiling as he starts feeding C.J. his cock and poking his hot little ass back onto Granger's cock but not letting him go inside. Granger can't take much of this but he tries as he reaches around Cole and grabs C.J's head and helps him master the rythmn of cocksucking before we move the party to the bedroom.<br /><br />Once in the bedroom, Granger and C.J. get involved in a little tongue fighting as they share Cole's cock with one another. Cole gets C.J. to move up and share his cock with him while Granger starts to make love to Cole's. Granger is right where he wants to be now troops. On Cole's cock, alone and unleashed. Cole seems to be liking his new buddy C.J. as he makes love to C.J.'s cock as good as Granger is making love to his. (I personally got off on this scene.) Cole really gets into C.J. Cole stands up and begins to feed his cock to C.J. while Granger sneaks around back and starts playing with C.J.'s ass. It isn't long before Granger is banging the hell out of C.J. as Cole feeds the boy his cock. C.J. has messed around and found himself in the hucklebuck folks but he aint complaining. He's taking cock at both ends and not missing a beat.<br /><br />The two veterans flip C.J. over on his back and Granger turns the reins over to Cole while Granger gets down on C.J.'s cock while C.J.'s legs are in the air waiting on King Cole to make his entry. Granger crams his cock in C.J.'s mouth to help take his mind off the initial shock he's about to receive and the entry goes off without a hitch. C.J. is taking a fucking at both ends and loving it, troops. This boy was born to have sex. Granger gets his cock all wet in C.J's mouth and moves around behind Cole to try to get inside his ass and this time he's succesful. Cole grunts a minute as Granger shoves in but once it's in it's on troops. Cole is fucking C.J. while he jerks on C.J.'s hard cock and Granger is fucking Cole and it's a hot two-way fuck folks.<br /><br />Cole is enjoying the bottom today so much so that he trades places with C.J. and throws his legs in the air and C.J. saddles up for the ride and starts fucking Cole good and hard. Cole is all riled up today and blows his load all over himself while C.J. slams in and out of his ass and Granger feeds Cole cock at the other end. C.J. doesn't stop pounding though cause he wants to get his nut too so Cole gets back into it and gets hard and cums again while C.J. is still fucking him. After Cole cums again I give Cole the camera and tell him to direct the ending. Cole gets Granger fucking C.J. and banging him hard. Granger blows his load on C.J.s ass then helps C.J. blow his load and Granger takes it in his hand.",
  "models": [
    {
      "name": "CJ",
      "person_id": 35061
    },
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Granger",
      "person_id": 35252
    }
  ],
  "release_date": "2005-03-01",
  "scene_id": 69959,
  "series": "Hard Corps 2",
  "tags": [
    "Gay"
  ],
  "title": "CJ, Cole & Granger"
}