{
  "collections": [
    "Active Duty"
  ],
  "description": "Our Journalist Throws His Pad Down And Gets In The Action ...Between beers and trying to take notes on the action and being constantly harassed by yours truly our writer finally gives up the pen and heads for the bed. Jack and Kane are more than happy to welcome him into their playpen. I think Jack was just happy to have another cock to play with while Kane may have been relieved to have some of the focus taken off of him. But Kane is still very much in the mix as our writer aims his sights on Kane and Jack happily finds his place between the journalists legs and starts lapping away on the writers big uncut rod.Jack has his hands everywhere including Kane's ass while Kane stands over writer and feeds him his cock Jack is reaching beneath and playing with Kane's ass and cock. Kane then turns himself around and puts his ass in the writers face while he helps Jack with the uncut prize. The two horny young soldiers get down to business together on the writers huge tool and work it over good while the writer munches away on Kane's sweet ass. Jack is quite the pig though and is comfortable working the cock over by himself so Kane returns to feed the writer his cock and the writer gladly accepts.Jack Needs A Cock Somewhere Besides His Mouth ...All this action has gotten Jack hotter than a $2 pistol and he's ready for someone to stuff something up his hungry hole. So, he suits the writer's cock up for entry and throw his hot ass in the air to be plowed as he latches onto Kane's cock and gives it his best oral attention. There's no turning back for our man of words now. He's about to become a man of action as he scoots up to Jack's hole and starts his plunge forward. A nice, fat uncut cock is just what the doctor ordered to scratch Jack's itch and he rears back on the uncut monster and helps our writer get balls deep in the action. Jack puts his sexy red hat on Kane's head and Kane just lays back and drinks his beer while Jack works his cock over and takes one for the home team.Our Writer Delivers More Than A Good Story ... This has got to be the sexiest image of Kane that I've ever seen as he looks so fucking hot in that hat just kicking back enjoying the fuck out of his cocksuckers attention and eventually shoots his hot load all over Jack's willing face. Talk about a hot scene. Kane lights a cigarette and takes a few sips of his beer before he and jack get into some very hot kissing. There's some serious lip-locking going on between these two soldiers and it's so hot to watch to buddies go so far.Our writer friend may be good with words but I'd be willing to bet he's just as good at fucking ass and this scene proves it. He watches the boys kiss and he continues to give it to Jack good. Jack is so into getting plowed by the fat uncut cock that he just lays his head down on Kane's chest and moans and yells 'Fuck me ... Yeah ... Fuck me good.' Kane rubs his buddies head and talks the writer right through to climax as he blows a huge load all over Jack's well fucked ass. Jack is happier than a pig in shit folks and it shows through the glow on his face and he lays back between his two men and just smiles from ear to ear. The three of them get into a threeway kiss that lasts for a bit and then they kiss each other one-by-one. Our writer has gotten more than just a story and our two soldier have had some fun with a slightly older fellow that's as hot as any thirty-something I've ever saw.Many of you have begged me to put the boys with just a slightly older guy and our writer is one sexy man to be in his thirties. It's a nice touch that really makes this video stand out.",
  "models": [
    {
      "name": "Jack I",
      "person_id": 35403
    },
    {
      "name": "Kane",
      "person_id": 35101
    }
  ],
  "release_date": "2005-11-01",
  "scene_id": 69957,
  "series": "Call of Duty",
  "tags": [
    "Gay"
  ],
  "title": "Jack, Journalist & Kane"
}