{
  "collections": [
    "Active Duty"
  ],
  "description": "Any Given Saturday ...It's a typical weekend around my place and the boys drop by in and out as always but two new additions work their way into the crowd this particular Saturday. J.Z. is a new guy that I met a couple of months ago that's made himself a regular around the house. He seems to have found himself a comfortable spot on my sofa like a cheshire cat, smoking his black and milds and chatting between naps with other soldiers that roll through. J.Z's the playa type with a bad boy attitude and a hat flipped sideways on his head. But deep down he's as sweet as that cat he resembles as he lounges around and makes himself comfortable with his newfound surroundings. By now he's met Swedish a few times and they've hit it off between his naps and Kody was enough to make him crawl up off of the couch and stretch and do a little pur. Sly comes in out of nowhere and he's as horny as he was the day he left for Iraq and the day he started to do his first video with Britt. Somehow the chemistry comes alive and we've got ourselves a wild Saturday ready-made.Pros teaching Amateurs or Vice-Versa? ...Knowing full well that neither of the other two have ever done a video, Kody and Swedish take it upon themselves to be the 'teachers' but once the action heats up, I'm not sure who was learning more. Once in the bedroom our four troopers pair off. Swedish moves over and shares the chair with J.Z. and Kody and Sly pair up on the bed. Swedish is the first to latch onto his newbie and take his cock for a spin as Kody quickly follows suit. It isn't long before the four come together and J.Z. shares his fat cock with our hungry newcomer Sly while Kody continues to work his fat cock and Swedish takes over on Kody. Sly is hungry for any cock and J.Z.'s fat meat is just what the doc ordered. Our two veterans pair off for a bit while Sly and J.Z. get better aquainted and Swedish and Kody get the chance they've long been waiting for with each other since they've never actually worked together besides appearing together in 'Band Of Lovers.' Kody and Swedish are a cute pair and watching Swedish stand over our big hero and feed him his cock is really hot to watch. Then Swedish moves down to service his big buddy as J.Z. moves over to take on Kody's mouth for fuck. Sly is horny as hell and Swedish notices his hard cock and moves over to service it for a bit as Kody gets fed by J.Z. It all takes another twist when J.Z. our street smart sweetie drops down and takes Kody into his mouth for a very passionate first time blowjob. All the while Sly is servicing Swedish but Swedish is watching J.Z. work on Kody's cock and Swedish finally decides that he wants Kody in his ass.Soldier See...Soldier Do ...Our two newcomers might be fresh to class, but they're learning quick and it isn't long before Kody gets his cock deep in Swedish's ass and our boy J.Z. is flipping over our hot, bothered bottom Sly for some foxhole exploration himself.J.Z.'s handling the mission quite well as he gets our hungry Sly to squeel and beg for more of his fat cock. Sly is the firecracker in today's group and he makes it quite clear that he's here to take a cock from everybody in sight.But since he sees no sense in hurrying he moves off to the bathroom shower with J.Z. for some one-on-one. This is a hot scene, as I imagined two horny soldiers come back early from the field with no one in the barracks but them and find themselves horny in the shower.And it plays off pretty much that way with Sly on the shower floor servicing his fellow service members member. What a passionate cocksucking we get to witness here troops as Sly latches on and licks and spits and sucks as if he's shining one of his boots for formation. Talk about polishing the knob.Well, it isn't long before Sly and the knob are both ready for it to be somewhere tighter and hotter than his mouth and Sly turns around in the shower floor and assumes the position. But it's only the first of the many positions that J.Z. will slam his comrades hot ass as they switch up first with Sly riding the fat cock then with his ass arched and cocked up as he rests his knees on the shower ledge.This boy is taking a major fucking and the sounds coming from the bathroom get our two pros attention as Kody and Swedish follow the sounds to join in on the shower fun.Four Soldiers, Hard Cocks And A Shower ...Kody wants some of Sly's hot ass and takes over where J.Z. left off and Sly is plenty happy to take on the platoon. Swedish convinces J.Z. to assume the position as he squats over him and starts to explore the virgin ass. Watching J.Z. bend over and give his street tough manhood away to little Swedish is a sight in itself and hot as fuck to watch from behind as the water cascades down between Swedish's freshly fucked cheeks, into J.Z.'s ass along with his cock and another soldier submits. The moaning and bantering is bouncing off the porcelain walls as the asses are being banged good and the soldiers are singing their war songs. All that's missing from this scene is a humvee and a drill SGT screaming 'fuck that ass boy' in the background. And, you probably have me at least doing the latter.Back In The Bedroom And On With Business ...I corral the water-logged soldiers into the bedroom for the rest of their fuckfest as the action keeps moving and Swedish keeps tearing into the ass of J.Z. as he stands above him plowing down into our thug soldier as he grabs the canopy rails above him and swings from J.Z.'s ass like a monkey.Kody has Sly bent over in bitch position and is banging his hungry hole like a jack-hammer and Sly aint complaining one bit. In fact, he's probably ready by this point to sit on a fire hydrant or anything else hard and steady. Talk about a cock hungry hole attached to a hot freak. Lawd give me a fan.J.Z. is ready for some more hot manhole and Kody is ready to give it to him so the four troopers switch things up again and Kody gets plowed by J.Z. as Swedish tries to hush the hungry Sly by stuffing his ass with his cock and fucking him as good and hard as he can.Kody takes a mean fucking by J.Z.'s fat cock and Swedish and J.Z. turn their fuck toys over on their backs and drive it home. Swedish is the first to blow and J.Z. follows quickly behind then Kody blasts off and lands a huge load on himself and Sly does the same.All you can smell in the room at this point is hot sex, ass, cock, feet, sweat and pure passion. If you could bottle this stuff you'd put Yankee Candle out of business.Wash My Back..I'll Wash Yours ... We end out with our four soldiers back in the shower washing up. And, just like soldiers watch each others asses in times of need they'll wash each others asses in times like these. The boys soap up and give each other a good thorough cleaning as they return to the simple, innocent horseplay that we like to imagine all our soldiers having in the showers. Boys will be boys and these boys have been each others boys. I hope you enjoy this scene as much as I did. This is as honest and uncomplicated as it gets as men bond in the way only men can.",
  "models": [
    {
      "name": "Swedish",
      "person_id": 35041
    },
    {
      "name": "Kody",
      "person_id": 35098
    },
    {
      "name": "Sly",
      "person_id": 35147
    },
    {
      "name": "JZ",
      "person_id": 35405
    }
  ],
  "release_date": "2005-02-01",
  "scene_id": 69952,
  "tags": [
    "Gay"
  ],
  "title": "JZ, Kody, Sly & Swedish"
}