{
  "collections": [
    "Active Duty"
  ],
  "description": "Hoss and Kody Get Acquainted ...<br />Hoss finally agrees (after much begging and pleading) to take the next step and try something with another guy. And I thought what better guy to team him up with than Kody. Kody has really come a long way since the days of his 'athletic modeling' and he has a great touch with new guys and I thought he and Hoss complemented each very nicely. So, I called on Kody to help me break Hoss out of his shell. What a great move since the two men hit it off so well and Hoss takes to Kody like a bee to honey. The two start out the usual way of watching porn and shooting the shit while working up some wood. Kody doesn't waste any time getting 'close' to Hoss and immediately starts rubbing Hoss' big leg. Hoss cuts his eye down at Kody's hand and as Kody rubs his leg Hoss let's his cock rise to attention on it's own without stroking it. Once his cock is hard, Kody latches on and starts stroking Hoss. It isn't long before Hoss returns the favor and starts stroking Kody back. The two stroke each other's cock for a few minutes. <br /><br />Kody Goes in for the Kill ...<br />After a little bit of mutual stroking, Kody goes in for the kill on Hoss' cock and takes the nice, fat, veiny beast between his lips and starts working it over. Hoss is really enjoying this new experience as he grabs Kody's head and starts shoving it down on his hard cock. Hoss grins a few times as Kody goes all the way down. Then, Hoss takes off his dirty Jack Daniels baseball cap and gets on his knees to feed Kody straight on. Eventually Kody lays on his back and positions himself beneath Hoss and starts licking his hugs balls from beneath as Hoss grabs Kody's cock and strokes it while he gets his balls washed. Kody switches up once more and gets on his knees beside the bed and lets Hoss fuck his face from that position for ahwile. All this hot cocksucking has got Hoss all hot and bothered and he's looking for the next place to stick his rock hard cock.<br /><br />Hoss Goes in for the Kill -- on Kody's Ass ... <br />Hoss is ready for the next lesson in mansex and that means he's ready to fuck Kody after getting his cock worked over good by Kody's mouth. Hoss stands over Kody's ass on the bed and drives his hard cock straight down in Kody's waiting hole. Kody grunts and moans until it's in good then he's all about it. Hoss is fucking Kody's ass like a madman. He obviously likes this new experience as much as he did the cocksucking and it shows in the way he attends to Kody's hot ass. They switch positions again and Hoss stands beside the bed while he continues to plow Kody. Kody is talking him up as he gets a good fucking. The position switches one last time and Kody ends up on his back with his legs in the air and Hoss starts plowing him as Hoss jerks on Kody's hard cock. This is a very hot ending to a great fucking as Hoss jacks Kody to an explosive cumshot. Once Kody has popped his load, Hoss blows his load all over Kody's stomach and the scene ends. What a hot fuck session between two muscle pups.",
  "models": [
    {
      "name": "Hoss",
      "person_id": 35088
    },
    {
      "name": "Kody",
      "person_id": 35098
    }
  ],
  "release_date": "2005-07-01",
  "scene_id": 69960,
  "series": "MIA: Men in Action 2",
  "tags": [
    "Gay"
  ],
  "title": "Hoss & Kody"
}