{
  "collections": [
    "Active Duty"
  ],
  "description": "Dean and Kody Shower Up ...<br />The video kicks off with Dean and Kody in the bathroom where they play around a little and undress each other before hopping in the shower. Kody slowly rubs and enjoys Dean's body and licks his nipples then moves down and starts giving him head and Dean returns the same attention before they hop in the shower together where the two of them caress one another's bodies and wash each other down. Kody slides his cock up and down the crack of Dean's ass as Dean bends over for his new buddy to explore. There's no entry here, but it's hot to watch. They exchange a wet blowjob then before getting out of the shower they lock lips in what has to be one of the hottest french kisses we've ever recorded. These guys compliment each other so well. Two, hot, beefy guys willing to explore each other and one so excited by the newness of it all that it adds such a great intensity to the mix.<br /><br />Dean, Cole and Cody Get Comfortable ...<br />Dean and Cole dry off and join Cole in the living room with hard-ons under their towels. Cole is already sportin' his own wood and the three soldiers hop right into to getting comfortable. Dean is the newbie so he's the first to taste King Cole's cock today. He's doing a great job at tackling the monster so Kody goes over and unveils the hard soldier underneath Dean's towel and goes to work on it. It's so hot to watch Dean make love to his first cock and with it being such a big one you'd think he'd have his hands full, but Dean masters the art of making love to a cock with his mouth pretty quick. Much to all our surprise. This man is hungry for what he's gotten himself into and it shows. Once he see's that Dean doesn't need his mouth as a distraction, Kody goes over and positions himself above Cole to feed him some cock. It's a cluster that you'll want to frame and hang on your wall. And there are many of those moments in this video.<br /><br />Kody Eats Ass for the First Time ... <br />Kody has come a long way in his adventures here on Active Duty. From the days of his athletic modeling to getting fucked by King Cole his first time around to his hot kiss with Shane and now Dean, but he's never eaten another guy's ass on video. Today that changes as he and Cole get Dean on the couch on his hands and knees preparing him for his first cock in his ass. Kody surprises us with a nice twist and as he's prepping Dean and just starts eating Dean's ass like it's the thing to do. Cole looks at me with his mouth dropped open in amazement. We never expected this. But Dean is one of those guys that will just make you do things you never thought you'd do. And this isn't a pansy ass-eating, troops, it's licking and sucking and enjoying a nice man ass in your mouth. Kody is doing such a good job getting Dean's ass ready that Dean gets so hot and bothered that he finally turns around and says why don't you just fuck me man? I almost fainted right there. All you Kody fans won't want to miss this one.<br /><br />Dean Gets Fucked Bareback For His First Time ... <br />We thought we'd be nice and let Kody be the first to open Dean's hole before King Cole took his plunge so Kody slowly enters Dean while Dean continues to have a ball with Cole's cock in his mouth. Dean really gets a rhythm going on Cole's pole while Kody slowly starts to bang him hard. Dean's taking it like a champ and not missing a beat on Cole's cock as Kody plows his ass like a fresh cut field. Kody and Cole teach Dean the art of arching your back while taking a good fucking and Dean catches on like a fish to swimming. Cole and Kody do some high-fiving as they train their newbie and break him in for what's about to happen next.<br />Once Kody has opened Dean up to a whole new world, King Cole steps in to finish the job. Dean might have thought this whole getting fucked thing hurting like hell was over-rated until now. Once Cole begins his plunge our soldier Dean starts moaning and the faces of agony start forming. But Dean's not a quitter and he takes Kody's cock in his mouth like a pacifier to ease the pain. He cups his hands under Kody's balls and sucks his cock like a champ. Moving from a huge cock to Kody's just-plain-big cock allows Dean to hone his skills and show them off. Meanwhile, Cole is balls deep in Dean's ass and Dean is getting a reaming like he never thought he would. Cole is bangin Dean hard and Dean is taking it like the hot man he is.<br /><br />Into Dean's Bedroom for More Ass-Eating and Hot Bareback Fucking ... <br />Once his seal is broken we decide to move things to the bedroom for a little more comfort and a lot more action. Cole continues his pounding on Dean's ass while Kody hovers over Dean in the 69 position and delivers Dean a cock down his throat while Kody sucks on Dean. To my flat-out surprise and Kody and Cole's as well...I jokingly say to Dean Ok, now it's time to return the favor and eat Kody's ass and, without one second of hesitation, Dean puts his tongue deep in Kody's ass, grabs Kody's cheeks and starts munching away on Kody's hole. The site of this cluster-fuck is another one you'd love to frame and hang on your wall. It's absolutely beautiful to see these three hot men in a twisted heat of passion and having a fucking great time. Dean eats ass just as good as he takes a cock and this is one hell of a hot scene.<br />We decide to switch things up a little and get Kody on his hands and knees on the bed while Dean bend over the bed and eats Kody's ass and Cole fucks Dean hard from behind while both of them are standing flat-footed next to the bed. Cole fucks Dean extra hard this time around and Dean eats Kody's ass harder and faster as he gets banged good and hard. It isn't long before our man Cole is ready to blow his nut and he pulls out and blows it all over Dean's ass. He opens the hole for us to inspect the damage and then Dean decides it's time to get his revenge on someone.<br /><br />Kody Gives it Up In the Name Of Fairness ... <br />Kody decides he'll let Dean fuck his hot ass since Dean has been such a sport and taken Kody and Cole on so well. Kody bends over for Dean and Dean fucks him like a madman. Kody cheers him on with a few Yeah man, fuck that ass..fuck me calls and Dean responds well to the calling. You can tell Dean is really loving the feeling of a man's tight ass wrapped around his cock as he intently watches his dick go in and out of Kody faster, deeper, and for a good amount of time. And Kody must be enjoying it too since he blows a nice load while Dean is still plowing away. Dean rams Kody a few more times before he pulls out to cum on Kody's hole while Kody spreads his cheeks apart for the wad to hit his hole. This is probably one of the biggest, juiciest cumshots we've seen lately as Dean's load splashes all over Kody's spread hole, his shoulder and the comforter. Talk about RELEASE!",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Dean",
      "person_id": 35074
    },
    {
      "name": "Kody",
      "person_id": 35098
    }
  ],
  "release_date": "2005-08-01",
  "scene_id": 69963,
  "series": "Open Ranks 3: Bareback Liberation",
  "tags": [
    "Gay"
  ],
  "title": "Cole, Dean & Kody"
}