{
  "collections": [
    "Active Duty"
  ],
  "description": "Tully, Kody and Bryson ... The next scene features three hotties. Tully is back and ready for some long overdue action and Kody has just introduced me to a new friend, Bryson. I get Bryson over for some fun with Tully and Kody shows up to catch his friend doing the dirty with Tully. But before Kody arrives Tully has the pleasure of giving Bryson his first blowjob and what a great job he does of it. Tully is crazy about sucking cock. It doesn't really matter what it's attached to. His fascination is with the cock itself and not so much the person. He'd do great in a glory hole. Bryson gets a taste of Tully's expert cocksucking skills before Kody arrives. Once Kody arrives the three of them get into a cockswapping scene with Tully and Kody sharing Bryson's cock and then Bryson getting a taste of both boys himself. The three of them do each other's cocks more than once and everybody is happy. Well, almost.The Three Heroes Head to the Bedroom ... Kody, Bryson and Tully head to the bedroom where they continue the cocksucking with Kody sucking Bryson and Bryson sucking Tully. The sucking gets intense as the three get really into it. After the cocksucking, Kody goes for some cock in his ass and starts to slowly ride Bryson's cock bareback as Tully helps him get the fat cock in his tight ass. Kody slams down on Bryson's cock and takes it all the way up his ass. The postion switches soon and Kody is on his back with his legs in the air and Bryson's naked cock inside his ass and Tully's cock in his mouth.Bryson Fucks Kody Bareback ... Kody is getting plowed good by his buddy Bryson while Tully sucks on Kody's cock. Kody's legs are high in the air as Tully works his tool and Bryson works his ass. It's heaven. Bryson is giving Kody a good fucking and Kody is getting sucked and jerked by Tully and it isn't long before Kody blows a huge load all over himself. Bryson keeps plowing his ass while Kody unloads his cream and soon Bryson follows suit with his own huge load all over Kody. This is one of the biggest, gushing cumshots I've ever seen as Bryson fills Kody's stomach with his hot man jizz. All the while, Tully is cramming Kody's mouth full of cock at the other end.Tully Fucks Kody Next ...After Bryson has done his damage on Kody's ass, Tully saddles up and goes in behind Bryson to finish Kody off. This is probably one of the hardest fucks I've ever seen Kody take. Tully is overly excited and it's showing as he bangs Kody hard. Kody later told me that no guy had ever fucked him that hard in a video and I believe him because I was there to watch it all take place and you will be too when you get your copy of MIA: Men In Action 2.Muscle Worship ... After the intense fuck session between Kody, Tully and Bryson, the three boys begin worshipping each other's nice bods. A nice treat.",
  "models": [
    {
      "name": "Bryson",
      "person_id": 35052
    },
    {
      "name": "Kody",
      "person_id": 35098
    },
    {
      "name": "Tully",
      "person_id": 35240
    }
  ],
  "release_date": "2005-07-01",
  "scene_id": 69961,
  "tags": [
    "Gay"
  ],
  "title": "Bryson, Kody & Tully"
}