{
  "collections": [
    "Active Duty"
  ],
  "description": "Dean Wants To Have A slumber party With Tony<br />After Tony relays his slumber party experiences to me, I immediately think of Dean and so I go to Dean's room and tell him a little of what Tony has told me about he and his buddy from high school. Dean wants to hear more but I tell him he'll have to hear it from Tony. So, Dean and I return to the room where Tony is laying on the bed and Dean hops on the bed beside Tony and I leave the two of them to talk. Tony tells Dean all about his slumber party and Dean is clearly excited by his stories. In fact, I think Dean may have been a little jealous that he'd not experienced such things with his buddies in high school. Dean tells Tony that he'd like to have a slumber party like that.<br /><br />Tony Moves in On Dean<br />As he tells Dean his story of he and his high school buddy, Tony starts rubbing Dean's leg and slowly recreating the situation he's describing to Dean. Dean is all smiles and clearly excited by Tony's story and his physical advances. Tony takes Dean's shirt off and then gets Dean to take off his pants and lay on his stomach so Tony can give him a massage. Dean loves massages so he does as he's asked. Tony takes his time rubbing and enjoying every inch of Dean's big, manly body as he rubs all over Dean and eventually reaches under and plays with Dean's cock through his boxer briefs. Dean is hard as a rock by this time. Tony gets naked and crawls on top of Dean and begins humping his ass through his boxers and Dean brings his ass higher to meet Tony's cock. This is wildly erotic as the two young men really get into the slow-hand seduction that Tony is putting on Dean. Eventually Tony pulls Dean's boxers down and rubs his naked cock up and down Dean's hot crack, giving his butt a massage with his cock. Tony leans forward and licks and sucks on Dean's ear and Dean responds with raising his ass more and more. Tony then turns Dean over and starts slowly sucking Dean's already raging hard cock, licking and sucking and slowly making love to it. Tony gives Dean a great blowjob before Dean takes his turn on Tony's cock and<br />Dean Returns The Favor To Tony and Then Some<br /><br />Tony moves up after sucking Dean's cock for a good while and puts his cock in Dean's mouth. Dean starts slowly making love to Tony's cock in return for the good blowjob and massage he's just gotten, but Dean takes things a little further and gives Tony a 'surprise' and turns Tony over on his stomach and starts slowly licking Tony's beautiful ass. Dean gives him a deep, intense rim job as he tongues him deep and slow. Tony is loving the new experience so much that Dean's senses he might be ready for the next surprise and Dean starts slowly fingering Tony's hole. Dean and Tony are both really horny so it doesn't take long before Tony is offering his ass to Dean and Dean is more than willing to take it and boy does he ever take it. Dean let's loose on Tony's ass like a stallion and fucks the boy almost senseless as Tony eggs him on to fuck him harder. Dean is in full-throttle on Tony's ass and fucks him harder than I've ever seen Dean fuck a guy. Dean is showing off his studliness as he manhandles Tony's ass. Finally, after an good hard, long fucking Dean pulls out and blows one of his famous huge loads all over Tony's back, hitting his shoulder and ear and you can just imagine how good it feels to Tony to have this stud's hot fucking load all over his back.<br /><br />Dean Promises Tony Another slumber party<br />After he's blown his hot load all over Tony's back, Dean leans forward and lays on top of his cum, snuggling next to Tony rubbing his chest into the cum he just shot on Tony's back. The two crawl under the covers and Dean promises Tony his chance at their next slumber party. The lights go out as our Soldiers move on to the rest part of their slumber party.",
  "models": [
    {
      "name": "Dean",
      "person_id": 35074
    },
    {
      "name": "Tony",
      "person_id": 35157
    }
  ],
  "release_date": "2005-08-30",
  "scene_id": 69978,
  "series": "Soldier Slumber Party",
  "tags": [
    "Gay"
  ],
  "title": "Dean & Tony"
}