{
  "collections": [
    "Active Duty"
  ],
  "description": "Let a Hot Boy Take a Hot Boy's Pics and Watch the Interest Peak<br />Realizing that I had a horny young man in tow, I decided to give things an interesting twist. I called Cole in the bathroom and told him what I'd discovered in Kevin. I told Cole that I thought he should go in and take my place behind the camera and finish taking Kevin's photos but I suggested he get naked while taking the photo's and in between shots to beat off to the video that Kevin was watching. Cole follows my lead and goes in to see what kind of reaction he can get out of Kevin. It isn't long before Kevin agrees that he'd like to have Cole naked beside him on the bed instead of taking his pictures. So I decide to finish the photo session later and start shooting a 'double jack-off' video. Kevin is more than OK with this scenario and takes to the idea with ease.<br /><br />Brad Wants to Watch<br />As Kevin gets more and more comfortable with the situation between he and Cole, I keep going in and out and purposely reporting their progression to Brad who is sitting outside the bedroom at the kitchen table. Brad is just sitting on the edge of his seat more and more with each report. Finally, he can't take the thought of what he might be missing and asks me if he can go in and 'watch'. 'Watch? No way!' I tell him 'If you watch you gotta participate.' Brad isn't too sure he can handle that just yet but one more return with a report that Cole and Kevin are considering going further than just jacking off and Brad can't resist anymore. He wants in. He agrees to get naked and jack off while he watches Cole and Kevin progress. So, I bring Brad into the room and he strips naked and gets on the bed with Kevin and Cole and starts stroking as he goes between watching the porn and watching his buddy Kevin admire Cole's cock.<br /><br />Kevin Can't Resist Cole's Cock and Brad Can't ResistÉWell, Brad Just Can't Resist<br />With some cajoling from Cole and I, Kevin reaches over and grabs Cole's cock and starts stroking it. It's apparent in Kevin's eyes that he wants the cock in more places than his hand so we continue to push the envelope. Kevin is a hungry little trooper and taking Cole's cock down his throat is no big deal for him to try. Much to both mine and Cole's surprise, Kevin nearly swallows the whole thing with no problem. Cole jokes that he thinks Kevin might have done this before, but I disagree and say that maybe he's so good because he's been fantasizing about sucking cock so long that he's just plain ready to give it his best. Whatever the true answer is, Kevin is a master at deep-throating a huge cock and he's enjoying the hell out of this new challenge. He takes Cole's cock deep down his throat over and over again, amazing all three of us with his skills. Brad is getting all excited watching his buddy suck Cole's cock and Cole and I finally talk Brad into joining in on the fun. Cole gets Brad to stand beside him while Kevin deep-throats both of their cocks. Brad isn't sure if he's supposed to be enjoying this, but he just can't help it. With a cocksucker as good as Kevin slobbin' your knob there isn't much you can do but stand at attention and enjoy it.<br /><br />Brad Is a Fast Learner<br />Once Brad has gotten over his nervousness (well, for the most part) We get him laying down on the bed with Kevin continuing to blow him and start slowly feeding him Cole's cock. Brad says 'wow that's a huge dick man' but Cole says 'you're handling it fine' and Kevin responds with 'Yeah, I was watching Kevin trying to learn something.' It's apparent that he learned quick as he bobs on the rod and sucks it quite well. Then we get Kevin in the mix and Brad goes to town on both cocks as Kevin and Cole feed him their meat. Brad takes turns sucking the cocks then moves down to give Kevin some extra attention. He's sucking his buddy as intently as his buddy sucked him while Cole eggs him on. Brad takes direction well and responds to all the commands just like a natural cocksucker.<br /><br />The Action Progresses Bareback!<br />Kevin reminds me of a married man that is trying gay sex for the first time. You know the type...so hungry, so curious and so fucking excited that they want to try it all in the first go. Well, that would be an accurate description of Kevin and Brad is just as ready to move forward as we position Kevin between Brad's legs with his ass in the air, ready and waiting for Cole to take the first plunge deep into his ass. Cole gets inside Kevin and starts slowly fucking him while Brad rubs Kevin's head as he lays his head on Brad's chest...but it isn't long before Kevin is all lathered up and eager to go. Cole may have gotten himself into a little more than he's used to handling with Kevin. Once the seal is broken, Kevin gets demanding. Cole puts him on his back and Brad gets above him to feed him the cock while Cole delivers his to the back door. Kevin opens right up and is taking the cock like a fucking true champ.<br /><br />Kevin Takes Cole and Demands MORE<br />Kevin becomes a very verbal bottom...saying things to Cole like 'Come on...give it to me. Is that all you got?' At another point he says to Cole, 'You aint got no big dick...come on give me more.' Kevin is an agressive bottom that doesn't fuck around. Once he's broken in he's a demanding little fellow. Later on during his fucking he is up on his hands and knees sucking Brad while Cole is pounding him as deep and hard as I've ever seen Cole pound anyone and says to Cole 'Come on motherfucker...I'm handling two...you can't even handle one?' It would seem at this point that Cole might have met his match for someone that can take it and dish it out at the same time. Cole is doing his damndest to hush the boy by banging him deeper and harder even slapping his ass leaving hand prints, but Kevin isn't letting up...he isn't backing down and his dirty talk and demands continue. He's not missing a beat on sucking his buddy Brad's cock either. He keeps a continuous rhythm.<br /><br />Cole Needs A Break<br />Our new recruit has done something no one else has ever done..he's fucked Cole to exhaustion. Cole has to actually stop during the scene to take a break. While Cole is breaking we are chatting about him having possibly met his match and Kevin just says fuck it. 'Have you got a bigger one?' I tell kevin that in order to find a bigger one than Cole we might have to go in the drawer. Cole says 'yeah you better have plenty of batteries' But Kevin wants the real thing and Cole is catching his breath again so it's back on.<br /><br />Kevin Rides The Donkey While He Sucks His Buddy<br />Brad is all riled up from all this hot action and seeing his buddy go all out has got him all hard, hot and bothered. Kevin is deep-throating Brad like a champ as he rides Cole's cock like a cock jockey. He's bouncing up and down. He's giving Brad one of the best blow jobs his young cock has ever had I'm sure. And Cole is letting Kevin take control as he rides the Donkey. Kevin is becoming quite the team player and he's multi-talented too. He keeps the pace of riding and sucking as good, if not better, than anyone I've ever seen. I don't think Brad is really believing what he's seeing but no need to pinch him just yet as he's having way too much fun to snap out of it now.<br /><br />One More Ride For The Road<br />Kevin gets in the doggy-style position one last time and starts yelling at Cole. Cole tells him to 'Arch your back' and Kevin says 'you arch your back, bitch.' Cole starts slapping his ass and I tell Cole not to slap him harder to fuck him harder. It's apparent at this point that Kevin isn't going to break...he's not going to back down. He gets a cramp in his leg and even that can't stop him. 'You think a cramp's gonna stop me motherfucker?' Cole confesses, 'No!' All the while Kevin is stroking and sucking Brad who's rock fucking hard from all the dirty talk and watching his buddy get plowed. This is one of the hottest fuck scenes I think I've watched. Kevin says to Cole 'Come on...all you gotta do is get yourself off...I gotta get you and off and him off' referring to his buddy's cock.<br /><br />King Cole Finally Drops His Load in Kevin's Ass<br />Cole finally blows as huge load all in the crack of Kevin's ass and Kevin reaches back and rubs it in. He wants to feel the load that he helped evoke. But he doesn't stop workin' Brad's cock as Brad blows his huge fucking load all over Kevin's hand and Kevin licks it off. He takes the cum in his mouth several times and spits it back onto his hand and plays in it like a boy with a new race car. Kevin has just discovered something he really likes and he brought his buddy Brad along for the ride. I'm sure they'll both be back for another lap around the track.<br /><br />To The Showers<br />Kevin has proven himself the star of this show and it doesn't stop in the shower as he Brad and Cole get cleaned up. Kevin starts showing off his ass and what a view it is. This guy is golden and it's all evident as he takes a shine to the camera once more and at my request shows off all his ass-ets and quite well I might add. I fell in love with Kevin during the filming of this video and I'm sure you'll fall in love with him by the time you hit the showers, too.",
  "models": [
    {
      "name": "Brad III",
      "person_id": 35426
    },
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Kevin",
      "person_id": 35106
    }
  ],
  "release_date": "2005-08-26",
  "scene_id": 69977,
  "series": "Forward March 2: Bareback Progression",
  "tags": [
    "Gay"
  ],
  "title": "Brad, Cole & Kevin"
}