{
  "collections": [
    "Active Duty"
  ],
  "description": "Dean Invites Kody To The Next slumber party With TonyFor the next slumber party Dean invites Kody into the mix with he and Tony and things get heated right away. This is a much more wham-bam experience with three hot, horny men in a bed things are bound to move faster. The three start out by playing with each others nipples then Dean and Tony share a kiss that makes Kody jealous and the three of them embrace in a three-way kiss fest that ends up focused on Tony. Dean and Kody lick and suck on Tony's ears and nipples and work toward getting his pants off. Once the pants are off Dean and Kody begin rubbing Tony's cock and then sharing quick kisses in between before they get Tony's cock out.Kody And Dean Give Tony Something To EnjoyOnce they get his shorts off, his cock is already hard and wouldn't yours be with these two hot studs giving you all that attention? Tony is no dummy and realizes quickly that he's probably one of the luckiest guys alive right now. Kody starts the headgiving and starts sucking Tony while Tony plays with Dean's cock through his boxers and works Dean up to a nice hard on. Dean and Kody share Tony's cock for a bit then Kody moves around behind Dean and starts pulling down his boxers to get better access to Dean's ass.Kody Eats Dean's Ass And Gets It Prepared for Tony to FuckKody gets Dean up on his knees while Dean sucks Tony's cock. Dean's beautiful round ass is up in the air and wide open as Kody rubs his cock on it and plays with it and gets some good responses from Dean. Kody gives Dean an good, intense rimming, sucking and slurping on Dean's nice hole before he begins fingering it and preparing it for the fuck Tony is about to give it. Once he's prepped Dean's ass Kody gets Dean in position and Kody and Tony slap their cocks all over deans round, firm buns before Tony moves in to fuck him.Dean Sucks Kody Good While Tony Fucks Dean GoodOnce Kody has helped Tony get his cock in Dean's nice ass, Kody crawls under Dean and starts feeding him his cock. Tony is balls deep in Dean's tight ass and Dean is working Kody's cock over good. Dean has gotten really dirty in his progression and starts spitting on Kody's cock and sucking it with fervor. Dean is giving Kody and intense fucking blowjob while Tony is plowing Dean's ass good and hard. I think we've found Dean's favorite position...a cock in his mouth and his ass seem to be heaven for Dean as he really gets into it all. Dean must be doing a hell of a job at sucking Kody's cock because Kody blows one of the biggest loads I've ever seen him blow. Dean is cheering him on as his huge load spews and Dean reaches up and rubs it all over Kody's belly, playing it in like a kid in a candy store. It's Kody's turn to get fucked nowDean And Kody Switch Up And Tony Fucks Kody GoodOnce he's blown his huge load and Dean has had his fun playing in it, Kody assumes the position to get some of the good fucking that Tony has been giving his buddy, while Kody returns the blowjob to Dean. Tony has never had this kind of luck to get two hot studs willing to give him their ass in one night before. But he's doing just fine handling the new adventure and picks up on Kody's ass where he left off on Dean's. Tony enjoys the view of Kody's nice, round ass and Kody blowing Dean's hot, hard cock as he slams in and out of Kody's ass. Kody is working Dean's cock good and it doesn't take long before he's giving Kody a load as good Kody shot for him. Seeing this combined with the feeling of Kody's tight ass wrapped around his cock sends Tony over the edge and he blows his hot load all over Kody's back and ass. The boys lay down and cuddle and spoon as the lights go out on this second Soldier slumber party.",
  "models": [
    {
      "name": "Dean",
      "person_id": 35074
    },
    {
      "name": "Kody",
      "person_id": 35098
    },
    {
      "name": "Tony",
      "person_id": 35157
    }
  ],
  "release_date": "2005-08-30",
  "scene_id": 69979,
  "series": "Soldier Slumber Party",
  "tags": [
    "Gay"
  ],
  "title": "Dean, Kody & Tony"
}