{
  "collections": [
    "Active Duty"
  ],
  "description": "Jake, Damien, Dean and KodyAs the pants come off and not wanting to waste time on pleasantries, Dean chows down on Jake without any discussion. Kody Slurps up Damien in one gulp and the game is on. Damien peers at Kody through closed eyes and moans his approval. Dean pumps Jake to attention and then moves on to the plump ass on the big guy. Dean slurps and kisses his way if not into JakeÍs heart then squarely into the pretty pink pucker. Dean is a buff picture snorkeling on Jake with his own fat low-hangers swinging in the breeze.In the meantime, Damien is returning Kody's favor listening to Jake moan. Dean's tongue is reaching places Jake didn't know he had and grabs both cheeks to hold on. Before Jake knows it, Kody is a waitin' doggie. Jake is making all kinds of faces and moaning first sofly and then turns up the volume. Damien is underneath sucking Dean and completes the circus act playing with Kody's balls. In the center ring, Damien is sucking Jake while Dean slurps Damien. Kody's first cumshot is a shot indeed all up and down Jake's spine. Damien is still wailing under Jake when we hear 'hot jizz on my back!' Dean focuses on Kody's bubble-butt, licking and kissing his way up the crack. Jake gets his revenge on Damien and mounts him like a bitch.Damien and Kody hang on to the back of a sofa side by side as Jake and Dean plow them from Behind The Line. Kody reaches over and slaps Damien's ass setting off a series of moaning, groaning, and pained facial expressions but it's all good folks. It's legs in the air for Damien as Jake shifts into high gear. Jake shoots a load in Damien's mouth, fills it up and we watch it flow down a blushing cheek. Not to be outdone, Dean shoots over Kody's shoulder, on his face, and down that beefy chest.Payback is the bitch that gets both Jake and Dean's legs in the air. Dean is holding on to Kody pulling him deeper and harder into his ass as Kody gives it a loud slap. We look under the twosome for the real action (balls banging and swaying, big dick plunging in and out). Dean screws his face up in a frown but manages to say 'feels good.' Damien gives Jake 'a little help' and starts to stroke long and slow. Kody doesn't need any help at all and shoots a big load spraying Dean on his chest, in this hair, on his face and the whole general area in front of him. Damien is up next, bathing Jake's dick and balls in sweet spooge. 'Ya'll stand up,' is Dink's final command as the buff foursome line up for a parting shot., followed by 'thanks for playin' guys.",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Dean",
      "person_id": 35074
    },
    {
      "name": "Kody",
      "person_id": 35098
    },
    {
      "name": "Jake (Big Jake)",
      "person_id": 35199
    }
  ],
  "release_date": "2005-08-26",
  "scene_id": 69975,
  "tags": [
    "Gay"
  ],
  "title": "Damien, Dean, Jake & Kody"
}