{
  "collections": [
    "Active Duty"
  ],
  "description": "Damien, Cole and Zack kick back and shoot the shit ...Zack was in town for the weekend for his first visit to the Active Duty compound in nearly three years. So, since Damien was our freshest recruit that week I decided to team him up with Zack and Cole for some afternoon fun. The three sexy devils kick back in the living room and start watching some porn while I bullshit with Zack about where's he's been and just get the guys talking and bullshitting in general. I leave the three of them alone with the porn for awhile and wouldn't you know it doesn't take long before they're comparing cocks and pulling off their pants. And wouldn't you know it's Zack that's first to latch onto a cock (after all it's been three years) and he grabs onto our toy soldier's little soldier and starts stroking him. Cole follows suit and they both play with Damien's cock. Damien (not one to be left out) grabs onto both Zack and Cole's cocks and starts stroking them in return.Gettin' Orally Acquainted ...Zack kicks off the cocksucking as he goes down on Damien to taste the toy soldier's gun. Must be clean because Zack doesn't back off. Damien grabs hold of Cole's huge gun and strokes it while Zack strokes his with his mouth. Finally Damien takes the plunge and goes down on the huge rod to give it a taste. Zack keeps the pace and follows Damien's cock and keeps it in his mouth while Damien services his first cock ever. After he's broken in, he moves over to Zack's cock and Cole takes Damien's cock in his mouth for a taste. After everyone's had their cock in someone's mouth and their mouth on someone's cock Damien kicks back and lets Zack and Cole share his cock for awhile. Cole moves over and gets another sample of Damien's hot mouth before they put our toy soldier in position to get his first cock in his ass.Cole Fucks the Daylights Outta Damien ... Damien is a trooper and this little soldier isn't going to let anything get the best of him. He's willing and able to take what's thrown his way and he's about to prove it. He's sporting one of the absolute cutest bubble butts I think I've ever seen and when he arches that beautiful tanned back and throws that ass in the air it's heaven. Even with King Cole at the helm our little trooper isn't scared. Zack looks more afraid than Damien as Cole makes his initial insertion into our toy soldiers virgin hole. Damien groans a bit and begs for a little mercy but he doesn't jump up and run. Once Cole is balls deep in Damien's tight young ass, Damien grabs Zack's cock and starts blowing him good while Cole plows Damien from behind.Once he's broken in good Cole moves Damien to the floor where he guides him down onto his cock so Damien can ride the horsey. And what a wild ride it is. Damien doesn't miss a beat as he guides the huge cock in and out of his ass as he bounces up and down. He's moaning a lot in between sucking Zack's cock but he aint complaining. He's riding Cole's cock like a champ. After he rides the cock for a bit Cole puts Damien face down in the rug and starts banging him from behind. Damien's chest is down and his face buried in the rug with his pretty little round ass sticking straight up in the air, giving King Cole just the angle he needs to give it a good thorough fucking. Cole does what Cole does best and gives the little soldier a hell of a plowing as Damien just moans. Damien's moans have got to be some of the sexiest I've heard from anyone taking Cole's cock. He's being fucked balls deep but he's trying like hell to enjoy it as best he can. I'm not sure I've seen a hotter bottom taking Cole's cock. After a grueling fuck Damien is well broken in.Zack backs that ass up for Cole ... Zack decides he's long overdue to take a good fucking. In the many videos he did for Active Duty back in the day he never once got fucked by anyone. Today that's going to change. Damien feeds him the cock while Cole prepares to bang him good. Zack bitches and moans for a few minutes while Cole works his tight ass loose. I thought at one point Zack was gonna throw in the towel and say to hell with it. But he stays in place and finally once the seal is broken he starts taking a good fucking. It's not long before Zack starts liking that big cock in his ass and he starts making it known.'Yeah ... come on big boy fuck me. Yeah ... fuck that ass man' comes the yells as Zack adjusts to the monster inside him. If this is Zack's first time being fucked he won't soon forget it. But I'd be willing to bet that after today that ass will need someone to tend to it from time to time. Zack really starts getting into it and pretty much takes over. Cole just stands in place while Zack does all the work and literally fucks Cole's cock himself. He's slamming back on it and yelling all the while. He's loving it and it shows. Cole never has to move again all he has to do is stand in place and Zack eventually fucks Cole to completion. This is the first time I've seen this happen. Usually Cole has to fuck the boys not the boys fuck him but Zack does just that. It's unreal to see how much he's enjoying what he's getting as he literally fucks Cole's cock instead of getting fucked by it. This is so fucking hot. All the while he manages to keep Damien's cock planted deep in his throat. Talk about multi-tasking. Cole blows his load all in the crack of Zack's ass and Zack is so excited by it all that he reaches back and shoves Cole's cum deep in his ass with his fingers. What a hot sight to see.Cole Helps His Fellows Out By Lending His Mouth ...After he's fucked them both silly Cole decides to help Damien and Zack get their nuts and gets down on the floor and grabs both cocks and goes back and forth between the two sucking until they blow their loads. Zack is the first to let loose as he blows a huge juicy load all over Cole's chest. Damien follows Zack's lead and does the same, delivering an even bigger, juicier load onto Cole's chest. We chat a few minutes and the fellows line up at parade rest for a closing pose. Hot!",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Zack",
      "person_id": 35249
    }
  ],
  "release_date": "2005-08-26",
  "scene_id": 69974,
  "series": "Toy Soldier",
  "tags": [
    "Gay"
  ],
  "title": "Cole, Damien & Zack"
}