{
  "collections": [
    "Active Duty"
  ],
  "description": "Jake, Luke and HossÉ<br />The Three Amigos line up for instructions and Dink says 'I suspect Hoss is gonna fuck somebody today' 'you guys are sheisty lookin' anyway.' 'I have a challenge for you. Get Hoss to cross the line and there's something in it for everybody.' Luke starts the conversion process with Hoss by saying 'Just think about the money,' 'And there are the Live Shows, with everybody 'lovin you''<br /><br />Now we have Jake and Hoss as bookends and Luke in the middle talking about when he fucked Tuffy for his first time. The shirts come off and then Luke starts peeling off his ranger panties. Hoss doesn't have to be encouraged to take it all off and the game is on. The three move Hoss to the middle so he can have a dick in each hand. Luke talks about some 'hard-on cream' he heard about that he swears is 'external Viagra,' and nominates Jake to suck Hoss to life. Luke decides to share Hoss's dick and stop his story-telling because 'My mama taught me not to talk with my mouth full.' So now we have Hoss in the middle with Jake and Luke on his dick holding their heads down to get it all in.<br /><br />Luke says 'why is everyone lookin' at me?' He looks at Dink and says 'well how do you want me?' The stage is set with Luke on all fours ready for Hoss to do the deed. Come on Hoss, Cole fucked me harder than this!' That was all Hoss needed to hear and he pumped up some speed. 'arrrrgh, arrrrgh, fuck me Hoss.' After 15 more minutes of hard plowing, Hoss slaps Luke on the ass a few times until he hears 'I don't think I can take any more,' 'that's a big dick' and then 'arrrrgh' and 'oh fuck' and 'arrrrgh, arrrrgh.' I guess his mama didn't tell him not to talk with his ass full either.<br /><br />Jake is up next and Luke doesn't waste any time. 'Put that cock in your mouth Jake' is all the big guy hears as he mutters 'wait 'till I get my turn mother fucker.' Hoss shoves his big cock balls deep in Jakes ass and hears 'fuck me, fuck me,' as he spews out a load on Jake's back. All Jake can say is 'that is one big-ass fuckin' cock!' All there was left to say was 'appreciate you playin' guys.",
  "models": [
    {
      "name": "Hoss",
      "person_id": 35088
    },
    {
      "name": "Jake (Big Jake)",
      "person_id": 35199
    },
    {
      "name": "Luke",
      "person_id": 35116
    }
  ],
  "release_date": "2005-08-26",
  "scene_id": 69976,
  "series": "Behind The Line",
  "tags": [
    "Gay"
  ],
  "title": "Hoss, Jake & Luke"
}