{
  "collections": [
    "Active Duty"
  ],
  "description": "Cole, Cliff and Brennan Hang Out and Watch Porn...Among Other Things<br />Cole and Brennan are sitting around in the living room watchin' porn and gettin' their drink on while we wait for Cliff to arrive. Cliff comes in looking great and wearing a shirt with an arrow pointing to his dick that says 'Atkins Approved'. And Brennan and Cole are about to give it their stamp of approval as well. I shoot the shit with Brennan, Cliff and Cole for a few minutes about lesbians and other 'life's mysteries' before the action kicks off in the shower. Cliff heads the shower and starts getting cleaned up before Cole and Brennan join him for some hot oral action.<br /><br />Hit The Showers<br />Once the three soldiers are in the shower things go as usual with Brennan going down on Cliff first. As always Brennan is making love to the cock he's sucking like only Brennan can. Cliff is enjoying the attention as Cole waits his turn. They slap high fives and Brennan turns to Cole's monster to tackle it. Cole's stroking on Cliff while Brennan works both their cocks. The shower time doesn't last long before they bail for the bedroom where the real action begins to unfold.<br /><br />Head For The Bedroom Where It's Head For Everyone<br />Back in the bedroom the three fellows start out stroking themselves a bit but it isn't long before the mouths start touching the cocks. They put Cliff in the middle of the trio as Cliff starts going down on Cole and Brennan strokes Cliff's cock and his own. Brennan can't resist for long and he's in on Cliff's cock like a vulture. The trio switches things up a few times so that everyone gets a taste of everyone and they're all heated up. Cliff latches on to Brennan's rock hard cock and gives it a whirl. Then Brennan and Cliff share Cole's massive rode like an ice cream cone at the beach. It's a three-ring cocksucking circus as they trade every position imaginable. This much cocksucking has to lead to some hot fucking and it does. Cliff is the first to move on Brennan's perfect ass as he begins the entry.<br /><br />Brennan Gets Fucked By Both Cole and Cliff<br />The little goose bumps that form on Brennan's ass while Cliff slowly goes inside him is proof that he's liking what he's getting. Cliff fucks him slow and easy at first giving him long, deep strokes. Once he's in good and Brennan is nice and ready, Cliff begins to bang him hard. All the while Brennan is swinging from Cole's pole as he tries to deep throat the monster. Cliff is getting Brennan's ass ready for that massive meat and getting his jollies at the same time. Cliff finds his rhythm and fucks Brennan to a melody. After he's nice and opened up Cole goes in for the kill. We put Brennan in an interesting position laying on his side with one leg over Cole's shoulder as Cole bangs him hard from the side while Brennan sucks Cliff's rock hard cock. Brennan isn't even flinching as he takes Cole's cock like a true soldier.<br /><br />Cole gets him doggy-style to do the job right, giving Brennan all of his hard, long dick. Cole is giving it to Brennan balls deep and Brennan is taking it like a man. Cliff watches as he jerks his cock. He's enjoying the first hand experience. Finally he can't hold back at the sight of this any longer and blows his huge load all over Brennan's back and Cole continues to slam dunk his ass. Cole blows next as Cliff cheers him on and lands a nice load on top of Cliffs. Cole rubs the load between Brennan's cheeks. After they've fucked him hard and hung him up wet, Brennan finally gets to jerk out his own massive load all over himself and Cliff and Cole play wingmen.",
  "models": [
    {
      "name": "Brennan",
      "person_id": 35045
    },
    {
      "name": "Cliff",
      "person_id": 35062
    },
    {
      "name": "Cole",
      "person_id": 35020
    }
  ],
  "release_date": "2005-12-20",
  "scene_id": 69988,
  "series": "MIA: Men In Action 3",
  "tags": [
    "Gay"
  ],
  "title": "Brennan, Cliff & Cole"
}