{
  "collections": [
    "Active Duty"
  ],
  "description": "Donnie And Jixer Together At Last<br />Donnie and Jixer watching a porn and shooting the shit. Donnie is quite aggressive and asks Jixer what he's interested in. When Jixer says just having fun Donnie demands that he be more specific, 'What kind of fun do you want?' Jixer tells Donnie he wouldn't mind having his dick sucked for awhile and Donnie tells him it depends on hard he can get that thing. That shouldn't be a problem for Jixer. His big cock responds pretty quickly. The pants come off and Jixer is hard as a rock. That big, curved cock is begging for attention but Donnie tells Cole he thinks Jixer wants to suck his cock and Jixer responds by saying he's right and gets down between Donnie's legs and starts sucking. Donnie instructs Jixer as Jixer gags on Donnie's cock a couple of times before he gets it in his throat good. Donnie starts fucking Jixer's face as Jixer goes to town on Donnie's hard cock.<br /><br />Donnie Returns The Favor to Jixer<br />After Jixer has given his cock a go, Donnie returns the favor to his buddy and starts in on the long, curved beast giving it a spit shine. Donnie is obviously hungry for it as he holds nothing back while he deep throats the huge cock. Donnie works his nuts and his cock while he strokes his own. He licks the shaft of Jixer's cock making love to the impressive piece of meat. He licks the head and looks at the camera like he wishes it was your cock he was servicing. Jixer then tells Donnie he wants to eat his ass.<br /><br />You Must Eat Before You Fuck<br />Before they fuck each other there's some great ass-eating action as an appetizer to the main course. Jixer really gets into eating Donnie's ass as Donnie moans in pleasure. Donnie's cock stays rock hard while Jixer tongues his hole from behind. Donnie strokes to the tongueing his asshole is getting. Donnie gets over Jixer as Jixer lays on his back and fucks Jixers throat with his cock. Jixer then bends Donnie over and starts fingering his tight hole to prepare it for his huge cock. Jixer starts his descension down into Donnie's hole and Donnie relaxes and lets it slide in. Donnie is really taking this big cock better than expected and Jixer begins to really fuck him hard. Donnie reaches back and spreads his cheeks further apart so that he can get more of Jixer inside him. Jixer puts Donnie on his back and fucks him in that position for awhile then stands him up beside the bed and fucks him good and hard while Donnie stands with one leg on the floor and one on the bed. Jixer's cock is long enough to go deep even in this position. When he's ready to blow he blows a huge load all over Donnie's ass and back and tells Donnie 'I want you to fuck me' in a very aggressive tone.<br /><br />Donnie Returns The Fucking Favor To Jixer<br />Once Jixer gives the command Donnie gives the cock. He puts Jixer on his back and fucks him wildly. I mean Donnie is fucking him like it's the last piece of ass he'll ever get and Jixer is taking it like he's never gonna get it again. Donnie fucks him on his side, Jixer rides Donnie's cock and the positions switch several times before Jixer gets on his knee's in front of Donnie and waits with open hands for Donnie's hot load to fill them up. Donnie shoots a huge load into Jixer's hands and Jixer takes the hot cum and rubs it all over his chest. Donnie takes his cock and helps him rub it in. Jixer takes Donnie's cum dripping cock in his mouth and milks the last drops for good measure.",
  "models": [
    {
      "name": "Donnie",
      "person_id": 35261
    },
    {
      "name": "Jixer",
      "person_id": 35424
    }
  ],
  "release_date": "2005-10-30",
  "scene_id": 69981,
  "series": "Hot Zone",
  "tags": [
    "Gay"
  ],
  "title": "Donnie & Jixer"
}