{
  "collections": [
    "Active Duty"
  ],
  "description": "Cliff Puts The Moves On Damien<br />Cliff thinks he's got himself an innocent little 19 year-old virgin boy to corrupt and we don't let him think any different. The thought seems to really turn Cliff on so we just keep our mouths shut and Damien plays right along. I tell Cliff it's his job to seduce and turn Damien out and he doesn't waste any time trying. Cliff has no idea that Damien has been down this road before and fucked hard and long by the best of the Active Duty studs. It's especially hot to watch as Damien fakes Cliff out and acts as if he's the innocent fuck Cliff thinks he is. In fact, I think the whole idea of being seduced (whether it's his first time or not) really turns Damien on. I can tell right away that the chemistry between these two is going to be magic. Cliff starts out the usual way with a porn in the DVD player as he starts playing with his cock and talking to Damien, 'this is getting me excited how about you?' Cliff does the old 'mind if I jerk off?' routine and Damien plays right along.<br /><br />Cliff pulls out his cock and starts pounding away as Damien cuts glances over to what will soon be in his mouth and ass. Cliff's body is awesome and Damien is having fun admiring it. I'd like to know what was going through Damien's mind at this point. Cliff asks him if he's ever jerked off with another guy and Damien's says once with a buddy when they were young and naive. Cliff asks if Damien liked it and Damien says yeah. Cliff suggests they jerk off together and Damien pulls out his cock. Cliff finishes undressing and Damien follows his lead. Cliff can't take the anticipation any longer and just blurts out, 'Think you could suck my dick like that bitch on the video?' Damien says he could give it a try and Cliff responds with 'well give it a shot' and Damien does.<br /><br />Damien Sucks Cliff Like A Champ and Cliff Returns The Favor<br />Damien is going down on Cliff's cock like there's no tomorrow. You can tell by the way he's sucking it that he's really into this guy. Cliff talks dirty to Damien while Damien sucks away. Then, Cliff takes a shot at Damien's cock as Damien jerks on Cliff. Cliff seems hungry as he buries Damien's dick in his throat and works on it like working on his abs at the gym. They switch off several times servicing each other and doing quite impressive jobs on each other's knobs. The low-voiced chat that Cliff keeps whispering to Damien is really hot. Cliff challenges Damien to see how far down he can go and Damien does his best to swallow the meat whole. The chemistry between these two is amazing as they both get really into each other and what's going on. What about that porn playing in the background? Well, neither of them seem to remember it now. They are into each other and it's showing.<br /><br />Damien licks and sucks and slurps up and down the shaft of Cliff's rod making love to it. Cliff tells his bitch boy what a great job he's doing and Damien responds favorably by getting more and more into pleasing his daddy. Then, Cliff wants to reward his boy so he sits him on the footboard of the bed and begins to work Damien's cock over again. Cliff is hard as a rock the entire time he's sucking Damien. Cole gets some great angles of the action so we don't miss a beat. Damien thrusts forward feeding his cock to Cliff as Cliff works it like a part-time job. They end out the sucking in a nice sixty-nine before Cliff gears up to tear Damien's ass apart. Cliff asks Damien if he's ever thought about getting fucked and Damien says he's thought about it. Cliff asks if he wants to give it a try and Damien says sure why not. Cliff tells Damien good 'cause your gonna get it.'<br /><br />Cliff Takes Damien's Ass Like A Real Man Should and Damien Likes It<br />Troops, brace yourself for this scene as I've jerked off to it myself over twenty-five times and that's no lie. This has got to be one of the hottest fucks scenes I've ever witnessed. Damien is loving the abrasive, assertive tone and attitude that Cliff is using on him and it's turning Damien on something fierce. Damien's cock never goes soft from the time Cliff puts his cock in to the time Damien blows his load while Cliff is fucking him. They start out doggy-style with Cliff talking to Damien as he makes his entry. Damien starts his famous moaning as Cliff plunges deeper. Thirty seconds in and Damien is already moaning in ecstasy. He's about to get the fuck of his life and he's gonna love it the entire time. Cliff opens Damien up doggy-style banging his ass and getting it loosened up for the three ring fuck that is about to follow.<br />Damien's hard cock is swinging in the breeze and he's moaning like he's in heaven. Cliff is getting his wish of a hot young fuck and Damien is getting the Daddy he's wanted all along to manhandle his ass like never before. Damien is arching his back and slamming back into Cliff's cock to get it all. No lie troops, as I was watching the DVD and writing this description I had to jack off. It's just that fucking hot. You cannot watch this without your cock getting hard and you won't even have to touch yourself. Cliff puts Damien on his back and starts to pound his out nice and hard as Damien continues to moan and jerks his cock. A few times Damien says 'oh I'm gonna cum' and Cliff says 'don't cum yet I ain't done with you. I'll let you know when you can cum' Cliff intends to fuck this boy good and Damien is more than happy to be along for the ride. After he's railed Damien's ass missionary style, Cliff tells Damien to ride his cock. Damien hops on the horsey and does as he is told. The whole time he's bouncing on Cliff's dick Damien's cock is bouncing on Cliff's stomach.<br /><br />Cliff puts Damien in both positions with him facing him and facing away. Damien is riding the donkey like a kid at the fair and having twice as much fun. Cliff continues with the hot talk as he instructs his rider how to go to town. The final lap in the long journey between Cliff and Damien ends with Damien with his ass in the air and head on the floor as his back rests against the bed and Cliff banging straight down into his nicely fucked hole.<br /><br />This is where Cliff allows his boy to cum and Damien blows a huge load all over his chest and face and Cliff continues his banging exercise from above. Then Cliff throws Damien back in the missionary position and goes for his load. Damien's face and chest is still fresh with his own hot load as Cliff begins the final run. Damien gets hard again, troops for the finale as Cliff bangs his ass one good last time. Cliff blows his load all over Damien's chest mixing his jizz with Damien's load and walks off the set.<br />Damien's cock is still jumpin' and yours will be too.",
  "models": [
    {
      "name": "Cliff",
      "person_id": 35062
    },
    {
      "name": "Damien",
      "person_id": 35071
    }
  ],
  "release_date": "2005-12-20",
  "scene_id": 69987,
  "series": "MIA: Men In Action 3",
  "tags": [
    "Gay"
  ],
  "title": "Cliff & Damien"
}