{
  "collections": [
    "Active Duty"
  ],
  "description": "Chaz And Clint Get More Than ComfortableThe DVD kicks off with Chaz and Clint in bed side-by-side, shooting the shit. I tell Chaz, 'You're bad!' and he says, 'I'm bad' points at Clint 'and he's a virgin and I'm gonna pop his cherry.' Chaz is sporting his t-shirt that says 'Friend With Privileges' and it's going to hold true for Clint tonight. There's some really great dialogue in the beginning between me and these two studs. Chaz is such a funny guy as he proclaims himself the 'Cum dumpster' and keeps the conversation flowing with some very funny commentary. They've just finished a duo LIVE Show together just moments before but you'd never know they'd just came as the action begins to unfold with a hot kiss between the two and some hot nipple licking action. Clint gives Chaz' head a soft, tender rub and the two go into another kiss. The two continue with the foreplay a bit then start moving into the serious action. Clint's body is so lean and cut. Chaz...we'll he's just gorgeous.The Cocks Are Out And It's Off To The RacesChaz and Clint are soon sporting wood and complimenting each other on their nice cocks. They start out with a little hand action, stroking each other and getting a feel for the other's size. The pants come off and it isn't long before Chaz is between Clint's legs woofin' down his nice, hard cock. Chaz must be doing a superb job because Clint is really getting into this blowjob as Chaz rubs his chest and works his cock, deep-throating and slurping and sucking his balls. Chaz gives Clint's cock a taste of the other side works his cock good. Clint looks so hot just laying back enjoying his buddies hot mouth. The deep-throating action that Chaz is showing Clint's long cock is impressive.It's Sixty-Nine TimeAfter Chaz has worked Clint's cock up to a nice hard-on the two move into the sixty-nine position and Clint works Chaz' cock as Chaz works his. Chaz is extra hungry tonight as he moves fast and hard on Clint's cock. Clint gives Chaz' cock a slow suck, not missing a spot on that wonderfully large head. This is some great sixty-nine action as the two hot boys go at it for awhile, giving each other deep, good head. Chaz instructs Clint a few times but Clint is doing fine on his own.Ass Eating At Its FinestChaz gets Clint on his hands and knee's and begins licking Clint's virgin hole. Chaz is very vocal and talks to his buddy while he licks his ass. Clint is moaning like he's never had anything feel so good. Clint continues to jerk his cock as his ass is being orally serviced. Chaz licks every inch of Clint's hole, not missing a spot as he slaps Clint's cheeks and spreads them further apart. Clint gets even more talkative and begins telling Chaz how to eat it. Clint grabs the headboard and hangs on for the ride, arching his back and really enjoying the experience of his buddies wet tongue. 'Work that tongue' Clint tells Chaz in between 'oh my God's' Chaz begins smacking Clint's ass again and Clint says 'smack it harder don't be a pussy' Chaz asks Clint if he wants a finger in his ass and Clint says yes. His cheeks are read from the slapping and his ass is wet and now Chaz fingers him good eventually putting two fingers deep in Clint's tight ass. Clint starts moaning as Chaz fingers and licks his ass at the same time.Clint bends Chaz over and begins returning the favor as Chaz keeps the dirty talk going. Clint might be new to this, but he's catching on quick as he tongues and eats Chaz' ass as good as he got. All the while Chaz is moaning and talking dirty to his ass eater, looking back as he talks to Clint. Chaz starts shaking his ass around to take full advantage of Clint's wet tongue. Before long Chaz can't take the teasing and has to have his ass plowed by Clint. 'Enough of that ass-licking how about you fuck me' Chaz says and Clint is more than willing to comply with the wish.Clint Fucks Chaz Like Any Horny Soldier WouldChaz is a horny devil and now Clint is just as horny as him. Clint begins plowing his cock slowly in and out of Chaz' hungry ass. The angles and close-ups are excellent in this scene as Cole gets right in there and captures what it would feel like if you're face were right beneath the action. Chaz is really into the hot cock in his ass and talks to his fucker the whole way through, coaxing him to fuck him harder, deeper, longer. Clint pulls Chaz' hair as he rams him deeper and deeper. Chaz bites his wrist and grits his teeth. Chaz tells Clint, 'do me like I'm a cum dumpster' and Clint does. The position changes and Clint puts Chaz on his back and begins to long strock his hot hole. Clint fucks him good and hard in this position for as long as he did in the last then pulls out and blows his hot load. Chaz holds his ankles back and takes the hot jizz all over his open hole.Chaz Get's His Revenge On Clint's Virgin AssThe table turn and it's Clint's turn to take some cock up his ass. Chaz works it in slow as Clint moans and yells. But once Chaz is in, Clint takes a fucking as good as anyone. He's clearly in pain at the beginning but it isn't long before he's getting into it. He gets on his back and Chaz begins plowing into him that way for a bit as he holds Clints feet high above him. Chaz flips him over on his side and begins to plow him while Clint lays on his side. Clint is taking it like a champ now and talking back to Chaz as Chaz talks shit to him. The final position is a truly hot one as Chaz puts Clint's head on the floor with his back against the side of the bed and stands over him in such a way so that Clint can look up and see Chaz' ass and cock while Chaz plows down into him. This is a very hot sight to see. Clint is getting a full view of his ass being railed and Chaz is able to go even deeper inside him. Chaz finally loses it and unloads a massive wad all over Clint's hole.",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Clint",
      "person_id": 35063
    }
  ],
  "release_date": "2005-10-30",
  "scene_id": 69980,
  "tags": [
    "Gay"
  ],
  "title": "Chaz & Clint"
}