{
  "collections": [
    "Active Duty"
  ],
  "description": "Trevor Has a Hard-On ... And So Does Cole And Hoss ... As soon as the camera comes on I tell Trevor he's been bitching for the last thirty minutes about having a hard cock. I challenge him to show it off for us, and sure enough he pulls out that nice, long hard cock and shows it off like only Trevor can. But wait, Cole has a hard cock too and so does Hoss. These three hot men sitting side-by-side with big hard cocks is a sight to behold. Trevor and Cole compare cocks to find that there isn't much difference except for Cole being just a bit thicker. But ol' Hoss is right up there with them. He always has such a rock hard cock. They take off their socks and show off their feet for all you feet lovers. It isn't long before they all have their hands full of hard cock and it's not their own. They are stroking each other and getting things going. The clothes come off and I zoom in on Tony and Colin who have been sitting on the other couch watching Hoss, Trevor and Cole. Colin And Tony Show Off Their Asses ...I get Tony and Colin to show off their beautiful asses for Hoss, Trevor and Cole. I ask the other three guys what we are gonna do with those nice asses and Trevor speaks up first 'We are going to destroy them' and Cole and Hoss follow Trevor's suggestion. Tony and Colin are sporting some mighty fine asses and you get to see them show them off really well in this shot. The Cocksucking Begins ...Trevor starts sucking on Cole while Cole sucks on Hoss. Hoss grabs hold of Cole's cock and feeds it to Trevor. Cole tells Hoss to help out but Hoss says Trevor seems to have it. So I get Colin to come over and give Hoss' mouth a good working over. Tony gets down on Hoss while Hoss sucks Colin and Trevor continues to make love to Cole's fat cock. Trevor and Colin switch places and Hoss starts in on Trevor's huge rod while Colin gets him some of Cole's. Cole starts telling Colin to see how far down he can go and Colin gives it the old Army try. He's handling that cock well while Hoss handles Trevor and Tony handles Hoss. It's a cocksucking fiesta, troops and you're right there to catch it all. Colin and Cole get in a sixty-nine while Hoss, Tony and Trevor keep the pace on their side. Hoss is loving Trevor's big cock and he's loving the head Tony is dishing out. Colin's Ass Become's The Focus ...What a hot fucking ass to focus on. Colin sports about one of the prettiest round asses I think I have ever seen and from the turn things take I'd tend to think all the guys agree with me. Cole starts fingering Colin while Hoss helps spread his cheeks out. Trevor is standing by stroking his cock next to Colin's ass. Hoss tells Cole to find Colin's prostate while he and Trevor stand on either side of Colin's ass stroking their meat. Hoss starts slappin his cock on Colin's ass while Trevor stands over Colin's back and lets Tony suck his huge cock. Colin is still chowing down on Cole's hard cock while the boys admire his fine soon to be fucked ass. Tony is swallowing Trevor whole while Colin does the same to Cole. Colin starts fingering Cole's ass to prepare it for the fucking that Trevor is going to give it later on. Cole Does The Honor And Fucks Colin ...It takes awhile, but Colin finally gives in and Cole takes his tight ass to new levels. The other boys stand by and cheer Colin on. Hoss and Trevor tried first to break the seal but Cole is doing the job right. He's patient with his fuckees and he's taking his sweet time with Colin and getting him loosened up right. Colin shakes around a bit trying to wiggle the huge cock in, but it's gonna take some serious pushing to break this seal. It's so fucking hot to watch this cutie give it his all in trying to take Cole. Once Cole is finally in Colin gives out the sweetest, sexiest moans while he sucks on Trevor. Cole is long stroking Colin's ass by now and Colin is sweating. The moans alone are enough to send you over the edge as Colin takes it like a champ. The other boys tell Colin how to suck Trevor's cock and lick his nuts while Cole bangs him hard from behind. Cole stand on the couch over Colin for leverage and gets him good. Colin is sucking Trevor good while taking his fucking from Cole and finally yells out to Cole...'it's your turn bitch'. Colin Tells Cole He Has To Take Trevor's Cock In His Ass While Hoss Fucks Tony ...Colin gets in front of Cole and yells in his face for him to take Trevor's cock while Trevor makes his entry into Cole from behind. Hoss saddles Tony up and begins to fuck him hard while Trevor fucks Cole and Colin Feeds Cole his cock. The double whammy fuck-a-thon is on, troops. Cole is stroking his hard cock while Trevor long strokes his ass from behind. Cole's huge cock is ready to explode but not until Trevor fucks him for a while. Trevor is going all the way in all the way out giving every inch of his huge cock to Cole's hungry ass. Hoss is tearing Tony's ass apart and Tony is loving every second of it. Colin is moving back and forth between Tony and Cole's hot mouths getting his cock worked over by the two horny fuckees. Hoss blows his load all over Tony's back first. And what a huge fucking load it is. Tony's back is soaked while he strokes out his on huge fucking load all over the couch. Next up it's Cole blowing his huge load all over the couch as Trevor continues to plow him from behind. Colin has settled on Cole's hot mouth to deliver his load. He blows his load in Cole's mouth and Cole spits the load back onto Colin's cock. Trevor ends out the five load fiesta with his huge wad all over Cole's ass. There's cum all over the place. You could have filled a quart jar with it all I'm sure.",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Trevor",
      "person_id": 35160
    },
    {
      "name": "Colin",
      "person_id": 35064
    },
    {
      "name": "Hoss",
      "person_id": 35088
    },
    {
      "name": "Tony",
      "person_id": 35157
    }
  ],
  "release_date": "2005-11-30",
  "scene_id": 69985,
  "series": "Fire in the Hole",
  "tags": [
    "Gay"
  ],
  "title": "Cole, Colin, Hoss, Tony & Trevor"
}