{
  "collections": [
    "Active Duty"
  ],
  "description": "Ken And Doc Teach Damien A Thing (Or Two) About Working Out<br />Cole sets up the scene in the garage with a twist in mind. Doc and Ken have their own twist in mind as they start teaching Damien while they play with their hot cocks as their 'boy' tries to show them he's a man. Well, at least tonight he's their man. Doc and Ken are workin' up hard-ons as they watch Damien try to please them. Doc and Ken show off their muscles a little as they teach Damien to curl. After a good work out and Ken and Doc eyeing their little soldierÉthey head to the showers where Ken and Doc hop in the shower for some 'big boy' fun as Damien soaks in the tub watching them.<br /><br />Damien Wants To Play With The Big Boys<br />Ken and Doc are having a grand ol' time in the shower playing with each other, stroking their cocks with body wash. Damien is watching intently, eyeing everything they do as he starts strokin' his cock in the tub. They're talking about how cute Damien is among themselves and Damien starts getting hard. Doc and Ken are hard as bricks as they continue to enjoy the water. Doc starts sucking Ken while Damien watches. Doc is enjoyin' Ken's cock and doing a hell of a job on it. Doc is buffin' that cock like a new pick-up truck. The position switches and Ken starts slobbin' on Doc's knob as Damien keeps watching. Finally Damien can't take it anymore and he gets out of the tub and sits on the ledge jerkin' his cock to Doc and Ken. (Our editor must have wanted to see Damien's grand exit twice cause he did an instant replay! Way to Go! LOL). Just rememberÉwe're 'amateur.' So Damien has gotten on the tub ledge twice and he's still stroking. Finally he wants to tease the boys with a little more than cocksucking so he gets on his hands and knees showing them his ass as he moves it around in slow cirlcles, teasing them. <br /><br />Damien Joins The Team And It's A Score for Everybody<br />Ken and Doc can't resist such a pretty little ass for more than two seconds and they rush over to Damien. Ken starts eating Damien's ass to get it ready for the games. Doc starts out rubbing his cock up and down Ken's crack while Ken rubs his tongue up and down Damien's. Damien's stroking his cock and tellin' Ken how good it feels. Doc comes around and gets in the tub and starts feeding his cock to Damien as Ken keeps chowing down. Ken's getting hot and bothered by this perfect round ass and decides it's time to fuck it. Damien's hard dick swings back and forth as the dominant Ken plows him hard from behind. He's moaning that trademark moan as he's manhandled by yet another Active Duty stud. We've come to realize that what turns Damien on the most is being dominated really good and Ken's doing a fine job of it. Ken's tearing that sweet ass apart and Damien's lovin' every minute of it as he chows down on Doc's cock. <br /><br />Damien Rides All The Rides At The Fair That Day<br />Doc and Ken switch up as Doc plows Damien's freshly fucked ass hard and long and Ken instructs Damien on how to please his cock with his hot little mouth. Damien's hard cock is still swinging in the breeze as he moans louder and louder. Doc fucks Damien for a long time, giving him a really good plowing. They switch back up and Damien rides Ken's cock while Ken sits on the step of the tub. Damien is pleasing himself now as he jerks his cock to Ken's rythmn. Damien sucks Doc's cock in unison and it's a dance ya'll. Doc starts stroking Damien's cock and says 'I want to see how that feels in my ass.' <br /><br />Doc Rides One Too<br />Damien starts out slow giving his long cock to Doc's hungry hole. Doc services Ken's cock in the front while Damien mans the backdoor. Damien is long-stroking Doc's hole. Ken comes out of the tub and starts fucking Damien's face while Damien plows Doc's tight ass. The looks on Doc's face are priceless. Damien fucks and sucks without missing a beat. The hot ass and the hard cock have gotten the best of him and he pulls out and blows his load on Doc's ass. Damien is waiting on Ken's load and Doc comes out from beneath and the two of them start sharing Ken's hard cock and sucking it as Doc jerks his own hard cock. Doc is getting off on sucking Ken's hot cock and blows his own load first. Ken blows next and right in Doc's mouth. It runs down Doc's chin as he spits it back at Ken's cock. It's shower time and the boys chat it up a little with Cole as the lights go out at the OK Corral. Ya'll come back now, ya hear?",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Doc",
      "person_id": 35079
    },
    {
      "name": "Ken",
      "person_id": 35104
    }
  ],
  "release_date": "2005-10-30",
  "scene_id": 69983,
  "series": "Soldier's Ball: Bareback Two-Step",
  "tags": [
    "Gay"
  ],
  "title": "Damien, Doc & Ken"
}