{
  "collections": [
    "Active Duty"
  ],
  "description": "The Wide Angle Lens is BrokeÉBut Cole Isn'tLooking back over some of the videos that Cole and I have done together, I realize what an awesome team he and I make. Always seeming to know just what the other is thinking. The more attention I pay to the two of us interacting on video, the more I recognize this. This particular night proves to be no exception as we loosen Ken up and let him conduct the band. The beat moves on quickly as we all shoot the shit and I assure Ken that I have 'no idea who owns this companyÉthey just pay me to corrupt people.' Ken quickly loosens up and I leave he and Cole to chat while I make us all a drink. When I return I coax Ken into feeling Cole's huge cock just to get a feel for it. Ken grabs on and doesn't let go all too soon. I get Cole on his knee's beside Ken and ask Ken to try double stroking that big cock. Cole starts stroking Ken in return. Ken says he got a lot of experience jacking cock overseas. I asked if it was his or other guys. Of course it was his. I asked Ken if he saw any hot guys overseas and he's like 'no' I told Cole I thought he was lying to us. I ask Cole to get on top of Ken and stroke their cock's together. Johnny Cash is singin' in the background with me and the beat moves on. Ken And Cole Do The Bareback Two-StepCole goes fom stroking their cocks in unison to rubbing his ass crack across Ken's cockÉteasin' Ken for what he's about to get next. I get Ken to reach back and grab Cole's cheeks while Cole strokes Ken's shaft with the crack of his ass. I tell Cole to give Ken 'a little taste of that nice ass' and Cole and I banter back and forth. Cole swears Ken and I were scammin' this whole thing and that it's all planned out. But in fact, it isn't. Cole begins to slowly ride Ken's naked cock and finally works it all the way in. Cole starts riding the horsey up and down. We've roped this cowboy now it's time to bring him home. We give Ken the reins and let him fuck Cole from behind. Ken likes the control and takes to that ass like a well-worn saddle. Cole arches the back and takes the fucking good. Cole sounds like a few of his bottom-boys have from time to time at first but once it's inÉhe's into it. Ken is bangin' that ass like he fucked that chick last night and Cole is yellin' like she did too (LOL). Ken puts Cole on his back and starts railing his ass good as he strokes Cole's cock. Cole is licking his lips and moaning. Ken flips him back over on his hands and knees and continues to slam him good. By the time Ken gets done, Cole is breathing like he's in lamaze class. Cole flips over for the big shoot-out and much to all our surprise takes Ken's huge load all in his mouth. Cole Takes The LeadÉAnd Ken's Virginity ÉAnd Leaves His Load In KenKen's ready for the next step in this rodeo and bends over for King Cole to give it to him good and hard. To my surprise Ken is doing a much better job at handling that big cock than I thought he would. He's moaning and whinin' a little but not as much as most that run up on Cole's cock for the first time. Ken is taking his fucking like the man he is. It's very hot to watch while you know that it's his pride that won't let him moan as bad as a bitchÉbut he's not far off. Cole opens him up nicely and Ken does a hell of a job taking it. Cole starts plowing down, moving his cock all around and working it like a part-time job. Ken's punchin' the clock on this shift though as he really starts getting into the serious fucking he's getting. Cole is 'long-strokin'' it. All the way in, all the way out like a piston in a revved up engine. Cole's railing his ass good. I bet Cole's pubic area was bruised from the pounding. Cole says he's ready to blow and I ask Ken where he wants him to blowÉ'in my ass' comes the grunt. I ask him again and he says 'IN' so Cole does as he's asked and plows out a huge load deep in Ken's ass. Ken is just basking in the glow as he feels Cole's hot load shoot in his well-fucked ass. Cole's not done and he goes back in for another load. This time he shoots it all in Ken's crack for us to see as he spreads it out.",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Ken",
      "person_id": 35104
    }
  ],
  "release_date": "2005-10-30",
  "scene_id": 69982,
  "tags": [
    "Gay"
  ],
  "title": "Cole & Ken"
}