{
  "collections": [
    "Active Duty"
  ],
  "description": "Hayden Comes Over With Matt For Some SurprisesI get Hayden in the bedroom alone and chat him up to get him primed for the threeway that is about to unfold. Hayden pulls his already hard cock out and starts stroking it as I leave the room to chat Cole and Matt up for a bit. While I'm away you get to watch Hayden masterfully handle his extremely large cock and do a dance with the camera with his sexy eyes. This guy is beautiful and he's horned up and ready to go. I can't tell you when I've seen a more beautiful big cock attached to such a cute young thing. It's been awhile, but he's here and he's ready. Cole and Matt join the fun and get on the bed with Hayden. Cole jumps in the middle and Hayden looks happy with his company. Hayden takes off his shirt to reveal his gorgeous upper body and Cole quickly follows suit. Matt and Cole are rivals from the start and constantly razz each other with snide remarks but laughingly so. Hayden is all smiles as Cole chats him up about what is about to happen. Cole is next to pull out his cock and Hayden immediately starts comparing as he gazes at Cole's cock then at his. There isn't that much difference.Let's Suck Some Cock After some chit-chat and cock stroking the boys get positioned for some oral exams. Matt starts out first sucking Hayden while Cole takes care of Matt. After a couple of minutes they put Hayden in the middle where he'll earn his cocksuckers badge today for some awesome oral expertise. Matt and Cole take each side of Haydens face and position their cocks for him to share. And boy does he ever share. Sucking and slurping like he just got two popsicles on a hot summers day. He's going back and forth trying to decide which flavor he likes best and by the looks of it he prefers a lot of both. His huge, hard cock throbs as he sucks the two big cocks in front of him. After he's tried both cocks on for size the boys switch things up a little and Cole strattles Haydens face and fucks it while Matt eats Cole's ass and jerks Haydens cock in unison. Matt strokes his cock together with Hayden's, grabbing both cocks in one hand together and stroking them. Cole switches postions with Matt and does the same, comparing the two huge cocks together shows little sign of difference as Hayden sucks on Matt's cock. Cole gets up and let's Matt suck his cock while Hayden continues to work Matt's. It isn't long before the scene switches again with Matt eating Hayden's ass while Hayden sucks Cole's rod. Hayden Takes His First Lesson In Being Fucked Long and Hard Matt is eating his ass while Hayden continues to suck Cole's cock. Meanwhile both Cole's cock and Haydens ass are getting well prepped for the next step. Matt is really eating that ass good as he reaches under and plays with Hayden's rock hard cock. Hayden is already learning to arch his back to get the best of this action as he continues sucking Cole. The time has come to make the insertion and Cole gets Hayden on his hands and knees with back arched and begins the entry. Hayden is tense and nervous at first and it takes some doing to get it in, but Cole is the man for the job when it comes to newbies and he takes his time with Hayden to do it right. Cole finally gets in and Hayden isn't sure what he thinks about all that meat in his ass, but he's not complaining as he tries his best to take it all. Matt is helping Hayden through the 'break-in' process and things start moving along. Matt gets under Hayden and sucks his hard cock while Cole does the plowing. Hayden Rides The Horsey, Too They switch positions and let Hayden ride Cole's cock while he sucks Matt's dick and he's doing a great job at both. Hayden leans back putting his hands on Cole's knees and rides the cock like a champ. You'd imagine that Hayden must have been raised on a farm cause he's riding this horse like's he's ridden before. It's Matt's Turn They switch things up and Matt assumes the position as Hayden makes the plunge into Matt's tight ass while Matt sucks Cole's cock and jerks his own. Hayden is getting some revenge as he fucks Matt's ass as hard as Cole fucked his. Matt's enjoying the huge cock in his mouth and the one in his ass. Hayden's balls deep in Matt's ass and Cole gives his cock to Hayden to suck on while he plows Matt deep. Hayden is fucking and sucking to his own rythmn. Cole tells Matt 'Arch your back bitch' and the trio continue with the status quo. They flip Matt onto his back and Hayden continues to plow him deep while Cole sits on his face and makes him eat his ass. This is a hot scene as it continues to unfold. But it's not done yet. Cole takes the wheel and starts fucking Matt as Hayden feeds him his cock. Matt is stroking his cock and is the first to blow his wad with Cole's cock deep inside his ass. Hayden goes next all over Matt's face and Cole follows with the final blast off. That's a wrap to this dance, folks.",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Matt",
      "person_id": 35419
    },
    {
      "name": "Hayden",
      "person_id": 35423
    }
  ],
  "release_date": "2005-12-15",
  "scene_id": 70002,
  "series": "Soldier's Ball 2:  Bareback Promenade",
  "tags": [
    "Gay"
  ],
  "title": "Cole, Hayden & Matt"
}