{
  "collections": [
    "Active Duty"
  ],
  "description": "Cole And Chaz Bring Elijah Even Further Along<br />Cole and Chaz work well together and Chaz is always stirring up the shit. Today he's not anything other than his usual self as he talks shit and slaps high five's with Cole about how they're gonna break the newbie in. Elijah doesn't scare very easily though eventhough Chaz and Cole are talking about 'the ball gag'. I take things a bit further and pull out the leather contraption. Elijah says it looks like a super hero's outfit and Chaz quickly corrects him and says 'More like the super slut costume.' It's evident from the very beginning that we've got ourselves a fun threesome underway. Chaz starts out licking Elijah's left nipple while Cole tweeks his right.<br /><br />Leave The Boys To Their Own Devices And See What Happens<br />I leave the room for a few and leave Cole and Chaz in charge of 'scaring up the newbie.' They begin by checking out each others packages and getting things ready. Cole and Chaz have a sword fight before they place Elijah between them to suck on their hard cocks. Elijah opts for the smaller of the two first and takes Chaz's cock in his mouth and starts working it over good as he strokes his own cock. He turns and takes on Cole's as Cole cajole's him to go deeper and he does.] Chaz goes down on Elijah while Elijah works Cole's cock and tries to find the right fit. Cole slaps Chaz's ass while he sucks on Elijah and Elijah continues to work Cole's cock. They switch things up a bit and Cole sucks Elijah while Elijah sucks Chaz. Chaz talks Elijah into deep throating his fat cock and Elijah takes to the new lesson well. Things switch up yet again and Cole stands over Elijah and feeds him his huge meat as Chaz sucks Elijah and strokes himself. Elijah is taking all of Cole's cock by now and is doing a mighty impressive cocksucking. They have Elijah straddle Chaz's face as Chaz licks and sucks Elijah's balls while Elijah continues to manhandle the huge cock in front of him. We get some 'cole cam' moments here as Cole films the action from his point of view.<br /><br />The Position Changes But The Action Stays Hot<br />They bring Elijah down on all fours as he positions himself between Cole's legs for easy access to the fat cock he's learned to suck so well. Chaz gets behind Elijah and begins tongueing his ass as he reaches underneath and strokes Elijah's cock. That's what we call a 'rusty trumbone'. Chaz isn't shy about eating an ass and his eating of Elijah's ass proves as intense as any he's ever performed. I get some really good close up shots of Chaz's tongue massaging Elijah's hole. Chaz spreads the cheeks out wider to get a better taste as he tongue fucks Elijah's fresh hole. Meanwhile, Elijah is now making sweet love to Cole's rod as he feels the wonderful sensation of a tongue deep in his hole.<br /><br />Time To Fuck The Newbie<br />Chaz suits up and gets ready for the plunge he's about to make into Elijah's boypussy as Elijah continues to lick and suck on Cole. Once in, Chaz starts out slow giving Elijah long, deep strokes. Cole says Elijah sucks a better cock when he's got a cock in his ass. Chaz takes Cole's foot and starts sucking his toes while he bangs Elijah's ass. Cole reaches up and helps spread Elijah's cheeks apart and he and Cole rub and tug on one another. Chaz keeps fucking Elijah deep as Cole and Chaz manhandle Elijah. They move him onto his back as Cole straddles Elijah's face and Chaz keeps fucking his ass. Cole stands up to feed his cock to Chaz while Chaz continues the pounding. Cole grabs Chaz's throat while Chaz sucks his cock. These two like to get rough with one another. The position changes once more with Cole straddling Elijah's face and fucking it as if he were doing a push up while Chaz decides to eat Cole's ass from behind as he keeps fucking Elijah.<br /><br />King Cole Takes The Chariot For A Ride<br />Cole jumps in where Chaz left off and begins railing the freshly fucked ass as Chaz postions himself over Elijah, squatting down so Elijah can eat his ass. Chaz stands up and feeds his cock to Cole as Cole continues banging Elijah's hole. Cole is going balls deep into Elijah's ass and Elijah aint complaining at all. Chaz goes back to feeding Elijah while he's being fucked. He's cramming his cock in Elijah's mouth as Cole crams his in Elijah's ass. King Cole is grunting as he pounds the newbie's hole. Cole gets Elijah on his hands and knees and starts giving it to him hard. Chaz puts a cock in Elijah's mouth to shut him up. Elijah is screaming his head off as Cole bangs him balls deep for a long while. Even Chaz's cock can't stop all this moaning. He's yelling out Cole's name as Chaz gets ready to blow a load all over his face. Elijah is licking out his tongue in anticipation of the hot load as Chaz works it up. Chaz shoots a huge load all over Elijah's face as Elijah continues to moan loudly. Cole's still in the rear pounding away and building up the next load that's gonna go all over Elijah's back. Cole shoots it and rubs it all over Elijah's back as Chaz kisses Elijah. The three kick back on the bed as Elijah strokes out his own huge load. Chaz and Cole rub his nice balls as he explodes. Thanks for playin'!",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Elijah",
      "person_id": 35081
    }
  ],
  "release_date": "2006-05-22",
  "scene_id": 70008,
  "series": "Rear Gunners 3",
  "tags": [
    "Gay"
  ],
  "title": "Chaz, Cole & Elijah"
}