{
  "collections": [
    "Active Duty"
  ],
  "description": "The Wide Angle Lens is BrokeÉBut Cole Isn'tIt all starts out with 'my wide angle lens is broke' and from there it's on. Cole and I have talked Ty into trying something new. We shoot the shit back and forth about some very interesting stuff and we find the two guys in a bidding war for something they both want. In the midst of the bartering the clothes come off and the cocks get hard. Things are headed in the right direction. Cole starts out sucking Ty and getting him comfortable. Ty has agreed to bottom and the big entry is just around the corner. But not before Cole works Ty's cock over with his hot mouth first for awhile. Cole is sucking and stroking Ty's hard cock and doing a damn good job of keeping the newbie interested and horny. Ty is enjoying this oral exam as he throws his head back and moans. His facial expressions say all is well and Cole continues working on him. I don't think I've ever seen Cole this into sucking a new recruits cock before. Cole takes his spit and starts lubing up Ty's hot ass, getting it ready for the pounding in its near future. Ty responds well to the finger while Cole continues the oral service while he works his middle finger deep into Ty's hole. It's Time For Ty To Ride The Horsey Cole stops the servicing and tells Ty it's time to ride his massive meat. Ty (in a slight daze at first) comes to and does as he's told. He's working the huge monster in as best he can and Cole is giving him a hand and guiding it in. Ty grabs the headboard in front of him and takes Cole's continuos deep plunges as he thrust up and deep into Ty's ass. Ty's got a nice ass and prime for the fucking somewhere in the heat of the moment and his animalistic lust his virginity disappears as a new road is paved for his future. He's taking the huge cock like a true weekend warrior all he's missing is the face paint to hide his excitement. He's moaning his head off and finally lays flat on his stomach while Cole continues his plunging into no man's territory. Cole is wearing this boy out to the point that our new recruit calls mercy a few times as he nears exhaustion. But me (nor Cole) give up that easy. On Your Knees Soldier Cole flips Ty onto his hands and knees and continues ramming him good and hard. Cole goes ball deep and Ty starts shaking from head to toe. He's shaking from pure excitement and pleasure I'm sure or just plain pride that he's taken this cock good for his first time. He's grabbin' his cock and balls and moaning like the bitch he's always dreamed of being. Cole flips him over on his back, pulls him to the edge of the bed, throws Ty's legs over his shoulders and continues the railing. Ty's perfect balls form a work of art as his half hard cock beats his stomach and Cole continues to ravage his now non-virgin ass. Ty starts pounding his cock as he moans loud with Cole doing his best to slam every inch into him. I pull his right leg back further and Ty takes it all. He's holding Cole's thighs but he aint pushing him back. Cole flips Ty back over and onto his knees again and continues to fuck the sense out of him. Ty lays on his stomach again for a bit to catch his breath while Cole doesn't miss a stroke. Cole's getting all the way in that ass now and Ty is taking it like a man. I'm egging him on all the while. It Ain't Done Yet Cole pulls out and spreads Ty's cheeks apart to inspect the damage and decides 'oh it aint done yet' and goes back to plowing the newbies fresh fucked ass. He fucks him so hard that Ty ends up with his head between the bed and the nightstand almost like a steere stuck in the fence. The banging is so intense that a huge picture falls off the wall and slams onto the floor, hitting Cole in the foot and just nearly missing Ty's head. You see the camera step back as I refuse to shut down. Cole shakes it off without missing a beat and I blurt out 'we done broke a picture over this oneÉlet's get it all' and Cole keeps on fucking. He lays Ty on his side and goes in that way for awhile as Cole's knee holds Ty's leg in the air. Ty holds on to the headboard and weathers the beating his ass is taking. Cole puts Ty in more positions than a rubics cube and never misses a stroke. Once he's decided that he's fucked him good enough Cole pulls out and cums all over Ty's gapping hole, smearing it in as Ty's cum covered ass winks at the camera. Cole plays with his own load smearing it into Ty's ass as he takes the cum on his finger and shoves it in Ty's ass. Ty and Cole lay back on the bed as Ty smokes a cigarette and tries to summize what he just did. I summize it for him with a quick 'he 'bout fucked your brains out'. And that's a wrap.",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Ty",
      "person_id": 35164
    }
  ],
  "release_date": "2005-12-15",
  "scene_id": 70001,
  "tags": [
    "Gay"
  ],
  "title": "Cole & Ty"
}