{
  "collections": [
    "Active Duty"
  ],
  "description": "Dean and Elijah Get, Ahem, Acquainted<br />As many of you know from the Active Duty LIVE shows last week, Elijah has become a major player here at Active Duty. It's been a long time since I seen someone jump right in with both feet and become such an overnight hit with the fans. Elijah just has the perfect personality for porn and for all the attention. He simply loves it. I can't really say enough about the scamp, he's just magnificent. Elijah stands about 5'9' and weighs in at about 170 lbs. If his nice body and ass don't captivate you then his beautiful eyes, smile and sweet personality will. Dean sure seemed to take to our new little buddy in the first scene of Rear Gunners 3 where to two of them got down to some serious bathroom business.<br /><br />Things kick off with Elijah doing something he seems to love...giving massages and he starts out massaging Dean's perfect body as he both admires it and enjoys the freedom of touching it. Have you ever wondered how many 'straight' guys admire their buddies and maybe just sometimes that admiration creates fantasies in their head that they could never possibly act out for fear that such action would automatically make them gay or even worse, get their asses kicked? Well, I think Elijah has found his chance to act out such fantasies without the fear of someone judgmental watching. He's found a freedom here at Active Duty that I think is akin to Dean's same found freedom at Active Duty. Both guys are so in touch with themselves and so very comfortable with their sexuality and this scene gives them a chance to explore that freedom even more.<br /><br />Elijah slowly moves down every inch of Dean's back, massaging and rubbing as Dean clearly enjoys the rubdown. It isn't long before Elijah is discovering new territory with Dean's nice muscle butt. He slowly pulls down Dean's boxers and begins worshipping the nice ass on his new buddy as he rubs and kisses it ever so gently. Dean is beginning to get hard from all the attention and slowly turns around to give Elijah something to massage with his mouth instead of his hands. The two embrace in a hot kiss before taking things to the shower where Dean begins to explore and admire Elijah's body too. Dean washes Elijah's back and admires his nice ass under the guise of getting it clean. Elijah does the same to Dean in return as they begin to soap up and get all clean for the fun they are about to have. During the shower, someone discovers that the shower massager head is removable and Elijah has a great time giving Dean a warm water enema as Dean seems to thoroughly enjoy the attention to detail.<br /><br />Out Of The Shower And On To Business<br />Once they're all clean, Dean and Elijah find a comfortable spot in the bathroom to carry on with their bathroom business as Dean begins sucking Elijah's cock, giving him some of the best head he's ever had. Elijah is really getting into this attention as his eyes roll back in his head several times. Dean is using his skills to work the newbie well as he raises the new troopers legs in the air and begins a fantastic rimming job by spitting on Elijah's hole. Dean goes from his cock to his balls to his ass as if he's orchestrating a symphony of ass eating. 'How's that feel?' Dean teases, 'Does it tickle?' 'Mmm hmm' Elijah responds as he begins jerking his cock frantically to fully enjoy this new experience. Dean is sucking on Elijah's balls the way we all enjoy a good ball cleaning. Dean tells Elijah to bounce his balls on his face as Dean laps up the sweetness of this hot young recruit. It's time to test the waters so Dean puts a finger in Elijah's ass to.<br /><br />Elijah Wants To Eat Some Ass Too<br />Elijah isn't one to be greedy so he tells Dean he wants to eat his ass too. Dean positions himself over the ledge of the tub and spreads out his big, musclar long legs and gives Elijah plenty of room to get his fill. Elijah must have learned a move or two as he watched Dean because he's right in there playing ball in the big leagues as he eats Dean's ass as attentively as Dean ate his. Dean is talking to his ass eater and telling him how good his tongue feels in his hole and to get 'deeper in there' with your tongue. Dean grabs his head and and pulls him in deeper as he continues to tell Elijah how good it feels.<br /><br />'Put Your Cock In My Ass' Is What Elijah Says Next<br />After he's eaten Dean's ass good and gotten all horned up from Dean's nice attention to detail on his own cock and ass, Elijah wants more and what he wants is Dean's cock in his ass. Elijah is very outspoken so telling Dean his wishes comes easy for him. Dean's not one to shy away from the fun so he grants Elijah's wish and starts the insertion into Elijah's tight ass. Elijah grabs onto the tub to brace the hard ride that Dean's gonna give him as Dean begins his fast thrusting motions back and forth, in and out of Elijah's ass. 'How does that cock feel in your ass?' comes the question and 'Oh it feels so good' is the answer, 'Good cause I'm gonna keep fucking you' says Dean. Dean starts slappin' Elijah's ass as he fucks it good. At this point Elijah has almost fell in the tub, but he's still hanging on for the ride. More than 8 seconds has passed so he's a cowboy for life now. 'I don't care how uncomfortable you are...this feels good for me' says Dean. Elijah doesn't seem to mind, he's going with the thrusts and enjoying every second of it. They're talking shit to each other as Dean fucks the shit out of Elijah. All this pounding is making Dean's balls tighten as he gets ready to blow. He pulls out and blows a huge load all over Elijah's hot, open hole. What a hot sight.<br /><br />Dean Muscles Up And Gives His Ass To Elijah<br />Elijah mounts Dean in the same fashion that Dean mounted him. Dean is talkative today as he tells Elijah 'Yeah man..push my shit in. Fuck me good. The only thing bigger than that dick is my biceps' LOL He continues with 'Oh yeah...man I've missed this. Fuck me. Long stroke it. Work it good.' All this talk has Elijah and Dean both all worked up. Dean is taking this fucking like no other and Elijah gets ready to deliver the goo. He pulls out and finishes off on Dean's waiting ass and blows a huge wad. Dean comments on the warmth of man juice and Elijah says 'Look at that sweat.' I tell Elijah to lick the cum off of Dean's ass and he does so without the least hesitation. They finish up with some small talk and I ask Elijah if he's in love. 'I could be. But I'm more of a swinger.' Dean says, 'Swing my way.' and Elijah reminds him 'I already did.",
  "models": [
    {
      "name": "Dean",
      "person_id": 35074
    },
    {
      "name": "Elijah",
      "person_id": 35081
    }
  ],
  "release_date": "2006-05-22",
  "scene_id": 70007,
  "series": "Rear Gunners 3",
  "tags": [
    "Gay"
  ],
  "title": "Dean & Elijah"
}