{
  "collections": [
    "Active Duty"
  ],
  "description": "Dean, Chaz and JaggerDean, Chaz and Jagger kick off the first scene in Fire In The Hole 3. We joke around in the beginning as usual and get things geared up for the great scene. The three troopers start playing with their little soldiers and when I return they give a display of their hard ons. Jagger is the first to take a cock in his mouth as he goes down on Chaz's huge headed monster. Dean watches intently as he strokes himself. It looks like Jagger may have done this before. Ya think? Dean isn't gonna miss out on any of the fun so he gets on his knees beside his buddy Chaz and starts feeding him his hard meat. Dean's nice ass just teases the camera as a threeway suck-a-thon begins to take motion. The clothes come off to make things more comfortable and it's right back to business for these three. Jagger is licking and sucking Chaz while Chaz gives Dean some serious attention to detail as he sucks his cock and plays with his balls. Dean fucks Chaz's face good as Jagger manhandles the meat in his mouth. The boys are taking quite nicely to one another. Things take a turn and Jagger gets behind Dean to eat his beautiful ass as Dean starts sucking on Chaz's hard cock.Jagger Eats Dean's Ass and Preps It For A FuckJagger is eating away at Dean's delicious hole as Dean continues to slurp and suck on Chaz. Jagger isn't missing a spot with his ass eating technique as Dean moans from the feeling. All this attention has Dean sucking Chaz good and Chaz just throws his head back and moans as Dean gives him a supreme servicing. Dean sucks and licks his nipples while Jagger cleans his hole good. Dean is pushing back and fucking Jagger's tongue. Jagger fingers his own ass a little as he strokes his cock to get it ready for Dean's waiting hole. Dean and Chaz embrace in a french kiss to set the mood for the fuck. Jagger takes Dean from behind and Dean and Chaz have their own affair up front. Jagger is railing Dean's ass good and it isn't long before they switch positions with Dean on his back and Jagger giving him the fucking as Chaz squats over Dean's face and feeds him his ass. Dean is grabbing Jagger's biceps as he eats Chaz's sweet ass and this is a real mens threesome folks. This is how real men do it. Pay attention. You might learn something here. Chaz reaches back and holds the sole's of Dean's feet to make the plowing easier for Jagger. Dean plays with his own cock and balls as he takes his fucking from Jagger.Chaz Takes His Turn At Dean's Sweet AssDean and Chaz have sparks between them so it's only right that Chaz would take his turn on Dean's nice ass and he does. Jagger surrenders the guard and Chaz takes over. He's giving it to Dean good and Dean is loving it. The position switches and Dean returns to doggy-style formation as he sucks Jagger's hard cock while Chaz bangs him from behind. Chaz is loving the nice tight ass he's fucking and the threesome is in sync. Dean spits on Jagger's cock and gets dirty with the blowjob skills he's honing. With every thrust of Chaz's cock into his ass Dean comes forward on Jaggers cock. It's harmony here as the three continue to teach us all a thing or two. Jagger moves up and stands over Dean's back and begins to feed Chaz his cock as Dean takes the fucking he's getting. Chaz is cock hungry today as he goes wild on Jaggers cock while he fucks Dean's ass. Jagger is really liking this attention as he gets mouthy and talks dirty to Chaz. Jagger takes one more round of Dean sucking his cock before Dean tells him to get in position to get his ass eaten. Jagger obliges and bends over for Dean to work his magic as he takes Chaz in his mouth for the ride.Dean Eats Jagger's Ass and Fucks It GoodDean gives Jaggers ass some good loving with his tongue before going in for the plunge. Dean gets a little nasty in this scene as he spits on Jagger's hole and then uses the spit for lube. The insertion is slow and easy at first then bang, bang, bang it's on ya'll. Dean is banging Jagger good as Jagger tries to keep his composure and keep Chaz's cock in his mouth. Dean isn't letting up as he bangs away. Jagger is drooling away all over Chaz's cock Chaz moves in line behind Dean and preps for a fucking of Jagger's nice ass. 'Arch ya fuckin' back, bitch' comes my command as we treat Jagger like a bitch.Chaz Bangs Jagger's BrainsChaz takes the reins from Dean and begins his long, hard ride on Jagger's ass. Dean moves forward and takes care of the other hole as he fucks Jagger's mouth. Dean gets a little rough with Jagger as he grabs his head and fucks his face. Jagger has been put in 'bitch mode' by these two as he submits to their every request. He's good at being submissive as we begin to see in this scene. It isn't long before Chaz is ready to blow and he pulls out and does it all over Jagger's freshlyt fucked hole. He rubs the load all over Jagger's hole and in it just for good measure.Chaz Throws His Legs Behind His Elbows For Dean's EnjoymentDean saddles up as Chaz throws his legs behind his elbows like a gymnast and gets ready for Dean's cock inside him. Dean is hard as a brick and makes his entry slow and easy as usual. Chaz grunts and moans as he reaches down to spread his ass cheeks to make it easier for Dean to come inside. Chaz observes intently as Dean makes his descent into his sweet, tight hole. Dean takes it to the balls as he begins to play with Chaz's cock. 'Give it to me poppy you sexy beast' Chaz tells Dean. All the while Jagger is feeding Chaz his cock while Dean bangs his brains out. 'Spank my ass' Chaz tells Dean as Dean slaps his ass while fucking him. Jagger slaps Chaz in the face with his hard cock as Chaz keeps the dirty talk going. Dean can't handle much more of this hot ass before he blows his huge load all over Chaz's nuts and what a load it is. Dean's huge gush covers Chaz in cream and Jagger blows his load in Chaz's hungry mouth. Chaz then takes the huge load in his mouth and shares it with Dean in a kiss. Dean spits it back in Chaz's mouth. The trio ends things with some hot kisses and it's a wrap.",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Dean",
      "person_id": 35074
    },
    {
      "name": "Jagger",
      "person_id": 35093
    }
  ],
  "release_date": "2006-07-26",
  "scene_id": 70009,
  "tags": [
    "Gay"
  ],
  "title": "Chaz, Dean  & Jagger"
}