{
  "collections": [
    "Active Duty"
  ],
  "description": "Cole and Rico Shower Up For The ShowRico is a newbie that has decided to take the next step in this scene so I pair him up with King Cole who is the master of turning out the virgins. Later on Luke joins in but first Cole and Rico have some fun in the shower. The two fellows strip down for the camera and hop in the shower to clean up. Funny how hard ons always pop up in my shower and today is no exception. In minutes the two troopers are hard and ready. Cole takes a seat on the shower ledge and strokes his monster. Rico gets down on his knees to give him some help. Rico takes the King's cock in his mouth and starts learning the art of sucking a big cock. Play catch up here now ya'll. Don't you remember your first big cock? Cole takes the position and returns the favor to Rico as he sucks him good. Rico throws his head back and enjoys the extra special attention. Coel stands back up and starts feeding Rico again as he strokes Rico's cock while Rico sucks his. Rico is doing his best to manhandle the monster and he's doing a pretty satisfying job of it if Cole's huge hard on is any indication. They swtich back and forth sucking and stroking each other.In Walks Luke and Three Is CompanyLuke joins the guys in the shower and picks right up where the action is and starts sucking on Cole's huge cock. He then turns his attention to Rico's rod and gives it a round. Cole follows suite and Rico is getting some serious attention. Thre three of them horseplay in the shower and share blowjobs before moving on to getting Rico's ass fucked royally by King Cole's huge meat.Luke Helps Prepare Rico For The Huge Cock He's About To Take From ColeCole starts out trying to fuck Rico's ass but it's apparent that it's going to need some prepping before it can facilitate such a large missle so Luke takes the reins and warms him up for the monster cock that's coming next. Rico is swinging from Cole's cock as Luke opens his tight ass. Luke comments on how tight it is and how it better get opened up. Luke fucks him good and hard and Cole saddles up for the ride.Cole Brings Up The Rear and Tears It UpCole is in the saddle now as Rico begins to grunt and groan. Luke talks him through the process of doing something 'not natural' and Rico gives it his best. Cole is balls deep in seconds and Rico is trying hard to keep up with the pace of being plowed by such a huge rod. Cole is long stroking the tight newbies ass as Rico begs for more lube. Rico is begging to move on to the next scene but we're not quite ready to let him off the hook that fast. Cole opens this ass up good as we watch it all unfold. Cole is slamming Rico hard as Rico bites down on a wash cloth to keep from screaming.Things Move to the BedroomThe three fellows take their business to the bedroom where Luke starts out by sucking on Rico's cock. Cole moves up to feed Rico his cock and it's a buffet. Cole and Luke switch places as Cole sucks on Rico and Rico on Luke. Cole straddles Rico's face from above and fucks it good and long. Rico takes fine to this position as he tries his best to deep throat the monster.Luke Helps Rico Saddle Up to Take His Revenge On Cole's Ass'Come on down, Cole. You're the next contestant on fuck my ass' I say as Cole prepares to ride Rico's cock. The curve in Rico's cock makes that a little difficult so Cole gets in doggy style position.I Pass Out and the Boys Film the EndingI don't know what happened to me that day but I guess all the hot action got the best of me. Cole and Luke take turns manning the camera in my disappearance. Luke fucks Rico again while Rico sucks Cole's cock. It isn't long before we see Luke assume Rico's position as Rico takes the camera. Then it's back to Luke fucking Rico. He fucks himself up to a cumshot and blows his hot load all over Rico's nice bubble ass. Cole gets his cumshot by Rico sucking his cock. Cole slaps the cum all over Rico's face then Luke helps Rico get his nut as Cole films the finale. Rico blows his load on Luke's face and the curtain closes on this break-in session. The burglar has intruded, the goods have been stolen and Rico may never be the same.",
  "models": [
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Rico",
      "person_id": 35137
    }
  ],
  "release_date": "2006-07-26",
  "scene_id": 70010,
  "tags": [
    "Gay"
  ],
  "title": "Cole & Rico"
}