{
  "collections": [
    "Active Duty"
  ],
  "description": "Barrett Deploys... I've wanted to work with Barrett Long for some time now and who would have thought that he was out there wishing the same thing? As fate would have it, we would finally meet and the rest is captured on video. When I told Elijah what a huge cock he was packing, Elijah dismissed my warning by saying I was lying. He would soon change his tune when Barrett hauled out the massive meat. Colin is the first to grab it, but Elijah is the first to suck it. Elijah jumps all over it like white on rice and is working it over with his hot, wet mouth in no time. He's jerking and sucking the monster like it's nobody's business. The huge cock is responding well to Elijah's attention and it's as hard as a rock. Elijah invites Colin to share in the fun and the two of them take turns burping the big baby. Colin says it's as large as his fist and Elijah claims it's as large as his forearm. Colin takes hold and doesn't let go for a while. He's sucking the huge meat and licking all the way up and down the shaft. He's playing with the foreskin and enjoying it. Barrett (as straight as he may claim to be) is obviously enjoying having two other straight boys worshipping his huge cock. Colin and Elijah start sharing the cock together and there is plenty to go around. With Colin's fist wrapped around it tightly as he strokes it and both he and Elijah's mouth going to town on it, there's still room for at least two more. But Colin and Elijah aren't in such a sharing mood. Elijah snatches the cock back and gives it another round, trying his best to take it all the way down his throat. Colin sucks and works the balls while Elijah does his magic and Barrett just lays back and enjoys the ride. Colin takes the reins again as Elijah watches intently and jerks his own cock fast and hard. Elijah gets on his knees beside Barrett so Barrett can stroke his cock while Colin sucks Barrett's. Incoming Missile... 'So, you guys ready to get fucked?' comes Barrett's next question. Elijah jumps at the chance. Colin positions Elijah in front of him and starts eating his ass that is about to get torn apart by Barrett's huge missile. Colin strokes Barrett as he eats Elijah's hot ass. Colin is tonguing Elijah's ass deep and Barrett moves around to feed him his horse cock, slapping him in the face with it. He almost knocked poor Elijah out. Elijah is all over Barrett's huge meat with his mouth again. He's breathing hard and anticipating the fucking that huge monster is about to put on him. Elijah is doing a very good job of pleasing the fat meat and it's hard as it gets. 'You ready for that cock in your ass?' Barrett asks Elijah. 'Oh yeah.' comes Elijah's excited response. Breathe... Barrett instructs Elijah to breathe as he begins his descent down into Elijah's waiting ass. Barrett is quite the accomplished top, but he's met his match today in bottoms. Elijah doesn't say 'ouch, stop, don't' or any other four letter words except 'Fuck.' 'Don't worry' Colin tells Elijah, 'You get to do me next.' Barrett says 'Who me?' and Colin quickly says 'No way.' He tells Barrett that fucking him is gonna be Elijah's treat and Elijah quickly says 'No, this is my treat right here.' Barrett gets balls deep in Elijah's ass in a matter of a minute and from there, it's a raw dog fuck that Elijah won't soon forget. Colin puts his cock in Elijah's mouth to calm him like a baby with a pacifier. Barrett hits bottom in Elijah's ass and Elijah lets us know it. He's taking this twelve-inch cock like it's nobody's business and he's doing an outstanding job of it. Flip... They turn Elijah over on his back and Barrett goes back in deep while Elijah sucks Colin's cock to calm his nerves. Barrett fucks, Elijah sucks, and it's two for the money, honey. This is going off like a Saturday night dance and Elijah has his dance card full among other things. Barrett continues to slam balls deep into Elijah's open ass and Elijah tells him to 'Fuck that ass' as Elijah howls at the moon. Colin is strokin' Elijah as Elijah watches the huge cock plow his ass deep. Elijah has passed the pain part and he's feeling the pleasure. 'I want him to fucking cum all over me. Bust a big ol' load.' And Barrett does just like he's asked, shooting one of the biggest loads I think I've ever captured on video. He sprays like a fire hose, filling both Colin and Elijah's chests with a huge wad of cum each. They're drenched in a massive wad. Elijah Gets His Second Treat... Colin positions himself doggy style with his beautiful ass in the air for Elijah and Elijah moves in to take his prize. Elijah is always hard as a rock and he gives his hard cock to Colin good. Colin grins and bears it. Barrett moves in to get Colin's mouth on his cock and it's on like a pot of neck bones. Elijah is a good top, too and he's giving it to Colin good. Colin hasn't been fucked in awhile, but he's been practicing with 'Mr. Pinky' and the practice has paid off. After a good long fucking and some slow motion 'let me really feel this ass' action Elijah blows his huge, well-deserved load all over Colin's back. The three troopers get back on the bed with Barrett in the middle and I ask Barrett how he'd rate Elijah's cock-taking skills. He laughs and says 'pretty good for someone who does it every day' and we all laugh.",
  "models": [
    {
      "name": "Colin",
      "person_id": 35064
    },
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Barrett Long",
      "person_id": 35362
    }
  ],
  "release_date": "2006-09-08",
  "scene_id": 70020,
  "series": "Long Deployment",
  "tags": [
    "Gay"
  ],
  "title": "Barrett, Colin & Elijah"
}