{
  "collections": [
    "Active Duty"
  ],
  "description": "Colin, Kyler and Elijah... <br />The camera comes on and guess who's already playing with a hard cock? Elijah! This scamp is all about whatever is clever. Colin is glad to be part of the mix while Kyler kinda looks like a deer in the headlights. But he comes out of his pants sporting wood too, so maybe he's more ready than he looks. Things kick off with Colin manhandling the hard meat in front of him. Looks like he's hungry today as he really gets into servicing the hard cocks Kyler and Elijah have prepared for him. He stands the two up and gets on his knees between them to enjoy the meat. Elijah suggests that Colin take his pants off too so they turn him around and Elijah uses his teeth to undress Colin. Elijah starts working on Kyler's cock and shows the newbie some love. He and Colin share the love and Elijah talks shit about the nice cock and how he wants it in his ass. Together they service the cock like champs and Kyler follows their lead. Elijah lays down on the bed and takes Colin's cock in his mouth as Kyler tries to take Elijah. He gags a few times and isn't quite sure he's going to be able to make the grade, but Colin hops in and shows the newbie a few tricks. If you can't tell this is Kyler's first time with a cock in his mouth then you haven't been to cocksucking school anytime lately. Elijah is hard as a rock and he's in the 'zone' while the other boys just try to keep up. <br /><br />Elijah Wants To Eat Some Ass... <br />Elijah decides he wants to taste some hot ass and he gets Kyler and Colin up on their hands and knees, backs arched and begins to munch down on Colin's beautiful booty. We've all come to realize that asses don't get much better than Colin's and Elijah must have realized it, too. Elijah wants to see the boys finger themselves so they do. Elijah then enlists the help of Colin to lick the newbies hairy ass. Colin wants to taste Elijah though so Elijah gives him his turn. The three troopers get in a circle with Elijah eating Kyler's ass, Kyler eating Colin's ass and Colin eating Kyler's ass. <br /><br />Nipples And Armpits... <br />The three boys get into some serious nipple sucking and armpit licking action and explore the newness of it all. Elijah sucks on Colin while Kyler sucks Colin's nipples. Kyler moves down to eat Elijah's ass some more while Elijah sucks on Colin. Colin can't resist being center of attention so he moves down to really show Kyler how to eat a man's ass. Meanwhile Elijah sucks on Kyler. <br /><br />It's Time To Fuck... <br />Colin is the first to take on Elijah's ass. He moves in after eating it really good and says he has to take it first. Elijah has no problems with that suggestion and Colin goes in for the kill. He's balls deep in Elijah in no time flat and giving it to him good and hard. Meanwhile Elijah finds comfort in sucking on Kyler's rock hard cock while he takes his banging from Colin. Colin has Kyler stand over Elijah so he can suck on Kyler's cock some too. Colin is fucking while he's sucking and Elijah is cheering the whole thing on. Colin comes out and puts on another condom and starts fucking Elijah hard. Colin reaches underneath and gives Elijah a nice reach around as he strokes Elijah's hard cock and fucks his wet, hot ass. Up next is Colin's fuck. <br /><br />Elijah Fucks Colin Next... <br />After getting all sweaty Colin switches places with Elijah and gives his ass up to get fucked good and hard. Kyler feeds Colin his cock while Elijah rubs his cock up and down the beautiful crack of Colin's ass before he goes in deep. Elijah gets all the way in and Colin is sure feeling it. You can tell by the faces he's making. Colin is taking it like a champ in the second half. Elijah stand over Colin's ass and does his trademark fuck position as he stands flat-footed and plows Colin deep. There's no escaping for Colin now as Elijah mounts the pretty round as and bridles him. Elijah slaps Colin's ass while he fucks it hard. Colin starts begging like a little bitch for Elijah to stop. <br /><br />Time To Fuck The Newbie... <br />After Elijah fucks Colin good and hard it's time to fuck the newbie. Kyler assumes the position. It's a tough first round for Kyler as he tries hard to get used to this new feeling. Elijah isn't one to give up though and thanks to his constantly hard cock he doesn't. He makes his first insertion and Kyler almost falls off the bed, but Elijah's not done with the newbie yet. Colin and Elijah are about to take Kyler to school. They instruct him on taking a cock and show him the ropes. After some bitching and complaining and almost chickening out, Elijah finally gets balls deep in the newbies ass. It's a bit chaotic here troops but it's like watching three young guys experimenting for the very first time. Remember those nights of camping when you and your buddies decided to try some new things? Well, this scene is going to throw you back in time and you're be right there for Kyler's first time in the woods. Kyler doesn't know whether to shit or go blind but he thinks he might wanna play with himself. Imagine how confused he was at this moment. After Elijah gets Kyler all broke in and nice and wet and opened up, Colin makes the tag and hops in behind Elijah to give his cock to Kyler. Elijah stand over and jerks his cock as he watches the two fuck. It isn't long before Elijah gets back in the saddle once more before Colin comes back in to finish the job. Once he's fucked Kyler a little longer he joins Elijah and the two of them jack off on Kyler's chest. But Elijah comes first and by the time Colin blows his load Elijah has worked up a second load that he blows before Colin's first. By this time Kyler has joined in and strokes out his nice load. Colin is sweatin' like a whore in church and Elijah decides he'll eat the load once it comes. Colin's load covers Elijah's mouth.",
  "models": [
    {
      "name": "Colin",
      "person_id": 35064
    },
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Kyler",
      "person_id": 35108
    }
  ],
  "release_date": "2006-09-08",
  "scene_id": 70021,
  "series": "Long Deployment",
  "tags": [
    "Gay"
  ],
  "title": "Colin, Elijah & Kyler"
}