{
  "collections": [
    "Active Duty"
  ],
  "description": "Elijah & Jacob ... <br />Every good Commander has to take out time to review his troops and that's what I've done for you with Troop Review. Jacob and Elijah are at the beach condo where we are taking some pics of the two of them that day. I start easing Jacob into taking pictures alongside Elijah instead of just the two of them alone. Eventually I turn on the video camera and tell them to go ahead and work up hard-ons for the next photos. My intention all the while is to let them jack off together and cum before I return. I do return a couple of times just to stir up some shit between them, but after watching this double jack-off sessions you'll agree with me that the two of them needed no real guidance. It is intense and so interesting to watch how Jacob becomes very interested in Elijah's cock. He can't keep his eyes off of it. In fact, I blame myself for staying out of the room so long because had I been seeing what I seen when I went back and watched this double J/O I'd have been right in there egging things on. I believe once you watch this scene you'll see what I mean. Jacob is clearly comfortable with Elijah (who wouldn't be) but Elijah doesn't quite pick up the signals and we are left to watch Jacob practically beg for more action just in his eyes and his own actions alone. This is a very hot scene despite the lack of anything other than the two of them jacking off together. I now know that it's time to call Jacob back in for a second round and this time I'll pay closer attention to his signals and run with them. Enjoy this intense twenty minutes of bound up testosterone, troops. I know I did (and obviously Elijah and Jacob did as well).",
  "models": [
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Jacob",
      "person_id": 35092
    }
  ],
  "release_date": "2006-09-29",
  "scene_id": 70022,
  "series": "Troop Review",
  "tags": [
    "Gay"
  ],
  "title": "Elijah & Jacob"
}