{
  "collections": [
    "Active Duty"
  ],
  "description": "Rodney, Lance, Elijah and Kyler get acquainted... (This scene is not bareback)... This scene actually comes first on the DVD because it was shot before the Lance and Rodney scene. This is the scene where Lance and Rodney refused to touch each other, but they didn't refuse to touch Elijah and Kyler. The boys are kicked back in the living room watching some TV and I shoot the shit with them about what we are about to do. This is both Rodney and Lance's first time on video with other guys and they fall right in like good Marines are taught to do. In The Bedroom....Skip The Bullshit and Get Down To Business... Once in the bedroom there are hard dicks all over the place as Elijah starts sucking on Rodney and Kyler sucks on Lance. Kyler is so hot to watch as he practices his newly learned skills on Lance's hard meat and Elijah manhandles the huge cock hung on Rodney. Kyler is licking and sucking on Lance and giving him some good attention while Elijah gets well aquainted with Rodney's massive rod. Lance comes up on his knees and moves to the side of the bed to give Kyler better access to his cock. Kyler is becoming a pro at this as he really gets down to business. Lance is clearly enjoying the attention as he licks his fingers and rubs his nipples. Rodney is clearly impressed with Elijah's skills as he smiles and talks to Elijah and the camera. Elijah licks up the shaft and slowly takes the huge meat in his hungry mouth and works it over good as Rodney kicks back and enjoys the ride. Lance Takes Elijah's Cock In His Mouth and Things Switch Up A Bit... Lance is sucking on Elijah while Kyler tackles the monster attached to Rodney for awhile. Lance is pretty good for a newbie and doesn't complain and neither does Elijah. Elijah says it feels so good. Lance takes his big tongue and licks Elijah's cock good and Kyler keeps the pace on Rodney's big, long hard cock. Rodney is all smiles and loves the attention to detail Kyler is giving his cock. Elijah And Kyler Share Rodney's Huge Cock... As always, I like to see two guys servicing one cock and what a great cock Rodney has for sharing. Elijah and Kyler get down in front of Rodney as he stands on the bed and suck his cock and balls in unison. Rodney ask if they like that big fucking cock in front of them and they just hum the 'yeah's'. They take turns on the long cock taking it all the way down and sharing it as Rodney watches and smiles. Elijah Eats Lance's Ass While Kyler Sucks Lance and Rodney Jerks Elijah... It's becoming a cluster of hot cocksucking and ass eating as Elijah positions himself below Lance and eats his tight ass while Kyler sucks his hard cock. Kyler stands up and starts feeding Lance his hard cock while Lance gets his ass rimmed good from below. Rodney jerks Elijahs cock for him as he watches the action. Elijah And Kyler Prepare Their Fuckers For The Fuck... Elijah and Kyler suck on Lance and Rodney and work their cocks up for the fuck they are about to give them. Kyler is sucking on Lance and Elijah has opted for the bigger of the two as he swings from Rodney's meat and prepares it for his hot ass. Rodney is the first to get inside his cocksucker as he bends Elijah over the bed and begins to fuck him good and hard. Before long, Lance is deep inside of Kyler and the two fuckee's are moaning and groaning. Rodney goes balls deep in Elijah's ass and Elijah does his trademark moans. He's loving this big cock up his ass and he's letting it be known. Rodney is slamming in and out of the tight ass in front of him and fucking it good. Meanwhile Kyler is getting used to his intruder as Lance fucks him good and hard as well. It isn't long before Kyler is ready to cum so Lance hops on the bed and tells him to cum on his chest as Lance jerks his own load out. There's a huge puddle of cum all over Lance's chest as the two men's cum mixes in to one big puddle. It's Rodney's turn next and he blows a huge load all over Elijah's stomach. Elijah hops up and returns the favor to Rodney as he blows his hot load all over Rodney.",
  "models": [
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Kyler",
      "person_id": 35108
    },
    {
      "name": "Lance Bear",
      "person_id": 35110
    },
    {
      "name": "Rodney",
      "person_id": 35138
    }
  ],
  "release_date": "2006-10-24",
  "scene_id": 70037,
  "series": "Soldier's Ball 3: Bareback Waltz",
  "tags": [
    "Gay"
  ],
  "title": "Elijah, Kyler, Lance & Rodney"
}