{
  "collections": [
    "Active Duty"
  ],
  "description": "Lance And Rodney Come Over For Photos... Lance and his longtime Marine buddy, Rodney come over to the house for photographs in their sexy ass uniforms. Rodney is wearing his desert cammies and Lance is sporting his dress charlies. They both look fantastic. I start out shooting photographs of Rodney who just got out of the Marines that same week. This was supposed to be a simple night of just photographs of each Marine alone. I start out with Rodney who is tall and handsome and hung. He's a wild one and as we are shooting his photos he begins to tell me how he really needs to make some extra money because he is leaving for Florida in the next couple of days. His girlfriend's father has offered him a job but he's gotta get up the money to get to Florida first. I tell him I have no idea what we can do. As we move through the photo session he starts brainstorming about ways we could make him some more cash. Several times he offers his big, thick cock to me, but I refuse because I see it as a set up. The Power Of Suggestion... Rodney is bangin' his brains out trying to figure out an edge to make himself that needed extra cash. He's done a male/male video before with his buddy Lance where they ganged up on Kyler and Elijah (see the next scene below) but he and Lance wouldn't even touch each other in that scene. These two have been to Iraq together, showered together and even banged chics together, but Lance wasn't having any when I had suggested they do the deed in the scene with Elijah and Kyler. So Rodney is making suggestions and he suggest I get someone over to fuck him on video. I tell him that's simply not possible. It's too late and no one is available except his buddy Lance who is out in the living room waiting on his close up. At this point Rodney is willing to do whatever it takes so he says he'll let Lance fuck his brains out on film so he can make the cash he needs to make the trip to Florida. I personally saw this coming a mile away and eased Rodney right into thinking it was all his idea. I tell him that Lance won't even hear of it. 'Let me talk to him' he says. So, the two go in another room and talk things over. Lance comes storming out two minutes later yelling 'Dude you are out of your fucking mind. I'm not fucking you man.' After much begging and pleading on Rodney's part and rationalizing on my part, Lance agrees to do the deed to help his buddy out. Only problem is, Lance has no idea what Rodney needs the money for...(more on that later). Two Marines Help Each Other Out... Off to the bedroom it is where I've already got everything set up to shoot. There's a lot of great dialogue here with Rodney telling us that he's actually always fantasized about Lance fucking him. He said he'd seen Lance in the shower a hundred times and banged chics with him a few times and had always wanted to do more with Lance. Our boy Lance is clearly shocked as he hears all this stuff coming out of his buddies mouth. Rodney is a little tipsy at this point and he's just letting it all out of the bag. Lance is sober so the shock value is certainly heavier on him as he listens. 'What a way to use a friend, eh?' says Lance. I leave the two Marines alone and they discuss things further. Rodney continues to express himself and Lance assures his friend that he's going to help him out tonight. Rodney is about to get a piece of Lance. Rodney says he's ready to get a taste of the medicine he gave Elijah and what better to pick his friend Lance to give it to him. Rodney is the first to pull out his cock and it's on, troops. He shows off the ass that he wants Lance to fuck and the banter continues for a bit. There is some very interesting exhanges here as the truth about Rodney's secrets come out. Rodney Sucks Lance For The First Time... The two Marines work up their hard-ons as I step away. When I come back they are hard and ready and Rodney has his eye on the ball as he watches Lance's cock intently. You can tell he's hungry to taste his buddies cock. Never one to be shy I suggest Rodney do just that. Rodney gets down and starts sucking on Lance's hard dick and licking the shaft. This is so hot to watch as the two Marines in uniform start getting down and dirty. Rondey must be doing a pretty damn good job because Lance is hard as a rock as his buddy chows down on his cock. He's giving it some serious action as he licks and sucks it, taking it all the way down his throat. I get him back on his knees and give him some pointers for tacking a cock down his throat. Rodney starts showing off his skills for the camera. He's got such a beautiful face and smile. I have to admit this guy really got to me. His smile was so radiant and his eyes danced with his smile to make one of the best looking faces I've ever seen on a man. Lance grabs on Rodney's head and fucks his face. Rodney licks and sucks on Lance's balls as Lance unbuttons his shirt for easier access. After plenty of oral attention on Lance...Rodney is ready for some anal attention on himself. Lance Fucks Rodney Bareback... Rodney is hot and ready for some cock in his ass and he's more than ready for Lance to do the deed. He spreads his ass cheeks for Lance to plow him good. Rodney tries to pussy out at first, but Lance and I have come this far and we're not hearing it. Rodney is about to get banged out just like he wanted it. Once Lance is in, it's on and he bangs Rodney good and hard....Rodney tries to get away a couple of times but when he realizes that's not an option he relaxes and goes with it. Lance grabs him on the shoulder and plows him good and hard. Rodney begs 'be easy, be easy' but Lance isn't having any of that. He bangs him harder and deeper. Rodney has gotten what he came for as his buddy fucks him good. Lance throws his foot up on the bed and goes balls deep into Rodney's tight virgin hole. Rodney is getting into it now and yells 'cum on my face' and flips over for Lance to shoot a huge fucking load all over his waiting face....this is one hell of a load troops. It's the biggest I've ever seen Lance shoot. Lance slaps his dripping cock all over Rodney's face. Rodney's face and shirt are covered in cum. Rodney Takes The Money and Runs and Leaves Lance Hanging With Rent To Pay... Two days later Lance calls me up and ask if I've heard from Rodney. 'No, why?' I ask. 'I came home today to get the rent money from him and all his shit and his girlfriend's shit is gone.' 'He didn't tell you he was going to Florida?' 'Florida?' 'Yeah, that's why he did the video with you the other night. He needed the money to drive to Florida where his girlfriend's father offered him a job.' Lance suddenly realizes that the fucking went both ways....he fucked Rodney in the ass and Rodney fucked him in the end. After all, what are friends for?",
  "models": [
    {
      "name": "Lance Bear",
      "person_id": 35110
    },
    {
      "name": "Rodney",
      "person_id": 35138
    }
  ],
  "release_date": "2006-10-24",
  "scene_id": 70036,
  "series": "Soldier's Ball 3: Bareback Waltz",
  "tags": [
    "Gay"
  ],
  "title": "Lance & Rodney"
}