{
  "collections": [
    "Active Duty"
  ],
  "description": "Shane, The Twins, Chaz And Damien Meet Up At My Hotel ... I get a hotel room so I don't have to clean up the mess and invite the five boys over to have a little fun. This was a really fun day as we all got together and just let things go where they might. And wouldn't you know it with some players like Shane and Chaz it didn't take long before things got hard and moving. The boys end up on the bed watching porn and jerking their cocks. I come back from getting ice to discover the debauchery. We shoot the shoot some and I talk to Chaz about his near death experience when he and Jagger were attacked by some strangers at a car show in Missouri. Don't miss the details here troops. I move around the crowd and talk to all the boys about what's been going on with them before I convince them to try out the Jacuzzi. You've Never Seen A Jacuzzi So Hot ... Until you put these five hot men inside it. The boys kick off with Shane saying someone has to take advantage of his perfectly good hard-on. Chaz jumps at the chance and shows his skills off to the others as he chows down on the hard cock being offered to him. Damien is next in line as he takes his turn followed by the twins who like sharing things together. What a perfect picture with these two at the helm. The other boys call it 'the twin turn.' The cocksucking ring continues as everybody takes and gets a turn both at the helm and on the receiving end. The Fun Continues On The King Size Bed ... The twins continue their turn on Shane's fat meat as Damien and Chaz play in the background. Damien moves over to secure a twin cock as Chaz and the other twin pair off for their own fun. Chaz feeds Shane while the twin feeds on Shane's cock and the other twin enjoys Damien's hot mouth. Damien And Chaz Eat The Twins Asses To Get Em Ready ... Damien and Chaz each take a twins ass to prep it for the fuck they are about to get. Meanwhile the twins keep sharing Shane's cock as they let their asses get explored. Chaz is spreading that hole open as his tongue explores it deep. Once they asses are wet and ready, Shane takes the wheel at one twins ass while Chaz handles the other. Chaz and Shane fuck the twins while the twins suck on Damien. Damien is watching like he's jealous, but he'll get his turn soon enough. The twins are taking a good fucking as they really get into giving up their asses to the fuckers that are taking them. Things flip around and they put the twins on their backs to finish the ride. Damien is feeding the twins his cock as they lay on their backs and take a good fucking by Shane and Chaz. Shane sucks on his twins cock as he rails his ass and things are in full swing now. Share The Fucking With Damien ... Shane isn't one to leave anyone out and he can see that Damien is ready for a cock in his ass, so he moves over and takes care of matters. Shane gives him a good fucking and then turns the ass over to Chaz who really puts a major fucking on Damien. This is a hard, brutal fuck that's gonna bring everyone to climax. Damien sucks the twins and Shane in a circle while Chaz plows his ass hard and long and Damien is in total ecstasy. This is just how our boy likes it, all attention on him and a nice hard cock in his ass. Chaz is fucking as he keeps on sucking one of the twins. He's not missing a beat in either direction as all the boys get ready to shoot their loads. They all blow all over Damien and it's a wrap. I spared you too many details to leave some mystery to this scene. Enjoy!",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Twins",
      "person_id": 35049
    },
    {
      "name": "Hops",
      "person_id": 35087
    }
  ],
  "release_date": "2006-12-12",
  "scene_id": 70045,
  "tags": [
    "Gay"
  ],
  "title": "Bryan (Twin),Chaz, Hops & Ryan (Twin), Scene #01"
}