{
  "collections": [
    "Active Duty"
  ],
  "description": "Chaz And The Twins Take A Shower ... Things kick off with our wild boy Chaz in the shower with the twins as they get all lathered up for some fun. Less than one minute into the DVD the cocks are hard and Chaz is playing with the twins hard cocks while they play with his. These boys don't waste any time. Chaz has his hands full of identical cocks and the twins are having fun sharing Chaz's hard rod as they decide it's time to start the sucking. The twins are the first to feast on Chaz's cock as he kicks back beneath the water and enjoys the attention. One twin sucks his cock while the other plays with his balls. The twins are sucking on this cock like it's gonna be their last, but we know that's hardly the case. Less than three minutes in and everyone has had their mouth on a cock and the action continues to unfold. Chaz sucks one of the twins while the other sucks him and it's a daisy chain of command here, troops! Chaz is spit-shining the knobs like a pair of combat boots as the three troopers enjoy each other. The cocksucking continues freestyle and no one is left wanting as these three really get into servicing. In Walks Hops to Jerk And Watch ... Hops walks in on the shower action in uniform smokin' his cigar and takes a seat on the toilet to stroke his fat cock as he watches our three pros in action. By the time his cock comes out of his cammies it's hard and ready for a stroking. This might be Hops first rodeo, but he's already a cowboy as he strokes his cock watching the hungry boys feed. The audience seems to intensify the action in the shower as the three soldiers are apparently happy to have a watcher. But the watching doesn't last very long as Hops is ready for some oral action of his own as he strokes hard and fast. Hops Wants Some Action ... After stroking his hard meat for a couple of minutes, Hops is ready to tango. He yells out 'Ya'll need to come on over here and give me some of that shit' and the twins are the first to respond to this emergency cocksucking call. On their knees in front of Hops they start in on his fat cock like two hungry pups and Hops is really enjoying himself. The uniform comes off and the hard dick stays risen to the occasion. Hops has found himself two willing players as the twins work his cock over good. Back and forth they share the big cock, licking up and down the shaft together and taking turns working it over with their hot mouths. Hops is really getting into it as he tells them to 'suck that dick' and moans with pleasure. This might be his first rodeo but this cowboy is riding the fun. The twins jerk themselves as they work the cock and it isn't long before Chaz wants in on the play. Chaz Joins The Twins And Hops ... Hops moves the action over away from the toilet to allow Chaz room to play and the four troopers get into a ring of fire. Chaz drops down and works the hard cock of one of the twins while the twins continue to share Hops' huge meat. The twins got Chaz supplied with two hard cocks to suck while they continue working on Hops and it's oral ecstacy, troops. It doesn't take long for Chaz to demand his taste of Hops as one of the twins takes the helm at his cock while the other twin helps him suck Hops. The suckers take turns moving about the circle making sure everyone's cock is nice and wet. Hops has fell right in place and is fitting in quite nicely. Hops tells one of the twins...'Your brother sucks a mean dick man' and the twins just laugh. Chaz is working whatever meat falls in his face and the pace keeps moving forward. The four troopers form a line with Hops heading things up with a twin on his cock as Chaz sucks that twin and the other twin sucks Chaz. Hops is loving the view from this angle as he looks down on three hungry cocksuckers enjoying all the cocks including his. We start to see Hops dirty side come out here as he really gets into appreciating his big meat being worshipped. He does his share of dirty talk as he squeezes and plays with his balls. Hops has taken a liking to the twins as he seems to prefer one of them to be his cock worshipper. Hops Says, 'Let's Take These Twins To The Bedroom' ... And off they go to continue with a little more cocksucking before they move into the fucking. Hops has got the twins right were he seems to want them and Chaz is always the happy helper. Much is to be said for his constant willingness in the matters at hand. Chaz always comes through for us as a true trooper in the call of duty. Hop isn't having any trouble following his lead as he takes well to having such fine commrades enjoy his manhood. It's a perfect foursome as the boys get even closer. The twins are clearly enjoying themselves too as they've come so far since their romp in the hay with Dean in Twin Soldiers. Our second installment proves our twins are ready to step up and serve as well. Chaz Starts Eating The Twin Asses To Prepare Them For The Fuck ... Chaz zooms his focus to one of the twins asses while the twins continue to polish Hops good as they share the shaft of his nice Puerto Rican cock. Chaz is putting the tongue to the twin ass and the twin is liking this attention as he moans and really gets into what's going on. The twin is really talking to his ass eater in the universal language of 'oh fuck yeah'. Hops is grinning as he ask the twin 'you like that shit twin?' 'Hell yeah man' comes the answer and it's confirmed. The twin is ready for his fucking. Chaz Fucks One Twin While Hops Entertains The Other One ... Chaz buries his huge-headed cock deep in the twins ass, not granting our little tough guy any mercy and it's clear that the twin is toughing it out for the fans. Like with most things, once the pain is over, the healing begins and with ass fucking that means it's starting to feel good. The twin is now liking it like he should and giving his tight ass to Chaz. Hops goes to fuck the other twin but the other twins ass is so tight that Hops actually bursts a blood vessel in his cock trying to fuck him. No lie, troops. His dick actually swelled up and turned blue, but Hops is ever the team player and he didn't give up, he let the twins suck it until he cums. we turn the twin on his side and get a good shot of Chaz's cock going in and out of the tight ass. This is a great view and the twin seems to like this position. Chaz Takes One For The Team ... Chaz is up for getting fucked anytime and today he's ready to be fucked good by his twin buddy. Our twin doesn't show him any mercy either, but Chaz has been know to take a good fucking more than a few times and today is no different. Chaz shows once again what a team player he is as he lets the twin rail his ass good. Our twin is hard as a rock and fucks Chaz's ass right up until he's about to blow. He pulls out and jerks a hot wad out all over Chaz's stomach as Hops looks on intently at what is unfolding while his twin keeps sucking him off. Chaz grabs the twins cock and squeezes the rest of his hot load out of the tip. The twin jerks at the intensity. This is a really cute moment between these two as you see the innocent enjoyment of boys having fun. Hops and the other twin aren't missing a beat on their side of the bed and the attention turns to them as Chaz looks on jerking his own hard cock as Hops shoots his hot load right into the other twins mouth. Our other twin isn't complaining one bit as he keeps sucking the fat cock and letting the cum ooze. Chaz isn't far behind as his twin cheers him on to his own great cumshot and the other twins blows one on Chaz's shoulder. Our troopers have worn themselves out, but it was all for you. There are some really candid ending rants and bullshitting that is really funny to watch here as well.",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Twins",
      "person_id": 35049
    },
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2006-12-12",
  "scene_id": 70044,
  "series": "Twin Soldiers 2",
  "tags": [
    "Gay"
  ],
  "title": "Bryan (Twin), Chaz, Damien, Ryan (Twin) and Shane"
}