{
  "collections": [
    "Active Duty"
  ],
  "description": "Dean, Hayden and Damien ... I start out shooting the shit with the boys before entrusting things to Cole. The usual shit, nervous glances and laughs as they start working up hard cocks for what is bound to unfold. Dean is the first to reach in and start playing with his little soldier and the other two follow suit. Everybody's waiting to see who's gonna pull out a hard on first and it looks like everyone is standing at attention at about the same time. The three troopers lose the pants and play with their hard ons through their boxers. Dean throws his boxers at Cole and cracks a smile. Dean reaches over and grabs the cocks on either side of him and starts stroking them in unison as Damien and Hayden the task of stroking Dean. Hayden's fat, uncut cock is rock hard and Dean is manhandling it as he continues to stroke both boys off in rhythm. Dean Gets The Sucking Started ... Dean isn't one to waste time and he's the first to take a cock in his mouth as he leans over and starts working Damien's cock with his hot mouth as Hayden continues to stroke Dean's hard cock and watch Dean suck on Damien. Hayden can't stand the temptation any longer and goes down on Dean's cock while Dean works Damien over. That feels pretty good says Dean as Hayden gets into a rythmn all his on. Dean's cock is standing at attention from Hayden's personal attention. Hayden continues to stroke his fat uncut meat as he sucks on the piece in front of him. Cole suggest that Damien and Hayden share Dean's cock and they do. Dean is all smiles as the boys work his meat. Ever the sensual one, Dean is rubbing and exploring both boys bodies as they suck his meat. Quite the director, Cole keeps making suggestions and the boys keep following his lead. Suck that cock at the same time he says, yeah lick up and down each side together. Hayden Takes Center Stage As Dean And Damien Share His Cock ... Things switch up a bit and Hayden takes center stage as Damien and Dean share his fat, uncut manhood. What a beautiful cock this guy sports. His skin is soft and his complexion perfect and the job Dean and Damien are doing on his cock is magic for this young stud as he lays back and enjoys the service. Take it all the way down, Cole instructs as Damien goes first and tries hard to bury the fat cock deep in his throat. Dean follows and gives it his best shot, too. Dean you ready to take that big cock? I'm willing to try and there you have it. Dean's gonna get fucked by Hayden first on this go 'round. Hayden Fucks Dean First ... Hayden slides into home and buries his big cock deep in Dean's waiting hole as the fucking begins. Dean gets into it and starts moaning as he tries to work Damien's cock up with his mouth. Dean is humming on the cock while Hayden works his ass. Dean is getting into this action as he sucks harder on Damien and pushes back on the big cock up his ass. Hayden slaps Dean's ass as he rails it deep and hard. Dean opens right up like a morning glory and takes the ramming good. Damien turns around and feeds his hot ass to Dean while Dean gets fucked good from behind. Cole gets some magnificent close-up shots of the ass eating before Dean flips over on his back to better accomodate Hayden's fat cock. Cole says how does that cock feel in your ass? and Dean asks Hayden how big it is, and he responds: about eight inches. Dean says it feels like about eight inches in his ass LOL. Cole gets some great underneath shots of Hayden's fat cock ramming deep into Dean's ass. Damien stands over Dean and feeds his cock to Hayden while Hayden plows Dean. Dean spreads Damien's ass cheeks and fingers his hole good while the action continues to heat up. Damien's cock stands at full attention now that he's got something buried in his ass. Dean sticks two fingers in as Hayden continues to ram his ass. Damien starts sucking on Dean while Dean fingers him and Hayden holds steady at the helm on Dean's hole. Cole demands to see Dean's gaping hole and Hayden obeys as he spreads Dean's cheeks for a better view. It's Damien's Turn To Get Plowed ... Hayden takes the reins on Damien's waiting hole as Dean stays on bottom and sucks Damien good while Hayden plows deep in our Toy Soldier. Hayden gets balls deep in Damien's ass as Damien screams out. Dean is loving his view from below as it's balls to the wall, troops. Dean sucks Damien's cock and plays with Hayden's ass. Hayden slaps Damien's ass while Cole dares him to take it easy on Damien. They'll be none of that tonight. Damien has suddenly found himself in the bitches seat while Hayden and Dean drive the ride. Dean is hard as a rock as Damien sucks his cock and moans loudly while he's being plowed deep from behind. The position takes an interesting turn as Hayden positions Damien on his back with his legs over his head and his back resting on the headboard as he plows down deep from above. This is a great position as we see all of Hayden's big cock go in and out of Damien's hungry hole. Dean spreads Damien's ass cheeks apart to accomodate the monster going in and out. Dean starts sucking on Damien while Hayden continues the banging of a lifetime. Hayden is in balls deep again and bouncing up and down plowing Damiens open hole deep and hard. Damien Gets His Revenge On Hayden ... After a long and gruesome hot fuck, Damien gets his turn at the wheel and goes for Haydens hole. Dean gets on his knees in front of Hayden and sucks his cock while Damien fucks him good. Damien and Hayden's bodies compliment each other so well. It's hot to watch Hayden give it up to his buddy the way his buddy gave it up to him. Just the thought of payback has Damien rock hard and banging Hayden's brains out. Damien is long stroking Hayden's hole. Hayden is out of breath as he takes a fucking akin to the one he gave. Damien aint playing, he's giving it as good as he got. Dean Joins The Chain And It's A Three Way Fuck ... Dean gets behind Damien and starts railing his ass while Damien fucks Hayden. A three way fuck has let loos and it's on, troops. Damien throws Hayden on his back and completes the job he started. Cole sounds like Dink Flamingo JR in the background as he growls, There ya go, keep fuckin' him...keep fuckin' him. Dean gets behind Damien and keeps plowing him while Damien fucks Hayden. Cole gets some great close ups and underneath shots of the action for us to enjoy. What a view! Dean reaches around Damien and grabs onto Hayden's thighs for leverage as Hayden jerks his own meat frantically as the three way fuck continues. Dean gets rough and starts manhandling Damien as he bends his arm behind his back and bangs away at his hole. Hayden and Dean both slap Damien's little ass as Dean tears into him like a tiger. The scene turns rough as they hold Damien down and keep his arms restrained. Dean is sweating as he delivers a hard fuck to Damien. Dean pulls out and blows a huge load all over Damien's hot ass. Damien pulls out of Hayden and blows his load on Hayden's stomach.",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Dean",
      "person_id": 35074
    },
    {
      "name": "Hayden",
      "person_id": 35423
    }
  ],
  "release_date": "2006-11-29",
  "scene_id": 70042,
  "tags": [
    "Gay"
  ],
  "title": "Damien, Dean & Hayden"
}