{
  "collections": [
    "Active Duty"
  ],
  "description": "Chaz, Trevor And Damien Meet Up For Some Fun ... Trevor has been bugging me to get some guys together for him to have some fun with. He likes sharing his big nine incher with whoever is willing to play and today Chaz and Damien have stepped up to the plate. Let's play ball! Things kick off with the usual fodder and bullshit as I talk the boys up a bit. The clothes quickly come off and the cocks come out. Cole took an interesting new angle to this as he films the guys getting hard. Chaz grabs onto Trevor's big cock at Trevor's request as Damien looks on. It's not long before Chaz has it in his mouth as he sucks his long and hard. Chaz soon gives the cock to Damien as he positions himself above Trevor and feeds him his cock as Damien sucks on Trevor. Damien And Chaz Share The Big Cock ... Chaz gets down with Damien to suck on Trevor's cock as they suck it together, like fighting pups for a tit to feed on. Trevor keeps their pace as he continues to suck Chaz and it's a circle suck of sorts. Trevor soon finds himself between both cocks as he sucks both Damien and Chaz as they suck and share him. Damien and Chaz decide to get up over Trevor and feed him their cocks while they take turns jerking his meat. Trevor Fucks Chaz As Chaz Sucks Damien ... Chaz is the first to take on Trevors nine inches as Trevor buries it deep in his hot ass. Chaz gets all into as he yells at Trevor to rail his ass. Damien keeps his cock in Chaz's mouth as the plowing continues. Trevor and Chaz are about to tear the bed down as Cole gets some great underneath shots of the action. Damien falls in where Trevor left off and they put Chaz on his back with his legs in the air. Damien goes to town on the freshly fucked ass and gives it his best shot while Trevor feeds Chaz his meat. The tag team switches up again and Trevor gets back deep in Chaz's ass again as Damien feeds him his cock. Our cumdumpster has taken on cock slut as the boys have their way with his pretty pink ass. Chaz has about met his match as he yells vulgar slurs at his fucker. Chaz Eats Damien's Hole To Get It Ready For A Fuckin' ... Chaz is eating Damien's hole while Trevor bangs his hard. Chaz says fuck me like a dirty whore. as he sticks his fingers in Damiens ass. Chaz gets his turn on Damien's ass and takes out his revenge. Trevor positions himself below Damien and jerks and sucks his cock while Chaz bangs him good. Trevor turns around and puts his ass in Damien's face to feel his tongue deep inside. They turn Damien over on his back and Chaz continues his hammering as Damien sucks on Trevors big meat. Cole doesn't miss a shot as he captures the action just like I would, but with a different style. Trevor decides to face fuck Damien while Damien jerks his cock and Chaz fucks his ass. Trevor raises up and blows his huge load all over Damien's face as Chaz watches while he fucks Damien and cheers Trevor on. Damien signals to Cole that he's about to blow and Cole moves in to get the goods as Damien shoots his wad all over himself. Chaz follows Damien with an explosive cumshot to mix in with Trevor and Damien's loads all over Damien. As a nice treat, Trevor decides he wants to taste Chaz's load. Trevor sucks the rest of the load out as Damien joins him to share the spunk. Final Words From Our Sponsor ... The Mr. Rogers of gay porn (yours truly) steps back into the room and talks to the boys about what just happened. Trevor shoots the camera the finger and Chaz says he's hungry and it's a wrap. Hot Zone 2 proves a success for Cole and shows that he paid very close attention to what was going on in the many films he graced with his presence for Active Duty. He's graduated from student to scholar. Congrats Cole!",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Trevor",
      "person_id": 35160
    }
  ],
  "release_date": "2006-11-29",
  "scene_id": 70043,
  "tags": [
    "Gay"
  ],
  "title": "Chaz, Damien & Trevor"
}