{
  "collections": [
    "Active Duty"
  ],
  "description": "Elijah Meets Adam In The Hot Tub ... We've got another newbie in this video for you and what a hot little newbie he is. Adam is short and petite and ready for some man on man action and Elijah is just the perfect one to give it to him. The two soldiers get things going in the hot tub where they kiss, eat ass and suck some cock. The chemistry is right between these two as they start things out with some hot kissing before Elijah turns Adam around to give him a good ass eating. After he's eaten Adam's ass good Elijah turns him around and starts feeding him his hard cock. Adam takes to this like a champ and starts sucking on Elijah good. Elijah is hard as always and Adam is enjoying sucking his cock and balls in the hot tub. Adam strokes and sucks Elijah as Elijah just moans away. Inside On The Pool Table ... The boys decide to take things inside where they land on the pool table and Adam continues to suck on Elijah's hard cock. Elijah is really getting into this hot action with his newbie. Adam is such a fucking hottie. He makes love slowly to Elijah's dick and tastes every last inch of it once or twice. He's clearly into Elijah and enjoying what's happening. Elijah is getting really into this attention and tells Adam to eat his ass as he bends over the pool table and lets Adam have at it. Adam is licking Elijah's ass and stroking his cock at the same time. This is very hot as we watch a newbie fall right into the good stuff right off the bat. Adam isn't playing he's eating ass like a pro and Elijah is letting him know how good it feels with all the moaning he's doing. Adam starts fingering Elijah's ass as he jerks his cock. Adam take his tongue from Elijah's balls to his ass back and forth several times, really giving Elijah a good licking. He starts sucking on Elijah's balls hard and Elijah is loving it. Elijah Carries His Newbie To The Bedroom ... Elijah grabs the newbie up in his arms and literally carries him into the bedroom where he positions Adam on the bed so he can eat his butthole. Adam throws his legs back to give Elijah access to his hole and Elijah starts chowing down as Adam strokes his own cock. Elijah goes back and forth between the newbie's balls and ass licking and eating him good. Elijah starts sucking on Adam's uncut cock hard and fast, deepthroating him and making Adam go crazy with desire. Elijah then crawls on top of Adam and feeds him his cock again as Adam strokes his own cock and Elijah reaches back to give him a hand. Elijah puts his finger in his mouth and gets it wet and sticks it in Adam's hot ass fingering it while Adam sucks Elijah. Elijah Fucks Adam Long And Hard ... It isn't long before Elijah wants some ass so he gets himself in position with Adam on his back and starts fucking Adam nice and hard while Adam strokes himself. Once Elijah is deep in Adam's ass Elijah grabs Adam's cock and strokes it while he plows his ass good and hard. Adam's faces are telling the story here troops as he looks like he's in heaven. Adam's cock is hard as a rock in Elijah's hand as Elijah's cock is hard in Adam's ass and it's hot as hell to watch these two sexy devils put on a show for us. Elijah and Adam are moaning together and the only thing missing is the preacher and the wedding rings here. These two are made for each other and it shows. Adam and Elijah take turns stroking Adam's cock while Elijah fucks him deep and hard. Elijah flips Adam over and goes at his ass doggie style while Adam moans with pleasure. Elijah does his trademark position of standing over the ass he's fucking and aims down as he fucks it good. Adam is open and ready for the business at hand and Elijah is balls deep in his ass. Elijah is ready to blow and pulls out and blows a fucking huge wad all over Adam's ass and rubs it in, letting it drip down to Adam's freshly fucked asshole. What a huge load it is and Adam's asshole is one of the prettiest I've ever seen.",
  "models": [
    {
      "name": "Adam Wells",
      "person_id": 35234
    },
    {
      "name": "Elijah",
      "person_id": 35081
    }
  ],
  "release_date": "2007-01-23",
  "scene_id": 70056,
  "series": "About Face",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Gay"
  ],
  "title": "Adam & Elijah"
}