{
  "collections": [
    "Active Duty"
  ],
  "description": "Shane & Elijah ... Things kick off with Shane and Elijah in the shower and Shane is trying to talk me into getting naked and joining them, but being the shy, reserved type, I decline his requests. Shane and Elijah give a great kiss to start things out and it goes on for quite a bit. They are chatting up the crowd and getting things going. It isn't long before Shane drops to his knees to taste Elijah's cock. After he's sucked his cock a little he turns that pretty ass of Elijah's around and starts munching on that for a while. Elijah returns the favor and gives Shane's cock some loving attention. Shane starts fucking Elijah's face and Elijah is having a hard time taking it all. Elijah takes a break and Shane takes his time alone in front of the audience very serious. After some more mutual sucking the boys dry off and move things over to the bathtub steps where they continue the sucking and talking to the crowd. Things move to the bedroom and Shane starts working Elijah's cock up so he can put it in his ass. Like always, Elijah is hard as a rock. His cock is loving the attention and it won't be long before it's up Shane's ass. But before that happens, Elijah wants to taste Shane's cock again. The crowd asks for another kiss and Shane and Elijah are more than happy to oblige. Shane works Elijah's cock up once more before he decides to ride it. Shane gets Elijah's cock up his ass and rides it like a horsy. He's strokin' his hard meat while he rides Elijah's hard cock fast and deep. Elijah reaches around and strokes Shane while Shane rides him. Once he's rode Elijah good and hard Shane switches things up and starts eating Elijah's hot ass. Elijah blows his load and Shane eats it like candy and gets up close to show the camera the hot load he got out of Elijah. Shane blows his load next with his signature screams in place and Elijah entertains the crowd.",
  "models": [
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2007-01-02",
  "scene_id": 70057,
  "series": "Active Duty Live Vol. 2",
  "tags": [
    "Gay"
  ],
  "title": "Elijah & Shane Live"
}