{
  "collections": [
    "Active Duty"
  ],
  "description": "Shooting Some Pool And The Shit ... Shane and the boys get together for some pool shooting and shit shooting about Iraq and the war and just things in general. Shane and Lance say they would have thrown a grenade in on Saddam then had his dental records checked. They talk about building things in Iraq and just the experience in general. This is very interesting conversation as we get to hear how things are in Iraq directly from guys that have been there, paid their dues and made it back to tell their stories. In the middle of the chat in walks the newest guy to the scene wearing a shirt that says I like slow-dancing. I quickly inform him that we don't do any slow dancing around here. The newbie is so nervous he is talking in an accent of some sort. He never could come up with a name so we just started calling him FNG for Fuckin' New Guy. Intimate Moments With Shane ... Shane and I start talking about this being his last day in the military and get all sentimental. We decide to go to the bedroom for a private, intimate conversation. We talk about the newbie and how cute Shane thinks he is. He says we have three highly motivated professionals here and it's going to be easy to do what needs to be done. Shane says we can make the newbies dreams come true. We move on to talk about our four year relationship and how we've grown close as friends and how I watched him leave and go to Iraq for a year. We talk about the scandal and how he just missed all the shit flying. He tells a story about how one of his DVDs started floating around in Iraq among his comrades and how the rumors spread in Iraq quickly and how it all just provided entertainment in Iraq. We talk about some of his favorite Active Duty buddies and he names Cole as his number one favorite. At this point, we weren't sure if or when he'd be back to do more videos so things were a bit teary. We ended with I love you and brought in the newbie for Shane to break in. Shane And The Newbie Get Acquainted ... I bring the newbie in and put him on the bed with Shane and leave him with a few words. Once I leave Shane doesn't wait a minute before he's engaging the newbie in some hot conversation and moving things forward. Shane tells the newbie that trying new things is the American way and today he's going to do just that. Shane has the newbie naked and strokin' in no time flat. The newbie's eyes are glued on Shane's cock as they get comfortable. Shane latches on to the newbie's cock and the newbie does likewise. It's on from here. Shane has him where he wants him and tells him it's all for the fans. Shane quickly goes over and starts sucking the newbie's nice eight inch cock. Shane is loving this big piece of meat and it's hard as a rock by this point. Shane moves around a little and gets the newbie down between his legs and starts instructed him on how to suck a cock good. Shane reaches underneath and strokes the newbie's cock while the newbie sucks him good. It isn't long before they are in a hot sixty-nine position giving each other some hot attention. The newbie has fell right in and became a pro in a matter of minutes. Shane moves up and gets beside the newbie on his knees and feeds the newbie his fat cock as he strokes the newbie in return. Shane moves the newbie onto his back and works his cock over for a bit as the newbie lays back and enjoys the ride. Shane then switches things up a little and strattles the newbie's face and fucks it from above. All the while the newbie is taking it like a champ. Bring In The Reinforcements ... At this point Elijah and Lance come on the scene to help Shane finish the newbie off, but there's a lot that's about to happen before the newbie is a certified pro. Shane keeps straddling the newbie's face while Elijah sucks on the newbie's cock and balls. Lance helps Elijah suck and slurp on the newbie's fat hard cock while Shane manhandles the newbie's face. Shane turns around and keeps his cock in the newbie's mouth as he shares the newbie's cock with Elijah and Lance. Shane then instructs Elijah and Lance to get positioned with their cocks near the newbie's so he can suck all three in rotation. Elijah seems to be liking this idea as his eyes roll to the back of his head. Elijah moves around behind Shane and starts eating Shane's ass as Shane keeps feeding the newbie his cock while he shares the newbie's cock and balls with Lance. Lance's long ass tongue does a wash job on the newbie's balls while Shane does a buff job on his cock and Elijah eats Shane's ass like their no tomorrow and the newbie sucks on Shane. Elijah is going between eating Shane's ass and licking his balls and the party is on. Shane turns himself around so the newbie and Elijah can share his cock while Lance devours the newbie's hard cock all alone. Shane Says It's Ass Eating Time ... Shane says he thinks it's ass eating time and that everyone should line up to get a feel of Lance's long, juicy tongue. Elijah, Shane and the newbie line up while Lance takes his turn on their asses. He goes in for the kill on Shane's ass first with his long ass tongue and eats Shane good. Shane is loving it as he moans and groans in the background and Lance makes love to his ass with his tongue. Elijah is watching and jerking as he anticipates the tongue in his ass. Lance moves down to the newbie's ass and gives it the same good attention he gave Shane's. Next up is Elijah's beautiful ass and Lance is right in there giving it his long tongue good and fast. He moves under Elijah and sucks his cock and balls as well while Shane moves over to eat Elijah's asshole. Elijah latches on to the new guys cock that has found itself in front of his face and sucks it while Lance and Shane work on Elijah's cock and ass. Rotations abound ... This foursome is changing up things so fast you have to watch closely. Shane is now sucking on the newbie's cock while Elijah is sucking on Shane and Lance is sucking on Elijah. The newbie is hard as hell as he watches all this below him as he stands on the bed. Elijah is laying beneath Shane to make it easy for him to fuck Elijah's face while Lance works on Elijah's cock and balls. Elijah is hungry for a cock in his ass and he doesn't hesitate to let it be known. He grabs Shane's cock in his hand and says I'm ready for this dick to be up my ass. Shane Fucks Elijah First ... They position Elijah on his hands and knees with the newbie's cock in his mouth as Shane begins plowing his hot ass hard and deep. Elijah is all horned up and ready for a good fucking and Shane is giving it to him as he latches on to the newbie's hard cock and works it over with his mouth. Shane buries his cock balls deep in Elijah's hungry ass and Lance finds his way underneath the newbie's legs to help Elijah with his fat cock. Lance and Elijah suck and slurp on the newbie's cock and balls while Shane plows Elijah hard from behind. All this hot action all at once gets the newbie overly excited and he blows his wad in his hand prematurely. But that's not going to stop the newbie from getting his nut a second and third time. Shane keeps the pace though and keeps on fucking Elijah and wearing his ass out. Fuck my asshole screams Elijah as Shane tears him up from behind. Shane really gets into Elijah's hot horny ass and fucks him 6 ways to Sunday all over the bed. Elijah raises his ass up to meet Shane's plunges and it's on like Donkey Kong. The newbie is hard again and puts his cock back in Elijah's mouth and Shane says he thinks the newbie should come get some of Elijah's hot ass. The Newbie Fucks Elijah ... The newbie cums a second time before he fucks Elijah's ass. It doesn't take long and the newbie is hard again and balls deep in Elijah's hot ass and Elijah is loving it. Elijah sucks on Lance's cock in front of him as the newbie plows him hard from behind. Lance moves over to the newbie's face and feeds him some cock while the newbie continues to plow Elijah's ass and suck on Lance. The newbie is a quick learner and he's sucking cock and fucking Elijah in unison as Elijah moans and groans loud. The Newbie Decides He Should Get Fucked Too ... The Newbie announces that maybe he should get some too and gets himself in position on his back with his legs in the air. His cock is still raging hard as Elijah and Lance put their cocks in his mouth and Shane moves in to fuck the newbie's ass. Shane works his cock slowly in the newbie's ass until he reaches bottom. Shane starts stroking the newbie's cock as he fucks his ass hard. The newbie holds his legs back for Shane to plow him good. Lance and Elijah help the newbie out as they hold his legs back for him and feed him their cocks. Shane tells the newbie he wants to watch him cum all over himself as he strokes the newbie's hard cock and bangs his ass hard. Shane is fucking the newbie harder and harder and the newbie gets closer and closer as all the hard cocks in the room get ready to blow. The newbie is the first to cum (his third load in the video) Lance and Elijah follow the newbie and blow their loads all over the newbie's face as he sucks their cum as Shane works his cumshot out and shoots it all over the newbie's chest and face. Shane brings his cum soaked cock to the newbie's mouth and lets him lick it all off. It's all in a days work, troops. Our newbie has done an About Face!",
  "models": [
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Lance Bear",
      "person_id": 35110
    },
    {
      "name": "Shane",
      "person_id": 35144
    },
    {
      "name": "Trey",
      "person_id": 35161
    }
  ],
  "release_date": "2007-01-23",
  "scene_id": 70055,
  "series": "About Face",
  "tags": [
    "Gay"
  ],
  "title": "Elijah, Lance, Shane & Trey"
}