{
  "collections": [
    "Active Duty"
  ],
  "description": "Willie And Alex Take The Mission To The Next Level ... Mike puts the two Marine's together later for another scene and this time they start out jerking off together. Both devil dawgs are in their uniforms for this one. These two together are heaven. Alex is a hot, horny devil and ready and willing to do just about anything for the camera. He's hard as a rock and waiting for his chance to pounce on Willie again. Willie isn't as nervous this go around and things seem to flow a lot smoother and get moving a lot faster. Willie takes off his pants to reveal some hot tighty whities. Alex's eyes on locked on Willie as he watches him take the briefs off to reveal his uncut cock. Alex is sporting some serious wood as he gives Willie time to catch up. This is classic military porn, troops as these two Marine's get down to the business of jerking side-by-side in a cheap hotel room. We all know what Marine's do on their weekends off and that's head to the nearest cheap hotel and get a room to spend their weekend partying in. This is what we imagine happens in those cheap digs as these boys show us the secrets behind those hotel doors. Alex reaches over without hesitation and starts stroking Willie's cock as Willie takes a swig of his beer. Mike tells Alex to suck Willie's cock and Alex obeys the command without the slightest hesitation. Willie quickly gets into the attention he's getting from Alex and starts moaning and groaning as his commrade sucks his uncut cock. Willie throws his head back, closes his eyes and enjoys the ride. Alex lays back and takes his turn as Willie gets in position and starts sucking him. We get some nice shots of Willie's nice bubble butt as he goes to work on Alex's hard cock. Alex is a talker and he doesn't mind telling his cocksucker how good he's doing. He also gives him a few pointers so Willie is sure to do a good job. Alex is horny as all get out and Willie's attention is just what he's been looking for. Alex reaches under and grabs onto Willie's uncut cock and strokes it while his buddy sucks him good. They switch up again and Alex sucks Willie some more as Willie grabs onto the headboard and breathes hard. Willie blows his hot load in Alex's mouth and it's a wrap.",
  "models": [
    {
      "name": "Alex",
      "person_id": 35236
    },
    {
      "name": "Willie",
      "person_id": 35397
    }
  ],
  "release_date": "2007-03-23",
  "scene_id": 70060,
  "tags": [
    "Gay"
  ],
  "title": "Alex & Willie 2"
}