{
  "collections": [
    "Active Duty"
  ],
  "description": "Shane Teaches Colin A Few Veteran Moves ... <br />After my heart-to-heart chat with Shane in About Face we all thought he was leaving porn forever to pursue the 'happily ever after' life, but things can quickly change in that world. Shane is back and this time it seems for good. He's always eager to help with new recruits and even though Colin has been in a few videos, he's never been in one with Shane. Shane says I always do him right. 'You always bring me the sweet boys.' Shane and I tease each other a little and I leave the two of them alone for a little while. Colin asks Shane what he's known for and Shane says a little bit of everything. Colin says he's known for his ass most and turns around to show it off to the camera. The boys show off their ink which really compliments each other. Both Colin and Shane have some great tattoos. Shane gets right down to business after just a little bullshit and before you can say suck that cock that's what Shane is doing. He's sucking Colin and working him up. The two switch up and Colin goes in for the kill on Shane's nice cock. Colin is doing a great job with the skills he's learned and Shane is enjoying the attention of this 'sweet boy'. <br /><br />Time For Sixty-Nine ... <br />Shane turns himself around so he can get some of Colin's cock while Colin continues to work on him. This is one hot sixty-nine in motion, troops. Colin is hanging right in there with our veteran as he really gets into sucking Shane's fat cock. The two are wasting no time as they service each other really well. Colin moves down and starts eating Shane's ass and sucking his balls. Shane's leg is in the air and his ass is in Colin's face and Colin isn't wasting this opportunity. Likewise, Shane is going to town on Colin's hard cock and working it over like an old pro. This seems to be just what Colin needs to get really into what's happening as he really goes the extra mile to please his partner. Colin is as horny as he's ever been and Shane is taking full advantage of the excitement as he continues to work Colin's hard cock over. Colin gets really into eating Shane's hole and Shane gets really into this attention as Colin laps at the ass like a dog in a water bowl. Shane slaps Colin's ass while Colin keeps licking. They get in true sixty-nine style with Colin on top and his pretty ass spread wide open as he sucks on Shane and Shane works his cock over in return. Shane moves up and starts eating Colin's beautiful hole as it puckers in the wind. Shane isn't wasting any time as he gets right down tongue deep in the hole and works it good. These two are so fucking hot together. Shane starts fingering Colin's hot hole and getting it ready for what's about to happen next. Colin is really getting into Shane's special attention as he begins to moan. It becomes obvious that this is the kind of slow-dance that Colin prefers as he lets all his fears go and gives in to the heated moment. They switch up once more and Colin is rimming Shane as good as he got as he opens Shane's hole for the camera to inspect. Colin's legs are wrapped around Shane like they're in a wrestlin' match as they eat each others asses. Colin is back on his knees in a minute with his head against the headboard while Shane asks the camera what they think about Colin's hot ass as he eats it. 'Ya'll wanna see that ass get fucked?' asks Shane, 'I think they do.' Colin answers. <br /><br />Shane Sees An Opening and Quickly Moves In To Fill It ... <br />Shane eases up behind Colin's open and hungry hole and starts working his fat cock deep inside him. Colin is in position, back arched and ready and waiting to have his hot hole filled. Shane straddles him and starts filling his hole with his hard cock as Colin moans and groans with pleasure. Colin's not bitchin', not complainin''. He wants this cock deep inside him and he's relaxing so it will happen. Shane reaches around and jerks Colin's cock to take his mind off the initial pain while he slams deeper into Colin's ass. Shane is balls deep in Colin's tight, hot hole in a matter of seconds and slamming deep. Shane is working him over like a part time job and Colin is loving it. I've never seen Colin have this much fun getting fucked and you can tell he's really liking it. Shane does his famous position where he stands flat-footed on the bed and plows down deep inside Colin's ass. We get to see a nice clear shot of the cock invading the tight hole as Shane slams deeper and deeper inside Colin's tight hole. Shane's balls and ass are sweating. Colin starts screaming 'Oh yeah fuck me hard. Just like that.' They are screaming and moaning in unison. Colin keeps whimpering, 'Fuck me, fuck me.' Shane flips Colin onto his back and stands beside the bed and plows him long and deep. Colin strokes his own cock while Shane bangs his brains out. The look on Colin's face is priceless as he takes this fucking like a man. Shane keeps plowing hard and deep as strokes out a hot load of cum from his rock hard cock. The site of this turns Shane on and he's plowing harder and harder getting ready to blow his own load all over Colin. Colin is still milking his balls for the last drops of cum as Shane keeps banging. Shane is screaming out and talking shit as he works up his load. 'Mix your cum in with my cum.' Colin tells Shane and with that, Shane pulls out and blows his huge load all over Colin's face, chest, cock and balls. There's no dry place left as Colin is covered in hot cum from head to cock. They kiss long and deep and it's a wrap. We bullshit back and forth and the camera fades out.",
  "models": [
    {
      "name": "Colin",
      "person_id": 35064
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2007-03-15",
  "scene_id": 70066,
  "series": "Platoon Party 3",
  "tags": [
    "Gay"
  ],
  "title": "Colin & Shane"
}