{
  "collections": [
    "Active Duty"
  ],
  "description": "Scene 2: Elijah And Hops Break In Newbie Jonathan... We all know what a character ol' Elijah is from watching his many antics on both AD LIVE as well as his many videos. In this scene I throw him on the bed with a newbie, Jonathan. This was actually Jonathan's first scene ever (it was shot before his scene in Platoon Party 3) and I put Elijah in with him to see what Elijah can stir up. Much to my surprise, Jonathan is more than willing and eager to go and he ends up just kinda waiting on Elijah to make the first move. You can see the intensity building as he and Elijah chat back and forth. Elijah gets up to go find me, but Jonathan pulls out a hard cock to get the action started. What a hot fucker Jonathan is. This guy is so fucking sexy. I tell Elijah that someone else is on the way and once I've left the room he looks at Jonathan and says I wonder who's coming over. This initial conversation is priceless as we listen to Elijah reasons with Jonathan about the ins and outs of making good videos. Jonathan Gives Elijah A Run For His Money... Ol' Jonathan is ready and willing and he's hanging right in there with Elijah who is taking him through the moves. Elijah reaches over and starts stroking Jonathan's rock hard cock and Jonathan is really liking this. Elijah starts playing with Jonathan's nipples while he strokes his cock, licking and sucking them. The look on Jonathan's face in response to this new sensation is priceless. Elijah is obviously very pleased with his playmate. You can see the desire in his eyes as he plays with the big cock in his hand. Elijah is horny and he wants what's in his hand very badly. Jonathan reaches over and starts stroking Elijah's cock, too. This is so fucking hot to watch as these two get very comfortable with each other. The pent up tension and desire is enough to send you right over the edge even before the major action gets started. In a matter of a minute, Elijah is going down on Jonathan and sucking him good while Jonathan throws his head back in ecstasy. Jonathan is loving this attention. Have you ever had your asshole licked? asks Elijah. Not that I can say Jonathan replies. Elijah gets him in position to lick his ass with Jonathan straddled over his face. Elijah sucks and licks the hot ass in front of him as he tells Jonathan, wow, you've got a nice ass. Elijah goes back to sucking Jonathan's fat meat before he turns the reins over to Jonathan who latches on to Elijah's hammer hard cock and sucks it like a pro. Elijah is moaning with pleasure as Jonathan makes love to his cock. What a sight to behold. This rough, tough Marine is really getting into the business of sucking cock. Hops Joins The Party... While Jonathan continues to make love to Elijah's cock, Hops walks in the room with his hard cock in his hand and starts talking shit to the boys. I notice that when Hops enters the room, Jonathan's cock seems to get harder and harder until it's standing at full attention at the prospect of another playmate. Hops goes up behind Jonathan and starts stroking his cock from behind as Jonathan sucks Elijah and Hops stroked his own cock. In no time flat, Hops is on the bed between the boys with Jonathan sucking his cock. Get down on that shit, Rookie Hops tells Jonathan. Before you can say damn that's hot as fuck the two boys have ol' Hops throwing his head back in complete delight. He's loving the attention of these two cocksuckers as they share his fat meat. Hops jerks Jonathan's cock while the boys service his cock. Hops comments several times on the sheer talent of his cocksucking team. Elijah takes the balls while Jonathan handles the cock. Watching these two hotties work such a fine piece of meat is so hit. They are literally making love to it as Elijah licks the shaft and balls while Jonathan concentrates on the tip. Hops starts playing with Elijah's sexy little ass, rubbing the cheeks and fingering the hole. Hops Fucks Elijah's Hungry Hole... After the cocksucking of his life, Hops is ready for some hole. He bends Elijah over the bed while Elijah sucks Jonathan's cock and begins plowing Elijah long and deep. Jonathan is watching the action while Elijah's pays his hard cock close attention with his hot mouth. Elijah has both of his hot holes filled now and he's right at home. Elijah is loving the fat cock in his ass as he makes love to the fat cock in front of him. He's moaning with pleasure and Hops is too. Hops is liking the tight ass he's cramming full of cock tonight. As Hops fucks him faster and faster, Elijah sucks the cock in front of him harder and harder as he starts fingering Jonathan's asshole while he sucks his hard meat. Hops takes the camera and gets some hot shots of all the action from his point of view. Hops flips Elijah over on his back and starts pounding him hard as Jonathan positions himself over Elijah's face. Elijah sucks and licks Jonathan's balls while Hops bangs him hard. Elijah's asshole is spread wide and he's loving it. Hops is about to cum and Elijah looks up just as he blows his fat load all over Elijah's stomach. Thick, creamy, gooey jizz covers Elijah in pools. Jonathan can't resist the chance to play in the hot jizz as he reaches down and rubs it in all over Elijah as Elijah strokes out his own hot load and Jonathan works his up at the same time. Jonathan is the next to blow his huge load as he tells Elijah, Yeah you ready for this hot load? Yeah. I'm coming all over you. as he shoots a big, hot load all over Elijah's chest and rubs it in, mixing it in with Hops load. What a hot fucking sight. Lord somebody get me a fan. Elijah is so fucking horny right now he's about to explode as he moans and groans as the hot cum covers his entire chest and stomach. Elijah blows his load and it mixes in with his two playmate's hot loads as he licks the last of the cum from Jonathan's cock and takes a finger running it through the hot mixture of cum on him and crams the finger up his hot, freshly fucked ass.",
  "models": [
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Hops",
      "person_id": 35087
    },
    {
      "name": "Jonathan",
      "person_id": 35422
    }
  ],
  "release_date": "2009-03-15",
  "scene_id": 70069,
  "tags": [
    "Gay"
  ],
  "title": "Elijah, Hops & Jonathan"
}