{
  "collections": [
    "Active Duty"
  ],
  "description": "Barrett, Hops and Damien Hanging Out... Barrett Long, Hops and Damien are all hanging out at the house. Damien is scared shitless because I've been telling him for the last two days how huge the fucking cock is that he's gonna be taking soon. I mean I've never seen someone so terrified in all my life. It was actually funny because I knew for a fact that he was making things a lot worse on himself than they actually were, but I must admit I was having fun teasing him about it...even holding up a Pringles potato chip can and telling him it was about that size. So, I invite over Hops who has only done one video, Twin Soldiers 2 so he could help us get Damien broke in good to take Barrett's huge meat. Hops is his usual crazy self and we chat back and forth about his busted knuckles that he somehow had let hit some other guys head the night before. You should see the other guys grill he says holding up his skinned knuckles to the camera. I pick on him about always causing havoc. I accuse him of punching a wall just to have a story to tell. Barrett is sitting on the couch next to Damien and his cock is already out and hard. Hops is stroking and Damien is as well. I bullshit with Barrett and Damien a little before we get the action started. Damien looks over at Barrett's cock and I ask him if he's up for the challenge. Damien says yeah...you got the paramedics available just in case? Hops Gets Damien Primed Up... Hops is stroking his hard cock and looks over at Damien and says why don't you get over here and get things started. Hops starts fucking Damien's hot, wet mouth and moaning like hell as Damien gives him some of his best cocksucking skills. Hops is fucking his mouth hard as he raises his hips up from the chair and crams his fat cock down the twink's throat. All the while Barrett is stroking his huge fat cock over to the side. Hops is really enjoying Damien's hot mouth as he breathes hard and pumps it in his throat faster and faster. Hops is checking out Barrett's huge meat as Damien works his meat. Damien has learned a few tricks along his journey here at Active Duty and he's showing them to Hops as he drives Hops up the wall with his oral skills. Damien Latches On To Barrett's Monster While Hops Watches and Instructs... Hops has been watching Barrett stroke his big cock all this time and now he wants to see the twink suck on it while he watches and strokes his meat. He tells Damien to go get on that big dick and Damien obeys. Damien wraps his hand and mouth around the huge meat and goes to town giving it some oral attention. Hops watches and says shit like Yeah suck that big dick as Barrett talks shit as well. Damien is handling the monster quite nicely as Hops enjoys the show. Hops says Why don't we take this pretty boy back to the bedroom and give him that big cock. Barrett agrees with Yeah let's go fuck him. and Damien responds with a heated yeah! Barrett And Hops Take The Twink To The Bedroom For Some Real Fun... In the bedroom, Damien keeps sucking Barrett's huge cock while Hops pushing and guides his head down on the monster and strokes his own cock in unison. All the while, Hops is talking shit to Damien as he sucks the big meat that is about to fuck his ass hard. But first, Hops is gonna get his, too. Hops grabs Barrett's big dick and strokes half of it while Damien sucks the other half. Hops seems to be enjoying playing with such a big piece of meat. Meanwhile, Damien goes back to Hops cock and sucks it while Hops strokes Barrett. Hops says this is a fuckin' workout...feel like I'm on a ski machine lol. Damien must be doing just as good a job as he did back in the bedroom cause Hops is breathing all hard again. It's apparent that Hops is really turned on right now and Damien isn't missing a beat on his cock. Hops Is The First To Do The Honors... Hops tells Damien, Why don't you bend over the bed right there and suck this big cock while I fuck that ass for you. Damien says it sounds like a good idea to him and gets himself in position for Hops to bang his ass while he sucks Barrett. Hops gets into Damien's tight hole slowly but surely and eventually he's balls deep plowing it good while Barrett stuffs Damien's mouth full of his horse dick. Pretty boy likes this shit Hops says as Damien moans while Hops crams his ass full of his fat meat. Damien's ass is perfectly positioned so Hops can plow it good and the camera gets a good view of all the action. These are some really hot fucking shots of our Toy Soldier getting his fuckhole plowed out. Damien starts sucking and stroking Barrett hard and fast as Hops does the same to his tight ass. Hops throws Damien's left leg in the air and bangs him sideways nice and hard as Damien licks and sucks on Barrett's meat. Barrett laughs as he listens to Damien moan and groan and wonders what the fuck the little twink will do when it's his turn to plow that ass. It's All Ready For Barrett Long's Huge Meat..Deploy The Weapon Of Ass Destruction... Hops says he's ready to watch Damien take Barrett's huge fucking dick and tells Barrett it's all broke in for him. Barrett wastes no time getting himself in position to devour the young, tight hole. Just breath and relax. he tells Damien as he begins cramming all the fat, hard meat in his freshly fucked hole. Hops holds Damien's legs above his head and strokes his cock while Barrett makes his initial insertion. Hops has opened Damien up nicely and Barrett begins to slide every inch of his fat meat into our toy wonder. Damien is taking the huge cock like a champ in no time as Hops fucks his face and holds his legs. Things get a little rough as Barrett slams balls deep into Damien's hot ass. Damien isn't complaining though...he's taking it like a pro. Barrett rears back, winks at the camera and slams his huge meat all the way into Damien's ass several times over as Damien licks and sucks the fat cock in front of him as Hops talks shit to him. Barrett plows him long and hard and finally pulls his huge cock out and shoots his big, juicy load all over Damien's stomach, chest and face. Hops Goes In Once More To Work Out His Load... Hops decides he wants some more of that tight young ass and plows back in to get his load. Damien is hard as a rock by now and strokes himself while Barrett slaps his face with his fat cock and Hops plows his ass deep. Damien is taking this fucking good and Hops says his ass is clinching around his cock. Hops can't take much more of this good as and he pulls out to stroke his load all over Damien and what a fucking load it is. Huge, creamy load all over the twink boy. Damien has been used like he likes to be by two big dicked men.",
  "models": [
    {
      "name": "Barrett Long",
      "person_id": 35362
    },
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Hops",
      "person_id": 35087
    }
  ],
  "release_date": "2009-03-15",
  "scene_id": 70068,
  "series": "Long Deployment 2",
  "tags": [
    "Gay"
  ],
  "title": "Barrett, Damien & Hops"
}