{
  "collections": [
    "Active Duty"
  ],
  "description": "Colin, Shane, The Twins, Adam and Jonathan Hangin' Out At The House ... The camera comes on with Shane and Colin watchin' a hot porn in the living room while the twins are passed out on the couch behind them. We just got done cooking steaks on the grill and the twins are taking a little nap. Adam is sitting in a chair and Jonathan is chillin in at my desk lookin on. It's a typical weekend night around my place with hot men draped all over the place and with a crowd like this something is bound to unfold. Things move to the pool table where the boys start smackin some balls around and talking shit. Shane is the first to pull out his cock as Adam watches from the sidelines. Shane is rock hard and strokin for the camera as the other boys watch. Colin steps over and grabs Shane's cock and plays with it a little. Back at my desk our newbie Jonathan is sporting a raging hard-on in his jeans. He blames it on the good porn and I get him to pull it out for us to inspect. Without any hesitation his fat cock flops from his jeans and the camera takes a good long look. Off in the distance the camera catches another glimpse of Shane admiring his wood. Jonathan heads over to join Shane as the camera finds one of the twins strokin' his cock on the couch. He's hard and ready to go, too. Back in the pool room Shane and Jonathan are strokin' their cocks and Shane reaches over to give Jonathan a hand. Jonathan says 'Oh shit he's going for it. Let's see what he's got.' Jonathan reaches over and grabs Shane's cock and strokes it a little before Shane drops to his knees and starts sucking on Jonathan's cock. Jonathan says he's has to sit down to enjoy this and grabs a chair at the pub table while Shane gets on his knees in front of him and keeps working his cock over with his wet mouth. Before you know it the twins are standing beside the pool table with their pants pulled down to their knees and hard cocks flopping. Shane and Colin move in to help them and start sucking the brothers side by side. Jonathan moves over beside them and takes a spot against the pool table as Adam comes over to help him out with his hard meat. Adam is deep throating Jonathan's cock as Colin reaches over and slaps Jonathan's ass. Three hard cocks and three great cock-suckers are hard at work now as things begin to unfold. This is the kind of Platoon Party we dream these boys have in the barracks. Here at Dink's they can let loose without worry of interference. Three Hard Cocks and Three Hot, Wet Mouths Hard At Work ... The three cock-suckers lay their men on the pool table and keep workin' their hard cocks with their hot mouths. The twins and Jonathan are enjoying the oral exam while Shane, Colin and Adam work the cocks in their mouths nice and deep. The cock-suckers switch cocks and taste the others for good measure. Colin grabs hold of Jonathan and starts sucking him and grabbin' Jonathan's face and sucking his nipples. The twins finish stripping the rest of their clothes off while Shane and Adam take care of them. Everybody follows the twins lead and strip off all their clothes. Things take a turn and it's time to eat some ass. Asses In The Air, Tongues In The Holes ... The positions change and the Twins position themselves on the pool table in front of Jonathan and start sucking his hard cock while Colin eats their asses. Adam and Shane pair off and Adam sucks on Shane. Colin is handling the twin asses like a champ as he moves between them licking and tonguing their holes. The twins man the cock in front of them like champs, too. Jonathan says he's lovin' it. The twins share nicely with the cock and give it a good servicing. Adam is giving Shane a taste of his own medicine with the deep, wet blow-job he's giving him. Shane is in heaven as this hot little soldier works his cock for him. Shane moves over while Adam sucks him and starts sucking one of the twins while the other twin sucks Jonathan and gets his ass eaten by Colin. Colin moves around and starts tonguing Jonathan's ass while one of the twins gets his ass lubed up and ready for some cock. The other twin is busy fucking Shane's face while Adam keeps workin' Shane's cock. Colin moves over to this twin and starts eating his ass while the twin pounds his cock deep into Shane's throat. Jonathan prepares to fuck the other twin as we watch all this hot action unfold. Colin moves around to check out the hot ass on little Adam and starts eating away at it, tongue fucking Adam's hole as Adam works Shane. Adam and the twin start kissing each other while Shane sucks the twin and Colin eats Adam's ass. Meanwhile things have taken a turn at the other end of the pool table with Jonathan and the other twin. The twin has decided he'll fuck Jonathan first and all hell is about to break loose. Let's Get This Fuckin' Party Started ... The Twin tells Jonathan to 'just relax' as he starts plowing his cock into Jonathan. The twin is in and he's giving it to Jonathan good. Jonathan is warming up to this action quite nicely and beginning to let us know with his grunts and moans and oh yeahs that he's liking it just fine. Meanwhile back in the foursome, Adam has straddled Shane's cock and is sitting on it, as we watch every inch slide in slowly. Adam is a little tight so he shoves two fingers in to lube himself up. This boy is hotter than hell and always up for a good time. As we learned in 'About Face' where he teamed up with Elijah, Adam is ready for whatever comes his way. Adam is sliding up and down on Shane's cock like he's the star of a rodeo. Heehaw! Watching this guy take it is so fucking hot. (sorry I had to stop typing and regain my composure, troops). Colin is going down on Adam while Adam rides Shane and Shane sucks the other twin. The other Twin is still tearing Jonathan's ass up at the other end of the pool table. Colin positions himself over Shane's face and puts his ass in the air for the other Twin to plow. The twin moves in and slowly slides his cock in Colin's ass and starts fucking him hard. Shane is taking advantage of Colin's cock in his face and starts sucking it while Colin gets fucked above. Three Hard Cocks, Three Open Asses And Lots Of Fucking ... Shane takes Adam to the side and positions him on a chair and keeps banging his brains out while the one twin keeps banging Jonathan and Colin gets plowed hard by his twin. Shane has himself a real player on his hands with Adam. Adam is taking his fat cock like there's no tomorrow and loving every second of it. Colin's twin gets him down on the floor in front of the pub table and stands over him delivering some deep thrusts to Colin's ass. The other twin has positioned Jonathan on the edge of the pool table and keeps fucking him hard. Jonathan is loving this. Don't all good Marine's like a good hard fucking? I get some good close up shots of all the action. Meanwhile Adam and Shane have switched positions and Adam is riding Shane again and really getting into it. Shane is sweating and Adam is moaning loud. Shane is literally bouncing Adam up and down on his hard cock and Adam is taking every last inch down to the balls. Shane and Adam give each other a great lip-lock and suck face while the ass fucking continues. Colin's twin moves him to the edge of the pool table near where his brother is banging Jonathan. Shane and Adam switch positions again. It's one hell of a fuck fest in the works here troops as everyone fucks like wild animals. The twins are tearing up Colin and Jonathan and Shane is handling Adam. Things switch up with Jonathan and his twin and it's Jonathan's turn to rail his twin hard. Jonathan buries his fat cock in his twins ass and starts banging away. Jonathan's lean, cut body is beautiful as he bangs his twin hard. It's clear he's liking it and his twin is too. Colin's twin is still fucking him and now all the men have migrated back to the pool table where the serious fucking continues. Colin and Jonathan give each other a nice, long wet kiss as Jonathan bangs his twin and Colin gets banged by his. Colin is kissing everyone as he latches on to any mouth in site. Let The Cum Fly And Land Where It May ... Colin's twin is the first to blow his huge load in the group as he aims for Colin's nice back and ass and lands a touchdown. Jonathan is the next to shoot his huge load all over his twin's chest and stomach. A huge load it is. Shane shoots next and it flies over Adam's head and hits the railing of the pool table and all over Adam as Colin cheers him on. Colin blows next and lands his load all over Adam's chest and neck. Shane starts sucking Adam's cock while Colin kisses his neck as they help the little man to his load. Shane eats his lovers load as Adam blows a huge one. Jonathan's twin is looking on as he jerks himself watching the action and blows a huge load over his shoulder and all over himself. And that's a wrap. The party is over and we're glad you came.",
  "models": [
    {
      "name": "Twins",
      "person_id": 35049
    },
    {
      "name": "Colin",
      "person_id": 35064
    },
    {
      "name": "Shane",
      "person_id": 35144
    },
    {
      "name": "Adam Wells",
      "person_id": 35234
    }
  ],
  "release_date": "2007-03-15",
  "scene_id": 70067,
  "series": "Platoon Party 3",
  "tags": [
    "Gay"
  ],
  "title": "Adam, Bryan (Twin),Colin, Jonathan, Ryan (Twin) & Shane"
}