{
  "collections": [
    "Active Duty"
  ],
  "description": "Hops Joins The Fun And Tries Some New Things ... Hops appears out of nowhere like always with his cock in his hand, ready for some action. Todays he's gonna get more than he came for and more than he's ever gotten in any of his videos before. He jumps on the bed beside Tuffy who is still getting blown by Shane and watches and says I'm next in line on that. Shane loses the pants and the party is just getting started. It doesn't take Shane long to switch things up and move on over to Hops' fat fucking cock where he latches on for dear life. Hops asks Tuffy, Why didn't you tell me he was this good? and Tuffy just grins. Tuffy moves down to work on Shane's cock while Shane keeps doing his duty on Hops. Hops positions himself so he can play with Tuffy's bubble butt while the sucking continues. Hops Sucks His First Cock Ever ... We all knew it wouldn't take long and we were right! Hops hunkers down on Shane's cock to take his first cock ever in his mouth and what a hot scene it is to behold. He's a bit skittish at first, but it doesn't take long before he's working Shane's cock over like a pro. He's licking and slurping like there's no tomorrow. Shane positions himself so the two troops can share his gun and they do a mighty fine job of it. The boys are working it like a part-time job in no time flat. Hops moves down soon and starts sucking on Huffy while Huffy continues on Shane. The sucking goes around in circles and Shane ends up with both cocks in his mouth. Things end up with both Shane and Hops worshipping Tuffy's cock. Tuffy is loving all this attention as the boys take turns on his fat meat. The boys work Tuffy over so good he blows a huge load right there. Feels good to be back in the saddle. Shane Starts Eating Tuffy's Ass To Get It Ready For Phase 2 ... Tuffy tells Shane That ass ain't free, you gotta work for it. Shane gets the idea and starts munching on Tuffy's tight hole while Tuffy sucks on Hops. You like having that asshole licked? Shane asks. Hell yeah, you gotta work harder than that though. Shane continues working on Tuffy's ass. He's licking, sucking, fingering and getting it ready for the long awaited fuck. Tuffy is hot and ready and it won't be long before he's got Shane back in the saddle. Doctor's Orders ... After being away so long it's the doctor's orders that Tuffy get his ass fucked good and hard by these two studs and he seems more than ready for his treatment. Shane finds a lube shooter somewhere that was left over from our big Christmas party and fills it with lube to shoot up Tuffy's ass. Things take a twist and Hops becomes the physicians assistant as he hold Tuffy's cheeks apart while Shane does the preparations. The boys have a lot of fun with this scene as they play doctor with Tuffy's ass. Once the doctor lubes up his other instrument (Shane's cock) the insertion begins. Tuffy is being a wonderful patient as he takes this probing like a man. Aside from some initial grunting and pillow biting, Tuffy is ready for what he came for. Shane straddles Tuffs ass and starts plowing down hard into him. The Physicians Assistant Continues The Exploratory Exam ... Once Shane has opened Tuffy up really nice, he turns things over to his assistant, Hops. Hops takes the exploration to the next level as Shane feeds the patient his cock. They move Tuffy on his back after a few minutes and Hops keeps plowing his ass while Shane feeds him his cock. Hops is banging our soldier pretty hard. It isn't long before the loads start flying and Hops is the first to blow his hot load all over Tuffy's cock, balls and stomach. Shane follows suite and throws his load all over Tuff's chest. Tuffy asks to see these doctor's credentials, but they remind him that he's covered in their credentials already.",
  "models": [
    {
      "name": "Hops",
      "person_id": 35087
    },
    {
      "name": "Shane",
      "person_id": 35144
    },
    {
      "name": "Tuffy",
      "person_id": 35163
    }
  ],
  "release_date": "2007-05-17",
  "scene_id": 70072,
  "series": "About Face 2",
  "tags": [
    "Gay"
  ],
  "title": "Hops, Shane & Tuffy"
}