{
  "collections": [
    "Active Duty"
  ],
  "description": "Tuffy, Hops And Trey Come To Play ... This scene starts out with Tuffy and Hops in the shower as Trey watches and jerks his cock. Tuffy and Hops compare cocks as they jerk each other off under the water. It isn't long before Tuffy is on his knees servicing Hops hot cock. Tuffy takes Hops cock for a spin as he worships the big meat, sucking and slurping and getting into giving his fellow soldier some great head. Trey watches from the sidelines as he strokes his hard, fat meat. Hops Sucks More Cock ... Hops takes his turn at Tuffy's fat meat and works it over as a pro as Tuffy stands on the shower ledge above him to give him easy access. It's so hot to watch a novice cocksucker learn the ropes and Hops is catching on pretty damn quick. Tuffy seems to be enjoying his level of skill just fine. Hops looks over at Trey and says Stop jerking that fucking cock and get in this fantasy of yours motherfucker. Trey obeys and hurries over to join the fun. Hops joins Tuffy on the shower ledge and they feed the hungry Trey their two fat cocks. Trey says he can't decide which he likes best, he likes them both so much. The boys move their cocksucker to the shower floor and double feed him their hard meat. He's in cocksucker heaven and loving every minute of it. The boys stop just short of drowning our cocksucker and turn off the water. Getting things ready for the next phase in the bedroom. But before they go there, they get out of the shower and Tuffy sucks on Trey while Trey sucks on Hops. Trey can't hold back any longer and blows his first load all over Tuffy's chest. Off To The Bedroom For Some Ass Fucking ... As soon as the camera comes on in the bedroom, Hops is working his fat meat into Trey's tight ass as Tuffy feeds Trey his big hard cock. In no time flat, Hops is deep in that ass and Trey is grunting and moaning on Tuffy's cock while Hops plows his hot ass deeper and deeper until he can't go any deeper. He's balls deep inside Trey and Trey's cock starts getting harder and harder with his banging. Trey starts stroking his own cock while the boys use his holes. Hops is handling that ass like a wild horse and Trey is loving it. Tuffy takes hold of Trey's cock and starts stroking it for him and it isn't long before Trey is cumming again. He blows a huge wad while Tuffy strokes him and Hops bangs his ass hard. Tuffy Takes The Reins ... After Trey cums, Hops turns his ass over to Tuffy who straddles him doggy style and starts banging him good while Trey sucks Hops cock. They get rough with the fuckee as Tuffy bangs him hard and pushes his head down on Hops cock. Hops can't hold back anymore and he blows his huge load all over Trey's face and slides it back in his mouth. Tuffy is still banging him hard from behind as he works himself up to a cumshot, blowing his huge wad all over Trey's back and ass. Tuffy and Hops declare that Trey FNG just got handled. FNG got FUCKED.",
  "models": [
    {
      "name": "Hops",
      "person_id": 35087
    },
    {
      "name": "Trey",
      "person_id": 35161
    },
    {
      "name": "Tuffy",
      "person_id": 35163
    }
  ],
  "release_date": "2007-05-17",
  "scene_id": 70073,
  "tags": [
    "Gay"
  ],
  "title": "Hops, Trey & Tuffy"
}