{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden, Levi and Adam Get Comfortable ... Things kick off as usual with three super hot guys on the bed and a porn playing. I chat 'em up a little bit to start things off. Levi gets a few good jokes in on me teasing me about my southern accent. I leave the boys alone and they start chatting about usual everyday things. They talk about the drama with women and Kaden says they should buy a blow up doll to save themselves all the drama, but I've got other ideas in mind. About four minutes in and all the cocks are hard and Adam is staring at Kaden's long, nice cock with hungry eyes. Adam, licking his lips, looks at Kaden and asks, you want me to suck on that a little bit for you? Sure comes Kaden's quick reply and it's on, troops, like a pot of neck bones. Adam gets down to business on that fine cock of Kaden's and Kaden seems to be enjoying every second of it. I don't think I've ever seen someone make love to a cock like Adam is making love to Kaden's. Levi starts playing with Adam's cock while Adam works his magic on Kaden. Adam has such a gorgeous face and up next to Kaden's gorgeous cock it looks even better. These two Navy boys are complimenting each other quite well. Levi is jerking Adam, Adam is jerking Levi and sucking Kaden all the while. Kaden is kicked back in pure delight as he enjoys this excellent oral attention. Adam turns his attention to Levi's cock and Levi keeps giving Kaden's cock attention as he reaches over and starts jerking on Kaden's hard meat. Levi Takes His First Turn At Sucking Cock ... Levi is thrusting his cock deep as he fucks Adam's mouth and strokes Kaden's cock hard. You can feel the tension building and hear the moans start to sneak out here and there from all three guys. Kaden watches intently as Adam sucks Levi's cock and he gets his own cock jerked. Little Adam plays instigator and tells Levi I wanna see you suck that cock. I've never seen you suck cock before. Levi follows Adams suggestion and starts sucking on Kaden's cock while Adam eats Levi's nice, beautiful ass. Levi latches on to Kaden's meat and starts sucking it like a champ. The next surprise move you'll notice almost immediately is how quickly Kaden reaches beneath Levi and grabs onto his hard cock and starts stroking it while Levi sucks him. This was totally unexpected and I got so fucking excited. Watching Levi suck Kaden while Kaden strokes him will send you over the edge. What hot, pent up passion. So fucking sexy. If Kaden's hard cock is any indication as to how Levi is doing for a first timer then he must be doing pretty damn good cause Kaden is hard as nails. There's lots of hard breathing and moaning going on here and I'm sure you'll be right there with them as you watch this threeway unfold. Time To Share The Newbie ... Adam and Levi decide that it's only right to share and share Kaden's cock is what they do. Kaden continues to jerk Levi and even starts jerking Adam as they place themselves on either side of him to share his nice, hard cock. Adam sucks Kaden's nuts while Levi sucks his cock and the action heats up. These guys are into this. Adam starts sucking and licking Kaden's chest and nipples, moving eventually down to his nice, pink asshole where he licks and sucks and plays with Kaden's hole as Kaden keeps jerking on Levi. This seems to get Kaden all hot and bothered as he starts starring at Levi's cock intently as he strokes it. Kaden edges closer and closer to Levi's cock with his tongue hanging out. Time To Give The Bottom Boy What He Came For ... Adam decides it's time to get some cock in his hungry little ass and Levi is more than willing to do the job. Adam gets himself in position to get fucked and Kaden positions himself in front of Adam so Adam can tongue his hot hole while Levi plows Adam's tight little ass. In no time flat, Levi is slamming balls deep into Adam's tight little hole and Kaden is moaning away from the ass eating he's getting as a result. The harder Levi fucks his hole, the harder he eats Kaden's. Adam gives Kaden a rusty trombone as he gets plowed deep and hard from behind. Levi fucks like a jackhammer and Adam loves every minute of it as he moans and groans loud and cusses, oh God damn, fuck. Kaden grabs Adam's head and shoves his face deep in his ass to muffle the sounds. Kaden flips over to feed his hungry servant some cock while Levi keeps banging away. This scene is so fucking hot and at this point you are probably about to blow your own load. But wait, it's just getting started. It's Kaden's Turn To Plow That Tight Hole ... Kaden takes the reins next and saddles up to fuck Adam good and hard. Adam gets on his back for this rodeo and Kaden is in deep in no time flat. Levi positions himself beside Adam's hot mouth so he can get his stiff cock serviced while the boy takes on Kaden's long, thick meat. Kaden's cock is a bit longer than Levi's and it's going deeper and Adam says He's long. But that doesn't stop our bottom boy wonder from taking it like a champ. Adam starts really getting into the fucking he's getting and starts talking dirty to Kaden as Kaden plows him deep. Fuck me harder, come on, you like that fucking ass? Kaden bangs away like he's fucking some cheap hooker in a hotel room and Adam loves it. Pound me harder, come on don't stop fucking me. Adam continues. All you can hear is skin slapping against one another and deep, long moans, heavy breathing and shit talking as this fuck session heats up even hotter. Adam strokes his own hard cock fast and in just a minute he blows his hot load all over himself, splashing Kaden's stomach in the process. Adam looks up at Levi and says give me your load right on my face. But instead of taking on his face, Adam takes the whole hot load right into his hungry mouth as Levi explodes. Adam licks and slurps up all the hot jizz like a wild, horny animal. Adam then looks up at Kaden and says Yeah, now I'm ready for yours. Kaden pulls out and does the honors, leaving Adam soaked in his hot cum. Adam rubs all over Kaden's hot body, so hot to watch. Levi reaches down and takes Kaden's cum on his finger and feeds it to Adam. This ends out this scorching hot scene, troops. Now rewind and do it all over again.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Levi",
      "person_id": 35112
    },
    {
      "name": "Adam Wells",
      "person_id": 35234
    }
  ],
  "release_date": "2007-08-01",
  "scene_id": 70078,
  "tags": [
    "First Time",
    "Gay"
  ],
  "title": "Adam, Kaden & Levi"
}