{
  "collections": [
    "Active Duty"
  ],
  "description": "Hops, Colin And Levi Direct And Shoot Their Own Threeway ... <br />Back on the same Captain's bed as the last scene, Hops, Levi and Colin are chilling out and talking shit as the porn plays. The boys are causin' a ruckus and I'm get right in on it. Levi and Hops tell me how I should redesign the set. This gets me thinking. But then I sit the camera on the end of the bed and Hops points out that it's most likely gonna fall and I dismiss his advice and he says So what are we supposed to be doing? Direct, director! I assure him that by now they all know what's going on. I tell 'em to get something going while I get another beer and I leave the camera sitting on the foot of the bed still recording. Once I left, Hops takes it upon himself to double check and make sure the camera's recording. Hops is the first one to say OK, how we gonna get this started? And Levi simply replies that his cum shot is gonna be hard to get tonight 'cause he fucked some pussy the night before. I come back in the room and tell Hops that I can't be with him and hold his hand for the rest of his life and that he's gonna have to learn to take matters into his own hands. With that, I leave the room again. <br /><br />The Troops Take Matters Into Their Own Hands ... <br />To my surprise the boys are more ready to get going than I thought. In no time flat they are getting the groove on themselves without any direction from me. Colin and Hops get on each side of Levi and Colin starts jerking Levi as Levi jerks Hops and Hops jerks Colin. I come in and applaud their pioneering and suggest that Hops take the camera and film Levi and Colin for a bit. Hops is more than happy to direct and jumps right to it. While Colin and Levi aren't quite sure about the new directing situation, Hops is more than confident he's cut out for the job. He tells em to get it started and they take his direction well. He films from a perspective so that you see his cock as he strokes it too so that he's also included in the action. This is so much fun to watch as we see these guys totally raw and unedited do the best they can with what they have and a director that's gone MIA. Colin sucks Levi while Hops directs then Colin blows Hops while he films for a bit and then hands the camera off to Levi. Levi, we find, is quite the camera man and his control and his own eye are both impressive. <br /><br />The New Director's Shine As They Get Their Chance To Be In Control ... <br />From there they go to Colin laying on his back while Levi fucks his throat as Hops jerks his own meat in front of the camera. Hops positions himself above Colin and Levi strokes Hops while Hops continues to get all the action. Levi moves out of the way and Hops slides down and shoves his cock down Colin's throat next. Hops directs the two troops in a hot 69 with Colin on bottom. Hops makes sure to get all the important angles as he moves about the action. Colin takes the camera next and films Levi sucking Hops. Levi sucks Hops good as Hops moans and Colin joins in with his commentary about how hot it all is. Colin is quite good with the camera as well and we get yet another person's eye at the action which makes things interesting. Things switch up and Hops takes the reigns on Levi's cock and Colin is sure to follow. It becomes apparent that Colin loves Levi's ass as he gets plenty of footage of that bubble butt. Hops takes the camera again and gets Colin sucking both he and Levi as he does a side angle trick with the camera that turn out to be pretty hot. Levi mans the camera next as he films both Colin and Hops worshipping his cock. Hops tells Colin where Levi likes to be licked (as he learned from their last shoot together) and Levi agrees that Hops is right as Colin starts licking the lower shaft of Levi's cock in the spot he likes. The boys suck and lick and suck in unison and it's so hot it's hard to watch without just exploding, but there's too much more to watch to cum now. These two boys are mastering the art of sharing a nice cock. Things change up and Colin and Levi are sharing Hops cock once more. Hops is the reckless cameraman in this crowd, but it goes with the reckless territory that we've come to associate with our man Hops. The boys haven't caught on yet that Hops is still manipulating them into servicing him the most LOL. They quickly figure it out and make Hops work for his, too. <br /><br />The Director's Cover All The Bases ... <br />The newfound Flamingos have done a good job of covering all the bases. They've made sure they've all got sucked and all taken turns manning the camera as the other two perform or including all three in the picture at once with some clever camera maneuvering and they just keep hitting all the stops along the way as Hops films Colin eating Levi's ass and then Levi films Colin sucking Hops some more. They Only base they haven't covered is getting somebody fucked, but that, too, is about to change. Colin gets in positions himself in place to take a good fucking and Hops saddles up to do the first ride. Hops eases into Colin's tight hole as Colin lays on his side, giving the viewer the ultimate insertion view. I gotta give it to Hops, like Shane, he really knows how to break in a newbie as he lubes his cock while it's still in Colin's ass and moves slowly to prepare his bottom for what's to come. They get some great shots of Hops fucking Colin in several positions, but my favorite is when Hops straddles Colin from behind and Levi shoots it from above as we see that beautiful bubble ass get penetrated deep with that hot, fat Puerto Rican/Italian cock. Oh hell now. The tables change and Levi takes the reins as Hops mans the camera. You hear me come in the room and say to Hops, Why don't you let him fuck you? You scared? Antagonizing Hops is so much fun to do. Hops does quite a damn good job capturing a hot scene between Colin and Levi as Levi fucks Colin hard while laying on top of him. Colin tells Hops to come closer so he can suck his cock and tells Levi not to stop fucking him. Colin needs a break and Hops takes the change to film a close up of Colin's spread hole. So hot. The perspective here is just great as we watch these guys capture a hot, natural scene between themselves. <br /><br />The Curtain Closes And The Boys Should Take A Bow ... <br />Hops takes his turn on Colin's ass and fucks him good. Levi gets all the shots and even gets his cock sucked in the process while Hops fucks Colin's brains out. It isn't long before Hops is about to cum and Colin says Cum down on me as Hops blows his huge, fat load. And what a fucking load it is, my goodness. There must be a pint of cum splattered all over Colin's back and slaps his cock all over his ass. Colin says I think I turned you on. and Hops responds with an Uh hmmm. Up next, Levi is back in the saddle working toward his cumshot as Hops directs the action. To our surprise when Levi says he's gonna cum, Colin turns around to take the huge load in his mouth, almost gagging as Levi fills his mouth full of hot jizz that Colin oozes out. Hops asks the boys my usual questions about having fun and they say it was all they expected of the evening. Hops says Thanks for playing, as Dink always says and the boys look down into the camera one by one, Colin and Levi say Party like a rock star but our man Hops has his own saying, Fuck like a porn star and it's a wrap.",
  "models": [
    {
      "name": "Colin",
      "person_id": 35064
    },
    {
      "name": "Hops",
      "person_id": 35087
    },
    {
      "name": "Levi",
      "person_id": 35112
    }
  ],
  "release_date": "2007-08-01",
  "scene_id": 70079,
  "series": "Below Deck",
  "tags": [
    "Gay"
  ],
  "title": "Colin, Hops & Levi"
}