{
  "collections": [
    "Active Duty"
  ],
  "description": "Nate And Willie Get Acquainted ... Mike brings in a brand new recruit named Nate and puts him and Willie on a bed together to see where things go. Both Marines are sporting their cammies and hats and before you can say Show us the cock Nate is already hard and pulling down his pants. Mike is directing the newbie from the sidelines and getting all the shots we want to see. It's another uncut beauty to compliment Willie's uncut beauty. Nate is packing a pretty nice piece and he's more than willing to share it and show it off. Willie is checking it out with an Eagle eye and sizing it up. Looks like Willie wants to play with it. Nate pulls his pants completely off and the fun is on. Mike gets Nate to show off his nice hairy hole for us and what a nice ass it is. Willie is stroking his meat hard and fast as he watches Nate stroke his. You can just tell something else is bound to happen as these two Marines seem more than comfortable with each other. Nate pops the question to Mike So uh, what exactly I gotta do to get some more money? Mike says some of the stuff they talked about, but you can already see Willie gearing up. He knows that's his cue to go after Nate's cock and he does. Willie starts off sucking the uncut beauty and if you're not jealous of Willie for being so beautiful, you'll be jealous of him now for the beauty he's sucking on. Willie is taking what he's learned from past films and applying it nicely to Nate's cock. Nate is really getting into the attention Willie is giving him as he moans and fucks Willie's face. Willie pulls down his cammies and Nate starts playing with that perfect bubble butt of his, slapping it and being playful as he force feeds Willie his cock. Nate reaches under and plays with Willie's cock as Willie services him good. Nate's nuts start tightening up as our hero gets ready to blow his huge wad. What a huge wad it is. Nate floods himself with his hot cum as Willie strokes him hard.",
  "models": [
    {
      "name": "Nate",
      "person_id": 35396
    },
    {
      "name": "Willie",
      "person_id": 35397
    }
  ],
  "release_date": "2007-03-23",
  "scene_id": 70081,
  "tags": [
    "Gay"
  ],
  "title": "Nate & Willie"
}