{
  "collections": [
    "Active Duty"
  ],
  "description": "Travis And Trey ... All Dressed Up And Horny As Hell ... Travis and I meet up at a hotel where I team him up with Trey and these two big dicked Marines go at it like there is no tomorrow. Trey doesn't know that Travis is packing a little more dick than he is and he certainly doesn't know that he's about to take every last inch of it up his tight ass. We shoot the shit for a few minutes and I break the news to Trey that he's about to take all of Travis' huge cock. The look on Trey's face is priceless as we tease him about what's to come. I leave our two heroes alone for a bit to see what unfolds and the uniforms begin to slowly peel off. Trey talks about the chick on the porn and Travis being bi-sexual seems to be doing OK with it as well. There is small talk about measuring cocks and so forth as the cocks come out. Once the cocks are hard and waving in the wind they do a salute with their hats on top of their cocks. Even though Trey has been here before and Travis has fantasized about it, there is still a bit of nervousness between the two. It's these priceless moments where we get to see the realness of these guys. They still have a lot of kid in them and they use that kid to try and cover up their unease. Travis is ready to skip the bullshit and start pouncing as he begins to watch Trey's cock with intensity. He reaches over and grabs the big piece of meat and starts stroking it. Trey returns the favor and the two jerk each other. Travis Makes Trey Suck His Fat Cock ... Trey is kind of the submissive type and Travis is a bit dominant and it works out great as Travis just reaches over, grabs Trey's head and shoves it down on his fat cock. Trey takes orders well and Travis dishes them out like a Drill SGT. Trey's mouth is watering like a fountain as he takes the huge meat deeper and deeper in his mouth. Trey goes to say something and Travis says Shut the fuck up and keep sucking it. Didn't your mom tell you not to talk with your mouth full? I bet you can suck the chrome off a trailer hitch. Trey likes to be ordered around and it shows as he takes Travis' orders well. Travis starts slapping Trey's face with his fat cock and submissive Trey just takes it like the bitch he is. Travis stands up and says let me show you how to suck a fucking dick. Fucking suck it. I'm gonna stick my cock all the way down the back of your throat. Trey strokes his own fat meat as he sucks on Travis' nice cock. Funny how the pussy porn suddenly becomes obsolete at this point. Travis Returns The Favor And Shows Off His Cocksucking Skills ... Travis tells Trey to let him suck his cock now. Trey lays back on the bed and lets Travis do his magic. Travis is so hungry for a cock in his mouth at this point that he gets really excited and hunkers down on Trey's cock like white on rice. Trey says Travis is doing excellent, Just like the girls back home. Travis spits on the huge cock and keeps sucking it long and hard. Anytime a good cocksucker is having fun, his mouth is wetter than any hot pussy and he's slobbering all over the cock in front of him and Travis is at that point with Trey. He finishes Trey off by jerking his big, wet cock until it explodes. Travis Turns Trey Over For The Fuckin' We All Came To See ... Travis shoves his big cock back in Trey's mouth a couple more times just for good measure then tells his comrade to get on his fucking knees so he can fuck him. Trey, being easy to follow direction, does as he's told and throws his nice, sweet ass in the air for some pounding -- Semper Fi style. It isn't long before Travis is balls deep in Trey's ass and Trey is whining like the good bottom bitch boy that he is. Regardless of his seemingly resistant moans of death, this is where Trey really likes to be. On his knees taking a fat cock up his tight hole and Travis is doing a damn good job of giving it to him. Travis is a very verbal top and he talks shit to Trey the whole ride. Travis tells Trey to get on his fucking back and Trey says I love it. Trey tells him to shut the fuck up and get in position. Once he has him on his back, Travis shoves all his fat 10 inches up Trey's ass and the rodeo is on. Trey is taking every last inch of that big cock and he's doing it good. I didn't get dressed up for nothing says Trey as Travis pounds his ass good and hard. Travis ends out his ride by landing a huge load of hot cum all over Trey's stomach and chest.",
  "models": [
    {
      "name": "Travis",
      "person_id": 35158
    },
    {
      "name": "Trey",
      "person_id": 35161
    }
  ],
  "release_date": "2007-06-12",
  "scene_id": 70087,
  "series": "About Face 3",
  "tags": [
    "Gay"
  ],
  "title": "Travis & Trey"
}