{
  "collections": [
    "Active Duty"
  ],
  "description": "Travis, Shane And Damien Meet Up For Some Fun ... In the second scene we team Travis up with Shane (by request on both their parts) and Damien who has become our resident big cock taker. I mention how much Travis looks like Harry Connick, Jr. but he can't play the piano. He can blow a horn though and Shane says Well we are starting a new band. Shane says Travis can use his horn for his tryout and everyone just laughs. These are the fun times we have making these videos when everyone finds something to laugh about. We talk about how Travis has been a longtime fan of Active Duty. Before you can say, go on take off ya clothes, the boys are stroking hard cocks. Damien is the first to latch on to Travis' big cock and starts stroking the massive meat. Shane looks on in envy. Shane and Travis position themselves on either side of Damien and start feeding him their hard cocks. Damien sucks and strokes as Travis and Shane kiss each other passionately, tonguing each others mouths and really getting into it. Damien mans the shafts well as the Shane and Travis kiss and Damien sucks them good. It's a Threeway Suck-A-Thon With Damien, Shane and Travis Sharing Each Other ... Shane sneaks over and starts sucking Travis while Damien sucks Shane and then Shane moves down and sucks Damien while Damien sucks Travis. Then, Damien and Shane share the massive meat between Travis' legs as one sucks the head and the other services the shaft (yes, it's that big). Shane opens wide and deep throats the monster. Things switch up yet again and Travis is sucking on Shane's hard cock while Damien continues to service Travis. It's a cocksucker's heaven here today troops as these three get down to the business of servicing each other. Shane fucks Travis' mouth good and hard before moving around to eat Damien's sweet little ass and get it ready for the wild ride it's about to take with both his cock and Travis'. Shane strokes Damiens hard cock underneath as he eats Damien's ass. It isn't long before Shane summizes that Damien is ready to have his tight little asshole fucked. Shane Suits Up To Do The Honors First ... Shane gets in position to fuck Damien's little tight ass while Damien devours Travis' fat meat. Shane eases in as we see Damien start to really get into it. Travis says Damien sucks better cock when he's getting fucked as Shane pounds him hard from behind. Damien is sucking on Travis harder and faster as his own hard dick swings in the breeze. This is what our bottom boy wonder likes. He loves a cock in his ass and one in his mouth. He's such a horny little devil and it all begins to show when you get him in this position. Shane gives Damien a reach around for good measure and strokes Damien's hard cock while he plows deeper into his ass as Damien keeps the pace on Travis' monster. Shane Tags Travis In Next To Plow Damien's Wet And Ready Hole ... Travis gets right in Damiens waiting ass and starts plowing him hard and fast right away. Damien does is usual, oh easy plea as we begin to wonder if this is really code talk for Fuck me harder, come on give me that big dick. Shane is down below sucking on Damien's hard dick as Damien gets plowed by the huge cock. Shane reaches up and spreads Damien's ass cheeks so you can see that huge cock going in and out. Travis tags Shane back in for some more of that sweet ass as they use this twink boy up for all he's worth. Damien is in heaven as he's dominated by these two hot men. Travis positions himself so he can suck Damien while Shane plows him from behind. All the while, Travis is stroking his own huge meat to the tune the band is now playing. Shane can't resist and he reaches over while he fucks Damien and strokes Travis' hard cock. Damien says he's about to cum, but I tell him not to cum yet. Things are just getting started. Time To Ride The Donkey Dick Damien Style ... Travis and Shane position our bottom boy so that he can ride Travis' huge cock. This is one sight to see as our boy wonder takes every inch of the huge meat up his tight twink ass. Damien is bouncing on that huge cock like a pogo stick in two seconds flat. Travis' cock is balls deep in Damien's hungry hole and it's on -- like a pot of neckbones. Shane stands with his feet on either arm of the chair above Damien's face and fucks it good while Travis plows his hole. Shane reaches down again and spreads Damien's cheeks so we can see the huge cock do its damage. Shane goes so far as to take Damien's ass and manually help him ride the donkey. Damien's cock is still rock hard and since it's in Travis' face, he grabs it and starts stroking it while Damien rides his cock. Meanwhile, Shane starts feeding Travis his cock to keep his mouth occupied. Shane is the king of positioning and he positions himself right in front of Damien while Damien rides Travis and fucks Travis' mouth with his cock while hanging on to Damien. What a wild rodeo we have here, troops. Somebody get out the fans, it's hot in here. Flip And Fuck, Flip And Fuck ... They turn Damien around in the chair onto his back and Shane gets above and takes a turn on his sweet little hole while Travis stands above his face and fucks it good. Damien jerks his hard cock as the guys use him good. Shane fucks him good and hard like a jack rabbit before turning that nice ass back over to Travis for one more round. Travis switches places with Shane and plows Damien's open hole for all it's worth as Shane keeps Damien's mouth full and sucks Damien at the same time. From the sounds Damien is making he's in pure heaven here troops as he gets dominated by the two studs. They switch the position once more with Damien turned the opposite way in the chair and Travis keeps bangin his ass while Shane jerks his cock above Damien's face and Damien strokes his cock. Travis is banging that ass balls deep and Damien can't hold back anymore, he blows his huge load all over himself. Travis pulls out and strokes his huge load out, mixing it in with Damien's juice. Shane is the last and the loudest to go. He hoops and hollers and shoots a huge load (as always) all over Damien, mixing it in with all the cum that's already there. It's a wrap!",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Shane",
      "person_id": 35144
    },
    {
      "name": "Travis",
      "person_id": 35158
    }
  ],
  "release_date": "2007-06-12",
  "scene_id": 70088,
  "series": "About Face 3",
  "tags": [
    "Gay",
    "Threesome"
  ],
  "title": "Damien, Shane &Travis"
}