{
  "collections": [
    "Active Duty"
  ],
  "description": "Kasey Returns and He's Got Company ... Kasey returns after a long absence from Active Duty, but he's not doing a solo on this return mission. He's joined by two of our hottest bottoms here at Active Duty, Elijah and Adam. The camera comes on focused on Elijah who's been talking about how bad he needs this since he hasn't busted a nut in a couple of days. Elijah is horny as hell today and we're about to find out just how horny. He talks about the morning wood he had when he woke up, but that something told him I would take care of him today so he saved it and waited. And when he found out that he'd be joined by Kasey, his eyes lit up and his cock got hard. Kasey seems a bit nervous at first, but that's all soon to change as this trooper gets right in there and gives it his best. Kasey isn't one to be shown up and he certainly pulls his weight in this scene alongside Elijah and Adam. Elijah's eyes are locked on Kasey's cock as soon as he pulls the hard piece out of his swim trunks. You can just tell that Elijah is dying to get ahold of that nice hard meat. All the cocks are hard as soon as they come out and this scene is well on it's way to being the scorcher it becomes. Elijah Sets His Sights Dead On Kasey's Hard Cock ... Elijah can't seem to take his eyes off of Kasey's hard cock, he's gazing at it like he wants it really, really bad. He's not even really listening to the conversation as he focuses all his attention on Kasey. You can tell he's excited to have Kasey as a new playmate. Kasey is getting his fair share of sneak peeks at Elijah's cock, too. You can just tell these two are gonna set the room on fire and with Adam in tow it's a sure bet that we're in for a treat today. Elijah's ready to get this show on the road and he's the first to latch on to Kasey's hard cock and start sucking it good. Elijah's hungry today and he's really getting into sucking on a nice hard cock. Elijah shares the nice cock with Adam while he rubs Kasey's nice chest. Adam must be as hungry as Elijah because they're running neck to neck on sucking the fat meat. Elijah starts licking and sucking on Kasey's nipples while Adam mans the helm. Elijah And Kasey Share The Muscled Hunk ... They share the nice cock back and forth and Kasey says they are both really damn good. It's a coin toss, both of you are pretty damn good. In no time flat Kasey has his hand wrapped around Elijah's hard cock as Adam sucks his cock. Kasey didn't hesitate to reach out and latch on to Elijah's meat. Elijah fucks his own face with Kasey's hard meat as Adam goes for the chest and nipples. Adam plays with Kasey's balls while Elijah deep throats his hard cock. If Kasey's not in heaven, you'd never know as he really gets into the attention he's getting. Kasey is giving out plenty of moans of approval as these two hungry boys ravage this sexy muscled-up stud. Kasey goes back to stroking Elijah's hard meat again and he's doing a damn good job of it. You wonder just how long he can hold out before he has it in his hot mouth. He's looking at Elijah's hard cock in his hand intently, sneaking looks up to Elijah once in awhile to make sure he's doing a good job. Adam takes turns on the two hard cocks, deep-throating them in unison as Elijah and Kasey enjoy his hot mouth. Kasey strokes Adam's cock while Adam services the two cocks. Elijah takes the reins again and starts moaning and groaning while he sucks Kasey's cock. Adam goes around behind Elijah and starts eating his ass while he reaches under and strokes his raging hard cock. Adam positions himself below Elijah and takes all of Eli's cock down his throat before going back and eating Eli's tight, hot hole. Kasey Can't Hold Back Anymore And He Sucks Elijah's Hard Cock ... Kasey has stroked it, gazed at it and now he's sucking Elijah's hard cock. This was a big surprise to us all as Kasey jumps right in, head first and gives Elijah as good as he's been getting from Adam and Elijah. From the moans Elijah is letting out, it's obvious that he's liking Kasey's hot mouth wrapped around his rock hard cock. Kasey is holding his own as Adam sucks him as he sucks Elijah. I get some great shots of Kasey sucking Elijah's cock from below as we watch him go after Elijah's cock. Kasey doesn't just get it wet and that's all...he gets down and dirty on sucking Elijah as good as he can. He asks Elijah if he's doing a good job and Eli confirms with a hell yeah. The Boys Eat Kasey's Ass And Suck Him A Little More ... Elijah tells Kasey he wants to eat his ass out and they position Kasey over Adam in 69 position as Kasey strokes Adam's hard cock, Elijah eats his hot ass while Adam sucks his cock. This has got to be pure heaven for Kasey as he's getting serviced by two pro's who love what they're doing. Elijah spreads the muscle butt apart and shows off the nice pink hole that Kasey's sporting. Kasey Fucks Elijah Good And Hard ... Before you can say damn that's a nice ass to be eating the scene switches up and Kasey has Eli on all fours and is about to mount his ass for a long, hard ride. Elijah is more than ready as it's been a couple of months since anyone has fucked his hungry hole. Kasey saddles up and takes the ride. Elijah is extra tight and Kasey starts out slow, working his cock in Elijah's tight ass deeper and deeper. Once it's in, Elijah says Oh yeah...fuck me baby. Kasey takes the lead and fucks Elijah good and hard. Elijah gets into his moaning and yelping phase, he's hot-to-trot today, troops. You can tell he's been waiting on this the whole time. Kasey says Elijah's ass is tight and Elijah asks, Tighter than your girlfriend's? Kasey says yeah as he keeps fucking him hard. I get some good shots from above of Kasey's hard cock pounding in and out of Elijah's hot ass. Kasey starts long stroking Elijah's hot ass. Elijah sucks Adam's hard cock while Kasey plows his ass, moaning all the while like he's in heaven. Elijah's sweatin', but he ain't complaining. He's getting what he's been waiting on all day. It isn't long before Elijah's hot ass has Kasey ready to explode and he pulls out and blows a hot, huge load all over Elijah's cheeks and hole. Elijah Fucks Adam Good And Hard, Letting Out All His Pent-Up Aggression ... As soon as Kasey squeezes out the last drop of cum on Elijah's ass, Elijah goes straight in for the kill on Adam's hot little ass, letting out all the pent up aggression and working up the huge load he's been saving for several days. Kasey watches as Elijah tears Adam's hot little ass apart. Adam strokes his own cock, working up his load as Elijah plows him good and hard. Kasey rubs on Adam's chest and Adam tells Elijah to fuck him until he cums. Elijah long strokes Adam's ass deep right where Adam likes it. Adam shoots a huge load all over himself, squirting it on his arm, the bed and everywhere else. All the while Elijah is banging his brains out hard as he edges closer and closer until bam! Elijah blows his huge fucking wad all over Adam's stomach, mixing it in with Adam's cum. Elijah wasn't lying when he said he'd been saving it. This is one of the biggest fucking loads I've ever seen him shoot. There's cum all over the place. I'm sure the same will be true for you, too.",
  "models": [
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Adam Wells",
      "person_id": 35234
    }
  ],
  "release_date": "2007-08-15",
  "scene_id": 70086,
  "tags": [
    "Gay",
    "Threesome"
  ],
  "title": "Adam, Elijah & Kasey"
}