{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden And Colin Get Acquainted ... Things kick off with Kaden and Colin naked on the bed with nice hard-ons. Colin is stroking alongside Kaden and things are already off to a great start. They bullshit back and forth about music, cars, etc. and then start talkin' about tats and working out as they sneak peeks at each others bodies. Colin finally asks Kaden what he wants to do today and Kaden starts checking out Colin's cock. He says, You look pretty hard there. That's a pretty big dick you got. as he reaches over and grabs Colin's cock and starts jerking it. Kaden strokes Colin as his own dick jumps up and down, hitting his stomach. Colin says Kaden's chest is turning him on as he moves over and starts rubbing and sucking on Kaden's nipples. Colin licks up and down Kaden's chest and abs before taking his hard cock in his mouth. Colin starts sucking Kaden as Kaden kicks back and enjoys the ride. Colin gives Kaden's cock a good long sucking as Kaden checks out Colin's nice ass. Kaden reaches over and starts rubbing and playing with Colin's nice bubble butt as Colin continues to feed on that nice, hard cock. Kaden starts pushing Colin's head down on his cock deeper and deeper. Kaden gets on his knees and starts feeding his cock to Colin as he fucks his hot mouth. Kaden seems to enjoy this position as he throat fucks Colin with a super hard cock. Colin gets on his back below Kaden's balls and gives them a good washing as he sucks Kaden's cock. Colin Gives Kaden's Ass Some Extra Special Attention ... It's in this position that Colin finds Kaden's nice, tight ass and starts licking it really good from below. Kaden loves to get his ass eaten and Colin seems to be doing a damn good job of it. Kaden gyrates that pretty bubble butt all around on Colin's face as Colin tongues it nice and deep. Kaden is moaning at this point in the game and looks down at Colin and says I want you to really eat my fucking ass as he moves to position himself on his hands and knees with his back arched good so Colin can get his tongue deeper in his nice pink hole. Getting his ass eaten seems to be one of Kaden's favorite things as he really gets into it, moaning and twirling his nice ass around in circles as to be sure his asshole gets some of Colin's tongue on every inch of it. Colin is doing a fine job of covering all the territory as he laps on Kaden's hot hole thoroughly. He reaches under Kaden and pulls his hard cock back so he can lick on it, too. Colin wants is to see what a nice hole he's licking as he spreads Kaden's ass to reveal his bright pink hole. Kaden's cock is hard as a brick and Colin keeps sucking on it in between licking that nice, hot ass. Colin keeps those cheeks spread open good so we can get a full view of the pink pucker as he works Kaden over good from behind. Kaden starts fucking Colin's face from this position and it's really hot to watch. I've never seen that before. Colin Gets A Finger In Kaden's Tight, Pink Hole ... Colin seems to sense that Kaden is enjoying the ass action and he really gets into it. I think he's as fascinated by Kaden's beautiful ass as we are and he gives us some very good shots of it spread open nice and wide as he sticks his finger in Kaden's hole. Kaden is moaning and groaning all the while and isn't complaining one bit. I think Colin has found something that Kaden really likes and he's taking full advantage of it. Colin finger fucks Kaden as Kaden's hard cock flaps in the breeze, at full attention. Colin flips Kaden over on his back and keeps working his cock and ass over with his mouth and finger. Colin takes his two thumbs and spreads Kaden's asshole open and says, Man that's pretty and it is. What a beautiful asshole Kaden is sporting. Colin is getting really horny from all this action and playing with Kaden's asshole must have his own asshole ready for some action. Colin looks at Kaden with his hard cock bouncing on his stomach and says, You wanna fuck me, now? Kaden doesn't hesitate and smiles as he tells Colin Hell yeah I wanna fuck you. Kaden Anchors Himself Deep In Colin's Tight Bubble Butt ... Colin throws that nice bubble butt in the air, arches his back and invites Kaden's stiff cock deep in his hot hole. Kaden works his rock hard cock slowly into Colin's waiting hole, as Colin grunts and groans. Kaden's sporting a long, thick cock and Colin is finding out now just how long and stiff it is. Once Kaden's got his cock all the way in, he starts fucking Colin fast and deep. Kaden is a jackhammer when he fucks a nice tight ass and Colin is quickly finding out that he's about to get a good hard fucking from this built, ripped stud muffin. These two hotties bodies compliment each other so well. Colin's nice ass in the air is enough to send anyone over the edge, but throw Kaden behind it, plowing it deep and hard and you're sure to loose it right here in this scene as Kaden manhandles Colin's hot ass. Kaden pulls Colin to the edge of the bed so he can get in his ass even deeper and he does. After a little while he throws Colin on his side with one leg in the air and goes after the hot hole from a perfect angle as we watch his hot cock go balls deep in Colin's hole. Colin strokes his cock while Kaden pounds his ass. The position changes again, this time with Kaden standing flat-footed on the bed above Colin's ass and pounding down deep and hard into Colin. Kaden isn't showing Colin any mercy as he fucks the hell out of him. He almost fucks Colin right off the bed as he pounds his ass harder and harder. Kaden flips Colin on his back for the final ride and fucks him hard as Colin strokes his own cock fast and hard. I'm gonna cum all over you. Kaden says and pulls his cock out and blows his huge load all over Colin's stomach. He rubs his cum into Colin's skin and looks at the camera and says, That was some good ass! I get the two of them to get on their hands and knees side by side and give us a great shot of those fine asses together and as they say, that's the end!",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Colin",
      "person_id": 35064
    }
  ],
  "release_date": "2007-08-15",
  "scene_id": 70085,
  "tags": [
    "Gay",
    "Rimming"
  ],
  "title": "Colin & Kaden"
}