{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden, Kasey, Adam And Damien Size Each Other Up ... Things kick off with Kaden and Kasey on the bed together and Adam and Damien on the couch. This two-way double-up is about to turn into a fierce four-way fuckfest, but there's some ground to cover on both the couch and the bed before we get to that. My camera finds its way from Adam and Damien's beautiful faces to their rockhard cocks and then focuses itself on Kaden and Kasey as they stroke side-by-side on the bed together. At the foot of the bed our two hot bottoms let the tops have some time alone while they have some of their own. Kaden and Kasey are already naked and hard as bricks by the time my camera zooms in. These two troopers are ready for action. Kaden has never sucked cock before, but all that is about to change today. The porn plays on as the eyes begin to wander. Kaden is sizing Kasey up and deciding his plan of attack. If this is going to be the first cock he's going to suck he wants to be sure it's going to be good. Our delicious twinks stroke their hard cocks while our muscle boys stroke theirs. Kasey sneaks a few peeks over at Kaden to size him up and all looks a go. These two are obviously attracted to each other, but who's gonna let it be known first? These two compliment each other so well that you'll be mesmerized by the mere site of them side-by-side for quite awhile just watching them watch each other. If you haven't fainted already, prepare yourself because when Kaden asks Kasey if he needs a hand and the two of them start stroking each other's cocks it's likely to finish you off. But don't die on us just yet. Things are just getting started. Kaden Sucks Cock For The First Time ... After stroking each others cock for awhile, things heat up even more when Adam decides to help Damien out at the foot of the bed on the couch they're sharing. Kaden and Kasey follow their lead and Kaden is on Kasey's cock in no time flat. This is Kaden's first time at bat with a cock in his mouth and he's sucking and stroking in no time flat. We're about to watch a wild oral ride as these four heroes give as good as they get. Kasey's really getting into this first-timer's skills as Kaden gives the hard cock a run for it's money with his virgin mouth. If Kasey's hard cock is any indication that Kaden is right on the money, then Kaden is battin' a thousand. Kasey decides to make things easier for his cocksucker and positions himself on his knees in front of Kaden to give him better access. Kaden lays flat on his stomach and mans the helm as he gets more comfortable with a cock in his mouth and hones his skills with hands-on experience. Kaden tells Kasey his cock taste good as he sucks it harder and faster. Kasey is enjoying the ride. Just the sounds alone of Kaden's slurps will drive you as wild as that hot mouth seems to be driving Kasey. These two were a match made in military manlove heaven. Kaden doesn't tire easily as he keeps sucking long after most first timers would have taken a break. There ya go, just like it, yeah Kasey tells Kaden as Kaden takes his time worshipping at the shaft. I had to stop writing this to get some fresh air for fear I'd faint. I hand the camera off to Kasey to get his perspective on things and it's hot as all get out. As he's filming Kaden suck his cock he asks Kaden if he'd like him to help him out. Kaden is all for it. Meanwhile Adam And Damien Work Each Other Over, Too ... Meanwhile at the foot of the bed on the couch, Adam works Damien's hard cock over with his hot, wet mouth. These two have a great chemistry together as they keep themselves busy while their comrades get acquainted on the bed. Adam is deep-throating Damien's long, hard cock and sucking and licking it. Watching him work the shaft and head of Damien's cock is so hot to watch. Adam is a natural and always comes through when it's time to show his partner a good time. Damien is loving the attention he's getting. For once, he may have found someone as submissive as himself. Adam makes love to the cock as Kasey and Kaden watch the two bottom boys get each other ready. Kasey Takes His Turn On Kaden's Cock And The Oral Training Continues ... The camera finds itself back on Kaden and Kasey and this time Kasey's hot mouth is on Kaden's hard cock as he sucks it nice and hard. I tell Kasey to hunker down on that thing and he takes time to catch his breath and comment on how big it is. Kasey's a trooper though and not one to give up too easily as he takes the monster back in his mouth and pampers it with his oral loving. Kaden kicks back and watches both Kasey sucking his cock and the two twinks on the couch as Adam keeps working Damien's hard cock for all it's worth. Kasey's back in the camera's eye with Kaden's cock down his throat. Kasey asks Kaden if he likes it and gets a mmm. hmmm. moan from Kaden. Kaden is rock hard, so hard his balls move up and down as Kasey strokes his cock and sucks it. Always the considerate one, Kaden reaches underneath Kasey and latches onto his cock to stroke his buddy while his buddy sucks him. That's watching out for your fellow man and Kaden is good at doing just that. The action keeps getting hotter as the boys keep getting hornier. Kasey keeps sucking Kaden and Adam keeps working Damien. Kasey and Kaden rub each others chest and comment on how nice the other is. These boys work out hard and they appreciate the other. The Hot Twosomes Finally Become One Fiery Foursome ... Kasey asks Kaden if he thinks they should invite Adam and Damien into their fold and Kaden agrees. Adam takes on Kasey's hard cock while Damien latches onto Kaden's and it's a foursome made in muscle-twink heaven as our two muscled-up heroes get their own hot bottom boys. Adam and Damien watch each other as they service their buddies, sizing up one another's expertise. It's hard to tell who's outdoing who as these two both do a damn good job at working the cocks over. Kasey and Kaden both agree that their hot mouthed boys are better at this than they are. Adam and Damien work the hot cocks over and get their hot muscle men worked up to give them the fuck of their lives. They switch up and Damien takes the helm on Kasey's cock and Adam hunkers down on Kaden while Kaden takes the camera and films it from his perspective. Hot, hot, hot! Adam gets down on Kaden's rock hard meat like a true soldier of lust. The candid cam switches up and Kasey takes the camera and films Damien working his cock over. Adam and Damien talk each other up as they devour the hard cocks. Won't be long before somebody's getting fucked good and hard. Kaden Makes The Call And It's Time To Fuck ... Kaden looks over at Kasey and says I think it's time we fuck these boys and with that, it's on. Kaden works his way into Damiens tight waiting ass. Damien has his back arched perfectly waiting on the hard cock to touch his hot spot as Kasey prepares to fuck Adam on the other side. Kaden is banging Damien good and hard just the way our bottom boy likes it and that nice little ass is complimenting that big muscled body just perfectly as these two turn up the heat. Watching Damien get fucked by Kaden is something to behold. They just look so good together. Meanwhile Kasey is preparing to begin his plow into Adam's hot ass behind Kaden, as they lay long ways on the bed behind Damien and Kaden. Both hard cocks are in both tight, hungry holes and all hell breaks loose as the fucking gets wild. The bottom boys are getting their brains banged out by our muscle tops and it's on like a pot of neck bones, troops. The moans are nice and load and the fucking is intense. Adam reaches over while Kasey is banging him and Kaden is banging Damien and slaps Kaden's rockhard ass a few times. The Bottoms On Their Backs And The Legs In the Air ... They switch things up and put the bottoms on their backs as they tear into them harder. Damien's head is at Kasey's feet and Adam's head is at Kaden's and the bottoms are watching each others faces as the tops watch each other plow the other's bottom. What a hot position for everyone to see the action from both ends. Our bottom boys are jerking their cocks to the bang of the cocks in their asses and it won't be long until the cum is flying. Kasey is the first to cum and he blows a generous load all over his bottom contender as Adam rubs the hot cum all over his chest. This sets Adam in motion as his own load quickly follows Kasey's and lands right on top of the slippery mess. Less than ten seconds later Damien makes that famous moan and his load squirts all over his stomach and chest like a perfect work of art. Kaden follows in hot pursuit and lands his load on Damien, mixing the cum in with Damien's hot juices. This all happens just like good sex is supposed to troops and there isn't one beat missed in the making of this love song. Thanks for playin'!",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Adam Wells",
      "person_id": 35234
    }
  ],
  "release_date": "2007-08-24",
  "scene_id": 70090,
  "series": "Below Deck 3",
  "tags": [
    "First Time",
    "Gay"
  ],
  "title": "Adam, Damien, Kaden & Kasey"
}