{
  "collections": [
    "Active Duty"
  ],
  "description": "Our Big Dicked Blonde Marine Meets Up With Damien ... <br />Many of you will remember meeting Christian at our 2007 LIVE Christmas Party where is big cock was quite the hit. He also talked to many of the chatters after the show in the chat room. Well, this big-dicked blonde Marine is back in his first video ever here on Active Duty and what a hot one it is. Christian e-mailed me a few weeks before one of my NC trips and being he was so close, I decided to bring him in and team him up with some of the Carolina boys. Christian is a really sweet guy that doesn't talk much, but that doesn't mean he doesn't know how to tell you exactly what he wants. He told me he wanted to work with Damien so I bring in Damien and let the two of them get acquainted. Damien is hard as soon as the camera comes on as he and Christian lay side-by-side and I leave them alone. Christian's eyes are all over Damien's cock and it isn't long before he's asking Damien to help him with his big cock. Damien is quick to oblige and dives right in, working the monster up as it quickly gets hard in Damien's hot mouth. Christian reaches under and strokes Damien's cock while Damien works his meat in his mouth. Damien's back is arched and ready as he anticipates how this big cock is gonna feel in his hot, hungry hole. <br /><br />Christian And Damien Swap Blowjobs ... <br />The boys go back and forth sucking and stroking each other's cocks as Christian gets his first taste of Damien as Damien strokes Christian's big cock. These two seem to be a match made on the battlefield. They're really into each other and I film quietly, looking on as the action heats up more and more. Christian is worshipping Damien's cock while I get some good shots from beneath and above. In a flash, Damien is back between Christian's legs deep-throating the fat cock as best he can and Christian is loving every second of it. Christian gets into a rhythm of fucking Damien's throat. Soon, they change positions and Damien stands above Christian and feeds him his cock while he continues to suck and slurp on Christian's fat meat. Damien fucks Christian's face for a while as he strokes and sucks Christian.<br /><br />Christian Eats Damien's Hot Ass And Gets It Ready For His Nice Fat Cock ... <br />It isn't long before this position turns more into Christian eating Damien's nice ass (who wouldn't eat that cute little bubble butt if it were in their face?) and the tables turn with Damien on his hands and knees and Christian worshipping at the mounds. Christian really gets into eating that ass good and hard, licking, slurping, going down to Damien's balls, slowly back up and burying his face and tongue deep in Damien's hole. Damien strokes his cock in anticipation of what's about to come next. Christian misses no beat as he sucks and licks Damien's cock, going back up for more of that hot ass as he slaps Damien's cheeks. <br />Damien Says He Ready For That Big Cock And Christian Delivers ... <br /><br />After his ass has been eaten and is hot as a firecracker, Damien wants something bigger and hotter in his hungry hole and Christian delivers his wish. Christian eases his fat cock into Damien's ass as Damien lets out long moans of approval. Once he's in, he starts thrusting in and out of Damien's ass fast and hard and Damien is loving it. Damien starts bouncing back on that cock meeting its thrusts in the middle to bury it as deep as he can in his ass. Meanwhile, Damien's hard cock just bounces in the wind. He's liking this. Christian gets in close and deep as he lays forward on Damien's back and reaches under to stroke Damien's cock. Damien finally takes the reins and starts stroking his own cock furiously as Christian plows in and out of his hole with his big meat. Christian turns Damien over on his back, throws his legs in the air and tears into his ass harder and harder. Damien strokes his cock as he gets banged hard. <br /><br />Christian Eats Damien's Cum And Blows His Own Load ... <br />Just as Damien is about to cum, Christian grabs his cock and strokes the load out, leaning down and taking it in his mouth, squeezing every last drop from Damien's cock and licking it up. Damien shakes and shivers all over as the sensitivity overtakes him. Christian quickly follows suit and blows his load all over Damien's stomach and then strokes their cocks together, releasing anything that's left. To end things out, Christian moves up Damien's chest and meets his mouth with his own lips and they lock in a kiss that leaves Damien dazed and confused. Damien says it feels like he just fucked a fan. Me thinks these two might have fallen in love.",
  "models": [
    {
      "name": "Christian",
      "person_id": 35060
    },
    {
      "name": "Damien",
      "person_id": 35071
    }
  ],
  "release_date": "2007-12-13",
  "scene_id": 70096,
  "series": "Hot Zone 3",
  "tags": [
    "Gay"
  ],
  "title": "Christian & Damien"
}