{
  "collections": [
    "Active Duty"
  ],
  "description": "Christian Meets The Twins ... The twins show up on the scene and they are looking better than ever. They've been pumping the weights and their bodies are really looking good. I leave the twins and Christian alone and go check the laundry. Once I'm gone, it doesn't take long before all three cocks are rock hard and the twins are all over Christian's cock like white on rice. One twin sucks while the other one feeds and Christian is in the middle of double pleasure as he gets sucked and sucks a twin. What a dream come true for a young horny Marine. The twin getting sucked says the Marine Corps has been teaching this boy something right...Hoorah! The twin doing the sucking is playing with his own asshole as he sucks Christian's cock and gets it ready for some action. These three are having a blast as they get down to some serious oral pleasure. The twins trade places and it's deja vu. I can never tell which is which so I just go with the flow. Christian Fucks His First Twin While He Sucks The Other ... What better feeling could one have than to have his cock deep in one brother's ass while he deep throats the other brother's cock? Christian can tell you after this video as that's what happens next as the action moves forward. Christian eases slowly into the twin's asshole as the twins show him what doubling your pleasure is all about. One twin tells Christian to fuck his brother like he was a chic on prom night. These two are so crazy. Christian keeps the pace as he fucks one ass and sucks another cock. The twins are right on point as always with keeping the action hot and moving. Christian Takes His Turn At Getting Fucked ... The twins decide that it's time for Christian to take some cock up his ass and they put him in position and one goes in for the drill. Christian sucks the other one as one of the Twins says All you got is getting filled up, boy Christian says Marine's can handle anything and he does. Christian reaches back and slaps the ass of the twin that's fucking him. The other twins says he thinks Christian sucks dick better with a dick in him. All the while our twin bangs Christian's ass hard and fast. Christian Takes The Second Twin Up His Freshly Fucked Ass ... After the first twin has broken the seal, the second twin moves in behind Christian and takes his turn at fucking the nice, loosened up ass. This twin is kind enough to give Christian a reach around as he strokes Christian's cock while he fucks his ass hard. Christian is sucking the other twin like there is no tomorrow. Christian must be a hell of a cocksucker as the twin he's blowing blows his load all over Christian's neck. The other twin quickly follows from behind and blows his load all over Christian's ass. They lay the Marine down and he works out his own load as one of the twins sucks his nipple. They shoot the shit for a minute after and Christian says he should make them honorary Marines. One twin says he likes the way that sounds and the other says he can dig it. It's a wrap. Thanks for playin'.",
  "models": [
    {
      "name": "Twins",
      "person_id": 35049
    },
    {
      "name": "Christian",
      "person_id": 35060
    }
  ],
  "release_date": "2007-12-13",
  "scene_id": 70097,
  "tags": [
    "Gay",
    "Twins"
  ],
  "title": "Christian & The Twins"
}