{
  "collections": [
    "Active Duty"
  ],
  "description": "The Twins, Kasey and Kaden Are In The House ... <br />Whenever the twins are around, there is bound to be trouble as these two scamps always bring it with them. These boys have come a long, long way since Twin Soldiers with our man Dean and they've come along quite nicely. These two little bulldogs are always ready and willing and when they see the muscle boys I've paired them up with you can see the excitement. The twins are the shit talkers and always keep something going. Today is no exception as they talk pure cat shit and have Kasey and Kaden laughing. The twins are so competitive with one another that it always makes for a great show. In trying to outdo one another, they keep the heat so hot that it's out of this world. <br /><br />Double The Pleasure, Double The Fun ... <br />After the bullshit is out of the way and the comfort level has been reached, it's time to get it rollin'. Everyone starts out stroking their cocks and getting it ready. Five minutes in and there's a room full of hard dicks. These guys came to play and they're ready now. The twins stroke their cocks while Kasey and Kaden strokes their own. One of the twins is the first to break the ice as he grabs onto Kasey's cock and starts stroking and sucking it. His brother follows suit as he latches onto Kaden and the party is on. The twins are really going at these two hot cocks and enjoying every second of it. Watching these two identical beauties is worship these two hot cocks is one hot site. Our twin wonders are deep throating the hell out of these cocks. It's hard to tell which twin is sucking the better cock and it's hard to tell who is enjoying it the most. This is hot action as it unfolds. There is no doubt our man Kaden is enjoying himself as he moans that famous moan and watches his twin suck his cock as if it's the best pussy porn he's ever watched. Kaden loves to get that cock worshipped and our twin soldier is worshipping it for all it's worth. Kaden moves up on one knee to give his cocksucker better access. Kaden grabs his head and face fucks the twin as the brother works Kasey's cock slow and deliberately. I go underneath and get some great shots of the twin working Kaden's cock as we see Kaden's hot ass right in focus. <br /><br />Let The Double Fuck Begin As Our Muscle Tops Saddle Up ... <br />Things move seamlessly into the fucking as Kaden and Kasey saddle up for the ride. Their twins position themselves perfectly to take the big cocks and Kasey sinks deep into his twins ass while the twin spreads his cheeks wide to take the fat cock. Our little bulldogs are shoulder to shoulder both with hard cocks balls deep in their identical asses. They are moaning and whining at the top of their lungs as Kaden and Kasey rail those holes good. The twins clutch each others shoulders and hold on tight as our top men give it to 'em good and hard. Kasey's twin starts really getting into it as he rears back and pounds his ass against Kasey's cock, fucking his own ass while Kasey just provides the cock. <br /><br />Two Twin Soldiers Ride Away ... <br />Kasey's twin takes things into his own hands and ass and hops on Kasey's cock and takes it for a long, hard ride. Our brothers are horny as all get out. It's been awhile since they were in the saddle and they are giving us their best today. I don't think I've ever seen the twins this vocal and horny before and Kaden and Kasey are right up there with them, keeping up with it all. Kaden fucks his twin while his twin is on his back with his legs in the air. Kaden is banging his twin hard and fast as his nice, muscle ass shines for the camera. Kasey throws his twin on his back beside his brother and the position takes the same mold as the position with Damien and Adam in the first scene. Such a good position to see all the action. Our twins lock their legs around one another in a clutch to hold each other in place while our boys pound them harder and harder. Kaden's twin rests his foot on Kaden's chest and what a hot visual for all you foot lovers. These four troopers were a foursome made in porn dreams and you're living that dream as you watch. The awakening is on its way as our heroes get close. Kaden's twin is the first to blow and he lands a home-run all over himself as his cock squirts a thick, juicy load of jizz all over the place. Kasey is the next to blow as he lands his load on his twins hand. His twin follows with a hot load all over the comforter as his brother watches his twin load land right next to him. Kaden is the last, but certainly doesn't cum the least as he lands part of his load on his twins face. The jizz is all over the place and by now it should be all over you. The four troopers have taken us to the edge and beyond.Ó",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Twins",
      "person_id": 35049
    }
  ],
  "release_date": "2007-08-24",
  "scene_id": 70091,
  "series": "Below Deck 3",
  "tags": [
    "Gay",
    "Twins"
  ],
  "title": "Kaden, Kasey & The Twins"
}