{
  "collections": [
    "Active Duty"
  ],
  "description": "Barrett Long, Shane, Elijah, Levi and Adam ... <br />It's another Saturday around the house and all the guys are shooting the shit and having some beers as I see what I can stir up. I take Levi outside for a while and talk to him about his latest experiences before we come back inside to find the rest of the boys shooting pool and the shit. I give Elijah a hard time about everybody loving a big dick and we just laugh. I love Elijah so much. He's right up there at the top of my favorite people list. And I really mean that with all my heart. I love this guy something serious. He's so uninhibited and so willing and ready to have a good time and participate like a good sport. When I think of how much he means to me as a person I almost cry. Ok, ok -- pass the Kleenex and let's get this party started. <br /><br />All Cocks Out And Hard In The Living Room ... <br />There's a pussy flick playing and when you got a bunch of straight boys gathered together with a pussy porn there's bound to be some hard cocks. Well, today is no exception. Everyone is in the living room naked in no time and stroking their hard cocks. Barrett, Elijah, Shane, Levi and Adam are all naked and stroking hard-ons when the camera comes back on. When Adam sees Barrett's big cock hard he says he doesn't want to look at it too much or he might run away. I assure him that all doors are locked and he's in for the long haul. I threaten to handcuff him to Shane cause we know isn't going anywhere. <br /><br />Barrett Gets Elijah and Adam To Service His Cock ... <br />Barrett is ready to get things going so he calls over Adam and Elijah to start servicing his cock while Shane services Levi. Elijah latches onto the monster first and starts sucking it and Adam quickly follows his lead. The boys swap their spit on the huge cock as they work it up nice and hard, giving it extra special attention. It's hard to tell who's getting into it more -- them or Barrett, but everybody is surely having fun. Shane is getting his face fucked by Levi on the sofa and things are unwinding nicely. Levi starts stroking Shane's cock as they sit side-by-side on the sofa. <br /><br />On The Pool Table Things Take a Turn ... <br />Everyone moves to the pool room and Barrett stands against the table while Elijah, Shane and Adam service his cock and Shane keeps servicing Levi. Adam takes the lead this go around and really gets into sucking the huge cock that's gonna fill his tight little ass. Shane gets in there and helps him out as they compete to see who can suck it better. Elijah moves over to Levi and sucks him just long enough to get him ready to fuck Elijah's tight ass, priming it for the fuck that Barrett is going to put on it. <br /><br />Elijah Bends Over A Bar Chair While Adam Throws His Legs In The Air On The Pool Table ... <br />It's time to fuck as Elijah is the first to bend over a bar chair and let Levi fuck his tight hole really good and hard. Elijah's cock is hard as Levi pounds his hole and Elijah gives us that famous screaming moan as he really gets into the fucking he's getting. Shane gets underneath and sucks on Elijah's cock but it doesn't take long for him to run back to Barrett and Adam where he sticks his hard cock in Adam's hot hole while Adam wrestles with Barrett's big cock. Adam and Elijah are both being primed good for the fucking. Elijah and Levi move over so Elijah can lean over the pool table while Levi continues to pound him good and hard. Shane declares Adam's ass ready for Barrett and turns him over to the monster as he goes over and tag teams with Levi for some of Elijah's ass. Adam positions himself on his back on the pool table with his legs in the air. <br /><br />Barrett Takes Turns Plowing Adam And Elijah Deep ... <br />Barrett buries his entire cock deep in Adam's ass while Shane keeps fucking Elijah. Adam is taking Barrett balls deep in no time flat and he's loving it. Levi moves in behind Shane and starts fucking his ass while Shane fucks Elijah. Things switch up soon and Barrett moves over to plow Elijah while Levi and Shane take turns on Adam's nice open hole. Elijah is taking it like a champ as he proclaims it to be the hardest work of his life. Barrett is going deep in his tight ass and Elijah reaches over and kisses Adam while Adam gets fucked by Shane and strokes his hard cock. Shane gets over Adam's face and starts feeding him his cock as he gets ready to feed Adam his hot load. Levi is plowing Adam hard and Barrett is banging Elijah good. Elijah yells out Barrett Long's my fucking daddy and Shane blows his hot load all over Adam's face and in his mouth. <br /><br />Barrett Long's Load Showers the Crowd ... <br />Barrett stand on the pool table above Adam, Elijah and Shane and sprays a huge load all over all of them, not missing anyone in reach. Elijah goes next and lands his load on Adam and Shane's tongues and they share the jizz. Adam is up next as he lets Elijah jerk his load out all over his stomach. Elijah rubs Adam's cum in and all over Adam's stomach. Levi is last to go and he feeds Shane and Adam his load too. They lap it up like hungry little grunts and take every last drop.''",
  "models": [
    {
      "name": "Adam Wells",
      "person_id": 35234
    },
    {
      "name": "Barrett Long",
      "person_id": 35362
    },
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Levi",
      "person_id": 35112
    },
    {
      "name": "Shane",
      "person_id": 35144
    }
  ],
  "release_date": "2007-06-01",
  "scene_id": 70095,
  "series": "Long Deployment 3",
  "tags": [
    "Gay"
  ],
  "title": "Adam, Barrett Long, Elijah, Levi & Shane"
}