{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden, Brock, Christian, Zack, Adam and Reese Join Up For A Six Man Fuckfest ... <br />Things kick off with Kaden, Brock and Christian in the shower while Adam is at the other end of the house getting in the wrong shower LOL. The three cocks are already pretty much hard when the camera comes on as these three enjoy the warm water in the shower and stroke their meat together. Adam finds the right bathroom and joins Zack and Reese in the Jacuzzi. Christian kicks things off in the shower by rubbing Brock and Kaden's chests and stroking their cocks. Kaden and Brock follow his lead and quickly they are all stroking each other. Adam and Zack have already found their places in front of Reese's huge cock and they are servicing the meat like a quick lube oil change -- fast and efficient.<br /><br />Six Man Suck-a-Thon ... <br />These six troopers quickly get down to business with Brock, Kaden and Christian sucking in the shower and Adam, Zack and Reese going at it in the Jacuzzi. Christian gets the ball rolling first in the shower as he goes down to service Brock's cock. It isn't long before he's making his rounds and is sucking on Kaden's cock, too. Christian goes back and forth between Kaden and Brock's cocks while Adam and Zack keep up the pace on Reese. The boys turn off the shower and come out to join Adam, Reese and Zack beside the tub as Brock sprawls out for Christian to work his cock and Kaden jerks himself as he watches. It doesn't take long though for Kaden to find his own wet mouth with Adam and get his cock sucked as well.<br /><br />Christian, Adam and Zack Service The Men ... <br />After finding his way to Adam's mouth, Kaden feeds him his cock like the hungry cock-sucker Adam has proven he is. Adam is so into Kaden and it shows on video as he always gives his best when it's with Kaden. And Kaden always seems to enjoy Adam's attention. Meanwhile Christian is really getting into sucking Brock's cock as Brock lays his head back and enjoys the ride. Reese and Zack are hitting it off quite nicely as Zack pleasures his huge cock. The intensity that evolves during this particular scene is sort of surreal as all the boys seem to have forgotten the camera is even there and are just really getting into what's going on. The chemistry is sizzling between this group as they move things forward. Things switch up and Zack takes over Brock's cock while Christian moves over to enjoy Kaden and Adam swings from Reese's huge pole. Won't be long now before the fucking begins.<br /><br />Kaden is The First To Mount Up As The Fucking Begins. ... <br />Kaden saddles up to take Christian's tight ass for a ride as Christian bends over and arches his back in preparation. The other boys cheer him on as Kaden slides his cock inside him and slowly starts his deep, fast thrusting as he really gets into Christian's ass good. Christian keeps his mouth full with Reese's big cock as Kaden pounds away at his hole. Adam moves over and takes over on Brock's cock with his expertise and Zack is off to the side beating his meat (later he'll deliver two cumshots as he watches the hot action).<br /><br />Zack Gets Plowed By Reese ... <br />Just as you're about to say 'where's Zack' he reappears and joins Reese in the Jacuzzi where Reese saddles up to mount him and what a mounting it is. Zack resists a bit at first but once that big cock is in and has 'broken the seal' he's riding it like a pony at a circus. Reese is slamming in and out of him hard and fast and Zack is loving the ride. Meanwhile Kaden continues to fuck the daylights out of Christian and Brock prepared to mount Adam.<br /><br />Adam Gets Fucked By Brock While Reese and Kaden Fuck Christian And Zack ... <br />Now, everybody's fucking as Brock goes in for the kill on Adam's ass while Kaden pounds Christian and Reese bangs Zack. The heat is intense as the fucking and moaning get louder and harder. Kaden turns Christian over and starts sucking his hard, fat cock as Adam moves in to help Kaden out with the big cock. Kaden and Adam share the nice cock as Brock keeps pounding Adam and Zack keeps taking Reese. Eventually Kaden takes a seat and Christian and Adam suck him . Brock is banging his own brains out along with Adam's as he fucks him silly. Christian and Adam worship Kaden's cock and body.<br /><br />Let The Cum Start To Fly ... <br />Reese is banging the hell out of Zack while all this other hot sex is going on around them and since Reese is positioned well to see it all from where he is, he's oddly the first one to blow his huge load all over Zack's hot ass as the others cheer him on. Christian and Adam are still worshipping Kaden's cock and balls and Adam says 'you gonna cum for us, too? Yeah we want it.' and it isn't long before Kaden is erupting his load all over the place as he tells Christian, 'oh yeah, keep licking those balls.' So fucking hot. Suddenly out of nowhere Zack appears with his cock in his hand and says 'Oh God I'm gonna cum too' and blows a huge load (the first of two) all over the floor as he watches Kaden cum. In two minutes Zack is back to deliver his second load all over Adam's back as Brock works up his own cumshot. Brock finally delivers and boy does he. He not only shoots one load on Adam's back, but two. By the time he's done, He's a little light headed and the big man looks like he might fall out, but he hangs tough and shakes it off. Adam's up next as he jerks his own load off and Christian follows up with his fat load all over Adam's stomach to mix in together. Adam licks the cum off Christian's cock for good measure. It's a wrap -- now rewind and start all over.<br />",
  "models": [
    {
      "name": "Adam Wells",
      "person_id": 35234
    },
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Christian",
      "person_id": 35060
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Reese",
      "person_id": 35134
    }
  ],
  "release_date": "2008-01-01",
  "scene_id": 70098,
  "series": "The Surge",
  "tags": [
    "Gay"
  ],
  "title": "Adam, Brock, Christian, Kaden, Reese & Zack"
}