{
  "collections": [
    "Active Duty"
  ],
  "description": "Hops, Adam and Levi Chillin' Around The House ... The first scene kicks off with Hops, Levi and Adam all chillin' in the living room watching some porn. I talk some shit with Hops because I enjoy giving him a hard time. Hops is so much fun and such a good sport that it's hard to resist talking shit to him. Adam and I talk about his previous shoot, Platoon Party 3 with the twins, Shane, Colin and Jonathan. What's interesting to note about this video is that it's Levi's very first time crossin' the line in any fashion. Sometimes I don't release things in the right order, but as you'll discover in this video Levi has never crossed the line before now. So, even though you've seen him cross the line already---this is the very first time. He's agreed to come over and do a triple jack-off session with Hops and Adam, but little does he know there's a surprise in order. Adam and Hops Create a Conspiracy in The Bedroom ... Hops uses some lame line to get Adam to follow him to the bedroom and with a cock like that -- it doesn't take much to get Adam to follow. Once in the bedroom Hops asks me what's up with Levi. Hops is convinced that Levi has come for more than a threeway jerk off. He asks Adam, Hey man ... didn't you say you suck dick? Adam smiles and says, Sometimes. Hops tell him to get on his dick and tells me to go work my magic on Levi. Yes sir! I reply and leave Adam sucking Hops while I go back to Levi. Levi Wants To Know What They're Up To ... It doesn't take long once I tell Levi that Adam is sucking Hops' cock that Levi is heading toward the bedroom to see for himself what's going on. He seems eager to get a glimpse of something so taboo to him. I sit the camera down and leave the room to see what Hops and Adam can drum up. I always like this part. Sure enough, Levi falls right in the mix with Adam and Hops cajoling him on. Adam switches up and takes Levi's cock in his mouth and Levi is all smiles. Adam is ever the considerate playmate as he reaches back and continues stroking Hops while he sucks Levi. Levi is liking this new attention and falls right into things as if he was meant for it. From here Adam goes back and forth between the two hard cocks, giving both of them equal amounts of his hot mouth. The boys come up on their knees to make their cocks more accessible for their cocksucker and he does a mighty fine job of equal opportunity, going back and forth between them. Hops reaches down and starts jerking Adam's cock as Adam continues his sharing. Adam deep throats the hell out of Levi, going all the way down to the balls. Levi looks a little surprised but seems to love it. Hops and Levi decide to double-feed their cocksucker and love in close so Adam can take both cocks in his mouth at once. Adam is loving this and goes for it like any good hungry cocksucker would. Adam Eats Levi's Ass While Hops Sucks Levi's Cock ... This is another first ... Hops sucking cock. This was actually the first time Hops ever sucked a cock even though we've released videos of him sucking cock already. This was actually his very first time. Hops asks Levi if he wants him to help make what Adam is doing is feel better as he grabs Levi's cock and starts sucking it good. Adam comes up and starts sucking Levi's balls while Hops sucks Levi's cock. It isn't long before Adam is sucking Hops while Hops sucks Levi and jerks Adam's cock at the same time. This is so fucking hot to watch as our bad boy Hops gets down and dirty with his hat flipped backwards. Hops makes the rounds as he sucks Adam's cock, too. Adam picks up where Hops leaves off and works Levi's cock some more. Hops Says It's Time To Fuck Adam's Tight Ass ... After a lot of fun oral play, Hops says it's time to get down to business and do some fucking. He starts out fingering Adam's tight little hole and then announces that it's time to stuff his fat cock deep in that tight hole. Adam moves to the edge of the bed and throws his legs in the air as Hops begins plowing deep into his hot hole. Once he's deep in Adam's ass, he tells Adam to keep sucking Levi's cock and Adam obeys the command. Adam loves getting that tight hole fucked and Hops loves fucking a nice, tight ass. The match is made in heaven and Levi is right in there with 'em giving it his all. Adam sucks and licks on the shaft of Levi's cock just the way Levi likes it as Hops pounds his ass good and hard. That cock starts feeling really good in Adam's ass and he gets really talkative...oh yeah that feels good ... put that dick in my mouth. This is the horny little fucker we've all come to love as he gets verbal with the action. Adam Cums While Hops is Pounding Him Deep ... Adam is really getting into the fucking that Hops is giving him and he yells out Oh yeah ... fuck me good ... just like that ... yeah you're gonna make me cum right now. Adam blows a huge load all over himself as Hops keeps pounding him deep. Levi Gets His Turn At Adam's Ass ... Levi says what the hell and decides he wants to try something else new and trades places with Hops. Levi gets in Adam's ass and starts pounding it good and hard like he would a nice piece of pussy and Adam loves it. Hops positions himself over Adam's face like he's doing push-ups and fucks Adam's mouth good and hard while Levi pounds his hole. Adam is sucking on Hops balls hard while Hops strokes out a huge load all over Adam's face. What a hot fucking sight. Hops covers Adam's face in his hot jizz and Adam licks it off of Hops' cock as Hops runs his cock through the load and gives it to Adam. Levi blows his load next and Hops feeds it to Adam as Adam laps it up. Mmm, mmm good!",
  "models": [
    {
      "name": "Adam Wells",
      "person_id": 35234
    },
    {
      "name": "Hops",
      "person_id": 35087
    },
    {
      "name": "Levi",
      "person_id": 35112
    }
  ],
  "release_date": "2007-06-01",
  "scene_id": 70094,
  "series": "Long Deployment 3",
  "tags": [
    "Gay"
  ],
  "title": "Adam, Hops & Levi"
}