{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden And Mason Get Acquainted Before The Foursome ... I decided to team Kaden and Mason up together before bringing in Levi and Kasey to join them and what a great idea it was. These two are so, so fucking hot together. They complement each other really well. Things kick off with Mason eyeing Kaden's hard cock like he wants it something bad as he jerks his own cock and tweaks his nipple and watches Kaden intently. Kaden, aware of the roaming eyes, eats up the attention and strokes his hard cock. For an old pro Mason seems a little nervous with Kaden and who wouldn't be? He's the epitome of gorgeous. I leave the room and leave them to their own devices to return and find that things have taken their proper course. Mason is chompin' down on Kaden's cock like there is no tomorrow and Kaden is loving it as Mason deep throats his rock hard cock. Meanwhile Kasey and Levi Are Hard and Sucking Each Other In The Other Room ... Meanwhile back in the pool room, Kasey and Levi are up to their own fun on the pool table as Levi sucks on Kasey's hard cock. Levi must be doing a really good job because Kasey is really getting into the head he's getting. Levi sucks and worships Kasey's hard cock nice and slow. Kaden Decides To Help Out Mason In The Other Room ... We return to Mason and Kaden to find Kaden about to help Mason out with his hard on as Kaden grabs Mason's hard cock and starts stroking and sucking it. Man this is one sight to see as Kaden puts the uncut cock deeper and deeper down his throat all the while stroking his own hard cock. Mason strokes Kaden as Kaden works that cock over. Mason goes down on Kaden again for good measure as these two heat up the room like a blazing fireplace. Levi's Choking On Kasey's Cock ... Levi is really getting into servicing his buddy as he goes balls deep on Kasey's cock, gagging a little, but keeping the flow. Levi keeps trying to deep throat Kasey even further. Kaden Fucks Mason's Face ... Kaden positions himself above Mason and takes the back of his head and fucks his face good and hard and Mason is just loving it. Mason strokes his beautiful uncut cock (what a beauty) as he plays with Kaden's ass and sucks him good. Kaden turns around and keeps feeding Mason's face while he takes Mason's cock in his mouth. This is so hot to watch as Kaden makes pure love to that beautiful uncut monster. Kasey Takes the Reins On Levi's Cock ... Back to Kasey and Levi and this time Kasey is sucking Levi's cock just as good as he got. Levi is horny as fuck and his cock is standing at attention as Kasey swabs it with his hot, wet mouth. Kasey licks and sucks the shaft as Levi moans and groans. Mason Eats Kaden's Ass While Kaden Continues to Worship His Cock ... Keep up, troops as the action is moving fast. Back in the room with Mason and Kaden, Mason is eating Kaden's sweet ass now as Kaden continues to worship that fat uncut meat. What a hot fucking sight it is to watch Kaden manhandle this thick meat with his hungry little mouth. Mason Bends Over For Kaden and Prepares For His Hot, Hard Cock up His Ass ... Kaden is ready to fuck and Mason is more than ready to bend over and take it from our beautiful blond sailor. Kaden buries his cock balls-deep as Mason strokes his own hard cock to Kaden's rhythm. I tell Kaden that Kasey and Levi are in the other room and he says bring 'em on in and let's tag team this ass. The Fourway Fuck Gets Underway ... Levi and Kasey join Mason and Kaden and its action from the start. Levi gets on the bed and starts feeding Mason his cock while Mason spreads his ass cheeks for Kasey's cock. Kasey gets in and starts fucking him hard while Mason devours Levi's cock with his hungry mouth. Levi squeezes Mason's nipples while Mason strokes his own hard cock and Kasey pounds him like there's no tomorrow. Levi positions himself over Mason's face and literally fucks his mouth at Mason's request. He's fucking the breath outta this slut and Mason is loving every second of it. Levi Fucks Mason As Kasey And Kaden Feed Him Their Cocks And Loads ... Levi takes the helm on Mason's ass and shoves his hard, fat cock all the way up Mason's hungry hole as Kasey and Kaden do the honors at the other end. Levi isn't showing any mercy as he bangs Mason balls fucking deep while Mason enjoys his other entertainment up front. Kaden is the first to blow his load and Mason laps up the hot jizz like a dog in heat. Kasey is the next to blow and Mason is right there to take it all as Kaden shoves his head down on the gushing cock. Mason licks what he missed right off the comforter, being sure not to miss his meal of hot straight cum. Levi is next as Mason turns around to take his hot load, Levi gushes right in his hungry mouth. Mason is the last to cum as the boys gather round and cheer him on. When he blows his load all over himself, Kaden rakes it up and feeds it to the hungry bottom boy. It's a wrap!",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Levi",
      "person_id": 35112
    },
    {
      "name": "Mason Wyler",
      "person_id": 35118
    }
  ],
  "release_date": "2007-10-25",
  "scene_id": 70093,
  "series": "Drafted",
  "tags": [
    "Gay"
  ],
  "title": "Kaden, Kasey, Levi & Mason"
}