{
  "collections": [
    "Active Duty"
  ],
  "description": "Adam And Levi Get Us All Warmed Up ... This scene was supposed to be a three way jerk off session with Levi, Adam and that hot, tanned and toned hottie, Cash. When Cash chickened out, Adam and Levi said fuck jerking off and got right down to business. I handed the camera off to Cash and let him film two guys having sex right in front of his eyes for what was probably the first time he's ever seen such a thing. His angles and the way he gets right into the action tells me that he must have been very interested in seeing what was happening before him. It's a short scene, but it's packed with hot action and Cash and I are right there to catch it all. Skip Right To The Good Stuff ... The camera comes on with Adam already sucking away on Levi's hard, fat cock as these two don't waste any time getting to the rodeo. Levi's beautiful balls just dance in the breeze as Adam works his hard cock with his hot mouth. Cash zooms out for a long shot and conveniently catches a great glimpse of Adam's hot little ass in the air as he goes to town on Levi's cock and strokes his own cock. Turns out, Cash is quite the little camera man and it's so interesting to watch his perspective of the action as he seems to gravitate to all the good parts and stay focused. We all know Adam is a horny little devil and he seems to be putting on an extra hot show for Cash. I think Adam (as bad as I) wanted Cash to throw down the camera and join in. Adam is putting a shine on Levi's cock as he strokes his own hard, uncut cock fast. Watching Levi use little Adam for his bitch is really hot to watch. These two have chemistry with each other. Adam Eats Levi's Ass ... Adam wants to be sure he tastes every inch of this hot ranch hand and he turns Levi over to do just that. With his ass in the air and his hands on the headboard, Levi gets his hole eaten good and thorough. Adam spends some time worshipping at the mounds and admiring Levi's muscle butt as he strokes his own cock. I think Adam wanted to jump in there and fuck that perfect ass, but he'll have to be satisfied just tasting it today. Cash is right in there, getting the goods as these two get hotter and hotter. Adam goes back to sucking Levi as Levi jerks Adam's uncut meat and his balls tighten as Adam pays close attention to all the right spots. Adam has learned what turns Levi on and he's using it to his full advantage as he makes Levi moan and squirm. Levi Rides Adam Hard And Hangs Him Up Wet ... Levi puts Adam on his back and saddles up to ride him hard. Adam throws his legs in the air and offers his hole to Levi. Levi plunges in deep and starts thrusting fast and hard. Cash is getting some great close-ups of the action as he hones his cameraman skills. Adam's cock is hard as nails as he strokes the uncut gem while his ass gets fucked good and hard. Adam loves this cock in his ass and he's not shy to tell it. Adam is working his own cock hard and fast and it isn't long before Levi hit's that spot and Adam blows his huge load all over himself as Levi continues to bang his ass hard. The cumshots come like domino's falling and Levi cums right after Adam, leaving Adam drenched in his own cum and Levi's hot load. Adam rubs it all around on his belly as he talks to Levi.",
  "models": [
    {
      "name": "Adam Wells",
      "person_id": 35234
    },
    {
      "name": "Levi",
      "person_id": 35112
    }
  ],
  "release_date": "2008-02-14",
  "scene_id": 70099,
  "series": "The Surge 2",
  "tags": [
    "Gay",
    "Rimming"
  ],
  "title": "Adam & Levi"
}