{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden, Mason and Brock Chalk Their Sticks and Sink Some Balls ... I tease Mason a little bit about coming over to steal my men and he admits it's  'cause they're pretty. We shoot the shit for a little while and I give Brock a hard time all in good fun while the pool game continues. It isn't very long before Mason has forgotten all about the pool table and has got his hands on Brock's hot ass. Mason decides there's rules to this game and that you've gotta take something off if you miss a shot, but something tells me the game is just getting started. On the next shot, Kaden's pants come off to reveal his hi-rise modest briefs and Mason turns red with excitement. Mason loses his shirt for the cause and by the next shot, Brock's naked with his cock in Mason's mouth. Kaden suddenly (or intentionally LOL) misses and joins the boys. In no time flat (three minutes) all these hotties are naked and Mason is just where he loves to be -- on his knees in front of two hot cocks. Mason is stroking his hard, fat uncut cock as he sucks on the cock in front of him. Mason works both the cocks up to nice hard-ons as this pool game suddenly switches sticks and balls. The Troops Double-Feed Their Slutty New Recruit ... Before you can say side pocket, Brock and Kaden are standing side-by-side feeding Mason their hard cocks from both sides, double-fucking his mouth and feeding this cockhungry recruit all the dick he can take. This is so hot as Brock and Kaden's cocks and thighs touch, creating a union of pure fucking sexy. Mason knows all the right moves to help his fellow soldiers out and he's proving his worth to the unit right away. We've Drafted ourselves a trooper! The boys are all standing at attention and everyone is focused. This mission is bound to go off without a hitch. Kaden reaches over to get a handful of Brock while Mason sucks him good. Brock takes the helm on Kaden's cock while Mason sucks Brock. Kaden slams Mason's head down on Brock's cock back and forth as Brock strokes Kaden's hard meat. Mason finds his sweet spot and Kaden can't get enough as he deep throats Kaden to the balls. Kaden Sucks On Mason While Brock Feeds Mason His Cock ... Kaden switches things up a bit and sits Mason on the pool table to suck his cock while Brock stand on the table and feeds Mason his cock. Watching Kaden suck Mason's long, fat uncut meat is heaven. Kaden gets right in there and gives just as good as he got. Kaden returns the hot licks as he moves up Mason's body, washing it with his tongue. He works his way up to Mason's nipples and tweaks them with his teeth and tongue as Mason keeps deep throating Brock. Kaden moves all the way up Mason until he reaches Brock's cock and starts sucking. Mason positions himself underneath Kaden and starts eating his hot, round ass while he strokes his own fat meat. Kaden reaches down and grabs it and starts stroking it for Mason as Mason keeps eating his ass and Kaden sucks Brock. Kaden is handling two cocks at once and doing a damn fine job of it. Kaden moves down to Mason's cock and starts sucking it again as Brock moves around and positions himself behind Kaden and fucks Mason's face. I specifically got this shot so we could all fantasize about Brock fucking Kaden. We can dream can't we? Brock Eats Mason's Hot Ass To Get It Ready For The Fucking ... Kaden and Brock switch places as Brock takes Mason's legs and throws them behind his huge, muscled arms as he goes to town on Mason's hole, eating it and lubing it up for the fuck. Meanwhile Kaden feeds Mason his hard cock as this clusterfuck gets hotter and hotter. Brock really gets into tonguing Mason's hot hole and it's hot to watch our muscle man get down and dirty. Kaden is jamming his hot, hard cock down Mason's hungry throat in a rhythm. Kaden gets flat-footed on the pool table and squats his hot hole right on top of Mason's hungry tongue as he tongue fucks him. The New Recruit is All Ready For Fucking ... Brock decides that Mason's hot ass is ready for some cock so he bends him over the pool table and makes his entry as Kaden positions himself in front of Mason on the pool table. Brock buries his hard cock balls deep in Mason's hungry hole as Mason strokes his own hard cock and sucks on Kaden's cock. It isn't long before Brock is slamming in and out of Mason's ass as Kaden keeps Mason's mouth shut by stuffing it with hot cock. Kaden and Brock soon switch places and Kaden is slamming in and out of Mason's ass as Brock feeds Mason's mouth. Mason is getting fucked good and hard. Brock is fucking Mason's face as hard as he fucked his ass and before long he's feeding Mason a hot, huge load of creamy white jizz as Mason laps it up and sucks every last drop from Brock's meat. Once he's devoured Brock's load, the boys turn him around to take Kaden's hot load as Kaden shoots it all in Mason's mouth. Mason doesn't let much get away as he slurps up all the hanging jizz. Mason blows his own load all over Kaden's foot and Kaden makes him lick it off as he slurps his own hot load from Kaden's beautiful boot fillers, licking and sucking Kaden's toes clean.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Mason Wyler",
      "person_id": 35118
    }
  ],
  "release_date": "2007-10-25",
  "scene_id": 70092,
  "tags": [
    "Gay"
  ],
  "title": "Brock, Kaden & Mason Wyler"
}