{
  "collections": [
    "Active Duty"
  ],
  "description": "Adam And Spencer Shoot The Shit ... <br />Spencer is really playing naive as Adam schools him on how things work here at Active Duty. At times, Spencer can't hold back a huge grin or a quick laugh as he listens to Adam rationalize the situation. Spencer is a smart cookie and he's got Adam's number. But as you watch, you'll realize that Spencer just might be enjoying this whole seduction approach. Especially since he knows full well what's going to happen. Spencer plays along just fine and by the time the action starts, you'll be wondering who's foolin' who. <br /><br />Adam Goes In For The Kill As Spencer Just Grins ... <br />Adam looks over at Spencer's hard cock once he pulls it out and does a double take. Spencer is all smiles as Adam reaches over and offers to help him out. I'm still MIA at this point and watching these two take matters in their own hands is something else. Adam jumps on that cock like white on rice and Spencer kicks back and enjoys the attention. Spencer's packing a nice fucking cock and Adam seems to be in heaven. Spencer tells Adam he's giving an awesome blowjob as Adam mans the helm. Spencer's eyes roll back in his head a few times from the sensation and you know he's having himself a mighty fine time. The porn is playing on the TV, but Spencer is having more fun watching his cock get sucked than watching some pussy porn. He's totally forgotten about the porn and has zoomed in on Adam working his dick like a champ. It's obvious that these two are into each other. Spencer is all smiles. You'll get the same feeling I did watching this. These two are a great match. Spencer is as sly and cunning as Adam thinks he is and the playfulness between them is so adorable. Adam is jerking his cock as he sucks Spencer. He takes a drink break and offers Spencer the remote in case he wants to change the porn. Spencer could care less what's playing on the TV, he's got all the visuals he needs with Adam swallowing his cock. <br /><br />Spencer Returns The Favor To Adam ... <br />Adam positions the camera so that we can watch Spencer suck Adam's cock and what a fine job he's doing. I'm sure Adam was in absolute heaven as he imagined this hot straight boy giving him his mouth for the first time. I know I would have been. But Spencer has his secrets that Adam doesn't know about and Spencer aint telling. He's enjoying the whole thing as if he's in control of some bit of information that, if known to Adam, would spoil the whole thing. Spencer guy turns out to be clever. Spencer's cock is raging hard the whole time he's sucking Adam's uncut meat. This guy never goes soft and he hasn't noticed the TV playing in the background this entire time. Adam asks Spencer if he's done this before and Spencer assures him that he hasn't. Still playing up to the whole fantasy for Adam. Spencer's cock is aching hard and he wants some more attention from his partner. They go back and forth between one another's cocks for awhile as they enjoy the oral attention from each other. The facial expressions are priceless that we get to witness here as these two bond. They pay equally close attention to every inch of each other's rock hard cocks, careful not to miss any detail. The crowing moment comes when Spencer tries to reach around for Adam's cock to jerk it while Adam sucks him and when it isn't possible, Adam moves over close into Spencer's arms and they are almost hugging. I nearly fainted. Spencer goes back down on Adam as his hard cock bounces around and his nice ass gets in view of the camera. What a fine ass this guy is sporting. Spencer even takes the camera for a few minutes and films things from his own perspective. Hot, hot, hot.<br /><br />Spencer Fucks Adam...But There's Foreplay First ... <br />Adam straddles Spencer's cock and starts rubbing the huge hard thing between the crack of his ass while Spencer strokes and sucks Adam up front. They toy around with lots of foreplay before Spencer finally says I wanna see what it's like to fuck a guy's ass and from there Adam gets in position to show him. Spencer saddles up and the ride begins. Adam works it in slowly, giving us, the viewer, plenty to look at. So fucking hot these two. Spencer stays put in place and let's Adam work it in until he's comfortable. Once it's in and Adam gives the green light, Spencer turns into a raging fuck. All the while, the camera is positioned so that Spencer can watch himself fuck Adam and watch he does. He's loving it. Adam's hard cock is bouncing in the breeze and he starts jerking it at my insistence. He's jerking as Spencer pounds him and these two are really into it. Adam reaches around and grabs Spencer's ass and pounds him harder into him. He wants every inch of this fine straight boy and who could blame him? Spencer was made for this. Every man's dream of a top. Spencer puts Adam on his back and pulls him to the edge of the bed with his legs thrown in the air and shoves his big hard cock back into Adam's freshly fucked hole and begins to pound away again. This time, Adam has full access to his own hard cock and he's stroking it hard and fast as Spencer picks up the pace at Adam's request, banging him harder and harder until Adam blows his load all over himself from Spencer's thrusts. Spencer pulls out and straddles Adam's chest, grabbing his head and pulling it close to the head of his cock as he strokes out a nice big load all over Adam's face and chest as Adam sticks out his tongue to taste the jizz. Adam takes the dripping cock into his mouth and sucks out the last drops of Spencer's load.",
  "models": [
    {
      "name": "Adam Wells",
      "person_id": 35234
    },
    {
      "name": "Spencer",
      "person_id": 35021
    }
  ],
  "release_date": "2008-05-07",
  "scene_id": 70109,
  "series": "Rear Admiral",
  "tags": [
    "Gay"
  ],
  "title": "Adam & Spencer"
}