{
  "collections": [
    "Active Duty"
  ],
  "description": "King Cole Returns To Help Old Pal, Chaz ... and Newer Guys Kaden And Spencer Draft Brent Corrigan ... Listen up, troops! Today is a very special day. One of Active Duty's all-time favorites returns to the fold for the first time in over a year. King Cole is back to help his old partner in crime, Chaz (who's also returning after a long absence) help newcomer Spencer and heart-throb Kaden draft the wonderfully cute and sexy Brent Corrigan to the Active Duty fold. When the mission calls for the professionals, you bring in the professionals. King Cole's legacy of being the best damned top at Active Duty precedes him and he's here to make sure we accommodate Mr. Corrigan with the same level of professionalism that Brent brings with him. Everybody's always telling me how damn lucky I am and today, I really feel it. Having King Cole return to meet up with such a hot and sexy star like Brent Corrigan leaves one wondering just how much more lucky you could get. Everybody Get's Lucky Today ... Things kick off fast in this scene as well. The camera opens to Brent Corrigan and Kaden snuggled up closely in a huge round chair, kissing like crazy. These two are on fire from the word GO! Brent gets right down to the business of exploring Kaden's beautiful body. What a wonderland of gorgeous. The two of them continue to explore one another as I move over to the couch where Spencer, Chaz and Cole are torn between watching the porn and what's going on with Kaden and Brent. I tell Spencer to unbutton his pants and let me see what all this visual stimulation is doing for him. Sure enough, he's hard as a rock and all smiles. What a gorgeous set of eyes this one has on him. Meanwhile Brent has somehow managed to find Kaden's hard cock in his boxers and get it out. He playfully licks on the shaft before slowly taking it into his mouth and sucking it nice and slow. Brent goes all the way down on Kaden, taking him deep, yet gracefully. Watching these two is surreal as they complement each other so well. Cole And Chaz Get Reaquainted And Teach Newbie Spencer A Few Tricks In The Process ... I focus on Chaz who's already hard and ready to go and slowly move the camera over to Cole. Cole is all smiles as we welcome him back. Cole says the King had to return and I ask him to show us what got him the name. He pulls out that gorgeous monster that has helped make him so famous and as always it's at full attention. The time away has only made it grow fonder it seems and Chaz goes right for it, not allowing another minute to be lost in this long-awaited reunion. Chaz and Cole always made for a hot scene and today isn't going to be any exception. These two stoke a fire in one another that is hardly matched by any other. Kaden Enjoys Brent's Cock While Cole, Chaz And Spencer Enjoy Each Other's Company ... Meanwhile back on the big chair, Kaden has found his way to Brent's hard cock and is giving it the same slow, seductive attention that Brent gave his. Kaden's boxers are half down, showing off his beautiful ass and hard cock as Brent rubs and caresses his back. Brent and Kaden come out of the few clothes they have left on and Brent finds his way down on the floor in front of Kaden to give his cock some more sweet attention. Meanwhile both Spencer and Chaz have found their way to Cole's huge cock and are feasting on it like two hungry pups. Cole is all smiles as he enjoys the attention from these two. Chaz sucks Cole while Spencer holds the monster in place for him and they swap back and forth, teaching Spencer to share as Cole says. Cole asks Chaz if it tastes as good as it used to and you can imagine his response. Meanwhile Brent and Kaden have switched places once again and Kaden is manning the helm as he gets more and more into sucking Brent's cock. These two have such hot bodies. They look like two jock buddies enjoying some locker room fun. Chaz And Spencer Share King Cole's Huge Cock ... Chaz and Spencer are still busy servicing Cole's cock and Cole is kicked back like a King on his throne. Spencer is taking to sucking cock like a true pro and giving it his best. Chaz shows him a few tricks of the trade and Cole gets him to try going deep. Spencer is a trooper and he tries, almost gagging at first. But he's determined not to let it get the best of him. Chaz takes the lead and shows the newbie how it's done as he takes Cole's cock all the way down his throat. Once he's shown the newbie how it's done, Chaz moves down to Spencer's cock and leaves him with Cole's. Chaz starts sucking Spencer while Spencer sucks Cole. Brent And Kaden Drive Each Other Crazy ... Brent is back in front of Kaden, teasing his cock as he puts it all the way in his mouth then lets it flop around before taking it again. Kaden seems to be loving this action as he gets teased good. Brent is all pro and he's really going to town on Kaden like a true pro would. Watching Brent perform is an amazing experience and especially with someone as hot as Kaden. Brent stand up on the chair and feeds Kaden his own hard cock as Cole, Chaz and Spencer change positions, too. A Front Row Ticket To All The Action ... I back away to get all five guys in view of the camera and what a stunning picture it is. Brent sneaks a peek over at Cole, Spencer and Chaz while Kaden worships his dick. Cole is standing on the couch with his cock in Spencer's mouth while Chaz continues to service Spencer. Brent really gets into the attention Kaden is giving his cock and we start to hear him moan. When Brent Corrigan moans, people listen. He's so hot and seductive and he and Kaden make for a great pair. Spencer is still learning to master Cole's huge rod and he's learning. Cole takes Spencer's hand off his cock and puts it behind his head as he shoves his cock deeper and deeper in Spencer's mouth. Cole gets a little rough with Spencer, but Spencer doesn't back down. Chaz and Cole have been known to be rough in their play and now they're trying to bring Spencer into their mix. Brent and Kaden are making good use of the big chair as they roll around in it and find new positions. Kaden explores Brent's equally hot body like Brent explored his earlier. Spencer slaps Cole's cock on his face as he enjoys the attention he's getting from Chaz at the other end. Cole lifts his cock and Spencer worships his balls and licks them good. This is so hot to watch. Cole Joins Kaden And Brent On The Chair As The Heat Turns Up ... Kaden is sliding his cock up and down the crack of Brent's ass, teasing it and Cole joins the two and puts his cock in Brent's mouth. Brent makes love to Cole's huge cock and gives it a sucking that a newbie like Spencer will have to practice more to achieve. He deep throats the monster while he strokes his own hard cock and Kaden teases his ass. Meanwhile back on the couch, Chaz and Spencer are doing just fine left to their own devices. Chaz is giving Spencer's cock a good sucking and Spencer is enjoying himself. Over on the chair, Cole reaches back and spreads Brent's ass apart to reveal his pink hole. Kaden slaps it with his cock and teases it good. Kaden Eats Brent's Ass To Tease It Even More ... Kaden's never eaten anyone's ass, but that changes today as he decides to take his teasing a bit further. He sticks his hot tongue in Brent's hot hole and goes to town, rimming his first ass ever. And what a beautiful ass to start with. Brent helps by arching his back good and Cole helps by spreading his cheeks out even further so Kaden can really get in there good and lick Brent's hole. Brent sucks Cole's huge tool all the while and something else is bound to happen soon. Spencer And Chaz Join The Party And Spencer Is The First To Do The Honors ... Cole invites Spencer and Chaz over to play and Kaden starts sucking Spencer's cock while Cole jerks Brent and Brent sucks Cole. Kaden goes back and forth several times between eating Brent's ass and sucking Spencer's cock, getting them ready for their meeting that is about to happen. Cole turns Chaz over to Brent's oral care while Cole strokes Brent. It isn't long before Chaz finds his way back to Cole's cock and Brent is reaching back stroking Spencer's cock in anticipation of what comes next. But first Chaz pays Brent's nice cock some attention while Brent sucks on Spencer. Brent asks Spencer what he's waiting for as he positions himself to take Spencer's cock up his ass. Spencer is already saddled up and ready to ride and moves in quick to mount Brent's ass. Spencer takes to it like a rodeo and starts riding hard as Brent pays close attention to the cocks in front of him, making sure each are well attended. Spencer is long-stroking Brent's beautiful butt while everyone finds a place for their mouths. Brent does his classic Brent Corrigan pose as Spencer pounds away. Spencer is rolling his hips around slowly as he fucks Brent. Brent moves his leg to show off the deep penetration and his own hard cock as it bounces around from the pounding. Cole and Chaz start getting into a little rough play off to the side as Brent sucks on Kaden's cock. Spencer is working himself up to a frenzy and blows his huge load all over Brent's back. Brent looks back at him and smiles and says, Who's next? Spencer Cums And Gives King Cole The Reigns On Brent ... Brent is like any good gay boy and he loves himself a huge cock. After all, doesn't everyone? Cole moves in behind him to pick up where Spencer left off. Cole fucks Brent in the doggy-style position before having Brent sit on his cock. Once he gives over control to Brent, it's on. King Cole's cock stretches Brent's ass open in a good way and Brent bounces up and down, taking it all deep and hard as Cole grabs his ass cheeks and helps him along. Brent doesn't need much help, though, as we see the true professional in him emerge. The sun was shining through the skylights that day, making a perfect glow on Brent's ass and Cole's cock as these two stars show how they can shine. The lighting was very dramatic. The other boys stand around and stroke their cocks as Brent and Cole go at it. Brent's cock drools pre-cum as he rides Cole harder and faster. Brent twists around on Cole's cock to position himself the other way, never letting Cole's cock come out. From here we watch Brent ride Cole harder and faster as he strokes his own hard cock, working himself up to an explosive cumshot. I got the angles just right and you get to watch Brent's face as he shoots his load and Cole's cock stays deep inside him. Even after he cums, Brent keeps the pace on Cole's cock, riding it as fast and hard as before. Cole is getting close so Brent scoots off and strokes out Cole's load while the other boys jerk their cocks around them. Cole blows his wad and it starts a chain reaction as Chaz follows with his own juicy load all over Brent's foot. Kaden is next to go as he shoots his hot load all over Brent's ripped abs. It's a wrap.",
  "models": [
    {
      "name": "Brent Corrigan",
      "person_id": 35018
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Spencer",
      "person_id": 35021
    }
  ],
  "release_date": "2008-04-07",
  "scene_id": 70108,
  "series": "Drafted 3",
  "tags": [
    "Gay"
  ],
  "title": "Brent Corrigan, Chaz, Cole, Kaden & Spencer"
}