{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden And Kasey Give In For One Another ... This has been a long, long time coming and thanks to the guys in the AD LIVE Chatroom and to Kasey who egged it on, we finally get to see these two bottom for the very first time and what a sexy and special event it is. Things kick off with these two hunks on the bed. Kaden's in his sexy black Calvin Klein undies and Kasey is looking better than ever. These two complement each other so much it's unreal. I read a funny text message I got from Kaden about what is about to happen as he tells me a few days earlier that he's talked to Kasey and he's really ready. I leave Cole to man the camera for the beginning of this scene and he does a spectacular job getting all the oral action before I come back to get the anal deflowering of these two hot studs. You can tell the boys are nervous as whores in church, but things soon warm up and the action begins to unfold. Kasey talks about sticking the handle of a razor up his ass to try and prepare. Kaden confesses to trying a tube of facial cleanser as his starter kit. The conversation here is priceless as the ice begins to melt and the clothes soon come off. Kaden Is The First To Suck Cock ... Kasey's hard cock keeps catching Kaden's eye and before you know it, Kaden is on it and sucking it good. Kasey is hard as a rock and Kaden is sucking it fast and deep as he pays close attention to the task at hand. Kasey is enjoying the attention as he watches Kaden's head bob up and down on his hard meat. Kaden starts his famous moaning as he gets more and more into sucking Kasey. I love to hear Kaden moan. It's so fucking hot. Cole gets all the right angles as Kaden services the cock. Kaden sucks and licks on Kasey's balls and licks and sucks the shaft as he covers all the bases in this cocksucking round-about. Kaden's cock is raging hard as he worships Kasey's cock, balls and thighs with his tongue. Kasey is always the gentleman and offers to return the favor. Kasey Returns The Favor ... Kasey gets down between Kaden's thighs and starts deep-throating Kaden's cock. Cole gets some good angles of Kasey's hot, bubble but from behind while Kasey works Kaden's hard cock. Kaden throws one arm behind his head and shows off his pits while Kasey sucks his cock and rubs his beffy chest. Kaden is moaning in no time flat again as Kasey works his dick good. This is so fucking hot to watch as these two muscle pups tangle in the moment. Kaden stand up on the bed to give Kasey better access and this seems to be the best position for Kasey to fully take charge and service Kaden's cock good. Kasey pulls on Kaden's balls as he sucks his hard cock and Kaden is loving the extra attention to detail as he moans his approval. Kaden looks off into the mirror and watches his cock go in and out of Kasey's hot mouth as he flexes his body for the camera. One More Time Before The Fuck ... Kaden lays Kasey down on the bed and hoovers over him to worship his cock and body once more before the deflowering begins. This is so hot to watch as we see one muscle boy worship another and both of them love every second of it. Kaden licks and sucks Kasey's chest as he moves up and pays extra special attention to Kasey's nipples. Kasey strokes his hard cock all the while as Kaden explores and worships his hard earned body for the jewel that it is. Kaden latches back onto the hard cock and sucks it again, and sneaks down to lick Kasey's ass a little. What a hot fucking tease. I nearly fainted as I watched it. Kaden's hard cock flops on the bed as he worships every inch of Kasey's body. He goes down and licks Kasey's ass a second time and if you don't lose it at this point, you're better than me. Kasey asks Kaden if he thinks he's ready and Kaden smiles as he plants a kiss on Kasey's lips and says I think I'm ready. Kasey Fucks Kaden First ... Kaden bends over the bed and offers his virgin ass up to his buddy as Kasey moves in slowly, taking his time with Kaden and working it in slow. Kasey gets right in and starts slowly thrusting his hard cock in and out of Kaden's tight hole as Kaden adjusts himself to the new feeling. In not time flat Kaden is moaning and they're talking back and forth to each other as Kaden grunts and ask yeah, you like that ass? The grunts get intense as Kasey starts fucking harder and faster and Kaden stays along for the ride. Kaden decides he'd like to try another position so he lays on his back and throws his legs over Kasey's shoulders. What a hot site to witness. Kasey gets right back in the groove in no time flat and he's ramming his cock in and out of Kaden's hole as Kaden moans and groans. Kaden starts playing with his cock as Kasey works his prostate and things start feeling slightly good. The position switches again this time with Kaden laying on his side as Kasey plows him from the side. You get to see all the action from this position as Kasey's cock goes in and out of Kaden's tight ass. Kaden gets into as he tells kasey to fuck his ass and Kasey delivers. Kaden gets on his back again as we spread Kaden's legs to give the camera a great view. Kasey starts banging Kaden's ass hard as Kaden squeezes and pinches Kasey's chest. It isn't long before Kasey works himself up to a cumshot and Kaden jerks his own cock hard and fast as Kasey shoots his load on Kaden. Kaden Fucks Kasey Next ... After he's shot his load, Kasey is ready to take what he's got coming to him in return and bends over the bed for Kaden. Kasey reaches back and jams his middle finger up his ass for good measure as Kaden prepares to go deep. They decide to put Kasey on his back and here is where Kaden finally gets it in Kasey's tight virgin ass as Kasey grunts along with Kaden as his cock goes into Kasey's virgin territory. Once he's finally broken the seal, Kaden does his trademark hardcore, fast and furious fucking on Kasey's ass. All the while Kasey's hard cock is flopping on his stomach. Methinks Kasey is liking this new experience and his cock is telling on him. Kasey starts jerking his own meat fast and hard as Kaden plows his ass deep and fast. Kaden grabs Kasey's cock and strokes it for him while he plows Kasey's ass. So hot to watch. Kasey grabs his cock back and starts stroking it harder and harder as Kaden pounds his ass harder and harder the perfect combination to make Kasey blow another load all over himself as Kaden keeps pounding, Kasey shoots another wad. Kaden can't hold back much longer and pulls out and shoots a huge wad all over Kasey's stomach to join in with Kasey's fresh load.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Kasey",
      "person_id": 35026
    }
  ],
  "release_date": "2008-02-14",
  "scene_id": 70100,
  "series": "The Surge 2",
  "tags": [
    "Gay"
  ],
  "title": "Kaden & Kasey"
}