{
  "collections": [
    "Active Duty"
  ],
  "description": "Mason Wyler Gets Drafted For Round Three At Active Duty ... Mason just loves him some Active Duty boys and he's always game for whatever we can throw at him. Most people think of Mason as a piggy, hungry bottom boy that can't get enough cock in his ass and that may be true. But Mason is also one hell of a top. And with the nice, thick uncut beauty he's sporting, there's no wonder he can hold his own whether it be giving or receiving. Mason has proven himself here at Active Duty to be a hot recruit and we close out his Drafted series with one of the hottest scenes he's done for us yet. Brock and Reese join the ranks with Mason in this scene and the three of them get down to some serious mansex. Mason Gets Right Down To Business With Brock And Reese ... The camera comes on and the cocks are already out and hard. Brock and Reese are completely naked and Mason isn't far behind. Mason goes right to town first on Reese's cock then moves over to Brock's for a bit. Brock looks at Reese and says, he's pretty good at this, huh? Reese agrees as Mason keeps the pace. Reese moves over and takes Mason's place on Brock's cock as Mason does the honors on Reese's huge meat. Less than three minutes in and the games are already in full motion on this one, troops. The boys move around and play musical blow jobs for a bit with everyone getting a taste of the other. Mason feeds Brock his cock while Reese works Brock's. Brock switches things up and moves down between Mason's legs and starts sucking him while Mason continues to enjoy Reese's monster cock. Mason is making love to Reese's cock and if he's not in love yet, it won't be long. Reese and Brock move Mason into a position so they both can share his wonderful uncut jewel and they do a fine job of servicing a guy that is usually known to do the servicing. While Brock sucks Mason's cock, Mason feeds his fingers to Reese who eagerly sucks them as he waits his turn to suck Mason's dick. They give Mason the royal treatment as they turn him around and service his back side as well. Reese sucks while Brock eats Mason's ass. Brock And Reese Eat Mason's Sweet Ass ... Talk about full service. Remember the days of getting your gas pumped and your windows washed while you waited? Well here at Active Duty we still honor those old traditions of full service and Brock and Reese do a fine job of fine tuning Mason's engine as it revs up more and more. If Mason isn't in heaven, he's lost somewhere in space as these two hot, straight studs give him the ultimate treatment. They spread Mason's sweet, pink hole open wide and lick and lap as one goes for the ass and the other for the cock. Won't be long now until they check the oil. Reese Fucks Mason First ... Reese is the first to dip his stick in Mason's sweet, hot hole and Mason is more than ready by this time. Reese is packing one hell of a fat cock and Mason works it in nice and slow so he can take the whole thing without any problems. Once he's in, Mason is moaning and gasping for air as he takes Reese deep and hard. Reese is a pounder and once he's deep in an ass he goes at it like a piston. Mason is stroking his own hard cock while he takes Brock's cock in his mouth and Reese up his tight hole. Mason is taking a good hard fucking and he's doing it so well. Brock is egging it on as he gets his dick sucked and the heat is so hot in the room that we had to turn on the A/C. Things switch up and Mason rides the donkey as he sits on Reese's fat cock and Brock sits above Reese's shoulders and feeds Mason his dick. Reese is slamming deep into Mason's ass and Mason is loving it. The Tables Turn On Reese And Brock Fucks His Ass Good And Hard ... It's time to see if Reese can take as good as he gives and Brock steps up to the plate to drive one home. Reese has learned to arch his back for occasion. Brock pops the head in and drives it home deep and fast in no time flat. Reese is manning up and taking it like a champ. We knew he would didn't we? Mason positions himself to feed Reese his uncut cock while Brock fucks himself up to a cum shot. Brock blows is signature two-loads-in-one all over Reese's back as Reese eggs him on to drench him good. Reese keeps sucking Mason's cock with the two loads all over his back without stopping to wipe himself off. He's here for the sex, fuck everything else. Mason Gets His Turn At Reese's Freshly Fucked Hole ... Reese is a trooper tonight and tells Mason he might as well finish where Brock left off and bends over the couch to give his ass to Mason for good measure. Mason proves once again that he's a solid topper and goes in for the good stuff. Mason gives Reese a good lesson in arch your back, bitch and Reese learns quick how to throw his ass in the air and let his fucker take the lead. Reese looks like he was born for this and the position fits him so well. He's taking Mason's fat, uncut beauty like a manbeast and Mason is giving it to him good. Reese gets loud and vocal, telling Mason fucking cum for me motherfucker Mason reaches around and puts his fingers in Reese's mouth while he plows his ass deep. This must have been the deal breaker for Mason because not long after he's spraying his hot load all over Reese's cum-dried back. As Mason is cumming, Reese is jerking his own cock fast and hard, getting the most out of the moment. Mason gets down on his knees in front of Reese and takes the hot load all over his mouth before taking the still oozing cock into his hot mouth. Mason looks up at the camera and smiles that beautiful smile and says it's good to be back. Reese and Mason hug each other tightly and it's a wrap, Reese has been deflowered.",
  "models": [
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Mason Wyler",
      "person_id": 35118
    },
    {
      "name": "Reese",
      "person_id": 35134
    }
  ],
  "release_date": "2008-04-07",
  "scene_id": 70107,
  "series": "Drafted 3",
  "tags": [
    "Gay"
  ],
  "title": "Brock, Mason Wyler & Reese"
}