{
  "collections": [
    "Active Duty"
  ],
  "description": "Kasey, Brock, Hops, Damien, Adam, Zack And The Twins ... I rented a hotel suite so we wouldn't have to clean up the mess that comes after eight guys fuck their brains out and leave the place a wreck. One of the worst things about this job is having to clean up afterwards. I bet the maids at this hotel didn't think very highly of us once they opened the door to find this suite freshly soaked in cum and condoms. Oh well, it's the price you pay when you're in the service industry. This scene was shot just after the big AD LIVE Christmas party and all the boys were in town. I start things out in our real world fashion and talk to the boys as they eat Chinese take-out. One of the twins is looking so smashing in his hunting gear as he sports his long-johns and his levi's with a hole in the crotch. I make my rounds talking to the boys and ask Kasey about the famous kiss between he and Kaden at the Christmas party. He almost chokes on his egg roll. I go to get some ice and when I come back all eight boys are on the bed with their cocks out, stroking hard-ons. The twins are looking spectacular. I don't think I've ever seen their bodies looking better. Hard work-outs and dedication have certainly been paying off for these two mirror images. Throw Eight Horny Dudes In A Hotel Suite And What's Bound To Happen? ... Cocks are bound to get hard and people are bound to get naked and I'm sure not gonna miss it as I get the camera rolling. All the clothes come off in an instant and the shit's about to go down. Hops is stroking his big fat cock along with everyone else and things begin to heat up. Damien and Adam are the first to latch onto the twins cocks as the twins lay side-by-side sporting hard-ons. Damien takes one and Adam takes the other and it's on. It isn't long before the four boys in the back take the hint and Hops starts sucking Zack while Brock sucks on Kasey. Brock is making sweet love to Kasey's cock while Hops jumps on Zacks for a spin. The twins are enjoying the comforts of Adam and Damien's hot mouths on their identical cocks. Hops starts making love to Zack's cock as he licks the shaft up and down with that edgy straight boy attitude of his seeming to get lost somewhere in the moment. He's a cocksucker for now and he's doing it just fine. Switch Up The Positions So Everyone Gets A Turn ... Things switch up and the twins return the favor to Adam and Damien as Kasey and Zack return the favor to Hops and Brock. It's a cocksuckers paradise with eight hard cocks being serviced round the room. Kasey is handling Brock's cock fine as he sucks and slurps on the fat meat and Zack is having himself the time of his life with Hops big cock down his throat. The twins are content with their current postions and Hops is really enjoying the attention from Zack. Adam moves up to eat Kasey's ass while Kasey sucks Brock and the twins double pleasure Damien's hard cock. One twin eats his ass while the other sucks his cock and it won't be long until Damien needs something bigger than a tongue up his ass. Brock goes back to sucking on Kasey as Adam and Damien embrace for some hot kissing. Let The Fucking Begin ... The twins are in tune with Damien's needs as they decide it's time to get something more than a tongue up that sweet ass. One twin fucks him while the other twin sucks him. What a hot clusterfuck to watch as it all unfolds. Brock and Zack team up on Kasey's cock while Hops prepares to fuck Adam's tight, hungry hole. Adam lays down beside Damien and gives his ass to Hops. Hops crams every inch of his fat Italian/Puerto Rican cock all the way up Adams ass and starts pounding him like a stallion while the twins keep handling Damien. Kasey comes over to handle the other twin while his brother fucks Damien good and hard. Kasey works his way in the other twins ass and starts plowing him hard. Hops is really fuck Adam hard and Adam is loving every minute of that fat cock up his ass. Meanwhile Brock and Zack get busy at the other corner of the bed and Brock makes his way deep into Zacks horny ass. Damien's twin is the first to cum as he fucks Damien hard. He pulls out and blows a huge load all over Damien's stomach. Kasey blows his load next as he lands a load on his twin. Hops blows his load next and it's always a huge one. He lands it all over Adam's stomach and hits Damien who's laying beside Adam. The other twin goes next as he strokes his own load out all over his stomach. Brock is the next to go and what a huge fucking load he shoots, flying over Zack's head and soaking his back. Adam and Zack stroke out their own loads as the boys egg them on. Zack shoots a huge load to end things out and it's off to the showers and hot tub. See what happens when I leave to get some ice?",
  "models": [
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Adam Wells",
      "person_id": 35234
    },
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Hops",
      "person_id": 35087
    }
  ],
  "release_date": "2008-02-14",
  "scene_id": 70101,
  "series": "The Surge 2",
  "tags": [
    "Gay"
  ],
  "title": "Adam, Brock, Bryan, Damien, Hops, Kasey, Ryan & Zack"
}