{
  "collections": [
    "Active Duty"
  ],
  "description": "Domenic, Reese And Damien ... Things kick off with Reese and Damien in the bedroom stroking their cocks and I tell them we've got a newbie in the other room that needs turning out. They assure me that they'll come to the call of duty and 'turn him out by the end of the day.' I go out in the living room and find Domenic sporting a raging hard-on as he sits in the 'gay porn green-room' waiting on his first assignment. He says he's nervous but I can't tell from the huge hard cock he's strokin'. Domenic is a beautiful specimen. He reminds me of Cameron from the old days some with those rosey cheeks. But he certainly stands out as on his own and I think we've found in him a true star that will claim his own place here at Active Duty. Bring In The Professionals (Not Me -- Damien And Reese!) ... Damien and Reese have their work cut out for them with this real true player they've got on their hands, but he's ready and willing so their work isn't going to be as hard as it maybe should have been. I turn them loose in Domenic and they waste no time taking advantage of his willingness. In two seconds flat they are down beside him worshiping that lovely huge cock together as they stroke their own. They hunker down for the mission ahead as Domenic kicks back and enjoys their tactics. He's clearly in heaven here, troops. He doesn't know whether to shit or go blind and can you blame him? With two hotties like these two on your cock would you? Domenic didn't just come for the service, he came to sing too, ya'll. Domenic Jumps Right In And Tackles Reese's Huge Cock ... Reese pulls out his nice fat monster and dangles it in Domenic's face and it doesn't take long before Dom takes the bait. He's got a mouthful of Reese in record time as Damien continues to work on Domenic's hard meat. The screen is on fire by now and these three have made battle buddies out of one another in no time flat. I could have gone out to lunch they'd have never known I was gone. They are clearly into each other. Reese says he doesn't think it's Domenic's first time and at this point, I'm glad if it aint. He's doing a fine job of it now. The shirts come off and Reese starts teasing and fucking Dom's face while Damien keeps his focus at the other end. Domenic is also very focused on what's he's doing. And the size and hardness of his cock says he's liking what he's focused on. Domenic and Damien are showing off some great oral skills and I'm down low getting every lick and suck for you. After Domenic is more acclumated, Reese and Damien go back to sharing his fat cock with one another for a bit. Domenic is back in heaven (if he ever left) and the boys are sharing him good. Domenic becomes very verbal as he tells his cocksucker's he likes it and to suck it. Domenic Puts It Deep In Damien's Ass ... After the men have oiled their guns good and thorough, it's time for the second part of the mission. Reese tells Domenic what a hot ass Damien has and Domenic wastes no time saddling up to give it a try. Damien takes to Reese's cock like second nature as he throws his ass in the air for Domenic. He starts out going shallow (maybe he thought Damien was as green as him?) and befoe it's over, he's long-strokin' that sweet ass good and deep. And boy does he ever pound that ass. Damien is getting exactly what he likes and Domenic seems to be loving it too. Meanwhile Reese is enjoying the blowjob that results from Damien being in pure pleasure. It's on like a pot of hot coffee. Damien's the sugar and Domenic and Reese are the cream. Damien is strokin' and suckin' and Domenic is deep-dickin' while Reese is getting deep throated. Domenic puts a fuckin' on Damien that I've never quite seen anyone else put on him. Domenic certainly has found his own style and Damien seems to like it. Reese can barely hold back his load as Damien worships his fat cock, but he's got more work to do. Three Little Soldier's Went To The Market ... And Damien Rode Reese's Cock All The Way Home ... Domenic asks Reese if he wants to hit it and Reese says yeah, but he's too comfortable to move so he tells Damien to move up and ride his fat dick. Damien doesn't hesistate (can you blame him?) and hops on Reese while Reese and Damien share Domenic's cock, passing it back and forth. Reese gets greedy and really starts getting into sucking Domenic's big cock while he's pounding Damien's hot ass. I've never seen Reese get this into a cock before, but he's on it like white on rice and he doesn't stop until Domenic is blowing his hot load all over Reese's chest. Damien is riding harder and faster as he strokes himself and fucks Reese's cock. He fucks himself right up to an explosive cumshot and lands it right in the puddle with Domenic's. Damien hops off and Reese blows his own huge fucking load right into the huge puddle. This may be one of the biggest, messiest puddles of cum I've ever seen three men produce and it just might be one of the hottest threeways I've ever shot. You decide! There's a great shower segment after the hot sex and you'll be laughing and smiling just as much as I was watching it. These guys were really, really good together.",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Domenic",
      "person_id": 35080
    },
    {
      "name": "Reese",
      "person_id": 35134
    }
  ],
  "release_date": "2008-05-22",
  "scene_id": 70111,
  "series": "Behind the Line 2",
  "tags": [
    "Gay"
  ],
  "title": "Damien, Domenic & Reese"
}