{
  "collections": [
    "Active Duty"
  ],
  "description": "Two Newbies Join The Fold Along With Spencer And Gage ... This DVD has three brand new faces freshly part of the Active Duty fold. In this scene we are introduced to Gio and Randy. Gio has the most delicious ass I do believe one can legally have and Randy is sporting one of the longest, fattest cocks to come along recently. They team up with Spencer and Gage and what unfolds is pure satisfaction. The boys are naked and hard as soon as the camera comes on. I'm getting old and slow and when men get horny, they don't wait for the camera. Gio is stroking a hard cock and so is everyone else. I tell Spencer there is someone here that's never sucked cock and Spencer vows to teach him. The boys bullshit about the chicks on the porn and Randy strokes his fat, hard meat. What a beauty this one is. Spencer Teaches Randy While Gage And Gio Teach Each Other A Few Things ... Spencer starts out sucking Randy's huge, hard cock while Gage feeds Gio his cock. Gio is a quick learner as he deep throats Gage's hard cock all the way to the balls. Can we say hungry? This one came fresh off the boat ready for action. Meanwhile, Randy is enjoying the lesson that Spencer is giving his cock as he gives those beautiful 'O' faces. Gio is workin' Gage's cock like a part-time job and the action is already heated. These four are bound to start a fire. Gio's cock is rock hard as he continues to service Gage and Spencer is liking the huge cock he's latched onto. Gage switches up and starts sucking Gio's hard cock as things keep moving forward. Gio is fucking Gage's face, thrusting his cock in and out of his mouth like a piston. Gage is staying with the beat and taking it down good. Gio is enjoying the ride. Gage is making what we call love to that cock. Randy Tries Sucking Cock For The First Time ... Once Spencer has given him a quick, wet lesson, Randy tries his skills and Spencer quickly complains, 'No teeth!' Watching Randy try to master the task at hand is hot as hell as the newbie does his best to give as good as he got. It takes a little time for him to adjust to the newness, but eventually he's hanging with the best of them. He chokes a few times in the process, but he doesn't give up. Spencer tells him how to tighten his lips nice around his cock. Spencer teaches him how to lick the shaft and Randy takes his instructions well. Gio has kicked back to relax and enjoy his blowjob from Gage while Randy learns the ropes. Everyone's getting an education today. Spencer goes back to worshipping Randy's big cock (who can blame him?) and does a little chokin' himself. Gage starts laughing at Spencer and so we tell him to try it. Gage says no, but Gio is willing. So Gio goes over and takes a swing on the big meat. After a little chokin', Gio has mastered the big cock and is taking it down his throat like a pro. Spencer and Gage pick up on the chair where Gage and Gio left off. Gio stands over Randy and shoves his cock down his throat as Randy gets better at the task at hand. Gio's cock is getting the best of it as Randy works it like a pro beginner. Spencer is helping himself to some of Gage's cock as everyone gets their dicks nice and wet. Gage Moves In To Eat Gio's Ass While Gio Sucks Randy ... Gio left his beautiful ass in the air while he was sucking on Randy and Gage goes over and just starts licking and eating it like there is no tomorrow and once you see the ass he's eating, you'll understand how one might be magnetically drawn to it. It's round, Gio is liking this attention as he rolls his ass around and moans on Randy's huge dick. I think Gage has found his spot. Gage starts fingering the tight hole and getting it ready for what's bound to happen next. Spencer Moves In To Fuck Gio's Bubble Ass ... Once Gage has it all nice and wet and hot, Spencer moves in to stick his cock up Gio's ass. Gio moans and grunts a little as he's getting it in, but you can tell that he's liking it. Gio is worshipping at the altar as Randy continues to fuck his face while Spencer fucks his ass. Gage comes over and feeds Randy his cock as the fourway moves on. Spencer flips Gio over onto his back to reveal Gio's huge hard cock and starts fucking him hard while Gio strokes his hard cock to the rhythm of Spencer's fucking. Gage is sucking on Randy's huge cock as we watch Spencer plow the nice ass, we see Gage sucking the huge cock. Gio Cums With A Cock Deep In His Ass ... This position must have touched all Gio's right spots as Spencer fucks him hard and he strokes himself. It isn't long before he's blowing his huge load all over himself as Spencer plows him hard. Gio milks the cum from his cock as his legs shake and Spencer keeps plowing. Gage is still sucking Randy and Randy is really liking it, but Randy wants more than just a blowjob. Gio reaches back and plays with Randy's balls while Gage sucks his dick and Spencer continues fucking Gio hard and fast. Gio brings Gage's ass over his face and starts eating it while Spencer fucks him. He's tonguing that hole good. Randy Fucks Gage's Nice, Tight Ass ... Randy has had enough blowjobs for one day, now he wants him some tight ass and Gage gives in and assumes the position. It takes Randy a couple of minutes to work that big, fat cock into that tight ass, but once it's in, he's fucking him hard. He's fucking it hard and slapping Gage's ass all the while talking shit to Gage as he manhandles his ass. Meanwhile, Spencer has worked himself up a huge load and he blows it all over Gio's face as Gio encourages him to shoot it in his face. Spencer slaps his cock all over Gio's face, rubbing the load all around as Gio puckers his cum-covered lips and opens his mouth to taste Spencer's load. Meanwhile, Randy turns Gage over on his back and fucks him good and hard for awhile as Gage strokes his own cock. Randy is pumping hard and it isn't long before Gage is raging a nice hard cock as he strokes it harder and harder and shoots a huge load all over himself as Randy keeps pounding faster, harder, deeper. Randy pulls out and delivers an impressive load to mix in with Gage's hot jizz, shooting Gage in the neck and face and splattering cum all over him. This was one hell of a load. Gage reaches up and grabs the big cock and squeezes the last drop out.",
  "models": [
    {
      "name": "Spencer",
      "person_id": 35021
    },
    {
      "name": "Gage",
      "person_id": 35084
    },
    {
      "name": "Randy",
      "person_id": 35130
    },
    {
      "name": "Giovanni",
      "person_id": 35177
    }
  ],
  "release_date": "2008-06-12",
  "scene_id": 70118,
  "series": "Rear Admiral 3",
  "tags": [
    "Gay"
  ],
  "title": "Gage, Giovanni, Randy & Spencer"
}