{
  "collections": [
    "Active Duty"
  ],
  "description": "A note from Dink ... Thomas and Elijah both make their returns to Active Duty in Caught In The Crossfire and what a welcome return it is for these two studs. I've been missing them both really bad since they've been gone and I know you have, too. They are both looking better than ever and are eager to get back into the fold. Thomas is still sporting that great body and huge cock and Elijah has that same winning personality and perfect butt and they're both ready for some action. They come back strong in this new DVD and show us that being away for a long time doesn't mean they have to relearn anything over again. They jump right in where they left off and give it their all. Join me in welcoming back two Active Duty favorites in our latest DVD release! Gio Meets Thomas And Elijah ... Things kick off with Thomas, Elijah and Gio on the bed. We'd taken an assload of photos for this scene before starting to film and Thomas had been eyeing the boys pretty heavily during the photo session as he jerked his huge meat. Both Elijah and myself noticed Thomas' wandering eyes and when I mention it to Thomas on video, Elijah just cracks up laughing. We call him out and he looks surprised, but not embarrased. Gio looks happier than a pig in shit with his co-stars as he eyes their packages and imagines what's next. I warn Gio that Elijah is a master at getting guys to do what he wants before I leave them alone to let things begin to unfold naturally. I tell the guys I'm gonna go check the pie in the oven and Elijah calls me out with a confused look on his face as he says, What pie? Elijah And Thomas Waste No Time Getting Gio In The Hucklebuck ... I'm not gone thirty seconds before Elijah tells Gio he should get over there and start sucking on Thomas' fat cock. Thomas agrees with Eli and Gio obliges. Elijah gets right down to the business of eating Gio's nice, bubble butt and licking his balls back and forth as Gio crams Thomas' huge cock down his throat. Thomas is already talking dirty shit to Gio, telling him to suck that big, fat cock. Gio takes orders well and wraps his mouth around that fat meat like it's the last he'll ever taste. Thomas jerks on it while Gio sucks it and Elijah is eating ass like there's no tomorrow. Two minutes in and we can tell already that these three are going to be one of the hottest threeways we've seen in awhile. Elijah smacks Gio's ass while Gio spits on Thomas' huge cock to make it easier to put down his throat. Thomas is standing at full mast as he fucks Gio's throat. Thomas Tells Elijah To Put His Cock In His Mouth While He Fucks Gio's Throat ... Thomas wants to taste some cock, too. He tells Elijah to put his cock in his mouth so he can get a taste. Elijah moves right up and shoves his cock in Thomas' mouth while Thomas guides Gio's head up and down on his hard cock. Elijah is really enjoying Thomas' mouth and starts shoving Gio's head up and down on Thomas' cock while Thomas sucks him good. They're chokin' Gio with that fat meat and Gio is loving every minute of it. Elijah says he wants Gio to suck his cock too and Gio goes right to town on it. Elijah reaches down and starts stroking Thomas' huge meat and Thomas is loving the view from where he's at. He likes watching Gio suck Elijah. Thomas starts pushing Gio's head down on Elijah's cock and they are using this boy for all he's worth. Thomas stands up to feed his cock to Elijah and Eli is more than happy to service the monster. Elijah is taking it down as far as he can get into his throat as Gio continues to deep throat Eli's cock. Keep suckin' that fat cock comes Thomas' command and Elijah obey's his orders. Elijah stands up and joins Thomas while Gio mans both cocks, going back and forth on the two hard dicks while the boys tell him what to do. Gio doesn't need much coaxing or help as he seems to be quite a natural at it. Gio has got to be one of the hungriest cocksuckers this side of enemy lines and he's proving his worth to his fellow troops. Thomas reaches down and starts stroking Gio's hard cock while Gio continues to service Eli's. They choke Gio several times and Thomas says, We got us a little whore tonight, we can do whatever we want to him. Gio doesn't protest and Elijah agrees. I think you'll agree, too. Elijah starts feeding Thomas his hard cock again and Gio mans the helm on Thomas once more. Gio and Thomas start sharing Eli's cock while Gio sucks the balls, Thomas sucks the dick. Gio moves around and starts eating Elijah's ass. Gio Masters The Art Of Ass-Eating ... Gio goes to town on Elijah's sweet hole, licking, sucking, slurping on it like a mad man out of control. Elijah loves having that hairy, manly ass licked and he tells Gio just how he likes it. Elijah reaches back and spreads his cheeks wide to give Gio plenty of room to manuever that tongue. Elijah is in heaven while Thomas sucks Gio's hard cock, these three keep each other more than occupied. Often times you'll wonder if they have forgotten there's a camera there. Gio tells Elijah to sit on his face and Elijah doesn't gripe about it. Elijah squats down right over Gio's tongue and gives him the access they've both wanted the whole time. Elijah's faces are priceless as Thomas strokes Gio while Elijah gets the ride of his life. Thomas moves up to get himself some attention from Elijah's hot mouth while Gio worships Elijah's hole. These three are a dream come true for us as the action heats up many times to the point of catching our DVD players on fire. Hands down this one of the hottest threesomes I've filmed in I can't tell you when. Elijah can't decide what he wants as he goes between Thomas and Gio's cocks, giving them both plenty of attention. Thomas strokes his fat, wet cock and watches on. Thomas is a voyuer as much as the rest of us. Thomas Fucks Gio's Throat As The Clusterfuck Continues To Tangle ... Thomas moves around to fuck Gio's face while Elijah sucks Gio's cock. Thomas is gagging Gio as he thrusts his fat meat in and out of his throat, faster, faster, faster. Gio is keeping up, but he's gagging good in between. What a trooper. Thomas gives his throat a break and gives his tongue something else to do as he turns around and squats his muscle ass over Gio's face. Gio takes right to it and tongues his hole good. Thomas reaches back and rubs his big, manly fingers around Elijah's pink manpucker and if your heart don't give a little, you aint payin' attention. Elijah starts eating Gio's nce ass, fingering it good, licking, sucking and getting it ready for what's coming next. Elijah Fucks GIo First, To Ready Him For The Ride ... Elijah hops in the saddle on Gio while Thomas feeds him his horsemeat. Gio throws his legs in the air and opens his ass for Elijah, who wastes no time ramming his hard prick balls deep into Gio's horny ass. Elijah is a natural star and it shines through when he gets lost in the moment. This is one of those moments when he's completely lost in horniness. He gets loud with Gio as he tells him to suck that fucking dick in front of him while he plows his ass good and hard. Gio is stroking his own hard cock as he sucks Thomas and gets rammed by Eli. Elijah is deep-dickin' Gio like a crazed rabbit as I nearly faint getting the action. Elijah is about to fuck himself slam outta breathe, but he aint stoppin'. Thomas Takes The Reins On Gio's Ass ... Elijah has worn himself out and offers Gio's ass to Thomas who quickly takes over and shoves his huge, hard cock all the way to the balls up Gio's ass. Meanwhile, Gio sucks Elijah's cock that is still nice and warm from just fucking his hole. Thomas is tearing Gio a new ass and Elijah is going crazy over how good Gio is sucking his cock while Thomas rails him hard. They're using him for all he's worth and Gio seems to love it. Thomas long-dicks that ass slow and hard, while Elijah keeps enjoying the mouth. Gio is loving him some of Elijah's cock and can't seem to get enough of it down his throat or enough of Thomas' up his ass. Elijah turns around and feeds his asshole to Gio once more. It's not long before Elijah wants to get fucked and Gio is ready to do the deed. Gio Fucks Elijah For A Little Payback ... Gio straddles Elijah's hungry hole and shoves his dick balls deep into the beautiful pink hole. Thomas reaches underneath and strokes Elijah's cock. Gio is going balls deep over and over and ramming Elijah hard. Elijah starts sucking on Thomas' gian meat to keep his mouth occupied. Any way ya shake it, Elijah is getting the hell fucked outta him and if how well he's sucking Thomas' cock is any indication, he's loving the hell out of it. Gio pulls out and blows his wad all over Elijah's ass. Everyone Blows Their Load ... Once Gio has soaked Elijah's ass with cum, he and Elijah go down to help Thomas get his as they lick his cock and balls until he cums, spurting all over the place. Elijah looks at Gio and tells him to suck his load out. He starts fucking Gio's face fast and furious and it isn't long before he's blowing a huge wad all over Gio's face. It just hangs there. We all bust out laughing as we wonder where it's going to land. These three have really outdone themselves and if you aint outdone by the time it's over, you've always got the next scene. My guess is, you won't make it through this one.",
  "models": [
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Thomas",
      "person_id": 35154
    },
    {
      "name": "Giovanni",
      "person_id": 35177
    }
  ],
  "release_date": "2008-07-26",
  "scene_id": 70119,
  "series": "Caught in the Crossfire",
  "tags": [
    "Gay"
  ],
  "title": "Elijah, Giovanni & Thomas"
}