{
  "collections": [
    "Active Duty"
  ],
  "description": "Spencer And Gage Get Acquainted ... You guys will remember Gage from a few weeks back when we introduced him in one of our War Chest Updates and the Gallery Updates! Well, Gage has been moving right along and Spencer has done his part to make sure that happens. Gage is a street-tough, rough-around-the-edges straight boy who grew up in a tough neighborhood where he was forced to fight. His father was in the military and Gage seen no other way to escape his childhood than to join up and follow in those shoes. Gage hasn't had an easy run of it. His past haunts his future and he seems to always be in some sort of trouble. But, Gage is very likable and down-to-earth. He and Spencer hit it right off and we begin to see that beneath all that toughness is a tender soul that isn't much different that the rest of us. He's curious, he wants to explore and he's found a place to do it without fear of being ridiculed. Spencer Moves In For The Kill ... Spencer is quite a character and he does these personalities that are hilarious. Gage runs me up a hill with a joke I was trying to crack about Hooters' billboards and I talk about my wide angle lens still being broken and tell the boys I have to go check my pie -- blueberry pie. I leave the two of them alone to see what comes up. It's very late at night and Spencer is very tired as he wipes his eyes and tries to pay attention. Won't be long though before he's wide awake. As soon as I'm gone, Spencer starts firing off the questions to Gage. Gage says he ain't doing no gay shit. Spencer doesn't give up that easy though. You can tell what's on Spencer's mind. As soon as the cocks are out and hard, all eyes are wandering. Gage isn't immune to a little sneak-a-peek. He's getting in his glances. It isn't long before Spencer has him convinced to let him stroke his cock. Spencer grabs hold and it's on. Gage admits that it's not that bad and in not time flat, he's grabbing Spencer's cock and jerking it in return as he strokes himself. Spencer Sucks Gage And Gage Returns The Favor ... Things continue to progress and Spencer has him talked into getting his cock sucked as he hesitates a little at first. Spencer gives him a nice taste of what it's like then backs off and asks for the favor to be returned. In short order, Gage is sucking Spencer's cock as his own hard cock flops in the breeze. Gage must have watched a lot of blowjob scenes because he's perfected the art of sucking cock. This doesn't look like a newbie to me. He's got skills and he's using them on Spencer's nice, hard cock. Spencer's eyes roll to the back of his head in agreement as he enjoys the cocksucking. I come in and move the camera to catch the action and quickly leave again. Spencer goes back down on Gage as we watch this experiment unfold to our liking. The boys flip-flop back and forth, giving each other as good as they got. Gage has one of the nicest, roundest asses I've seen in some time. I can't keep my eyes off of it and you won't be able to either. The boys break off into jerking themselves and Gage watches Spencer's cock, intently waiting on the cumshot. Just as Spencer is about to cum, Gage grabs his cock and strokes the load out for him as his eyes stay glued to Spencer's cock, he watches as it shoots and strokes himself in unison. Things Take An Unlikely Twist As Spencer Takes A Load In His Mouth ... Spencer says no at first, but Gage doesn't give up that easy. Gage tells Spencer if he doesn't take his load in his mouth he's done with him. He and Spencer go back and forth for a bit and Spencer finally agrees. Once the load is blown in Spencer's mouth, Gage rushes off and it's a wrap.",
  "models": [
    {
      "name": "Spencer",
      "person_id": 35021
    },
    {
      "name": "Gage",
      "person_id": 35084
    }
  ],
  "release_date": "2008-06-12",
  "scene_id": 70117,
  "tags": [
    "Gay"
  ],
  "title": "Gage & Spencer"
}