{
  "collections": [
    "Active Duty"
  ],
  "description": "Spencer and Damien Do Some Serious Role-Playing ... <br />Damien loves, loves, loves to be dominated. But we've rarely seen a model that has taken Damien the way he really seems to want it. Thomas in Rear Gunners 2 was one and Cliff in MIA: Men In Action 3 was another, but rarely has anyone pushed this super sexy bottom boy to his limits. I decide to see if Spencer can come to the call of duty and do it. And he does. <br /><br />Things kick off with the two of them on the couch and their cocks are already hard and out as they stroke. Spencer tells Damien to get up and show him his fucking jockstrap and when Damien does, he bends over to show Spencer his nice ass. Spencer tells him to give him some poses and Damien gives him some really great poses. Damien bends over and puts his ass right in Spencer's face and tells him to smack it. <br />Spencer says he hears Damien likes to get plowed. We've never seen Damien show off like this before and what a fucking show it is. Spencer is enjoying the fuck out of all this devoted attention and Damien asks if he wants him to suck on his hard cock for him. Spencer says hell yeah. <br /><br />Damien Sucks Daddy's Cock For Him ... <br />Damien goes to town on Spencer's cock as he listens to Spencer's instructions. Spencer tells the little bottom boy what to do, when to do it and how to do it and Damien follows the instructions. Spencer has him nearly choking on his cock as he deep throats the hard meat. Damien sucks Spencer as he's told and when Spencer gets close to coming he decides to edge it and hold his load as he tells Damien to show his ass off to him again. <br /><br />Damien does as he's told again and Spencer has his way with the submissive young hottie. Spencer starts fingering Damien's hole, one finger, then two, Spencer is now ready to edge it again and gets Damien back down on his cock sucking it hard and fast. After he's edged once more and almost came, he pulls out a HUGE 12 inch dildo for Damien to play with. He makes Damien suck the huge dildo first before telling him to shove it up his tight fucking hole. Damien does as he's told. <br /><br />The HUGE 12 inch Dildo Comes Out And Goes Up Damien's Tight Ass ... <br />Damien takes the huge dildo and turns around to try sitting on it as Spencer tells him what do to and edges himself even further. Damien moves to the floor in front of Spencer and slowly starts sitting all the way down on the huge dildo as Spencer talks shit to him in the background as he strokes himself. <br />Watching Damien slowly lower himself down onto the massive dildo is unreal. You might have to stop your DVD player and regain your composure as our hot bottom boy does his thing. Spencer gets really intense as he tells Damien how to ride that cock. He tells Damien to turn around and keep the huge cock inside him while he sucks his cock. Spencer fucks his face fast and hard while Damien keeps the dildo deep in his ass using his feet. So hot to watch. <br /><br />Spencer Puts His Own Hard Cock Up Damien's Ass To Cum ... <br />After he's worked his bitch boy over good and edged himself to cumming several times, Spencer decides he wants to have his cock deep inside Damien to make him finally cum. He throws Damien on his hands and knees and starts pounding him hard. Damien's hard cock is flapping in the wind as his ass gets pounding deep. <br /><br />Spencer puts him on the arm of the couch on his back and fucks him some more, harder and harder, faster and faster until Damien can't hold back anymore and blows his load all over himself. Spencer follows quickly after and lands his own huge load all over Damien's stomach.",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Spencer",
      "person_id": 35021
    }
  ],
  "release_date": "2008-05-29",
  "scene_id": 70114,
  "series": "Rear Admiral 2",
  "tags": [
    "Gay"
  ],
  "title": "Damien & Spencer"
}