{
  "collections": [
    "Active Duty"
  ],
  "description": "Spencer, Kaden And Chaz Meet Up To Play ... Chaz has made his official return to Active Duty and in his second scene we've paired him up with the gorgeous Kaden and the ultra sexy Spencer. These two are sure to show him a good time and give him a great welcome back. Chaz is being his usual crazy self and I'm not sure if Spencer or Kaden knew how to take his craziness, but they sure knew how to take everything else he had to offer. For once, Chaz seems nervous. Very unlike our hero. But the two hotties he's paired with today would make anyone nervous I think. These three complement each other so well. They're all sporting some of the prettiest blue eyes I've ever seen in one room together. And with the natural daylight shining through, it only accents them more. Chaz is certainly himself though as the first thing he proclaims is that he's ready for these guys to find their place on my face. This gets a rise out of both Kaden and Spencer as they listen to me and Chaz go on. Now I know you're gonna think I'm lying, but I was actually baking a pie that day for the big cookout we were going to have afterwards so I leave the guys alone for a few minutes to see what happens. Spencer is eager to get things going. He says, let's quit shooting the shit and do what we came to do. So ready and willing this guy is. Let The Good Times Roll ... In no time at all, the underwear are all off and the cocks are all hard. These three come to do business and if their cocks are any indication of how serious they are, I'd say we're all in for a treat. Spencer is sneaking peeks over at Kaden's cock as he unveils it from his undies. Everyone is sneaking a few peeks. Chaz starts sucking Kaden first as Spencer jerks his own cock and plays with Chaz's cock, too. Spencer and Kaden get up on their knees to give Chaz access to both of their cocks and he goes back and forth between the two dicks and sucks them good. Chaz Eats Kaden's Ass While Kaden Worship's Spencer's Nice Cock ... Kaden tells Chaz to let him get some of Spencer's cock while Chaz eats his ass. Never one to argue about eating ass, Chaz does as he's told and moves behind Kaden to chow down on that beautiful hole while Kaden makes love to Spencer's nice cock. Watching Kaden suck cock is one beautiful thing to witness as he takes his time, slowly and carefully, licking, sucking, slurping and enjoying the entire cock from top-to-bottom. Watching Kaden get his hole licked and eaten while he enjoys a nice cock is hot stuff. Chaz gets right in there where the good stuff is and spreads Kaden's ass apart so we can see the hole really good. Meanwhile, Kaden is worshipping the cock in front of him as only Kaden can. So hot to watch this. Chaz is eating and jerking at the same time and Kaden is loving the attention. Spencer is having himself the time of his life with such a beautiful man handling his cock. Kaden has it nice and wet with his spit as he moves up and down the shaft. Spencer just watches and enjoys the visuals. Chaz Moves Up To Feed Spencer his Cock While Kaden Keeps Sucking Spencer ... After he's given Kaden's sweet ass a round or two, Chaz moves up to feed his cock to Spencer while Spencer gets his cock serviced by Kaden. Spencer isn''t shy and he latches on and gives as good as he gets. After this, the position changes once more and they put Kaden on his back with his legs in the air as Spencer moves close so Chaz can eat Kaden's ass, suck his cock and suck Spencer's cock too. Kaden licks on Spencer's bubble butt as this threesome sets the room on fire. Spencer Tells Chaz He Better Lick Kaden's Ass Or Something Cause He's About To Fuck Chaz Good ... Spencer asks Chaz if he's ready for some of his cock in his ass and tells him he better lick Kaden's ass or something cause he's about to fuck him good. Chaz keeps sucking Kaden's cock as Spencer moves in behind him to fuck him good and hard. Spencer makes his entry and it's on. He's fucking Chaz fast and hard and Chaz is having a hard time keeping up with this jack rabbit. This boy came to fuck some ass. I tell Spencer to long stroke that ass and he does as he's asked. He's fucking Chaz good and Chaz is letting him know. I get some great shots of all the hot cock going in and out of Chaz's nice ass as Kaden enjoys the blowjob and nipple play that Chaz is giving him. Spencer slaps Chaz's ass a few times and he's loving it. He tells Chaz how tight his ass and Chaz tells him how big his dick is. Kaden comes up on his knees and keeps feeding his hot cock to Chaz as Spencer bangs him from behind. Spencer Hands Over The Reins To Kaden And They Put Chaz On His Back For The Finale ... Spencer asks Kaden if he wants a piece of that ass and Kaden quickly says yeah. They put Chaz on his back and Kaden goes in for a piece of that freshly fucked hole. Spencer feeds Chaz his cock while Kaden plows his ass. Kaden starts jerking Chaz while he fucks his hole and the speed intensifies. Chaz looks at Kaden and tells him to fuck that ass as he services Spencer's nice hard cock. Spencer is the first to blow as he cums all over Chaz's pretty face, leaving a big load all over the side of Chaz's cheek. Spencer shoves his cock back in Chaz's mouth and goes for another load while Chaz strokes himself while Kaden bangs his ass. Chaz is the next to go as Kaden rails him hard, he blows his own load all over his stomach as Spencer keeps working out another load for him and Kaden bangs out his own. Kaden is next in line as he delivers his load all over Chaz's stomach and what a big load it is. Our boy wonder, Spencer is about to blow again and he follows Kaden's load with another hot load of his own and it all just mixes in together. We do the close-outs and Chaz says his new playmates are more fun than Disney Land, Kaden says Chaz is awesome and Spencer says we worked him. And it's a wrap. Another hot session of mansex comes to a close.",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Spencer",
      "person_id": 35021
    },
    {
      "name": "Kaden",
      "person_id": 35022
    }
  ],
  "release_date": "2008-05-07",
  "scene_id": 70110,
  "series": "Rear Admiral",
  "tags": [
    "Gay"
  ],
  "title": "Chaz, Kaden & Spencer"
}