{
  "collections": [
    "Active Duty"
  ],
  "description": "Brock, Domenic, Reese, Kasey and Cole ... <br />Today's a big day and we brought some big boys to do the job. An Active Duty legend returns once more to the fold to do some very big honors and he's joined by some of our newest and hottest contenders. Cole comes to play with the newbies and meets up with an old friend as this five-man fuckfest becomes the stuff that classics are made of. Cole wasn't really supposed to fuck Brock in this scene, Kasey was supposed to be the only one to do the honors. We start out joking that Cole is really the one that's come to do the job and Cole even mentions having joked with Brock about it on the phone. We jokingly refer to Kasey as the 'decoy' as we break the ice for Brock. Brock doesn't yet know (and neither do the rest of us) that he'll end up with Cole balls deep inside him before it's all over. And what would be more fitting? These two made quick friends from the early days in Rear Gunners and have always seemed to really like one another. That in itself is something totally special about this video. But there's a lot more special things happening here to keep up with so stay with me, troops. <br /><br />The Cocks Come Out Right Away As Domenic And Reese Worship King Cole's Cock ... <br />I go to put on some laundry and when I come back, Cole's got his massive cock buried deep in Domenics hot mouth while Reese nipples around the edges, trying to get a taste. These two might be fighting before it's over, but right now they're sharing well. Brock is already down on Kasey's cock on the other couch. Things are taking the fast-track here as these five hotties get right down to business. Watching Kasey and Brock interact is somewhat surreal as these two ultra masculine guys share a few laughs and some good sucking. Cole is looking like a million bucks and that gorgeous cock that got him crowned 'King' is working like a charm. He's enjoying the attention of his newbies as he holds court on his chase throne. Cole starts jerking Reese and Domenic's hard cocks while they continue to service his. Brock is still busy with Kasey and all hell is bound to break loose soon. Cole pulls their boxers down for easy access before he stands them both up to get his own taste of some new cock. <br /><br />Cole Sucks Reese And Domenic While Kasey Latches On To Brock ... <br />Cole positions Reese and Domenic on either side of him and starts blowing their hard cocks in harmony as they stroke his hard cock. Kasey has moved down between Brock's legs by now and is enjoying himself as he gives Brock's cock a turn. Brock is hard as a rock as he enjoys Kasey's special undivided attention. Meanwhile Cole is pulling off Domenic and Reeses boxers for even better access as he continues to show off his oral skills. He might have been away for awhile, but he's more enthusiastic than ever. Watching him service these two nice cocks is heaven especially as you watch his own hard cock bounce in the breeze and get jerked by the other two. He spits on Reese's big meat and works both cocks equally good. Kasey is workin' Brock over good and what a hot site to see as these two muscle men service each other. Brock and Kasey get in a 69 and service each other simultaneously while Cole sucks Reese and Domenic sucks Cole. The smell of heat is so thick in the air, that you can actually hear the dogs barking in the background, troops. How's that for the smell of mansex? <br /><br />Reese Eats Domenic's Ass While Domenic Nearly Eats Cole's Cock ... <br />Reese finds his way behind Domenic and starts eating his sweet ass while Domenic continues to aggressively work on Cole's huge dick. Reese is tonguing every inch of Domenic's virgin ass and Domenic isn't letting up one inch on Cole's cock. Not many people can deep-throat King Cole, but Domenic is doing a damn fine job trying and Cole appears to be on cloud 9 as this newbie works his cock over good and deep. Reese is giving Domenic a 'rusty trumbone' as he strokes Domenic's cock and eats his nice ass. I get some great shots from beneath and it's just sizzlin' to watch. Meanwhile, Kasey is saddlin' up to take Brock's virginity and things are about to get crazy. <br /><br />Kasey Saddles Up To Steal Brock's Virginity ... <br />Brock is on the couch doggy-style as Kasey edges up slowly behind him to take his manhood. Brock is ready and Kasey goes in. The look on Brock's face is priceless as he mimmicks Big Jake's facial expressions from the first Behind The Line. Brock looks like he might cry as Kasey makes his intial insertion. Before he can say 'That fuckin' hurts', Kasey is already all the way in and pumpin' his ass nice and slow. Kasey is long-strokin' in no time at all and Brock is still wondering how we got here. Kasey is being a fine gentleman, but he's not pussy-footin' around. He's fucking Brock's ass and he's fucking it deep. I talk to Brock and tell him how good he's doing so he doesn't lose his focus. Works like a charm as he takes to it more and more. Cole, Domenic and Reese are still having their own fun over on the chase and I've got all five men in the frame. Brock is smiling by this time and I think he's feeling pretty proud of himself. But he's still got something ahead of him that I'm sure he's really gonna be proud when the day is over. Reese has bunkered himself beneath Domenic and is sucking his cock while Domenic enjoys Cole's nice cock. <br /><br />Reese Takes King Cole's Huge Cock Up His Tight Ass ... <br />Cole tells Reese to go get beside his buddy Brock that Brock has something to tell him. Cole saddles up and moves in behind Reese as Domenic positions himself in front of Reese to muzzle his yell's. Cole breaks the seal like he always does---slow and deliberate. Reese gets used to the huge cock in his ass and it's on. Kasey is fucking Brock hard and fast as Cole fucks Reese's ass and Domenic fucks Reese's mouth. Reese may be in some pain, but his cock is hard as a rock and he starts stroking it as Cole fucks him harder. Cole is now balls deep in Reese's ass and Reese is stroking faster and faster. Brock takes over on Domenic's cock and sucks it fast and hard as Kasey continues to fuck Brock's ass. This is where the tables turn. <br /><br />Cole Takes Over On Brock's Ass While Domenic Saddles Up To Ride Kasey's Ass ... <br />Two milestones are reached in this next segment as Cole moves over to man Brock's freshly devirginized ass and Kasey bites the bullet for our newbie, Domenic and gets fucked for his second time here at Active Duty. Cole works it in Brock's ass and starts pounding away pretty quick as Domenic works it slower and gentler for Kasey. Reese feeds his cock to Brock as Cole pounds him hard. Meanwhile Domenic has manuevered himself nearly balls deep in Kasey's hot asshole and Reese starts feeding Kasey his cock. Cole is fucking the hell out of Brock and Brock is letting it be known. Reese can't decide who's mouth is the hottest as he keeps moving back and forth between Brock and Kasey. Domenic is slow-stroking Kasey and taking his time as he enjoys the tight ass. Kasey's cock is rock hard as Domenic plows deeper and deeper inside him. Brock is strokin' on Reese's big meat as Cole pounds him harder. Cole asks Brock if he wants his hot load on his ass and Brock says 'I guess so, you done fucked it, motherfucker!' and with that remark noted, Cole blows a huge wad all over Brocks gaping hole, covering the freshly fucked manhole with his hot load. Domenic is ready to blow next and Kasey is eagerly waiting to feel his hot cum all over his back as Domenic sprays a puddle in the arch of Kasey's back. Kasey flips over and watches Brock's ass as it stays aimed in the air and Kasey blows his own load all over himself. Reese is next to cum and he doesn't disappoint as he shoots his wad across Brock's back. Domenic and Reese get down on their knees in front of Brock as Brock works out his own load and shoots it all over the two waiting chests. History has been made here at Active Duty today, troops, and you've had a front row seat.",
  "models": [
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Domenic",
      "person_id": 35080
    },
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Reese",
      "person_id": 35134
    }
  ],
  "release_date": "2008-05-22",
  "scene_id": 70112,
  "series": "Behind the Line 2",
  "tags": [
    "Gay"
  ],
  "title": "Brock, Cole, Domenic, Kasey & Reese"
}