{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden Mans The Porthole ... <br />This porthole has been getting some serious action, but it's not over just yet. These boys like to wear their toys out. And who would ever throw a toy away like the porthole? Kaden is in a mischievous mood tonight as he finds himself manning the porthole. He's watching, waiting, anticipating and his wishes are about to come true. In comes the first cock after a little peeking and Kaden latches right on. It's a nice, long perfect cock with a huge set of balls. Kaden strokes his own cock while he jerks and admires the huge meat. His dirty talk kicks in as he asks the cockowner is he likes it. Kaden takes the moans as confirmation as he drops to his knees to worship the meat. I think the editor got as confused as the cameraman as he shows one cock and one ass that both belong to different people LOL. What a wild ride. No matter which ass goes with which cock, Kaden doesn't care and isn't that what glory holes are all about? Kaden is doing his job of playing cock worshipper, who cares about an ass? Kaden is making love to this fat cock like he just tied the knot with it. And what a perfect site it is to watching him so unabashedly enjoy himself. This proves my theory that everyone loves a huge cock as Kaden idolizes the monster. <br /><br />Everyone's Getting Sucked ... <br />As they wait their turn on the other side, Spencer and Reese get a little too horny to hold off and find themselves sucking each other like mad as they wait for Kaden's mouth. Spencer is chomping down on Reese's big cock and Reese is enjoying every second of it as he strokes his own big, hard cock. Finally the hole becomes available and Spencer is the first to step up as he delivers his nice thick cock to Kaden's waiting mouth on the other side. Kaden picks right up where he left off on the last hard cock and does his duty well. He jerks it and sucks it while he jerks himself. Kaden's famous little moans alone will send you over the edge as he really gets into what he's doing. He slaps his own cock on it as someone says Put your dick through here and Kaden does. Kasey and Reese are waiting on the other side to share in the glory of Kaden's nice cock as they worship it together. Kaden fucks the hole hard as the boys service him good. Kaden kisses the door and licks it as they suck and lick his cock on the other side. Spencer jerks and watches the cocksuckers return the favor. <br /><br />Kaden Puts On A Show The Boys Can't Resist ... <br />Kaden moves himself to the middle of the floor and begins slowly moving and gyrating his nice round edible ass around in circles. Almost like he's doing a private lap or couch dance for whoever's on the other side of the porthole. The others watch intently and tell him to spread his ass cheeks, Kaden continues teasing and playing as the others get hornier and hornier (and you will too) as they watch this little show. Kaden has fun taking orders from the boys as he does everything they tell him to do. Bend over, arch that back, let us see that little tight ass of yours. is what we hear in the background as Kaden obliges. The boys can't take it anymore and they beg him to let them in. Kaden says you can't, it's locked but the boys aren't hearing that. Spencer reaches in through the hole and unlocks the door as he, Kasey and Reese barge through the door and immediately get themselves tangled up with Kaden on the floor. <br /><br />Let The Four-Way Begin ... <br />Once they're in, they're in. Reese finds himself down behind Kaden eating his nice little ass as Spencer lets Kaden suck his cock. Kasey is on standby waiting on a spot. Spencer gives him the reigns as he goes and shares his cock with Reese who eats ass and sucks in unison. Reese slaps Spencer's cock on Kaden's ass as Kaden sucks Kasey and things are bound to get outta hand soon, troops. Reese keeps sucking and licking Kaden's hole and we get to see some great close-ups of that tight pucker as it gets licked good. By this time, Kasey is fucking Kaden's throat fast and deep. It isn't long in this ritual before the primates pair off. Kasey grabs Reese and leaves Spencer alone with Kaden as they pair off for the mating. Spencer moves in behind Kaden and starts slapping his hard cock all over Kaden's nice round ass. Kasey and Reese watch and jerk for a bit then get into their own fun. Kaden slowly crawls to the couch and positions himself to be fucked as he looks back at Spencer and says, come on, fuck me. This is so fucking hot. Reese and Kasey egg them on as Spencer moves in to slowly start the deed. We watch as Spencer's long, hard cock slowly makes its way deeper and deeper in Kaden's tight fuckhole. What a sight to see. By the time he's balls deep, Kaden has adjusted well and the fucking is on. Meanwhile Kasey is fucking Reese behind Kaden and Spencer and Reese is bunkered down to take a good fucking. All this action has both of them super horny as a hot, sweaty fuck session begins. A good solid twenty minutes of hardcore ass fucking follows. Reese comes somewhere in the middle, but goes back to getting fucked. Kaden is into it now and telling Spencer to fuck his ass. A lot of pounding, moaning and fucking later, Kasey blows his hot wad all over Reese and Kaden is begging for Spencer to cum. Spencer obliges and lands a fat wad all over Kaden's back and ass. The boys suck Kaden off at the end and he blows a huge load. The boys leave through the porthole door and Kaden runs over and yells through the hole, Thanks for playin' and it's a wrap.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Reese",
      "person_id": 35134
    },
    {
      "name": "Spencer",
      "person_id": 35021
    }
  ],
  "release_date": "2008-08-15",
  "scene_id": 70116,
  "series": "The Porthole",
  "tags": [
    "Gay"
  ],
  "title": "Kaden, Kasey, Reese & Spencer"
}