{
  "collections": [
    "Active Duty"
  ],
  "description": "ÓDomenic Mans The Porthole ... The feature kicks off with Domenic manning the porthole and what a natural fit he is. The cocks start coming through and it's your job to guess which cock belongs to who. The cocks on the other side include: Reese, Kaden, Kasey, Spencer and Damien. At the porthole, a cock has no name and Domenic isn't discriminating as they shove them through and he services each one with diligence. The first cock comes through the hole as soon as the camera comes on and it's a nice, big, fat cock and Domenic grabs it immediately and starts sucking it. Closer examination shows that it's a nice, thick cock with the perfect set of balls and whoever it is attached to is enjoying Domenic's service as the owner moans loud from the other side. A quick view with the camera from the other side of the porthole will reveal that it might belong to Reese, but you don't see his face. Standing behind him is what appears to be Chaz with a huge boner waiting his turn. Back on the other side of the porthole, Domenic continues to work his magic as he strokes his own hard cock. He licks, sucks and worships the rod and the whole anonymous aspect seems to turn both the cockowner and the cocksucker on. The huge, heavy balls hang low and Domenic can't resist sucking on them and giving them their due attention. Some clever camera work from the other side of the hole shows the cock fucking Domenic's mouth from a whole new perspective. So hot. The Cocks Line Up As A New Cock Comes Through The Porthole ... What would appear to be Chaz goes next as he's been waiting patiently and hard for some porthole action. He shoves it through and Domenic doesn't miss a beat. He picks up on it where he left off on the other one. With each new cock Domenic seems to adopt a whole new technique just for that cock. A quick view from the other side reveals the cocks lined up as the boys are clad in their plain white boxers. Five cocks in all wait for service on the other side as one is being serviced; the other four wait their turn as they stroke themselves and each other. Domenic is ready for the call of duty as he services whatever comes through the hole. And he's doing it with grace and integrity. The Cocks Take Their Turns As Domenic Welcomes New Visitors ... Now, the third cock makes its way through the porthole and it would appear to be Kasey, but you'll have to figure it all out for yourself. What's most fascinating here is that Domenic doesn't care whose cock it is. He's quickly taken to the meaning of the hole as a place where a cock has no name, no body, no face and the thought of this seems to add to his enjoyment and enthusiasm for what he's doing. He's worshipping cock and he's doing it very well. He gets the meaning of the hole and seems to be really enjoying it. As Domenic services his third cock, the camera takes a stroll on the other side of the hole to reveal the hard cocks being stroked that are waiting their turn. All the cocks are standing at attention and the boys are waiting patiently. Someone is fucking the hole by now and making lots of noise, as Domenic's skills must be getting better and better. This porthole user is slamming his hard cock down Domenic's throat as he bangs the wall hard. Up next is what appears to be Kaden as he tells the loud porthole fucker to let him get some of that. Another cock comes through the hole for Domenic and he's staying the course. Reese Eats The Ass While Domenic Sucks The Cock ... Reese pulls down the boxers of the cockowner to reveal a beautiful ass and starts eating it while Domenic services the cock on the other side of the porthole. What a perfect round ass it is as Reese buries his face deep in it and his tongue far up it. All this action has gotten Domenic hard and horny and he's ready for some servicing of his own. Domenic Reverses The Roles And Gets His Cock Serviced ... Domenic shoves his hard cock through the hole to see if there are any takers on the other side. If they are as good at giving as they are at taking then he just might be in luck. Kaden steps up to bat and mans Domenic's cock as he services it as well as Domenic serviced his. Domenic's cock is long, hard and perfect and Kaden is worshipping it like it might be the God of cocks. Watching this is so fucking hot. Kaden sucking a cock is one of those priceless things to witness as he does so with such care and enthusiasm. A shot from the other side reveals Domenic's nice ass pumping the hole and a nice mouth latched onto his cock. Those pearly whites must belong to Kaden and those moans are unmistakable. Kasey comes in to help his partner in crime and the two of them take turns worshipping the long, thick cock as Domenic enjoys two mouths for his hard work earlier. While Kasey mans Domenic's cock, Kaden turns his attention to Reese's fat meat and things heat up on both sides of the hole. The boys form a circle around Kaden as Kasey keeps Domenic's cock entertained and Kaden makes his way around the circle, sucking all three cocks equally as good as the last. He strokes two as he sucks one and it's three for one as he makes his rounds. Kasey is doing a fine job on Domenic all the while. Domenic then does some watching through the porthole as he watches Kaden suck all the cocks. This is a hot view, as the camera gets clever again. Domenic Wants More Cock ... As Kaden makes his rounds, Domenic must feel left out. He yells through the porthole hey give me another dick over there. His request is quickly filled as another hard cock comes through the hole for him to play with. The other boys are having fun with Kaden's hot mouth as he continues to service all three cocks in unison. Reese takes Kaden's place on the other side and sucks the hard cocks and Kaden on this go-round. Kaden enjoys the break by getting his cock sucked as well. The Cocks Start To Cum ... One by one, the cocks start to cum and the first one explodes right through the hole as Domenic grabs it and milks the load out. Domenic strokes his own hard cock as he waits for the next erupting cock to come through. When the huge cock comes through it blows a fat wad all over the place, making a huge mess of the porthole as well as all over Domenic's uniform. The third cock to come quickly comes through and blows an even bigger load of cum through the hole. The floor is covered in hot jizz. What appears to be Kaden bends over and gives Domenic a nice ass shot as he spreads his ass cheeks to reveal his hot hole. Chaz And Damien Talk Domenic Into Opening The Porthole Door ... In every good glory hole establishment there is always a honeymoon suite which is a bigger room that those who want more personal contact after getting acquainted through the glory hole can go into to get more physical. Damien and Chaz start talking to Domenic through the hole and convince him to let them in. Domenic opens the door and the three of them get down to the act of consummation. They decide that Domenic deserves some attention for all the attention he's been giving and they both go down on his hard cock and share it together. Damien sucks the balls as Chaz sucks the cock and Domenic enjoys the attention. Things quickly switch up and before you know it, Chaz is pounding Damien's ass hard as Damien sucks on Domenic's hard, thick cock and moans loud. Seems Damien's moans and his enjoyment are making Domenic harder and harder. Chaz gives Damien a reach-around and strokes Damien's cock while he plows his tight ass. After Chaz has fucked Damien's hole nice and loose, he turns him over to Domenic to man the helm and Domenic is more than ready to fuck that nice, tight ass. Meanwhile someone is watching through the porthole. Is that you? They flip Damien over on his back on the couch for better access to both his loose fuckhole and his hungry little mouth. Domenic eats Chaz's ass for a while since it's right in his face. It isn't long before Chaz is gonna cum and he stands over Damien and blows it all over him. Chaz sticks around to help Domenic get the most out of this hot bottom boy as Chaz holds Damien's legs back while Domenic bangs him hard. I must say Chaz looks extra hot tonight as his muscles and definition shine under the light. He's clearly into seeing his two mates complete their mission. And they do. Domenic is next to blow as he's plowing Damien's ass and Damien strokes himself. Damien quickly follows and covers himself thicker in his own cum. That mysterious eye is still watching through the porthole. Is that you?",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Spencer",
      "person_id": 35021
    },
    {
      "name": "Domenic",
      "person_id": 35080
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Reese",
      "person_id": 35134
    },
    {
      "name": "Kasey",
      "person_id": 35026
    }
  ],
  "release_date": "2008-08-15",
  "scene_id": 70115,
  "series": "The Porthole",
  "tags": [
    "Gay"
  ],
  "title": "Chaz, Damien, Domenic, Kaden, Kasey, Reese & Spencer"
}