{
  "collections": [
    "Active Duty"
  ],
  "description": "Domenic Is Back, Cole Is Well and Chaz is Along For The Ride ... <br />Domenic returns to the fold after King Cole has gotten his allergies cleared up and Cole's got his main partner-in-crime, Chaz, in tow with him today as we prepare to deflower another Active Duty virgin. Domenic did such a good job in Behind The Line 2 that he's surely already found his way into many of your hearts. I know he's found a way into my heart. Today he's looking as delicious as ever and up next to Cole and Chaz, it's a threeway made in heaven. What's about to unfold will reaffirm the truth behind that statement. I warn Domenic in the beginning that Cole and Chaz go way back and they don't show any mercy. My words were in vain on that one because Domenic is the perfect match for these two. I go to put some clothes in the dryer and come back to find the boys hard as rocks and already getting down to business. Chaz and Domenic are sucking on Cole's nipples while they play with his cock and theirs. Domenic goes right for the monster cock and pulls it out of Cole's pants and has it in his mouth in no time flat. Chaz joins him and they share the meat together. Cole reaches over and grabs Domenic's cock. He tells Chaz he wants to find out what Domenic's packing and they all strip off their boxers. <br /><br />A Threeway Cocksucking Daisy-Chain ... <br />Cole goes down on Domenic as Chaz moves up to feed his cock to Domenic while Chaz strokes Cole's hard cock. Cole is going to town on Domenic's cock and Domenic is doing the same to Chaz. Chaz moves down to share some love with Cole's cock and Cole comes up to give Chaz some head while Domenic moves down between Cole's legs to service his cock. Domenic is deep-throating Cole's cock while Cole sucks Chaz. Domenic says it's so big and Cole suggest Chaz go help Domenic out. Chaz sucks the cock while Domenic licks and sucks Cole's balls. Things soon switch back to Cole sucking Chaz's cock and Domenic going it alone on Cole. Chaz starts pushing Domenic's head down on Cole's huge meat. The position switches as they put Domenic on his back with Cole's cock down his throat and Domenic's cock down Chaz's throat. Meanwhile, Chaz is stroking his own cock. Domenic switches over to Chaz's cock while Chaz goes back to Cole's cock. <br /><br />Chaz Eats Domenic's Ass As The Action Heats Up ... <br />Chaz finds his way down to Domenic's sweet asshole and starts licking and munching on it like it's the last ass on earth. He goes between Domenic's nuts, cock and ass, giving all three his equal attention. King Cole takes the camera to film a Cole Cam experience as he watches Domenic deep throat his massive rod. The boy is doing a fine job of pleasing the monster. Everyone has tasted everyone's cock, but it's time to taste some more ass. <br /><br />Domenic Eats Chaz's Ass To Prepare It For The Fuck ... <br />Domenic isn't shy and he is more than willing to hang with whatever you throw his way. He's eating Chaz's ass now and he's tonguing it good. Cole stands above as he watches and strokes his fat cock. Cole grabs the lube and starts lubing Chaz's hole up good. Chaz is talking shit and telling Domenic to eat his ass as Cole gets his asshole nice and slick with the lube. Won't be long now before somebody is getting fucked. Cole spreads Chaz's cheeks out and opens his hole wide. I ask Domenic if he's ready to fuck it and he says oh yeah! <br /><br />Domenic Fucks Chaz's Ass First ... <br />Domenic saddles up and takes the plunge. He's balls deep in Chaz in less than 60 seconds. Cole feeds Chaz his big cock while Domenic shoves his big dick in the other end. Chaz is in his favorite position and he's taking it like a champ. Chaz looks back at Domenic and says Fuck that shit bitch, you know how daddy likes it. and Domenic doesn't waste any time. He's slammin' his nice fat cock in and out of Chaz like a piston. Meanwhile Cole is choking Chaz with his giant cock and Domenic is fucking him. Chaz and Cole get into a rough spot with Cole nearly choking him as Chaz gags repeatedly and takes Cole's pre-cum in his mouth. He's got pre-cum dripping down his chin as Cole keeps slamming it further down his throat. Domenic is fucking him harder and faster from behind as Chaz spits on Cole's cock. Domenic is slapping Chaz's ass hard. <br /><br />Cole Takes His Turn On Chaz's Sweet Hole ... <br />King Cole shoves it in and goes balls deep from the start. He's telling Chaz to start riding it harder and harder and Chaz does as he's told. Cole is fuckin' his old partner in crime just like old times and these two really heat up the camera. They are getting it on like always and Chaz is takin that cock like the true champ we know him to be. Domenic better be paying attention here troops cause this is how it's done. He's paying close attention now to how well Chaz is sucking his cock while Chaz is getting plowed from behind. Cole is deep-dicking Chaz good and it's so hot to watch. Things switch up a bit and Chaz starts riding Cole's cock. He's bouncing up and down on it like he's riding a pogo stick and he's loving every second of it. Domenic keeps his mouth stuffed full of his big Greek cock. Chaz asks Domenic if he's ready to try it and Domenic says yes, he is. <br /><br />Domenic Gets Fucked For The Very First Time ... <br />Chaz saddles up and to take the newbie for a ride and what a ride it's gonna be. Domenic assumes the position and he seems to be more than ready for this new experience. Chaz makes his entry slow, but deliberate and he's in and the seal is broken. Domenic grabs onto Cole's cock and puts it in his mouth while Chaz fills his ass with cock. Domenic is in for a long ride as both Cole and Chaz are gonna fuck him before it's all said and done. It's not long before Chaz is pounding hard and fast that I realize Domenic's cock is rock hard. I tell chaz to flip him over on his back so we can see his hard cock and watch him stroke it as he gets fucked good and hard. Domenic's cock is flappin' in the breeze as he's pounded harder and harder. Cole straddles his face and reaches back and puts his finger in Domenic's mouth as he helps Chaz stroke Domenic's cock. Cole slaps his cock on Domenic's cock and what a hot fucking scene we have here, troops. These three are a threesome made in heaven. Cole is stroking both his own cock and Domenic's cock in unison as Chaz does the honors of loosening Domenic's hole so that Cole can take the reins next. Cole licks Domenic's underarms and his nipples too as he strokes both cocks. Cole's got his cock in Domenic's mouth now as he jerks Dom's cock. Cole says he's about ready to take a piece of that ass for himself and Chaz reluctantly turns it over to him. <br /><br />Cole Moves In To Finish The Job ... <br />Chaz has gotten our newbie all opened up to the new thrill of getting pounding and Cole is about to drive it home. Cole slides his huge cock all the way up Domenic's ass as Domenic keeps jerking his cock and Chaz shoves his cock down Domenic's throat. Domenic is taking nicely to this new experience as Chaz and Cole really work him over good. Domenic is stroking his hard cock faster and faster as Cole fucks him harder and harder. It isn't long before he's over the edge and blowing a huge load all over himself as Cole keeps banging him deeper and deeper. He shoots a huge wad of his own jizz all over his stomach, making a puddle of his own cum in his belly button. Cole doesn't stop though, he's gonna go for his own nut and he's gonna use Domenic's tight ass to help him get it. When he does blow, it's a big load and it mixes in with Domenic's jizz all over his stomach. Chaz follows their lead and lands his load all over Domenic's face. Cole and Chaz both agree that we have a natural on our hands with Domenic and I'm sure you'll agree.",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Domenic",
      "person_id": 35080
    }
  ],
  "release_date": "2008-05-29",
  "scene_id": 70113,
  "series": "Rear Admiral 2",
  "tags": [
    "Gay"
  ],
  "title": "Chaz, Cole & Domenic"
}