{
  "collections": [
    "Active Duty"
  ],
  "description": "Gio Finds The Porthole And Gage Helps Him Along ... I show Gio The Porthole and he vaguely knows what it is (at least he says) but he claims he's never seen one up close. The boys are shooting the shit and having some beers. All hell is about to break loose. Gage with his nosey self joins us as I show the hole to Gio. Gage has got to be in the middle of everything and he's about to get in the middle of this go round. I tell Gio I'll go see if I can rustle up some cock and Gio assumes the position down on his knees. The first cock comes through and it's our anonymous friend who just happened to be over and agreed to get involved if his face wasn't shown. Gio goes to work on the uncut meat and the games have begun. Meanwhile Reese and Randy stroke each other's big cocks behind the stranger on the other side and Gio is hungry on the other side as he gets Randy's huge cock through the hole. Gio is loving all these cocks and he's sucking them all like they might be his last. Gage Mans Gio's Hole While Gio Mans The Porthole ... Gage gets down behind Gio and tongues his ass while Gio services the cocks in front of him. Gage gets really into eating Gio's ass as he gets down on his side on the floor so he can get his tongue as deep in his ass as possible. Reese's huge cock comes through and talk about making someone's mouth water--Gio is literally slobbering on the huge meat while Gio eats his ass. Reese and the stranger stroke each other while Randy gets his cock serviced for a while. Reese gets down on his knees to service the stranger and the stranger seems to like it. On the other side, Gage is stroking and licking and spitting in Gio's hot ass all the while Gio is doing his duty. Gage Fucks Gio's Nice Ass While Gio Continues To Serve The Cocks ... Gage decides Gio's ass is ready for a fucking and mounts up to do the deed. At Gio's request, Gage smacks his cock all over Gio's ass. He tells Gio to keep sucking those cocks while he fucks him. Gio is very submissive and takes orders nicely. Gage decides it's best to straddle Gio's ass and he gets him from behind in an interesting position. He's in full control of pounding that ass. Gage lays on Gio's back so that he can reach forward and suck a cock while he rams Gio's ass. It's so hot to watch Gage suck a hot cock while he pounds Gio hard and fast. These men are horny and they are determined to make the most of it. Gio stands up to give Gage better access to his hole and Gage keeps fucking him hard. Gage And Gio Move To The Couch While Randy Mounts Up To Fuck The Stranger ... Gage says he wants to move Gio to the couch, but he'll need a crowbar to get him off the dick he's sucking. Gio reluctantly agrees to move to the couch while Randy gears up to give it to the stranger on the other side while Reese watches all the action. Our stranger is showing off his pink tight hole for the camera while Randy feeds his mouth. Reese is watching all the action and telling them what he wants to see. He's telling Gage how to fuck Gio and watching as Gage deep dicks Gio and Gio jerks himself. Reese Joins Gage and Gio While Randy Gives The Stranger His Wishes ... The stranger says he wants some of what Gio is getting and Randy moves in for the kill. Randy fucks like a jack rabbit and today is no exception. He mounts the Stranger and shoves his hard cock balls deep into his ass. The stranger strokes his hard uncut cock and takes the fucking like a champ. Randy is a dirty talking top and he's talking shit to our bottom boy stranger as he rams his cock deep into his wet hole. Randy reaches around and squeezes and pulls his balls out of the way so we can see his horse cock drill deep into the strangers horny hole. Meanwhile, Reese is long-stroking Gio's ass on the other side. He gets really anxious and Gio has to tell him to slow down. Reese is lost in wild abandon and it's a hard ride. Randy milks the strangers prostate and the stranger blows his love juice all over the wood floor. Randy shoves his cock back in for good measure as the strangers milks the last drops from his dick. Randy sticks a finger in to check the hotness and tells the stranger he's on his way to the other side. Randy Joins Gio, Reese and Gage on The Other Side For The Grand Finale ... By the time Randy makes it to the other side, Reese is fucking Gio hard and fast as Gio sucks Gage. Gage sits on Gio's face and Gio tongues his hole while Randy feeds his fat cock to Reese and Gage eats Randy's ass. Randy is getting what I call the car wash treatment as he gets his ass and cock serviced by two hot mouths at once. What a feeling. Gio can't take it anymore and he's ready to blow his load. Reese grabs his cock and strokes the hot cum out for him all over Gio's stomach as Reese keeps pounding Gio's hole.",
  "models": [
    {
      "name": "Gage",
      "person_id": 35084
    },
    {
      "name": "Randy",
      "person_id": 35130
    },
    {
      "name": "Reese",
      "person_id": 35134
    },
    {
      "name": "Giovanni",
      "person_id": 35177
    }
  ],
  "release_date": "2008-09-20",
  "scene_id": 70127,
  "tags": [
    "Gay"
  ],
  "title": "Gage, Giovanni, Randy, Reese & ???"
}