{
  "collections": [
    "Active Duty"
  ],
  "description": "A Note From Dink ...Hey troops. I've been working on Miles for months now. As you know, we posted his first solo in the War Chest Archives a couple of months ago. Well, a lot has been going on behind the scenes with Miles since then. I was working on him and he agreed to come through and do a male/male video for me but flaked out a couple of times. So, I decided to try another tactic. I decided to have him over while Spencer and Gage were around and talk them into helping me bring him across the line. Miles is very reluctant at first (the ladies always protest too much) and puts on a big front about the whole thing. I just keep pushing the envelope until he's packed up between Spencer and Gage to see what happens. I wasn't surprised when he kept faking the funk and kept protesting. I think the fact was he wanted it so bad he could taste it. You know my old theory that goes back to our childhood stories: Please don't throw me in the briar patch knowing that's exactly where they want to go. So, I just keep easing the situation along in this one and let Gage and Spencer do all the work while I play innocent. I think Miles knew damn well what was going on and he certainly surprised the hell out of me with how far he went. He went from zero to dick up his ass in about forty-five minutes. Watching this big dick man take to the bottom like a fish in water is a wonderful watch. Enjoy.Miles Meets Spencer And Gage ...Miles comes over to do a solo, but little does he know there are other plans cooking in the background. I've got two trustee helpers, Spencer and Gage hanging around the house that night to help matters move forward. There's a lot of discussion back and forth with Miles about what he will and won't do, but I am getting the impression that half of what he's talking is all a front. I keep pushing the envelope a little further and eventually Spencer comes in the room and joins Miles on the bed. Miles seems shocked but doesn't overly protest. Spencer pulls his cock out and starts jacking it while Miles jerks himself. I tell the guys my wide angle lense is broken and that they'll need to scoot in closer. Miles doesn't hesitate and moves right in closer to Spencer. Funny how that works. Both guys are stroking hard and fast and Miles is taking his fair share of peeks at Spencer's hard cock. In fact, I'd say at some points he's down right starring at it. Gage eventually finds the party and joins Spencer and Miles for the jerk off party. I come back in the room and act surprised, asking Gage what the fuck are you doing in here?. The boys play right along and I stay innocent. I kid Spencer and Gage about having the hots for each other. Before you know it, Gage is naked and on the bed jerking with them. The funny thing here is that Miles never goes soft, not once. He stays hard as a rock the entire time.Spencer And Gage Keep Pushing The Envelope ...I leave the room (Gage says Go bake that pie) and leave these three to their own devices. I always like to see what they can get themselves into while I'm gone. It all starts out with measuring their cocks with their hands. Spencer reaches over and grabs Miles' cock and squeezes it to see who's is thicker. Spencer says Miles has him on the thickness. Eventually they talk Miles into grabbling Spencer's cock. And now, we know where things go next. Miles and Spencer start jerking each others cocks. Gage joins in the party and they are all jerking and playing with each others cocks. Spencer convinces Miles to let him suck his cock and so Spencer goes down on Miles and starts sucking him. Once he's sucked Miles for a bit, Spencer and Gage convince him that he is supposed to return the favor and so Miles does what he thinks is right and wraps his lips around Spencer's cock. Miles really gets into it as he sucks and strokes Spencer and takes his time. I walk back in the room to find all this going on and convince Gage that he should be sucking Miles while Miles sucks Spencer.Two Mouths Are Better Than One ...Now that Miles is learning the ropes, he's got to know what two hot mouths feel like on your cock and balls at once. I talk Spencer and Gage into sharing that big, fat uncut cock together and Miles just lays back like he's having the time of his life. I mean, wouldn't you be having the time of your life? Miles is plainly enjoying the hell out of all this attention as he moans and groans and looks down and tells Spencer, Damn you do that better than my girlfriend man.If You're Going To Fuck An Ass, You Gotta Eat It First ...I tell Miles that we have a rule -- if you are going to fuck an ass you gotta eat it. Miles cracks a huge grin and says OK. Gage gets on his hands and knees and throws his ass in the air while he sucks Spencers cock, leaving his ass in the air for Miles to eat. Miles moves in and seems to take to this new adventure just fine as he tongues and eats Gage's hot ass. He must be doing a good job because Gage is talking shit and moaning. He's clearly liking Miles action. Gage is talking shit to Miles telling him it tastes just like a pussy and Miles is agreeing as he laps at the nice ass with his tongue over and over. It is clear that Miles doesn't mind working for an ass if he gets to fuck it. Gage tells Miles to put a finger in it and Miles follows directions. He sticks his finger in Gage's ass and eats it while he finger fucks it. Miles does something we don't see straight boys do very often and he starts stroking his hard cock while he finger fucks Gage's hole.Let The Fucking Begin ...You ready to get that hole fucked? asks Miles. And with that he shoves his dick in Gage's ass. It's a big dick and Gage decides to take it laying on his back so he can stroke his own hard cock while Miles bangs his ass with the huge dick. This is one beautiful sight to see as we watch Miles bang his huge dick balls deep into Gage's ass and Spencer's rock hard cock slap Gage in the face. Gage is right where he was born to be---between two hard cocks taking it like a man. Gage is stroking his own hard cock fast and steady as Miles fucks him like a jack rabbit. Spencer moves in to get some of Gage's ass and Gage is loving it as he strokes out a nice juicy load all over his stomach while Spencer keeps banging.Miles Decides To Get Fucked After All ...Once he's seen Gage take it and like it and cum with a big cock in his ass, Miles decides it must not be all that bad so he takes up where Gage left off and throws his legs in the air so Spencer can fuck him. Spencer saddles up and moves in for the task at hand. Miles is stroking his hard cock before Spencer even gets inside. You can tell he's been waiting on this all night long. He's as horny as he's probably ever been and he's about to get what he came for. Spencer slides in slow and easy, giving Miles time to appreciate it and boy does he. Miles is jerking his big uncut hard cock faster and faster as Spencer gives it to him deeper and deeper. Eventually Spencer is pounding him deep and fast and showing no mercy at all, but that's OK, it doesn't look like Miles is looking for mercy. He is enjoying this deep pounding as he strokes his cock faster. Miles shoots his load and what a load it is. He hits his shoulder he's so turned on he blows it everywhere.Spencer Cums On Miles Face And Miles Licks Up The Last Drop ...After blowing his load, Miles looks up at Spencer and says, I want you to cum on me and Spencer does just that. He straddles Miles face and blows his hot, juicy load all over his mouth. Miles takes the head of Spencer's cum covered cock in his mouth and sucks the last drops off himself. So hot.",
  "models": [
    {
      "name": "Spencer",
      "person_id": 35021
    },
    {
      "name": "Gage",
      "person_id": 35084
    },
    {
      "name": "Miles",
      "person_id": 35122
    }
  ],
  "release_date": "2008-10-10",
  "scene_id": 70128,
  "tags": [
    "Gay"
  ],
  "title": "Gage, Miles & Spencer"
}