{
  "collections": [
    "Active Duty"
  ],
  "description": "Levi Meets Spencer And Elijah ... My friend Buzz West introduced me to Levi and said he needed some work. I took one look at this blonde beauty and decided to give it a go. He's so gorgeous and innocent looking that I decided to pair him up with two scamps that could help bring him along quickly. What better two to do the job than Spencer and Elijah. The boys take to each other pretty fast with lots of banter back and forth while they stroke their cocks. I tell the guys I'm baking the newbie a pie and that gets a few laughs. Spencer is eyeing the cocks as the boys take off their clothes to reveal rock hard cocks. Spencer's eyes roam between the two, but he seems to like Elijah's the most. Elijah Questions The Newbie And His Intentions ... Elijah wastes no time in asking the newbie what he is willing to do and the newbie says he'll do everything but get fucked and rim. But that'll change later when he's eating Elijah's ass like it might be the pie I baked for him. Things kick off with Levi stroking Spencer's cock while Elijah eggs on the situation. He tells Levi to suck Spencer's cock and he'll suck Levi's and Levi doesn't hesitate. There's a threeway suck-a-thon on in no time flat as Levi takes Spencer's cock down his throat and Elijah services Levi. Levi must be doing a really good job because Spencer seems like he's in heaven. Watching Levi go down on that rock hard cock is amazing. Levi doesn't discriminate and moves right over to Elijah's cock next to give it a whirl while he reaches back and jerks Spencer's cock while he blows Eli. It's Musical Cocks And Everyone Is Singing ... The boys play musical cocks, everyone taking a turn and everyone getting sucked at some point as the three of them take turns on one another. Levi sucks in every position imaginable as the threeway gets more and more heated. Spencer goes down on Levi and shows him how much he's appreciated for his good oral skills as Levi keeps sucking on Eli. Elijah gives Levi's cock another spin as he really gets into sucking the rock hard meat. Levi Eats Elijah's Sweet Ass To Ready It For The Fucking ... Levi does what he initially said he wouldn't and before you can say eat his ass he's already eating Elijah's sweet hole and he's really getting into it, spitting in it and licking it like there is no tomorrow. For someone who said they wouldn't do this, he seems like he's been here before. Funny how that works, huh? Elijah sucks on Spencer's hard cock while he gets his ass serviced from behind and his cock stroked in unison. Levi sticks his thumb in Elijah's sweet pucker and gets it losened up to fuck. Levi Fucks Elijah Good And Hard ... Levi saddles up and shoves his hard, long cock all the way up Elijah's hot ass and Elijah keeps the pace with Spnecer's cock in his mouth. Elijah is really enjoying this as Levi smacks his ass and fucks it hard and deep, railing him good and hard. It isn't long before Spencer wants him some of that nice ass and tells Elijah to ride his long, hard cock. Elijah Rides Spencer's Cock ... This is one hot segment when Elijah sits down on Spencer's hard cock and rides it for all it's worth. Things end up in a threeway jerk session with Elijah and Spencer both coming twice for the camera. Our Newbie got a little stage fright and bows out of the cum session, but he'll be back soon enough to give it another try.",
  "models": [
    {
      "name": "Spencer",
      "person_id": 35021
    },
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Levi Buzz",
      "person_id": 35178
    }
  ],
  "release_date": "2008-07-26",
  "scene_id": 70120,
  "series": "Caught in the Crossfire",
  "tags": [
    "Gay"
  ],
  "title": "Elijah, Levi & Spencer"
}