{
  "collections": [
    "Active Duty"
  ],
  "description": "Chaz Introduces DJ To The Porthole ... <br />The camera comes on with Chaz showing DJ The Porthole and telling him all about it. They open it up to find some hard, hot cocks jerking on the other side. It doesn't take long for them to talk someone into putting their cock through. The first cock to enter the hole is that of King Cole and we all know what a cock that is. Cole puts it through and DJ does the honors as he stuffs the fat cock down his throat. The two of them share the monster back and forth, giving it some really hot service as it stands at attention. In no time flat, DJ pulls out his own hard cock and begins stroking as he sucks Cole's cock more. Chaz follows DJ's lead and has his own hard cock in his hand stroking as they continue to share the cock. Cole is stuffing the hot mouths full of hard cock. Elijah's cock comes through next and gets the same hot attention that Cole's got as the cocksuckers enjoy the spoils of The Porthole. DJ is back on Cole's dick in a jiffy and man is he enjoying this big cock as he slowly makes love to it through the hole. <br /><br />Troop Rotation and Reciprocation ... <br />Things switch up and DJ stands to put his cock through the hole and Elijah is waiting on the other side to return the favor. DJ's hard cock is getting the same full attention he gave earlier as Elijah goes first and boy is he hungry. He's getting down on DJ's cock like a champ as DJ enjoys it. Cole stands behind Elijah, stroking his hard cock and Elijah looks torn on which one to suck, but he's a fair guy so he gives DJ the attention he deserves first then turns his attention to Cole's huge cock and gives it a round. Elijah strokes his own hard cock as he literally hums on Cole's rod. What a hot sight to see. Meanwhile back behind Elijah is another hard cock waiting in the hole and this time it belongs to Chaz. <br /><br />Cole Mans The Porthole And Does His Duty ... <br />Cole mans up and takes on Chaz's hot hard cock through the hole. He's sucking and stroking the hard meat and paying back his dues for the good cocksucking he's been getting. Cole has never been one to be greedy and his generosity is showing in the attention he's giving Chaz. Cole spits on the hard cock to lube it up for his mouth as Chaz moans in pleasure on the other side. Cole strokes his own cock and moans along with him as this oral session gets hotter and hotter. Elijah moves in closer and Cole latches on to his cock and goes back and forth between them while his own hard cock swings in the wind. Things switch up again and Elijah mans the hole from their side as he finishes what Cole started on Chaz's cock. Elijah goes back and forth between Cole and Chaz's cocks. Suddenly DJ's cock comes through the hole and Elijah and Cole switch places again. <br /><br />Chaz Is Back At The Hole With Both Hands Full ... <br />Chaz is back at work and this time he's sucking a huge cock in front of him and stroking DJ's cock behind him. What a magician. Cole is getting his cock sucked and stroking Elijah's behind him at the same time. Talented troops we have here. Chaz passes it off to DJ who gives it another round. Elijah can't hold it anymore on the other side and sends his load through The Porthole for Chaz and DJ to admire as it oozes down the wall. He's got another one though and we'll get to see it later. Elijah is horny as all hell today. <br /><br />Ass-Eating Action Through The Porthole ... <br />Elijah loves to bend over and have his asshole plundered and he puts it up to The Porthole to see if he can get some tongue action. DJ takes the call of duty and tongues Eli's hot hole as Elijah pushes his hole against DJ's hot, wet tongue. Elijah is rolling his hot little ass around getting that tongue deep inside his twitching little fuckhole. He latches on to Cole's huge cock again as he's getting his hole tongue-fucked and sucks the monster, keeping both holes full. <br /><br />Elijah Gets Fucked Through The Porthole...DJ Get's Fucked On The Other Side ... <br />Elijah's ass has been eaten good now it's time to get it fucked. DJ saddles up and does the honors as Elijah keeps sucking on Cole's huge meat. Meanwhile Chaz moves in behind DJ and sticks his cock deep inside DJ's hole while DJ pounds Elijah through door. <br /><br />The Porthole Door Opens And The Troops Unite ... <br />The boys decide it's time to meet face to face and so The Porthole door opens and Elijah and Cole join DJ and Chaz on the other side. Cole strokes Chaz's cock as he passes by and in no time flat, Elijah straddles Cole and starts riding his huge, hard cock. What a fucking hot mess this is to watch as Elijah pounds up and down on the massive meat. Elijah's hole is spread open wide as the huge cock plows deeper and deeper into his ass. His cheeks are spread to maximum capacity and he's screaming loud about how big the cock in his ass is. He's riding it and loving every second of it. Meanwhile Chaz bends over for DJ and DJ makes the plunge deep into Chaz's hungry hole. The action is so intense you may need to stop to catch your breath. I know I just did. They're both getting fucked good and hard. <br /><br />Cole Fucks DJ While Chaz Fucks Elijah ... <br />Things switch up and Cole bends DJ over the arm of the couch and starts railing his ass hard and deep. DJ is in for a surprise when the huge monster goes in to the nuts. Chaz asks DJ how he likes that dick and DJ says It's big. Cole rams in and out of DJ like a piston grinding in a hot rod motor and DJ is taking it like a man. Chaz is fucking the daylights out of Elijah's hot, sexy ass as these four bring the party home. The hairs on Elijah's ass have curled up and goose bumps are covering his cheeks. Me thinks he's liking this dicking. <br /><br />The Cumshots Are Caught In The Crossfire ... <br />The cumshots start happening so fast and Cole and Elijah decide they are both gonna come at almost the exact some time, but Chaz is the first to land his load all over Elijah's stomach. Meanwhile Cole has started blowing his load on DJ's ass and I catch that as it flows out all over DJ. Without warning, Elijah comes at almost the same time and I'm able to catch both cumshots, even though it was a challenge. DJ is the last to cum as he bends over and leans back into Cole's huge cock one last time. The cum has flown and the fun is over as DJ closes up The Porthole. Mission Accomplished.",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Elijah",
      "person_id": 35081
    }
  ],
  "release_date": "2008-09-20",
  "scene_id": 70126,
  "series": "The Porthole 3",
  "tags": [
    "Gay"
  ],
  "title": "Chaz, Cole, DJ & Elijah"
}