{
  "collections": [
    "Active Duty"
  ],
  "description": "Thomas, Domenic, Brock and Kasey ...These four heroes meet up for some fun at my place and it turns into some really hot fucking. When the camera comes on, all the cocks are hard and all the guys are stroking and laughing and joking back and forth. There is lots of banter between myself and the guys and everyone is in a good mood. I had wanted to get Domenic and Thomas together so badly. I thought these two would make one hell of a match and they did not dissappoint me. Kasey and Brock are one hot pair as well and when things get going, watching these four hot men go at it is almost unreal. Isn't this the type of group scene we'd all like to get in the middle of?Group Stroke ...Kasey and Brock are stroking each other on one couch as Thomas and Domenic stroke each other on the other couch. Everyone is hard and ready as things begin to move forward. All the guys stand up and hoover close in a semi-circle for a circle jerk. The boys shake their cocks around and admire each others dicks. They are all smiles as they enjoy a good old fashioned circle jerk.Cocksucking Circle ...The cocksucking begins with Kasey sucking Brock and Domenic sucking Thomas and all the boys are enjoying themselves as Kasey and Domenic stroke themselves while they suck and worship the cocks in front of them. Brock and Thomas talk back and forth about how their cocksuckers are doing. They tease Domenic about being innocent and he was until he saw Thomas' cock. It isn't long though before Thomas has switched places with Domenic and is sucking on his cock like a champ. Kasey is making love to Brock's cock all the while stroking his own hard cock fast. Brock and Kasey move in beside Thomas and Domenic and Brock takes the helm on Kaseys cock as Brock and Thomas suck Domenic and Kasey. Brock and Thomas are taking lessons in licking cock shafts and they are passing the test with flying colors.Brock Eats Kasey's Ass To Get It Ready ...Brock has Kasey bend over the couch so he can eat his nice, round bubble butt and get it ready for the fucking that is coming soon. Domenic is on his knees worshipping Thomas' cock again as it all unfolds. Thomas is having fun watchin Brock eat Kasey's ass. Thomas reaches over and spreads Kasey's ass cheek open for Brock to have better access. Thomas goes back to sucking Domenic and tries his best to deepthroat Domenic's long cock. Thomas moves the circle trying out all the cocks and ends up on Brock's jock. He gets it ready for Kasey's ass as Kasey sucks Domenic.Brock Moves in To Fuck Kasey's Ass ...Brock is all hot and bothered now and ready to fuck some ass. He moves in behind Kasey as Kasey sucks on Domenic's dick and starts slowly sliding his cock into Kasey's hot hole. Thomas moves in to join Domenic and keep Kasey's mouth full of cock while brock keeps his ass stuffed nice. Brock puts Kasey on the arm of the couch for the final stretch and Kasey strokes his cock whle Brock pounds his ass. It doesn't take long in this position before Kasey is blowing a huge load all over himself as Brock bangs his hole deeper and deeper. Brock follows closely behind and lands one of his huge trademark loads all over Kasey's chest and stomach. Kasey says now we know why Brock has so many kids. LOLThomas Fucks Domenic ...Thomas says something to Domenic about getting fucked with his big, fat cock and Domenic jumps to his feet and says yeah. Talk about wasting no time on small talk. Domenic assumes the position like he's been waiting on this all day long. It isn't long before Thomas is pounding him balls deep and Domenic is taking it like a man. Talk about being a great bottom, eager to please. I think Domenic takes the prize. Domenic shoots a huge load, almost hitting himself in the face. Thomas isn't far behind with a huge load of his own and he lands it right on top of Domenic's load, mixing it in with his own cum, Domenic talks about how nice and warm it is. And, it's a wrap.",
  "models": [
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Domenic",
      "person_id": 35080
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2008-10-10",
  "scene_id": 70129,
  "series": "Caught in the Crossfire 3",
  "tags": [
    "Gay"
  ],
  "title": "Brock, Domenic, Kasey & Thomas"
}