{
  "collections": [
    "Active Duty"
  ],
  "description": "Elijah Discovers The Porthole And More ... <br />Elijah is back from thirteen months in the brig and he's missed the hot sex here at Active Duty. In just a few minutes you'll know what I mean. He's hungry and the Porthole is going to do a good job of feeding that hunger. He and I bullshit for a bit about the history of gloryholes, etc. When he opens the Porthole, there's already a cock waiting for him on the other side. How's that for troop readiness? <br /><br />Alert The Troops, The Porthole Is Open For Business ... <br />I go into the living room and tell Spencer and Gage that there's someone manning the porthole and he's gonna need some more dick to keep him happy. They're already watching a porn and stroking their cocks, so moving on to the porthole isn't a problem. They're ready for some action, too. The living room is dimly lit like a backroom porn theater and wouldn't you love to discover these two there on your next visit? <br /><br />Let The Feeding Frenzy Begin ... <br />Elijah is liking the idea of all these cocks coming through the porthole as he yells for another cock to find it's way through. In pops a new long, hard dick for him to service and he's on it quicker than you can say, suck it. If Elijah's cock is any indication of how much fun he's having, I'd say he's having a ball. His cock is hard as a brick as he strokes it and sucks the cock in front of him. You can tell he's so horny he can hardly stand it. He's beating his meat fast and hard as he sucks the cocks faster and more intently. He's moaning and groaning on the cocks and they're all standing at attention. It isn't long before his pants are gone and he's stroking his hard cock while he gives expert service to the hard cocks. Meanwhile Gage is playing with Spencer's ass on the other side of the hole while Spencer enjoys the ride. They switch up and Gage fills the hole with his hard, fat cock. <br /><br />Elijah Takes His Turn At Fucking Some Face ... <br />Elijah puts his cock through the hole to enjoy some oral attention himself and just the image of him standing there with his perfect ass and body as he fucks the hole is enough to send me over the edge. He's packed on about 15 pounds of pure muscle since we seen him last and it's really looking good on him. Meanwhile Gage is busy with his mouth full as he gives Elijah as good as he's was getting. It isn't long though before Elijah is back on his knees wanting to suck more cock and the boys oblige with their hard pricks, feeding his hungry mouth all the dick he can handle. Eli is strokin' his own hard cock fast and hard as he sucks the cocks deeper and deeper. <br /><br />Elijah Wants To Get Fucked Through The Porthole ... <br />Elijah is so horny he's about to explode. All this action has got his tight little hole twitching for some pleasure. He spits on the hard cock in front of him then turns around to slide it in his tight ass. This is the first cock he's taken in thirteen months so it's gonna be tighter than ever, but it's also hotter than ever. You can tell how bad he's been wanting this. He's slapping the head of the hard cock all over his puckered fuckhole as his own hard cock swings in the breeze. Brace yourself troops, it's about to get way hot up in here. He uses some gun oil to grease up the cock and ready it for his waiting hole. He turns around and eases back on the long prick, moaning and grunting all the while. The looks on his face are priceless. <br /><br />The Porthole Is Opened And All Hell Breaks Loose ... <br />Elijah wants that cock deeper inside of him than he's able to get it through the hole, so he opens the porthole door and lets Spencer is to do the job deeper. Meanwhile Gage has Damien bent over the counter fucking his brains out. Spencer turns Eli around and starts banging him harder. The action is all over the place as these four men fuck like crazy. Elijah is bent over with his elbows on his knees as Spencer slams in and out of him deeper and deeper. He's getting what he's been missing for a long time and he's loving the attention to that ass. Damien is getting his brains fucked out by Gage and you're gonna wish you were right there, doing the same. Eli tells Spencer not to be scared to fuck him harder as you see the delight on his face from the big cock in his ass. Meanwhile, Eli is stroking his hard cock as his ass gets pounded harder and harder. Damien is holding his own against Gage's big cock and taking it like a champ. <br /><br />Elijah Fucks Gage's Ass While Spencer Manhandles Damien ... <br />Things switch up and it's Elijah's turn to fuck some ass. He's been eyeing Gage's all night and he's about to take out all that pent up frustration out on it. Gage assumes the position and Elijah moves in behind him while Spencer bangs Damien harder and harder. Eli has Gage straddled and he's tearing that ass up. I get some great underneath shots of that hard cock pounding in and out of that nice fuckhole. Elijah puts Gage on his back and keeps pounding his hole fast and deep as Gage's cock gets harder and harder. Meanwhile Spencer lays on his back and Damien rides the donkey while Elijah keeps pounding Gage. Elijah is the first to cum and he blows his load all over Gage's stomach. Spencer pulls out and blows his load all over Damien's ass cheeks, all around his fresh fucked hole. Gage rubs Elijah's hot cum all into his stomach and abs as he strokes out his own huge wad all over himself. It's a typical Gage cumshot, huge and juicy.",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Gage",
      "person_id": 35084
    },
    {
      "name": "Spencer",
      "person_id": 35021
    }
  ],
  "release_date": "2008-08-15",
  "scene_id": 70122,
  "series": "The Porthole 2",
  "tags": [
    "Gay"
  ],
  "title": "Damien, Elijah, Gage & Spencer"
}