{
  "collections": [
    "Active Duty"
  ],
  "description": "Spencer Shows Gage The Porthole ... <br />We did a little set up for this one, but it was fun as Cole filmed the intro from his belly while laying on the grass as Spencer tells Gage about the porthole. Once Spence shows him the glory hole, things get going pretty fast. The two bullshit back and forth about the ethics of the glory hole. Gage aint no fool so he takes to the idea pretty fast. When Spencer leaves, he decides to give it a shot. This is all a little contrived here, but it was fun putting it together and the fantasy is built in automatically. It makes for some hot video and some hilarious Behind The Scenes. <br /><br />Meet Chance ... <br />When Spencer finds his way back to the other side of the glory hole, he's got it all figured out and tells Chance he's got a friend on the other side who wants a blowjob. Chance is waiting in the wings, ready to give some head and when the cock comes through, he's on it like white on rice. Spencer is callin the shots. And they're battin' nine-hundred. Chance takes hold of Gage's cock coming through the hole and worships it better than any anonymous cocksucker would. He's in love with this dick and there aint no hidin' it. Spencer doesn't need to teach him anything else, he's caught on fine. Chance says he's got a big dick in his hands and Spencer says that's the glory hole for ya. Chance is getting into this cocksucking and the freedom of not facing his cockholder seems to be fasinating him more. Gage is loving the action and letting us know with his reactions. <br /><br />Spencer Direct's The Show ... <br />We all know how well Spencer can direct when he gets in the mood. Well he got in that mood on this shoot while he watched Chance suck Gage's big cock through the Porthole. Wasn't long before Spence was in rare form, telling the cocksucker how to do it. You'd have thought, well, lord, if you know so much about it, get down there and do it yourself, Spence. And he does. But not before he gets his cock sucked good by Chance. <br /><br />Spence Mans The Hole ... <br />Being in charge ain't always easy and when Spence is given the reigns, he does pretty good. He gets down and works the cock to be sure Chance doesn't outdo him. But it isn't long before Gage is working Spencer's dick again. <br /><br />Gage Eats Chance's Ass ... <br />Gage wants to taste some ass and Chance aint backin off of giving him one to eat. Chance turns around and bends his ass over and reveals a delicious ass to Gage. Gage tongues the hell out of it like we all would and Chance looks like he's ready to get fucked long and hard by anything that'll give it to him. Gage is gonna make sure of that. Gage fingers his ass deep while Spencer feeds him his cock. They talk shit to Chance and Chance just loves it. What a cocksucker we found in this one. Spencer names him an excellent cocksucker and the beat moves on. <br /><br />The Tables Turn And Chance's Ass Is Right In The Middle ... <br />Chance turns around to service another cock through the Porthole and Spencer is so horny at this point that he's ready to fuck Chance's ass. He starts slappin' his hard dick all over Chance's ass and watching this is so fucking hot. Chance turns around and serves it up. Spencer is right in there, giving it to him. Spencer fucks Chance down to the ground on this go' 'round, troops. <br /><br />Chance Takes Spencer's Cock Like A Good Spankin' ... <br />Chance is on his knees, giving Gage head and takin' a fat cock from his budddy Spencer. This is hot. Spencer aint playin' he's giving it to Chance like a good little bitch. . Spencer is fuckin' tfhis guy like there aint no tomorrow. Chance is sporting a nice hairy hole and he obviously likes to get it banged and Spencer isn't wasting any thrusts, he's hitting it home deep every time. Spencer straddles him and fucks him harder while Chance continues to service the big cock starring at him through the porthole. <br /><br />Spencer Invites Gage To The Other Side Of The Porthole ... <br />Spencer yells out to Gage, you want some of this? Come on over here. But first, Chance turns around and starts taking Gage's cock through the porthole. This is so hot to watch as I get some great angles of the action all around. It isn't long though before Gage wants to enjoy that ass fully so the door swings open and Gage comes to the other side of the Porthole. He's banging Chance's hole while Spencer feeds him cock. These three are super hot together. Their bodies complement each other so well and watching them fuck and suck is enough to blow your mind. <br /><br />Spencer Fucks Gage While Chance Watches ... <br />This is Gage's first time ever getting fucked on video--even though you've seen him get fucked in other releases, this is it. This is truly his first time as you'll later see in the hilarious Behind The Scenes Footage. Gage gets down on all fours and Spencer eases in behind him, slowly sliding that long, beautiful cock deep inside of him. Once Spencer is in, he fucks Gage's virgin ass good. You can see the pink ring as it hugs around Spencer's long cock. It isn't long until this tight virgin ass is making Spencer blow his huge load all over Gage's back. What a hot mess we've got on our hands here, troops.",
  "models": [
    {
      "name": "Chance",
      "person_id": 35057
    },
    {
      "name": "Gage",
      "person_id": 35084
    },
    {
      "name": "Spencer",
      "person_id": 35021
    }
  ],
  "release_date": "2008-08-15",
  "scene_id": 70121,
  "series": "The Porthole 2",
  "tags": [
    "Gay"
  ],
  "title": "Chance, Gage & Spencer"
}