{
  "collections": [
    "Active Duty"
  ],
  "description": "A Note From Dink ...<br />In this brand new release we are introducing all you non-members to a very special new recruit, D.J. This hot, blonde Marine is sporting one of the prettiest set of green eyes I have seen in quite awhile. He's also sporting a nice, thick nine inch cock that Elijah seems to love playing with. And that nice, tight bubble butt that Kaden and Thomas have a lot of fun fucking. DJ just got out of the Marine Corp and he'll be with us for awhile here at Active Duty. DJ recently admitted to himself that he prefers guys and he's having a blast exploring here at Active Duty with all the other hot guys. Join us as we introduce you to this sexy devil dog as he gets himself more than he bargained for in the two scenes of this DVD.<br /><br />Kaden, DJ and Thomas Get Right Down To Business ...<br />The boys are already naked and hard when the camera comes on because we were shooting pictures before we started filming the video. This tends to loosen the guys up a little and get them hot and horny before the actual shoot. I've found it works nice lately. So, the cocks are hard and we're bantering back and forth a little as the boys eye each others cocks. I'm certain that leaving these guys alone for a few will produce some nice results and I was right. Not thirty seconds after I leave the room and DJ is going down on Thomas' hard, fat cock while Kaden rubs his thighs. It looks like they're gonna worship the giant cock for a bit and they do. Kaden jerks his cock as he watches DJ suck Thomas and the two of them share the huge cock back and forth as they jerk themselves. After a little sharing, Kaden decides to give Thomas something to suck on and moves up on his knees to feed Thomas his cock. Meanwhile DJ mans the post on the huge tool between Thomas' legs. If there is one thing a man with a big cock loves, it's having it worshipped and Thomas loves to have his cock worshipped. I think he likes to see the reaction. All this is going on while I'm out of the room.<br /><br />DJ Makes His Rounds ...<br />Thomas wants to make sure that DJ gets his fill of good cock and suggest he get some of Kaden's. DJ doesn't hesitate and moves his attention to Kaden's hard cock and worships it. Kaden strokes Thomas and then DJ repositions himself so Kaden can suck him and Kaden moves over to suck on DJ while Thomas reaches under and jerks Kaden. Thomas then gets on his knees to feed DJ more of his cock while Kaden worships DJ's cock. Nobody is missing out on any of this fun as the three of them make sure each other gets plenty of attention. Thomas is doing his usual dirty talk to the boys and everyone is having a good time. Kaden's hard cock swings in the breeze as he licks and sucks DJ's cock. Again, Thomas reaches under and grabs Kaden's cock and jerks it hard. Thomas starts pushing Kaden's head down on DJ's cock and it's so hot to watch as Kaden shows off his cocksucking skills. Kaden licks DJ's thigh front knee to cock and what a hot site to see. My, my, my. That alone will just about make you blow. Thomas moves in to take Kaden's place and Kaden moves up to give DJ his cock. Like I said, no one is missing out in this free-for-all. It's cocksucking heaven. Kaden's cock is harder than his nice, tight and chisled body as DJ shows him how an expert sucks cock.<br /><br />The Boys Do Double-Time On Each Other ...<br />Thomas finds himself in a unique position and is stroking both DJ and Kaden's hard cocks, trying to figure out which one to suck first. Kaden's gets the first attention, then while Thomas is sucking DJ, DJ strokes Kaden. The boys go back and forth and back and forth.<br /><br />DJ Eats Kaden's Ass ...<br />DJ gets down behind Kaden and starts licking and sucking on his nice pink fuck hole. Kaden's hard cock is bouncing around as he grabs onto Thomas's fat cock and strokes and sucks it. DJ's face is buried deep between Kaden's rock hard cheeks and he's eating that sweet ass like it's dessert. DJ starts fingering Kaden's hole while he strokes Kaden's hard cock and Kaden goes to town on Thomas' cock. Thomas smacks Kaden's ass a few times and gets a rise out of Kaden. Thomas moves down and starts worshipping Kaden's cock while Kaden sucks on DJ some more. Kaden's rock hard and he's horny as all hell. Thomas strokes, sucks and works that hot cock like it's his own.<br /><br />Kaden Eats DJ's Ass ...<br />After getting his eaten and his cock worshipped good, Kaden decides it's time for him to eat some ass. He tells DJ to suck Thomas' cock while he eats DJ's ass and DJ doesn't complain. Would you? Kaden slaps his hard cock on DJ's ass before he eats it. Kaden is slapping DJ's ass and spreading out his ass cheeks before plunging his tongue deep in DJ's hole. He does it over and over and what a hot mess to watch. Get out your fans, these boys are on fire. Keep those fans out because you're gonna need them many times. Kaden is eating DJ's ass and really getting into it as he takes his cock and slaps it on DJ's hot ass every so often. It's clear that Kaden is hornier than he normally is and he's wanting some of that hot ass in front of him. Meanwhile Thomas is keeping DJ's mouth nice and full with his fat cock and DJ is having a blast.<br /><br />Kaden Fucks DJ First ...<br />I knew it wouldn't be long before Kaden was fucking DJ as you watched his cock bounce up and down hard as a brick while he was eating DJ's ass. Kaden saddles up and makes the plunge deep into DJ's ass. It isn't long before Kaden is balls deep in DJ's ass and he's banging it harder, harder and faster with each thrust. DJ is sucking on Thomas' cock as he takes the fucking of his life. Thomas keeps the dirty talk going and DJ is clearly having himself a ball. Thomas says Get that tight asshole warmed up for this big cock. and Kaden does as he's told. He's fucking the hell out of DJ. I'm not sure I've ever seen Kaden fuck anyone this hard and agressive before.<br /><br />It's Thomas' Turn To Fuck DJ's Ass ...<br />Kaden turns the reigns over to Thomas and DJ gets on his back with his legs in the air and offers his freshly fucked and loose ass up to Thomas to devour with his huge meat. Thomas steps in and drives it home as Kaden gives DJ something to keep his mouth busy. DJ strokes his own cock as Kaden rubs his nipples and Thomas plows his ass hard and deep. Kaden slides his hard cock down DJ's throat and the camera nearly melts. Thomas strokes DJ's cock while he pounds his ass hard and fast. Kaden smacks his hard cock on DJ's chest and watches the huge cock go in and out of DJ's ass deep. They turn DJ over and Thomas goes in from behind as DJ sucks and licks on Kaden's hot cock. They're working DJ over Active Duty style and he's getting what he came for.<br /><br />Kaden Blows His Load On DJ's Face While Thomas Covers His Back ...<br />After DJ gives Kaden one hell of a hot blowjob, Kaden strokes out a nice load all over DJ's face and almost instantly, Thomas is blowing his hot, huge wad all over DJ's back and I mean he shoots what seems like a gallon all over DJ's back and ass. I didn't think Thomas was going to stop cumming. We do a little chit-chatting after the shoot and DJ says he's proud of himself for taking Thomas' huge cock and Kaden agrees that DJ has star potential. Thomas and I had a $50 bet going that he couldn't shoot his load over DJ's head and we go back and forth saying we owe each other money. It's a wrap.",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2008-08-30",
  "scene_id": 70124,
  "series": "Caught in the Crossfire 2",
  "tags": [
    "Gay"
  ],
  "title": "DJ, Kaden & Thomas"
}