{
  "collections": [
    "Active Duty"
  ],
  "description": "DJ Meets Elijah and All Hell Breaks Loose ...All of you know how crazy I am about Elijah. There's just something about him that oozes pure sexuality. I mean he's hot, horny and always ready and that's my kind of guy. Elijah is one of those guys you can't put a label on. He's as masculine as all get out, but he's not shy about sucking a cock or taking one deep up his beautiful ass. Elijah is also a good talker and he loves to try pulling things out of new guys so I leave him alone with DJ to see where things go. Elijah never lets us down. The two of them shoot the shit about the military and martial arts and the different styles and just get to know a little about each other. You can tell Elijah is flirting with DJ as he tells him how he looks so big and musclar. Elijah is such a scamp and he's working DJ just like he wants to. Watching these two work into things is so fascinating and so fucking hot. DJ says to Elijah, What you working with over there and Elijah just smiles. The two of them move in closer to each other and start rubbing each other all over. As they are talking, Elijah moves right in and locks lips with DJ and they kiss long and deep for what seems like a long time.The Ice Is Broken And It's On ...After the long kiss, Elijah moves down DJ's body, kissing and licking his nipples. They kiss more and Elijah finds DJ's long, hard cock in his shorts and says oh yeah and from there you know these two are really gonna get into things. Before you can say suck his dick that's exactly what Elijah is doing. He's hungry and this nice long and fat cock is exactly what he needs. Elijah seems hornier than ever and DJ is right in there with him. Elijah takes DJ's cock deep down his throat several times, trying to go deeper with each try. He deep throats the big cock like a champ and his own cock is hard as hell inside his boxers and sticking straight out. DJ reaches under and plays with Eli's cock as Eli worships his. DJ goes down and swallows Eli's cock all the way to the balls and Eli just moans with pleasure. Elijah's body is looking so fucking hot these days and that ass is as round and delicious as ever. He reaches down and strokes DJ's cock while DJ sucks his.It's Sixty-Nine Time ...Elijah decides it'll be more fun for everyone if they sixty-nine so he crawls on top of DJ and grabs onto his cock and sucks it hard and deep. DJ eats and fingers Elijah's ass while Elijah deep throats his dick. Like always, Elijah is loving his hole being licked and fingered and he starts squirming around like a snake in heat. He's horny as hell and DJ must be too since his dick is so hard that everytime Eli lets go of it, it slaps back onto his stomach making a loud noise. DJ starts sucking Eli's cock and the two of them go at it like dogs in heat. It's clear these two are way into each other. They go back and forth giving each other deep head and worshipping each others hot cocks. It won't be long before someone has one of those cocks buried deep in their ass. Elijah is all over DJ's cock like white on rice and he's really into sucking and slurping on it. They embrace again for another long, wet kiss before Elijah stands up and straddles DJ's face and feeds him his cock deep down his throat. Elijah turns around and squats down to feed DJ his hot hole as he strokes DJ's hard cock. He tells DJ to put a finger in his hot ass as he strokes DJ harder and faster. He yells out to DJ, Oh I want you to fuck me in my ass And with that, he turns around and sits down on DJ's long, hard cock. He's ready to ride.Elijah Rides DJ's Hard cock And Takes It in A Few Positions ...Elijah is hotter than a firecracker and he can't contain himself. If he's trying to keep up a straight image, the only thing he's pulling off is the masculine part. But he's clearly in heat for a good fucking and DJ is is gonna give him what he wants. Elijah sits all the way down on DJ's cock and buries it deep inside his hot hole. DJ starts thrusting hard and fast and he's tearing Eli's ass up good. Elijah seems like he's been needing a good deep fucking and he's getting exactly what the doctor ordered. DJ is deep inside him pounding away deeper and deeper until all you can see is DJ's balls up against Elijah's ass. Get out those fans again, troops. Swooning is what you'll be doing. Elijah tells DJ he wants him to bend him over and fuck him harder and DJ follows his lead. Elijah bends over the bed and DJ gets behind him and picks up right where he left off. Elijah throws one leg up on the bed and we get to see DJ's huge cock going in and out of Elijah's tight hole. Deeper as he long strokes it, coming in and out and in and out. Elijah has got to be one of the best bottoms I've ever seen as he takes the mansize meat hard and fast. Elijah is yelling and screaming telling DJ to fuck him harder and DJ is obeying the commands. Elijah starts asking DJ if he can take a dick like that and DJ tells him yes. Elijah says let me give it to you and things take a turn.Elijah Fucks DJ As Deep And Hard As DJ Fucked Him ...Elijah gets in his favorite position and stands over DJ while DJ assumes the doggy position. Elijah is slamming down deep into DJ's ass while Eli stands flat on his feet. Elijah doesn't last long before he says he's about to come, but DJ aint gonna let him get away that fast. DJ flips over on his back and tells Elijah to come on and put that cock in him as he strokes his hard cock. Elijah thrusts his hard cock back inside DJ's hungry hole and bangs him harder and fast again. Elijah doesn't last long in this position either and before long, he's blowing his hot, juicy load all over DJ's cock and stomach. DJ keeps stroking himself as he watches Elijah's load land all over him.Elijah Tells DJ To Cum In His Mouth ...DJ is stroking his cock and Elijah says I want you to cum in my mouth, DJ looks up and says he wants Elijah to eat his fucking load. Eli goes down on DJ and DJ blows a huge load in Elijah's hot mouth and the sweet juice just runs all out of Elijah's mouth as Elijah sucks it out. They embrace in one last, long kiss and it's a wrap!",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Elijah",
      "person_id": 35081
    }
  ],
  "release_date": "2008-08-30",
  "scene_id": 70125,
  "tags": [
    "Gay"
  ],
  "title": "DJ & Elijah"
}