{
  "collections": [
    "Active Duty"
  ],
  "description": "Chaz And DJ Team Up For Some Hot Fun ...The Third scene is a charm. Chaz is such a character. He and I always get some great laughs together. The camera comes on and Chaz is saying something about Steve and I ask who the hell Steve is and say it must be an imaginary friend. I tell Chaz that I have a real friend there for him to play with today but that his imaginary friend can still join in and play along. Smart ass Chaz says Great, I think he should bottom. It's obvious from the start that he and DJ are gonna make one hell of a match. Two all-American boys with their blonde hair, blue eyes and beautiful skin. They complement each other so well.Once I'm Gone, It's On ...Funny how that works. As soon as I leave the room they start playing with their cocks and Chaz compliments DJ on his impressive piece of meat. Chaz gives DJ the option of getting sucked or sucking first and DJ choses to suck Chaz first. As soon as he goes down on Chaz you can tell he's been wanting this for quite some time. He's deep-throating Chaz's nice hard cock in no time flat. Chaz is enjoying the attention and starts rubbing DJ's nice body as he gets his cock sucked. Chaz reaches under and starts stroking DJ's cock and from there it's on.Chaz Returns The Favor ...Chaz can't wait to get his mouth around DJ's nice, long cock and he really gets into sucking the impressive piece of meat as he gets very animated in his cocksucking spotlight. Chaz rubs DJ's chest while he sucks his cock and nuts. DJ is clearly in heaven as he tells Chaz when asked if he thinks he made the right choice. Chaz is a showstopper and loves the attention the camera gives him while he's the one in charge. He goes for a kiss and they lock lips in a nice long kiss.Sixty-nine Time ...They assume a nice side sixty-nine position and both of them go at each other's cocks like hungry pups on a tit. It's clear they've both made the right choice and the imaginary friend is there to capture it all as the camera stays on the two like white on rice. They finger each other's holes while they suck and DJ ends up on top with his finger up Chaz's ass while Chaz fingers DJ's hole. They eat each other's nice hot holes like there's no tomorrow. Chaz wraps his legs around DJ's shoulders and if you aren't having fun by now, you should turn it off.DJ Fucks Chaz ...After all the hot oral fun, it's time for some fucking and DJ decides he wants to fuck Chaz first. Once he's in, he starts pounding that nice ass hard and deep. Chaz rubs DJ's chest while DJ deep dicks his nice ass. DJ moves in for another kiss and what a hot one it is. These two have passion beyond belief. DJ flips Chaz over and does him doggie-style for a while and Chaz backs up on that cock like he's in heaven. Things take another turn and Chaz rides DJ's cock as he sucks and licks on DJ's nipple and kisses him deep and passionately.Chaz Fucks DJ For The Finale ...Chaz wants a shot at DJ's ass and DJ is ready to oblige. DJ lays down on the bed and gives Chaz what he wants as Chaz slides in nice and slow giving DJ what he wants too. Once Chaz is in he shows no mercy and I don't think DJ wanted any to begin with. Chaz starts pounding him hard and fast as DJ strokes his hard cock fast and furious. Chaz slows down a few notches so DJ can milk out his huge hot load and he blows all over himself as Chaz slow-strokes his ass. Chaz goes next and lands his load right on top of the beautiful mess that DJ made. I think the bond has been forged.",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "DJ",
      "person_id": 35025
    }
  ],
  "release_date": "2008-09-15",
  "scene_id": 70134,
  "tags": [
    "Gay"
  ],
  "title": "Chaz & DJ"
}