{
  "collections": [
    "Active Duty"
  ],
  "description": "A Note From Dink ...<br />I've gotten so many e-mails about the super cute and super hung Randy. So many of you just love this hot little package and with a personality and cock the size of Dallas -- who wouldn't? Since he first appeared here on Active Duty the e-mails have poured in wanting to know when we were going to get him to give up that sweet little virgin ass. Bulletproof 2 puts all that behind us (and Randy) as we get to see this hung hottie give it all up as he joins Kaden and Elijah for a threeway that ends with everyone taking a cock up their ass. Randy proves to be quite the trooper and Bulletproof 2 kicks off with a great first scene.<br /><br />Kaden, Randy And Elijah Get Orally Acquainted ...<br />Things kick off as usual with the boys laying on my bed playing with themselves and chit-chatting back and forth. This time the boxers are all that's left when the camera comes on and all the cocks are rock hard, ready for action. A little more than two minutes in and Randy says he thinks they should all suck some dick. Kaden says Randy can start on his and Randy is between Kaden's legs, sucking his cock faster than you can say Bulletproof 2.<br /><br />Elijah hops in there and helps Randy out and you can tell right from the start that this is going to be one hell of a threeway. Elijah positions himself so that Kaden can suck his cock while Randy works on Kaden. The boys peel off their boxers like an unwanted layer of skin. Nothing is in the way of their good time now. Kaden is sucking Randy's giant cock now as Elijah enjoys a taste of Kaden. Things move fast, so pay attention. Randy goes back down for more of Kaden's nice meat as Kaden strokes both Randy and Elijah, enjoying his blowjob all the while.<br /><br />Elijah Eats Randy's Ass ...<br />Things move right along and before you know it, Elijah has other plans. He positions himself behind Randy and starts eating his tight ass, getting it worked up for the fucking. But before that happens, Kaden wants another round with that huge fat cock of Randy's and he goes down for another dive.<br /><br />Elijah and Randy lock lips in a deep, wet and sensual kiss and the screen just melts. Elijah is working his way right into Randy's heart to make getting in his ass a bit easier. Randy is taking to it like candy and loving every second of it. The passion in this scene is over the top as these three really explore themselves some hot mansex. A hot circle-suck ensues and these three are on fire. The cocks are raging hard and the moans tell the story. Bulletproof 2 can't be bothered with being penetrated by any downtime. These three keep the action moving so fast and furious that you wonder if they even remember there's a camera there.<br /><br />Elijah Prepares Randy For The Mission At Hand ...<br />Elijah says it's time for Operation Penetration as he spreads Randy's ass cheeks apart to reveal his pink virgin hole. Elijah says he's gonna tear that shit up and Randy seems more than ready to have him do it. Kaden positions himself over Randy and does push-ups with his cock going in and out of Randy's hungry throat. Elijah slides his hard cock slowly into Randy's hot pucker and Randy takes it like a man while sucking Kaden's cock at the other end. Eli is balls deep and pounding fast and hard in no time flat and Randy is ready to ride it. They switch positions and Randy takes the hard cock for a ride cowboy style. They go from one position to the next and Eli fucks him six ways to Sunday.Just as Elijah is finishing up the deed, Randy gets a call and it's his live in girlfriend sayings she's outside in the driveway and for him to hurry his ass up. Thank goodness she didn't ask to come inside. Things could have taken a crazy turn if that would have happened. Luckily for us, and for you, Randy has completed the mission he was assigned and so we free him to go.<br />Elijah And Kaden Get Intimate and Anal ...<br />Once Randy is out of the picture and we're all safe from the possibility of female intrusion, Elijah and Kaden get down to business together, giving us an explosive ending to one hell of a scene. They both bottom for each for the other and what a sight to witness. These two are on fire together and you're gonna enjoy every minute of their intimate interaction as they both take it as good as they give it. I'm still speechless as I watch these two hotties get so into each other. Kaden laying across Elijah's back as he pounds his ass has got to be one of the hottest things I've seen in quite some time. Kaden is so relaxed this time around and gives his tight ass up to Elijah with ease and eagerness. You can tell he's come a long, long way from that first time when he and Kasey did the deed for one another. And, Elijah seems satisfied in the end that he finally got his chance with Kaden after so long. Elijah had met Kaden way back before Kaden had crossed the line and was still doing solo's. I had a hunch then that Elijah was just waiting for his chance at this fine piece of man meat. Today, he gets his wish and I think Kaden enjoyed just as much or more than Elijah did.",
  "models": [
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Randy",
      "person_id": 35130
    }
  ],
  "release_date": "2008-11-02",
  "scene_id": 70135,
  "series": "Bulletproof 2",
  "tags": [
    "Gay"
  ],
  "title": "Elijah, Kaden & Randy"
}