{
  "collections": [
    "Active Duty"
  ],
  "description": "Chaz And Dorian Bond By The Pool ...I always like to give the guys a little bonding time during the beginning of the shoots and today I chose to let Chaz and Dorian frolic in the pool as I set the camera up to watch them. They start out doing cannon balls and climbing the rocks of the waterfall, trying to outdo one another with their fancy footwork. The frolicking soon turns to grappling as these two commandos try to show each other who is boss. Some of their moves get quite close and intimate and you have a hard time telling whether they are fighting or about to fuck.The Match Continues In The Pool House ...Just when you think there might be a bloody brawl, the guys grab their towels and head for the pool house where the match continues, but it's not a bloody brawl, it's a fuckfight between two masculine men who have both served in Iraq, risked their lives for our safety, given their all to this country and now find peace in knowing that they can fuck as well as fight.On the way in, Dorian gives Chaz a playful slap on his ass with his wet towel and the look on Chaz's face is priceless. You just know these two are gonna be great together. Chaz is mumbling about what a big boy Dorian is and how strong he is. Then he turns to his Chazisms about spilling some Chaz on the floor a little later. Suck a character. The guys strip out of their wet bathing suites and show off their bodies. They hop on the bed and sprawl out naked side-by-side and I tell them we are gonna continue to watch as we've been doing. They are both cool with that.Can You Fuck Like You Wrestle? ...That's the next question Chaz asks Dorian as they stroke their cocks together and check out each other's bodies and cocks. Dorian says he's sure he can fuck better than he can wrestle. Chaz looks over at Dorian's hard cock and declares him a winner. Chaz moves in and takes the nice hard cock in his hot mouth and goes crazy on it. You can tell Chaz wanted to get his lips around this dick. He's hungry for it and it's showing in how eager he's sucking it. I'm not sure if I've ever seen Chaz this eager for a cock before. And who could blame him? Dorian is smoking hot and his cock stands at attention so nicely. Chaz says he's out of practice and Dorian tells him to practice away. Dorian is really into the head Chaz is giving and he's fucking his face by now. Chaz is stroking his own hard cock as he deep throats Dorian.A little Sixty-Nine Action ...Chaz tells Dorian to suck his cock while he sucks Dorian and Dorian has no problems with that at all. Chaz positions himself to give Dorian access. Dorian commences to making sweet, slow love to Chaz's cock while Chaz continues to devour his. Dorian's dog tags jingle in the breeze as these two hotties get a good taste of each other's cocks. They are going at it like two fighters in an octagon ring only this is hot sex and not fighting. The only fight here is to see who can out suck the other one. Things switch up a bit and Dorian gets on top of Chaz giving each other better access to one another's cocks. Chaz spreads Dorian's asshole wide open to reveal what he'll be getting into really soon. Dorian sucks Chaz like a pro and you know it won't be long before someone is getting fucked.Chaz Eats Dorian's Nice Ass And More ...Dorian squats over Chaz's face and gives him complete access to his hot hole as he moves down on top of Chaz's tongue. Chaz strokes his hard cock while he licks and sucks the nice hairy hole and Dorian is in heaven, his cock standing straight up and at full attention. Chaz has Dorian get on his hands and knees to give him better access as he spreads Dorian's ass cheeks wide to get his tongue deeper. All the while Dorian is stroking his massive hard-on and enjoying this anal attention.I Want You To Fuck Me In My Ass Says Dorian And Chaz Obliges ...After some serious ass-eating, Dorian's hole is ready for more than a tongue and he tells Chaz he wants him to fuck him in his ass. Chaz is always the gentleman and does as he's asked. Chaz stands over Dorian's open hole and mounts him, going in slowly at first, giving Dorian a chance to adjust. It doesn't take a lot of adjusting and Dorian is doing just fine as he strokes his own hard cock as Chaz pounds his hole deep. You can tell Dorian has been waiting for this to happen. Chaz is balls deep and Dorian is stroking himself hard and fast as these two experience the ultimate in male bonding. Isn't this how heroes are supposed to bond? Dorian is whispering to Chaz to fuck that ass and Chaz is talking back to him asking him if he likes it.I Wanna Ride Your Fuckin' Cock Dorian Tells Chaz And So It Is ...Chaz positions himself on the edge of the corner of the low bed and Dorian squats right down onto his hard, waiting cock. He slides all the way down on the hammerhead and takes it all deep inside him. Dorian's hard cock bounces in the breeze as he strokes it and lets it go, not wanting to blow his load too fast. Chaz's cock is balls deep in his ass and Dorian is loving it. Dorian is moaning like a pig in heat and stroking his hard cock faster and faster. This is mansex at its finest folks as these two heroes show us how it's done. A sneaky grin crosses Dorian's face as he tells Chaz, Oh God, you're gonna make me cum and strokes himself faster. Chaz is along for the ride as his hard cock is still balls deep in Dorian's hot ass.Dorian Shoots A Huge Load While Chaz's Cock Is Balls-Deep Inside Him ...After all that hard riding, this Marine is ready to blow his wad and what a huge, hot wad it is. Dorian sprays what seems like a gallon of cum all over the floor as it gushes out all over the place. It's evident that he liked what was going on. But he's not done yet. Dorian Returns The Favor And Fucks Chaz ...Dorian asks Chaz if he's ready for his and Chaz is never one to pass on a good cock in his ass. Dorian moves in behind Chaz and sticks his cock deep in his hole. The huge load that Dorian just shot must not have taken much out of him. He's rock hard again and balls deep in Chaz's ass in no time flat. He fucks Chaz hard and fast and then tells Chaz he wants to watch him cum. The two get on the bed side-by-side and kiss long and deep as Chaz strokes out his huge wad all over himself. The kisses are out of this world as these two bring things to an explosive close.",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Chaz",
      "person_id": 35019
    }
  ],
  "release_date": "2009-01-15",
  "scene_id": 70137,
  "tags": [
    "Gay"
  ],
  "title": "Chaz & Dorian"
}