{
  "collections": [
    "Active Duty"
  ],
  "description": "DJ Finally Gets A Crack At Gage ...DJ has been wanting him a piece of Gage since we started working together but things have never worked out until now. Today, DJ gets his wish and Gage seems thrilled that someone so hot has been wanting him so badly. We joke around about popularity contests and Gage says if he's gotta be popular he'll need a brand new Mustang. I offer up a stallion instead and Gage seems fine with that. We get a lot of laughs in before things heat up and these two go at it.I Leave To Mow The Grass And The Boys Get Down To Business ...As soon as I'm gone Gage looks at DJ and asks him if he really requested him and when DJ says yes Gage just beams with delight. They talk a little more shit and all the while they're both stroking hard cocks through their shorts. Eventually they get naked and the hard cocks come out. Leave two studs like this alone with hard cocks and something is bound to happen. Gage seems as into DJ as DJ is him. Gage spies DJ's big cock once he pulls it out of his boxers and it doesn't take long before Gage is all over it, sucking and worshipping the huge meat. DJ kicks back and enjoys the attention. Gage is about as hungry as Cash was in the last scene and Chaz was in the first scene. He's making love to DJ's cock and he doesn't even seem to remember there's a camera recording it all. Once he's given DJ's cock a good sucking, DJ is ready to do the honors.DJ Sucks Gage In Return ...DJ latches onto Gage's hard cock and gives it a go. Gage kicks back and enjoys the ride while DJ worships his dick. He can hardly get any sucking time in edge-wise before Gage is all over his cock again. Gage is in love with DJ's perfect dick and you can tell by how much he wants it in his mouth. They go back and forth sucking each other's dicks and making sure each other gets plenty of oral attention.The Kiss ...They embrace in a long, hot, deep kiss in between their cocksucking extravaganza. What a hot sight to see. Gage starts licking and sucking DJ's torso working his way all the way up DJ's chest and back to his lips for another hot kiss. More hot kissing and more hot cocksucking and then another kiss. These two are on fire. Gage is loving DJ's nipples and keeps licking and sucking them in between licking and sucking his cock.Gage Eats DJ's Ass ...After some long hot kisses and some hot cocksucking, Gage decides to put his tongue somewhere else as he turns DJ over on the bed and gets behind him to lick and eat his ass. DJ starts moaning as Gage practices his ass-eating skills on DJ's nice hole. Gage is so into eating DJ's ass that he just keeps going and going. He's worshipping that nice hole with his hot tongue.Gage Fucks DJ's Hot, Wet Ass ...Gage doesn't miss a beat from moving straight from licking and eating DJ's ass to fucking it hard and deep. He straddles DJ and goes in deep. DJ raises up and starts stroking his own hard cock as Gage fucks him deeper. He fucks him in that position for a bit then turns DJ over on his side and fucks him from the side hard. DJ strokes his hard cock all the while as Gage pokes him deeper and faster. Gage is a fuck machine and he's fucking DJ like a champ. He reaches down and starts stroking DJ's hard cock while he fucks his ass and DJ just relaxes and enjoys all the help.DJ Bends Gage Over And Shows Him Some Appreciation ...DJ Bends Gage's ass over and shoves his long, hard cock deep in Gage's hungry hole to show him some appreciation for the good fuck Gage has given him. Gage is moaning like a bitch as that long hard cock slowly goes in deep, comes almost all the way out and goes all the way back in balls deep. This is one hot fuck to watch as DJ proves he's as powerful on top as he is on the bottom. He's fucking that hole like there's no tomorrow and Gage is proving once again that he can be a power bottom when duty calls. His ass is getting banged hard and deep by a huge cock and he's taking it like a real champ. He puts Gage on his back and Gage strokes his hard dick while DJ keeps the rhythm. Gage is stroking fast and enjoying the fuck.Gage Blows His Huge Load With DJ's Cock Deep Inside Him ...After some serious fucking, Gage is ready to blow and what a hot load he always delivers. DJ pounds him hard while he strokes out his load all over himself. DJ isn't far behind as he pulls out and delivers his goods all over Gage's stomach, mixing in the manjuice as the cum dances and intertwines. It's a gooey good mess and these two have outdone themselves. DJ gives a thumbs up and a big smile and we know he's satisfied. They embrace in another deep kiss and it's a wrap!",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Gage",
      "person_id": 35084
    }
  ],
  "release_date": "2009-01-15",
  "scene_id": 70139,
  "tags": [
    "Gay"
  ],
  "title": "DJ & Gage"
}