{
  "collections": [
    "Active Duty"
  ],
  "description": "A Note From Dink ...<br />Today we've got the DVD release, Bulletproof, ready for shipping. We've emerged from being Caught in the Crossfire to Bulletproof and what a great release this is going to be. The first scene brings newcomer Cooper to the Active Duty fold. This blonde, sexy, bedroom blue-eyed beauty is a sight to behold. Cooper is as all-American as they come. The epitome of that hot wrestling jock we all lusted after in high school and as horny as every military man out there proves to be. Take that thick wrestler's body and team it up with our taller, thinner and big-dicked Spencer and you've got a pair that will fill out a lot of fantasies in one hot scene.<br /><br />Cooper Meets Spencer ...<br />Cooper says he's nervous, but you couldn't tell by how quickly he and Spencer get naked and right down to business. The cocks are hard as soon as the shorts come off and these two are obviously liking what they see on each other. The stares back and forth, glancing at one another's cocks and sizing them up is so fun to watch as these two get ready for the deed. There's chemistry here and these two aren't wasting anytime exploring it. Old Spencer proves once again that he's the perfect match for a new recruit, slowly seducing Cooper into one really hot session of mansex.<br /><br />Getting Things Started ...<br />Spencer breaks the ice by reaching over and grabbing Cooper's lovely cock and begins stroking it. Cooper isn't shy about returning the favor and it's fascinating to watch how into this the two of them get. Porno? Who cares. These two are into each other's cocks and the art of giving as good a handjob as you get. The contrast in their bodies and the beauty of both is really stunning as you watch these two hot men enjoy a good handjob from each other. They joke about how hard their cocks and laugh a little to break the ice more.<br /><br />All Hell Breaks Loose ...<br />Spencer suggests that Cooper try sucking a cock for the first time. And when Cooper does start sucking, he literally starts making love to Spencer's nice boner. He takes his slow, sweet time between Spencer's legs, making sure to taste every inch of that long, hard cock and really gets into the art of sucking a nice dick. Watching Spencer's expressions you can tell he's really enjoying the slow attention Cooper is paying his cock and Cooper seems really lost in making sure that's the case.<br /><br />Mansex Maneuvers---Operation Sixty-Nine ...<br />Spencer returns the favor for a bit before they move to a nice sixty-nine position to make sure both get their fair share of hot mouth around their hard cocks. Spencer spreads those nice beefy cheeks apart and shows the camera what a nice, pink pucker Cooper has. Both men get plenty of oral attention before they move forward with the next exercise in mansex.<br /><br />Spencer Fucks Cooper ...<br />Cooper seems OK with the idea of getting fucked and Spencer saddles up to do the honors. Cooper first tries riding the long, hard dick, but it proves a bit much for his first go-round. Cooper assumes the position on all fours and opens his hole up for action and Spencer dives right in. I get great shots of that nice long cock slowly deep-dicking that sweet, blonde hairy hole. Spencer takes it nice and slow at first, but when we both realize that Cooper's cock is hard as a brick, we decide to put him on his back so he can stroke his hard dick.<br /><br />Spencer is banging Cooper's ass hard as he long-strokes it and Cooper jerks himself faster and faster. It doesn't take long in this position for Cooper to lose control and blow a huge load all over himself. Spencer is pretty worked up at this point and follows Cooper's lead, landing a hot load of his own all over Cooper's stomach. The boys lay side by side on the bed and we chat a bit about the experience. Cooper says he had fun and he will definitely be back for more!",
  "models": [
    {
      "name": "Cooper",
      "person_id": 35186
    },
    {
      "name": "Spencer",
      "person_id": 35021
    }
  ],
  "release_date": "2008-09-12",
  "scene_id": 70130,
  "series": "Bulletproof",
  "tags": [
    "Gay"
  ],
  "title": "Cooper & Spencer"
}