{
  "collections": [
    "Active Duty"
  ],
  "description": "Trent, Thomas, Gage And Cash ...The next scene brings with it some really hot stuff for you that happened sorta unexpectedly one evening around my place that ended up being the second scene. At first, the plan was simple: put Gage with Cash and Thomas and let him take them both on and bottom for these two hotties all the while, pulling Cash further across the line. Just these three guys together would have been one hell of a hot scene for Bulletproof 2, but then my friend Major Wood showed up with a hot Marine in tow: Trent. Trent was sporting a pair of nut-huggin' Wrangler's, a big belt buckle and cowboy boots with a smile that went on for days. This aw shucks country boy was wide-eyed and obviously interested in what was going on. He stood on the sidelines and watched the action unfold until he just couldn't help himself anymore and joined in the fun that would become the second half of Bulletproof 2. But before he joined in, Gage, Cash and Thomas really put on a show that hardly anyone could resist the chance to join in on.Trent Can't Handle The Temptation And Joins In On The Fun ...Six minutes was all it took and Trent was there on the couch next to Thomas. He kept saying how he wanted to worship Thomas' nipples and play with his big pecs. You gotta love a man that knows exactly what he wants. He gets right down to the task at hand and buries his face in Thomas' chest while Gage buries his face in Trent's crotch. Things go from there to Trent and Gage sharing Cash's hard cock for a bit. Talk about being hungry. Trent has got to be one of the hungriest young Marines I've seen in quite some time. Once he gets down on a cock, he doesn't let up until lightening strikes -- or, a bigger cock presents itself.That's exactly what happens in the second scene of Bulletproof 2 when Thomas' cock comes into view. Trent goes bananas for that huge meat and is on it, sucking and worshipping it like he's at a buffet. Meanwhile, Gage is doing the same with Cash's cock. The four of these guys together equals enough heat to melt your screen. Watch with caution and check your monitor's tempurature regularly, troops.Gage Eats Trent's Ass ...Things take a turn about midway through the action as Gage positions himself behind Trent and starts eating his nice hole while Trent keeps sucking on Thomas' huge meat and Thomas feasts on Cash's hard cock.Cash Fucks Gage While Trent Gets Throat-fucked by Thomas ...Things take their next turn when Cash can't help himself any longer and wants an ass to plow. Gage throws his up in the air and offers it to Cash and Cash dives right in. Meanwhile Thomas is fucking Trent's throat like there's no tomorrow and Trent is taking it like a champ. Thomas slides in with his huge hard cock and buries it in Gage's ass after Cash has it all wet and ready. Gage blows his load in record time with the huge monster deep inside him and Thomas asks, so, who am I fucking next? Gage points to Trent who is all smiles and elects him to be next. Trent assumes the position on his hands and knees and I zoom into his face and ask if he's ready for this. He says he's not sure about that, but what follows proves he had it all wrong.He was dying for it. Thomas is balls deep in no time flat and Trent is in heaven. Thomas is stuffing this country boy to the gills and slamming his cock in and out of his cowboy ass. I'm sure Trent felt like he was being ridden by a bull instead of riding one. Thomas pulls out for a minute to give me a nice shot of this freshly fucked hole and what a sweet looking pucker it is. But Thomas isn't done yet. He plows back in balls deep and goes for another round. While he's being banged out hard and deep, Trent reaches over and strokes Cash's hard cock. But Thomas goes first and pulls out of Trent's hole and lands the biggest load I've seen in awhile all over Trent's back, neck and face. A real gusher. Cash follows up with a huge load of his own and these boys are spent. Trent has come full circle in a matter of an evening and its a wrap. Bulletproof 2 is complete.",
  "models": [
    {
      "name": "Cash",
      "person_id": 35024
    },
    {
      "name": "Gage",
      "person_id": 35084
    },
    {
      "name": "Thomas",
      "person_id": 35154
    },
    {
      "name": "Trent",
      "person_id": 35190
    }
  ],
  "release_date": "2008-11-02",
  "scene_id": 70136,
  "series": "Bulletproof 2",
  "tags": [
    "Gay"
  ],
  "title": "Cash, Gage, Thomas & Trent"
}