{
  "collections": [
    "Active Duty"
  ],
  "description": "Cash Crosses The Line With Damien ...<br />I've gotten so many emails about our man Cash and when he might decide to cross the line. This tall, dark and sexy devil has been on my list to conquer for quite some time now and I know you're gonna be glad to see him take this next step. I decided to team Cash up with Damien to give him a submissive pro that could handle his rough style. Cash is a tough nut to crack, but we've done it.<br /><br />Damien Works His Magic ...<br />Damien eased right in there and by the time he got Cash's cock in his hot little mouth, Cash was ready for more. Damien was just what we needed to break the ice with Cash and things get really heated up as Cash talks really dirty shit to Damien as he pushes his cock deep down Damien's throat, holding his head and telling him to suck it you little bitch as Damien does a fine job of obeying orders. Cash is spying that hot little ass of Damien's, too. He starts slapping it and asking Damien if he like's to have his little pussy ass fucked and we all know Damien does. You decide who was in control here.<br /><br />Cash Fucks Damien And Damien Takes His Load In His Mouth ...<br />Things are sometimes not what they appear. Damien plays it right up and we get Cash right were we all want him. Once he's hard, Cash stays hard the entire time and fucks Damien's ass good. When he's ready to blow his load he decides he wants to blow it in Damien's mouth and Damien takes the load like a champ. This is the first of several scenes that Cash has already done -- including a sandwich fuck with Kaden and Chaz for our forthcoming sequel to The Porne Ultimatum for Dirty Bird Pictures and several other Active Duty scenes. Enjoy!",
  "models": [
    {
      "name": "Cash",
      "person_id": 35024
    },
    {
      "name": "Damien",
      "person_id": 35071
    }
  ],
  "release_date": "2008-09-15",
  "scene_id": 70133,
  "series": "Double Time",
  "tags": [
    "Gay"
  ],
  "title": "Cash & Damien"
}