{
  "collections": [
    "Active Duty"
  ],
  "description": "Domenic And DJ Alone At Last ...<br />DJ and Domenic finally get together and it has been a long-awaited pairing on my part and on DJ's. We all know how DJ loves himself a nice looking man and when he saw pictures of Domenic I knew I had to get them in a scene together. Domenic seemed pleased as hell when he found out he'd be working with DJ, too.<br /><br />The Long, Hot Kiss ...<br />Things kick off in the first scene of Double Time with me chatting with DJ first and then when Domenic joins us, I make some jokes about my wide-angle lens and talk to the guys a little. I give Domenic a hard time about how beautiful and kissable his lips are, but I make sure to leave these two alone for awhile and to their own devices. Something tells me they need no instructions as it is obvious they are clearly into one another. Once I'm gone they chat a little and DJ actually seems pretty nervous. I know I would be if I were left alone to have sex with a fine man like Domenic. It's fun to watch as Domenic seems to find DJ's nervousness sexy himself. They kick things off with a nice, slow and long kiss that is out of this world. They really get into it and you can tell right way that this was the perfect pairing. It's so fun to watch the guys direct themselves. Left to their own devices, they do just fine. The boxers come off to reveal some nice boners and they're off to the races.<br /><br />The Sucking...The Rimming....The Fucking ...<br />These two take things to several levels. They go from kissing to sucking one another with DJ being the first to taste the goods. Domenic follows his lead and does some great sucking of his own. They move to a nice sixty-nine position and then on to DJ eating Domenic's pretty asshole to fucking Domenic and finally Domenic lays down and lets DJ staddle his hard cock and take it for a ride. All the while, Domenic is stroking DJ's hard cock as DJ rides Domenic fast and hard. For the finale, DJ lays on his back with his legs in the air and Domenic fucks him hard in the missionary position while DJ strokes his hot load out all over himself. Domenic follows him fast and pumps out a huge gush all over and mixes it in with DJ's hot load. They end things out with a kiss, and they've both been worked over in Double Time.",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Domenic",
      "person_id": 35080
    }
  ],
  "release_date": "2008-09-15",
  "scene_id": 70132,
  "series": "Double Time",
  "tags": [
    "Gay"
  ],
  "title": "DJ & Domenic"
}