{
  "collections": [
    "Active Duty"
  ],
  "description": "Cooper Returns To Meet Up With Gio And Cash ...<br />Cooper keeps his word and returns to the Active Duty fold for another go-round. And this time we've got him teamed up with one of our hungry veteran's, Gio. They also get an unexpected visit from Mr. Cash who takes care of business for himself. Things kick off with Cooper and Gio on the bed together and Cooper has a big grin as I tease him about returning so quickly. I tease both the guys about a girl that's not going to show up. Gio is listening all ears as talk to them. Leave the boys to their own devices and they usually don't disappoint. Gio gets right down to the chit-chat to get to know more about Cooper and we do as well in the process. He quizes Cooper about the work he's done and tells Cooper what all he's done. It's great listening for some juicy gossip.<br /><br />Gio Crosses The Line And Get's The Ball In Play ...<br />Leave it to Gio to get right down to business and you've got a man you can count on. He wastes no time starting out slowly kissing Cooper's chest and playing with his package while he takes in the view of that nice wrestler's body. The pants come off in record time and Gio starts servicing Cooper's nice, hard cock. Cooper may have met his match when it comes to really getting into worshipping and sucking a nice cock. Gio is on it like white on rice and loving the taste of this nice, newcomers cock. Gio gets all the way down to the good stuff and starts sucking and licking Cooper's balls and taint. They eventually switch up and Cooper has a chance to show off his newly earned skills while Gio enjoys a return on the favor. These two are both expert cocksuckers and you can tell how much they are enjoying this.<br /><br />Gio Eats Cooper's Ass To Ready It For A Surprise Visitor ...<br />Gio turns Cooper over on his hands and knees and starts giving him an A-1 class act rimming. And Cooper is loving it as he moans and rolls his eyes back in his head. I think we've hit the hot spot, troops and are finding out what Cooper really likes best. All the while I've been telling them about Cash jerking off out in the living room to some porn and I am trying to talk him into joining them. The guys invite the idea and so I finally get Cash to come join the fun.<br /><br />Cash Joins In And Things Heat Up Even More ...<br />Cash comes in and finds Cooper's hot mouth ready and willing so he fills it with his hard cock. Gio trades places with Cooper and gets on his back so Cash can fuck his face while Cooper has more fun with Gio's cock. Cash starts fucking Gio's throat nice and deep and talking dirty to Gio all the while. They eventually switch positions and get Cash on the bed so Gio can keep sucking his cock while Cooper keeps working Gio's nice hard-on. Cash is a selfish fucker and loves making someone gag on his cock as he takes what he wants how he wants it. He's a no-nonsense kinda guy. Gio doesn't mind taking it rough so he and Cash make a good team. Gio gags, goes deeper, gags again, but never stops.<br /><br />Gio And Cooper Share The Stud ...<br />Gio and Cooper decide that sharing Cash could be fun so they both move onto his cock, sharing it. One sucks the balls while the other sucks the dick. Cash is kicked back enjoying his cocksuckers attention.<br /><br />Gio Saddles Up To Take On Cash ...<br />While Cooper is still enjoying Cash's nice cock down his throat, Gio is lubing up and getting ready for Cash to fuck his tight hole. He bends over the bead and spreads those nice ass cheeks with both hands to give Cash easy access. Cash wastes no time going deep into that open, welcoming ass and starts plowing it hard as Gio sucks Coooper's cock. The rougher Cash gets the more Gio seems to like it. He keeps one hand spreading his ass open while the other hand strokes Cooper as he sucks him. It seems the faster Cash bangs his hole, the hungrier he gets for the cock in front of him. Cooper is hard as a brick as he watches and gets his cock serviced. It isn't long before Cooper can't hold back any longer and shoots a huge load all over the side of Gio's face and head as Cash keeps plowing him deeper. Cash is getting close so Gio gets down on his knees in front of Cash while Cash strokes his huge load out into Gio's waiting mouth. Gio licks it all up and takes Cash's cock back in his mouth for one last deep suck to make sure it's clean. Cash packs his bags and leaves, he got what he came for.<br /><br />Gio Gets His Way With Cooper For A Grand Finale ...<br />Gio kicks back and smile's a victory smile as he lets Cooper go down on his cock to get it ready for Cooper's nice, tight ass. He gets nice and hard with the help of Cooper's mouth then puts Cooper in position and starts eating his nice hole to prep it for the fuck. He fucks Cooper six ways to Sunday, on his back, on his stomach as Gio strokes Cooper's cock. The two move all over the bed and have a blast enjoying each other. Gio fucks Cooper good and Cooper finally blows his load all over his stomach as Gio keeps banging. Cooper gets on the floor in front of Gio and gives Gio a chance to get a little revenge by blowing his huge load all over Cooper's face. Gio steps in and lands a winner. I talk to the boys afterwards and joke around with Gio, giving him a hard time. It's all in fun and Gio gives me the bird. Thanks for playing!",
  "models": [
    {
      "name": "Cash",
      "person_id": 35024
    },
    {
      "name": "Cooper",
      "person_id": 35186
    },
    {
      "name": "Giovanni",
      "person_id": 35177
    }
  ],
  "release_date": "2008-09-12",
  "scene_id": 70131,
  "series": "Bulletproof",
  "tags": [
    "Gay"
  ],
  "title": "Cash, Cooper & Giovanni"
}