{
  "collections": [
    "Active Duty"
  ],
  "description": "Cash Sucks His First Huge Cock ...<br />My wide-angle lens is still broken (go figure) so I have the boys move the pillow from between them and get a little closer. Randy nor Cash have a problem with this. Cash is ready to try something new and Randy is ready to help him. A few nights before we did a practice run and Cash sucked Randy's cock like a true pro. It was during this practice run that I noticed just what a great match these two made. They were clearly into each other and I've never seen a hungrier cocksucker than I seen in Cash that night. So we're back and the boys are ready to give it another go for the camera this time and this proves even hotter than the practice run.<br /><br />One minute and twenty-three seconds into the video and they are already pulling and tugging at each other's hard cocks through their shorts. They can't wait for this next round and it shows in how eager they are to get things going. By a minute and a half Randy's shorts are off and Cash's hot lips are wrapped around his hard cock and he's going at it like there is no tomorrow. It's funny how fast a guy will change his mind and decide to try something new.<br /><br />Everybody Loves A Big Cock. Even Cash ...<br />You know my old saying, Everybody loves a big cock. Obviously our man Cash is no exception as he seems to be mesmerized by Randy's fat meat as he grabs on and you think he'll never let go. If anyone was ever any hungrier than Cash seems for a cock today, I haven't seen it lately. It's surreal to watch as this hard-edged country boy comes across the line and does a complete turn-around. Living in the deep South can sometimes hinder a man from getting just what he wants, but all he's gotta do is join up with us here at Active Duty and we'll set him straight. Today it's evident that we found what Cash might have been wanting all along. Randy is loving the newbies natural skills as he gets into talking shit to the newfound cocksucker. Cash is now playing with his own hard cock through his shorts as he sucks the massive meat.<br /><br />Cash Isn't Ready To Let Go Of The Huge Meat ...<br />Randy asks Cash if he wants him to suck on his cock a little bit and Cash says not yet as he keeps stroking and sucking Randy's big dick and stroking his own through his shorts. Seems Cash has found something he's not ready to let go of. Can you blame him? A huge cock like that always comes with fans. And Cash is quickly becoming this cocks biggest and hungriest fan. It's a full five minutes before Cash finally comes up for air and when he does, he pulls out a raging hard cock of his own for Randy to play with. Randy quickly goes down on the pulsing cock and gives it some well-deserved attention.<br /><br />Randy Returns The Favor ...<br />Cash gives in and let's Randy have his way with his hard cock as Randy seems as hungry as Cash. He gives it as good as he got and he's making love to Cash's cock in no time at all. Cash is moaning and really getting into it as Randy takes the lead.<br /><br />Sixty-Nine Time ...<br />They can't resist and get into a hot sixty-nine so no one's mouth is left empty. These two are into each other and they don't want to miss a minute of having the others hot cock in their mouth. They go on and on in this position with moans of pure joy and passion as they try to outdo one another, but it ends up being a match made in heaven. These two are so hungry for one another that you get lost in it all.<br /><br />Randy Eats Cash's Ass ...<br />Cash is going to try something else today and Randy is too. Randy gets behind Cash and spreads his cheeks out wide so he can dive down deep with his tongue in Cash's ass. Cash opens up to the new experience and starts moaning as soon as Randy's wet tongue touches his virgin ass. Randy spits on it and gets it nice and wet as he buries his tongue in the hole more and more. Cash comes up on his hands and knees and pushes his ass back further to get that tongue deeper.<br /><br />They Exchange More Good Head ...<br />After Randy has eaten Cash's ass, they get back to the business of sucking and Cash is right back in there on that huge dick like white on rice. He doesn't seem to want to stop sucking it. Eventually he comes up and straddles Randy's face though and feeds him some hard cock and Randy does a good job of handling it in this position as Cash fucks his face as he grabs him by the back of the head.<br /><br />Cash Fingers Randy's Ass And Readies It For The Fuck ...<br />Cash gets back down between Randy's legs and starts sucking his hard cock again only this time he starts sliding his fingers into Randy's ass while Randy's legs are far behind his head. Randy's cock is rock hard and he seems ready for whatever Cash can throw his way. Cash is ready to fuck that nice ass and it isn't long before he starts doing just that. <br /><br />Cash slowly slides in and Randy grunts and moans in slight pain at first, but once Cash is in, Randy seems to be really enjoying the fuck. His cock is hard and he's stroking it while Cash fucks him deep and hard. If Randy ever wanted a cock up his tight ass this is the one as he gives himself to Cash completely and if his hard cock is any indication as to how turned on he is, I'd say he's pretty turned on. <br /><br />He bends Randy over the bed and fucks him doggy style while Randy stands and bends over the bed. Cash is fucking him hard and Randy's hard cock is pressed against the edge of the mattress hard as ever. It isn't long in this position before Cash just can't hold back anymore and blows his huge load. Randy gets up on the bed and they lay side-by-side as Randy strokes out his own huge load. Cash is there right beside him, rubbing the cum into his belly. Randy's belly-button is filled with his hot load as Cash rubs it all around.Ó",
  "models": [
    {
      "name": "Cash",
      "person_id": 35024
    },
    {
      "name": "Randy",
      "person_id": 35130
    }
  ],
  "release_date": "2009-01-15",
  "scene_id": 70138,
  "series": "Double Time 2",
  "tags": [
    "Gay"
  ],
  "title": "Cash & Randy"
}