{
  "collections": [
    "Active Duty"
  ],
  "description": "A Note From Dink ...<br />Brace yourself, troops. Today's release contains something we've all waited so patiently for. Spencer's bottoming debut! That's right, Spencer finally gave in and gave it up. And he didn't give it up to the smallest dick we could find. David comes to the rescue and takes Spencer's virginity with that long, nice cock he's packing. Spencer was sweating and moaning but he took it like a champ. By the time it was over I think he was not only proud of himself, but found out that all that crying and complaining in his first attempt in The Porthole 2 was all over-rated. Spencer's seal has been broken and you get to watch it all unfold in the second scene of Battle Cry 2.<br /><br />Spencer, Conrad, David and Christian ...<br />We get a double treat in this scene with Conrad making his Active Duty debut while Spencer gives in and gives up his virgin ass to David. This is one wild ride from start to finish and everyone has some fun. Spencer giving it up has been something so many of you have waited for and now the time has come. Virgin no more. Spencer is finding out what it's like to be on the receiving end. Conrad debuts to show us what he's got and boy does he ever impress. This hottie is ready for some fun and it shows in his debut. As you'll learn in the scene this isn't Conrad's very first as we had him very busy that first weekend he visited. This is his second night at the house and he's ready for round two. I chat him up a little and tease him about someone saying they heard him say he was ready to bottom. He's a really cute, sweet and funny guy and we tease him a bit. Christian joins him on the bed and he's all smiles, David follows and then Spencer. I talk to Spencer about what is about to happen and he's confident that this time is it.<br /><br />Let The Party Begin ...<br />Christian tells Spencer that tonight there is no backing out, just backing in. Spencer chooses David to be the man to do the job and David is more than OK with the job he's assigned. Things kick off with some playful fun as David and Christian get aquainted and Conrad and Spencer pull out their hard cocks. David wastes no time and starts giving Christian head right away. Spencer asks Conrad if he's ever given head and Conrad says he tried it out yesterday for the first time. Spencer tells him he should try it out on his cock and Conrad tells Spencer he should try it out on him first. Spencer agrees and starts going down on Conrad's big cock. David asks Conrad if he's enjoying himself and Conrad gives a big nod of approval. Meanwhile Christian continues to suck on David's hard cock as Conrad reaches around and plays with Spencer's hard cock. It's a cock-feeding frenzy as these four guys really get into the cocksucking. Christian and David are making love to one another's cocks as Conrad and Spencer move slow and Conrad enjoys the attention.<br /><br />Conrad Sucks Spencer, David And Christian Make Love To Each Others Cocks ...<br />Conrad gives in and wraps his hot lips around Spencer's hard cock. Such a beautiful sight to watch this hunky Marine chow down on some hard dick. Things soon switch up and Christian makes him way between Spencer's legs to service his dick while Conrad straddles David's face to feed him his. One hot thing to watch as this goes on is David's rock hard cock bouncing up and hitting the crack of Conrads muscled ass. It got me gazing for more than a minute myself. Christian is in love with Spencer's cock and he's showing just how much he loves it. Spencer is enjoying the love affair just fine. Christian sneaks in and tongues Spencer's hole a few times before Spencer flips him over to give him some head. Conrad is kicked back while David deep throats his hard cock and strokes his own.<br /><br />A Daisy-Chain Of Command ...<br />The boys get into a circle so that everyone can get their cock sucked. With Conrad sucking David, David sucking Spencer and Spencer Sucking Christian while Christian sucks Conrad. Everybody's got a cock in their mouth and a mouth on their cock. This is one hot circle as they really get into servicing each other well.<br /><br />The Kisses And Ass-Eating ...<br />The circle breaks and they pair off as Christian and Conrad give each other a deep tongued kiss and David raises Spencer's leg to eat his ass. He's tonguing around Spencer's hole to get it ready for the fuck. Spencer makes his way on top of David and David slowly starts to work his cock into Spencer's virgin hole.<br /><br />Spencer Gets Fucked ...<br />David keeps pushing his cock deeper and deeper into Spencer's tight ass as Spencer moans and groans. David is balls deep sooner than later and Spencer is adjusting to the big cock being deep in his tight ass. He's sweating as he takes it all up his ass. David flips him over on his back and stands beside the bed and plunges his cock back in as he slides it in and out of Spencer's ass. David gives him a good fucking, long-stroking his big dick in and out of his tight little ass. Spencer has manned up and met the challenge.<br /><br />Spencer Gets His ...<br />Revenge that is. David decides he wants to give Spencer a chance at some revenge and positions himself to take Spencer's cock up his ass. Spencer rams it right in and starts out fast as he pounds David hard and deep, showing no mercy, but David doesn't mind. David is jerking his hard cock just as fast as Spencer is fucking his ass. Conrad and Christian move in to feed David their cocks as Spencer keeps his ass busy.<br /><br />Let's Take Turns On David's Ass ...<br />Spencer switches up and gives the reigns over to Conrad who plunges his hard cock deep into David's hungry hole. He's banging and pounding as hard or harder than Spencer did. David is loving all this attention as he keeps stroking his hard dick.<br /><br />Spencer Fucks Christian ...<br />Meanwhile Spencer takes his aggression out on Christian's tight ass and he bangs him hard along side Conrad who is pounding David harder and faster. Conrad is stroking David's hard cock for him as he bangs his ass deep and hard. David can't take it anymore and blows his huge load all over his stomach. Conrad goes in for a deep, wet kiss with David then pulls out and sprays his own huge load all over David's stomach to mix in with David's huge load.<br /><br />Christian Fucks David ...<br />Three cocks in his ass and he's still ready for more. Christian moves in behind Conrad and takes his turn at David's hot little ass. David's cock is rock hard AGAIN as Christian slowly shoves his dick all the way up his freshly fucked hole. Meanwhile Spencer is stroking his dick above David and blows his huge load all over David's chest. Christian follows Spencer's lead and does the same. It's a wrap!",
  "models": [
    {
      "name": "Christian",
      "person_id": 35060
    },
    {
      "name": "Conrad",
      "person_id": 35066
    },
    {
      "name": "David",
      "person_id": 35073
    },
    {
      "name": "Spencer",
      "person_id": 35021
    }
  ],
  "release_date": "2009-02-12",
  "scene_id": 70141,
  "series": "Battle Cry 2",
  "tags": [
    "Big Dick",
    "First Time",
    "Gay"
  ],
  "title": "Christian, Conrad, David & Spencer"
}