{
  "collections": [
    "Active Duty"
  ],
  "description": "Kasey, DJ and Gage Critiquing Porn ... It's Kasey's first time back in the Active Duty fold in 2009 and he's joined us at the Summer Recruits beach house to make his comeback. He's in good hands with DJ and Gage who have gotten plenty of practice in front of the camera this year. The three guys are kicked back on the couch critiquing my bad choice in porn and laughing at the actors. What the fuck is she wearing? asks DJ about the porn chick on the screen. But Kasey seems much more interested in the two guys to his right and throws his arm around Gage who throws his arm around DJ. They're laughing and joking as they start playing with their cocks. Kasey can't take his eyes off of the other two. It isn't long before the hard cocks are out and everyone is stroking. Gage is the first to reach over and grab DJ's nice hard cock and start stroking it. As soon as he gets DJ's pants off, Gage is down on his cock sucking it like there's no tomorrow. Gage quickly involves Kasey in the fun by reaching over and stroking him while he strokes DJ. Gage spends an equal amount of time going back and forth on the two gorgeous hard cocks, making sure to give them both the right amount of attention. Kasey watches intently as the action unfolds. Won't be long before he has his first cock in ages deep in his throat. Kasey has his arm wrapped around DJ for the moment and is playing with his chest while Gage services them both. He positions himself laying across DJ's lap and sucks Kasey's cock while DJ plays with Gage's cock and inspects the beautiful ass laid nearly right in his face. Gage is teasing DJ for what's to come and DJ seems to be taking the bait just fine. Meanwhile he's working' Kasey's cock like a part-time job and giving it the long awaited attention it deserves. DJ spreads out Gage's cheeks and inspects the fine, slightly hairy love hole. One of the most beautiful moments of this part is watching Gage's cock and balls rest gently against DJ's hard cock and low hangers.Kasey's First Cock Of 2009...Kasey moves in to take Gage's place and finds himself down on DJ's cock like he's been waiting on this all his life. You can tell he's missed the action just by the slow, perfect blowjob he's delivering. He's sucking DJ's huge cock and loving every second of it. Meanwhile Gage slides behind Kasey with his cock against his muscled ass and reaches around and strokes Kasey's hard cock while he dry humps Kasey's bubble butt. Kasey doesn't seem to be having much of a problem taking DJ's long hard cock deep in his throat and Gage is getting him plenty excited at the other end. Gage moves up and kisses DJ while Kasey continues his oral service down below. DJ and Gage lock lips several times in passionate kisses and you know things are gonna get overheated soon. Gage licks and sucks DJ's nipples and chest and then goes down to help Kasey out as they share DJ's hard cock and DJ just throws his head back in complete delight. There's a war going on here of sorts to see who can give DJ's cock the best attention. I can't tell who's winning can you? And I don't think DJ cares. He just wants them to keep it up.Everybody's Gettin' A Taste...Gage decides to move up and give DJ access to his hard cock as he positions himself on the back of the couch and DJ starts sucking him. Kasey's still working his post and giving DJ's cock plenty of inspiration. Gage is getting huffy up above as DJ shows off his expert oral skills on Gage's hard prick. DJ seems to be in heaven with these two. Gage is spying himself some of Kasey's ass and in no time flat moves down to claim himself a piece.Kasey Gets His G-Spot Hit And Cums Without Touching Himself...Gage is balls deep in Kasey's ass in a matter of seconds and pounding away fast and hard. This is the first cock Kasey's had in his ass in quite some time. Sometimes being away from the action can make us long for it so much and our fantasies build so graphically over time that when it all finally happens again, we nearly burst at the seams. I can't speak for Kasey, but what happens next would tend to make me think the same is true for him. While Gage is plowing away at his ass and sucking DJ's cock at the same time, I move around and catch Kasey's face for the expressions. Just as I'm doing this, Kasey says, Stop, stop and in an instant he raises up and is blowing his load all over the place. All this happened while Gage was banging him balls deep and Kasey wasn't even jerking his cock. Talk about hitting that G-spot. Even DJ is surprised. He doesn't know quite what to make of it. I think he's just jealous. Hell, aren't we all?Kasey Rides DJ's Huge Cock All The Way Home...Once we've all recovered Kasey hops on top of DJ's hard cock and starts riding it like there's no tomorrow. I gotta say to me this is the hottest moment of the entire scene. Watching Kasey take control and ram that huge dick all the way up his ass on his own is something else to behold. That sweet, juicy bubble butt looks so good bouncing on that thick, meaty dick. Kasey's cock is rock hard again and Gage starts stroking it for him as he rides DJ's dick. DJ is balls deep and Kasey's taking it all. Gage keeps stroking as Kasey keeps riding and DJ is having the time of his life. He's found himself a good bottom for the day. Kasey comes off the cock completely a few times and rams it back deep in his ass. Very hot to watch as his ass seems to have adjusted nicely. By now he's stroking his own cock fast and hard with the cock balls deep in his ass. He blows his load again this time all over his stomach. He's two to none against the others.DJ Fucks Gage's Tight Ass While Kasey Jerks His Hard Cock...Kasey is hard AGAIN and DJ is ready to fuck Gage's ass. Gage lays in his back on the couch and winks at the camera. DJ slowly slides his cock all the way up Gage's ass until he's all the way in. Gage is stroking himself as Kasey stands beside him and strokes his own hard cock, working up to his third cumshot of the scene. DJ is taking all his pent up aggression out on Gage's tight little ass and fucking it hard and fast. He's long-stroking that little ass the way you should and it looks like a piston going in and out of Gage's small body. Gage's hard cock is telling the story as for what he's feeling himself. His balls are tightening up as he pounds his cock harder and harder and the moans and deep breathing start getting louder and louder as Gage gears up to blow his huge hot load all over his stomach. It's a huge load as we've all come to expect from Gage. He bends over the arm of the couch and teases DJ with his freshly fucked ass until DJ blows his hot wad all over it. Gage then grabs Kasey's hard cock and strokes out his third load for him. Gage is covered in cum and the boys are ready to hit the beach again.",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Gage",
      "person_id": 35084
    },
    {
      "name": "Kasey",
      "person_id": 35026
    }
  ],
  "release_date": "2009-06-04",
  "scene_id": 70149,
  "series": "Summer Recruits 2",
  "tags": [
    "Gay"
  ],
  "title": "DJ, Gage & Kasey"
}