{
  "collections": [
    "Active Duty"
  ],
  "description": "David, Domenic and Brian ...<br />I come in from the beach to catch these three on the sofa together watching porn. Well, Brian and Domenic are watching porn. David is watching them. This little rascal is always up to something. The boys are already naked and hard and things are sure to move quickly with these three gorgeous men in this state of mind. The other guys are all out on the beach, enjoying the sun and surf, but these three recruits have decided on a little R&R of their own. Almost immediately the hands are roaming and latching on to a different cock than their own. David strokes Brian while Domenic strokes David and Domenic and Brian go for a long, tongue-filled kiss that is out of this world. The heat is on from the very start. The beer has taken its effect with the hot sun beating down and these three are as randy as ever. David isn't one to be left out so he joins in the tongue fight that Domenic and Brian are having and it turns into a hot threeway tongue dance that we all envy.<br /><br />Cocksucking Is A Must ...<br />Domenic goes down and puts Brian's hard cock deep in his mouth as Brian and David continue to kiss. David and Brian seem like they've been waiting on this moment forever. David sucks and kisses Brian's ear, clearly driving the man crazy with lust. He's squirming and smiling all the while as Domenic manhandles his cock like a true pro. Domenic and David share the cock and the kisses back and forth as they both suck Brian's cock for a bit while the other kisses him deeply, going in rhythm that no one could choreograph. They're making their own music and the moves are beautiful. David wants himself a taste of something different so he stretches across Brian's lap and puts Domenic's cock in his mouth as he squirms his cute little hungry ass all over Brian as Brian rubs it and jerks himself underneath. Brian plays with David's cock, too, slapping it together with his own hard cock, the passion is heating up. A double cock delight ensues as David and Domenic share that beautiful cock of Brian's together as they lick it and kiss each other. So beautiful. The cocks all get sucked in turn and no one misses out on any oral action. Brian gets himself a good taste of David and Domenic and everyone is happy so far.<br /><br />Domenic Eats David's Ass While Brian And David Do Other Things ...<br />David positions himself over Brian as he kisses him hard and fast. Brian's hard cock is inches from David's hot hole so Domenic sees an opportunity to enjoy both together and he does just that. He licks and eats David's ass and goes down to enjoy Brian's hard cock, back and forth, back and forth, not missing an inch on either orifice. David moves up a little and puts his cock in Brian's mouth and Brian sucks his cock while Domenic services both David's hole and Brian's hard cock. By this time David is moaning and groaning in complete pleasure. He's lost in the moment as he's shared by these two gorgeous men.<br /><br />Brian Eats David's Ass And David Loses Track of All Time And Space ...<br />David bends over arching his back in front of Brian's face while Domenic sucks on Brian's cock. Brian starts slapping David's ass and goes in to give it a taste. So hot watching this man do something so sexy. Get out your fans, now wave, wave, there ya go. Don't pass out. Things are just getting started. Brian buries his super long tongue deep in David's hole and David is struggling to handle the sensation. He's clearly gone away into a state of complete ecstasy as this hot man munches his hole. David reaches back and strokes Brian's hard cock while Domenic licks Brian's nipples. David flips himself around, putting himself on his back and his ass and cock in Brian's face. He pulls Domenic down for some hot kissing and then Domenic sucks his cock while Brian services his hot ass with his tongue. Talk about getting a full service lube job. Man these two guys could run their own service center. David is clearly liking it. This is where he lost all sense of time and space. When we stopped to transition to the fucking, David didn't remember where he just was. For ten minutes he was completely lost in the moment. We had to assure him that yes, in fact he was there and yes he was on the coffee table. He protested for only a moment before getting back in position to get his ass fucked good by Brian.<br /><br />Brian Fucks David, Domenic Fucks David, David Fucks Domenic ...<br />Back in position and Brian is lubed and ready to give David's ass what it needs most right now. A nice, hard cock ready for action. David squirms around a bit as Brian goes in for the good spot. Brian bangs David's ass hard and deep while David sucks Domenic's hard cock. Soon, the positions switch and Domenic is fucking David's hot ass doggy-style while David sucks Brian's cock. The energy is on full blast here folks as these boys fuck like men should. David had clearly wanted himself some of Domenic from the first moment he laid eyes on him and he's getting his fill now as Domenic rides his ass hard. Won't be long before David gets the rest of Domenic when he bends him over to sit on his cock. Domenic slowly goes down, sitting on David's hard cock as David pushes himself deeper inside Domenic. David takes things one step further and sucks Domenic's dick while he fucks his ass. Limber boy that David is and Domenic can't stand all the sensations and blows a huge load all over his chest. David reassumes the position so that Brian can fuck him again--this time until he cums. This is one hot, wild and hard fuck as Brian literally fucks the cum out of David. Brian blows his own huge load all over David's ass when David turns around and offers it up. David turns back around and takes Brian's cock into his mouth, enjoying the last drops of savory manjuice.",
  "models": [
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "David",
      "person_id": 35073
    },
    {
      "name": "Domenic",
      "person_id": 35080
    }
  ],
  "release_date": "2006-12-15",
  "scene_id": 70144,
  "series": "Summer Recruits",
  "tags": [
    "Gay"
  ],
  "title": "Brian, David & Domenic"
}