{
  "collections": [
    "Active Duty"
  ],
  "description": "Dorian, Conrad, David and Domenic ...These four gorgeous stunners return from a long day on the beach showing themselves off to everyone in the sand. They've been playing in the ocean, laying in the sun and walking up and down the beach most of the morning. Time to check in back at the house for a cool shower and some good food. But a day at the beach is never complete without some hot sex. They hit the showers together as soon as they arrive. I focus on Dorian and Domenic and follow them up to the bathroom where they share the shower and some other hot stuff together. These two are a match made in heaven. The shower is cool, but the chemistry is as hot as the sand that still covers their feet. They wash the sand out of each other's cracks, wash one another's backs, explore each other's hot bodies, linger in some deep kissing and rubbing and dry off to join Conrad and David downstairs. They find David and Conrad in David and DJ's bedroom, naked and hard already. That's just fine by Dorian and Domenic as they're all frisky now and want to play.Right Down To An Afternoon Delight ...Dorian and Domenic lay side by side on the other bed and watch and jerk as David starts sucking Conrad right away. No time wasted here. These guys are ready to get off. David is sucking Conrad's long, thick, curved cock like the pro he is. Dorian and Domenic are stroking each other's cocks as they watch. They joke a little and Dorian tells them not to stop on their account. And stop they do not. Conrad goes down on David, trying his best to top David's deepthroating skills. David is enjoying watching Conrad practice until his little heart and big cock are content.Move The Beds Together For Easier Access ...They decide they should move the two beds together so that everyone can enjoy each other. Once the beds are moved together they go back to the business of getting off. This time Domenic starts sucking Dorian while David and Conrad watch. It doesn't take much watching for David who quickly takes Conrad's cock back in his mouth as they all enjoy themselves. Dorian and Conrad go for a hot kiss while Domenic and David service their hard cocks. They're as into each other and the kiss as they are the blowjobs their getting. Domenic and David seem to be racing, one trying to outdo the other. They switch positions and Dorian goes down on Domenic while Conrad takes on David's hard cock. They're gonna make sure that everyone is orally satisfied before the day is over.Bend Over And Take It ...That's exactly what David and Conrad do in the next transition. They position themselves on the bed doggy style next to one another. Domenic mounts Conrad's hot ass while Dorian goes in for some of David's sweet hole. David bounces back hard on Dorian's stiff cock as it bangs balls deep in his ass. Conrad is taking Domenic quite well at the other end and everyone seems happy. They switch positions so that David and Conrad are face to face while the two of them get fucked deep and hard. They embrace is some hot kissing as their asses get pounded deep. Dorian is the first to blow his hot load all over David's freshly fucked ass and Domenic follows quickly thereafter, landing his huge load all over Conrad's back. They flip the boys over so they can shoot their own loads. The guys were extra horny this particular afternoon and Dorian and Domenic had no problems getting hard again to provide David and Conrad something in their ass while they stroked themselves off. Conrad goes first and David follows with a huge load of his own. Time for lunch and DJ's got something on the grill. Dorian says if they don't pick up any chicks at the bars tonight they can always come back and gang bang David. David has no objection to that idea. Would you?",
  "models": [
    {
      "name": "Conrad",
      "person_id": 35066
    },
    {
      "name": "David",
      "person_id": 35073
    },
    {
      "name": "Domenic",
      "person_id": 35080
    },
    {
      "name": "Dorian",
      "person_id": 35017
    }
  ],
  "release_date": "2006-12-15",
  "scene_id": 70147,
  "series": "Summer Recruits",
  "tags": [
    "Gay"
  ],
  "title": "Conrad, David, Domenic & Dorian"
}