{
  "collections": [
    "Active Duty"
  ],
  "description": "Conrad, Kaden and Cash Take A Break To Unload ...<br />These three hotties are out on the beach tossing around the football, running and sweating in the hot summer sand. Kaden can't seem to catch a ball to save his poor life, but just watching these beauties bake in the sun (like you're a fly on the side of the beachhouse) is really something special. It's a scene we wish we saw on every beach we went to, but usually one we fantasize about. Today, that fantasy is a reality as you get to see three of the most gorgeous men do what boys do.<br /><br />Hit The Showers ...<br />Football on the beach is a sweaty, manly affair and it calls for a nice shower afterwords. Kaden, Cash and Conrad are all about saving water so they decide to hit the showers together. And Cash suggest they jack off too. Conrad and Kaden seem fine with that idea, but something tells me there will be more to it than that. Once in the shower they all wash up and get the sand out of their cracks. Once out of the shower, they all sit lined down the jacuzzi tub and start jacking their hard cocks.<br /><br />A Threeway Suckfest ...<br />Once they're all hot and bothered Kaden decides to switch things up and he goes in and takes Conrad's cock in his mouth. This fires off a chain reaction that becomes a threeway suck-a-thon. Cash watches and strokes his cock while Kaden sucks Conrad. Cash moves in to give Conrad access and Conrad takes his cue and his cock in his mouth. They switch up and Cash sucks Kaden for a good long time as Conrad rubs and admires Kaden's beautiful body. These three are a wet dream come true. Conrad moves up and puts his cock back in Kaden's mouth as Cash doesn't seem to want to share Kaden's cock. Conrad is the first to blow his load all over Kaden and Kaden follows his lead, landing his own hot cum all over himself, mixing it in with Conrad's. Cash brings up the rear and you wonder just what's going through his mind as he finishes himself off. Was it the bodies glistening in the sun? The thought of Kaden's hot, hard cock in his mouth? A mixture of both? Whatever it was sure caused him to have a huge eruption.",
  "models": [
    {
      "name": "Cash",
      "person_id": 35024
    },
    {
      "name": "Conrad",
      "person_id": 35066
    },
    {
      "name": "Kaden",
      "person_id": 35022
    }
  ],
  "release_date": "2009-06-04",
  "scene_id": 70148,
  "series": "Cash, Conrad & Kaden",
  "tags": [
    "Gay"
  ],
  "title": "Cash, Conrad & Kaden"
}