{
  "collections": [
    "Active Duty"
  ],
  "description": "Brian, Kaden, DJ and Dorian ...Another lazy afternoon hanging around the beach house. The scene kicks off with Dorian vacuuming up the hair from Brian's buzz cut (which is featured in full in the Behind The Scenes footage) as DJ, Brian and Kaden relax on the couches. It should be a law that we all have our own naked Marine to vacuum our house. Don't you agree? Meanwhile Brian is sporting a full hard on over on the couch as he spies the porn. DJ and Kaden are playing with their hard cocks through their shorts and Dorian joins them. It won't be long before all the clothes are off and all the boys are having fun. The porn must have been awful because all the boys can seem to do is make fun of it. It's more comedy than inspiration so they must find other ways to inspire themselves. Something tells me that won't be hard at all.Team Up For Some Cocksucking Exploration ...Kaden moves over to the couch with DJ and starts in on his rock hard cock with his soft, hot, wet mouth and DJ seems to be right at home. Dorian and Brian watch for a couple of minutes, both imagining the others cock in his own mouth as DJ and Kaden put on a show for them. Faster than you can say suck my cock, Dorian is doing just that as he goes down on Brian's hard dick and gets himself a taste. Dorian strokes his own hard meat as he orally services Brian's. Kaden is doing a great job on DJ so DJ decides to return the favor. He gets down between Kaden's legs and starts sucking and stroking him in a passionate rhythm that seems to send Kaden into the zone. Brian follows DJ's lead and gets down between Dorian's legs to taste himself some of Dorian's beautiful meat. They switch back and forth within their teams a few times before they decide to assume a circle position that will allow everyone to get a taste of everyone's cock.The Daisy Chain Of Command ...They form a circle on the floor with DJ sucking Kaden, Kaden sucking Dorian and Brian sucking DJ, I get some great shots from above to show off the circle and these four hotties are lost in the taste of one another. After the circle of sucking they move back against the couches where Kaden sucks Dorian and Brian sucks DJ. Dorian and DJ embrace in a deep kiss while the other two men service their cocks. Kaden does his famous tongue-dance all the way up Dorian's chest, licking and sucking his nipples before he plants his lips deeply on Dorian's and they tongue each other deeply. Brian follows Kaden's lead and DJ seems to really like the extra attention. Brian and Kaden stroke their buddies cocks while they all engage in some heavy kissing. All this affection is about to lead to some hardcore fucking.Dorian Fucks Kaden While DJ Fucks Brian ...They saddle up for the ride and Kaden positions his ass in the air for Dorian to take and Dorian moves right in and does just that. Meanwhile Brian gets in position for DJ to take his ass and it's on. Dorian goes in slow and deep on Kaden's tight ass as Kaden pushes himself back, Dorian slides in further and further until he's balls deep in Kaden's ass. DJ works his way into Brian's hot ass and the four are fucking their brains out. DJ crams all nine of his thick inches balls deep into Brian's tight ass and Brian grunts and groans as DJ and Dorian find a rhythm as they fuck these two hard and fast almost in step with one another. Talk about marching to the beat. Man, these two are fucking Brian and Kaden like there's no tomorrow.DJ And Dorian Return The Favor To Their Comrades ...DJ and Dorian offer up their asses to Kaden and Brian after they've fucked them both good and hard. Brian tears into DJ's tight ass while Kaden and Dorian watch for a minute. Soon, Kaden is buried in Dorian's ass while Dorian and DJ both stroke their hard cocks They're going to town and making sure everyone leaves with a good fucking. DJ is the first to pop his load as Brian plows deeper and deeper into his ass he blows a huge load all over himself. Dorian is the next to go as he covers his dog tags in hot manjuice while Kaden plows his ass hard. With no warning at all, Brian starts shooting his hot load all over DJ's chest. I rush to get the cumshot, nearly tripping over Kaden in the meantime. Finally Kaden is ready and Dorian is waiting as Kaden shoots a fat load on Dorian. They go for one last cum-covered kiss. Mission complete. At ease!",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Brian",
      "person_id": 35046
    }
  ],
  "release_date": "2006-12-15",
  "scene_id": 70145,
  "series": "Summer Recruits",
  "tags": [
    "Gay"
  ],
  "title": "Brian, DJ, Dorian & Kaden"
}