{
  "collections": [
    "Active Duty"
  ],
  "description": "Dorian Returns With Christian And DJ ...Our man Dorian from our last release, Double Time 2, returns and this time he's got some new playmates. Christian returns after a long break from Active Duty and he's looking better than ever. DJ joins in and just makes this threesome out of this world. It's obvious from the start that these three are gonna be fun to watch. Things kick off in the pool house with DJ and Christian all smiles. We all know how crazy I am about Dorian. I get him to strip off his shirt right away. And then I decide that they should all strip down and do a line-up. These three look fantastic together. I suggest some hot tub fun and they don't hesitate.Heating Up The Hot Tub ...Once in the hot tub these three don't waste much time getting aquainted with one another's bodies. All hands are on Dorian first as DJ and Christian take turns rubbing and feeling him up. What a hot body this Marine has. It's a wonder just to look at. Can you imagine being able to touch and rub it? DJ's cock gets rock hard just from touching Dorian's chest. You can tell right away that the chemistry is there. Dorian is new to all this, but he's eager so Christian moves in on DJ's cock to give Dorian a little show of what he's gonna get to play with. Doesn't take long and Christian has Dorian talked into sucking on DJ's hard cock. Dorian's first comment is It's big and it sure is as it stands at solid attention. Dorian moves in and takes the cock in his mouth as Christian stands by to offer any assistance. Dorian doesn't seem to need any help as he begins taking the hard dick all the way down his throat as he cups the balls to make it easier to swallow the whole thing. He makes room for Christian and together they share the beautiful cock.Back Inside The Pool House ...The three Marines gather on the murphy bed and make themselves comfortable. All the cocks are hard pretty quick as the action continues to get heated up. Something tells me it won't be long until this trio is deep in the heat. I tell DJ and Christian how bad I want to see them corrupt Dorian. Dorian just smiles a huge smile and blushes a bit. Something tells me the task at hand won't be all that hard. Dorian is so excited about all this new stuff he's been experiencing around my place and he's along for the ride. DJ quickly moves in and takes Dorian's big, hard cock deep in his mouth as Dorian strokes Christian's hard dick. Christian movies in to help DJ and takes Dorian's cock all the way down his throat to the balls. Trying to one-up DJ? Hmmm. They go back and forth, sharing Dorian's cock when one isn't sucking he's licking and sucking Dorian's chest and nipples. So hot to watch.Swappin Spit Never Tasted So Good ...These three really go the rounds giving each other some deep, good head. Christian moves down to service DJ while DJ keeps servicing Dorian. Dorian is watching it all and loving all the attention. Sensory overload might be the right phrase. DJ reaches under Dorian's balls as he sucks his cock and starts fingering Dorian's asshole. Christian comes back for more of Dorian's cock while DJ makes his way around to Christians pretty little ass, spreading his cheeks out to show off that cute, tight hole. DJ takes a dive and starts eating Christian's tight pink pucker while Christian mans Dorian's hard cock. Meanwhile Christian decides to investigate things further and finds his tongue deep in Dorian's asshole while DJ eats his.Eating Ass ...Dorian turns over on his hands and knees so he can give Christian better access to finish the job he's started. Dorian seems to love having his hole eaten and played with. Funny how that works. DJ keeps eating Christian's ass as these three learn to share. It won't take much of this action before someone is getting fucked.I Want You To Fuck Me Says Dorian To Christian ...And I was right. Dorian reaches underneath and hands Christian a condom as he tells him he wants him to fuck him. Christian jumps at the chance and saddles up. Christian buries his fat cock deep in Dorian's hole and DJ reaches underneath and strokes Dorian's hard cock while Christian plows his ass. Christian gets Dorian's hole all hot and bothered and DJ can't take it anymore. He's ready for some cock up his ass too. They switch up and Dorian takes the reigns on DJ's hot ass.Dorian Fucks DJ ...Meanwhile DJ and Christian are engaged in a hot sixty-nine while Dorian is going balls deep in DJ's hot hole. Christian is givien DJ's cock all the attention it needs while Dorian services his ass. DJ must be in heaven at this point. Dorian must be too as it doesn't take long before he's blowing his huge load all over DJ's ass.Spraying Dorian ...DJ and Christian get on each side of Dorian and jerk their loads out all over his chest. It's a wrap.",
  "models": [
    {
      "name": "Christian",
      "person_id": 35060
    },
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Dorian",
      "person_id": 35017
    }
  ],
  "release_date": "2009-02-12",
  "scene_id": 70140,
  "series": "Battle Cry 2",
  "tags": [
    "Gay",
    "Rimming"
  ],
  "title": "Christian, DJ & Dorian"
}