{
  "collections": [
    "Active Duty"
  ],
  "description": "Dorian, Conrad, David and Chance get acquainted ...Things kick off with Conrad sitting at my desk as I talk to this cherub-faced, humpy Marine. He tells us that he's 20, 6'1 and I guess that he's 185 pounds and what do you know? I'm right. We talk about some bi videos but I told him that I would put him in a bi video only after he'd done a full hardcore gay scene for us on Active Duty. Doesn't take long for this hunk to strip off his shirt and reveal that smooth, muscled chest. The gorgeous smile on his baby face just spells innocence, but I got a feeling this devil is anything but. He admits that this will be his first time doing anything with another guy, but he still seems eager in a fascinated kinda way.Meanwhile Dorian, David And Chance Strip Behind Us ...While I'm talking to Conrad ... Dorian, David and Chance are busy getting naked in the adjoining living room. Conrad can see them from where he's sitting and his eyes seem to wander behind me. David is spying Dorian's hard cock as he pulls it out and strokes it. Conrad continues removing his clothes, pulling off his black underwear to reveal his hot ass. David, Dorian and Chance are all stroking hard cocks and David looks like he's getting very eager to get a taste of someone. By now Conrad is stroking his cock and working up a hard-on as he spies what the others are doing in the other room. Doesn't take long before that perfectly curved cock is rock hard and ready. David has reached over and started playing with Chance as Conrad sneaks a peek at the action.David Reaches Out To Lend A Helping Hand ...Before you can say suck it bitch David has his mouth full of Chance's uncut meat. He's going to town on it. Dorian is watching in anticipation and in his view Conrad is stroking his meat and returning the glances. David moves over and gives Dorian some service and Dorian throws his head back in obvious relief. David is swallowing like a circus sword swallowing act. Talk about talent. David makes his rounds back and forth on Chance and Dorian, giving them the help they need.David Makes The Rounds ...David is glad to help his fellow man in need and moves from sucking Dorian and Chance over to give Conrad's huge cock some attention. Conrad is still sitting in the office chair as David goes down on his knees to throat-fuck himself with the curved monster. Conrad is experiencing the best blow job of his life if his facial expressions give us any clues. David is mastering this straight boy and getting him ready for some serious mansex.Chance Takes Dorian For A Spin ...Meanwhile Chance has found Dorian's nice hard cock and has latched on tight. Dorian is feeding his face good and fast and Chance is along for the ride. He seems so submissive hunkered down on such a hard bodied daddy. In the background you can see David bobbing up and down on Conrad's hard meat and somehow the camera seems to not be there. They are all lost in the moment and enjoying ever second of it.Conrad And David Embraced In A Kiss ...The heat of the moment gets the best of him and Conrad finds himself lip-locked with the lips that just left his cock. David tongues Conrad and these two let the intimacy flow. From there Conrad switches places with David and does down on his knees to return the great favor David has been showing Conrad's cock. David's big cock is a challenge for this first timer, but he'd giving it a soldier's try and doing a fine job at the same time. When Conrad makes his way down to David's huge balls love seems to be found. He makes love to those beautiful nuts with his mouth.The Foursome Meets In The Middle And All Hell Breaks Loose ...David and Conrad move from the office to the living room where Dorian is returning the favor to Chance. A chain of cocksucking ensues as David goes down on Dorian while Dorian goes down on Chance and Chance goes down on Conrad. Things switch up fast with Dorian finding his way over to Conrad and taking his cock in his mouth as David takes over on Chance. Conrad is finding pleasure in all these hot new mouths as he moans from the action Dorian is giving him. Conrad seems to really like having such a big, agressive man between his legs as he tries to dominate Dorian by grabbing his head and face fucking him. Chance and David switch places and Chance takes David in his mouth. Something tells me Chance will end up on the submissive end of this deal. Dorian's cock is swinging hard in the breeze as he gets force-fed with Conrad's cock.Conrad Shows His Submissive Side With Dorian At The Reigns ...Conrad suddenly finds himself between Dorian's legs getting face-fucked himself while he grabs onto Dorian's dogtags and pulls them tight. Dorian's hard cock is ramming in and out of his slick throat. Conrad moves up Dorian's muscled torso with his tongue, licking and sucking until his lips meet Dorian's lips for a short teasing kiss. These two are on fire as Chance continues his submissive role as David's cocksucker.One Seriously Hot Moment ...Conrad grabs Dorian's cock and squeezes it to his as he jerks them together. What a hot sight to witness as these two muscled Marines buddy up. While this is going on, David moves in behind Conrad and starts licking and fingering his hot, smooth hole. What a perfect pink pucker it is and David isn't wasting anytime tasting this behind. Conrad moans loud with delight at this new sensation. Chance climbs aboard Dorian's cock for some more service while David really gets into eating Conrad's hot hole. Conrad reaches up and holds Dorian's cock while Chance bobs his head up and down on it faster and faster while David sticks his tongue deeper and deeper into Conrad's virgin ass.Let the fucking begin ...David can't hold back anymore so he saddles up to take Chance's ass for a ride. Chance is ready and assumes the position. Conrad has latched back onto his big teddy bear Dorian and you know things are about to get crazy. David takes the deep plunge into Chance's hungry hole and slides his long, hard cock all the way down to the balls. Conrad and Dorian are embraced in a pre-fuck kiss and what a hot one it is. These two beautiful giants are about to engage in battle, but the prepping is just as much fun to watch. Meanwhile David is banging Chance's ass hard and steady and Chance is in heaven. Chance is moaning and breathing like a bitch in heat as David pounds his horny ass hard.Dorian Hops On Top Of Conrad ...While David is frantically fucking Chance, Dorian climbs on Conrad's lap and puts his asshole next to Conrad's hard cock. Conrad reaches around and spreads Dorian's cheeks to reveal that beautiful hole. Conrad grabs Dorian's dogtags again and pulls them tight. David has Chance in a chokehold by now as he bangs him harder. Conrad bends Dorian over the couch and slowly starts his insertion. Once he's in, Dorian tells him to bang his ass hard. Conrad shows no mercy as he does as he's told. Conrad gives us a surprise as he bangs Dorian's hole he reaches back and spreads his own hole open wide. Conrad is long-stroking Dorian's hole with his long dick going in and out in long strides.Conrad Blows The First Load Of The Scene ...As he's pounding Dorian's gorgeous manhole Conrad can't take the sensation any longer and pulls out and plows a huge load all over Dorian's ass. Lucky for you we had two camera's catching all the action so you get a double take of the glorious shower of hot jizz from two angles. Double your pleasure.Dorian Fucks David ...David has done his time as a top today and he's feeling the need to be a little submissive. Dorian is just the man to give it to him as his own asshole has just been rode hard and hung up wet. Dorian steps in to fill David's hole and what a good filler he proves to be. He's fucking him hard as David strokes his own meat fast and hard. Dorian's huge cock going in and out of that little tight ass is seo fucking sexy. It must be just what the doctor ordered because David blows his huge load as Dorian pounds him the hardest. David's tight little ass must have done the trick because Dorian quickly follows his lead with a huge load of his own. They rub their cum-soaked cocks together and you might have fainted by now. I know I nearly did. David moves over to help Chance with his load and Chance blows it in David's mouth. A hot ending to a fucking hot fourway.Ó",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Chance",
      "person_id": 35057
    },
    {
      "name": "Conrad",
      "person_id": 35066
    },
    {
      "name": "David",
      "person_id": 35073
    }
  ],
  "release_date": "2009-03-10",
  "scene_id": 70142,
  "tags": [
    "Gay"
  ],
  "title": "Chance, Conrad, David & Dorian, Scene #01"
}