{
  "collections": [
    "Active Duty"
  ],
  "description": "DJ And Randy Finally Get Some Time Alone...The tension has been building between these two all during the entire trip. Their nights out and all the flirting and teasing back and forth. Randy has clearly got the hots for DJ and the feeling is mutual. These two have needed some time alone the entire weekend and today they get it while the other guys are all out riding the waves. They make their way back to the house and find a quiet bedroom to kick back and relax in. The kissing starts off immediately as these two have been longing for this. They're tongues are dancing and their hands exploring within the first forty seconds after the camera comes on. Within the first minute, DJ's board shorts are off and Randy is sucking his hard cock. DJ's cock is rock hard and loving the attention. He's rubbing Randy's pretty little ass while Randy gives him plenty of attention. Randy is becoming quite the little cocksucker and he's really loving getting to practice his skills on DJ. Randy peels off his board shorts and DJ quickly takes his half hard cock in his mouth. It's nice to watch DJ suck Randy's cock all the way to full staff, standing at attention. Randy plays with DJ's chest while DJ works Randy's rod. Randy reaches down and starts jerking DJ's hard cock and what a beautiful moment to watch as these two finally get their go at one another. By now Randy's cock is hard as a brick and DJ is giving it a circular hand-mouth blowjob. DJ gets Randy to lay back on the bed and relax while DJ works his magic. He's got that big dick standing at attention and Randy's mouth is telling the story as he gives his O face over and over. DJ works the balls in unison. DJ moves up and feeds Randy more of his own hard cock as Randy strokes his hard dick and sucks DJ good as DJ fucks his face. Randy's doing a nice job of taking DJ's face-fucking. He's come a long way baby. They go back and forth on one another's cocks and then Randy decides he's ready to ride DJ's. I was surprised, but love does strange things to us. Luckily for us, we get to see it. Randy Rides DJ's Big, Hard Dick Like A True Lover...He saddles up for the ride and hops on. It happens just that quick. He's slowly moving down on DJ's cock as DJ slowly pushes up. Randy's ass is so smooth and beautiful and its so hot to watch DJ's long shaft penetrate that tight little hole. DJ keeps slowly working it until it's hitting balls deep in Randy's tight ass. He's worked his magic and Randy is taking all DJ has to give. And he's doing it like a damn champ. I'm so proud of Randy at this point that it's hard for me to hold the camera. Soon, DJ is pounding harder, faster, deeper and Randy is moaning more and more. DJ 's giving him a good hard fucking and decides to flip him over on his back and go in again as Randy strokes himself. DJ gets in all the way and starts fucking him hard once again. DJ is long-stroking him fast and Randy is hard as a rock. At one point he thinks he's gonna cum, but it's a false alarm. But watching him stroke his big hard meat while DJ pounds him is hot as all hell. After doing all this fucking, DJ is ready to get fucked himself and he bends over for Randy's big meat to deep inside.Randy Fucks The Cum Out Of DJ...Randy saddles up and moves in behind DJ and shoves his hard, long cock deep in his ass. DJ is ready for it and takes it like a champ. The looks on DJ's face are priceless as he takes this monster cock on for size. It takes no time at all for Randy to work his magic and loosen DJ's ass up to his cock. Randy is a damn good bottom, but he's a master at topping a hot ass and he proves his skills once again as he fucks the daylights out of DJ. This is a fast-paced fuck as DJ is pounding his own cock fast and hard. He's getting all he can out of this hot fuck. He's yellin' and moaning like it might be the best of fucks. Randy is doing his job and doing it well, he's hitting every spot deep inside DJ that matters. It isn't long before he hits that one certain spot just right and DJ explodes a huge load all over the bed while Randy pounds him hard. Randy doesn't stop, he keeps banging DJ's ass and stands up on his flat feet to get better leverage and it doesn't take long before he's blowing a huge load all over DJ's back. It's a huge wad and it covers DJ's lower back. They embrace in a hot kiss and fade with the sunset.",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Randy",
      "person_id": 35130
    }
  ],
  "release_date": "2009-06-04",
  "scene_id": 70151,
  "tags": [
    "Gay"
  ],
  "title": "DJ & Randy"
}