{
  "collections": [
    "Active Duty"
  ],
  "description": "Colt, Kaden, Trent And Brian ... Colt, Brian and Trent are lounging around on the sofa with nothing on but their jeans. What a hot picture this makes and when Kaden joins them in nothing but his shorts it's a perfect picture by far. This was actually Colt's very first hardcore scene here at Active Duty and Trent's return after a long absence. I start out by chatting up Colt and all the guys just join in and make things fun. I speak to Trent who is just returning from a nine month deployment and he says he's really missed the action. He talks about circle jerks in the bathroom stalls. Wild stuff. Brian is looking better than ever. He's been working out really hard and his body is hotter than hell. Colt is scanning the group for anyone that might need some help. The dicks start coming out and they're nice and hard. Colt is a bit nervous but the other guys will help cure that soon enough. Everyone is sportin' wood by now and Trent is talking about someone shoving a fist up his ass. Colt asks permission to go pee, so cute. Brian and Trent decide it's time to get naked and the others follow their lead. The boys are all naked now. It's hard to tell who is the happiest to be here, Trent, Colt or me. Trent is eyeing the boys and checking out the cocks. Let The Sucking Begin ... Left with no instruction manual, the guys make do for themselves. Colt latches on to Brian's cock and Trent moves over to Kaden and bows beneath him to service his cock. I finally decide to do my job and grab the camera to make my rounds. Brian seems to be enjoying Colt's hot mouth and Trent is sure happy with the meat he's wranglin'. Kaden reaches over and rubs Colt's ass while Colt services Brian. Things switch up a little and Kaden hoovers over Brian to give him something to suck while Trent moves over and grabs onto Colt's huge, hard cock and takes it for a spin. This is cocksucking 101, so take notes, folks. You're bound to learn something from these eager military men as they get right down to business and really get into it. Things switch up again and this time Brian joins Trent to help him with Colt's monster cock as Kaden gets down between Brian's legs to keep him happy. Watching Brian and Trent (two fellow Marines) share Colt's large dick is an extra special treat. Trent gets playful and reaches down, fingering Colt's ass. The more I watch these two, the more I realize just how much they love sucking cock. And Kaden is always a pleaser as he takes his cocksucking very seriously. Things switch up yet again and Trent moves up to feed Colt his cock while Brian stays behind and mans Colt's rod. Kaden stays put on Brian's cock and from the looks of it, Brian is very pleased with his decision. By the time things take another turn, Brian moves up to join Trent as Colt pleases both cocks back and forth and Kaden moves down to handle Colt's big hard on. I zoom in on Kaden's pretty asshole for your viewing pleasure and what a nice one it is. I then focus some attention on the attention that Kaden is paying Colt's big cock and what a treat it always is to watch Kaden worship a hot dick. He does it so well. Brian and Trent are enjoying the use of Colt's hot mouth and Colt aint doin' no complaining. Who would? The view from above feels like you're looking down on heaven as I get some shots showcasing all four hot men in all their glory. Kaden and Trent trade places and Trent is making love to Colt's fat cock while Kaden gets him some of Colt's hot throat. Kaden is fucking Colt's throat to the balls and Colt doesn't seem to mind. Trent starts fingering Colt's ass again and you know it won't be long now until they've gotta fuck it. Colt wants to know who's gonna fuck him first. Kaden Fucks Colt While Brian Fucks Trent ... Just as the fucking is about to start, Trent looks at Colt and says, 'feels good don't it?' in that Texas twang of his. Such a hottie. Brian works it in and Trent is tight from not getting fucked for nine months. But he arches that back and takes it like a good Marine. Kaden is balls deep in Colt's ass in no time flat and the fucking has begun. Watching Trent arch his back and take a dick is like looking at a beautiful summer sky, it's amazing. Colt seems to be doing just fine taking Kaden's hard cock and all four guys seem to be having their fair share of fun. Brian and Kaden are Pullin' Rank on the newbies and it's all working out just fine. Trent bites the couch and takes Brian's cock like a champ while Colt holds his own with Kaden. Trent and Colt lock in a kiss while they're getting their brains fucked out. I gotta tell you I couldn't stop watching Trent's pretty ass get fucked hard by Brian. It was just beautiful. Tag Team Hit And Switch ... Things switch up and Brian gets him some of Colt's ass while Kaden delivers the goods to Trent's back door. Colt is yelling 'Fuck me, yes, fuck me.' as Brian rails his ass hard and deep. The way Trent arches his back is heavenly. Kaden fucks Trent nice and hard and the ass fucking continues. The Cum Flys All Over Colt ... Colt gets on the floor and says he wants all the guys to cover him in cum and it's a barracks bukake. Brian is the first to go and he lands one of the hugest loads I've seen in awhile all over Colt's chest, face and hair. Kaden follows his lead and covers Colt even more with his huge load. Colt takes the cum and uses it as lube to jerk his own hard cock fast. Colt can't hold back any longer and blows his own load all over himself. Trent steps in right after Colt is done blowing and hoses him down good with a really big load. I'm not sure who blew the biggest wad since they were all huge. Colt is in heaven. Brian welcomes Colt to the AD family and it's a wrap!",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Colt",
      "person_id": 35065
    },
    {
      "name": "Trent",
      "person_id": 35190
    }
  ],
  "release_date": "2009-08-12",
  "scene_id": 70157,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Gay",
    "Group",
    "Jerk Off",
    "Muscular",
    "Rough",
    "Smooth",
    "Straight",
    "Tan",
    "Twink"
  ],
  "title": "Brian, Colt, Kaden & Trent"
}