{
  "collections": [
    "Active Duty"
  ],
  "description": "Dorian, Kasey and Gage Hiding Out Jerking Off...I'm wandering around the house with the camera as the boys come in and out from the beach and the deck. Everyone's up to something but three guys seem to be missing in action. I roam around and as soon as I turn the corner the camera catches three cocks laying side-by-side on the bed getting stroked. They've hi-jacked a laptop and disappeared for a little afternoon relief. I quickly get in on the fun and tell them if they're gonna do this they might as well remove the shorts. Everyone's already hard and stroking and the shorts come off easy. Kasey is in the middle and his attention quickly turns to Dorian who he's never worked with before. You can tell Kasey wants himself a taste of this side of beef. He reaches over and grabs DJ's cock and starts stroking it and Dorian returns the favor. Kasey is stroking Gage as well. Before you can say suck his dick, that's exactly what Kasey is doing for Dorian and he's mastering the task at hand. Gage moves in and they share the cock. Gage is hungry and he's not letting go too quickly of Dorian's hard meat. Kasey is stroking as he watches, probably wondering when Gage is going to share. Kasey skips through the small talk and quickly moves in behind Gage to give him a dick in his ass to go along with the cock in his mouth.Kasey Gets Right To The Fucking Point...Kasey is teasing Gage's ass with his hard cock before he buries it deep inside him. Dorian's eyes are glued on the action as Gage's mouth is glued to his cock. Dorian is having fun. Dorian is fucking Gage's face as he grabs his head and pushes it down on his cock deep. Kasey saddles up and moves in for the tight hole. Gage moans and groans a bit, but takes it like a champ. Kasey is in and fucking him hard and fast in no time at all and Gage is loving it as both holes get stuffed. Having a cock shoved up his ass seems to make Gage that much more hungry for the cock in his mouth. A perfect reaction. They switch positions and Gage gets on his back, still able to reach and suck Dorian's cock as Kasey plows his ass deep.Dorian Takes His Turn On Gages Hole...Gage bends over and juts his ass out for Dorian to plow and Dorian moves in to do just that. Kasey moves around and gives Gage something to put in his mouth and Gage sucks it hard while Dorian fucks the hell out of his ass. They switch positions and Gage rides Dorian for awhile, slamming the hard cock in and out of his ass while Dorian services Kasey's dick. Gage beats his hard dick on Dorian's hard, flat stomach as he shoves his cock deeper and deeper up his ass.Dorian Takes One For The Team...Gage saddles up and they flip Dorian onto his back so Gage can fuck his ass. Dorian is stroking his own hard cock and sucking Kasey's dick while Gage pounds the fuck out of his ass. All the while Dorian is telling him how to fuck his ass. Gage tags off with Kasey and Dorian is happy to take on another hard dick as he watches them switch in anticipation. He's become the mouthy bottom as he tells Kasey to come on and put his cock in him. Dorian says he wants to feel it inside him. Dorian's cock is rock hard as he strokes it and waits. Gage moves in and starts kissing him. Kasey wastes no time and dives in where Gage has made a path for him. He's fucking Dorian hard and pounding him good.Dorian Takes A Cum Bath...After He's been fucked good and hard for a long while, Dorian is ready for a bath, but it's gonna be a cum bath. Gage is the first to blow and what a huge load it is. He shoots all the way across Dorian's chest and soaks him with his huge load. Kasey is the next to go and he blows his load all over Dorian's wrist and shakes the rest off all over his chest. Dorian finally squirts and finishes the glaze on his chest. He's covered him hot cum and loving it. Dorian says, It smells like cum in here. Everyone laughs. They end it out with a nice kiss between the three and a lot of smiles.",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Gage",
      "person_id": 35084
    }
  ],
  "release_date": "2009-06-04",
  "scene_id": 70150,
  "series": "Summer Recruits 2",
  "tags": [
    "Gay"
  ],
  "title": "Dorian, Gage & Kasey"
}