{
  "collections": [
    "Active Duty"
  ],
  "description": "Payne And Brian Get Down And Dirty ...This scene blew my mind. I know you're gonna come away from it breathless, too. Payne is one hell of a top and Brian is becoming the best bottom. This scene really brings it out of Brian. I was speechless when Payne started donkey fucking Brian and it was all I could do to hold the camera. Things kick off with me chit-chatting with Payne about how he uses me for a place to come get off. He admits it without shame and I tell him I'm just jealous. Payne is one of my personal favorites. That impish little grin and that tight, compact body with that gorgeous uncut cock attached to it makes for the complete package for me. There's just something about him that gets my motor running. I ask him what he thinks of Brian (before Brian joins us) and Payne gives his approval. Who wouldn't? Brian is adorable. Anyone in their right mind would fuck either one of these guys,but today they get to have each other. Brian Deep Throats Payne's Fat Uncut Cock. Over And Over ...As soon as Brian comes in the pool house Payne is all over him. From the minute he lays down Payne starts rubbing his chest, feeling him up. Payne isn't shy, he's ready to get down. Brian moves in and starts sucking and licking Payne's nippes as he plays with his own hard cock and Payne jerks himself. Brian moves up to get a kiss and Payne returns with his tongue deep in Brians mouth. Their tongues intertwine and they taste each others taste buds. Brian moves quickly down to that uncut beauty and has it in his mouth quicker than you can say foreskin. This is the first time Brian has sucked an uncut dick and he seems to be liking it just fine. He takes it all the way down his throat to the balls. Payne gives a look of surprise at first but then he gets lost in the feeling. Brian doesn't stop with one deep throating, he keeps going over and over and mastering the art of deep throating as he goes. I've never seen him worship a dick quite like this. Payne's cock must taste as good as it looks because Brian sure seems to be enjoying the taste. Watching him make love to that beautiful piece of meat will make you jealous and I'm not sure if you'll be jealous of him because that cock is so beautiful and tastey looking or if you'll be jealous of Payne because Brian is clearly so into his cock, but either way you're gonna wish you were there.Payne Hunkers Down On Brian's Gorgeous Cock and Returns The Favor ...Payne must be very hungry today because when he gets Brian's cock in his mouth he really gets into it. But after the head he just got from Brian I guess he feels like he really owes him something special and he's giving it to him right from the start. Payne's hard cock rests against his leg and bounces with his heartbeat. So hot to watch as he worships Brian's hard cock and Brian enjoys it immensely. These two are the perfect union. Payne tries hard to return the deepthroating favor and Brian reaches under as Payne comes up on his hands and knees to better service Brian, while Brian reaches beneath him and jerks his hard dick while he sucks Brian with wild abandon. Payne sucks Brians balls and starts playing with his ass.Brian Gets Fingered Before The Fuck ...Payne gets Brian on his hands and knees and starts fingering his ass, getting it ready for that nice uncut cock that's about to go exploring deep inside it. Payne strokes his own hard cock while he shoves his middle finger knuckle deep in Brian's tight hole. Brian's pink ass ring is tighly squeezing around Payne's middle knuckle as Payne rolls it around in circles you can see how tight that is as it puckers close to Payne's knuckle. Hot, hot, hot.Payne Fucks Brian Six Ways To Sunday ...Payne does the famous Donkey style and comes up flat on his feet, squating down to ram his huge, fat meat deep in Brian's waiting tight pucker. He descends rapidly, going in quick. Brian reaches back and spreads his ass cheeks as far apart as he can to give Payne plenty of room to work with as he plows Brian's tight hole, harder and harder, opening it up like wider and wider as Payne stuffs his fat meat deeper and deeper until he's balls deep. Payne isn't giving Brian any mercy and I was totally breathless at this point. But what happened next nearly sent me completely over the edge. I tell Payne to come all the way out and go back in and he does and watching Brian's asshole as it is gaped open is a sight to see. Payne repeats this several times and we see Brian's tight ass gaping, fully open and ready. He keeps fucking Brian for a good long while, balls deep and banging hard. He can't hold out any longer and he blows a huge load all over Brian's back and what a huge load it is. It runs all the way down the middle of Brian's back.Payne pulls Brian back onto him as Brian grabs his huge, hard cock and jerks out his own fat load all over his stomach. They go for another really hot kiss and it's fade to black...",
  "models": [
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Payne",
      "person_id": 35125
    }
  ],
  "release_date": "2009-05-15",
  "scene_id": 70154,
  "series": "Double Time 4",
  "tags": [
    "Gay"
  ],
  "title": "Brian & Payne"
}