{
  "collections": [
    "Active Duty"
  ],
  "description": "Dorian and Diego ... <br />Things kick off as usual, on the couch, with these two hot Marines watching some good porn to get them ready. We talk shit back and forth and I give Diego a hard time about being late. I tell him he's on probation. Dorian joins in and things loosen up really quickly. I tell Diego I'm gonna leave the two of them alone and see how long it takes Diego to jump Dorian's bones. Diego tells me I instigate things and I deny his accusation. He tells on me about having a sailor spend the night that had a cast on his arm and tells me I go after the handicapped. He says that's why I went for him. <br /><br />I leave these two alone and it isn't very long before they are butt ass naked and hard as rocks. They talk a bit about their tattoos and Diego explains some of his. He tells Dorian how he could never make a career out of the Marines, but Dorian has other things on his mind than talking about the military. His eyes are glued on Diego as he strokes his big hard cock in anticipation of what's to soon come. <br /><br />After they've stroked their cocks together for a bit, they give each other this really deep stare and embrace in a kiss. Two hot devil dogs tongue fighting as they play with their guns. After the first kiss, Diego goes down on Dorian's cock like he's been starving for it for months. I've never seen anyone any more eager than Diego to suck a cock and he does it so well. He's on it like white on rice. You'd think these two had gotten stranded together and hadn't had sex in months. That's how hungry they seem to be for each other. By the look on Dorian's face you know Diego is quite the accomplished cocksucker. And with the hand action he's including with his hot mouth you'll be wondering if he isn't damn near a pro. <br /><br />Diego throws his cute little ass in the air while he's sucking Dorian's big meat and that gives Dorian something nice to focus on. He starts playing with Diego's cute little butt as Diego services his huge, hard cock like a champ. Dorian grabs Diego by the back of his head and feeds him his massive meat. Diego seems to like the control that Dorian is taking as he gets more into it. Diego is working his own hard cock as he works Dorian's with his mouth. You can see Dorian's pre-cum on the shaft of his dick as he shows this young devil dog the ropes. <br /><br />Things take a turn and we see a very hungry Dorian go down to repay the favor to his brother in arms. He's hungry for something in his mouth and Diego's cock is just the right answer. It's so hot to watch Dorian's big hands rubbing all over Diego's small body as he sucks Diego's cock and worships his little tight body all at the same time. After he's gotten a good taste, Dorian slides back up and puts his big cock back in Diego's hot mouth and face fucks him fast and hard as Diego strokes his own hard cock. Won't be long now until someone is getting fucked somewhere besides their mouth. Once he knows he's got the big muscle daddy all hot and bothered, Diego looks up at Dorian as he holds his hard cock in his hand and says, I want you to fuck me with this. <br /><br />And from there, Dorian does just that. He buries his raging hard cock deep in Diego's tight little ass and Diego moans and whines with pleasure. Diego is biting his arm as Dorian plows his tight hole. Watching this muscle Marine man handle this small Marine is heaven. After Dorian has him nice and opened up, Diego decides to ride the monster meat and hops on top of Dorian and literally fucks himself with that beautiful dick. All the while Diego is stroking his own hard cock and getting his ass filled with Dorian's. Dorian lets the little Marine fuck himself up to a cumshot as Diego blows his huge load all over himself while still sitting on top of Dorian's cock. Diego tells Dorian he wants him to cum on his chest so he lets Dorian stand over him and stroke out a massive load as he tells Dorian to make him his cum slut. Diego's cock is still rock hard as he strokes himself and waits for the prize. Dorian delivers a huge load and splashes it all over Diego's chest. They stroke the last few drops from each other's cocks and go for another hot kiss. I tell Diego he's almost out of the dog house and Dorian says we still have to spank the puppy a few more times. I tell Dorian it's called Pullin' Rank!",
  "models": [
    {
      "name": "Diego",
      "person_id": 35077
    },
    {
      "name": "Dorian",
      "person_id": 35017
    }
  ],
  "release_date": "2009-09-10",
  "scene_id": 70158,
  "series": "Pullin Rank 3",
  "tags": [
    "Gay"
  ],
  "title": "Diego & Dorian"
}