{
  "collections": [
    "Active Duty"
  ],
  "description": "Randy, Thomas, Kaden and Damien ... Things kick off right away with Randy sucking on Kaden while Damien is sucking on Thomas. I must have been downstairs baking a pie cause these four heroes got started without me. But that's OK, we've come in just at the right time. Randy is sucking Kaden while Kaden strokes Randy and Thomas is telling Damien how to worship his cock. Some things never change and one thing you can count on here at Active Duty is some hot sex between hot ass guys. This scene is no exception. The heat is on and we find ourselves right in the middle of it. Thomas is talking his usual dirty shit to Damien who is choking on his horse meat while Randy and Kaden are having their own pow wow. Randy is hungry today and Kaden is rock hard. He's stroking Randy's huge meat while he gets his worshipped. Damien is doing his magic on Thomas' stick and it's business as usual. Kaden reaches back while Randy is servicing his dick and spreads Randy's cheeks apart to reveal that hot hole of his. Thomas stands up to fuck Damien's throat and Damien is in heaven as he does what daddy tells him to do. Thomas tells him he wants to choke him with that fucking big cock and Damien is along for the ride. Whatever daddy says, goes. Kaden watches Damien as he gets his own cock worshipped by Randy. I'm not sure I've ever seen Randy get this into sucking a dick, but Kaden's sure looks delicious so I can't blame him. Kaden's cock is hard as a brick and there's nothing better than a thankful cock when a cocksucker is doing his job. I guess that gets Randy all worked up. Wouldn't it you? Thomas is standing on the side of the bed, holding Damien's head in his hands and skull fucking the breath out of him. Damien is so horny for Thomas' big horse cock that his mouth is watering overtime. His hot little mouth has Thomas' cock shining with his spit. This is what loving to suck a cock really means. Things switch up and Kaden finds his way down between Randy's legs and takes that big, hard dick in his mouth and gives it that special Kaden attention. Meanwhile Thomas flips Damien over on his back with his head hanging off the bed and fucks his throat from above. Kaden is gyrating his pretty little butt around in circles as he sucks Randy's horse cock. That must be a telltale sign that someone wants to do more with Randy's cock than just suck it. Randy is stroking Kaden's dick all the while as Kaden continues to enjoy. Randy is rock hard as Kaden's beautiful lips make love to his fat cock. Kaden can't take it anymore, he wants to know what it feels like to have that big dick deep inside of him. He looks at Randy and tells him he wants him to fuck him with that big cock. And with that, Katie bar the door! What happens next is so surreal that I had a hard time believing it actually happened while sitting here and rewatching it all. It's been over a month since this scene was shot and I honestly had forgotten just how hot the fuck scenes were. Brace yourself, troops. Randy is about to pound Kaden's tight hole with that monster dick of his. Meanwhile, Thomas is having fun using Damien as his little sex toy and Damien is loving every minute of it. Randy is slamming his big dick in and out of Kaden's hole and Kaden is loving it too. Randy does his famous donkey fuck and pulls his balls out of the way so we can see his horse dick as it slides in and out of Kaden's ass. Thomas comes up to put his cock in Kaden's mouth and Kaden has the two of the biggest Active Duty cocks inside of him at one time. Damien is enjoying the show as he plays with Thomas' balls and watches the action. Randy isn't letting up on Kaden's ass as he fucks it harder and faster. Kaden grunts and moans in that special Kaden moan and you know he's in heaven. Randy must be in heaven too cause his nuts are tightened up really close and we all know what that means. That cock is loving where it's at and those balls are showing it. Thomas keeps feeding Kaden from one end while Randy feeds him from the other. Damien can't stand it anymore and he's gotta have some of what Kaden is getting so he sits down on top of Thomas' big cock and takes the horsie for a ride. Meanwhile Kaden is ready to return the favor to Randy and Randy positions himself on his back to take Kaden's dick. Once Kaden is in, it's on. Thomas is plowing Damien's ass and Randy is taking Kaden. By the time it's all over, everyone has blown their loads and are satisfied.",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Randy",
      "person_id": 35130
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2009-09-10",
  "scene_id": 70159,
  "series": "Pullin Rank 3",
  "tags": [
    "Gay"
  ],
  "title": "Damien, Kaden, Randy & Thomas"
}