{
  "collections": [
    "Active Duty"
  ],
  "description": "Conrad And Brian Get Some Alone Time ...Conrad and Brian are hanging out over at Major Wood's place and watching their copy of Summer Recruits. Things get a little heated so the Major grabs the camera and gets one hell of a scene between these two. Their cocks are still soft and we get to watch them work each other up to raging hard ons. Conrad is the first to go down on his knees and get a taste of Brian's hot cock. He's sucking on Brian and in no time has Brian standing at attention. After he's paid Brian some attention Conrad lays back on the ottoman and lets Brian take a turn on his cock. Brian takes the limp cock in his hot mouth and gets it standing erect in a matter a minute. Brian reaches down and strokes his own hard cock while he sucks Conrad. They move over to the mirror in the bedroom and admire each other's bodies as they stand in the full-length mirror. They kick back on the bed and continue the sucking as Brian goes back to what he was doing in the living room.Brian Works Conrad's Cock Over. ...Brian is all about some deep throating action lately and he's going all the way down on Conrad's dick, taking every last inch of it down his throat as Conrad lays back and enjoys Brian's skills. Brian seems to get lost in the moment as he makes love to the nice, long dick. Conrad rubs and plays with his own chest then moves his hands over to Brian's back and massages it while Brian works his magic on Conrad's cock.They Do A Sideways Sixty-Nine ...They position themselves on their sides and do a nice sixty-nine as both boys get a mouthful of hard dick. They are working each other's cocks over good and each one gives the other plenty of attention.The Boys Eat Ass Before They Fuck ...Conrad moves in behind Brian who has assumed the position doggy style. Conrad spreads Brian's ass cheeks apart and eats his ass, licking his hole and lubing it up for his cock that will soon follow. Conrad assumes the position and Brian tongues his hole. He's eating it nice and slow and wiggling that tongue deep inside. Conrad Is The First To Get Fucked ...Brian positions Conrad across the bed in the doggy position and moves in behind him, slowly sliding his cock in his ass a little at a time. Deeper and deeper he's soon balls deep and Conrad is moaning loud. Brian is fucking him good and hard and Conrad is taking it like a man. These two look so hot together and the chemistry is amazing. Conrad is ready to fuck and so Brian gives him his chance.Conrad Gives It To Brian Deep and Hard ...Brian assumes the position and Conrad saddles up for the long ride. He's about to fuck the daylights out of Brian and he's gonna stay in the saddle awhile. These two go at it and end out with some really great cumshots and a hot shower scene that is delicious.",
  "models": [
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Conrad",
      "person_id": 35066
    }
  ],
  "release_date": "2009-05-15",
  "scene_id": 70155,
  "series": "Double Time 4",
  "tags": [
    "Gay"
  ],
  "title": "Brian & Conrad"
}