{
  "collections": [
    "Active Duty"
  ],
  "description": "Conrad And Kaden Alone At Last ...These two have done a scene together with other guys, but never alone. I've wanted to see them alone together for the longest time. This scene kicks off fast and with just a little teasing of Conrad from me, I leave them alone to get down to business. Conrad wastes no time getting up close and personal with Kaden as he moves in and immediately starts kissing him. They are rubbing and feeling on each other just like that. They caress one anothers bodies and check each other out. Kaden is the first to reach in for Conrad's cock and pull it out. Kaden wastes no time in going down for a taste of that large beautiful dick. Watching him work Conrad's cock up from soft to hard is a hot sight. Conrad just kicks back and enjoys the help as he rubs all over Kaden's gorgeous body. Kaden worships the thick meat like only Kaden can. Watching Kaden make love to a dick with his hot mouth is something else. It's something I enjoy very much. He's got Conrad at full attention in no time at all and Conrad goes down to get a taste of Kaden.Conrad Returns The Favor ...He goes down on Kaden who is only half hard and in no time at all, Conrad's skills has Kaden's cock rock hard and ready to go. Conrad makes love to Kaden's cock, too. He's licking the shaft and sucking it fast and hard as Kaden throws his head back and enjoys the feel of Conrad's tongue all over his hard meat. He moves around and kisses Kaden's thigh and lower belly and then goes back to sucking again. He's enjoying Kaden's beautiful body and who can blame him? Kaden slowly fucks his face off and on as Conrad keeps the pace. Beautiful it is to watch these two beauties enjoy one another. I get some great angles and while you watch Conrad suck Kaden's cock, you get to watch Kaden spread his ass cheeks and play with his hole while Conrad sucks him.Kaden Goes Down For More ...Kaden finds his way down on his knees in front of Conrad again and latches on to that monster dick and takes it for another spin. You can see how huge Conrad's dick is from this angle and Kaden is having himself a ball as he worships it with his hot mouth. Kaden reaches down and plays with Conrad's ass and balls while he services his cock fast, giving himself some help by using a good mixture of hand technique and mouth together. Conrad is using his foot to play with Kaden's hard cock as Kaden keeps sucking him. Hot to see that foot action as he moves it up and down Kaden's cock. Conrad raises his leg up to give Kaden easier access to his hot ass and Kaden takes the lead and puts his finger in Conrad's hole, fingering him while he sucks him good. Kaden bends him over to take a closer look at that nice ass as he sucks his cock and plays with his hole. He's spreading it open and massaging it while Conrad strokes his own hard cock. Kaden Saddles Up To Fuck Conrad's Ass ...After he's played with it and Conrad has jerked his hard meat while Kaden plays with his hole, it's time to take things to the next level. Kaden saddles up and gets behind Conrad to deliver a good fucking to his waiting ass. Kaden slides right into home base and Conrad starts moaning and groaning as Kaden bangs his ass harder and harder from behind. Kaden sits down on the couch and Conrad squates down on his hard dick and they go at it in this position for a bit as Conrad takes control and shoves Kaden's cock deep in his ass. Conrad's cock is hard as a rock and he's stroking himself hard while riding Kaden's dick faster and faster. Conrad says he's pre-cumming and he is. Watching him ride Kaden's dick while he strokes his own is really hot. Conrad is horny beyond words and he's ready to fuck Kaden's ass so they switch.Conrad Fucks Kaden's Hot Tight Ass ...In no time flat Conrad is inching his huge cock deeper and deeper into Kaden's tight hole. Before long he's long-stroking Kaden's ass and Kaden is giving off his signature grunts and moans. He's got a big dick up his ass and it's going in and out balls deep and he's gonna make sure you know it by the sounds he's making. The deep-dicking he's giving Kaden has him over the edge and he's ready to blow...They Explode Together ...Conrad asks Kaden where he wants him to cum and Kaden says on his chest. He turns over and Conrad positions himself above Kaden and strokes out a huge load all over his chest and stomach. Kaden scoops up a handful and uses it to stroke his own hot load out.",
  "models": [
    {
      "name": "Conrad",
      "person_id": 35066
    },
    {
      "name": "Kaden",
      "person_id": 35022
    }
  ],
  "release_date": "2009-05-15",
  "scene_id": 70153,
  "series": "Double Time 4",
  "tags": [
    "Gay"
  ],
  "title": "Conrad & Kaden"
}