{
  "collections": [
    "Active Duty"
  ],
  "description": "Brian And Domenic Shower Up And Get Off... <br />This scene kicks off with these two hotties in the shower, lathering themselves up and each other. I've wanted to see these two alone together for a while now and if you have too then here's your chance. Domenic is such a horny devil and I knew he'd be hot for Brian. They had roomed together while we shot Summer Recruits and had played together in a scene with David, but getting them alone together was the ultimate. They kick off with some really hot kisses and things keep moving forward. Watching them explore each other's bodies under the warm shower is really hot. It isn't long before the cocks are hard and we all know what that means. <br /><br />Wet Cocks In Hot Mouths... <br />Domenic sits on the shower ledge and Brian drops to his knees to service Domenic's hard cock and what a good servicing he gives it as he licks, sucks and takes the hard cock down his throat. He gets down on those delicious balls too and really gives Domenic's cock the cleaning and service it deserves. He wants to be sure he's giving Domenic really good head so he asks to make sure Domenic is enjoying himself. Watching Brian suck cock is like an out of body experience. He gets so lost in what he's doing and so determined to please his partner. It's obvious that sucking cock is something this stud loves to do and by Domenic's reaction, he does a damn good job of it. He's stroking his own hard cock as he sucks Domenic's and it won't be long before Domenic offers to return the favor. <br /><br />They Trade Places And Domenic Returns The Favor... <br />And with just as much enthusiasm as Brian showed his cock, Domenic gets right down to worshiping this hot piece of meat with his tongue and throat. He literally makes love to the cock as Brian kicks back and enjoys the returned favor. By Brian's reaction you can tell he's having plenty of fun as Domenic slaps Brian's cock all over his face in between taking it deep in his hot throat. <br /><br />Out Of The Shower And Back To Business... <br />Brian goes back down to give Domenic's cock some more attention and this time he's really getting into it as he worships those nuts and works that cock good for Domenic. Domenic gives his O face and you know all is heaven as these two get down to the business of manlove. Domenic rubs himself as Brian sucks his cock, getting himself hotter and hotter. They switch up again and Domenic does his magic once more. <br /><br />Domenic Asks Brian If He Wants To Fuck Him And Brian Is More Than Ready... <br />But not before he eats that beautiful ass out really good before sticking his cock inside. Brian is an expert ass eater and that long, beautiful tongue of his gets right in there and works the ass he's eating like a pro. He's tonguing Domenic's hole and Domenic is loving it. Brian doesn't skimp on the job when he eats an ass and it gets Domenic all fired up for action. Brian slides his hard cock inside of Domenic and starts thrusting back and forth, faster, harder, longer. He's a master at fucking a nice ass too. Is there anything this hot fucking stud can't do when it comes to pleasing his partner? He fucks that hole good and hard while Domenic jerks his own cock. Domenic has to stop jerking himself he's so close to coming. Brian talks shit to him as he plows his hole and Domenic goes right along for the ride. <br /><br />Domenic Rides Brian's Cock And Works Himself Up To A Huge Cumshot... <br />Watching Domenic ride Brian's cock is out of this world. He sits right down on that hot, hard cock and takes it all deep in his ass as he strokes his own long, hard cock fast and hard. He's bouncing up and down as Brian's cock goes balls deep in his hot ass. He's all into it and it won't be long now before he works out a huge fucking load that hits the camera and squirts out all over the place as he sits all the way down on Brian's dick while he shoots out his thick load. That hot ass is getting the best of Brian and he pulls out and blows his own huge load all over the place. Brian is shaking all over and that's plenty of indication that the orgasm he just has was amazing. They give each other a really hot kiss and it's a wrap!",
  "models": [
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Domenic",
      "person_id": 35080
    }
  ],
  "release_date": "2009-12-15",
  "scene_id": 70162,
  "series": "Double Time 5",
  "tags": [
    "Gay"
  ],
  "title": "Brian & Domenic"
}