{
  "collections": [
    "Active Duty"
  ],
  "description": "Brian and Blake ... Blake took to showing off so well and I knew he was hungry to get be a perfect match for the young buck and I knew Brian would really appreciate being able to worship a cock the size of a Chrysler. I was right. And who can blame him? Blake's cock is the perfect cock for sucking. When Blake saw Brian for the first time I thought his eyes would pop out of his head. He cut a sly and happy smile that covered his beautiful face and those eyes lit up. I knew just from his expression that he was pleased with the pickins. In fact I don't think he could get Brian naked fast enough. I try and convince Blake that Brian is a newbie too, but I don't think he's buying it. They get right down to the good stuff kicking things off with a really long, hot kiss. All the while our horny little bad boy Blake is inching his hand all over Brian and up his shirt. In no time both guys are pretty good and hard so they start playing with each other's cocks through their jeans. The belts come off and Blake helps Brian peel off his t-shirt. Blake is appreciating the fine chest Brian's been working so hard on. You can tell they are both happy. The pants come off quickly after the shirts and Blake keeps inching his way down Brian's chest as he holds his hard cock in his hand and finally moves in for his hard hot cock. Blake takes it to the balls and worships them. Brian is in heaven as Blake shows him how it's done. Once Blake's gotten himself a really good taste of Brian's cock, Brian kisses him and slowly moves down his chest until he reaches that huge, fat cock and takes it in his mouth. What happens next is like watching a master at work. A true cocksucker always spends a long time worshipping the cock he's servicing and Brian spends quite a bit of quality time with Blake's huge monster. Watching Brian service a hot cock reminds me of the care and patience Kaden puts into the job. Brian makes it a beautiful work of art. But a lot of the credit goes to just how fucking beautiful Blake's cock is as well. Once Brian has given the beast his full and undivided attention for awhile, Blake moves back in to finish his oral exploration of Brian's cock and Brian takes one final round with Blake's before someone gets fucked. Brian looks at Blake and they both smile as Brian asks Blake if he's gonna let him fuck him. Blake smiles and they kiss and Blake turns over on his stomach as Brian kisses and licks from the top of his back all the way down to the cheeks of his ass where he spends some time really working Blake up, getting him hot as fire, teasing that ass and adoring it at the same time. Brian's beautiful long tongue glides lightly down the crack of Blake's ass, driving him crazy. Brian knows just what he's doing and it won't be long before this young stud is begging him to fuck him. Brian starts fingering Blake's ass while he licks his ass all over and Blake is moaning away. Brian moves on top of Blake and starts slowly sliding his cock up Blake's ass. They fuck in several positions, back and forth, literally wearing each other out. Brian figures out the best position to make his boy shoot as so he fucks Blake on his back, hitting the spot until Blake blows a huge load all over himself, moaning loudly all the way. Brian follows his lead and delivers his usual huge load to mix in with Blake's. They go for a lot more kissing and things end out perfect between these two.",
  "models": [
    {
      "name": "Blake",
      "person_id": 35040
    },
    {
      "name": "Brian",
      "person_id": 35046
    }
  ],
  "release_date": "2010-01-18",
  "scene_id": 70168,
  "tags": [
    "Gay"
  ],
  "title": "Blake & Brian, Scene #01"
}