{
  "collections": [
    "Active Duty"
  ],
  "description": "Shawn, Chaz and Brian Get Right Down To Business ... I have to confess to you, troops, I got so fucking excited while filming this scene for Gung Ho 3 that I decided to leave the tape it in the camera for later (ahem) viewing that night for technical reasons (wink) and forgot to remove the tape after I'd completed my laborious review. I ended up taping over the initial chit-chat in the beginning, but I'm sure you'll be more than fine with where things pick up. Brian and Shawn are engaged in a hot kiss and Chaz has Shawn's big, hard cock in his mouth, cleaning his gun. Brian quickly moves up and gives Shawn something to suck on and then changes up and heads South for Shawn's cock and trades places with Chaz. By the time all is said and done there won't be a dry cock or an unexplored mouth in the room. These three are plainly on a mission to please both us and themselves and what a fantastic fucking job of it they do. Orally Getting To Know Each Other ... Shawn obviously loves sucking cock as much as anyone and once he latches on to Chaz' cock you'd think lightening would have to strike before he lets it go. He worships Chaz hammerhead, giving it lots of tongue action and good old fashioned oral love. Meanwhile Brian is laying his lips, tongue and throat all over Shawn's huge meat, licking and sucking his balls and really giving it a thorough short arm inspection. There won't be a spot on Shawn's gun that isn't clean by the time this former Marine gets done with his cleaning. Brian has one of the hottest fucking tongues I've ever seen at work and he uses it to his full advantage. Brian and Chaz move up and let Shawn share their cocks as they share in some really hot kissing. Shawn doesn't miss a beat and gives their cocks equal attention, leaving neither of them wanting. Chaz switches back and takes the reigns on Shawn's cock again while Brian straddles Shawn's face and fucks it really good. Shawn lays his head back on the headboard and takes the deep throat fucking like a good comrade. Rimming For Readiness ... Brian decides to move the headboard to the other end of the bed and they position Shawn so that Chaz can lick and eat his sweet hole, preparing it for the fucking that Chaz is about to put on it. But first their going to use his sweet little hot mouth to get their cocks nice and ready. Chaz calls in the reinforcements and gives Shawn's sweet, delicious little hole over to Brian's long, hot tongue and Brian really gives it a good rimming while Chaz enjoys the other end. Watching Brian use that long busy tongue on Shawn's hot hole is something else. Chaz uses us mouth, slapping him in the face with his cock. Watching how well Shawn sucks Chaz' cock lets you know just how horny Brian's tongue worshipping his tight little hole has our man. He's ready to get fucked and things are about to get crazy. Ride 'Em Cowboy ... Chaz moves over to this peculiar little chair that I bought because it looked like it'd be fun to fuck on and I was right. It provides the perfect position for Shawn to crawl up on Chaz' cock with his feet on Chaz' thighs so he can ride the hard cock deep and fast. The angle allows us to see it all as Shawn does an amazing job of riding the hard meat. Brian offers a hand to insure all of Chaz' cock goes deep inside Shawn's ass as he sucks Shawn's cock at the same time. Shawn has got to be in complete fucking ecstasy with these two studs servicing him at both ends. If his O face is any indication I'd say he's loving the ride. Shawn's small size (fun-size!) makes him very gymnastic and he's able to take on many positions that most people can't pull off. So, fun-size is a very good description of this athletic acrobat. He switches around and rides Chaz cowboy style while sharing kisses with both Brian and Chaz as he rides the cock up and down, taking it deep inside his tight ass. More Rimming For Readiness ... Brian and Chaz position their little playmate with his back over the headboard so Chaz can continue plowing him while Brian fucks his face. Soon, Brian turns around and spreads open his ass cheeks to give Shawn easy access to his hot, hairy hole. Watching Shawn get plowed and eat a hot man hole at the same time is enough to drive one crazy. This little trooper is all about having fun and he's been paired up with two troopers that can help him achieve his mission. Brian Gets Anally Explored ... Once he's eaten Brian's delicious hole, he wants to put his dick deep inside it and Brian is up for the challenge. They bend Brian over the headboard and give Shawn his turn in the saddle. Now this is a big dick for a tight ass like Brian's and he certainly lets us know by the crying moans and trademark grunts that we've all come to associate with Brian when he's being plowed hard by a big dick. Shawn works it in slowly, going deeper and deeper as Brian's tight hole loosens up and gives in to the fuck. Chaz kisses Brian and feeds him his cock while Shawn bangs him from behind. Cum-Eating, Swapping and Kissing ... Brian's tight ass must be really fucking good as Shawn can't help himself and cums while his cock is deep in Brian's hole, filling the condom with a huge, hot load as he pulls it out and shows it off. Chaz wants to do more than just see it, he wants to taste it. He tells Shawn he wants some of that cum so Shawn takes the condom and squeezes out his load right down into Chaz' waiting, hungry mouth. Chaz takes most of the cum and then kisses Brian and Shawn in a threeway tongue fight that shares the reward with everyone. Then, Shawn and Chaz lick the rest of the load off Brian's back and Shawn turns the condom inside out and shares the rest with Chaz. Then they share it with Brian in more hot kisses. That's not all, these three troopers go for more cumshots as Shawn goes for his second of the scene and lands a huge load all over Brian's chest. Chaz follows his lead and Brian is covered in cum once again. At first we didn't think Brian was going to be able to cum, but when Shawn offers to take his load in his mouth, Brian steps up and delivers a forceful cumshot all into Shawn's open mouth, shooting several strong gushes into Shawn's mouth and all over his face. Shawn licks the rest up and dives in for a deep, cum-filled kiss with Brian, swapping his cum with him and then returning to his chest to get the rest.",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Shawn",
      "person_id": 35230
    }
  ],
  "release_date": "2010-02-12",
  "scene_id": 70169,
  "tags": [
    "Gay"
  ],
  "title": "Brian, Chaz & Shawn"
}