{
  "collections": [
    "Active Duty"
  ],
  "description": "David Tells Us Some Secrets And Talks About Some Recent Scandal... Things kick off with me joking around with David about how he used to watch Active Duty when he was still a virgin and very curious. He admits to having dirty thoughts about Cole and the other guys and then we start talking about the recent story that broke about him being in a mainstream military movie that was covered by Leatherneck Magazine. He was literally outed by the gay community and within a matter of days all the gay blogs all over the 'Net had posted the story. We get some really good laughs at the expense of the blogs and then I introduce him to Blake. I tell David I want him to take out all his frustrations on Blake and he agrees that sounds like a great idea. David And Blake Alone On The Bed... They join each other on the bed and they hit it off immediately. I joke that I doubt we'll need a video playing in the background today and David just laughs. They start out kissing and it gets serious. These two are a match made in porn heaven. You can tell they are super hot for each other and it isn't long before the clothes start coming off as they both take off their shirts to reveal their gorgeous young bodies to one another. David is aggressive, but Blake holds his own because he's just as horny for David as David is for him. David can't wait to get Blake's huge cock out of his jeans to play with it and he starts working earnestly toward that goal as Blake keeps him busy with plenty of hot kisses. Once he's got his hands on Blake's huge meat and Blake has latched on to his, you know things are about to get wild. The pants come off to reveal two of the hottest, biggest, thickest and prettiest cocks in all of gay porn. Consummating The Mutual Attraction... Blake goes down and starts kissing and licking David's stomach and works his way right down to that big, hard cock and takes it in his hot mouth as he begins to suck it like he's never sucked a cock before. You'd swear that you are watching these two fall in love right before your eyes. David can't wait to get a taste of Blake's big monster and he goes in for the kill and masters the huge meat as he licks, sucks and swallows it. David tries to see if he can take it all in and he does a damn good job at it. Again we get to witness some good old fashioned ball worship as David gives Blake's big balls a run for their money as he shows them plenty of attention. Exchanging Oral Pleasantries... They go back and forth going down on each other's cocks and balls, giving each other great servicing. They get in a sideways sixty-nine and eventually a traditional sixty-nine as they eat each other's asses and worship each other's cocks. So hot watching these two big-dicked boys really get into one another is something else. It's beautiful. Hands down one of the most beautiful scenes I've shot lately. They embrace in more kissing as they continue to pay plenty of attention to one another. David crawls on top of Blake and puts their cocks together as he leans down to kiss Blake some more. He can't resist though and ends up back down on Blake's big cock with it down his throat. You can already tell where David really wants that big piece of meat the most. I get some great shots from behind David as he sucks Blake's cock and his own cock gushes out a huge stream of pre-cum. From this angle Blake's cock looks like a huge fucking monster -- and it is! David Eats Blake's Ass Before The Fucking... He's been eating that ass all along, but now he's paying special attention to it before he sticks his cock in Blake's tight hole. He works it in slowly as Blake jerks his big dick and David kisses his chest. Isn't long before David is all the way in and he grabs Blake's cock and strokes it for him while he fucks him. He's making love to Blake and these two are on fire for one another. David fucks him good, long and hard as Blake strokes his big, hard cock faster and faster. David Rides Blake's Huge Dick All The Way Home... After he's fucked Blake's ass really good, David crawls on top of Blake's huge cock and takes it for a hard ride. He's got the monster balls deep in his ass and he's pounding his hole with it up and down, taking every last inch of it deep inside him. They roll over and Blake takes control of the situation, slamming his huge cock deep in David's ass as David yells out in pure pleasure. Blake is wasting no time taking advantage of having such a nice ass to fuck as he pounds it good, hard and fast. David is in heaven as this hottie fucks his brains out. David can't stand the heat any longer and shoots a huge load all over himself and waits for Blake to do the same. Won't y'all cum join us at the wedding this Summer?",
  "models": [
    {
      "name": "Blake",
      "person_id": 35040
    },
    {
      "name": "David",
      "person_id": 35073
    }
  ],
  "release_date": "2009-12-15",
  "scene_id": 70163,
  "series": "Double Time 5",
  "tags": [
    "Gay"
  ],
  "title": "Blake & David"
}