{
  "collections": [
    "Active Duty"
  ],
  "description": "Cash Gives In And Expands More Than Just His Horizon ... On the third day of their visit, I decided the time was right when they returned from their regular visit from the gym. They were both sweaty and really pumped up from the workout and needed showers. I thought this would be the perfect time to see if they were ready. Cash decided he would shower first and I told him I wanted to film it because I thought it'd be hot to see his body after a hard workout. Ever the show-off, he agreed. Now let me tell you. I felt like a spy cam peddler in a locker room. Watching this man's beautiful body glisten in the water is like, is like -- well it's damn hot that's what. Enough romanticism, let's just be real. This guy is hot no matter how you capture him. He could be clipping his toenails and there'd still be something sexy about it. You'll love this shower opening and when Kaden makes his appearance you'll love it even more. Kaden Join Cash In The Shower ... Kaden comes in, gives Cash a quick once over and drops his shorts at the edge of the shower and asks Cash if it's OK for him to join him. Cash is happy to have company. The two of them admire each others hard work and enjoy feeling each other up as they get all lathered up. The cocks are hard in no time and just watching these two get so into each other is enough to send me over the edge. I've fainted twice writing this. Luckily Kaden and Cash are stronger than me and they seem to be lasting just fine. They start playing with each others hot cocks and soon the action begins to take another turn. Cash is the first to drop to his knees and begin sucking Kaden's cock. Now let me tell ya, troops, this guy is as hot about sucking a cock as Kaden or me or you for that matter. He simply loves it and it shows in the way he gets into it. Kaden's reaction seals the deal. The real story is between Cash's legs and it's hard as a rock as he strokes it fast and hard as he devours Kaden's dick. Now this is a blowjob and man what a hot one. They Show Each Other Their Oral Qualifications ... They switch up and Kaden goes down on Cash as Cash sits back on the shower bench and gives his knees a rest. His cock is rock hard for Kaden's hot mouth and Kaden is right in there on it. You can tell that Cash loves getting head as much as he's come to love giving it and it's just as hot to watch him get his cock sucked as it is to watch him suck one. What a long way this country boy has come and today he's gonna take things all the way. He's moaning and giving Kaden plenty of sexy sound bites as Kaden rocks his world with his own rendition of the perfect hummer. Just watching these two interact alone with one another and seeing how hot they obviously are for each other threw me into a jerk-off coma. That was three days ago. Meanwhile Cash reaches around and grabs Kaden's hard cock to stroke it while Kaden keeps the pace on Cash's cock. This is really hot. Cash wants to make sure his partner is having as much fun as he is. Out Of The Water And Into The Wetness ... They ditch the shower and Kaden rests on the ledge of the tub to get his return favor. Cash is back at it like a pro in heat and it won't be long before Kaden says So, you never been fucked before huh? Cash grins and says, Nah. Kaden responds with, I think today's your day and Cash says, Let's do it. And they do! Man do they. Kaden starts out by playing with Cash's ass, spreading his cheeks and hole open, giving us a great few as he sticks a few fingers in to loosen him up. Kaden lubes him up really good and just goes for it. Cash naturally grunts a little and yells, God damn it, God, God damn it a few times but it aint long before that cock is deep in his virgin ass and he goes to moaning. It's obvious when it starts feeling good because you see his hand go down to his cock and to play with himself. Cash Has Been Conquered, But Kaden Still Needs Taming ... And from there, troops, we see how wars are won. We see how a reluctant young country boy can discover just how much he likes a cock up his ass. Funny how that works, huh? Kaden gets deep inside Cash's ass and fucks him hard and fast. Cash takes it like the solid man he is and enjoys himself just plenty I'm sure. I get plenty of good shots of Kaden's cock going deep into Cash and fucking him long and hard. Cash learns the value of arching that back and the great feeling that can come along with it. He might be conquered in one way, but in another way he's now wide open for the future. Things will never be the same. Things take a turn and Cash gets to fuck Kaden's ass. This is such a hot position they take as Kaden sits on Cash's cock as Cash leans back on the ledge of the tub. Kaden's hard cock is bouncing up and down as he goes up and down on Cash's hard dick. Watching from this angle might be dangerous to your self control so be warned. Cash does this interesting thing where he reaches around and strokes the very bottom of the shaft of his cock and balls while he pounds in and out of Kaden's hole. You can tell by his nuts that his dick is having fun as they draw closer and closer into him. Kaden's cock is rock hard and something tells me that for him, Cash's cock might be the perfect fit. It's clear how much he's enjoying the fuck as he only has to stroke his cock every so often to keep it raging hard. He rides Cash hard and fast, working his cock harder with each thrust, slapping it on his lower abs until he works himself up to a really explosive orgasm. He shoots a huge load...it's a ten roper, troops and you can imagine how good it feels. Cash then tells Kaden to let him cum on his ass and Kaden bends over and arches his back for Cash to blow his nut all over. What we don't get to see on video is when Cash popped his first load in the condom while he was fucking Kaden and we call him out on it in the closings. The First Kiss Is The Deepest ... The next thing that blew my mind was the hot ending kiss. I said I thought such a good job deserves a kiss and at first Cash said, Maybe later. as he waved me away. Kaden eases him into it and steals not one, but two kisses from Cash. Are ya'll still with me? Good. Now go watch this scene again.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Cash",
      "person_id": 35024
    }
  ],
  "release_date": "2009-12-02",
  "scene_id": 70160,
  "tags": [
    "First Time",
    "Gay",
    "Muscular"
  ],
  "title": "Cash & Kaden"
}