{
  "collections": [
    "Active Duty"
  ],
  "description": "Joey's Back For Another Adventure And He's Brought His Buddy Abel With Him ... And I've brought a trusty veteran, DJ, with me so the playing field is evenJoey has been doing some practicing on the side, working a few fingers up his ass for about a week now, getting ready for what's going to happen today. There's something so fucking hot about Joey and I personally can't get enough of him. He's that sexy little devil you see walking down the street in your neighborhood that you just want to walk up to and strike up a conversation with. He comes off as very unapproachable at first glance and you're scared to death to make the first move. You'd never guess that a little coaxing and negotiating would get him naked with a hard cock in his hand. Once the ice is broken and the clothes are comfortably on the floor, he's more than willing to make your many fantasies about him come true.And Gung Ho 2 is all about making those fantasies a reality as Joey really takes things to the next level, sucking cock like a pro and taking it up the ass like he was born for the role. You never know what secrets hide behind those first tough impressions but Joey is a good example of how you can't judge a book by its cover. Once he gets DJ's cock in his mouth you'll swear this isn't his first rodeo as he seems to be quite good at worshipping a nice cock, giving it plenty of attention as he explores every last inch of it with his mouth and tongue.And his buddy Abel isn't shy at all, he's down to have some fun and he jumps right in there, stroking DJ and eventually moving up to let DJ suck his cock while Joey sucks DJ's. He doesn't stop there, he takes it to the next level and sucks DJ's cock in return. This guy is on fire and he's not going to let this opportunity pass him by. You'd swear he's done this before judging by how good he is at the task at hand. Watching him and his best buddy suck a cock together is just pure heaven. They go to town together on DJ's massive cock, licking and sucking the shaft and really working it good. They take turns really going at it as DJ throws his head back and moans in pleasure. Two straight buddies sucking your cock together will usually have that effect.What Happens Next Is What We've All Been Waiting For ... As Abel and Joey suck DJ's cock it's decided that the time has come for Joey to go the next step. He says he's stoked as he throws his legs in the air doing what Major Wood calls the dying sparrow as DJ slowly slides his huge hard cock deep into Joey's virgin ass.It isn't anywhere near the work one would think as Joey says he has a very high tolerance for pain. With a cock as big as DJ's up your ass for your first cock you better have plenty of tolerance. That cock is no joke. Once it's in, things go smooth as DJ really fucks the hell out of the virgin ass. It won't be long before DJ is long stroking the virgin hole with his 9 inches of pleasure and it won't be long before Joey is talking shit to his top man and telling him to fuck his ass harder.Joey talking to DJ makes it even fucking hotter as he asks DJ if he likes that ass. Abel strokes his cock as he watches his buddy's anal cherry get popped. It makes him so fucking horny that he can't hold back anymore and blows his huge load all over Joey's chest. DJ follows his lead as the tight ass grips his cock and eventually coaxes out a huge load from him that lands all over Joey's chest. Joey is covered in cum. He says after all that he needs a dip and reaches for his can of Skoal and puts in a dip. This hardcore soldier is just that now -- hardcore!I talk to them after it all and ask Abel how it was to watch his friend get fucked and he says it was kinda funny at first but then it was pretty cool experience. The first time Joey came to the hotel I joked with him about having secrets. He swore he had none, but my intuition was telling me different. Luckily I was left with enough time on the trip to help him discover some of those secrets I thought he had. The scene with Brian and Joey was just the beginning of Joey's adventures and by the time I left he'd come full circle and DJ agrees.",
  "models": [
    {
      "name": "Abel",
      "person_id": 35198
    },
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Joey",
      "person_id": 35197
    }
  ],
  "release_date": "2010-01-10",
  "scene_id": 70165,
  "series": "Gung Ho 2",
  "tags": [
    "Gay"
  ],
  "title": "Abel, DJ, Joey"
}