{
  "collections": [
    "Active Duty"
  ],
  "description": "Dorian Does Dallas... <br />After we introduced Dallas in the War Chest, the emails started pouring in about this hot, slightly older, more mature guy. Seems he struck many of you as being just as hot as he actually is. I'm personally crazy about him myself so I can see what all the hoopla is about surrounding this guy. He's stunning, smooth, dark and handsome as all hell. As I said in the letter last week, it took some work to get Dallas to this point, but once I did it was all good from there. Once he decided he was going to try bottoming for another guy in a video he was dedicated to making it work. He went out and purchased a practice dildo and got in a lot of practice. It wouldn't be long before the call came saying he thought he was ready. And was he ever. I knew teaming Dallas up with Dorian would be one hell of a hot scene and I was right. These two slightly older studs jumped head first into one of the hottest deflowering scenes I've shot in some time. <br />Things kick off as usual with me talking shit and getting them warmed up. Dorian doesn't seem to need any warming up though, he's obviously ready to take on the task at hand with great enthusiasm and as soon as I leave the two of them alone, we see that enthusiasm come to life and manifest itself in some really hot foreplay. Once I turn Dorian loose on Dallas it's like white on rice. He's all over him. <br /><br />Alone At Last... <br />Once I'm gone to bake a pie, these two get right down to the business at hand. Dallas is really impressed with Dorian's tats and checks out his hot body as he checks out the tats. Dorian breaks the ice and moves in to start rubbing all over Dallas' smooth, nicely built chest as he rubs all over his sexy body. Dorian starts out kissing Dallas' chest then pulls him into him and plants a hot kiss right on his lips. This sparks Dallas to begin licking and rubbing Dorian's body as they pull out their hard cocks. Dallas mentions his huge balls and Dorian says he's already heard about them and looks forward to seeing them. In my mind I look forward to seeing Dorian lick, suck and worship those huge danglers. Dallas throws his leg over Dorian's and starts rubbing Dorian's thick, hard cock as Dorian keeps rubbing Dallas all over. He goes in for another kiss to seal the deal and then down to play with Dallas' hard cock. They jerk each other for a couple of minutes as they admire each other's cocks. <br /><br />Dallas And Dorian Suck Cock... <br />Dallas goes right in for the target and takes Dorian's long, thick cock down his throat as he gets a taste of the goods. Dorian is liking the attention and is convinced this isn't Dallas' first time. They switch up a few times and get orally acquainted with each other's guns. You can just tell this was the right pairing. Dorian goes down on Dallas and worships his cock really good. I get some good shots of his ass while he sucks Dallas and Dallas jerks Dorian's cock. Dorian goes back to feeding Dallas his thick hard cock again and with each time down there, Dallas seems to get more and more into it. You can tell he doesn't mind this duty at all as he masters the cock and shows what a hot cocksucker he can be. Dallas' cock is rock hard as he sucks Dorian and Dorian grabs on and jerks it. <br /><br />Dorian Worships Dallas' Huge Nuts... <br />I encourage Dorian to give Dallas' huge nuts some extra special attention and he gets right in there and does just that as Dallas squeezes them together for him. Dorian is really getting into this and Dallas is loving it. A set of nuts like that should never go unworshipped and Dorian is making sure they don't. You can hear Dorian breathing hard as he really gets into servicing those huge nuts. Really hot to watch all that muscle submit to being so submissive. Dallas does a little dirty talk and Dorian stays with it. <br /><br />Dorian Face Fucks Dallas... <br />Once he's worshipped those huge, nice nuts, Dorian encourages Dallas to really get down on his cock and as he does, Dorian face fucks Dallas and it's really hot to watch as Dallas takes on the role of the submissive one. He's really getting into the face fucking and Dorian is feeding him that massive cock good as he grabs the back of his head and feeds the big meat to Dallas. Dallas does some ball washing of his own on Dorian's nuts and really gets into working those balls good. All the while Dorian is jerking Dallas' cock. <br /><br />Dallas Teases Dorian's Cock WIth His Hot Virgin Ass... <br />This was really hot to film as Dallas hops on top of Dorian and puts that big meat right in the crack of his ass and slides his ass up and down on that hard cock, teasing the hell out of Dorian's dick as he shows him what he's about to get. Dallas seems to enjoy the teasing and Dorian does too. But it won't be long now until it's time to tame that virgin hole. <br /><br />Dorian Eats Out Dallas' Sweet Hole... <br />Dorian gets down behind Dallas and spreads his cheeks open as he buries his tongue deep in that virgin ass, licking, sucking and eating that hole, getting it ready for the fuck. Dallas is in heaven and he's letting Dorian know how good it feels. He starts talking dirty a little bit more as he tells Dorian to eat that fucking ass and tongue fuck him. Dorian does just that and Dallas seems to really like this. He's telling Dorian to shove his tongue in his ass and Dorian is doing as he's told. <br /><br />Dorian Fucks Dallas' Virgin Ass Good... <br />After the hot ass eating, licking and sucking, Dallas is all warmed up and ready to go and Dorian wastes no time taking advantage of the moment. He moves in behind Dallas and slowly starts working that huge hard cock deep into that tight virgin ass and it's on. Dallas proves to be one hell of a bottom. He says he has a high threshold for pain and he isn't joking. He takes one hell of a hot fucking from Dorian who is slamming in and out of his fast and hard in no time at all. Once he's got that ass loosened up good, Dallas starts really liking it and talking shit to Dorian, telling him to fuck it harder. Dallas throws his ass off the edge of the bed and I get underneath to get some really hot footage of Dorian's huge cock plowing in and out of that tight fuck hole. Dorian puts Dallas on his side and goes in once more as he holds Dallas' leg in the air and plows his ass hard. Dallas is taking the fucking he's being dealt really good.<br /><br />Let The Loads Fly... <br />Dorian decides he wants his cock back in Dallas' hot mouth to work his huge load out and Dallas is all game. He tells Dallas to suck that hard cock until it comes all over him and Dallas obeys his orders as he jerks his own hard cock fast and hard. Dorian pulls his cock out of Dallas' mouth and lands his load all over his chest. This sparks Dallas to blow his own load and he lands a thick, creamy load all over his stomach.",
  "models": [
    {
      "name": "Dallas",
      "person_id": 35070
    },
    {
      "name": "Dorian",
      "person_id": 35017
    }
  ],
  "release_date": "2009-12-15",
  "scene_id": 70161,
  "series": "Double Time 5",
  "tags": [
    "Gay"
  ],
  "title": "Dallas & Dorian"
}