{
  "collections": [
    "Active Duty"
  ],
  "description": "Blake and Austin Together at Last ... Blake is back and he's got that sexy blonde, blue-eyed Marine Austin with him and what a hot fucking duo these two make. These two go together like butter and a baked potato. They complement each other so well and the chemistry is intense as they enjoy each other thoroughly, resulting in one hell of a voyeuristic experience for all of us. Both guys are sporting tall, lean, sexy bodies and huge, hard cocks that stay rock hard from start to end. They go from slowly worshipping each other's hard cocks to passionately licking and eating each other's beautiful holes. Watching is almost torture as we get to see it in slow-burn mode, building us up, up, up until we can hardly stand it anymore. And finally, Austin bends over, giving Blake complete open access to his beautiful pink Marine hole and Blake slowly slides his monster cock balls deep inside of Austin's tight ass. Austin is in heaven. All the build-up has made him so horny he can barely handle the intensity. Blake pounds his ass in doggy position for a while then turns him over on his back and bangs his brains out as Austin strokes his hard cock, enjoying the fucking. Once he's had his ass pounded, it's time for the tables to turn and he bends Blake over the arm of the couch and returns the favor. He's fucking Blake hard and fast and Blake's moans and groans are telling the story -- he's getting as good a fucking as he gave. Things end with them jerking their loads out all over themselves and then Austin rakes his hand through his huge load and eats a finger full and then runs his hand through Blake's load and eats it too. A hot kiss seals the deal.",
  "models": [
    {
      "name": "Austin",
      "person_id": 35036
    },
    {
      "name": "Blake",
      "person_id": 35040
    }
  ],
  "release_date": "2010-01-18",
  "scene_id": 70167,
  "series": "Double Time 6",
  "tags": [
    "Duo",
    "Gay"
  ],
  "title": "Austin & Blake"
}