{
  "collections": [
    "Active Duty"
  ],
  "description": "Brian Helps Joey Through His First Phase Of Training ... <br />Sometimes all you need is a seasoned veteran to help you complete the mission and bring the new recruit to a comfortable, confident place where in the heat of the moment he charges forward and conquers the task head-on.. I called in the reinforcements and brought in Brian to help me out. Brian was the first to cross my mind when I thought of the perfect partner and I knew he'd be a great match for Joey. These two inked up studs had a lot in common and I knew if I could just get Joey away from his buddies and in the company of Brian, I'd have a better chance of getting him to cross that line. As luck would have it, I was right. <br /><br />The first scene in Gung Ho 2 is a really hot scene of Brian & Joey where things took a turn midway through and Joey ended up slowly giving in to much more than we had originally planned. What was supposed to be a simple double jack-off session turned out to be Joey's first time touching another guys cock and getting his dick sucked by another guy. <br /><br />Thanks to Brian's slow, patient coaxing and the comfort level their chit-chat created, Joey gave in and said what the hell. Brian quickly moved in and took the opportunity presented and made the most of it. It takes some time but midway through the scene the plan suddenly unfolds and Brian has Joey's cock in his mouth. Joey takes quickly to the new experience and offers to help Brian by jerking his cock as these two go on a journey together that ends with Brian blowing his massive load all over Joey and Joey returning the favor. By the time it's over, Joey declares that the blowjob he just got ranked in the top two of his life. Makes you wonder who was number two. I say that because you can tell by his reaction that Brian is giving him damn near the best blowjob anyone could ask for. Brian lets loose in this scene and gives one of the best oral performances I think I've seen from him. <br /><br />I've said it before but I'll say it once more, watching Brian make love to a cock is like watching an artist create a masterpiece. It's beautiful. Brian really gets into it and makes an art out of sucking cock. And watching Joey's reaction to the lip service he's getting is priceless. <br /><br />The Banter Is Priceless ... <br />Things kick off with me talking to Joey about coming to see me without his buddies. In the first two minutes of the video he says he is positive that he will not do anything with another guy. He says nothing could change his mind. He says he'll do some one-handed skiing but that's about the extent of it. Brian joins him on the bed and the banter starts immediately. <br /><br />Brian has overheard the conversation and gets right in there talking to Joey about how he started out not being willing. He explains his journey in man/man sex to Joey and Joey listens intently. You can tell that Joey is nervous, but he hasn't run out the door yet. They continue the chit-chat as they stroke their hard cocks. <br /><br />Brian's eyes are glued on the prize as Joey strokes his hard meat. He asks Joey if he needs a helping hand and Joey takes him up on the offer and offers his hand to Brian. Brian keeps talking a mile a minute, trying to convince Joey to let him suck his cock. It doesn't take long as Joey has gotten very comfortable and very horny. Brian jumps right in and from there we watch magic happen. Joey gets right into it and starts to really enjoy what's happening. He's totally forgotten about the porn playing and is paying all his attention to the attention Brian is paying to his cock. <br /><br />It isn't long before Joey is telling his cocksucker how to treat his meat and Brian is following orders. Joey is such a hot little daddy that it would be hard not to take orders from him. He wants to jerk Brian's cock while Brian sucks his so they reposition to give Joey access. <br /><br />The Moment Where I Lost My Mind ... <br />Joey straddles Brian to fuck his face and this leaves Brian's cock slapping against Joey's hot little hairy ass as Joey keeps stroking Brian's dick. This had me wanting to get that furry little butt fuck but that would have to wait until the next scene. They blow their loads all over each other for the finale and I think we've got ourselves a new star! ",
  "models": [
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Joey",
      "person_id": 35197
    }
  ],
  "release_date": "2010-01-10",
  "scene_id": 70164,
  "series": "Gung Ho 2",
  "tags": [
    "Gay"
  ],
  "title": "Brian & Joey"
}