{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden Helps In Shawn's AD Training ... <br />I've been teasing you guys with bits and pieces about a brand new hot guy. Shawn is 5' 7 and when he first came to San Diego to visit as I introduced him to my friend Beau (who was smitten from hello) he said to Beau, I'm fun-size. And fun is right. If you guys know anything about me you know that I like them on the smaller side. (Body wise at least.) There's one place that small doesn't apply to this hottie and that's the huge cock he's packing and I would certainly apply his description to that: fun-size! <br /><br />So, I knew I had to get Shawn hooked up with a guy that could help show him the ropes here at AD. Who knows the ropes and how the chain-of-command works around here better than our very own Kaden? Kaden is a prime example of starting out slow and moving forward fast and I knew he'd be a great first partner for Shawn. I could not have been more right. These two make a beautiful pair and complement each other so well. <br /><br />This is the scene that kicks off the DVD and it's sure to give you more than your money's worth as I'm certain you won't get past it without losing your pearls. Just the overload of pure, natural beauty that these two bring together is enough to send you over the edge. <br /><br />Cocksucking ... <br />Things kick off and move pretty fast as these two are rock hard from the very beginning and get right down to business with some mutual rubbing, touching, squeezing and hot kissing. Shawn seems to really enjoy exploring Kaden's near-perfect body and Kaden seems to enjoy playing with Shawn's enormous hard cock as things move forward and the boxers come off. You can tell that these two are really into each other. Shawn is the first to go down for a taste of Kaden's beautiful hard cock as he gives it some great oral attention. They swap head back and forth as they stroke themselves while the other services their cock. <br /><br />Ass eating ... <br />Kaden finally bends Shawn over and starts eating that beautiful, perfect little ass and sucking his cock from behind, getting Shawn well prepared for the fucking that's about to come his way. Kaden takes his sweet time, enjoying the pretty butt and licking every inch of it as Shawn's O face tells the story. He's loving this attention. Shawn is jerking his hard cock fast and furiously as Kaden fingers his hole and lubes it up for the fuck. <br /><br />Fucking ... <br />By this point you can tell the anticipation is driving Shawn crazy. Kaden goes and teases his ass really good and then slowly slides it in, giving Shawn what he's been waiting for. Kaden is such a versatile guy and can give a cock as good as he can take one. You can tell he was horny for Shawn's sweet little ass as he fucks the hell out of it as Shawn jerks himself off. They switch positions and Shawn goes onto his back as Kaden gets on top and delivers his cock deeper and deeper into Shawn's ass. I get some really good shots from behind that show just how deep Kaden is going. Shawn reaches around and pulls Kaden by the thigh, slamming him into him harder and faster. <br /><br />They switch up and Kaden throws his sweet ass in the air, giving Shawn the access he needs to tongue it good before plowing his huge hard cock deep into that sweet spot. Shawn gives it as good as he got and really puts a fucking on Kaden's hot ass. Once he puts him on his back, Kaden strokes himself hard and fast as Shawn keeps him full of cock and Kaden works himself into a frenzy, blowing a huge load of hot cum all over himself. Shawn follows soon after and lands his load all over Kaden's stomach and Kaden takes his fingers and plays in it. They end out a hot scene with a sweet kiss and it's a wrap.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Shawn",
      "person_id": 35230
    }
  ],
  "release_date": "2010-01-18",
  "scene_id": 70166,
  "series": "Double Time 6",
  "tags": [
    "Gay"
  ],
  "title": "Kaden & Shawn"
}