{
  "collections": [
    "Active Duty"
  ],
  "description": "Kasey And Shawn Get All Lathered Up And Shower Down ... Dorian has been around here with us at Active Duty for about a year and half now and he's done his fair share of really outstanding performances in front of the camera so I decided to see what he could do behind the camera and I gotta tell ya, I was really pleased. He's a chip right off the old Dink Flamingo block as he mans the camera and wrangles Kasey and Shawn into one hell of an awesome scene. Dorian catches Shawn in the shower and Shawn tells Dorian to quit stalking him. He's brought Kasey along to help Shawn get all the tough spots clean and Kasey is more than up for the task. They shower down really good as they lather each others backs and asses. I've always loved watching two hot guys in the shower. It brings to life so many fantasies I had back in high school in the gym locker room. This was my idea of taking a shower and Dorian does a fine job of bringing those fantasies to life as we watch these two get clean as whistles. The Kissing And Sucking Is Wetter Than The Water ... The kissing starts out almost instantly and these two steam things up with some really delicious kisses as they rub each others cocks and stroke up hard ons. It isn't long before Shawn is on the shower floor servicing Kasey's hard cock as Kasey enjoys the hot water and Shawn's hot mouth wrapped tightly around his cock. Shawn isn't just playing with Kasey's hard cock, he's stroking his own massive meat as well. It's apparent by the hard cock that Shawn is sporting that he truly loves sucking a nice dick and Kasey is more than willing to return the favor. Kasey takes his turn on the shower floor and works on Shawn's huge cock like a pro. Shawn's 'O' faces tell the story as always and the story says he likes it. Cleaning And Servicing The Nice Asses ... When they switch up again, this time Shawn is back on his knees behind Kasey eating his hot hole and giving it a good tongue cleaning as he licks and sucks and fingers it really good. Dorian is right in there getting all the blow by blow as these two have some amazing fun together. What a hot couple they make. Once he's cleaned his hole really good, Shawn turns Kasey back around to give him some more front end service. He's stroking his own hard cock again as he does it and you can just feel the heat in the room, steaming the paint off the walls. Shawn Feeds Kasey's Face More Of His Hard Cock ... Shawn moves up and sits on the shelf between the shower and tub and lets Kasey go on a feeding frenzy. And man does he ever. He's on that cock like white on rice and loving every inch of it as deep in his mouth as he can get it. These two are a perfect match as they seem to consummate their deep, primal desires for one another. Shawn's huge cock and balls just love all the attention as they stand at full attention for Kasey's hungry mouth. Kasey done got ahold of something he likes and Shawn is giving him plenty of time to enjoy it as he enjoys it too. He's fucking Kasey's face hard and fast as Kasey strokes his own cock. Shawn is really into this hot blowjob as he throws his head back in damn near ecstasy. Kasey then throws Shawn's legs back and goes to town munching on his hot little hole as Shawn keeps stroking his cock. Shawn Gives In To Kasey's Tongue And Takes His Cock Up His Ass ... After Kasey has tongued his nice, sweet hole, Shawn wants to get it fucked and Kasey is up to do the honors. Kasey moves in and slides his cock deep in Shawn's hot little hole and long strokes him good as he's bent over the tub. Shawn is stroking his cock from beneath as Kasey pounds him from above. Dorian is doing an amazing job of catching all the action. I'm impressed. He fucks him in several positions even with Shawn riding his cock. He pounds him hard and for a very long time. Kasey Takes All Of Shawn's Big Hard Cock Deep Inside ... Once he's fucked Shawn's brains nearly out, Kasey bends over to take his turn with Shawn's bat. Shawn is fucking him fast and furious and Kasey is stroking his own hard cock just as fast and enjoying the hell out of the pounding. He's working that cock in and out of that hole like a jackhammer and Kasey isn't far from going off the deep end. He blows his load all over the place while Shawn is pounding his hole deep. His cock stays hard after he blows his load and Shawn ain't far behind. He pulls out and blows a huge fucking load all over Kasey's back and ass. What a fucking intense scene. The hop in the shower to clean off the manjuice and it's a wrap! One last kiss seals the deal.",
  "models": [
    {
      "name": "Kasey",
      "person_id": 35026
    }
  ],
  "release_date": "2010-03-14",
  "scene_id": 70172,
  "series": "Double Time 7",
  "tags": [
    "Gay"
  ],
  "title": "Kasey & Shawn"
}