{
  "collections": [
    "Active Duty"
  ],
  "description": "Horseplay In The Pool ... <br />Things kick off with the boys horsing around in the pool, playing chicken. Nash is a beauty and holds his own against the fine looks of the other three. Cash is that hot ass beauty that you always wished would come to your pool parties and lose his bathing suit. But it's the newbie Nash that's the first to lose his shorts and show off his pretty ass as he does a backflip off the waterfall. From there the rest follow his lead and do naked acrobatics from the waterfall as we get to watch them peel off their shorts and throw caution to the wind.<br /><br />In The Pool House ... <br />Nash is the first to disappear into the pool house but not before he shows off for the camera a little. Cash follows right behind him but he's only there to get a beer. I get a chance to talk one on one with Nash and he reveals some of his secrets. He goes so far as to tell us who his favorite guy is in the pool. Nash is one beautiful man with a pair of furry legs and a pretty furry butt that will get you all riled up. I leave him alone for a few minutes to recruit Kasey to come back and help me with Nash. While I'm gone, Nash stands there and gets a hard cock without even touching himself.<br /><br />Kasey Comes To The Rescue ... <br />Kasey, Nash and DJ all file into the pool house to join Nash and I get some great shots of all the hot eye candy. Kasey is the first to lay on the bed and jerk his hard hot cock to temp Nash. Nash bites the bait and is on the bed next to Kasey in no time at all sucking that cock like there's no tomorrow. Meanwhile DJ finds himself a seat to spectate and Cash finds his way between DJ's legs and latches on to that big monster. Now if anyone ever loved sucking a cock it's Cash I don't care what you say. When you see him get his hands around a big one you see a change in his eyes and an eagerness that can only come from a cocksucker with a big dick in his mouth.<br /><br />Watching Cash Suck Big Cock ... <br />It's amazing to watch this hottie as he worships a big dick and strokes his own. You can just imagine him in some roadside gloryhole servicing all the truckers that come through and doing it with pleasure. There's a secret side to Cash that I think we'd all like to know more about. I think DJ is getting a taste of what that secret side is. He literally makes love to a cock when he sucks it and it's so fucking hot to watch. His slow, deliberate attention tells a story all on its own.<br /><br />Wondering If Nash Might Have Some Secrets ... <br />Kasey says this doesn't seem like Nash's first time at bat. He's pretty sure Nash has some secrets of his own and watching him work Kasey's cock over might make you think the same thing. By now these two are in a sideways sixty-nine positon and things are looking hotter than ever. They're getting into it, pumping their cocks in each others mouths as DJ sits back and watches it all from his front row seat and gets one of the best blow jobs of his life.<br /><br />Mixing It Up With All Four On The Bed ... <br />DJ and Cash move over to the be to join Kasey and Nash; and Nash gets his mouth wrapped around DJ's huge meat in no time flat. He's deep throating that huge cock like it's no problem at all. And the secrets start to emerge even more. Meanwhile DJ and Kasey are sharing Cash's cock and all seems glorious. DJ can't believe how well Nash is handling his meat and he can't take his eyes off of him as he works it over like a champ. Meanwhile Cash is laying back, raging hard and enjoying the attention and enjoying watching Nash suck DJ's cock. DJ and Kasey go for a hot kiss in between sharing the cock in front of them. Things switch up and Kasey goes for DJ's meat while Nash puts his skills to good use on Cash's cock. Soon they switch positions and Cash is going down on Nash. DJ moves over and takes over on Nash's cock while Kasey and Cash get ready to get Cash's ass fucked. Cash is worshipping Kasey's hard cock, getting it nice and wet for his hot hole. Once again we see that passionate cocksucker emerge from Cash as he handles Kasey's cock with tender care. DJ is now eating Nash's ass as Kasey sucks Cash and Cash watches all the fun. Kasey bends Cash over and starts fingering his hot ass side-by-side with Nash as DJ fingers Nash's hole. These two asses are about ripe for the fucking and Kasey and DJ move in to do the deed. <br /><br />Fucking Nash And Cash ... <br />Nash hops on top of DJ's big meat and takes it for a ride as he stuffs it deeper and deeper in his hungry ass. Meanwhile Kasey has Cash bent over the bed and is ready to go in deep. By now Nash is literally bouncing up and down on DJ's cock while Kasey slowly pushes his deep in Cash's ass. Once he's in, it's no holds barred as he long strokes Cash's ass, showing us that cock go in and out and in and out of Cash's hot hole. Cash is a trooper and he's taking it like a man while Nash does the same with DJ's dick. The goosebumps on Cash's ass and thighs tells a story and I think we all know what that is. Cash is liking this dick as it rails his ass deep. Cash is starting to get into it now as he moans 'oh yeah' and Nash continues to bounce up and down on DJ. <br /><br />They all switch up and Kasey takes the reins on Nash's freshly fucked hole while DJ takes control of Cash's ass. Kasey is banging Nash deep and fast as Nash jerks his own cock frantically. You can tell Nash is wanting badly to cum from the thrusting. Meanwhile DJ saddles up and moves in for Cash's ass while Nash and Kasey are miles ahead. DJ slowly shoves his big dick deep in Cash and Cash grunts in pleasure. Nash is working his own mojo while Kasey gives him the pleasure he needs to make it happen. By now DJ is deep in Cash's ass and these two bottoms are getting a good work out. Kasey is long stroking Nash's ass as Nash beats his dick like it owes him money. <br /><br />Let The Cum Fly ... <br />Nash is the first to shoot his wad as Kasey pounds him deep. He lands a huge load all over his stomach while Kasey pounds him hard. Kasey follows quickly and delivers a gushing load all over Nash's stomach while Nash eggs him on. DJ follows with a nice thick load on Cash's back. It's a wrap, troops.",
  "models": [
    {
      "name": "Cash",
      "person_id": 35024
    },
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Nash",
      "person_id": 35027
    }
  ],
  "release_date": "2010-05-20",
  "scene_id": 70174,
  "series": "Alpha Tango 3",
  "tags": [
    "Gay"
  ],
  "title": "Cash, DJ, Kasey & Nash"
}