{
  "collections": [
    "Active Duty"
  ],
  "description": "Further Training For Jameson ... <br />Jameson's continuation in basic training here at Active Duty is one long awaited. I got so many e-mails about this hunk and I agree with all of them. He's one fine devil dog. I was immediately taken with him myself and knew that I couldn't let this one slip through the cracks, I had to get him across the line as quickly as possible. I called in Conrad to help me on this one. I thought the two of them complimented each other so well. Both have those adorable baby faces and their bodies are very similar. I just had a hunch that they'd get along well. <br /><br />Jameson Gets More Than He Bargained For ... <br />So, I was able to talk Jameson into doing a side-by-side jack-off session and getting his cock sucked and jerking Conrad's cock. He was all down for that, but it was Conrad who took things to the next level and got Jameson comfortable enough to do even more. We set this scene up with a little fantasy in the beginning that I think you'll enjoy, but Conrad soon ditches the script and takes things in a whole new direction and lucky for us, Jameson follows his lead and what ends up happening was much more than either I or Jameson expected. These two got very well acquainted and Jameson came out of it ready for more. Just what the doctor ordered. <br /><br />All Lathered Up With No Date ... <br />Things kick off with Jameson returning from a long run, he's sweaty and needs to use the shower, but Conrad is in the bathroom shaving. He tells Conrad to hurry he has a date tonight with some chick he's met on the Internet. When Conrad continues to take his sweet ol' time, Jameson jumps in the shower and they shoot the shit and Conrad sneaks a few peeks at Jameson's jewels as he showers. Conrad uses the excuse of needing to trim his pubes a little more and joins Jameson in the shower for a bit. He tells Jameson that since he doesn't have a date lined up that he's gonna go rub one out. <br /><br />Rubbing One Out ... <br />Conrad is on the bed stroking his huge cock when Jameson comes into the room and says his date canceled. Jameson sits on the bed next to him. They start shooting the shit and Conrad asks Jameson if he's ever jacked off with another guy. Jameson lies at first and says no. But once he gets on the bed with Conrad he confesses to the circle jerk he did with his buddies the first day I met him and another double jerk-off he did with his buddy Riley for me. They're both stroking and Conrad starts in with the questions. Conrad wants to know if Jameson has ever had a guy suck his cock and confesses to Jameson that he has. Jameson says no, but he's down to give it a try. He asks Conrad how many times he's done it and they go back and forth breaking the ice. <br /><br />Surprise Attack ... <br />Conrad slowly moves in for his planned attack and starts rubbing on Jameson's leg. He grabs on to Jameson's rock hard cock and starts stroking it. Jameson surprisingly reaches over right away and grabs Conrad's cock too. They stroke each other for a bit and Conrad finally moves in and takes Jameson's nice cock in his mouth. Jameson's balls are tight and his cock is raging hard as Conrad takes it in his mouth and shows him how it feels to get his cock sucked by a guy. Jameson throws his head back and a look of satisfaction covers his face as Conrad sucks him nice and slow. Before long, he's so into it that he's guiding Conrad's head with his hand. <br /><br />I'll Do You If You Do Me ... <br />Conrad comes off Jameson's cock and looks at him and chuckles a little and says, 'You need to return the favor, bro.' I thought I would fall in the floor. Conrad wasn't playing, he wanted Jameson to suck his cock in return. And why not? Only fair right? You can see Jameson's mind going a hundred miles an hour as he cuts a few glances over at Conrad's hard cock. Conrad is telling him it's no big deal. He tells Jameson that he'll suck him some more if Jameson will return the favor afterwards. And Jameson goes for it. Watching this hunky Marine throw all caution to the wind and take a cock in his mouth for the first time is something else to watch. You'll be drooling by the time these two lay side by side and blow their loads.",
  "models": [
    {
      "name": "Conrad",
      "person_id": 35066
    },
    {
      "name": "Jameson",
      "person_id": 35094
    }
  ],
  "release_date": "2010-05-20",
  "scene_id": 70175,
  "series": "Alpha Tango 3",
  "tags": [
    "Gay"
  ],
  "title": "Conrad & Jameson"
}