{
  "collections": [
    "Active Duty"
  ],
  "description": "Dorian, Abel And Joey Get Quickly Acquainted ... <br />We all witnessed the hot threeway with buddies Abel and Joey when they teamed up with DJ in Gung Ho 2 for some hot fun. However, in that scene Abel and Joey wouldn't dare think of sucking each other and Abel certainly wasn't willing to throw his legs in the air and take it like Joey did when DJ pounded his virgin ass. Abel was there and willing, but only to go so far. In this scene with Dorian they decide to take things a little further. The way this unfolds was not really planned, it just kind of unfolded and Katie bar the door. Things are about to take a turn toward Hotsville and Dorian is there with me to drive the caravan straight up these guys alley -- literally! <br /><br />Dorian's In Charge ... <br />I hand the reigns to Dorian so he can guide these two newbies further across the line. Dorian makes a good man to have in charge. Dorian says he has no mercy and by the time it's over I think we'll all be in agreement with that. The clothes start coming off quickly and in no time flat they're all naked and Dorian and Abel are the first ones hard. Since Joey isn't hard yet we decide he'll be the first one to suck a cock and watching Abel watch him suck on Dorian's cock is hot just in itself. Joey goes down while Abel watches and strokes. <br /><br />A Friendship Suddenly Gets Deeper ... <br />Joey moves over from Dorian's cock and goes down on his buddy Abel and this is really something else. As Joey handles his hard cock, Dorian goes in for a kiss with Abel. Dorian eventually moves up and positions his cock in front of Abel's face and Abel latches on and gives him some of the same attention his buddy Joey is giving his cock. We've got a threeway suck-a-thon happening right before our eyes as these three troopers show us how it's done. Abel takes great care in the attention he's paying to Dorian's hard cock and you'll wanna faint if you're like me. In the middle of it all, things switch up and Abel goes down on Joey and returns the favor to his buddy. He gives Joey's cock the same undivided attention he gave to Dorian's cock and Dorian enjoys Joey's hot mouth some more as he watches Abel suck his buddies dick. Abel jerks his own hard cock as he sucks his buddy. <br /><br />Buddies Know How To Share ... <br />Dorian lays down and spreads his huge, muscular legs, giving buddies Joey and Abel access to his huge, hard cock. The two go down on the dick, sharing in the responsibility of pleasing it and kind of get in a little competition to see who is best. I think it's a toss-up and I'm sure Dorian is thoroughly enjoying being the judge. Abel goes for the balls while Joey deep-throats it and vice-versa. These two clearly have no issues sharing the task at hand as they swap spit on Dorian's dick. Dorian says he thinks they've been practicing in the barracks and Joey and Abel flatly deny the allegation. But I'd say from the looks of things if they haven't been practicing, they've both sure been thinking about it. And judging by their unison in the matter, I'd say those thoughts have been along the same lines as their tongues fight over the hot cock. <br /><br />Are You Ready To Get Fucked Now? ... <br />Dorian and Joey are locked in a hot kiss when Dorian pops the question to Joey, So, you ready to get fucked now? Joey says, waiting on you big boy and from there he positions himself on his back with his legs in the air so Dorian can invade his foxhole. Abel steps aside and watches to insertion as he jerks his hard cock to the tune of his buddy getting plowed. Dorian is deep in Joey's ass by now and Joey has adjusted. Joey decides to put something in his mouth since he's already got something in his ass and takes Abel's cock in his throat as he takes Dorian's hot, hard cock up his sweet ass. <br /><br />Doing It Doggy ... <br />They flip Joey over and Dorian takes him from behind as he continues sucking Abel. They're using him to his fullest potential as he gives up both holes for the good of the group. Dorian is enjoying that tight ass and his moans and shit talking are telling the story. Joey seems to enjoy this position of submissiveness as he gives himself over to these two hot men. They switch up a little and Abel lays back on the bed while Dorian pile-drives Joey's ass from behind, going deeper and deeper. <br /><br />They Turn The Table On Abel ... <br />I'm not sure how we managed to talk Abel into this, but somehow we did and he's suddenly on his back with his ass in the air, about to take Dorian's cock just like his buddy did. This is a true on the fly moment as we see it unfold right before our eyes, raw and uncut. At first none of us are sure what's going to happen or if it's going to happen at all. Abel struggles pretty hard to accommodate Dorian's cock, but doesn't chicken out when the pain becomes intense. He learns quickly how to breath and the look on his face is priceless. It's almost like he's on an operating table about to have a leg removed with a chainsaw. It takes him a minute to realize that he can handle the operation. Once the initial pain is over, Dorian starts plowing him harder and faster and Joey starts feeding Abel his hard cock. Abel is jerking his dick, trying to stay in rhythm with the group and doing a mighty fine job of it. This was one hell of a way to break in a newbie, but Abel has accomplished the mission and all that's left are the cumshots which start to fly.",
  "models": [
    {
      "name": "Abel",
      "person_id": 35198
    },
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Joey",
      "person_id": 35197
    }
  ],
  "release_date": "2010-02-12",
  "scene_id": 70170,
  "series": "Gung Ho 3",
  "tags": [
    "Gay"
  ],
  "title": "Abel, Dorian & Joey"
}