{
  "collections": [
    "Active Duty"
  ],
  "description": "Elijah, Fox & Shawn ... Elijah has been away for awhile but he's looking as good as ever and he's always super horny. I think this time around he was especially ready for some long over-due man sex as he told me in a text message a few days before his trip out, 'I need some bromance and you always line up the best.' Can't argue with a man that tells you straight up what he wants, you just have to deliver. Elijah always enjoys the newbies and he had his hands full with Fox and Shawn in this scene. What Lurks Beneath Shawn's Shorts? ... I let my buddy Joe from My Straight Buddy man the camera on this scene while I was busy filming another scene. Elijah and the boys help Joe out and together they all pull off a really hot threeway. Joe keeps my tradition in kicking things off with a little light banter and getting the boys all warmed up as they shoot the shit and get 'in the mood'. Shawn's big cock is the first one jumpin' as he flexes his hard-on in his shorts. You can tell he's ready to kill the chit-chat and get down to some action. Elijah is hard as always just waiting on his company to touch it. Different Strokes ... Fox reaches over and grabs Elijah's cock and strokes it through his shorts as he strokes his own hard cock through his boxers. Elijah cuts through the bullshit and gets naked first with his hard on bouncing off his naval. Elijah offers up some help to Fox and goes down on his cock for a taste. Fox approves and says he's better than the girl he had the other night. Shawn moves in and starts feeding his fat cock to Fox as he fucks Fox's face while Elijah deep throats Fox's cock. Things are underway as the room heats up with these three hotties. Cock Suckin' N' Ass Eatin' ... Fox shows off his skills once again and how much he loves to gag on a fat cock as he takes Shawn's cock all the way down his throat, gagging the whole way, but doing a fine job of mastering the big meat. Meanwhile Elijah is brushing up his cocksucking skills as he takes orders from Fox on how to man his rod. Things switch up and Shawn and Elijah share Fox's hot cock as he sits on the headboard and directs his partners. After they've shared the cock, Fox goes back to eat Shawn's ass as Shawn services Elijah's hot cock. Won't be long now before someone is getting fucked. Shawn seems the likely suspect, but it's actually Fox who ends up on bottom first as he switches places with Shawn and gets his ass eaten and readied for the fuck. Shawn tongues the nice hole and Elijah declares that the better Shawn licks it, the better Fox sucks. Shawn and Elijah Both Fuck Fox ... From there, Shawn begins his slow, but deliberate insertion into Fox's nice hole. Fox tries to complain a bit but Shawn isn't buying it and keeps moving forward to end up pounding that nice hole fast and hard. Once Shawn opens that hole up, Elijah moves in to get his turn. By this time Fox is primed up and loving the cock. His dick is hard as Elijah pounds his hole. Fox loves to be the pass around party boy and he's getting what he likes today with these two studs. Now It's Elijah's Ass' Turn ... Elijah isn't one to shy away from a good ass fucking and he gives his sweet ass up to Fox who moves in to get some revenge. Elijah enjoys eating Shawn's nice ass while he gets banged out by Fox and everyone seems pretty happy. Elijah has been waiting on a good pounding for several months now and Fox is giving it to him. Elijah Bends Shawn Over ... Elijah gets to fuck one more hot ass as he bends Shawn over and gives it to him deep while Shawn and Fox do a hot sixty-nine. Shawn is sucking Fox's cock while Fox returns the favor and Elijah fucks his hole good. Soon enough, the cum starts to fly and the boys call it a scene!",
  "models": [
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Fox",
      "person_id": 35083
    },
    {
      "name": "Shawn",
      "person_id": 35230
    }
  ],
  "release_date": "2010-08-02",
  "scene_id": 70177,
  "tags": [
    "Gay"
  ],
  "title": "Elijah, Fox & Shawn"
}