{
  "collections": [
    "Active Duty"
  ],
  "description": "Oh Dakota! ... <br />Remember I was teasing you recently about Braden's buddy Dakota and telling you that you'd be seeing the latter really soon here at Active Duty. Well, it's happening sooner rather than later because Dakota stars in this scene with two other new guys: Joel and Justin! We recently introduced Justin to our Members in the War Chest and now we've got him in some hard core action. Joel hasn't even made it to the War Chest yet -- as of this DVD's release -- so this is an extra special treat for everyone. <br /><br />Joel's In Heaven ... <br />As for Joel, You can tell he's loving what's going on as his cock never once goes down the entire scene. He fucks the daylights out of both Dakota and Justin, showing them how good a big dick can feel up your tight virgin ass. Little does Dakota know that Justin and Joel had already been acquainted at my place one night about a week prior to us shooting this scene. I invited the two of them over for a test run and Justin let Joel fuck him that night just to see how good it would feel. He must of really enjoyed it because he's back for this scene and eager for more. <br /><br />Cream Pie Delivery Service? ... <br />Once we clue Dakota in on Joel and Justin's secret, he's all game for getting involved. I leave them alone as I go bake a pie. (Why I've yet to go into a side business of selling home-baked pies, I'll never know.) While I'm gone, Dakota asks Joel and Justin if they'd give him a cream pie. That sounds a whole lot better than the cherry pie I'm working so hard on down in the kitchen. <br /><br />Strip Down ... <br />Dakota is the first one to strip down and Joel and Justin quickly follow his lead. Won't be long now before something comes up. Joel is the first to pull out his hard cock and Dakota is on it like white on rice. It's a big, nice piece of meat and would tempt even the best of us. Joel is such a regular everyday guy and there's something extremely sexy about him and maybe it's that no-so-average cock. <br /><br />Major Wood, No, the *Other* Major Wood ... <br />All these guys are sporting some major wood. I can't remember the last time I had three near-perfect cocks in the same room together. Justin is packing some serious heat with his beautiful cock and perfect low-hangers and Dakota has one of the most suckable cocks I've seen lately. Together these three make up a cocksucker's dream. Dakota has a perfect bubble butt that will make your mouth water and you'll love watching it get reamed out by Joel's fat meat. Hang on to your hand-grenades, troops. This threeway is off the charts!",
  "models": [
    {
      "name": "Dakota",
      "person_id": 35069
    },
    {
      "name": "Joel",
      "person_id": 35245
    },
    {
      "name": "Justin",
      "person_id": 35171
    }
  ],
  "release_date": "2010-09-08",
  "scene_id": 70179,
  "series": "Firewatch 2",
  "tags": [
    "Gay"
  ],
  "title": "Dakota, Joel & Justin"
}