{
  "collections": [
    "Active Duty"
  ],
  "description": "Super Duo Vinny & Shawn ... It features that super stacked and muscled Vinny who returns to turn things up a notch and take it to the next level and he's teamed up with one of my favorites and our very own 'Fun Size' Shawn. Talk about a hot duo. These two compliment each other so well and the chemistry is bubbling from the moment the camera comes on. A Little Massage? Why Yes! ... The scene begins with Shawn behind Vinny, massaging his shoulders, helping him relax as Joe grills them for the latest and tells Vinny what a success his oral scene was that he and Kaden did for Amateur Straight Guys. Vinny must have enjoyed himself because he's back to play again. Kissin', Squeezin', Feedin' ... Shawn is excited to get the chance to bring Vinny further across the line. They talk about his chest and body and Vinny tells them his routine for staying fit. Shawn is feeling him up and starts slowly kissing his ear and neck, moving his hands all over that gorgeous body right down to the basket that's already hard. By the time he grabs Vinny's cock, they are locked in a deep kiss. Shawn is easing him right along with no trouble at all. You can feel Vinny's excitement as he anticipates getting a chance to return the favor to Shawn. The moaning alone tells the story and when Shawn pulls out Vinny's super hard cock we know by the size of that thing that it's pretty happy, too. Shawn takes his time, moving Vinny slowly along and Vinny is appreciating all the effort. The kisses are intense as the action heats up. Vinny stands on the couch and starts feeding his cock to Shawn who is hungry to take it for a test run. Shawn swallows it to the balls, deep throating the fuck stick as he caresses the balls. He's working Vinny's cock good. Blowjob Leads To Rimjob ... Either Vinny or Shawn can't get enough of Shawn's hot mouth on Vinny's hard cock because Vinny sits down on the couch to enjoy it longer as Shawn strokes his own cock while he continues working Vinny's cock with his throat. This is that long, slow, intense blow job we all fantasize about and with a hottie like Shawn doing the deed you'll be a bit jealous of Vinny. I know I was. And if the blowjob couldn't be more intense, Shawn throws Vinny's legs back and starts tonguing his tight hole. He's really giving him one hell of a hot rim job as Vinny confesses this is a first for him. Vinny is jerking his cock while Shawn eats his ass with just as much detail as he gave the blow job. Straddle Action ... All this hot tongue action has got Vinny super horny. He's ready for the next step now and tells Shawn to give him some of his dick. Shawn obliges and gives Vinny that fat meat to play with. Shawn is straddled over him, giving Vinny full access to that delicious meaty cock and Vinny is taking full advantage of it. I think we've found something Vinny really likes and who can blame him? With a fat cock like Shawn has it's a cocksuckers delight. Vinny is stroking his own hard dick while Shawn feeds him his dick and you can tell how horny all this action has our man Vinny. He's really getting into it. It just proves what I've always said, 'Everybody loves a big cock'. Vinny Plows Shawn Hard ... Vinny moves around to lick Shawn's ass and Shawn squats down on his tongue, giving him all the ass he can eat. Shawn strokes his cock as Vinny eats his ass. A hot tongue is just the beginning of a hot fuck that's about to unwind as Shawn's ass gets good and ready. Vinny saddles up and moves in behind Shawn and shoves his cock in and starts fucking him fast and hard. He's serious about fuckin' an ass as he tears Shawn's ass out of the frame. Shawn isn't complaining though, he's taking it like a man and you can tell this is a fucking he's been needing for awhile now. He's reaching back and pulling Vinny into him deeper as Vinny plows him hard. Judging by how intense he's fucking Shawn, you know Vinny has been waiting to fuck another guy for awhile now. And all the while, Shawn's huge hard cock is bouncing in the breeze. Acrobatic Achievements ... Vinny fucks Shawn six ways to Sunday, bending him over the arm of the couch, putting him on his back on the floor with his ass and legs in the air as he pounds down deep into Shawn's hole with Shawn jerking his own hard cock frantically. Shawn is so riled up he can't hold back much longer as he blows his load all over his chest while Vinny keeps pounding. He's drenched and Vinny is about to add to the mess as he stands up and blows a huge fucking load all over Shawn, sending gobs flying past his head, and mixing it in with Shawn's hot load. Vinny reaches down and spreads the hot love around as he plays in the massive loads.",
  "models": [
    {
      "name": "Vinny",
      "person_id": 35165
    },
    {
      "name": "Shawn",
      "person_id": 35230
    }
  ],
  "release_date": "2010-08-02",
  "scene_id": 70176,
  "series": "The Frontline",
  "tags": [
    "Gay"
  ],
  "title": "Shawn & Vinny"
}