{
  "collections": [
    "Active Duty"
  ],
  "description": "Shawn And Dorian Break In The Pub ... When we closed the doors on the old pub I was able to salvage a lot of the fixtures and resurrect a small clone in the garage to make myself one hell of a man cave. It was a labor of love. Dorian, Shawn, Major Wood, Brian, a few guys we hired off of Craigslist and myself were able to whip this place into shape in just a few short days. The results were the ultimate man cave and you know me well enough by now to know that any man cave of mine will have men fucking like cave men in it, right? Right! The Balls Are On The Table -- And Other Places ... Things kick off with Dorian and Shawn shooting pool and all of us shooting the shit. I dub the new man cave 'Flamingo Bar and Thrill' because thrills are the only thing I plan on cooking up in this place. Dorian is excited because he's sure he's going to beat Shawn at the game of pool they're playing and therefore get to fuck Shawn's ass as the prize. He says he's been waiting for it all day and by the look on his face I'd say I believe him. Dorian lays down the rules for strip pool and Shawn's already lost two articles of clothing. By the time Shawn loses his shirt, he realizes he's not wearing any underwear. LOL. Next thing you know, he's naked as a jaybird and Dorian still has all his clothes on as the final shot that calls the game comes, Dorian scratches on the eight ball and loses the game. Shawn says he knew he'd fuck up if he just gave him enough time now Dorian has to bottom first. I kid Dorian that I think he planned it all out that way and he doesn't deny it. Dorian And Shawn's Sticks And Balls Are All That's Left On The Table Now ... From there it's nothing but extra hot and steamy mansex between these two fine specimens as we watch them go from some aggressive deep kissing and playing with one another's hard cocks to Shawn directing Dorian to lay back on the pool table as he takes Dorian's super hard cock into his hot mouth as he sucks, slurps, licks and enjoys. Dorian is loving the prep job as he lays back and moans. Shawn doesn't miss one single inch of that nice stiff dick as he covers every last inch of it with his hot tongue and throat. Dorian fucks his face good and hard as Shawn strokes his own hard cock, eventually coming up on the pool table and giving Dorian access to his own hard dick while he continues to work Dorian over. They get in a nice sixty nine as they feed each other their hard cocks. Sinking The Other Balls ... Just looking these two cut, lean bodies going at it is enough to send me over the edge. Their bodies are insane. Dorian is underneath Shawn, taking his dick deep down his throat as Shawn puts it balls-deep in his throat and teabags him with his balls. Next, Shawn flips him over to rim that sweet, tight hole of Dorian's and Dorian is loving the attention. Shawn takes his sweet precious time licking and eating Dorian's fine ass. Sinking The Sticks ... Shawn slowly starts sliding a finger in and out of Dorian's freshly eaten hole, getting it warmed up for the fucking that will soon follow. All the while Dorian is stroking his hard cock fast and furious as Shawn hits the right spot. Next thing you know, Shawn has Dorian's ass thrown off the edge of the table and he's plowing his cock in and out of him while Dorian strokes his own cock as he takes the cock deep in his ass. Talk about stuffing an ass full of hot cock, man, Shawn is literally stuffing his fat dick in Dorian's tight ass and Dorian is loving every second of it. Shawn is giving it the longest, hardest pounding I think I've ever seen him give an ass. Once he's reached the point of no return he hops on top of Dorian's tight abs and lands his hot load all over Dorian's huge chest and it just gushes all over the place. He whispers to Dorian that he wants Dorian to do him now and he doesn't miss a beat. Shawn positions himself on barstool with his little ass hanging off the edge, giving Dorian the access he need to lay down a good fucking on his tight little ass. And Dorian returns the favor with gusto as he tears Shawn's tight little ass out of the frame with his rock hard cock banging him faster and harder. Shawn, (aka 'Fun Size') proves just what his nickname means as he's just the perfect fit for Dorian's hard dick. Dorian works him over just as good as he worked Dorian's ass over and when Dorian is ready to blow his wad, Fun Size decides to get on his knees and take it all over his chest.",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Shawn",
      "person_id": 35230
    }
  ],
  "release_date": "2010-03-14",
  "scene_id": 70171,
  "series": "Double Time 7",
  "tags": [
    "Gay"
  ],
  "title": "Dorian & Shawn"
}