{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden's Discovery Evan Teams Up With Austin ... You'll all remember that delicious find that Kaden shared with us over at Amateur Straight Guys named Evan. We'll, Evan was actually a little more well-suited for Active Duty since he's actually a military guy and I personally could not pass up a chance to work with this little hottie so I invited he and Kaden out for a weekend and we shot a few scenes. I teamed Evan up with our delicious Austin and these two really hit it off. I had a hunch that Austin would be a perfect match for Evan and it turned out I couldn't have been more right. I felt it was only appropriate to let Kaden film this scene as he continues to hone his skills behind the camera. I think you'll all agree he did an amazing job of directing these two in one really hot scene. All the bases were covered and I'd say Kaden, Evan and Austin all three hit a home run with this one, troops. Kaden Shoots, While Austin Prepares to Score ... Kaden kicks things off chatting and bullshitting with the boys as they warm up and get comfortable. Evan seems to like what he's been paired up with and I think Austin shares his feelings. It's obvious from the start that these two are going to heat things up. Evan kicks things off as he goes down and starts kissing on Austin's abs, moving quickly down to his cock where he finds that Austin is already standing at attention. It doesn't take Evan long to get Austin out of his jeans and Austin begins eagerly working on doing the same with Evan. You'll swear that Evan was born to suck cock as you watch him literally make love to Austin's dick with his beautiful lips. Kaden has trained his new recruit well and now Austin is expanding on the training and giving Evan a full course in mansex. Why Waste Time? Let's 69! ... The tables turn and it's Austin down on Evan's nice, fat cock as he returns the favor. Kaden is right in there, getting all the hot action as these two enjoy their time together. Evan is also standing at full attention and he's a vocal one, too. He's letting Austin know just what an awesome cocksucker he is with his moans and groans and nods of approval. Austin look especially hungry as he devours the delicious newbies cock. Why waste time? Let's sixty-nine! Kaden gets the guys in a nice sixty-nine position so both of them can get maximum pleasure from the great cocksucking they both so obviously give off. A match made in porn heaven for sure with these two giving each other their best. I've seen some sixty-nine action in my time, but I think this one ranks right up there with one of the hottest. It's so clear that these two are having the time of their life. Parting Is Such Sweet Ecstasy ... And before you know it, Austin has Evan bent over and is eating that nice, sweet, tight asshole that is just damn near perfect. I'm sure you or I could eat it for hours without coming up for air and Austin gives us a run for our money as he dives in and enjoys the prize. He spreads the sweet pink hole wide open and tongues it deep, spitting in it and getting it ready for the next step. As he's eating that sweet ass he says to Kaden, 'Now I know why you brought him out here.' I'm not sure if Evan has ever experienced anything this intense as Austin isn't just dancing around the issue, he's going deep and really giving his fullest attention to detail. Once he's got that sweet, tight hole opened up he moves in with two fingers and starts finger fucking Evan's tight hole. He rubs his hard cock around the pulsating hole and gets ready to move in. Heaven Knows ... Austin's fingers have opened the doors to heaven and he's able to dive right in Evan's sweet ass and bury his cock deep inside. He's fucking him fast and hard in no time at all and Evan is loving every second of it. Evan's cock is hard and he takes advantage of the moment as he strokes himself while Austin fucks him good. Austin better enjoy that sweet ass as much as he can because things are about to take a turn. Cum On, Try a Taste ... Austin ends up on bottom with Evan plowing him deep as Austin holds his hard cock in his hand and bites the pillow beside him. He's moaning like a whore on shore leave getting pounded by the entire fleet as Evan shows him he's as good on top as he is on bottom. Austin starts pounding his own cock fast as Evan pounds him faster and deeper, working Austin up to blow his load all over himself while Evan is deep inside his sweet hole. Kaden makes a directors call and gets Austin down on the floor in front of Evan so he can blow his hot load all in Austin's mouth, squeezing the last few drops out into his mouth, then going in for a hot kiss to swap the gooey goods. Delicious!",
  "models": [
    {
      "name": "Austin",
      "person_id": 35036
    },
    {
      "name": "Evan",
      "person_id": 35082
    },
    {
      "name": "Kaden",
      "person_id": 35022
    }
  ],
  "release_date": "2010-09-08",
  "scene_id": 70178,
  "series": "Firewatch 2",
  "tags": [
    "Gay",
    "Threesome"
  ],
  "title": "Austin, Evan & Kaden"
}