{
  "collections": [
    "Active Duty"
  ],
  "description": "Dorian & Styx ... <br />This scene is interesting because it was shot the day after we shot the Styx and Lucky scene that is in the War Chest. Yes, the scene where I put Styx up to getting Lucky to go as far as Styx could get him to go. And it ended up being really hot as these two explored together and Lucky broadened his horizons a little and let Styx jerk him off, but it didn't stop there. I guess Lucky was in the mood to go a little further and he returned the favor to Styx and jerked him off in return. That scene took me back to the early, early days of Active Duty when things moved a little slower and took their course in smaller moves. <br /><br />Wide Angle Lens Broke (Again!) ;-) ... <br />Things kick off with these two hotties on the bed and I'm talking to Styx about the night before. I remind them that my wide angle lens is still broken and convince them to scoot in closer to one another. These two look like a couple straight out of Tun Tavern. The epitome of sexy brought together to show it all off. <br /><br />Styx Is Still New To This ... <br />I leave the room to do some laundry and these two get right down to business. The shorts come off and the cocks get hard and we're waiting on edge as Dorian starts spying Styx up and down, taking in the scenery. Wouldn't you like to know whats going on in that gorgeous head of his? Styx gets right down to the call of duty and starts sucking Dorian's cock like a champ. All the while Dorian is rubbing and exploring Styx's tatted up torso and rubbing that beautiful ass. Styx is still a bit new to all this and still a bit nervous but that's the part that makes it so hot as we watch him explore. He's not afraid to take matters into his own hands. Dorian gets him on his knees so he can stroke Styx's cock and play with his nice bubble butt while Styx services his cock. I go around and get some really nice views of that gorgeous asshole as Styx throws it in the air and puts it on display. Straight boys learn so quick and Styx is no exception. <br /><br />From One Straight Dude to Another ... <br />Dorian starts rubbing that beautiful pink pucker with his big fingers, getting it aroused and awake. Styx arches that back and eases himself back to give Dorian better access. The more he plays with that hole, the faster and harder Styx sucks his cock. He and Dorian embrace in a kiss that is out of this world. Dorian is a good sport and a fair lover and he goes down on Styx's cock to return the favor. He grabs Dorian by the back of the head and instructs him on how to suck it deep. Meanwhile Styx is guiding his head down on his cock and fucking his face and Dorian does a damn fine job of following instructions. <br /><br />The Harder Styx Pounds, the More Dorian Likes It ... <br />Styx notices the beautiful ass in the air and reaches around to rub Dorian's cheeks. He slaps Dorian's ass and asks if he likes to get that nice ass fucked. Dorian responds by telling him he didn't get him rock hard for nothings. From there, Styx mounts Dorian's round bubble butt and drives it balls deep into his hole. Styx tells Dorian his ass is nice and tight and Dorian responds by telling Styx to fuck him harder. Dorian's perfect ass looks so delicious as he arches his back and spreads his legs for Styx. He tells Dorian to stroke his cock while he fucks his ass and Dorian does as he is told. This seems to turn Styx on even more as he starts pounding away again. <br /><br />Spread That Asshole WIDE ... <br />Styx is ready to have the favor returned and have Dorian pound his ass for a change of pace. Dorian saddles up to take the reigns as Styx puts his face down and his ass up. This is such a hot way to see this stud take it. He puts his chest and face down on the bed like a good submissive bottom and gives his top complete access to that super sexy hole. Dorian plunges in and starts pounding away as Styx strokes his own cock fast and hard. Dorian flips him over on his back to plow his hole as Styx keeps stroking his cock faster and faster. Styx holds his own leg back behind his elbow as he strokes himself and blows his load. He keeps stroking his cock as Dorian keeps pounding. Dorian turns him over and fucks him doggy style again as he spreads his cheeks out to give us a good view of that hole as he fucks it. All the while Styx is pushing his ass back on Dorian's cock and then he reaches back as Dorian is about to cum and spreads his asshole wide open. Dorian blows his huge load all over Styx's back in huge gushes, soaking his asshole and his back. The cum just drips down Styx's asshole onto his balls and it's a wrap. These two are so fucking hot together.",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Styx",
      "person_id": 35149
    }
  ],
  "release_date": "2010-08-21",
  "scene_id": 70182,
  "series": "Double Time 8",
  "tags": [
    "Gay"
  ],
  "title": "Dorian & Styx"
}