{
  "collections": [
    "Active Duty"
  ],
  "description": "Diego & Elijah ... Two of my personal favorites come together and rock the bedroom in an awesome duo scene that'll leave you breathless. Both of these guys are all smiles at the thought of getting it on with one another. They've met several times in the past, but they've never done a scene together and I think the tension has been building all this time. If their scene that we're from Double Time 8 is any indication I'd say they've both fantasized about this moment at least once or twice. Body Lickin' Good ... I put out a challenge to the two of them to see who can be the most aggressive and things kick off right away with a big, hot kiss between the two of them. From there the competition is on and Elijah is all over Diego's tatted up body, licking his abs and admiring his body and Diego quickly returns the favor, exploring Elijah's body in return. Diego is the first to take Elijah's cock in his mouth and he does it with such wild abandon. You can tell Diego is hungry for this and he's got Elijah's full attention. He works Elijah's cock, giving it plenty of hot man lovin' and affection. 69? Don't Mind If We Do! ... Elijah must suddenly remember that he's supposed to be the more aggressive one because he puts Diego against the wall and gets serious about returning the favor. He's on it like a dog on a bone, giving Diego the time of his life. They switch places once more and Diego goes in for another round on Elijah and this time I think he may have won the prize. Diego is so intent on sucking Elijah's cock and making it feel good that I think he got lost in the moment for awhile there. Elijah decides there's room for two in this game and suggests a sixty-nine that gets really heated. It's so hot watching these two tatted up studs orally enjoy each others manliness. You'll wish you were right there with them, slurpin' away. Follow the Bouncing Balls ... From the sixty-nine they move to a reverse cowboy and Elijah climbs in the saddle and takes Diego's hot, hard cock for a good long ride. He's bouncing up and down on the hard meat, getting what he came for. He asks Diego if he wants to get on top of him and fuck him and Diego is more than ready. He gets behind that sweet, round bubble butt and plows away as Elijah moans out his approvals. Diego is giving it to him as hard as I've ever seen him give it to anyone before and Elijah is loving it. Wanna Go For a Ride? ... Diego is ready to take a ride of his own and he straddles Elijah and rides away. Their balls slapping together so beautifully as Diego takes Elijah's cock deep inside. By the time Elijah bends him over, Elijah isn't playing anymore. He's taking control and owning that ass. And Diego is more than glad to let him. Lord, somebody pass me a fan.",
  "models": [
    {
      "name": "Diego",
      "person_id": 35077
    },
    {
      "name": "Elijah",
      "person_id": 35081
    }
  ],
  "release_date": "2010-08-21",
  "scene_id": 70180,
  "series": "Double Time 8",
  "tags": [
    "Gay"
  ],
  "title": "Diego & Elijah"
}