{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden & Evan ... I recently had these two studs out for a weekend and we shot some really hot stuff. You've already watched one of the scenes we shot that weekend with Evan and Austin that Kaden shot and directed. This time I man the camera and direct Kaden with his new recruit to unleash themselves on one another and that's exactly what they did. 'Pools of Blue' ... Things kick off with me talking to Evan a little, warming him up. This guy is so friggin' hot. That beautiful smile and those 'pools of blue' eyes as Kaden calls them along with that beautiful skin make this guy totally delicious. Pair him with a stud like Kaden and you've got magic. The beauty of Evan doesn't stop with his eyes and smile and pretty skin. It goes way beyond once you've gotten this little stud naked and that nice, hot hard cock at full attention. Bend him over to reveal that sweet pink hole of his and you may have a hard time recovering. On Fire ... After some chit-chat, I turn them loose on each other. They begin with a hot, hot kiss as Evan rubs and admires Kaden's hot body, all the while stroking Kaden's rock hard cock through his shorts. In no time flat Evan has Kaden's hard cock out of his and in his hot, sweet mouth, worshipping it as Kaden pulls off Evan's shirt and starts running his hand down the back of Evan's shorts, playing with his pretty little ass. Kaden has trained his little recruit perfectly as we watch him service Kaden's cock like a pro. Kaden finally gets Evan out of his shorts and starts tugging on Evan's hard cock through his boxer briefs that quickly come off to reveal a super hard cock with a beautiful curve to it. Kaden is quick to return the excellent attention to Evan's cock that Evan paid to his. The Camera Is Forgotten ... Kaden turns Evan around on his hands and knees and spreads that beautiful pink hole open and tongues and finger fucks it for a bit as he also licks and sucks Evan's cock. The site of Evan's hot little ass gets Kaden all riled up as he slaps his hard cock on it and continues to lick and tongue it. All the while Evan is stroking his hard cock and reaching back to caress Kaden's tight body. These two are totally in the moment. They've forgotten all about the camera and we're like flies on the wall witnessing a beautiful love-making session between these two hotties. Evan's Ass Is Amazing ... Evan finds himself on his hands and knees again with Kaden's tongue and finger in his ass. It's obvious that he's on fire and ready for Kaden to mount his ass and take it for a ride. Kaden saddles up and moves in, slowly burying his hard cock deep in Evan's tight little ass. The moans that Evan lets out tell the story. He's getting exactly what he wants as Kaden goes balls deep in his ass and fills him full of hot cock. Evan's own cock is bouncing in the breeze as Kaden hits that prostate over and over. Evan's ass is so small and tight that Kaden's cock looks huge going in and out of it. Kaden directs his little star to sit on his cock and Evan does just that. Now this is really hot to watch and Evan's tight hole stretches to accommodate Kaden's hard cock. You can literally see it stretching out as he sits all the way down on it. Kaden flips Evan over on his back and continues to plow him deep as Evan strokes his own hard meat. It looks as if Evan might shoot his wad any minute, but his turn is next so he holds off. Kaden Finds The 'Spot' ... A long, wet kiss precedes what's coming next as they jerk their cocks together, enjoying the moment before Evan slides his cock deep into Kaden's ass as Kaden throws his legs back to give Evan complete access. Evan slides his cock in and out of Kaden's hole, fucking him slowly as Kaden strokes his hard cock and takes the fucking like a champ. Evan pulls Kaden to the side of the bed and stands and delivers his hard cock deep in Kaden's ass as Kaden strokes himself fast and furiously. Evan finds the right spot and keeps hitting it as Kaden reaches his climax and blows his load all over his stomach. Evan keeps the pace and keeps slamming his cock in and out of Kaden, working himself up to cum. He lands his load right in there with Kaden's and the juices mix together like a perfect blend of hotness.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Evan",
      "person_id": 35082
    }
  ],
  "release_date": "2010-08-21",
  "scene_id": 70181,
  "tags": [
    "Gay"
  ],
  "title": "Evan & Kaden"
}