{
  "collections": [
    "Active Duty"
  ],
  "description": "Dan (With Help From Alex) ... Dan starts off this scene alone, jerking for the camera, showing off his ripped body. But soon, Alex comes in and gives him a helping mouth (and, well, a hand too!). Then, we get Dan and Alex together in a proper pairing. Alex is sometimes slow, but always deliberate in his approach and normally he ends up making it seem like the other guy just couldn't resist him and today that seems to be the case with Dan. Things kick off in this scene with Alex and Dan on the bed. Alex is butt ass naked with a raging hard on already and this time no one has to coax the other guy into anything. Mike simply says, 'Why don't you help him out with that Dan?' and Dan obliges pretty quickly. Maybe it's because he's been sitting there for 20 minutes watching Alex stroke it before Mike turns on the camera or maybe Dan is just that hungry to taste a cock. Either way, he's on it like white on rice and sucking that cock like a pro. Alex is loving his skills and makes it well known with the verbal responses he's giving him. You can tell Dan is a natural at this. He's not even worried about himself as he focuses all his attention on Alex's cock. And Alex is more talkative and more verbal than I think we've ever seen him before. This guy must really know what he's doing. Several times during this fantastic blowjob Alex says he's going to cum, but Mike tells him to hold off and enjoy the ride more. When it's obvious that Alex can't hold back his load anymore he and Dan start stroking his cock together. What a hot thing to watch and finally Alex blows his wad all over himself for a hot finale to a really hot oral scene where Dan proves he's up for the mission at hand.",
  "models": [
    {
      "name": "Alex",
      "person_id": 35236
    },
    {
      "name": "Dan",
      "person_id": 35343
    }
  ],
  "release_date": "2007-06-20",
  "scene_id": 70188,
  "series": "Covert Missions 6",
  "tags": [
    "Gay"
  ],
  "title": "Alex & Dan"
}