{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden & Jonavik ... I'm sure many of you can't forget that hot guy named Jonavik from the Covert Missions series. Yeah, the one with the huge cock that looks like he could beat the living shit out of you. And, if you're like me, you'd probably let him, but only after he let you suck that big dick. Well, I was so smitten with this guy and his huge dong that I decided to travel all the way to Mike's hideout where he shoots the Covert Missions series and get to know Jonavik myself. I didn't go alone, though, I took Kaden Saylor with me to see what we could stir up. The plan was simple really. I wanted to see this tough guy stuff that cock deep in someone's ass and I knew Kaden could handle the challenge. I mean we've seen him handle just as big when he took Thomas in Battle Cry and we've all witnessed the sweet love he can make to a huge cock. Kaden was down for the challenge so we saddled up the horses and headed for the hideout. Covert Comes Over ... Now this was well before Mike shot the scene of Jonavik getting fucked by Chris in Covert Missions 7 and Jonavik was still pretty new at all this. I knew Kaden could warm him up and get him to take things a little further but I had no idea they'd go this far. Time to Break the Ice ... This was the first time that Mike and I had ever met, so we had some catching up to do. I get Kaden and Jonavik on the bed together and Mike and I head downstairs to the hotel bar to chase a few soldier's we'd spotted earlier while Kaden and Jonavik get acquainted. And it doesn't take these two long to break the ice. Kaden offers to help Jonavik get out of his jeans and Jonavik gladly accepts the help. Immediately Kaden is drawn to that huge basket Jonavik is sporting and starts rubbing and playing with it as he plays with his own rock hard cock. The boxers quickly disappear and Kaden moves in to help Jonavik out. Delicious, No? ... Before you can say 'suck that cock' that's exactly what Kaden is doing and Jonavik is getting a taste of what it's like to have a pro suck your cock. Kaden must have noticed how delicious Jonavik's lowhangers were looking because he spends plenty of time on them as he works Jonavik's cock up to a massive hard on. This is where the beauty begins. I could watch Kaden suck a big dick any day of the week because he gives it such devoted attention. And Jonavik has one of the nicest big dicks I've seen lately. Who wouldn't make love to such a monster given the chance? Get On Your Knees ... As Kaden works his big cock over with his hot mouth, Jonavik reaches around and starts jerking Kaden's hard dick. By the look on Jonavik's face, you can tell just how good all this is feeling. Kaden decides to get him on his knees to so he has better access to that huge cock as he really gets down on it. But we quickly learn the other reason that Kaden got him on his knees and we find out when Kaden stands up and starts feeding his cock to Jonavik. Watching this uber masculine stud sucking on a hard cock is magic to behold. But it doesn't take Kaden long to miss the big dong and he goes right back for more. Time. To. Fuck. ... Sometimes there's nothing better than a good, long tease to get you all worked up before the fuck and Kaden knows just how to tease us. He straddles Jonavik and starts slapping that massive meat against is hot bubble butt, teasing both us and Jonavik as Jonavik strokes Kaden's hard cock. Jonavik reaches around and grips those hot cheeks in his big, manly hands and spreads Kaden's ass apart as Kaden rubs his crack back and forth against Jonavik's dick, literally driving us crazy as we watch. This is where the tables turn and we learn a secret that Jonavik has been keeping. But whatever could that be? Well, he wants Kaden up his ass, that's what! You've got to see how it all unfolds -- so snap up the DVD and find out!",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Jonavik",
      "person_id": 35212
    }
  ],
  "release_date": "2010-12-27",
  "scene_id": 70196,
  "series": "Kaden's Recruits 2",
  "tags": [
    "Gay"
  ],
  "title": "Jonavik & Kaden"
}