{
  "collections": [
    "Active Duty"
  ],
  "description": "Dustin & Kale ... Things kick off with these two hotties on the bed and I give them my usual round of bullshit, trying to loosen them up and get them at ease. It doesn't take much of that before you realize that these two were born ready. Kale is a little rascal and always smiling and laughing, but always ready as well. Dustin follows his lead in the beginning, but it won't take long for him to get in where he fits in and forge his way into Kale's ass and our hearts all in the same scene. Unzipped! ... The jeans unzip, hands go in the boxers to find hard ons ready and waiting. The jeans come off, the cocks stand at attention and it's on from there. They're comparing cocks by gripping each others dicks in their hands. Their cocks are almost twins. Dustin says it feels like he's just stroking his own cock. I suggest that they'd make great roomates all the while we're watching the bond grow between these two. The intensity is building and it won't be long before one can't stand it any longer and has to taste the cock of the other. After all, it'll be just like sucking their own cocks, right? Wink. Cocksuckin' Love ... To my surprise it is Dustin who does the deed first as he goes down on Kale's cock and literally begins to make love to it. All the while his own cock is throbbing hard. Kale questions whether it's Dustin's first time because he's so damn good. Dustin takes it slow and enjoys the cock in front of him while he strokes his own dick hard and fast. Kale is sure that Dustin has found his new favorite hobby and I can't say I would disagree with him. Dustin is a natural. Watching him make love to Kale's dick will only make you jealous in between stroking your own hard cock. This guy takes on the task at hand and masters it all in about five minutes. Meanwhile Kale is stroking Dustin's cock, giving him even more inspiration to provide good service. Oral Exam ... Kale rewards Dustin for a job well done by giving him an equally good oral exam. And Kale's skills seem to have improved since his scene with Vance as he seems to really get into sucking Dustin's dick. Dustin kicks back and enjoys the attention. These two were meant to make a scene together. 69 Time ... A nice side-by-side sixty-nine unfolds as these two decide to enjoy each others cocks simultaneously. Makes you wonder what gets them harder, having their cocks sucked or sucking a cock, but what really matters is how hot it is to watch as these two enjoy one another. Kale sneaks in a finger and starts playing with Dustin's ass. He spreads those cheeks to give us a nice look at that sweet hole as Dustin raises his leg to give us a better view. Kale is sliding his middle finger in and out of that perfect butt and Dustin isn't complaining. Stokin' And Kissin' ... For me, one of the hottest things happens next. They start stroking each others cocks and kissing like there's no tomorrow. Watching these two lock lips as they stroke each others cocks is enough to drive us over the edge. But we're far from done here, do don't blow your load just yet. The intense kissing and stroking is just the start to what's gonna happen next Time to Fuck ... 'Put that cock in my ass' is what Kale says to Dustin as he looks back at him, throwing his ass in the air toward Dustin's hard cock. Dustin wastes no time. He goes right in and buries his cock in Kale's fury little bubble butt. Kale eggs him on, telling him to 'fuck that tight little ass' and giving Dustin the go ahead to rail him good. Dustin takes orders well and uses his own hot bubble butt to slam deeper and harder into Kale's hole. Watching Dustin's bubble butt thrusting in and out is hot all in itself. Dustin reaches around and starts jerking Kale's cock to the same rythmn he's fucking his ass and Kale is really getting into it. At one point he's slamming back on Dustin's cock harder and faster than Dustin is pounding him. Spreadin' His Own ... 'Get it, get it.', comes Kale's demands as Dustin continues to rail his ass into next week. I think Kale has found his perfect cock to fuck him just the way he likes it. Dustin puts Kale on his side and fucks him from behind as Kale strokes his hard cock. They kiss even more as Dustin's cock slides in and out of Kale's furry little hole. Dustin reaches around and does Kale's stroking for him. What Dustin does next blows my mind. While he's fucking Kale's hole, he reaches around and spreads his own pink pucker for all to view. He's not only giving us a good view of him fucking Kale's ass, but a great view of him fingering his own hole. He starts licking and sucking Kale's nipples all the while, making sure there's plenty going on for us to watch. The Big Finish ... What happens next will blow your mind. Dustin is so limber he's able to suck on Kale's cock while he pounds his ass and doing it from the side gives us such a good view. Dustin wants Kale to cum for him so he puts Kale in his favorite position and Kale blows his load all over his stomach as Dustin continues to pound him. Won't be long before Dustin follows his lead as Kale tells him to explode all over him. Dustin lands his load all over Kale and Kale likes the warmth. Kale reaches up and squeezes out the rest of the cum from Dustin's cock, they go for another hot kiss and then they tease the camera with Dustin's perfect ass and what's coming soon. Thanks for playin'.",
  "models": [
    {
      "name": "Kale",
      "person_id": 35015
    },
    {
      "name": "Dustin",
      "person_id": 35016
    }
  ],
  "release_date": "2011-05-15",
  "scene_id": 70199,
  "series": "Dustin & Kale",
  "tags": [
    "Gay"
  ],
  "title": "Dustin & Kale, Scene #01"
}