{
  "collections": [
    "Active Duty"
  ],
  "description": "Jaden & Bastian ... <br />Kaden pushes the envelope a bit further and teams Jaden up with Kaden's bad boy, Bastian for a full on fuck scene and Jaden proves he's well suited for the role of bottom as Bastian plows that pretty ass like there's no tomorrow. <br /><br />Bastian Is a Wild Card ... <br />But before he gets his ass plowed, Jaden engages in some really hot oral action with Bastian as the two get orally acquainted. Bastian is a wild card and wastes no time hamming it up for the camera. He loves the attention and he loves giving attention. He quickly reaches over and starts rubbing and playing with Jaden's naked chest and abs and sneaking in a few quick feels of Jaden's cock through his jeans. Bastian is all smiles and Jaden starts returning the gesture. <br /><br />Up at Bat ... <br />It's no surprise that Bastian is the first at bat and once Jaden's jeans are down, he's burying his face in his crotch, sucking a licking that nice cock of Jaden's as he works it up. Bastian gives him just enough to get him horny then the tables turn and Jaden goes down to suck on Bastian's raging hard cock. He puts those oral skills he learned with Kaden to good use as he really gets into sucking Bastian's dick. Bastian gives Kaden and the camera a thumbs up to signal his approval. <br /><br />Bastian Gets Face-Fucked ... <br />On his second time at plate, Bastian is on his hands getting face-fucked by Jaden's hard cock. Bastian just opens his mouth wide and let's Jaden fuck it as he sees fit then regains control, licking and jerking as Jaden's cock grows harder and harder. <br /><br />Tables Turn: Bastian Fucks Jaden ... <br />The real kick comes soon after when Jaden tries, but doesn't succeed at fucking Bastian's horny ass who is ass up, face down, waiting. But that's OK because they quickly switch it up and before you can say 'let's try this again,' Bastian is balls-deep inside of Jaden's beautiful butt. And what a pretty ass it is. Bastian is rock hard and going in deep as Jaden mans up and takes it all. Jaden even starts slamming his ass back on Bastian's cock once he's used to it and then flips over on his back to switch things up. Bastian throws his legs up and goes in deep. Soon, Jaden is blowing a huge load all over himself and a big smile covers his face. Bastian follows with a big load of his own and it's a wrap.",
  "models": [
    {
      "name": "Bastian",
      "person_id": 35174
    },
    {
      "name": "Jaden",
      "person_id": 35218
    }
  ],
  "release_date": "2010-12-27",
  "scene_id": 70195,
  "series": "Kaden's Recruits 2",
  "tags": [
    "Gay"
  ],
  "title": "Bastian & Jaden"
}