{
  "collections": [
    "Active Duty"
  ],
  "description": "Styx & Austin ... <br />Styx throws all caution to the wind, bends that beautiful ass over, throws it in the air and offers it up to Austin who takes it, fucks it good and hard and milks two more hot cumshots out of Styx before all is said and done. <br /><br />Awe-inspiring ... <br />You'll be in awe as you watch this rough and tough Marine let down his guard and succumb to his deepest, darkest desires and still hold out his ultra masculine image the whole way through. Austin has a way with Styx that I'm not sure anyone else has had. And why not? Have you noticed how dreamy Austin is? <br /><br />Austin? Horny? You Don't Say! ... <br />Things kick off with me, Austin and Styx talking about the weekend and everything that has transpired. Austin is horny as fuck and he's already sporting wood (which he keeps playing with) in his jeans. It's clear he's up for what's about to happen and so much so that you can sense how anxious he is. <br /><br />Let's Get Engaged ... <br />Once I leave them alone, Austin engages Styx in conversation and you can begin to see the tough guy melt just a little to expose the sweetheart lying beneath. Austin guides Styx right through from nervous chit chat to a first hot kiss as Austin points out how good Styx smells. Austin offers Styx some help getting hard and Styx accepts the offer. Austin goes right down on that cock and it takes about thirty seconds for him to work it up. You can tell Austin is in hog heaven with such a hot, straight fine piece of meat at his disposal. He finally convinces Styx to go down on his hard cock and give it a taste and once Styx does it's all smooth sailing from there. <br /><br />So, You Ever Had A Guy ... <br />The next thing we hear is Austin asking Styx if he's ever had another man lick his butt hole and before you can say bend over, Styx is up on his knees with his ass in the air and Austin licking his nice hole. Austin takes his time and enjoys that sweet ass while Styx enjoys the attention. Styx really starts getting into it and giving Austin commands and telling him to lick that asshole deeper. <br /><br />'You Love It' ... <br />Austin takes great care going between the asshole and the hard cock that Styx is sporting. Austin says to Styx: 'I can tell by how hard your cock is that you love it' and Styx grunts 'hell yeah'. Austin discovers that Styx loves being spanked and so he spanks that ass while he eats it. That hole is spread open and all lubed up now with Austin's spit. You can tell that by now Styx could hardly resist taking a cock up that nicely teased and primed hole. <br /><br />Fuck! And Cum Twice ... <br />Austin moves in and rubs his hard cock all over Styx's hole, teasing it even more as it opens up and invites Austin's cock in for some hot fun. And from there, troops, I shall say no more. If you're going to be watching this I don't want to spoil the rest of the fun for you. All I'll say is that Austin does indeed fuck that sweet hole and Styx discovers something he likes enough to make him cum twice in the same scene.",
  "models": [
    {
      "name": "Austin",
      "person_id": 35036
    },
    {
      "name": "Styx",
      "person_id": 35149
    }
  ],
  "release_date": "2010-05-15",
  "scene_id": 70198,
  "series": "Austin & Styx",
  "tags": [
    "Anal Sex",
    "Duo",
    "Gay",
    "Rimming"
  ],
  "title": "Austin & Styx"
}