{
  "collections": [
    "Active Duty"
  ],
  "description": "Vinny & Kaden ... <br />This scene was actually one of Kaden's very first videos over at ASG when he was shooting content for us there. It remains the most popular video on ASG today and it was also Vinnny's very first video where he ventured out and did something with another guy for the first time. <br /><br />Vinny's First Time ... <br />Vinny has an amazing body with a chest and pecs that just won't quit, as we've all witnessed in his other videos here at AD. He's got a big smile and an even bigger dick, but he's never done anything with a guy before, but curious enough that Kaden was able to convince him to go further than he ever thought possible. <br /><br />Intense Chemistry ... <br />The mojo between Kaden and Vinny is intense right from the start. You can tell that Vinny has an itch to scratch and with Kaden leading the way it's no wonder that Vinny follows. Both of them take turns sucking the shit out of each other and Vinny in particular can't get enough of Kaden's beautiful cock. Kaden returns the favor, putting Vinny up against the wall and showing him how good a blowjob from a guy can be. Inspired, Vinny pushes Kaden on the bed and the sixty-nine session that follows is so hot you should probably remove all flammable items from around your computer before you watch it. Check out the look of ecstasy in Vinny's eyes as he swallows Kaden's meat all the way down to the base, finally getting to scratch that itch you know that every straight guy has to see what the other side has to offer. <br /><br />Cum Geysers ... <br />This video ends with two amazing cum shots. Kaden and Vinny lie side by side, head to toe and toe to head and when Vinny enters the home stretch he gazes longingly at Kaden's beautiful cock for inspiration before blowing a massive load all over his own chest. A geyser of cum erupts everywhere, big thick wads shooting out, covering his stomach and even hitting the wall behind him. He even tastes a little of it! That's all the inspiration Kaden needs to unleash a salty splatter of his own and Joe (from MyStraightBuddy.com behind the camera) makes Vinny taste a little bit of that too, knowing full well that Vinny wanted to try a sample of Kaden's man-batter but was just too new and shy to ask. Then the two of them exchange a warm, wet kiss to seal the deal.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Vinny",
      "person_id": 35165
    }
  ],
  "release_date": "2010-12-27",
  "scene_id": 70194,
  "series": "Kaden's Recruits 2",
  "tags": [
    "Gay"
  ],
  "title": "Kaden & Vinny"
}