{
  "collections": [
    "Active Duty"
  ],
  "description": "Nick Gunner & Shawn ... <br />Nick Gunner returns, paired up with fan-favorite Shawn where Nick Gunner takes things to a whole new level. Previously we've seen Nick Gunner get head and get his ass eaten by Fox and we've seen quite a bit of him over on My Straight Buddy, but we've never seen him suck cock or get that hot little ass fucked proper. Double Time 10 changes all that. Shawn breaks Nick Gunner in 'AD style' and what a break-in it is. Shawn was the perfect match to bring Nick Gunner across the line and these two got along so well that you might be wondering by the end if this didn't spark up a 'bromance' between these two studs. We can dream can't we? <br /><br />Finally, Nick's a Team Player ... <br />Whether a bromance resulted or not, one thing is for sure: Nick Gunner is now a team player and we've all been waiting on that for awhile. I know I have at least. There's something about this sexy baby-faced stud pup that just drives me crazy. I'd chase him all across the world and we practically did to make this scene happen. In fact, my buddy Joe from My Straight Buddy filmed this scene while I was busy in the other hotel room filming one of our recent War Chest finds, Tanner. I gotta give it to Joe, he did a stunning job capturing this scene and I'd rate it up there as his best. Things kick off with these two studs on the bed shootin' the shit. But I knew Shawn and Joe could handle the mission. <br /><br />Take Off Your Clothes ... <br />'Bring it on' says Nick Gunner and from there, it's on. Shawn dives right in and starts taking Nick Gunner's clothes off. It doesn't take long for them to have their hands all over one another. Nick Gunner loses his boxers first as Shawn strokes his cock and plays with his balls. Shawn throws Nick Gunner's ass up so we can see that sweet little hole as he rubs and plays with Nick Gunner's cock. Before you know it, Shawn is on Nick Gunner's cock, sucking it like there's no tomorrow. Nick Gunner is hung like a giant for a little guy and the big cock fills Shawn's mouth nicely. I could watch this all day, but lots more is about to follow. It's obvious that Nick Gunner and Shawn are both enjoying the blowjob that Shawn is delivering, but things are about to take a turn. <br /><br />Suckin' Before The Fuckin' ... <br />Shawn positions himself over Nick Gunner and shoves his cock down his throat, thrusting fast in and out of Nick's mouth. You can see the hunger as Nick devours the dick and Shawn feeds his hunger. I'm not sure I've ever seen a hungrier first-timer go after a cock so eagerly. They position themselves in a nice sixty-nine and share in the glory. Some great ass eating follows the cocksucking and Nick Gunner gets his first taste of man hole. He's going about it just as eagerly as he did sucking cock. Shawn pushes his cock back so that Nick can suck him while he eats his hole and Nick Gunner pays both equal attention. <br /><br />Slam Fucked Into the Next Room ... <br />Shawn positions Nick to give him unlimited access to that sweet little hole of Nick's and he starts eating and fingering it, preparing it for the fuck. He gives us a nice look at that pretty pink pucker before he fucks it and it looks ready for action. Shawn fucks Nick Gunner six ways to Sunday and literally wears his ass out. We're not sure how Nick didn't collapse from the slam-fucking that Shawn gave him, but his whimpering and cries certainly indicated he was in a blissful pleasure (and or pain, or, that delightful combo where the two collide).",
  "models": [
    {
      "name": "Nick Gunner",
      "person_id": 35123
    },
    {
      "name": "Shawn",
      "person_id": 35230
    }
  ],
  "release_date": "2011-02-15",
  "scene_id": 70203,
  "series": "Double Time 10",
  "tags": [
    "Gay"
  ],
  "title": "Nick Gunner & Shawn"
}