{
  "collections": [
    "Active Duty"
  ],
  "description": "Jake & Diego ... Jake makes the first move and locks a deep kiss on Diego's sexy lips right away. Just the intensity of the kiss should get you stiff in your jeans. It certainly does for Jake who wastes no time getting his shirt off and moving in closer to let Diego play with his cock. Jake bites on Diego's neck a few times before asking him if he wants to suck his dick. Off come the jeans and out comes the monster cock that Jake's packing. Diego is on it like white on rice and it doesn't take long for it to reach its full potential. Jake Doesn't Discriminate ... If there was ever a straight man that loved a hot blowjob from another guy, it has to be Jake. He just loves the attention. His huge cock tells the story as it grows thicker and thicker. Diego seems to have found just what he was looking for as the beast continues to grow bigger, Diego seems to get hungrier and hungrier. The chemistry here is off the charts. These two have known each other in passing for quite some time, but today is the first time they've been able to really get to know each other. Plowin' Like a Pro ... Diego is working that big dick like a part time job. You'd think it would take lightening striking to get him off that big cock. But Jake wants to taste Diego's cock, too. They decide on a nice sixty nine so they can both enjoy themselves. Jake let's Diego get on top of him and straddle his face while Diego takes top. Watching them make love to one another's cocks is so delicious to watch. Jake is getting good at sucking cock and he just might learn a few more tricks from Diego who is going to town on his cock like there was no tomorrow. There's one word to describe the heat here and that would be hungry. The moans alone are enough to send us over the edge as we watch and listen to these two devour each other's meat. Jake sneaks his finger around to start playing with Diego's hot little hole and it won't be long before he's coaxing Diego into riding his cock. It proves a slight challenge for the veteran who has taken a few cocks like a champ in his time, but this one is a bit bigger than he's used to. The second try proves successful as he slowly sits down on the huge cock and takes it deep. Diego's dick is rock hard, bouncing in the breeze. You can see the steam come off these two as Jake plows that ass like a pro. Diego is stroking his cock hard and fast as Jake rails his ass good. Cock Slappin' & Hard Ridin' ... One of the hottest moments come when Diego turns around, facing Jake and rides that cock so hard and fast that his own hard cock is slapping Jake in this stomach. Jake takes full advantage and strokes Diego's cock for him. They switch it up and do a side position that allows us to see that huge schlong plowing in and out of Diego's ass, every last inch balls deep. After he's rode him hard and gotten all wet, Diego gets on his hands and knees doggy style and gives Jake the reigns. Jake takes control of that tight little ass and fucks it good and hard. The last position seals the deal for both guys as Diego takes it laying on his back. It doesn't take long for him to shoot his juicy goo all over himself as Jake plows him hard and deep. Jake quickly follows his lead and pulls out to deliver a huge fucking load of hot jizz all over Diego's stomach as it mixes in with Diego's juice. Diego is soaked in cum, but you can feel the intensity vibrating as these two go for one last hot kiss. Somebody pass me a fan, I'm burning up .",
  "models": [
    {
      "name": "Diego",
      "person_id": 35077
    },
    {
      "name": "Jake II",
      "person_id": 35239
    }
  ],
  "release_date": "2011-02-15",
  "scene_id": 70202,
  "series": "Double Time 10",
  "tags": [
    "Gay"
  ],
  "title": "Diego & Jake"
}