{
  "collections": [
    "Active Duty"
  ],
  "description": "Bric & Kai ... Kai hit me up and said he was down to try something new and that he'd really been thinking a lot lately about what it'd be like to suck another guy off. He said he'd been really fantasizing about it. Kai had also told me that he gave awesome massages and that got me to thinking. Maybe I could convince Bric to try a massage from another guy and if things went smooth, maybe he'd go a little further. It was worth a shot. So, the first thing I did was show Kai a picture of Bric. I knew this would get his motor running and by the time he showed up for the shoot he'd be so anxious that he'd do whatever it took to help convince Bric to take that next step and let him get that beautiful uncut cock in his mouth. Now all I had to do was convince Bric to open up enough to allow things to happen. After many text messages back and forth, I finally convinced him. It was on and I was ready to make damn sure our boy Bric got the best damn first blow job from another guy that was humanely possible -- even if I had to jump in and play stunt throat. Unfortunately for me, that was not how it all panned out, but the way it did was just fine with me as I'm sure you'll agree. Things kick off with me chatting with Bric who is looking like a million dollars with those gorgeous eyes and that beautiful smile glistening in the sunlight. We joke and bit and he blames me upfront for whatever happens. I gladly take the blame. I cut through the bullshit quick and get Kai in the room with us. He brings in some massage oil and Bric flips over on his washboard abs to give him access. Kai starts out slowly rubbing Bric's beautiful back, working and kneading his muscles as I watch (I mean film) with my tongue hanging out. I'm so jealous at this point that it's all I can do not to knock Kai in the head with the camera and take over. I somehow contain myself, but the jealously remains. Both of these guys are very lucky. I mean who wouldn't want a massage from Kai first of all and who the hell in their right mind wouldn't want to be rubbing all over Bric's gorgeous body? Kai is a sly devil and it doesn't take long for him to start working Bric's boxers down over those perfect round cheeks to reveal that delicious bubble butt as he works his way further down. The sight of this glorious gluteus maximus gets Kai's cock all hot and bothered as he pulls and tugs at his hard cock through his boxers, pulling it out and jerking it. He slowly, but deliberately, works his way right down to Bric's cock and as soon as he touches it, you see it getting hard. It doesn't take much rubbing before Bric's dick is as hard as a, well . . . brick! His foreskin has disappeared enough to reveal the huge, hard head and Kai is getting anxious. He can't seem to help himself as he goes in for the first lick. His tongue explores Bric's nice cock just as his hands had his body and this massage has suddenly gone to the next level. There's more than one way to give a good massage and it won't be long now before Bric can't resist flipping over for the front side. You can see him rubbing his head and nearly squirming as Kai licks that cock more intensely. A quick slap on the ass and Bric is on his back, hard cock standing at attention and ready for action. Kai takes his time, teasing Bric even more by licking his thigh and hitting all the right spots as he massages his balls and strokes his hard cock slowly before going down with his awesome tongue and slowly beginning to lick the head of the monster cock. You can see the approval on Bric's face as Kai's tongue continues to explore his cock before Kai starts taking it into his hot mouth. Kai slowly begins taking the big uncut jewel deep into his throat and Bric's hips begin to move as he rubs his head and looks down at Kai as Kai slowly worships his cock. Can you imagine how fucking intense this must be for Bric? Everyone should enjoy a nice, slow blow like this at least a few times in their life. Kai speeds things up and starts sucking faster and harder as Bric throws his head back and tries not to lose his mind, letting out deep moans and enjoying the hell out of this special attention. Kai goes faster, things keep getting more intense and Bric is somewhere between heaven and ecstasy by now. He's pumping his hips forward as Kai meets his thrusts with his throat and mouth. You can see the deep breaths that Bric is taking as he grabs Kai's head and starts pumping his cock into his face. Finally, Bric can't hold back any longer and he shoots his load all over himself as Bric strokes his cock. Bric is obviously blown away by what just happened as all he can do is breathe hard and rub his head. He does have one thing to say and that's I guess it's true what they say and I think it is. Welcome to our world, Bric, we're glad to have you!",
  "models": [
    {
      "name": "Bric",
      "person_id": 35047
    },
    {
      "name": "Kai",
      "person_id": 35172
    }
  ],
  "release_date": "2011-07-17",
  "scene_id": 70205,
  "series": "Ready Reserves",
  "tags": [
    "Gay"
  ],
  "title": "Bric & Kai"
}