{
  "collections": [
    "Active Duty"
  ],
  "description": "Bric & Taylor ... Things start out on the juicy side right from the beginning as Bric tells us a little story about something that transpired between he and a good friend recently. It was totally by accident and he was drunk (surprised?). But, it happened nonetheless. He's sticking to the story that his friend took advantage of him but if the way he gets down on Taylor's cock is any indication I think he took to being taken advantage of just fine! The story gets Taylor going and he's already sporting a hard cock in his jeans as Bric tells the tale. Taylor takes notes from the story and by the time he's done telling, Taylor has his cock out, stroking it. He's ready to see what Bric learned and so are the rest of us. I leave the two of them alone to go put a pie in the oven and Taylor tells Bric he wants to see what he learned from his friend. Bric wastes no time at all taking that big cock in his mouth and practicing his newly learned skills. And practice does make perfect as Taylor decides that yes, Bric has done this before. Taylor's big cock is also loving what he's learned as Bric really gets into servicing the big piece of meat. Taylor starts stroking Bric's cock which is rock hard already and you can tell right away that this is going to be a good pairing. Taylor is very vocal as Bric works his magic. Bric pulls Taylor's jeans off to give himself better access but Taylor turns the tables on him and goes for a taste of his perfect uncut gem. He's licking and sucking it slowly and intently as Bric lays back and enjoys. There's something mesmerizing about that beautiful cock and whatever it is has Taylor's full attention. He gets Bric out of his jeans too and continues to work his cock. There's a priceless moment here as Taylor is clearly working that cock over just to Bric's liking, Taylor says, So, is that better than your friend? Bric shakes his head and says, You win. But Bric isn't done getting himself a taste of Taylor's nice big cock yet. Taylor stands next to the bed and Bric takes his big cock back down his throat, working it with his mouth and hand in rhythm as he strokes his own stiff dick at the same time. His cock hasn't gone down once during all this and I think it's safe to say that he's enjoying this. I'm not sure when I've seen a newbie take to a dick like this and really enjoy it. Bric obviously means business and Taylor is really digging his expertise. Taylor really gets into licking and sucking the shaft of Bric's dick as Bric slaps the big beauty all over his face and tongue. Talk about making love to a dick. But two can play that game and once he's been driven to the edge a couple of times by Taylor, Bric decides to give as good as he got and gives Taylor a surprise in return. They switch things up a few times and they both get their fair share of the other before getting in a sideways sixty-nine where all hell is sure to break loose.",
  "models": [
    {
      "name": "Bric",
      "person_id": 35047
    },
    {
      "name": "Taylor",
      "person_id": 35153
    }
  ],
  "release_date": "2011-08-20",
  "scene_id": 70207,
  "series": "Direct Fire 1",
  "tags": [
    "Gay"
  ],
  "title": "Bric & Taylor"
}