{
  "collections": [
    "Active Duty"
  ],
  "description": "Bastian, Evan and Kaden ... Now, the great thing about this threesome is that it didn't start out with the intention of being a threeway. Kaden was -- well, until he couldn't control himself -- simply going to man the camera and direct the action. But, things didn't turn out as planned. (Shocking!) Kaden Speaks ... Here's what Kaden had to say about the action: Evan and Bastian are both amazing guys with great personalities. Evan seemed very eager to have a taste of Bastian's sexy cock. Those bedroom blue eyes are a site to see while he services Bastian's member with his mouth and tongue. It is obvious that Bastian has a desire to return the favor. Bastian puts Evan on top of the headboard and starts sucking his balls and slobbering all over Evan's hard dick. Evan gets dominate and pushes Bastian on the bed and decides that he wants to suck Bastian's dick while he is getting head. Bastian is overcome with desire for Evan and as his perfect ass hovers over Bastian's face. He takes action and starts rimming Evan! Kaden Continues to Not Control Himself ... I was so overwhelmed by how fucking hot this scene was. I decided to pull rank and take Evan's cherry myself! As we have all noticed Evan has a perfectly round ass, I could not resist. Bastian took over the camera and I had no problem at all making my dick stand at attention. My dick has perfect military bearing when it comes to hot young virgins like Evan. I struggled in the beginning but I managed to open Evan's ass right up. I fucked him until I flipped him over and blew my huge load all over his chest. After getting mine out of the way, I decided to let Bastian get his. Evan sucked Bastian until he came all over his chest. I believe there was a 'plot' conspired to cum on Evan's face as well. I plead the 5th amendment on that one! After having his chest drenched in our cum Evan was finally ready to blow his load. Bastian was eager to help him cum! This scene was phenomenal and had a little twist in it. I hope you enjoy!",
  "models": [
    {
      "name": "Bastian",
      "person_id": 35174
    },
    {
      "name": "Evan",
      "person_id": 35082
    },
    {
      "name": "Kaden",
      "person_id": 35022
    }
  ],
  "release_date": "2011-04-27",
  "scene_id": 70200,
  "series": "Kaden's Recruits 3",
  "tags": [
    "Gay"
  ],
  "title": "Bastian, Evan & Kaden"
}