{
  "collections": [
    "Active Duty"
  ],
  "description": "Korbin & Nolan ... <br />This scene is another hot duo that really came out of nowhere for me. It features a brand new recruit that we've only met in the War Chest so far and marks the debut of another new recruit that none of you have ever seen before. I've got to admit to holding back a special treat with the fresh baby-faced Korbin. I've known this stud for quite awhile now and just never got around to putting him on video. Consider him reserved ammo if you will because I knew when he exploded onto the scene, you'd all fall for this one. But I waited patiently to deploy this trooper until the perfect time. <br /><br />Ready for the Assignment ... <br />When Nolan (yes, that big, beefy stud from the War Chest) called me up and said he was ready for his next assignment I knew it needed to be something extra special. It just so happened that when the call came, Korbin was sitting right in front of me. My mind started racing and the gears went into overdrive. Korbin had already agreed some time ago to accept a duty assignment, but we'd never really pinned down when that would be. Immediately I knew that the time was now. I pitched the scenario to Korbin as soon as I hung up the phone with Nolan and the rest as we say is Active Duty history. <br /><br />Jeez, You're Already Hard? ... <br />I wasn't the only one excited about the idea I'd come up with as you'll see when the camera comes on in this scene. Nolan is already sporting a huge fucking hard-on in his gym shorts. This big stud is all man and the tent in his shorts was a testament to Korbin that something large and delicious waited just beneath silky red material of Nolan's shorts. The look on Korbin's face is of both delight and frieght all rolled into one. I urge him to reach over and give it a feel to make sure it's real. A quick grab and he confirms it's real. The look on Nolan's face is one of pride and who can blame him with a cock like that? <br /><br />Get It Out! ... <br />We waste no time in getting the big cock out of the shorts and into Korbin's hot little mouth. Nolan just kicks back and gives our little man free reign with the monster as Korbin plays with it. Nolan places his hand gently on top of Korbin's head and that's his que. As Korbin sucks the monster dick, Nolan tells him to wait until he gets ahold of that little ass. From there we know we're in for a treat. Korbin loses his shirt and continues servicing the studs big meat as Nolan reaches around and pulls down Korbin's shorts and starts playing with his cute little ass. You can tell Nolan is ready to pounce but he remains focused on the good head Korbin is giving as he rubs and squeezes Korbins ass. It isn't long before Nolan is stroking Korbin's hard cock and slapping his own beast on his belly. <br /><br />Ready for the Fuckin' ... <br />Nolan is ready to fuck and Korbin is ready to get fucked so the next step is obvious. The big stud eases his huge cock into Korbin's tight little hole and the look on Korbin's face as that big dick penetrates his tight virgin hole is priceless. Nolan slowly goes deeper, burying his huge meat balls deep in Korbin as Korbin gives off some of the best moans and faces. It doesn't take long for it to start feeling really good to Korbin as he begins jerking his own hard cock while Nolan delivers the dick to his back door, knocking harder, faster, deeper with each passing moment. I think Nolan is amazed at the little guys ability to handle his cock so well and it has to turn him on. He says to Korbin, 'I want you to cum for me, baby boy' and I nearly lose it. What a hot fucking thing to have a stud like this utter to you while he's balls deep inside you. It must have had the same effect on Korbin because it isn't long after Nolan's plea that Korbin is shooting a hot stream of jizz all over the place. <br /><br />An Interesting Turn Of Events ... <br />But Nolan isn't quite done. Once Korbin has enjoyed his intense moment of pleasure, Nolan puts our little trooper on his hands and knees and takes that ass from behind, pumping him full of hot, hard dick harder than before. It's Nolan's turn to get his and he takes it. All Korbin can manage to utter is 'fuck me, daddy' as Nolan plows away, heading toward the finish line. This is where things take an interesting turn. As I'm watching it all unfold I decide it would be so fucking hot to have Nolan cum inside the condom while he's still deep in Korbin's ass. Nolan likes the idea and in no time at all he's shooting his load inside Korbin. After he's drained his load into the condom, he pulls out and dumps the contents of the condom all over Korbin's back. Fucking delicious. Korbin would later tell me that he could feel Nolan's cock pulsating inside him with each squirt of jizz. I was jealous.",
  "models": [
    {
      "name": "Korbin",
      "person_id": 35251
    },
    {
      "name": "Nolan",
      "person_id": 35173
    }
  ],
  "release_date": "2011-02-15",
  "scene_id": 70204,
  "series": "Double Time 10",
  "tags": [
    "Gay"
  ],
  "title": "Korbin & Nolan"
}