{
  "collections": [
    "Active Duty"
  ],
  "description": "Blake, Rusty & Nick Gunner ... I couldn't wait to get our latest new find, Rusty, into some hot action so I quickly called in the reinforcements and got a hot three way set up. This hot trio brings back two Active Duty favorites that we haven't seen in a little while now. Everybody loves little Nick Gunner and it's no wonder. He's such a cute little devil and today he proves just how horny he can be when you put him in the right situation. He comes through in this scene and not only does a damn good job as a top, but also bottoms for the other returning favorite, Blake. Yes, big, huge-dicked Blake. Blake is back and he's brought that big meat along with him to give to Rusty as a welcoming gift. Rusty doesn't quite know what he's in for, but he's a real trooper and by the time it's all said and done he proves just how damn eager he is to please. Things kick off with us joking about Nick Gunner watching the Food Network and how it's making him hungry. What he's really watching is some good porn and it's making him horny. Blake is already licking his lips as he sits between these two studs and anticipates what's about to go down. As soon as we finish the chitchat, Blake is all over Nick Gunner, Rusty is all over Blake and you can tell right away that these three are about to show us some real fun. Rusty is all smiles as he rubs on Blake's stomach and lifts his shirt. He and Nick help Blake out of his shirt and they lose theirs, too. The shorts quickly follow and the boys enjoy a little foreplay as they explore each others bodies. Rusty and Blake embrace for the first kiss and Rusty reaches down to discover the monster in Blake's boxers. Nick Gunner is fascinated by Blake's nipples and spends some time playing with them as he plays with his own hard cock. A kiss between he and Blake follow as Rusty gets Blake out of his shorts and starts sucking his big dick. Nick keeps on sucking and licking Blake's nipples as Rusty handles that big cock, taking it down his throat and working it good. Nick Gunner is watching as Rusty enjoys Blake's cock. You can tell he wants some attention himself so Blake wastes no time giving him some loving. He peels Nick Gunner's boxers off and goes to town on that delicious dick as Rusty keeps the pace on his. The curve on Nick's dick is so awesome and Blake seems to love it. He and Nick go for another kiss and then they put Nick in the middle so Rusty and Blake can share that perfect cock together. Rusty wastes no time getting himself acquainted with Nick's monster as he sucks the shaft while Blake takes the balls and then they meet in the middle and share it al. Nick is in heaven and that beautiful face is telling the story as he moans. Nick Gunner has been itching to get his hands and mouth around Blake's big cock since the scene kicked off and now he gets his chance. Blake moves up to give him access while Rusty keeps servicing Nick. Blake's cock makes a big play toy for Nick Gunner who seems to be having all sorts of fun playing with the big cock. He makes love to it with his mouth, swirling his tongue around the head and working the shaft with his hands. He's gone pro on us and it's showing in this hot three way. Rusty wants to see that pretty little ass that Nick Gunner is sporting and he gets him on his knees and starts tonguing Nick's hole as he spreads his cheeks out. Meanwhile Nick is letting the good feeling he's getting from behind rub off on what he's doing to Blake's dick as he gets more and more into stuffing that huge cock down his throat. Rusty positions himself so that his beautiful furry ass is in the air for us to see as we watch this trio in their tangle. Rusty is munching on Nick's perfect ass while Blake and Nick kiss again. Nick is letting us know just how much he's liking what's going on at his back door as he gives the camera some come fuck me looks and gets more aggressive on Blake's cock. He's trying his best to deep throat Blake's dick and doing a damn good job of it. Once he starts sucking and licking on Blake's huge balls he really gets a rise out of Blake. Things switch up and Nick Gunner takes Blake's place as Rusty takes Nick's place for Blake to eat his perfect furry hole as Rusty sucks Nick Gunner. Nick is enjoying the hell out of this as he rubs Rusty's back. But Blake has further plans for Rusty's ass and before you know it, he's got that huge cock buried balls deep in Rusty's butt, fucking him hard and fast. Rusty takes it like a champ---ever last thick inch of it and doesn't wince or whine once. Blake is pounding him good as Rusty keeps himself occupied at the other end with Nick's big cock. Nick is really getting into watching Rusty take that big cock as he fucks Rusty's face. In fact, he's so turned on by it that he blows a huge load all over Rusty's face. Blake bends down as he fucks Rusty and licks it off his face and then they kiss and swap the gooey goods. Blake is on a roll and Nick Gunner is next in line for a pounding as he swaps place with Rusty and takes his turn at bat with Blake's huge dick. Blake is pounding him just as hard and deep as he pounded Rusty and Nick Gunner is really liking it. He's sucking Rusty's cock, but takes the time to express his emotions for us quite well. He loves the camera and it seems he also loves a big dick in his ass, too. Rusty is also liking the attention his cock is getting from Nick Gunner. It's Blake's turn on bottom and Nick Gunner steps up to plate to prove he can do the job and cum again. He's rock hard and slamming in and out of Blake's ass like a piston as Blake jerks his own cock fast as he sucks Rusty. Nick is banging him fast and hard and Rusty is stuffing his throat full of cock and Blake seems to be in heaven. Nick Gunner seems to be able to go forever and that's just what Blake needs to make him shoot his load. Nick Gunner and Rusty decide to cum on Blake's face (load number two for Nick!) and they both blow huge loads, covering him in cum. Rusty decides to lick it off and share it with Blake and Blake swallows what's left.",
  "models": [
    {
      "name": "Blake",
      "person_id": 35040
    },
    {
      "name": "Nick Gunner",
      "person_id": 35123
    },
    {
      "name": "Rusty",
      "person_id": 35168
    }
  ],
  "release_date": "2011-07-17",
  "scene_id": 70206,
  "series": "Ready Reserves",
  "tags": [
    "Gay"
  ],
  "title": "Blake, Nick Gunner & Rusty"
}