{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight our War Chest ammunition comes from a close friend of mine who will be doing some guest-directing for us here at Active Duty in the near future. Recently, I was introduced to what would become a very quick and dear friend who shares my genuine love and admiration for our men in uniform. His nom de porn is Major Wood and you may have heard that name echoed around in the circles of military lovers the last several years. Major Wood is one of the kindest, most gentle human beings I've ever met and he has a true love in his heart for the men he befriends. His loyalty, like all good fellow military lovers, is with his men. He is one of the best photographers I've had the pleasure of getting to know and we've now begun to include him on our Dirty Bird Pictures projects as our head photographer. His skill and sharp eye for capturing something very special is unique and I look forward to a long working relationship with him.<br /><br />Tonight, though, I'd like to focus on another talent of Major Wood. In getting to know him, he has shared so much with me and while digging through his vault we came across so many guys that I've wanted to work with over the years and never knew that the source of these beautiful faces had in fact been Major Wood. Like I said, he's a generous guy and in trying to look out for his men he often tried to hook them up with work. Tonight we are featuring a young man that Major Wood discovered several years ago who would go on to work with a few other studios. He disappeared quickly from the scene and the reasons why are an entirely different story. Major Wood and I are in discussion with Brian now and I've offered him a hefty contract to return to the spotlight. We'll see how that goes. In the meantime, let's enjoy the very first video that Brian ever did   in our War Chest Update   which was shot by my friend Major Wood in the 'helping hand' fashion that he is known for where he takes Brian over the edge to an explosive cum shot.",
  "models": [
    {
      "name": "Brian",
      "person_id": 35046
    }
  ],
  "release_date": "2008-10-29",
  "scene_id": 70242,
  "series": "Brian",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Brian"
}