{
  "collections": [
    "Active Duty"
  ],
  "description": "These three were the perfect threesome. Payne does one hell of a job keeping up with Cooper and Kaden and the results are beyond hot. Five minutes in and all the cocks are out and hard. Cooper is in the middle of the trio so he's bound to get his hands around some nice cock first. Cooper reaches over and grabs Payne's nice uncut cock and starts stroking it a little and goes right to town sucking on the nice piece of meat as Kaden reaches over and latches on to Cooper's cock and strokes him.Payne says Cooper's a pro cocksucker and Payne says he wants to see what Kaden's got so they put Payne in the middle and Kaden goes down on Payne's cock as Payne strokes Kaden's hard dick. Cooper watches and jerks his own cock as these two hot men get to know each other a little better. Kaden takes to sucking that nice uncut cock, showing off his skills and Payne seems delighted. You'll drop your jaw at what happens next.Kaden sides up to Payne as Cooper sucks Payne and Payne reaches out and grabs Kaden's hard cock and puts it in his virgin mouth. I almost fainted. I get some really great close-up shots of Kaden fucking Payne's hot little mouth and it is a sight to behold. Kaden goes back to sucking Payne while Payne takes a taste of Cooper's hard cock and the threesome continues to unfold. Kaden licks and sucks every inch of Payne's hot bod as Payne sucks Cooper's cock like a quick learner. Cooper and Payne decide to give Kaden some extra special attention and Cooper fingers and plays with Kaden's asshole while Payne sucks his cock nice and deep.It's time to get someone fucked and Cooper is ready for some cock in his beautiful ass. Kaden saddles up to do the honors first and Cooper hops on to take it for a ride. Payne stands up and feeds his cock to Cooper while Kaden plows his hole. They bend him over doggy-style and Kaden takes another round as Cooper keeps Payne's cock entertained. Payne gets underneath Cooper and they do a hot sixty-nine as Kaden bangs Cooper's ass harder and faster. Payne has a front row seat to all the hot action as he and Cooper suck each others cocks.Payne takes his turn at Cooper's ass next and they put Cooper on his back. That nice, hard uncut cock slides right in and it's on. It doesn't take much of that hot cock to send Cooper into a frenzy as he blows his load all over himself. Kaden follows Cooper's lead and lands his load all over Cooper's chest and slaps it around, mixing the cum. All this cumming has Payne ready to blow and he pulls out and puts his hot cum all over Cooper's belly.There you have it, troops. Payne's hardcore debut. Nearly an hour of unedited, raw footage. In fact, you may notice some sound quality issues as my old camera was on its last leg. I had to retire the camera after this shoot!",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Payne",
      "person_id": 35125
    },
    {
      "name": "Cooper",
      "person_id": 35186
    }
  ],
  "release_date": "2009-02-18",
  "scene_id": 70256,
  "series": "Cooper, Kaden & Payne",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Cooper, Kaden & Payne, Scene #01"
}