{
  "collections": [
    "Active Duty"
  ],
  "description": "We're back this week with an extra hot War Chest Update for you. Remember that hot Marine, Trent, from Bulletproof 2? Yes, the one that got plowed deep and hard by Thomas when he showed up with Major Wood and seen what all was going on with Cash, Thomas and Gage. Well, Trent made his way back to the house another night and we were all sitting around looking for something to get into. DJ was there and so was Gio. I got the bright idea that it might be hot to see these three mess around. DJ liked my idea. He thought Trent was super hot and wanted himself a little taste of those cowboy goods. Trent is such a fucking hottie and he's ready for any fun you can throw his way and you know we can throw it around here at Active Duty.<br /><br />So, Trent is back and he's eager and ready for some more fun. Trent said he had so much fun the last time around with Thomas and the other guys that he just couldn't wait to get back for more. He said he was really turned on by Thomas' hot pecs. Tonight I've got Gio and DJ hanging out, having a few beers and we did not expect to do any shooting. This was totally off the cuff and unplanned. But when duty calls, we have to come to the frontline and report!<br /><br />Things kick off with Gio and Trent kicking back on the couch enjoying some porn. They are comparing crotches and when it comes time to show them off, Trent tells Gio, 'Show me yours and I'll show you mine.' That's all it took and the two guys strip off the clothes. Trent is already sporting a nice hard cock and Gio's ass is out of this world. Gio gets right down to business and starts sucking on Trent's cock. Gio is a pro cocksucker and it shows in how well he administers his oral skills on Trent's big cock. Trent is enjoying the attention and has kicked back on the couch to relax. I leave the two alone to their own devices and go roaming through the house to find DJ. While I'm gone Trent and Gio get more than acquainted. These two get right into it.<br /><br />Gio suddenly disappears, leaving Trent with a raging hard cock. Enter DJ Stage right to save the day. Trent grins from ear-to-ear when he sees how hot DJ is. You'd have thought he fell slap in love. And who wouldn't? Trent doesn't hold back and he tells DJ exactly what he wants. I think DJ was a little thrown off by how blunt our cowboy was about things. DJ jumps right in and picks up where Gio left off. Gio reappears and starts giving DJ head while Trent comments about how well they both suck cock.<br /><br />It's Trent's turn and he takes it at DJ's hard cock. He goes down and it's some time before he comes back up for air. He has himself some fun swinging from that nice cock and then turns around and puts his hot ass in DJ's face for DJ to eat while he turns around and sucks on Gio's cock.<br /><br />Trent decides it's time to get a fat cock up his ass so he sits straight down on DJ's hard cock and starts riding him hard and fast. Gio moves in and sucks Trent's hard cock while he bounces up and down on DJ. Soon, Trent does a turn and moves around and Gio gets down and starts sucking and licking DJ's balls and ass while DJ pounds Trent hard as Trent rides him faster and faster. What happens over the next twenty minutes is sure to blow your mind (among other things) but I won't spoil it for you. Check out this week's War Chest Update and see the entire finale. Just goes to show what can happen when you throw a few beers, a couple of hot and horny Marines, myself and the camera together on any given night. Enjoy!",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Giovanni",
      "person_id": 35177
    },
    {
      "name": "Trent",
      "person_id": 35190
    }
  ],
  "release_date": "2009-04-22",
  "scene_id": 70265,
  "series": "DJ, Giovanni & Trent",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "DJ, Giovanni & Trent"
}