{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm in love again! It happens every week. Sometimes two or three times. This week, I'm in love with our latest new recruit, Paulie who we are posting in the War Chest Update. Now Paulie was a surprise. He was unexpected. You know, like a 'love child.' I had originally met another Marine buddy of his in the strip club that I frequent and his friend called me up and was ready to do his first solo. He wanted to know if it was alright if he brought his buddy along and I said sure. When they arrived, I was immediately drawn to Paulie. I couldn't take my eyes off that gorgeous baby face. Those pretty brown eyes and those long, lushious eyelashes mesmerized me from the moment we shook hands. His friend was a hot redhead with a huge uncut cock that we'll be featuring in the coming weeks, but this week I want to introduce you to Paulie.Paulie is a good Italian boy who found his way from the east coast via the USMC. He's not much on the southern California lifestyle and misses the east coast. I know how he feels. We east coast boys are a different breed and you've gotta really have something special to win our hearts over. Well, Paulie won my heart immediately. He's so cute and just a regular type guy. He's somewhat shy, but when a camera aims in his direction he's suddenly a ham. This one really likes to show off. Paulie is 20-years old, 5' 10' and 170 lbs. He's got beautiful brown hair and those puppy-dog brown eyes that just pull you in and make you wanna keep him.Paulie is playful and really gets into showing off and playing with his ass. He's got a really pretty ass to show off and he spends a lot of time giving us an eyeful of that beefy butt and that perfect hole. By the time it's all over, you'll wanna keep Paulie, too. And, if you're lucky like me, he just might let you. Enjoy this baby face Marine, troops. He's a keeper.",
  "models": [
    {
      "name": "Paulie",
      "person_id": 35124
    }
  ],
  "release_date": "2009-09-23",
  "scene_id": 70275,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Paulie, Scene #01"
}