{
  "collections": [
    "Active Duty"
  ],
  "description": "What better place to be properly introduced to the two hot studs you are about to get fucked up the ass by than in the very bed where it's gonna happen? Ten minutes before it does happen.You may remember that cute Marine from Major Wood's Special Ops: Alpha Company, Sky? Well, Sky has come over to meet some of the Active Duty guys and I've decided to team him up with Domenic and Elijah for some threeway fun. If there's anything military guys are proud of and always anxious to show off, it's their tattoos. So these three strip off their shirts and show off all their ink. It's a manly thing. But it's so hot to watch as you imagine them getting them just to show off to some other dude to prove their masculinity. Men will be boys.After they've established their masculinity, they share in a little male bonding by enjoying some porn together. I wander off to check on my pies in the oven and they quickly start shedding the clothes. Sky is all eyes as the boys strip down. He's trying his best to get a glance of what he's up against. This is also a War Chest first for Domenic and Elijah. They've never worked together. Elijah is always the inquisitive one and he asks Sky what he's willing to do. Sky quickly replies that he'll do whatever. Good answer. The eyes are wandering all over the place. No one can get a long enough glance at the other cocks. Watching them hold a conversation while they try so hard to sneak the peeks is really fun to watch. Doesn't take long for the action to begin to unfold and these three are twisted up like pretzels. The sucking gets things up and running and all the boys get a taste of one another. The War Chest is on fire tonight!While Sky sucks Elijah's cock, Elijah says he wants to put it in another hole. They flip Sky over and get him ready for some good old fashion ass fucking. Sky's legs are in the air pronto. Elijah comments on Sky's beautiful hairy butt and Sky just smiles. Elijah wastes no time getting in deep and Domenic straddles Sky's face and feeds him his cock while Elijah pounds his ass deeper and harder. Sky is taking it like a man and these three have found their stride. Sky starts breathing really hard, he's getting close to blowing and boy does he ever. All over himself. He leaves to go shower up and Domenic and Elijah take over from there.Before this War Chest Update, these two have never been together and I think the excitement had been building between them all week. Elijah wastes no time hunkering down on Domenic's gorgeous hard cock, teasing the poor guy to no end. In fact, he's got him so worked up that as soon as Elijah sits down on that big cock, Domenic can't hold back. He blows his load and fills the condom full of hot jizz in a matter of a minute. But he's not done. He's not giving up another chance to fuck that ass good. He stays hard, saddles up once more and Elijah squats over him for the second go 'round.This time Domenic fucks him six ways to Sunday and then bends over for Elijah and takes Elijah's hard cock up his ass for one hell of a finale. Get your fans ready before you watch this one, troops. Pull up your bootstraps, it's gonna be one hell of a night!",
  "models": [
    {
      "name": "Domenic",
      "person_id": 35080
    },
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Sky",
      "person_id": 35195
    }
  ],
  "release_date": "2009-08-19",
  "scene_id": 70271,
  "series": "Domenic, Elijah & Sky",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Domenic, Elijah & Sky, Scene #01"
}