{
  "collections": [
    "Active Duty"
  ],
  "description": "Quinn and I have been drinking buddies for awhile now. He's a down-to-earth Marine that I met a couple of months ago and have just been taking my time with him, easing him along and getting him ready for the next step. We shot this War Chest Update solo one night while he and I were just hanging out and throwing back a few brews. You can tell when the video starts out that neither of us are all that organized as Quinn searches for an ashtray or another beer on the bedside table and I fumble around behind the camera. But we have a lot of fun when we get together and Quinn is a great sport. He puts up with my crazy ass and I make sure he's up and at 'em and makes it to base the next morning for work. We make a great team like that.<br /><br />I'm particularly crazy about Quinn. I've always been a sucker for a beautiful face and I think you'll agree that Quinn certainly is a looker. He's also adventurous and always up for trying something new. In fact, he's already done his first hardcore scene here at Active Duty that we'll be releasing soon. Sometimes a guy will come along that I just can't get enough of and Quinn is certainly one of those guys.<br /><br />Quinn is big boy standing 6'2' and he's 22 years old. Quinn says he's always been a big guy. He was over six foot by the time he was in seventh grade. He says he's never been a mean bully and these days if he does bully someone it's not because he's trying to take their lunch money. I told Quinn he might have gotten a lot of things from me when I was young (like my virginity) but I'd have beaten his ass if he ever tried to take my lunch money. He just laughs. This guy is a total sweetheart. The conversation we have during this War Chest Update video is priceless   and revealing   and I suggest you take the time to listen to it. You'll come away seeing how Quinn and I have made a friendship and you'll come away being as in love with this Marine as I am.",
  "models": [
    {
      "name": "Quinn",
      "person_id": 35129
    }
  ],
  "release_date": "2009-09-16",
  "scene_id": 70274,
  "series": "Quinn",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Quinn"
}