{
  "collections": [
    "Active Duty"
  ],
  "description": "Colt is a Wrangler-wearing, boot-kicking, cock-loving sailor that I just met recently. I'm introducing him to you now because he's moving pretty fast around here at Active Duty.In the War Chest Update tonight we're sharing his first solo with you because he's already gotten down and dirty in two hardcore scenes in less than a week. This one is horny and he's wasting no time making himself at home here at AD. You're gonna love this guy. He comes right out in the first five minutes of his solo and spills the beans about how much he loves to suck cock. Well, we've got him covered with plenty of cocks to suck around here and so far he's been doing just that. But we've found that sucking cock isn't the only thing Colt likes and you'll see just what I mean here very soon when we unveil his first hardcore scene where he's covered in cum among other great things.Colt is a natural at this. He's 23-years old, 6', 155 lbs. and he likes to draw and read ... and get naked. That's enough for me. Aside from cock, he also loves older women. But the most noticable thing about Colt aside from his great personality and pretty smile is the size of that humongous cock hanging between his legs. It's among one of the biggest we've introduced here at Active Duty lately and you're gonna be drooling when he flops that big, hard piece of meat out and starts stroking it nice and slow, teasing the camera and showing it off. You know he knows he's hung like a horse and just loves to have it admired.I've found there's nothing you can say to a guy with a huge cock that makes him smile any quicker than just telling him the truth. So, when I tell him he has a huge cock, he just smiles and shows it off more.Colt comes out of the gate like a bucking bronco and ends up shooting a big load all over his chest for us. He then rakes it up on his fingers and eats it. Get used to this one, troops, he's a keeper!",
  "models": [
    {
      "name": "Colt",
      "person_id": 35065
    }
  ],
  "release_date": "2009-09-09",
  "scene_id": 70273,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Colt, Scene #01"
}