{
  "collections": [
    "Active Duty"
  ],
  "description": "I'd like to share another of those hot east coast finds with you. While cruising the local Barnes & Noble, looking for a good book, I spotted a really hot guy that was a tad older than I normally approach. He looked a little on the mean side and somewhat unapproachable. But Dallas was so hot I couldn't help myself. I did a few circles around the military history section where he was checking out a few books. Finally, I got the nerve to walk up to him and strike up a conversation. To my surprise and delight, Dallas was very friendly.I asked him about good bars to go to in the area and he gave me several good pointers. At the end of our conversation I slipped him my card and told him to give me a call if he was interested. That night, back safely in my hotel room, I checked my email and there was an e-mail from Dallas expressing interest in my offer. I quickly replied and a few e-mails later we were meeting up at my hotel for his first solo and photos.I'd say of all the guys I met on the trip, Dallas surprised me the most. Not only was he a super nice guy, but he was curious and this led to him being one of the guys on the trip that crossed the line. Dallas ended up in a scene with Conrad, DJ and another new recruit I met on the trip that we'll be introducing to you in next week's War Chest Update. He got his feet wet in that scene and is now ready to move even further across the line. I plan to make another trip soon to see him do just that.Dallas is 28-years old, 5' 9' and weighs about 180 lbs. He's an outdoors lover and likes to hike, loves the water since he grew up in Florida. Dallas wrestled in high school, played football, played tennis and was in three different types of martial arts. Dallas says the camera likes him and I'm sure after watching his video and checking out his gallery you'll agree. He's been to Iraq and has a background in videography himself. For fun he likes to have all the sex he can, go to the lake and play beer pong. Aside from his beautiful face, gorgeous eyes and near perfect body, Dallas has a most impressive set of low-hangers. And don't even get me started on his pretty bubble butt. It's to die for.",
  "models": [
    {
      "name": "Dallas",
      "person_id": 35070
    }
  ],
  "release_date": "2010-06-12",
  "scene_id": 70283,
  "series": "Direct Orders",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Dallas"
}