{
  "collections": [
    "Active Duty"
  ],
  "description": "Remember that hot Marine we featured in dress blues a couple of weeks back? Yes, Derek. Well, the full story behind Derek leads us to this week's new recruit that we are posting in the War Chest Update.Major Wood arrived back east a couple of days before I did and met Derek who he approached to pose for a coffee table book that Major Wood is working on that I'm going to publish. Once they met, Derek was anxious for Major Wood to meet a couple of his friends. Once he introduced the Major to them, Major Wood told them about his friend who produced adult videos. Immediately all three of the guys were ready to strip naked and get down to business. One of them suggested, 'Hell we'll do a circle jerk right here and now.' Major Wood had to slow them down. He told them that the video stuff was my department and they'd have to meet and talk with me.As soon as I arrived I met the three Marines and I had no doubt I was ready to film them.Tonight I'm introducing you to the second of the three: Jameson. This is the one that yanked my heart out and I was instantly in love. He's just so full of life &nbsp; and talk about gorgeous, OMG! This man is one fine specimen. Jameson is 20-years old, 6' 2' and weighs 195 lbs. His hobbies include flying, traveling and riding his motorcycle. He joined the Marines for the college money and hopes to go on to college as soon as his tour of duty is up. He just got back from Afghanistan and used all the money he'd saved to buy his new motorcycle.Now Jameson was also one of the guys on our trip that crossed the line. In fact, the first day I met him with his two buddies they did that three way circle jerk they volunteered. So this was actually his second trip to the rodeo.",
  "models": [
    {
      "name": "Jameson",
      "person_id": 35094
    }
  ],
  "release_date": "2009-11-04",
  "scene_id": 70281,
  "series": "Jameson",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Jameson, Scene #01"
}