{
  "collections": [
    "Active Duty"
  ],
  "description": "There's one in every group. One guy that just grabs your attention and holds it hostage for the duration of your time around him. That's what Joey did to me on my recent trip back east. When I met him in the Wal-Mart beer section he was with two of his buddies (who we'll meet in the coming weeks) but it was Joey that caught my eye first and so I walked up to him and struck up a conversation. From the looks of this guy you'd think he'd be the first one to kick your ass, but as soon as we started talking he had a very disarming smile and friendly demeanor that immediately made me want to go hang out with him and drink the beer he and his buddies were buying. We chatted and laughed for a few minutes standing there in the beer aisle and as I turned to leave I handed him my card. He read it, smiled and said, 'what's this all about?' and as I was walking away I returned the smile and told him to call me and we'd talk about it. I figured it would take him a couple of days, but this guy wasted no time. Major Wood was along with me and by the time we got out to the parking and back to our car, my phone was ringing with a call from a number I didn't recognize. It was Joey and he was still standing in line waiting for his friend to pay for their beer. He was ready to talk business.<br /><br />I told him everything he wanted to know and he said he'd call me back when he got to the barracks. Less than an hour and my phone was ringing again. Not only was he ready to give it a shot, but his two buddies were, too. We set up an appointment and as they say   the rest is . . .<br /><br />During my three week stay back east Joey would prove to be one of my favorites. We spent a lot of time together and he came across the line in some major ways. He not only crossed the line, he ran full speed ahead and past it.",
  "models": [
    {
      "name": "Joey",
      "person_id": 35197
    }
  ],
  "release_date": "2009-10-28",
  "scene_id": 70280,
  "series": "Joey",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Joey"
}