{
  "collections": [
    "Active Duty"
  ],
  "description": "I met Abel along with Joey who we've already introduced to you. If you don't remember Joey be sure and check him out in the War Chest Archives as well. Joey and Abel are buddies that serve together and I've joked with them both about having secrets. Well, we've seen Joey's secrets come out a little so far in his scene with Brian that we posted in the Videos Of The Week section recently. There's much more to come of Joey's explorations as well as Abel. I'm not sure who is callin' the shots between these two, but they've both come a long way since I met them. My guess is they're talking one another into going further, but I'm not sure who is doing the most convincing. Tonight we're gonna get started getting to know Abel. I think you'll agree with me that it's a hard call on who is the biggest catalyst in this friendship.Abel says he's born for this type of stuff and that neither of his friends (there was a third one there that night as well) are gonna be able to compete with him. Abel is 19-years sold, 6' 3' and weighs around 190 lbs. He kinda reminds me of Colin in a way and I'm sure you'll see what I mean. Abel played football in high school. When he has time he likes to snowboard. He says he decided to join the military because he was going to college and working constantly. He had no time for himself and when things got tight, he decided to join up. Abel tells us he's not shy and it's pretty obvious. He's out to have a great time and he's certainly got the personality to make that happen.I tell Abel I'm gonna leave the room and he doesn't have very long to prove what a true pro he is. By the time I get back I expect him to be fully hard and putting on a show. He smiles really big and says he's ready. Once I leave he looks at the camera and gives it two thumbs up and ask you if you're ready. This one is a character for sure and just the type I like. I laughed out loud when I went back and watched him playing to the camera. He's a live wire and that cock is up and at 'em in no time flat. And Abel pays plenty attention to the camera, inviting you in. He has the smoothest milky white skin and boyish charm that gives him a certain sensuality that is irresistible. His cock is a nice match for his larger frame and that smile he sports and flashes will make you melt. After an entertaining show of all the goods, Abel blows a huge load for us and yells 'fuck yeah'. This one is a keeper.",
  "models": [
    {
      "name": "Abel",
      "person_id": 35198
    }
  ],
  "release_date": "2009-12-02",
  "scene_id": 70285,
  "series": "Abel",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Abel, Scene #01"
}