{
  "collections": [
    "Active Duty"
  ],
  "description": "In every group there's always that one that has a certain sparkle in their eye, a sparkle that says there's a lot more there than may appear on the surface. I met Blake on my recent trip back east and instantly I was crazy about him. There's something about his smile and his candid attitude about what he wants that makes you wish you were that young again. He's the epitome of youthful lust and adventure and he knows exactly what he wants. And he's not the least bit shy about it. I'm sure once you've watched his video in this week's War Chest Update, you'll agree.At 19-years old, Blake knows himself pretty well and he knows he loves himself some hot sex with hot men. His smile and eyes just glow and he puts you in the mind of some 1950's star in their prime that you just can't put your finger on. He radiates and the camera loves him. There's something else the camera loves that Blake brings with him, too. Blake is hung like a bazooka! I'm not sure the last time I encountered a dick of death quite like his. It's beautiful and somehow it makes him remind me of a very young Cole. He certainly shares the cock and the playful nature that Cole brings to the screen. I have high hopes of this guy and I hope you'll fall for him as much as I have.Blake is a tall one at 6' and he weighs 155 lbs. The Marines will catch up to him and help him fill out his youthful frame in time and he'll be one hell of a hung strapping stud. Blake likes to swim, run and chase straight boys. I knew we had something in common! He agrees that out of all his hobbies, sex is probably his favorite. I saw that one coming.Blake shows up to my hotel room still dressed from work. He's got more than one nice surprise beneath his cammies and the other surprise is a hot pair of silk PT shorts. He uses them to tease the hell out of the camera in his War Chest video as he works up that huge gun of his and you'll be drooling in anticipation. He certainly knows how to get your attention and I'm sure by the time he hauls that monster out of those silk shorts, you'll be as hard as he is. After he leads you to an explosive orgasm along with himself, there's a special treat at the end. While we were filming, Blake was watching an Active Duty video of Thomas, Kaden and DJ with Thomas and Kaden fucking the hell out of DJ. I told Blake that when I reported back to the guys for their approval, they'd most likely be looking to see how hot his ass was. So, without any hesitation Blake comes up on his hands and knees and does a long teasing show of his ass in all positions. I fainted after that, but luckily housekeeping got my note of what to do in case I was non-responsive.",
  "models": [
    {
      "name": "Blake",
      "person_id": 35040
    }
  ],
  "release_date": "2009-11-25",
  "scene_id": 70284,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Blake, Scene #01"
}