{
  "collections": [
    "Active Duty"
  ],
  "description": "It's been quite awhile since we featured anything from my buddy Mike with Covert Missions and the other day he sent me two hot tapes of a really gorgeous Marine with a sexy country accent that I just had to share with you. I don't know where Mike found Kyle, but this guy is smoking hot. Mike lathers him up in the beginning of the first video and gets him all comfortable. Mike says he's surprised Kyle showed up since he flaked out on him a few nights ago and Kyle is quick to point out that he saw Mike on the balcony talking to one of his Sergeant's so he kept on riding through the parking lot. Kyle says he couldn't afford to let his command know that he was doing this. Mike quickly asks, 'Well, what do you think he was doing with me?' From there, Mike gets Kyle to strip down to his silk PT shorts and start playing with his cock.Mike's lighting and technique have come a long way since we first started watching his stuff. And with Kyle, his talent has certainly come a very long way. There's something so damn sexy about a hot Marine in a cheap hotel room stripping down and giving us exactly what we want to see and Mike is always there to egg them on. Kyle gets very comfortable during his first video in tonight's War Chest Update which is nearly 40 minutes long.Kyle is 22-years old, 6' 1' tall and weighs 208 lbs. He's been in the Marine Corps for about four years now and he loves it. He's thinking of staying in and making a career out of it. He says he'd be stupid to do anything else. Mike gets Kyle to sit up and flex his muscles for the camera and what a hot body he's sporting. This Marine is pure dreamboat material. Built like a brick with a 52 inch chest from his measurements and I'd say a 32 inch waist. He works out everyday in the Marine Corps and as much as he can own his own. He gives us a nice showing of his upper body, flexing and posing and then gets down to the business of stroking that nice Marine meat. Mike does a good job at getting some really great angles of Kyle peeling off his shorts and showing off that gorgeous hard cock. With a specimen like Kyle in front of your camera it's hard to get much wrong. He's absolutely stunning. Mike eventually gets his hands around Kyle's cock a few times and you just wish you could slap that bitch for being so lucky, but Mike's luck gets even better than that in the next video we're sharing with you tonight.",
  "models": [
    {
      "name": "Kyle",
      "person_id": 35182
    }
  ],
  "release_date": "2010-01-06",
  "scene_id": 70289,
  "series": "Kyle",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Kyle, Scene #01"
}