{
  "collections": [
    "Active Duty"
  ],
  "description": "We're back tonight with a super special War Chest Update for you. I teamed up Dallas, DJ, Conrad and Blake for an awesome fourway before Dallas did his scene with Dorian where he crossed the line and gave up all the goods when he let Dorian deflower his virgin ass. Well, you know you have to move slow sometimes with getting guys ready for that next step and tonight we're sharing the fourway with you that took place just before the Dorian and Dallas scene.This scene took place only a week after I met Dallas and already he's up for expanding his horizons. I chit-chat with the guys a little in the beginning and get Dallas loosened up. I put Dallas on the bed next to Blake who says he isn't nervous one bit. DJ and Conrad are on the other bed and this is a first for these two since I don't think they've ever been in a scene together. Blake wastes no time in tonight's War Chest video and gets right down to getting Dallas out of his shirt as he sets his eyes on the prize packed inside of Dallas' blue jeans. In no time flat, Blake is rubbing Dallas' crotch and invites him to move in closer for better access. Dallas helps Blake out of his jeans and takes off his own. You can tell right away that this is going to get really heated.Meanwhile Conrad and DJ have started stripping out of their clothes and DJ is wearing a hot pair of tighty whities. Both DJ and Conrad are already rock hard as I focus a little more on Blake and Dallas, they get their own heat going. They quickly get out of their clothes and start flexing some pretty massive cocks as Conrad reaches in for DJ's leg, giving him the signal that he wants to taste his hard cock. And taste he does. Conrad goes down on DJ's dick and gives it a hot oral exam as DJ enjoys the attention. Conrad strokes his own hard cock as he does the honors.Over on the other bed, Blake is getting Dallas' hard cock out of his shorts and into his hot mouth and Dallas seems so good so far. He's grabbed onto Blake's head and is guiding it up and down on his swollen dick and Blake is taking matters into mouth as he worships Dallas' cock with his mouth. Dallas doesn't hesitate to reach around and latch onto Blake's big cock and stroke it while Blake sucks his.They do some musical beds and Conrad ends up with Dallas while Blake moves over to meet DJ. Conrad gets right down to business on Dallas' dick and Dallas seems to enjoy playing with Conrad's huge cock. Funny how that works. Over on the other playing field, DJ is playing with Blake's ass as they both stroke their cocks and things are moving along quite nicely. DJ can't wait to get his lips wrapped around that huge horse meat that Blake is packing and he goes right in for the kill. We all know DJ (as well as the rest of us) loves a big cock. Blake returns the favor and these two are doing just fine. Dallas and Conrad continue to get acquainted and watching Dallas play with Conrad's huge dick is so hot.Finally the four men team up on one bed and it's on like a bot of neck bones. Conrad is down on Blake's cock as Blake mans both DJ and Dallas' cocks. It won't be long before they all gang up on Blake and use that beautiful ass for their pleasure. After more oral fun, DJ saddles up first to take on Blake's sweet little ass and from there, they all get a taste. They rotate using Blake's beautiful hole as they keep his mouth full of cock while his ass is being plowed.",
  "models": [
    {
      "name": "Blake",
      "person_id": 35040
    },
    {
      "name": "Conrad",
      "person_id": 35066
    },
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Dallas",
      "person_id": 35070
    }
  ],
  "release_date": "2010-02-03",
  "scene_id": 70293,
  "series": "Blake, Conrad, Dallas & DJ",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Blake, Conrad, Dallas & DJ, Scene #01"
}