{
  "collections": [
    "Active Duty"
  ],
  "description": "I recently met Maxx while hanging out in a downtown bar. He was trying to talk his way into the pants of some cougar in her late thirties and when he struck out, I struck up a conversation with him. Maxx is a really nice guy and built like a brick shithouse. He's 20-years old, stands 6' tall and weighs about 230 pounds. He works out everyday religiously for two to three hours and you can tell. He says his hobbies are hanging out with friends, going to the beach and soon he'll add bar hopping to that list. Maxx says he's pretty open minded and that this business sounds like it could be a lot of fun.I leave Maxx alone for a few minutes and as soon as I'm gone he pulls his nice hard cock out of his white boxers and starts slowly stroking it. This guy is the whole package and you're gonna fall in love with him right away. I know I did. When he pulls off his wife beater he reveals some of the most gorgeous nipples. This is the second War Chest Update in a row where the guy has had exceptionally sexy nipples. If you're a nipple lover like me you'll appreciate such perfection. The boxers come off quickly after the shirt and we've got this hunk of muscle all naked and to ourselves. I get some really good shots and angles of that gorgeous muscle body as Maxx continues to enjoy pleasing himself. Trust me, you're gonna want to jump right in there and do the work for him as he teases us up into a frenzy.Next we are treated to a nice viewing of that hot bubble butt and Maxx isn't shy about showing it off at all. He arches the back and gets right into it. All that muscle arched into a perfect picture. I get some nice close-ups of that nice hairy hole as Maxx allows total access, looking at the camera with a 'come fuck me' look on that sexy mug of his.Once he's allowed us to drool over his gorgeous muscles, he pops a really nice load for us. But the best part of this solo session for me was the shower scene after the jack-off session. Watching his beefy body glisten in the water is something else. Just perfection. I made this shower session extra long and got shots from a lot of angles showing off his ripped abs and tree-trunk legs. This guy is hotter than a firecracker and you're going to want to savor every last inch of him.",
  "models": [
    {
      "name": "Maxx",
      "person_id": 35120
    }
  ],
  "release_date": "2010-01-13",
  "scene_id": 70290,
  "series": "Maxx",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Maxx, Scene #01"
}