{
  "collections": [
    "Active Duty"
  ],
  "description": "My buddy Mike from Covert Missions has been sending in some really hot stuff lately and tonight in the War Chest I'm sharing a hottie he sent over recently named Danny. Danny is built like a dreamboat and packing a seriously long cock. Mike doesn't talk much with Danny in this solo, but it doesn't matter. Sometimes less is more and in this case, Danny's hot body and beautiful cock make up for the loss of chit-chat between the two. Danny is sporting some really hot tats with one that circles his sexy nipple and brings attention to a near perfect chest. He slowly works his way out of his uniform as he teases us with his hot cock. Mike's camera work continues to improve as he captures Danny's beauty and hotness with great skill.Danny is 22-years old and has six months left in the military. He has no plans of re-enlisting as he starts showing off his pretty butt and the length of that gorgeous cock. Mike starts chatting him up a bit, but leaves things simple. Danny has such smooth and nice skin, you'll get lost in just how perfect it is. Mike has him raise his legs up as Mike reaches down and spreads Danny's ass cheeks to reveal that hot fucking pucker. Danny says he likes to be on top and when he gets his cock sucked he likes to be jacked while he's sucked. Mike gets plenty of good shots of that super long cock and then gets Danny to bend over and show off his hole. What a perfect ass on this guy. Mike keeps reaching in and spreading out his cheeks while Danny doesn't seem to mind. Danny blows a huge load for us that lands on his chest. Go check out the video in the War Chest section and take a look for yourself. Hopefully Mike can convince this cutie to do much more in the future. (Honest: the pictures in the image to your right don't do justice to the video and to Danny. The video is is much hotter, you gotta believe me.)",
  "models": [
    {
      "name": "Danny",
      "person_id": 35202
    }
  ],
  "release_date": "2010-01-27",
  "scene_id": 70292,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Danny, Scene #01"
}