{
  "collections": [
    "Active Duty"
  ],
  "description": "This week, we're upping the antics with a really wild three way jerk off with Adam, Frankie (who was the camera man at the end of Adam's solo last week) and their buddy Jameson. Now we all know that Jameson has done some sneaking around and crossed the line a little further without his buddies knowing about it. But, this threeway jerk-off came before Jameson paired up with Conrad (and did more than jerk off). I think you'll all agree that Frankie seems the most likely to have crossed the line before any of them, but I wasn't as persistent with him because Jameson was clearly the hotter of the two.Let me give credit where credit is due. Frankie was actually the instigator in a lot of these crazy antics as he encouraged his buddies to move forward (even without him) and go for the gold. My thought is that he secretly fantasizes about doing much more with his buddies and getting them to move forward &nbsp; even without him &nbsp; has served his fantasy world very well. Frankie isn't in the best of shape due to an injury he had from a work-related accident, but he's got personality and a sense of humor that really shines on video. He's working on getting himself in better shape so that he can move forward and hopefully join his buddies across the line soon. I love this guy. He keeps me laughing every time I'm around him and I can't wait for him to join us for more fun.Tonight, though, let's enjoy these three buddies together as they strip down and stroke off together in what proves to be a very hot circle jerk and a super fun time. These three take us on one hell of a journey in this half hour of fun and by the time it's all over I'm sure you'll love each one of them equally. There is some absolutely priceless moments in this video and at the end I joke with Frankie about him bringing his red wig and whore red lipstick for our next meeting. He seems more than fine with the idea until I say he'll be the fluffer. He screams 'I'm not the fluffer.' I say, 'Oh come on Frankie, you get paid extra for that.' and he quickly replies, 'OK, I'll be fluffer.' Enjoy these guys because I know I sure enjoyed making this video for you and so did they.",
  "models": [
    {
      "name": "Jameson",
      "person_id": 35094
    },
    {
      "name": "Frank",
      "person_id": 35204
    },
    {
      "name": "Adam",
      "person_id": 35235
    }
  ],
  "release_date": "2010-02-24",
  "scene_id": 70297,
  "series": "Adam, Frank & Jameson",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Adam, Frank & Jameson, Scene #01"
}