{
  "collections": [
    "Active Duty"
  ],
  "description": "You all remember our recent new recruit, Jameson, right? Well, before Jameson decided to cross the line I spent a lot of time with him and a few of his buddies. One of those buddies was named Riley and what a hot little devil dog this one was. I had a hunch that Riley had some secrets so I decided to pair him up in a double jack off with Jameson just to see how these two reacted to jerking off together. I'm sure they've both had fantasies of doing more than just jerking off together or maybe I'm just fantasizing. Either way, the thought of getting these two naked with hard cocks out and stroking was a fantasy of mine so I had to make it happen.One night these two showed up with a bunch of their buddies at my hotel room. Major Wood and I had adjoining rooms and I was able to convince Jameson and Riley to disappear with me over to my room while Major Wood entertained the other troops. As soon as the camera comes on I'm telling them some sob story about how my wide angle lens is broken &nbsp; or how I broke it on purpose before they showed up. We start shooting the shit and I tell Riley how he missed out on a circle jerk with his buddies the other day. He acts upset and says he wishes he'd have been there. This one likes to lay the bullshit on thick and sometimes you don't know whether he's pulling your leg or telling the truth. I tend to like to believe the latter. I give them some shit about how this is going to be more intimate since it's just the two of them. I ruffle their feathers a little and get them all worked up. Riley is having a lot of fun with the bullshit and is a really good sport. These guys are a lot of fun and you can tell that I'm hitting the nail on the head with some of the points I'm making.Once the clothes come off, the tension builds as these two get comfortable being hard and naked together. And getting hard doesn't take them long at all. They're hard before the pants come off. Jameson with his beautiful, long cock and Riley with his nice, uncut jewel. They start making jokes about each others cocks in order to steal glances at one another's dicks. Classic boyish nervousness. You'll feel like you're at a sleepover at one of your buddies houses growing up. Remember those? We've all seen Jameson and know how fucking sexy he is, but tonight take special notice of Riley. This guy is smoking hot. Nice, olive skin and big sand dollar nipples and a smile that could melt what's left of the North Pole. Enjoy the nice long video of these two buddies rubbing one out for you tonight troops and hopefully you're appreciate it as much as I think they did.",
  "models": [
    {
      "name": "Jameson",
      "person_id": 35094
    },
    {
      "name": "Riley",
      "person_id": 35201
    }
  ],
  "release_date": "2010-01-20",
  "scene_id": 70291,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Jameson & Riley, Scene #01"
}