{
  "collections": [
    "Active Duty"
  ],
  "description": "We're back tonight with another brand new hottie streaming for you in our War Chest Update. Adam is one sexy ass Marine and just as playful as a cute little puppy. That's one thing I love about Marines &nbsp; they're just like snuggly little puppies. They just want you to pet them and rub them and love them and as long as you do that, they'll do anything for you in return.In his solo video (well, semi-solo ... you'll see what we mean) we find out Adam has been in the USMC for three years now, is 21-years old, 5' 9' tall, weighs 150 lbs and is from Texas. And, he just got back from Afghanistan where he spent eight months alone with his buddies. He says there was plenty of homo-erotic horseplay like doing the 'mangina' and shit like that. He's got several tattoos and of course he's sporting the USMC motto. Adam says he's ready to do a bi video and thinks he can talk his buddy Jameson into doing one with him and a hot chick. Little does Adam know that Jameson has already crossed the line and done a scene with another guy. I'm sure Adam is down to do the same and time will tell. This cute little devil is totally comfortable with himself and his sexuality. You can tell he's looking to explore and he's come to the right place to do so.He teases us with his hard cock, rubbing it through his boxer briefs and pays plenty of attention to the camera. This Marine is packing a nice sized gun and he loves showing it off. He takes his time stroking it and admiring it.In the middle of his solo his buddies beat on the door from the other hotel room and Adam doesn't miss a beat. He's not nervous at all about being naked in front of his friends. I decide that it would be fun to let one of his buddies take the camera but first I tell him to whisper some encouragement in Adam's ear and he does. The expression on Adam's face is priceless as his buddy whispers in his ear. I then decide that it would be hot to let his buddy finish filming his solo and hand off the camera to him. Adam asks when he should nut and I tell him 'anytime the director tells you to' and from there his buddy takes the reigns. His buddy tells me to go on in the other room that he has everything under control.Once I'm gone, his buddy starts talking dirty to him saying, 'Look at that big cock.' Adam grins a mile wide as his buddy keeps egging him on. Adam gets into talking shit back to his buddy and talk about fucking sexy. You're gonna lose your beads listening to these two tease one another back and forth. Adam asks his buddy, 'Do you want me to cum for you?' His buddy says 'Yeah.' as his buddy keeps saying, 'Do it, do it.' Adam blows a huge load all over himself and looks up at his director and says, 'Is this what you wanted?' Just as he does Riley and Jameson walk in the room and I'll let you see what happens from there.",
  "models": [
    {
      "name": "Adam",
      "person_id": 35235
    }
  ],
  "release_date": "2010-02-17",
  "scene_id": 70296,
  "series": "Adam",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Adam, Scene #01"
}