{
  "collections": [
    "Active Duty"
  ],
  "description": "Daytona is a hot new Marine in uniform that Major Wood found while patrolling the streets on our recent trip back to the East Coast.I left Major Wood to his own devices at the hotel that day while I went out looking at properties and by the time I got back he had this Jarhead in the can for us. There's something super sexy about Daytona. Maybe it's those gorgeous lips that an Iraqi soldier pointed out while he was deployed. Daytona just returned from Iraq and has tons of stories to tell about his time in the sandbox. The Major gets him to share a few with us and that's when we learn that he was told by an Iraqi man that he had sexy lips.Daytona says he jerked off sometimes as many as eight times a day while he was deployed. He got the name Daytona because of the car he drives so other Marines started calling him that. The Major is eager to have Daytona get his gun out and leaves him be for a bit to get things going. Daytona strips down to reveal a nice, smooth chest and a really hot cock. He's wearing those hot ass green PT shorts beneath his desert cammies. The Major gives us a nice touch by having Daytona leave on his socks and boots and his boonie cap for the duration of his hot solo. Daytona bends over the ottoman and gives a great long look at that devil dog ass he's sporting and what a fine piece of ass it is with the blonde hair just lightly covering the trail.Major Wood has Daytona move over to the conference table and get on his hands and knees on the glass top where he can see his reflection. Here he jerks himself up to one of the hugest cumshots I've seen lately, splashing his huge load almost all the way across the eight foot long table top. Talk about massive loads. This guy shoots like a cannon. I'm sure by the time it's all over some of you will say on a scale of 1-10 Daytona is a 500. He's certainly in the pole position in our War Chest Updates tonight.",
  "models": [
    {
      "name": "Daytona",
      "person_id": 35206
    }
  ],
  "release_date": "2010-03-24",
  "scene_id": 70301,
  "series": "Daytona",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Daytona, Scene #01"
}