{
  "collections": [
    "Active Duty"
  ],
  "description": "This devil dog is the epitome of what a sexy Marine should be. I'm still drooling over this one, troops. Major Wood really scored big with this hottie and I'm happy to report I've already gotten a chance to meet and work with him myself. And let me tell you, this guy is a real fucking trooper. You're gonna lose it when you see what we have in store for you in the near future with Fox.Fox says he got the nickname from his experience in the rave scene where the lady's call him Foxy. Fox is from the East Coast and has been in the Marine Corps for about two years. He's loving the SoCal party scene. In high school Fox boxed and played soccer. He's 6' 1' tall and weighs around 175 pounds. He tells us about his first sexual experience with some neighbor chick in the treehouse in his backyard when he was 15-years sold. He tells the Major about a 'gay night' he and a buddy of his had back in high school. He says they did it all and really enjoyed it.Fox comes out of his trousers with semi wood and the Major is clearly excited. He focuses in on Fox's weapon as he gets it locked and loaded. Fox works it over good and has it standing at full attention in no time flat. Fox moves over in front of a long mirror and strips off the rest of his cammies as Major Wood gets him to strike a few poses. Fox is a natural show off and he's loving the attention. We get some nice glimpses of that beautiful ass in the mirror and it's back to stroking it again. Major Wood gets some great angles but one thing I can't help but focusing on myself is those very delicious nipples on Fox.The other very noticeable thing about this devil dog is those perfect lips and beautiful baby-blue eyes. I swear this guy could sell me anything just by flashing that gorgeous smile. Take off the clothes and he could take anything back I'd already paid for. There goes the boat and condo! The Major gets him to stay in his boots and what a hot, nice touch this is.Next comes my favorite part as Fox gets on his hands and knees to show off that delicious ass as he throws it in the air and shows it off. You can tell he's enjoying the hell out of this as he continues to stroke his rock hard cock and smile at the camera. Once he's laying back on the bed he sticks a finger deep in his hole and teases us even more.It doesn't take long before Fox is blowing a huge, gushing load of hot jizz all over himself and it's one big mess that lands on his dog tags where he licks it off of the American flag. If you ain't singing 'Old Glory' by now, you're a tough one to please.",
  "models": [
    {
      "name": "Fox",
      "person_id": 35083
    }
  ],
  "release_date": "2010-04-21",
  "scene_id": 70306,
  "series": "Fox",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Fox, Scene #01"
}