{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm not sure if I've ever shared with you guys what a huge fan I am of UFC and MMA (mixed martial arts) and how I throw parties here at my place when they have UFC events on Pay-Per-View through my cable company. We just had one last weekend in fact. San Diego is also a hotbed for aspiring MMA fighters and is loaded with gyms where these aspiring fighters train. A lot of these guys just happen to be Marines and one of those facilities happens to be right down the street from my house. I see these hot guys coming and going every day and always fantasize about recruiting one (or a dozen) of them for Active Duty.Enter Ryder.While driving by the gym near my house the other day I spotted this little hottie in full fighting gear walking down the street. Without even giving it a second thought, I decided to stop and offer him a ride. He declined my ride, but was very friendly about it and I gave him my card before I drove off. That night I got an email from Ryder telling me he was interested in my offer. I was very excited to say the least. So, I set up an appointment right away and the next day Ryder was naked in the flesh right in front of me.Ryder is 20-years old, is 5' 8' tall and weighs 142 pounds and besides being an aspiring MMA fighter, he also enjoys football, rugby, ice hockey and snowboarding. He's also working on becoming a better surfer to better fit in here in Southern California. Ryder says he loves checking out his body every day in the mirror, loves getting naked and loves to show off.I leave Ryder alone and he gets right down to business. It isn't long before he's stripping out of his cammies and boots and putting on a show for the camera. Enjoy getting to know Ryder and his nice, tight little body. Is it just me or does he remind you of Diego as much as he does me? Their bodies are so much alike and they're the same exact size. Wouldn't it be hot to see these two go at it? Maybe I'm the only one that shares this fantasy.",
  "models": [
    {
      "name": "Ryder",
      "person_id": 35141
    }
  ],
  "release_date": "2010-03-31",
  "scene_id": 70302,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Ryder, Scene #01"
}