{
  "collections": [
    "Active Duty"
  ],
  "description": "Major Wood is back with a hot Sailor in tow and he's giving one of his famous 'helping hands' to this stud who just happens to look a hell of a lot like our favorite Brian. In fact Luke and Brian could be brothers. They have eyes and smiles almost identical. More about that in just a minute.The Major is one sly devil and he gets Luke right where he wants him &nbsp; on his bed naked. He then takes things further and jumps in to offer the notorious 'helping hand' that only the Major can provide. But first, he eases this hottie into things with a little chit-chat to let us get to know a little more about Luke. In the warm-up phase we learn that Luke is 22-years old, he's from Kansas and as all the guys, he enjoys the SoCal lifestyle. In high school he wrestled and played football and baseball. He wrestled in the 123lb weight class. He started wrestling from the sixth grade through his freshman year then moved on to football.Luke had his first sexual experience when he was 14. He and a buddy were hanging out, called a girl up and they had a threesome but during this threeway he found out his friend was gay. He didn't mess with his friend that night, but he played around with some buddies after that. The Major quickly moves on from the chit-chat and gets Luke naked and once the pants come off, he's already sporting a pretty hard cock. You can tell this guy is ready for action. He has the furriest, sexiest legs I've seen in awhile and his chest is matching. Nice to see some hair on a guy for a change. His cock is raging fucking hard and nice and fat and you'll wanna jump right in there and grab it yourself, but that's what we've got the Major for. It won't be long before he makes his move. But before he does, he puts this recruits through the moves, having him pose for us in several hot positions as he shows off that beautiful fucking cock and that nice, furry ass.Once he's gotten Luke all lathered up, the Major moves in for the kill. He latches on to Luke's rock hard meat and works it over like a part time job. You can tell Luke is really enjoying the help because it doesn't take long at all before Luke is shooting a massive load all over the place. He laughs with nervous relief as the Major tells him how awesome it was. The Major gives him his signature torture as he jerks the sensitive cock even more. I think the Major missed his calling. He could have worked in one of those Korean jack shacks notorious outside of military bases across the country. Luckily, we have him here at Active Duty. Enjoy!",
  "models": [
    {
      "name": "Luke 2",
      "person_id": 2
    }
  ],
  "release_date": "2010-04-28",
  "scene_id": 70307,
  "series": "Luke",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Luke, Scene #01"
}