{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight we're sharing another newbie with you named Ken that Mike rustled up somewhere. In the first session Ken is sporting a cap and a pretty smile. Mike sounds like he's on the sauce tonight and gets right down to the questions. Ken is 20-years old, stands 6' 1' tall and weighs around 165 or 170 lbs. He says his weight goes up and down because he's into martial arts. Ken is very obedient (like all military guys) and gives Mike plenty of 'yes sirs'. Mike leaves Ken to his own devices for awhile so Mike can freshen up his drink and it doesn't take but a minute for Ken to lose his shorts and start stroking his beautiful cock. And what a real beauty it is. Once it's hard, it's nice and fat. Mike gets Ken out of his shirt to reveal a very nice body.<br /><br />Mike is laying the bullshit on thick already and Ken just laughs. Ken has Mike's number I believe but he's gonna stick around and give him the goods. This one I think will make Mike really work for it. Ken does have one beautiful face, body, smile and cock on him. He's got that olive completion that just makes you want to go to exotic places and have hot sex. Ken says it's really cool but weird at the same time to think that so many people are going to get off on watching him.<br /><br />Mike gets Ken to turn over on his stomach and spread his ass cheeks to reveal a nice hairy hole. Mike isn't cutting him any slack, he makes him take both hands and spread 'em and Ken doesn't seem to mind. His legs and butt are fury and hot and his chest is naturally smooth. Those nipples are beautiful too. This one is a keeper. Watching his balls tighten up is a special treat because they're such a nice set of nuts. You could fall in love with this one just watching him read the paper. Luckily for us, we get to enjoy it all. He's oozing pre-cum as he begins to stroke it fast and hard. Mike tells him to shoot it on his chest and he follows orders exactly, landing a nice, fat, thick load of juicy white cum all over his tummy. You can tell Mike is pleased as he just gloats about it and grabs Ken's cock.",
  "models": [
    {
      "name": "Ken",
      "person_id": 35104
    }
  ],
  "release_date": "2010-05-19",
  "scene_id": 70312,
  "series": "Ken",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Ken"
}