{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight we've got something really special for you as usual. We've been rolling out some hotties over the last several weeks that came to us as a result of those wild FourPlay weekend parties that we've been throwing with my buddy Joe from My Straight Buddy. Tonight we've got another guy that landed on my bed at the end of one of these weekends and ended up making my weekend that much better.Scorpius is a tougher nut to crack than the rest of the guys that have come our way as a result of FourPlay. He's an expert at playing hard to get and he's the only one out of the bunch that has not yet taken that next step and crossed the line in some form or fashion. And, he just happens to be one of my favorites in the bunch just for that reason. I love the ones that play hard to get, that make you work a little harder and tease you a lot along the way. Scorpius is a pro when it comes to teasing the hell out of a drooling cocksucker like myself, but not so insensitive that he's not very playful all the while. He can tease you just enough to satisfy you until next time.What keeps me captivated by this little hottie is that big, bubble butt that he's packing and the monster cock hanging between his legs. Together they could keep me hanging on longer than most. You all know I don't give up so Scorpius is in for a surprise if he thinks he can outlast me. That ass is really something special and if you've been following our FourPlay weekends on My Straight Buddy where we've already featured two updates called 'Fun At Dink's Part 1' and 'Fun At Dink's Part 2' and if you've watched the FourPlay War Chest Update then you've already seen the super sexy ass hung on this guy. It goes on for days and he's fully aware of what a nice butt he's sporting. In fact, I think he's quite proud of it. In one of the Fun At Dink's videos over on My Straight Buddy I tell Scorpius to turn around and show us that ass and he drops the towel and does just that. I tell him that's where he's gonna get all those tattoos with my name on them and we get a good laugh. When I tell him that Dink is a great name to go on his ass he quickly points out 'But I don't have a dinky ass.' Touche!In tonight's War Chest video we get to enjoy Scorpius all to ourselves as he strips down and strokes that fat curved cock of his and leads us all straight over the edge. Before I get him naked I talk to him a bit and we talk about the parties. I shock the complete hell out of him when I ask him if he realizes he kissed a guy the night before and he claims he was way too drunk to remember, but acts as if he doesn't believe me. He did kiss a guy though and that guy was Austin. And he didn't skimp on the kiss either. You'll see that surface over on Semper Fuck soon.Scorpius gets his name from the huge scorpion tattoo he has wrapping around his upper thigh, but the real beauty is that curved fat hard cock he's stroking once I've got him naked. It's truly one of those cocks you call beautiful with low hangers to compliment and he's no slouch when it comes to showing that beauty off. He takes his sweet time, careful to let you get plenty of good looks at it as I get in close with the camera. This is one really big cock and he knows it. This makes showing it off a lot more fun for him and a lot more fun for us.The pride he has in that ass of his comes shining through in this War Chest Update as well when he bends over and takes his sweet time in showing off every last inch of it. I go on an exploration that lasts long enough to let you pop your load. I even get him to roll it around, gyrating you straight to climax. You're gonna love this guy.",
  "models": [
    {
      "name": "Scorpius",
      "person_id": 35142
    }
  ],
  "release_date": "2010-06-23",
  "scene_id": 70315,
  "series": "Scorpius",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Scorpius, Scene #01"
}