{
  "collections": [
    "Active Duty"
  ],
  "description": "Meet my man, Cabo. He's a married Marine that ended up riding down with a buddy of his and believe it or not, cleared it with his wife over the phone to allow him to participate in the weekend's activities.Cabo is 21-years old, stands 6' tall and weighs around 150 lbs. He likes to ski, play guitar and sing. He's on his way out of the Marines but says he might switch branches. Cabo has the most gorgeous green eyes and pretty smile. His sense of humor is priceless and he doesn't miss a trick. I give him a hard time and he's a damn good sport about it. We get a lot of laughs before Cabo strips out of his clothes and shows us what he's sportin'. One thing very noticeable about this Marine is his awesome tats &nbsp; so colorful and vivid!I leave the room to bake a pie while Cabo gets comfy with the camera. It doesn't take long before up springs something delicious. And just like that, he's outta his boxers in no time flat. Cabo's not only blessed with beautiful green eyes, but he's packing a nice fat cock that he just loves to play with. When I say he's got a nice dick, I ain't never lied. I could personally go down on that thing and likely never come back. Heaven. Period.Cabo puts on one hell of a show, teasing the camera and us like there's no tomorrow. Cabo's nice cock and tats aren't the only thing he's willing to show off. Once he bends over and arches that back to reveal a beautiful, tight, pink hole you'll be lost in a daze. And his cock never goes soft. He seems to like showing off that ass and we don't mind at all. After he's teased us up to a near stroke, he flips back over and blows a nice fat load for us all over his stomach. He later jokes that he arches his back so well because he had to teach his wife how.",
  "models": [
    {
      "name": "Cabo",
      "person_id": 35053
    }
  ],
  "release_date": "2010-05-26",
  "scene_id": 70313,
  "series": "Cabo",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Cabo, Scene #01"
}