{
  "collections": [
    "Active Duty"
  ],
  "description": "We're back tonight with a very, very special treat. Kaden decided that he wanted to try his hand at seducing another straight guy. I mean after all, he's come full circle here at Active Duty since the days of An American Sailor when he was just a straight country boy from Texas out for an adventure. He and I tossed the idea around and I put the challenge out to him to find his own straight boy and seduce him on video. So, he and his roommate found a hot little sailor that's aboard his roommate's ship and convinced him to come over to their place. Now Kevin (that's Kaden's target for seduction) already knows that Kaden's roommate is bisexual because they work together in the Navy. Kevin's cool with it and has been over to their house a few times and met Kaden.<br /><br />Tonight's visit is going to be just a little different. Kaden is in the bedroom watching porn when Kevin gets to their place and the roommate starts playing with the camera thats already set up in the room. Strangely enough Kevin never really asks any questions about why the camera is in the room. He seems much more interested in the porn and maybe a little more interested in Kaden. Either way, Kaden tells him the camera is there because sometimes he makes videos of himself jerking off and sells them online for good bucks.<br /><br />And from there you'd swear Kaden was a chip off the old block of bullshit cause he lays it on thick. He gets Kevin all fired up about the idea and suddenly tells him he has to leave the room to answer his phone. While he's gone Kevin decides he might wanna make a few bucks so he starts jerking to the porn while the roommate is standing in the corner filming him and Kaden is taking a call. This is where I got all excited. Kevin is very sexy in his own way. In that sailor kinda way that just gets you going as he seems so carefree with enjoying himself.<br /><br />Kaden returns and makes small talk about his girlfriend calling and Kevin cuts right to the chase about continuing to watch the porn as Kaden comments he needs some sex. By the time Kevin is on the bed you won't know who wanted to be there more. Kaden is proud to have been the seducer, but Kevin didn't mind being seduced it seems. And from here things move right along like a perfect fantasy of two young, hot guys getting off together. Kaden's skills are to be envied because with a body, face and smile like his who the hell couldn't be seduced. I believe these were Kevin's sentiments exactly and what happens next will tell the story. Kevin seems to be thinking so hard about what's happening and so anxious for it to happen that in an instance he allows Kaden to take over for him and stroke his dick. And Kaden could disarm a militia with his tenderness while you watch him totally make Kevin feel so wanted, so sexy and for sure horny enough to fuck a post. The melting starts here and half way through the game Kevin has let his guard down and is sucking Kaden's hard cock. Kaden comments that Kevin has a nicer ass than his girlfriend and Kevin giggles. It's clear that Kevin is having no problems servicing Kaden's beautiful hard on and Kaden is taking full advantage of it.<br /><br />Good Lord, I've about fell out here writing about it and I know what's going to happen next. Trust me, you won't believe it. There's a lot more ground to be covered and by the time it's all over, you'll either think Kaden seduced Kevin or Kevin seduced him. But it won't matter cause either way we got to watch.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Kevin KR",
      "person_id": 35208
    }
  ],
  "release_date": "2012-01-08",
  "scene_id": 70310,
  "series": "Drafted 4",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Kaden & Kevin"
}