{
  "collections": [
    "Active Duty"
  ],
  "description": "You gotta strike while the iron is hot, troops! And sometimes that means striking at three in the morning.Tonight I've got a wild card up my sleeve for you that I stumbled upon as I stumbled out of a bar in Myrtle Beach, SC a couple of months ago. Myrtle Beach is a happening place and a hot bed of Marines on the East Coast on hot summer weekends looking to party and sometimes even get naked if the right opportunity comes along.I spend a lot of time hanging out there in the summer because I spent a lot of my summers there while growing up and I have long known all the favorite hang outs of the hot, sexually frustrated Marines that get caught by that 'last call' whistle and find themselves without anyone to go home with. In some cases, they've lost contact with their buddies and just walk down the street aimlessly hoping to find their way back to their hotel.Ace was one such find. A jewel in the rough. And even though I wasn't really well prepared to film a scene, I was determined once he said yes that I would figure it out. We get back to the hotel and I fire up the camera. I tell Ace he was one of the easiest pick-ups I've ever found and he just laughs. Ace is my type all the way. He's sweet, a shit talker, smiles a lot and knows how to take a joke.He also loves to show off and has no problems stripping right down to the basics. I leave Ace to his own devices and by the time I come back you can see the chub in his boxers and once he pulls it out, it's a nice fat horse cock that had me wanting to fall right down on my knees and service it. He strokes it slow and deliberately as those huge balls just bounce in the wind. He's sporting some huge low hangers and they match that fat horse cock. You'll want both of them down your throat as this hot Marine teases the fuck out of you.About half way through the video, Ace blows his first load. When I tell him he's got to do it again, he doesn't complain. He just gets it up again and goes once more. The second time around is the charm. By the time he's done driving you crazy you'll be hooked. Catch Ace in the War Chest tonight and look for him more in the future. After his second load, Ace says it's time for another beer. My kinda guy!",
  "models": [
    {
      "name": "Ace",
      "person_id": 35214
    }
  ],
  "release_date": "2010-09-29",
  "scene_id": 70327,
  "series": "Ace",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Ace, Scene #01"
}