{
  "collections": [
    "Active Duty"
  ],
  "description": "Ever since we first posted Styx and then Lucky, I've gotten tons and tons of emails about these two hotties and everyone has been begging for more, more, more. Well, tonight in the War Chest Update we've got what you've been asking for. This was the weekend that I flew Lucky out to California. We had a huge cookout that night and I grilled my famous steaks and while I was playing chef, yours truly got into the cooking sherry and had just a tad too much. I realize that Styx and Lucky are MIA and I go off with the camera to look for them. I could not pass up this opportunity so I just went for it. By the time I get around to catching these two, I find them in my room naked on the bed watching porn with hard cocks in hand and stroking. Of course I felt an obligatory duty to you &nbsp; the AD fans &nbsp; to capture this hot moment for as long as I could stand and hold the camera. Styx is talkin' about taking over for me once I retire and I tell him he's got to get in the spirit of things before he can do that.This video has all the makings of an Active Duty classic as I proclaim that my wide angle lens is broken. Realizing that things have the potential to get out of control, I call in the reinforcements and get Dorian on the scene to take over in case I collapse. It doesn't take long before the glances start and both guys are eyeing the others prize. Styx is the first to break the ice by offering to share the lube with Lucky and before you can say 'grab his dick' Styx and Lucky are frantically jerking each others cocks. Styx really gets into telling Lucky how to stroke his cock so he can make him cum and Lucky is a fast learner. He gets Styx to pop his load in record time. With a little coaxing, Styx moves in to repay the favor. He works Lucky's cock over like it owes him money and Lucky is loving the help. This is one of the most amazing hand-jobs I've ever seen anyone perform. Styx even gets on his knees to get a better grip and strokes Lucky's load out and Lucky blows a huge load, hitting himself in the forehead.",
  "models": [
    {
      "name": "Lucky",
      "person_id": 35115
    },
    {
      "name": "Styx",
      "person_id": 35149
    }
  ],
  "release_date": "2010-08-11",
  "scene_id": 70321,
  "series": "Lucky & Styx",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Lucky & Styx, Scene #01"
}