{
  "collections": [
    "Active Duty"
  ],
  "description": "There's few things in life more exciting than having a cowboy in the saddle   or being in his saddle for that matter. Tonight we've got a really hot country boy for you in the War Chest Updates who is sportin' his shit-kickers and wearing his nut-huggers and topping it all off with a really nice Stetson. Not to mention a Southern accent like they hand out to the boys in Georgia and a smile to melt your mama's heart.<br /><br />Yep, that's Braden.<br /><br />This all-American can play the guitar and sing you a song to melt your heart. Braden was like so many of us that discovered Dad's porn stash and borrowed it when the old man was away. 'Course, Dad's porn stash taught Braden a few things and that's why he thinks he's cut out to be on camera.<br /><br />Once you see that smile I'm sure you're gonna agree with Braden. The camera loves him. I chat him up for a bit and we hear some good stories as we get to know this sexy devil. Braden is 23-years old, stands 6' 2' and weighs in at about 185 lbs. I recreate the scenario of him finding his father's porn and it doesn't take long for him to get in the mood. I then tell him I'm going to reveal a deep dark secret of Braden's once his cock is out and standing at full attention.<br /><br />A few nights before this video was shot, Braden was brought over by his buddy Dakota. Now, you've never met Dakota, but you will soon: both in the War Chest and Active Duty LIVE. Well, Dakota introduced me to Braden and well I guess Dakota was eager to give his buddy's horse a test ride. So, after a few beers I made the suggestion to Dakota that he should 'fluff' his buddy and after some hemin' and hawin' Braden gives in and lets his buddy Dakota suck his cock for him. An honor we'd all love to have. I feel guilty I was there without you.",
  "models": [
    {
      "name": "Braden",
      "person_id": 35043
    }
  ],
  "release_date": "2010-10-06",
  "scene_id": 70329,
  "series": "Braden",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Braden"
}