{
  "collections": [
    "Active Duty"
  ],
  "description": "I gotta give it to Mike, he can sure pick 'em and tonight's recruit is no exception. He is stunningly beautiful. This side of beef is all-American except for the name, but even a name like Jonavik conjures up thoughts of something wonderfully exotic but this country boy is pure red-blooded patriot. Jonavik has been in the Army now for about three years defending our asses and doesn't it make you feel good to know such fine studs have our back?Jonavik is all man and once he strips off his shirt and pulls down his pants you'll wanna hop right on the bed with him and let him whisper sweet nothings in your ear. He's not shy about stripping down and comes out of his clothes in no time at all. Mike is egging him on and some nice music is playing in the background to set the mood. His cock stands at attention quickly and you can see why he's part of America's finest. This stud is hung like a Mack truck and sporting a pair of balls to match. Mike gets right in there and gets the goods for us all to enjoy and if you're like me you'll be swooning at the thought of tasting that hot, fat cock.Mike reaches in and grabs it and makes us all jealous. Wouldn't you just like to slap that bitch? Well, not really cause he sure brings us the goods. But you sure will find yourself living your fantasies through Mike as he fondles the goods and gets so close to the manly perfection we all fantasize about.Jonavik knows just how to tease us as he slowly strokes that huge meat and shows off every last inch of it. He's no newbie to the game and Mike may not realize that this one is actually the one in control. I'm sure Mike doesn't mind though. Jonavik starts rubbing his chest and breathing hard and you will be too as you watch this soldier play with his gun. By the time he blows his huge load all over himself you'll be imagining you're right there to lick it up.",
  "models": [
    {
      "name": "Jonavik",
      "person_id": 35212
    }
  ],
  "release_date": "2010-09-08",
  "scene_id": 70325,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Jonavik, Scene #01"
}