{
  "collections": [
    "Active Duty"
  ],
  "description": "Hang on to your hand grenades because tonight we've got a super hot new recruit lined up for you in the War Chest Update. In fact, I'm so smitten with this one myself that the editor had to literally rip the tape from my hands because I was so reluctant to let it go. I must have watched this hottie four or five times after I shot it because this guy is just that damn hot and talk about knowing how to work the camera (and my nerves) he's got me wrapped around his little finger.I met Lucky on one of my recent trips back to the East Coast. He's a country boy and I just happened to run into him while he was on leave at the beach. I actually flew Lucky out to SoCal for his first time on the West Coast. Yeah, that's how hot I thought he was. This stud is 20 years old, 5'9' and weighs 165 lbs.Lucky has a beautiful smile and some of the most gorgeous eyes (one is blue, the other is green) and he's sportin' a smokin' body from head to toe. In the interview portion of the video I ask Lucky if he's a show off and he says no, but later we learn that he's a huge show off when he gets his clothes off and into being watched by the camera.In the beginning of the video I get Lucky to stand up and strip down and pose for the camera and he's an instant natural. I could watch this guy read the phone book and get instantly aroused. He's just plain gorgeous. Once he's on the bed he's fast about getting right down to business, but he still takes his time and is more than playful with the camera. You can tell he's loving the spotlight and the camera is loving him. His cock is hard in a jiffy and he's strokin' a nice, fat piece of meat as he rubs his chest and legs and keeps good eye contact with the camera.By the time I get Lucky up on his knees to show off his beautiful body and ass, he's so comfortable that he can't take those gorgeous eyes off the camera. The hottest moments come when he begins showing off that perfect bubble butt and giving the camera a come hither look like he wants you to dive right in and fuck it &nbsp; and you'll want to do just that. It's an amazing ass and I couldn't get enough of it. When he sprays his huge load all over his chest you'll wish you were right there to help him clean it all up and do it again. Simply amazing.",
  "models": [
    {
      "name": "Lucky",
      "person_id": 35115
    }
  ],
  "release_date": "2010-07-28",
  "scene_id": 70320,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Lucky, Scene #01"
}