{
  "collections": [
    "Active Duty"
  ],
  "description": "Every so often I get a package from my buddy Mike who's brought us all the really hot guys in the Covert Missions series and usually I tear it open like a young man in a candy store. I can hardly wait to see what he's come up with next. For me, it's nice to see what someone else is doing and to fantasize about guys that I didn't find. Well, Mike seldom disappoints. Mike's work throws me back to somewhere around 1999 when I was just starting to get my groove behind the camera and his style feels a lot like mine did then. The Covert Missions series has brought us some super stunning guys and tonight in the War Chest Update we've got yet another example of this with Mike's brand new recruit, Chris.<br /><br />Chris is, at first glance, the boy-next-door that signed up for the military and shipped off one day without you taking much notice. But, if you'd gotten to experience that same guy next door like we get to experience Chris tonight in the War Chest then you'd probably have hopped in his duffle bag and gone all the way through boot camp or basic training with him, just to be sure you never let him out of your sight. Yes, Chris is that damn cute.<br /><br />Mike's bullshit never ends and the video kicks off with him talking shit about the female porn star on the screen and making it sound almost as if he knows her. He starts interrogating Chris right off the bat and we find out that Chris is 19-years old and has been in the Army for just over a year. Chris doesn't miss a beat as Mike tries to throw him off, he keeps right up with Mike's line of questioning. Chris likes to race dirt bikes, claims to have a 8.5 inch dick (which I'd love to measure) and I'm sure you'll want to pounce on it like I'm sure Mike wanted to. I can just see his mouth watering. Chris tries to explain motocross racing to Mike and Mike plays along. All the while Chris is stroking his cock inside his cammies and you're just waiting to see it.<br /><br />By the time Mike gets him naked you'll hope Mike has a pie to bake so we can be left all alone with this stud. He's beautiful with quarter sized nipples, ripped abs and a huge fat cock that could choke you even while soft. Not only is he packing 10 pounds of cock he's got the bucket of balls to go with it. Mike is weighing his odds as he asks Chris, 'what's the most you ever cummed in a night?' Chris seems very laid back and up for just about anything and I personally can't wait to see him do more.",
  "models": [
    {
      "name": "Chris MB",
      "person_id": 35194
    }
  ],
  "release_date": "2010-08-18",
  "scene_id": 70322,
  "series": "Chris",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Chris"
}