{
  "collections": [
    "Active Duty"
  ],
  "description": "This new hottie has already done some crossin' the line and is up and ready for more. He went from 0 to 'let's do this' in about two days. I'm excited about this big-dicked blond stud and once you get the not-so-short arm inspection we have for you tonight, you're gonna feel the same way I do I am sure.<br /><br />Taylor is packing some serious firepower in his pants and he's ready to unleash the fury on anyone who wants to take it on. I've found someone to do just that and we'll be seeing some of that really soon. In the meantime, let's get to know this sexy stud in the War Chest and evaluate the goods before he puts them to use on some unsuspecting fellow comrades. I'm in love with his blond hair and green eyes and that mischievous smile he's sportin'.<br /><br />Taylor is 20 years old, is 6' tall, weighs 185 lbs. and enjoys the outdoors. He spends his weekends camping, hiking or hanging out at the beach. He says that chicks are his preference but he's down for experimenting with another dude though and is completely open to getting head and fucking a guy. I tease him a bit about remembering what he just said when I talk him into sucking a cock and getting fucked. And, troops, you know I will eventually.<br /><br />He says the wildest thing he's ever done sexually was his best friends mom. He tells us this fascinating story and all I want to know is if he did the friend too. You'll have to wait and see what he says about that. He tells us another story about a guy who offered him a ride one time and ended up taking him home and offering him a blowjob. The guy put the moves on him and you'll have to see what Taylor's reaction was by listening to the rest of the story. Taylor is full of stories and you'll want to listen to them all. He's quite a character.<br /><br />Aside from good stories and a big cock, Taylor is also sporting a very nice body that he obviously spends plenty of time at the gym working on. You can tell he likes showing it off, too. Once I get him naked he's hard in a matter of seconds and that huge cock is staring us in the face, begging someone, anyone to come suck it. Are you up for the task? I'll let you decide.",
  "models": [
    {
      "name": "Taylor",
      "person_id": 35153
    }
  ],
  "release_date": "2010-12-01",
  "scene_id": 70338,
  "series": "Taylor",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Taylor"
}