{
  "collections": [
    "Active Duty"
  ],
  "description": "It's War Chest Update time again and tonight I gotta tell ya, I feel like we keep hitting the jackpot or winning the lottery lately. Think of it as 'scratch and sniff.'<br /><br />Tonight we've got another brand new hottie for you in the War Chest and this one is sure to make you have hot flashes. He gave me the pure vapors. In fact, it took me three hours to review his War Chest video in order to get myself back together and in shape to write about it.<br /><br />Killian is 20 years old, stands 5' 7' tall and weighs in at a thick, hefty 170 lbs. He's got killer green eyes and a pretty smile. In high school he played all sports and stayed very active. Can you imagine being naked in the locker room with this guy? I'm not sure I'd have been able to contain myself.<br /><br />Killian is a good Irish boy that doesn't wear underwear and you know what they say about guys that go commando! I keep teasing Killian about a huge dildo and he's a very good sport about it. In fact, I think it was all that teasing I did that made him give us such a nice, long ass shot and be totally comfortable with it once he found out I was kidding about the dildo. Compromise is sometimes worth the end result and once you see this beefcake show off that nice gluteus maximus I'm sure you'll be just as content as I was.<br /><br />A nice bubble butt isn't all this stud is packing. He's got a thick, rock hard cock that stands at attention and you can see his swollen prostate below his big balls just begging for some attention. This stud is all man and he's as horny as anyone I've met lately. That hot cock of his doesn't go down once it's hard and he just teases the camera with it. It's almost as if he knows we are watching him and drooling and he's loving the fucking attention. This one is a real show off and you're gonna love it.<br /><br />But back to that beautiful ass. Oh my, it's just plain perfect. Nice, soft, fur lines the precious hole and keeps it safe as I zoom in all the way to make sure we don't miss one fine hair around the pucker and he shakes it and gyrates it around, teasing me until I'm sweating and panting about to fall out.<br /><br />This guy has my number and he's working me like a part time job. By the time he sits on the edge of the bed to blow his load, I'm thankful because I'm already on the floor. He shoots it right down at me as we watch the hot jizz just ooze out. At the end I get a shot of him taking a long piss and he's not piss shy at all. We watch him lather up in the shower and by the time it's over, you'll need a long hot bath!",
  "models": [
    {
      "name": "Killian",
      "person_id": 35107
    }
  ],
  "release_date": "2010-10-27",
  "scene_id": 70332,
  "series": "Killian",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Killian"
}