{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm so happy to be back with you tonight and I'm really excited about sharing our new War Chest recruit with you because I happen to have a real soft spot for this one. He's playful, has a good sense of humor and is hung like a Howitzer -seriously. When Dante first pulled out his cock I thought I would fall in the floor   and then   when he got ready to shoot his load, I did get on the floor and let him shoot it all over me and the camera. See what I go through, troops? Down in the trenches getting fired at just to make you all happy ;-)<br /><br />But there's much more to this tall, lean sexy devil that just his huge toy, Dante has personality for days and a beautiful body to boot. He's a really good sport and just laughs when I tell him he's about to ride a huge dildo. He did shoot back with 'maybe next time' which was more than enough to keep an old hanger-oner like me hanging on. We talk about the size of his cock before he pulls it out and you can tell that having that big thing admired is right up Dante's alley. He just grins from ear to ear knowing that what he's about to pull out is going to be impressive.<br /><br />Dante is 6' 2' and weighs around 170 lbs. He loves shot-put, basketball and jerking off. Before I leave I can't resist getting Dante to take off his jeans and show off his Jockeys. When I return that monster is standing at full attention and he's stroking it hard and fast. I get him to hold it down at the base for us and show off the full glory. My jaw just drops as Dante isn't playing this game of cock size fair. He was definitely standing in the big cock line when he got his. Watching him stroke that massive meat is mesmerizing and those huge balls bouncing up and down with each thrust will have your mouth watering all the way to the cumshot. At that point you'll probably wish you were there to kick me in the head for the position I was able to land beneath that hot stream of jizz.<br /><br />Once I get Dante up on his knees the true size and might of that cock can really be seen and appreciated. The thing is fucking huge. Period. My camera angles make you feel like you're right there about to grab onto it and take it down your throat. Once I get down on the floor below him, we discover a little secret trick of Dante's that helps him blow his load. It ends up being a nice surprise (and hope for the future). Keep your eyes on this prize, troops. You're bound to see more of Dante.",
  "models": [
    {
      "name": "Dante",
      "person_id": 35072
    }
  ],
  "release_date": "2010-12-08",
  "scene_id": 70339,
  "series": "Dante",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Dante"
}