{
  "collections": [
    "Active Duty"
  ],
  "description": "Dana is a sexy blond who fits my idea of a perfect 'scamp' by every definition. He's mischievous, horny and up for just about anything. Dana says he doesn't mind that guys are gonna watch. He says it turns him on that guys will get off watching him jerk off. Mike starts out right away pushing the envelope and searching for an 'in.' Dana doesn't take much probing before he starts spilling some secrets. He tells us a story about getting head from another guy when he was in high school. He says he didn't return the favor, but he did jerk the guy off in return.Dana is 20-years old, is 5'9' tall and weighs in at 175 lbs. He's got blond hair and very pretty blue/green eyes. Dana likes working on cars, rock climbing, sky diving and he's pretty good at all of them. Dana tells us how he met Mike all thanks to his car breaking down. Once he learned how much it would cost to fix it, he called Mike up right away. After the chit-chat, Mike tells Dana how he wants him to tease us. Mike keeps pushing and Dana finally admits that there was one guy he served with in Iraq that he would have really considered fucking. It was his gunner and Dana tells us about how hot he was and how nice his abs were.All this talk about his gunner seems to get Dana playing with his cock a lot more. He comes out of his pants and works up a nice hard on for us as he and Mike keep the banter going. This one is a talker and he might be a better bullshitter than our dear friend Mike. But eventually, Mike's coaxing wins out and before you know it he's got Dana rubbing and playing with his ass and bending over to let Mike get a better look and a little feel himself. Once his cock is nice and hard it's a big fat dick that you'll just wanna get a taste of yourself.",
  "models": [
    {
      "name": "Dana",
      "person_id": 35216
    }
  ],
  "release_date": "2010-11-17",
  "scene_id": 70336,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Dana, Scene #01"
}