{
  "collections": [
    "Active Duty"
  ],
  "description": "Let me tell you, there is so much more to your local Wal-Mart than may meet the eye. And I'm not talking about the roll back specials or the friendly senior citizen greeters or cheap deals on underwear. I'm talking about the hot, hot men that stroll the isles in search of deals to help them save on the tight budgets we all keep these days. Young, hot and broke is a combination that I can never pass up when I'm shopping my local Wal-Mart and I support them whole-heartedly for the true American made male goodness and wholeness they supply to us in such great abundance.<br /><br />Such fine American pride comes in so many varieties and tonight I'm introducing you to just one out of thousands available. I'll take you back to my local Wal-Mart right now and you can come along on the journey that led to me meeting our War Chest hunk of the night, Zander. Now close your eyes and try not to envision the really bad floral arrangements or the senior citizen greeters for just a moment. In fact, think about the underwear aisle and all the hot men on the packages to get yourself more in the spirit of the kind of Wal-Mart adventure I'm talking about.<br /><br />There now, ready? So, there I was minding my own business trying to get my oil changed at the Super Saver Auto Center when out of the corner of my eye I see this hunk stroll by in the auto section, looking for something. The man at the counter was asking me what type of oil I wanted and I just walked away, suddenly not caring if my car was serviced or not. Once I saw Zander the car could have exploded for all I cared if having it serviced meant losing the chance to get this hottie. The man called after me as I strolled away on a mission. I even left my keys with this stranger as I lost all consciousness and went into my 'gotta get me this man' trance and headed off into the wilderness of motor oil, air filters, car stereos and things I ain't never seen before. But not far ahead was something I was quite familiar with. And I was not going to stop until I got a chance to speak with him. This guy was hauling ass with a case of water on his shoulder and my fat ass was struggling to keep up. The guy from the auto center yelled out behind me and I just kept going.<br /><br />Zander made it to the check-out line before my old ass could catch him so I headed around the registers and parked on the bench outside the restrooms, waiting and trying to catch my breath. Just as I did, he threw the case of water on his shoulder and started that fast-paced strut of his again on his way out of the store.. I called out to him, getting his attention and called him over. I chatted him up a bit about some bullshit I can't even remember and then hit him with my card. He thanked me and quickly exited the building. Once he'd left and my mission was over, I realized I'd abandoned my car and my keys with the stranger back in the auto center and headed back that way to finish getting my oil changed. The guy at the counter just gave me some strange looks as I said 'I had to go really, really bad.' As luck would have it, Zander called me about 20 minutes later and the deal was sealed. Perfect timing. My car was ready to take me three thousand more miles and the adventure I was about to go on with Zander would prove totally worth it all.<br /><br />This one is a keeper, troops and I was able to get him to move along quite fast. He's done a lot more than what we're going to see in the War Chest tonight and I can't wait to share it all with you. For now, let's all get to know this guy we just picked up at Wal-Mart. And remember, the next time you're thinking about ditching Wal-Mart because you think it's a little too white trash for your taste, floor it right on past that Target and get thee to Wally World.",
  "models": [
    {
      "name": "Zander",
      "person_id": 35166
    }
  ],
  "release_date": "2013-04-07",
  "scene_id": 70333,
  "series": "Reenlisted",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Zander"
}