{
  "collections": [
    "Active Duty"
  ],
  "description": "Nick Gunner is just adorable and I'm sure you're gonna agree with me. If not, that's OK, I'll keep him all for myself. This little hottie is so sexy and such a ham for the camera. The camera loves him and he loves the camera and by the time you've checked out his gallery and watched his video in the War Chest you're gonna love him, too!Nick is so special that I even gave him a last name. I'd been trying to give the name 'Gunner' away for weeks and when I mentioned it to Nick he said 'I'll take it.' So, 'Nick Gunner' was born.He's dynamite in a small package and he's packing some heat down below. His 'package' isn't so small as you'll see but he's only about 5' 4' tall. My perfect type. And talk about knowing how to work a camera for all it's worth, this guy knows every move to drive the viewer crazy. He simply loves posing and showing off his gorgeous little tight body and I was right in there working him over. I'm not sure who worked who, but by the time it was over I didn't care and I'm sure you won't either.I fell in love with his sweet little bubble butt and those gorgeous eyes and that pretty little impish smile. By the time his huge cock comes out, I'm already in a daze. It's got the perfect curve in it and he really knows how to arch that back and show off that sweet little butt while he strokes his big meat.Once he starts working that cock, you'll wanna crawl up next to him, take him in your arms and keep him forever. But don't lose your pearls just yet, wait for the fantastic ass show this hottie puts on. Nick knows how you like it and he's ready to tease you all the way to climax. He moves that little bubble butt ever so intently and shows off that nice little pink pucker with slow, deliberate moves that will send you right over the edge.Showing off his hot little ass must make him as horny as it does us, because as soon as he turns back around he blows one of the biggest loads I've seen in awhile. Once you see it, I think you'll agree that the name Gunner fits him perfectly.",
  "models": [
    {
      "name": "Nick Gunner",
      "person_id": 35123
    }
  ],
  "release_date": "2012-07-27",
  "scene_id": 70331,
  "series": "Fraternizing Forces 2",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Nick Gunner"
}