{
  "collections": [
    "Active Duty"
  ],
  "description": "Sometimes there's more to win at a casino than your hand at black jack or hitting the motherload on the slot machine. If you're me, sometimes you walk away having hit the jackpot! Such was the case on my last visit to the casino when I met the hottie we are featuring in the War Chest tonight. Boston was playing his hand at the same black jack table with me and as the night went on, I wasn't doing so well.<br /><br />Boston ended up in the same boat and walked away flat busted just like I did. But my luck took a turn when I struck up a conversation with him as we both were leaving. This stud is so fucking handsome that I have to admit I was a bit nervous when I approached him. I knew he was probably in a bad mood from having a bad night at the tables and I was taking a chance on getting a bad response. But as soon as we started talking, Boston started smiling and I knew it was a very good move on my part. We talked for awhile and I gave him the scoop. Later that night my phone rang with Boston on the other end and I suddenly came out of my losing slump and perked up to prepare myself for this huge win.<br /><br />The next night, Boston came over and we were able to get more acquainted. Boston is 6' even, weighs in at around 175 lbs. and wears a size 10.5 shoe. He likes playing basketball, working out and he's very athletic. In high school he played basketball and soccer and was very good at both. He says he wants to get into this business to have a good time and I assure him we can show him a very good time. I talk to him about his first blow job and he describes it more as a 'teeth' job. Boston says he's from New England and I tease him about the Jersey shore and ask if he's going to show us the 'situation.' He laughs and assures me he's gonna show us the situation.<br /><br />Once I leave him to his own devices it doesn't take long for him to strip out of his clothes and get that hard cock out to play with. You can tell right away that this one likes showing off. He teases the camera with that hard cock as he shakes it around, showing it to us in all its glory. Once I come back and find him naked and hard I can't resist getting up close and personal with this beautiful hunk as I get some really good close angles of this stud's beautiful body It's smooth and damn near perfect and those low hanging nuts of his would make anyone's mouth water for days.<br /><br />He isn't shy about giving the camera plenty of attention as he seduces it with those gorgeous fucking eyes of his. He doesn't just sit there jerking like a madman, he makes the experience very erotic, taking his time, showing it off and making sure we get plenty of everything.<br /><br />And I do mean everything. Once he bends over to show off that hot little smooth ass of his as he looks back at the camera, you'll be in heaven. The light fuzz around his sweet pink ass is totally delicious. By the time he turns around to shoot his huge load you'll be over the edge.",
  "models": [
    {
      "name": "Boston",
      "person_id": 35042
    }
  ],
  "release_date": "2010-11-24",
  "scene_id": 70337,
  "series": "Boston",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Boston"
}