{
  "collections": [
    "Active Duty"
  ],
  "description": "Now, we've already met Art (kinda) in one of the Covert Missions scenes we are featuring in the Videos Of The Week section where Mike teams him up with Chris and Nick for some first time oral fun. These three got a long like peas in a pod and their cocks ended up having a lot of fun as they all got a good taste of one another.<br /><br />Tonight, let's get to know Art alone in his very first solo for Mike where we get a chance to get up close and personal with this little hottie. There's just something about him that oozes innocence but deep down I think we've got a bad boy on our hands here that's down for pretty much anything. Things took off so fast in his trio with Chris and Nick that we never really got a chance to get to know much about him except he's game to jump on a cock and suck it pretty damn good for a first timer.<br /><br />Tonight we learn that Art is 19-years old, is 6'1' tall and weighs 185 lbs. He enjoys working on cars and doing landscaping. The entire time Mike is interviewing him this horndog is jerking an obviously hard cock through his shorts. (And it looks delicious just through the shorts.) When he pulls it out and takes off his shirt we see a sexy dude with a beautiful smooth body who looks like the boy next door just waiting on you to pounce on him and bring him home.<br /><br />When Mike asks Art about a girlfriend Art is quick to point out that he's just got done with a lot of drama and that a girlfriend is not on his mind at the time. That's good news for Mike and maybe a chance to get this cutie do try some other routes while he's in transition. (His trio with Nick and Chris proves Mike was probably thinking the same thing.) Enjoy this delicious treat all to yourself tonight in the War Chest, Troops.",
  "models": [
    {
      "name": "Art",
      "person_id": 35220
    }
  ],
  "release_date": "2011-02-02",
  "scene_id": 70348,
  "series": "Art",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Art"
}