{
  "collections": [
    "Active Duty"
  ],
  "description": "Riley melted my heart the very first time I laid eyes on him. I was suddenly thrown into a nostalgic state when I realized just how much he reminded me of Active Duty's beloved Dean. I swear these two could be cousins. Riley is about the same size Dean was when he first came on the scene back in 2005 in Open Ranks 3: Bareback Liberation. Dean became an Active Duty legend with his manly looks and boyish charm and went on to entertain us in many, many Active Duty titles such as: Behind the Line, Soldier Sleepovers, Bi Barracks, Twin Soldiers, Rear Gunners, Rear Gunners 3 and Fire in the Hole 3 and captured the hearts of so many of us. In fact, I still get emails asking about this hunk even today. It just goes to show that some people never get old.So, when I met Riley I was thrown back to those days of Dean and it wasn't just his looks that reminded me of Dean, it was more than that. As I got to know Riley during his War Chest solo, I would come to see a lot more similarities between he and Dean. Just the innocent desire for exploration and a realization of feelings that might deserve more attention. Riley is open and honest and you're going to really like his attitude about things.Riley is 21-years old, stands 6' and weighs around 200 lbs. Riley says he wants to get into the biz to have some fun and he's pretty open minded. I tell Riley I'm going to find out just how open minded he is so he should be ready for the ride. He's all smiles as he undresses in front of the camera. Once he gets down to his boxers I see that they are torn on the sides and I suspect that it's because his thighs are like tree trunks. When I ask if that's why his boxers are torn, he confirms my suspicion.Once he's on the bed and comfortable I start talking to Riley more about his curiosity and just how far he thinks he'd be willing to go. We talk about all the usual stuff first, the chicks, the first blowjob, the first time he ever jerked off and then I move on to the good stuff. I'm not going to ruin it for you because it's so cute to hear him tell it in his own words. Let me just say that as my questions get more involved, his dick just keeps getting harder and harder. What are you waiting for? Get your ass on over the the War Chest and help us give Riley a huge welcome to Active Duty.",
  "models": [
    {
      "name": "Riley",
      "person_id": 35201
    }
  ],
  "release_date": "2011-01-26",
  "scene_id": 70346,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Riley, Scene #01"
}