{
  "collections": [
    "Active Duty"
  ],
  "description": "My buddy Major Wood called me up one night and said he had someone he wanted me to meet. So, grabbed my coat and headed out the door. When Major Wood says he wants you to meet someone it means he's found a diamond in the rough that he's already brushed off, shined up and is ready to display. Well, a diamond in the rough is exactly what Marshall is. He's cute and innocent looking but once he gets naked a whole other side of him comes out that surprises and delights.<br /><br />Marshall just got his cock sucked for the first time by another guy a few nights before we filmed his War Chest video. Now, Marshall grew up with a close friend who was openly bisexual but he never did anything with this buddy. That might change soon because right after we filmed this solos Marshall was supposed to take a long load trip with his bisexual buddy. Marshall wrestled in high school and pretty much kept his focus on that sport.<br /><br />Marshall is 21, 5' 11' and weighs about 165lbs. He's a country boy at heart like so many that pass through my doors. You can tell by the sly smile on this one that he's a pretty smart cookie, too. I get Marshall comfortable on the bed without his shirt and leave him to his own devices long enough to get the main device up and running and it doesn't take long at all. One thing I love about this one is he still uses his own spit for lube. A true sign of a man that knows what to do when things are limited. As he peels out of his blue jeans, he reveals a nice set of legs and not long after a nice hard cock follows. He's all about showing it off to the camera as he pulls it out of the leg of his boxer briefs, giving us a glimpse before he reveals the entire beauty. Once he's lost the undies, he starts playing with his balls in a way you don't normally see guys play with their balls. You can tell he's very aware that the balls like attention just as much as the cock.<br /><br />Just below those near perfect balls you can see his a throbin' knot that usually tells you that his ass might be very sensitive too. I'm dying to see so I start talking about it with Marshall, just seeing where things might go and all the while he starts playing with it lightly. I get him on his knees and finally convince him to turn around and show us just what a nice ass he's packing. As he pushes his back into an arch that beautiful pink hole starts winking at the camera. He arches his back very good and his cock stays rock hard. I get him to reach back and spread his cheeks even further apart and we get a much better look at the pucker. That's one tight hole. You'll probably find yourself wondering the same thing I was wondering and that is just how long it will take us to get this Marine to give up that virgin ass. Marshall must have liked the attention we were giving his ass because as soon as he turns over, he blows a huge load all over the place.",
  "models": [
    {
      "name": "Marshall",
      "person_id": 35117
    }
  ],
  "release_date": "2010-11-10",
  "scene_id": 70345,
  "series": "Direct Orders 3",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Marshall"
}