{
  "collections": [
    "Active Duty"
  ],
  "description": "I first fell head-over-heels for this guy when he cleaned my buddy Joe's gun over on <a href='http://mystraightbuddy.com?trk=23&track=23'>My Straight Buddy</a> (a super hot site that is free with your Active Duty membership!). Wyatt (as we call him here) is always known by the porn name, Fuckmaster. He's in about nine videos featured over on My Straight Buddy as well where Joe showcases this stud cleaning guns, showering, shooting guns out in the desert and even jacking off while talking on the phone with his girlfriend. He's quite the character and I'd always wanted to feature him here at Active Duty.<br /><br />As luck would have it, just as he got out of the Marine Corps and was heading out to the East Coast to start his new life, Wyatt stopped by to say goodbye and finally I got my chance to get this stud all alone. I'd met him and been around him countless times since I first saw him debut on My Straight Buddy and I guess I'd gotten used to how damn handsome he was. But we never got any alone time and I never got to get him to do the dirty things I wanted him to every time I saw him. So today was my chance to get this stud naked and get him to show off for me (and you) in private.<br /><br />I was actually taken aback by how affable Wyatt was and what a good, down-home guy he was when you closed the doors and sealed off the rest of the world and slowly lured him out of his shell. Wyatt is a true gem and once you get him alone he's one hot fucking dude to get to know. I had a lot of fun messing with Wyatt and giving him a hard time as I got him to push the envelope and try to embrace a different kind of fun than anything he might have done on My Straight Buddy. Wyatt if you're reading this, come back to the dark side, we're waiting!",
  "models": [
    {
      "name": "Wyatt",
      "person_id": 35217
    }
  ],
  "release_date": "2010-12-15",
  "scene_id": 70340,
  "series": "Wyatt",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Wyatt"
}