{
  "collections": [
    "Active Duty"
  ],
  "description": "Over the years I've gotten a lot of emails asking me why I don't write a book. I always wonder to myself if these folks have ever bothered to read my update letters. If they had, they might not suggest that such a grammatical and spelling disaster ever be attempted and if I told my webmaster I'm sure he'd get a big laugh. But it's guys like the one I'm introducing you to tonight in the War Chest that make me think that yes, I probably could write a book. Especially when I watch his video and realize that he's one of hundreds of characters that I've come across over the years just looking for their 15 minutes of fame   and in some small way   got it. But Tobias deserves his fame. He's a character to remember.I'll never forget the night I met this stud. I was roaming around outside the bars at closing time, slowly riding by and observing when I saw him walking all alone. I pulled up next to him only to realize I'd pulled into a one way parking lot the wrong way. The cops were out in full strength so I quickly put my card out the window and said 'Call me.' He wasn't having none of that. He said, 'Hey what the fuck are you some kind of taxi?' I told him to read the card. A quick read before I was able to pull off and he was yelling, 'Are you shooting tonight?' It was 2 AM but I said what the hell, 'Sure if you're game. Get in and we'll ride around and talk.' And from that car ride came a conversation worthy of any book I would ever dare to write.To make a long story short, Tobias wasn't buying it. He couldn't believe I thought he was worthy of taking pictures of and maybe I was drunker than he was, but this guy won me over and by the time it was all said I'd make a damn good friend that I'm sure will last for years. But it wasn't a friendship that wasn't earned. Tobias grilled me to the third degree. Below I'll just give you some of how the conversation went:Tobias: 'So you want me to get naked and jerk off? Where would we do this? In your car?'Me: 'No, no. I have a little place on the beach.'Tobias: 'Who's there?'Me: 'Just a friend of mine but he's asleep'Tobias: 'Let me get this straight. You want me to jack off in some motel room with some other dude passed out in the bed next to me?'Me: 'No, it's a two bedroom house. He won't even know we're there.'Tobias: 'How do I know you won't sell this to a bunch of 70-year old women?'Me: 'Well, you don't, but who cares?'Tobias: 'Yeah, fuck it, I don't. But I ain't into old women.'And from there the deal was sealed   well, almost. As we rode toward my bungalow something suddenly came to Tobias and he said:'Wait a minute. You want me to pay you to film me jerking off? I can jerk off by myself for free.'And so it goes. Tobias never really cared about the money as long as he wasn't the one paying and when he got paid that night he said, 'What the fuck? People will do anything these days.'",
  "models": [
    {
      "name": "Tobias",
      "person_id": 35155
    }
  ],
  "release_date": "2011-01-12",
  "scene_id": 70344,
  "series": "Tobias",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Tobias, Scene #01"
}