{
  "collections": [
    "Active Duty"
  ],
  "description": "I thought it would be nice to take a little break from Covert Missions and introduce you to another brand new Active Duty recruit that I found recently. This one really gets my motor running and I couldn't wait to share him with you.Devon is 21-years old, he's 5' 10' and weighs in at 175 lbs. He loves cars, rock climbing, gymnastics and he was on the high school swim team. Devon says he's interested in getting in the business to have fun and make some cash. When he takes off his shirt you'll wanna have some fun with him. He's not shy at all and getting Devon stripped out of his clothes was a breeze. He came ready and once he's down to his boxers he's already packing a nice hard on. A quick turn around shows off a nice ass that'll make you wanna see more.Devon is a teaser and he plays with his cock through his boxers, rubbing and jerking that hard massive meat for a few minutes before showing us all the goods. I love a tease don't you? And Devon is damn good at it. Once he pulls out that huge meat stick you'll be drooling all over yourself. He's hung and packing a nice pair of low hangers that he loves to play with. He also likes reaching beneath them and playing with his ass a little. It seems to really get him going.Devon really gets into pleasing himself as he throws his head back and enjoys the attention he's paying to himself. He'll having you wanting to jump up on the bed and help him out, he's so sexy. I get a lot of footage of this hottie because I'm so taken with him. He's so masculine yet so open and free-spirited and you can tell he likes being admired.When he bends over and shows us that pretty pink asshole you'll wanna dive right in and just wait until he gets ready to cum and gets very verbal. Mmm. Mmm. Look out for more of this hottie in the near future.",
  "models": [
    {
      "name": "Devon",
      "person_id": 35014
    }
  ],
  "release_date": "2014-03-12",
  "scene_id": 70350,
  "tags": [
    "Big Dick",
    "Blonde",
    "First Time",
    "Gay",
    "Jerk Off",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Devon, Scene #01"
}