{
  "collections": [
    "Active Duty"
  ],
  "description": "At first I wasn't all that excited about this stud, but once he got in front of the camera and his personality came out, I took a second look at him and realized I'd discovered a diamond in the rough.<br /><br />His look isn't the usual for us here at Active Duty -- he reminds me more of one of those beefy Colt models from days gone by and that's exactly what makes Hurley such a special addition here at Active Duty. The more I was around him, the more he rubbed off on me and even reminded me of the late Haus Weston when I first met him. He's an affable, sexy guy and once he peels off his clothes you'll fall in love with what's beneath. That ass is worth making a note of as it's damn near perfect. The more I was in Hurley's company, the more I fell for this big brute. In fact, by the time the shoot was over, I was damn near in love. And lucky for us, Hurley is ready to go the distance. He's looking for fun and is willing to try new things and that's just what we like.<br /><br />Hurley is 19-years old, he stands 5' 11' tall, weighs 195 lbs. and loves football. And with a tight-end like his, I'm sure he's a damn good player. He's from Minnesota and you can tell. A viking in size and heart. He says he knows he's got what it takes to make it in the business. At this point I get him to stand up for us and you can clearly see the imprint of his thick, hard cock underneath his jeans. I tease him a bit and get him to pull it out and when he does, it's standing at full attention, ready for action. A quick turn-around reveals that ass that you'll just want to bury your face in for hours. Trust me when I tell you, the more time you spend with this stud, the more you're gonna love him.<br /><br />Hurley gives us a nice, long look at every inch of his gorgeous, beefy body and that edible ass for as long as we want it before shooting a deliciously big load all over the place that'll have you wanting to lap it all up and go for seconds. He's not shy at all when it comes to showing off and his confidence is as much of a turn on as his beefy ass and cock. This big boy is definitely a keeper. And I intend to make sure he stays right here with us.",
  "models": [
    {
      "name": "Hurley",
      "person_id": 35090
    }
  ],
  "release_date": "2014-05-28",
  "scene_id": 70353,
  "series": "Hurley",
  "tags": [
    "Big Dick",
    "Brunette",
    "First Time",
    "Gay",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Hurley"
}