{
  "collections": [
    "Active Duty"
  ],
  "description": "It's Wednesday's War Chest time again and we've got you covered with another brand new recruit who I'm sure you're just gonna love. Dustin is about as sexy as they come and he's quite the show-off. Tonight's War Chest video gives Dustin plenty of time to strut his stuff. and showing off is something I think you'll agree he does very well.Things kick off with the usual interview where we learn that Dustin is 20, 5'7' tall and weighs 145 lbs. He shows off his tats and tells us he's up for just about anything. He's into dancing, cars and like most young studs he loves to party and have sex. As he starts stripping off his clothes we quickly learn that this little stud is packing an incredibly nice, tight body and once he turns around that's all she wrote. An ass for days! Yes, days. Months even! This compact little stud has some serious junk in the trunk and he loves showing it off. The camera gets glued to that glorious gluteus maximus and it's hard to move forward from there, but we manage. Dustin does some serious posing for us then he hops down on the floor and does some push ups while the camera follows him.Once he's on the bed it doesn't take long for Dustin to steal the rest of the show. He talks to the camera constantly, engaging us with his showmanship. Trust me, this guy is entertaining. By the time it's over we've all learned a new lesson in the art of a good jerk off session and it's one we won't soon forget.And if the instructional jerk off session wasn't enough, once it's over we get a huge bonus by following this cutie to the shower where he practically does a whole other show for us.Water. Cascading. Muscles. Glistening. Ass. Incredibly bendy. I think I just done passed out.I think you're going to agree that this one loves to show off and I think you'll also agree that you could watch him do it many times over. So, hit rewind and do it all over again.Once you've watched the video at least twice, be sure to cruise over to the Gallery Updates and check out some very nice images of Dustin.",
  "models": [
    {
      "name": "Dustin",
      "person_id": 35016
    }
  ],
  "release_date": "2011-03-23",
  "scene_id": 70355,
  "series": "Dustin",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Dustin, Scene #01"
}