{
  "collections": [
    "Active Duty"
  ],
  "description": "When I was growing up and we'd get a cold grandma would always slip us a little bourbon with some honey to help us get better, but later in life I'd learn that it sometimes took more than a little bourbon to make you feel better when you're battling a cold. The best thing to do is bundle up and head to your local watering hole and find yourself a bar stool beside a hot military guy and strike up a conversation while you nurse your cold with several shots.<br /><br />So, recently, that's exactly what I did.<br /><br />And while I was nursing that cold with shot after shot of good, strong bourbon I was chatting up the strong, hard man next to me. His name was Pierce and as our conversation followed the shots, I'd spill the beans to him about what I did for a living. Intrigued, Pierce wouldn't let me out his sight for the rest of the night.<br /><br />He followed me home with little coaxing and ended up butt-ass naked on my couch where he helped himself to my porn collection while I was scrambling around for more 'cold remedy.'<br /><br />By the time I got the camera turned on he'd already shoved his hands down his pants and started playing with his cock. Doesn't take long for me to get him out of his shirt and then, out of his jeans. I get him to stand up and show off that perfect body and pecs for days and then I get him to pull down his jeans where we can see his hard cock peeking through his plaid boxers. Once the boxers come off that cock is standing at full attention. You can tell this guy is ready for some action.<br /><br />Pierce is 21, 5' 10' tall and weighs 165 lbs., but looking at his massive chest and arms you'd swear he weighs more. And the nipples on this guy are the size of silver dollars. A perfect specimen we've got here. Pierce is playful too and doesn't hesitate when it's time to show off that beautiful ass of his as he bends over my couch and gives us a nice view from behind. Then he stands up and delivers a gushing cumshot that squirts all over me. See what I do for you guys? Pierce gives a big grin and a look of satisfaction and it's a wrap. Thanks for plain'.",
  "models": [
    {
      "name": "Pierce",
      "person_id": 35127
    }
  ],
  "release_date": "2011-04-13",
  "scene_id": 70357,
  "series": "Pierce",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Pierce"
}