{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm really excited about tonight's new War Chest recruit and am all giddy about sharing him with you.Nolan is a mess, but he's a good mess. He's always got something going on and he over-extends himself so that he's often left with no choice but to back out on you at the last minute. We had tried two nights in row to get him in for his solo, but something kept coming up and when you see this man you'll know why he's in such high demand. He's simply stunning and he's a character to boot. He and I get along very well and are able to give each other a hard time without causing any hard feelings. We're both good sports and it shows in tonights War Chest video.Nolan staggered into my place one night with the regular crew of military guys that seem to find their way to my house when the bars all close &nbsp; my couch and spare rooms and sometimes even the floor quickly fills up with wayward men who find it a better option than risking a DUI. I'm always happy to accommodate them. When Nolan showed up, I was instantly smitten and he and I ended up talking most of the night and by the time the sun came up, I had him convinced to strip down and show it off for us. But that would take a few more days as his busy schedule kept him from showing up. Once he did, though, it was well worth the wait.Nolan is 24-years old, stands 6'1' tall on a good day with sandals on and weighs between 200 and 215 lbs. Nolan is a good ol' Texas boy who likes jet skiing, riding Quads and of course bar hoppin'. This guy is stacked. You can tell he spends some time in the gym and it pays off. Big, beefy and hung like a Mack truck.I leave the room for a few and when I come back, Nolan has his cock and balls crammed into a cock pump and he's pumping it like crazy. I wasn't expecting this surprise, but I go along with it. If that huge cock can get any bigger I definitely wanna see it.As things move forward we notice something a little different about Nolan: This guy likes it rough. He pinches his nipples, beats and slaps on his cock and talks a lot of shit. I get us all a nice, long look at every inch of this guys hot cock and body and pay special attention to his perfect pink pucker. After it's all over, I follow him to the shower and we get to watch him clean up the mess.",
  "models": [
    {
      "name": "Nolan",
      "person_id": 35173
    }
  ],
  "release_date": "2011-04-20",
  "scene_id": 70358,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Nolan, Scene #01"
}