{
  "collections": [
    "Active Duty"
  ],
  "description": "We're back with another of Kaden's Recruits for you tonight in the War Chest. Now, I could go on and on about this gorgeous stud, but I think Kaden tells it best, so I'm turning it over to Kaden:Hey Guys! I met Lex at a local bar I go to frequently. He is 22 years old and weighs about 180 lbs. and is 5'9' tall. When I saw him, I thought to myself, 'Damn, I have to give this gorgeous guy my card.' Only thing was: he was with a girl and I did not want to go up and embarrass him. So I decided to ask him if he would like to play some pool. I happen to be an avid pool player and I knew that this would be my only chance to get him away from his girl, so we could have some, '1 on 1 time.' I could not even focus, he was looking so amazingly gorgeous that I knocked the cue ball off the table several times that night. I was hoping the cue ball might 'accidentally' hit his girlfriend in the head and I could steal him away right then and there! As soon as his girlfriend went to the bathroom, I made my move. I told him, ' Here is my card, and I would really like for you to do some work for me.' He seemed apprehensive, but I knew he was certainly curious about the idea. So we decided to put a little waiver on the last game of the night. If I won he had to do a solo for me, If I lost, I would pick up his entire bar tab.Lucky for me, that is when I was ready to get my hustle on, in several different aspects. Long story short, I won! So we met up the following day and he brought over a Flesh Jack. I was like 'Wow, this guy is not only gorgeous but he is a sexaholic too.' He was ready to stick that big gorgeous dick into that jack and show off his body without any signs of nervousness. I was like, mmhmmm I know this is not your first time. He has such a masculine body and his ass is perfectly round and bubbly. Lex flexes every ounce of muscle in his well defined body, I was sweating like a whore in church. I don't know how Dink does it, I was ready to throw that camera down and fuck him sideways till I was numb from head to toe. Lex has an awesome personality to match that beautiful body. I feel very honored to have been able to see Lex in his natural beauty. Now it is your turn!Kaden SaylorAnd there you have it troops, straight from the source!",
  "models": [
    {
      "name": "Lex",
      "person_id": 35222
    }
  ],
  "release_date": "2011-04-27",
  "scene_id": 70359,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Lex"
}