{
  "collections": [
    "Active Duty"
  ],
  "description": "We're back with another super hot new recruit for you tonight in the War Chest Update.<br /><br />I'm really excited and super crazy about this guy. He's got cuteness and personality for days and he's just my type. Talk about a little scamp, Kale is the epitome of the word. He's adorable and playful and he knows just hot to get what he wants out of you.<br /><br />At least that holds true for me. Once he bats those pretty eyes and flashes that cute little smile I fall into his trance.<br /><br />Kale is just 19-years old, stands around 5'8' and weighs about 165 lbs. In high school he was on the gymnastics team, wrestled and played football. His hobbies include playing guitar, working on his car and playing in his band.<br /><br />Kale has always thought about getting into the porn business but until he met me, he never really knew how to do it. And you know me, I'll get him on the fast track to learning quickly!<br /><br />In fact, Kale and I have become good buddies since we shot this first solo and he's been on the Dink Flamingo two-step porn plan. And he's already rounded second base, but we'll learn more about that in the coming weeks.<br /><br />Yes, Kale has become a team player so let's get to know him tonight in the War Chest before he's whisked off to basic training at Camp Flamingo. (What lies ahead in basic training? Only we know! Mwah ha ha!)<br /><br />I can't put my finger on who Kale reminds me of. In fact, he reminds me all the time that I tell him I remind him of everyone. One person he does remind me of is Mason Wyler. But there's a lot of other people he brings to mind. He also reminds me of Elijah when he laughs and his eyes remind me of Brian, but once you've done this as long as I have, features begin to run together and you see so much of other people in every person you meet.<br /><br />One thing I am sure of is that while Kale may remind me of a lot of different people, he's definitely one of a kind!",
  "models": [
    {
      "name": "Kale",
      "person_id": 35015
    }
  ],
  "release_date": "2014-05-07",
  "scene_id": 70351,
  "series": "Kale",
  "tags": [
    "Gay",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Kale"
}