{
  "collections": [
    "Active Duty"
  ],
  "description": "Sometimes you gotta chase 'em.I don't always get lucky that first time around, either. I've been known to chase a hot man just as long as it takes me to catch him. Tonight's new recruit in the War Chest was one of those guys I had to really chase. The first time I met him we were having a cigarette together outside a local bar. He was so nice and sweet and so polite. I threw that cigarette down just knowing that I had this one locked down and that my phone would be ringing with Asher on the other end any minute.Days passed and I still didn't hear from him. I was heartbroken. And, I kept going to that bar in hopes of seeing him again. Never got lucky. But, even though I'd written him off, things weren't over yet. A couple of weeks later I got a call from a friend who said they'd met someone that I knew. When I found out it was Asher, I got all giddy. I hurried to arrange a meeting where Asher and I would get our second chance to be friends. But as they say, third time is a charm and it would actually be our third meeting that would seal the deal.Asher is a real keeper. It may have taken me a little longer than usual to pin this former high school wrestler down, but once I did, I had a friend for life. Asher and I have become fast friends and make a point of hanging out at least once a week. Not only is he totally gorgeous, but he's sweet as all get out and is a very considerate friend. He'd give you the shirt off his back, but if you knew what was underneath you might just as well rip it off him.Asher is 5' 6' and weighs 148 lbs. He enjoys playing soccer, practices martial arts and swims regularly. He was an avid athlete in high school and played nearly every sport. While he's telling us all about that I get him to stand up and start getting naked. Once his jeans come down the first thing we see is that gorgeous bubble butt of his. Then he turns around to reveal a raging hard cock. Talk about standing at attention. This guy is ready for battle. He drops down and gives us some push-ups where I get some great shots of his had cock touching the floor and some great sneak-peeks at that beautiful round ass. The sunlight hits it perfectly and he crawls on the bed to give us a show. Don't miss this super hottie as he slowly takes us through a beautiful jerk off session as we sit back and fall in love. And lust!",
  "models": [
    {
      "name": "Asher",
      "person_id": 35034
    }
  ],
  "release_date": "2011-05-05",
  "scene_id": 70360,
  "series": "Asher",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Asher, Scene #01"
}