{
  "collections": [
    "Active Duty"
  ],
  "description": "I met Tanner on one of my recent trips traveling the bases looking for hotties who are willing to strip down and stroke it for the camera. I'm usually pretty lucky on these trips and this time was no exception.<br /><br />Tanner was among my favorite finds on this trip even though it was a female friend of mine who put us in contact. Man, I really wish I could take the credit for finding this sexy little devil pup, but I can only take credit for getting him naked and directing him through some really hot photos and a really engaging jerk off session. Tanner was a pleasure to work with and such a sweetie. He was more than willing to follow direction and even throw in some of his own special treats like playing with his pretty little ass for us and fingering his hot hole.<br /><br />Tanner stands 5'10' tall and weighs in at around 160 lbs. He enjoys hiking, camping, snowboarding and jacking off. Once he strips out of his shirt we get treated to some of the most defined abs I've seen in awhile. I mean really, you could wash your laundry on them. And grate cheese.<br /><br />Once he comes out of his boxers, a nice, fat cock is revealed that will have you drooling in no time flat. Tanner is very sensual and you can tell he's right at home showing off for the camera. His cock is rock hard in no time at all and we're on our way to a fun time with this stud as he really gets into it.<br /><br />The entire time I was filming him I kept wondering who he reminded me of. By the time he blew his fat load all over himself I knew exactly who it was -well, two people actually. The actor James Franco and our very own Chaz   without the blonde hair. In fact, he could be a cousin to either and it would be totally believable. You're gonna love this guy. He's got all the moves down and that sly little grin along with those beautiful bedroom eyes will have you watching him more than once I'm sure.",
  "models": [
    {
      "name": "Tanner",
      "person_id": 35169
    }
  ],
  "release_date": "2011-05-11",
  "scene_id": 70361,
  "series": "Tanner",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Tanner"
}