{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight we've got a super hottie to share with you that I met through our friend Mike from Covert Missions.  Luckily for me, I got to him before Mike did and we had a great time getting to know each other and shooting his solo that we're sharing with you in the War Chest tonight.  Rusty is a handsome stud and has those puppy dog brown eyes that'll melt your heart and when he flashes that smile with them, that's all she wrote.  He's admittedly bisexual and that made my job very easy.  It also opened the door for some other things that we'll talk about a little later.Rusty is 20 years old, stands around 6' and weighs 160lbs.  He enjoys playing the guitar and drums and says he's a pretty good country singer that can sing karaoke pretty damn good.  He says people tell him all the time that he should go on 'American Idol' and he just laughs.  Well he might not make it to 'American Idol' but we've got something even better.Rusty tells us about some experiences he had in his teens with a friend of his.  Things got a little crazy one night and ended up going from hand jobs to blow jobs to the two of them fucking each other and getting off multiple times.  But that wasn't the last time, they seem to have made a regular thing out of it and did it at least five more times. I happened to meet another one of Rusty's friends named Tate and I really wanted to see the two of them together, but we'll introduce you to Tate in the coming weeks.  Rusty is just gorgeous.  He reminds me a little of Landon from the Crossin' The Line series.  Angelic face, nice, toned body and an ass to die for.  I get him to stand up, turn around and drop his pants and show off that gorgeous ass for us.  And this one likes to show off.  He goes commando just to make showing it off that much easier.  I tell him his buddy Tate was pretty good at showing off his ass and this presents itself as a challenge to Rusty.  He bends over the chair and spreads his cheeks and starts showing that ass off like there's no tomorrow.  Talk about knowing how to arch your back, Rusty is a pro.  One thing you are sure to notice while Rusty is turned around showing off that scrumptious butt is those huge fucking low hangers he's sporting.  They're hanging like a bag of gold tied to his cock.He takes his pants off to free up his movement and continues the ass show.  I'm egging him on the entire time telling him all the things Tate was doing for the camera.  Rusty isn't one to be outdone and he's working the camera good.  Thank goodness this ain't 'American Idol.'As soon as he's done he hops on the bed with a hard on and starts stroking it. He's packing some serious man meat and you'll get lost somewhere between that gorgeous face, those beautiful eyes, those perfectly hairy legs, those low hangers and that huge cock.  He bends over again and shows off that perfect ass and that beautiful hole with just the right amount of soft fur.  This guy is a total tease that will drive you crazy.  I, for one, am in LOVE",
  "models": [
    {
      "name": "Rusty",
      "person_id": 35168
    }
  ],
  "release_date": "2011-08-03",
  "scene_id": 70376,
  "series": "Rusty",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Rusty, Scene #01"
}