{
  "collections": [
    "Active Duty"
  ],
  "description": "We're back and tonight we've got a live one for you in the War Chest Update. This guy is full of personality and loves to show off on camera. He's got an ass to fucking die for. You know me, I love a nice, tight bubble butt and I spend plenty of time behind Carson getting to know his ass, I mean -- him, him. He's also got another thing going for him when it comes to getting in good with the director and that's the fact that he's a shorty, too. We all know I like them short and Carson stands about 5' 7' and weighs in at around 160 lbs. This little compact hottie is not only sporting a gorgeous ass, beautiful smile and a nice cock, but he's also got a set of abs so defined you could wash your dirty laundry on them.<br /><br />Aside from being the perfect package, Carson has a personality that lights up the room and he's very interactive with the camera. This guy is a total ham and you can tell he loves every second that the camera is on him.<br /><br />We chit chat while he jerks it and he never misses a beat. Throughout the video (while he keeps jerking his cock) we learn about his first blow job and the time a girl tried to stick a finger in his butt, but he cut her short and told her he's the one that should be doing her in the butt. I think you'll beg to differ and agree with me that with an ass like Carson's, he definitely needs to reconsider. Don't worry, I'm already working on it, troops. Give me time.<br /><br />You're going to really fall for this little tough guy as he grabs your attention from the very beginning and plays with your heart strings all the way to the explosive cum shot. His cock is so rock hard all the way through that even after he blows his massive load it's still standing at full attention. He ends things out by saying, 'I hope you enjoyed my cock!' And indeed I'm sure you did.<br /><br />Keep your eyes open for Carson as I'm sure you'll be seeing more of him sooner than later.",
  "models": [
    {
      "name": "Carson",
      "person_id": 35056
    }
  ],
  "release_date": "2011-08-22",
  "scene_id": 70377,
  "series": "Direct Fire 2",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Carson"
}