{
  "collections": [
    "Active Duty"
  ],
  "description": "We're back this week with a special video that I shot kind of spontaneously one day when I caught Asher napping at my place. We had a long night the night before and he disappeared in the afternoon to take a shower. After he'd been gone too long for just a shower I got curious and thought maybe I'd get lucky and catch him jerking off. Well, I didn't catch him jerking off but it took no convincing him once he woke up with a hard on.When we posted his first solo awhile back, I got a ton of emails about this blond-haired blue eyed all-American boy next door. People loved him as do I. He's a short, compact guy with a gorgeous face, a very nice dick and looks that can make any room he shows up in go quiet and stare.So things kick off with me filming him while he's taking a rest as he discovers his cock is hard and starts rubbing it and playing with it through his tighty-whities. He looks so delicious laying there that all I can do is be quiet and watch for a bit. He's so handsome that just watching him taking a rest is an experience.When he wakes up, he grabs his glasses and the laptop, finds some good porn and then pulls out that nice hard cock and slowly starts stroking. He doesn't seem to mind that I'm there with the camera, in fact I think he kind of enjoys the audience. He peels off his undies and gets more comfortable and those beautiful balls are just perfect. The shirt comes off next to reveal that perfect chest and those chiseled abs. He starts rubbing himself all over as the porn seems to get better.Half way through he shoots an amazing load. One of the hugest gushing cum shots I've seen in awhile. Afterwords we get a very nice shower show as he finally does what he went upstairs to do in the first place. We get to relish every last inch of that perfect body as he washes every crevice. Delicious!",
  "models": [
    {
      "name": "Asher",
      "person_id": 35034
    }
  ],
  "release_date": "2011-08-17",
  "scene_id": 70378,
  "series": "Asher",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Asher, Scene #01"
}