{
  "collections": [
    "Active Duty"
  ],
  "description": "we've got a brand new recruit for you fresh from Kaden's camera.Tonight in the War Chest we are introducing you to this delicious uncut delight named Drake. Kaden met this hottie in a park that he frequently goes on runs in and it was there that he spotted the sexy Drake shooting hoops. Kaden circled back around by the courts and sided up next to Drake to give him a card. The rest, as they say, is history. Drake was more than willing to strip down for Kaden on camera and so they set up a time to do the deed. Kaden continued on his run and Drake kept shooting hoops, but the best was yet to come.Drake shows up at Kaden's place looking fresh and ready to go. He's a little nervous but all smiles. Drake weighs about 170 lbs and stands 5'10' tall. He enjoys shooting basketball and has a dream of being in the NBA. He also likes to draw and enjoys pretty much anything he can have fun doing. Kaden chats him up a bit and then leaves him alone with some hot porn to get comfortable and naked.  As soon as Kaden leaves, Drake loses the shirt. He looks at the camera for and gives us a hand gesture to let us know he's aware we're watching. As quick as he came out of his shirt, he comes out of his boxers and shorts and his nice, uncut cock flops between his legs. It takes him a minute to realize that Kaden expects him to get the party going without him, but once he does, he gets that nice cock standing at attention pretty damn quick.Now if there's one thing I love it's a nice, fat uncut cock and Drake is sporting a beautiful one. Kaden returns and Drake flashes a nervous grin that says he's glad Kaden's back. Kaden stars manning the camera and getting some good close-ups of the beautiful uncut jewel as Drake shows it off good for us. You can't help but like this guy as he tries very hard to please his director. His cock stays at full attention from start to finish and he has no problem putting on a show. He'll kind of remind you of the twins I think as he does me.What will Kaden be able to get this tough guy to do next?",
  "models": [
    {
      "name": "Drake",
      "person_id": 35225
    }
  ],
  "release_date": "2011-07-20",
  "scene_id": 70373,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Drake, Scene #01"
}