{
  "collections": [
    "Active Duty"
  ],
  "description": "Personality is an understatement when it comes to Rhett. This guy is not only adorable but he's got personality for days. Rhett tells us that he's 24 years old, is 5' 10' tall and weighs in at 167 lbs.Now there's an interesting background story here with Rhett as we learn Mike has known him now for about three years. Rhett didn't know that his brother had been secretly doing videos for Mike the whole time. Rhett says he held out because he was nervous, but you won't be able to tell that was ever the case after watching him in his War Chest video tonight.Mike and Rhett have quite a conversation and you won't know who is bullshitting who as you listen to these two go back and forth. Rhett tells us about his pregnant wife like it's just all part of conversation. So we get a little bit of history before we get down to the meat and potatoes.When the meat finally does make its way out of his shorts, it's not Rhett's cock he decides to show off first. He's all about giving us a nice, long ass show and with an ass like his you'll appreciate the full attention. This one knows just how to tease all of us ass lovers and give us exactly what we want. Even ol' Mike has to speak up a few times and voice his opinion of the bubble butt. Rhett knows how to spread 'em and arch that back without even being told what to do. He likes it rough, too, as he spanks his own ass and pulls his cheeks far apart, showing us the gold mine. Once he's got us in the palm of his hand, he starts fingering that nice little puckering hole and you can tell that this is what he likes to do when his wife isn't around.His furry little manhole just winks at the camera over and over and he's rubbing his cheeks and talking mad shit to Mike. He's working Mike for everything he's worth and giving him a damn good run for his money. This kid is extra sharp and though there may not have been a camera recording it, you can just tell he's been here before and he confesses to many things. This is where it gets really interesting.Seriously, this is probably one of Mike's best solos in that he has such a super rapport with Rhett and the conversation is fun and sometimes fascinating. I keep thinking what a good pairing he'd make with Nick Gunner or even Zander or hell, maybe both.  I gotta go, troops, I just restarted the video.",
  "models": [
    {
      "name": "Rhett",
      "person_id": 35028
    }
  ],
  "release_date": "2011-06-29",
  "scene_id": 70371,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Rhett, Scene #01"
}