{
  "collections": [
    "Active Duty"
  ],
  "description": "a brand new hottie that Kaden found for his 'Kaden's Recruits' series. Kaden is sharpening his eye for talent and today's new recruit is just an example of some of the new studs he's been able to get naked in front of his camera lately. I think you're going to agree with me I say we've got some winners on our hands.Tyler is Kaden's new favorite so I thought I'd share him with you guys first. And, the more I look at him he might be my new favorite, too. But there's a little short blonde hottie coming soon that still has my heart strings all wound up. Kaden chats Tyler up for a bit and we learn some things about this guy.Tyler loves working out and is a personal trainer. He's 6' tall and weighs 187 lbs. of what Kaden calls 'solid muscle.' You can tell he's as nervous as a whore in church, but Kaden is throwing on the charm and loosening him up pretty quick. Once Kaden leaves him alone for a bit, Tyler wastes no time stripping off his clothes all the way down to his boxers. He sits back on the couch and starts playing with his crotch as he watches the porn that Kaden has started for him. You'll love his sexy body and those big, beefy legs. It's not long before he's got his soft cock in his hand, working it up. Once he's hard you see him look at Kaden off camera for the approval to pull off his boxers.And holy fucking shit when he does, we see a monster standing straight up at full attention between his legs. Now I see why Kaden fell in love so quick. I'm right there with him as I watch this beefy stud show off his package. Kaden can't help getting a little chatty with excitement as he starts zooming in closer to his new love.Aside from a great body and huge cock, Tyler is sporting some very impressive lowhangers and you'll wish you could bury your face between those meaty thighs and get a taste. Join the crowd -- line forms around the block. Just watching his huge nuts move up and down in their sack is enough to drive me over the edge. I'm ready to jump through the screen and lend a helping hand to Tyler. He strokes his big, curved cock faster and faster as Kaden zooms in closer, getting a look at every last inch of this stud.And Kaden doesn't forget all of us ass lovers as he gets Tyler to show off that perfect round bubble butt for us. It's perfectly round and furry in all the right spots. And Tyler already knows how to arch it just like we like it.By the time Tyler turns back over, he's horny as hell and ready to pump that cock hard. He's giving us a good long show and giving us voyeurs exactly what we want. Kaden does a fine job directing this hot stud all the way to his thick, juicy cumshot.",
  "models": [
    {
      "name": "Tyler2",
      "person_id": 2
    }
  ],
  "release_date": "2011-07-06",
  "scene_id": 70372,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Tyler2, Scene #01"
}