{
  "collections": [
    "Active Duty"
  ],
  "description": "As luck would have it I met Bric just a few days before he was getting out of the Navy and I spared no time at all. When opportunity knocks, you answer the door with a big smile. I quickly took advantage of the lucky streak and sort of fast-tracked Bric. I got him in for two solos right away. Yeah, I couldn't get enough of him, either. He's just that damn hot. Those dreamy eyes are enough to make you forget your name and that big, uncut cock is damn near perfect. Couple that with a body that won't quit and you've got the total package. I've never won the lottery, but I struck gold with this guy. Aside from being sexy as fuck, Bric is a really cool guy, very approachable and after he warms up he melts the screen.<br /><br />In our first session we get to know a little about this stud as he tells us he's 22-years old, stands about 5' 8' and weighs somewhere in the neighborhood of 160 lbs. He likes cars, motorcycles, snowboarding, working out, going to the beach, drinking and all your typical guy stuff. Bric says all his friends would expect him to do something like porn. He's always the adventurous one and we hope to see more of that side of Bric as time goes on.<br /><br />After I leave him alone for a bit it doesn't take very long at all for him to unbutton his jeans and haul out that uncut treasure he's been hiding. Those abs are defined and that cock so big that it might take you a bit to notice just how handsome his face is, too. As he warms up, he gets more into showing off the goods and you can tell that he's totally comfortable though maybe just a tad nervous.<br /><br />The first-timers' nervousness has no bearing on his horniness and this stud's cock stays at full attention the entire time. He enjoys playing with his balls and pulling his foreskin over the head of his cock and I'm sure you won't mind letting him do whatever he wants as long as he lets you watch.  When he comes up on his knees and starts stroking you can see the <br />precum oozing out.<br /><br />He starts rubbing his chest and abs and showing off that gorgeous body before turning around to show off one of his best assets. After sharing a little bit of everything with us, he shoots a nice, creamy thick load all over those perfect abs. I follow him to the bathroom for one last look at that beefy butt and it's a wrap.",
  "models": [
    {
      "name": "Bric",
      "person_id": 35047
    }
  ],
  "release_date": "2013-03-25",
  "scene_id": 70375,
  "series": "First Strike 3",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Bric"
}