{
  "collections": [
    "Active Duty"
  ],
  "description": "I passed camera duty off to my friend Major Wood on this hottie. The Major puts our new recruit through the paces and by the time it's all over I'd say Shay has definitely passed the test. The Major is a tough customer, but Shay keeps the pace and stays all stiff and smiles through the process.Shay is a sexy blonde that stands 5'9' tall, weighs 160 lbs. and is 23-years old. In high school he played baseball, football and did a little bit of wrestling, too. His blue eyes and Southern accent just melt me every time I watch this video. He tells a story about his first blowjob from a slutty 9th grader when he was just a 7th grader. So, clearly, he started out liking them older from the start.The Major gets the party started by getting Shay out of his shorts where we see a nice package as Shay starts working it up. It doesn't take long before his beautiful cock is hard and the Major is right in there between his legs catching all his glory. This studs hairy legs are amazing and you'll probably wanna just lay your head down on them and snuggle your face close to that nice fur, but you'd quickly get distracted by that nice cock I'm sure. The same goes for the light fur on his belly.Another hot feature for me on this hot stud is his brown, dime-sized nipples that I could just play with for hours. After a few minutes of initial nervousness he's right in there, playing ball. His hard cock stays at attention and we see a natural emerge. The next thing that caught my eye was his armpits. That blonde hair bushing out and just looking so delicious. This stud is certainly a keeper.The Major pushes forward and his next mission is to get Shay to show off that nice ass for us. The nice trail of blonde fur leads right to the bullseye and we see a nice pink hole hidden beneath the beauty of all that blonde hair. The next thing I notice is a large amount of pre-cum on Shay's thigh that tells the story that he's really having fun. The Major gets him in several positions and really gives this recruit a nice workout that I think you'll enjoy as much as I did and I'm sure the Major did.",
  "models": [
    {
      "name": "Shay",
      "person_id": 35145
    }
  ],
  "release_date": "2011-09-14",
  "scene_id": 70382,
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Shay, Scene #01"
}