{
  "collections": [
    "Active Duty"
  ],
  "description": "Kasey, Levi, Hops, Trey and Mr. Woods ... The five hotties meet up at my place and before I can get the camera turned on they are all naked and hard and the action is already getting heated. Trey's gonna be the bitch today and suck all four cocks. He starts out with Kasey's cock in his mouth as he sucks it slowly, but intently. Levi moves in next and feeds our cocksucker as the line forms behind him. Mr. Woods follows Levi and shoves his cock in Trey's mouth and Trey strokes his cock all the while. Kasey goes back for seconds and Hops brings up the rear. Hops throat fucks Trey good and hard as he talks shit to the cocksucker. Trey Is The Resident Cocksucker ... Levi and Kasey follow Hops and double feed our cocksucker with both their hot, hard cocks. Trey seems to be in heaven as he enjoys being used and abused. He's stroking his own hard meat as he handles the cocks in front of him like a pro. They move things up on the bed and Trey keeps the pace as the boys keep feeding him. Hops moves in and takes Levi's place at the helm and Trey doesn't miss a beat. He's playing a fun game of musical cocks and having himself a blast. Levi And Kasey 69 While Hops And Mr. Woods Throat Fucks Trey ... Levi gets back in the saddle for awhile before finding himself in a nice 69 with Kasey at the foot of the bed while Hops and Mr. Woods tag team Trey's throat some more. We've got a great view of all the action as Levi continues to service Kasey and Hops and Mr. Woods keep Trey's mouth occupied. Levi's cock is hard as a brick as he manhandles Kasey's hard meat. Mr. Woods delivers the wood and keeps his cock deep in Trey's throat. Trey jerks his own dick fast and hard as he enjoys being the bitch. Trey is so hard as Mr. Woods fucks his throat and his balls are drawn up deep inside him. He looks like he's about to blow a huge wad, but he's got more work to do before that happens. Levi and Kasey take the reins again and put Trey on his knees as they share his mouth. Hops and Mr. Woods take the reins one more time for good measure to be sure our cocksucker feels like a good whore. Trey Takes All The Loads All Over His Face And Chest Then Shoots His Own ... They tell Trey to get down on the floor so they can cum all over him and he does as he's told. Hops is the first to blow his fat load all over Trey's face and chest and Trey licks the leftovers off for good measure. Mr. Woods and Kasey follow Hops and blow their loads on Trey's face and chest at the same time. Levi brings up the rear and finishes off on Trey's other cheek and eye. Trey ends things out with his own cumshot mixing in with the gallon of cum that's already covering him. He's literally drenched in hot cum -- what a hot, hot mess.",
  "models": [
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Matt Woods",
      "person_id": 35242
    },
    {
      "name": "Hops",
      "person_id": 35087
    },
    {
      "name": "Levi",
      "person_id": 35112
    },
    {
      "name": "Trey",
      "person_id": 35161
    }
  ],
  "release_date": "2008-03-17",
  "scene_id": 70395,
  "series": "The Surge 3",
  "tags": [
    "Gay"
  ],
  "title": "Hops, Kasey, Levi, Matt & Trey"
}