{
  "collections": [
    "Active Duty"
  ],
  "description": "Tully Has Come Home Hungry ... One minute into the video and Tully already has Reese's cock down his throat like the hungry cock-sucker he is. He's stroking his own meat and worshipping Reese's huge cock as he swallows it all the way to the balls. Reese jumps right in there and starts choking Tully with his fat meat as Tully goes wild on the dick. Tully is as rambunctious -- maybe more rambunctious as he's ever been -- I'm sure the tequila shots were helping as he worships the huge meat. Tully soon strips Reese's pants off and raises his legs to get down on those huge balls of Reese's. All the while Tully is begging Reese to tease him and slap him with the huge cock. Tully rams his tongue up Reese's ass and Reese is in heaven. Reese and Tully soon pulls each others shirts off in a passionate rage as these two really get hot and heavy. Tully starts kissing and sucking Reese's nipples and chest.Passionate Kissing and Sucking Heat Up The Room ... After the shirts come off, Tully and Reese embrace in some extremely passionate kissing and Reese goes right along for the ride. Not bad for a newbie! Tully leads this duo right where he wants it to go. Tully goes back to sucking and worshipping that huge cock again as Reese just lays back in pure ecstasy. Tully throws Reese's legs in the air once more and eats his ass some more before focusing his attention on Reese's huge nuts. We find out that Reese really liked his big nuts sucked and pulled on as Tully continues his oral expertise. Reese is getting right into this hot action as he talks dirty shit to Tully and tells him how he likes it. Reese is a firecracker himself as these two set the screen on fire. The cock-sucking continues with Reese even sucking Tully some and eventually sticking his finger up Tully's ass after Tully does the same to him. Tully Takes His First Cock Up His Ass -- Ever! ... After Reese has fingered Tully's ass for awhile, Tully looks up at him and says he just got out of a three year relationship with a woman and he's never been a bottom. He says that Reese's cock is so perfect that he'd love for Reese to be his first. Reese agrees and it's on. They try it in several positions as Tully seems to be having a hard time taking such a huge cock for the first time. Reese bends Tully over the bed and takes his ass. He's in and he's shoving it deeper with each thrust. They switch positions again with Tully doggy style on the bed and Reese puts it in once more as Tully's face shows his pain. Reese doesn't give up (in the spirit of King Cole) as he takes Tully's ass at every move. Finally he traps Tully beneath him so he can't move and rails his ass long and fucking hard. Reese fucks Tully all over the bed, never letting him get away and Tully has found his match when he comes to being aggressive. Tully Eats Reese's Load For A Juicy Ending ... This scene will wear you out just watching it, imagine how these two felt after it was over. After he's conquered Tully's ass, Reese gives his cock back to Tully's mouth and this is where Tully seems to like being most. Tully assumes the less aggressive role here as Reese suddenly becomes very aggressive -- shoving his cock down Tully's throat to the point of taking his breath. Tully doesn't miss a beat though as he proves his worth as a dedicated cock-sucker. You can tell he's longing for the prize that Reese is sure to give him. Tully sticks his finger in Reese's ass and goes for the gooey gold. Reese is yelling and cussing as he nears climax and yells, 'I'm about to cumÕ Tully gets even more excited as the hot load explodes in his mouth and he licks it all up, not leaving a drop anywhere on Reese.",
  "models": [
    {
      "name": "Reese",
      "person_id": 35134
    },
    {
      "name": "Tully",
      "person_id": 35240
    }
  ],
  "release_date": "2008-01-01",
  "scene_id": 70393,
  "series": "The Surge",
  "tags": [
    "Gay"
  ],
  "title": "Reese & Tully"
}