{
  "collections": [
    "Active Duty"
  ],
  "description": "Mr. Woods And Trey Go Bottoms Up For Kasey And Hops ... Levi gets called in to work at the sub base but Kasey and Hops are ready to do the deed. Trey and Mr. Woods are about to get fucked and it's a first for Mr. Woods. Mr. Woods has done many videos before, but he's always been the top. Today he's gonna learn what it means to be at the other end of the spectrum. The first words you hear as the camera comes on is Mr. Woods saying slow man as he flashes a big grin for the camera. I gotta tell you, this sweet cowboy is one hell of a guy. I've gotten to know him pretty well and he's the biggest sweetheart anyone could ever ask for. Today he's giving something of himself for my camera that I'll always be thankful for. This ex-Navy boy is all man, but he's about to experience something different. Kasey does the honors first to break him in and Mr. Woods is feeling the pain. You can see it in his face, but he aint complaining. Kasey gets in and he's giving it to him good in no time flat. Mr. Woods has manned up and he's taking it like a charm. Meanwhile Hops saddles up to take Trey's ass for a ride. Hops stands on the footboard of the bed and straddles Trey's ass to give it to him good. Hops is in and slamming it to Trey hard before he knows what hit him. Mr. Woods is gruntin' and hollerin' as Kasey fucks him harder and harder. Trey is taking it like a pro as always as Hops delivers his huge cock deep in Trey's hole. Hops puts him on his back and pounds his brains out. Kasey is giving it to Mr. Woods deep and hard as Mr. Woods is on his back. Mr. Woods is getting a taste of his own medicine today. Things switch up and Kasey takes the reins on Trey as Hops moves in for the kill on Mr. Woods. Hops gives it to him long and strong. Hops puts Mr.Woods on his hands and knees so he can give it to him even better. Mr. Woods screams for mercy, but Hops isn't letting up. He's gonna fuck it good. Kasey shoots his load first all over Trey. Hops follows his lead with his own cumshot and Trey goes next as Mr. Woods brings up the rear and this scene is a wrap.?",
  "models": [
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Hops",
      "person_id": 35087
    },
    {
      "name": "Trey",
      "person_id": 35161
    },
    {
      "name": "Matt Woods",
      "person_id": 35242
    }
  ],
  "release_date": "2008-03-17",
  "scene_id": 70396,
  "series": "Hops, Kasey, Matt & Trey",
  "tags": [
    "Gay"
  ],
  "title": "Hops, Kasey, Matt & Trey, Scene #01"
}