{
  "collections": [
    "Active Duty"
  ],
  "description": "Thomas, Chaz And Randy Get Rowdy...<br />DJ tries his hand behind the camera and I was really impressed with what a great job he did of keeping these guys in line and focused. He kicks things off like I normally do and shoots the shit with the guys for a bit before getting down to business. Randy makes strides on this beach trip and really takes to bottoming like never before. This scene is proof. The boys kick things off with a little kissing and it doesn't take long before everyone is butt ass naked. Chaz quickly moves in and starts sucking and playing with Randy's cock as Randy sucks on Thomas' huge hard meat. I think Randy is surprised to see a cock as big as his. He's trying hard to master the monster while Chaz masters his monster. <br />Thomas and Chaz stand up and share Randy's hot little mouth, gagging him with their cocks as Randy tries his best to keep them both at attention. Chaz moves back down and sucks on Randy while Randy concentrates on Thomas. They take turns sucking Randy's cock and using his mouth as Chaz fucks his face next and Thomas sucks his cock. Watching Chaz fuck Randy's face is really hot. Chaz is an seasoned vet and he's gonna make sure his cocksucker does his job. Randy gags again and Chaz seems to get a charge out of it. They continue to take turns using Randy's throat for their pleasure and Thomas keeps sneaking back down to play with Randy's huge cock.<br />Chaz Says It's Time To Fuck And Randy Is The Focus...<br />Chaz tells Thomas he's gonna roll Randy over and fuck him and he does. He shoves his hammerhead cock deep in Randy's ass as Randy grunts and moans in initial pain. Chaz shows no mercy and he's determined Randy's gonna be walking funny tomorrow. Chaz works it in and he's all the way to the pubes in no time at all. Randy is putting up a slight fight but he's manning up. Thomas feeds him his cock while Chaz bangs his ass. The looks on Randy's face are priceless. Seeing him with a fat cock in his mouth and one in his ass is a precious sight. Thomas is talking dirty to him as Chaz fucks him hard.<br />The Hot Sandwich Fuck...<br />These three end up in a hot sandwich fuck with Thomas fucking Randy while Randy fucks Chaz. The noise is intense as Randy screams and moans, Chaz moans and screams and Thomas talks dirty to them both. There's no doubt there was some pain mixed in with all this pleasure tonight as DJ captures it all. This is some of the most intense fucking I've ever seen. You could hear it all the way out on the beach. We had a walkway that led to the beach that went right beside this room and you could hear the screaming and yelping clearly as you walked by.<br />Everyone Blows Their Load on Chaz...<br />Chaz is the cum dumpster again tonight and Randy and Thomas blow their hot loads all over him before he lands his own hot load on himself. The three go for a nice kiss and DJ closes out the scene. Bravo.Ó",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Randy",
      "person_id": 35130
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2009-06-04",
  "scene_id": 70398,
  "series": "Summer Recruits 2",
  "tags": [
    "Gay"
  ],
  "title": "Chaz, Randy & Thomas"
}