{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden, Levi And Christian Bring Along Our New Recruit, Spencer ... Things kick off with me and Kaden shootin' the shit and joking back and forth. He's all smiles. Levi is sitting on the couch as we start talking about him getting out of the Navy. He says he's decided to do something different. He says he's going on vacation and is gonna let his hair grow for awhile, but he's here to do something different tonight. Christian is all smiles as he listens in on the conversation and our new guy Spencer is sitting at my desk manning the porno. Spencer moves over and joins the crowd. This guy is super fucking hot. The prettiest blue eyes. OMG. We joke with Christian about his penis weighing as much as him and Christian says They're not lying. LOL. Once we've shot the shit, the action gets going and our newbie is more ready than we'd imagined. I tell Christian to reach over and see what Spencer is working with and he grabs a hand full of rock hard cock. Spencer came to do business, he's serious and the action is about to get heated. Spencer Is The First One Hard And Butt-Ass Naked ... And he means business. Gosh how great it is to be 20. This cat is horny and he aint shy about it. Christian came to play, too and he gets right down to the business of unleashing what Spencer has to play with. Spencer peels off his shirt to reveal one sexy set of abs as Christian continues to explore the package. We've got ourselves a LIVE one here, ya'll. This guys body is a wonderland and Christian is enjoying the exploration. Kaden squeezes his own hard cock as he watches the two. In no time flat, Spencer is butt-ass naked and Christian is rushing along the process. Kaden asks Spencer if he likes it and Spencer responds by reaching over and grabbing Kaden's hard cock through his cargo shorts. Watch out, ya'll. It's about to get hot up in here. Spencer unzips Kaden's shorts to reveal the goods and a hard cock emerges from out of nowhere. Spencer latches on while Christian strokes his cock and Spencer is now part of the crew. Spencer has found himself a set of playmates and if judging by his cock tells us anything, he's thrilled with his find. Kaden reaches over and strokes Spencer's cock to give Christian time to undress. Levi follows Christian's lead and strips as well. Four hot, beautiful naked men on one ugly ass couch makes a perfect picture. Levi latches on to Kaden's cock while Kaden keeps stroking Spencer and Spencer strokes Christian. Levi Is The First To Taste The Cock And The Rest Follow ... Levi skips the bullshit and goes right to sucking Kaden's beautiful cock. Christian follows in Levi's footsteps and hunkers down on Spencer's hard prick. Two beautiful men sucking two perfect cocks. Spencer reaches around to grab Christians big cock and strokes it while Christian sucks him. Kaden wants a piece of the newbie that he's been watching so he tells Christian to let him at it. Christian reluctantly gives up the reins and Kaden moves in on Spencer's nice dick to give it a whirl. Christian moves down and gets on Kaden's dick and Levi searches for a place for himself. Can you say hello? Levi quickly finds a willing mouth in our hot newbie as Spencer doesn't hesitate to take Levi's cock in his mouth. Christian goes wild on Kaden's cock and Spencer finds his way as he gets used to the new environment. Kaden's cock is at attention and Christian is saluting it. Kaden is giving the newbie what he came for as he pounds the cock deep in his throat. Our newbie is holding his own as he gets better and better at cocksucking. This is quickly becoming a daisy chain of cocksuckers on command. Kaden gets down to some serious business on Spencer's cock as Levi and Christian do the same. Christian takes notice of Kaden's hot ass as it bounces to and fro in the breeze. He's got his eye on the target. Kaden is having himself a ball with the newbies hard cock as he makes love to the rod. Kaden's ass is looking as delicious as ever as Levi rubs it now. Christian Eats Kaden's Beautiful Ass While The Action Continues ... Levi tells Christian to eat Kaden's nice ass while Kaden keeps sucking Spencer's cock. Levi moves up to give the newbie a cock to suck as Christian tears into Kaden's pink hole with is tongue as he strokes Kaden's cock. Our newbie is learning from the veterans as he gets better and better at manhandling a cock. He's giving Levi as good as Kaden is giving him. Christian moves up and slides the hotdog in and out of Kaden's hot ass buns, teasing Kaden's hole. Things switch up a little and Spencer gets on his knees in front of Kaden's face as Levi takes hold of Kaden's cock. Christian gets behind Levi and starts getting him prepped for what's coming next. He lubes up Levi's ass and starts to finger it. Pay close attention here, troops as the first thing to ever enter Levi's ass begins to make its insertion. Christian gets the middle finger knuckle deep and it's about to be on -- like what? A pot of fuckin' neckbones! Christian moves out of the way and Kaden and Levi talk a little. Levi says, be gentle? and Kaden says, you know I will. Meanwhile Spencer wants to know if Christian does anything besides suck dick. Christian tells the newbie that he can fuck him if he wants as Christian smiles at him. Let The Fucking Begin ... Both Kaden and Spencer saddle up for the ride with Levi and Christian's asses in the air, at attention and ready for service. Kaden moves in on Levi's virgin ass and what a pure picture of heaven. Brace yourself here, troops. This is one for the Active Duty history books. If Levi hasn't learned anything else during his time here at Active Duty, he's learned how to arch his back. And arch he does as he gives his virginity to Kaden who slowly works his way into the virgin territory. Spencer slowly works his way into Christians tight ass and once the seal is broken, it's free trade. Kaden works things a little slower and gentler with Levi as he shows his buddy some mercy, but it wont be long before he's robbing him of his virginity good and deep. Meanwhile our newbie works it nice and slow like anyone would want him to at first. But this guy is a jackrabbit at heart and it won't be long before he's pounding. Levi has sweat all over his back as Kaden finally goes balls deep. His back is arched like a pro and he's steadfast along for the ride. Spencer is pounding faster and faster as his facial expressions show is delight at his newfound pleasure. Levi is hollering for his higher power, but staying the course all the same. The pounding has begun and it won't be long before the coming. Christian reaches over and rubs Levi's back to ease and comfort him. Levi's ass is glistening with sweat and what a hot site to see. Christian strokes his hard cock hard and fast as Spencer pounds his ass. Let The Cum Fly Where It May ... The fucking goes on for quite some time, but good things only last so long before the nuts draw up and the load comes. Kaden pounds Levi until he's about to nut and Spencer's gonna cum, too. Kaden pulls out and strokes his hot jizz all over Levi's ass. Kaden spreads Levi's asshole open and shows us the damage. Spencer moves up and delivers his load to Christian's mouth as Christian laps up the goo. Christian is next in line as he blows his hot load all over himself. Kaden goes down on Levi to help get his cum flowing. Kaden looks up at Levi and says I wanna taste your cum. Levi gives him what he asks for as he delivers a hot load into Kaden's mouth as Kaden sucks his dick. Kaden spits the results out into a towel as we watch. We do our usual end-outs as we talk about the night and the camera fades to black. Thanks for playin'!?",
  "models": [
    {
      "name": "Spencer",
      "person_id": 35021
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Christian",
      "person_id": 35060
    },
    {
      "name": "Levi",
      "person_id": 35112
    }
  ],
  "release_date": "2008-03-17",
  "scene_id": 70397,
  "series": "Christian, Kaden, Levi & Spencer",
  "tags": [
    "Gay"
  ],
  "title": "Christian, Kaden, Levi & Spencer, Scene #01"
}