{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden & Drake ... In this scene, Kaden takes Drake to the next level. After planting the seed in Drake's mind about a week earlier, Kaden waited patiently for this sexy little devil to give it some thought. Drake had previously told Kaden that he'd never done anything with another guy so he's have to give it serious thought. Luckily, after thinking it over, Drake decided what the hell. He called Kaden back and the deal was sealed. Now comes the fun part. Kaden gets Drake over to his place to do the deed and things kick off with Kaden behind the camera chatting Drake up. At a few points during this you get the feeling that Drake is just ready to get the party started, but Kaden chats him up a bit first and gives him a few lines of both bullshit and encouragement. Finally, Kaden sits down next to Drake on the couch conveniently wearing nothing but a pair of shorts. It feels like a hookup that's about to get steamy. The awkwardness of the first few minutes is really fun to watch as Kaden rubs his chest and glances over at Drake a few times who is sitting forward on the couch looking at the porn with a big shit-eating grin on his face. You can feel the nervous anticipation coming through the screen as these two get comfortable. Finally Kaden touches Drake on the shoulder and tells him to relax and take his shirt off. Drake takes the cue and sits back and relaxes a little more as he grins at the camera. Kaden's cock is already hard at the thought of corrupting this first timer and things are about to get interesting. Kaden suggests that Drake get even more comfortable by taking his pants off and looks around with a smile and says, no one is watching. Not yet, at least. Drake laughs and strips his pants off while Kaden watches and plays with his hard cock through his shorts. Kaden breaks the ice by placing his hand on Drake's thigh and telling him, you have nice legs, Drake smiles and says thanks. You can tell Kaden is ready to pounce of this precious cutie, but he's taking his time -- at least for now. All of a sudden you hear someone open a door somewhere in the house and Kaden looks around. It's an awkward moment, but they both keep stroking their cocks. Kaden convinces Drake to take off his boxers and he's sporting a nice hard on already. Kaden wastes no time reaching over and taking matters into his own hand as he begins to stroke the nice, uncut cock. Drake takes Kaden by the forearm and shows him how he likes it stroked. What he's really trying to do is pull Kaden down on his cock to suck it and Kaden gets the clue as he goes down and starts sucking Drakes nice, hard cock. Drake takes time to feel Kaden's body and reaches around and plays with Kaden's hard cock. Kaden asks how it feels and Drake says pretty good, I think I might like this. From there, Kaden knows that Drake is all his and he starts exploring further as he kisses Drakes chest, removes his shorts and gives Drake complete access to his own hard cock. Drake takes full advantage of the opportunity and before you can say it, he's already sucking Kaden's cock. This is so fucking hot to watch as we feel like a fly on the wall to what could just be a private encounter between two horny studs that hooked up online. But lucky for us, the camera is running and catching all the hot action. Kaden gets a little more creative with the camera this time around and gives us some really good angles. By the looks on Drake's face, you can tell this is probably one of the best, if not the best, blowjob he's ever gotten. His cock is rock hard and he's rubbing all over Kaden's body. Kaden gives Drake another turn at his cock and Drake jumps right in. And we are only half way through the scene so far, troops. These two get along like two peas in a pod and it just keeps getting hotter. At one point Kaden positions the camera in front of Drake down below his cock and balls and the view is to do for. That huge uncut monster is angry as hell as we watch Kaden work it. Drake throws his head back and enjoys the ride and the view as he watches the action in the camera's viewfinder. Kaden goes crazy on that cock and is enjoying the hell out of himself, too.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Drake",
      "person_id": 35225
    }
  ],
  "release_date": "2011-07-04",
  "scene_id": 70403,
  "series": "Kaden's Recruits 4",
  "tags": [
    "Gay"
  ],
  "title": "Drake & Kaden"
}