{
  "collections": [
    "Active Duty"
  ],
  "description": "Heath & Shay ... <br />Heath had also been calling looking for another adventure since his first foray into the dark side with Hurley. He's been working out quite a bit and he's looking very good. All the hard work is paying off six-fold in his abs area and that cock looks much bigger than I remember. It's huge. And what better way to break in a newbie than with a huge cock his first time out? Shay doesn't know exactly what he's in for, but he'll soon find out when the pants come off to reveal that meaty cock that Heath is blessed with.<br /><br />The usual chit-chat kicks things off as I admire their beautiful eyes, one with brown and one with blue and both as pretty as can be. These two are a nice contrast to one another and a perfect pairing. Heath and I work on loosening Shay up by letting him know that Heath has been here, done this before and he's a pretty good person to walk Shay through the whole thing.<br /><br />As soon as I leave the room Heath starts chatting Shay up as he plays with his cock and gives Shay the once over. He instructs Shay to do the same as the two of them enjoy the adult entertainment I have playing for them. Heath sneaks a few peeks at Shay's crotch as they work their cocks. You can feel the nervousness coming off of Shay but he doesn't let that stop him from moving forward, following Heath's lead. They talk about the bitches on the screen and talk about some of their sexual liaisons. Heath wants all the details as he asks Shay his age, height and weight. All the while Shay has started sneaking his own peeks at Heath's cock as it grows bigger and bigger.<br /><br />Heath comes out of nowhere and goes down on Shay's cock, sucking him as a courtesy to his newcomer. Both cocks are nice and hard by now and Shay is taking notes on Heath's cocksucking skills. Heath asks Shay if that's good enough for him and Shay responds by getting harder and harder. Heath strokes his own cock while he works Shay's dick with his mouth, showing off for the camera all the while. Heath is quite a ham.<br /><br />Shay's shirt comes off as Heath continues stroking him and looking him up and down. You can tell that rascal Heath loves what he's doing. I imagine what must be going through both of their minds as Heath peels Shay's pants off of him followed by his boxers. Heath goes back down for more of Shay's cock, working him right along. Heath reaches up and takes Shay's hands, putting them on the back of his head to guide him and make him feel more in control. It's a really sweet gesture that doesn't last long as Shay decides to go down on Heath.<br /><br />You'd never guess we had a newbie on our hands, but I think it's more of a quick learner as Shay takes what he learned from Heath and puts it to good use on Heath's hard dick. Heath guides his head up and down on his cock as Shay becomes more comfortable. This is why I love military guys. They're always willing to try something new and give it their all. Heath comes out of his jeans, revealing the entire huge cock he's sporting and giving Shay an easier in as he rubs Shay's body. Heath decides to stand up next to the bed so Heath can take more of his cock down his throat as Heath fucks his throat, holding his head all the while. Shay seems to have found a new favorite toy as he enjoys the big cock in his mouth, taking it out every so often to admire the size of that big meat.<br /><br />And just when he's not expecting it, Heath instructs our newbie to turn around and arch his back. Shay complies with the order and Heath saddles up to take things to the next level as he moves in to fuck Shay's virgin ass. He slowly works it in, opening Shay's hole up nicely as he buries his cock balls-deep in his hot, furry hole. It isn't long before he's pounding hard and deep into Shay's ass. I love the way Heath fucks. He comes all the way out and plunges all the way back in over and over again. That really opens up the virgin ass.<br /><br />He puts Shay on his back so he can stroke his cock while he pounds his ass and Shay gets in a rhythm. He's stroking as Heath is pumping and Heath tells him how nice and tight his asshole is. All the while Shay is stroking and he can't hold back. He shoots a huge load all over himself as Heath pounds his hole. Heath quickly follows him with his own big load mixed in with his as he strokes that long, hard cock, squeezing out every last drop of juice onto Shay's stomach. Enjoy!<br />",
  "models": [
    {
      "name": "Heath",
      "person_id": 35246
    },
    {
      "name": "Shay",
      "person_id": 35145
    }
  ],
  "release_date": "2011-09-16",
  "scene_id": 70418,
  "series": "Double Time 11",
  "tags": [
    "Gay"
  ],
  "title": "Heath & Shay"
}