{
  "collections": [
    "Active Duty"
  ],
  "description": "Thomas has returned to the Active Duty fold after a long absence. About a year ago he was diagnosed with 'Athletic Heart Syndrome' from all the intense sports he's played over the years and the strenuous workouts he's endured. Even without stepping foot in a gym for that entire time, he's still looking delicious if just a little on the beefy side. His doctor has cleared him for a new fitness and workout routine and he's back in the gym now, 'getting that body back, baby' as he told me on his recent visit. Personally, I'll take Thomas any way I can get him because he's such a stud any way you cut it.I'm not sure if he did a lot of thinking during that downtime or some fantasizing and experimenting, but something gave him an itch to give bottoming another try and this time it was an epic event. Many of you will remember his first time on bottom in Fire in the Hole 2 where Elijah did the honors and took his man cherry. Well, Thomas vowed then that he'd never do it again, but things have a funny way of changing and today we're going to see just how hungry five years worth of waiting can make someone.This scene also marks another first for our stud, Bric. He mans up and takes the next challenge, fucking Thomas like there's no tomorrow. That big, beautiful uncut cock is just what the doctor ordered for Thomas' hunger and Bric takes the task on with serious fervor. Thomas ends up liking that cock so much that he starts pounding back on it at one point, fucking it himself as Bric meets him in the middle. I think you'll be amazed at how into the moment Thomas was and just how damn horny this made him.Things kick off with me talking to the guys before the deed and Thomas and I discuss some of our recent text messages back and forth discussing what's about to go down. From there, Thomas asks Bric to help him out and get him in the mood. Bric doesn't waste any time getting right down to business as he works on Thomas' cock and gets it raring to go. Thomas is up to his old tricks of talking dirty to his cocksucker and Bric doesn't seemed phased at all by it. In fact, he's multi-tasking as he pulls his own cock out and strokes it while he sucks Thomas. His uncut jewel is hard right from the start as Thomas rubs his ass and watches him service his cock. Bric is a quick learner and he's handing Thomas' huge meat like a pro, working his lips tightly around it and giving it just the right amount of everything.Bric comes out of his jeans and positions himself between Thomas' legs to give him better access to that huge cock. He works it with his mouth and hand in perfect unison, proving that he's quickly learning the ropes. They switch things up and Bric straddles Thomas' chest and puts his cock in his mouth, getting a little return on the favor he just payed to Thomas. Thomas is stroking himself while he licks and sucks on the foreskin of Bric's dick. Bric reaches back and grabs Thomas' big dick, stroking it for him.Bric lays back on the bed and Thomas gets in a better position to take that cock deeper down his throat and Bric is loving it. Thomas seems to be living it to as he has fun with the uncut beauty and strokes himself all the while. Something tells me it won't be long before Thomas wants that pretty cock somewhere else besides his mouth. Just sucking on it has Thomas' cock so fucking hard it looks like the head might explode and pop off.Bric offers Thomas one last chance at his hot mouth as they form a sixty-nine before the real reason we're all here happens. In the heat of the sixty-nine, Thomas tells Bric he thinks it's about time for him to fuck his ass and Bric agrees. Thomas lays on his back, slightly on his side and raises his leg to let Bric in. Bric works his cock into Thomas as Thomas jerks himself while getting pounded. Bric takes over and strokes Thomas' cock for him as he fucks his ass good and hard. Thomas starts getting really into it and talking dirty to Bric telling him to fuck him hard while he jerks his big dick.Things switch up and Thomas decides to sit on Bric's big dick and take control of the ride as he continues jerking himself. He sits all the way down on it, leaving nothing but the balls. After a little bit of riding, they switch positions again and this time Thomas is on the edge of the bed with his legs thrown high as Bric moves in and shoves his cock deep into him once again.Thomas looks down at the cock going in and out of his ass and jerks his cock harder. Bric is slamming into him harder and faster as we hear skin slapping skin and Thomas just can't hold back anymore. He blows a huge fat load all over himself as Bric keeps pounding away. The hard breathing is enough to send me over the edge as Thomas explodes. Bric isn't far behind as he pulls out and lands his load right in there with Thomas'. Thomas rubs the love juice in and it's a wrap. You'll be able to smell the hot mansex in the room just watching it on the screen. The two of them hop in the shower for a little washing up and that's a wrap!",
  "models": [
    {
      "name": "Bric",
      "person_id": 35047
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2011-08-22",
  "scene_id": 70414,
  "tags": [
    "Gay"
  ],
  "title": "Bric & Thomas"
}