{
  "collections": [
    "Active Duty"
  ],
  "description": "I thought our next stop after this shoot between Zander and Blake was going to be the courthouse to get their marriage certificate. That's what getting a big dick up your ass the first time on bottom will do to you. That's right, Zander bottoms for the first time in this scene and for Blake's big cock no less. The sparks fly and Zander finds something new that I think he really likes. It's been a bit since we've seen Zander and he's looking just as hot as ever. He called me up and said, 'I really wanna keep working. You've shown me a new side of myself that I really like' And that's exactly what I like to hear.Things kick off with sexy ass Zander laying on the bed as I zoom in and chit-chat with him for a minute. He notices the Trojan Magnum Extra Large condoms and says he knows they aren't for him. Funny how they showed up the very day he's going to bottom for the first time eh? We get a few laughs out of that and things get going pretty damn fast. These two are locked in a passionate kiss the next thing you know and Blake is working Zander's belt and buttons loose. Zander comes up on his knees and lifts his shirt for Blake to kiss and worship his abs. Zander's shirt comes off and he lays down on top of Blake and does some of his own exploring. The kissing remains intense and they throw each other around a bit and Blake ends up back on top of Zander, working his way down to his cock, but Blake likes the foreplay and he teases Zander some more before reaching down into his shorts and grabbing his hard cock. He pulls his shorts down and starts licking Zander's ass cheeks and back, slowly working his shorts further down and his tongue into the furry crack of Zander's ass.He puts Zander on his knees and starts licking his hole deep. You can hear Zander breathing hard as he reaches back and pulls Blake's head deeper into his ass. He's in heaven and you can sure tell by his reaction. Another kiss follows and you wonder if Zander thinks his ass tastes as good as Blake did. The tables turn a bit and Zander is in control as he forces Blake's shorts off and starts playing with his huge, hard cock. He finds the right spot on Blake and it's driving Blake insane. All the while he's working that big cock in his hand as he slowly starts licking Blake's balls, moving up to his cock, then moving on up for another kiss while he wiggles out of his own shorts.Zander slides up and sits on Blake's chest as he reaches back and jerks Blake's cock and Blake takes Zanders cock in his mouth and gets it standing at full attention as he takes it deep in his throat. Zander starts face-fucking Blake for a bit before moving back to Blake's cock and licking and worshipping it. You can tell Zander likes this big cock he's found to play with. And you know what I've always said, 'everybody loves a big dick' I don't care who you are and Zander is no exception to that rule. He really gets into to sucking that big meat and working it over.Soon they find themselves in a sixty-nine for some dual action. In a sixty-nine these two find the right amount of everything. They turn loose on each other like two wild animals. Zander starts fingering and licking Blake's perfect pink hole as he takes his cock down his throat. Blake takes Zander's cock down his throat all the way to the balls while Zander tongue fucks his hole.Blake decides that two holes getting eaten at the same time sounds like a good idea so he throws Zander's legs back and starts fingering and licking his hole too. Zander then decides he wants to suck on Blake's cock some more but he doesn't take away the access that Blake has to his hole as Blake keeps finger it and playing with Zander's hard cock.Zander saddles up to ride the pony and crawls on top of Blake's cock and slowly starts shoving it up his tight, virgin ass. He works it in and Blake starts pounding and troops you're gonna have to watch the rest on your own. I'm about to faint.",
  "models": [
    {
      "name": "Blake",
      "person_id": 35040
    },
    {
      "name": "Zander",
      "person_id": 35166
    }
  ],
  "release_date": "2011-09-16",
  "scene_id": 70419,
  "tags": [
    "Gay"
  ],
  "title": "Blake & Zander"
}