{
  "collections": [
    "Active Duty"
  ],
  "description": "Nick Gunner Meets Fox ... Things kick off with me talking to the guys and telling Fox how I'm about to live through him as he seduces Nick. Therefore, he can be just as dirty as he can be without having to own up to it since it's all gonna be me living through him. Fox is OK with that scenario. I'd shown Nick some photos from some of Fox's videos and he was ready to see what Fox could put on him. 'O' Yes! ... Nick comes out of his pants and you can see his nice hard cock through his boxer briefs as he and Fox watch some hot porn. Once Nick pulls out that huge cock, you'll be drooling right away if you're anything like me. He throws some glances over at Fox's cock and a few longer stares. Once he stands up and takes off his boxers Fox takes notice of the package he's sporting and reaches over and takes hold of the prize. In no time flat he's going down on Nick's cock and stroking it. Down on his knees, Fox starts deep throating Nick's rock-hard cock and Nick is certainly enjoying the treatment as he throws his head back and gives his 'O' face. The rest of his clothes come off and Fox keeps servicing his cock. Starring: Nick's Ass ... Fox bends Nick over the back of the couch and spreads his cheeks out to reveal that sweet, pink hole just before he dives in to tongue is good. Nick's hard cock is pushed back between his legs, giving Fox access to both of his best parts as Fox goes back and forth between the two trying to decide which tastes the best. Nick doesn't care which one he chooses because they both feel so damn good. By the look on Nick's face you can tell he's really getting into this kind of personal attention and Fox is getting into giving it. The faces Nick is giving to the camera tells the story along with his deep, heavy breathing. I think Fox has found a happy medium that Nick is really digging. Fox gives Nick's ass plenty of attention before he has him turn back around so he can focus more on that big, delicious cock. Nick has his ass positioned on the pillow so that Fox still has access to that precious hole and Fox starts fingering the pink pucker as he sucks Nick's cock. Nick is in heaven and Fox is having more fun than a barrel of horny monkeys as he has his way with this hot little newbie. It Must Be Love ... Fox lubes up his finger and shoves it up Nick's tight little ass and tickles his prostate while Nick jacks his cock between Fox deep throating it for him. Fox can't resist to taste the ass a few more times while he keeps fingering it. Once he gets his finger in deep, Nick starts stroking his cock hard and fast as Fox licks and sucks his balls. It doesn't take long before he's blowing a huge load and Fox is lappin' it up. Nick has discovered something new today and Fox did a great job helping.But wait! There's more!Fox still has to get his and Nick is willing to help -- with limitations. Fox wants to look at Nick's ass and jack off to it and Nick is willing to put on a teasing ass show in order to help Fox out. And what an ass show it is. OMG. I lost it watching this hot little dude tease Fox with that beautiful little ass. It must have been good for Fox too because he ended up getting off TWICE just looking at that ass.",
  "models": [
    {
      "name": "Fox",
      "person_id": 35083
    },
    {
      "name": "Nick",
      "person_id": 35229
    }
  ],
  "release_date": "2010-01-25",
  "scene_id": 70410,
  "series": "Firewatch 3",
  "tags": [
    "Gay"
  ],
  "title": "Fox & Nick"
}