{
  "collections": [
    "Active Duty"
  ],
  "description": "Things kick off with us all shooting the shit as I focus the camera on Nick Gunner and tell the other guys about how Nick is an 'erotic artist'. What I was referring to was how well Nick Gunner can grind that ass for the camera. Trev is a Justin Beiber lookalike and Joel is your regular guy next door who's packing a dick that if you knew he had it, you'd be over there trying to suck it.<br /><br />Nick Gunner confesses to being a 'chronic masturbator' and seems quite proud of his condition. The other two confess to sharing the same condition so it would only make sense to have them all do it together. You can tell just how enamored with Nick Gunner as I seem to focus a lot of mine and the camera's attention on him. Can you blame me? This guy is so fucking smoking he could set a room ablaze just by getting naked and smiling.<br /><br />He's a playful little devil and he loves being the center of attention, too. So when I ask him to show off his ass for us he doesn't hesitate to steal the show. I get him to remove his shorts 'slowly and erotically' as he reveals a pair of tight black boxer briefs that are hugging his ass just like we all wish we could. The other guys start singing stripper songs and I tell them they don't have to wait any longer to pull their cocks out, I know this is making them hard.<br /><br />I kinda play antagonist during this scene as I play up Nick Gunner to the other guys. Joel squeezes his hard cock and says, 'looks like we're about to get this meeting started.' Such a joker, but the joke is on me cause this guy is packing one awesome dick. Trev isn't left behind in the big dick department either. What we have here is three horse hung guys about to get down and dirty.",
  "models": [
    {
      "name": "Joel",
      "person_id": 35245
    },
    {
      "name": "Nick Gunner",
      "person_id": 35123
    },
    {
      "name": "Trev",
      "person_id": 35159
    }
  ],
  "release_date": "2014-01-25",
  "scene_id": 70416,
  "series": "Ready Reserves 2",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Joel, Nick & Trev"
}