{
  "collections": [
    "Active Duty"
  ],
  "description": "Things kick off with Carson in the shower shaving his face where introduce him to some 'help'. Dustin joins Carson and starts shaving his face for him as their cocks touch and the water glistens on their beautiful bodies. It isn't long before they are embraced in a nice, wet kiss and playing with each others cocks. The kissing is intense as these two troopers get right down to business.<br /><br />Dustin pushes Carson against the shower wall as they tongue each other and strokes one another's cocks. Dustin's cock is raging hard as he goes down and starts working on Carson's cock as Carson throws his head back and enjoys the ride. He doesn't shy away in the least when it comes his turn to suck Dustin's dick in return but he gives a little nipple nibbling and chewing before making his way down the treasure trail and taking Dustin's cock in his mouth. This is when all hell breaks loose as third trooper joins the fold.<br /><br />Austin has been away for awhile and he's really hungry for some action. He joins Carson and Dustin in the shower for some Intense play. His cock is hard in no time at all and Dustin is more than happy to give it some attention for him as he sucks Austin's cock while Carson keeps the pace on his. Austin has obviously missed playing with his AD buddies and it isn't love before he's sitting on the shower floor behind Dustin, eating his sweet little asshole, licking and tonguing it hungrily as Carson sits opposite of him and continues sucking Dustin's dick, giving Dustin the best of both worlds front and back.<br /><br />Dustin is such a little guy that he's able to climb up on Carson's strong shoulders and give the tall Austin direct access to the goods while Carson sucks on Austin's cock, Austin sucks on Dustin. This is a hot position to watch as we see the power come into play here. Austin grabs Dustin's small body and holds it against his as Carson eats Dustin's ass and sucks Austin's cock in unison. He teases Dustin's hole with Austin's hard cock all the while as Austin and Dustin kiss like two lovers in heat.<br /><br />Carson is proving quickly that he plays well with others as he gets right in the mix with his two newfound playmates and gives it his all. When things move to the bedroom Austin and Dustin focus their full attention on Carson's cock and give him double the pleasure as they share his manhood. Dustin is stroking his hard cock all the while as he takes turns kissing Carson deeply, licking his chest and nipples and sucking his cock while Austin does the same. The look on Carson's face is priceless as he enjoys the intensity of the attention.<br /><br />Dustin decides there's room in there to get his cock sucked too so he moves up a little and puts his cock in Carson's mouth. Austin decides to follow his lead and the two of them takes turns sucking Carson's cock and letting Carson suck theirs. And Carson proves he can give as good as he gets and you won't believe the talent this guy has for a 'first timer.' The three of them have a lot of fun going back and forth sharing the oral love and the deep kisses as they get to know each other even more. Austin takes his attention away from Carson and focuses more on Dustin's cock while Dustin takes care of Carson.<br /><br />Dustin is sure to show off that gorgeous little ass of his every chance he gets and it won't be long before someone decides it needs some attention. Austin is the man for the job and he moves behind Dustin and starts licking and rimming his sweet little virgin hole (yes, this was actually Dustin's first time bottoming) and getting it nice and wet and ready for what's to come next. But before he fucks him, Austin gives Dustin's ass plenty of tongue action and then starts teasing it with his hard cock as he smacks it against the hole. He then gives Dustin an intense fingering, lubing and loosening him up before the fuck.<br /><br />Just watching Austin finger Dustin's pretty pink pucker and open it up really good is enough to send me over the edge. Dustin's body is covered in goose bumps and that's a good sign that he's really liking what's going on. Austin opens his hole up well as he puts the second finger deep inside his ass. All the while Dustin is worshipping Carson's cock as he strokes his own. Carson is excited about Dustin getting fucked and says how fun it's going to be to watch him get plowed for the first time. And before we know it, Austin is balls-deep in Dustin's ass, fucking him on his side while Dustin strokes himself and sucks Carson. Dustin decides to take control and positions himself reverse cowboy to take Austin's dick even deeper. Austin gives him a nice reach around as he shoves his cock balls deep inside him. Carson keeps his hungry mouth fed while Austin fills his hole full of hard cock as we watch this awesome threesome unfold. Carson decides to give Dustin some oral love as he sucks his cock while his ass is being pounded. Can you imagine how fucking intense this must be for Dustin as these two studs service him front and back? Carson is literally fucking his face while Austin fucks his ass.<br /><br />They switch the position up and Dustin goes doggy style while forming a hot sixty-nine with Carson who sucks his cock while Dustin sucks his and Austin continues to plow that hole from behind. There's some great shots and angles of all the action so you get to see that tight little hole squeeze tightly around Austin's cock as Carson works his dick, once again proving that he's up for any challenge and in any position. Carson clearly came to have fun and he's having a boatload of it with these two. Dustin raises Carson's legs in the air and starts licking and sucking his hole while Austin continues to fuck him deep. Dustin spreads Carson's nice pink hole open for us to see as he tongues it and massages it with his fingers. Meanwhile Austin's cock can't handle the tight hole any longer and he pulls out and blows a fat load all over Dustin's ass, hitting carson in the face as it drips down Dustin's hole. Austin spreads Dustin's cheeks open to show the damage and then the focus turns back to Carson who is about to get fucked for the first time. Dustin does the deed as Austin sucks Carson's cock, Dustin slowly starts shoving his cock deep in Carson's ass. The looks and moans coming from Carson are priceless once again as he experiences his first cock up his tight virgin hole. What happens in the end you'll have to go watch for yourself but it's a 'snowball' effect.",
  "models": [
    {
      "name": "Austin",
      "person_id": 35036
    },
    {
      "name": "Carson",
      "person_id": 35056
    },
    {
      "name": "Dustin",
      "person_id": 35016
    }
  ],
  "release_date": "2011-08-22",
  "scene_id": 70413,
  "series": "Direct Fire 2",
  "tags": [
    "Gay"
  ],
  "title": "Austin, Carson & Dustin"
}