{
  "collections": [
    "Active Duty"
  ],
  "description": "Jake is that guy you always love to see. He always looks so happy to be here. I guess he's found a good place to have that big cock of his worshipped and pleased like nowhere else. Talk about a guy who has come along way. With each scene we see Jake get more and more into what's going on and today's scene is no different. He's all smiles and that huge cock is hard as a rock. He can't wait to get it into Gage's mouth and Gage seems to share the feeling.<br /><br />Things kick off with these two naked and it isn't long at all before Jake's thick dick is at full attention and Gage is all over it. Jake throws that head back in his signature 'O' face and enjoys the servicing as he reaches around and starts playing with Gage's pretty smooth ass. You can tell Jake is ready to tear into that sweet little hole, but he's gonna enjoy the blowjob first. And what a hot blowjob it is to enjoy. Gage gives him the slow, seductive sucking that he's so good at and Jake just loves it.<br /><br />After he's sampled that big cock of Jake's, Gage comes up on his knees to give Jake access to his. Jake moves right in and goes to town. Gage lays back on the bed to enjoy the ride as Jake really gets into the it. You can see precum dripping down the shaft of Gage's cock as Jake works it. Jake seems to be getting used to sucking a nice cock and he's got his own technique down with a mixture of jerking and sucking that would drive anyone crazy. Those big, full lips wrapped around Gage's cock is feeling good and Gage is letting it be known.<br /><br />Gage reaches around and grabs Jake's cock and strokes it while Jake services his. These two are smoking hot together and you can feel the chemistry dripping off the walls in the room. These boys are horny for one another. It won't be long before Gage is shakin' that tight little ass at Jake, egging him on to come and fuck it.<br /><br />All is takes is for Gage to say the word and Jake is behind him slowly easing that huge dick of his into Gage's silky smooth ass. Gage has a little trouble in the beginning as his hole opens up to the monster, but once it's in, it's on. Jake is palming that pretty little ass and pounding it hard. We all know what a pounder Jake is once he's got his meat inside a nice warm hole and today he's proving his pounding skills as he bangs that ass of Gage's.<br /><br />They switch positions and Gage gets on top to ride the meat as Jake gives him a polite reach-around. Gage's hard cock is slapping down on Jake's balls as Jake pounds his ass deep and hard from below. Jake grabs Gage by the hips and leaves his hard cock bouncing in the wind as he plows Gage's ass harder. By the looks on Gage's face, I'd say he's loving the cock.<br /><br />They switch positions again and Jake throws Gage's legs behind his head and goes in for more, pounding him harder even still. Won't be long before Gage is blowing his load all over himself as Jake hits all the right spots. Jake follows his lead and lands his load right in with Gage's. It's a wrap!",
  "models": [
    {
      "name": "Gage",
      "person_id": 35084
    },
    {
      "name": "Jake II",
      "person_id": 35239
    }
  ],
  "release_date": "2014-01-25",
  "scene_id": 70415,
  "series": "Ready Reserves 2",
  "tags": [
    "Gay"
  ],
  "title": "Gage & Jake"
}