{
  "collections": [
    "Active Duty"
  ],
  "description": "Bric Bottoms for the First Time (For Kaden!) ... Things kick off with a little chit-chat with me and the guys and Kaden is looking just as delicious as ever. These two together are just beautiful. I quickly leave the two of them alone to get comfortable and sneak away to listen from the other room. Bric breaks the ice with a 'so what's up?' and from there these two get to know each other as well as we'd all like to get to know the two of them. They chat about the Navy and their experiences as we listen like flies on the wall.After they've broken the ice, Kaden sweet talks Bric out of his shirt as he admires his body and tells him how nice it is. Bric mentions how big Kaden's arms are and the comparisons and mutual admiration continues on until Kaden's shirt comes off as well and Bric gets to do some admiring of his own. Kaden puts his hands down his pants and Bric says 'Gettin' all hot and bothered?' Kaden just grins as he continues playing with his hard cock. He stands up and takes off his shorts and Bric follows his lead. They kick back side-by-side and play with their cocks as Bric takes a few sneak peeks at Kaden's cock. Kaden reaches over and starts rubbing Bric's body all over, getting some good feels before he starts kissing his chest and eventually pulling out Bric's big cock and taking it down his throat. All the while Bric is rubbing Kaden's body as he enjoys the warm feeling of his mouth on his cock. Kaden's hard cock is poking out of his boxers and Bric see's a chance to cop a feel. He slowly puts his hand down Kaden's boxers and that's a cue for Kaden to lean back and give him access.Bric goes down on Kaden's dick, taking it slowly in his mouth and making love to it as he sucks and strokes. Bric has come a long way and his oral skills get better each time. I don't think I've seen him get this excited about sucking a cock so far but he's on Kaden's cock and giving it his full attention as his own cock stays rock hard throughout.Kaden pushes the envelope a little and starts out kissing Bric's neck as he strokes his hard cock. He moves around exploring Bric's neck and body with his tongue and then sucks Bric's cock a little more before moving back up and finally planting that long awaited kiss on Bric's lips. Bric was a little shocked at first, but he gives in and they lock lips, tongues dancing, hormones raging out of control as they explore new territory. The swapping of cock sucking continues as Bric steps up the pace and gets more intense and Kaden's dick responds in kind as it rages harder and harder. The kisses continue as the heat between these two gets hotter and hotter.They move to the bedroom and this is where the real fun begins as they continue their lust-driven bromance. The kisses are melting the screen and Kaden asks Bric if he's ever had his ass eaten. Bric says no and Kaden turns him over on his stomach to give him a new sensation. You can hear the moans coming from Bric as Kaden's tongue explores his ass. Kaden jerks Bric's cock as he eats his ass, spreading his hole open for us to get a good look as he plunges his tongue deeper and deeper. Bric's cock is rock hard all the while and he even strokes himself to this new feeling. Kaden fingers Bric's ass for a bit to loosen him up as he strokes his own hard cock.And as we all sit on the edge of our seats waiting for that priceless moment, it happens out of nowhere as Kaden slowly starts penetrating Bric's virgin hole. Bric is breathing hard and fast as he adjusts to the feeling of having something up his ass and Kaden goes deeper, eventually burying his cock balls deep in virgin territory as Bric takes his dick like a man. They switch positions and Bric is on his back as Kaden works his cock into him again, this time going harder and deeper as Bric strokes his own hard cock. Bric's tight hole is a beautiful pink and watching Kaden's cock go in and out of the tight spot is enough to send us over the edge, but not yet. There's much more fucking to be done. Kaden keeps pounding and Bric keeps jerking and the looks on Bric's face are heaven. Kaden turns him over on his side and fucks him some more and Bric keeps jerking. Bric is taking a good fucking and loving every second of it. Just the fact that his cock stays so rock hard tells the story about how it feels.Kaden goes back down on Bric's cock as he strokes his own hard dick and they do something that rarely happens when you're shooting porn. As they stroke their cocks together, they both shoot their loads at almost the exact same time and all the jizz lands on Bric's abs as they squeeze out every drop. And that's just the frosting on the cake. Kaden rubs it all in as Bric watches and comments on how warm it is. They go for some more hot kissing and it's a wrap. Bric has officially gone from 'never to whenever'. Bric has coined his own term for such a moment and it's 'from no way to any day.' Thanks for playing!",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Bric",
      "person_id": 35047
    }
  ],
  "release_date": "2011-09-16",
  "scene_id": 70417,
  "series": "Double Time 11",
  "tags": [
    "Gay"
  ],
  "title": "Bric & Kaden"
}