{
  "collections": [
    "Active Duty"
  ],
  "description": "Things kick off with me giving Fox a hard time and then Fox and I giving Taylor a hard time. It's all in good fun though and the guys are certainly good sports. Fox says he's ready to be the 'Crash Test Dummy' for Taylor and he gets right down to business, undoing those jeans and hauling that massive piece of meat out that Taylor is packing. As soon as the pants are off, Fox is down on that cock like white on rice, sucking it and deep throating it like only Fox can do. There was a reason I chose Fox for this mission and once you see how deep he can take that big cock of Taylor's you'll know exactly why. Fox doesn't play when it comes to sucking a nice dick. Taylor just kicks back and enjoys the ride. You can tell by the look on his face that this is probably the best head he's ever had.<br /><br />I'm so jealous of Fox's deep-throating abilities. He can take that monster to the balls with only a little gagging, but the gagging makes it all that much hotter. I tell Taylor to grab Fox's head and fuck his face and as soon as he does you can hear Fox moaning. It's clear that Fox likes to be manhandled. Taylor gets aggressive and throat fucks Fox. It isn't long before he's totally forgotten there's a camera in the room as he really gets into what's going on. He's moaning and throwing his head back in between shoving Fox's head down on his cock. That big cock is responding well to this treatment too as it stands rock hard and at full attention.<br /><br />Fox starts getting off on what's going on and stroking his own hard cock as he sucks Taylor's. Taylor comes up on his knees to fuck Fox's face even harder as he slams his cock down his throat fast and hard. Two things are for sure and that is Fox is a very talented cocksucker and Taylor likes it.<br /><br />The real kicker comes when Taylor stands up and straddles Fox's face as he leans into the wall and fucks Fox's face faster, going deeper down his throat and feeding him that huge dick. This seals the deal for Taylor as he blows his huge load all over Fox's face and in his mouth. Fox takes the load in his mouth and loves it. Taylor watches as Fox strokes out his load, too. Taylor is all eyes and says watching him jerk out was really hot. ",
  "models": [
    {
      "name": "Fox",
      "person_id": 35083
    },
    {
      "name": "Taylor",
      "person_id": 35153
    }
  ],
  "release_date": "2011-09-24",
  "scene_id": 70424,
  "series": "Fox & Taylor",
  "tags": [
    "Gay"
  ],
  "title": "Fox & Taylor"
}