{
  "collections": [
    "Active Duty"
  ],
  "description": "We are really excited about the scene we're sharing with you in the Videos Of The Week section this week. Two things about it are really great. First of all, our beloved Thomas returns after a long break. Secondly, Dustin returns and this time he's ready to try something new and what a BIG step this is considering what he's up for trying and who he's trying it with. Thomas and his big cock take the reins on our little trooper and fucks him six ways to, well, Sunday! And here we are.<br /><br />Now, before you all think that I'm just some cruel-hearted, cold-blooded monster without a conscience at all, I must admit this is not Dustin's first time bottoming. That's in another hot threeway that we have in the pipeline with he, Austin and Carson. And that was one smoking fucking scene that we'll see very soon, but I could not wait to share today's scene with you. Watching this little trooper get manhandled by Thomas and his huge cock was just too hot to hold. We were afraid that if it sat next to his first bottoming scene with Carson and Austin that the two might melt each other. So, today we are seeing just how far this daredevil is willing to go with just one bottoming scene under his belt. I think once you're done watching this you'll agree we have another Damien on our hands with Dustin. I'm still dumbfounded.<br /><br />Things kick off per usual with me chatting the guys up and then I leave to check on a pie in the oven while they get things preheated in the bedroom. While I'm gone they shoot the shit and talk themselves out of their pants while Thomas talks shit to Dustin and Dustin gets down to pulling out Thomas' big cock and playing with it. By the time I come back Thomas has talked Dustin into sucking on his big cock and Dustin wastes no time getting right down to the business at hand. He's not shy at all about it and starts working it pretty good right from the start. He's licking and sucking like there's no tomorrow while his own hard cock flops in the wind.<br /><br />He must be doing a pretty damned good job as Thomas just lays back and enjoys the attention with deep moans and lots of dirty talk. You can tell Dustin really liked being dominated as he listens to Thomas' every demand. With a cock in his mouth nearly as big as his wrist, he seems right at home. He's working it over and having himself a blast.<br /><br />Things switch up a little and Thomas gives his little trooper some head for a bit before coming up on his knees and feeding the hungry, eager Dustin more of his fat cock while he strokes Dustin's hard dick. Dustin is jerking and sucking the big meat, nearly deep throating the entire thing as his own cock gets harder and harder. Thomas says maybe Dustin's dick will get even harder when he fucks him in the ass. Dustin wants a little more oral action from Thomas so Thomas obliges and goes back down on him once more. Thomas says Dustin's dick tastes good as he sucks it while Dustin jerks him. Thomas is really getting into giving his little buddy some good head before feeding him his cock once more. Won't be long now before something else happens.<br /><br />Dustin plays with Thomas' balls while he works his dick over some more. Thomas lays back and gives him full access as he talks really dirty shit to him about fucking his tight little ass. He's telling Dustin to choke his self on that big fucking dick and Dustin is trying pretty hard. Thomas reaches around and starts playing with Dustin's tight little hole while Dustin keeps the pace on that big cock, making love to it with his hungry mouth. Between his cocksucking skills and his tight little ass, he's got Thomas so hard he's about to explode. He's got his big finger up Dustin's tight little ass but he wants something else in there for sure.<br /><br />Dustin positions himself over Thomas so that he can suck Thomas while Thomas fingers his ass and gets a better view. Thomas tells him he's gonna bend him over doggy style and fuck the shit out of him.<br /><br />Thomas makes good on his promise and bends Dustin over and slowly shoves his huge, thick cock in Dustin's tight little hole, you could almost hear it pop. Once he's in, it's on and Dustin amazes us all by taking a royal fucking by a huge cock like a champ. Thomas is showing no mercy as he pounds every last inch of his thick cock deep inside that tight little ass. I mean he's slamming harder and faster than I've seen anyone get it in awhile and Dustin is reaching back spreading his ass cheeks out wider to take it even deeper. You can see the goose bumps all over his body as Thomas rails the hell out of him. Dustin strokes his own hard cock fast and hard as he's getting plowed by the huge dick.<br /><br />Dustin lays on his side to give Thomas a better angle and Thomas plows right in again, wasting no time as he fucks this hot little horny stud damn near senseless. And talk about taking a fucking. They switch positions again and this time Dustin is on top, riding the hell out of the big cock while he strokes his own. I'm not sure when I've seen someone ride a donkey dick like Dustin is riding this one. You can tell he's loving it.<br /><br />They end up side-by-side as Thomas jerks his big, hard cock and shoots a big load. All the while Dustin is squeezing Thomas' balls, licking his nipple and chest and saying 'Cum for me, daddy, cum.' Next up it's Dustin's turn to cum and Thomas talks shit to him about how hard he fucked his ass until Dustin blows his own big load all over himself. Then we get a look at the damage to his tight little hole as he gives us a few big grins and it's a wrap.",
  "models": [
    {
      "name": "Dustin",
      "person_id": 35016
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2011-08-29",
  "scene_id": 70421,
  "series": "Dustin & Thomas",
  "tags": [
    "Gay"
  ],
  "title": "Dustin & Thomas"
}