{
  "collections": [
    "Active Duty"
  ],
  "description": "Bringin' Out BrennanAs we all know, our little trooper Tuffy has already had his taste of the other side in Rear Formation: Bareback Attack! Where he takes his first step forward (in a big way). He actually came back for that video without Brennan's knowledge after the two of them had both come together for their first solo's. During this, their second visit together, Brennan discovers that Tuffy made the secret visit and at Tuffy's request we showed him some of the pictures taken from that video. I'm not sure if Brennan was shocked, amazed or aroused, but I'd be willing to bet what happens next gives us a clue.Tuffy and Brennan hop up on the bed together to do the double jack-off video that Brennan had planned to come do. But with our little protagonist, Tuffy, more is bound to happen than just jacking off. The two buddies strip out of their clothes pretty quickly and it isn't long before the guns are saluting and Brennan is eyeballing the hell out of Tuffy's cannon. Just to watch the facial expressions of Brennan as he admires what has been hidden from him for the last sixteen years was enough to send me over the edge. It's obvious he's either been waiting on this forever or he's at least glad it's happening now. And of coarse I put him on the side of the bed that would put Tuffy's cock right in his sights. Tuffy must sense the intense stares as he flashes a few looks back at Brennan. Whatcha you lookin' at dawg? Tuffy asks in his street style slangy twang. Brennan just grins from ear to ear and keeps looking.Before you can say Halt! Tuffy is talking to Brennan about sucking his cock. You never thought about it?, comes the question and from there it's a bit of a verbal wrestling match of If I do, will you? and Brennan does. After a bit of bickering back and forth and engaging in what is one of the most sweetly coated battles, Brennan edges his way slowly down to Tuffy's cock and, to both my surprise and Tuffy, latches on for dear life, with a style all his own as if he'd practiced this moment a hundred times in his head as he jacked off thinking about it (or done it a few times on some secret mission of his own).Either way, it's one of the sweetest, most tender moments I've ever captured on video as two lifelong friends share the most intimate parts of themselves with one another. Brennan is intent on giving his buddy the best he can and he does. If I've ever witnessed true lovemaking oral service from one buddy to another, it's this moment troops. Priceless and somehow, no matter how we march forward from this moment onÊwith Brennan, it'll never be quite the same. Determined, he holds his position on Tuffy's cock until the rounds of hot cum fire from the head and blast their way onto the camera lens as Brennan looks on, pleased with his accomplishment.Tuffy sucks it up and drives on ...Kiddingly reluctant, at first telling Brennan that he was pulling his leg about giving him head in return, Tuffy toughens up and returns his buddies favor. Being a known veteran to the sport, Tuffy doesn't seem as gentle and loving, but that's his style. He's the leader in this friendship and he has to keep a certain restraint about himself in order to maintain control. But Brennan is obviously pleased with what he's getting because he's really getting into the reciprocation as much as he was in doing the deed. And not one to ever be outdone in anything (maybe it's that short man's complex) Tuffy gets down to the business of getting his buddy off and that he does.Watching Brennan as he really gets into watching Tuffy service him is yet another priceless moment. He's into this and the video playing in the background has long been forgotten in this moment. Eventually, once the whole scene gets the best of him, he blows the load of a lifetime, one that I suspect he's waited many years to blow. And the two of them return to old buddies bullshitting on the bed side-by-side as Tuffy teases Brennan about how good he was and joking that there must be something Tuffy had failed to pick up on about his friend over the years.",
  "models": [
    {
      "name": "Brennan",
      "person_id": 35045
    },
    {
      "name": "Tuffy",
      "person_id": 35163
    }
  ],
  "release_date": "2004-04-01",
  "scene_id": 70426,
  "series": "Forward March",
  "tags": [
    "Gay"
  ],
  "title": "Brennan & Tuffy"
}