{
  "collections": [
    "Active Duty"
  ],
  "description": "One thing that we've always been known for here at Active Duty is slowly moving recruits across the line, inch by inch, getting them more and more comfortable and ready for the next step. Sometimes that means getting them to do their first solo and then a lot of behind the scenes discussion and negotiating until they agree to give things a try full on. Other times it means baby steps and getting them to take that process slowly on video as they agree to try more.<br /><br />This time we've got a recruit who has chosen to do the latter course of training and take things slowly as he becomes more comfortable step-by-step on video. You'll surely remember this stud from the War Chest Updates and the nice, big, delicious dick he's sporting. Devon was featured in the War Chest a couple of months ago and I've been working on him ever since to get him comfortable enough to take the next step. Finally one day he called me up and said he was down to try something a little different as long as it wasn't too crazy. I couldn't wait to pair him up with someone that I knew would appreciate this stud and that perfect cock of his. I called up my buddy Ransom and set things up right away.<br /><br />Devon is all smiles when the camera comes on and I start chatting him up about being ready to take things a step further. He says he's ready and I introduce him to Ransom who is looking mighty delicious himself. Ransom has been spending some serious time in the gym and it's paying off nicely. That body of his is so fucking hot as he sits next to Devon, ready to attack. I can hardly wait and the anticipation is building as Devon seems ready to get the show on the road.<br /><br />I leave the two of them alone for a few minutes only to return to find them both butt ass naked and playing with their cocks. Devon is looking quite tasty himself with his long, well defined torso and nice hairy legs. I inform our heroes that my wide angle lens is broken and they move in closer until they are arm to arm, tats touching and suddenly both cocks spring to full attention as the heat of their bodies warm them up. Devon waits patiently and you can just hear his mind wondering when this guy next to him is going to make the first move. Ransom lets him wonder for just a bit longer before moving in to rub his abs and eventually take hold of his cock and start stroking it as he strokes his own. Devon lays back and gives Ransom the lead as he closes his eyes and imagines what might come next.<br /><br />What comes next is Ransom's hot mouth on his waiting cock and Devon's mouth opens in an 'O' face as Ransom gets down to taking care of business. Devon is vocal about how it feels as Ransom becomes more and more aggressive, taking his cock all the way down his throat as he caresses his nice balls. Ransom is getting into it, too, as he takes the cock balls deep and comes up for big gasps of air. I focus on that nice ass of Ransom's as he moves it up and down, humping the bed as he deep throats Devon's hard cock.<br /><br />Devon clutches the pillow next to him and rubs the back of his head as he enjoys the newness of getting head from another guy. His cock is throbbing and Ransom gags on it a few times as he tries to take it as deep as he can the bigger it grows. Devon grabs the back of Ransom's head as he manhandles his cock. Ransom is challenging himself to see just how far he can go down on the beast and he has Devon come up on his knees to give him better access. All the while Devon is moaning deeper and deeper and Ransom is inspired by his moans to take it even further.<br /><br />Ransom fucks his own mouth with Devon's cock and gags himself a few more times. You start getting the idea that Ransom likes to gag on this straight boy's cock and who could blame him? Devon takes control and starts feeding it to Ransom as Ransom offers up his mouth to use as he pleases.<br /><br />Suddenly we see Devon stick his finger below his balls and start playing with his taint and ass. He reaches back behind him to finger his own ass while Ransom takes care of the front. Once Ransom realizes what's going on, he turns Devon around to give him a tongue in his furry ass and Devon strokes his cock while Ransom eats his hole and plays with it with his finger. All the while Devon's cock is hard as he strokes it. Ransom takes over and does all the work as Devon leans into the pillow loving ever second of it. Devon gives the camera a look that could make you cum right there and then flips back over to feed Ransom his cock some more.<br /><br />Ransom reaches under and plays with Devon's ass as he continues to service is huge, hard cock with his mouth and hand and lick and suck the head and shaft like a pro. Devon is lost in the moment and really getting off to being the center of Ransom's attention. They switch positions and Ransom lays on his side as Devon lays back on the bed and Ransom sucks while he strokes his own hard cock.<br /><br />Devon's cockhead swells and you can tell he's about to blow a load and Ransom offers up his face for the landing as Devon shoots his wad on Ransom's chin. Ransom jerks the rest of the jizz out, milking every last drop and then strokes out his own load of cum while Devon rubs and plays with his chest and abs. Devon's cock is still hard as he watches his cocksucker work out his load.",
  "models": [
    {
      "name": "Devon",
      "person_id": 35014
    },
    {
      "name": "Ransom",
      "person_id": 35131
    }
  ],
  "release_date": "2014-01-12",
  "scene_id": 70423,
  "series": "Devon & Ransom",
  "tags": [
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Facial",
    "First Time",
    "Gay",
    "Tattoos"
  ],
  "title": "Devon & Ransom"
}