{
  "collections": [
    "Active Duty"
  ],
  "description": "Since Taylor has returned to the AD fold after a two month absence I decided to get him back in the mix as quickly as possible. Heath has proven that he can be relied upon to deliver a good performance whether he's on the top or the bottom and I couldn't wait to see him bottom again. And, I couldn't wait to see him take a nice big cock so Taylor and his monster meat was the perfect choice. Things kick off with me teasing Taylor about staying gone for so long and he's just all smiles. His smile and eyes dance together like two professionals doing the Tango. Those eyes are adorable and the more I'm around him the sexier he gets to me. Heath is also a gorgeous dude. I love the shape of his face and that pretty smile and his trademark of chewing gum during every shoot just tickles me. It doesn't harm his ability to suck a big cock though and that's a good thing.I leave the room and let the two of them talk and get to know each other a little. They chit-chat and it doesn't take long before the cocks are out and they're jerking to the porn. The sneaky peeks start up and the cocks get hard and from there it's on. They're all smiles as they cut glances over to one another's cocks.Taylor makes the first leap and dives in for Heath's cock, taking it in his mouth and giving it some sloppy wet attention. Heath is clearly liking what's going on. Taylor grabs his own cock and starts jerking to the rhythm he's got going with his mouth and Heath just kicks back and enjoys. Heath is moaning and getting into it as jerking his own cock seems to make Taylor suck a little better. Imagine that.I return to find that all hell has broken loose and get the camera in a little better position to catch the hot action. I'm still enjoying watching so I use the tripod a bit before I get in 'director mode.' Heath decides he's ready to get himself a taste of the huge cock that's going to fuck his tight ass here in a bit and he really seems to enjoy playing with the beast. Taylor takes both their shirts off so we can see a little more skin and Heath keeps the pace on his cock.They jerk each other a little bit as they check each other out completely naked no that the clothes have disappeared. Taylor really loves his balls to be played with and once Heath notices this he takes full advantage. All the while Taylor seems to be equally loving playing with Heath's big cock. He licks his abs and moves back to Heath's cock. Taylor seems to love sucking dick more and more each time he does it and they go back and forth sharing in the glory of each others hot mouths.A sixty-nine forms and they go at each other's cocks a bit more before jerking themselves a little more. They go for a hot kiss as they jerk themselves and then Heath goes back down on Taylor. He's working that monster for all it's worth before another hot kiss and then Taylor comes up on his knees to fuck Heath's face. Heath opens wide and gives Taylor control and Taylor ends up on top with Heath laying beneath him fucking his mouth. He hangs his head off the edge of the bed to give Taylor better access to his throat as he strokes himself while Taylor fucks his face. Taylor goes down and gives Heath some more head while his cock touches Heath's tonsils.And that's about all it takes before Heath tells Taylor that he wants him to take that big cock and fuck his ass with it. Taylor puts it in and goes balls deep, thrusting into Heath's ass like a jackhammer. All the while Heath is jerking his own big cock as he takes Taylor's deep in his ass. Heath's cock is so fucking hard he has to let go of his dick before he blows his load. Taylor isn't done quite yet, he's still gonna fuck that ass some more and he reaches up and grabs Heath's hair to pull him back further on his dick. Heath starts talking dirty shit to Taylor as he plows his ass deep, burying his cock balls deep and holding it there for a bit.Heath wants to get on his back so he can blow his load while Taylor is deep inside him. 'Fuck me' he tells Taylor as he strokes himself hard and fast. Taylor obliges and rails his ass harder. With all this thrusting it doesn't take long before Heath is blowing his batter all over his washboard abs and Taylor decides to pull out and cum with him. They sword fight with their cum-covered cocks, touching the tips together and spreading their cum and then they go for one more hot kiss and it's a wrap.",
  "models": [
    {
      "name": "Taylor",
      "person_id": 35153
    },
    {
      "name": "Heath",
      "person_id": 35246
    }
  ],
  "release_date": "2012-05-15",
  "scene_id": 70429,
  "tags": [
    "Gay"
  ],
  "title": "Heath & Taylor"
}