{
  "collections": [
    "Active Duty"
  ],
  "description": "This scene is one we'll all remember. I got a text message from Ransom late one Friday night telling me that he'd just lubed up his ass and was playing with it in the shower. He'd had a few drinks and was telling me some of his fantasies. My guess is he'd visited the site recently and spotted our man Bric and had gone and got the hots for him. Anyway, Ransom tells me via text messages how he's longing for some hot cock in his ass and I knew just the scratch he needed for such an itch. The next morning I sent him a text telling him to come over that afternoon and we'd get him all caught up on what he'd been missing. <br /><br />Another quick call to our man Bric and my afternoon was all set. I'd been wanting to see these two get it on for awhile but I was waiting until Bric got a little more experience under his belt before turning him loose with such a horny devil as Ransom. The time was right and I knew that Bric could hold his own. What unfolds is 49 minutes of pure smoldering sexiness right on your screen. <br /><br />From the shower to the cum shots these two have one hell of a time exploring each other. By the time it's over, Bric does some deep exploration that Ransom clearly is loving and I think Ransom's oral skills has Bric kind of blown away. <br /><br />It all starts with a beautiful wet lip lock in the shower and some rubba-dub-dub as they jerk each other's dicks while they're all soaped-up. Ransom notices right away how much cock Bric is packing and he's clearly pleased with the package as he spends plenty of time playing with the uncut beauty as Bric does the same to him. <br /><br />Ransom is the first to drop to the shower floor and show his love for Bric's uncut manhood as he gets into some deep-throating action. Bric lays back against the shower wall and enjoys the special attention to detail that Ransom is paying to his cock as his abs glisten in the water all ripped and shredded. You could throw your laundry in there and get it done while they are at it. <br /><br />Bric returns the favor and pays some special attention to Ransom's cock as he jerks his own hard meat. Bric is coming along nicely as we watch him begin to enjoy having a cock in his mouth and as his skills improve. He's clearly comfortable in this new territory he's found and his actions tell the tale. They continue to swap head in the shower for a bit as Ransom goes back down for more of Bric's huge cock, this time taking it deeper and deeper each time. You can hear Bric's approval through the deep moans he's letting out as Ransom goes deeper each time, cupping Bric's balls to allow him to go even deeper. When Bric realizes that Ransom is down to take the cock he starts face fucking him fast and deep as Ransom gags a few times here and there. <br /><br />Ransom stands up and puts his chest to the shower wall, showing off his pretty bubble butt to Bric who starts slapping his big hard cock between the cheeks and rubbing it up and down the crack of Ransom's horny ass. Ransom arches his back and moves his ass up and down, back and forth on Bric's dick, letting Bric know exactly where he wants him to stick his cock next. Bric's cock stays rock fucking hard the entire time and you can tell he's picking up on Ransom's vibe and the idea seems mutual between the two. Naturally it's time for this duo to move things to the bed. <br /><br /> Once on the bed Ransom is jerking Bric's cock while he strokes his own and the look of anticipation on his face tells the thoughts in his mind. He goes down on the big meat again, giving Bric some amazing head and himself a nice hand job. Bric is still in awe of Ransom's deep throating skills and goes down on Ransom's cock for good measure. He gives Ransom's cock a thorough inspection as he enhances his oral skills. They end up in a side ways sixty nine and Ransom starts fingering Bric's asshole which gets a few great moans from Bric. <br /><br />Bric fucks Ransom's face from the side for a bit while he strokes Ransom's hard cock. It won't be long before Bric is fingering Ransom's hole and preparing it for the fuck. But first Bric wants to fuck Ransom's hungry face some more and he gets over him in push up position to fuck his face long and hard. <br /><br />Ransom crawls on top of Bric and straddles his cock, rubbing it up and down the crack of his hot, horny ass as Bric saddles up to go inside. It's a fat, thick cock and Ransom's tight ass has to adjust to it for a minute before it finally slides inside. You can almost hear Ransom's hole tear as Bric's thick dick does deeper and deeper inside him. <br /><br />Finally it's in and after they've worked out Ransom's hole, we watch Bric fuck the living hell out of Ransom for the next 14 minutes, giving him exactly what he came for.",
  "models": [
    {
      "name": "Bric",
      "person_id": 35047
    },
    {
      "name": "Ransom",
      "person_id": 35131
    }
  ],
  "release_date": "2012-01-12",
  "scene_id": 70420,
  "series": "Bric & Ransom",
  "tags": [
    "Gay"
  ],
  "title": "Bric & Ransom"
}