{
  "collections": [
    "Active Duty"
  ],
  "description": "This scene features two newbies in a duo. One of them we've introduced to you previously in the War Chest and the other is brand-spankin' new, but you might not be able to tell by his stellar performance. Heath is one of those guys that we fast-tracked through his basic training because he showed such promise. This guy can suck a cock like a pro and take one for the team like he's been playing ball all his life.Hurley we've met in the War Chest already and this big, beefy stud jumps right in there with Heath and gives him a run for his money. A perfect pairing that really blows me away for first-timers. They compliment each other well. Heath is tall and lanky while his partner, Hurley, is more like a football player. Together they make for one hot team.They waste no time getting right down to business as they are embraced in a tongue-twisting kiss as soon as the camera comes on. Hurley is already feeling his way around Heath's crotch, getting to know him better. The shirts come off pretty fast as these two seem eager to keep things moving. They return to the kissing and caressing as they feel each other up. Hurley throws Heath back on the bed while he lets his tongue explore his nipples and unbuttons Heath's pants as he works his hands down inside. Heath returns the gesture and tears the buttons down on Hurley's pants. Heath's cock is the first to visibly stand at attention. By the time they wiggle out of their boxer briefs, both cocks are ready for action.Heath is the first to go down for a taste of Hurley's cock as he slowly starts giving Hurley what is most likely some of the best dome he's ever had. Watching Heath service Hurley's cock gets me going every time I watch it. He's so careful and pays close attention to every detail of Hurley's cock and balls. This guy is good and Hurley's cock agrees. Meanwhile Hurley plays with Heath's cock, stroking it slowly as Heath makes love to his.The tables turn and Hurley goes down on Heath's cock, giving it the same, detailed attention as Heath gave his. You can tell these guys want to please one another and they're doing a damn good job of it so far. Hurley looks up into Heath's eyes a few times with a look of lust. Heath decides to give Hurley better access and sits on the window ledge as Hurley moves between his thighs and continues to work his cock.Soon, Hurley has Heath's legs thrown in the air, licking his ass as he strokes Heath's cock. He brings Heath down onto the bed and continues tonguing his hole, preparing it for the next step. It's feeling so good to Heath that he's rubbing his head and pulling Hurley's face deeper into his hole.Once he's loosened up and ready, Hurley positions himself behind Heath and slowly eases his cock into Heath. Heath is stroking his own cock as Hurley slowly plows his tight ass deeper and deeper. When Heath starts moaning you'll lose it as this hottie seems to be really liking what he's getting. His cock is rock hard as he strokes it and Hurley must be turned on by his reaction, too, as he's banging him harder and faster now.Hurley puts Heath on his side and starts slamming his cock deep into him as Heath continues stroking his own cock faster. They switch up once more with Heath on his back and Heath blows his huge load all over himself as Hurley pounds his ass. Hurley isn't far behind and pulls out to pop his load all over Heath's stomach, mixing it in with all the jizz. Heath jerks their cocks together, milking out the cum and they go for one last kiss.",
  "models": [
    {
      "name": "Heath",
      "person_id": 35246
    },
    {
      "name": "Hurley",
      "person_id": 35090
    }
  ],
  "release_date": "2011-06-19",
  "scene_id": 70422,
  "series": "Heath & Hurley",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Duo",
    "Gay",
    "Rimming"
  ],
  "title": "Heath & Hurley, Scene #01"
}