{
  "collections": [
    "Active Duty"
  ],
  "description": "These two are your typical rough-around-the-edges Marines. Sky is a real beauty and they both have lots of personality. They seem to hit it off really well. The Major has just introduced them only an hour or so before the scene. They both know what they are here for and they both seem pleased with their partner. The boys are watching some pussy porn as they kick back on the Major's couch. They are commenting on the girls and Sky says he'd do one of 'em in the butt. Then he says 'Hell, I'd let her do me in the butt.'The Major suggests that Holden can do the honors and Sky seems more than fine with that. Holden says they can take turns. The Major slyly gets the boys to take off their shirts expressing interest in their tattoos. Both Marines have their share of ink and some nice work. All eyes will certainly be on Sky who has stunning good looks for just a regular kinda guy. His eyes are beautiful and you can see just how excited Holden is to be paired up with him. They boys kick back and pull out their cocks and start jerking side-by-side. The talk goes to asses and Holden says he doesn't think he can get four fingers up his ass. The Major keeps slowly coaxing the guys to go further and soon he's got 'em both butt ass naked.Once he's got the guys naked, they start jerking one another a little as they continue to comment on the porn. Holden keeps talking about his ass. He says Sky will need more than just spit for his ass if he's gonna fuck it. They give those famous glances back and forth and the cocks slowly get hard.The Major suggests that the boys take things to the bedroom and they're all for it. Once on the bed Holden decides he's ready to try giving head for the first time and Sky kicks back do give him access to his hard cock. Holden starts out slowly licking the head, working his way down the shaft, getting comfortable as he goes. Sky swears it's not Holden's first time. After Holden has his turn, Sky takes his and grabs Holden's cock and gives it a try. Talk about technique--Sky has plenty and he's giving all his attention to Holden's cock.The boys get in a great sixty-nine position and go at it giving each other head. The Major catches all the action as these two really explore one another. Holden gets on top of Sky and reveals his pretty hairy ass as he goes down on Sky and gets attention from Sky in return. The Major gets some great angles of the action, showing us what it's like to be right there.Sky decides its time to test the waters and see if Holden is ready for some cock. He starts out with a finger and Holden sounds like a little school girl giggling and yelling. They switch up and Holden fingers Sky's ass and Sky gets hard while he massages the prostate. Holden plays with Sky's ass in several positions as these two get closer to doing the deed. Who's gonna be the first to take a cock in his ass?Both boys seem to have bit off more than they can chew, but the Major sticks in there with them and makes sure both boys get their holes poked. Holden is the first to give it a try as Sky shoves his hard cock deep into him. They go from one position to the next and before you know it Sky is on bottom giving Holden his turn.Sky is the first to cum and what a nice load it is. He then decides to take Holden's hot load in his mouth and the boys are both relieved.",
  "models": [
    {
      "name": "Holden",
      "person_id": 35255
    },
    {
      "name": "Sky",
      "person_id": 35195
    }
  ],
  "release_date": "2009-01-10",
  "scene_id": 70439,
  "series": "Special Ops: Alpha Co.",
  "tags": [
    "Gay"
  ],
  "title": "Holden & Sky"
}