{
  "collections": [
    "Active Duty"
  ],
  "description": "Neal is a real beauty and reminds me of someone a lot but I just can't put my finger on it.  Maybe you'll be able to refresh my memory and tell me just who it is that he reminds me so much of. Regardless of how much he reminds me of someone else, Neal is definitely his own person and has so many hot ass attributes that set him apart from a crowd.  He's got some of the prettiest brown eyes and such a cute smile and you can tell he spends his fair share of time in the gym by the body he's sporting.  But that's just the beginning of all the good things about Neal.  As he loosens up and begins to get more comfortable we see a real, true performer emerge from his shell as Neal takes us on one hell of a solo journey that ends with.Things start out as usual with Neal and I chit-chatting about him and we learn that he's 20 years old, he's 5' 7' (which is my favorite height) and weighs 165lbs.  He enjoys paint-ball, going to the gym and getting drunk.  In high school he played football and wrestled.  He thinks getting into porn would be a fun way to make some cash on the side.  I assure him that he'll still have to work 'hard' for the money and he just grins.  I get him up on his knees without his shirt to pose for us a bit and then I leave him be for a few minutes to see what comes up.Once I return he's already stroking a nice hard cock and comes out of his boxers pretty quickly.  This hottie isn't wasting any time putting on a great show for us and he seems to be very comfortable doing so.  He pays plenty of attention to the camera and that always makes us feel involved so he's a quick learner.  That nice cock he's sporting is at full attention and he's really getting into what's going on.  I love the way he moves his lips as he strokes his meat and how intense he is as he shows off the entire package.  You can tell he likes being watched.  He takes his time and slowly shows off his nice cock instead of beating it to death and leaving us wonder about the size, he shows it off nice and slow for us.  He also gets into rubbing his nice chest and giving us some sensual moments along the way.As if you'd have to guess, my favorite part of the video comes when Neal gets up on his knees to show off his ass for us and let me tell you this guy really knows how to tease you with that perfect ass of his.  He's not shy at all about it and in fact I think he rather enjoys it.  His cock never goes soft once as he gives us one hell of an ass show.  He's got a beautiful ass and he knows just how to arch his back in just the right spot to make it poke out just perfectly.  All the while he fucks his fist with his cock and I'm in a daze. I could watch him move that ass in circles all day long and would never get bored.  It's fury in all the right places and just begging for someone's tongue to eat it for hours.  Don't' take my word for it, get on over to the War Chest and see for yourself.",
  "models": [
    {
      "name": "Neal",
      "person_id": 35250
    }
  ],
  "release_date": "2011-11-09",
  "scene_id": 70431,
  "series": "Neal",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Neal, Scene #01"
}