{
  "collections": [
    "Active Duty"
  ],
  "description": "Thomas And Damien Get More Than Acquainted…<br />While Thomas is in the shower Damien goes in to shave. Luckily the mirror is positioned in such a way that Damien gets a full view of the horse meat that is about to plow his tight boy ass good and hard. I did this on purpose to build the momentum of Damien trying to contain himself. Thomas and Damien shoot the shit back and forth while Damien shaves and Thomas showers. They talk about whether Damien can take all of Thomas' meat or not. I tell Thomas I got something I want him to see.<br /><br />Thomas Watches Damien Get Fucked While He Fucks Him…<br />I bring in a laptop with MIA: Men In Action 3 playing on it where Cliff banged Damien's little brains out. Thomas is all into watching little Damien take it like a man as he strokes his cock to the video. Damien likes watching too and positions himself in front of Thomas with his ass in the air, but Thomas wants Damien's hot mouth first. Thomas makes his little bitch boy worship his manmeat before he shoves it deep in his ass and Damien obliges with deep head as he licks and sucks the shaft of the huge cock that is about to spread his ass apart. Thomas returns the favor for a bit and sucks Damien while he fingers his tight ass, getting it ready for the fucking he's about to give it.<br /><br />Damien Takes The Cock Like A Jockey…<br />Thomas positions himself behind Damien and shows his little ass no mercy as he plows deep inside him on the very first thrust. He kisses and licks Damiens back as he bangs him hard. Damien has found himself just where he likes to be..on the receiving end of a rear man's cock. Just the act of being dominated turns Damien on beyond control and he let's all the 10 inches sink deep in his young, tight ass. Damien is a master at bottoming for the big boys and he's showing his skills are still in tact as he takes Thomas' huge cock like a true pro. Thomas is in balls deep and Damien is in ecstasy.<br /><br />The Lights Go Out But The Fucking Goes On…<br />There was a thunderstorm the day we shot this video and in the middle of the scene the electricity went out. But we had enough daylight left and Thomas and Damien were too horny to quit so we move things to a spot we can get some daylight and the two fellows keep the pace. Damien rides Thomas' cock this time as Thomas strokes Damiens dick. Damien rides Thomas harder and harder until he blows a huge load all over Thomas' chest. Thomas ask Damien if he wants to let him cum all over him and Damien says yeah. Thomas stand over Damien and delivers a huge, hot load that our little hero laps up, taking it all in his mouth and spitting it back out over and over. Damien's face and chest are covered in cum but it takes awhile before he lets loose of Thomas' cock. Once he does he ends with 'Damn that cum tastes so good.'",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2006-05-08",
  "scene_id": 70436,
  "series": "Rear Gunners 2",
  "tags": [
    "Gay"
  ],
  "title": "Thomas & Damien"
}