{
  "collections": [
    "Active Duty"
  ],
  "description": "Kody And Brennan Break In Our Newbie, Rico ...The next scene is an hour long, just like the first scene, and features our boy Kody along with Brennan who has just returned from an eight month deployment in Iraq and boy is he looking better than ever. We last saw Brennan in Rear March 3 and he had his head shaved just before he was leaving for Iraq. He worked out a lot while he was over there and his hair has grown back and boy he's hornier than ever. Kody and Brennan have never worked together either, but they know the deal just like Cole and Granger and their newbie Rico proves to be a piece of cake for our two heroes. Rico is a sexy little devil with the cutest 'stick 'em out' ears (God I love those ears) and the hottest, roundest bubble butt I've seen for awhile. He's as nervous as all get out though but our two pros warm him up real quick as Kody starts playing with Rico's cock through his boxer briefs. Rico's cock doesn't take long to repond no matter how fast his heart is beating and Kody has it out in a second and in his mouth.While Kody's mouth and Rico's cock get acquainted, Rico reaches over and grabs Brennan's beautiful cock that just happens to be rock-hard at this point and starts stroking it while Kody goes to town on Rico's dick. Kody and Brennan decide to share the pretty cock with one another and Rico gets to feel what it's like to have two hot guys going down on you and he seems to like it from the looks of his cock's response. They switch things up and it's Rico's turn to taste some cock so Kody gets the newbie down on his hard dick then Kody and Brennan get up on their knees on each side of Rico and start feeding him both their cocks while they reach down and share stroking his cock. Once Rico seems comfortable Kody goes back to sucking Rico while Rico falls in love with Brennan's cock and seems to be enjoying the hell out of this newfound hobby. Brennan's nuts start to tighten giving us the cue that he's loving what Rico is doing as I get some good shots from underneath. Rico must be a pretty good cocksucker cause Brennan is all into it.Kody Gets Off On Getting Fucked ...Kody is horny now and wants some cock up his hot ass so I suggest Brennan do the honors first and give Kody some dick. Rico feeds Kody some some cock as he watches Brennan and learns how to fuck a nice hot man pussy. Brennan fucks Kody like he hasn't fucked anything since he's been in Iraq. Brennan is fucking him good and hard and Kody is loving a cock in his ass and his mouth at the same time as he strokes his own hard dick. Kody is hot today and Brennan and Rico are delivering what he needs. It isn't long before Kody is blowing his load all over himself as Brennan continues to plow him good. Brennan holds out as long as he can but he's finally ready to blow his load to and lands his cream right on top of Kody's cum all over Kody's dick and balls.Brennan Gets as Good As He Gives ...It's time for our newbie Rico to show us what he's learned about fucking a man's ass and Brennan is just hot and bothered enough to let him try. Rico makes it plain that he wants Brennan's ass and Brennan aint complaining. Rico learns fast and wastes no time getting positioned standing over Brennan's ass and putting his curved cock deep in Brennan's hungry hole. Brennan hasn't been fucked in awhile and he's ready and Rico is doing a fine job of taming his hot ass. Rico fucks Brennan from behind for awhile then flips him over on his back and fucks him while Brennan throws his legs in the air. I get some great underneath shots of Rico's curved cock going in and out of Brennan's pretty pink hole and some great shots of Rico's nice, round bubble butt. I might have lingered there awhile -- LOL. Finally, Rico can't hold this load he's been building for the last hour and blows a huge fucking wad all over Brennan's chest, stomach and balls. Brennan is hard and follows Rico's lead and blows his load too. What a hot scene between these two hot soldiers.As a bonus we get to watch Brennan shower. I couldn't resist as he looked so good in the new bathroom. I just wanted to show them both off.",
  "models": [
    {
      "name": "Brennan",
      "person_id": 35045
    },
    {
      "name": "Kody",
      "person_id": 35098
    },
    {
      "name": "Rico",
      "person_id": 35137
    }
  ],
  "release_date": "2005-03-01",
  "scene_id": 70434,
  "series": "Hard Corps 2",
  "tags": [
    "Gay"
  ],
  "title": "Brennan, Kody & Rico"
}