{
  "collections": [
    "Active Duty"
  ],
  "description": "Meanwhile Back At The Ranch…<br />Kody and Hoss are doing their thing and not wasting anytime getting their cocks hard and in each others mouths. Kody starts off things by giving Hoss the kind of head he enjoys and Hoss returns the favor just as well. For all those Hoss fans you're not gonna wanna miss this scene as the boys bring things to a sixty-nine position and share in the glory. I was impressed with how well Hoss took to Kody's cock and the two just seemed to be as good a fit as Dean and Brock.<br /><br />In Come Dean And Brock And It's A Four Way Made In Heaven…<br />Dean and Brock return to the living room to join Kody and Hoss and the four of them get all twisted together in a delightful exchange of saliva. Brock is sucking and worshipping Hoss' cock while Dean sucks Brock's cock and Kody brings up the rear by eating Brock's ass. The tables switch and it's dean in Brock's last position as he sucks both Brock and Hoss while Kody does the honors on Dean's ass. Dean is mastering the art of sucking two cocks in unison while Kody continues to perfect his art of eating a nice man ass.<br /><br />Our Rear Gunners Take Their Positions…<br />The fucking kicks off with Hoss fucking Kody and Brock fucking Dean as Kody and Dean take it like champs side-by-side. Dean and Kody exchange a hot kiss as the two gunners plow them hard from behind. After breaking in their asses good Hoss and Brock switch up and Brock fucks Kody while Hoss fucks Dean. Dean says Hoss' cock is the 'perfect fit' as Hoss fucks the daylights outta him.<br /><br />The Cumshots Fly…<br />After the awesome fuckfest the four heroes let their loads fly and the curtain closes. But we're not done yet!",
  "models": [
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Dean",
      "person_id": 35074
    },
    {
      "name": "Hoss",
      "person_id": 35088
    },
    {
      "name": "Kody",
      "person_id": 35098
    }
  ],
  "release_date": "2006-04-05",
  "scene_id": 70435,
  "series": "Rear Gunners",
  "tags": [
    "Gay"
  ],
  "title": "Brock, Dean, Hoss & Kody"
}