{
  "collections": [
    "Active Duty"
  ],
  "description": "We're back this week with something very special that we promised you on Wednesday. My friend Major Wood has been very busy lately putting together his first hardcore release for us here at Active Duty. This week we are introducing Major Wood's Special Ops: Alpha Company as the Major's very first hardcore release here at Active Duty. This week in our Videos Of The Week section we are streaming the fist scene of Special Ops: Alpha Company for all of our members to check out.<br /><br />This first scene is one really hot threeway and includes one of Active Duty's longtime favorites, Chaz. I sent Chaz over to help the Major out and boy did he ever. Chaz gets Conner and Jack (yes, the same Jack from a recent Active Duty LIVE show) to get down and dirty while the Major captures it all on video for us. Jack and Conner (or the Major for that matter) didn't need much help at all. Once things kick off these guys are going at it pretty fast and furious in no time flat.<br /><br />It's nice having an AD veteran there to help and I think it set the mood as things certainly get off to a nice fast start in the first scene of Major Wood's Special Ops: Alpha Company with these three ready for action within the first three of four minutes after the camera comes on. Jack is the first to reveal a nice raging hard on and Conner and Chaz are all eyes. They both follow his lead and pull out some boners of their own. Three hard cocks, three sexy guys all on one bed. The Major's boys go down on Chaz first to show their appreciation for their veteran player. They share his cock, suck his nipples and enjoy his body.<br /><br />Chaz soon moves in on Jack's nice hard cock and has it in his mouth before you can say 'suck it'. Things go at this pace for a bit and then Conner finds his way to Chaz's cock and Jack finds his way to Conner's cock. Everyone gets a taste of each other in Special Ops: Alpha Company.<br /><br />Chaz starts eating Conner's ass and gets it ready for the fuck. Once he's gotten it all hot and bothered he tells Jack it's time to fuck Conner's asshole and they put him in a wild position with his shoulders on the floor and ass in the air as Chaz moves in and slowly shoves his cock deep in Conner's waiting hole. Jack moves in and finds a warm spot in Chaz's mouth while Chaz plows Conner's hole. Things switch up and they put Conner on his back as Chaz keeps fucking his hole. Jack finds a way to lock Conner's legs around his so he can keep feeding Chaz his cock. It isn't long before Jack is squatting over Conner's face, feeding him his asshole. What a hot thing to watch as Conner seems to love munching on the hairy hole.<br /><br />Everything is all lubed up now and Jack decides to ride Conner's cock while Conner is still getting fucked by Chaz. This is one hot position as Jack gets plowed by Conner who's getting plowed by Chaz. It isn't long before Chaz is blowing his load, but that doesn't stop Jack from finishing his hot ride on Conner's cock. Chaz stays with 'em and rubs Jack's chest and nipples while Conner strokes Jack's nice, hard cock while he plows his ass. Jack takes matters in his own hands and strokes out his own nice hot load then hops off of Conner and jerks Conner's cock until Conner blows a huge load. Chaz gets the guys up on the bed for the usual AD 'close outs' and says he can't wait for me to meet Major Wood's boys! A great ending to a very, very hot first hardcore scene for the Major. Be back here next week as we release the second scene to our members and the DVD for ordering.",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Connor",
      "person_id": 35253
    },
    {
      "name": "Jack",
      "person_id": 35254
    }
  ],
  "release_date": "2009-01-10",
  "scene_id": 70438,
  "series": "Special Ops: Alpha Co.",
  "tags": [
    "Gay"
  ],
  "title": "Chaz, Conner & Jack"
}