{
  "collections": [
    "Active Duty"
  ],
  "description": "I was so excited when Guy told me that he was ready to a video with some other dudes that I could hardly contain myself. This big, blond beefy stud is packing some serious meat just like our man Taylor and I knew the two of them would be a great tag team for a willing bottom. Korbin came to mind after the good fucking he took from Nolan in Double Time 10 so I gave him a shout and he was down. I didn't warn him ahead of time that both the guys were super hung and that both of them would take turns on his sweet little ass, but once he got there he didn't seem to mind at all. In fact, I think he was in the middle of something he really wanted anyway.Things kick off with Guy and Taylor on the couch already playing with their cocks as they watch some porn. Taylor's cock is already out and he's stroking it while Guy sits beside him checking it out. The two of them decide they need a third to join and help them out so Korbin comes over and kneels in front of Guy and starts sucking his cock while Taylor stands jerking and watching. They take turns on Guy's cock, working him up and getting him over his initial nervousness. By the time the three of them get back on the couch Guy is hard as brick with his cock in Taylor's mouth. Korbin is busy working on Taylor's big cock and we've got what I call a daisy-chain-of-command going on. These three troopers waste no time lending a hand -- err mouth -- to one another. Watching Guy enjoy himself so much is such a turn on. His facial expressions are amazing.Korbin moves down to take over on Guy's big dick while Taylor moves around to let Guy get his first taste of cock by giving him his big tool to lick, suck and play with. Guy wastes no time returning the favor and is actually quite good at it if Taylor's moans are any indication of how damn good it feels. All the while Korbin is working Guy's cock like a part time job. Guy gets schooled in sucking a cock and fast-tracks it to damn near pro as he works Taylor's big meat with his mouth. The better he gets, the more Taylor lets him know how good it feels. In fact, I don't think Guy comes up for air once while he's working that cock. Taylor even stands over him, straddling his face and pumping for awhile.Time to share and Guy's cock makes a damn tasty thing to share as Korbin gets help from Taylor working that big cock. But it doesn't take long for Taylor's attention to get hijacked by Korbin's cute little butt. Korbin positions himself to give Taylor better access and Taylor starts slapping his cock on Korbin's ass while Korbin continues working Guy's horse cock. Taylor is rubbing his hard cock up and down the crack of Korbin's ass as he prepares to fuck it. Korbin proves to be a bit short so they put him on the ottoman while Guy face fucks him hard.Taylor is all saddled up and ready to ride and Korbin arches his back and prepares for the big cock he's about to have up his ass. Guy looks like he's really enjoying watching as he asks Korbin if he's ready for that big cock up his ass and moans. Taylor slams it in deep from the start and Korbin is moaning loud as Taylor plows him hard and fast. So much for getting used to it, he's all in and going full throttle. Taylor is slapping that ass while he fucks him balls deep and Korbin keeps his mouth occupied with Guy's beautiful piece of meat.Korbin is quite the trooper as he moans and slams his ass back on Taylor's big cock, meeting it in the middle of each forceful thrust. The looks on his face are priceless as he enjoys being the bottom boy for these two hot studs. Guy is up to bat next and he's swinging a big bat. He slams it into Korbin deep just like Taylor did and rams him hard. You can see the goose bumps form on Korbin's ass as Guy hits the spot.Taylor is watching the action and jerking his cock as he holds Korbin by the hair of the head. This is enough to send Taylor over the edge and he blows a huge wad of jizz all over the place. Guy keeps the pace and talks dirty shit to Korbin as he fucks him hard and deep and Korbin begs him to cum. He shoots his load all over Korbin's back and it's quite a fucking load. All the build up must have had Guy's nuts churning overtime as the load he shoots is amazing. He rubs it all in with the head of his cock and it's a wrap. But, not until the three of them embrace is some hot kisses.",
  "models": [
    {
      "name": "Guy",
      "person_id": 35086
    },
    {
      "name": "Taylor",
      "person_id": 35153
    },
    {
      "name": "Korbin",
      "person_id": 35251
    }
  ],
  "release_date": "2011-08-20",
  "scene_id": 70432,
  "tags": [
    "Gay"
  ],
  "title": "Guy, Korbin & Taylor"
}