{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm really excited about this sexy blond devil. We've known each other for a couple of months and have formed a friendship that is very special to me. The fact that he's hot as all fuck surely helps, but Boyd has much more to offer than just his gorgeous face, body, ass and cock. He's got a heart of gold that he doesn't hesitate to share with those around him. He's sexy and super sweet and I think I'm in love all over again.<br /><br />Boyd is 21-years old, stands 6' tall and weighs 160 lbs. He likes to surf and snowboard and he played basketball in high school. I quickly get him out of his shirt to reveal that gorgeous set of abs he's sporting. He's lean and ripped and has the most beautiful suckable nipples that just drive me crazy. We chat a bit about the first time he jerked off and why he wants to get in the business. Boyd comes across a bit shy but he's a total ham for the camera and loves to show off.<br /><br />I leave him alone for a bit and when I return he's got his cock out stroking it nice and slow. He's paying plenty of attention to the camera with those beautiful blue eyes as he works himself up. He starts rubbing his chest and abs as he plays with his dick and we see the sensual side of this stud being to emerge. I zoom in and focus some attention on those gorgeous nipples and those well-defined abs as he pleasures himself for us.<br /><br />Once he comes out of his jeans and boxers he's more than comfortable with the camera. His lowhangers are a beautiful sight to behold as they dance below his perfect cock. All the while he's playing to the camera like he's doing this just for you.<br /><br />The real icing on the cake comes when I get him to show off that perfect fucking bubble butt of his and let me tell you this guy really knows how to tease us with that butt. He gives us one hell of an ass show that will leave you drooling and wishing you were right there licking it or fucking it. I'm all in there getting the best angles of that ass and following him as he gyrates that beautiful ass in some of the most erotic movements I've seen in awhile. I position the camera at one point to make it feel like you are right there behind him as he grinds his ass on your cock. Trust me when I tell you that by the time this video comes to an end (with his super gushing cumshot) you're going to be in love with Boyd.",
  "models": [
    {
      "name": "Boyd",
      "person_id": 35248
    }
  ],
  "release_date": "2012-02-28",
  "scene_id": 70430,
  "series": "High Alert",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Boyd"
}