{
  "collections": [
    "Active Duty"
  ],
  "description": "Brian had seen pictures of Kaden before they met and he was clearly smitten with what he saw. His eagerness told the tell. These two hit it off right from the start. Two country boys with their southern drawls can't help feeling a bond. I remember the day we shot this scene they went outside and sat by the pool and I could see them laughing and smiling and I knew I'd done something right. Things kick off with me talking to Brian about always having wanted to work with him since the first time I saw his handsome face. He's all smiles. Brian tells Kaden that he's pretty fucking nervous and Kaden assures him everything will be fine. These two together is mesmerizing. Those smiles and eyes will get you lost. But pay close attention to the banter because it's great. They take off their shirts and admire one another's bodies. Kaden is complimentary of Brian's body and vice-versa. It doesn't take long for the pants to come off and Kaden is spying Brian's cock as soon as it reveals itself. They're all smiles. The cocks are hard and bouncing in no time and they're sizing one another up. They start out jerking each others cocks and comparing size. Brian is really impressed with Kaden's body and he starts touching and rubbing Kaden's torso all over. Finally he gives one of Kaden's pecs a little bite and starts licking and kissing Kaden's chest. Kaden cups his hand around Brian's head and enjoys the attention. They go for a hot french kiss and they enjoy it for quite some time. Kaden returns the torso worship but works way quickly down to Brian's hard cock and takes it in his hot mouth.<br /><br />Kaden wastes no time getting right to the meat and potatoes. He's on Brian's cock and sucking it good (as Brian affims with his comments) and it's so hot to watch as Kaden sucks and worships Brian's huge low-hangers. Kaden takes such care when he's sucking a nice cock to give it a full inspection. He gives Brian's cock plenty of attention and they move back into the kissing and worshipping of each others chests. This time Brian moves down.<br /><br />Brian takes Kaden's cock in his mouth and he must have been paying close attention in blow job class because he's a quick learner. He has Kaden fully hard in no time flat as he licks and sucks Kaden's meat. It's so hot to watch a guy suck another guys soft cock and bring it to a full rockhard erection and Brian does just that with Kaden's cock. They switch back and forth and Kaden goes back down on Brian, giving him great pleasure.<br /><br />As they swap back and forth, it's intense to watch as they try harder each time to please the other even more. Kaden goes back to worshipping Brian's cock and gives it a better go than the first time around. Brian returns the favor and this time with even more enthusiasm. He's taking to this newfound experience pretty damned well. He sucks Kaden's cock hard and fast then slow and sensual. He goes from licking and sucking his balls, all the way up the shaft, licking and takes the cock back in his mouth slow and intently. Brian is a natural deep throater as he takes Kaden's cock all the way down his virgin throat to the balls.<br /><br />They hold each other tight in their arms and kiss each others shoulders and chest as Brian lays his head on Kaden's shoulder as he jerks his cock. Kaden goes back down on Brian and Brian strokes Kaden's cock while Kaden sucks him. Kaden soon lays back on the bed and Brian snuggles up next to him and takes his hard cock back into his mouth and licks and sucks it, tongue all over the place as he enjoys the hard meat. Me thinks he's found something he really enjoys. And Kaden doesn't seem to mind it at all. Brian has found his stride. Brian moves up Kaden's chest and stomach kissing and licking and Kaden throws out his tongue and Brian meets it with his. The kissing between these two is so fucking hot. Kaden goes back after Brian's hard cock and by now he's slapping his hard cock on his stomach as he sucks Brian. We all know when he does that, he's super fucking horny.<br /><br />Kaden reaches around while Brian is sucking his cock and starts fingering and playing with Brian's ass. This is virgin territory and Brian has never let anyone get this close. Something about Kaden eases him into considering it. Kaden pops the question, 'Have you ever been fucked before?' Brian answers lowly, 'No.' 'You wanna try?' Asks Kaden. A short pause and then a devilish grin comes over Brian's face as he says 'I guess I could let you try.' From there, it's on, troops. Kaden is about to pop Brian's anal cherry and Brian seems more than willing to give it up to him. They start out with Brian on his back with his legs in the air, his cock is hard and Kaden gets inside him. It proves too much at first so they change positions and Brian throws his ass in the air and Kaden goes in from behind. This position works much better and Brian is taking it much better. He's in pain and his face makes it clear, but he's a trooper and Kaden's taking it gentle. Kaden starts pounding him harder and faster and Brian's face is priceless. I ask him how that feels, like a big dick in his ass and he says 'uh huh'. He's not running though and he's not squirming across the bed trying to get away. He's taking it like the man he is and Kaden's delivering a great first fuck to this virgin. By now Brian is reaching back and grabbing Kaden's muscled thigh and pulling him in harder. He's taking a good fucking for a beginner.<br /><br /><br />We decide to give Brian some revenge time and he gladly takes it. Kaden assumes the position and Brian plows his hard dick deep in Kaden's perfect bubble ass. Kaden is moaning and groaning as Brian puts it balls deep. I love the way Brian fucks. He long strokes it so that we see the full length of his big cock going in and out of that tight little ass. A director's dream. Brian puts Kaden on his back and holds one leg over his shoulder as he shoves his cock deep in Kaden's loosened ass. Kaden starts stroking his own hard cock while Brian pounds his hole. Once again Brian is long stroking that tight ass and Kaden is beating his meat against his stomach. I'm glad that Kaden enjoys long fucks because Brian fucks him for a good long time. Kaden seems to be getting close and Brian starts talking to him telling him, 'Come on, cum for me, cum for me now.' Brian starts squeezing and playing with Kaden's nipples as he fucks him fast and Kaden strokes his hard cock. One last, cum for me from Brian and Kaden shoots a huge load all over his chest, above his pecs. Brian says that was evidently pretty damn good and Kaden says, 'Fantastic.'",
  "models": [
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Kaden",
      "person_id": 35022
    }
  ],
  "release_date": "2009-03-15",
  "scene_id": 70444,
  "series": "Double Time 3",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Gay",
    "Kissing"
  ],
  "title": "Brian & Kaden"
}