{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden And Thomas: A Long Time Coming ...<br />Getting these two together for this took some time. Kaden had to prepare himself for the task at hand, but when he did, he meant business. When the camera comes on the two of them are on the couch chatting back and forth. Getting them together for some one-on-one was the best idea I could have had. It set them at ease and gave them a chance to really get into each other. They are both aware of their popularity and they're proud to get the chance to be alone. I talk with the guys a bit about what's about to happen. Kaden says he came to try something different. Thomas says he thinks what's about to happen is spectacular. Fireworks. I go to put some laundry in and bake a few pies while these two get things started. You can tell they're both a bit nervous but I think it's more nervous excitement. Both of these guys have worked really hard on their bodies and they know how to admire hard work. The glances start and they don't stop until the hard cocks come out and then the glances turn to stares. Kaden is the first to latch on to Thomas's hard meat as he starts stroking it and feeling it up for size. Kaden gets a good handful and says 'lord, that's going in me?' Thomas replies with devilish grin, 'yep.' The verbal exchange between the two at this point is priceless.<br /><br />Let The Games Begin ...<br />After some banter back and forth about their bodies and how hot they are, the talk turns to cock and Thomas starts talking about how Kaden's hot abs lead right down to his hot cock and Thomas says he's ready to taste that hot cock. Kaden sheds the rest of his clothes and gives Thomas access. Thomas wastes no time moving in and taking Kaden's cock in his mouth. I return from baking just in time to get some good shots of all the hot action as it starts to unfold. Perfect timing. While Thomas services his cock, Kaden feels all over Thomas' muscled back and admires the beauty. Thomas really goes to town on Kaden's rock hard cock, worshipping it like a true straight guy who has been starved for dick all his life.<br /><br />The First Kiss ...<br />As Thomas makes love to Kaden's cock, he slowly moves up his chest, rubbing and worshipping his body and chest, licking his nipples, squeezing his pecs, licking his neck and then it happens. That first kiss. Long, deep and sensual. This is where that feeling enters your gut. The one that tells you this one is going to be a winner. You also feel feelings in other places if you're like me. Thomas moves slowly back down to the task at hand and finishes enjoying the taste of true perfection as he continues his oral caress of Kaden's cock. If I were an old romantic I might get misty eyed and claim there's a love affair in the making here. But being the animalistic beast that I am, I just assure myself that this will be one hot fuck.<br /><br />Kaden Tames The Monster ...<br />Kaden helps Thomas strip the rest of his clothes and out flops that hard monster just bouncing in Kaden's face. Kaden wastes no time getting his hands and lips wrapped around it and Thomas is in for the ride of his life as Kaden returns the favor with just as much passion and poise. There isn't many things you can watch in this life that are as mystifying as a hot, masculine man enjoying the hard tool of another hot, muscled stud. And watching Kaden make love to Thomas' monster is a sight to behold. He uses mastery and skill and the two of them continue rubbing and admiring each others hot bodies. Thomas gets into his trademark dirty talk and talks shit to his cocksucker and Kaden responds with moans. By now, I'm lost in the moment and that feeling in my stomach keeps getting deeper and more present. All the while, Kaden strokes his own hard cock. I get some great underneath shots of Thoams fucking Kaden's sweet mouth. He's tamed this monster. They switch positions and Thomas makes love to Kaden's cock again.<br /><br />The Second Kiss ...<br />Thomas works his way back up Kaden's body and they embrace for a second kiss, all the while Thomas is stroking Kaden's hard cock again. The tongues are dancing and in my head the music is playing. Wonder what was going through their minds?<br /><br />The Third Kiss ...<br />'Man that felt good' must have been what was going through their heads because they go for a third passionate kiss. Kaden goes back down on Thomas for a bit and then gives him his trademark tongue bath as he licks and tastes every inch of Thomas' torso. Passion is all in the air as these two studs make love, not war.<br /><br />Kaden's Ready To Try It ...<br />All this passion and heat has brought them to that point where it's now or never. Thomas asks Kaden if he's ready to give it a try and Kaden whispers 'yes'. Thomas says 'Show me that ass' and Kaden does his trademark slow grinding tease that we saw in The Porthole. He's teasing Thomas with that pretty round bubble butt and showing it off. Thomas and his cock are both responding well. Both of them are teasing one another. Kaden with his ass and Thomas with his cock. Thomas is stroking his hard massive meat as he rubs Kaden's ass in anticipation. Kaden arches his back to show off a perfect bubble butt. Thomas reaches under and strokes and plays with Kaden's hard cock. If Kaden aint ready now, he'll never be. The heat is so intense you'd have thought the room would have melted by now.<br /><br />Kaden Says Go For It ...<br />And from there we watch Thomas' massive cock squeeze it's way into Kaden's tight hole slowly, slowly and then it disappears and for the next few minutes we watch that huge cock plow Kaden's tight ass six ways to Sunday. And this isn't some pussy fuck. This is a real man with a real huge cock fucking another real man who is taking it like a true champ. This is a passionate fuck between two men. It doesn't get any better than this. Thomas takes on the dominate role he's so good at and Kaden gives in to the good feeling and together they fuck like rabbits, each in total control yet wild abandon. They're lost in the fuck and you can tell. Me and the camera are just along for the ride. This is their show. Their time to shine. That feeling in my stomach rumbles and I am numb.<br /><br />Several Minutes Of Pure Bliss ...<br />From the time Thomas buries his cock in Kaden for the first time until they both cum, we are treated to one hell of a fuckfest between two chisled Gods who seem to love every second of it. Thomas starts out slow fucking then turns dominate and starts in talking shit, they go from fast to slow, to passionate, back to fast, deep, hard, pounding exstacy. This has got to be the hottest, horniest moments of either of their lives. I know it was mine. I was speechless and all I could do was capture it. They go from kinky moments of dirty talk and ass slapping to slow and passionate lovemaking. I am still in awe even as I watch it again and write this. Words fail me on how great this scene is. Kaden tells Thomas to put him on his back and fuck his ass. Thomas agrees and Kaden gets on his back with his hard cock in his hand as he strokes it hard while Thomas re-enters him and fucks him fast and hard. Kaden strokes his cock and slaps it on Thomas' stomach as Thomas plows him deeper.<br /><br />Let The Cum Fly ...<br />Thomas literally fucks the cum out of Kaden as he pounds him deeper and deeper talking shit to Kaden all the while who is presently lost in the moment. Kaden blows his load all over himself as Thomas eggs him on. A huge cumshot lands all over Kaden's stomach and he's soaked. He tells Thomas he wants him to cum all over him and Thomas pulls out and obliges with a drenching outpour of pure manjuice, spraying Kaden's chest like a gargen hose. The porn gods are watching in admiration as this scene comes to a close. Heaven.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2009-01-04",
  "scene_id": 70441,
  "series": "Battle Cry",
  "tags": [
    "Gay"
  ],
  "title": "Kaden & Thomas"
}