{
  "collections": [
    "Active Duty"
  ],
  "description": "Scene 2: DJ And David Meet Payne And Thomas ...We've all met David on the Active Duty LIVE Shows with DJ. These two hot ex marines are roomates and have been close friends for a few years now. It's my theory that they are secretly in love, but don't tell them I told you that. We've enjoyed many hot duo shows of these two on AD LIVE and now they're here together for the first time. David is as sweet and beautiful in person as he is on webcam. Imagine my delight as I'd only seen him on webcam before he and DJ made this trip out. I decided that a hot pairing would be Thomas and Payne. Payne has come a long way fast here at Active Duty and I wanted to throw him in the mix with DJ and David to see just how much they could make him shine. Thomas takes a backseat in this scene, but that's OK. What he did in the first scene pays his dues for awhile. We shot both of these scenes the same weekend so I didn't get too upset that he stayed behind the shadows while David, and DJ take on Payne and bring him further along.Loosening Up ...The boys and I chit-chat for a bit and I leave to do the rest of that laundry that I still hadn't finished the day before. The pies are in the oven and hot sex is on the way. All the cocks get hard and suddenly spring out of their zippers. David is more than pleased with his company as he kicks back and just watches the boys play with their hard cocks as his own hard cock rests against his stomach. You can tell he's happy with what's on the menu tonight. Things kick off with David going down on Thomas' huge cock first, taking it on for size and handling it like a champ. He doesn't intend to miss a cock tonight and he quickly turns his attention to Payne's hard uncut beauty to give it some attention as well. To watch David make love to such an uncut jewel is a true thing of beauty. DJ strokes his own hard cock and watches the show. I think the boys are comfortable now.Making The Rounds ...All the guys get their fair share of cock-tasting as they try each other out. DJ moves in on Payne while David goes back for some more of Thomas' meat. Payne watches the cocks and decides which one he'll suck first. At this point, David is oozing pre-cum and Payne grabs his cock and goes down to take a taste. He's licking and sucking and tasting the pre-cum as DJ sucks him and David sucks Thomas. A nice daisy chain of cocksucking is going on as these four enjoy some oral expertise. Things switch up and Payne gets him some of DJ's cock while Thomas takes a taste of David.The Kisses ...Payne and DJ embrace in a hot, slow and passionate kiss as they stroke their cocks. DJ heads south for another taste of Payne's uncut wonder and Thomas keeps sucking David. Everyone is into the moment as all the cocks are serviced. They switch teams and Payne and Thomas pair up while DJ and David embrace in another kiss. You can tell these two have chemistry and passion for one another. Payne joins DJ eventually to share in the wonder of David's impressive meat. Payne and David go for a kiss of their own as DJ services David's cock. Payne leans over and grabs onto Thomas' hard cock again and takes it for another round. Thomas is hard and ready.The Ass Eating ...David finds himself behind Payne while Payne has his hot ass in the air and Thomas' cock in his mouth. David really gets into this straight boys virgin pink hole as he licks it, sucks it, spreads it and shows off the pink as he slaps it with his two fingers and teases it. Wonder what was going through Payne's head right about now? David can't resist and starts fingering the tight virgin pucker as he asks Payne how it feels who responds with a sweet, low, 'it feels good.' By this time, DJ is feeding his cock to Thomas who is keeping Payne's mouth busy while David does the honors at the backdoor. A circle of hot sex is happening as we watch.David Rides Payne's Uncut Cock ...David is ready for the main course and hops on top of Payne's hard cock to take it for a ride. Payne is hard and ready and David sits right down on it. DJ comes to the rescue and puts David's hard bouncing cock in his mouth as David rides Payne's dick. This is one hot thing to watch as DJ deepthroats David's cock while David takes Payne's cock deep in his hungry hole. You'd have thought David found a coin operated horsie outside the five and dime with a pocket full of quarters as he bounces on the uncut gem like he's going to ride it all the way into some cowboy movie and play hero as he saves the day.Bring On The Competition ...David and DJ are very competitive when it comes to men. They can't stand for one to have more fun than the other and when DJ sees that David is enjoying himself maybe a little too much, he tells David to let him get some of that cock. DJ positions himself doggie-style and gives Payne the reins. Payne dives in and plows him deep as David feeds DJ his hard cock. DJ is right where he prefers to be and these two are giving him something he'll remember. Payne finally puts DJ on his back so he can jack off as he watches Payne's cock plow his ass deep. David tries to be sneaky and goes behind Payne and tries to bury his cock in the virgin hole. Payne isn't quite ready for that yet and if he is, he has business of his own at hand as he fucks the hell out of DJ's hot ass. When he sees that option isn't open, David heads around and positions himself over DJ's face and jerks his hard cock fast and furious. Somebody's bound to cum and it won't be long.Drenching DJ ...It all starts with David's hot load as he shoots it all over DJ's chest as DJ jerks himself harder and faster but Payne beats him to the draw. Payne pulls out and lands his own huge load all over DJ's chest as it mixes in with David's load and makes a puddle in DJ's adam's apple. Payne tells DJ to get in a more comfortable position to blow his own load and as soon as DJ sits up, he's spraying a huge load all over himself and Payne and David urge him on. He's covered in hot, juicy thick cum and it's a wrap. Rewind and let's do it all over again.",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "David",
      "person_id": 35073
    },
    {
      "name": "Payne",
      "person_id": 35125
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2009-01-04",
  "scene_id": 70442,
  "series": "Battle Cry",
  "tags": [
    "Gay"
  ],
  "title": "David, DJ, Payne & Thomas"
}