{
  "collections": [
    "Active Duty"
  ],
  "description": "The second scene from Double Time 3 features Dorian and Elijah getting into some hot and heavy mansex. Talk about chemistry. These two are so hungry for one another. I always like to keep Elijah away from the action just long enough that he's about to explode when he arrives on the AD scene. I timed it just right and he and Dorian hit it off so well in their scene from Double Time 3 that they can't hide how hot they are for one another.Things kick off with these two horseplaying in the pool, doing cartwheels and cannon balls and wrestling around a bit. I set the camera up in the pool house and left them be. Didn't take long before they were walking past the camera to get to the shower. In the shower they start exploring each other's hot bods and the kissing and foreplay begin almost immediately. Elijah asks Dorian if he went to the gym today as Dorian's thick muscles gleam in the streaming water. Elijah starts feeling those tight muscles up right away and in no time flat he's concentrating on the muscle he wants most -- that gorgeous cock of Dorian's.While Elijah plays with Dorian's cock in the shower his tongue moves down to worship those hot, muscled pecs that Dorian works so hard for at the gym. Both cocks are hard by now as Elijah washes Dorian's back and plays with his ass. That muscled ass seems to have Elijah just as mesmerized as it does the rest of us. Dorian turns around to help Elijah clean up and they embrace in a hot tongue-to-tongue kiss that sets the screen on fire as they rub and feel on one another's hot, muscled and inked up bods. One more kiss for good measure and Elijah turns around to tease Dorian's cock with his tight little ass. Dorian is loving it and so is Elijah. Elijah arches his back and pushes his bubble butt up against Dorian's hard cock, teasing him with what's to come. Five kisses in and the passion is steaming up the camera.I ask Elijah what he thinks about Dorian and he says 'That dude is built like a brick shithouse.' I agree. Dorian dries off and joins Elijah and these two get right down to business. Two seconds after Dorian lays down beside Elijah, Elijah shows how hungry is by getting right up on his hands and knees as he takes Dorian's cock in his mouth like a pro. You can tell he's been waiting for this since he first laid eyes on Dorian. Dorian wastes no time either as he reaches under and grabs Eli's hard cock and strokes him while Eli services him. They soon switch places and Dorian is worshiping Eli's hard cock as Elijah reaches down and jerks Dorian's dick. They soon find their way to a hot sixty-nine as both guys get their fair share of cocksucking in. Elijah raises Dorian's legs so he can eat that hot hole for awhile as Dorian keeps the pace on Eli's cock. By now they're tonguing each other's holes deep and hard. Elijah and Dorian decide it's time for someone to get fucked and Dorian is up first. Elijah flips him over in the doggy-style position and eats his ass some more as he begins lubing that fine ass up for a fucking. Dorian strokes his own hard cock as Eli fingers and lubes his ass. The camera angles are superb if I must say so myself.Elijah is determined to tease Dorian's ass until he can't stand it any longer. Dorian tells Elijah, 'Quit licking my ass and fuck it.' To find out what happens next, check out the scene. I've only covered the first half of the scene here for you, the rest you'll have to watch on your own. There's a hell of a lot more to see so go get started!",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Elijah",
      "person_id": 35081
    }
  ],
  "release_date": "2009-03-15",
  "scene_id": 70446,
  "series": "Double Time 3",
  "tags": [
    "Gay"
  ],
  "title": "Dorian & Elijah"
}