{
  "collections": [
    "Active Duty"
  ],
  "description": "Quinn was the perfect fit for Jack and Dane and these three get it on in more positions than a secret ops unit. They are just perfect together. Dane and Quinn are big guys - both nearly 6' 4' tall. Put them next to little Jack who is at least a foot shorter and you've got the perfect manwich.Quinn is a character. He's your usual baby face Marine with lots of tats and a good-natured attitude. He and I hit it off the very first time we met and I knew then that Quinn would become a regular around Active Duty. Personally I think he's hot as all hell and that beautiful long, defined nose and those gorgeous eyes are enough to send me into la la land.As things get started, Quinn's getting an eyeful and Dane is the first to go down on Quinn as Jack directs the action. Quinn isn't shy and reaches underneath and grabs Dane's cock as he reaches over to jerk Jack's dick. He's got both hands full as Jack and Dane share his cock back and forth. Doesn't take long for Quinn's cock to stand at full attention in this formation. Jack quickly moves up to test the waters and puts his cock in Quinn's face and Quinn readily takes it in his hot mouth and shows it some respect.Quinn seems to be a natural at sucking cock and handles Jack's big meat with ease. Soon, both Jack and Dane are feeding Quinn their cocks and he's handling the new experience just fine.Jack moves in and puts his cock next to Quinn's and Dane services them both together, sucking both cocks at the same time. Jack is full of ideas too and he has Dane and Quinn lay on the bed so their cocks are together and he sucks them both together as well. Talk about knowing how to manipulate the action, Jack is doing just that as he feeds on the two nice cocks. Quinn is pullin' his weight in the mix of things too as he reaches over and jerks Dane's cock when Jack isn't paying it any attention. Jack positions himself over Dane so Dane can suck his cock while Jack services Dane and Quinn.Dane is the first to get fucked as he throws his ass in the air for Jack to fuck. Quinn finds his way beneath Dane where he can suck and worship his cock while Dane sucks and worships his. By this time, Jack is balls deep inside Dane's tight ass and these three have forgotten all about the camera. They flip Dane over on his back so Quinn can fuck his face and Jack can suck his dick while he fucks his ass. Jack is so short that he can manage going down on Dane while he fucks the hell out of his ass. Quinn moves in and shares Dane's cock with Jack.Jack hops on top of Dane's cock and rides it next, burying that cock deep in his hole as Quinn feeds Dane is cock. Jack gets hungry so Quinn moves up and feeds him some cock too.Things switch up and Jack lays on his back to take Dane's cock while he feeds on Quinn's cock more. Soon, Quinn takes the reins and starts fucking Jack's hot hole while Jack gets his mouth fucked by Dane. Soon, Dane can't hold back and he's blowing his huge load all over Jack's face and mouth and Jack just loves it. Quinn pulls out and blows a huge load all over Jack's stomach and Jack is covered in hot jizz.",
  "models": [
    {
      "name": "Quinn",
      "person_id": 35129
    },
    {
      "name": "Dane",
      "person_id": 35189
    },
    {
      "name": "Jack",
      "person_id": 35254
    }
  ],
  "release_date": "2009-08-29",
  "scene_id": 70449,
  "series": "Pullin Rank 2",
  "tags": [
    "Anal Sex",
    "Brunette",
    "Gay",
    "Threesome"
  ],
  "title": "Dane, Jack & Quinn"
}