{
  "collections": [
    "Active Duty"
  ],
  "description": "Things kick off with us all bullshitting back and forth and I give Diego shit saying he'd requested the 18 inch dildo for this scene. I pull it out and throw it on the bed and they pass it around like a hot potato. We get in some really good laughs and Fox says he's a little nervous. I say I'm not sure he's that nervous and Diego says, 'I think he's just trying to sell it.' Once everyone is loosened up and comfortable I head for the kitchen to put a pie in the oven and leave Fox in the capable hands of Austin and Diego.<br /><br />No sooner than I've left the room, Austin orders Fox to lose his pants. Then he orders him to remove Diego's and then Diego orders him to remove Austin's pants. I come back in just in time to make sure Austin goes down on Fox and gives him the total welcoming package. Austin is quick to oblige and gets down on Fox's hard cock quickly as Diego strokes his own hard cock and watches the action intently. Won't be long before he's jealous but I save the day and get fox to jerk Diego's cock while Diego reaches over and grabs Austin's head and pushes it down on Fox's cock. <br /><br />It isn't long before things start moving pretty fast and by this time Fox is almost balls deep in the action as he sucks Austin's cock while Diego sucks his. Diego is hungry today as he really gets into sucking Fox's cock like it might be the last one he ever touches. Fox does a damn good job of handling Austin's cock while his is getting plenty of attention. Diego strokes his own hard cock as he sucks Fox and Fox is really starting to enjoy sucking his first dick as he services Austin. Things switch up again and it's Diego standing over Fox now getting his cock worshipped while Austin goes down on Fox. <br /><br />This is where things get very interesting. For a first timer Fox is pulling out all the stops and gets behind Diego and starts eating his ass like it might be the last supper. He's tonguing it like a fucking pro and Austin gets behind him and tongues his ass. Diego turns around and kisses Fox's lips that have just eaten his hot ass and Fox starts tongue fucking Diego's hole from there. Meanwhile Austin is licking and fingering the Foxhole and he's got two fingers in it already. Fox is taking just fine to his new experiences and hanging right in there with the veterans. Austin is shoving two fingers in and out of Fox's hole and jerking his cock at the same time while Fox eats and fingers Diego's hole. <br /><br />Austin saddles up and goes in for an exploratory inspection of the Foxhole as they bend Fox over and ready him for the fuck. Diego feeds him his cock to take his attention off the pain and it seems to work like a charm (mostly) but Fox's facial expressions are telling us just what he's feeling. Austin is doing a fine job of opening the newbie up and Diego is stuffing his cock down his throat all the way to the pubes, choking him from one end while Austin plugs him from the other. I ask Fox how it feels and he says it actually feels pretty good. 'Hurts so good' is what he says. Austin switches places with Austin and Diego begins banging his hole fast and deep while Fox stays occupied with Austin's cock in his throat. This is so hot to watch as Fox chokes himself with Austin's long cock, brining tears to his eyes as Diego pounds his fuckhole. Together Diego and Austin are working him over like a part time job and Fox seems to be really into the moment and follows orders like any good Marine would. This boy is hungry and we're getting him fed good today. <br /><br />Austin has fucked Fox's face and worked himself into a tizzy. He's about to blow and Fox agrees to take the jizz in his mouth and Austin obliges by shooting a hot stream of cum into his hungry mouth. Austin takes it a bit further by turning around and bending over and telling Fox to put that cum in his ass and Fox does as he's told and takes the cum from his tongue and licks Austin's ass, smearing it all over his hole. Austin says he has something to do and leaves Fox in the capable hands of Diego who tells him to turn around and take his load in his mouth and of course Fox follows orders and does as he told. Diego strokes his hot load out into Fox's hungry mouth and Fox takes every last drop then licks what he missed off his hand and lets it run down his chin. Fox wants his revenge and Diego agrees to let him get it by fucking his tight ass. Diego bends over the bed and gives Fox access. <br /><br />Fox proves to be quite the top in addition to being the dream slutty bottom. He bends Diego over and rails his ass a new one. I mean he's really fucking pounding Diego and I think this was exactly what the doctor ordered for Diego as he takes the pounding and enjoys the hell out of it. Once Fox is ready to blow, Diego turns around to return the favor of taking his load as Fox shoots his load all in Diego's mouth and all over everywhere else. There's a wad on Diego's shoulder and Fox wipes it up with his finger and feeds it to Diego. ",
  "models": [
    {
      "name": "Austin",
      "person_id": 35036
    },
    {
      "name": "Diego",
      "person_id": 35077
    },
    {
      "name": "Fox",
      "person_id": 35083
    }
  ],
  "release_date": "2010-05-13",
  "scene_id": 70455,
  "series": "Deep in the Foxhole",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Facial",
    "Gay",
    "Rimming",
    "Tattoos",
    "Threesome"
  ],
  "title": "Austin, Diego & Fox"
}