{
  "collections": [
    "Active Duty"
  ],
  "description": "The scene came together after Jake called me a while back -- after he did his first solo with us -- and said he'd been doing some thinking about things and decided he'd like to try more. I asked what he'd like to try and he said 'Well, I'd like to get my dick sucked again and I might be willing to fuck someone in the ass.' Well, it took me all of two seconds to say, 'When?' And with that came the quick reply, 'Tonight?'I knew I had to have someone that would take that huge cock of Jake's and love every second of having it up their ass and I was in luck because DJ was visiting that weekend. We all know that DJ has been showing us what a great fucking top he is, but according to him (and his early days with AD) he really prefers to bottom for a big cock. Well, with the cock hung on Jake, I knew DJ would be in heaven. I showed DJ some of Jake's photos and DJ was more than willing to give the hung straight boy a place to park that Chrysler sized cock of his.Things kick off with these two relaxing on the bed watching a porn. They chit-chat back and forth and it's Jake that breaks the ice first with, 'I hear you like to suck cock.' Jake isn't wasting any time getting right to the point. You can tell this straight boy is ready to get things moving. After all, he wants his cock sucked. From there they tangle in several positions, with DJ sucking the huge cock and Jake jerking on DJ's fine meat. Watch closely as Jake and DJ embrace for Jake's first kiss on another mans lips. Yes, our straight hero does some hot kissing in this scene, too. And he really gets into stroking DJ's cock. He even gets up on his hands and knees and concentrates all his efforts on DJ's dick, giving him a nice, long hand job as DJ kicks back and enjoys it. What comes next will blow your mind.Troops, strap on your Kevlar's, double-lace your boots and hang on tight for one wild ride as we watch Jake unleash the power of a hardcore fucking all over DJ's willing ass. Talk about fucking like a jack-rabbit. Maybe it was the fact that he was horny as fuck or maybe it's just the way he always fucks, but once he gets that huge monster in DJ's ass, Katie bar the door. He goes at it like it's the first and last time he might ever get a chance to bang someone's brains out. I don't know when I've seen a guy fuck someone like this before and I'm not sure when someone has enjoyed the hell out of it like DJ is obviously enjoying this.One thing I noticed while filming this scene was Jake's obvious concern that DJ get his nut while Jake was inside of him. Jake wanted to make DJ cum, but he wanted to cum himself so he just took his time toward the end, allowing DJ to get off first before he blew his own load. And what a huge fucking load he blew -- hitting DJ in the chin with it and as it ran down DJ's face, Jake moved in and kissed him. If this scene doesn't blow your mind, I'll hang up my camera and call it quits.",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Jake II",
      "person_id": 35239
    }
  ],
  "release_date": "2010-03-12",
  "scene_id": 70454,
  "tags": [
    "Anal Sex",
    "Duo",
    "First Time",
    "Gay",
    "Kissing"
  ],
  "title": "DJ & Jake"
}