{
  "collections": [
    "Active Duty"
  ],
  "description": "I teamed up Brian, Kasey, Randy and Damien for a really, really hot foursome that brings with it some exceptionally hot sucking and fucking.<br /><br />Their scene kicks off with Brian on the bed showing off that gorgeous smile spread across his face and his hard cock in his hand. Kasey is eased up beside him with an equally big smile across his face and a nice hard on to boot. These two met the night before and Brian has admired Kasey's hot body up until now. Brian is looking his best too, though, and has no reason to feel like a slouch. He's hot as fire and things are about to get ignited.<br /><br />Kasey is snugly fit between Brian and Randy and Kasey gives Randy a little shit about the gay-go-juice incident from Summer Recruits 2. The boys do their usual joking and laughing and all in good-natured fun. I tell them that I'm gonna leave them to figure out who's gonna do who and what's gonna get done. Randy doesn't waste anytime once I'm gone, he moves in close to Damien and starts rubbing his leg, slowly moving up to embrace in a hot kiss. So cute. Randy's huge cock is bouncing with each beat of his heart as Kasey and Brian follow his lead and embrace in their own hot kiss.<br /><br />All the cocks are rock hard and the action is underway. Kasey is the first to go down for a taste of cock as he takes Brian's nice hard dick in his mouth, aiming that perfect bubble butt in the air for all to admire. Bring your drool rags along with your cum rags for this one, troops. You'll be doing a lot of both I'm sure by the time Pullin' Rank 2 over.<br /><br />Damien can't seem to let go of Randy's huge cock as he strokes it while they kiss. You can tell Damien has other things on his mind. Damien can't resist the temptation and finds his way down to the monster and takes it in his mouth. Damien and Kasey are taking good care of their partners as they service their cocks with expert attention to detail. Already this soon in the game and Randy looks like he could blow his load anytime, but there's a lot of ground to cover in Pullin' Rank 2 so he edges himself and waits.<br /><br />Randy decides to get a little rowdy and starts face fucking Damien who is taking the huge cock down his throat like a champ. He pushes Damien's head down further and further, making Damien gag on his cock. Meanwhile Kasey moves up to get his cock wet in Brian's mouth as he reaches back and strokes Brian's hard cock. All the throat fucking that Randy has been dishing to Damien must have gotten Damien really wet and horny as hell. Damien positions himself to take Randy's cock and Randy moves in behind him to fill his hole full of his huge meat. Randy slides the huge cock deep in Damien's ass and it's off to the races. He's fucking Damien fast and hard and if you're a betting man, I'd place my money on Randy fucking the daylights out him and Damien taking like the good bottom he is. Randy stands up on the bed and does his famous 'donkey' as he drills down into Damien's hungry hole. He's banging Damien's brains out and Damien is loving every second of it. Meanwhile Kasey and Brian are fucking Damien's face while he gets his ass plowed. Randy asks Damien if he's ready for the next dick and Damien says, 'hell yeah, where's it at?' Brian comes in and takes the reigns from Randy and keeps the pace going on Damien's ass.<br /><br />They're in the groove now with Brian fucking Damien, Damien sucking Randy and Randy sucking Kasey. Then, Kasey gets his turn at Damien's ass while the rest of the boys link up mouths, hands and dicks.<br /><br />Kasey is the next to get fucked and Brian is doing the honors on his ass. Brian saddles up and moves in as he eases his hard cock slowly into Kasey's tight hole. Soon, Kasey has flipped over onto his back and a few short thrust later, he's cum onto his stomach. It's always awesome to see a guy shoot his load while getting fucked, and Kasey hasn't disappointed in that department lately!<br /><br />For the finale, it's Brian's turn to submit to, oh boy, Randy's beer can-thick cock. We're not sure if he knew what hit him, considering his pained wails. But he's a trooper, and continues to get plowed by Randy until the end. Soon, everyone has shot their load on Brian's chest (including a second one from Kasey!) and the boys call it a day. Whew! ",
  "models": [
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Randy",
      "person_id": 35130
    }
  ],
  "release_date": "2009-08-29",
  "scene_id": 70450,
  "series": "Pullin Rank 2",
  "tags": [
    "Big Dick",
    "Gay",
    "Smooth"
  ],
  "title": "Brian, Damien, Kasey & Randy"
}