{
  "collections": [
    "Active Duty"
  ],
  "description": "We open with Fox, DJ and Jack relaxing in the hot tub and chit-chatting. All the guys are playing with their cocks beneath the bubbles and it isn't long before you see nice hard ons peeking above the water. Things quickly turn into a 'show me yours, I'll show you mine' as they stand up and show off their hard cocks to one another. Fox takes a quick dive in the pool and then disappears into the pool house.Once he's in the pool house, Fox quickly starts stroking his cock and I ask him what he's thinking about and he is quick to point out that he's thinking about the big cocks hung on Jack and DJ and how he wants to suck them. He's hard as a rock and shows off his sweet little pink hole for us before I offer to go out and wrangle the other boys in. I bring in DJ first and 30 seconds after he walked into the pool house he's got his huge cock down Fox's hungry throat. Fox gives himself a nice throat-fucking with DJ's cock as he slams it down his throat gagging himself with the monster meat. You can tell this one really loves to choke on a dick and he does a fine job of it.Jack comes in to see what's going on and quickly finds himself with his dick shoved deep down Fox's throat. DJ moves down to help out Fox while fox gets a taste of another hot hard dick. It isn't long before Jack suggests they double fuck his face and they stand on each side of him and feed him their dicks, letting him choke on them like he seems to love to do. He chokes, gags and spits on the dicks as he takes them all the way down his throat, burying his face in their pubes and then repeating. It's clear this one loves to suck cock and by the way he's doing it, you'll never believe (like DJ and Jack) that this is his first time at bat.DJ and Jack decide to show Fox some special attention as they lay him down and take turns sucking his hard cock as he strokes them. They get in some really hot kisses and service his cock good as Fox serviced theirs. It's obvious where things are going and at least two things are going up Fox's hot little ass. But it's gotta be eaten out really good first and readied for the big cocks it's about to accommodate.DJ does the honors and positions himself behind Fox as Fox sucks Jack's cock. DJ spreads Fox's beautiful ass cheeks and dives in with his tongue. Fox starts his now famous ass shaking and literally tongue fucks himself with DJ's hot tongue up his ass. All the while Jack is fucking his face like there's no tomorrow and Fox is swallowing every last inch of Jack's huge dick while DJ keeps playing with his hot ass. The more this goes on, the more you can tell Fox is ready for a fucking. Just the way he moves that ass and sucks that cock in front of him tells the story. This boy is on fire. DJ spreads Fox's cheeks for the camera to show off the dilated fuck hole and Fox looks back at DJ and asks if he's ready to try it out. From there my friends you'll want to prepare yourself for one of the wildest threeways we've ever featured here at Active Duty. (We're talking wild. No man's load is safe! It's all about 'sharing' the love here.)",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Fox",
      "person_id": 35083
    },
    {
      "name": "Jack",
      "person_id": 35254
    }
  ],
  "release_date": "2010-05-13",
  "scene_id": 70457,
  "series": "Deep in the Foxhole",
  "tags": [
    "Big Dick",
    "Blonde",
    "Gay",
    "Threesome"
  ],
  "title": "DJ, Fox & Jack"
}