{
  "collections": [
    "Active Duty"
  ],
  "description": "I take Jake back to the bedroom for his initial check-up and give him some shit. He's playing with his cock as soon as the camera comes on. We shoot the shit about Jack's shoot with Chaz and Conner over at Maj. Wood's place. I tell Jack I think he and Chaz have something in common. They are both instigators. Jack just grins. I leave the room to go get Chaz and Domenic and Jack takes over like he's on a live show chatting with the camera and showing off that hot little body and that gorgeous cock of his. What a ham this guy is. I return with Domenic and Chaz and Jack looks like he's pleased.These three waste no time getting right down to business. Chaz is sucking on Domenic before you can say 'suck it, boy'. Jack is watching in anticipation. I think he likes his playmates just fine. Domenic reaches over and starts stroking Jack's cock while Chaz sucks his. Jack stands right up at the invitation of contact and puts his big hard cock in Domenic's mouth. These three are going at it like hungry pups on tits and it's hot to watch them feed. Chaz comes up and they share Domenic's hot mouth together with Domenic playing musical cocks. Jack gets hungry and moves down to Domenic's cock to help him out while Domenic keeps servicing Chaz. Chaz positions himself over Domenic so he can fuck his face. Things get really heated as Jack gets really into sucking Domenic's big cock and Chaz fucks Dom's face. You can feel the heat in the room as these boys moan in pleasure. Jack and Chaz go down together on Domenic's cock and give it a nice tongue bath as they touch tongues and enjoy the cock.The kisses are many and passionate in this scene as these three really get into one another. Jack and Domenic lock in a kiss that is out of this world. Jack is licking and sucking on Domenic's neck while Chaz is sucking and licking on Domenic's cock and Domenic is going crazy with passion as these two show him what manlove is all about. Licking and sucking ever inch of his gorgeous body. Chaz and Jack switch places and Chaz goes in for a kiss. Jack goes back to fucking Domenic's face and it's three's company. Domenic seems to love having his face fucked with a huge cock. Jack gets in the middle and Domenic services his cock while Chaz and Jack engage in another hot kiss. Domenic goes for the nipples while Chaz takes over on the cock. Domenic moves up to Jack's face and gives him something to choke on while Chaz sucks Jack's meat. Chaz moves up and licks Jack's ear while his mouth is full of cock. They go for a kiss with Domenic's cock in the middle of their tongues. Careful here as you might pass out from all the passion. So much kissing goes on that it's hard to keep up.While Jack entertains himself with Domenic's cock, Chaz moves behind him and starts licking and eating that beautiful ass. Jack's hole is loving the action. Chaz is out to lunch and he's loving what's on the menu.In a surprise twist, Jack is behind Chaz about to bury his cock balls deep in that beautiful ass of his. Chaz assumes the position to give Jack good access. Jack buries his cock balls deep. Chaz grunts but takes it like the man he is and Jack is loving that hot ass shoved all the way down on his cock to the pubes. Domenic shoves his cock in Chaz's mouth to give him something to hum on. Jack is fucking Chaz like he'll never get another piece of fine ass again. These two are really into it as Chaz tells Jack to fuck him harder.The Hot Sandwich Fuck With Jack Fucking Chaz As Domenic Fucks Jack ...Jack looks at Domenic and tells him to come around and fuck him while he fucks Chaz. Domenic wastes no time making Jack the meat in the sandwich as he gets behind Jack and buries his cock in Jack while Jack continues to fuck Chaz. Jack almost bit off more than he could chew as he moans and grunts as Domenic buries his huge cock in that tight fucking hole. Jack is loving the pain. Jack is fucking Chaz and fucking himself with Domenic's cock as he pounds Chaz he fucks himself with each thrust. The three of them kiss each other together as the sandwich fuck reaches orgasmic heights. Domenic pulls out and blows his hot, huge load all over Jack's back as Jack keeps fucking Chaz's ass harder and deeper. Jack is the next to cum as he pulls out of Chaz's ass and dumps his huge load all over his back. Chaz looks up at Jack and says he's gonna flip over and cum as Jack and Domenic lay on either side of Chaz while Chaz strokes out his own fat load. The boys go for one last kiss and it's as passionate as the first. I joke with the boys a bit and tell Chaz his number is up. Go figure---his number was 69!",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Domenic",
      "person_id": 35080
    },
    {
      "name": "Jack",
      "person_id": 35254
    }
  ],
  "release_date": "2009-04-17",
  "scene_id": 70451,
  "series": "Battle Cry 3",
  "tags": [
    "Big Dick",
    "Blonde",
    "Gay",
    "Kissing",
    "Tattoos",
    "Threesome",
    "Twink"
  ],
  "title": "Chaz, Domenic & Jack"
}