{
  "collections": [
    "Active Duty"
  ],
  "description": "The first scene features Dorian, Shawn and Austin in a scorching threeway that I'm sure you're all going to love. Things kick off as usual with me chit-chatting with the guys and loosening up the air, giving them time to get comfortable and ready. The shirts come off and man what a sexy trio these guys make. I have to warn Dorian and Austin that the only place Shawn isn't little down below and to get ready for what's to come.Austin, being the horny devil dog that he is, kicks things off by rubbing on Shawn's leg and going in for a hot kiss. Dorian watches as he plays with his own cock through his shorts and Shawn is quick to reach over and offer his assistance. Three minutes in and the shorts and pants are already coming off. It won't be long before these three are in an Alpha Male Tango (yes, yes, I keep pushing it - loll). Austin is all about the little guy in the middle as he gives plenty of attention to Shawn.Shawn doesn't want Dorian to feel left out so he gives him some undivided attention as he kisses Dorian and sucks on his nipples. Austin watches and strokes while he keeps his eye on the prize inside of Shawn's boxers. Austin finally gets his hands around Shawn's hard cock and suggests that Shawn do the same for Dorian. Austin continues his exploration of Shawn from head to nearly toe and seems to be enjoying every minute of the trip. Somehow you know he's going to be the first one with a cock in his mouth and you'd be right. He positions himself between Shawn's legs and do down on that cock, worshipping and sucking it ever-so-gently. Shawn plays with Dorian's hard dick and Austin soon moves over to give it some attention too.Dorian and Austin take turns on Shawn's big cock, giving it the attention it deserves during such a hard exercise. Dorian takes the head and shaft while Austin mans the balls and taint and plays with Shawn's tight hole. Dorian positions himself on his knees, giving Shawn complete access to his throbbing hard dick and Shawn doesn't shy away from the task at hand while Austin works Shawn's cock in the meantime. Soon, Shawn gives Dorian's cock off to Austin who gets right down to business as Shawn plays with Austin's ass and cock. All this attention has Austin sucking Dorian's cock like a true champ. Shawn strokes his hard cock and waits on his turn. Austin turns his attention back to Shawn and works that cock like a part time job. Seems Dorian and Shawn have turned this devil dog into their own private bitch boy.Dorian stands up against the wall, showing off that damn near perfectly ripped body of his and Shawn moves in for that hot throbbing cock once more, giving it a good work over. By this time Austin is back down between Shawn's legs licking and sucking his cock and washing his nuts. He's got Shawn's balls cupped in his hand while he works over the entire unit.Austin is getting impatient and you can tell he wants a cock in his hole. He turns around and rubs his ass against Shawn's hard cock, giving the signal that he's ready to be plowed. But Shawn wants a little more oral action before taking the plunge so Dorian and Austin position him standing up so he can get what he wants first. Soon, that horny Austin finds himself behind Shawn eating his hot hole while Sean works Dorian's cock a little more.Things take a twist as Austin is eating Shawn's hot ass he tells Dorian he should come back there and fuck that hot ass and Dorian thanks him for getting it all warmed up for him. Dorian takes his position behind Shawn and goes in deep, fucking his fast and hard in no time flat while Austin feeds Shawn his hard cock. Dorian is deep in the valley by now and Shawn is moaning his head off as Dorian deep dicks his tight ass. Austin keeps Shawn's mouth full while Dorian fills his ass. Austin finds his way down beneath Shawn's ass as Dorian plows from above and sucks Shawn while Dorian dicks him deeper.Shawn's ready for a different dick in his ass so he decides to ride Austin's cock while Austin sucks Dorian's dick. As we've come to know, Shawn is quite the acrobat and he shows off his skills once more while he's riding Austin's dick and jerking his own.",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Austin",
      "person_id": 35036
    },
    {
      "name": "Shawn",
      "person_id": 35230
    }
  ],
  "release_date": "2010-04-18",
  "scene_id": 70452,
  "series": "Alpha Tango",
  "tags": [
    "Gay"
  ],
  "title": "Austin, Dorian & Shawn"
}