{
  "collections": [
    "Active Duty"
  ],
  "description": "Ethan personally requested to work with Damien and I made his wish come true. Jack joins them and things get so hot you'll need to be sure you're A/C is cranking before you watch it.I had the guys helping clean up our warehouse where we store all our DVDs and I should have known it was a very good idea if I wanted to get the boys in the mood, but not a good idea if I actually wanted the warehouse organized. Needless to say, the warehouse remains a mess, but it was well worth the final results. Jack and Damien are sweeping up when Jack comes across an Amateur Straight Guys DVD called 'Dude, Suck My Dick'. He reads the title aloud to Damien and he snickers. Jack takes a more serious tone and tells Damien, 'Seriously, dude, suck my dick'. They move over to the couch and Jack hauls out that huge cock of his and Damien gets down to business. Meanwhile I go into Cole's office where Ethan is supposed to be packaging movies but he's found another package to play with instead. He's sitting there watching a scene from Deep in the Foxhole and stroking that big, beautiful cock of his. And what a nice piece of meat it is. Ethan is so cute and so comfortable with himself that you just want to eat him up. He's got the hots for Damien's little ass and says he's ready to join them in the warehouse.As soon as he arrives on the scene, he puts his hard cock right in Jack's hot mouth while Damien is down between Jack's legs working on his huge meat. Jack is deep-throating Ethan's nice cock in no time flat and licking and sucking those beautiful balls. Ethan has some fun fucking Jack's face as he watches Damien work Jack's nice cock. Ethan strips off all his clothes and fucks Jack's mouth hard and fast. Things switch up and Ethan goes down to share Jack's cock with Damien. Together they've got all the bases covered as they lick and suck his cock and balls. Ethan is swallowing Jack's cock and returning the deep throat favor as he strips Damien's clothes off to get at his cock. Jack goes back to taking Ethan's cock all the day down his hungry throat and boy does he ever master the art.Ethan can't resist the urge any longer and gets down behind Damien to eat his hole and get it nice and lubed up, using the three finger method to open him up nicely. All the while Ethan's hard cock is bouncing up and down in anticipation of getting inside Damien's fuck hole. They position Damien on the couch so he can suck Jack's cock while Ethan fucks his ass. Ethan saddles up for the ride and goes in deep as Damien takes it good. Meanwhile Jack chokes Damien with his dick as Ethan plows him from behind. Damien is in his favorite position, being used and abused by two hot guys, one fucking his face and one devouring his ass. Ethan is getting what he asked for and everyone is happy. But this is just half of everything that happens in this hot scene so it yourself to see how it unfolds.",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Ethan",
      "person_id": 35211
    },
    {
      "name": "Jack",
      "person_id": 35254
    }
  ],
  "release_date": "2010-07-23",
  "scene_id": 70460,
  "series": "Firewatch",
  "tags": [
    "Anal Sex",
    "Gay",
    "Smooth",
    "Threesome"
  ],
  "title": "Damien, Ethan & Jack"
}