{
  "collections": [
    "Active Duty"
  ],
  "description": "The third time is a charm as they say and this was Zander's third time up to the plate. I start out talking with Zander and about what's about to happen and he lets it be known that he's 50/50 nervous and excited. That's always a great combination for a newbie who's about to try something new. I introduce Zander to Shawn and Cash and from there it's on. I leave the guys alone while I go bake a pie and leave them to their own devices. Once I'm gone Shawn and Cash jump right in and start peeling Zander's jeans off him to reveal a super hard cock that he's already gotten. Shawn wastes no time at all and dives on it, sucking it and stroking it as Cash strokes his own cock and watches.The first kiss is always the sweetest and it's a sweet sight when Shawn locks lips with Zander in his first kiss as Cash sucks Zander's cock and Shawn plays with his own. These guys aren't wasting any time and Zander's cock is rock hard from all the attention. He and Shawn kiss again and again and then they have a better idea. They want to see how far they can get this newbie to go so they decide it's time that Zander to suck some cock. Cash decides he'll break in the virgin mouth and gets himself in position for Zander to taste his cock. All the while Shawn is working on Zander's hard cock and things are going fast and furious.A daisy chain-of-command forms between the three as Zander sucks Cash, Cash sucks Shawn and Shawn sucks Zander. The hormones are raging and the cocks are all at full attention as the hot mouths explore. Zander and Shawn switch up a bit and Zander goes in to suck more of Shawn's cock while Cash keeps the pace on Zander.Zander takes things another level and heats up the room as he gets behind Shawn to eat his first ass. Shawn's ass is in the air and Zander's tongue is right in there, getting it all lathered up as he tongues Shawn's hole, doing a mighty fine damn job for a newbie. Watching Zander eat ass is an amazing moment that would put anyone over the edge. Zander is having himself plenty of fun licking, sucking and fingering Shawn's hole as Shawn sucks Cash.Once he's gotten Shawn's ass wet and ready, Zander saddles up for the ride. He shoves his big cock up Shawn's ass and fucks it deep and hard. Shawn is keeping his throat busy with Cash's hard cock as Zander bangs his brains out from behind. Zander isn't showing any mercy on that ass and Shawn is slapping Cash's cock on his mouth and tongue like a bitch in heat as Zander fills his ass with Zander's hot straight boy cock.Things take a turn and Shawn is ready to fuck some ass himself and Cash is willing to give him one to fuck. Shawn hits his stride as Cash feeds hungrily on his cock. Then Cash decides to ride the big dick as he strokes his hard cock and blows his load. Shawn follows quickly behind and lands his load right in with Cash's and Zander brings up the rear and delivers an amazing load, drenching Shawn in his hot man juices and it's a wrap, troops!",
  "models": [
    {
      "name": "Cash",
      "person_id": 35024
    },
    {
      "name": "Zander",
      "person_id": 35166
    },
    {
      "name": "Shawn",
      "person_id": 35230
    }
  ],
  "release_date": "2010-01-25",
  "scene_id": 70462,
  "tags": [
    "Anal Sex",
    "Gay",
    "Tattoos",
    "Threesome"
  ],
  "title": "Cash, Shawn & Zander"
}