{
  "collections": [
    "Active Duty"
  ],
  "description": "The first scene from Direct Orders 2 features two of our hottest veterans Brian and Kaden along with a new recruit that has recently joined the ranks here at Active Duty. You remember Ransom right? That sexy devil with the gorgeous eyes and smile with the hot inked-up body that came to us through our buddy Jack. He and Jack did a hot oral scene that we featured over on Amateur Straight Guys some time back. Seems Jack and Dane have been stepping out on one another lately and that's good for us because it brings in the hotties like Ransom and gives us even more sexy studs to salivate over.I was busy in one room filming a scene when today's scene kinda came about. Thankfully Joe from My Straight Buddy was around and I asked him to film Kaden, Brian and Ransom while I finished up what I was working on. Joe did an excellent job capturing all the hot sex and Brian and Kaden put their experience to work on Ransom, showing him the ropes and taking him further than he's ever gone before. In no time at all, Ransom has both cocks in his mouth servicing them while Kaden and Brian enjoy some hot kisses. Ransom works on both hard cocks for quite awhile, getting plenty of experience and having a hard time deciding which cock he liked best. From the looks of it, he liked them equally.From there Ransom eats out Brian's ass while Brian services Kaden's cock. Doesn't take long before Ransom is saddling up to fuck Brian's tight ass. Brian moves back to the edge of the bed so Ransom can stand up and rail his ass harder. Kaden keeps Brian's mouth occupied with his hard dick and this threeway is on fire. The tables soon turn and Ransom's ass is in the air with Kaden's cock banging the hell out of it while Ransom gets face-fucked by Brian. Things take another turn but you'll have to see for yourself.",
  "models": [
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Ransom",
      "person_id": 35131
    }
  ],
  "release_date": "2010-08-08",
  "scene_id": 70463,
  "series": "Direct Orders 2",
  "tags": [
    "Gay"
  ],
  "title": "Brian, Kaden & Ransom"
}