{
  "collections": [
    "Active Duty"
  ],
  "description": "Austin is just a stunner. Such a tall drink of water (6'4'!) with a baby face pretty blue eyes. I knew that pairing him with Kaden was the right thing to do. These two compliment each other so well and the passion and chemistry is intense between them. They are so into each other and it melts right through the screen and comes to life.Things kick off with me talking to Austin on the couch with his shirt already off and that beautiful chest and those nice abs just popping out at you. You can tell how hungry he is and things are about to get really hot. I leave him alone with Kaden to see how things unfold and I'm sure you're gonna agree that they went very well. These two waste no time in getting down to business. As soon as I leave the room Austin takes one look at Kaden and moves in closer. They start exploring each others bodies and Austin seems more than pleased with his first partner. The tension builds quick and you can tell that Austin just wants to kiss Kaden right away.They start some really passionate kissing and begin their journey that'll lead them to some really hot sex. Austin has his hands down Kaden's shorts in no time at all and the kissing gets more intense. It isn't long at all before the jeans and shorts come off. Austin worships Kaden's beautiful pecs as he plays with his cock and Kaden reaches down and starts playing with Austin's cock. Austin is eager and he throws Kaden back as he continues to explore his chest with his tongue. He's got Kaden's cock out of his boxers now and he's stroking it as they enjoy each others bodies.Kaden is the first to go down on Austin's cock. As we know, watching Kaden suck and worship cock is one sight to behold and today is no different. After Kaden has tasted Austin's perfect cock, Austin goes down for his own taste of Kaden's. They go back and forth on the each others cocks making sure to each give the other plenty of attention. Kaden lays Austin back on the couch and they hump as we watch Kaden's pretty ass gyrate back and forth. Their cocks are touching and Austin takes advantage of the moment by jerking them together. It's so hot to watch. The kissing continues as Kaden sucks and licks on Austin's neck. These two are totally into each other and you'd never know they were aware of the camera. Austin enjoys the foreplay just as much as Kaden. Kaden straddles Austin's face and fucks his as he rubs his hot bubble butt all over Austin's cock. Austin reaches back and spreads Kaden's cheeks to reveal his nice pink hole and rubs the head of his cock all over the precious pucker.Breathing heavy yet? Want to know what happens next? Well, stop reading, get your hands off the keyboard, and take your eyeballs inside to watch the scene to find out how it ends!",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Austin",
      "person_id": 35036
    }
  ],
  "release_date": "2010-08-08",
  "scene_id": 70465,
  "tags": [
    "Gay"
  ],
  "title": "Austin & Kaden"
}