{
  "collections": [
    "Active Duty"
  ],
  "description": "The first scene in Direct Orders 3 features three of our favorites here at Active Duty, Dorian, Elijah and Dane. Talk about some serious attraction. These three have chemistry to go around and this scene is smoking hot as a result. I personally couldn't wait to throw Elijah between our two biggest muscle studs and see the sparks fly. I knew it would be a damn near perfect threeway and I think you'll agree.Things kick off with me giving Elijah a hard time as usual. He's got such a great personality and is always a great sport. It's evident that he's more than happy to be sandwiched between these two studs and it doesn't take long for the three of them to get naked and start having fun. Elijah latches on to Dorian's cock first and Dane follows his lead and gets beneath Elijah to give his cock a warm mouth. Dane quickly moves over to Dorian's cock while Elijah takes a break to admire Dorian's tight pecs and delicious nipples.Before long they've got Elijah going back and forth between their hard cocks, but the pace is fast and Dorian comes up on his knees to feed Elijah some cock while Dane gives Elijah's plenty of attention. Dorian soon moves down and starts working on Elijah's cock and Dane joins in to help him out. Elijah is having himself a blast as these two make him the center of attention.Dane loves to suck a nice cock and he can't make up his mind which one he wants to focus on, so he lays down and takes turns with both. Dorian and Elijah decide to get creative and move their cocks side-by-side and Dane takes full advantage of the ease of access as he inhales both cocks in his mouth at the same time. Dorian decides he wants to give it a try too, so he gets Elijah and Dane's cocks together for some back and forth action as Elijah and Dane give each other hot, sloppy kisses back and forth. Dorian comes up for air and some tongue and joins them in the lip-lock.Dorian's ass is like a slab of marble and Dane takes notice and decides he wants to lick it so he does as Dorian sucks Elijah's cock. A tongue in his ass gets Dorian all excited and he's moaning loudly as Dane tongues his ass deep. Elijah moves around to give Dane's rear some attention as he licks and fingers Dane's hole. Dane keeps himself busy down on Dorian's hard cock and these three are in the zone. It won't be long before these asses are ready for some deeper action.Elijah uses his mouth to roll the condom down on Dorian's cock, getting it ready for Dane's hot ass. He slides into home with no trouble and starts fucking him long and slow at first then speeds up the pace and gives it to him faster and harder as Dane makes love to Elijah's cock in between load moans and commands for Dorian to fuck him harder.Next up, Elijah wants his turn on someone's ass and Dorian offers his up. Dorian decides to ride it as Elijah positions himself on the edge of the bed, making it easy for Dorian to ride his cock and for Dane to suck Dorian's cock. Dorian's getting the best of both worlds. Dane eventually moves around and starts licking and kissing Dorian's ass as Dorian rides Elijah's cock.Elijah's ass is next and Dane takes the reigns on the ass as Dorian straddles Elijah's face and feeds him his hard cock while Dane goes balls deep on his ass. Elijah is really liking it as he directs Dane on just how to fuck him. Dane takes instructions well and gives it to Elijah just like he wants it. Meanwhile Elijah is enjoying Dorian's cock down his throat. Elijah wants more than just one cock in his ass tonight so Dane and Dorian do a tag team on him. Dorian starts plowing his ass deep as Dane jerks off all over his chest. Elijah wants Dorian's cum all over him too and Dorian gives him his wish. Elijah gets his and we've got three happy men.",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Dane",
      "person_id": 35189
    }
  ],
  "release_date": "2010-11-10",
  "scene_id": 70469,
  "series": "Direct Orders 3",
  "tags": [
    "Gay"
  ],
  "title": "Dane, Dorian & Elijah"
}