{
  "collections": [
    "Active Duty"
  ],
  "description": "You can tell Dane is hungry for Dorian just by how he's sucking that nice cock. Things switch up quickly and Dorian is returning the favor. Things have gotten off to a really hot start with these two and Joe is just along for the ride. Dorian is quite the accomplished cocksucker and he's giving Dane's cock a really good workout as he licks it and really gets into it, playing with Dane's balls and worshipping his cock all at the same time. Dorian is stroking his dick to the same beat he's sucking Dane's and the testosterone levels are about to explode. These two hunky slabs of beef were the perfect match for one another.Dorian suggests they get in a sixty nine position and it was a great idea. Now they can enjoy each others hot mouths at the same time without having to wait turns. Dorian's ass is so beautiful and Dane notices just how pretty it is and buries his tongue deep in that hole as Dorian enjoys Dane's cock. You can feel the heat coming through the screen as these two set it ablaze with just how much they're into one another. All this heat has Dane's ass on fire and he's ready to give it up to Dorian. Dorian mounts the big man from behind and Dane is in heaven as that hard cock plows in and out of his tight hole, opening up the gateway to Dane's heart. They switch positions and Dorian puts Dane on his back so Dane can stroke his hard cock while Dorian plows his ass with his. Dane tells Dorian when he's hit the spot as he strokes himself fast and hard. Watching Dorian's beautiful ass as he plows Dane's hole is something to behold. It's a perfect ass to watch while it's at work. Dorian is a courteous fuckbuddy and grabs Dane's hard cock and strokes it hard and fast while he bangs Dane's ass hard and deep.Things switch up and it's Dorian's turn to take it in his beautiful hole as Dane gets him from behind. Dorian is stroking his dick while Dane does the honors on his ass and you can feel the steam coming through your screen. Dorian's ass has to be one of the roundest, smoothest, most beautiful asses on the planet and it's got dane all lathered up as he fucks his like there's no tomorrow. It's got Dane so horned up that he can't take much of it before he pulls out his cock and lands his hot load all over Dorian's muscled back. It's a drenching wet and lovely mess and you can just feel the release as it happens. Dane takes things one step further and eats his cum of Dorian's back and then tells Dorian to cum on his face. Dorian fulfills the request and shoots a hot mess all over Dane's face and chest. I don't know about you but after that, I need to gather myself. Someone pass me a fan. Dane asks Dorian 'When can we do that again?'",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Dane",
      "person_id": 35189
    }
  ],
  "release_date": "2010-07-23",
  "scene_id": 70461,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Duo",
    "Facial",
    "Gay",
    "Muscular",
    "Rimming"
  ],
  "title": "Dane & Dorian"
}