{
  "collections": [
    "Active Duty"
  ],
  "description": "Jaden and Kaden ... So, Jaden is back with us and Kaden has something up his sleeve for what's in Jaden's pants. Jaden asks Kaden right off the bat what he has planned and Kaden isn't telling him the full story right up front. You can tell just how nervous and excited Jaden is and it makes him that much more sexy as he waits to see what Kaden has in store for him. He might seem nervous but he's also anxious and he asks Kaden once more what's next. Kaden is kinda toying with him and isn't coming clean too fast. He's making this hottie wait and wonder.Get Down There ... Finally Kaden makes his move and gets down between Jaden's legs, pulls out his cock and starts sucking it while Jaden holds the camera for a bit. Once Kaden's got him where he wants him he puts the camera on the tripod for awhile and enjoys his newfound playmate as we watch. Jaden's body is damn near perfect and those thighs are stunning. His cock springs to action after feeling Kaden's hot mouth on it for a bit and you can tell Kaden is having way too much fun bringing this newbie across the line. If there's one thing Kaden is good at, it's worshipping a nice, hard cock in his hot mouth and Jaden's cock is no exception. The way Kaden has the camera positioned you can't exactly see Jaden's face but you can tell he's watching the camera and watching Kaden suck his cock. This is so hot to me. Jaden flexes his abs and Kaden takes notice and licks and worships them with his tongue. P.O.V. ... POV is the highlight of this scene and Kaden convinces Jaden that they gotta get the point-of-view from both perspectives. He asks Jaden if he's ready to give it a try. And from there we watch this straight Texas boy get on his knees and worship his first cock as he takes Kaden's dick down his throat, gagging a few times before pretty much mastering the task at hand. Jaden follows orders well and when Kaden is ready to cum he tells Jaden to rub his balls for him and Jaden does. Kaden pops a big load all over himself. Kaden mans the cam as Jaden pops a huge load himself. Kaden asks Jaden how it was and you can see the gleam in his eyes as he promises Kaden he'll return for more. Amateur porn at it's best. Watching this scene you'd think these two were just fuck buddies who decided to turn on a camera and film their fun. Could it be that we are just witnessing first hand Kaden's personal conquests? You decide.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Jaden",
      "person_id": 35218
    }
  ],
  "release_date": "2010-09-05",
  "scene_id": 70468,
  "tags": [
    "Gay"
  ],
  "title": "Jaden & Kaden"
}