{
  "collections": [
    "Active Duty"
  ],
  "description": "Jake Returns ... Kaden got a hotel room close to the airport and waited for my gift -- the long lost Jake -- to arrive. I was being very secretive but told him he would definately want to be bring his camera and tripod along. I left it at that and sent Jake over to the hotel. As you'll see in the video, they were both very pleasantly surprised. In fact, Jake was so pleasantly surprised that this time he would let nature take it's course and allow Kaden and the heat of the moment to get him to do something he'd never done before.An Airport, a Hotel and a Camera ... Two hot studs all alone in a cheap hotel near a Texas airport with nothing but a camera, a tripod and two hot, hard cocks. Things quickly heat up between these two and the chemistry is perfect. Jake must have really had the spirit of the season because he was willing to give much more than he'd ever given before and Kaden got one of the best Christmas presents anyone could dream of. Receiving head from this hot, hung straight hunk and getting that fat dick up his ass and just having his way with Jake would more than make Kaden's Christmas complete. But it went both ways as you'll see in the video. Jake was really into it and just let things flow. Beauty unfolds as these two have the time of their lives and help each other make sure they capture it for all of us to enjoy.Let the Magic Happen ... Kaden follows Jake around with the camera in awe for a few minutes, letting it all sink in and then once he's got Jake on the bed he joins him and from there we watch magic happen. Jake is quick to grab onto Kaden's hard cock while Kaden plays with his. Watching Jake enjoy himself so much is enough to turn anyone on and Kaden is no exception. The real turn on for me was listening to the banter between these two as they casually explore each others gorgeous bodies. Watching Jake so eagerly play with Kaden's cock really got me going.Moaning His Ass Off ... It doesn't take long for Kaden to get down on that fat cock and take it deep down his throat. All the while Jake is filming it and moaning his ass off. Just listening to his reaction to the blowjob Kaden is giving is almost too much for me to handle. Kaden is clearly having fun making love to this cock and Jake is really into the attention. Jake does a damn good job of manning the camera while Kaden worships his cock and balls and tells him how big his fucking cock is. Jake mentions how hot it is to watch his cock get sucked on camera and how good it feels all at the same time. He's clearly enjoying this time alone with Kaden.Jake Sucks Dick For the First Time ... In fact, Jake is so lost in the moment that what happens next shocked the hell out of me. Kaden asks Jake if he's ready to suck his dick in return and I expected Jake to say 'Oh, I don't do that.' but surprisingly his answer came quick and it was just the opposite, 'Damn right I wanna suck your dick'. And suck it, he does -- like a champ. He's getting into it just as much as Kaden was into his big cock and you'll be on the edge of your seat watching this all unfold.A Little 69 ... Kaden does a clever trick with the camera and gets a high shot from above of he and Jake in a perfect sixty-nine, sucking each others cocks like there's no tomorrow. Jake continues to amaze as he keeps right up with Kaden and gives as good as he gets. Kaden comes up on his knees and starts feeding his cock to Jake and Jake is on it like white on rice, giving it his full attention.Jake Fucks Kaden ... Jake takes the camera again and this time he asks to see Kaden's ass, so Kaden hops on top and pushes his ass back toward Jake and the camera and Jake is just loving the view. Jake gets into playing with Kaden's ass as Kaden grinds back and forth on Jakes big cock. He's teasing Jake's cock nice and slow. Next thing you know, Jake's primed and ready to do the deed and Kaden sinks his cheeks onto Jake's huge member. At one point, things get so heated, Kaden has to pull himself off as he bit off a bit more than he could chew. The banter between the two here is priceless, you gotta hear it! Soon, Kaden turns around to face Jake as the couple prepare to shoot their loads...",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Jake II",
      "person_id": 35239
    }
  ],
  "release_date": "2010-09-05",
  "scene_id": 70466,
  "series": "Kaden's Recruits",
  "tags": [
    "Gay"
  ],
  "title": "Jake & Kaden"
}