{
  "collections": [
    "Active Duty"
  ],
  "description": "I've been getting emails from you guys asking to see more of Nick Gunner and tonight we've got a great scene for you featuring this hot little stud.  I've also paired him up perfectly with our super sexy stud, Bric.  These two really hit it off on a long weekend shoot that we did recently and became fast buddies.  I knew just by the way they got along during that weekend that they'd be a perfect match that would end up being a smoking scene and I was right.  We are also treated to Bric's second time on bottom in this scene as they decide to flip-flop and fuck eachother.Things get started with me watching Nick shave in the bathroom.  I could watch him do anything and be entertained.  I'm not the only one that decides to join him in the bathroom as Bric soon walks in and eases up behind Nick and starts rubbing his big hard uncut cock up next to Nick's pretty little ass as he rubs all over Nick's gorgeous little body.  A big grin covers Nick's face as he continues to shave and enjoy the attention.  Once Nick feels that big cock rubbing up and down his back he reaches behind him and grabs it, stroking it with a huge grin.  He finishes shaving in record time and tells Bric he was about to get in the shower and invites him to join.Bric gets the water all nice and warm for the two of them and Nick hopes in when the temperature is just right.  His cock is rock hard already and it doesn't take him long to start jacking Bric's dick along with his own as Bric washes him down.  Bric says he's gonna get Nick all cleaned up and Nick smiles and says, 'yeah, I have been a little dirty lately.'  So cute!  They get into washing each other down and stroking each other's cocks as the steam builds.  Little Nick goes in for Bric's neck and starts planting kisses on his buddy and Bric returns with his own love pecks.  They lock lips for a kiss that is out of this world as the water cascades around them.  Their cocks are kissing too and Bric takes them, puts them together and jerks them as they continue to kiss.  You can feel the heat coming off the screen as their hot shower gets even hotter.Nick is the first to go for a taste and he's on his knees taking Bric's dick in his mouth as Bric enjoy's the water and the head.  Nick really starts getting into it and taking Bric's cock deeper, going faster and getting nice responses from Bric as he shows him his skills.  Nick looks up at Bric and asks, 'how does that feel?' with a grin as big as Texas.  Bric asks when he gets to return the favor and Nick assures him very soon.  Meanwhile little Nick is going to enjoy ever second he can worshipping the nice uncut beauty in his mouth.In a cute moment Bric takes Nick and stands him on the shower ledge, giving him direct access to Nick's big cock.  He starts working it with his mouth as he works his own cock with his hand as Nick looks down and watches him worship his cock.  We've got ourselves a perfect pair here, troops.  And Nick's cock must taste very good because Bric's cock never goes down.  It's standing at attention the entire time as he works his buddy's hot cock, giving it a polishing and deep throating it.  I get some good underneath shots of Bric stroking while he's sucking.What happens next is just what the doctor ordered.  Nick tells Bric he'd love to feel his hot tongue in his ass and Bric bends him over and gives him what he wants.  Bric gets right in there and tongues Nick's hole really good as Nick strokes his cock and tells him how good it feels.  Bric certainly isn't shy about eating that nice little hole and we get to watch him as he explores new territory with vigor.  I love a dedicated trooper and Bric is certainly proving that he's just that.Once he's gotten Nick's ass all hot and wet, Bric slowly starts working his big cock deep into Nick's tight ass.  Nick is taking it like a champ as Bric goes deeper and deeper and Nick strokes his hard cock to the feeling of that big cock in his hole.  He's giving us plenty of good moaning and great 'O' faces as Bric continues to plow his ass deep.  Nick can barely touch his hard cock without blowing his load all over the place so he jerks it a little then backs off, giving Bric plenty of time to fuck him good.They switch positions and Nick gets on his back as Bric fucks him standing on the ledge of the tub.  Nick's cock is still rock hard and he's stroking it  while Bric fucks him and rubs his chest and nipples.Things take a turn and Nick takes his turn on Bric's ass as he bends him over the tub.  Nick works his cock in that ass pretty fast and is pounding him in no time.  Bric is biting his bottom lip as Nick slams his ass.  He tells Nick what a big fucking dick he has as Nick takes it even deeper.  Bric starts stroking his own hard dick as Nick plows him harder.  It's obvious from how hard his cock is that he's really enjoying this cock in his ass.  I think we've got a truly versatile man in our boy Bric who seems to love it whether he's giving it or taking it.  His balls are nice and tight as Nick slams into him, going balls deep.It isn't long at this pace before Bric is ready to blow and he does just that as Nick fucks him harder and harder.  Once he blows his huge load Nick asks, 'Did you come for me, baby?'  Bric replies, 'You made me cum.'  And from there Nick goes for his cum shot and shoots it all the crack of Bric's freshly fucked ass.  They go for another hot kiss and it's a wrap!",
  "models": [
    {
      "name": "Bric",
      "person_id": 35047
    },
    {
      "name": "Nick Gunner",
      "person_id": 35123
    }
  ],
  "release_date": "2012-02-20",
  "scene_id": 70475,
  "series": "Direct Fire 3",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Shower",
    "Smooth"
  ],
  "title": "Bric & Nick Gunner"
}