{
  "collections": [
    "Active Duty"
  ],
  "description": "You've seen Taylor get his cock sucked. And you've seen Marshall do, well, nothing yet. lol. But in Direct Orders 3, Taylor spreads his wings and joins the flock, while Marshall takes things to the mat and not only sucks his first cock, but takes one for the team! In the intro to the scene when I usually talk to each of the guys, when I get to Marshall he's all smiles and you can see the excitement on his face. He's damn happy to be in the company of the studs we've chosen and you can tell. Like fisherman at a Bass Pro Shop this guy has found the perfect spot. And, like a fish to water, he takes right to his new surroundings like he was born for it.<br /><br />Enjoy the Ride ... <br />Things kick off with the usual bullshit and I tease Taylor about taking things further and he just grins. But once things are underway we learn that Taylor may have never sucked a cock before but he surely must have thought of it once or twice or practiced at least on his finger because this guy can suck a cock like nobody's business. As soon as DJ pulls out his impressive piece of meat, Taylor starts the glancing. Everyone follows DJ's lead and the pants and shorts come off. DJ quickly moves in and grabs Taylor's huge cock and takes in his mouth as Kaden does the same for Marshall. The two newbies are kicking back, enjoying the ride. The look on Taylor's face is priceless as DJ shows off his hard-earned skills on that thick dick of Taylor's. Marshall takes a little more control as he guides Kaden's head down on his cock and talks to him while Kaden does the deed. Marshall is a toucher and rubs Kaden's shoulders and body as Kaden works on his cock. Taylor's huge balls just grab your attention as they bounce in the breeze while DJ services his cock. Taylor gets so into it when his cock is buried in someone's deep, wet throat. <br /><br />Who Knew Marshall Would Be So Good at Sucking? ... <br />Things switch up and Marshall returns the favor to Kaden as Kaden comes up on his knees to give him plenty of access. Meanwhile the shock of the night comes as the camera zooms over to Taylor who has taken DJ's huge dick into his mouth and is literally making love to it. You can tell he's really liking this. It's always fun to have the big cock that is getting serviced, but servicing a big cock can be just as much fun and by the looks of it, Taylor is having himself a blast. Marshall is becoming a pro in a matter of minutes as he masters the art of cocksucking right before our very eyes and really gets into sucking, licking and deepthroating Kaden's hard meat. Marshall is more of a cocksucker while Taylor seems to be more of a lovemaker as he slowly licks and sucks DJ's cock like it were a lollipop. All the while he's humping the bed beneath him with his own hard dick. <br /><br />Things Switch Up ... <br />Kaden moves over and takes on DJ's cock as Taylor switches places with him and sucks on Marshall's dick. It's a fourway suckfest and everyone's getting their fair share of face time. DJ is getting off on watching the newbies as they play well together and Kaden sucks his cock for him. Taylor is driving Marshall crazy with his slow licking, deep sucking action as Taylor unleashes the cocksucker inside. <br /><br />Open Up And Say 'Ahh' ... <br />And now it's time for something completely different as DJ gets Taylor up on his hands and knees and starts eating that virgin hole. The look on Taylor's face is priceless as he feels a tongue in his ass for the very first time. Kaden is doing the same for Marshall and Marshall is opening right up -- ahem -- to the pleasure. Marshall bends Kaden over and returns the favor as Taylor does the same for DJ. Talk about something hot. Watching these two newbies follow two veteran's leads into the world of ass eating is something to behold. They seem to be giving as good as they got. Taylor is a horn dog and all the while he's sliding his fingers in DJ's ass to see how deep the rabbit hole goes. Marshall is following his lead and doing the same to Kaden as these two explore new territory together.<br /><br />Finally Fucking ... <br />Taylor finally has DJ's ass right where he wants it and he shoves that huge cock of his deep in DJ's ass, going balls deep and fucking his hole nice and slow. He gives it nice, long, slow strokes before speeding it up and pounding his ass and all the while DJ is jerking his own hard cock as Taylor plunges deeper into him. Meanwhile Kaden has eased into Marshall's tight ass and Marshall is telling him how big his cock is. By the time this scene is over, we've got a couple not-so-virgins anymore, plus splashes of cum all over the bed and bodies. Just another day here at Active Duty!",
  "models": [
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Marshall",
      "person_id": 35117
    },
    {
      "name": "Taylor",
      "person_id": 35153
    }
  ],
  "release_date": "2010-11-10",
  "scene_id": 70470,
  "series": "Direct Orders 3",
  "tags": [
    "Gay"
  ],
  "title": "DJ, Kaden, Marshall & Taylor"
}