{
  "collections": [
    "Active Duty"
  ],
  "description": "Boyd is on the fast-track and has already crossed the line.  Originally I'd gotten him together with Taylor to do a double jerk off for a follow-up War Chest update and to move him along a little quicker, but once they got to jerking off together, Taylor convinced Boyd to take things a little further and then even a little further still.  It's fascinating to watch and listen as Taylor convinces Boyd that trying something new is OK.  I have to admit I had my doubts that Boyd would take the next step so quickly, but when you have good-looking troops like Taylor to help you out it's amazing how quick things can move.  It gives the new recruits someone they can relate to more easily and they suddenly realize that if the other guy can do it, so can they.  Boyd realized this as Taylor talked to him while they were stroking their cocks and what happens from there is nothing short of sizzling hot.<br /><br />We kick things off our normal chit-chat and the plan starts out as a double jack off session.  Taylor was responsible for getting Bric to cross a very important line and suck his first cock so he's certainly a good choice in this situation.  I say to Taylor that I am wondering if Boyd might considering doing anything besides just jerking off and the look on Boyd's face is a poker face.  You can't tell from his reaction to what I'm saying but something tells me that Taylor can get him to the jumping off point.  As Taylor begins telling his 'first time' story to Boyd, all Boyd can do is check out Taylor's cock.  I love the sneak peeks these guys always have going on.  Boyd doesn't seem nervous in the least as they chit-chat back and forth about the porn playing.  Something tells me from the start that this is going to be much more than just a jerk off session.  It's all up to Taylor and how well he sells the deal to Boyd, but given Boyd's comfort level I don't think it's going to be that hard.<br /><br />Taylor breaks the ice by asking Boyd if he's ever considered letting another guy touch him.  Boyd immediately throws up the natural wall response and says no way, but he doesn't jump up and put his cock away either.  Taylor doesn't give up there though, he keeps on by telling Boyd it isn't bad at all and then I chime in from the other room and say, 'you know what they say, guys give better head' and by that time Taylor already has his hand wrapped around Boyd's hard cock, stroking him while he strokes himself.  Boyd finally relaxes and throws his head back as Taylor takes his cock in his mouth and starts sucking him off.  Boyd immediately agrees that we weren't kidding about guys giving better head as Taylor shows him how it's done.  Taylor asks if he likes it and Boyd says, 'It feels fucking amazing'.  <br /><br />Taylor pulls Boyd's jeans off for him and then puts his best cock-sucking skills to work on that beautiful dick of Boyd's as Boyd repeats that we were not kidding.  He's breathing hard and obviously enjoying the moment as Taylor slowly works his cock, licking the shaft and balls and then taking him deep down his throat again and again.  Boyd reaches forward and grabs the back of Taylor's head, guiding it down on his cock as Taylor continues to work his magic.  You can tell that Taylor is having a good time turning out the newbie, too.  He's putting his best head forward for Boyd to make sure he's got him exactly where he wants him.  He's licking and moaning on Boyd's cock and giving him the blow job of his life and Boyd is enjoying the hell out himself.  So hot to watch as a newbie explores and Boyd is one hot fucking newbie.<br /><br />Watching Taylor suck cock is always a treat because he gets so into what he's doing, giving 100% to the task at hand.  Boyd's washboard abs tighten time and time again as he tenses up from the good head Taylor is giving.  Taylor says to Boyd, 'This is way better than just a jack off session isn't it?' and Boyd's reply is 'Hell yeah'.  Taylor takes off his own jeans to have better access to his own hard dick and strokes it intently as he returns to Boyd's dick.  He asks Boyd if he wants to fuck his face and Boyd gets a huge grin on his face and says yes.  He comes up on his knees and starts fucking Taylor's face as Taylor gives him control and just moans as Boyd uses his mouth for his pleasure.  All the while Taylor is stroking himself as Boyd keeps his mouth plenty busy with his cock.  Boyd's low-hangers just bounce around as he feeds his hard cock to Taylor.  The breathing gets extra heavy here and then Taylor comes up on his knees and starts stroking their cocks together.  They 'sword fight' for a little bit and Taylor tells him to lay back down.  This is where the next part of Taylor's plan comes into play.<br /><br />As they lay side-by-side together Taylor asks Boyd if he thinks he'd consider sucking his cock.  Boyd says he doesn't know and immediately Taylor coaxes him to just touch it.  Boyd starts out jerking Taylor's hugs cock and then Taylor says, 'Wanna try just sucking it?'  Boyd looks him in the eyes and just grins and says, 'I can'.  From there we watch this newbie give it his best as he goes down on Taylor's big fucking cock and takes it into his mouth.  In no time flat Taylor declares that we have ourselves a natural with Boyd who is treating Taylor's cock like a lollipop as he explores new ground.  He finds a good pace and just goes for it as he gives Taylor a nice, slow blow. Boyd's cock never goes soft once as all this is going on and Taylor takes advantage of it by getting him on his knees so he can stroke Boyd's cock for him while Boyd sucks him.  I get some good shots of all the action and of Boyd's low-hangers bouncing around as Taylor strokes his cock for him.  The faster Taylor sucks, the harder Boyd breathes and sucks.<br /><br />We see how long and beautiful Boyd's eyelashes are as he closes his eyes while sucking Taylor's cock.  This stud is so fucking hot and the two of them rubbing together could start a major fucking fire.  Taylor goes back to sucking Boyd for a little while as Boyd strokes him and these two aren't missing a beat.  They've got a nice balance going between them.  Taylor decides it's time to fuck Boyd's virgin mouth for awhile and they get in position.  Taylor starts fucking Boyd's mouth fast and hard and Boyd keeps right up.  He's humming on that big cock as Taylor breathes hard and enjoys fucking his throat.  Boyd doesn't come up for air once the entire time as Taylor's cock fucks his mouth like a hot pussy.  They go back and forth, sucking each other again and again and all the while Boyd is learning new things that he's bound to want to try again.  After several OMG's from Boyd, he finally gets close to blowing his load as Taylor continues working his stiff cock.  Taylor finishes him off with an intense hand job as Boyd blows an amazing load all over his well-defined abs, hitting his chest and beautiful nipples, too.  You can tell this was one of the most intense moments of his life.<br /><br />Now it's Taylor's turn and he has his choice of how to get off.  He tells Boyd that he saw his solo video and how well he moved that ass and he'd like for Boyd to put on a nice ass show for him while he jerks himself off.  Boyd has no problem giving him a show and does just that as Taylor watches and strokes.  Taylor is telling him how to move that ass for him as he works himself up to a nice explosion.  All the while Boyd is moving that beautiful ass around in circles, teasing Taylor as he watches him jerk his hard cock to his nice bubble butt.  Taylor's huge cock looks like it's about to burst as he nears his climax.  Taylor starts moaning and telling Boyd, 'Yeah that little ass is gonna make me cum' as he explodes all over himself. Boyd has a huge smile of achievement on his face as he realizes what his ass did for Taylor.  Troops, thanks for playing!<br />",
  "models": [
    {
      "name": "Boyd",
      "person_id": 35248
    },
    {
      "name": "Taylor",
      "person_id": 35153
    }
  ],
  "release_date": "2012-02-28",
  "scene_id": 70471,
  "series": "High Alert",
  "tags": [
    "Blonde",
    "Duo",
    "First Time",
    "Gay"
  ],
  "title": "Boyd & Taylor"
}