{
  "collections": [
    "Active Duty"
  ],
  "description": "This is a scorching threesome in the shower featuring Zander, Carson and Dustin.  Seems Dustin and Carson always meet up in the shower for fun and today they've got another hot recruit in tow.  Zander has been away for a bit but he's back and looking delicious.  In fact he's so delicious to Carson and Dustin that the two of them really get into ravaging their comrade.Things start off with Zander alone in the shower soaking up the suds and cleaning his manhood while we all watch.  His classic Italian looks shine even better in the glistening water.  We get some nice shots of his bubble as he drops the soap and of course Carson is the first one to point out his blunder as he joins him under the water for some mutual cock scrubbing.  Carson goes in for an initial kiss, but Zander plays hard to get for a minute before locking lips with Carson as they stroke each others dicks.Dustin joins them to complete the trio and suddenly the bathroom gets a little steamier.  Watching these three explore each others bodies is a real treat and Dustin's tight little ass could hold my attention for days.  Dustin and Zander go for a long, wet kiss as Carson finds his way down to their cocks and starts sucking and stroking them as they tongue each other.  The water dances off of Carson's face as he nearly drowns himself sucking their cocks.  He's such a trooper and you can tell he's hungry for the cock.  Dustin shows his appreciation by planting a hot kiss on Carson's lips then joining him in worshipping Zander's nice dick.  Carson takes the balls while Dustin works the shaft and Zander strokes Dustin's dick to keep him happy.  Zander finds Dustin's nipples hot and decides to go for a little nipple play to spice things up.Zander takes his turn at sucking Dustin and Carson to return the love.  Carson and Dustin are kissing all the while and things are about to get even hotter.  Dustin decides to double up on his dose of cock and takes both dicks in his mouth at once, sucking and slurping on them like lollipops before things switch up and Carson finds his way to Zander's cock while Dustin eats Carson's ass.  Hot mansex at it's best, troops, is all I can say.Dustin eats Carson's ass for a good while as Zander enjoys Carson's mouth all over his rock hard cock and balls.  Carson takes time to kiss and caress Zander's thighs for good measure before turning Zander around to munch on his hot hole.  Carson calls this the ass-eating train while he stands behind me watching as I write this.  He's proud of his performance.  He's pointing out how sexy his arms and back were looking as the water rolled off of them.Dustin moves around to get some of Zander's hot mouth on his cock and a few wet kisses as Carson keeps working on Zander's ass.  Zander is really getting into servicing cock today as he gives Dustin his full attention, slowly then faster and more intense.  Carson moves around to give Dustin his cock as he watches Zander suck Dustin.  Zander decides to help Dustin handle Carson's dick as Dustin sucks and Zander plays with Carson's balls.The tables turn and Zander is bent over the tub about to take Carson's cock up his ass as Carson eases his way slowly into Zander's hole.  Dustin keeps Zander's mouth busy with his cock while Carson begins to fuck him harder.  It's been awhile since Zander had his seal broken and Carson's cock is a bit of a challenge at first as he kicks Carson in the leg a few times, but as it gets better his moans get deeper as he strokes Dustin's cock and takes the cock up his ass.Carson pulls out and blows his hot load all over Zander's ass and it's a nice, big load.  He licks it up, every last drop, and takes it in his mouth and shares it with Dustin as he gives him a delicious snowball that Dustin shares with Zander.Carson has gotten his and he dries off and leaves Zander and Dustin to finish things off.  Zander gets his revenge on Dustin's tight little bubble butt.  Zander is extra fucking horny today and he takes out all his frustrations on Dustin's little ass as Dustin takes it like a champ.  They fuck in several positions before Zander puts Dustin on his back and strokes his cock as he fucks him.  Dustin shoots a hot load all over himself while Zander stays balls deep in his ass.  Zander follows Dustin's lead and fills Dustin's belly button with a puddle of hot jizz.  They go for one last kiss before we fade to black.",
  "models": [
    {
      "name": "Dustin",
      "person_id": 35016
    },
    {
      "name": "Carson",
      "person_id": 35056
    },
    {
      "name": "Zander",
      "person_id": 35166
    }
  ],
  "release_date": "2011-11-23",
  "scene_id": 70477,
  "series": "At The Ready",
  "tags": [
    "Anal Sex",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Gay",
    "Kissing",
    "Shower",
    "Threesome"
  ],
  "title": "Carson, Dustin & Zander"
}