{
  "collections": [
    "Active Duty"
  ],
  "description": "This week Mike has found us a delicious little blond soldier to feast our eyes on and we get a double dose as Mike was able to get him to do the deed not once, but twice. This little guy is a firecracker and puts on a hell of a show for us in both solos.<br /><br />Brock is 20 years old, stands 5' 8' tall and weighs in at 155 lbs. Brock says he has a nice size cock that measures around 7.5 inches. Mike kicks things off asking the cutie some questions about himself. He gives him the preliminary instructions and leaves Brock to his own devices to get hard. Brock wastes no time at all shoving his hand down his shorts to grab his cock and start playing with it. He comes out of his shirt really quick to reveal a very nice, tight and toned body. Mike compliments him on his nice chest and Brock just beams. You can tell right away that this one likes to show it off. He doesn't seem nervous in the least and quickly comes out of his pants, leaving just his boxers to hide the prize that he was bragging about earlier.<br /><br />Once he comes out of his boxers we see a gorgeous package with light blond fur and right away it's obvious that this little devil loves to play with his nice balls. He pays a lot of attention to them as he's working up his hard on. Some guys are like that about their balls. They love any kind of stimulation that involves their boys. I've known guys that could cum just from having their balls licked and I think Brock might be one of those fellows as much attention as he gives them.<br /><br />Mike puts Brock through the paces and eventually gets him on his hands and knees to show off that gorgeous furry little butt. He's not shy about it, either. Mike gets in there and helps him spread his cheeks as we get to see all the glory. And we also find that Brock is a moaner as he gives us plenty of good noise. He also likes playing with his nipples as much as he does his balls. I'd say Brock is a total little horndog and he's having more fun than a barrel of monkey's showing off for us.",
  "models": [
    {
      "name": "Brock MB",
      "person_id": 35256
    }
  ],
  "release_date": "2012-04-20",
  "scene_id": 70472,
  "series": "Covert Missions 9",
  "tags": [
    "Gay",
    "War Chest"
  ],
  "title": "Brock"
}