{
  "collections": [
    "Active Duty"
  ],
  "description": "Tatum is a really hot dude and as soon as I met him I knew he'd most likely be down to play, but you never really know until you 'try' so I decided his first solo was as good a time as any to see how far he might go.Luckily, I had a willing accomplice to help me out on my mission and things went much smoother than I'd expected.  But things kicked off just like any normal War Chest solo as I chat Tatum up and we get to know more about this hot stud-muffin.  He's so adorable and I personally can't get enough of that cute Southern drawl of his.  Tatum is 20 years old and stands 5'10'.  He's got a great semi-furry tight body that weighs in at around 165 lbs.  Tatum loves motorcycles and enjoys anything that gives him an adrenaline rush.  He has a fear of heights but he's found a way to get over that fear that he explains.  Tatum is an Alabama boy and that sweet awe shucks attitude just drives me crazy.  He's got so much sex appeal it makes me melt.I thought it was so cute when I asked Tatum why he thinks he'd be good for this and his first answer is an honest, 'well, I look pretty good.' and I couldn't agree more.  I get him out of his shirt and leave him alone for a bit and he quickly comes out of his shorts and starts playing with his cock.  He's watching the camera and smiling like it's a real person.  When he pulls off his boxers he's already rock hard and his cock is a nice, big thick beauty to behold.  I mean it's really thick.  He gets into jerking his cock and rubbing his body as he pays plenty of attention to those of us watching.Once I return I'm pleasantly surprised by the size of that gorgeous cock and I get right in there to get some great shots of it as he keeps the pace and starts showing it off even more.  Tatum might be nervous but his hard cock isn't showing it.  He's standing at full attention and I can tell he's wondering what I might have up my sleeve next.  But I hold my secret back for a little longer as I continue to admire his all-American good looks and cornfed cock.  I can't get enough of this stud.  His legs are gorgeous, too, and you can tell he spends his fair share of time running.  A great example of what military PT will do for you.I get him up on his knees so we can get some better shots of that cock as it drips with pre-cum.  He's rubbing his chest and showing off for us, never once losing his rock-hard boner.  This guy is super horny and you can tell.  It's at this point that I finally decide to reveal my secret and I tell Tatum that I have a Marine buddy in the living room who saw his pictures and said he'd suck him off.  I ask Tatum he thinks he might let him and he doesn't hesitate to say yes.Dustin comes in and starts playing with Tatum's big cock, jerking it and playing with his balls as Tatum keeps watching the camera.  At this point I have the camera angled so that Tatum can see what's going on as he watches.  Dustin is trying to make him as comfortable as he can and it's driving me crazy.  I would have been all over that cock like white on rice from the very start.  But, boys will be boys so I let them bond however they decide.Dustin is looking at me for guidance and I keep giving him the cock sucking motion in the background.  He's still not sure if Tatum is down and I assure him that he is.  Once Dustin knows Tatum is cool with it, he goes for it.  I tell Tatum that Dustin gives better head than he does hand and Dustin goes down to show him.  As soon as his mouth touches Tatum's cock it's rock hard once again.  It's a big dick for Dustin to master, but he gives it a good try.  Tatum throws his head back  and starts biting his lips.  You can tell this is a brand new experience for him but his dick is really liking it.  Once he shoots his load, Dustin plays with his cum and rubs it al over his cock.  And that's all she wrote.  He's putting on his shorts and heading for the door just like any good piece of trade would.  Gotta love it.",
  "models": [
    {
      "name": "Dustin",
      "person_id": 35016
    },
    {
      "name": "Tatum",
      "person_id": 35258
    }
  ],
  "release_date": "2011-11-23",
  "scene_id": 70476,
  "tags": [
    "Big Dick",
    "Blowjob",
    "Duo",
    "Gay",
    "War Chest"
  ],
  "title": "Dustin & Tatum"
}