{
  "collections": [
    "Active Duty"
  ],
  "description": "Christmas Begins ...The Christmas show opens with all the boys gathered around sitting on the couch, the floor, the arms of chairs so everyone can squeeze in the picture in from of the Christmas tree. Everyone is enjoying their beverage of choice and all the men are dressed in gold tuxedo vests and bow ties along with sexy white boxers. The twins have on burgundy vests and black bow ties to set them apart. Kaden is missing and the boys say he couldn't make it, but they've brought us another present and it's over to the right of the couch wrapped in shiny silver paper. Suddenly it starts to move and Kaden rips it open, revealing his sexy body in his Christmas attire, matching the crowd. The chatroom is full of viewers on The Active LIVE Interface and all the boys chat with the folks watching this all happen LIVE. All the boys give a big toast to our LIVE audience and I begin to make the introductions.The Introductions ...The guys are looking absolutely stunning, the colors so vivid, the smiles so vibrant. You can tell this is a room full of happiness and that everyone is really glad (if not in awe) to actually be here. The Christmas music is playing softly in the background as I just look at the beauty before me and decide we should introduce everyone.There was someone here that no one had every met except in our War Chest Updates---Payne. I had hoped that bringing Payne to the party, we'd get him to go a little further in his bonding experiences, we didn't quite get that, but he did keep a raging hard-on the entire time and in the Extra's part of the second disc, we get an extra special look at him. We'll also be seeing more of him soon, taking things to another level. Ho, ho, ho. There's something about Payne that just drives me crazy. He's short, stout and built like a little brick shithouse. And that uncut cock is heaven. We won't even mention the butt.I was glad that Zack could make the Christmas party as he goes way, way back here at Active Duty. All the way back to our sixteenth video release, Cum Hungry Grunts. Zack is very special and having him back looking better than ever (at 29 years old) was a really special treat. Zack become the 'housemother' of sorts and was very helpful throughout the whole process in keeping the house clean and helping feed the others. His maturity only hidden by the kid inside that comes alive when the camera's come on.Kasey steps up to the plate looking like someone famous that shouldn't be among us. His stunning beauty and just overall manliness coupled with that boyish smile and shy sorta way always wins me over. My first memories of Kasey were in a John Deere hat, driving a Chevy pick-up truck. He's the epitome of small-town with big dreams and equal potential. Kasey has become a fan favorite here at Active Duty and looking at him shine tonight, you see why.Our beloved angelic-boy-gone-bad Kaden makes his way before the camera and he's so breath-taking that you almost need an oxygen tank to take his presence. This Texas boy is what every gay man dreams of when he first starts dreaming about men. His straight, bright white smile and flush cheeks, that smooth, near perfect skin and his loving personality melts you into submission. His country accent and his awe shucks demeanor is disarming but watch out, he's packing the goods to make you explode. Kaden was my first San Diego love I guess you could say. He was the very first sailor I met after arriving and our relationship and its evolution has been one of the best experiences of my life.Those wild twins are up next and they're always up to something. These two are such rivals and watching their intensity toward one another has always been amusing to the rest of us at AD. The twins are beloved parts of our family. After all, shouldn't every big family have their own set? They are rougher around the edges, blunt and very matter-of-fact about what they like or don't like. They're our revolutionist I guess you could say, our banditos. Deep down they are two of the sweetest guys you could ever hope to meet, simple-loving, street-smart, and the exact definition of scamp.We continue the introductions with Colin, Damien, Adam, Hops, Christian, Reese and Brock saying hello to the LIVE audience.King Cole's Cameo ...This part of the party really had me choked up. It was all I could do to choke back the tears of joy and just strong emotion. Cole had agreed to join us for the Christmas party to help film and be with us, but made it clear he wasn't comfortable with being on film again just yet. I had originally made the silver wrapped box that Kaden came out of for Cole, but when he laid the news on me that he wasn't going to appear, I switched the plan 20 minutes before the feed went live and put Kaden in it. The little shit would come back to surprise me later by coming out dressed in a tuxedo vest, bowtie and white boxers and I'm not sure if the rest of those rascals knew his plan or not, but I almost cried. I realized at that moment how everything doesn't always have to be on 'our' terms, by them being on someone elses could sometimes be magical. Cole punked me on this one. He had not appeared on video in close to eighteen months and I had sorely missed working with him. But during that time off he's become a very valuable part of the AD family behind the scenes. Like with everything he appears in, Cole stole his portion of the show and I was glad he did. It would not be until four months later when he would decide to slowly make a comeback in front of the camera.Santa Makes His Rounds ...It's gift-giving time and Santa always has the good gifts. We let the guys sit in the Christmas throne one-by-one to receive their presents. Everyone was wide-eyed as they opened gifts from lap tops to Xbox 360 or Playstations and all the accessories. Each year Santa give the guys five things to choose from and gets them one of those five things so that it's still a surprise.The twins come up to get their presents talking shit as always, but find themselves pleasantly surprised I do believe. All the guys razz the twins as they open their gifts and Damien follows the twins and he's followed by Hops, Kasey, and all the rest. The gift opening session is really like an Active Duty LIVE Friars Roast. All the boys give each other shit and I join in the fun.Get The Party Started ...After all the sentimentals you know that we are bound to get down to the essentials here at Active Duty. And it doesn't take long before there's some action happening beneath the Christmas tree. The cocks start coming out and the boxers start coming off. Some serious oral action begins to take shape on the couch. Christian starts sucking Kasey, Zack gets him a taste of Kaden while one of the twins gets himself a taste of Damien. Adam starts sucking Reese while Colin gets a taste of Adam's sweet ass. The other twin moves over and gets ahold of Hops huge cock. There's some serious party favors going on in the room tonight as everyone does everyone a few favors. The sucking goes on and the boys mingle around and get comfortable.Giving And Receiving ...A lot of very special things happened that night, but one of the best moments was that famous kiss that started it all. From here things get really opened up and wild. Everyone is getting a taste of everyone and it's hard to keep up with this merry christmas go-round of hot action. The boys are loosened up and everyone's ready for a good time. The boys egg Payne on a little and he's hard as a rock just watching and he's not shy to show off a little. Adam goes down on Reese's huge cock something fierce while everyone keeps taking turns on everyone. Brock is slinging his muscles all over the party and he's getting the attention he wants. No one gets left out on this gift-giving event.Bottoms Up! ...The cocks are all standing at full attention and the service has got them wet and ready. Damien is the first to throw his hot little ass in the air tonight as one of the twins moves in to guide the sleigh. The twin gets Damien nice and lathered up and ready for some Christmas fun. Brock keeps Damien's mouth full of cock as he shoves his dick deep into him. Brock is next to step up to the plate and plow Damien's field. Damien is happy as all get out as he gets used and abused by his boys. Colin decides to bend over and take one for the team as Hops moves in behind him to give it to him, but it's shortlived. Colin was a bit more gungho than his ass was. But there's a lot more hard cock and hot holes to go around and things keep moving forward.Return From Intermission ...After a short break we return with Hops wearing Santa's wig and looking like Cruella DeVille. Things move immediately to Reese fucking the daylights out of Damien. Reese fucks him like there's no tomorrow, it's insane and Damien strokes his hard cock all the while. Adam decides he wants to ride some horsey and trades places with Damien where he throws his legs high in the air for Christian to slide in. Adam loves a good hard fucking and Christian gets things started off right.Hot Loads Abound For Adam ...The boys decide Adam will be the target tonight as one of the twins kicks things off with blowing his hot load all over Adam's stomach. This starts a chain reaction as Hops follows suit and lands a really huge three day load all over Adam. All the while Christian is pounding Adam's ass. The other twin follows Hops and thickens the huge puddle on Adam's stomach with his own hot jizz. Christian gets excited by all the hot loads and pulls his cock out of Adam's hot ass and blows his own load all over Adam, stroking their cocks together to squeeze it all out. Colin follows the crowd and lands his load on Adam. Kaden is next to mount Adam and he knows Adam's spot. He gives Adam a good hard fucking while Adam strokes his cock until he explodes. Kaden always knows how to make Adam cum. Can you blame him? Brock rushes over and blows his load on Zack and starts another chain reaction. Damien steps in and unloads on Zack and Reese follows his lead. Zack is soaked in cum as Christian helps him rub it all in. He and Zack embrace in a long, wet kiss. Kaden shoots another load along with Kasey all over Colin and end it out with another hot kiss.Twas The Night Before Christmas ...Cole does the honors as we dim the lights and he reads 'Twas The Night Before Christmas' laying in front of the fireplace as we close out our wonderful Active Duty LIVE Christmas. Merry Christmas to all of you, our Active Duty family.Extras ...There was two cameras running that night and we threw in some of the footage from the second camera to give you a totally different perspective. This might have been mostly my perspective as I seem to be focusing heavily on things that interest me and things to come in 2009.",
  "models": [
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Christian",
      "person_id": 35060
    },
    {
      "name": "Cole",
      "person_id": 35020
    },
    {
      "name": "Colin",
      "person_id": 35064
    },
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Hops",
      "person_id": 35087
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Payne",
      "person_id": 35125
    },
    {
      "name": "Twins",
      "person_id": 35049
    }
  ],
  "release_date": "2008-12-02",
  "scene_id": 70481,
  "series": "Active Duty Live: Christmas 2008",
  "tags": [
    "Blonde",
    "Blowjob",
    "Brunette",
    "Gay",
    "Jock Strap",
    "Muscular",
    "Twink",
    "Twins"
  ],
  "title": "Active Duty Live: Christmas 2008, Scene #01"
}