{
  "collections": [
    "Active Duty"
  ],
  "description": "We teased you with them in the War Chest, and now we're back with more Bryce and Kasen, but this time they're together and both of them are ready to take things to the next level.While Bryce is taking a nap, Mike was working his magic behind the scenes on the phone. Mike called up Kasen and sealed the deal. While Kasen is on his way over, Mike tells Bryce what's about to go down. He suggests that Bryce get that big cock of his all nice and hard before Kasen arrives so they'll be ready to go as soon as he arrives.The knock comes at the door and Bryce is all eyes, watching to see who's coming in. He looks Kasen up and down while he continues stroking his cock beneath the sheets. Kasen starts stripping down off camera and you can see Bryce watching. Kasen jumps on the bed butt ass naked and playing with his cock.These two waste no time getting right down to the business at hand. Kasen suggests to Bryce that he try sucking him off and Bryce is more than willing to give it a try. By the looks on Kasen's face and the moans, he's approving of the new cockcsucker's enthusiastic start. Bryce's big piece of meat is swinging in the breeze as he works his magic on Kasen's cock, deep-throating is and slurping like he likes what he's doing.They switch it up and Kasen goes to town on Bryce's big cock and you can tell they are both loving it. Kasen has some good skills as he puts his hand in the mix, stroking as he sucks the monster. Bryce is very vocal and letting his cocksucker know just how damn good it feels. These two are a perfect match and Kasen is the perfect cocksucker for Bryce's first time. Talk about making love to a cock and talk about really appreciating a damn good blowjob -- both apply to this duo.Kasen is having a lot of fun with his big new toy as he slaps it on his face and goes all the way down on that big cock, gagging himself a few times. Bryce's moans and reactions are priceless and tell the story about just how damn good it's feeling about now. I'm not sure when I've seen someone work a cock like this, but Kasen means fucking business. Wouldn't we all with a beautiful cock like that in front of us?Bryce pulls his cock out of Kasen's mouth and jerks out his load all over his stomach, then turns his focus and attention to Kasen's cock, sucking and jerking it like a pro. He's definitely giving just as good as he got. Even if you're blind, you'll enjoy just the soundtrack to this scene as the moaning, slurping and vocals are amazing. These two obviously like what's going on. Bryce works Kasen to the edge and Kasen blows a huge fucking load all over himself. Mike can't resist getting his hands in the picture as he squeezes out the rest of Kasen's load. At least he has nice hands. The scene closes out with a promise from the guys that they'll return tomorrow for some more fun and Kasen make sure to say, 'As long as this guy's coming' as he points to Bryce.",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Kasen",
      "person_id": 35102
    }
  ],
  "release_date": "2011-12-18",
  "scene_id": 70487,
  "tags": [
    "Blowjob",
    "Gay"
  ],
  "title": "Bryce and Kasen: Oral"
}