{
  "collections": [
    "Active Duty"
  ],
  "description": "Today we are releasing a really hot five man scene featuring Bric, Rusty, Nick Gunner, Zander and Dustin.  This was a really fun shoot for everyone and we get to see some crazy antics with the guys playing around before the hot sex gets underway.  The 'man cave' proves the perfect spot for this to all go down and provides the atmosphere for the guys to play around and be goofy.Things get started with me joking around with Rusty as he walks around with a hard cock sticking out of his pocket.  I tell him that I don't believe him and he pulls it out to prove me wrong.  I tell him to put it away and then move over to Dustin to get him to show us his perfect bubble butt.  There's something about that beautiful little butt that just drives me crazy.  I tell him it's time for him to get up on the bar as I joke around with Bric.  At breakfast earlier that morning Bric was walking around the kitchen with his butt crack sticking out.  He shows us his breakfast butt and I move on to Zander who's sporting a nice impression of his hard cock through his jeans.  I convince him to show us and he gives us a nice showing of that delicious dick.  Zander and Rusty stand side-by-side showing off their cocks through the top of their pants and then pull out their nuts through their zippers.  They pull them out and their cocks kiss.The guys are now discussing the cost of hookers and how much they might charge for five guys.  The night before I had teased Bric about getting him a stripper and today I tell him the stripper is here.  Bric says he's excited and I bring out the stripper.  Dustin starts slowly crawling down the bar in a camouflage thong, collecting tips.  Sometimes you have to improvise and Dustin proves that he can shake it as good as any stripper can.  The guys happily tip him as he moves up and down the bar shaking his ass.  The guys throw their money and 'make it rain' and Dustin keeps on shaking it.Nick Gunner joins the fun and gets on the bar with Dustin to help him entertain the others.  They are having a lot of fun with this.  In fact, Nick Gunner's cock gets rock hard as he dances.  He slowly pulls his boxers down to reveal his perfect little ass and they convince Bric to climb up on the bar with them.  Now we've got three hot fuckers stripping for us.  Rusty and Zander keep throwing the tips as all three guys get butt ass naked.  You'll feel like you're right there getting a private dance yourself.Things soon go from stripping to sucking as all the guys get up on the bar and Dustin starts going down on Bric's hard cock.  Nick Gunner and Rusty are stroking their cocks as they watch Dustin service Bric's dick.  Bric gets Dustin to stand up as he takes his turn on Dustin's cock and strokes his own.  Meanwhile Nick Gunner is enjoying Rusty's hot mouth on his cock as Zander strokes Rusty's cock and watches him chow down on Nick's big dick.  Before you know it they're all in a tangle and everyone is either getting their cock sucked or tasting someone else's cock. The positions are hot and ever changing as everyone takes their turns getting and giving.They form a human centipede leaning to the right as Bric sucks Dustin, Dustin sucks Nick Gunner, Nick Gunner sucks Rusty and Rusty sucks Zander.  After some good sucking in this position Bric yells 'left face' and they switch again.  No one is left out on this formation.  But it isn't long before Zander decides he wants to fuck Rusty's ass and this starts a whole new fire in the room.Bric bends over and takes Dustin's cock up his ass as he sucks Nick Gunner's cock while Zander keeps fucking Rusty's tight ass.  The fucking gets loud and intense and soon Bric is ready to blow his load all over the place while Dustin pounds away at his ass.  Once he blows his load he's all about helping Nick Gunner get his and Nick Gunner works himself up to a huge fucking cumshaw that shoots in ropes across Bric's back, splattering all over Dustin in the process.  Dustin follows Nick's lead and blows his load all over Bric's hot ass.Zander and Rusty are up next and Zander keeps plowing Rusty's ass until he's ready to shoot.  Rusty gets down on his knees in front of him and takes his hot jizz all over his face.  Zander returns the favor and takes Rusty's load all over his face as the other fellows cheer him on.",
  "models": [
    {
      "name": "Dustin",
      "person_id": 35016
    },
    {
      "name": "Rusty",
      "person_id": 35168
    },
    {
      "name": "Bric",
      "person_id": 35047
    },
    {
      "name": "Nick Gunner",
      "person_id": 35123
    },
    {
      "name": "Zander",
      "person_id": 35166
    }
  ],
  "release_date": "2011-12-04",
  "scene_id": 70482,
  "tags": [
    "Anal Sex",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Gay",
    "Group",
    "Smooth"
  ],
  "title": "Bric, Dustin, Nick, Rusty & Zander"
}