{
  "collections": [
    "Active Duty"
  ],
  "description": "In our last War Chest Update we watched Brock and Ron go at it in a side-by-side double jerk-off session where we were reminded just how much Brock loves the camera and how fucking horny he gets when he knows he's being watched.  It's clear he really loves the attention.  It was the first time he'd shared the limelight with someone else and we quickly learn that if he feels like someone else might steal his show he'll work extra hard to keep the camera's attention on him.  Brock is a bundle of twisted-up testosterone just waiting to be unravelled.  Our buddy Mike quickly recognizes this and takes full advantage of it by teaming him up with a tried and true player on the Covert Missions team.This week Brock is back but he's got company again. This time it's the super adorable and hung Bryce.  Bryce is out of the Army now and he's looking better than ever.  Mike calls him in to help with his plan of getting Brock to take things to the next level.  Playing right into Brock's love of attention, Mike and Bryce work as a beautiful team to take Brock across the line.  But Mike plays it really smooth and let's Brock call all the shots, giving him plenty of room to put himself in the position it's so obvious he wants to be in.  You can lead a horny soldier to water but you can't make him drink.  You have to let him do that for himself and Mike understands this all too well.Bryce gets up to go to the bathroom and while he's gone Brock is stroking his hard cock hornier than hell. He looks at Mike and the camera and whispers, 'I think he wants to suck some cock.'  He's talking about Bryce of course and Mike wastes no time getting him to repeat what he said.  It's obvious he wants Bryce's hot mouth on his hard dick and he wants it now.  Mike tells him to ask Bryce when he returns and see what he says.  Now the tables have turned and the ball is in Brock's court.  He wastes no time making his play and as soon as Bryce is back he's asking away.Bryce isn't the least bit hesitant as this is exactly what he and Mike had planned all along. He gets down on his knees and starts servicing Brock's cock, working it good.  We all know that Brock likes his nuts played with and Bryce is sure to pay plenty of attention to the nice low hangers.  He's deep-throating that nice dick and licking those delicious balls and Brock is just loving it.  You can tell Brock is sure of his control in this situation and that's just fine.  He's getting what he wants, Mike and Bryce are getting what they want and so are all of us.Bryce makes quite a good cock sucker and he's all about giving Brock exactly what he wants. As we watch Bryce perfect his cock sucking skills, Brock is all about it.  He's getting into all this attention and the great service he's receiving from Bryce.  After enjoying a long, wet and sloppy blow job Brock shoots his load all over himself as Bryce jerks it out for him.  But Brock isn't your typical straight guy who gets his nut then zips up and leaves.  He makes sure to give Bryce a nice hand job that brings him Bryce to the edge as he explodes all over himself as Brock jerks his big meat.Mike is proud of his accomplishment but he isn't done yet.  He tells Brock and Bryce that they are all gonna go for some food and drinks and talk about something else.  Stay tuned to find out what they talked about and what happened next.",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Brock MB",
      "person_id": 35256
    }
  ],
  "release_date": "2011-12-11",
  "scene_id": 70484,
  "series": "Covert Missions 9",
  "tags": [
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Smooth",
    "Twink"
  ],
  "title": "Brock & Bryce"
}