{
  "collections": [
    "Active Duty"
  ],
  "description": "Bryce and Kasen are back the next day and ready to take things one step further. This is where things get very interesting. They talk a little about the first step together and Kasen says it wasn't his first time giving head but Bryce doesn't seem to care if he was the first or not as long as he got a chance.The cocks are already out and flopping around as soon as the camera comes on and Kasen is paying plenty of attention to Bryce's cock, but it won't be Kasen who is sucking first today. Bryce goes down on Kasen's big cock and deep throats it for a bit. They trade places and Kasen really gets into that big cock of Bryce's once again, making love to the monster and giving it plenty of attention. Kasen has this cocksucking thing down to a T and the way he uses his hand in conjunction with his mouth is a win! This boy can suck some cock. Bryce's dick is so fucking hard the guy is about to explode, but not until he gets to try out something else of Kasen's first.Mike and the boys throw us a big surprise and Kasen takes Bryce's cock bareback up his tight little ass and Bryce really gives it to him good. Kasen has no problem taking the huge cock up his ass as he straddles the big cock and teases it first before getting in position to let Bryce take the lead. Once he's in charge, Bryce really lays the pipe to Kasen's ass.Bryce is longstroking Kasen's ass and Kasen is taking it like a champ. That big, long cock is going balls deep into that sweet little ass as Kasen moans aloud. Bryce has some good rhythm going on and Kasen's moans are so sweet. Soon, he's telling Bryce to 'come for me' and that's all it takes for Bryce to lose his beads of cum all over Kasen's stomachs and cock.",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Kasen",
      "person_id": 35102
    }
  ],
  "release_date": "2011-12-18",
  "scene_id": 70488,
  "series": "Covert Missions 8",
  "tags": [
    "Anal Sex",
    "Duo",
    "Gay"
  ],
  "title": "Bryce and Kasen: Anal"
}