{
  "collections": [
    "Active Duty"
  ],
  "description": "Last week we introduced you to two really cute, sexy brothers Ronnie and Rex in separate solos in our War Chest Update. I hinted then that there was more of these two to come and tonight we're back to deliver just that. This time the brothers decide to rub one out together side-by-side and that's not all that happens.<br /><br />Mike gets the brothers back for round two and this time they're on the bed together in boxers when the camera comes on, rubbing their cocks and getting comfortable. Mike chats them up a little and gets us filled in on the 'back story' before turning them loose and seeing where things go. He pulls one of my old tricks and gets the brothers to scoot a little closer to each other as they continue playing with their cocks. Rex is the first to pull out his cock and start stroking. These two are so cute together. They share the same father and that's enough to have them sharing some features like the cleft in their chins, their noses and their smiles.<br /><br />Rex doesn't look nervous at all as Mike keeps pushing the envelope, asking how much more they think they might do together. By this time they are both naked and Rex is hard as a rock, big smiles covering their faces and the excitement of it all. Makes you wonder if they've practiced this routine together before but just aren't letting on. One can only fantasize.<br /><br />Rex loves showing off his big uncut cock and I love watching him. Mike zooms in to get some good close ups as he chats Rex up. Rex says he jerks off two or three times a day -- four if he has the apartment to himself. Mike gets him to show off that pretty little fury hole for us as he rubs it and spreads it out. The look on his face tells us that he enjoys playing with his hole and the way he navigates around back there tells us he's probably done it more than once. He sticks in a finger and massages it and then goes back to stroking his hard cock. Meanwhile brother Ronnie is busy stroking himself and starts playing with his ass, too. He gives us a nice show as he shoves his middle finger knuckle deep into his tight ass.<br /><br />This is where things take an exciting turn and suddenly Ronnie reaches over and grabs Rex's cock and starts stroking his brother off. Rex just lays back and enjoys the feeling of his brother's hand as Ronnie does all the work. It's shorter lived than I'd hoped, but just the fact that he touches his brother's cock at all is nothing short of amazing.<br /><br />He goes for round two though and makes up for the first time as he turns on his side facing Rex, stroking him harder and faster. This time he really seems to get into it a lot more as Mike instructs him to jerk his brother's cock until he cums. Rex must really like the way his brother's hand feels because he shoots a huge load all over the place.<br /><br />And just like most men, once he shoots his load, Rex is pretty much over the situation. Mike asks if he'll jerk Ronnie off and he says, 'prolly not, maybe another time?' and he heads for the shower while his brother finishes himself off.<br /><br />Will Mike be able to convince Rex to finish the job later? We'll have to stay tuned for the answer.<br />",
  "models": [
    {
      "name": "Rex",
      "person_id": 35136
    },
    {
      "name": "Ronnie",
      "person_id": 35228
    }
  ],
  "release_date": "2011-12-18",
  "scene_id": 70486,
  "series": "Covert Missions 8",
  "tags": [
    "Blonde",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Straight",
    "War Chest"
  ],
  "title": "Rex and Ronnie"
}