{
  "collections": [
    "Active Duty"
  ],
  "description": "I was digging around in my War Chest over the weekend and came across a very sexy hung stud that Mike from Covert Missions discovered some time back.  Mike met Jordan when he was still in the Army and tried his best to get him naked then, but Jordan was a little leery at first and held out, making Mike wait.  After getting out of the Army he realized he needed some money so he hit Mike up and came in for a solo.  I'm glad he did because this stud is hung like a cannon and hot as hell.<br /><br />Mike talks him up a little in the beginning to get the 411 for us as we learn that Jordan is 6' 2' and weighs 180 lbs.  He enjoys hunting, fishing and hanging out with his boys and drinking.  He's been out of the Army for about two months and is looking forward to the future.  Jordan says he's a little nervous but it doesn't take him very long to come out of his shirt but once he does that body is smoking.  Those nipples are so fucking lickable and those abs are delicious.  Once his massive cock appears on the screen you'll lose your beads over this one, troops.  His darker complexion gives him an exotic look and that dick is so fucking suckable.  Mike puts him through the paces and gets us a peek at every inch of that gorgeous body including that nice ass that he bends over to show off as he spreads his cheeks out to give us a full view.  That cock stays rock hard the entire time and Jordan doesn't miss a beat.<br /><br />Jordan keeps edging himself, working that cock like a part-time job over and over again until he can't hold back anymore.  He's very vocal when he gets ready to shoot his load and it lands in a nice puddle all over his stomach, forming a cum pool in his sexy belly button.",
  "models": [
    {
      "name": "Jordan II",
      "person_id": 35262
    }
  ],
  "release_date": "2011-12-14",
  "scene_id": 70485,
  "series": "Covert Missions 15",
  "tags": [
    "Gay",
    "Solo",
    "War Chest"
  ],
  "title": "Jordan"
}