{
  "collections": [
    "Active Duty"
  ],
  "description": "Mike took Bryce and Brock out for some drinks after they shot the oral scene we saw last week and talked them into taking things further.  So, this week they return to finish the deed and Bryce gives up his virgin hole to the hot, rambunctious Brock who takes it with pride and gusto.  We've all learned what a firecracker Brock can be when the camera is on him and today's scene is no exception.  Brock is glad to be the center of attention and he's more than glad to stick his nice cock in Bryce's hot hole bareback.Things get started with Mike and the guys shooting the shit about their plans.  Mike boasts about getting Bryce to agree to what is about to happen and Bryce says he's willing to try.  Mike leaves the boys alone to talk as he heads down to the bar for another drink.  They talk a little about the oral scene they did previously.  Brock also asks Bryce about his 'girl' and Bryce confirms he does have a girl in his life.  Brock doesn't seem too interested in talking more about her, he gets right down to playing with his cock.  He's about to give Bryce something his girlfriend can't give him.Bryce locks his eyes on Brock's crotch as they talk about the new experience all this is for them.  Something tells me they are both liking things so far.  Brock strikes me as just a horny devil that will put his cock where ever he can to get it off and Bryce's ass is as good a place as any.Bryce starts helping Brock get undressed and Brock returns the favor as they remove each others shirts then start playing with their cocks.  Mike comes back to man the camera as they continue on their journey.  Bryce's long cock comes out and it's looking as delicious as ever.  Bryce helps Brock out of his pants as he strokes himself.  He quickly gets his hands to exploring Brock's body as he takes Brock's boxers off and throws them across the room.  Brock shocks us as he reaches over and grabs Bryce's big cock and starts stroking it.By the look on Brock's face you can tell he likes playing with the big cock in his hand and he makes sure to help Bryce out of his jeans, too.  Brock is all smiles like a kid in a candy store.  He goes back to jerking Bryce's cock while Bryce plays with his.  Bryce goes down and gives Brock some head to help him along and Brock starts moaning.  Doesn't take long for that hot mouth to get Brock's cock standing at attention and it doesn't take long for Bryce's cock to rise fully to the occasion.  Having a cock in his mouth makes his dick instantly hard and he strokes himself while he sucks on Brock's nice meat.This shoot is all about new experiences and Bryce takes things to the next level when he raises Brock's legs and begins eating his nice hole, tonguing it as he strokes Brock's cock and licks his balls.  After eating Brock's ass a bit he gets back to that nice dick and keeps working it good.  If anyone has ever made sweet love to a cock, Bryce is right up there with them as he marries his mouth to Brock's dick.  You can tell he's having fun with this.Brock is rock hard by now and Bryce is ready to ride.  He crawls on top of Brock and guides his dick into his ass raw.  All the while Brock is stroking Bryce's cock while it's right in his face.  Bryce is slowly working Brock's dick into his tight ass as Mike instructs him to take his time.  Once it's finally in, Bryce sits all the way down on that thing, taking it to the balls.While Bryce rides, Brock strokes his hard cock for him fast and hard, working it over good and eventually making Bryce blow a huge load all over his stomach.  It's a nice, thick creamy load but this is where the real fucking begins.Brock puts Bryce on his back and raises his legs to give him better access to that sweet virgin ass as he buries his cock balls-deep into Bryce and starts pounding him good and hard.  Bryce is taking it like a champ and the looks on his face are priceless.  Brock has unleashed his fury on that furry hole and he's going for the finish line as he bangs his balls hard against Bryce's ass cheeks.  Mike eggs him on from the sidelines as he tells him to 'bury that motherfucker'.  One of the sweetest things during this intense fuck is the way Bryce holds Brock's hand while he fucks him.  Tender moments are always sweet no matter how rough the fuck.  Brock fucks him right up to the cumshot then pulls out and shoots his load all over Bryce's balls.  They give each other a big hug and Bryce admits that it hurt a little but felt good, too.  Enjoy, troops!",
  "models": [
    {
      "name": "Brock MB",
      "person_id": 35256
    },
    {
      "name": "Bryce 2",
      "person_id": 2
    }
  ],
  "release_date": "2011-12-18",
  "scene_id": 70483,
  "series": "Covert Missions 9",
  "tags": [
    "Anal Sex",
    "Blonde",
    "Brunette",
    "Duo",
    "Gay",
    "Smooth",
    "Twink"
  ],
  "title": "Brock & Bryce"
}