{
  "collections": [
    "Active Duty"
  ],
  "description": "Things kick off with Bryce, Drake and Ray all on the couch talking shit to one another and commenting on the porn.  Someone suggested that Bryce put on a pair of stockings but he declines.  You can tell these three have been buddies for awhile just by the way they horse around and get along so well.  And all three are really hot so I'm sure you'll find a favorite in this trio.  I know I did, but I'm not revealing my crush this time around.  The Major gets all the lowdowns as he asks the guys about what they did over the holidays. Drake gets the cock pump out to get the circle jerk started right.  He's so fucking sexy in his cut off shirt and he just adds to his cuteness when he puts his cowboy boots back on once he takes off his pants.  Ray lubes up the pump and pumps it for Drake to help him get going. Bryce helps out some, too.  What are friends for?  That's right, they're there to help you pump your cock when you need it.  They're all having fun with this and it's really cute to watch.Drake tells Bryce you gotta have balls to use the cock pump and Bryce says he's ready to try it, but Drake doesn't want to give it up just yet.  He's having too much fun pumping his cock.  His cock is rock hard as Bryce and Ray provide the pressure and the sound effects.  Bryce finally gets his change but he mans the pump himself.Ray and Bryce lube up each of Drake's hands so he can go skiing with their cocks.  He reaches on either side of him and grabs his buddies dicks and starts stroking them.  Ray reaches in and grabs Drake's cock while Bryce clutches his balls.  Everyone's got their hands on cock now and Ray is really enjoying his hand job.Drake is the adventurous one in the bunch and he takes things a little further when he gets his hands on a dildo that the Major has.  He shoves it up his ass and starts pushing it in and out while he strokes his cock.  The other guys hold his legs back for him to make it even easier.  Next thing you know Drake is sucking on Bryce's cock.Ray ends up on the floor with Bryce and Drake jerking off over him.  Bryce is the first to pop his load and it's a huge one.  He covers Ray in jizz.  Drake wants some help so the Major offers to lend a helping hand and that does the trick.  Bryce is really getting into the hand job and you can see it on his face.  Ray goes for a second cum shot followed by Bryce while the Major finishes Drake off.  It's two to one on the cum shots and Drake makes up for lost time by shooting a huge load as the Major antagonizes him by continuing to jerk him after he cums.  What a fun shoot this was and you can tell these guys all had fun.They finish things off with a nice hot shower together as they joke about what they just did.",
  "models": [
    {
      "name": "Ray",
      "person_id": 35183
    },
    {
      "name": "Bryce 3",
      "person_id": 3
    },
    {
      "name": "Drake 2",
      "person_id": 2
    }
  ],
  "release_date": "2011-12-28",
  "scene_id": 70493,
  "series": "Special Ops: Bravo Company",
  "tags": [
    "Gay",
    "Jerk Off",
    "Smooth",
    "Threesome",
    "War Chest"
  ],
  "title": "Bryce, Drake & Ray"
}