{
  "collections": [
    "Active Duty"
  ],
  "description": "Bryce has proven to be a huge asset to Mike for more than just his big dick.  He's been Mike's go-to guy for awhile now, helping him turn guys out and bring them across the line.  So, naturally Mike knew he could call on Bryce to help him in his mission with Rick.Things kick off with Rick under the sheets naked playing with his cock as he and Mike talk about the solo scene he did the day before.  Mike lays on the usual bullshit and starts pushing the envelope.  He gets right to the point with Rick and Rick said he's down to at least get a blow job and see where things go from there.  Bryce knocks at the door.  How convenient! LOL. And Mike asks him to come in and go ahead and get naked while Rick jerks his cock and gets a nice hard on for Bryce to play with.Next thing you know Rick is pulling back the sheets and showing off his nice hard cock.  That's Bryce's cue to join in and have some fun.  Mike keeps Rick waiting for a minute before sicking Bryce on him and it's just enough time to get Rick all horny and ready for action.  By the time Bryce makes his way over to Rick, he's all hot and bothered.Bryce comes on the scene with a raging hard on already and gets right down to business.  He latches on to Rick's hard cock right away and goes to town.  Rick immediately starts in with the dirty talk and moaning and you can tell he's happy to have such a cute cock sucker worshipping his dick.  And Bryce is damn good at what he does.  At Mike's request Rick starts telling Bryce just how he likes it and Bryce follows orders well.  Rick is rubbing all over Bryce's body and looking at his ass and cock.  Rick's enthusiasm makes Bryce better at what he's doing.  After all, a good cock sucker's reward is always a good response from his suckee.  In fact his response to Bryce is so good that he shoots a huge load all over the side of Bryce's face and you can tell Bryce is proud of his accomplishment.It's at this point that things take an interesting turn and Rick goes from dominate to a little submissive when Mike tells him to jerk Bryce off in return.  Bryce is so horny from sucking that cock that it doesn't take long for him to blow his load.  His belly is full of cum and so is his face.  If you ask me that's a win/win situation to be in.",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Rick",
      "person_id": 35272
    }
  ],
  "release_date": "2012-01-04",
  "scene_id": 70492,
  "series": "Covert Missions 10",
  "tags": [
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Smooth",
    "War Chest"
  ],
  "title": "Bryce & Rick"
}