{
  "collections": [
    "Active Duty"
  ],
  "description": "Major Wood starts out chatting up Scott as we get to know a little about this deep-voiced masculine stud.  He's been in the military for a short time and he's having fun out in Southern California.  He's been having fun with the beaches and the city and that makes up for not being able to do exactly what he wanted to do in the military.  Scott told the Major that he was open to new experiences and tells him a story about something that happened before he joined the military when a guy came on to him with a proposition he'd never tried before.  The story is interesting and Scott says he'd be cool with having another similar experience and possibly taking it even further.The phone rings while they're talking and it's Brent and Zack who are outside the building.  The Major lets them in and they sit down on the couch with Scott.  Scott already has his shirt off and Brent is all smiles.  You can tell Brent is ready to jump Scott as soon as he sits down.  Brent and Zack waste no time getting out of their shirts and the Major quickly gets things going.  Brent goes for Scott's cock while Zack starts kissing his neck and rubbing his legs.  Brent moves up to give Scott a kiss while Zack goes down to taste his cock.  Brent removes Scott's glasses and goes for another kiss.  Scott doesn't hesitate at all and seems comfortable with the way things are going.Brent and Zack go back and forth on Scott's cock, tag-teaming his dick and the Major suggests that Scott reach over and help Zack out a little while Brent continues to blow him.  Zack comes out of his jeans revealing his Navy PT shorts.  Scott is super hard from all the attention as he plays with both Brent and Zack's cocks a little.  When Brent pulls out his big, fat cock a big grin comes across Scott's face.  Zack takes his Navy PT shorts off to reveal a raging boner as things get hotter with this trio.  All the boys are super hard and horny as the Major encourages them on to take things further.Zack and Scott lock lips in a deep kiss as Brent sucks Scott and Scott jerks Zack.  Everyone's having themselves the time of their life and the kisses just keep getting hotter.  Finally Zack moves up to give Scott access to his cock and Scott wastes no time at all getting the stiff dick in his mouth.  Brent follows Zack's lead and before you know it, Scott has both nice cocks in his mouth.  He's going between the two like he can't decide which one he likes best, but that's OK because he has them both.  Zack and Brent go for a hot kiss as Scott works their cocks.Zack stands over Scott and feeds him his cock while Brent works on Scott's cock some more.  Watching Scott slowly take Zack's cock in and out of his throat is so hot to watch.  You can tell he's been wanting to do something like this for a long time.  They turn Scott around and he goes down on Zack while Brent starts eating his nice virgin ass.  He's tongue fucking his hole and getting it all hot and bothered as Zack enjoys Scott's hot mouth.  Something tells me that things are about to take a very hot and interesting turn.Scott's cock is rock hard from all the attention and Brent is jerking it while he eats his ass.  Scott is looking up at Zack with his mouth full of his hard fat cock and you'll wish you were right there with them.  Brent turns the ass he's just eaten over to Zack to break in and moves into Zack's place to let Scott suck his dick as Zack moves in behind Scott and slowly starts burying his cock in his ass.  Scott flinches a little as it goes in but once it's in he's good to go.  Brent talks him through it a little and he loosens up nicely.  Before long Zack is slamming his cock in and out of Scott's ass like a jack rabbit and Scott is taking it like a champ.  Scott's cock is raging hard the entire time and Zack reaches around and starts stroking it for him as he sucks faster and harder on Brent's big dick.  They're fucking this newbie right and he's loving every second of it.They switch positions and Brent takes the reins as he lays on the floor and lets Scott ride his big meat.  All the while Zack is stroking Scott's dick as they work the big cock up his ass.  Soon Scott is bouncing up and down on the big dick while Zack strokes his cock for him.  He shoots his load all over Brent's stomach but things aren't over yet.  They put him on his back on the couch and Scott goes for another load as he strokes himself while Brent pounds his ass again.  This boy is horny and Zack and Brent are making sure he gets to have as much fun as he can.  He's stroking his super hard dick fast while Brent slowly goes balls deep in and out of his ass and rubs his chest.  Brent takes matters into his own hand and helps Scott out while his cock is buried deep in his ass.The three of them finish off side-by-side and blow their loads, leaving them exhausted but satisfied.",
  "models": [
    {
      "name": "Brent II",
      "person_id": 35265
    },
    {
      "name": "Scott II",
      "person_id": 35266
    },
    {
      "name": "Zack II",
      "person_id": 35267
    }
  ],
  "release_date": "2011-12-25",
  "scene_id": 70491,
  "series": "Special Ops: Bravo Company",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Gay",
    "Kissing",
    "Threesome"
  ],
  "title": "Brent, Scott & Zack"
}