{
  "collections": [
    "Active Duty"
  ],
  "description": "Taylor has been around for awhile now but so far he's managed to keep his virgin ass safe from an invasion.  All that changes today as he steps up to save the scene and gives his virginity to Ransom.  Things don't always go as planned and sometimes someone bites off a little more than they can chew.  Such was the case when Tatum told me he would bottom, but when it came time to give it up, he got cold feet after one or two tries and decided he wasn't quite ready.  To my surprise, Taylor stepped up and offered to take Tatum's place.Tatum has been a tough nut to crack, but we're slowly working on him.  Many of you will remember other such guys---Cash comes to mind when I think about who Tatum reminds me of.  But, there's one thing about Tatum that can't be denied and that's the fact that he's a great top.  That boy can pound an ass like nobodies business and never once go soft.  He's a hard hitting top with the stamina to match, but he wasn't as ready as he'd thought to switch sides and take it just yet.Taylor has been holding out and has never once offered to bottom, but in today's scene he's a trooper and really comes through.  Once he sees that Tatum is having trouble he jumps in to save the day, leaving both Tatum and I relieved.  What do you do when the scene is half way done and difficulties arise?  If you're Taylor you put on your hero outfit and answer the call of duty.Tatum and Ransom both have their fair share of shining moments in the scene, too.  Tatum gets himself a double dose of good head as Taylor and Ransom share his cock and he does a little cock-tasting himself as we move him along.  Ransom winds up on the receiving end of Tatum's thick ass dick and says a few times that he can feel it ripping him open.  Tatum pile-drives his dick in and out of Ransom like a jack hammer pounding the concrete.  Ransom takes it like a champ, though, giving Tatum a willing hole to drill.Tatum is so cute and you can tell this is all new to him.  He's a little unsure of how to proceed with things, but once Ransom puts the condom on his cock, lubes it up and asks, 'you ready to put this big thing inside of me?' -- Tatum knows just what to do.  He lets Ransom work his thick cock into his ass and once it's in, Tatum goes for the gold.  All the while Ransom is gagging and choking on Taylor's big cock while Tatum manhandles his ass.Once the tables turn and Taylor is on the bottom, the faces and noises he makes are priceless.  He's finding out what it feels like to be on the receiving end after plowing so many tight asses with that big cock of his.  Everyone gets their load and the boys joke a little at the end.  Ransom gives Taylor a hard time and the banter is priceless.  Enjoy, troops.",
  "models": [
    {
      "name": "Ransom",
      "person_id": 35131
    },
    {
      "name": "Tatum",
      "person_id": 35258
    },
    {
      "name": "Taylor",
      "person_id": 35153
    }
  ],
  "release_date": "2012-01-01",
  "scene_id": 70494,
  "series": "High Alert",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "First Time",
    "Gay",
    "Tattoos",
    "Threesome"
  ],
  "title": "Ransom, Tatum & Taylor"
}