{
  "collections": [
    "Active Duty"
  ],
  "description": "We're back with a hot new recruit for you in the War Chest Update tonight.  Major Wood is back at it and he's introducing us to his latest find, Brady.  Brady will be featured on the soon to be released Special Ops: Bravo Company DVD.  Get ahead of the pack and check out this stud over the Holidays in between your egg nog and last minute shopping.  I think you'll agree, he's a keeper.Major Wood starts things out by getting all the particulars out of Brady.  We learn that Brady is from Florida, he's 23 years old, 6' 1' and weighs approximately 175 lbs.  He's got some nice ink and the Major gets him out of his shirt to show off his tattoos.  As we look at his ink we get a good look at his gorgeous nipples.  Brady says he's been fighting mixed martial arts (MMA) and one of his fights was on pay-per-view.  He's sporting some really sexy eyes that I could just get lost in.  The Major drills him about when he lost his virginity and he says it was his senior prom.  They talk a little about that experience and Brady seems pleased with the outcome.After the chit-chat, Brady gets right down to business playing with his dick and working it up through his jeans.  It doesn't take long at all before he's pulling out a nice long, curved hard cock that he starts stroking fast and furiously.  Brady tells the Major that the last time he measured it was about 8 inches.  I love a curved cock and Brady certainly has a very nice one.  You can tell by the way he handles it that he spends a lot of time playing with it and can you blame him?  I'd be playing with it all the time, too, if I could.The pants eventually come off to reveal some really nice fury legs and a better view of that beautiful cock.  I could personally watch him all day myself.  Major Wood gets in close to get a better look at that cock for us a few times and when Brady stands up that monster bangs against his stomach.  He moves to the edge of the bed to watch himself stroke in the mirror and you can tell he's proud of what he sees.  He stands up again and moves closer to the mirror as the Major follows, getting a nice view of that sexy bubble ass.Brady lays back on the bed to go for the final round, working that nice cock up to a very impressive explosion that shoots all over his nice, smooth stomach and that delicious treasure trail.  Brady is clearly proud of his accomplishment and says that's the biggest load he's popped in a long time.  He's all smiles and now we're all messy.  Be sure to rate this video according to how much you'd like to see Brady in the future as he's already said he's ready for the next mission.  If he gets more than 3.5 stars we'll bring him back for the next step.",
  "models": [
    {
      "name": "Brady",
      "person_id": 35264
    }
  ],
  "release_date": "2011-12-21",
  "scene_id": 70490,
  "series": "Special Ops: Bravo Company",
  "tags": [
    "Brunette",
    "Gay",
    "Solo",
    "War Chest"
  ],
  "title": "Brady"
}