{
  "collections": [
    "Active Duty"
  ],
  "description": "In today's scene things begin with me zoomed in on Bentley playing with that massive cock of his through his dirty gym shorts.  The outline of that big monster alone is enough to make your mouth water.  This boy was certainly blessed.  But this isn't just any big piece of meat, it's the beloved Bentley from Amateur Straight Guys glory.  As he shows off his cock we joke back and forth.  It isn't long before I get him out of his shorts to reveal that cock better through his sexy tight underwear.  All the while that big monster is growing by the minute.  We chit-chat about his years at ASG and how much fun he's had making porn. (And believe it or not, after all that time at ASG, he never bottomed. Well, that's all about to change. . .)<br /><br />We get Bentley to join his newfound comrades on the bed where he gets in the middle of Brian and Ethan.  We all joke and talk a little more and I embarrass myself by not remembering Ethan's name.  It's all good though, when you're a hungry newcomer like Ethan your name doesn't matter as much as how well you perform.  Ethan is openly gay and confesses his love of sucking cock without hesitation.  I tell the guys I've got some laundry to do and I leave them alone to get comfortable.  Before I even leave the room the AD boys area all over Bentley kissing him and welcoming him to the family.  There's lots of hot kissing to kick things off and then Ethan goes straight for the beef, taking Bentley's huge cock down his throat like a pro.  Bentley is clearly impressed by his skills and calls his the best welcoming gift he's ever gotten.  All the clothes come off and the action continues with these three.  The chemistry is there from the beginning and it doesn't take much direction on my part to keep it flowing.  These three had spent some time together out and about on the days leading up to this scene so they were comfortable with each other already and I think looking very forward to all of this.<br /><br />Ethan goes back to work on Bentley's cock while Brian keeps him busy with kisses.  They share that cock back and forth and alternate the role.  Then, Ethan and Brian go for a hot ass kiss while playing with Bentley's dick.  Ethan is having a great time just watching Brian suck Bentley's cock as he works on his own.  Even Brian is impressed with Ethan's enthusiasm for Bentley's hot cock and the way he ravishes it each time he gets his turn.<br /><br />The kisses are as hot as anything else in this scene to me and I can see how they all stayed hot and bothered by just that action alone.  Brian and Ethan go for another kiss while Bentley decides to give their cocks a taste.  he goes back and forth between the two, enjoying a double dose of cock while they take their turns on his.  Brian moves to Ethan's cock while Bentley sucks him and he jerks Bentley.  Bentley is as happy as a young man in a candy store and the smile on his face confirms it.  He's having the time of his life with these two and things are hot as hell.  They take turns fucking his face and feeding him cock but they are sure not to leave him out.  That big cock swinging in the wind is enough to leave one speechless and when he takes both their cocks together it's simply delicious.<br /><br />After lots of oral examination it's time to do what Bentley came for.  Ethan gets him on his knees and I tell him to arch his back.  All the while Bentley is sucking on Brian's cock while Ethan eats his ass, spitting on that virgin hole getting it nice and lubed up for the fucking.  Ethan's cock is at stiff attention as he plays with that ass and big cock of Bentley's.  You can tell he's ready for the mission of deflowering the virgin hole.  I instruct Brian and Ethan to 'take no prisoners'  so Ethan opens that hole up with lots of lube and two fingers as Bentley tries to relax and ready himself for the cock.<br /><br />Bentley has put himself in the zone by now and he's ready for whatever happens next.  That ass is worked out and ready to receive.  Ethan digs in with two fingers and it looks like a go.  Brian's hard cock is keeping Bentley's attention devised while Ethan saddles up for the initial ride.  He moves in closer and rubs his cock up and down the crack a little before slowly working the head of his cock into Bentley's ass like he'd previously done with his fingers.  Bentley moans and grunts a little as he gets used to the feeling of a cock in his hole and Ethan eases the pain with a few tender kisses to his neck and ear.  In no time at all they've got him relaxed enough for Ethan to pound that tight hole.  Bentley puts up some resistance but doesn't give in.  The more Ethan works it, the less Bentley resists and he keeps pounding him hard, going balls deep and slapping his balls against his ass.<br /><br />In a funny moment I say, 'it doesn't feel as bad as you thought does it?' and Bentley answers, 'oooooh yeah.'   But he doesn't jump and run.  After he's opened that hole up nicely we take a minute to look at the damage as that pretty pink hole spreads open.  He's a virgin no more and Ethan has stuck to the plan of taking no prisoners.  Ethan works his way back in that pleasure cove and starts pounding him again.  Bentley is taking it like a champ by now as Brian helps him continue to relax by rubbing his shoulders and fucking his face.<br /><br />They put Bentley on his back and Ethan sucks his cock, getting him nice and hard before they fuck him again.  I wanted to see if Bentley could cum with a dick in his ass.  Once Ethan has that big cock at full attention with the veins popping out, it's time to go back in.  Ethan fucks his ass while Brian sucks his cock.  They switch up and Ethan mans the big cock while Brian pounds his ass.  Once Brian starts pounding him hard, Bentley starts screaming out again.  Ethan straddles his face and fucks it to keep him quiet while Brian mans the hole.<br /><br />The other hot part happens when Brian and Ethan decide to blow their loads in Bentley's mouth.  Ethan goes first and delivers a thick, gooey load in his mouth.  Brian follows Ethan and shoots his big wad into Bentley's mouth, filling it with hot jizz as Ethan licks Bentley's balls to help him get off.  Bentley blows a huge load all over himself and Ethan licks it up and shares it with Bentley.  Bentley puts a big gob of it on Ethan's head and everybody gets a good laugh.  This scene was a lot of fun to shoot both for myself and the boys.  I think you'll see why it's remained the fourth-most popular scene on ASG out of over 500 scenes!",
  "models": [
    {
      "name": "Bentley",
      "person_id": 35273
    },
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Ethan",
      "person_id": 35211
    }
  ],
  "release_date": "2012-01-08",
  "scene_id": 70499,
  "series": "Drafted 4",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Facial",
    "First Time",
    "Gay",
    "Kissing",
    "Tattoos",
    "Threesome"
  ],
  "title": "Bentley, Brian & Ethan"
}