{
  "collections": [
    "Active Duty"
  ],
  "description": "You can tell Rick is nervous but eager.  He's a hot Latino stud with beautiful skin and a hot body to match.  Mike gets him all cozy with a little chit-chat to start.  We find out that Rick is 21 years old, he's 5'9' and weighs in at 170 lbs.  He's got perfect lips that are so damn kissable and a well defined face.  Once Mike gets him out of his sweatshirt we get an eyeful of that body that he works so hard on.  Rick says he works out five times a week and it shows.  He pulls off his sweatpants to get comfortable and he's sporting a sexy pair of tight white boxer briefs.  He's already playing with his cock for the camera while Mike piddles around in the background looking for another glass of rum.Rick isn't shy a bit and he loves the camera.  He's eager to show off and you can tell.  He strips out of those boxer briefs pretty quick to get a better grip on the situation.  He has a unique rubbing technique that he uses to get hard that I found interesting.  He asks Mike if he can get on the bed and once he does, that's when he really gets going.  He gets that beautiful cock hard and we see that he's got a nice curve at the head.  Rick is also very vocal and likes to make lots of noises and talk dirty while he beats his meat.  Just his moans and dirty talk and the obvious way that he's so into what's going on is a turn on all to itself.Mike puts him through the paces and he passes the test with flying cum all over his stomach.  Once he's popped his load Mike gets him to turn over on his stomach and show off that ass.  He puts on one hell of a hot ass show for us and leaves us wanting more.  This boy is a wild one and we're about to see him get even wilder.",
  "models": [
    {
      "name": "Rick",
      "person_id": 35272
    }
  ],
  "release_date": "2012-01-04",
  "scene_id": 70498,
  "series": "Covert Missions 10",
  "tags": [
    "Brunette",
    "Gay",
    "Solo",
    "War Chest"
  ],
  "title": "Rick"
}