{
  "collections": [
    "Active Duty"
  ],
  "description": "We've got a really hot duo featuring Bric and Boyd where Boyd takes things a bit further than he did in his first scene with Taylor.  Boyd decides to saddle up and take Bric's hot ass for a blistering ride.  We get to watch it all unfold as these two develop a chemistry that becomes a great mix.  Boyd certainly enjoyed this next step and the cum shot he delivers all over Bric's chest at the end is all the proof we need that he had a great time taking things to the next level.<br /><br />We start things out with a challenge to Bric to take his learned magic and make it work on Boyd.  I leave the room to bake a pie and Bric starts asking Boyd questions about his first time.  Boyd doesn't seem as interested in talking about his first time as he does getting down to business for this second round.  They take off the shirts and Bric gives him the once over and compliments Boyd on being all bulked up and in great shape.  Boyd is getting in his fair share of glances toward Bric as he sizes him up in return.  <br /><br />I tell Bric that Boyd is so good at showing off his ass and Bric jumps the gun and tries to get him to give him a dance.  Boyd assures him that it'll come later and Bric seems intent on holding him to his promise.  The pants come off and they're wearing the exact same boxers.  I later joke that they must have already met and made fashion decisions together before the shoot.<br /><br />I had told Bric that the guy he was going to work with today was packing 11 inches.  The thing you gotta love about Bric is that he still showed up.  He gently works Boyd to show off his cock and Boyd is all eyes on Bric's crotch to see what he's working with.  Boyd is already hard when he pulls his out and Bric reaches over to give it a few tugs.  Bric wants his new buddy to be comfortable so he offers to start things off by blowing Boyd who lays back and starts to enjoy.  Bric takes great care in making love to Boyd's nice dick and Boyd relaxes.  Bric's hard cock is hanging out as he strokes himself a bit but keeps the focus on Boyd.  Boyd sees Bric's dick just hanging there and decides to reach over and give him some action, too.  He rubs it smoothly, caressing the head as Bric continues to treat him to some great head.  <br /><br />Bric takes Boyd's boxers all the way off to give him better access and Boyd continues to work Bric's cock in return.  Bric stars kissing up Boyd's stomach and chest and licks his nipples a bit.  All the while Boyd is getting more aggressive as he tugs on Bric's uncut jewel.  Bric removes his boxers to free things up and Boyd decides it's time to return the favor.  Watching Boyd suck a dick is like watching an artist paint his masterpiece.  This boy really gets into making love to a cock as he works his own hard dick all the while.<br /><br />Bric switches positions so he can watch Boyd's beautiful ass in the mirror while Boyd works his dick.  And what a perfect ass it is to watch.  Boyd knows exactly how to use his ass to his advantage.  The end up in a sixty-nine with Boyd on top and continue pleasuring one another.  They flip on their sides and Boyd's cock sucking gets even more aggressive.  After some mutual affection, Bric lays back and enjoys all the attention Boyd is giving his dick as Boyd shows off his skills.<br /><br />They end up side-by-side again locked in a deep kiss as they continue fondling each other and stroking one another's cocks.  The kissing goes on for awhile and Bric finally pops the question, 'have you ever fucked a guy before?'  Boyd says, 'no, I haven't' and Bric asks if he's feeling pretty comfortable rig now.  The answer comes when Boyd shoves his hard cock deep in Bric's ass and begins to slowly plow his hole.  His ass fucking becomes as aggressively intense as his cock sucking was.  He's banging Bric's ass hard and fast as Bric's hard cock swings in the breeze.  Looks like we found something Boyd really likes and according to the big grin on Bric's face, he's good at it, too!<br /><br />Bric starts really getting into as he strokes himself and tells Boyd to 'work it'.  Boyd does as he's told and works that ass.  Bric wants to get on his back but they end up with Bric riding Boyd's dick as he sits in a chair.  Boyd reaches around and strokes Bric's hard dick for him as he plows his ass.  He's giving it to Bric fast and hard and Bric takes over jerking his cock.  Soon he's shooting a huge load all over the place while Boyd's cock is balls-deep in his ass.  Boyd keeps fucking after Bric catches his breath and goes for his load next.  He keeps banging Bric's hole until he gets close and Bric tells him to cum on his chest.  Boyd does just that as he shoots one of the most amazing wads I've seen lately.  It's clear this guy was having fun.  Bric says, 'I guess you are comfortable now -- that might be as much as Nick' (meaning Nick Gunner) as he squeezes the rest of it out of Boyd's cock.<br /><br />In our close-out, Boyd says the experience was awesome as a big grin covers his face.  We fade out but I come back on for one more kiss as they lock lips and seal the deal.",
  "models": [
    {
      "name": "Boyd",
      "person_id": 35248
    },
    {
      "name": "Bric",
      "person_id": 35047
    }
  ],
  "release_date": "2012-01-15",
  "scene_id": 70505,
  "series": "Force Rendezvous",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Tattoos"
  ],
  "title": "Boyd & Bric"
}