{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden and Bric are of course at their best and Chaz is even able to get Bric all fired up in ways we've never seen him.  Kaden serves as the anchor and the one who Axl seems to gravitate toward the most, but he still gets (and gives) plenty of attention from the others.  All-and-all this is one hell of a first go for our man Axl and a fun time for all.  It's also a much longer scene than usual clocking in at over an HOUR LONG.  That gives us plenty of time to complete our mission of properly putting Axl through his Active Duty basic training.  I'm sure it's a training mission he or us won't soon forget.I begin by welcoming Chaz back to the fold and bullshitting with him for a minute.  He's as lively as he was the first day he arrived on the scene and he's looking as good as ever.  Even at 29-years old, those big blue eyes just sparkle and shine and his innate youthfulness brings the room to life.  Next I focus on Kaden who is all smiles and more than ready to come to the call of duty.  After the blonds, I turn to Bric who I call 'the pepper' and joke with him a little.  I welcome Axl aboard and the other guys tell me to get lost and go bake a pie.  Axl says he trusts these guys to show him the way, but I'm not going anywhere until I get Axl to show us some skin.From there, the guys take over and welcome Axl as they chat him up a little and see where his mind is at.  He's all smiles as the guys give him a little background and tell him how special he is.  Bric chats him up about his workout routine and Chaz quickly moves in and tells him to take off that jacket.  Chaz isn't one to waste any time before getting the action started.  Everyone is rubbing their cocks as they watch Axl take off his sweats to reveal a hot pair of clingy blue Calvin Klein boxer briefs.  They admire his great body and tell him how comfortable their about to make him feel.  Kaden suggests that to do that they should all take off their shirts, too.  Bric gets a chance to show off his tats as Axl admires his gorgeous body.  You can tell by the look on Axl's face that he's ready to get things going.  They keep chiding the newbie until they've got him out of his boxers with his hard cock swinging in the breeze.  Kaden senses that Chaz is ready to pounce and he wasn't wrong.  They all follow suit and lose their pants as Axl sits and watches, taking it all in.  Axl says, with a big grin, 'This is a whole lot of dicks.'Bric is the first to reach over and grab Axl's cock and then the others follow his lead and get a little feel.  Kaden asks who's gonna be the first to jump on Axl's cock and of course Chaz is the first to drop to his knees.  While Chaz sucks, Bric and Kaden worship Axl's body, rubbing, licking and caressing.  Axl takes Bric's cock in his hand and with a huge grin says, 'This thing's huge.'  Chaz then offers Bric the next place in line and Bric drops down to do the honors.  Kaden and Chaz suck and lick his nipples and slap his nice ass a few times, keeping him fully occupied.  It's clear he's loving his place at the center of all this hot attention.  He's keeping both of his hands busy with Kaden and Chaz's cocks and then Kaden takes his turn on Axl's rod.Chaz decides to taste Axl's ass while Kaden sucks his cock and gets behind him to spread open his cheeks.  Bric finds a place for himself licking and sucking Axl's nipples while Chaz and Kaden service him.  Bric and Axl lock lips in a hot, long kiss and you can just feel the heat in the room.  Things switch up a little and Kaden and Axl are being serviced by Bric and Chaz as they find their way to each others lips and begin some more hot kissing.    Chaz has his free hand on Bric's cock, stroking it as his own dick stands at full attention.  Another hot kiss ensues between Axl and Kaden and then Axl finds the sweet spot on Kaden's neck.Bric positions himself below Chaz to give him some of the oral loving everyone else is getting as he strokes his own hard cock.  Chaz manhandles both the cocks in front of him going back and forth between the two.  Chaz senses that Axl is ready to take a turn sucking some cock and Kaden invites his comrades to join him on the couch to give Axl three cocks to choose from.  He takes Kaden's dick in hot mouth first as he uses his hands to jerk and play with Bric and Chaz's cocks.  Axl is all smiles again and Chaz expresses his jealousy.  Axl quickly moves his attention to Chaz where he finds it just a little challenging to master that huge mushroom head, but once he does, he keeps the pace.Next he moves over to Bric's cock and Chaz finds his way behind Axl once again to lick that beautiful pink pucker.  This must get Axl pretty worked up as Bric is having 'oh wow' moments from his cock sucking skills.  Kaden is stroking himself and licking and sucking on Bric's nipples as Bric finds his way to Kaden's ear and nibbles on it playfully.  Bric latch onto Kaden's cock and jerks it, giving Axl the cue to pay it some attention.  All the while Chaz is eating and licking that nice ass of Axl's while Axl has plenty of fun at the other end.  Axl's doing such a good job on Kaden's cock that Kaden says, 'damn dude, if I don't find a girl tonight I might be coming to your room.'  Axl just beams.Bric suggests to Kaden that he move closer so he can service his cock and he does.  Bric says this is one hell of a sandwich to get in the middle of.  Kaden is soon fucking Bric's face while Axl sucks Bric's cock and Chaz moves underneath to service Axl's hard cock.  It's a free for all, troops and we're right in the midst of it.  It's at this point that they all decide to take this party to the bedroom where, as Bric puts it, 'We can really break this new car in.'Once in the bedroom, Chaz finds a place for himself at Axl's feet where he decides that the space between his arches are a perfect place for his cock.  He squeezes Axl's feet together and fucks his feet while Bric sucks Axl and Axl sucks Kaden.  Chaz is liking this footjob as Axl gets more intent on letting Chaz fuck his feet.  He gets involved in the rhythm to make it more enjoyable for Chaz as things keep heating up.  Bric decides to help out by first cupping his hand to give another bit of feeling to the foot fuck.  Eventually he decides that his mouth would feel much better meeting Chaz's cock at the other end, so he puts his mouth down there to catch Chaz's cock as it comes thrusting between Axl's feet.  Axl isn't sure what to make of it all, but he's certainly enjoying himself.Axl snuggles up next to Kaden closer, kissing and licking his neck while Chaz finds his way to Bric's cock and Bric finds Chaz's asshole and begins to finger it slowly.  Axl and Kaden are having a moment of cuddle time as Chaz reaches over and starts fingering Axl's hole.  Axl grunts a little as he adjusts to the feeling of Chaz's finger and Bric helps out by spreading Axl's cheeks apart.  Bric notices the pink ring and makes mention of it and I get a nice close up of it for us all to enjoy.  It is an amazing tight, pink hole that is so inviting.  The kisses continue between Axl and Kaden while Bric and Chaz play with his asshole.  Chaz manages to stick his middle finger in the sweet spot as he loosens the nice hole up.Meanwhile Chaz is working Bric's uncut meat with his mouth while he works Axl's ass with his finger and Bric works his ass with his finger, too.  Axl finds his way back to Kaden's cock as Kaden fucks his face.  Then they switch and Kaden sucks him a little more.  All of this is going on while Bric makes his first insertion into Chaz's ass which hasn't had a cock in it for quite some time.  Chaz grunts and moans until it's in and Bric starts pounding him deep.All of this and there's still 30 minutes more to go.  By the time it's over, everyone has gotten fucked and gotten to fuck someone else and Axl is a bonafide member of the Active Duty family.",
  "models": [
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Bric",
      "person_id": 35047
    },
    {
      "name": "Axl",
      "person_id": 35274
    }
  ],
  "release_date": "2012-01-22",
  "scene_id": 70507,
  "series": "First Strike",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Gay",
    "Kissing",
    "Muscular",
    "Rimming",
    "Tattoos"
  ],
  "title": "Axl, Bric, Chaz & Kaden"
}