{
  "collections": [
    "Active Duty"
  ],
  "description": "For several years now I've had a fetish that only comes out at certain times.  Usually it's when we have big parties and things get crazy.  In my closet I keep several sizes of leather outfits and usually I can find just the perfect fit for a guy who is up for the challenge of putting one on.  Sometimes it comes in the form of a dare or a bet or as the result of losing a game of pool and having to choose between a 'man thong' or putting on the ass-less leather chaps. Last year or the year before we featured a scene in the War Chest from one of these crazy parties that we entitled Four Play.  Among some of the crazy antics in the video was Styx, Fox and Scorpius dressed in leather.  Styx and Fox took things pretty far and did some pretty hot play while dressed in the leather digs.  But other than that much of this has never seen the light of day here on the site.The one thing I've found over the years is that most of the AD guys look damn good in ass-less chaps, vests and harnesses.  It just seems to be the perfect fit for them. And, they usually are very curious once we pull it out to see what they look like in it.  In fact, I've had guys ask to try it on even when they weren't the ones losing a bet or dare.  They gravitate toward it for some unexplained reason.  Usually, the look fits.  Maybe its all the machismo that goes along with the territory or perhaps its the well-defined bodies they have or the rough look some of them portray as a result of their ink work.  Either way, it's a damn sexy sight to behold to me.Another thing I've discovered is that a lot of the AD guys are actually pretty good dancers and if they didn't spend their days blowing shit up, they'd be a great addition to the line-up of your local gay strip joint.  Most have never considered it, but with the help of some booze and good music you can usually get them to give it a try.  Such was the case with Neal (you'll remember him from a more recent War Chest Update) one night we had a birthday party for a friend of mine and she kept commenting on all the hot guys.  I knew Neal could dance because he talks about clubbing it all the time and dancing the whole night away on the dance floor.  I jokingly asked Neal if he'd do a strip tease for my friend since it was her birthday and he was way more than willing.So, tonight's War Chest Update came as a result of that party.  I already had the leather so we set up a special solo shoot for Neal to don the leather and do a little bit of 'dancing' before getting down to business and jerking off.  The result was really hot.  Without music, he just went through the moves and put on one hell of a show and he looked damn good doing it in the ass-less chaps and leather get-up.  The way this guy teases us is out of this world.  It's mesmerizing to a degree and you can tell he's having a lot of fun getting us all riled up as he shakes his bubble butt and jerks his cock.  He's intent on jerking his cock slow and deliberately.  He ends things out with a great cum shot.Now I know there will be some of you who don't care for this and that's perfectly understandable.  But, I'd suggest you still take the time to watch it before you make a final decision.  And, remember, there's always the rating system that will reflect the overall consensus about it, so be sure to use it.  The rating system for each video lets us know loud and clear how much you like or dislike something and we certainly pay attention.  The rating system for each video lets us know loud and clear how much you like or dislike something and we certainly pay attention.  Now, go give Neal's leather show-off video a chance to entertain you and if it doesn't be sure to rate it accordingly.",
  "models": [
    {
      "name": "Neal",
      "person_id": 35250
    }
  ],
  "release_date": "2012-01-25",
  "scene_id": 70508,
  "series": "Neal in Leather",
  "tags": [
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Neal in Leather, Scene #01"
}