{
  "collections": [
    "Active Duty"
  ],
  "description": "Things kick off with Axl alone on the bed as he and I chat a little.  He's so fucking cute you'll wanna jump right through the screen and crawl up on the bed right next to him and cuddle.  That smile will melt your heart.  We talk about him looking lonely so I quickly call in Boyd who is all smiles.  I knew as soon as Boyd saw Axl that it would be magic between these two.  Boyd crawls up next to Axl and together they look like two angels.  To even things out we bring in a little devil named Chaz who jumps right on top of them.  Chaz assures Axl that if he's an angel, he'll surely have the devil in him later.  I suggest a nice, hot shower to kick things off and Axl and Boyd head for the water first.  They undress each other revealing their cute boxers and Axl goes right in for some affection as he hugs up next to Boyd and tickles his nipples.  They kiss their soft cocks together as they embrace in a hot kiss.  Axl is anxious to play in the water so he invites Boyd in with him.  Once they're under the warm water the kissing continues as they continue to explore each others bodies.  Axl likes nipples and can't seem to get enough of Boyd's.  But he's much more interested in what's below the waste as he drops to the shower floor to starting sucking Boyd's cock.  He teases it with his tongue and then takes it deep into his throat as he jerks his own rock hard cock.  Axl is all about making his partner feel good and he keeps telling Boyd how big it is as he takes it balls deep.Things switch up and Boyd takes his first turn at Axl's hard rod, passionately sucking it slowly as Axl requests.  This is where Chaz joins them and a three way kiss evolves into more sucking and nipple play.  Chaz suggests that Axl go down and enjoy both hard cocks while he and Boyd dabble in some hot tongue twirls.  Chaz brings his straight-forward and pushy approach to the surface as he slaps his cock against Axl's face and mouth.  Boyd soon goes back down to get a taste of both cocks himself while Chaz and Axl guide his head on their cocks. Next, it's Chaz's turn to drop to his knees and he gets right down to business on both cocks as Boyd and Axl enjoy a little intimate time together above.  Chaz likes to show off his skills and Boyd and Axl are enjoying the concerted effort two-fold.  The looks on Axl's face are priceless as he gives the 'O' face new meaning.  He soon drops back down for more cock in his mouth as the warm water helps keep the passion flowing.  Axl is taking both cocks in his hot mouth at once and Chaz and Axl are exploring each others  mouths.  All the while Axl is stroking his hard cock as he works the two in front of him with his mouth.  Even his tongue is beautiful as he uses it to lick and explore both dicks.  He's careful not to stroke himself too fast as he wants another turn.  Boyd drops down to give him his wish and Chaz quickly joins him.  This is where the priceless facial expressions get even more intense from Axl as he fucks both mouths one after the other.  Chaz and Boyd both take their sides on the shaft of that beautiful pole and lick it up and down as Axl leans back into the corner of the shower, looking down and enjoying all the attention.  Boyd and Chaz make good cock sucking tag-teaming partners as they take turns enjoying Axl's cock.  Chaz gets Axl to turn around and arch his back as he rams his tongue deep into his pretty pink asshole and Boyd finds his way back around to Axl's cock.  Axl has no problem arching his back for Chaz's hot tongue and making sure Boyd has a nice mouthful of his hard dick at the same time.  Chaz spreads his cheeks out to give a good view of what he's licking and you'll wanna jump right in to help.Axl suggest that they go get nice and dirty now that they are all nice and clean and things head to the bedroom where more kissing and sucking continues.  Axl tells Boyd to rub his asshole while Chaz sucks his cock.  Boyd and Axl are lost in a moment of passionate kissing while Boyd fingers Axl's ass and Chaz works his cock with his mouth.  Chaz and Boyd switch it up again and Chaz takes to a long, hot kiss with Axl.  Axl says 'I could get used to you guys.'  After all there's nothing like having your own devil and angel all at the same time, right?  Chaz goes back in for the ass and starts tonguing it again as Boyd works Axl's cock.  Chaz comments on Axl's pretty pink hole being the prettiest he's ever seen as he plays with it and licks it good.  Once he finds his way up to Axl's balls we see he's hit the spot.  Axl likes it.  Between the two of them, Boyd and Chaz are working this newbie over and something tells me that they're liking it just as much as he is.  Chaz keeps spreading that ass apart for us to see as he and Boyd service his dick and balls.  Axl finds a new spot to play and starts fingering Boyd's hot little ass.  Axl says he isn't  sure if he likes playing with Boyd's ass more or getting his dick sucked.  What a terrible dilemma.  They turn the tables and throw Boyd's legs in the air and Axl goes to town tonguing it as Chaz sucks his dick.  Boyd is breathing hard as they work him over and I think we've found something he really likes, too.  Axl finds his way up to Boyd's cock as Chaz puts his in Boyd's mouth.  The passion from Axl is amazing as he gets all into sucking Boyd and jerking his own dick.  He's laying on his back jerking and sucking until finally he can't resist the urge to have that cock in his ass.Boyd saddles up to do the deed and Axl bends over and arches his back.  Chaz joins in to fill Axl's mouth full of cock while Boyd fills his ass.  Once he's in, Axl is lost in the moment.  Both holes are filled deep with dick and he seems to be in heaven.  Chaz decides to get underneath in a sixty nine with Axl, sucking his cock while Axl sucks his and Boyd bangs Axl from behind.  Axl's ass has Boyd really going as he struggles to keep his breath.  That perfect pink ass is wearing him down, but he's pounding it like no there's no tomorrow.  They put Axl on his back and Chaz stands above feeding Boyd his cock while Boyd feeds Axl's ass his dick.Keep watching troops as you're about to see Axl do something we rarely see.  It's intense, passionate and no doubt -- liberating.",
  "models": [
    {
      "name": "Axl",
      "person_id": 35274
    },
    {
      "name": "Boyd",
      "person_id": 35248
    },
    {
      "name": "Chaz",
      "person_id": 35019
    }
  ],
  "release_date": "2012-02-05",
  "scene_id": 70513,
  "series": "Force Rendezvous",
  "tags": [
    "Big Dick",
    "Blonde",
    "Brunette",
    "Gay",
    "Kissing",
    "Rimming",
    "Sensual",
    "Shower",
    "Tattoos",
    "Threesome"
  ],
  "title": "Axl, Boyd & Chaz"
}