{
  "collections": [
    "Active Duty"
  ],
  "description": "Blake has a way about him that can get most anyone to come around.  Take for instance his scene with Jake.  People went bonkers over that scene and it was simply Blake servicing Jake.  But it's the way he goes about it. When you watch it, you'll know. There's just something about it. There was a certain sort of passion bubbling under their scene, and it's undeniable. And then with Zander, he turned that sexy man into a cock-hungry bottom the first time they were together. Since then, Zander has made leaps and bounds with us.Thus, with Blake - - anything is possible. Today's scene was a little tougher challenge for Blake, but that didn't stop him from giving it his absolute best.  Tatum is one of the toughest guys to crack.  He reminds me a lot of Cash and how difficult it was to get him to finally let his hair down and go all the way.  One thing I've realized about Tatum though is his genuine shyness.  You can tell when the camera is focused on him that he's terribly shy.  I think this gets a little in the way of his opening up and letting loose.  Regardless, one thing we have found about Tatum is that he's a damn good top.  He can rail an ass like there's no tomorrow and never once go soft while he's at it.  It's clear that he likes banging a guy's ass and he's very good at it.  Blake has his work cut out for him today.  Tatum is coming along, but he's not quite to the point of giving in and giving it up all at once.  Blake takes his time and looks for an in while trying to figure out his strategy along the way.  Tatum doesn't play easy to get, either and that makes Blake's job even harder.  But, as always, Blake is all smiles and determined to give it his best shot.  They chit-chat a bit but Tatum isn't offering any easy ways in so Blake suggests they take off their jeans and shirts.  Once they are down to their boxers Blake reaches over and grabs Tatum's dick which is already nice and hard.  He then grabs Tatum's hand and places it on his hard dick and Tatum slowly squeezes and plays with it.  Before you can say 'let's see the dick' Blake has Tatum's cock out and in his mouth.  He pulls down his boxers and gets busy blowing Tatum.  Tatum is quick to place his hand on Blake's head and guide him up and down as Blake makes his way to Tatum's balls.  Blake deep throats the fat cock, taking it all the way to the balls as Tatum kicks back like a straight trick just here to get his nut.Blake finally gets Tatum to reach around and play with his cock and Tatum starts stroking him while Blake keeps blowing him.  Blake starts sneaking his fingers down below Tatum's balls, playing with his ass, working down his dick, passed his balls and licking his taint.  Next, he puts Tatum on his back and throws his legs in the air so he can lick Tatum's ass.  After he gets a little taste of that sweet straight hole he puts him on his knees to get better access to the goods.  Tatum doesn't hesitate, he goes right along as Blake tongues his hole and works his dick at the same time.  Blake manages to get a couple of fingers up Tatum's ass and all the while Tatum's dick stands at attention.That fat, hard cock of Tatum's is distracting to Blake's mission and he finally decides that getting some of that might be a good thing.  He saddles Tatum up and together they work his fat dick into Blake's horny ass.  It's a bit of a challenge even for Blake as that dick is one thick, angry monster.  Once it's in, Blake pulls him closer and starts jerking his own hard dick as Tatum pounds him deep and hard.  Blake takes to moaning loud as Tatum rails his ass and he strokes himself.  It doesn't take long for Tatum to hit the right spot and cause Blake to loose his beads.  He shoots his first load (yes, Blake shoots two loads in this scene) all over the couch as Tatum tears his ass apart with that fat dick of his.Later I would learn that Tatum accidentally shot his load in Blake's mouth while Blake was sucking his cock.  But Blake goes for one more load as he jerks it out to the taste of Tatum's cum.",
  "models": [
    {
      "name": "Blake",
      "person_id": 35040
    },
    {
      "name": "Tatum",
      "person_id": 35258
    }
  ],
  "release_date": "2012-01-29",
  "scene_id": 70510,
  "series": "High Alert 2",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Gay",
    "Smooth",
    "Tattoos"
  ],
  "title": "Blake & Tatum"
}