{
  "collections": [
    "Active Duty"
  ],
  "description": "Andrew is a 23-year old Navy boy from Illinois stationed in Hawaii, the jewel of the Pacific, and he is quite a gem himself. He stands 6' tall and weighs 165 lbs. Tim is a blond, buff Marine looking for a hook-up and has only fooled around with two guys before (and both times he was wasted).After a brief introduction, Tim is joined by Andrew who is freshly showered and ready for a little fun. As soon as we get pleasantries out of the way, sparks start flying and the guys are all over one another. They start jerking each other's cock, kissing and then Andrew's mouth makes a bee-line straight for Tim's dick.Tim is hungry for action too, and soon enough, he is chowing down on Andrew's thick cock and lapping at his balls. I urge Time to take more and more of Andrew's cock and he complies. Andrew is in his own slice of heaven as Tim sucks his cock and finger-fucks Andrew's tight ass.A hot 69 transitions us and they boys flip-flop again. This time Andrew is the one doing the swallowing as his lips slide eagerly down Tim's dick, sending him into another world. Andrew is working Tim over good, feasting like a starved man. Soon, we get the guys into ass-eating position and Tim sends his tongue straight into Andrew's gorgeous ass. This is a new experience for Andrew and you can hear his moans of surprise and pleasure as Tim rims him.After an action-packed evening of oral pleasure, Andrew is ready to bust and he does so on Tim's face. He shoots some on Tim's cheek before Tim takes Andrew's dick into his mouth to such out the last drops of cum. Tim takes his own cock into his hand jerks himself out and over Andrew's gorgeous smooth chest. The boys hop in the shower to clean up and that's a wrap!",
  "models": [
    {
      "name": "Andrew",
      "person_id": 35282
    },
    {
      "name": "Tim",
      "person_id": 35281
    }
  ],
  "release_date": "2012-02-19",
  "scene_id": 70524,
  "series": "Andrew & Tim",
  "tags": [
    "69",
    "Blonde",
    "Blowjob",
    "Duo",
    "Facial",
    "Gay",
    "Kissing",
    "Rimming",
    "Smooth",
    "Twink"
  ],
  "title": "Andrew & Tim, Scene #01"
}