{
  "collections": [
    "Active Duty"
  ],
  "description": "These four clearly came to play.The video kicks off with the sex already in full swing with this foursome as Jack is sucking on Dorian's cock who is standing on top of the headboard while DJ services Jack while being sucked by Ransom. Yes, we've walked right in the middle of some wild sex underway so let's play catch up.Jack is swallowing all of Dorian's stiff dick and loving every second of it as he finally gets his chance at the muscle stud after all this time. Jack had been wanting this for awhile and once he's got it, he takes full advantage of the opportunity. Meanwhile DJ is focusing his full attention on Jack's cock while Ransom takes on DJ's hung cock and furthers his oral skills. Things switch up quick so pay close attention. Before you know it, Jack has moved down to give DJ some head while Ransom moves over and takes Jack's place on Dorian's hard-on. The circle continues as these four show each other the love. DJ's huge dick looks so good going in and out of Jack's throat as Jack masters the monster. Dorian switches with Ransom and gives Ransom some much deserved attention as Ransom sits on top of the headboard to give him access.Before you know it, Jack has moved on to Ransom's cock to take it for a taste drive as Dorian takes over on DJ's cock. I'm not sure when I've seen DJ this worked up -- well, yes I do. DJ's always hot and horny and today is no exception. He's loving all this action and his cock is showing his enthusiasm. Ransom switches up and gives Jack some love as he swallows his cock, nearly gagging on it. DJ turns the tables on Dorian and slobbers all over his cock as he gives it some famous hand-twisting action.Ransom throw his ass in the air hoping to get some action and Jack steps up to the plate to bury his cock deep inside him while Ransom keeps his mouth busy with Dorian's dick. Doesn't take long before Jack is slamming his cock into Ransom balls deep and pumping it fast and hard. This causes Ransom to suck Dorian's cock even better. Watching Ransom swallow a cock while he's getting his ass plowed is a treat in itself but when you throw in the rest of what's happening it's magic. DJ is straddling Dorian's face, fucking it fast and hard while the scene continues to unfold.Jack decides to flip Ransom over onto his back and DJ and Dorian see a good opportunity to stuff his mouth with cock as they move in to each side of his face with their cocks, giving him plenty to keep him busy while Jack fucks his ass. This is where Ransom shines most. A cock in his ass and two in his mouth seems to be the perfect position for our tatted-up bad boy. You can't help but see how much fun this is for him as he goes back and forth between the cocks and enjoys the one in his ass all in unison.DJ reaches down and grabs Ransom's cock, stroking it while Jack long strokes his hole. Ransom is moaning on DJ and Dorian's dicks as the group decides who's going to fuck his ass next. Dorian takes the reins and bends Ransom over to give him some of his cock and Ransom follows orders perfectly. Dorian buries his cock in that ass and takes it for a long, hard ride while DJ and Jack share his mouth. Ransom's back is arched perfectly as he takes the dick in his ass like a true champ. Ransom has no problem choosing between the two big cocks in front of him, he sucks them both equally as they fuck his face and ass.Things take a turn and DJ bends over for Dorian while Jack bends over for Ransom. It's hard to tell who's having the most fun, but something tells me it's a tie. Jack is clearly loving the dick shoved up his ass as he arches his back and talks shit to Ransom who's plowing him hard. The looks on DJ's face tells the story and leaves no room for guessing. DJ is stroking his long, hard cock fast and hard as Dorian delivers the goods to his back door. DJ and Jack meet for a long, wet kiss as their asses are fucked. Jack is playing with DJ's nipples in between kisses as Jack backs up on Ransom's cock, literally fucking himself.Just when you thought it couldn't get any better, Dorian takes to Jack's ass for his turn and Jack is in heaven. He's loving this muscled up stud service as Dorian goes in as deep as he can. DJ is sucking on Ransom's hard cock while Dorian turns Jack over on his back to go deeper in his ass. It isn't long before Jack is stroking a massive hard on while Dorian pounds the mounds. Jack can't hold back any longer and gushes a huge wad of jizz all over himself, but it's still not over. Dorian's ass hasn't been fucked but that's all about to change. Ransom saddles up for the ride and puts his cock deep in Dorian's ass. Dorian's cock is as hard as I've ever seen it as he gets fucked hard. DJ and Jack cheer him on as Dorian strokes his cock to the tune of Ransom's rhythm. Doesn't take long for the big man to blow a huge load all over himself with Ransom's cock balls deep in his ass. Ransom is the next to go as he strokes his load out, mixing it in with Dorian's all over Dorian's abs. Jack rubs it all in and it's a wrap.",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "DJ",
      "person_id": 35025
    },
    {
      "name": "Ransom",
      "person_id": 35131
    },
    {
      "name": "Jack",
      "person_id": 35254
    }
  ],
  "release_date": "2012-02-12",
  "scene_id": 70522,
  "series": "The Frontline 2",
  "tags": [
    "Big Dick",
    "Blonde",
    "Brunette",
    "Gay",
    "Group",
    "Tattoos"
  ],
  "title": "DJ, Dorian, Jack & Ransom"
}