{
  "collections": [
    "Active Duty"
  ],
  "description": "Logan is a sexy Latino papi and he's got the hots for Vinny. In fact, I'm still a little confused because of how this all played out. You see, Logan said he was down to do some work, but he had one stipulation: He would only work with Vinny. I tried to convince him to do a threeway which would include Vinny, but he was making it clear that he wanted Vinny all to himself. As the evening progressed another interesting fact emerged between these two. They pretty much had this all planned out about a week before the shoot when they went to the doctor together and got tested for HIV and STD's. Yes, they planned on doing this scene bareback. I guess Logan not only wanted Vinny and only Vinny -- but he wanted the experience to be as raw and personal as possible.It became obvious to me that we had a budding love affair on our hands and that these two had really thought this out a lot. But I think it was Logan who had the future planned out, Vinny was just along for the ride. When I asked Vinny if the two of them were an item, he wouldn't admit it. But you could see it in their eyes that whatever was going on between these two was much more than just friendship. Maybe to Vinny it was a bromance and that's fine, too. Either way, what transpired between these two was nothing short of a hot ass love-making session and luckily we all get to watch as these two sexy ass dudes let it all go, throw caution to the wind and consummate their relationship in the most personal way possible.DJ just happened to be at the house that weekend and I decided that I'd let him capture the moment between Vinny and Logan. I thought his fantasies coupled with theirs would make one hell of a scene and I was right on target. I give DJ the camera and my blessing and left the room to let things unfold. No sooner than I'm gone, DJ moves right in to get things going and starts out with a few questions that reveal that Logan is very curious and all he's done before is jack another guy off. He gives Logan and Vinny the go-ahead and from there they embrace in a hot, passionate lip-lock as they massage each others crotches. You can feel the heat coming off of these two as they begin their exploration. Vinny manages to get his hand inside of Logan's pants first and seems pleased with what he finds as Logan slowly makes his way inside Vinny's. You can see the anxiousness of Logan and feel the intensity as the deep, passionate kiss gets hotter and hotter.Logan can't get his pants off fast enough and Vinny just grins as he looks at the hard-on Logan is sporting in his boxer briefs. The kiss continues as they play with one another's hard cocks and suddenly Logan takes Vinny's cock in his mouth and a dream comes true. He's literally making love to Vinny's cock with his mouth. Vinny takes him by the back of the head and speeds up the motion a little as he begins to fuck Logan's face. Meanwhile Logan's cock is standing stiff and at full attention between his legs as he blows his buddies cock. Vinny lays down to give him better access and Logan continues his handwork. Vinny reaches under and grabs Logan's hard cock and begins to stroke it slowly as Logan worships his cock. Logan puts his hands on those amazing pecs of Vinny's and rubs them slowly while he sucks his cock. If sucking cock has ben something Logan has long fantasized about, he's getting plenty of action for his first time out.Vinny decides it's time to return the favor and lays Logan back on the bed and gets between his legs to service his cock. Logan is rock hard and ready for the action as he guides Vinny's head up and down on his cock. Here we get a chance to get a better look at Logan and what a fucking total hottie he is. Just as we're taking it all in, he looks at Vinny and tells him he wants him to eat his ass. Vinny obliges as Logan turns around and puts that beautiful round butt right in Vinny's face. Logan isn't shy about expressing how good it feels as he gets vocal about it. Vinny continues playing with and jerking Logan's cock while he rims his delicious ass. Something tells me it won't be long before Vinny gets his invitation to fuck that nice butt.Yep, I was right. The next thing we know, Vinny is preparing to mount Logan's beautiful ass and Logan is ready to give up his cherry. Vinny starts out slowly, giving Logan time to adjust and then he starts fucking the daylights out of that virgin ass. You'd think Vinny was some sort of fuck machine that just had his ON switch flipped and is in full swing as he devours Logan's ass rough and raw. And Logan is loving every minute of it as he gives his ass over to the man he chose for the job. Just like the extended cocksucking that Logan got to experience, Vinny is making sure that Logan's first fuck will be one he remembers for the rest of his life. And Logan is totally enjoying all the attention as he strokes his rock hard cock to Vinny's rythmn.Vinny puts Logan on his back for the last leg of this amazing race and Logan strokes his hard cock and slaps it on Vinny's belly as Vinny plows his ass hard. I think the last time I saw someone put a fucking like this on their partner it was Jake fucking DJ. Logan can't hold back any longer and he shoots a huge load all over himself as Vinny digs deeper in his ass. Vinny quickly follows his lead and shoots one of the biggest loads I've seen lately al over Logan's stomach, mixing it in with Logan's load Logan is drenched in cum and I think that's exactly what he wanted. They end things out with the type of hot, passionate kiss that you'd swear was reserved only for lovers. Kudos to these two hotties and kudos to DJ for capturing suck a hot, intense moment.",
  "models": [
    {
      "name": "Logan",
      "person_id": 35113
    },
    {
      "name": "Vinny",
      "person_id": 35165
    }
  ],
  "release_date": "2012-02-12",
  "scene_id": 70521,
  "series": "The Frontline 2",
  "tags": [
    "Bareback",
    "Gay",
    "Muscular",
    "Rimming",
    "Rough",
    "Smooth"
  ],
  "title": "Logan & Vinny"
}