{
  "collections": [
    "Active Duty"
  ],
  "description": "The last time we saw Bric and Taylor together it was a milestone moment for Bric here at Active Duty.  It was during that scene that we learned Bric had done a little experimenting off camera and tried a few things out before bringing what he learned to camera.  Taylor was Bric's first duo on video where he gave as good as he got.  It was also the first time we saw Bric suck another guy's cock and it was fantastic.  These two were really awesome together.Then, they went their separate ways and Bric ended up going all the way across the line while Taylor did, too.  But, as many who have since written in have pointed out, they never got a chance to really go all the way together.  Today, that all changes as these two hotties come back together for what proves to be a shining moment for both.Things kick off with us all shooting the shit and Bric and Taylor are both looking mighty delicious.  We recap their history together and cover the parts that we missed in their last pairing.  I tell them that I'm working for them and ask if they have some ideas brewing of their own.  I joke that I don't know who looks more afraid and Taylor points out, 'well, there are two big dicks in the house.'  I can't argue with that.  So, I leave them be and go preheat the oven for some pies.While I'm gone they strip each other out of their shirts as they admire one another's bodies.  Taylor's cock is the first one out as they kiss and lick on each others upper bodies while Bric moves his hand slowly down to Taylor's cock, tugging on it as he kisses Taylor's nipples and neck.  Taylor gets Bric's boxers off and takes off his own shorts and it's back for some hot tongue tying kisses and cock tugging as the action gets started.Bric is the first to go down on Taylor's delicious dick as he strokes his own.  Taylor caresses Bric's head slowly and appreciatively while Bric works his magic on his stick.  It doesn't take long before Taylor is standing at full mast and Bric's hot mouth is all over it. Meanwhile Taylor reaches down to play with Bric's hard cock, returning the love and then leaning back to fuck Bric's mouth for a spell while Bric jerks his own hard meat.They switch it up and Taylor takes the reigns on Bric's uncut meat, working his tongue and throat in unison to satisfy his partner.  Bric is loving it as he throws his head back and moans.  They've recreated things to the point where they last left off and both of them are doing a better job this time around.  Bric kisses Taylor's back lovingly as Taylor services him.  They go back and forth a bit recalling their last time together.Bric suggests they consummate things a little more as Taylor turns on his side with his ass facing Bric's hard dick.  Bric moves in and slowly starts shoving his cock up Taylor's ass, working it slowly as Taylor begins to moan deeper and deeper as Bric works his big dick into him deeper and deeper.  Taylor pulls his leg up close to his chest to give Bric better access and Bric keeps the pace.They change positions and Taylor gets on his hands and knees as Bric rams his huge cock in and out of his tight hole, fucking him with long strokes as Taylor moans away.  This is so hot to watch as it's been a long time coming for both.  By now, Taylor is stroking his own hard cock as Bric pounds him harder, faster, deeper.  Taylor is telling Bric to fuck his ass harder and Bric obliges.   The looks on Taylor's face are priceless and you can tell it's a hurt he's loving.But things just wouldn't be complete unless the tables were turned and Bric took Taylor's juicy fat cock up his tight ass, too.  So, Bric tells Taylor he wants him to fuck him now and Taylor says it would be his pleasure.  They put Bric in the same side position that Taylor started in and Taylor goes hard from the start, stuffing and pounding his big, fat cock deep inside Bric's beautiful ass.  All the while Bric is stroking his hard dick as Taylor pounds him deep.  I'm not sure I've ever seen Taylor fuck someone so hard.What happens next is so intense for both Bric and Taylor.  Words really can't do the moment justice, you'll just have to see it for yourself.  Let's just say that things are now complete!",
  "models": [
    {
      "name": "Bric",
      "person_id": 35047
    },
    {
      "name": "Taylor",
      "person_id": 35153
    }
  ],
  "release_date": "2012-03-11",
  "scene_id": 70534,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Duo",
    "Gay",
    "Tattoos"
  ],
  "title": "Bric & Taylor"
}