{
  "collections": [
    "Active Duty"
  ],
  "description": "The Covert Missions guys recently had a pretty wild weekend and Mike was able to get some really great shoots with his guys, Brock, Nick and Bryce.  All told he ended up with three really hot scenes and tonight's War Chest scene is actually the last of the three.  But that's OK because it's a nice build up of the scenes that will eventually follow.Mike lathers the boys up with his typical bullshit and they're all smiles.  Nick has been overseas for awhile and out of the game but he's looking  better than ever.  Funny how nothing but a weight pile, lots of boredom and tons of testosterone surrounding you will do that to a man.  To pass the time when you ain't blowing shit up, you pump the weights in tight green silkies with your battle buddies.  It's paid off nicely for Nick.It's obvious that these three have spent a long weekend with Mike and done some things already so Mike decided it best just to leave them be and let them 'get in where they fit in.'  He leaves the room for a bit and lets the chips fall where they may.He plays like he's snapping a few pictures in the background but we haven't had him send in a picture yet that we could get in focus.  It's all good, the video camera is running and that's all that matters.  Mike, if you're reading this, I love you buddy.  But I love your boys better.The boys are stroking their meat and everyone's taking a few sneaky glances here and there and you can tell they haven't quite seen enough of each other.  Bryce finally decides to play instigator and reaches over and latches on to Brock's boxers, pulling them off and getting him naked.  All the while Nick is watching them as he strokes his cock.  Doesn't take long for him to reach over and start caressing Brock's balls, rubbing his chest and abs and this inspires Brock to return the favor.Brock decides to go skiing and grabs onto both Bryce and Nick's cocks and stroke them.  This in turn bets Bryce to go down on Brock and Nick says, 'you like it when he gives you head?'  Brock grunts out 'oh yeah' and Mike asks Bryce if he likes that cock and he just shakes his head without ever taking his mouth off of it.  Bryce's big cock is swelling all the while and Brock decides to grab it again.Brock is also stroking Nick's dick and it's getting harder and harder by the second.  Mike's phone rings in the background and he's off to the bathroom to bullshit another soldier while things heat up on the camera.  Nick trades places with Bryce and takes that cock down his throat, sucking it like he's always wanted to.  You'd have thought he was a snapping turtle and the lightening would have to strike before he let loose.Suddenly Bryce pops a question to Brock, 'you like your ass eaten?'  'Hell yeah' comes the reply.  And Bryce is on it like a part time job.  He's playing with that cute ass and licking and fingering it while Nick is watching something on his phone.  Mike zooms in to get the finger action and Bryce goes in with a thumb.  He's servicing that ass like he's a licensed plumber and Nick's dick is rock hard as he starts paying attention again.Brock reaches over and starts jerking Nick again and Bryce instructs him to turn back over.  He does as told and reaches over and grabs Nick's big dick again.  Nick wants to know how he liked that ass rimming and Brock tells him how good it felt.  Bryce is back down on Brock's cock sucking it as Brock jerks him.  Mike chimes in and talks some shit.The guys got each other all lathered up and things are bound to explode soon.",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Nick",
      "person_id": 35229
    },
    {
      "name": "Brock MB",
      "person_id": 35256
    }
  ],
  "release_date": "2012-03-14",
  "scene_id": 70535,
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Threesome",
    "Twink",
    "War Chest"
  ],
  "title": "Brock, Bryce & Nick"
}