{
  "collections": [
    "Active Duty"
  ],
  "description": "When Diego and Evan were visiting we got these two together for another scene and this time it was with our latest heart throb, Axl.  These three proved that just by switching up one person in the mix, it can give you a totally different hot time altogether.<br /><br />As always the guys are all smiles.  It's a beautiful day and we've got a bed full of beautiful men.  I had rented a beach house for the weekend and the boys all stayed there together and bonded really well.  We shot this scene on the last day of the trip and the time they spent as bunk mates at the beach house proved to just what the porn gods ordered.<br /><br />I say I wanna make some smut and Diego says, 'I wanna fuck his butt' and Axl follows up with 'I wanna get sucked.'  From there the clothes start slowly peeling off as Axl loses his pants and Evan loses his shirt while Diego follows Axl's lead and loses his pants, too.  What the hell, they all decide to get right down to their boxers.  From there, everyone grabs a handful of cock and Evan starts licking and sucking on Axl's nipple.  Axl goes straight for Diego's dick and it doesn't take long for Evan to get down between Axl's legs and start sucking his cock.<br /><br />Less than five minutes in and we've got a suck fest going on right before our eyes.  Axl comments on how he's liking what he's got his hand and mouth on and Evan works his dick up while he sucks on Axl.  Evan and Axl decide to kiss and have a tongue fight while Diego goes down on Axl.<br /><br />Evan loses his boxers to reveal his rock hard cock and goes back for some more of Axl's dick.  Diego finds his way over to Evan's cock and this is one very merry go round.  Everyone's getting a taste of the other and no one is getting left out.  Diego plays with Axl's balls while Evan works his cock and Axl just lays back all smiles as he watches Diego work his magic on Evan's meat.<br /><br />Axl says all this attention is making him so fucking horny and you can tell by the way he can't keep his hands or his mouth to himself.  He finally finds his way back down to Diego's cock and licks and kisses Diego's inner thigh while he and Evan share Diego's cock.  Axl figures out he can go back and forth between the two just fine so he's having himself a feast.<br /><br />Evan spots Axl's incredible bubble butt grinding on the bed and starts rubbing it.  I suggest he come back and get a closer look.  Once he see's Axl's cock hard and resting between his thighs he wastes no time getting in closer and taking it for a taste test as he strokes himself.  He's working Axl's balls and cock and then works his way right up to that beautiful pink pucker that's just waiting for some oral examination.  All the while Axl is loving on Diego's fuck stick like it's a popsicle that's his favorite flavor.<br /><br />Once Evan finds his way up the Axl's backside and discovers that perfect pink hole he buries his tongue in and gets a deep taste.  Axl is stroking his cock while Evan eats his ass and Diego is enjoying the view.  It doesn't take long for that beautiful pink hole to entice Evan to explore even further.  He goes in for a deeper exploration as Axl moans in pleasure all over Diego's dick.  Evan is slowly shoving his cock in and out of Axl's ass as we watch it all unfold.<br /><br />They put Axl on his side and Evan goes back in and Diego and Axl form a sideways sixty-nine.  Axl is licking and sucking Diego's cock while Evan pounds his ass and Diego sucks his dick.  Eventually Axl takes matters into his own hand as he strokes himself and watches Evan's dick go in and out of his tight ass.  He turns his attention back to Diego's cock as Diego does the same to his.  Evan is slowly plundering Axl's treasure and they move him to his back where he blows the first of two loads in this scene. ",
  "models": [
    {
      "name": "Axl",
      "person_id": 35274
    },
    {
      "name": "Diego",
      "person_id": 35077
    },
    {
      "name": "Evan",
      "person_id": 35082
    }
  ],
  "release_date": "2012-03-18",
  "scene_id": 70536,
  "series": "High Alert 3",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Gay",
    "Kissing",
    "Rimming",
    "Tattoos",
    "Threesome"
  ],
  "title": "Axl, Diego & Evan"
}