{
  "collections": [
    "Active Duty"
  ],
  "description": "The two studs start out in the shower washing each other up with Elijah washing Damien down first and Damien following up with the return favor. What is interesting to note with these two is that they spent the entire week living in the same beach house with both Damien’s wife and Elijah’s girlfriend. So, the tension had to be building as they spent so much time together before this scene. I think they were so hot for each other by the time we shot this that is shines through in how hot the scene is. After getting all cleaned up the boys work up some hard ons in the shower as they stroke each others cocks. Damien drops to his knees first and starts sucking Elijah’s cock. It isn’t long before Elijah says “Damn, you got me fucking horny…let’s get out of here.” The boys dry off and head to the bedroom to get all dirty.Damien continues where he left off in the shower sucking Elijah’s cock. Elijah is really enjoying this attention as he watches Damien intently. Elijah is moaning and talking to Damien as Damien works his cock over. Damien is sucking and stroking Elijah’s rockhard cock and talking shit back to Elijah. It isn’t long before Elijah is down between Damien’s legs returning the favor and man does he ever get into sucking a cock. Elijah is one of the horniest guys I’ve ever met as he gets so into what he’s doing. They switch back and forth several times working each others cocks over and over again. Damien is deep-throating Elijah as Elijah calls him his “dirty boy” and asks him how he likes that cock. Telling him to suck it real fucking good. Elijah reminds me of Kody in the way he gets so fucking hard and stays that way until he blows his load. Elijah is a true player in the game and enjoys every minute of Damien’s hot mouth on his cock. Damien is hard as a rock too and Elijah tells him it’s his turn again. They switch up again and Elijah works Damien over once more. Damien says “That feels so good I wanna cum in your mouth.” and Elijah returns with “Maybe I want you to.” I’ve never seen Elijah get this wound up sucking a cock. But it is evident by his dripping cock that he’s really into what he’s doing. One last turn of the tables with Damien sucking Elijah again and it’s on to a 69 before moving on to other things.Damien assumes his favorite position doggy-style and arches his back like a good boy to get ready for Elijah’s warm tongue to get his hot ass ready for a good fucking. Damien is at home in this position as we’ve come to learn through his many video appearances and Elijah is right at home eating a nice ass. Elijah eats Damien’s ass while Damien squirms around trying to contain himself from the overwhelming feeling of exstacy. Elijah is stroking Damien’s hard cock as he tongues his ass in unison. Elijah goes the extra mile eating this sweet ass as he tongues it for a good while before he saddles up to ride it long and hard.Elijah asks Damien if he’s ready for him to “get up in it' and Damien is. Elijah makes his intial insertion but isn’t satisfied on his knees so he stand flat-footed on the bed and plows down into Damien’s sweet hole. Damien likes this position and turns to check Elijah out as he slams his ass. Elijah is going balls deep, fucking Damien good as Damien strokes his own hard cock and the two talk back and forth to one another about how damn good it feels. The position switches and Damien rides the horsey as he continues to stroke his cock. Elijah grabs hold of Damien’s cock and does the stroking for him as Damien continues riding his cock...going all the way down, taking all of Elijah inside of him. Elijah tells Damien he wants him to cum all over him as he strokes Damiens cock as Damien bounces up and down on Elijah’s cock. “I wanna taste that fuckin’ cum.” Elijah tells Damien. “I’ll shoot it on your face you dirty boy' Damien responds. Damien blows and lands some on Elijah’s chin as Elijah tries to eat it. Elijah turns Damien back over in doggy-style position with Damien’s cum still dripping all over his chest, stomach and face and finishes off as he blows a huge load all over Damien’s back and lays down on Damien’s back to mix their cum together. The cum just runs down Damien’s crack, gathering up around his fresh fucked hole. The two boys head for the beach.",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Elijah",
      "person_id": 35081
    }
  ],
  "release_date": "2012-03-25",
  "scene_id": 70539,
  "series": "Fire In The Hole 2",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Duo",
    "Gay",
    "Rimming",
    "Smooth",
    "Twink"
  ],
  "title": "Damien & Elijah"
}