{
  "collections": [
    "Active Duty"
  ],
  "description": "In today's scene two of our favorites return after long absences:  Evan (Kaden's Recruit) and Diego both return and I pair them up with Boyd.  This three-way is one to remember as the guys really have fun with one another and things get so heated until all hell breaks loose and it ends up in a sandwich fuck with Evan fucking Diego while Boyd eases in to top Evan.  This was a great trio to put together and after watching the scene I'm sure you'll be in agreement.  Evan is looking better than ever and Diego is hot, horny and ready for action.  He said before he made the trip that he was looking very forward to this weekend of bromine.  I think he got exactly what he came for.Things kick off with the guys sitting in the living room shooting the shit.  I talk to Diego and Evan and welcome them back.  They're both all smiles and you can tell they've been looking forward to this right up until this moment.  Boyd is all smiles, too.  He's coming along nicely and I think we'll see him bottom very soon.  For now, he's proven to be a damn good top man and that's always a plus.  My gut tells me he's ready for the next step though and I'll be working on that step very soon with him.  Diego reminds me that it's been almost a year since his last video.  He says he's missed the man sex as we joke back and forth.  Evan is such a pretty boy.  I joke with him about not telling Kaden that he made the trip out.  Too late.  He'd already texted Kaden that he was here.After the introductions things get started right away.  I leave to do some laundry and let them start their own cycle.  It takes no time at all for Diego and Boyd to invite Evan to join them on their couch.  Love seat takes on a whole new meaning here, troops, as these three turn into into a virtual love-making seat.  The clothes start falling off and they get down to their boxers.  Evan is all eyes as he watches Boyd and Diego strip down.  Diego wastes no time getting his hand full of Evan's cock and Evan likewise does the same by skiing with his hands on Boyd and Diego's crotches.Boyd is rising to the occasion as Evan gives him plenty of personal attention.  Evan encourages Diego to take a feel of Boyd's happiness and Diego doesn't pass up the opportunity.  It's fun to watch Boyd as all his attention is focused on Evan and Diego's crotches as he plays with his own.  You can tell he's ready for what's about to happen.  Diego strips off more of his clothes and the heat keeps rising.  Evan takes notice of Diego's washboard abs and takes a feel.  Evan decides to strip Boyd the rest of the way down and Diego does the same for Evan, commenting on his pretty little ass as he pulls off his boxers.  Diego goes straight for the goods as soon as Evan sits back down and takes his nice cock into his mouth.  Evan and Boyd start out kissing as Evan strokes Boyd's hard cock.  Evan is standing at full attention now with the help of Diego's hot mouth and Evan finds his way down to Boyd's cock to give it the same attention.Boyd soon gets his turn on Evan's cock while Evan finds his way to Diego's dick and a suck-a-thon is under way.  Evan can't quite decide which dick he wants the most, but he can have 'em both so it's all good.  Boyd is enjoying the taste of Evan's cock and these three are now officially acquainted.  Evan and Boyd keep up their kissing as Diego moves down to take another taste of Evan. Diego eventually finds his way back to Boyd's cock and he and Evan share it while Diego keeps double time with Evan's cock in the mix, too.  Diego does a good job of keeping both cocks happy as he divides his time equally between the two.Diego and Boyd decide to double feed Evan's hot little mouth with their cocks and Evan keeps the pace.  Boyd and Diego spend time kissing while Evan services their cocks for them.  There's lots and lots of kissing in this scene and that's always a plus.  Everyone makes sure to tastes everyone else's  tongue as well as their cocks.  Won't be long now until other areas are covered just as thoroughly as the cock sucking.  But first, Diego and Evan share Boyd's hard dick, tongue fighting over it and both winning out in the end.  Boyd is loving the attention as he kicks back and enjoys these two hot mouths all over his cock.  Boyd and Diego do the same to Evan next to make sure no one gets jealous.Soon Diego eases behind Evan and starts eating out his perfect little ass, licking and tonguing it good while Evan continues to service Boyd.  They've moved things to a 'sex chair' now and things are moving in the right direction.  Evan spreads his ass cheeks apart to give Diego better access and Diego takes the opportunity to go deeper.  All the while he's licking and sucking Evan's cock and balls, too.  Evan gets lost in the great feeling a few times but tries to keep his attention focused on Boyd's cock, too.And, as if we didn't see it coming, Diego takes this opportunity to seize Evan's sweet ass as he shoves his hard cock deep inside Evan, ripping it open for the first time in awhile.  Boyd sees an 'in' and gets down below Evan to suck his hard cock that is bouncing in the breeze.  Diego is tearing Evan's sweet ass apart as he rams deeper and deeper inside him.  Evan deserves some credit for taking suck a good deep pounding.  Next, it's Evan's turn and he puts Diego on his back  and plows his ass as it hangs over the arm of the couch.  Diego keeps his mouth full of Boyd's cock and Boyd does likewise to him.  Until, that is, Boyd see's another place he can get some action.Boyd moves in behind Evan as Evan fucks Diego's ass and puts his cock deep in Evan's ass.  A sandwich fuck ensues as these three really take advantage of the position.  Diego is the first to shoot his load and he lands it all over those gorgeous abs while Evan keeps pounding his ass.  Evan blows his wad next and it mixes in with Diego's then he bends down and locks lips with Diego while Boyd blows his load all over Evan's ass.  It's a huge load and Evan's back is covered in jizz.  Evan reaches around and gives Boyd a kiss of appreciation and the three of them come together for one last group kiss.  Fade to black.  Now rewind and let's do it all over again.",
  "models": [
    {
      "name": "Diego",
      "person_id": 35077
    },
    {
      "name": "Evan",
      "person_id": 35082
    },
    {
      "name": "Boyd",
      "person_id": 35248
    }
  ],
  "release_date": "2012-03-04",
  "scene_id": 70532,
  "tags": [
    "Anal Sex",
    "Blonde",
    "Blowjob",
    "Gay",
    "Sandwich Fuck",
    "Tattoos",
    "Threesome"
  ],
  "title": "Boyd, Diego & Evan"
}