{
  "collections": [
    "Active Duty"
  ],
  "description": "Have ya ever heard that song by Kenny Chesney, 'The Good Stuff'?  Well, that's exactly what we've got today for you in the update.  And you can only get it here at Active Duty.  When Axl first came on the scene we threw him in the fire of a hot four way, but one thing we didn't get to see in that four way that I think we all wanted to see was more of him and Bric.  Today, we get them both all to ourselves in a hot duo where the fire ignites and sets the room ablaze.  These two are plain gorgeous together.<br /><br />Axl's smile alone could launch a thousands ships and when it's aimed at his scene partner it can melt their hearts.  At least that's what I like to imagine.  Either way, it melts mine and I'm sure it melts yours, too.  It's been a long time since we had someone come on the scene so excited about what they're doing.  Axl is the epitome of curious goes crazy.  He submerges himself in the moment and doesn't let go until both he and his partner are satisfied.  Bric has come a long, long way in his short time here at AD and he's proven to be a good team player.  Each video brings another side of Bric that we haven't seen yet and his exploration seems like a journey we'd all love to take.  Come on, ya'll, let's take a little trip.<br /><br />It's a beautiful day and these two shine almost brighter than the sun.  Nothing like two hot men basking in the sunlight with hard dicks, dirty thoughts and each other.  You can tell they've both wanted this day to happen.  In the four some I almost purposely kept them apart so this day would be even more intense.  I think my plan may have worked.  As I chit-chat with them, you can tell their minds are somewhere else.  They've got their own plans and that's just fine with me.<br /><br />Axl decides he'd like to run the show and Bric is down with that.  I leave to put a few pies in the oven and they get things heated up pretty quickly.  Axl goes straight for the belt, pulling it through the loops and unbuttoning Bric's pants.  He's wasting no time finding the prize in Bric's boxers.  Once he convinces his friend out to play, he's on it like white on rice.  Axl gets lost in the moment completely and is worshipping Bric's cock and body like it was an altar all its own.  Axl tells Bric his cock tastes like candy and Bric wants to know how many licks it'll take to get to the center.  Axl says he's sure they'll find out.  And from there, troops, it's on.  Bric's got his hand on Axl's cock and his cock in Axl's mouth.  Nothing could be better.<br /><br />It's Bric's turn now and he works his way down Axl's chest, licking his nipple a bit and kissing his chest until he finds his hot mouth all over Axl's hard cock.  He's careful to pay himself some attention as well as he strokes his hard cock while he works his magic on Axl's.  You'd have thought this was the point where all love started in the universe as Bric makes devine love to Axl's rod.  Amazing how far he has come.  You can tell that Bric is really starting to like this.  And Axl is all smiles.  Smiles that'll melt you heart while Bric's lips melt on his dick.  Watching this take place in front of me I'm in awe.  The chemistry just ignites the room.<br /><br />Axl's got some ideas of his own and Bric's ass is one of them.  I think by this point Bric had decided the same thing.  You can tell he's taken to the more submissive role and today that seems just fine for Axl.  He likes watching Bric play with his big uncut cock while he services his.  And I must admit it is hot to watch.  Axl can't take it anymore and tells Bric to crawl on top of him and put that big dick in his mouth.  Bric does as Axl wishes and begins feeding him the huge uncut meat.  Axl takes to it like a fish to water and Bric enjoys feeding the hunger.  Axl fucks his own mouth with the uncut tip of Bric's huge cock while Bric works the foreskin back and forth on his hot red lips.  Bric reaches back and doubles the pleasure for Axl by stroking his cock while he's feeding him his.<br /><br />All the while Axl's hard cock is getting closer and closer to Bric's pretty ass and before you know it, Bric is rubbing it up and down his beautiful crack, caressing it and trying it on for size.  You can tell he wants it pretty badly.  He's working that cock and squeezing those balls and inching down on that dick to get it nice and ready.  He goes back down on Axl once more for good measure.  Axl takes the time to enjoy Bric's balls for a minute before he starts playing with his ass.  Once he starts rubbing that hot round ass his mind goes somewhere else.  <br /><br />They dock.  In a moment just before Axl is about to fuck Bric, Axl gets the idea of being docked by Bric's foreskin.  They try it and it works.  Bric's darker foreskin covers the pink head of Axl's cock just perfectly.  This moves things to a sword fight of sorts for a bit before the good stuff.<br /><br />Bric saddles up on top of Axl, riding him and rubbing their cocks together like two rowdy cowboys.  You know what's about to happen is going to take your breath away.  The tension is filling the air and something is about to explode.  Axl has Bric's ass cheeks spread open as he rubs his cock against it.  Bric rides it with his ball sack and the two are having way more fun than the law allows.  Bric's showing off that pink hole to Axl like teasing a nympho.  Bric's got Axl just where Axl thinks he's got Bric and what's about to happen is worth waiting to see.<br /><br />Get ya'll's fans and meet me at the scene.  Bring some wet wipes cause it's bound to get messy.",
  "models": [
    {
      "name": "Axl",
      "person_id": 35274
    },
    {
      "name": "Bric",
      "person_id": 35047
    }
  ],
  "release_date": "2012-02-26",
  "scene_id": 70530,
  "series": "First Strike",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Muscular",
    "Tattoos"
  ],
  "title": "Axl & Bric"
}