{
  "collections": [
    "Active Duty"
  ],
  "description": "Pierre isn't a military guy, but he's a hot college student who has played rugby since he was a kid and he's sporting the body to prove it.  He hasn't been in the United States very long and his thick accent is a real turn-on.  Couple that with the fact that he really gets into talking dirty to us in his native language and you've got a package that is very hard to resist.  Please, don't write to me and tell me what he's saying.  I want to imagine that his words are all for me.  You can imagine the same, too.Pierre was a referral from another French friend whom I'd tried to get to model, but he turned me down.  He gave Pierre my contact information and I got the call not long after.  In the initial interview we learn that Pierre is between 5' 9' and 5' 10' and weighs around 180 lbs.  Like most people who come to Southern California, Pierre loves it here and hopes to return one day once he's finished with school.  He especially enjoys playing his favorite sport, rugby, here in the beautiful sunshine.  He also enjoys music, mostly R&B which I find most French men seem to love.  He enjoys cinema and lots of other things and he's sporting a tattoo on his shoulder that says, 'Live today as if you will die tomorrow.'  That's a great way to look at life.  And today we're going to see Pierre seduce us as if he'll fuck us tonight.As soon as I give him the go-ahead to get started he wastes no time at all getting comfortable.  He enjoys being playful with the camera and teasing us as he slowly unzips his jeans to reveal that beautiful big uncut meat.  Once he's worked himself out of his pants his cock is already standing at half mass as he plays with the tip of his foreskin, teasing himself to a full woody.  His cock is perfect and the pretty pink tip comes out from hiding behind the perfectly formed foreskin as he strokes it slowly.  All the while he seductively rubs his chest and makes plenty of teasing eye contact with the camera.  Then he bend over to reveal a beautiful furry bubble butt and gorgeous pink hole.  He's not shy about showing off his assets at all and as he's giving us a good look at that nice ass he's pushing his cock back for us to see it, too.At full attention his cock has a wonderful curve in it that would probably feel wonderful milking someone's prostate.  His balls are delicious, too, as they bounce beneath his monster cock.  The treasure trail leading from his cock all the way up his chest is one you'll want to follow again and again all the way to those kissable lips that are talking dirty to you in that romantic language.By the time he shoots his  creamy white  load you'll hope he's telling you to come lick it up.  Join Pierre in the shower next as he cleans up after a dirty fun time.  Pay close attention to that perfect body and encouter troupes.",
  "models": [
    {
      "name": "Pierre",
      "person_id": 35285
    }
  ],
  "release_date": "2012-03-07",
  "scene_id": 70533,
  "series": "Pierre",
  "tags": [
    "Big Dick",
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Pierre, Scene #01"
}