{
  "collections": [
    "Active Duty"
  ],
  "description": "Colton was such a handsome devil that I must admit being a little nervous in my approach with him.  However, I quickly learned that he was just as sweet as he was hot and this stud did not disappoint.  During the solo I gave him the low-downs on other work he could do and he didn't come right out and bite during that visit.  Sometimes it takes a  little while for things to sink in, a little time to do some thinking and then the call comes.As soon as the camera comes on you'll think we might have found ourselves in the company of a tough guy with a bad attitude, but as soon as you see the smile on Colton you know he'll warm up pretty nicely.  During our chit-chat we learn a little more about Colton.  He's 23-years old, about 6' tall, weighs 190-195 lbs and once he takes that shirt off you can tell this guy spends some time in the gym.  Colton tells us that he spends about two hours a day working out and it shows.  He enjoys working on cars, drag racing, shooting guns.  He played baseball, hockey and football as well as wrestled in high school.  An all-around jock that you can imagine drooling over in the showers after practice.  Luckily for us, we've got him all to ourselves tonight.When I ask my usual question about being hung like a horse or a horsefly, Colton is quick with his answer.  I leave the room for a minute and come back to find that his answer wasn't far from the truth.  He's sporting a very nice cock and it's rock hard and ready to go.  He comes out of his pants pretty quick and reveals a nice set of legs that compliment his nice body perfectly.  This man is very well proportioned.  If you're a nipple fan you're gonna love Colton's nice nips, too.I keep asking questions and Colton is glad to answer.  He says he was about 14 the first time he jacked off, bout 15 when he got his first blowjob and he tells us the story about how that all went down.  You can tell he's just a tad uncomfortable just yet but he doesn't mind showing off that nice body and cock.  That's the first good sign to good things to come.He stands in the corner and jerks his cock while we get a great look at that gorgeous body and those nice legs, even turning around for a bit to give us a nice peek at that delicious bubble butt he's sporting.  I get a few good up and down pans of those legs and that body while he beats that nice dick for us.  He takes a short break and just stands there for us to admire that body he works so hard on while turning around to allow us to admire that butt.  Once he's back on the bed he's stroking it hard and fast, even working up a sweat until he blows a nice, juicy load all over himself.  That smooth, gorgeous body looks so delicious with all that hot jizz covering it and if you aren't in love with Colton, you soon will be.",
  "models": [
    {
      "name": "Colton",
      "person_id": 35287
    }
  ],
  "release_date": "2012-04-04",
  "scene_id": 70543,
  "tags": [
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Colton"
}