{
  "collections": [
    "Active Duty"
  ],
  "description": "You'll all remember Dallas from his few scenes in the past.  For me, the winner was his scene with Dorian in Double Time 5 where these two rocked the room.  I still watch that scene on a regular basis and it's saved in my own personal favorites here on AD.  Yes, I liked it that much.  Anyway, Dallas contacted me and said he was ready to return for some fun and I couldn't wait to get him back in front of the camera.  I also couldn't wait to see him get that nice, round bubble butt of his fucked again.  I showed his pictures to our adorable newbie, Axl, who was ready for action.  Axl had also confided in me that he'd found a sweet spot for Thomas and couldn't wait to find out what that big cock felt like up his ass.  So, out of Axl's own longing, today's threesome was born.  I think you'll agree, our horny little recruit was spot-on with his choices for a great scene.Things kick off with me shooting the shit with Dallas about where he's been.  He's looking great and I can tell he's ready to get down to business.  We talk a little about his last scene and Thomas pipes up to talk a little about his award winning scene in Rear Gunners 2 where he, Cole, Chaz and Shane take advantage of the gym equipment in my garage and end up bringing home the award that year for Best Amateur Video at the GayVN Awards.  Thomas is all smiles as he recounts the 'dip machine' they used in that scene.  Axl says he feels special to be in such company as his face beams with delight.  Dallas' cock is already hard and Axl has his eye on it as he plays with his own dick through his boxers.  Once they see the size of Dallas' nuts they get a good laugh but I can tell that Axl is ready to get his mouth on them.Axl pulls off the boxers to reveal a raging boner and it matches the big smile on his face.  Axl isn't wasting any time.  As they wait for Thomas' beast to rise to the occasion, Axl slides up next to Dallas and starts playing with his hard cock.  He's admiring those big nuts as he squeezes them in his hand and he's down on that dick in no time flat.  Meanwhile Thomas is watching these two get acquainted as he pulls out that monster of his and starts stroking it.  Dallas is liking the attention he's getting from Axl as he lays his head back and moans.Thomas brings his cock to the game and Axl latches on as Dallas goes down on Axl.  After Axl sucks Thomas for a bit and Dallas sucks Axl, Thomas decides to help Dallas on Axl's cock.  They share the nice meat together as Axl kicks back and enjoys.  Thomas and Axl go for a kiss and Thomas works his way down Axl's abs and finds his way back to his cock.  Meanwhile Dallas makes his way down to Thomas' cock and starts sucking it.  His nice ass is in a perfect position for someone to move up behind him and fuck him as he manhandles Thomas' meat.  Axl is horned up and ready and quickly finds himself behind Dallas' perfect round ass where he's ready to fuck it.  He shoves his cock in Dallas as Dallas keeps his mouth full of Thomas' fat dick.  Axl is fucking him hard and deep and Dallas is loving it.  The moaning is at a high-pitched level now as these three get lost in the moment.  Axl is shoving his cock balls-deep in Dallas and Thomas is directing the action as he tells Axl to fuck that tight ass and Dallas to keep his fat cock in his mouth.  Dallas takes orders well as both his holes are getting filled.  Thomas keeps his usual dirty talk going as Axl continues to pound Dallas' ass.  He takes a cock so well it doesn't matter which end it's in.  Dallas is slapping Thomas' huge meat on his mouth and face as Axl bangs his ass deep.  He must be in heaven by now or somewhere in another world.  Axl even goes down to help Dallas suck on Thomas' cock while he plows Dallas' ass.  Talk about multi-talented!It's Axl turn to take some dick as he straddles Thomas' dick and Dallas helps him get the fat meat up his tight ass.  Once they work it in, Axl goes for a joy ride, taking that big dick to the balls as he sits all the way down on it.  Dallas finds his way into the mix and Axl takes turns stroking his dick when Thomas isn't sucking it.  Axl shoots his load all over Thomas' abs and chest, Thomas follows suit and blows his wad while Axl plays with his balls and Dallas brings up the rear with Axl sucking his dick, working it to climax before Dallas takes matters in his own hand and finishes the job.",
  "models": [
    {
      "name": "Axl",
      "person_id": 35274
    },
    {
      "name": "Dallas",
      "person_id": 35070
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2012-04-15",
  "scene_id": 70546,
  "series": "Fraternizing Forces 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Gay",
    "Threesome"
  ],
  "title": "Axl, Dallas & Thomas"
}