{
  "collections": [
    "Active Duty"
  ],
  "description": "The boys get wet then play some football with Josh and Damien teaming up against Thomas and Elijah. Thomas and Josh tangle a few times in the sand trying to show off their tough-guy persona’s. The football game is shortlived as the boys head to the house to get cleaned up. Once in the shower the touchy feely begins as the four hotties wash each other down. That’s a lot of hot meat for one shower but they manage to shift things around so that everyone gets good and clean. I get some good overhead shots of the shower scene and it’s so hot to watch as they huddle together like Navy Seals trying to stay warm. Damien and Josh wash each other down good as Thomas and Elijah clean one another up. Our heroes get all dried off only to get all dirty and wet again back in the bedroom.Thomas and Elijah team up on the same bed while Josh and Damien take their bed. It’s the start of a cocksucking fiesta, troops. The cocks are hard from the start as Josh wonders how long it’s gonna take before Damien latches on to his and gives it some lovin’. Damien must have been reading Josh’s mind cause he’s on it like white on rice in a matter of seconds. Elijah positions himself between Thomas’ legs and begins taking the long, thick monster down his throat as Thomas smiles. Damien is holding his own on Josh’s fat meat as Josh guides his head up and down shoving the shaft of his cock deep down Damien’s throat. Thomas watches Damien and Josh and the glances go back and forth as Josh and Thomas watch each other get serviced by their boys. Josh gets on his knees and begins to face fuck Damien as he thrusts his cock back and forth into Damien’s salivating mouth. Elijah continues to swing from Thomas’ big rod and the cocksucking games continue. Josh is loving all this attention to his cock and he makes some very interesting faces. Elijah decides to get down on his knees beside the bed so he can manhandle the huge cock in front of him. Thomas and Josh position themselves side by side so they can compare their cocksuckers abilities to one another. Elijah and Damien go at it toe-to-toe giving the cocks a good working over.Thomas turns around and lets Elijah eat his ass to prepare it for the fucking Elijah is about to put on it. Elijah is a master ass eater and spares no lick in eating Thomas’ ass. Damien continues to service Josh as the scene progresses to the next step. Josh keeps a close eye on the action beside him as his cock is being worked over good. Elijah strokes Thomas’ huge cock as he eats his tight hole. Elijah takes the huge cock in his mouth once more before he bends Thomas over the bed and puts his cock deep inside him. Thomas is getting a taste of his own medicine now as Elijah plows deep inside him. Elijah isn’t showing Thomas any mercy as he fucks him good and hard. Meanwhile Damien has started riding Josh’s cock on the other bed and the fucking has begun. But this is just the start of all the ass fucking that took place that day. Damien is taking all of Josh’s huge meat as he bounces up and down on it, taking it deeper and deeper each time. Josh gets him doggy style so he can really put a fucking on the hot young ass. By this time Elijah has flipped Thomas on his back and has his legs in the air as he fucks Thomas’ ass really good. Damien is yelling as Josh fucks him hard. Thomas is starting to like it by now and the fucking continues. Elijah is going all the way in Thomas’ ass at this point and Thomas is holding his legs back for his fucker to do his job. Thomas’ cock is nice and hard which is an indication that he’s getting comfortable in this position and with a nice cock inside him. Josh is slamming Damien hard and Damien is jerking his cock. Elijah is licking and sucking Thomas’ nipples as he fucks his ass. He takes his cock out and moves up Thomas’ chest as the two embrace is a hot kiss. Josh has Damien on his back now as Damien strokes his cock while Josh fucks him hard. Damien blows a huge load while Josh is inside him plowing deep. Josh helps him stroke it out.Elijah manages to sit on Thomas’ cock and take it all inside him. But Thomas wants control so he turns him over on his hands and knees so he can give it to him deep and hard. Elijah is giving off some yelps as Thomas shoves all his cock deep in Elijah’s ass. Elijah is taking this huge cock up his ass like a true champion as he breathes hard and shakes all over. He reaches underneath and plays with Thomas’ balls as they bang up against his. Elijah’s cock is getting hard and his nuts are tightening as he takes a good fucking from Thomas. He’s stroking his rock hard cock now as he’s being banged. Thomas invites Josh over to take the reins and Josh is more than happy to do so. Elijah is soaked in sweat at this point and Josh just rubs it all in as he plows deep into Elijah. Elijah isn’t complaining one bit as Josh gives him a harder fuck than Thomas did. Meanwhile Thomas has gotten Damien all hot and bothered again and is balls deep in Damien’s ass banging him while Josh bangs Elijah. They get the boys on the same bed face-to-face as they bang them both hard from behind.Josh is the first to go as Elijah eggs him on to cum in Damien’s mouth. Josh pulls out of Elijah and puts his cock in Damien’s mouth and blows his huge load. Damien takes the load and it oozes out of his mouth. Elijah ask him how it taste and he responds, “like candy.” Thomas is banging Damien hard and pulls out and feeds his load to Elijah who takes it all and just lets it fill his mouth until he can’t hold anymore. The huge load oozes out and onto the bed. And that, troops, is a wrap.",
  "models": [
    {
      "name": "Damien",
      "person_id": 35071
    },
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Josh",
      "person_id": 35099
    },
    {
      "name": "Thomas",
      "person_id": 35154
    }
  ],
  "release_date": "2012-03-25",
  "scene_id": 70540,
  "series": "Fire In The Hole 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Facial",
    "Gay",
    "Group",
    "Muscular",
    "Shower",
    "Smooth"
  ],
  "title": "Damien, Elijah, Josh & Thomas"
}