{
  "collections": [
    "Active Duty"
  ],
  "description": "The guys are already shirtless and laughing when the camera comes on and of course playing with their cocks as they loosen up.  I start out giving Gamble a hard time, asking him if he's already causing trouble.  He's the first to pull out his cock and it's already hard and ready.  We bullshit a little and Carson and Gamble give Dixon a hard time because they're both hard and jerking while he's still working things out.  You can tell right away that these three devils are up for some mischief.  Gamble loses his shorts as Carson slaps his hard cock against his stomach and Dixon is getting an eye full of hard dick.Dixon gets naked and Carson goes right for his hard cock, taking it in his mouth and starting to work it.  Gamble is paying close attention as his own hard cock bounces in the breeze, slapping his furry little tummy.  He moves closer to give Dixon access to his dick and Dixon takes to to it like a duck to water.  He's on it as quick as it gets close enough to put in his mouth.  Gamble is all smiles as Dixon works his cock.  He's giving the newbie some pointers and Dixon is learning quick.  Carson is keeping Dixon's cock at attention all the while as these three get the party started.  You can tell that Carson is having himself a good time on Dixon's cock as he strokes his own.  Gamble cracks some raunchy jokes and then offers to help Carson out on Dixon's dick.Gamble goes down for his first taste of dick and shows off some tricks he picked up from Carson as he puts Dixon's cock in his jaw and pops it with his hand.  They switch things up and Gamble goes for Carson's dick while Dixon strokes Gamble.  Dixon is rock hard as he watches these two hovering just above him.    Gamble's cock is also rock hard and Dixon is keeping it company as he strokes it for him.  At this point Carson and Gamble begin sharing Dixon's cock, taking turns on the nice meat as Dixon strokes them both in unison.  Gamble suggests that Carson lick Dixon's balls while he sucks his dick and then Gamble decides to take over the whole duty as he licks his balls himself.Dixon's turn up to bat comes once more as he goes down on Gamble while Carson kisses and licks Gamble's neck.  All the while Gamble keeps his free hand stroking on Dixon's cock and then Carson and Dixon take turns on Gamble.  Gamble is having a blast as he reaches around and slaps Carson's ass while Carson works his dick.  They go back and forth on Gamble's cock for a bit then Carson moves up to feed his cock to Gamble who keeps slapping his ass while he sucks his dick.  Carson is face-fucking Gamble as Dixon sucks and jerks Gamble's cock and jerks his own.Gamble opens his beautiful mouth for Carson to fuck it and you can tell he's lost in the moment.  He's making love to that cock like he's in love with it as Carson grabs the back of his head.  Gamble can't seem to get enough and all the while Dixon is keeping him happy by keeping his cock in his mouth.  Gamble has suddenly turned into a cock hungry horny fellow and it's so hot to watch.  Dixon decides to go up and help Gamble out as he strokes Carson's cock while Gamble sucks it.  Gamble shoves Dixon's head down on it.  After they share it for a bit, Dixon goes back to work on Gamble.  Soon, Carson joins him again and helps feed him Gamble's cock.  The facial expressions we are seeing on Gamble are priceless as he enjoys the hell out of all this action.  He's stroking both dicks now while Carson works him.  Gamble tells Carson he's got his cock as hard as it's ever been as Carson and Dixon switch places once again.Gamble earns the nickname 'cock gobbler' so the boys decide to feed him both their cocks at once as they take turns fucking his hungry wet mouth.  He's proving that the nickname fits as he works both dicks back and forth, kissing and licking and sucking and taking some pretty intense face fucking from both Carson and Dixon.  Carson keeps him happy by stroking his dick.  While Dixon fucks Gamble's face, Carson finds his way back to Gamble's dick to keep it at attention.  Gamble has found out how thick and juicy Carson's ass is and he tells Dixon he should come around and check it out.  Dixon follows the lead and finds himself behind Carson squeezing that juicy but and smacking his hard cock all over it.  He goes down and gives it a few kisses as Gamble calls the shots from below.  He's enticing Dixon, encouraging him to fuck Carson as he reaches back and spreads Carson's cheeks for Dixon to get a better view.And from there, Dixon proceeds to saddle up for the fuck, sliding his cock slowly balls-deep into Carson's waiting ass.  Carson flinches a little but keeps his mind focused on Gamble's dick as he continues to suck it.  Gamble is stirring the pot with all his dirty talk as Carson gets his ass fucked proper.  Dixon is proving he makes a damn good top as he slams in and out of Carson's juicy butt.  Gamble can't keep his eyes off the action as Dixon unleashes his aggression on Carson's hole.  Meanwhile Carson is keeping busy with Gamble's cock in his mouth as they use him for their pleasure.  He's sweating now and Dixon is getting short of breath from all the fucking and Gamble continues to talk mad shit.  Carson tells Dixon he likes getting his ass slapped and Dixon gives him what he wants.  Things continue to get more and more intense to the point of being hard to describe.  This is where I'll have to leave you to see what transpires.",
  "models": [
    {
      "name": "Carson",
      "person_id": 35056
    },
    {
      "name": "Dixon",
      "person_id": 35288
    },
    {
      "name": "Gamble",
      "person_id": 35289
    }
  ],
  "release_date": "2012-04-22",
  "scene_id": 70548,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Gay",
    "Tattoos",
    "Threesome"
  ],
  "title": "Carson, Dixon & Gamble"
}