{
  "collections": [
    "Active Duty"
  ],
  "description": "Colton returns for round two and I'm chatting him up a little before I leave him in Nick Gunner's care.  It takes about one minute for Nick to start pulling Colton's pants off.  He's right down to business as he watches Colton strip his clothes off you can tell he's excited with the package he's about to tear into.  He wastes no time getting right to the heart of matters as he kisses Colton's neck and chest as he works his way down to that nice cock.  Nick is taking pride in how he works that dick with his mouth as he talks to Colton's dick, telling it to get on up for him.  And it listens.  Nick Gunner takes off his watch and from there the blow job he's giving Colton does the trick.  Colton is standing at full attention by the time I return to the room and it's obvious that Nick Gunner's little hot mouth is pleasing him just fine.  Colton gets a nice grin on his face from time to time and lets out some amazing moans of approval as he watches his little cock sucker worship his nice dick.  Colton is all man as he lays back and enjoys Nick Gunner working that cock.  The moans alone are enough to drive me crazy as I watch in awe.  These two have hit it off nicely and Colton seems very at ease with little Nick Gunner crawling all over him like a little ferret.  A few times you can hear Colton as he whispers out, 'Fuck.'  Nick talks to him, telling him how good that big dick tastes and Colton asks him if he likes it.This might all be a brand new experience for Colton but he's taking to the newness just fine.  Nick Gunner assures him that he's gonna take good care of him and Colton agrees that he is.  Nick finally wiggles his way out of his boxers while he worships Colton's cock.  He starts playing with his cock as I zoom in on his nice little ass, anticipating Colton's cock shoved in there.The verbal exchange that happens next is just as hot as Nick Gunner's blow job as they negotiate about Colton fucking Nick's tight little ass.  And as quick as you can say 'fuck his little ass,' Colton is saddled up and inside Nick Gunner, slamming his cock in and out of that hot little hole.  He's pounding him like a bitch he picked up at the bar and Nick Gunner is loving every minute of it as he tells Colton to smack his little ass while he fucks it hard.  Nick is jerking his own hard cock while Colton bangs his brains out.Colton manhandles little Nick Gunner like his own personal little bitch and it's so fucking hot to watch as you know they are both really enjoying the fuck out of this.  Nick's 'O' faces tell the story as he strokes his own hard cock faster and faster.  Colton puts him on his back to give him a better angle to bang that ass and Nick a better position to stroke his own hard cock.  Nick is stroking hard and fast as Colton pounds his little hole, he's got him stuffed full of cock and that's just what Nick needs to blow a huge load all over himself.  He squirts it out as Colton goes deeper and deeper, giving Nick Gunner the attention he's needed for days now.Nick isn't done yet, though, as he tells Colton to let him suck that dick some more and make him cum.  You can tell he intends to make this one hell of a memorable experience for this newbie.  He works that cock with more gusto than before and Colton is loving the attention.  Nick Gunner is deep throating that cock and teasing the hell out of Colton as he works him closer to cumin.  Colton is being pretty verbal as Nick Gunner tells him to give him that hot cum.  You can tell Nick wants him to shoot as bad as Colton wants to.  He finally blows his load all over Nick's chest, soaking him good for a job well done.",
  "models": [
    {
      "name": "Nick Gunner",
      "person_id": 35123
    },
    {
      "name": "Colton",
      "person_id": 35287
    }
  ],
  "release_date": "2012-04-08",
  "scene_id": 70544,
  "series": "Fraternizing Forces",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Gay",
    "Smooth"
  ],
  "title": "Colton & Nick Gunner"
}