{
  "collections": [
    "Active Duty"
  ],
  "description": "That day I met up with Kolby after he was off work and showed him pictures of Elijah.  I could see the excitement beaming in his eyes as he asked me tons of questions about what Elijah liked to do.  By the end of our conversation Kolby was all excited about Elijah's arrival.  Kolby's curiosity was about to get satisfied and I was anxious to see how all this would play out.  Once Elijah arrived on the island I took the two of them out for drinks that night to let them get to know each other a little before the shoot.  They hit it off immediately and I just knew we had ourselves one hell of a duo scene on our hands.  I was right.<br /><br />Things kick off with Kolby sporting a huge smile as we chit-chat about the build-up that brought us here.  Elijah chimes in and helps things along and it isn't long at all before these two are getting right down to business.  Kolby doesn't hesitate to be aggressive as he reaches right over to cop a feel on Elijah's hard cock.  The clothes come right off and they meet in the middle of the bed to explore each others bodies.  Kolby starts out by kissing Eli's nipples and playing with his cock but it doesn't take Elijah long to find his way down to that nice fat uncut Brazilian cock of Kolby's.<br /><br />It's been a little while for Elijah and he finds the big uncut meat to be a little challenge at times as he gags on it while servicing it.  You can tell he's hungry from his long absence of 'bromance' and his intensity shows as he really gets into servicing Kolby.  All the while Kolby is jerking and playing with Elijah's cock, too, as they get to know each other even better.  Kolby eventually moves underneath Elijah and they form a nice sixty-nine as they explore each others cocks.  Kolby is having all sorts of fun with Elijah's cock in his mouth and his in Elijah's.  <br /><br />Eventually the sixty-nine breaks up and Kolby is down beside Elijah sucking his cock as he jerks his own.  You can tell he's liking this.  Elijah is liking it, too, as he throws his head back and rolls his eyes.  Kolby gets points for being an enthusiastic first-timer as he deep-throats Elijah's cock over and over until tears are coming from his eyes.  That big smile tells the story as he works that dick with his mouth as Elijah reaps the benefits and moans in pleasure all the while.  These two are hot for one another and the heat in the room transfers right to the screen.  <br /><br />They go for some hot kisses, tongue-fighting before Elijah goes down to return the favor.  He's spitting on that uncut cock and sucking it like it may be the last cock he'll ever taste as he strokes his own hard cock at the same time.  He takes it all the way down his throat again and again to give Kolby the best treatment possible.  All the while, Kolby is starting to find his way to Elijah's nice little ass as he plays with it and Elijah's cock.  Kolby's smile lights up the room as he watches Elijah enjoy his fat cock.  You can tell he's getting exactly what he came for.<br /><br />Kolby asks Elijah if he likes that dick and Elijah says, 'Mmm hmmm.  You like mine?'  Kolby says 'yes' and Elijah says, 'How much?' and Kolby responds by saying this much as he pulls Elijah on top of him to fuck his face.  Elijah squats over Kolby throat fucking him and slapping his rock hard cock all over his face and mouth.  Kolby's hard cock meets Elijah's nice ass and Elijah is getting other ideas as he rubs the uncut jewel against his pretty little ass.  They go for more hot kissing and Elijah asks Kolby if he'd like to put that dick in his ass and Kolby says he is.  Elijah comments that he's ready for it as he rubs it against his crack some more.<br /><br />Elijah does the honors of saddling-up Kolby's cock for his ass as starts out riding the big dick first, slowly working it in all the way to the balls.  Elijah says, 'Damn that's a big fucking dick, oh my goodness.' as he sits all the way down on the thick meat.  'I ain't felt that in fucking forever, thank you Dink.' says Elijah as he rides that fat Brazilian dick.  Elijah amps up the dirty talk as he takes the cock deep inside him while Kolby strokes Elijah's cock.  As he's riding that dick and getting his jerked, Elijah says, 'I bet your girlfriend don't fuck you like this.'.<br /><br />Elijah wants it from behind and Kolby is more than ready to take control of the situation as he moves in behind Elijah and slides his cock deep into his ass again.  This is when we find out what a bull our man Kolby can be as he tears into Elijah's hot ass, fucking it hard and deep.  Once when he pulls out for a second Elijah demands he put it back in and he does.  He fucks him every which way but loose and Elijah is loving every second of it.  Something tells me that Kolby is liking it just as much as he manhandles Elijah's hole.  Kolby likes taking his time and trying out new positions and Elijah's willing ass provides the perfect opportunity to use a hole like he wants to for the first time.<br /><br />Elijah says he's gonna cum from that big dick being up his ass so I suggest that Kolby put him on his back so he can jerk his dick while Kolby pounds his ass.  Once he gets him on his back and starts ramming that huge dick in and out of Elijah's hole, it doesn't take long for Elijah to blow a huge load all over himself.  It's Kolby's turn now but he's not done fucking yet.  He pounds Elijah's ass some more before pulling out and shooting his own hot load, mixing it in with Elijah's.  They go for a few last hot kisses and it's a wrap.",
  "models": [
    {
      "name": "Elijah",
      "person_id": 35081
    },
    {
      "name": "Kolby",
      "person_id": 35286
    }
  ],
  "release_date": "2012-04-01",
  "scene_id": 70542,
  "series": "Fraternizing Forces",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay"
  ],
  "title": "Elijah & Kolby"
}