{
  "collections": [
    "Active Duty"
  ],
  "description": "Tucker is 21-years old, stands 6' 1' and weighs around 180 lbs.  He likes to golf, work out, snowboard, wake board and party it up.  When I ask him if he's hung like a horse or a horsefly he's confident in his answer of 'I'd say more like a horse.'  I get him to stand up and take off his shirt and we see just how ripped up his gorgeous body is.  He strips down to his cute boxers and gets right to work on that massive cock he's sporting.By the time I return, he's stroking that nice hard dick and breathing pretty hard.  He's got it out of the flap in his boxers going to town.  I can't wait to get him completely naked so I can get a good long look at those delicious thighs.  We quickly find out that Tucker is a talker and he gets the dirty talk going as he strokes his big cock for us.  He wants to know if we like that big dick he's teasing us with.  Finally the boxers find their way to the floor and this stud comes up on his knees to give us a hot show.  I get down below his cock so we feel like it's right in our face and he keeps asking us if we like it.  I pan up his body as he shows off all that definition he's worked so hard for in the gym.  I could look at this guy all day long and never grow tired, he's just plain fucking hot.Once he lays back down that big cock is standing at full attention and he's really liking the way his hand feels. He's breathing harder as he strokes it faster, switching up his technique a few times as I get lost in those gorgeous blue eyes.  For me, it's probably the nice furry thick thighs and near perfect big dick that gets me going most, but the entire package together is just perfect.What happens next take the cake for me as Tucker turns over on his stomach and starts humping the bed, showing off that beautiful ass as he pounds his hard dick into the bed.  I get behind him and get some good shots of those perfect mounds as he bangs the bed and talks dirty to us.  He wants someone to lick that ass for him as he brings his ass up and spreads his cheeks to show us that hole.  And what a beautiful pink pucker it is.  It opens up a little so we can get a great look at it.  Once he's teased us just enough he turns over and shoots a huge load all over the bed as it drips down his thigh and almost into his ass.  We join him in the shower where he shows off some more for us as he washes that gorgeous body down, making sure to give us plenty to gaze upon.",
  "models": [
    {
      "name": "Tucker",
      "person_id": 35162
    }
  ],
  "release_date": "2014-01-29",
  "scene_id": 70549,
  "tags": [
    "Big Dick",
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Tucker, Scene #01"
}