{
  "collections": [
    "Active Duty"
  ],
  "description": "In my interview with Dixon where we learn that he hails from Tennessee, likes to drink, fight and used to do some rodeoing. He likes to work on trucks and is an all around country boy and proud of it.  Dixon is 20-years old and stands 5' 11' and weighs around 160 lbs. I get him out his shirt as we shoot the shit and get him on the bed where he is quick to unbuckle his belt and pull out his cock.  This cute country boy ain't afraid of shit and it shows.  His cock stands at attention quicker than you can say 'shit-kickers' and he has no problem letting us get up close and personal.As the session goes on, I realize that Dixon has a good sense of humor in between takes so I take my chances and move in a little closer, getting him to talk to us about how he likes to have his dick sucked and that's where I start telling him about Old Reliable and his method of picking up rough, tough guys and get them to show off for him.  I tell Dixon that Old Reliable just wanted to work his way toward sucking the guys dicks but I assure him that I'm not going to  do that.  What Dixon says next was totally unexpected as he says, 'At least not yet.  At least not until you buy me dinner or something.'  I assure him that I'll buy him dinner and he says, 'Better be a good fucking dinner, I ain't cheap.'  I ask him if a Happy Meal will do the trick and he's quick to ask, 'Do I get a toy?'From there, Dixon and I make fast friends as I tell him that if I'm going to suck his dick I wanna eat his ass, too.  I get him to bend over and show it to me and he has no problems spreading that hairy hole open and showing us the gold.  He wants to know if I like the way it looks and I say, 'Mmmhmm.'  He stays in the arched back position long enough to give us a good, long look before coming up on his knees and keeps stroking that rock hard cock of his.  I'm not sure the last time I seen such a hard dick -- it was literally like concrete.  It was then I started to realize that Dixon was having just as much fun as I was.The banter war goes back and forth between us and I ask him to play with his ass a little bit and he rubs his finger up and down his hole.  Finally I challenge him to shoot his load all over the camera as if it were my face, but the position proves to be too cramping so he lays back and works his load out all over himself.  I tease him about not shooting it on me and he blames it all on me not being close enough.  Damn, If I had three feet one of 'em would still be kicking me in the ass for missing that.",
  "models": [
    {
      "name": "Dixon",
      "person_id": 35288
    }
  ],
  "release_date": "2012-04-11",
  "scene_id": 70545,
  "series": "Fraternizing Forces 3",
  "tags": [
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Dixon"
}