{
  "collections": [
    "Active Duty"
  ],
  "description": "Kolby is of Brazilian descent with beautiful brown eyes, thick lips and a nice, fat uncut cock to match.  In his debut solo we learn that Kolby is 23 years old, stands 5' 11' and weighs about 180 lbs.  He loves to play drums, shoot guns and go mudding in his truck.  I get Kolby to stand up for us and you can see the imprint of his fat cock protruding through his jeans.  He turns around and shows off that beautiful bubble butt.  Kolby is smooth with an olive complexion and we waste no time getting him on the bed where I zoom right in on that nice uncut masterpiece as he begins to stroke it.  The foreskin is just perfect.  Kolby comes out of his jeans and starts working on the uncut wonder, lubing it down and working it up as I spend some time between his legs asking him questions like how old he was the first time he got his cock sucked.  Those lips are just gorgeous and that smile tells the story about how much a scamp this hottie can be.I ask him if he's ever had his cock sucked by a guy and he says not yet, but he's ready.  When I go further and probe him for more answers about what he'd like to try he admits that sucking a big dick is on the top of his list. (I've always said everyone loves a big dick.  Kolby's answer helps confirm my theory.)The more he works that nice cock up and slowly pulls that nice foreskin back and forth over the beautiful head, the more you'll want to jump on the bed next to him and help him out.  Something tells me Kolby wouldn't mind that at all, either.  He gives us a guide to how he likes his cock sucked and I'm all ears.  He also tells us some hot stories as he continues stroking his cock.I decide that I want this hot man's cum all over me so I get on the floor beneath him, aiming the camera up at that nice fat cock as he shoots at least a ten-roper all over me and the camera.  You don't hear any complaints out of me except maybe a little light-hearted protesting (but I assure you I was as happy as he was).",
  "models": [
    {
      "name": "Kolby",
      "person_id": 35286
    }
  ],
  "release_date": "2012-03-28",
  "scene_id": 70541,
  "tags": [
    "Big Dick",
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Kolby"
}