{
  "collections": [
    "Active Duty"
  ],
  "description": "First, we have the return of our man Jake after a long absence. And, our man Dixon bottoms for the first time. But wait, there's more! Kaden returns to the director's chair to man the camera and direct the action for today's hot scene.Jake has returned to AD looking better than ever.  He's been working hard in the gym and that beautiful body is shredded to damn near perfection.  It's been awhile since he was in the saddle but today Jake makes his comeback by breaking in our country boy Dixon who has no doubt rode a few horses in his day, but today's horse is going to be just a bit different.  Dixon makes the journey from Hawaii to Cali to lose his virginity and I thought he and Jake would make a great pair.  I spend some time admiring Jake's new fit body and Dixon says he doesn't like to share the camera for long.  He's a pistol and doesn't appear to be afraid of anything.  We talk about his first scene with Gamble and Carson and how good it was and he points out that it was because he was in it.  I'm blown away by his confidence so I ask Jake if he thinks he can pound some of that confidence out of him today.  Jake seems to think he can.After the initial chit-chat, I turn the reins over to Kaden and leave the room.  They get a little of their own banter going back and forth as they work up their cocks.  Jake throws that head back in his signature style as he prepares for the mission at hand.  I could look at this man all day no matter what he was doing.  Dixon is checking him out, too.  You can tell that Dixon is pleased with his scene partner as he checks out Jake's fat cock.  'Not bad.' is Dixon's response when he first sees Jake haul the soft monster out.  Dixon can't take his eyes off the prize as he continues to check out Jake's body and package.  His cock is hard as a brick in no time at all.Jake isn't here to waste time and it doesn't take long for him to suggest to Dixon to give his cock a taste.  Jake wants to see what Dixon has learned so far before he teaches him something new.  Dixon goes right to town on Jake's cock, working it as it grows in his mouth.  He takes special care in his attention to Jake's fat cock and gives him plenty of action on the shaft and balls.  He does his signature jaw popping while the big cock fills his mouth.  By the time Jake's cock is standing at full attention, Dixon is coming out of his shorts, sporting his own wood.  Jake is quick to grab on and stroke it for him while he sucks Jake's dick.Dixon is like a snapping turtle and you wonder if it'll take a bolt of lightening before he let's go of Jake's big meat.  He's obviously having fun playing with such a big toy and worshipping it good.  Jake is loving the attention that Dixon is giving his dick as his moans tell the story.  He decides to come up on his knees to fuck Dixon's throat and what a throat fucking it is.  Dixon takes everything Jake can shove down his throat.  Dixon mentions how he can feel that big cock stabbing his tonsils, but that doesn't scare him off.  He takes a few more fast thrusting throat fucks as he jerks his own hard cock.  Jake moves Dixon to the side of the bed and has him get down on his knees to worship his cock as Jake continues filling his throat with his fat dick.They switch places and Jake takes Dixon's cock in his mouth, working it with his tongue.  Dixon kicks back and enjoys the returned favor as he comments on Jake's skills.  Jake spits on Dixon's cock to lube it up more as he keeps working it with his mouth.  Dixon keeps the pace going by jerking Jake's cock for him while Jake services his.  From there, a sixty-nine forms between these two with Jake on top working his cock down into Dixon's throat.After they've enjoyed their mutual cock-worshipping session, Jake suggests it's time to teach Dixon the next new thing and tells him to lube up his ass a little to prepare for the new mission.  Dixon doesn't hesitate.  He bends over and arches his back, anxiously waiting on what Jake is about to teach him.  Jake decides to open him up a little bit first by shoving some fingers in his tight ass.  He gives Dixon an appetizer of finger fucking his virgin ass for a bit before giving him the main course.  While Jake is still fingering him, Dixon asks if that's his dick or finger.  It's obvious this country boy as never been on the receiving end of a fat cock before.Jake works his fat cock slowly into unexplored territory as he allows Dixon to relax and let it slide in.  It's a tight spot for Jake's big Chrysler-sized cock, but he's an expert at parking it in tight spots.  Dixon is grunting like the grunt he is as he tries to accommodate the huge dick.  By the looks on Dixon's face you'd think someone did just pull a Chrysler into his ass.  Priceless.  He asks Jake if his hole is tight enough for him as he strokes his own cock fast and hard.  Jake works his way into plowing mode and begins pounding his cock in and out of Dixon's hole, slamming his ass so hard that you can hear his balls smacking that ass.Next, Jake puts Dixon on his back and begins to plow him from that position as Dixon strokes his cock while Jake pounds his ass hard and fast.  It doesn't take long in this position before Dixon is screaming out, 'I'm coming, I'm coming' as he breathes hard and moans.  Once he's landed a huge load all over his chest he tells Jake to keep going and get his.  Jake pounds him a little more before he reaches his climax and shoots his load right in with Dixon's.  After it's over, Kaden calls me in to do the closeouts.  I give Dixon shit by telling him that in a couple of hours we're going to do his first double penetration.  For the first time ever, he throws in the white towel.  Maybe another day?  Enjoy.",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Dixon",
      "person_id": 35288
    }
  ],
  "release_date": "2012-05-20",
  "scene_id": 70557,
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Duo",
    "Gay",
    "Tattoos"
  ],
  "title": "Dixon & Jake"
}