{
  "collections": [
    "Active Duty"
  ],
  "description": "I fell in love the moment I met Porter and he flashed that gorgeous smile and those beautiful green eyes.  I was hooked from the start.  Once things got going I became even more enamored with this delicious little devil.  He certainly knew how to work me and I'm betting he'll give you a run for your money as well.Porter told me a few of his secrets and I bring them up as we chat in the beginning.  A few days prior to me filming Porter, he'd rode along with another friend of his who I'd had scheduled to shoot.  While his friend was having his photos taken by Major Wood, I was outside on the patio talking with Porter and the subject came up about whether he'd ever experimented with another guy before or not.  He wasn't shy in the least and commenced to telling me a great story.  It's a classic tale of two friends having a good time and finding out some things about themselves along the way.  I'll let you watch the video to get the whole story straight (pun intended) from Porter's mouth.After his story of experimentation we find out that Porter hails from Phoenix, Arizona, he's 21-years old, stands 5' 8' and weighs 145 lbs.  In high school Porter ran cross-country track, swam and wrestled.  Sounds like he was quite the little jock.  Porter has personality for days and he's all smiles.  I can't wait to get him naked and once I do, he comes out of his jeans with a raging hard cock, ready to get right down to business.  That furry little butt grabs my attention right away and I can't seem to get enough of it and boy does he know how to show it off.  He's also not shy about playing with that sweet little hole and sticking his finger inside.  If you're an ass man and love a hot guy that knows how to show it off then you're gonna love Porter.  Hold on to your hand grenades, troops, I'm sure we'll be seeing more of this cutie in the future.",
  "models": [
    {
      "name": "Porter",
      "person_id": 35291
    }
  ],
  "release_date": "2012-05-09",
  "scene_id": 70554,
  "series": "Force Rendezvous 3",
  "tags": [
    "Brunette",
    "Gay",
    "Jerk Off",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Porter"
}