{
  "collections": [
    "Active Duty"
  ],
  "description": "Boyd finally mans up and gives up that perfect virgin ass to none other than Kaden.  It took a lot of talking and a lot of convincing, but when he finally committed to it, he was anxious and excited.  And, I was excited for him.  I had a hunch that he'd really like it and I was right.  I think we'll be seeing more of Boyd giving up that sweet butt in the future.Things kick off with Kaden and Boyd all smiles as I chat them up a little before they get better acquainted.  Kaden is already playing with his hard cock through his tight jeans as I chat Boyd up about what's going to happen.  Kaden jokes about Boyd going from 'never to whenever' and Boyd just laughs.  But I can tell that he's really been waiting for this moment and I don't waste any time letting them go about their business.  I leave the two of them alone and Kaden continues the chat.  He tells Boyd how nervous he was his first time bottoming, but Boyd doesn't seem as nervous as he does excited.  After the initial chit-chat they start out by admiring each others bodies as they begin to strip down.  Boyd seems mesmerized by Kaden's body and they start out with a nice juicy kiss.  Kaden starts playing with Boyd's nipples and exploring his torso with his tongue as Boyd lays back and enjoys.  The pants come off quickly and Boyd is waiting to see what's inside Kaden's boxers that's eventually going to take his virgin ass.  Kaden wastes no time playing with Boyd's cock, getting it out of his boxers and going down on it.  The feeling is intense for Boyd as he let's this pro explore his manhood.Kaden gives Boyd lots of attention as he works his cock with his mouth.  He's giving him a combination of teasing and attention that seems to send Boyd over the edge.  Once Kaden's boxers come off it doesn't take long for Boyd to return the favor.  He's getting a taste of the cock that's about to go in his ass and he seems to love it.  Kaden lays back and let's him work his magic as he thrusts his cock in and out of Boyd's throat.  He's fucking his face and Boyd is keeping the pace.They switch back and forth, enjoying each other's cocks and mouths as things progress toward the next step.  Boyd gets his chance to return the face-fuck to Kaden.  You can feel the horniness all over the room as we watch these two get into one another.  Kaden is liking the face-fucking that Boyd is giving him and he's letting him know.  Kaden is slapping his own hard cock against his belly as Boyd fucks his throat.They end up in a sixty-nine position as they fuck each other's faces, but things are about to take a turn.  Kaden asks Boyd if he's ready to get fucked and Boyd is more than ready.  He comes up on his knees for Kaden to admire that beautiful virgin ass as he arches his back, waiting for the moment to come when Kaden shoves his cock deep in his ass.  Once it's in, it's on and the faces Boyd is giving off are priceless moments of both pleasure and pain.  He's getting his perfect ass deflowered by a beautiful man and he's loving every minute of it.  Kaden is lost in the moment as he plows that tight virgin ass.  He can feel Boyd's excitement wrapped all around his cock as he fucks him harder and harder.  He's banging him so hard his ass is rippling from the pounding and he's jerking his hard cock that looks as if it will explode.Boyd is loving this new intense feeling so much that he tells Kaden to put him on his back so he can come while that cock thrusts in and out of his deflowered hole.  Once he's on his back it doesn't take long before Boyd is erupting all over himself in ropes of sweet white cream.  Kaden keeps pounding him harder and deeper after he comes as if the tightness of his ass contracting while he's coming is making Kaden even hornier.  He pounds him for a good while longer and until he reaches the point of no return, exploding all over Boyd's stomach and still hard cock.   Boyd is covered in hot cum and tingling as they go for another hot kiss to seal the deal.  Boyd's obvious pleasure makes you wish it was your first time again, too.  Enjoy.",
  "models": [
    {
      "name": "Boyd",
      "person_id": 35248
    },
    {
      "name": "Kaden",
      "person_id": 35022
    }
  ],
  "release_date": "2012-05-06",
  "scene_id": 70553,
  "series": "Force Rendezvous 2",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Duo",
    "First Time",
    "Gay",
    "Kissing",
    "Muscular",
    "Smooth",
    "White Butt"
  ],
  "title": "Boyd & Kaden"
}