{
  "collections": [
    "Active Duty"
  ],
  "description": "Tanner is one fine hunk of a hero and we were lucky to have him join us.  He's a perfect fit for AD and he seems to be eager to move things forward.  He was a little reluctant at first but I took him to a long lunch where I laid it all out on the table as the waitress brought out our sushi.  I wasn't quite sure what kind of reaction I was going to get from him, but I didn't hold back.  Tanner didn't blink an eye.  I thought he might jump up and run out of the restaurant, but he was all ears.  By the time lunch was over, he was in.  Now I had to decide who to pair this stud with to ensure his first experience was a memorable one and that he'd be sure to return.<br /><br />Axl came to mind right away.  Since Axl's first scene, we've seen just how much he enjoys what he's doing and when I showed him pictures of Tanner he was all for it.  I think he enjoys the thought of being a guy's first experience and I'm certain that anyone who is lucky enough to have Axl as their first will certainly be hooked.  He has personality for days and his excitement seems to bubble right on over to his scene partners.  Tanner was no exception.  In fact, Tanner went a little further in this scene that he'd originally agreed to go, thanks to Axl.<br /><br />After the initial chit-chat, Axl and I get Tanner to take off his shirt where Axl gets his first look at that stunning body in person.  He's really into Tanner's muscles and can't stop rubbing him.  Can you blame him?  Axl gets right down to business as he begins worshiping Tanner's chest and arms, kissing and caressing him as Tanner begins to warm up a bit.  Axl slowly starts unzipping Tanner's shorts as he reaches in to play with his cock.  Tanner cuts a few glimpses over at Axl and then closes his eyes as Axl begins kissing his neck.<br /><br />All the while Axl is playing with his own cock which I'm sure is hard as a brick by now.  Tanner watches as Axl puts his hands down his own shorts and Tanner is all eyes, waiting to see what Axl is packing, but Axl likes to tease a little first.  He goes back to exploring Tanner's body, rubbing his cock through his boxers and pulling it out to take a look.  Tanner is still a little nervous, but Axl's warm mouth doesn't take long to do the trick.  He may be a little nervous but his cock is ready for action.  With a little attention from Axl it's standing at attention in no time at all.<br /><br />Axl works his shorts off and can't help but notice those gorgeous muscular legs of Tanner's.  It doesn't take long for him to get back to work on Tanner's cock, though.  As Axl makes love to Tanner's cock I can't help but wonder what must be running through Tanner's mind right about now.  I know the blood is pumping through his hard cock and that's a good thing.  He's watching Axl intently as Axl admires his cock and body.  You can tell that Tanner is loving all the attention and Axl is certainly giving him plenty.  Tanner's big balls are beautiful and Axl is sure to give them their fair share of attention but he can't seem to keep his hands off that beautiful bulky chest.<br /><br />Tanner throws his head back a few times and closes his eyes.  It's more than obvious that Axl is doing things just right.  Once Axl takes his pants off to reveal his own hard cock, Tanner is all eyes.  He's watching Axl play with his own cock as Axl sucks his.  Axl rubs his hard dick against Tanner's leg and Tanner's hard cock starts jumping.  Axl is having fun with the jumping cock as he tries to keep it in his mouth.  He tells Tanner to make it jump in his mouth and Tanner does.<br /><br />By now Tanner is smiling as he watches Axl worship his cock. He can't take his eyes off the action now as Axl works his cock and balls like a champ.  Axl decides to lay side-by-side with Tanner and slyly says, 'you know you can touch it, right?'  Tanner gets a huge smile on his face as his hand wanders over to grab Axl's hard dick.  They look into each others eyes and I almost drop the camera.  There's something about the way Tanner looks into Axl's eyes that really gets me going.  He's lost in the moment as he plays with the head of Axl's hard cock as Axl strokes him back.<br /><br />Axl wants to explore Tanner's entire body so he turns him over onto his stomach to admire his gorgeous furry ass.  Tanner works his ass up to give Axl access to his cock and balls and Axl gives them plenty of attention while admiring his ass.  Axl decides to crawl underneath Tanner so Tanner can fuck his face and as he does, I get some great shots of that furry buttonhole.  Tanner watches the action in the mirror a little but mostly pays close attention as he guides his cock in and out of Axl's mouth.  All the while, Tanner is stroking himself as Tanner fucks his face gently.<br /><br />Axl turns Tanner back over onto his back and begins working his cock faster and faster, licking, sucking, jerking in a combination that seems to really be working for Tanner who starts breathing harder and harder.  From here it doesn't take long for Tanner to blow his nice load.  The look on his face as he's shooting his load is one to remember.  Axl has a huge grin of achievement on his face that's so cute.  He asks Tanner to 'make it jump' some more and Tanner does.<br /><br />Now, it's Axl's turn  to cum and Tanner doesn't mind giving him a helping hand to achieve his goal.  He strokes Axl's hard cock fast as Axl plays with his ass and balls.  Finally Axl cums all over himself while having Tanner flex his gorgeous muscles for him.  That does the trick for Axl as he blows a thick creamy load all over himself.",
  "models": [
    {
      "name": "Axl",
      "person_id": 35274
    },
    {
      "name": "Tanner II",
      "person_id": 35290
    }
  ],
  "release_date": "2012-05-13",
  "scene_id": 70555,
  "series": "Ripped Recruits",
  "tags": [
    "Big Dick",
    "Duo",
    "First Time",
    "Gay",
    "Muscular",
    "Tan",
    "Tattoos"
  ],
  "title": "Axl & Tanner"
}