{
  "collections": [
    "Active Duty"
  ],
  "description": "I know many of you have been waiting on today's scene to happen just as much as I have and it's finally here.  Nick Gunner and Axl get their chance to tangle and what a beautiful match made in porn heaven it turned out to be.  The energy and chemistry was there from the very start as they kicked the scene off with some sensual lip-locking, tongue-tangling kissing that lets you know right away that they are both happy to be there.  Not many people have the ability to show enthusiasm for what they're doing like these two.  Put them together and you've got enough passion hot enough to set the bed on fire.The warm-up kisses, body exploration, dry humping and teasing set the mood perfectly as these two finally get a chance to find out what they've been missing.  They've met before, hung out and partied together but they've never had the chance to get a taste of one another.  I think that build-up of anticipation really paid off once they were able to unleash it with one another.  I've been watching it simmer since the first day they met and today it boils over into one of the hottest duo's I think we've featured lately.Less than three minutes in and the clothes are all but gone as Nick Gunner climbs on top of Axl and slowly loses his boxers as they continue to lock lips and embrace the moment.  Nick's little ass shimmies loose from his boxers and looks like a prize.  Axl reaches underneath and cups Nick's balls, stroking his cock slowly before moving his hands around to that gorgeous little ass and spreading it open.  It's clear from that moment on what Axl is after.  Nick Gunner continues to tease Axl by grinding gently against his body in between kisses.  Finally, he pulls Axl's boxers off to reveal that beautiful hard dick and it doesn't take Nick long to find his way down to that joystick.  He starts out slowly licking the head of Axl's cock, literally making love to it as he licks the shaft, takes it down his throat slow and gentle and just enough to get Axl all riled up.Axl pulls Nick Gunner up onto his chest where he takes his cock in his mouth and begins slowly sucking the nice curved meat.  All the while Nick is slowly stroking Axl's hard cock in response.  Axl speeds up the pace a little as he works Nick's cock with his tongue and mouth and Nick gently rubs his balls.  It's clear they're both enjoying the hell out of one another.  Nick starts moaning lightly and then he can't resist telling Axl how damn good it feels as Axl just smiles before taking Nick's cock back into his mouth.  Axl rubs his hand up Nick's abs as he admires that gorgeous little body.  Nick moves back down for another taste of Axl's rod and finds it harder than it was before.  Axl slowly pumps his hips as Nick finds his way down to his balls where he spends some good time licking and worshipping those mounds full of man juice.Nick Gunner is grinding that little ass of his around like crazy.  You can tell he's got a sudden itch that will soon need scratching and something tells me it's just for Axl.  This isn't the same kind of itch he gets for most people, this is more intense.  The passion is the kicker here as you feel it oozing out between these two.  You'll wonder if they even realized there was a camera in the room as much as they are into one another.  They seem to have forgotten and now it's all about them.  I'm not sure if anyone has been able to get Axl this horned-up before.  The intensity of his looks and the hardness of his cock are unmatched.Axl trades places with Nick and makes him the center of attention for awhile as he sucks his cock and plays with his own.  Nick Gunner licks his lips with satisfaction as he throws his head back giving us one of his signature 'O' faces.  Those lips alone are enough to drive you wild, but couple that with those facial expressions and you've got perfection.  Axl is fully aware of just how hot his partner is as well and he's letting it show with every lick, stroke and suck he gives Nick Gunner's gorgeous curved cock and delicious balls.  He starts kissing Nick's thighs and this really gets Nick going.  Nick Gunner throws his little legs high in the air, giving Axl the access he needs to that perfect pink hole.  Axl takes the opportunity to worship that little ring of joy as he buries his tongue in Nick Gunner's ass, licking, sucking, slurping and kissing it over and over again.  Nick Gunner is enjoying this sensation as he strokes his hard cock and moans a little louder than before.  Axl has found the sweet spot and Nick Gunner is loving it.  The heavy breathing tells the story as Nick watches Axl eat his little ass as he strokes his hard cock.  Axl slowly moves back to Nick's dick and works it over some more as he humps the bed with his own hard cock in anticipation of putting it somewhere a little warmer and wetter.That doesn't take long once he starts teasing Nick's tight little hole with his hard cock.  He's moving it up and down the crack of Nick's ass and Nick positions himself to rub up and down some on his own.  Nick says 'put it in there' a couple of times but Axl decides to tease him a little more.  Finally, Axl slowly begins giving Nick what he wants by slowly pushing the head of his hard cock into that perfect tight pink hole.  Axl is taking his time as he opens that beautiful buttonhole and works his cock further and further into it.  He's purposely holding back, making Nick want it even more.  By the time he's balls deep, Nick Gunner will be in love.The faster Axl pumps his ass, the harder Nick strokes his cock.  Soon Axl is pounding that sweet little hole hard and fast and Nick Gunner can barely take all the pleasure it's delivering.  He's moaning out in deep satisfaction as he takes that cock all the way in his ass.  They switch positions and Axl spoons up next to little Nick Gunner, cupping him in a side position as he shoves his thick cock back inside.  The faces Nick Gunner is making are the icing on what's already one hot fucking cake.  Axl turns him over more so he can plow him deeper and Axl's expressions show just how happy he is to be inside that beautiful little ass.This where things get really intense as Nick Gunner comes up on his knees and arches that little back, poking that ass in the air for Axl to tear into.  Axl takes the opportunity to really pound that hole as he grabs Nick Gunner by the hips and fucks him fast and hard.  Nick Gunner is moaning louder and moving his little ass around in circles on Axl's cock.  He lays flat and Axl stays deep inside as he continues banging his hot hard cock in and out of that hot little hole.Nick Gunner climbs on top to take Axl's hard cock for a nice long ride as Axl furiously bangs his cock in and out of Nick's ass.  Nick Gunner grabs his own dick and starts pumping it fast as Axl does the work from behind.  Nick wants Axl to cum for him now as the intensity increases and Axl asks Nick if he wants him to cum on his chest.  Nick Gunner says that would be so fucking sexy as he lays back and waits on Axl's load to land all over him.  Axl explodes all over little Nick Gunner's sexy stomach and chest, leaving a trail of hot white cum from his belly button to the middle of his chest.It's Nick's turn now and Axl eases up next to him kissing and licking him as Nick Gunner works out his built up load.  All this has Axl hot and horny all over again and he begins stroking a hard cock of his own once more as Nick shoots his huge, spurting load all over himself.  But Axl is finished yet.  He's all hot and bothered to the point of wanting to shoot another load so Nick Gunner helps him work it out as he rubs it in with a huge smile on his face.  Another round of hot kisses ends out this intense session and it's a wrap.",
  "models": [
    {
      "name": "Axl",
      "person_id": 35274
    },
    {
      "name": "Nick Gunner",
      "person_id": 35123
    }
  ],
  "release_date": "2012-05-27",
  "scene_id": 70559,
  "series": "Fraternizing Forces 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Rimming",
    "Sensual",
    "Smooth",
    "Tattoos",
    "Twink"
  ],
  "title": "Axl & Nick Gunner"
}