{
  "collections": [
    "Active Duty"
  ],
  "description": "Brennan is 21-years old, 5' 9' tall and is originally from New Jersey. Aside from partying and raising hell he enjoys all sorts of active things.  He's enjoying Southern California beaches and all the beautiful people.  In high school he played football and wrestled and I can just see him rolling around in a singlet with another hot jock as their ass cracks sweat up a storm.I leave him alone for a few minutes to give him time to get comfortable and when I return he's got that uncut cock nice and hard.  I love an uncut cock and Brennan's is perfect and pretty. He spends a lot of time pulling and prying at his foreskin and seems to like the sensation.  I get down below as if I'm about to suck his cock and aim up at that nice body as he strokes his dick in my face.  He likes his body and pays lots of attention to his pecs as he strokes that dick for us.I catch a shot of him bending over in the mirror and we get a nice sneak peek at that furry little hole of his.  What an ass it is.  Then, he turns around and starts showing it off for us as he arches his back and continues stroking his cock.  I zoom in closer to that edible hole and imagine diving in.  That's an ass I could eat for days without coming up for air.  And Brennan knows just how to move it and show it off.  He reaches back and spreads those cheeks to reveal the hole more and we get an up close and very personal view of a delicious manhole.  He doesn't stop there, though, he keeps it up, putting on one hell of an ass show and if you're an ass lover like me, you'll be in heaven.He turns back over to bust his nut and it's a thick, creamy load of white goo.  After that, I tell him we wanna see that ass again and he's all for showing it off.  He stands up beside the bed and begins another ass show that will knock your socks off.  This stud could be a private dancer in his spare time when he wasn't busy blowing shit up.  Enjoy!",
  "models": [
    {
      "name": "Brennan II",
      "person_id": 35292
    }
  ],
  "release_date": "2012-05-16",
  "scene_id": 70556,
  "series": "Brennan",
  "tags": [
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Brennan, Scene #01"
}