{
  "collections": [
    "Active Duty"
  ],
  "description": "I chat them up a little in the beginning as I talk to Tucker about his decision to cross the line.  He's all smiles again as we chat and I let him know that Axl is going to walk him through things.  Axl chimes in a bit and then I leave the room, telling Axl it's all in his hands.  No sooner than I'm gone, Axl tells Tucker to move a little closer.  Then he tells him he's not much into all the talking stuff and from there they lock lips in a hot kiss.  Next the shirts come off and they embrace for more kissing.  Axl lays Tucker back so he can kiss and lick his chest as he says 'damn dude' as he admires his body.  They help each other loosen their buttons and zippers and the shorts come off.From there, Axl takes the lead and goes right down on Tucker's soft cock, sucking it and licking it as Tucker admires Axl's nice ass.  Eventually Axl's skills do the trick for Tucker's dick and he's hard as a rock as Axl works it for him.  Tucker is watching intently as Axl works his big dick, playing with his nice balls.  I'm not sure what's harder -- Tucker's cock or his abs.  This guy's body is smokin'.After sucking Tucker's cock for awhile, Axl asks Tucker if he's ready to give it a try and Tucker doesn't hesitate.  He's on Axl's cock quick and working it with his mouth.  He takes the time to go down and lick and suck Axl's balls really good in between taking it down his throat.  He cups Axl's balls so he can easily lick them as he sucks his dick.  Tucker tells Axl how nice his dick is and Axl responds by reaching around to grab Tucker's cock again and strokes it as Tucker keeps sucking his.Axl wants another taste of Tucker's dick so he goes back down for more.  Tucker is licking his lips which is an indication that he's liking what's happening.  He can't seem to keep his eyes or hands off of Axl's ass and he compliments Axl once more on how nice it is.  Axl tells him he can spank it if he likes and Tucker says he was thinking about it.  He really gets into rubbing and playing with Axl's ass as Axl sucks his nice hard cock.Axl likes a nice ass himself and he knows that Tucker has a very nice butt on him.  He turns Tucker over and starts licking his hairy pink hole as Tucker really enjoys this backdoor attention.  Axl spreads those furry cheeks apart and it's almost more than Tucker can take.  He's letting Axl know just how damn good it feels as Axl keeps licking.  The looks on Tucker's face are priceless as Axl brings him up on his knees, arching his back and spreads his cheeks out for better access.Meanwhile Tucker reaches back and finds Axl's cock and starts stroking it as Axl eats his ass.  These two are having plenty of fun together as Tucker revisits what it's like to experiment with another guy.  You can tell he enjoys it enough that he shouldn't put it off so long before he does it again.  Tucker goes back down on Axl once more as Axl lays back and enjoys watching Tucker suck his dick as he strokes his own.  Axl gives Tucker a little instruction on what he thinks feels good and Tucker follows his instructions in between a few more hot kisses.  Soon, they are blowing their loads together and the smiles on each of their faces are priceless.  Tucker has revisited a past time that I think he's finding he should have never abandoned.Now, there's one more interesting thing at the very end of this footage:Originally Tucker had agreed to just a mutual oral scene, but once we were there in the moment he agreed to try more. We threw it on as a 'bonus' because it didn't quite work out the way we intended and I felt the scene would flow better on its own as just an oral scene.  But, the important thing is Tucker was willing to give it a try.  And, he did it after he'd already cum the first time.  Axl coaxed him into trying some anal and things didn't go too bad but neither the guys or myself felt it strong enough to interrupt such a good oral scene.  However, it does open some doors of possibility for the future.",
  "models": [
    {
      "name": "Tucker",
      "person_id": 35162
    },
    {
      "name": "Axl",
      "person_id": 35274
    }
  ],
  "release_date": "2014-01-26",
  "scene_id": 70550,
  "series": "Axl & Tucker",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Gay",
    "Kissing",
    "Rimming",
    "Tattoos"
  ],
  "title": "Axl & Tucker, Scene #01"
}