{
  "collections": [
    "Active Duty"
  ],
  "description": "Normally Major Wood is right next to me shooting still photos of the action or he gets the pleasure of seeing the guys naked first because he normally shoots their first photos.  Every so often though, we put him in the director's chair where he seems to excel equally at capturing the beauty of these hot young recruits.  Tonight, we're turning the video camera over to Major Wood to introduce us to new recruit, McKenzie.The Major gets right down to the business of asking McKenzie the hard questions in his interview.  From there we learn that McKenzie hails from Minnesota, he's 20 years old, stands 5' 4' and weighs 141lbs.  He played hockey in high school and fought MMA (Mixed Martial Arts).  When the Major asks what his record was, McKenzie admits to getting beat up quite a bit, but that's because he was rarely paired up with anyone his own size.After that, Major Wood takes us on a tour of McKenzie's tattoos where we see some of his awesome ink work and learn what the meanings are behind them.  This hot little stud has a body that won't quit and if you're not interested in what the tats mean, you'll love how he shows off the body while he shows off those tats.  While he's getting McKenzie to do show and tell with his tats, the Major also gets him to take off his jeans where we are introduced to McKenzie's nice uncut cock.  After a quick turn around and some showing off, McKenzie jumps on the bed and starts stroking his hard uncut meat.  He's full of precum and it just oozes out all over the place throughout the entire shoot.  If you want some really great precum shots be sure to check out the Gallery of McKenzie where the Major captures many, many delicious shots of it.Major Wood puts McKenzie through the paces, having him change up positions several times during the shoot where we watch him on his knees behind over to show off that delicious furry little ass and some great close-ups of that precum and then a nice show of that butt as McKenzie humps the bed.  That cock stands at full attention the entire time as he grinds it against the covers.  He raises up and continues stroking that nice cock as he squirms around on the bed before standing up in front of the full-length mirror where he continues to stroke his dick for us.  The Major gets down low and shoots up toward that hot cock giving us the feeling that we are right there on our knees about to worship it.The mirror show is priceless and you don't want to miss one second of it so hang in there and ride it out to the huge cumshot that McKenzie splashes all over the mirror.",
  "models": [
    {
      "name": "McKenzie",
      "person_id": 35294
    }
  ],
  "release_date": "2012-05-30",
  "scene_id": 70560,
  "series": "McKenzie",
  "tags": [
    "Blonde",
    "Gay",
    "Jerk Off",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "McKenzie, Scene #01"
}