{
  "collections": [
    "Active Duty"
  ],
  "description": "Porter is a wild one.  Every time I hear that song 'Oooh, I heard you were a wild one, wild one' I think of Porter.  He's so young and excited about life that he can get a little on the wild side and I think after watching just how fast things move in today's scene you'll know what I mean.  I could hardly keep up with him once I turned he and Kieran loose together.<br /><br />As soon as the camera comes on they are both playing with their cocks and Kieran is already hard as a rock.  Once I leave the room to bake a pie, it doesn't take long before Porter is all over Kieran kissing him deeply and playing with his hard cock.  Kieran seems just as excited as he puts his hand down Porter's boxers and starts playing with his cock, helping him along.  The kissing is pretty intense as these two fast track getting to know one another.  Porter was a handful.  Having never shot a duo scene he wasn't always worried about where the camera was and what it could see. LOL.  You'll see what I mean in the first few minutes of the scene! But once we get a bridle on this wild horse, he does an exceptional job right along with Kieran.<br /><br />After the intense kissing and cock play, Porter finds his way down between Kieran's legs where he pulls that cock out and starts sucking it, showing off his lack of a gag reflex as Kieran watches in amazement.  Luckily I come back to check on them just in time to start capturing the action.  Porter is ready to play and he's more focused on the action than he is on the logistics of how a shoot goes.  It's  refreshing to see someone so eager, but it made my job quite the challenge as Porter seemed to decide he was the man in charge for this shoot.  I decided that it might be best to let that be the case while I focused on what he was going to decide to have he and Kieran doing next.  <br /><br />Not long after showing off his lack of a gag reflex to Kieran, he gets Kieran down between his legs to work on his cock.  Kieran is like me, he's just following Porter's lead and he's doing a damn fine job of keeping up with him.  Kieran seems a natural once he starts working on Porter's cock, sucking it and licking his balls as Porter watches with approval.  Porter doesn't like to stay in any one position long, though.  He orders Kieran to turn around for some sixty-nine action as he takes Kieran's cock down his throat while Kieran continues to work on Porter's hard cock.  Porter starts fingering and playing with Kieran's ass while his cock is down his throat and then as quick as they got in this position, Porter decides it's time to switch it up again.  This fellow is hungry for the action and he's getting it in every position imaginable. All the while his cock is hard as a brick.  He's shoving Kieran's cock down his throat over and over and they are both loving every second of it.  He comes up for a break and shoves his cock down Kieran's throat as he leans back on his knees and enjoys the view.  <br /><br />Kieran is to be commended for keeping up with Porter as he falls right in place and keeps the pace.  He's returning the favor to Porter and giving it his best and that's when things get even crazier.  Porter is ready to fuck and he doesn't stop to ask if it's OK to shove his bare cock deep in Kieran's willing ass, he just does it.  Kieran is taking that raw cock deep in his ass in no time flat and Porter is shoving it deep.<br /><br />It's time for another position change per Porter's orders as he puts Kieran on his back and shoves his bare cock back in deep.  Kieran is stroking his hard cock but Porter decides the position isn't as good as it can be to make his cock feel it's best so he puts Kieran back on his hands and knees and stands up on the bed plowing his cock down deep into Kieran's ass once more.  He's balls-deep and banging it hard as Kieran's hard cock flops around in the breeze.  Porter fucks him six ways to Sunday as Kieran holds his hard cock tightly in his hand.  I never would have thought that Kieran would take a hot fucking like this so well, but he's all-in as Porter pounds his hole.  It doesn't take Porter long before he decides he's gonna cum and he blows his hot, huge load all over Kieran's freshly fucked pink hole.<br /><br />Porter's thinks we are all done, but he's got a surprise coming.  It's now Kieran's time to return the favor.  Porter gets on his hands and knees and arches his back, waiting on Kieran to bury is bare cock deep into his ass as payback for the good fucking he just put on Kieran.  This is where we find out just how tough our wild boy is.  He's not quite as gung-ho about Kieran plowing the hell out of his ass as he had been about fucking the shit out of Kieran, but eventually he mans up and takes a good fucking just like the one he dished out.  Kieran gets right to the business of burying his bone deep in Porter's hole as he gets his.  Funny how calm Porter seems to get about changing the positions a hundred times while Kieran's cock is deep in his ass.  He's not quite as rambunctious now.<br /><br />Porter does decide to ride that long, hard cock of Kieran's and does an amazing job as we watch the bare dick plunder his booty.  That red ring wraps tightly around Kieran's cock and looks so beautiful as he takes that cock deep in his ass.  Once he works it in balls deep, Porter rides it all the way to the balls, taking every last inch of it up his tight little ass as he bounces up and down.  They lock lips in another intense fit of kissing before the final position where Kieran crawls on top of Porter, plunges his cock back in deep and goes for the gold.  Just before Kieran is ready to blow his load, Porter reaches back and spreads open his hole, giving Kieran his target.  Bullseye!",
  "models": [
    {
      "name": "Kieran",
      "person_id": 35284
    },
    {
      "name": "Porter",
      "person_id": 35291
    }
  ],
  "release_date": "2012-06-03",
  "scene_id": 70561,
  "series": "Force Rendezvous 3",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Kissing",
    "Tattoos",
    "Twink"
  ],
  "title": "Kieran & Porter - Bareback"
}