{
  "collections": [
    "Active Duty"
  ],
  "description": "Today, for Sebsatian's introduction to guy-on-guy action, we're pairing him up with Kaden, who knows how to show the new guys the ropes. I joke around with the guys -- who are splayed out on the bed -- saying how Kaden prefers uncut dicks. Kaden cracks up, gesturing to me behind the camera, 'I think *he* likes uncut dicks' and they both laugh. 'Shh! No more from you!' I say and I leave the guys alone to see 'what comes up.'After a few, Kaden loses his shorts, getting more comfortable, and encourages Sebastian to do the same. In 30 seconds flat, the guys go from clothed to buck-naked. They ain't messing around! Both are hard as they watch the off-camera porno, and Sebastian looks a bit nervous. Luckily, Kaden's there to help calm those nerves -- among other things.I have to say, Sebastian looks amazing. I mean, we already knew that, but his beauty is hard to capture in still photos, but in a moving video, he's really even more gorgeous. He's just a big hunk of a guy with an amazing body.I'm still in the other room while the guys are shooting the shit back and forth. We hear an amazing story from Sebastian about how a 'stripper girl' is going to pick him up from the airport later. And then comes a crazy story that sounds like Sebastian's going to find himself in a three-way with the stripper and her mom. This is gold, people!Soon, Kaden asks if Sebastian 'needs some help with that' and swoops down, engulfing Sebastian's uncut dick into his mouth. Sebastian's loving it, as he leans his head back and licks his lips. After a spell, Kaden flips onto his stomach and starts to rut into the bed, grinding his dick into the bed while sucking off Sebastian.Sebastian is hard as a rock and has a body that won't quit. He's got his hands behind his head, just enjoying what's happening to him. The sounds that Kaden makes throughout the scene are incredible -- between the slurps and heaving breathing, his heavy sighs tell you exactly what's going on . . . . The pair switch things up a bit, with Sebastian up on his knees with Kaden on all fours in front of him -- still sucking away. Sebastian nicely makes his ass hole available for a bit of fingering by Kaden. Baby steps, people, baby steps! Kaden has a light touch -- don't want to frighten the guy off, now do we?Kaden hands Sebastian's dick back to its owner and let's him finish himself off, to a surprisingly vocal orgasm. He shoots his load over his smooth, zero-percent body fat stomach -- spent from the experience. Kaden follows afterwards with his own load.At the end, we joke around with Sebastian, and I tell him he did 'pretty good.' I tease him about this dick got really hard when Kaden was playing with his ass, telling him he 'might like that.' He says, with a half-smile, 'little bit. . . ' We shall see if we can get anything else up in there in future scenes. Do tell us what you'd like to see from our new friend Sebastian!",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Sebastian",
      "person_id": 35297
    }
  ],
  "release_date": "2012-06-24",
  "scene_id": 70569,
  "tags": [
    "Blowjob",
    "Duo",
    "First Time",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Kaden & Sebastian"
}