{
  "collections": [
    "Active Duty"
  ],
  "description": "You remember big, strapping Nick Tower don't you? The massive hulk of a stud debuted in the War Chest way back on Nov. 16, 2011 in a solo scene, but since then, the 6'-tall man has been off your radar.<br><br>Well, that all changes today, as I was able to get him to take the next step forward (and then some) by pairing up with a pro that knows how to handle delicate newbies: Kaden. Now, while Nick isn't ready for everything quite yet, I think you'll be surprised at what he does do. By the end of the scene, Kaden's fingered and worked a toy up Nick's ass. Damn!<br><br>We start off the 45-minute scene with the camera focused on Nick, who is already playing with himself in his shorts. I joke around with him, saying how when I picked him up in my car, I tricked him into coming over. He hits back: 'I could tucked and rolled if I wanted to.'<br><br>Now, we've tried to make a duo with Nick happen before, but his partner always ended up flaking on me. (Maybe they searched the site and saw how massive his dick was and got scared?) Anyways, Kaden's up for the challenge, so I leave the room for a bit to let the guys get comfortable.<br><br>They joke a little about the porno that's playing and Nick is focused completely on the video, occasionally stealing glances at the camera and Kaden. For his part, Kaden's busy getting himself up to speed, slipping out of his T-shirt and bringing his dick to attention. They start shooting the shit about working out, how much they can bench and how Nick was doing MMA for a while.<br><br>I come back in to the room and jokingly tell Kaden to 'attack, attack!' and he responds with a smile, 'If I have to.' Finally, Kaden leans in to help Nick takes his underwear off and he immediately starts sucking him off. Nick's still getting hard but it doesn't take long for him to fully rise to attention. And man, what a massive, thick dick Nick has!<br><br>Kaden continues to work him over, while Nick reaches around, helping Kaden out of his shorts and starts jerking him off. Kaden moves up Nick's expansive chest to lick and suck on his nipples for a bit before heading back down south again. Nick must like what's going on, his hips are grinding and thrusting into Kaden's mouth. (Honestly, I'm not sure how Kaden can take ALL of Nick -- he's just that big and thick. It's like a beer bottle or something.)<br><br>Soon, Kaden has worked a finger into Nick's ass while he continues to suck him off. Kaden picks up the pace with his digits, thrusting in and out faster while focusing on Nick's meaty head.<br><br>After a while, Kaden says 'why don't you try something different?' And reaches over to produce a beaded toy and begins to work into Nick's ass. The beefy stud is shaking and convulsing at the sensation, jerking back as Kaden pushes more and more of it in. And one point, Nick shoots a look of death at the camera like, 'what the fuck did you get me into Dink?'<br><br>One thing's for sure, Nick's dick stays as hard as a 2x4 and he's trying desperately to keep his composure. Kaden keeps fucking his ass with the beads while Nick alternately grunts, pants and moans.<br><br>Things switch up a bit, as Kaden gets up on his knees in front of Nick, so Nick can jerk Kaden off while Kaden continues to work the beads into his ass. Nick is two-handing both himself and Kaden now, working up to blow his load. Kaden pulls out the beads, replacing it with his finger and the boys continue to get closer to blowing. When Nick shoots, it's like he had a minor coronary, he's breathing that hard! He spews onto his stomach, completely out of breath. Kaden gets his turn, sending his load onto Nick's abs, too.<br><br>As we close out, Kaden tells Nick, 'hope to see you again,' and Nick says, 'me too.' After some lip-locking, it's a wrap!<br><br>",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Nick Tower",
      "person_id": 35257
    }
  ],
  "release_date": "2012-06-17",
  "scene_id": 70567,
  "series": "Tower Watch",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Duo",
    "First Time",
    "Gay",
    "Muscular"
  ],
  "title": "Kaden & Nick Tower"
}