{
  "collections": [
    "Active Duty"
  ],
  "description": "Sebastian is a little older than we normally feature here and he has the sexy gray hair to prove it.  Albeit he's certainly not anywhere near ancient, I think the graying hair gives him a distinguished sexiness that makes him that much more delicious.  Think of it as just the right amount of salt and pepper on a delectable entree of pure American military beef.As I chat with Sebastian we learn that he's 27-years old, stands 6' 4' and weighs a rock solid 235 lbs.  If that isn't enough of a man to keep you busy all night I'm not sure what is.  I pick on him a little about his gray hair and he cuts a big smile that'll melt your heart.  As we continue chatting we also learn some other interesting things about Sebastian.  He's not only been deployed several times to Iraq and other places, but he's also played college basketball, ran track in high school and loves to work out.  He was born in Germany and was there when the wall came down.  His German heritage explains that nice, huge uncut cock he's sporting in those boxers.  I have him take off his shirt and pan up and down that gorgeous gym body before getting him to take off his shorts and boxers to reveal that nice, soft uncut cock with it's beautiful foreskin.  What a total gem this guy is.  Once he turns around we see that his ass is just as nice as everything else on him.I also get plenty of those big size 13 feet for all you foot lovers out there before I leave him alone to get comfortable.  As nervous as he claims to be, it doesn't take Sebastian long to get that big uncut cock standing at attention for us.  As he slowly jerks it, moving that foreskin up and down over that perfect pink head I get plenty of good shots of this gorgeous stud.  I could look at that perfect cock all day long -- among do other things with it, but I keep my composure as Sebastian continues to get more comfortable.  His chest has a lightly trimmed coat of fur that makes him even more masculine than his size alone.Probably the sexiest thing we learn about Sebastian is that he was 17 when he first jacked off and got his first blow job.  I thought I would pass out at the thought of such innocence.  Looking at this hunk you'd think he would have been experimenting with sex at a much earlier age.  And, you'd probably think that such a hot man would have had at least one experience with another man.  But, neither was the case.  Sebastian had told me that he was really curious about experimenting with a guy when he was younger but it didn't last very long.  When I asked him exactly what he was fantasizing about he said getting his dick sucked and bending a guy over.  I assure him that it's never too late to re-explore those old fantasies.  From there, I'll leave you to enjoy more of Sebastian.",
  "models": [
    {
      "name": "Sebastian",
      "person_id": 35297
    }
  ],
  "release_date": "2012-06-20",
  "scene_id": 70568,
  "series": "At The Ready 2",
  "tags": [
    "Gay",
    "Jerk Off",
    "Muscular",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Sebastian"
}