{
  "collections": [
    "Active Duty"
  ],
  "description": "After things went so well in Tanner's first man-on-man scene -- with Axl -- I decided why not pull them in for another round? But this time, we were going to up the ante. In their initial session, Tanner got sucked and rimmed, but he wasn't ready to cross the line and reciprocate. This time, Tanner was going to suck dick and fuck a guy for the first time.<br /><br />After I go and bake the proverbial pie (really, I'm running out of recipes), the gents get down to business. After about five seconds of chit-chat, Axl says he's not one for 'all the talking stuff, I just wanna get my dick sucked.' Tanner nods and says -- seemingly half-jokingly -- 'alright.' And away we go!<br /><br />Axl peels off his sweat pants, bright teal undies and his T-shirt, revealing his already-hard dick. After he gets Tanner to get his shirt off, Tanner leans over and tentatively starts to lick and suck at Axl's meat. Axl lets out a sigh and says 'Look at that!'<br /><br />We come in closer on the action and Tanner plays to the camera, working over Axl's dick with his tongue, all the while stroking it with his hand. Axl is nothing but smiles here, like a kid in a candy store. Tanner switches around to get in-between Axl's legs for more easy access to his dick, doing the ol' jerk-n-suck routine. Tanner's fond of working Axl's cock over like a lollipop, tickling its underside and focusing on its head. After a while, Axl tells Tanner, 'see how deep you can go.' Tanner takes a stab, but can get maybe half of Axl's monster in his mouth. Honestly, Axl is nothing but shit-eating grins all the way through the sucking. He occasionally steals glances at the camera, giving us that, 'do you believe this?' look. Ha.<br /><br />Finally, Axl grabs Tanner and pushes him back over to his side of the bed and tugs his shorts off. Out pops Tanner's big hard dick with that larger-than-average head. Axl dives down and starts sucking with abandon. Tanner is the strong, silent type throughout, while Axl is all-smiles.<br /><br />Axl lays back down on his back, getting Tanner to straddle him so he can suck him off. Axl, feverishly sucking Tanner while jacking his own dick, breathlessly says 'God, I'm so hard.' And he ain't kidding. Axl's working overtime on Tanner's dick, giving it the proper lovemaking treatment.<br /><br />Tanner then switches around, so he can hover over Axl and suck his dick in a 69 position. Axl can't keep his hands off Tanner -- rubbing his shoulders, feeling his forearms and massaging his ass cheeks. Axl pays special attention to Tanner's balls, tenderly licking and sucking them.<br /><br />The guys move around again, with Axl on top of Tanner, sucking and biting his nipples, telling him, 'you're a tough guy, you can take the biting.' Tanner is letting Axl do a lot of the work, as Axl grinds his body into Tanner's while licking his neck. <br /><br />As Tanner jerks Axl off, Axl tell him that it 'vibrates my asshole when you do that.' A minute later, Tanner says, 'So about that ass?' Axl: 'I thought you'd never ask.' And now we're really off the races!<br /><br />Axl lays down on his stomach, spreads his legs apart and Tanner starts working Axl's stiff dick from behind. Tanner asks, 'you ready for it?' as he teases Axl's asshole, lightly blowing on it while slapping his cheeks. Soon enough, Tanner's dick is knocking on Axl's back door. Tanner's taking it slow, letting the moaning Axl get used to his dick. After he's made entry, Tanner gets up to a steady pace, all the while Axl is gasping and sighing 'oh my god, yeah.'<br /><br />Axl tells Tanner to 'fuck that ass' and Tanner picks up the speed, slapping Axl's cheeks and thrusting harder. We get some amazing shots underneath the guys, where Tanner takes his dick all the way out before slowly shoving it back in. Back up above, Tanner's rock hard abs are getting a work out as his torso thrusts in and out of Axl -- who is jerking off his own dick. Eventually, Tanner goes in for a reach-around, stroking Axl a bit. <br /><br />Axl flips over so he's laying on his back on the bed and Tanner goes back in to continue the fucking. While plowing, Tanner strokes Axl, who looks to be in heaven, mildly blissed-out on dick. Tanner keeps on jerking Axl, faster and faster until Axl takes matters into his own hands. Tanner pulls out and starts jerking himself and both guys are on the verge of shooting. And would you believe it? They shoot at the same time!<br /><br />Afterwards, Axl goes in for a little peck on Tanner's chin (we're not calling it a kiss, not quite), and he asks, 'What'd you think?' Tanner says, 'It was great, what'd you think?' A smiling Axl basically says words escape him . . . and that's a wrap folks!<br />",
  "models": [
    {
      "name": "Axl",
      "person_id": 35274
    },
    {
      "name": "Tanner II",
      "person_id": 35290
    }
  ],
  "release_date": "2012-06-10",
  "scene_id": 70564,
  "series": "Ripped Recruits",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Duo",
    "First Time",
    "Gay",
    "Muscular",
    "Tan",
    "Tattoos"
  ],
  "title": "Axl & Tanner 2"
}