{
  "collections": [
    "Active Duty"
  ],
  "description": "Meet our latest War Chest recruit: Broghan. He's 22-years old, stands 6'1' tall and weighs in at 175 lbs. He likes to play sports, drink, have a good time -- the usual stuff. He hails from New Jersey, but don't hold that against him. I'm kidding! (I don't think he took too kindly to my joke, either, as you'll see. lol.)While Broghan is the quiet type, his body and sizable dick make up for his lack of chit-chat. He's got a solid chest with bulging abs and big nipples. Oh, you know my weakness for nipples . . .I leave him alone for a few minutes to get comfortable and he quickly gets to work. He grabs the lube and starts filming his own personal sequel to 'The Fast and Furious' with his hands as his dick comes alive.He's got a big one too! Without it even completely out of his shorts, it's easily a two-hander. I come back in to the room and make sure to get some up-close shots of those fast hands in action.He soon peels off his jeans and boxer briefs, revealing a lightly hairy lower body. But Broghan's main appeal is . . . well . . . his big ol' cock. He stares at the camera, seducing us with a 'you-know-you-want-this' look, as he points his stiff one at the lens. I swear, his dick head is getting bigger as the scene progresses. It's positively engorged.Broghan gets up on his knees so I can get an over-the-shoulder shot of the action. He seems a little nervous, but his dick ain't going down, so he can't be that bothered. I make sure to turn him around so we get a rear-view of his behind. Like a lot of guys, he seems a bit confused as to what we're looking for -- it's kind of cute. (Not every guy automatically turns over and starts humping the bed. Broghan's one of those guys. Just a regular dude probably amused that we'd want to see his ass!)A couple minutes later, Broghan is shooting a ropey load that leaves him speechless.",
  "models": [
    {
      "name": "Broghan",
      "person_id": 35301
    }
  ],
  "release_date": "2012-07-25",
  "scene_id": 70578,
  "tags": [
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Broghan, Scene #01"
}