{
  "collections": [
    "Active Duty"
  ],
  "description": "As the scene opens, I tell Tanner, 'Every time I turn my camera on, you're here.' But how can I help it, this guy makes me weak in the knees. And today -- today folks -- is a special day. Today is the day Tanner bottoms for the very first time. And who better to take his Active Duty cherry than big-dicked Jake? When our scene opens, the boys are already on the bed in their underwear, groping themselves through the fabric. I ask Jake, 'let's see that,' and he unveils his monster dick. Tanner's stunned, saying 'Jesus Christ, that's a big cock.' I leave the room for a spell to let the guys get going without me, and they then trade compliments about their bodies.Jake goes in for some smooching and asks Tanner if he's ever sucked a dick before. Tanner says he has, so Jake puts him to the test. Off comes Jake's undies, fully revealing his thick monster. Tanner goes down, working him over with his hand and his mouth, getting him harder. Jake's hairy, meaty thighs are a sight as they thrust up and forward into Tanner's mouth.Tanner continues to go to town on Jake's tool. Even though Tanner himself is massive and has huge hands, he still can barely get his fist around Jake's dick. Tanner pays special attention to Jake's cock head, kissing and licking it. The guys switch positions a bit, so Tanner is between Jake's legs, laying down -- thus giving us an eye-full of Tanner's gloriously muscled rear-end. Jake's in heaven: eyes half-closed, one arm behind his head, abs flexing and hips gyrating into Tanner's willing mouth. Jake his a pair of hypnotic hips that just won't quit -- and we're going to see them work on Tanner's ass in just a little bit . . .  but until then . . . back to the oral action.Tanner's making love to Jake's dick and he's lost in the moment. After a nice long blowjob, the men exchange some kisses and flip over. Now, it's time for Tanner to have his turn. Jake kisses down Tanner's body, planting little pecks down his chest and abs until he gets to his dick. Jake jerks himself off while engulfing Tanner's tool, making the sweetest little slurping noises you've ever heard. Tanner relaxes, putting his hands behind his head, and just goes with the flow. (It's stunning how big of a head Tanner has on his dick. It's just big. Big. And Jake makes sure every centimeter of it is worked over.)I get some wonderful long, horizontal shots of Jake on his knees, servicing Tanner. These men are just gorgeous specimens of physical beauty, I must say. Position change! Tanner's on his stomach now and Jake is grinding his dick into his ass crack -- and continuing to kiss on his shoulders and upper back. At this point, Tanner must be thinking, 'If Jake is humping me this fast now, imagine what's going to happen when he's actually *inside* me.'Tanner flips around, giving Jake a show of his rear end, and then Jake comes around so both guys are on their knees. Tanner's on his hands *and* knees though, so you know that's coming next. . . That's right . . . Jake slaps his hard dick on Tanner's ass cheek and we hear the solid 'thunk thunk thunk' of it against the muscle. Moments later, Jake is entering Tanner, who emits grunts and an 'ah, fuck' as Jake makes his way inside. 'You got a pretty tight little ass hole,' Jake says to Tanner, who responds, 'Pretty big fuckin' cock.' Jake just chuckles, but keeps on going. Jake places a hand on Tanner's lower back to gain his footing, slowing easing his dick in and out. 'Man, this really is your first rodeo huh?' Jake says to Tanner, as Jake is obviously having to take it nice and slow. Tanner shoots back, 'Yeah!'We weren't joking. This is indeed Tanner's first time, so all those grimaces he makes? And the grunts? And the pained sounds? They're all real.Jake finally gets all of his dick in and Tanner looks like he just had a stroke. I make sure to tell them, 'That's it, that's it. You got it. Just relax.' Of course, Tanner is still trying to get used to that pipe in his ass, so he can't relax, but he's doing his best! The worst is over and the best is yet to come.Now Jake's speed is picking up, and we see his famous hips in action. All poor Tanner can do is go 'uhhhnyuuuhhh' over and over and over as Jake rails on his ass. Finally, Tanner's cries of agony give way to 'ah yeahs' as he starts to experience the pleasure of getting fucked for the very first time.We get Tanner on his back, legs thrown in the air, so Jake can face him as they fuck. Jake enters him again and Tanner is audibly and visibly slightly unprepared for his mammoth cock. But Tanner's dick is certainly responding, as he's keeps on jerking his own hard dick as the boys come closer and closer to orgasm.Soon enough, the guys are shooting their loads at the same time, spurting all over Tanner's stomach. Both gents are exhausted, and I ask Tanner, 'How'd that big dick feel in your ass?' He gives me that look of I'm-gonna-deck-you and says, 'Fuckin' hurt!' (But we all know it was a 'hurt' that was a good kind of 'hurt.')",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Tanner II",
      "person_id": 35290
    }
  ],
  "release_date": "2012-07-08",
  "scene_id": 70573,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Duo",
    "First Time",
    "Gay",
    "Kissing",
    "Muscular",
    "Tattoos"
  ],
  "title": "Jake & Tanner"
}