{
  "collections": [
    "Active Duty"
  ],
  "description": "For those of you that love Axl (who doesn't?) you're in luck. This week, we've paired him with strapping Jake, and it's a match made in Active Duty heaven.We don't waste any time in this half-hour scene with Axl and Jake. We wanted to get right to it, so as soon as the video starts, the boys are kissing and groping one another in front of a full-length mirror in the bedroom. The smooching is major here as the guys get down to business, with smiles and heavy petting a-plenty. The kissing and tenderness here is off-the-charts, and when the guys get on to the bed, Jake simply can't get enough of exploring Axl with his lips. Well, actually, neither of them can! It's adorable the way Jake plants little pecks on Axl's forehead and ears. When Axl lays back, with Jake straddling him on his knees, we get this insane view of Jake's ass. We've seen a lot of gorgeous, perfect rear-ends here at AD, but I think Jake and Axl have about the prettiest, most-perfectly formed butts possible. Jake focuses on sucking and jerking Axl's stiff monster, while Axl reaches around and gropes Jake's ass. He pulls Jake in close, so he straddles Axl's face, letting Axl aggressively suck Jake's dick. Taking a breath from sucking, Axl smiles and tells Jake, 'It's a big'un.' Jake just laughs, and Axl puts the 'big'un' back into his mouth, and keeps on sucking.The men change positions, so that Jake is laying down on his back, letting Axl go to work between his legs. Jake's in some other dimension, lost in the pleasure that Axl's giving him. 'You definitely know how to suck a dick,' Jake says to Axl. 'You like that?' Axl shoots back. It's almost a bit too much for Axl, who gags and coughs on Jake's big one, and then laughs, saying 'It is too big!' But that doesn't stop him from keeping up the cocksucking.The guy change it up again, so that Axl is laying down on his back, so that Jake can give him some oral pleasure. When I'm behind both of the guys with the camera, I've got Jake's ass squarely in the frame. I whisper to Axl (who can see the monitor), 'You see that butt?' He laughs back, 'Yeah!'And now, it's time to watch the butt in action, as Jake sinks his dick into Axl's ass. And man, he does not even let Axl get used to his dick before he just starts railing him. Poor Axl, he can barely contain his 'oh my god' and 'yeah' exclamations!Jake ruts into Axl as if his life depended on it, working him over like a jackhammer. Jake is a little jackrabbit (or, jakerabbit)! I make sure to get some amazing shots of Jake's behind, furiously thrusting into Axl, who is just a panting machine right about now.Axl flips over so he's on his back, legs thrown up in the air, and Jake enters him again. Axl keeps on jerking his own dick, eyes closed, lost in the moment. Jake keeps on going, holding back Axl's thighs so he can get better leverage as he plows. Jake spits on Axl's dick, giving him some more lube, as Axl then slaps his cock against Jake's thrusting abs. Axl throws his legs behind Jake's back, interlocking his feet, before slapping Jake's ass. This shit's getting serious y'all. lol.For the big finale, both of their loads end up all over Axl's stomach and the guys are exhausted. They joke about how it was a 'workout' and this is subbing for their gym time for the day. There's some great chatty moments between the two after finish, with Axl admiring Jake's ass.BUT WAIT, there's more! You have to watch until the very end of the video. We've included a little one-minute outtake that you have to see. I'm not going to spoil it for you, but Axl jokes ' . . . man this better not turn into one of those viral vids!'",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Axl",
      "person_id": 35274
    }
  ],
  "release_date": "2012-07-04",
  "scene_id": 70571,
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Tattoos"
  ],
  "title": "Axl & Jake"
}