{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight, we draw the massive Nick Tower further across the line. While you may have seen him give up his ass a couple weeks ago (to Tanner, in their three way with Domenic) -- he has yet to top anyone. Well, that all changes tonight, when we get to watch him fuck Axl (and get fucked by Axl!).We start off the scene with me telling the story of how this scene actually began -- weeks before we shot this. A while back, when both Axl and Nick Tower were at my place, I got them each alone and asked what they thought of the other. I actually was having Nick help hang the drapes upstairs (no, really!). Turns out, they were both into one another and were up to mess around.So, I got them together that night, and Axl was on Nick Tower like a ferret. Kissing him like wild and going at it with gusto. But then, damn it all, we got interrupted right after we got started and we had to just kill the whole scene right then and there.So now, we're back. And there will be no interruptions! Or, as I say, 'we're back today to hang those drapes!'I step away, as usual, and let the guys get started. Now, I have to say, watching Axl and Nick Tower together is what Active Duty is all about: Two hot guys, having a great time, comfortable with one another, joking around and fucking around.Axl and Nick lose their shirts, revealing Axl's perfect torso and Nick's massive chest and pec muscles. Axl gestures to Nick's package as they undress, asking  'what is this thing I'm gonna be working with, huh?' Nick says, 'supposedly it's pretty intimidating.' Soon enough, Axl finds out, as he hauls Nick's growing dick out of his shorts. Axl wastes no time, diving down onto Nick's dick, slurping him up in his mouth. I think Axl forgot about where the camera was (and how I was out of the room) when he made his next move, though. He gets between Nick's legs, facing away from us, and moves up to starting making out with Nick. We get a screen full of Axl's grinding rear-end as he works his body against Nick's. Hand me a fan.Axl rolls over, and they continue to make out a bit more, and then Axl whips off his shorts, and out pops his massive dick. 'Not too intimidating' he says to Nick. 'Yeah, I can handle that,' Nick says. And handle it, he does, as he grabs Axl's cock with his right hand and starts jerking him off. And then we get *more* kissing. And necking. And licking. And sucking. And yes, you should really watch this video. Down Axl goes, back to Nick's dick, as Nick sighs 'oh fuck' while rubbing Axl's back and slapping his ass. Axl grabs a container of lube from the night stand, squeezes a bit into his hand, and Nick asks, 'what's that?' Axl just smiles, and starts working his lubed-up fingers around Nick's ass. 'You like that?' Axl asks? 'Yeah,' Nick responds, in a half-moan. 'That's a big fuckin' cock,' Axl says, between gulps. And really, Nick's dick is about 80% the thickness of Axl's wrist, or, seemingly as tall as Axl's head. It's just that dang big. Axl finger-fucks the hell out of a groaning Nick whilst also slurping down his massive meat. It's pretty incredible, troops -- and we're not done yet!'Let's do this,' Axl says to Nick, pushing him back onto the bed, lubing his ass up some more with his fingers. Next thing you know, the guys on their sides, with Axl working his dick up Nick's ass. And oh yes, Nick is raging hard while getting fucked -- clearly, something is to his liking. Seeing Nick's massive thighs wrapped around Axl's legs is pretty fantastic. It's just muscle upon muscle in this scene. Axl reaches around to jerk Nick off while fucking him and I swear that takes Nick to another level of enjoyment.The guys get up on their knees, with Axl behind Nick, when Axl jokes about Nick's ass, 'that's one tight little son of a bitch.' All Nick does is just grunt and pant in return, holding on dearly for life as Axl continues to fuck him. Nick is just a heaving mess for the duration, and then, Axl reaches under, grabs Nick's dick, and says, 'I wanna ride this thing.'The guys switch around, with Nick on his back, and Axl grabs a condom and tries to get the thing over Nick's engorged, thick dick. Do they make condoms in Cadillac Size? They must, because the boys get it on, and then, they get it it ON.Axl hops on top of Nick, facing him, and straddles his ass over his waiting dick. 'Oooh, fuck! Oh my god, that hurts so bad,' Axl says. And yet, he pushes his ass farther down on Nick's cock. Well, once he gets into a rhythm, all is right with the world as he tells Nick to 'fuck that ass' as he grinds and RIDES Nick's dick. When I say ride, I mean ride. Axl's a bucking bronco on Nick's dick. Axl keeps pumping until he shoots his load all over Nick's chest. Once he's shot, Axl energetically jerks Nick to completion on his own, spewing Nick's load across his groin.But wait . . . we have outtakes. And these are some pretty hilarious ones too. They are the kind that make you like the guys even more. (And, you'll hear that maybe a five-guy gang-bang could be in Nick Tower's future. . . )",
  "models": [
    {
      "name": "Nick Tower",
      "person_id": 35257
    },
    {
      "name": "Axl",
      "person_id": 35274
    }
  ],
  "release_date": "2012-07-29",
  "scene_id": 70579,
  "series": "Tower Watch 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Muscular",
    "Tattoos"
  ],
  "title": "Axl & Nick Tower"
}