{
  "collections": [
    "Active Duty"
  ],
  "description": "Meet Walker, a good ol' small town country boy that we get to know tonight in the War Chest. The 22-year old stands a whopping 6'3' tall and weighs 195 lbs -- most of that muscle, as you can see from our great photos of him (not to mention debut video).<br /><br />I joke about how our photographer just couldn't get enough of him -- we shot his photos before doing the video -- and he laughs, saying we got something like '500' pics of him. (We're not sure about 500, but there are 50 images of him in his gallery tonight!)<br /><br />Walker enjoys the great outdoors, riding his Harley and playing basketball and football. We chit-chat back and forth about why he wanted to get in front of the camera and what he has to offer. I say, 'you're hung like a giant, right?' And he just laughs, 'some could say that . . .'<br /><br />His biceps are so big, he has a hard time getting his shirt off. He jokes 'maybe one day I'll get out of it . . .' Don't worry, he does. Off come the cowboy boots, and out the door I go, leaving Walker along to get started.<br /><br />He struggles to get his jeans down off his big thighs, revealing a smooth body and a big chest. He's already half-hard, but he's packing major heat even in a not-totally-erect state.<br /><br />I return shortly thereafter, and Walker is already panting and breathing heavy, jerking his thick dick for all it's worth. He's got such expressive eyes -- you just know he's on cloud nine (possibly 10) while working over his cock.<br /><br />I make sure to get him up on his knees so we can better take in his large frame. Dang, he's a sight. I know I was there and all -- but just seeing it again on video reminds me being back there . . . Oh wait, where was I? Oh yes! Walker turns around, and sensually grinds into the bed. We get a glorious look at his round, muscular ass. Hand me a fan troops. It's getting warm in here.<br /><br />Walker flips back over, and soon enough, he's sending sprays of cum all over the bed and his thigh. The poor boy's heart nearly stopped in the process -- but I think it was the good kind. (The size of his load is surprising -- but not for the reason you think. You'll find out why -- I say something to him at the tail end of the scene that'll clue you in.)<br />",
  "models": [
    {
      "name": "Walker",
      "person_id": 35298
    }
  ],
  "release_date": "2012-07-04",
  "scene_id": 70572,
  "series": "Walker",
  "tags": [
    "Big Dick",
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Walker"
}