{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight, our pal Major Wood brings us a genuine ginger in the form of Kent. Now, this 22-year old firecracker of a guy stands at a compact, all-muscle, 5'6' and weighs in at 145 lbs. The little red head wrestled back in high school, and you can tell. He's got a body that just won't quit and abs that you could grate cheese on.We learn that Kent lost his virginity at 16-years old and has since had sex in an elevator, in a room with 12 other people, outside of a building . . . Clearly, Kent's the adventurous type!After Major Wood finishes our introduction to Kent, he leaves the room to let him get comfortable. Kent has already lost his button-down shirt and then swiftly gets out of his khaki shorts. I just love the way Kent rubs down his stomach, focusing our attention on his muscles. He makes a great show of drizzling lube from high above his body, down to his waking dick.Soon, he's standing at full attention, working over his cock with both hands, thrusting his hips into the air. At a few points, he abruptly lets go, and his dick slaps against his groin, making a 'thunk' sound. Yeah, he's hard alright!We get in close with the camera so you can hear every move that he makes -- from his sighs of pleasure to the sound of his fingers running through his pubes. The microphone and camera captures everything.Kent stands up in front of our trusty full-length mirror, giving us a nice view of his entire body. Major Wood gets underneath him so we can get the God-shot (where all we see is towering Kent above us). The camera pans under his thighs, giving us a wonderful lingering look at his lightly-dusted hairy legs.Kent returns to the bed, laying back on it, with his ass hanging off the edge, supported by his strong legs. Major Wood gets a really cool shot, where he comes up from underneath him, as if you were there between his legs.You can tell Kent's getting closer to blowing his load just by the look on his face. He flips over, showing off his finely rounded rear, jerking his cock towards the camera. It won't be long now, if those gasps that Kent are making are any indication. For the finale, Kent crawls up the bed, turns over and focuses on the work at hand. Well, *in* hand. His strokes pick up speed, going faster and faster, until he lets out a little breathless, 'fuck, I'm gonna cum.' Boom! Out comes a spurting mess of a load all over his abs. Major Wood laughs at the copious amount of gooey, stringy cum and says 'that was fuckin' awesome.' Kent just laughs, 'why thank you!'",
  "models": [
    {
      "name": "Kent 2",
      "person_id": 2
    }
  ],
  "release_date": "2012-07-11",
  "scene_id": 70574,
  "series": "Kent",
  "tags": [
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Kent, Scene #01"
}