{
  "collections": [
    "Active Duty"
  ],
  "description": "After Sawyer's introduction in the War Chest, I couldn't wait to get him in front of the camera again. So, I rang up our pal Ransom, knowing he'd be able to ease Sawyer across the line. And that's where we're at today folks: Sawyer's first taste of man-on-man action here at Active Duty.I remove myself from the room after our little introduction and Ransom wastes no time getting friendly with Sawyer. Ransom leans over and starts exploring Sawyer's chest with his hands, rubbing his pecs and abs -- all the while Sawyer is just grinning at Ransom. The latter latches onto Sawyer's boxer briefs and unveils his stiff dick. And presto: Sawyer's standing at attention, ready for action. Ransom dives down and starts sucking with gusto while Sawyer just leans back, arm behind his head, enjoying the action. After a moment, the guys slip Sawyer's undies off completely, giving Ransom full access to Sawyer's package. Sawyer has this great smiling/stunned look on his face -- like he can't believe what's happening to him. His cock is certainly reacting well -- it's as hard as a rock and Ransom is making sure every inch of it is getting quality attention. Ransom growls and grunts as he sucks Sawyer off -- knowing that the vibration in his mouth will add an extra level of pleasure. (And it works -- Sawyer throws his head back just about every time Ransom does it!)The guys switch it up a bit, and Sawyer stands up on the bed while Ransom is on his knees -- giving him eye-level access to Sawyer's dick. It's a perfect position for us to take in the glory that is Sawyer's perfect body. Have we mentioned just how gorgeous he is? Sawyer can't believe his luck either: He has a look of 'am I really here?' on his face.Things start to get amped up for real as Sawyer face-fucks Ransom, pumping and grinding his groin while Ransom sucks him off. It's super hot to see Sawyer's perfect abs and bubble-butt in motion. My god, his ass is just BEYOND. And I made sure to get underneath it, behind it, around it and as close-up as possible for you. (I do it because I care . . . lol.)Ransom is playing with Sawyer's ass a little bit, working him up with a finger (not going inside, though), teasing him a bit for what's about to come.Ransom tells Sawyer to sit down . . . on his face. Sawyer straddles Ransom, facing away from him, giving Ransom easy access to Sawyer's glorious butt. Ransom looks to be in heaven and Sawyer is just pleased as punch. Sawyer gets on his hands and knees, and Ransom goes to town on his rear while Sawyer keeps on jerking his stiff dick. Ransom surprises Sawyer and slaps his ass, which takes Sawyer off-guard. A grin busts out across Sawyer's face -- that smile of 'what just happened?' crossed with 'my god this feels good.' (You know the look . . .)But we're not done with the ass-eating frenzy yet. Sawyer gets on on his back, with his legs thrown in the air. Good ol' Ransom is down between his legs, working his tongue around Sawyer's hole. Sawyer keeps on jerking his dick, which looks like it could blow at any minute -- it's that hard.Ransom goes back to sucking and jerking Sawyer, working up to what we're sure is going to be an epic orgasm. 'Why don't you eat my ass again while I play with myself?' Sawyer says to Ransom. Up goes Sawyer's legs again as Ransom dives back in to his ass. We're getting close now, as Ransom puts either of his hands on the back of Sawyer's thighs -- pushing them back for easier access.'Oh fuck, I'm gonna cum . . . right now,' Sawyer says. And cum he does, letting out a high-flying load that lands on his upper arm. Dang. He and Ransom laugh as they inspect the damage. Now it's Ransom's turn to shoot, as he leans back on the floor, jerking out his cum, still perched between Sawyer's golden legs.At the end of the video, in my post-interview, I ask Sawyer, 'So we'll see you tomorrow?' And he immediately answers, 'Yes, yes you will.' I ask, 'Are you ready for the next step?'He nods in agreement, 'We can,' he pauses, 'We can. . . go that way . . . yeah, for sure.' Ransom laughs and mimics Sawyer, telling the camera with a brow-raised grin, 'For sure.'",
  "models": [
    {
      "name": "Ransom",
      "person_id": 35131
    },
    {
      "name": "Sawyer",
      "person_id": 35300
    }
  ],
  "release_date": "2012-07-22",
  "scene_id": 70577,
  "tags": [
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Rimming",
    "Smooth",
    "Tattoos"
  ],
  "title": "Ransom & Sawyer"
}