{
  "collections": [
    "Active Duty"
  ],
  "description": "Our video tonight opens with Sawyer chatting about how he would Skype with girls and jack off for them -- for free. Clearly, they were getting a serious bargain, because Sawyer is worth every pretty penny you can find. We joke about how he's grown up with the Internet and how he's part of the YouTube generation -- or, the XTube generation. He exclaims, 'I love XTube!' Well, lucky for us, Sawyer's going to put on his own x-rated 'tube' show tonight.<br /><br />Sawyer is 22-years old, stands 5'8' tall and weighs in at 165 lbs. (on a 'good day,' he says). Turns out, only two-and-a-half years ago, he weighed 120 lbs. That extra 45 lbs.? Why, that's muscle earned from a five-day-a-week work out plan. And it's oh-so evident in his photos and video. (He jokes about his work out: 'I think it's working a little bit. . . ' You don't say!)<br /><br />He loves playing soccer and has been a fan of the sport ever since he was a young man, growing up back in South Carolina. While he may have lost his accent, he hasn't lost his love of the sport and continues to play when he can. Sawyer also says he loves electronic dance music and has ideas of perhaps making his own tunes eventually.<br /><br />I step away from the camera for a few minutes, as I traditionally do, letting Sawyer get comfortable. He has an amazing, glistening body, as if he's been lightly oiled down -- but we know he hasn't. His gaze is intently fixed on the camera, but he's slowly working up his dick to full size.<br /><br />I return to manning the camera, zooming in on Sawyer's mid-section and dick. While Sawyer works his cock over with one hand, he focuses attention on his pecs and perfect nipples with the other. <br /><br />He has the smoothest upper chest you've ever seen that simply *glows*. I'm not kidding.  And to see it gyrate and grind into the air as he contorts his body while masturbating, why, it's a special sight.<br /><br />As we get closer and closer to orgasm, I zoom in closer and closer on Sawyer's beautiful face. You can hear him sighing and panting a little bit as he nears the big finish. And my my, look at his beautiful eyes! With just one look he could seduce you.<br /><br />But I think we've saved the best for last . . . <br /><br />Right before we near the end of our scene, Sawyer flips over and starts humping and grinding his ass into the bed. Lord. I think I need to get some air. His ass has been sent from heaven as a gift from the gods. It just has the perfect amount of everything: the right tone, perfect cheeks, dimpled muscles, a dusting of hair in all the right spots. It's hypnotic, I tell you. Hypnotic!<br /><br />Sawyer flips back over onto his back and he's just about to lose it and when he does . . . watch . . . out. Man, does he get some height on that load. It's a powerful one.<br /><br />I tell Sawyer thanks for playing, and he smiles back with 'I enjoyed the game!'<br />",
  "models": [
    {
      "name": "Sawyer",
      "person_id": 35300
    }
  ],
  "release_date": "2012-07-18",
  "scene_id": 70576,
  "series": "First Strike 3",
  "tags": [
    "Blonde",
    "First Time",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "War Chest"
  ],
  "title": "Sawyer"
}