{
  "collections": [
    "Active Duty"
  ],
  "description": "And now, for our feature presentation tonight, we have the return of Domenic! We match up him with two of our muscle men, Nick Tower and Tanner, and watch the sparks fly. This scene also marks Nick's first time bottoming, so you know it's going to be something extra special. Ready?I ask Domenic when the video opens, 'where you been?!' And he just says, 'I've been around. Here there and everywhere.' I tell him, 'Been everywhere but here!' And ain't that the truth. Domenic is reclining on the bed to the right of hunka hunka burning love Nick Tower, who is sitting next to Tanner.  I joke with Domenic that we're going to make Nick -- who I refer to as a 'big slab of meat' -- the 'center of attention.' And you know me, I cut right to the chase, instructing Nick to show us what's he got that makes him worthy of being the center of attention.And wham! Out springs his dick of death from under his shorts. I temporarily lose my breath and frankly, watching this back again, I'm amazed I didn't drop the camera. Nick just smiles a sly smile, knowing he's got us in the palm of his large hands.Aside from a few new tattoos, Domenic looks pretty much the same as when we last saw him. And he hasn't seemed to have forgotten how to suck a dick either, as he swiftly dives down onto Nick's thick one. Domenic blurts out in a moment of levity, 'I can hardly get my mouth around it. It's huge.'Domenic sarcastically jokes to Tanner about Nick, 'Since he's the center of attention, I guess we gotta show him all the attention.' Domenic goes back to work on Nick's cock, while jerking Tanner with his left hand. Soon we see Nick's right hand creep under Domenic, giving his dick a spin. The guys switch things up a bit, re-arranging themselves on the bed. (Which is actually kinda funny to watch, since there is *just* enough room for all three of the big boys on the mattress.)Tanner starts sucking on Domenic, while Domenic continues to work on Nick. So far, Nick's got the easy job of just sitting back and relaxing, but don't worry -- he'll have to do some 'work' soon enough.Nick stands up on the side of bed, making it easier for Domenic to suck him off. Soon, both Tanner and Nick are on their knees on either side of Domenic, giving him easy access to suck and stroke both gents. While Domenic focuses on Tanner for a spell, Nick takes it upon himself to jerk Domenic off.After a few minutes of that, Domenic slides his hand under Nick and between his legs and in goes a finger into Nick's undoubtedly tight ass. That's just a teaser though, as the guys switch it up again, letting Domenic rest for a bit as Tanner goes to town on his dick. All this time, Domenic has a finger up Nick's ass, getting him ready for what's about to happen. . . After a little more sucking and stroking, the guys get into position, readying Nick for entry. Tanner gets behind him and wastes no time, leaving Nick breathless. He's a trooper though, as we watch him concentrate on getting used to the sensation of having Tanner's dick up his ass. We swing the camera around to the front so we can see both Nick and Tanner's faces. Nick's face goes through about seven different emotions at the same time while he says 'oh god,' while Tanner is steady-as-he-goes in the back.Now, Tanner has barely only gotten into the bottoming business -- having only recently had his cherry popped in a scene with Jake -- but we make sure that his ass gets some attention in this scene, too. We sandwich him in the middle for a bit, where he's fucking Nick while getting fucked by Domenic. While that doesn't last too long, we isolate just Tanner and Domenic together so they can have some one-on-one action.Tanner's up on his hands and knees, getting fucked from the back by Domenic while sucking off Nick in the front. Like I said earlier -- Nick may have started off as the center of attention, but we made sure to mix things up.Domenic starts shooting the shit to Nick about the action, and I tell Nick to 'stand up and feed his loud mouth some of that cock.' And what a good idea that was! Domenic looks good when he's in a steady rhythm of fucking-and-sucking, especially with the towering Nick above him.Soon enough, Domenic has pulled out of Tanner and blows his load all over Tanner's back. And it's not just any load, but a six-spurt (maybe seven!) gusher. Understatement of the day: That's a big load.We get Tanner and Nick back on the bed, side by side, as they furiously jerk their dicks. Tanner fires off a gooey load and a few minutes later, Nick practically has a coronary shooting his load on his chest.But wait, there's more! Some amusing outtakes follow the scene, but you'll have to watch to find out what happens.",
  "models": [
    {
      "name": "Domenic",
      "person_id": 35080
    },
    {
      "name": "Nick Tower",
      "person_id": 35257
    },
    {
      "name": "Tanner II",
      "person_id": 35290
    }
  ],
  "release_date": "2012-07-15",
  "scene_id": 70575,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "First Time",
    "Gay",
    "Muscular",
    "Tattoos",
    "Threesome"
  ],
  "title": "Domenic, Nick Tower & Tanner"
}