{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden's back, and he's taken a newbie under his wing: Bailey. 'This is your first time?' Kaden asks and Bailey quickly responds, nodding, 'This is my first time. Ever.' Though Kaden tells Bailey he doesn't look nervous, Bailey says he is, 'Oh I am!' Luckily, Kaden's here to ease Bailey in action -- who better to show a new guy the ropes than one of Active Duty's seasoned veterans?'Just relax,' Kaden says to Bailey. 'Watch some porn. You know, let it take its own course.' Kaden gestures to Bailey's biceps, 'you work out?' 'No, not at all' Bailey answers. 'Must have good genetics then' Kaden says, half-smiling. Bailey just chuckles in response.Kaden leans over and undoes Bailey's belt buckle, helping him get comfortable. Soon enough, the shirts come off and Kaden's broad, gorgeous chest is back on our screens to greet us. Like an old friend, we can always count on Kaden's beautiful body to be there when we need it -- lol.'Let's not waste time,' Kaden says, as he slips Bailey's jeans off and dives his face down to his striped underwear. Kaden goes to work, sucking on Bailey as we get some gorgeous views of Bailey's tanned thighs. After a few minutes, Bailey says, 'Kaden, I wanna suck your dick. You gonna let me do that?' And next thing we know, the boys have moved off the bed with Kaden reclining in a side chair. Bailey's down on his knees between Kaden's legs, going all out on sucking Kaden off. All the while, Bailey gives us a nice ass show, pulling apart his cheeks so we can get a bird's eye view of his pretty rear and hole.'Mmm, you sure this your first time?' Kaden says to Bailey, who is feverishly jerking and sucking Kaden. 'It is my first time,' Bailey says and all Kaden can answer back with is 'you're pretty good!'Bailey reaches around to his own ass and starts to play with it. Kaden notices, and tells him to  'Finger your ass while you suck my dick.' Then he pauses and says 'Getting your ass ready for me?' Bailey attempts to deep-throat Kaden, much to the latter's (amusing) surprise. Bailey starts to rail on Kaden's dick, going aggressively faster on it as Kaden's hip-thrusts meet him just as quickly.We're sensing a bit of enjoyment in the aggression here, from both parties. Bailey seems eager to work on Kaden, and the latter doesn't mind dishing it out. Bailey starts sucking on Kaden's balls and after a few moments, Kaden reaches over across Bailey's back to start slapping his ass and prepping him for what's about to come. Next thing we know, Bailey's up on the chair, one leg in the air and Kaden's two seconds away from thrusting his fat dick inside him. 'Oh, fuck!' Bailey blurts out in a grimace, as Kaden makes his entrance. 'You like that?' Kaden says. 'Oh yeah,' Bailey responds between grunts of pleasure and pain. 'Fuck! Your dick feels so good in my ass' Bailey says, eyes closed, head bobbing to and fro.After a spell, the guys move over to the bed, with Bailey on his back, demanding Kaden go 'harder, please harder!' Minutes of pounding go by with a sweaty Bailey demanding more and more of Kaden, who is giving it as hard as Bailey wants it.And, surprise of all surprises, Bailey tells Kaden that he likes to be . . . how do I put this? Restrained? Held down a bit? Kaden obliges, using his hands around Bailey's neck to play a little . . . rough . . . with him. If you know what I mean. Kaden slams harder and harder into Bailey until Bailey says 'you gonna cum for me?'Kaden starts yelling 'Ah fuck I'm close! I'm fuckin' close! Uhh!' as he rough-fucks into Bailey, slamming his entire body into Bailey's. 'Ah fuck I'm about to cum! Ah fuck!' Kaden says and quickly pulls out as Bailey whips around on the bed to get his face closer to Kaden's cock. Kaden -- who is visibly shaking and trembling -- whips off his condom and starts jerking his load out, all over Bailey's open mouth and waiting face. 'Oh fuck,' Kaden says, 'Oh yeah, fuckin' drink that shit' to Bailey as he sticks his tongue out to capture Kaden's load. Bailey sucks and slurps on Kaden's freshly spent dick, getting the last bits of cum out of it. 'Now it's my turn,' he says. Kaden then gets on his back as Bailey feeds him his dick from over head. Bailey face-fucks Kaden, who continues to jerk Bailey and suck him at the same time. 'Oh god, you like suckin' that dick don't you?' Bailey says to Kaden, 'feels so good!' Bailey reaches over Kaden's chest and starts finger him while still getting sucked off. It won't be long now . . . and soon Bailey is jerking out a load all over one of  Kaden's thick pec muscles. Bailey bends over and licks up some of his own cum.We rejoin the guys on the bed, in the post-scene after glow, where Kaden asks, 'Did you enjoy that?' Bailey nods, 'It was the best first time I could have ever imagined.' Kaden says, 'I enjoyed you,' as the two go in for a couple kisses.And that's a wrap!",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Bailey",
      "person_id": 35304
    }
  ],
  "release_date": "2012-08-26",
  "scene_id": 70588,
  "series": "At The Ready 3",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Facial",
    "First Time",
    "Gay",
    "Muscular",
    "Smooth"
  ],
  "title": "Bailey & Kaden"
}