{
  "collections": [
    "Active Duty"
  ],
  "description": "Meet our new recruit, Bailey! The young twinky blond gent was introduced to us by another recent addition to the Active Duty fold, Sawyer. (Thank you Sawyer!) Bailey is 22-years old, stands 5'9' and weighs 160 lbs. He a soccer freak -- and is in two different leagues. And he was captain of his soccer team in high school. (Cue your fantasies about seeing the captain of the soccer team naked in five, four, three . . . ) <br /><br />We also find out Bailey likes to party and go out to raves. He talks about how he went to the Electric Daisy Carnival in Las Vegas this year, and, despite how high winds shut the show down, he stuck it out and got to have an intimate evening with superstar DJ Steve Aoki (and 5,000 of their closest concert-goers). <br /><br />But enough about hobbies, let's get Bailey naked. Our new little blond friend has just the dreamiest body -- tanned and toned in all the right places. He clearly comes from the Sawyer school of beautiful skin, where there's barely a blemish to be found. Bailey gets to work on his dick under his red and black striped undies, while occasionally sticking his finger in his mouth for a quick lick. <br /><br />He makes a bit of a show of taking off his Abercrombie & Fitch boxer briefs, working his ass around and teasing the camera. We think Bailey might have an oral fixation, as he certainly likes to lick his fingers suggestively while working a come-hither look at the camera. You'll also get a taste of Bailey's slow-grind dance moves -- after all, he does like EDM, so he's got some rhythm.<br /><br />Though Bailey has said he's never done anything with a guy before, by the end of the scene, he's already agreed to doing a guy-on-guy scene. Well, now, isn't that something to look forward to?",
  "models": [
    {
      "name": "Bailey",
      "person_id": 35304
    }
  ],
  "release_date": "2012-08-15",
  "scene_id": 70584,
  "series": "At The Ready 3",
  "tags": [
    "Blonde",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "Twink",
    "War Chest"
  ],
  "title": "Bailey"
}