{
  "collections": [
    "Active Duty"
  ],
  "description": "I knew that hitching Kieran up with Sawyer would be a great match. We start off the scene hot and heavy with the guys making out in bed in their undies -- no chatter, no filler, we get to the good stuff fast.<br /><br />Kieran is feeling up Sawyer's bod, paying attention to his pecs and gorgeous abs, while we at home are paying attention to the obviously hard dicks in their boxers. They keep shooting smiles at one another in-between kisses and it's just so adorable. More hot than adorable is how they keep groping at the straining fabric covering their dicks, knowing they're just mere minutes away from peeling off those boxer briefs.<br /><br />If you are a fan of watching our Active Duty guys making out, then you are going to be in hog heaven. Kieran and Sawyer have hitched a ride to Make-Out City and there's no turning back. The clothes can't stay on forever, so Sawyer slips off his briefs, exposing his stiff one and Kieran immediately goes to town. He jerks and sucks on Sawyer's dick, which -- as we see from an overhead shot -- is nestled between two tan-lined thighs. <br /><br />I get the camera behind Sawyer, so we're looking down from behind his head as he's reclined on the bed. Kieran is between his legs looking up at him, licking up and down his dick like a lollipop. It's so hot to hear Sawyer's erratic breathing, as he's clearly excited by what's happening to him.<br /><br />Kieran comes up to Sawyer, meeting him face to face, and Sawyer says, 'it's your turn,' flipping him over onto his back. Sawyer slowly works down Kieran's chest, kissing his way down, and then unveils Kieran's dick from behind his underwear. He quickly swoops down on it with his mouth as Kieran smiles and says 'get on there.' <br /><br />'Suck that dick,' Kieran says to a breathless Sawyer. 'Like how that tastes?' Kieran asks. All Sawyer can muster (with a mouthful of dick) in response is a muffled 'mmmhmmm.' Sawyer, having trouble getting all of Kieran in his mouth, lifts off of him and jokes, 'I'd say you got me beat by a few inches, just maybe.'<br /><br />After a spell of sucking, Kieran says it's Sawyer's turn to get blown again. So Sawyer gets up on his knees on the bed and Kieran's on all fours in front of him and away they go. A couple minutes of that and Sawyer says to Kieran, 'let me see that ass of yours.' So Kieran flips around, still on all fours, showing off his butt to Sawyer.<br /><br />Sawyer wastes no time, as he slaps Kieran's ass playfully and dives in with his tongue. He reaches around to jerk off Kieran while rimming him and we're in heaven watching Sawyer not only cross the line but run past it with flying colors.<br /><br />I make sure we get some great wide shots of the boys, so we see some wonderful images of Sawyer's entire perfect body. The guys joke around a bit about Kieran's ass as Sawyer slaps it some more. Sawyer laughs about how there's 'not much meat back here' with reference to Kieran's small butt. <br /><br />Soon enough, Sawyer is prepping to take things a step further, as he wraps it up and gets ready to plow the waiting Kieran. And Sawyer doesn't waste time, and barely lets Kieran gets used to his dick inside him -- he just *goes*. Kieran is panting and grunting on the other end, seemingly happy at the events that are unfolding behind him. <br /><br />Kieran flips over on his back, pulling his legs back behind his knees with his hands, giving Sawyer better access to fuck him. Sawyer bucks faster and faster, eventually arriving at an enormous spurting load that sails all over Kieran's chest. Amazing. It's insane. And then Kieran shoots his own load over his chest. Poor Kieran is just covered in glistening spunk. The guys are just laughing at the scene before them and it's a wrap!<br />",
  "models": [
    {
      "name": "Kieran",
      "person_id": 35284
    },
    {
      "name": "Sawyer",
      "person_id": 35300
    }
  ],
  "release_date": "2012-08-05",
  "scene_id": 70581,
  "series": "Force Rendezvous 3",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "First Time",
    "Gay",
    "Kissing",
    "Tattoos"
  ],
  "title": "Kieran & Sawyer"
}