{
  "collections": [
    "Active Duty"
  ],
  "description": "For those of you with a case of an addiction to Axl, you're in luck tonight! We bring back our own super star Axl for an intimate duo scene with the recently-returned Domenic. What results is a flip-flop pairing that is just beauty in motion.We kick things off immediately in the shower, where the boys are cleaning up before getting dirty. The dick are already hard, the kisses are already happening, and the sucking starts immediately.Axl drops to his knees, engulfing Domenic's big dick in his mouth while the water cascades down his face and body. The tall Axl (all 6'3' of him) looks amazing as always in the shower, as he stands up to let Domenic orally please him. He jokes, as Domenic sucks him, that 'those girls we got those numbers from might have to take a lesson from us!' referencing another wild night out on the town. Axl laughs and Domenic agrees.Axl wonders why they're wasting their time in the shower when they could be on the bed. What a great idea! We cut to the bedroom, with Domenic laying back, enjoying Axl's mouth wrapped around his dick. Dang, now, I know you can see for yourself how gorgeous Axl's body is -- but really, it's something, isn't it? He's got a body that just won't quit. His ass is that of an Olympic gold medalist gymnast, I swear.Axl coughs and gags a bit, pulling off Domenic's big one, saying how it hit the back of his throat. Well, Domenic *is* a big boy . . . But the trooper that Axl is -- he goes back down on Domenic. We get some great shots from above and from the side, where we see Axl splayed out on the bed, grinding into it, as he sucks away on Domenic. (Why don't we have a video of Axl just dancing or stripping for us? I'll get right on that . . .  lol.)Domenic sits up a bit, so his legs dangle off the bed, and Axl gets in-between them. Axl is *almost* able to get all of Domenic's dick down his throat -- but not quite. 'Big fuckin' pork sausage' Axl says to Domenic, as he manhandles his dick, slapping it against his stomach.We get Domenic back to laying on the bed, but this time, Axl straddles him, diving his dick into his mouth. I make sure the camera gets behind Axl, and underneath his balls, so we can get the ultra close-up of the sucking. (So close-up, that we hear Domenic's slurps and swallows.)With Domenic still on his back, the guys move around to a 69 position. Lord, hand me a fan. I could watch Axl all day in this position. That is: the position with his knees on either side of Domenic's head, ass in the air. We move around to the other end, to get closer to Axl's face, and we hear him whisper 'just tastes so good' about Domenic's cock. Amazing.After a spell of 69-ing, Domenic says he wants to see Axl's ass up close. And wow, we get a nice show. Axl gets on his stomach, and Domenic comes in for an inspection, slapping his huge dick against his cheeks. Axl goes back down on Domenic as the latter continues his ass-inspection. This is a serious Ass Fiesta, and it's only going to get better, troops.Because now? Now it's time for some fucking -- and Axl is first to take it. I love how about mid-way through, Axl kind of takes matters into his own . . . ass? He starts rutting backwards, fucking himself on Domenic's dick. (P.S. Domenic is no slouch in the Gorgeous Ass Department, and we get a good look of it as he drives into Axl's rear.) Domenic reaches around to stroke Axl and, says, surprised, 'ooh, you're hard as a rock!' Axl replies, with a smile, 'absolutely.' The guys pick up the pace, with Axl slapping his ass hard against Domenic's dick and body. It's some hot stuff, and Axl is so turned on, he tells Domenic that it's his turn to bottom.We move to watching Domenic on his back, ass on a pillow, with Axl fucking him. And when -- wow -- as Axl fucks him, he sucks Domenic too. Yes, you read that right: Axl simultaneously fucks and sucks Domenic. And then he RAILS Domenic and we're there for every second of it to see Axl's thick dick sliding all the way in and out -- going double-time folks.We're in the home stretch now, and there's no stopping the Axl train as he gets closer and closer to spewing his load. 'This asshole is so fucking tight' he says to Domenic, as he continues to thrust away, getting in some serious long-strokes. He's doing the all-the-way-in-and-out thrusts, with Domenic's ankles up around his  head.Soon enough, Domenic says he going to cum and he shoots his load all over his chest while still getting fucked by Axl. The latter quickly follows up, spewing his seed to blend with Domenic's. 'That's a big mess' Axl says, 'but I'm still ready to go though,' gesturing to his still-hard dick. We're not getting a round two out of these guys just yet, but we do close out with them sharing a couple kisses and we fade to black.",
  "models": [
    {
      "name": "Domenic",
      "person_id": 35080
    },
    {
      "name": "Axl",
      "person_id": 35274
    }
  ],
  "release_date": "2012-08-19",
  "scene_id": 70585,
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Shower",
    "Tattoos"
  ],
  "title": "Axl & Domenic"
}