{
  "collections": [
    "Active Duty"
  ],
  "description": "'Guy, where the hell you been man?!' I ask him as the scene opens. 'I've been gone for a little bit,' the 5'11'-tall Guy responds. I say, 'People's been asking about you.' 'Oh yeah?' he says, with a sly grin. I tell him how after his only other hard core scene for us -- a three way with Korbin and Taylor -- the letters started pouring in, asking for more of the beefy gent.<br /><br />Well, your porn prayers have been answered tonight, because Guy and all 8.5 inches of his dick o' death have come back to this fine site.<br /><br />I get out of their way and let the fun begin. Out comes Guy's massive cock and Tanner is impressed, wondering where he could possibly store such a huge tool. Tanner tells Guy to take his shirt off, and he does, revealing his beefy torso with its dashes of ink. Tanner manhandles Guy's thick thighs and pec muscles before grabbing onto his cock. Guy is blowing bubbles with his chewing gum, clearly wondering who is going to make the first serious move.<br /><br />As Tanner has been around the block a few times here, he knows the ropes, so he takes lead. After getting Guy's underwear off, down Tanner goes, kissing Guy's stomach and chest while jerking his dick. After a minute of stroking, Tanner's mouth finds its way to Guy's dick, helping it get stiffer and stiffer. Guy seems to like it, as we see his hips slowly move up and down, helping push his dick farther into Tanner's mouth.<br /><br />Things switch up, so Tanner is on his back with his stiff dick pointing north. Guy climbs over and goes to work, sucking Tanner much to his enjoyment: 'Now that's how you suck a dick!' he says. Lots of slurping and gurgling ensues on Tanner's part, where I think we hear just about every breath, swallow and gurgle he makes. (If only we presented our videos in Dolby THX! lol.)<br /><br />Guy goes up for some quick kisses and then slips back down Tanner's torso, pecking his skin along the way. Back to sucking for Guy, as Tanner says 'you really know how to suck a dick man.' And by the looks of it, we're going to agree!<br /><br />Tanner gets up on his knees, flips around and shows off his ass to Guy, who starts slapping Tanner's muscled cheeks. Guy tells Tanner to squeeze his cheeks, and he does, and it -- of course -- is a sight of firm, muscled glory. Guy slaps his ass a bit more and goes down to steal some kisses from his ass.<br /><br />Jesus, when Guy comes up and starts slapping his dick against Tanner's ass, it's insane. It's so thick! It makes such a loud thunk-thunk against Tanner's rump -- just wait until you hear it. We get some up close shots of Tanner's hole as Guy slaps his dick ever closer to it, alternating some ass-slapping with light kissing.<br /><br />Soon enough, Guy is spearing Tanner's ass with his dick, squeezing his thick log into him. All Tanner can do is grunt and pant his way through the initial breakthrough, until Guy penetrates that ass-seal -- so to speak. Guy starts driving into Tanner, faster and faster, and all Tanner can do is pant and go 'agh!' in return. <br /><br />We get Tanner on his back, legs flung in the air as Guy gets between and goes to town. It's all a blur of vibrating, moving, thrusting flesh now. 'You want me to cum?!' Guy says to Tanner, and a moment later, the loads start to fly all over Tanner's chest. Whew!",
  "models": [
    {
      "name": "Guy",
      "person_id": 35086
    },
    {
      "name": "Tanner II",
      "person_id": 35290
    }
  ],
  "release_date": "2012-08-12",
  "scene_id": 70583,
  "series": "Force Rendezvous 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Guy & Tanner"
}