{
  "collections": [
    "Active Duty"
  ],
  "description": "It's been a spell since we checked in with our pal Bryce -- one of our buddy Mike's finds. Bryce is such a fine specimen with that gorgeous young body of his, his massive dick and that adorable face -- you just wanna eat him up. Well, tonight, he's joined by muscled cutie Jimmy, who you've met before, but this time Jimmy is going to do something he's never done . . .<br /><br />We get things going right off the bat with the guys on the bed, already groping themselves through their shorts. Mike says to Jimmy that he knows he has to go somewhere in an hour, but asks if he can come back later. Jimmy says he can, so we'll see what happens then . . . <br /><br />But for now, let's focus on the present. The guys slip their shirts off and Mike asks them to get closer together. Now, their shoulders and biceps are touching, so Mike asks, 'Is that alright?' Jimmy hits back 'Oh yeah.' Guess things are working out! A minute or so goes by and Bryce takes it upon himself, without prompting, to unveil his monster cock. The thing is the size of, jeez, I don't know, a baby's arm? He gets two fists around it, stacked on top of the other and . . . there's a knock at the door. Who is it? The guys both look off camera as Mike goes and answers. We never find out who it was. Perhaps Mike's next gentleman caller?<br /><br />Mike returns and asks Jimmy, who says he's never really done anything with a guy, if he can reach over and jerk Bryce. He says that he can, and takes Bryce's thick member in his hand -- much to Bryce's audible approval. Soon, Jimmy gets his pants off so we can see his muscled body in full -- what a pretty sight! Bryce is enamored as well, as he feels up Jimmy's pecs with his hands before diving down on Jimmy's dick with his mouth.<br /><br />Jimmy moans and sighs, telling Bryce that he's 'doing a really good job' sucking his dick. Certainly Bryce looks to be loving every minute of it, taking Jimmy all the way down as far as he can. Mike tells Jimmy to tell Bryce what he wants him to do, so Jimmy says 'suck that dick!' Jimmy says he wants it 'slow and easy,' so Bryce complies, lovingly giving him the blow job he wants. <br /><br />Mike gets things switched around so that Jimmy gives cocksucking a go, and Bryce is his target. But before engulfing his dick in his mouth, Jimmy kisses Bryce's body up and down his torso, exploring and caressing his skin. Soon enough, Jimmy is jerking Bryce's thick tool and bobbing up and down. All Bryce can do is sigh and moan, flinging his head around and twisting his body in response to the blow job.<br /><br />Eventually the boys work up to shooting their loads, and Bryce make sure none of Jimmy's is wasted, as most of it ends up all over his cheek. Ensuring that Jimmy is indeed good to the last drop, Bryce sucks and licks the rest of his cum off Jimmy's dick after he's shot his load. After that, Bryce shoots his shot and Mike gets Jimmy to suck out the last bit of his load, saying, 'It ain't gonna kill ya.' As we close out the scene, the guys kiss and promise Mike that they'll return for another round later that same day . . . <br /><br />Until then!<br />",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 35051
    },
    {
      "name": "Jimmy",
      "person_id": 35295
    }
  ],
  "release_date": "2012-08-29",
  "scene_id": 70589,
  "series": "Covert Missions 13",
  "tags": [
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Smooth",
    "War Chest"
  ],
  "title": "Bryce & Jimmy"
}