{
  "collections": [
    "Active Duty"
  ],
  "description": "Somehow we've never paired up big Tanner with our own legendary Kaden Saylor up until tonight. How in the world did we let this match-up slip past us until now?<br /><br />Our scene with the guys -- who are just as jovial as ever -- opens as they joke about their seating arrangement. Tanner is up in a higher chair that's throne-like, while Kaden is sitting comfy in a lower perch. Tanner laughs about the set-up and how Kaden is at a lowly evel: 'that's why you're down there and I'm up here.'<br /><br />Kaden shoots back, 'that's alright, you're about to be down there!' as he points to the ground, indicating his ass will be up for grabs in a matter of minutes. They both laugh and share an inside joke about the off-camera porn that's playing. 'I think we need a new DVD,' Tanner says. (Dang, I need to work on our porn collection, it seems.)<br /><br />Kaden tells Tanner, 'I've been watching you . . . your performances . . . and I was like, 'I wonder how he sucks dick?'' And then he says to Tanner, 'Are you good at it?' And Tanner says, 'I don't know, I guess you'll have to find out. I'm one of those game day players,' he says, smiling. 'I rise to the occasion.'<br /><br />Both of these guys are such cards, and to see them in action, it's pretty funny. They shoot the shit about how guys might be better at sucking dick because they know what they want. (And how some girls jerk a man off as if they're trying to rip a cock off. lol.)<br /><br />Off comes the shirts and shorts, and after Tanner sees Kaden's body for the first time, tells him 'You're making me look all small!' Yeah, it's OK Tanner, I think you're doing just fine buddy. Tanner goes down on his knees and begins to go work on Kaden's dick. Kaden starts up-thrusting his hips to meet Tanner's bobbing face, telling him, 'Aw, yeah, suck that dick. Fuck that mouth. Yeah! Smack that around.'<br /><br />After a spell of sucking, Kaden says, 'You ready for me to fuck that ass?' And pushes Tanner over to the bed and onto his back. Kaden starts to ram on in -- much to Tanner's dismay as he grunts and moans to high heaven. I think we should've gone the slow-and-easy route this time, but . . . oops?<br /><br />A few minutes of seemingly wild discomfort passes and Kaden finally gets in and gets into a rhythm. The guys work through four different positions -- Tanner on his back, side, hands and knees, and then straddling/sitting on Kaden's dick. The poor guys gets a serious fucking workout. Tanner shoots his spurting load whilst atop Kaden. Then Kaden spews his big load all over his chest, moaning and grunting as he jerks out all his cum.",
  "models": [
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Tanner II",
      "person_id": 35290
    }
  ],
  "release_date": "2012-09-30",
  "scene_id": 70599,
  "series": "Tower Watch 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Kaden & Tanner"
}