{
  "collections": [
    "Active Duty"
  ],
  "description": "Meet our latest recruit, the sexy and talented Chip. Not only is he a former motocross racer, but he's also a chef. So basically, if Chip plays his cards right, he'll not only model for us, but also end up in the kitchen cooking meals for the entire Active Duty army. The compact guy -- who stands at 5'7' -- hails from Texas and is so beat up from his motocross days, he says he only has one real joint left (his left elbow). He's got so much metal in him, he regularly sets off alarms at the airport and has to show a special pass to security that explains his loaded-with-metal body.Major Wood gasps when Chip slips off his blue jeans. Not only because of how Chip isn't wearing underwear, but also because of his burgeoning erection. Major Wood asks Chip how big his dick is, and Chip says, 'to be honest with you, I've never even measured it.' We're gonna try and believe that one folks, but it's a good-sized one, trust us.Chip reclines on the bed and focuses on the matter at hand, working over his cock with two hands. We get in real close so we can hear every squish of his dick as its gets squeezed and stroked by Chip's hands. Chip gets up and gets a gander of himself jerking in the full-length mirror, which is always a treat to see. It's like he's standing next to his twin -- or we're seeing double. All we need now is one of those dressing room mirrors that shows four different angles all at the same time and we'll be in business.Chip's smooth, golden-tanned body leans back on the bed, still enjoying the view of the mirror, as he continues to pay close attention to his thick member. After a spell, he gets up off the bed, giving us a nice rear-view of his back side. We get in close -- and underneath -- to inspect the goods, so to speak. Chip then does this nifty little move where he humps the side of the bed, pushing his dick down against the side of the mattress, rubbing it up and down against the comforter.It won't be long now before Chip blows his load, so he lays back down on the bed, grabs a bit more lube, and gets back down to business. Soon enough, as he's two-fisting his cock with his eyes closed and head flung back. Chip sighs, 'oh fuck,' and starts shooting. One, two, three . . . four, five, six spurts come out, hitting his chest and left pectoral muscle",
  "models": [
    {
      "name": "Chip II",
      "person_id": 35306
    }
  ],
  "release_date": "2012-09-05",
  "scene_id": 70591,
  "tags": [
    "Brunette",
    "Gay",
    "Jerk Off",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Chip II"
}