{
  "collections": [
    "Active Duty"
  ],
  "description": "If you caught our War Chest Update this past Wednesday, then you might guess what's coming in today's update. That's right, we're drawing Jimmy across the line thanks to our pal Mike and his cutey recruit Bryce. Today: The guys take turns fucking one another -- bareback.We open today's scene with Bryce and Jimmy on the bed, still impossibly dressed (they'll make quick work of that) as Mike jokes with them about what they shot earlier that day. Jimmy says that 'it was a lot to handle,' referring to not only the new experience of sucking a guy, but having to suck a guy with a dick as large as Bryce's. Mike asks about if he's ready for what's about to happen now, and he smiles, saying somewhat nervously: 'we're gonna see.' Mike asks, 'why, what do you think the problem is gonna be?''He has a really big dick!' Jimmy answers, which makes all three of them laugh.Mike lets the guys take it away, and they start pulling at one another's belt buckles, while going in for some kisses. Bryce slips off his blue jeans, Jimmy peels off his shorts and then all the clothes just come clean off. The boys go to work, jerking one another. All this happens in less than two minutes -- the guys ain't messing around.Jimmy swoops down on Bryce's dick, engulfing the huge member in his mouth. He sucks for a bit before it's Bryce's turn to work over Jimmy. The guys go back and forth for a bit, and when Jimmy goes to work on Bryce, kissing and licking his balls, Bryce ends up in heaven. 'Lick those balls!' he tells Jimmy. The guys start making out while jerking, and I'm thinking we've made a love connection here folks. They are so tender when kissing, you'd swear they probably made a date for dinner later that night. (We'll get back to you on that one.)It's incredible to see Bryce's huge dick, just freely standing at attention while he makes out with Jimmy. The thing is a beast! Jimmy makes sure to grab it though, giving it some attention while the guys smooch and caress one another. Bryce is certainly on another plane -- lost in the emotions he (and his cock) are feeling. I'm not sure if I've ever seen Bryce this hot for a guy before. (Really, an entire scene could have been made of just the guys rolling around kissing -- there is so much footage.)But, all of that is only a warm-up to The Big Moment: Jimmy flips over onto his stomach and lets Bryce lube up his rear. Bryce makes sure to take extra care (and extra lube) when working his fingers in there, getting his ass ready for what will be an enormous proposition. lol. Bryce takes it easy when slipping his thick log into Jimmy (bareback), making sure not to hurt our muscular fella. But once he's in -- and in good -- Bryce lets out an 'oh fuck!' as he starts to build a rhythm. Mike gets his camera up close on the action and we can see goose bumps on Jimmy's ass! Clearly, *something* is working its magic on Jimmy. Soon, Bryce's downward thrusts are matched by Jimmy's upward thrusts and the men are off to the races. You know, I've seen a lot of our friend Mike's footage that he's sent to us, but I really do think this is one of his best scenes. It's raw and rough around the edges, but the guys are so cute and somewhat lost in the moment, it's a very much an 'amateur' experience. (If some of you remember what 'amateur' videos used to look like a zillion years ago! lol.)Jimmy flips over to his back, and Bryce starts going at him with Jimmy's legs up in the air. All that thrusting leads to Bryce blowing his load over Jimmy's hole -- and of course Mike goes in for an ultra - ultra - close up. But now - it's Bryce's turn to get fucked. After liberally lubing up Bryce's butt, Jimmy plows in - bareback. On his back, Bryce can't contain his yelps and 'uhhs!' Jimmy goes in for some lip-locking as he ruts into Bryce, telling Mike how tight Jimmy's ass is. Soon too, Jimmy is unloading his cum all over Bryce's hole, and we fade to black . . .",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Jimmy",
      "person_id": 35295
    }
  ],
  "release_date": "2012-09-02",
  "scene_id": 70590,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Muscular",
    "Smooth",
    "Twink"
  ],
  "title": "Bryce & Jimmy"
}