{
  "collections": [
    "Active Duty"
  ],
  "description": "For their second scene together, Bryce and Marty are fully clothed, but we waste no time getting right to it. They start groping one another, nuzzling, and feeling the increasingly growing bulges in their shorts. They start tenderly making out and getting more aggressive with their exploring, until Bryce's monster dick is sticking out the bottom of his shorts.If you really like seeing guys making out and being tender and just 'in the moment,' you'll love their scene together, really. It's two, young, cute-as-a-button gents just in the *zone*. They're making love -- they ain't just having sex.I'm not sure we've seen Bryce's dick *this* hard before. If Marty and him didn't exchange numbers and go out for a candlelit dinner afterwards, those boys are missing out. After rolling around and sucking and kissing for a while, Bryce gets Marty up onto his knees so we can see one of the cutest asses to grace our site. Bryce kisses and explores Marty's behind a bit, before he decides to work a finger -- or two -- in his ass. We know what's going to happen next, folks. But Bryce has gotta get Marty ready for his thick tree trunk of a dick. A minute or so later, Bryce is pushing his dick -- bareback -- into Marty's pretty little rear. 'Fuck, you have a huge dick,' Marty whispers. 'Fuck! Damn!'Soon, Bryce is loosening Marty up. And Marty responds in kind, 'Gimme that dick!' Then Bryce says something back to him that we can't hear, but Marty answers: 'I love that shit.'  Soon, all we heart is a chorus of groans, moans and 'uhhhhs' from Marty as he gets filled up by Bryce. You know those old commercials, with that kid 'Mikey' and how 'Mikey likes it!?' Yeah, well, today, we're saying 'Marty likes it!'Mike gets in super close with the camera, so all we see is frantic fucking by Bryce and all we hear is heavy breathing by both Marty and Bryce. It's like you're *on top* of the boys as they go at it. Bryce pulls out and starts jerking over Marty's cheeks, and Marty tells him to 'get that cum on me.' Well, Bryce follows orders, and jerks out a huge load over Marty's ass crack as Marty says 'gimme that cum.' Mike gets in close with the camera as we see Bryce's cum pooling in Marty's freshly worked-over hole. Dang.'Now it's my turn,' Marty says. So he reclines back on the bed and lets Bryce work him over with his mouth, making him harder and harder. Then, Bryce gets up on his knees and out comes the lube. While the 'Bryce sitting on Marty' position doesn't really work out for the pair, they soon switch things up and we get Marty behind Bryce (who is on his hands and knees). Now *that* position works and the guys start up a rhythm. You'll have to see how things end, folks, but I think we've Bryce and Marty are going to become fast friends!",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Marty",
      "person_id": 35307
    }
  ],
  "release_date": "2012-09-23",
  "scene_id": 70597,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Smooth",
    "Twink"
  ],
  "title": "Bryce & Marty II"
}