{
  "collections": [
    "Active Duty"
  ],
  "description": "Pointing at the off-screen TV playing some straight porno, Tanner asks Sebastian, 'What do you think of that?' Sebastian laughs, 'That looks painful as fuck!' <br /><br />And that's how we start tonight's scene with Sebastian and Tanner folks. Now, you've seen Sebastian in two separate solo scenes, along with a duo with Kaden (where he only got sucked off by Kaden). But tonight, he's jumping clean across that line -- no joke. Tonight, Sebastian not only sucks dick, but also gets fucked by Tanner. We ain't wasting time with this strapping, tattooed stud -- and we hope you'll agree that it's a sizzling pairing!<br /><br />As Sebastian's arms are covered in ink, this leads to a great exchange by the guys, where we learn a bit about his tats. After the men have peeled off their shirts and bantered a bit, Tanner says, 'So what else are you hiding?' 'Well, I got somethin' in my shorts…' Sebastian answers.<br /><br />He slips off his shorts and boxers and starts working on his dick, bringing it to attention. Meanwhile, Tanner starts exploring his body, feeling up his enormous thighs and chest. Really, Sebastian is tall -- way tall. And built -- way built.<br /><br />'You're a big dude,' Tanner says, running his hands over Sebastian's body, 'so much to touch.' Then he grabs Sebastian's cock, saying 'that's a big fuckin' dick.' We're off to the races!<br /><br />Tanner kisses up and down Sebastian's shaft, and then pecks at his neck and chest, before sinking his mouth over his dick. 'That feels good,' Sebastian tells him, running his hands up and down Tanner's back.<br /><br />'What you got in your underwear?' Sebastian asks Tanner. The latter slips them off, revealing his thick stiffy. 'Don't be shy!' Tanner tells him, as Sebastian grabs hold of Tanner's dick and start stroking. 'You're hard as a rock. You feel good,' Sebsatian says. Tanner jokes back, stroking Sebastian, 'You have very soft hands.' The guys giggle a bit over that, breaking whatever tension was left in the room. <br /><br />After a bit more sucking on Tanner's part, he tells Sebastian, 'I think it's time for you to return the favor,' and leans back. 'Well, alright,' Sebastian says, going in for his first taste of Active Duty cock. A little tentative at first, Sebastian seems to get the hang of it quickly. He dances around Tanner's dick a little, kissing it and tonguing it slightly. 'Don't be shy with it!' Tanner tells him. So Sebastian goes down properly and Tanner sighs and moans in response.<br /><br />'Are you sure this is the first time you've sucked a dick?' Tanner asks. 'It's my first time' Sebastian assures. 'I think you're a liar,' says Tanner. <br /><br />Tanner gives valuable instruction: 'You can go a little faster you know.' So Sebastian picks up the pace and bobs up and down faster. Tanner taunts Sebastian about how he can't wait to fuck his 'virgin ass.' We don't have to wait for long, as the guys shift around a bit, with Sebastian on his hands and knees and Tanner slapping his ass with his dick. <br /><br />Tanner slaps on a condom and starts pushing his way in. Once he breaks into Sebastian ass, he lets out, 'Ahh! There we go, finally! That's a tight ass!' Sebastian cheers him on, 'Man, you are going to town on that ass.' We get underneath Tanner so we can see him slam into Sebastian, balls slapping against him, fast and furious. 'Oh you like it?!' Tanner says. 'Fuckin' love it!' shoots back Sebastian. <br /><br />Sebastian flips over onto his back, 'god, that's deep,' he says to the still-thrusting Tanner. Sebastian's jerking away as Tanner continues to plow on in, making himself at home in Sebastian's tight hole. It won't be long now before one of the gents busts his nut.<br /><br />'Uh, I'm about to cum!' Tanner says. He quickly pulls out, shooting his load all over Sebastian's balls and thighs. Sebastian's next with his load, as he sends it sailing across his own chest, high in the air. Dang. (Tanner agrees: 'That's a lot of cum!') Sebastian is a shaky, jittery mess afterwards, telling Tanner: 'That felt amazing!' <br /><br />The guys bask in the afterglow, and, as it turns out, Sebastian liked his 'first time' Active Duty. See, it wasn't that bad! Tanner goes in for a quick kiss and we're out!<br /><br /><br />",
  "models": [
    {
      "name": "Sebastian",
      "person_id": 35297
    },
    {
      "name": "Tanner II",
      "person_id": 35290
    }
  ],
  "release_date": "2012-09-16",
  "scene_id": 70594,
  "series": "At The Ready 2",
  "tags": [
    "Anal Sex",
    "Duo",
    "First Time",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Sebastian & Tanner"
}