{
  "collections": [
    "Active Duty"
  ],
  "description": "We heard you loud and clear. Our recent drop-dead gorgeous recruit Sawyer has been slowly trying new things with us, and tonight, he takes one more step. He bottoms for the first time -- with Tanner! (And you know Tanner has a big one, so this should be mighty interesting.)We open the scene with the guys shooting the breeze, and Tanner point out how Sawyer is already hard underneath his shorts. It's pretty obvious -- there's a big lump under the fabric. Tanner asks, 'So, is this the first time?' And Sawyer says, 'This is gonna be first of . . . receiving. The first time I'm actually catcher. Should be interesting.''It's a lot better being the pitcher sometimes,' Tanner jokes. 'My opinion,' he says, smiling.Tanner asks if Sawyer has any tattoos, and off comes his shirt. Oh, and then off comes Tanner's tank top. Amusingly, the guys compare their matching tan lines, which leads to Tanner inspecting Sawyer's chest with his hands . . . And we're off!'You have very soft skin,' Tanner says to Sawyer. As Tanner strokes Sawyer's legs and chest, he tells him, 'You're a very pretty man,' and Sawyer responds in kind, 'Thank you.' (Really, this sounds stilted in print, but it's adorable when you watch the video.)There's a lot more build-up in getting them fully naked, and I think you guys will really like it. They take their time in getting there -- and getting fully comfortable with one another. They aren't rushing things, but once Sawyer's boxers come off, Tanner knows exactly what to do. He grabs Sawyer's dick and starts jerking, while kissing his abs up and down his chest.When Tanner goes down on Sawyer, we hear Sawyer shudder and let out a stuttering sigh -- clearly happy with what's going on. After a minute, there's a bit of a gurgle and Tanner comes off Sawyer's cock, saying, 'I almost choked on it.' 'Fuck, does that taste good?' Sawyer asks. Tanner mumbles, dick-in-mouth, 'mm hmm' and Sawyer says 'Feels good.' Tanner comes off his dick, saying 'Better than your girlfriend?' Whoah nelly! 'Yeah,' Sawyer says, eyes widening, 'any day.''Alright, my turn,' Sawyer says to Tanner, telling him to 'take those (shorts) off.' Sawyer is a bit stunned at Tanner's size, but that doesn't hinder him from diving down and wrapping his lips around its thick head. 'Think you can take the whole thing?' Tanner asks. 'I doubt it . . . I can give it a try' Sawyer says, 'probably gonna gag me though.' And try he does -- go Sawyer! While he can't get it all in, he gives it his best effort, and really, that's what matters, right? lol.Sawyer stops for a moment, starts kissing Tanner's chest, and seemingly lost in the moment, tells him, 'you're so sexy.' Tanner hits back, as his dick bobs around on its own in the air, 'Look at that, you're making my dick jump all over the place. It's jumping to be in your mouth.' Sawyer laughs, 'It'll get in there,' and then goes back to working his dick over with his mouth.'Suck me off again?' Sawyer tells/asks Tanner, and up he jumps to straddle Tanner's broad chest to feed him his dick. Tanner smacks Sawyer's AMAZING ass as he pumps his dick into Tanner's mouth. All the while, Tanner slaps his thick dick against Sawyer's pretty butt.After a bit more teasing, Sawyer gets onto all fours on the bed, and Tanner's up behind him, dick in hand, ready to go. After a couple tentative strokes into Sawyer's ass, Tanner's in and BOOM, starts fucking him fast and hard. He starts slapping Sawyer's ass cheeks and says 'how do you like that dick?' Sawyer mumbles something incoherent. We pull back to get a wide side shot of the guys, and Tanner grabs Sawyer's hip and starts going to town. 'Smack my ass,' Sawyer tells Tanner. 'It's the tightest ass I've ever fucked,' Tanner says, 'Back that ass up.' And whoah, hello nurse! Sawyer starts bucking his ass onto Tanner's dick. Sawyer flips over onto his back, legs flung up in the air with Tanner between them. He goes on in with his cock, and Sawyer blurts out, 'fuck that feels good.' We get in really close so you can see the ol' in-out, in-out action. Sawyer plays a bit with his nipples and tells Tanner to 'get in there nice and deep like.' After a little while, Sawyer says to Tanner, 'It's my turn to fuck you,' and Tanner hits back, 'I thought you'd never ask.'The guys switch around and Sawyer starts fucking Tanner from behind and wastes no time with easing himself in. All of a sudden, we hear nothing but grunts and groans from Tanner as Sawyer wails on his ass. Sawyer grabs onto Tanner's muscled ass cheeks for balance and works him over. Tanner moves around onto his back and Sawyer starts fucking him again. We're almost there now and it looks like Tanner is ready to blow, as he jerks off his hard dick as Sawyer fucks him like nobody's business. The guys are a sweaty mess now and Tanner is slapping Sawyer's chest -- which is bouncing and glistening with sweat. 'Gimme that ass,' Sawyer tells Tanner -- and at this point Sawyer is nothing but a blur of moving flesh.And wow -- Sawyer's load is crazy huge and it gets major distance. All the way up Tanner's chest, up to his neck! We're gonna say he liked the experience . . . just a bit! Tanner unloads to right after, sending cascades of cum down the shaft of his cock.The scene fades to black, and we pass out. lol.",
  "models": [
    {
      "name": "Tanner II",
      "person_id": 35290
    },
    {
      "name": "Sawyer",
      "person_id": 35300
    }
  ],
  "release_date": "2012-09-09",
  "scene_id": 70592,
  "series": "First Strike 3",
  "tags": [
    "Anal Sex",
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "Muscular",
    "Smooth"
  ],
  "title": "Sawyer & Tanner"
}