{
  "collections": [
    "Active Duty"
  ],
  "description": "Our buddy Mike is up to his old tricks again. And tonight we get to bring Brock and Jimmy together for some oral action'What do you want to do today Brock?' Mike asks the studly gent stroking his dick under his shorts. 'Get my cock sucked' he answers. 'I might be able to get that done for you,' Mike coyly responds.Well, lucky for Brock (and us), Jimmy has just walked in the room after grabbing some food. We hear Mike conspiring behind the camera with Jimmy, clearly aiming to get Jimmy over to the bed -- we think. Brock reveals his thick dick -- and frankly it's a  perfectly-formed cock with a set of balls to match. Mike goes back and forth with Brock, asking him what he likes to do with it. To no one's surprise, he says he likes it sucked. He even says he likes fucking guys with it. Well, we're in business folks! (You've seen his work before in the War Chest, mind you.)Finally, the ice has been broken, and Brock asks the off-camera Jimmy if he'd suck his dick. 'Yeah!' Jimmy responds, and he's off to the races, jumping onto the bed. He teases Brock -- kissing up and down his thigh while get tantalizingly close to his dick. After a minute or so, Jimmy stops taunting Brock and engulfs his cock in his mouth. Brock absolutely loves to get his balls licked and sucked, and responds in kind to Jimmy's tongue, letting off moans and groans like he's found the love of his life. Jimmy keeps on working over Brock until he can't take it any more. He grabs his dick and starts frantically jerking his dick. 'I'm about to cum!' he says, and then swiftly spurts out a load onto his polo shirt.While the fun may be over with the guys tonight, from the way their scene ends, you can be they are going to be back for round two. And next time, there's going to be some fucking . . .",
  "models": [
    {
      "name": "Brock MB",
      "person_id": 35256
    },
    {
      "name": "Jimmy",
      "person_id": 35295
    }
  ],
  "release_date": "2012-09-12",
  "scene_id": 70593,
  "tags": [
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "War Chest"
  ],
  "title": "Brock & Jimmy"
}