{
  "collections": [
    "Active Duty"
  ],
  "description": "It's new recruit time here at Active Duty, where we're bringing you a never before seen guy: Grant. The 22-year old muscular gent comes to us thanks to our director pal Mike, who has been very busy behind the camera lately. Grant stands 6' tall, weighs 187 lbs. and hails from Virginia. He likes to work out, run and shoot. And 'competitive pogo-sticking' he says, laughing.We're not more than a minute into our scene with Grant, and you can hear the off-camera chick on the porno groaning her head off. While it adds a certain flair to the proceedings, Mike luckily turns down the volume a bit so we can concentrate more on Grant's deep breathing as he jerks his 8' dick. And wow, it's a thick monster. It's bone-hard as soon as he slips it out of his camos. (Really, you guys that have been itching to see uniforms here on the site are gonna love Grant. When he peels off his T-shirt -- but leaves on his camo hat -- you just might lose your shit.)About half way through the scene (and after Mike has copped a feel of Grant), Mike asks if Grant's ever had a guy suck his cock. 'No,' comes the quick response. 'You ever thought about it?' Mike asks. 'Everybody . . . I guess most people have?' Grant says. DING DING DING, we have a winner!So of course Mike says, 'Would you be willing to let a guy suck your cock?' Grant pauses, and furrows his brow, answering, 'I guess?' Lucky for us, and Grant, Mike has a surprise planned (or plotted, more like it). And here's where it gets . . . odd? When Grant hears the door jingle and open off camera, he freaks out, and throws his boxers over his erection. Then goes even further, and grabs a pillow and covers up his entire groin.We hear Jimmy come in, sounding kinda pissed off, saying to Mike: 'What's going on man? I was eatin' food!' And then comes the introduction that only happens in porn: Jimmy meets a buck naked Grant for the first time. Mike says, 'This is Grant. Grant, this is Jimmy.'Mike tells Jimmy to help Grant out, and, here's where we think Jimmy's full of shit -- he says, 'What do you want me to do?' So Mike says, 'What do you want him to do Grant?' 'Suck my cock,' Grant says.And boom! We're off, and Jimmy's sucking Grant with gusto, slurping him down and working him over. 'Suck my balls,' Grant commands Jimmy, who complies. 'Choke on my cock,' Grant says, 'You like that dick?' Jimmy responds, mouth full of dick, 'Mmmhmmm.''You ready for that cum?' Grant says, as he grabs his own dick and start jerking furiously while Jimmy licks and sucks on Grant's chest. And out comes his load, spewing all over his groin. Jimmy licks up the last drops from the tip of Grant's dick -- at Mike's instruction.This may be it for the guys in this scene, but I have the feeling we're going to see them again together really soon .  . .",
  "models": [
    {
      "name": "Jimmy",
      "person_id": 35295
    },
    {
      "name": "Grant II",
      "person_id": 35308
    }
  ],
  "release_date": "2012-09-26",
  "scene_id": 70598,
  "tags": [
    "Blonde",
    "Blowjob",
    "Brunette",
    "Gay",
    "Muscular",
    "Uniform",
    "War Chest"
  ],
  "title": "Grant & Jimmy"
}