{
  "collections": [
    "Active Duty"
  ],
  "description": "When we last left you with Brock and Jimmy (a week ago), the guys had tip-toed into some oral action, but left us wanting more. (And we think Brock wanted more, too!) So our pal Mike brought the two back together for another round and this time, asses were on the line. Literally.<br /><br />After a minute of small talk, Mike leaves the guys alone for a bit so they can get comfortable. They're working their dicks beneath their underwear and soon enough, Brock hauls out his big one. Dang, I know we've seen it before, but it's still such a sight for sore eyes. Why Mike hasn't measured this puppy on camera is beyond me. I think we need to make that happen. But hey, I digress.<br /><br />Back to the action now as both gents are nearly naked, save for Jimmy's black boxer briefs. Oops! Now they're gone too, and Jimmy reaches over to Brock and begins jerking him off. After a spell, Jimmy goes to work sucking Brock's dick. After he gets him nice and wet, Mike tosses a bottle of lube at the guys. Evidently, that's the universal sign for 'you ready for some ass fucking?' lol!<br /><br />The guys waste zero time as Jimmy flips onto his back, legs flung into the air, hands behind his knees. Brock gets up next to his ass and -- boom! -- dives in with his bareback dick. It's not the best position for the boys, so they move around so Brock can stand up next to the bed and work himself into Jimmy. All Jimmy can do is moan and groan while Brock slams into him.<br /><br />Brock can't take it any longer, and he pulls out and shoots his load all over Jimmy's balls and dick. He then quickly stuffs his just-shot dick back into Jimmy's ass. Dang Mike! <br /><br />We rejoin a reclined Jimmy on the bed, who says that it was only the second time he's ever been fucked. (The first time was with big-dicked Bryce, so Jimmy's get the full treatment from Mike and his stable of big boys. lol.) Brock comes over to help jerk Jimmy off, and strokes out his load onto his stomach. Mike chats with Jimmy afterwards about how Jimmy said he was never going to do certain things and well, as Mike says, he's 'come a long way.' <br /><br />And that he has folks!",
  "models": [
    {
      "name": "Brock MB",
      "person_id": 35256
    },
    {
      "name": "Jimmy",
      "person_id": 35295
    }
  ],
  "release_date": "2012-09-19",
  "scene_id": 70595,
  "series": "Covert Missions 16",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Duo",
    "Gay",
    "Muscular",
    "Smooth",
    "War Chest"
  ],
  "title": "Brock & Jimmy"
}