{
  "collections": [
    "Active Duty"
  ],
  "description": "20-year old Marty is a shorty, standing 5' tall and weighing in at 120 lbs. In our first scene with Marty, we find out that he actually shot a solo for Mike previously -- but wouldn't let Mike film it. (So basically, Mike, you're saying you got a private show? You sly dog.) Mike tells us, from behind the camera, that Marty has worked up the courage to come in and let Mike film him. And not only that: film him in a duo scene with Mike's own little super star Bryce.Mike lets the guys get comfortable and they start jerking under the white sheet of the bed. Soon, the dicks are unveiled and away we go! Mike asks if Marty would let Bryce jack him and he says yes. The look on Bryce's face is amusing, since he's an old pro by now and this it just par for the course for him. He reaches over and start slowly workingMarty reaches over to cop a feel of Bryce's log of a dick and soon enough, Bryce starts to sucking on Marty. After a minute or so, Mike asks Marty if he could do the same to Bryce, and he says he'll give it a try. He grabs Bryce's dick, saying 'It's huge' and tentatively licks the head. He's hesitant at first, but eventually really gets into it, seemingly lost in the moment. We see his dick react as it bobs into the air, still stiff as a board.Something fascinating happens next: Bryce pushes Marty over, back to his side of the bed, and slides up to try to kiss him. Marty resists at first, turning his head away. Bryce places a hand on the side of Marty's face, bringing him closer. Bryce goes in for a kiss, not letting Marty get away, and Marty responds -- kissing him back. There's something unique happening here -- though it remains unsaid. A few minutes later, after they've traded some more oral action, the kisses start once more. And this time, there is no resistance on Marty's part. I think Mike made a love connection with these two -- or at least a lust connection. Soon enough, Bryce is jerking Marty to completion, and then Marty takes over and sucks Bryce's enormous cock until he shoots all over Marty's face.",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Marty",
      "person_id": 35307
    }
  ],
  "release_date": "2012-09-23",
  "scene_id": 70596,
  "tags": [
    "Big Dick",
    "Blowjob",
    "Duo",
    "Gay",
    "Twink"
  ],
  "title": "Bryce & Marty"
}