{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm just crazy about Marty -- he's the perfect cute little package. And I just love watching him get fucked. lol. And lucky for me -- and you -- that's what you'll see in  his scene with Grant!As our scene starts up, Mike says how the guys met earlier the same day and had some lunch. Of course, as with likely all lunches at Mike's house, any invitees usually end up naked in a bed by the end of the afternoon. Mike excuses himself from the room to let the guys see what comes up. They're already jerking their dicks under the white sheet -- and you can clearly see Grant's cock head poking up against the sheet. After a minute or so, the guys move closer together and start jerking one another's dicks. You like that?' Grant asks. 'Feels good,' Marty answers, between sighs. I can't tell if Grant is even watching any porno off camera -- and if he is, I can't hear it. Marty certainly isn't paying attention to anything except Grant's body and big ol' dick, that's for sure.'You wanna suck that dick?' Grant asks Marty, and the latter answers by immediately engulfing Grant's rod into his mouth. 'Suck that cock,' Grant tells Marty, 'Fuck yes. Fuckin' deep. Suck that dick! You like that dick?' Marty's raging hard-on answers for us, but he also says 'tastes good!' in between deep-throat attempts.Marty looks to be in heaven, licking up and down Grant's stiff cock -- making sure to lick his balls (just like he asks).Before you know it, out comes the lube and Grant is greasing up his dick. Marty gets himself ready too, while Grant asks 'You ready?' Marty grunts out 'yeah,' and straddles Grant's big one, facing him. And wow. Marty impales himself on Grant's raw dick and it's just crazy hot. Marty lets out a 'damn!' as he settles into a rhythm, trying to take in all of Grant's dick.The guys switch around so that Marty's face is shoved into the pillow and his ass is up in the air. 'Gimme that dick!' he tells Grant, who is giving it as good as possible, while throwing pillows out of the way. Marty lets out a 'Damn!' as we see Grant grasp the top of the headboard, using it as leverage as he pounds away at an increasingly turned-on Marty.Grant goes full-on jack rabbit on Marty, long-stroking him as Marty sails into another sphere of enjoyment. 'Gimme that dick,' Marty says as he's shoved further and further into the headboard, 'Fuuuck.'Grant can't take much more, so he pulls out and shoots his load all over Marty's pretty white butt cheeks. But wait, there's more: He slaps his spent dick around Marty's ass and then shoves it back IN to his hole. Marty is still hard as a rock, never once losing his erection while being fucked. So he turns over onto his back, letting Grant jerk him off to completion. The guys are so exhausted after shooting the scene, they can barely form sentences when Mike asks them how it went. But it's clear by their responses: They had a good time.",
  "models": [
    {
      "name": "Jimmy",
      "person_id": 35295
    },
    {
      "name": "Grant II",
      "person_id": 35308
    }
  ],
  "release_date": "2012-10-28",
  "scene_id": 70608,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay"
  ],
  "title": "Grant & Marty"
}