{
  "collections": [
    "Active Duty"
  ],
  "description": "You've seen the adorable Boyd here on the site before, but tonight we're posting a scene that had been tucked away in my personal stash for a long while. Boyd was introduced to you in a solo scene almost a year ago (back in November of 2011) and we quickly put him to work doing hard core. He went on to do five scenes with us, including a three way with Axl and Chaz (where Boyd topped Axl) and a duo with Kaden where he bottomed for the first time.As I've said before, the War Chest Update was originally meant for 'found' footage -- stuff that I didn't realize I had stashed away. Or, scenes that simply were meant to be posted and then I got distracted. So, tonight's update with Boyd is pretty much the definition of the War Chest.Tonight's scene with Boyd was one of the first, if not the first, scenes I shot with him. Now, I'm warning you up front -- the audio on tonight's scene isn't the greatest. There's a constant hum that you hear through it -- we had a fan blowing in the room and the constant whirr is a bit annoying. BUT! Boyd's beauty makes you forget all about whatever white noise is going on.Rewatching it now takes me back. Dang, Boyd is just gorgeous. Those nipples! They're the size of saucers. And those eyes -- they cut through you like a knife. Have I mentioned his pecs of death and his abs that can grate cheese? Boyd's a 6' gent, weighing in at 160 lbs. with buzzed blond hair. Lord, every inch of his smooth body is sexy.Boyd puts on a lovely show for us here, and I made sure to get in nice and close to the action, if you know what I mean. Enjoy our little visit with a 'lost' scene with Boyd, and make sure to check out his other scenes on the site to get to know him better.",
  "models": [
    {
      "name": "Boyd",
      "person_id": 35248
    }
  ],
  "release_date": "2012-10-10",
  "scene_id": 70602,
  "series": "Force Rendezvous 2",
  "tags": [
    "Blonde",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "War Chest",
    "White Butt"
  ],
  "title": "Boyd"
}