{
  "collections": [
    "Active Duty"
  ],
  "description": "Marty's already on the bed, jerking his dick as our scene opens. Director Mike asks if he's alright and if he needs anything, but Marty says he's cool. (Maybe because he knows what's in store?)We hear Mike whispering something off camera, but we can't make it out. We figure that he's conspiring with Bruce to get him into the action. And sure enough, Mike soon tells Marty that he's got Bruce here and he's 'gonna try to talk him into doing something . . . ' As soon as he says that, Bruce cuts in, 'I told you I ain't gonna do that.' Oh really? 'Why don't you just try it for a little bit?' Mike asks. 'Uh . . . I don't get on that,' Bruce replies. 'It ain't bad, is it Marty?' Mike says, clearly hoping a little encouragement from him will help his cause. 'Nah, it's not that bad,' Marty says as he continues to stroke his dick.'Why don't you give it a try,' Mike says to Bruce, again. 'Nah,' Bruce says, 'Sorry man.' Mike sweetens the deal: 'What if I turned off the camera? Would you do it then?' Well now, this is getting interesting. 'Yeah . . . I'll try it,' Bruce says. Jackpot! 'I'll turn the camera off,' Mike says.'Ok, it's off,' Mike tells Bruce. 'Are you sure?' Bruce asks. 'Yeah,' Mike assures him. (Of course, the camera is still on and getting all of this, obviously.)And in comes Bruce in his tight-fitting blue jeans, who saddles up next to Marty. He grabs on to Marty's dick and takes a lick of his dick, quickly making a face and grimacing. He licks around on his head a little bit, taking some of it into his mouth, trying to get used to the feeling of having a dick between his lips. We hear little choking sounds coming from Bruce's mouth, which is funny, since he's barely taking more than an inch or two of Marty's cock into his mouth.'It's not bad is it Bruce?' Mike asks. 'Not that bad,' Bruce answers as he bobs up and down on Marty's dick. Mike then says, 'Can I turn it back on?' (meaning the camera), and Bruce nods, 'Yeah.' Bruce picks up the pace a little bit as Marty places his hand behind Bruce's head to guide him down. Mike tells Bruce to lick Marty's balls and then asks him to see how much of Marty he can take. And well, Bruce takes almost all of Marty's dick down his throat, only choking a little bit. What a trooper! Ever crafty, Mike tells Bruce he wants him to take some lube and work it onto his fingers and then finger Marty's ass. Bruce immediately agrees and goes at it. He starts with one digit and then after Mike tells him, he puts two fingers in. Things move fast at Casa Mike, that's for sure! Mike interrupts: 'What do you think about fucking Marty tomorrow?' And Bruce says, 'Yeah, I could do that.' Nothing like going from Zero to 60 in the span of one scene, right? Well, we look forward to seeing Bruce's explorations in the coming days and weeks . . . but until then . . . he has a cock to finish sucking!Hilariously, after some more head-bobbing action, Bruce turns to the camera and asks, 'Is that enough? My jaw hurts.' And you know what, we believe him! Mike tells him that he's done a good job and it's enough (for now, mwah ha ha). Bruce slips off the bed and lets Marty finish himself off. (Wait until you hear Mike and Bruce talk about getting a dick up his ass . . . You'll have to listen to find out what he says!)",
  "models": [
    {
      "name": "Bruce",
      "person_id": 35312
    },
    {
      "name": "Marty",
      "person_id": 35307
    }
  ],
  "release_date": "2012-10-31",
  "scene_id": 70609,
  "series": "Covert Missions 19",
  "tags": [
    "Blowjob",
    "Brunette",
    "First Time",
    "Gay",
    "Smooth",
    "War Chest"
  ],
  "title": "Bruce & Marty"
}