{
  "collections": [
    "Active Duty"
  ],
  "description": "As we open today's scene with big Jake and and cutie-pie Sawyer, I ask Sawyer where he's been. 'Around,' he says with a smile, 'doing my own thing. . . ' I tell him, 'Well, we finally got you 'around' here. And we got a BIG surprise for you today.' Sawyer responds, 'Is that right? That's what I been hearing.''Big,' I repeat, adding, 'I don't know if you're gonna have that smile on your face in a few minutes. But let it last while it can.' We all get a good chuckle out of this because I know -- and you at home know -- that Jake is packing major heat in his shorts. Of course, Sawyer has yet to see the log o' dick in Jake's pants -- but he will soon enough.'And you Mr. Jake,' I turn the camera to focus on the big strapping hunk of a man, 'You are no longer in Marine Corps.' 'Nope, not anymore,' Jake says. 'Are you happy?' I ask. 'Very. Very very happy,' Jake answers. 'We're happy for you,' I tell him. And aren't we? Now we get to see more and more of him and play matchmaker with him and our roster of AD fellas.After a little bit more joking about how Sawyer has messed around with guys before -- though he's never worked with a dick this big -- I step out of the room to let the guys get to know one another a bit better. Jake cuts to the chase and says, 'So you any good at sucking dick?' 'Ehh. . . I'm ok?' Sawyer responds. 'I'm getting around . . . learning the tricks of the trade.' 'You wanna show me what you got?' Jake asks, with an evil smile plastered across his face. 'Uh. . . yeah, let's see it,' Sawyer answers.Jake slips off his pants and boxers, revealing his soft dick. 'It's small right now, but trust me, it'll grow.' Sawyer chuckles, 'I . . . imagine.' Sawyer leans down and begins to kiss Jake's rock hard abs, exploring his solid chest with his lips. He sucks and jerks on Jake's dick, bringing it slowly to life. For himself, Jake is just enjoying the moment with his hands clasped behind his head, reclining. After a couple minutes of sucking, we can see Jake's dick getting thicker and thicker and Sawyer seemingly struggling to keep up with its ever-growing size. Amusingly, we see Jake watching Sawyer, smiling, clearly knowing Sawyer's mouth is getting awfully full of his cock. lol. 'You're right,' Sawyer says as he gasps for air and comes off Jake's dick, 'It does get big.' The size doesn't deter Sawyer, as he goes back down, continually stroking Jake's sausage-size meat. After licking it up and down, Sawyer pauses for a moment. And it's then when we see that basically, Jake's dick is as long as Sawyer's face is tall. Wow.Jake helps Sawyer slide out of his shorts and we're graced with the ever-gorgeous presence of Sawyer's perfect ass. 'So?' Sawyer says, looking up to Jake for approval on his dick-sucking skills. 'Not bad! Not bad at all,' Jake answers. 'You're not so bad yourself. That's a big, big dick,' Sawyer responds. Call me crazy, but it's so sexy to see Sawyer licking up and down Jake's dick, while Sawyer himself is hard -- and grinding into the bed. Hot damn. Clearly, jake is intrigued by this too, as he reaches over and starts milking Sawyer's dick while Sawyer keeps on sucking. Jake spits into his hand to give himself more lube and goes back to work, concentrating on Sawyer's cock head. Hand me a fan. 'Your turn to return the favor?' Sawyer asks Jake. 'Yeah,' Jake says. Sawyer flips around to lay on his back and Jake gets between his legs. Sawyer jokes about his dick: 'It looks like a toothpick compared. . . ' (And to Sawyer, we say: Shut up. Your dick is beautiful and definitely NOT a toothpick.) Sawyer plays with his nipples while Jake goes to town, sucking and jerking Sawyer. Jake knows what he's doing, and Sawyer is enjoying his skills. A few minutes go by and Jake changes things up, standing up on top of the bed with Sawyer standing on the floor sucking him off. We get some awesome under-Sawyer shots, where we can see both Sawyer's stiff dick bobbing in the wind as he blows Jake. Gorgeous. Next up: It's time for the fucking! 'Sure you can handle it?' as Jake teases Sawyer's ass with his dick of death. 'We're gonna find out,' Sawyer answers.Jake starts to ease himself into Sawyer from behind and we immediately hear the latter muffle 'Oh my god' into a pillow. 'Oh my god . . . uh . . . uh! Uh . . . fuck! Slower, slower, slower! Oh my god.'After a minute, Sawyer gets (slightly) used to Jake being in him, and breathlessly says 'Oh my god,' in between thrusts, 'You're dick is so huge. Oh my god, you're taking my ass.''I'm gonna have a hard time walking after this,' Sawyer jokes, 'but it feels so good though.' I make sure we get lots of close-ups of Sawyer's pained face as he squirms through the fucking. The guys change positions, so that Sawyer's on his back -- and so we get a much clearer shot of Jake's dick diving into him. Sawyer grabs onto Jake's biceps for support while his feet twitch in the air. 'I've never had so much pain and pleasure at the same time' he tells Jake. We're working up to the end now, and Jake has pressed Sawyer's legs back with his hands for easier access, while Sawyer is jerking his own hard dick. 'Holy fuck,' Sawyer says to Jake as the latter continues to plow on into Sawyer's tight hole. Sawyer's cries and gasps are getting more urgent now and he straight-up loses it when Jake starts to POUND his hole. The bed is shaking and Jake's going a mile a minute. Sawyer may have been sighing 'oh my god' earlier, but now Sawyer is yelling out, with no pretense, 'OH MY GOD.'Jake pulls out and starts shooting all over Sawyer's ass and soon enough, it's Sawyer's turn to let off his load. He's a mess of shaking and shivering as he blows his cum into the air and onto his torso. Whew! The boys kiss to close out the scene and that's a wrap!",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Sawyer",
      "person_id": 35300
    }
  ],
  "release_date": "2012-10-14",
  "scene_id": 70603,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "Smooth",
    "Tattoos",
    "Twink",
    "White Butt"
  ],
  "title": "Jake & Sawyer"
}