{
  "collections": [
    "Active Duty"
  ],
  "description": "After Mike finishes up the introductory chit-chat, the guys get to talkin' on the bed -- already naked under a sheet. The guys are watching some straight porn on the TV while jerking off. A smiling Grant asks Jimmy, 'So did you like my trouser snake?' Jimmy says, 'It's pretty big!' And then out pops both of their dicks as they wank to the cooing and moaning girl on the porn.Jimmy takes matters into his own hands as he grabs Grant's big one and starts to go to work, stroking. Off-camera, Mike jokes about how Grant is going to be only the third guy to fuck Jimmy. Grant laughs a little, 'That's three more than me!' Caught up in a trance while watching the porn, Grant mutters to Jimmy, 'Suck that dick.' Jimmy smiles and goes down on him and Grant gets aggressive: 'Suck that fuckin' dick! Fuck yes. You like that dick?' All Jimmy can do is mumble a 'mmhmm' as he sucks on Grant's thick cock.After some feisty ordering by Grant for a few minutes, where Jimmy tries to go as deep as he can on Grant's dick (and makes sure he follows orders and sucks his balls good), things move on to the next round: Fucking.Jimmy lubes himself up -- and Grant too -- and delicately sits on top of Grant's massive bare dick. Thanks to a lot of lube, Jimmy's able to get all of Grant in him -- but this position only lasts for a minute, as the guys quickly switch to something a bit more comfortable. Jimmy clips around to lay down on the bed and Grant gets behind him, slipping in and going to town. He wastes no time in building up a fast rhythm, fucking Jimmy like a little jack rabbit.At one point Mike has to come over to Jimmy and urge him to slow down so he can see his dick go in and out. Mike has the guys switch positions again so that Jimmy's on his back and Grant's standing off the edge of the bed. Jimmy holds his legs back, hands behind his knees, so Grant can get easier access.The camerawork here reminds me of the olden days of AD, where it was just me with a couple lamps in a room and an old VHS recorder. This isn't perfect, but it's raw and real.And hell, by the looks of Grant's whopping boner the entire time through this scene, it's clear he (or at least his dick) like's Jimmy's ass a whole lot. Grant fucks Jimmy harder and harder, blurting out 'Take that dick! Take that cock!' as Jimmy grunts and pants with every forward thrust.Soon enough, Grant is shooting his load all over Jimmy's chest, and then quickly thereafter, Jimmy jerks his own load onto his body -- joining Grant's cum.",
  "models": [
    {
      "name": "Jimmy",
      "person_id": 35295
    },
    {
      "name": "Grant II",
      "person_id": 35308
    }
  ],
  "release_date": "2012-10-07",
  "scene_id": 70601,
  "series": "Covert Missions 14",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Smooth"
  ],
  "title": "Grant & Jimmy"
}