{
  "collections": [
    "Active Duty"
  ],
  "description": "Jake comes in to the bedroom as we open the scene, fresh from a work out. He greets Sebastian and suggest that they take a shower to get all squeaky clean (Jake's words, not mine! lol). The guys strip down and head on in to the shower to soap up and rinse off.Sebastian can't help but to get 'a little bit hard' in the shower (as he tells Jake) while they're scrubbing up. But it's not like he's the only one sporting wood -- Jake's growing by the second too. They guys go in for some kisses and as Jake works down Sebsatian's body, he arrives at -- surprise! -- Sebastian's stiff uncut dick. He gets down on his knees and goes to work. 'Fuck that feels good!' says Sebastian, as we see Jake's head bobbing up and down on his dick.It's Sebastian's turn to 'return the favor,' he says. As soon as he gets down in front of Jake's cock, he blurts out, 'that's a big dick!' Well . . . you probably would too. Have you seen Jake's dick o' death? After a bit of oral excitement, the guys towel off and head back to the bed.Jake dives down onto Sebastian's dick, and the latter jerks Jake with his right hand and enthusiastically tells him how good of a job he's doing with his mouth. The men get into a 69 position so they both have easy access to one another's dicks. They switch things up a bit, so that Jake is on his back and Sebastian is straddled along him -- above and on his knees. We in turn get some super close ups of Sebastian's smooth ass. He adjusts his body so Jake can get better access, all the better to prep him for what's about to happen. That is: The entrance of Jake's big dick. Jake fingers him a bit, but nothing will prepare Sebastian for what's next . . .Jake gets up behind Sebastian, who is on his hands and knees, and slowly works his way in with his big ol' cock. Slowly -- slowly -- Jake slips his dick in. Finally, when the whole thing locks into place, Sebastian exclaims: 'Holy shit!' and we can hear Jake muffle a giggle under his breath. 'God, you got a big dick!' Sebastian tells Jake. The latter laughs and says 'Almost don't know whether to take that as a compliment or a complaint! You got a nice little ass though, that's for sure.'The guys pump and thrust their way through three different positions, on and around the bed, as Jake gets closer and closer to orgasm. (Seeing Jake's firm, muscled ass pound Sebastian is a sight for sore eyes, let me tell you . . . )'You gonna cum for me?' Jake asks Sebastian. And cum he does -- while still being fucked by Jake. 'I'm coming! I'm coming!' and pow, out comes a high-sailing load all over his chest. Jake quickly follows, spraying a big batch of jizz all over Sebastian's torso.'I produce masses,' Jake jokes as he smiles straight into the camera.The guys grab a quick smooch and they call it a day.",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Sebastian",
      "person_id": 35297
    }
  ],
  "release_date": "2012-10-21",
  "scene_id": 70606,
  "series": "Ripped Recruits 3",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Duo",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Jake & Sebastian"
}