{
  "collections": [
    "Active Duty"
  ],
  "description": "'You nervous?' our director pal Mike asks the cowboy-hat wearin' Bruce, who immediately responds, 'No, not at all.' Well alright then!Bruce is a 23-year old country boy who hails from Arkansas. He's been in the Marines for three years now and he loves it. You'll be shocked to discover this, but Bruce likes to rodeo (see, the cowboy hat ain't for show!), ride, and does a 'little cloverleaf barrel racing.' (I had to look that one up, y'all. It's when you ride a horse in a cloverleaf design around barrels in an arena.)He also wrestles a little bit, 'from time to time.' Maybe we can get him wrestling with another cowboy and see who lassos who . . . Back in high school he played football and was good enough to get a college scholarship. But, the military was his calling -- it was always his 'dream,' he says. Mike does his usual song and dance of telling Bruce about how he knows why he's here today and how he's going to leave him be to get comfortable. Mike bails for a minute and Bruce goes from 0-60 in about five seconds flat.Out comes his dick and he's jerking hard and fast, going a mile a minute. This guy ain't wasting time. He shucks off his blue jeans down to his calves, leaving him with a cowboy hat and black T-shirt on. His cock has caught up with his brain and it's rock hard already. Off comes his shirt and hat, revealing smooth, lightly muscled chest -- but he quickly realizes (or perhaps Mike tells him from behind the camera) that he should put the hat back on. (As Joe Cocker sings, 'you can leave your hat on . . . ')Bruce's cock is so big, he can lay it across his thigh and it stretches across most of its width. Damn! He starts pinching his nipples while slapping his thick log of a dick around in the air. Bruce gets up onto his knees and faces the headboard, thrusting his dick into his hand and putting on a grindy little ass show for us. All the while, he keeps letting out little moans and sighs. Clearly, Bruce is having a good time -- and we're having a good time watching!Bruce builds and builds himself to an amazing orgasm, shooting a huge load up and down his chest, with splashes of it hitting his neck! You should see the size of his dick at the end of the size -- I swear it's grown another 25%.",
  "models": [
    {
      "name": "Bruce",
      "person_id": 35312
    }
  ],
  "release_date": "2012-10-24",
  "scene_id": 70607,
  "tags": [
    "Big Dick",
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Bruce"
}