{
  "collections": [
    "Active Duty"
  ],
  "description": "As we open the scene, Mike tells the guys -- really for our benefit -- that he got the guys naked and under the sheet as he didn't want to waste any time. Now, you saw these guys together before, where Bruce sucked his first cock -- Marty's. So, in our new scene tonight, Mike asks Bruce what he thought. He says once he got over the instinct of gagging, it was alright. (Straight men, go figure!) Marty, on the other hand, is all smiles, saying he 'was real good!' That's our boy Marty!<br /><br />Mike departs the room for a moment, to let the guys get going. A minute or so later, Bruce whips out his dick. And good god, the thing is enormous. 'You got a nice cock there Bruce,' Mike says. Bruce, the gentleman, says 'thank you.' Not to be outdone, Marty whips his own big gun out and guys start jerking side by side. Bruce quickly reaches over and starts jerking Marty, and Marty returns the favor. Bruce is loving it, and he lets us know by sighing and moaning. <br /><br />Marty leans over and goes down on Bruce's dick, and all the latter can do is moan, 'that's so good . . . oh yeah.' Mike switches positions so we can get a better angle to watch Marty slurp to his heart's content. Marty isn't just sucking on Bruce's dick, I think he's making love to it -- almost choking at one point. 'Oh, that's so good,' Bruce says, as Marty tries to take more and more into his throat.<br /><br />It's Marty's turn to get sucked, so Bruce leans over and starts going to work. 'Just like that,' Marty tells him, 'Suck that dick.' Bruce moans as he slurps on Marty's dick, all the while continuing to jack his own cock. 'Fuck!' Marty exclaims, as Bruce concentrates on Marty's head. The scene gets really hot when Marty starts face-fucking Bruce, holding on to the back of his head and guiding his dick in as his hip thrust into the air.<br /><br />After a spell, we fade into the guys just as they are getting started fucking. Marty's on his back, legs up in the air. Bruce is standing off the side of the bed, already thrusting into Marty. 'Damn!' is all Marty can say as Bruce shoves his big bareback dick into him. Bruce has so much dick, he can hold onto it with his fist and still get a whole bunch of it into Marty's ass. 'Ah yeah,' Bruce says, 'Tight asshole. You like that?' The camera pans to Marty's face and all he can do is look longingly into Bruce's face, clearly loving the experience and feelings.<br /><br />We pull out (the camera, that is) so we can get the full picture. Bruce is pistoning into Marty, plowing hard into him. The entire bed is shaking and it sounds like its going to fall apart. All Marty can do is blurt out 'Damn! Fuck!' as Bruce grabs onto Marty's thighs for support. Soon enough, we hear those magic words: 'I'm gonna cum!' Bruce pulls out and shoots his load over Marty's dick, spreading his cum over Marty's balls with the head of his dick. <br /><br />'You want me to get you off?' Bruce asks. 'Yeah,' Marty says. We cut back to Bruce going to town on Marty's dick, sucking him like mad. 'Alright!' Marty yelps out, and that's Bruce's cue to back off. He keeps jerking him furiously though, aiming Marty's dick as his cheek. Out comes Marty's load, streaming onto Bruce's cheek. Mike makes sure to get in real close . . . so we can see Bruce's cum-coated cheek. Whew! Mike wraps up with the guys, who are in good spirits, and they promise to come back and play again.",
  "models": [
    {
      "name": "Bruce",
      "person_id": 35312
    },
    {
      "name": "Marty",
      "person_id": 35307
    }
  ],
  "release_date": "2012-12-25",
  "scene_id": 70617,
  "series": "Bareback Base Camp 2",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Facial",
    "First Time",
    "Gay"
  ],
  "title": "Bruce & Marty (2)"
}