{
  "collections": [
    "Active Duty"
  ],
  "description": "Today's scene is so long, you may have to parse it out into two installments and savor the action over two different viewings! The 40 minute long (!) scene stars Hunter and Bailey, and the former (who we just introduced to you a few days ago) shows Bailey's ass a very good time. (And a very BIG time, at that. lol.)And another semi-surprise for you: Cole (yes, King Cole) directed and edited this scene. For all you fans out there, you'll probably be thrilled to hear his voice behind the camera, as he talks to the guys and guides us through the scene. All hail King Cole! We open with Bailey and Hunter sitting on the bed, shooting the breeze with Cole. The latter asks Hunter how many scenes he's done with Active Duty, and he says just his solo. Cole jokes, 'already, we're throwing you in the mix!' Cole follows my example, and steps out of the room for a bit to let Bailey and Hunter get to know one another.Bailey quizzes Hunter on if he's excited and ready for this. He says he is, but you can tell he's a little hesitant. Bailey asks if Hunter goes to the gym a lot and jokes with him that it's 'paying off.' Hunter smirks and flexes a little, but you can tell he's a bit nervous. The guys start talking about their first time having sex, and we find out that Bailey was 12 (with an older woman!) and that Hunter did the deed on a Mexican beach as a teenager. Bailey starts to feel Hunter's dick through his jeans. 'What's this you got here?' he asks.Hunter's answer: 'Really big and thick.' Well, alright then! I think we're off the races folks. Bailey chuckles and agrees, as he starts to unzip Hunter's jeans. Bailey is just gobsmacked at the thickness of Hunter's cock. And it's no wonder -- it just might be the thickest on any guy we've ever had on Active Duty. No joke!Hunter isn't shy about telling Bailey how to suck his dick either: 'Make sure to get around the head,' he says in that deep, deep voice. Bailey complies, still in awe at Hunter's size. After a spell, the guys switch around so that Hunter can have a taste of Bailey's dick. 'This is my first time doing this,' Hunter tells Bailey -- and we believe him. He's tentative, slowly learning how to best take a dick into his mouth. He says again, 'It's my first time.' And Bailey quickly says, 'Don't worry, you're doing just fine.' Cole interjects, telling Bailey, 'Why don't you tell him how to do it.' So Bailey does . . . and he just can't believe it's Hunter's first time having a dick in his mouth. Or maybe he's just amazed at his great fortune! lol.We move the guys around so that Bailey is on his hands and knees and Hunter is behind him, getting ready to start a'probin with his fingers. Hunter is quick to grab the lube and start working two fingers into his ass, much to Bailey's delight. Hunter is all business, saying he's trying to stretch Bailey out (to make room for his dick). 'Ready for three?' Hunter asks. You can hear Cole gasping behind the camera and Bailey hesitating . . . Too late! Three fingers in. Pow! 'You ready?,' Hunter says to Bailey, dick in hand. 'Ready as you'll ever be?' And in goes Hunter's massively thick meat into Bailey's ass. All the latter gent can do is shudder and say 'ooh fuck . . . ' as his body makes room for Hunter. 'Your leg's shakin' man,' Hunter tells Bailey. 'Yeah! It feels that good,' Bailey tells him. As we build closer to the finale, Cole gets the guys to move into a really interesting position, where Hunter is upside down on the ground, with Hunter spearing him from above. You can tell the guys are struggling a bit to get it going, but once they do, damn it's hot looking. (Cole knows from experience that this can be a good position -- he's done it himself for us before!)After the gymnastics routine of fucking, the guys switch back to some oral action for the big finale. Bailey is on his knees, servicing Hunter, making sure to get his tongue around the head. 'Yeah! Suck it bitch!' Hunter barks at Bailey. 'Like that big cock in there?!' Bailey can't answer, his mouth is full of cock. 'Come on, more spit,' Hunter tells him. He's in charge and he's making sure he gets to cum the way he wants. 'Gag on it! You wanna taste that cum?' And whoah . . . wait until you see his load. He has to apologize for Bailey for being so . . . voluminous. There's a storm front moving in, and it's called Hunter's cum shot. We'll let you see how Bailey finishes the scene (don't worry, he gets off too) and how he never ever wants to see a dick that thick again. lol. (But he had a good time, trust us!)",
  "models": [
    {
      "name": "Hunter II",
      "person_id": 35277
    },
    {
      "name": "Bailey",
      "person_id": 35304
    }
  ],
  "release_date": "2012-11-18",
  "scene_id": 70615,
  "series": "Geared Up",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "First Time",
    "Gay",
    "Muscular",
    "Smooth"
  ],
  "title": "Bailey & Hunter"
}