{
  "collections": [
    "Active Duty"
  ],
  "description": "So, tonight we've got something really special for you.  Not only is it a brand new hot country boy recruit but it's also the directorial debut of my boyfriend.  I haven't spilled the beans to you guys, but I've been deeply in love for the last seven months and it's been the happiest seven months of my life.  Anyway, it was decided early on that my new love would not become product here on the site.  He's too special to share on screen, but I decided to let him try his hand at directing some new recruits and I think after watching him direct Hunter you're gonna agree with me that he's a chip off the old block.  <br /><br />Just listening to him talk to Hunter as he directs the action tells you he's been paying close attention in the bedroom when I become vocal with him.  He jumps right in there and gets the best out of our latest find.  It helps that they have a lot in common being two corn fed country boys who like their trucks, boots and blue jeans.  They hit it off from the very start and I think my baby boy put Hunter right at ease.  Even the awkward beginnings are sexy as you listen to these two chat it up with one another.  By the time my little fellow gets comfortable behind the camera he's got Hunter with a finger up his ass exploring places he never dreamed he would.<br /><br />Things kick off with baby boy asking Hunter all the usual questions putting his own spin on things.  Hunter is from Texas, he enjoys going to the gym, BBQing and drinking with the boys.  Baby boy gets right down to business getting Hunter to stand up and take his shirt off right away.  Then things take an unusual turn as Baby boy asks Hunter straight away to turn around and show off his butt a little for us.  Then he gets Hunter's pants down and asks him to turn around and bend over the chair.  All the while Hunter is following his fledgling director's every instruction.  He even suggests some things himself.  Baby boy gets right in there as Hunter spreads his butt cheeks and spreads them open to give us a nice view of that perfect tight asshole.<br /><br />Baby boy gets Hunter up on the bed as he moves around exploring his nice body with the camera and complimenting Hunter all the while.  It doesn't take long for Hunter to work up that insanely thick cock to a nice solid hard on as baby boy moves in closer to the goods.  Hunter is sporting one of the thickest cocks I think we've ever featured here on Active Duty and baby boy is making sure to get us up close and personal.<br /><br />Baby boy is all about checking out Hunter's nice ass as he asks him to throw his legs up and spread his butt a little bit.  The zoom lens goes straight for the hole as Hunter complies with all baby boy's wishes.  From there, he drills him with questions about how he enjoys getting his cock sucked.  Hunter gives specific details and then baby boy asks if he enjoys getting his butt played with.  It's obvious that my baby is as much of an ass man as I am.  Hunter says he's never played with his ass before but it's on his 'to do' list.  Baby boy assures him that we will be sure and work that out.<br /><br />The sexy banter between these two was enough to make me cum just listening.  Baby boy keeps edging his way further and further with Hunter until he's got him on his hands and knees shoving his middle finger deep in his ass.  I think you'll agree that these two made a good team for both being first timers.  Hunter and baby boy agree that Hunter will do some practicing on his own playing with his ass.  Be back Sunday to see what happens next with our new man Hunter.",
  "models": [
    {
      "name": "Hunter II",
      "person_id": 35277
    }
  ],
  "release_date": "2012-11-14",
  "scene_id": 70613,
  "series": "Geared Up",
  "tags": [
    "Big Dick",
    "First Time",
    "Gay",
    "Jerk Off",
    "Muscular",
    "War Chest"
  ],
  "title": "Hunter"
}