{
  "collections": [
    "Active Duty"
  ],
  "description": "We were so excited about Marco -- and he was so excited to work with us -- that we fast-tracked him straight into a hard core scene. No messing about with an introductory solo from him. No sir! Tonight, little inked-up Marco meets up with fellow tattoo fan Jake and the sparks fly!As we open, Jake says to Marco, 'Decided to jump into all this business, huh?' Marco answers, never taking his eyes off the already shirtless Jake, 'Looks like it'd be a fun business.' And I think he means Jake is looking fun, if you know what I mean . . . 'I dunno, maybe I can toss you around a little bit,' Jake tells Marco with a sly smile, as Marco fondles Jake's torso.'You know how to suck a dick?' Jake asks Marco. 'Pretty well,' Marco answers. And we're off! Jake starts kissing Marco's chest and arms, quickly suggesting that they should slip their pants off. Jake then goes in for some more kisses -- and really, if you're a fan of watching the AD men make out, you'll love this scene. Jake kisses and nibbles along Marco's inner thigh before engulfing his slowly-hardening dick. 'I like it when you suck my head like that,' Marco tells him, 'feels so good - fuck!' After a minute or so, Marco says, 'Now let me suck your dick,' and the guys switch around so Jake is on his back.'Dirty little slut,' Jake says to Marco, who is going to town licking up and down Jake's dick. 'You like that?' Marco asks him, 'You've got such a big cock.' I must say, Marco is loving every moment of sucking Jake off. He's working the shaft with his hand, taking it as deep into his mouth and throat as possible. We give him an 'A' for enthusiasm!'Feels like you've done this a couple times before,' Jake says to Marco, who responds: 'Maybe once or twice . . . feel good?' 'Oh yeah,' Jake says.Marco pauses, and then kisses up Jake's chest and they go in for some serious make-out moments while Marco continues to jerk him off. This. Is. Hot. Jake grabs Marco by the shoulders and pushes him back onto the bed: 'My turn,' he says, and starts to suck on Marco some more. 'I love that - when you suck on my head,' Marco says, 'feels so good.' Soon, the guys change it up and get into a 69-position, with Marco on his back and Jake straddling him from above. Marco massages Jake's firm ass cheeks and Jake starts humping into Marco's mouth. He gets into a frenzied rhythm, fucking his mouth as Marco continues to hold his ass, ramming Jake's dick into his face. Marco goes to town, alternately rimming Jake and sucking his thick log. He's in heaven!Marco flips around so he's on his stomach, ass in the air. Jake starts to inspect his hole and cheeks, massaging and playing his butt, getting it ready to take his cock. 'Tight little butt hole,' Jake says to Marco, as he starts to slip a finger in. And then two. We can hear Marco breathing heavy, panting. 'You're making it feel so good,' Marco says to Jake. He responds: 'You ready for me to fuck that ass now?' We think so!Jake starts to slowly slide his thick dick in, and -- in a moment of *real* reality, Marco quickly says, 'Yeah, I can't do it. Yeah, it hurts too bad. Too tight.' Jake responds, 'I'm already in right now. I'm already in.' Marco: 'Dude, you gotta take it out.' So Jake does, and we cut out for a brief moment, and then Jake tries again. And this time, we have success!Jake starts building a steady rhythm, fucking Marco from behind while holding onto his cheeks for support. They're go so hard that the bed is rocking and rolling into the wall. They just might break the thing if they aren't careful. They move around so that Jake is laying down and Marco is siting on him, facing away. Marco starts bouncing away on Jake's dick. 'Feels amazing,' he tells Marco, who is rock hard as he's getting fucked. Marco leans back, so we know more of Jake is into him now, and we can tell Marco's feeling it. Marco keeps jerking his dick as Jake plows into him, 'I'm gonna cum!' Marco says, as he spews his load all over the bed. 'I think I'm about to cum,' Jake says, so Marco quickly spins around and gets his mouth over Jake's dick. 'You gonna give me that hot cum?' Marco says, 'Let me taste it.' Jake starts shooting and Marco's tongue is there to catch it. Marco starts sucking Jake's just-spent dick, getting all of the cum out. 'That tastes so good,' Marco tells Jake, 'You're too good. I love your cock.'We wrap up with the guys, with Marco asking Jake, 'You enjoy that?' Jake smiles, saying, 'I did. How was your first time?' Marco, as they start to kiss: 'It was amazing.'",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Marco",
      "person_id": 35314
    }
  ],
  "release_date": "2012-11-11",
  "scene_id": 70612,
  "series": "Geared Up 2",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Duo",
    "Gay",
    "Kissing",
    "Tattoos"
  ],
  "title": "Jake & Marco"
}