{
  "collections": [
    "Active Duty"
  ],
  "description": "For all you lovers of young twinky types . . . well, you've hit the jackpot tonight.<br /><br />Young, masculine Sean is a mere 19-years old (though we swear he could pass for a day over 18), stands 5'8' tall and weighs 140 pounds. He loves staying active and playing sports -- they are a 'huge' part of his life, he says. Back in high school he was a gymnast, in fact. '(I) can do flips,' he says, 'Bend my body in weird ways.' We'll have to see for ourselves just how bendy he can be, now won't we?<br /><br />I ask him why he wanted to try his hand at getting naked in front of the camera. 'Expand the horizons a little bit,' he says, 'It's a new thing . . . new experience.' I joke a bit about how since he's come to Southern California, it's been nothing be new things hitting him left and right. I say that certainly no porn producers ever approached him, as I did, back in Vermont. 'Never even heard of one!' he smiles and says to me.<br /><br />After some of our introductory conversation is out of way, I get him to stand up and take off his shirt, revealing a tone, smooth chest with nary a hair to be found. He slips off his jeans to expose his tight black boxer briefs with an obviously growing dick trapped beneath the fabric. I get him turned around so he can slip off his briefs while bending over nice and slow . . . and it's a lovely view.<br /><br />I joke with him about being nervous, and though he says he isn't, I can tell he sort of is. He cracks a smile and I tell him that I'm going to leave him to get comfortable. We fast-forward in time to when he's gotten nice and comfy with a nice and stiff cock in his hand. He's stroking hard and fast with his right hand, working over a larger-then-expected cock. <br /><br />After a spell, we get Sean bent over on the bed so we can get a closer look at his glorious rear-end. I have to say, the guy knows how to arch his back -- and you know how much I love saying that. <br /><br />You'll have to see how he closes out the scene . . . but I'll give you a hint: He produces a lip-licking, cum-spurting finish.",
  "models": [
    {
      "name": "Sean",
      "person_id": 35317
    }
  ],
  "release_date": "2012-11-28",
  "scene_id": 70618,
  "series": "Geared Up 3",
  "tags": [
    "Big Dick",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "Twink",
    "War Chest"
  ],
  "title": "Sean"
}