{
  "collections": [
    "Active Duty"
  ],
  "description": "As our scene opens, Grant is on our left and cutie-pie Bryce is on the right. Our director pal Mike -- who has clearly been working over time lately, right? -- says to the guys how they've agreed to 'do a side-by-side.' (Meaning: Jerk off next to one another.) Mike quickly adds, 'Maybe I could talk you into something?' Grant squints and says, 'We'll see' while Bryce just smiles that knowing smile. 'I'll leave you alone,' Mike says, and the guys start stroking their burgeoning wood through their jeans.Bryce has been one of Mike's greatest finds, I think, and I'm still dying to get him to come out here and film something behind *my* camera. You hear that Mike? lol. Don't worry, we'll go easy on him.After the the pair have pulled out the cocks, Mike says to Grant, 'Tell me something. What did you think about fucking Jimmy?' Grant says, 'It was different . . . I guess?' Mike says, 'Did you like it?' Grant answers, 'A little.' (Well, the guys *are* straight, so their answers are going to be a little . . . interesting.)Have we mentioned just how big Bryce's dick is? It's enormous and looks like a monster in this scene. Bryce goes to town jerking his thickness, as does Grant. Once the guys shuck their jeans they shimmy closer to one another on the bed, bodies lit quite beautifully in the light. (I'm trying to curb myself from gushing about Bryce, quite honestly, as I could ramble a bit about his glorious skin and how . . . wait, I caught myself!)The guys start to help one another out with a mutual hand job and Grant's sighs and moans tells us exactly how he feels about Bryce's digits rubbing up and down his dick. After a spell, Grant says to Bryce, 'You gonna suck that dick?' Bryce says 'Yeah,' and descends onto Grant's thick cock. 'Fuck yes,' Grant sighs, 'suck that dick.' Bryce licks and slurps on Grant's dick like a pro, pausing to lap at his balls. I'm thinking any number of Mike's recruits would be in good hands if they were paired with Bryce. Grant places his hand behind Bryce's head, helping guide (and push) him down onto his dick. (In the background, we hear Mike scurrying around, doors opening and a cell phone buzzing. It's Grand Central Station up in Mike's place, clearly!)After some oral loving from Bryce, Mike asks Grant if he wants to fuck Bryce. It doesn't take more than a second for him to respond in the affirmative and we're off! We immediately cut to Bryce on his stomach, face in the bed with Grant pounding into his ass. 'Take that dick!' Grant barks, pushing his bare dick deeper and deeper into Bryce's pretty butt. The guys flip around so Bryce is on his back, legs flung in the air, while Grant leans into him. 'Take that fucking cock!' Grant groans as he pistons in and out of the panting Bryce. Grant flips Bryce back onto his stomach and begins long-stroking him, leaning back for maximum thrust capability. Soon, Grant take any more, so he pulls out and shoots his load all over Bryce's ass cheeks, and then Grant immediately lays down next to Bryce -- completely exhausted.'Did you guys have fun?,' Mike asks. Bryce smiles and says 'Yeah,' while Grant is still lost in a post-orgasm daze. Though he can barely form sentences, Grant gives every indication he'll be back for more with Mike and his buddies.",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Grant II",
      "person_id": 35308
    }
  ],
  "release_date": "2012-11-04",
  "scene_id": 70610,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Twink"
  ],
  "title": "Bryce & Grant"
}