{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight we have a new find for you guys, and, it was directed by a secret guest director. (Ok, he's only 'secret' in that we haven't come up with a stage name for him, so forgive me.)<br /><br />More importantly, you get to meet our new recruit Grayson -- who I swear has the dark looks and bedroom eyes of Joe Jonas. (Not that I'm an expert on the Jonas Brothers, but doesn't he sorta resemble him?)<br /><br />Grayson is 23-years old, stands 5'11' tall and hails from Colorado. He weighs in at 160 lbs and sports a light dusting of hair on his chest and in other places that you'll be sure to enjoy. lol. He likes going out four wheeling -- and in a change from most of our models -- likes computer programming. Maybe we can get him to work for us here on the Web site! <br /><br />After a little chit-chat, we get him standing up so we can get a good look at his body. For those of you that like wife-beaters, you're in luck, as Grayson looks mighty fine in his. He peels it off slowly and eventually we get him down to nothing but his purple Diesel boxer briefs. Now comes the fun part!<br /><br />Our guest director tells Grayson that we have a video playing for him off-camera, so he can relax and enjoy himself and watch a little porno to help him out. Seems like Grayson doesn't need much help, as he immediately slips off his undies, throws them across the room, and reveals a rock hard dick. Well, alrighty then! Grayson lays down and starts to go to work on his dick, which I swear is swelling in size before my eyes -- both in thickness and in length. <br /><br />You can tell Grayson is a little nervous, as he occasionally throws a look to the camera of 'are you sure?' But soon enough, those nervous glances turn into smoldering stares and you'll be captivated by him too. Wait until you hit the 13:00 mark in the video. LAWD. Grayson squeezes out a bit dollop of precum from his dick onto his finger, and then licks it up. I need to lie down . . . <br /><br />BUT WAIT … Just wait until you see the very, very end of the video. Grayson can lick the top of his own dick. And he does so *after* he's cum. ",
  "models": [
    {
      "name": "Grayson",
      "person_id": 35316
    }
  ],
  "release_date": "2012-11-21",
  "scene_id": 70616,
  "series": "Battle of the Bulge",
  "tags": [
    "Brunette",
    "First Time",
    "Gay",
    "Solo",
    "War Chest"
  ],
  "title": "Grayson"
}