{
  "collections": [
    "Active Duty"
  ],
  "description": "We start off the scene very, very quiet. So quiet in fact, all you can hear is the rustling of the fabric as the guys start to work up their dicks through their shorts. Soon enough, after Diego has felt up Guy for a while, Diego tells him, 'Now it's getting hard.' Guy grins, looking down Diego's hand, 'Yeah, it's getting there.' 'You gonna help me out?' Diego asks, motioning towards his zipper. 'Yeah,' Guy says, 'let's see what you got over here,' as he reaches over and start feeling Diego's dick through the denim. Diego peels off his shirt, revealing his tatted-up body and tight abs. 'Let's get these pants off of you,' Guy says to Diego. Off come the jeans! Guy grabs on to Diego's stiff dick, saying, 'Look at that. Let me taste this,' and sinks his mouth around Diego's cock. The latter sighs and starts grinding his hips into Guy's sucking mouth and helpful hand. 'Does that feel good?' Guys asks. 'Fuck yeah!' Diego says, then jokes, 'Perfect amount of teeth!' LOL. Oh Diego -- always such a joker around here. And he's no different in this scene.Guy starts kissing up Diego's chest, saying in between kisses, 'I really like these tattoos,' and then going in for a lip-lock. After a minute, Guy pauses, and heads back down south, while Diego says, 'Yeah, get back down on that dick.'It's Diego's turn to suck, as Guy leans back on his back and let's Diego go to work. Diego is stiff as a board and looks to be quite happy with Guy's dick in his mouth. 'Does that dick taste good?' Guy asks, 'You like that?' Diego gets out some 'mmmhmmms' in between slurping on Guy's meaty cock. 'Let me see that ass,' Guy says, 'I'm ready to fuck.' Diego jumps up and turns around so he's on his knees, with his face and arms planted in the bed's pillows. Guy inspects Diego's ass, planting a few tender kisses on his cheeks while he massages them with his hands. After a little bit, Guy slips a finger into Diego's ass, asking him, 'Is that what you wanted?' Diego sighs, 'Oh yeah . . . 'Next thing you know, Guy is slowing spearing Diego from behind with his dick as Diego yells out 'Oh fuck!' Perhaps it's a bit larger than expected? 'You like that?' Guy asks, 'Aw, fuck yeah . . . it hurts . . . such a big dick,' Diego answers. Diego bounces back onto Guy's dick, holding on to the head board to maintain balance. Guy places a hand on Diego's ass cheek to help guide him back, while Diego himself keeps jerking his own dick from underneath. The guys go through a couple positions, ending with Diego on his back and Guy fucking him while standing off on the side of the bed. 'You feel so good,' Guy says to Diego, railing him hard. Soon enough, while Guy is fucking him, Diego shoots off a load, sailing globs of cum all over his chest. Guy keeps on fucking him all through his orgasm, and then Diego says, 'I want you to come for me.' Guy pulls out and starts shooting his own load onto Diego's tatted torso. 'That's a nice load,' Diego says to Guy, who then leans in and kisses Diego. And that's a wrap!",
  "models": [
    {
      "name": "Diego",
      "person_id": 35077
    },
    {
      "name": "Guy",
      "person_id": 35086
    }
  ],
  "release_date": "2012-12-02",
  "scene_id": 70619,
  "series": "Reenlisted",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Tattoos"
  ],
  "title": "Diego & Guy"
}