{
  "collections": [
    "Active Duty"
  ],
  "description": "I've got a great find you in tonight's War Chest update: big muscular Sergio, who has a 1,000-watt smile, body of death and a King Kong-sized dick. I introduce you to him in his first video for us, and I think you guys will like him a lot! Let me know what you think, as always.As we open our scene with him, find out that Sergio is 25-years old and hails from Pennsylvania. The shaved-headed gent is wearing a grey tank top that shows off his biceps for days. Sergio loves running, working out at the gym, going to the beach and swimming. You just might notice how his hobbies are doing wonders for his physique. Keep up the good work Sergio! After I've gone through a few questions, I have him stand up and take his shirt off. And wow, Sergio wasn't joking when he said he works out. I ask him how often he goes to the gym and he says 'a lot of time . . . just about (every day).' It shows.I get him to relax on the bed and he starts to go to work on his monster-sized dick. Seriously, some of our photos don't do it justice. The thing is big -- like 'two hands wrapped around it' big. We make sure to get in nice and close so that his cock practically takes over the screen. Sergio gets in some dirty talk, too, asking us, 'You like this big dick? Look how big it is. You want that inside you? That big dick?' Uhm, I think we know the answer!'There's so many things that I could do to you,' Sergio says, continually stroking his dick with that beaming smile of his.Now, I have to say, most of the guys that do solos for us don't talk dirty to the camera. Sometimes it works, sometimes it doesn't. (It only doesn't work if you don't believe what the guy is saying.) Well, with Sergio, it works. He knows how big his dick is and he makes sure we know too. He says more -- but I won't reveal what. You'll have to watch and find out. And oh lord, wait until you see him cum all over our big standing mirror. It's a gusher. The man just *paints* that mirror.",
  "models": [
    {
      "name": "Sergio",
      "person_id": 35313
    }
  ],
  "release_date": "2012-11-07",
  "scene_id": 70611,
  "tags": [
    "Big Dick",
    "Gay",
    "Muscular",
    "Solo",
    "War Chest"
  ],
  "title": "Sergio"
}