{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight brings us another new recruit from our main man, actor-turned-director Kaden Saylor. In the War Chest this evening is Troy, a man with a gleaming smile, smooth body, built chest and just gosh-darn pretty eyes. Troy stands 5'10' tall and weighs a muscular 205 lbs. He's got a natural build that's all farm-grown from physical labor. For his hobbies, Troy says he loves anything outdoors, including playing football and wrestling. Kaden jokes with Troy, saying 'I can picture you in one of those little singlets!' 'I actually got a pair of those back home,' Troy says. 'Really?!' Kaden quickly shoots back, adding, 'What color are they?' Oh, the wheels, they are a turning! 'Red,' Troy answers. This is where Kaden should have turned off the camera, had Troy go home and get the singlet and put it on for us. But you know, there's always next time! (I'm sending a note to Kaden right now . . . )Kaden excuses himself from the room to let Troy get comfortable, and the fine young gent does just that. He slips off his green plaid shirt and quickly gets down to his bare chest. And really, if this man doesn't work out in a gym, we need to find out his farming secrets. Off come the jeans and we're down to . . . oh look! Nothing! Troy grabs some of the lube from the nightstand and starts to earnestly go to work on his dick, jerking it awake. Soon, Kaden returns and we get in close with the camera, eyeing Troy's meaty thighs and heavenly pec muscles.Troy sits up on his knees, continuing to stroke with his left hand, getting his cock nice and hard -- and it's bigger than I expected! After a spell, Troy turns around so we can get a nice little ass show, complete with some firm slapping of his ass. (No, no, it's not Kaden doing the slapping -- though that would be fun. Troy slaps his own rear.) Troy pulls his cheeks apart so we can get a nice gander at his pink hole, as he lingers a finger up and down his crack, teasing his hole with a digit. He gets ever so close to slipping a finger into his ass, but alas . . . Wait until you see the 'oh fuck, I'm coming!' load Troy spurts out . . . Watch now and see for yourself!",
  "models": [
    {
      "name": "Troy",
      "person_id": 35320
    }
  ],
  "release_date": "2012-12-19",
  "scene_id": 70624,
  "series": "Battle of the Bulge",
  "tags": [
    "Brunette",
    "First Time",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Solo",
    "War Chest"
  ],
  "title": "Troy"
}