{
  "collections": [
    "Active Duty"
  ],
  "description": "It's the moment so many of you have been waiting for:<br /><br />Jake bottoms for the very first time today! <br /><br />Kaden directs this scene, and, as we open on the gents sitting side-by-side, he tells us that 'something new' is going to happen today. 'What is it?' he asks Sawyer, who says, 'A new experience . . . I think it's time for me to give him (Jake) pleasure instead of me receiving all the good times.' Jake laughs and says, 'I know a lot of people have been waiting for this to come out.'<br /><br />'Without a doubt,' Kaden says, 'I know we all are.'<br /><br />A little background first on Jake: He's been with us for a long while now and has shot 11 earlier hard core scenes for us. But, he's never bottomed before. Since he debuted on the site way back in December in 2009. Oh, he's fucked a lot of our guys, but somehow, we've never convinced him to have the tables turned on him until today. <br /><br />And, lucky for us, pairing him with Sawyer was a fun little stroke of genius. Why? Because this is only the first time Jake has worked with someone for a second time. (Maybe every other time the guys were scared off by the size of Jake's cock? Perhaps!)<br /><br />Back in the scene, Jake tells Kaden, 'I have to experience some of the pain I put people through.' See, he's a thoughtful one, that Jake. So, Kaden steps out and lets the guys catch up and chit-chat before they get down to business. <br /><br />After a minute or so, the shirts have come off and Sawyer starts exploring Jake's chest, gliding his hand over Jake's rippling abs. 'So this is your first time?' he asks Jake. 'It's my first time,' Jake responds. 'I'll go easy, don't worry about it,' a smiling Sawyer tells him. Down to their shorts, Sawyer goes in for a kiss of Jake's pecs and abdomen. And poof! There went Jake's underwear. Faster than you can say 'suck it,' Sawyer's lips are wrapped around Jake's growing dick. Jake's body responds in kind -- we see his toes curl and his head lean back in ecstasy. Yes, we think Sawyer's mouth is doing a fine job . . . <br /><br />After about five minutes or so, we hear Kaden come back in and we're off to the races in earnest. We get the camera to come in closer so we can hear Sawyer tell Jake that his dick is, 'so big, it's ridiculous.' Ain't that the truth brother? A few minutes go by, and Sawyer slides up Jake's body, and the guys start some light tongue-wrestling with their mouths. They're just so darned pretty when the make-out, I tell you what. <br /><br />'Now it's my time to get you out of those,' Jake tells Sawyer as he rolls him onto his back, and slides down Sawyer's grey boxers. Out pops Sawyer's stiff dick, which soon finds itself inside Jake's eager mouth. Sawyer is loving it and focuses his eyes on Jake's head between his thighs. A little bit later, the guys flip around again so Sawyer can suck on Jake some more.<br /><br />And now -- it's time to prepare for the fucking. Jake's up on his hands and knees, giving Sawyer access to his rear. Sawyer then lubes up a few fingers, working not just one but two fingers into his ass.<br /><br />'You like that?' Sawyer asks Jake, who responds: 'Definitely a different experience, that's for sure.'<br /><br />'You take it pretty good,' Sawyer says. 'How many fingers is that,' Jake wonders aloud. 'Two,' Sawyer answers, 'Wanna try for three?' as he repositions his fingers, clearly eager to work in a third digit. 'Oh no, not yet,' Jake laughs. 'Easy, easy.' <br /><br />And then a few seconds later, without telling him, boom, there goes Sawyer with three fingers. He's ready to pounce: 'You about ready to take this?' Sawyer says to Jake, as he rubs his dick up and down Jake's waiting ass hole. <br /><br />Sawyer slips his dick in, breaking Jake's seal, and all the latter can do is let out a 'OH! Ohhhh! . . . Fucker!' <br /><br />'That feel good?' Sawyer asks Jake, who can't manage a response, it seems, as he's likely concentrating on the pain. 'Your ass is so tight,' Sawyer continues, as the camera gets up close and personal.<br /><br />'Tell me how it feels,' Sawyer says. 'Damn it feels like there's a dick up my ass right now,' Jake jokes as he flings his head to one side, wincing. 'It feels good.' Sawyer slaps Jake's ass, and then grabs his own butt cheeks as he pushes his own body into Jake's.<br /><br />Jake is just a panting mess through this scene, as we see him grab onto the sheets, holding on tight as Sawyer puts him through his paces. Lucky Sawyer -- getting to take the cherry of one of our favorite Active Duty men. We get a really nice close up mid-way through the fucking of Sawyer thrusting in and out -- and look at that: Jake's nice and hard dick is sticking out between his legs. Perhaps Jake's body is telling us something . . . <br /><br />We get the guys to move around so Jake is on his back with his legs up over Sawyer's shoulders. Wow, what a sight it is from the rear -- as Sawyer's ass is just to die for. It's one of the prettiest we've ever seen. And, to see is doing the ol' in-out-in-out on Jake, well, it's just awesome.<br /><br />And just you wait until you see the guys shoot their loads. Sawyer's is so big it hits Jake's face! Jake can't help but to crack up. It's a great moment of levity -- and we love it when our guys have that kind of rapport with one another. Sawyer asks Jake how it went for him, and he says: 'Not bad . . . have to say, one-of-a-kind for sure. Now I'm all messy!' <br /><br />We cut to a post-coital moment, when Kaden quizzes Jake how it went, and he responds: 'Extravagant.' Kaden laughs at his choice of words, 'Very sophisticated for porn, I'll tell you that much!' The three of them get a good chuckle out of that. Sawyer agrees that it was a fun time and a good experience. So does this mean we'll see Jake on the receiving end again in the future? Time will tell . . . ",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Sawyer",
      "person_id": 35300
    }
  ],
  "release_date": "2012-12-09",
  "scene_id": 70621,
  "series": "Kaden's Recruits 5",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "First Time",
    "Gay",
    "Tattoos",
    "White Butt"
  ],
  "title": "Jake & Sawyer 2"
}