{
  "collections": [
    "Active Duty"
  ],
  "description": "'So how long you say you been doing this?' Ryan asks Bryce as Mike rummages through what sounds like a trunk full of junk off camera.<br /><br />'Uh,' Bryce pauses for a moment to think, 'couple years?' The guys talk about how long Ryan has been in the military (four years, it turns out) and then Ryan laughs, 'Well, after a couple years, you should be pretty good.' Bryce laughs, 'Yeah!' Then Ryan quickly adds, 'We'll see.' Mike then adds from off camera, 'I promise it won't hurt.'<br /><br />The guys are getting comfortable, watching some porn and stroking their dicks through their pants. I wonder if Bryce knows, at this point, just how much meat Ryan is packing? Hmm. . . Bryce unbuttons his jeans, slips a hand in, and places his other hand behind his head -- getting nice and comfortable. Ryan pulls out his dick while Bryce continues to stroke his through his undies. Bryce continues to steal glances at Ryan's dick, checking out its size, while he keeps working his own monster cock. (Y'all have seen Bryce's Dick Of Death before, right?)<br /><br />After a little bit -- when the guys have completely stripped down to nothing but hard dicks -- Mike asks, 'You ready Ryan?' He jokes, looking down at his dick, 'I think he is.' Bryce leans a hand over and starts to stroke Ryan and the latter sorta zones out, letting the experience wash over him. Bryce then goes down with his mouth and starts to lick and suck at Ryan's cock. <br /><br />'How's he doing Ryan?' Mike asks. Ryan smiles, while he looks down at Bryce's head, and says, 'Doing pretty good.'<br /><br />'Oh yeah,' Ryan reacts to Bryce's jacking of his dick. 'Suck it,' he tells him. And down Bryce goes again -- taking as much into his throat as he can. Bryce slips down and tentatively licks Ryan's balls. 'Put 'em in your mouth,' Ryan tells him. And Bryce obliges, sucking them into his warm, waiting mouth.<br /><br />Ryan's getting more comfortable with the experience, it seems -- he takes a hand and puts it on Bryce's head, guiding his bobbing noggin' up and down his cock. He lets off after a minute, telling Bryce to 'jack it.' Ryan's got an interesting way of jerking his dick, as he explains to Bryce, <br /><br />The guys switch around so they are side by side, with Bryce rubbing Ryan's balls while Ryan frenetically strokes his dick. Ryan's getting closer and closer -- and we can hear his dog tags jangling on his chest. 'Oh fuck, oh fuck,' Ryan says, getting closer to shooting his load. And wham, out it comes, spurting thick streams onto his shaft, balls and thigh. 'Fuck!' <br /><br />Bryce isn't done yet, so Mike suggests to Ryan, 'Wanna help him out?' Ryan reaches over and starts stroking Bryce's skyscraper of a dick. Bryce grunts and groans in appreciation, 'oh fuck!' It isn't long before Bryce starts to slowly buck his hips into the air. He then reaches over with a free hand to stroke one of Ryan's pec muscles and play a little with his nipple. 'Oh shit! I'm about to cum,' Bryce says, 'oh fuck! I'm about to cum. Oh shit . . . fuck . . . I'm coming.' And out flings his load -- all the while Ryan is jerking him. Now that's something! It's sometimes hard for another man to jerk you off to completion -- and Ryan was able to do it for Bryce!<br />",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 35051
    },
    {
      "name": "Ryan II",
      "person_id": 35321
    }
  ],
  "release_date": "2012-12-23",
  "scene_id": 70626,
  "series": "Bareback Base Camp 2",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Smooth"
  ],
  "title": "Bryce & Ryan"
}