{
  "collections": [
    "Active Duty"
  ],
  "description": "Jake and Tanner are back - together! And Jake's bottoming for only the second time! Even better, Kaden is directing these scene. So, basically, it's pros directed by a pro.<br /><br />Kaden asks the guys, who are seated on the bed together as our scene starts, what they are going to do today. Tanner says, 'the last time we got together, it was a little painful,' gesturing to himself. <br /><br />'It was painful for you, huh?' Kaden says, ''Cause that's a big-ass dick,' meaning Jake's. (Who is nothing but all smiles as Kaden says this, of course.) 'So,' Jake continues, 'What's gonna happen is . . . he's gonna have to get fucked.' <br /><br />'Revenge fuck time,' Kaden jokes, 'is that what it is?' <br /><br />'Oh yeah!' Tanner hits back. 'Time to get your revenge,' Kaden says, egging him on. <br /><br />'He ain't gonna be walkin' right,' Tanner says, pointing at Jake, who says under his breath 'Oh jeez. . . ,' quickly followed by 'karma's a bitch.'<br /><br />'Well you did almost make me cum out of my mind the last time, so . . .' Tanner says, 'there's a lot of built up karma.'<br /><br />And now it's time for Karma Payback to begin! Kaden steps out of the room to let the guys catch up a bit -- after all, it's been about five months since they last saw one another. They shoot the breeze about how the holidays are coming up, but quickly turn to Jake's first time bottoming a few weeks ago. Tanner asks how it went, and Jake says there was a lot teeth-gritting and 'trying to enjoy it.' lol.<br /><br />After their shirts come off, Tanner and Jake make some pointed comments about the off-camera porno that's playing. Evidently, they've seen it once or twice before. Ok guys, we get it. We need to buy you some new porn.<br /><br />'Let me take care of you for a little bit,' Jake says to Tanner, who slips off his shorts and underwear. While sucking Tanner, Jake slides off his own shorts in a very deft move, and Jake takes note: 'That was talented.' Jake agrees, saying 'Mmmhmmm' while sucking down Tanner's dick. After a bit, the guys switch around so Jake can have a turn at getting blow. As he dips down towards Jake's dick, Tanner says, 'smells like cinnamon.' Well, that's a new one. Tanner gets down there and starts working on Jake, joking with him by asking, 'Is there a reason your dick smells like cinnamon?' Jake doesn't have an answer, so Tanner keeps working on Jake's cinnamon stick. (Zing!)<br /><br />Tanner pauses for a second to kiss Jake's chest, asking him, 'How was that?' Jake says, sighing, 'It was amazing.' Tanner hits back, 'It's going to be even more amazing when I fuck your ass.' lol! I love our guys and their sense of humor.<br /><br />Soon enough, it's time for the fucking to begin. Jake gets down on his elbows and knees, showing off his ass to Tanner. 'Think you had what . . . Sawyer loosen it up for you a little?' Tanner asks Jake. 'Oh yeah, just a little.' <br /><br />'I'm gonna enjoy tearing that ass up,' Tanner says as his finger explore Jake's hole and butt cheeks, slapping his rear. A few minutes later, Tanner slowly slips in his big-headed dick and all Jake can do is grunt wildly into a pillow. Seriously, all I'm hearing is grunts and groans of pain and pleasure out of Jake. 'There we go!' Tanner says as he picks up the thrusting pace -- quickly. 'Payback time!' he says.<br /><br />We get the camera moved around to in front of Jake's face so we can capture his facial expressions as he's man handled. Between the grimaces and squinting and the exasperation . . . I think there's a glint of enjoyment. Tanner tells him to turn over so he can see the 'pain in his eyes' when he fucks him. Jake flips over onto his back to let Tanner have a go in a different position. It isn't long before Tanner starts to yell 'I think I'm gonna cum' and he starts shooting all over Jake's thighs and stomach. Probably 30 seconds later, Jake is jerking out his own load. He smears it onto his chest, panting after his sexual workout.<br /><br />'I'm so out of breath right now,' he tells Kaden as the guys relax on the bed. Tanner tells us that Jake's ass was so tight, 'It kinda hurt my dick.' And he's not joking!",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Tanner II",
      "person_id": 35290
    }
  ],
  "release_date": "2012-12-30",
  "scene_id": 70628,
  "series": "Ripped Recruits 3",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Duo",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Jake & Tanner II"
}