{
  "collections": [
    "Active Duty"
  ],
  "description": "Meaty. Veiny. Thick. Those are the three words that immediately come to mind when describing Davis' big honkin' dick. It's just thick as all get-out, veiny, and looks like it could do some serious damage to someone who wasn't ready for it.<br /><br />And guess who introduces us to Davis? Why, none other than our man Kaden Saylor, who directs this scene and mans the camera. See, here at Active Duty, our models are more than just models. As you've seen with Kaden and 'King' Cole, they go on to work behind the scenes for us and stay with our Active Duty family.<br /><br />Davis tells us that he's 21-years old, stands 6' tall and weighs 185 lbs. He's from Oklahoma and loves to hunt and fish. He also enjoys wrestling, and used to do that when he was back in high school. Kaden leaves the strapping, smooth gent alone to get comfortable, and we get to see him slip off his clothes. Off comes his T-shirt. Down goes his zipper. And there go his jeans.<br /><br />Davis has got a rocking body, with thick legs and a gorgeous, toned chest. He settles in to watch the off-camera porn, slowly working himself up through his plaid shorts. <br /><br />After a spell, Kaden gets Davis to flip over to show off his ass to the camera, and we get a nice little show. 'Give it a firm slap,' Kaden commands. And Davis listens. 'Spread it open,' Kaden tells him. And he does. We just love guys who follow orders!<br /><br />Wait until you see Davis' load. Wow. It's a gusher and it sprays all over his chest. 'That's good,' Davis <br /><br />'So, Davis, wow . . . you had a big ass load!,' Kaden jokes, 'How long you been holding that one?' 'Long enough!' Davis says, joking. He adds, 'It was fun! A lot easier than I thought it was going to be . . . easiest work I've ever done!' ",
  "models": [
    {
      "name": "Davis",
      "person_id": 35318
    }
  ],
  "release_date": "2012-12-05",
  "scene_id": 70620,
  "series": "Kaden's Recruits 5",
  "tags": [
    "Big Dick",
    "Blonde",
    "First Time",
    "Gay",
    "Jerk Off",
    "Smooth",
    "War Chest"
  ],
  "title": "Davis"
}