{
  "collections": [
    "Active Duty"
  ],
  "description": "Our man Kaden has been a busy bee behind the camera lately. You've seen his work lately in a number of scenes that he's directed, and tonight he brings us yet another Kaden-directed duo!<br /><br />Hunter and Tanner team up for Hunter's only second-ever hard core scene. You remember last month when the tall, strapping Hunter met up with lil' ol' Bailey and fucked him? Well, now Hunter has teamed with our man Tanner -- an AD Pro if there ever was one -- and we're going to watch the sparks fly.<br /><br />'So I didn't read the memo,' Kaden jokes from behind the camera as our scene opens, 'what's supposed to go down here? Anybody know?' Tanner just smiles and shakes his head from side to side.  'Nobody knows, huh?' Kaden says. 'We're just gonna let it happen,' Tanner suggests. 'That's the best way to do it, right?' Kaden answers, 'Let the magic flow.'<br /><br />'Sound good to you, Hunter?' Kaden asks to so-far quiet gent. He just chuckles, and says, 'Sounds good.'<br /><br />Kaden cracks me up, telling the guys 'Come on y'all get a little closer, like you're about to have sex or something.' lol<br /><br />Tanner is a sweet talker, luring the shy Hunter out of his shell a bit. He asks him where he's from and what he likes to do in his spare time. They start talking about their various tattoos, too. Funny how ink can bring guys together -- almost without fail. <br /><br />Hunter slides out of his blue jeans and Tanner blurts out, 'You're a lot of man!,' grabbing his meaty thighs and gesturing to the camera: 'Look at all of this! This is all mine today.' <br /><br />The guys continue the small talk for a while, with Tanner taking the lead when it comes to the conversation. After a spell, Kaden returns and we get in close with the camera. And just in time, too! Tanner helps Hunter out of his red briefs, and blamo, Tanner reacts to Hunter's dick thusly: 'Would you look at that?!' He grabs on to it with his hand, jerking it to further life. 'You got a fucking massive cock,' Tanner tells Hunter. Seemingly non-plussed, Hunter says 'It's thick.' Tanner keeps on: 'I can barely get my mouth around that thing.' And he's not joking -- Hunter's dick is just *that* thick. Tanner goes to work on Hunter, trying his best to suck on the mammoth piece o' meat. <br /><br />Some time goes by, and Hunter tells Tanner, 'Uh . . . let me return that favor for ya.' The guys switch around so Tanner is on his back, giving Hunter access to his cock. The latter goes down on him, kissing and licking his dick. 'How's that?' Hunter asks. 'I feel like you're making love to it,' Tanner jokes. Hunter has only sucked dick once before, so he's still new to all of this. But, as Tanner points out, he's doing a pretty good job for being a newbie.<br /><br />After a little bit more of Tanner sucking Hunter, we get the guys arranged so that Tanner on his hands and knees with Hunter behind him -- inspecting the goods. 'Ready for me to fuck you in the ass?' Hunter asks/tells Tanner. 'Thought you'd never ask,' Tanner shoots back. And away we go!<br /><br />Hunter plows his thick dick into a panting Tanner, who is yelling muffled grunts into the pillow. 'Oh it's a big fuckin' dick!' Tanner barks out. 'You like it?!' Hunter retorts. 'Fast or slow,' he asks Tanner. 'Just like that,' Tanner responds. The boys keep up the pace with Hunter manning Tanner from behind, grabbing onto Tanner's firm ass cheeks to keep up the rhythm.<br /><br />Tanner gets flipped over onto the bed, so he's on his back. Hunter shoves his dick into him and it literally takes Tanner's breath away. We're feeling for the poor guy, who -- we doubt -- has ever had anything this thick up inside him. 'Aw, fuck!' Tanner groans. The guys keep up the pace with Hunter plowing Tanner good. Eventually, it's getting so good, Tanner's dick is rock hard and he's swinging his erection up towards Hunter's chest. Hot damn!<br /><br />Hunter quickly pulls out and flings off the condom. 'Oh my god,' he says, shooting all over Tanner's dick and balls. 'Shit . . . aw fuck . . . Jesus,' Tanner says, working out the last bits of cum from his cock.<br /><br />It's Tanner's turn next. 'Let me see that load!' Hunter tells him. And here it comes! Tanner's load is gooey -- coming out like sugar glaze that should be atop a Christmas cookie. (Hey, 'tis the season!) <br /><br />In the post-sex chat, Tanner jokes about just how painful it was to have Hunter's dick in his ass. (He compares it to having a dangerous weapon shoved in there -- you'll have to watch to find out which one.) Kaden asks Hunter if he'd ever consider bottoming, and, to our delight, he indicates that he's entertained the idea. 'Course, it would take -- he says -- an entire bottle of lube up his ass to make it happen. If that's all it takes . . . :)",
  "models": [
    {
      "name": "Hunter II",
      "person_id": 35277
    },
    {
      "name": "Tanner II",
      "person_id": 35290
    }
  ],
  "release_date": "2012-12-16",
  "scene_id": 70623,
  "series": "Kaden's Recruits 5",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "Muscular",
    "Smooth"
  ],
  "title": "Hunter & Tanner"
}