{
  "collections": [
    "Active Duty"
  ],
  "description": "'Man, I told you I'd get you this far,' Kaden tells Wade. 'You kept your word,' the deep-voiced Wade responds.<br /><br />And that's how we open our new War Chest scene tonight, where we are introduced to Kaden's new find, Wade. The youthful strawberry-blond gent stands 5'8' tall and weighs in at 160 lbs. He loves motorcycling in his spare time and back when he was in school he used to kick box.<br /><br />'I'm a man of my word, for sure,' Kaden says, and then asks Wade how he feels about the experience so far. 'Pretty exciting, actually . . . good experience so far . . . no complaints.'<br /><br />'We're here to see you make some magic,' Kaden says before stepping out to let Wade get more comfortable. After Kaden slips out of the room, Wade wastes no time slipping a hand into his jeans. He's already working up an erection while watching the off-camera porn. Moments later, Wade's tossing off his pants -- no underwear, mind you -- and he's off the races. <br /><br />Wade's got a smooth body with a good-sized dick on him. When Kaden returns we get up nice and close to Wade -- so close that we can hear nearly every sigh and breath he takes. 'Damn . . . shit,' Wade sighs as he breathes hard and stares at us directly in the camera. You kinda get the feeling he's working his dick over just for you -- you at home watching. 'You want this cock, don't you?,' Wade asks the camera. 'Fuck yeah. How much do you want this cock?'<br /><br />'You want this dick, don't you?' Wade says as he shakes his cock at the camera, which is nestled between his thighs, looking up at his face. Well, actually, yes Wade, yes, I think we do. (I know I've said it before, but sometimes dirty talk works. And sometimes it doesn't. And with Wade -- it works.)<br /><br />'I wanna fuck you really hard,' Wade says, 'Shoot my cum in your mouth. Make you swallow it all.' Lord hand me a fan. I need to lie down before I hit the ground. <br /><br />You'll have to see how the scene finishes, but I think you'll be glad you got to know Wade tonight!",
  "models": [
    {
      "name": "Wade II",
      "person_id": 35319
    }
  ],
  "release_date": "2012-12-12",
  "scene_id": 70622,
  "series": "Going Commando",
  "tags": [
    "First Time",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Wade II"
}