{
  "collections": [
    "Active Duty"
  ],
  "description": "A wrench is quickly thrown into the proceedings by director Kaden, who, despite starting off 'on script,' he quickly tosses it aside. So enamored is Kaden with Bailey's ass, it's not more than a minute into the scene before he tells Bailey to show it off. Axl is intrigued too, and he's quickly mounting (while clothed) Bailey's rear end. Axl says, 'Who wouldn't want to fuck that shit? Maybe we should take this off and see what his ass really looks like?''Wait, already?!' Kaden says. 'Why not?' Axl responds. 'Let's do it!' Kaden hits back. (Now, normally, this is where Kaden would bail from the room to let the guys get to know one another. But not today! Axl and Bailey don't need time for chit-chat.)Bailey loses his jeans, leaving his boxer-brief clad buns for Axl to inspect. Axl dives in, kissing and massaging Bailey's butt -- and slapping it for good measure. 'I see he's got a nice cock on him, too,' Axl says, motioning to the camera.Axl is in full control here and he's wasting to no time getting things moving along. He peels off his shirt and jeans, revealing red boxer briefs that have a visible erection in them. He smiles and tells Bailey, 'Why don't you take your shirt off?' So he does and then the guys quickly get tangled up in a passionate make-out session. Bailey kisses down Axl's torso, suddenly confronted with his cloth-covered dick. 'You wanna suck my cock?' Axl asks. 'Why yes, I do,' Bailey says. Out pops Axl's cock, which quickly finds its way into Bailey's eager mouth.Axl holds the camera so we can see his point of view, looking down at Bailey: 'You like that cock?' he asks Bailey. 'Yes, I do . . .' Bailey says. 'Say 'yes daddy',' Axl orders. 'Yes daddy,' Bailey says. But, Axl gives as good as he takes -- and so it isn't before long until Bailey is straddling Axl's chest and feeding him his dick. Axl's loving it -- sucking Bailey's dick and jerking his own cock at the same time.The guys get into an awesome 69 position, where poor Bailey ends up choking on Axl's dick so much -- drool starts dribbling out of his mouth. Axl ends up face-fucking Bailey to the point of him choking, barking 'Yeah, you take that shit!' Bailey doesn't seem to mind, considering he's lovingly holding on to Axl's thick thighs and kneading his firm butt cheeks.Then things get acrobatic, as Axl lifts up Bailey's torso, bringing Bailey's ass up to his face so he can rim him mid-air. Dang! But now we move on to the fucking -- which consumes nearly half of this 30 minute scene. Axl teases Bailey with his dick and fingers, 'Fuck that's such a tight asshole,' he says. 'Stop teasing me,' Bailey tells Axl, who laughs in response. Axl finally relents and lets Bailey have his dick -- slow at first, but then he swiftly picks up the pace. And that pace never lets up.Axl slam fucks into Bailey. He grabs Bailey's hair, pounding into him, and then hisses 'Take that cock!' Soon Axl's ass is nothing but a blur as he aerobically pounds into Bailey. Axl is in seventh heaven, losing himself in the moment -- humping Bailey frantically.Axl turns up the heat to 11 as he roughly fucks Bailey into the next time zone. 'Aw fuck my ass!' Bailey yells out as Axl yanks on his hair. 'Yeah you like that?' Axl pants/grunts out as he continues to rail on Bailey's ass. The guys change positions so that Bailey is sitting atop Axl, facing towards the camera. Axl keeps on slam-fucking Bailey for all he's worth. We're fairly certain Bailey won't be able to walk after this . . . 'Ride that dick,' Axl tells Bailey, who then ruts his ass onto Axl's cock and rides it. Axl meanwhile reaches around and starts to frantically finger-fuck his *own* ass while he's fucking Bailey.One more position change, as the guys go at it doggy style for a minute before Axl can't wait any longer and needs to blow. He shoots all over Bailey's tongue and face, and then lets an eager Bailey licks up the mess (and suck on his spent dick). 'Swallow that cum. Swallow that shit,' Axl tells Bailey. 'Fuck, I'm gonna take a good rest tonight!' Axl jokes in our post-sex interview. Considering the literal pounding he gave Bailey, we suspect he passed out shortly after Kaden turned off the camera!",
  "models": [
    {
      "name": "Axl",
      "person_id": 35274
    },
    {
      "name": "Bailey",
      "person_id": 35304
    }
  ],
  "release_date": "2013-01-27",
  "scene_id": 70638,
  "series": "Pumped Privates",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Facial",
    "Gay",
    "Rough",
    "Smooth",
    "Tattoos"
  ],
  "title": "Axl & Bailey"
}