{
  "collections": [
    "Active Duty"
  ],
  "description": "'This is gonna be something new for you Finn,' our guest director Mike tells Finn as our latest War Chest scene opens. And Mike isn't kidding!Finn has shot a couple solos for us before, but this is his first time doing anything with a guy -- and luckily, Mike was there to capture the moment. Finn has such a striking physique. He's a muscular guy with a gymnast-like body with eye-popping abs, pecs and biceps.Mike tells us, and Finn, 'I brought my old buddy Nick over and we're gonna see what we can get done today.' You've seen Nick before on the site, as he's an old hand by now at this, having appeared in a number of scenes. So, it's good that he's been paired up with the total newbie Finn for his first taste of man action.As the guys get comfortable and are stroking themselves a bit, side-by-side on the bed, Finn asks Nick, 'So what trick do you use to get hard, dude?' Nick smiles and says, 'Usually don't need a trick. I just . . . uh . . . look at porn.' There's a funny exchange between the two about porn and the kind of girls they like. (At one point, Finn talks about how some girls just want to be 'fed dick.' Well, alright then!)Soon enough, Finn is reaching over to get a handle on Nick's thick meat. A minute or so goes by and Mike tells Finn, 'Why don't you try something else now.' Finn says, 'What'd you want me to do? Go down on it? You want me to start sucking it?' Mike: 'Will you?' Finn: 'I'll try.' And away we go . . .I won't spell out every little detail, but I will say that Nick gets a taste of Finn's dick too. But the really exciting stuff happens after that, when Nick shoots a big load all over Finn's face. The poor guy never saw what was coming I think!",
  "models": [
    {
      "name": "Finn",
      "person_id": 35296
    },
    {
      "name": "Nick",
      "person_id": 35229
    }
  ],
  "release_date": "2013-01-09",
  "scene_id": 70632,
  "series": "Bareback Base Camp 3",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Facial",
    "Gay",
    "Tattoos",
    "War Chest"
  ],
  "title": "Finn & Nick"
}