{
  "collections": [
    "Active Duty"
  ],
  "description": "Nick is joined by our strapping cowboy pal Bruce for one of Bruce's first scenes with another guy. I just think Bruce is such a good looking fella with a body that won't quit.Our guest director Mike starts us off, asking Bruce, 'What did you tell me you'd never do?' Bruce responds, 'I don't suck no dick and I don't take it up the ass.''Well, so far, you've sucked dick. How was that?' Mike asks. (Referring to an earlier scene with Marty.)'It wasn't bad,' Bruce says. 'Now you're ready to fuck, is that right?' He hesitates, but answers: 'Yeah.' Well, we aren't going to see any fucking today, but we are going to see some blowjobs happen.Mike jokes around with Nick and Bruce, reassuring Bruce that Nick's an old pro at this and has been doing it for a while. Mike says that this is Bruce's third or fourth shoot, and then asks him if he's getting used to this yet. Bruce quickly shoots back: 'No' and smiles. There's a good bit of fun conversation that happens next, but I won't go into lurid detail, but let's just say it involves a drag show, Thailand and boozing it up. You do the math. lol.It isn't long before Bruce is down on Nick, sucking him. 'Aw, it feels great,' Nick says to the back of Bruce's bobbing head. 'He's got a nice fat cock, don't he?' Mike asks Bruce. The latter can only respond with a muffled 'mmmhmmm' as he's got a mouthful of dick. The guys switch things up a bit, as it's Bruce's turn to lay back and get worked over. 'You suck that so good,' Bruce says, grinding and lifting his hips up to meet Nick's sucking mouth. After a few more minutes, the guys split up to jerk themselves off to completion. It's now where we can see just how big their dicks are. Big. Big big. It's so awesome to watch Nick stare at Bruce's dick as the latter jerks it frantically, waving the big thing in the air. Methinks Nick might like what he sees!It isn't long before both gentlemen are blowing their loads all over their chest. Nick has more volume, but Bruce definitely gets more distance. lol. Mike asks Nick, 'For a beginner, can Bruce suck cock?' Nick smiles, 'Yeah, he's actually pretty good at it!'",
  "models": [
    {
      "name": "Nick",
      "person_id": 35229
    },
    {
      "name": "Bruce",
      "person_id": 35312
    }
  ],
  "release_date": "2013-01-13",
  "scene_id": 70633,
  "series": "Bareback Base Camp 2",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Duo",
    "Gay"
  ],
  "title": "Bruce & Nick"
}