{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden had the good fortune of directing this scene with Axl and Sawyer, who both top *and* bottom in the scene. Kaden gets out of the way quickly and leaves the guys to get to know one another.<br /><br />'Let's see that body of yours,' Axl tells Sawyer, who has one hand in his pants already. Axl says, 'Take off your shirt.' Axl's licking his lips and visibly checking Sawyer's chest out. 'You play sports or anything?' he says Sawyer. 'Soccer. Love soccer,' Sawyer answers. <br /><br />Axl climbs over Sawyer, who seems taken aback by Axl's swiftness. But, all Sawyer can do is grin when Axl straddles his legs and starts to inspect his body. Axl leans down and starts to kiss Sawyer's chest and feels his abs. 'You have a pretty nice body dude!' Axl tells Saywer. Kaden isn't even back in the room yet, so we're seeing a totally candid moment that only the camera captured. Axl is planting more and more pecks on Sawyer's chest as his body gyrates against him.<br /><br />'So, before I get to see it,' Axl says, 'how big would you say your penis is?' Sawyer chuckles, 'Not too big, not too small.' Axl smiles and says, 'Not too big, not too small? That's perfect.' Sawyer shoots back, 'How about yourself?' Axl: 'I'd say average. I'm a pretty humble person.'<br /><br />Sawyer is the first to go down, much to Axl's liking: 'You're pretty good at that,' he says. 'I am?' Sawyer responds as he continues to lick and suck on Axl's oh-so-pretty penis. 'Let's see that cock of yours,' Axl says to Sawyer as he quickly jumps on top of him, yanking off his jeans and underwear. He immediately engulfs Sawyer's dick and goes to work. We get such a lovely full-body shots of Axl -- who is a very tall 6'3' and is just breathtaking. Sawyer's figure is striking too -- he's got such wonderful, golden, perfect complexion. And clearly, Axl is enamored with it. He moves up his body, kissing his neck, nuzzling Sawyer as he grinds his dick between his legs, knocking on his ass' door. <br /><br />The guys flip around so that Axl's again on his back, with Sawyer going sucking his ever-hardening dick. He tries his best to get as much of it in his throat -- we can hear little gurgling, gagging sounds. Bravo Sawyer for trying! 'Cup my balls,' Axl says, and Sawyer does what he's told, continuing to suck on Axl as he plays with his balls, too.<br /><br />Sawyer gets up to face-fucking Axl, standing over his face. Axl is in heaven with a mouthful of dick. Sawyer slides back so that he's about to sit on Axl's dick. There is an amazing moment that comes next -- Axl is working his dick closer and closer to insertion while the camera is really close up. And then, POP -- we actually hear his dick 'lock' into Sawyer's ass. Both guys let out a little moan when it happens and you will too.<br /><br />'Does that feel good?' Sawyer asks. 'It feels so tight,' Axl answers. 'It IS tight,' Sawyer jokes back at him. lol. Seeing Sawyer sitting on Axl while the latter just grinds and  pounds into him from underneath is awesome.<br /><br />Sawyer then twists around so that he's facing away from Axl -- and the entire time he's able to keep Axl's dick inside him. Sawyer jokes and tells Axl to 'Stay there,' as he spins around on his cock. Axl's going in deep -- balls deep. Sawyer is such a trooper -- and wow, wait until you see his abs working in this scene.<br /><br />(I've now realized I've written a half-novel, and we haven't got to when Axl gives up his ass to Sawyer! lol. I need to get this show on the road!)<br /><br />The guys switch around so that Axl is standing on the side of the bed, pounding into Sawyer who is face down into the bed. Axl is relentless -- and we get some amazing footage of him fucking Sawyer. It isn't long before it's time for Axl to get on the bottom, so the guys switch positions. Now we get to see Sawyer's glorious rear end pounding into Axl -- while Axl himself is rock hard. 'Oh my god, I wanna cum so bad,' Axl says as Sawyer continues to fuck him into the bed. 'I like that ass,' Sawyer says, which prompts Axl to groan out, 'I like that cock. Mm. Fuck my ass!'<br /><br />Axl gets onto his back, legs flung in the air around Sawyer's head. Sawyer's going faster and faster now and Axl locks eyes with Sawyer. 'Oh my god,' Axl says, 'I'm gonna cum!' And blamo - out cums a huge load while Saywer's still inside him. Then, Sawyer yells out that he's gonna cum too, and pulls out to shoot his load onto Axl. 'That was fun,' Sawyer says to Axl.<br /><br />But wait, there's more. The guys are back on the bed together, naked. Saywer points to Axl, 'I think we might have a little bit more action over here.' Axl says, 'I'm going to try to cum again.' And cum again he does folks. Two loads in one scene. Gotta love it.",
  "models": [
    {
      "name": "Axl",
      "person_id": 35274
    },
    {
      "name": "Sawyer",
      "person_id": 35300
    }
  ],
  "release_date": "2013-01-20",
  "scene_id": 70636,
  "series": "Geared Up",
  "tags": [
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Smooth",
    "Tattoos"
  ],
  "title": "Axl & Sawyer"
}