{
  "collections": [
    "Active Duty"
  ],
  "description": "As the video opens, we find cute little Marty on the bed, all by himself. After a few minutes where it seems like he's going to end up doing a solo for our guest director Mike, we hear a knock on the door. In walks Nick -- who Mike had thought was going to be a no-show for the scene today. Lucky for us -- and Nick -- Marty is here to show Nick's thick dick a good time.Nick says he doesn't have long, so he plops down in his fatigues and let's Marty go to work on him. Marty reaches over and starts to feel at Nick's package in his pants. He quickly unzips Nick's pants, revealing a semi-hard dick. Marty goes down, much to Nick's liking, 'Ah yeah . . . that feels great.' And damn, Nick is packing heat. Mike says to Marty, 'He's got a thick cock, don't he?' Marty pauses for a moment, unlodging the monster from his mouth, 'Real thick,' he says. This is a scene that's purely for Nick's enjoyment. He just lays back, relaxes, and let's Marty do all the work. Marty licks Nick's cock up and down, stroking it constantly, taking as much of it into his throat that he can. 'Aw, fuck yeah,' Nick whispers to Marty. Soon, Nick's head on placed on the back of Marty's head, guiding his mouth up and down his shaft. 'It feels so good,' Nick says as he peels off his shirt, revealing a broad, smooth, muscular chest. Down goes Nicks pants, giving Marty better access to Nicks ever-enlarging dick. Nick takes over and starts jerking his own meat, clearly getting close to shooting his load. Marty caresses his thigh and looks on, waiting for the cum. And bam! He shoots and scores -- all over his chest. Marty goes in and sucks off the last bits of cum from his dick. And with that, our quickie with Marty and Nick is wrapped!",
  "models": [
    {
      "name": "Nick",
      "person_id": 35229
    },
    {
      "name": "Marty",
      "person_id": 35307
    }
  ],
  "release_date": "2013-01-13",
  "scene_id": 70634,
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay"
  ],
  "title": "Marty & Nick"
}