{
  "collections": [
    "Active Duty"
  ],
  "description": "Our fine friend Major Wood brings us a new find tonight in the striking form of 18-year old Chandler.<br /><br />The lean, finely-toned gent comes to us all the way from Illinois. He stands 5'10' tall and weighs in at 155 lbs. <br /><br />Major Wood asks him, as we do of most guys when we meet them for the first time, if they played any sports in high school. Chandler jokes that he wasn't 'coordinated enough' for sports, but he did enjoy 'participating in some illicit activities' with a neighborhood girl down the street when he was younger. Turns out, that was his first sexual experience, he he tells us a little bit about what happened.<br /><br />Major Wood presses on, asking if Chandler's ever been in a tag-team situation and Chandler says he has. It involved him and one of his friends from school and a girl they knew. He says 'we were pretty good buddies . . . and she was all about it!' (Of course, once you see Chandler naked and the nice piece of meat he's packing, you'll be all about it too!)<br /><br />We get Chandler to take his clothes off, revealing a lightly worked-out body (he tries to keep in shape, he says) and an already-stiff dick. It's really quite thick and is one of those -- and I've said it before -- good-looking dicks. I know it sounds funny, but you know it's true. Some dicks are beautiful, and some are . . . less so? Chandler's is more on the handsome, nice-to-meet-ya side of things. lol. <br /><br />For those of you with a thing for socks, you'll enjoy this scene, as Chandler keeps on his bright green and grey socks throughout the scene. And wait until you get a load of Chandler when he humps the bed, fucking his hand. Watching his ass plowing into the bed is just such a pretty sight. (We get up real close at one point so we can hear Chandler heavily breathing -- he's fully into it.)<br /><br />And wow, what a load he shoots! I count nine spurts out of his dick, sending his load all over his abs. Poor Chandler is breathless, but says the experience was 'excellent.' As it turns out, Chandler is a big shooter, saying this sort of massive load is typical. So if we get him back for a hard core scene, we'll have to warn the other guys that he might shoot their eye out!",
  "models": [
    {
      "name": "Chandler",
      "person_id": 35325
    }
  ],
  "release_date": "2013-01-23",
  "scene_id": 70637,
  "series": "Geared Up 2",
  "tags": [
    "First Time",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "War Chest"
  ],
  "title": "Chandler"
}