{
  "collections": [
    "Active Duty"
  ],
  "description": "Lane pairs up with Jimmy for his first experience with a man -- and it's a good one. :) Now you have may seen Jimmy before, but I swear he's getting even more muscular. The beefy guy has got biceps of death and thighs that just won't quit. The two guys are sitting side-by-side on the bed -- Lane in grey briefs and a red T-shirt and Jimmy in dark blue boxer briefs and a patterned T. <br /><br />The guys are watching some straight porn off camera while jerking their dicks inside their shorts. Eventually, their meat slinks out of their briefs a little -- and we can see Jimmy sneaking glances over at Lane's dick. Jimmy takes the lead and is the first to pull his cock out and then to take his shirt off. Eventually, Lane follows suit. Jimmy loses  his shorts, revealing his muscled, smooth body, and then it's Lane's turn to get fully naked. <br /><br />Now with these two fine specimens buck naked, Mike asks, 'Hey Jimmy, I told Lane something about you.' Jimmy says, 'What's that?' Mike says 'I told him you like sucking cock.' Jimmy has a smirk on his face and says, 'Yeah.' And here's the good part, Lane then turns to Jimmy and asks, 'Would you mind?' 'No,' Jimmy answers and we're off!<br /><br />'Now don't make me out a liar,' Mike jokes as Jimmy starts to suck Lane, 'I told him you were a good cock sucker.' Lane places his hand on the back of Jimmy's head, guiding his mouth down on his cock. 'He knows what he's doing,' Lane tells us. The looks on Lane's face tell the tale -- he's loving every second of this. <br /><br />Lane's getting short of breath and he keeps closing his eyes, mouth agape, clearly in ecstasy. His dick is massively hard -- nice and 'thick, fat' Mike says to Jimmy off camera. Lane isn't really watching the porno anymore, he's lost in the moment -- over the moon with the experience of Jimmy's mouth on his dick. 'Don't stop man!' Lane tells Jimmy when he pauses for a second. Jimmy starts to jerk on Lane's dick a bit more, which prompts him to order 'faster!' It isn't more than a minute or so later where he blurts out 'I'm about to cum!' and Jimmy jerks out a big ol' load over Lane's chest, legs -- everywhere.<br /><br />Mike goes in to inspect the damage, grabbing Lane's dick to squeeze out the last bit of cum. He tells Jimmy to clean him off -- so Jimmy dives down and sucks off the remaining cum off his dick. Mike asks how the blowjob felt and Lane, seemingly totally honest, says it was 'the best I ever had.'<br /><br />Lane has to go shower up, leaving Jimmy behind on the bed to finish himself off. Jimmy tells Mike how Lane's dick was 'nice and big' and -- while stroking himself -- remarks about how thick Lane is. A hilarious moment comes later, when -- while Jimmy is still stroking -- Lane (off camera) bids his adieu to Mike and Jimmy. 'It was nice meeting you Jimmy,' Lane tells him (as Jimmy continues to stroke). 'Oh yeah!' Jimmy answers, smiling a big, wide grin at the camera. 'We'll see you next time,' Lane says.<br />",
  "models": [
    {
      "name": "Jimmy",
      "person_id": 35295
    },
    {
      "name": "Lane",
      "person_id": 35323
    }
  ],
  "release_date": "2013-01-06",
  "scene_id": 70631,
  "series": "Covert Missions 17",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Straight"
  ],
  "title": "Jimmy & Lane"
}