{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight in the War Chest Update we're bringing you a red blooded, All-American college baseball jock. Big tall Steele is packing major heat in his pants -- easily a two-hander -- and we're so happy to have him. <br /><br />The 21-year old is from South Carolina and stands 6'3' tall and weighs in at 168 lbs. (Or, as he says, 'sometimes 170 after Thanksgiving, you know how it goes.')<br /><br />He's out here in California visiting the sights, which include 'beautiful girls, beautiful sun (and) nice water.' He's a fan of snowboarding and extreme sports as well. He says back in school he did gymnastics for a few years, which led him into 'playing college baseball somehow.' He's got the tall, lanky (but ripped) body of jock baseball player, too.<br /><br />I have to say, Steele is one of those guys that is sometimes difficult to photograph, though Major Wood did a lovely job with his glamour shots that you see in the update letter and in Steele's gallery. But -- once you see Steele *in* the video -- I say his beauty and hotness really shines even stronger.<br /><br />Major Wood directs this scene as well, and he asks Steele what his most recent kinkiest sexual experience was. As it turns out, Steele and his buddy picked up a 'cougar' at a bar who took them back to her place so her husband could watch his wife get it on with Steele and his buddy. Well alright! Steele says the fun went on through the entire night and he and his pal have gone back for a return engagement a few times.<br /><br />I know you're asking 'What did the husband do while the three of them were messing around?' Well, you'll have to watch the video to find out -- I can't spill *all* of Steele's secrets here, can I?<br /><br />Steele says he's 'pretty excited' to show of his goods and he puts on a heck of a performance, ending with a massive load that sends sprays of cum all over his incredibly tight abs. Without prompting, he drags his fingers through is load, smearing it across his chest, only to then take a finger or two into his mouth to taste his spunk. He seemingly can't get enough, as he keeps on licking and tasting more and more.<br /><br />Major Wood is impressed, as is Steele, who jokes: 'Too bad I'm not from Kentucky, otherwise you could call me Louisville Slugger!'",
  "models": [
    {
      "name": "Steele",
      "person_id": 35326
    }
  ],
  "release_date": "2013-01-30",
  "scene_id": 70639,
  "series": "Geared Up 2",
  "tags": [
    "Big Dick",
    "First Time",
    "Gay",
    "Smooth",
    "Solo",
    "Twink",
    "War Chest",
    "White Butt"
  ],
  "title": "Steele"
}