{
  "collections": [
    "Active Duty"
  ],
  "description": "'I like your muscles,' a smiling Marco tells Hunter, as he lets his hand drift up and down Hunter's upper arm, groping his bicep. 'Thanks man, I like yours too,' Hunter says. 'What do you got for tattoos?' Hunter asks. Marco, knowing how to best take advantage of the situation, says, 'Oh, you know . . . I have a hidden one.' 'Where's that at?' Hunter asks, seemingly not catching on to Marco's plan. 'Oh, you know . . . it's by my dick.''That was subtle,' Hunter says, laughing. 'Wanna see it?' Marco says. As it turns out, Marco does indeed have a semi-hidden tattoo down towards his dick, which gives him an opportunity to take off his shirt and show Hunter some flesh. The shirts start coming off and both of the guys start complimenting one another on their bodies. Marco is clearly smitten with Hunter's physique. Marco is leading the conversation here, moving the action along by asking if Hunter likes his dick sucked. 'Who doesn't?' Hunter says. Well, that's a rational answer if ever I've heard one.Marco starts to yank off Hunter's sweat pants and briefs, only to reveal his monster dick. 'That's a big cock!' Marco exclaims. He wastes no time in grabbing onto it, telling Hunter 'Your dick is so thick.' Marco kisses Hunter's chest, focusing on his nipples, and then engulfs Hunter's dick with his mouth. 'Lick around the head of it,' Hunter instructs Marco, who is only happy to oblige the request.Hunter jokes a bit, asking Marco if he thinks he'll be able to take the dick up his ass. Marco isn't too sure if he'll be able to, but says he might try. Hunter is 'so hard,' Marco says, clearly loving sucking his dick. (And, kind of amusingly, Hunter is very specific when it comes to giving instructions.)'I like to be surprised. You can do whatever you want to my dick,' Marco says to Hunter, after the latter asks him how he likes it. Marco is clearly getting off on just having Hunter's mouth on his dick -- he's not picky about his technique! 'It feels so good when you suck my dick,' Marco tells Hunter. 'You like my dick in your mouth?' Hunter can't respond, since he has . . . well, a mouthful of cock. Then, things take a turn, as Marco lays down, ready for Hunter to investigate his ass. Hunter slips in a finger, asking Marco how it feels. 'Feels good,' Marco says, with zero hesitation. Hunter knows he's going to have to get Marco's ass really loose if he wants to fuck him, so we'll see how this goes. 'Want me to try to use two fingers?' Marco says, 'Go slow,' even though he says it hurts. Hunter promises to go slow.The guys work up to an attempt at fucking, but it's not gonna work. Hunter's just too damn big for Marco's cute little ass. (Though they give it the college try!)Marco says 'You wanna fuck my face?' as a trade-off, and Hunter agrees. After some face-fucking, the guys switch to a 69 position, which is awesome to watch. Marco is bobbing up and down so furiously on Hunter's dick, saliva is spilling out and down Hunter's cock. Soon, Marco is down on his knees whilst Hunter is vigorously face fucking him. 'You ready?' Hunter says? Hunter pulls out and starts shooting his load all over Marco's face. 'Good thing you closed your eyes,' Hunter says. Marco grabs Hunter's thick, spent dick and starts jerking it some more, licking it. He's in love - clearly. Don't worry, Marco still have to burst, and that he does -- all over Hunter's chest and legs. The guys joke around a bit at the end, with Marco saying that he'll gave to get his ass loosed up a lot more before Hunter takes another stab at fucking him. (Maybe we'll get them back for round two together!)",
  "models": [
    {
      "name": "Hunter II",
      "person_id": 35277
    },
    {
      "name": "Marco",
      "person_id": 35314
    }
  ],
  "release_date": "2013-02-24",
  "scene_id": 70646,
  "tags": [
    "69",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Facial",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Hunter & Marco"
}