{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm back in the director's chair for this scene, where I pair up the oh-so-beautiful Sawyer with the twinktastic newbie Sean. While it's Sean's first time with a guy, he says that he's 'excited' and 'ready to go.' Sawyer says 'that sounds like some fun' and I couldn't agree more. I ask Sawyer if he's going to ensure that Sean has fun, and Sawyer jokes, 'I'll do my damnedest!' Sawyer is hilarious and says how he's 'throat's been aching' for a little while, and he's been looking to suck a dick. lol. I'm not sure if poor Sean knew what hit him, but he's taking it all in stride. I tell the guys that I'm going to leave them alone and that I'm sure 'something will come up soon.' Pun intended, of course.Sawyer jumps right into the action, slipping out of his shirt, seemingly surprising Sean. As soon as Sawyer starts to undo his own belt buckle, Sean says 'taking it off?' shocked that Sawyer is already yanking off his clothes. It doesn't phase Sawyer, who tells Sean to take off his shirt. He does, and reveals an amusing 'all I do is fuck and party' sleeveless shirt. Sean starts to undo his pants, but Sawyer says 'let me help you do that' and leans over to unzip him. Sean is clearly in uncharted waters right about now, but he's keeping his cool. Sawyer starts to grope at Sean's boxers while kissing his chest and admiring his slim body. Sean takes off his shorts, though he seems a bit shy about it. But once he does, and once Sawyer gets Sean's dick in his mouth, the look on Sean's face is priceless. It's that perfect expression of 'I'm not sure what's happening but I think I like it . . . a lot.' You know that look that you've seen on many a man that's passed through Active Duty's walls? Well, this is one of those videos where you're seeing a real moment happen. Sawyer pauses and asks, 'First blowjob from a guy?' And Sean answers what we already knew: 'Yeah.' Sawyer responds: 'Not too bad, huh?' Sean smirks, 'Not at all.'Sean's comfortable enough now with the situation to place his hand behind Sawyer's head so he can guide him down his cock. Sean pumps his hips into the air, gently face-fucking Sawyer -- who is doing an admirable job sucking Sean. 'Go deep,' Sean says, as Sawyer struggles to deep-throat him. 'Keep sucking my dick, I'm gonna jack you off.' Sean spits in his hand and starts jerking Sawyer with his right hand, while Sawyer keeps up the pace by blowing Sean. The guys change positions so that Sawyer is on the ground, on his knees, blowing Sean, who is on his knees on the bed. Got that? I get some wonderful under-the-dick shots of the action so we can see Sean pump his cock into Sawyer's mouth. It's quite hot if I do say so myself.'Keep playing with my nuts,' Sean says to Sawyer. Well, Sawyer does one better, and just rearranges himself so that he can lay his head underneath Sean to tongue his balls while jerking him off. 'Keep going,' Sean breathlessly says to Sawyer, clearly liking what's happening. Sean gets off the bed so he can straddle Sawyer. The latter's finger start doing the walking, exploring Sean's cute-as-a-button butt. A few minutes later, after some teasing with a little bit of a finger or two, Sawyer starts tonguing Sean's hole. Sean can't help but to moan his emotions -- which sound pleasant to me!Sawyer soon tells Sean that after all this hard work, it's time for Sean to 'repay the favor a little bit.' Sean asks, 'How?' Sawyer: 'Uh. . . maybe suck *me* off a little bit. I love a good blow job, too.' Sean: 'I can do that.' (Success!)Sawyer straddles Sean's chest -- as he's lying on the bed -- and feeds him his dick. And well, well. Sean takes to sucking like it's a hobby! He eagerly licks up and down Sawyer's shaft, working it with his lips and taking it into his mouth. (And, considering the position he's in -- never a great one for sucking -- he does pretty great!)'See, not too bad!' Sawyer says to Sean, whose head is bobbing around between Sawyer's thighs. They move around so that Sawyer can finally relax on his back, and Sean crawls up next to him. He keeps on sucking -- while his own dick stays erect -- much to Sawyer's approval. Sean continues until Sawyer is close to cumming. Sean quickly pulls off so that Sawyer can blast his cum -- and wow, what a load. Sean follows suit, jerking out his own load on his chest.'First time was awesome,' Sean says to Sawyer, smiling. I ask if we're gonna see Sean again, and he says 'definitely.'",
  "models": [
    {
      "name": "Sawyer",
      "person_id": 35300
    },
    {
      "name": "Sean",
      "person_id": 35317
    }
  ],
  "release_date": "2013-02-10",
  "scene_id": 70642,
  "series": "Pumped Privates",
  "tags": [
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Rimming",
    "Smooth",
    "Twink"
  ],
  "title": "Sawyer & Sean"
}