{
  "collections": [
    "Active Duty"
  ],
  "description": "'I don't like wasting time,' Mike says, as we open this scene with Bryce and new guy Steve. 'I got you guys under the sheet, 'cause I want to see some action.'We haven't shared with you any of our guest director Mike's stuff in a while, so we felt it was high time we post an update focused on something from him. In today's scene, Bryce (the twink with the dick of a death) pairs up with new find Steve (with a quite-sizable log himself) for some oral action.Now, as we find out early on in their scene, Steve has already shot a solo for Mike. We haven't posted that yet, so be on the look out for that later. I really wanted to post this scene for today's update, so I just skipped over Steve's introductory solo and headed into the . . . 'head' action. The guys are watching some porno off camera, already naked, and jerking their big dicks side-by-side. Mike notes just how thick Steve's dick is, and tells Steve how Bryce has a 'big-ass cock, don't he?' Steve agrees, eyeing Bryce's meat, saying 'ooh yeah!' 'Steve, is it alright if Bryce jacks you for a little bit?' Mike asks. 'Oh yeah,' Steve answers -- the only right answer one could give to this question, really. lol. Steve gives Bryce a hand, too, and the guys are quickly jerking one another off. It isn't long before Mike suggests to Steve that Bryce suck his dick, and Steve is totally down for it.'Does that cock taste good?' Steve whispers to Bryce. 'Fuck yeah,' Bryce answers, after lifting his head off Steve's big one.'Damn, that's a tight throat,' Steve moans to Bryce, clearly loving the feeling of Bryce's mouth and throat around his cock. 'Take it all Bryce,' Mike tells him. Bryce does. Steve moans. We're in business! 'Suck that dick hard. I want you to suck the cum out of that cock,' Steve says.And hell, we're only barely only getting started in the video!'Could you give it a try?' Mike asks Steve. 'Suck his cock?' Steve asks Mike. He catches on quickly and jumps onto Bryce, aggressively sucking his dick. 'Ooh, fuck!' Bryce says, throwing his left arm behind his head while guiding Steve down with his right harm.  'You like that Steve?' Mike asks. All Steve can say is 'mmhmmm' as his lips are wrapped around Bryce's thick tube. The guys move around so that Bryce can blow Steve again. Steve's lost in the stratosphere, as he's having *that* good of a time. Bryce is feeling all over Steve's chest, sucking his dick, playing with his balls. And then when Bryce goes all the way down on Steve . . . well, by the moan Steve makes, he loves it.By the end of the video, Steve's already making plans on coming back to shoot more with Mike. So, I think we have a winner on our hands! I'm looking forward to seeing what happens next with Steve (and Bryce, of course, too!).",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Steve",
      "person_id": 35330
    }
  ],
  "release_date": "2013-03-03",
  "scene_id": 70648,
  "series": "Covert Missions 18",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Twink"
  ],
  "title": "Bryce & Steve"
}