{
  "collections": [
    "Active Duty"
  ],
  "description": "'That's gonna be you later,' Tanner says to Grayson as he points towards the girl getting fucked on the off-camera TV screen.<br /><br />'That,' Grayson says, pausing to squint at the TV, 'looks like . . . not fun for my ass,' before bursting into laughter. <br /><br />'That doesn't look like fun for anybody,' Tanner jokes back, helping to break the ice in this scene, which introduces Grayson to man-on-man action. 'I don't even know how she's enjoying that.'<br /><br />Grayson -- sitting next to Tanner on the bed -- is seemingly as nervous as a cat in a room full of rocking chairs. Until today, he had only shot a solo for us -- three months ago -- so this is a big step for him. Today, he not only messes around with a guy, but he goes all the way -- he's going to get fucked by Tanner.<br /><br />All the awkwardness and hesitation seems to drift away from Grayson once Tanner places his mouth on Grayson's dick. He leans back, lets out a little sigh, and watches Tanner suck him. 'You like that?' Tanner asks. 'Yeah, it's so good,' Grayson says. <br /><br />After a couple minutes, Tanner says to Grayson that he thinks it's time for him to return the favor. So, Tanner leans back and yanks off his blue boxer shorts, revealing his stiff dick (with its big ol' head). Grayson grabs Tanner's dick, but then kisses Tanner's stomach and legs, hesitating just a bit.<br /><br />'Don't be scared,' Tanner says, 'it ain't gonna bite you.' Clearly, Tanner is loving every minute of this, and he blurts out 'You sure you haven't done this before? I have a feeling you're lying.'<br /><br />Grayson is going slow and steady on Tanner's dick, but that isn't pleasing Tanner, who barks, 'You know you could go a little faster, and not make love to it.' So, Grayson obliges, picking up the pace. Tanner's moans tell us everything we need to know about how well Grayson is doing in the dick-sucking department.<br /><br />Grayson is a quick learner, as he seriously deep-throats Tanner all the way down to his pubes. Tanner is in heaven, letting out moans as he throws his head back on the bed. We give Tanner the camera so he can film Grayson from above -- and it's super hot. (Especially when Grayson looks up at the camera with his big eyes, licking up and down Tanner's shaft.)<br /><br />Tanner tells Grayson it's about time for him to get fucked, so Grayson turns around and gets on his hands and knees. Tanner slips a finger into his ass, telling him how tight he is, unsure if he'll be able to get his dick up there.<br /><br />Well, cut to a minute later, and Tanner has shoved his dick in, grunting all the while. 'Oh my god,' Grayson moans as Tanner slams into him from behind. 'Fuck that ass!'<br /><br />The guys switch positions so that Grayson is on his back, jerking himself off, while Tanner fucks him. 'Fuck me with that big dick,' Grayson tells Tanner, who grabs Grayson's legs and puts them up on his shoulder. Tanner sounds like a wild animal now -- barking and making guttural sounds.<br /><br />'Oh my god, I'm coming, I'm coming!' Grayson starts to shoot his load all over his chest as Tanner continues to fuck him. 'Oh fuck yes!'<br /><br />'Oh yeah, now it's my turn!' Tanner pulls out and starts frantically jerking over Grayson's torso. I don't think I've seen Tanner's dick quite this engorged before. Clearly, something was working! <br />",
  "models": [
    {
      "name": "Grayson",
      "person_id": 35316
    },
    {
      "name": "Tanner II",
      "person_id": 35290
    }
  ],
  "release_date": "2013-02-17",
  "scene_id": 70644,
  "series": "Battle of the Bulge",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Muscular"
  ],
  "title": "Grayson & Tanner"
}