{
  "collections": [
    "Active Duty"
  ],
  "description": "Lucky Bailey gets to be the first man to suck Steele's dick tonight -- it's something Bailey says is a 'privilege.' Steele says he's 'pretty excited' and he's impressed by Bailey's body. So we're off to a good start already! Kaden, who directs this scene, asks if Steele might be willing to do more. Steele says 'we'll see how it goes, see how things heat up.' Kaden tells Bailey to take it away, so Bailey asks Steele what his hobbies are as he continues to grope at his jeans-covered dick. Steele says he likes outdoor stuff, skateboarding and 'a lot of sex.' 'Well that's good,' Bailey says, 'then I think we have something in common.'Bailey wastes no time after that, diving in for a kiss on the lips -- and I immediately wonder if Steele has ever kissed a man. He doesn't have time to think about it, but seems to react . . . well. He kisses back and says to Bailey, 'I'll have to let you take over since this is my first time.''Don't worry,' Bailey says, 'But get that shirt off first though.' Steele takes off his shirt, revealing his long, smooth torso. Bailey slinks down onto his chest, kissing it and slowly moving down to unbutton Steele's fly. Bailey pauses for a moment to take off his own shirt, causing Steele to say 'Aw shit, that's a nice body.' Back down Bailey goes, with one hand on Steele's boxer briefs and his lips locked to Steele's lips.Bailey slides down Steele's chest and starts to slurp on Steele's dick. Bailey's a trooper, focusing all of his attention on Steele and his dick, working it over like a champ. Bailey gets Steele bent over so he can suck him from underneath -- and so we can take in the full, impressive length of his cock. Bailey gets Steele to straddle him, so he can face-fuck Bailey. As Steele continues to piston in and out of Bailey's mouth, Bailey slips a finger into Steele's ass. He responds with an 'Oh shit!' and then says 'Easy!' Clearly, it's a bit much for Steele, who is getting a very quick lesson in 'watch out for Bailey's hands.''You like that big fat cock?' Steele says to Bailey, who can only respond with a mouthful of 'mmhmmm.' I'll say this about Steele -- he really must like making-out with Bailey, as he keeps pausing the oral action to bend down and smooch with him. (Of course, while this is happening, Bailey continues to jerk on him, so . . . )I won't spoil how the scene ends, but let's just say Bailey gets a mouthful . . .",
  "models": [
    {
      "name": "Bailey",
      "person_id": 35304
    },
    {
      "name": "Steele",
      "person_id": 35326
    }
  ],
  "release_date": "2013-02-03",
  "scene_id": 70640,
  "tags": [
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Facial",
    "First Time",
    "Gay",
    "Smooth"
  ],
  "title": "Bailey & Steele"
}