{
  "collections": [
    "Active Duty"
  ],
  "description": "Today we're introducing you to a fine specimen of man named Silas. And lawd, this one's a cutie and has THE most perfect ass. He also has the prettiest eyes and the most adorable little smile. I swear he looks a touch like football player Tim Tebow, don't you think? Silas -- or, Sy, as he says to call him -- has been fast-tracked here and I didn't waste any time getting him straight into some man-on-man action.Lucky Bailey is the fellow that got the call for this scene. I tell Sy that Bailey knows what he's doing, so I'll leave them to get to know one another. And to, you know, 'see what comes up.' Heh, heh . . . Bailey asks Sy what he likes to do for fun, and Sy jokes, 'Well . . . this?' Bailey smiles and laughs a bit, 'Oh? That's good.' Sy's an outdoorsy dude, and says he likes to go out and 'enjoy the backwoods' and 'back roads.' I'm just getting lost in the fantasy of Sy out in the woods, wearing nothing but a pair of jeans, being one with nature, and . . . oh hell, where was I? Right - the scene! Sorry.Sy tells Bailey that this is his first time being with a guy, so Bailey quickly puts him at ease, saying that he thinks he'll 'come to enjoy it.' He continues, 'I've been told I give pretty good head.' Sy perks up, 'Oh yeah?'Sy leans back and lets Bailey start to go to work, unbuttoning Sy's jeans and slipping them off to reveal . . . pink underwear! The guys get a chuckle out of that, but quickly move on to the matter at hand. Sy's totally unfazed by anything and is ready for whatever. He flashes that cute smile at Bailey as we watch Sy's dick grow ever-harder. I come back in a few minutes later and get in close with the camera. I ask Sy how Bailey's doing in the blowjob department, and Sy quickly responds, 'He's great!' I ask, 'Better than you thought?' Sy: 'Mmmm. . . definitely.' (Meanwhile, Bailey is practically choking himself on Sy's stiff-as-a-board cock.)'Definitely a good first-experience here,' Sy tells Bailey at one point. And I have to agree. And wow, Sy just looks fantastic in this light. There's some sunlight cutting in through the blinds, hitting his smooth chest and ripped abs. Gorgeous.When Bailey starts going fast and furious, we hear Sy whisper, 'suck that . . . ,' which is quickly followed by him blurting out, 'You're amazing.' I think Sy's found a new love, and his name is 'Bailey's Mouth!' Sy reaches back to start feeling at Bailey's round butt. 'Is that where you want this dick?' Sy says. 'Eventually,' Bailey responds. But first he wants a taste of Sy's glorious ass.Sy slides down the bed, giving Bailey easy access to his ass as he flings his legs up in the air. 'First time for everything!' Sy says. Damn, I love guys that are willing to try new things! Bailey dives in deep with his tongue, giving Sy's ass a proper going-over. Sy, meanwhile, throws his head back, in awe of what's happening. Bailey jerks Sy off while shoving his tongue up inside him. 'That's awesome,' Sy says, in between pantings breaths and orders of 'Eat it!'Sy's so impressed by Bailey, he's got some plans in mind for him. Turns out, Sy's friend is waiting for him in the other room while Sy's taking care of business. 'I'll have to ask my buddy to come in here after,' Sy tells Bailey. 'I'm sure we can work something out,' Bailey says, but 'he's gonna have to wait his turn' until he's done with Sy.And now, the moment we've been waiting for: Bailey presents his ass up to Sy. Damn, it's so beautiful to see Sy's ass working in and out of Bailey -- Sy's perfect ass cheeks clenching as he motors in and out. Then, when the guys move so Sy's standing on the side of the bed, things kick into high gear. Sy's perfect little ass just goes to town, plowing Bailey from behind. I tell Sy to long-stroke Bailey's ass and it's just fabulous. Yes, fabulous. lol.Sy's so good with his hips, I think I need to get him a Chippendales outfit or something so he can works his go-go dancing magic for me. Watch for that video later! lol. (I'm kidding. Or am I?) The guys get on their side and Bailey's jerking himself to a frenzy while Sy pounds him from behind. 'Wanna cum in my mouth?' Bailey says to Sy. After a quick minute, Sy gets up and stands over Bailey, jerking himself right above his mouth. Soon enough, Sy is shooting his load all over Bailey's lips and tongue, and then slips his dick into Bailey's waiting mouth. Bailey sucks out the rest of Sy's cum, while jerking himself off, eventually shooting out his own load.'How's that for your first time?' Bailey asks Sy.'I might wanna do it again sometime,' Sy says, later calling it a 'life-changing' experience. Hot damn, we're in business!",
  "models": [
    {
      "name": "Bailey",
      "person_id": 35304
    },
    {
      "name": "Silas",
      "person_id": 35332
    }
  ],
  "release_date": "2013-03-10",
  "scene_id": 70650,
  "tags": [
    "Anal Sex",
    "Blonde",
    "Blowjob",
    "Duo",
    "Facial",
    "First Time",
    "Gay",
    "Tattoos"
  ],
  "title": "Bailey & Silas"
}