{
  "collections": [
    "Active Duty"
  ],
  "description": "Sexy Tatum is back and he's doing a whole lot of things he's never done before. He bottoms, sucks dick and kisses a guy for the first time tonight. Our pal Jake is the lucky guy that gets to lead him across the line, and I think it's a perfect match between these two. (A perfect match right down to their dicks: They're about the same length and girth!)We start off in the shower where the guys are already buck naked and I'm shooting the shit with them. Tatum's back in the real world now -- so to speak -- and he says he's ready to try new things. Luckily for him -- and for you -- hanging out with me can lead to *all sorts* of new things. lol.Tatum's appeared in three scenes for us before: A solo turned oral (where Dustin sucked him off), a three-way with Ransom and Taylor (where both of them bottomed) and then a scene where Blake took a pounding from Tatum. But, back to today: Jake rubs down Tatum in the shower before turning him around to get a handle on his already-hard dick. Jake goes to town, dropping to his knees and engulfing Tatum's thick dick in his mouth. Tatum puts his hand behind Jake's head, guiding him as he thrusts his hips forward, meeting Jake's mouth over and over.Jake stands up and starts planting kisses on Tatum's neck, shoulders . . . and then mouth. Tatum's tentative at first, but then starts kissing back. It's always great to see guys discover something and let the moment take hold -- and that's what we're seeing here. After their momentary make-out session, Tatum works his way down Jake's body, taking his cock into his mouth. I ask Jake how Tatum's doing for a newbie, and Jake smiles and says, 'He's doing great.' Tatum concentrates Jake's dick, jerking and sucking him at the same time -- occasionally pausing to take in the sight of Jake's massive dick. All the while, Tatum keeps jerking his own hard dick as we hear Jake let out little moans and sighs -- clearly pleased at what's happening.The guys move around so Jake can dive in and start rimming Tatum's virgin hole. 'Look at this tight little ass hole,' Jake says, slipping a finger in as Tatum jumps forward into the wall. Well, you would too if you've never had anything up your ass before! After a spell of ass investigation, Jake gets up behind him, teasing Tatum's ass with his dick, asking 'You about ready for this?' Tatum says he is . . . and away we go.Tatum and Jake get down on their knees, as Jake slowly -- slowly -- enters Tatum. Poor Tatum is clearly and truly an ass virgin as -- after Jake gets most of his dick inside him -- Tatum yelps out 'Jesus! God! Ok! . . . ' almost ready to tell Jake to get the fuck off of him. I tell Tatum that he's alright and Jake calms him down too and Jake slowly starts to get into a rhythm. Tatum's still kind of losing his marbles down there, but Jake keeps up the momentum. Jake looks up at the camera, smiles, and says 'This poor little virgin . . .' So lost in the moment, Tatum plum forgot the camera was on, telling me: 'You should be filming this.' I tell him, 'I am!' And he says 'Ok,' somehow relieved that I'm capturing the moment on video. Tatum's still rock hard, and Jake starts giving it to him harder. Tatum reaches down and starts jerking his own dick as we start to hear Tatum's ass slapping against Jake's thighs. Yes, things are getting *that* frenzied up in here.They switch positions so that Tatum's on his back, jerking his dick, while Jake fucks him from above. I get the camera up underneath the guys so we can get a good look at Jake railing into Tatum. Jake holds Tatum's legs in the air, continuing to plow him. 'You're a tight little ass hole,' he says. Tatum's still stiff as a board -- and still stroking hard.Jake pulls out and starts shooting onto Tatum's stomach -- and the look Tatum gives us is priceless. It's this glance of 'what the fuck, he's coming ON me?' lol. 'It's your turn to return the favor,' I tell Tatum. He grins, gets up and says 'Yup! Time to get fucked, you fucker!'Now Jake is on his knees with Tatum behind him, in a position a little more familiar to Tatum -- but not by much. He doesn't waste time, shoving his dick in and going to town as soon as he can. He builds up a steady rhythm, giving it to Jake as good as he gave. Soon enough, Tatum pulls out and starts stroking furiously. 'You gonna cum for me baby?' Jake asks, and Tatum pants out an answer: 'Yeah!' And cum Tatum does, smearing it into the small of Jake's back.",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Tatum",
      "person_id": 35258
    }
  ],
  "release_date": "2013-03-31",
  "scene_id": 70656,
  "series": "Geared Up 3",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Shower",
    "Tattoos"
  ],
  "title": "Jake & Tatum"
}