{
  "collections": [
    "Active Duty"
  ],
  "description": "In Sy's first appearance in front of the camera, he told us that his buddy Archer needed to get in on the action with Bailey. But there was a catch: Archer was actually outside the room, waiting on Sy. 'I'll have to ask my buddy to come in here after,' Sy told Bailey -- who was in the middle of slurping down Sy's cock. Bailey joked, 'he's gonna have to wait his turn!' The pair finished up, and Sy reminded me that Archer was gonna have to be next.<br /><br />(Eagle-eyed viewers may remember Archer from last May, when he did a solo for us. He's just as pretty today as he was then, and I think his body might be even more impressive now. He's got abs for days, muscles out to here, and thighs that are drool-inducing. I'm swooning, I know. I'll stop. lol.)<br /><br />So, as we open our scene today, I tell Archer and Bailey, who are sitting on the bed together, that Sy said he wanted to direct their scene. Yes folks, I handed off the camera to the guys for this scene -- and I think it turned out pretty hot.<br /><br />'So, you're in the hands of your buddy!' I joke to Archer, who laughs and looks at the camera in mock-shock. 'Perfect!' he says, sarcastically. 'Get that evil look on your face, Sy,' I tell him. 'Evil as fuck!' Archer laughs. You can tell the guys are buddies, so this is gonna turn out fun.<br /><br />From behind the camera, Sy tells Archer, 'Like I told you, he's really good' -- meaning Bailey's dick-sucking abilities. 'You need to let him work his magic on you as well.' <br /><br />'You're about to mesmerized,' Sy tells Archer, who reveals that he's never been with a guy before. Sy lets Bailey take the lead here, so Bailey gets Archer's shirt off -- and some jokes ensue about how Archer must work out . . . a little. lol. (His body is bangin'.)<br /><br />'You are just one sexy fuck, aren't you?' Bailey says. 'Yeah,' Archer agrees. LOL. That takes the cake. When Bailey yanks off Archer's jeans, he too is flabbergasted by Archer's thighs. <br /><br />As soon as Bailey starts to go to work on Archer's dick, the latter blurts out, 'Jesus, fuck!' Yeah, I think Archer's loving it. He intently watches Bailey go down on him, fascinated by this first-time experience. The guys run through a series of positions, with poor Bailey almost choking on Archer's dick at one point. 'Don't go so deep!' Bailey yelps, after Archer has face-fucked him while standing on the side of the bed.<br /><br />You'll have to watch to see how everything unfolds, but by the end, Archer tells Bailey -- who has a mouthful of cum -- that he is, indeed, 'amazing.' He tells Sy that it was 'fuckin' good.' Bailey jokes, 'So, you think you're gonna be with another guy anytime soon?' And, much to my surprise, Archer says, 'Hopefully soon. . . '<br /><br />I come in at the end ask Sy, 'How was it for you? Was it hot?' Sy also surprises me, saying 'It was very, very hot.' Archer: 'You liked it?' Sy: 'I liked it.'<br /><br />I can't wait to see what Sy and Archer do for an encore performance!",
  "models": [
    {
      "name": "Archer",
      "person_id": 35293
    },
    {
      "name": "Bailey",
      "person_id": 35304
    }
  ],
  "release_date": "2013-03-17",
  "scene_id": 70652,
  "series": "Drafted 5",
  "tags": [
    "Blonde",
    "Duo",
    "Gay",
    "Muscular",
    "Straight",
    "Tattoos"
  ],
  "title": "Archer & Bailey"
}