{
  "collections": [
    "Active Duty"
  ],
  "description": "Things get going in the shower, where the gents are soaping one another up into a lather -- both literally and metaphorically speaking. Zander soon drops down to his knees to take Tatum's big one into his mouth, all the while stroking his own ever-hardening dick. Tatum guides Zander's head by placing both hands on either side of his noggin' as water cascades down both of their bodies. Tatum is stiff as a board, and it's just so hot to see Zander licking up and down his shaft. His dick is the size of a small car. Did it get bigger since the last scene? I swear it looks bigger!The guys turn off the shower and move over to the tub, where Tatum leans back and lets Zander go to work. 'You taste so good,' Zander breathlessly says to Tatum, in one of the brief moments where his mouth *isn't* feverishly sucking Tatum. The guys exchange some hot talk back and forth while Zander keeps up the pace, groping Tatum's chest and pec muscles with his hands while blowing him.It's Zander's turn to get sucked, so the men switch it up so that Zander is standing above Tatum. 'Suck that dick,' Zander hisses at Tatum, who can only mumble 'mmhmmm' since he's got a mouthful of cock. Tatum keeps on stroking his own dick while swallowing Zander's piece. I get some hot under-the-cock shots where we can see Tatum's pretty lips working over Zander's dick.Oral fun is over with, as Zander gets down on his knees, ass up in the air, and says to Tatum, 'Come gimme that dick.' Tatum obliges, shoving his dick in -- while I'm underneath with the camera telling Tatum to 'open that tight ass up.' Zander grunts that it's been 'too long' since he's been fucked, and you can tell he's not joking.If you like your sex loud and moany, Zander is your man. The guy moans, grunts, yells and wails something serious. Seeing Tatum's dick split Zander in two is amazing -- and of course I'm down there telling Tatum to go 'deeper, deeper!' Of COURSE, I am. I'm here for you guys! lol.The guys switch positions so that Zander is on his back, with his legs resting on Tatum's shoulders. I get some great from-behind shots of the action, watching Tatum's pretty little butt piston in-and-out of Zander's ass. Zander's our own Little Red Riding Hood, telling Tatum that he doesn't want it too hard, too soft . . . but 'just right.' (Yes, really. lol. Gotta love him.)Soon enough, Zander has a coronary -- I mean, he shoots his load. Damn, that man is just a heaving MESS when he orgasms. It's insane. Next up is Tatum, who jerks out his load all over Zander's stomach, at Zander's urging: 'Cum all over me!' And that he does. Whew!The guys lean in for a kiss or two to close out the scene. I tell Zander 'welcome back' and he says, completely out of breath, 'thanks for having me.' And that's a wrap.",
  "models": [
    {
      "name": "Zander",
      "person_id": 35166
    },
    {
      "name": "Tatum",
      "person_id": 35258
    }
  ],
  "release_date": "2013-04-07",
  "scene_id": 70659,
  "series": "Reenlisted",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Shower",
    "Tattoos"
  ],
  "title": "Tatum & Zander"
}