{
  "collections": [
    "Active Duty"
  ],
  "description": "Today we meet Dalton, a 24-year old, aw-shucks kind of guy that just happens to be buck naked in my shower. You know me, I'm always catching guys off-guard in the shower when I've got a camera in my hand. lol.Dalton's been hanging out with me for a bit, getting to know some of the guys around here. And clearly, it's been a positive experience for us both. And good lord almighty, he's hung like a horse.In the shower, as he and his big dick and flopping around, he tells me, 'I didn't know if I was gonna have an audience, but you know, might as well.'I go and rustle up some, uh, 'audience' for him from the other room while he starts jerking for the camera.I return a little bit later, saying, 'Let's add a little bit to your audience,' and he jokingly says, 'uh oh?'In walks Sawyer, who is sporting a huge new colorful tattoo on his chest. He drops to his knees and starts slurping up Dalton's dick, which is a mouthful and a half. Dang. Sawyer's stiff as a board himself while sucking -- something we always like seeing. Enthusiasm! 'Makes me wanna suck on one,' Dalton says to Sawyer, enamored with Sawyer's skills. I quickly chime in, 'We got one for you to suck.' Dalton: 'Oh yeah?'Sawyer keeps up the pace, making love to Dalton's engorged dick. Dalton perches on the side of the tub, one leg up in the air, so we can get a good look at as muscular, hairy thighs. I get in close with the camera, zooming in on Sawyer's mouth going to town on Dalton's meat. 'Why don't you hop up here?' Dalton asks Sawyer, patting the side of the tub. Sawyer lays back and lets Dalton swallow down his dick. Dalton may be new to the game, but he's eager -- and Sawyer's sighs and gasps tell the tale of how he's enjoying the experience. 'How about we change things up a little bit?,' Sawyer asks Dalton. 'Why don't we see if I can fit that thing up my ass?'Dalton's game and soon enough, he's slipping in his big honkin' dick into Sawyer. Poor Sawyer, who exclaims, 'Dang, you got a big dick!' Dalton's getting into it, as he slaps Sawyer's ass while Sawyer is moaning and groaning at the other end. 'Oh good lord!' Sawyer yelps, 'Holy god!' Dalton rails him good, eventually getting him to flip over onto his back. Dalton seems to have found his sweet spot, as he starts growling in a deeper voice, 'You like that?!' Sawyer's into it, for sure, but he wants to know when he's going to have a turn at Dalton's ass. Lucky for us, Dalton's down to burn it down, so now it's Sawyer's turn to fuck!Sawyer slowly starts to work his dick in, while Dalton loses his marbles entirely. 'Your ass is tight!' Sawyer tells Dalton, who grunts out, 'Your dick is big!' It's pretty clear that Dalton's never done anything quite like this before, and his poor ass is getting a hefty first-time workout.Dalton is hanging in there though, jerking his still-hard cock while Sawyer gives it to him. I think Dalton might be speaking in tongues, since he's making noises and sounds you don't normally hear out of a human being. lol!Soon enough, Sawyer is convulsing and shooting his load all over Dalton's back. I think Sawyer may have had a mini heart attack in the process! Dalton has his turn to cum too, sending out a ropey load all over the floor. Phew!And that's a wrap on Dalton's debut!",
  "models": [
    {
      "name": "Sawyer",
      "person_id": 35300
    },
    {
      "name": "Dalton",
      "person_id": 35341
    }
  ],
  "release_date": "2013-05-12",
  "scene_id": 70669,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Shower",
    "Tattoos"
  ],
  "title": "Dalton & Sawyer"
}