{
  "collections": [
    "Active Duty"
  ],
  "description": "'I know you're really nervous,' Mike says to new recruit Jessie as tonight's scene opens, 'and you told me you don't know what in the hell you got yourself into.'<br /> <br />'But trust me, it will not hurt. I'm gonna leave you alone as much as possible.'<br /><br />And with that, Mike essentially lets Jessie take it away for his debut scene with us. Think of this as an ice breaker scene -- where the new guy is just getting a feel of how all this works and what it feels like to whip it out on camera.<br /><br />Mike's been trying to get Jessie to do a scene for something like six months now. So Mike must be pleased as punch that he got the 21-year old in front of his camera. Jessie stands 5'11' tall and weighs 145 lbs. He's from Tampa, Fla. and enjoys skateboarding and fishing.<br /><br />As soon as Mike's gone, Jessie starts groping his dick through his pants and feeling up his abs. He slowly works his hands across his chest, sensually giving himself a little rub down, so to speak. He eventually slips out of his shirt and jeans, revealing his thin, lightly-tattooed body. His dick is still hidden under his grey boxers -- but not for long. <br /><br />Soon he's jerking himself good and eventually Mike slips a hand in, going in for a little bit of help. I think Mike knows it's probably not the right idea at this point in time, so he only fondles Jessie for a brief moment before yanking his hand away and getting back behind the camera. <br /><br />Even after Jessie's shot his load at the end, Mike asks, 'Still nervous?' Jessie smiles, and answers, 'Little bit! It's a little weird.' But, he says he's 'for sure' going to come back.<br />",
  "models": [
    {
      "name": "Jessie",
      "person_id": 35339
    }
  ],
  "release_date": "2013-05-01",
  "scene_id": 70666,
  "series": "Bareback Base Camp",
  "tags": [
    "First Time",
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Jessie"
}