{
  "collections": [
    "Active Duty"
  ],
  "description": "Have we got something super special for you guys today: A three way with new cute red head Bobby, along with mega-hung Bryce and the always-adorable Marty. Hot damn!'That's a motley group there, I swear!' says our guest director friend Mike as our scene opens. Now, you just met Bobby a week ago, where he got friendly with Marty. Now, he's really taking things a step further.With Marty last week, Bobby only sucked Marty. (And didn't even get sucked himself!) Now, Bobby is ready to take a serious plunge: He sucks, gets sucked and fucks all in once fell swoop! And did I mention Bobby is hung like a stallion, too?So, we open with the three young gents on the bed, still wearing clothing. (I'm shocked! Usually, Mike already has his guys buck naked with nothing but a sheet to cover them up. lol.) Mike says he's going to leave them alone as usual and that they should just have some 'fun.'Well, fun is certainly had in this scene, as the guys start to go to work on their already-developing erections in their shorts. Bryce and Marty, who are no strangers to having worked in front of the camera, are quick to lose their shirts and shorts, clearly comfortable with their surroundings. Bobby is a bit more hesitant, but he comes around soon enough. Granted, he comes around with the help of Marty, who dives down on his dick and starts sucking away. Bobby is a tall guy, with the legs as long as a redwood. If only we had shot this in 3D, his feet would be coming through the screen!Soon, Bryce has bent over and started to blow Marty, who is still sucking Bobby. Marty seems to have a raging erection throughout the scene, so this is clearly working for him. lol. After a spell, Bobby leans over and goes to work on Marty, whose abs are looking mighty fine, if I do say so myself.It isn't long before the guys take matters into their own hands, and Bryce pulls Marty down the bed, laying him flat so he can have easy access to his dick. Next thing you know, Marty's ass is hanging off the side of the bed and Bryce is getting his dick nice and lubed up. When Bryce starts to enter Marty's ass, you can tell Bobby is really interested at what's going on. So interested, in fact, he's rock hard, jerking his dick over Marty's open mouth, letting Marty lick his balls. Marty grunts and takes Bryce's big dick as best as he can, only occasionally letting out a 'damn!' every so often. (This gets a chuckle out of Bryce, shortly before he starts pumping in and out of Marty's ass.)Bryce keeps on fucking *and* jerking off Marty -- who is stiff as a board. After a little while, the guys decide to switch things up so that Bobby has a chance to plow Marty. Man, once Bobby starts to get going, he does not let up! The man is machine, thrusting hard into Marty's ass. All the while, Marty is sucking off Bryce. Poor Marty (or lucky Marty?) is getting it from both ends and loving every minute of it.Just watching Bryce slap his huge dick across Marty's face is amazing. I mean, it's only as tall as his face, after all. lol. And, just wait until the guys shoot their loads, too. Bryce's, especially, is quite impressive -- and ends up all over Marty's chest.All of the guys seem in good spirits when the scene closes out, promising to come back, as 'always!'",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Marty",
      "person_id": 35307
    },
    {
      "name": "Bobby",
      "person_id": 35336
    }
  ],
  "release_date": "2013-04-21",
  "scene_id": 70663,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Gay",
    "Smooth",
    "Threesome",
    "Twink"
  ],
  "title": "Bobby, Bryce & Marty"
}