{
  "collections": [
    "Active Duty"
  ],
  "description": "Now, Ryan says he's never been fucked by a guy, but has been sucked off once. So we know he's willing to try new things. Mike says he wants to put him 'with a guy and see what happens,' but first he wants another solo out of him -- this time, with an ass show.Ryan flips over and lord almighty, I've died and go to heaven. His silky green shorts couldn't be any shorter, tighter or more revealing. Ryan slips a hand down his shorts and starts groping his own cheeks. 'You like your ass played with?' Mike asks. 'Yeah,' Ryan responds, quickly pulling down his shorts to reveal his bubble butt that just demands someone to dive into it. As we've said before, Ryan's legs are muscular and just beautiful. And now to finally see his ass paired up with those tree trunk thighs -- well, it's just awesome.Mike gets in close with his own hands now, helping Ryan a bit. Mike tells Ryan to 'spread your cheeks,' so Mike can drip a little lube into Ryan's crack. Ryan stars to play with his hole a little, lightly fingering himself. Mike gets in extra, extra close so we can see all of the action. We're afraid if Mike gets any closer, we'll be up inside Ryan!Mike tells Ryan to raise up on his knees so we can get a better view of the action. Mike then takes a squishy blue dildo and works it up and down Ryan's ass crack -- but doesn't go inside. Mike then throws caution to the wind and slips in a finger -- Ryan doesn't seem to mind, as he continues to jerk his own cock. While Mike doesn't actually get the dildo into Ryan, it's a good sign of potential things to come. Ryan closes out the scene by flipping back onto his back to jerk out his load. Ryan's a panting mess after he's shot his wad, and jokes how it was a 'very nice workout.' Ryan says he's definitely going to come back and do more, so we'll see just how far Mike gets him to cross the line. . .",
  "models": [
    {
      "name": "Ryan III",
      "person_id": 35334
    }
  ],
  "release_date": "2013-04-10",
  "scene_id": 70660,
  "series": "Bareback Base Camp 6",
  "tags": [
    "Gay",
    "Solo",
    "Uniform",
    "War Chest"
  ],
  "title": "Ryan III - 2"
}