{
  "collections": [
    "Active Duty"
  ],
  "description": "'Just how I like to see ya Marty . . . naked on a bed!'And that's how we open today's update, which stars our cutie-pie pal Marty and new adorable red-headed recruit, Bobby. It's brought to us by our old friend, guest director Mike. As our scene gets going, Marty -- with his beautiful hairless body and big dick -- is relaxing on the bed, buck naked, jerking his dick. Mike tells him that he has a surprise waiting for him, but, he doesn't want to spoil it . . . just yet. So, Mike tells him to just keep on jerking and he'll let him know when the time is right.A few minutes elapse, and Mike says, 'Can't believe you ain't asked me what I got in mind.' Marty chuckles a little, and Mike continues, 'Are you curious?' Mike says that earlier, Marty met Bobby -- a guy we haven't seen yet. And now, Bobby is going to do something he's never done before. 'What's that?' Marty asks. Mike says 'He's going to come over there and suck that cock for you.''You ready Bobby?' Mike asks, to the still-unseen Bobby. 'Yeah,' we hear from off camera.A few seconds later, Bobby has crawled up onto the bed and, faster than you can say 'HOLY HOT RED HEAD!,' Bobby's mouth is slurping down Marty's dick. 'Suck that dick,' Marty tells Bobby, who, for someone who has never done this before, sure has taken to it like a duck to water.'Has he got a nice cock?' Mike asks Bobby, mid-way through the scene. Bobby pauses, squints a thoughtful look, and says, 'Oh, definitely!' By the sounds and reactions of Marty, I'm not sure he's had this good of a blowjob in a long while. Marty reaches down and starts fingering his own ass while Bobby keeps on slurping away and jerking Marty's dick at the same time. The guys work up to a splattering finish, and they promise to come back for more. So, we'll see where Mike takes us with them!",
  "models": [
    {
      "name": "Bobby",
      "person_id": 35336
    },
    {
      "name": "Marty",
      "person_id": 35307
    }
  ],
  "release_date": "2013-04-14",
  "scene_id": 70661,
  "series": "Bareback Base Camp 3",
  "tags": [
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Smooth"
  ],
  "title": "Bobby & Marty"
}