{
  "collections": [
    "Active Duty"
  ],
  "description": "Our guest director Mike brings us up to speed on what's happening with one of his latest finds, Danny, as our newest video opens.Mike reminds Danny about how he asked him about 'trying something new' -- as in, more than just a solo jerk-off video. Danny says in his cute accent, 'Yeah, we did talk . . . well, I'm here . . . so . . . (I'll) give it a try.'Mike asks Danny why is he hesitant, and Danny says he's afraid of staying hard. Well, as Mike points out, that's a common problem, but it's nothing to worry about, and that -- of course -- he should give it the old college try. Lucky for Danny, he's already met Bryce, who is on hand, and has 'volunteered to do the honors,' as Mike says.Danny strips out of his clothes and gets to work on getting himself up to speed, so to speak. 'Nice looking, ain't he Bryce?' We hear Mike ask Bryce -- who is still off-camera. 'Yeah,' Mike answers, still out of camera range. We hear some shuffling around while we watch Danny stroke himself, concentrating on getting hard. Some time elapses, and Bryce soon joins Danny.Bryce walks into the frame, laughing, 'What's up man?' And Danny playfully responds, 'What's goin' on?' And then it's on like Donkey Kong, as Bryce gets down on his knees and starts slurping on Danny's dick. 'How's that Danny? You like it?' Mike asks. To no one's surprise, he says 'I like it!' lol. Soon, Danny is more into it, breathing heavy with his head thrown back, making little 'oohs' and 'aaahs' sounds. He tells Bryce to lick his balls, and Bryce does what he's told. Bryce reaches up to feel Danny's chest with his hand, and then Danny takes his own hand and places it over Bryce's. It's a little thing like this that -- while it seems like not a big deal, is actually quite intimate and suggestive of how in the moment Danny is.I'll let you see how the scene plays out, but I can bet you that Danny is going to return for some more new experiences with Mike and Bryce pretty soon!",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Danny II",
      "person_id": 35338
    }
  ],
  "release_date": "2013-04-24",
  "scene_id": 70667,
  "series": "Covert Missions 18",
  "tags": [
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Twink"
  ],
  "title": "Bryce & Danny"
}