{
  "collections": [
    "Active Duty"
  ],
  "description": "I've got a treat for you today. I imported one of my guest director friend Mike's men for a scene! Today we get to see Marty in action in front of *my* camera. Now, you're familiar with Marty, as he's been in a bunch of scenes filmed by Mike. But, this is the first time we've had one of Mike's guys come in and get down and dirty in front of my camera. Things turned out pretty interesting, and I think this could be the start of something cool if we get more of Mike's men into my clutches, I mean, studio. lol.Joining Marty today is the drop-dead beautiful Silas -- aka Sy -- who returns for his second scene with us. Sy is busy soaping up in the shower as our scene opens, getting all squeaky clean.'Where's that buddy of yours?,' Sy tells me while stroking his dick. 'Get him in here.''What you gonna give him?,' I ask.'This,' Sy says as he shakes his cock at me. 'You know what *I* want,' I tell Silas, who grins at me. 'Show me what I want.'And Silas does show me -- turning around to flash that heavenly ass of his. Lord almighty, they broke the mold with this one. Marty comes in and immediately drops to his knees to start servicing Sy. After a quick spell of sucking, he stands up and Sy starts lathering his backside, paying special attention to his bubble butt.When the guys stand side-by-side, it's amazing just how tall Sy is compared to Marty. Sy's easily a full foot taller than our little imported pal. Marty plants affectionate kisses on Sy's chest before dipping back down to gulp on Sy's dick again. Marty's a pro at sucking cock by this point, licking up and down Sy's shaft. Sy says 'just like that,' encouraging Marty, and asking him 'you like the way it tastes?'Sy tells Marty to hop up on the tub so we can see his ass. Marty gets up on all fours, showing off his clean-as-a-whistle rear end, asking Sy if he 'likes the way that ass looks?' Sy comes in for a closer look, taking both of his hands and clasping them on Marty's ass, spreading his cheeks apart. Sy investigates Marty's rear with his thumb as I comment, 'that's nice and tight, isn't it?' Sy just says 'mmmhmmm,' as he concentrates on the ass . . .  er matter . . . in hand.'I want you to fuck my ass,' Marty says, as Sy keeps on groping his rear end. A moment later, Sy is lubed up and sliding in to Marty's tight butt. 'You like that?' Sy says. 'Yeah,' Marty grunts out, 'damn your big.' I get in real close so we can see Sy going in and out while Marty jerks his stiff dick. Sy gets into a steady rhythm, as I pull out the camera to get a full body shot of the guys going at it. This is all still very new to Sy, but he's catching on pretty quick. Sy wants Marty's mouth back on his dick, so we switch it up a bit, for some more oral action. 'I don't know what's better,' Sy tells Marty, 'your mouth or that ass of yours.' After a little bit, Sy says, 'You ready to feel this in your ass again?' Marty eagerly replies -- as he takes Sy's dick out of his mouth -- 'yeah!'Marty gets on his back so Sy can fuck him while he jacks off. I get in close with the camera to see Sy's bodacious butt pound into Marty. Soon enough, Marty is shooting his load while Sy's still inside him. He blows, and Sy keeps on fucking. 'Damn that feels good,' Marty grunts. 'You like that Marine dick?' I ask him. 'Feels good!,' says Marty.'Shoot that load all over my face,' Marty says to Sy who is towering above him, jerking his dick mere inches away from his head. Sy blows his load all over Marty's cheek, which send is dripping down his face. 'We do things a little different out here,' I tell Marty, who smiles and nods in agreement. Sy's happy, Marty's happy, I'm happy . . . and now, as I tell the guys, it's time to 'go eat!' lol.",
  "models": [
    {
      "name": "Marty",
      "person_id": 35307
    },
    {
      "name": "Silas",
      "person_id": 35332
    }
  ],
  "release_date": "2013-04-28",
  "scene_id": 70665,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Facial",
    "Gay",
    "Shower",
    "Smooth",
    "Tattoos",
    "White Butt"
  ],
  "title": "Marty & Silas"
}