{
  "collections": [
    "Active Duty"
  ],
  "description": "'You . . . uh . . . jack off with a lot of guys?' Lance asks Marty, who, is sitting next to him on the bed. And blam, that's how we start off Lance's first encounter with another guy in today's update.Marty, possibly knowing if he says too much he might scare Lance away, only says, 'Jacked off a few of them . . . 'Lance is bewildered, shaking his head and says 'Never done anything like this before.''New to you, huh Lance,' our guest director pal Mike asks. 'Just a tad,' Lance says, making the understatement of the day. Mike leaves the guys on their own, and tells them to 'rub one out.' They start watching the off-camera porn while we hear the tiss-tiss-thump of some music playing. The two of them shove their hands in their respective shorts and start manhandling their meat. Soon, Lance is unzipping his fly and Marty is hauling out his big slab of cock. Marty slides his hand over to Lance's thigh, and Lance quickly side-eyes Marty, as if he's thinking 'what the fuck?' Marty starts to jerk Lance off and we hear Mike ask 'Is that alright?' Lance says 'That works,' and lets Marty go to work.'Can you jack him?' Mike asks Lance, who obliges, gingerly stroking Marty. Mike tries to ease the tension a bit by telling Lance that it looks like he's been putting on some more muscle (he's got a rocking body).Next up: Another new experience. Mike asks Lance if he would mind if Marty sucked him off. Lance says he doesn't mind, and Marty dives down onto Lance's dick. Lance says he's never had a guy suck him before, and by the looks on his face, Marty's mouth is something really special. lol.And, notably, Lance is harder now -- with his dick in Marty's mouth -- than he was earlier just jacking himself off. Lance is getting into it, saying 'Aw yeah, fuck yeah' and placing his hand on the back of Marty's head. When we see Lance's eyes roll into the back of his head, we know Marty's sucking him good. You'll have to see how things come to an end by watching the scene yourself!",
  "models": [
    {
      "name": "Marty",
      "person_id": 35307
    },
    {
      "name": "Lance II",
      "person_id": 35340
    }
  ],
  "release_date": "2013-05-19",
  "scene_id": 70671,
  "series": "Covert Missions 19",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "First Time",
    "Gay"
  ],
  "title": "Lance & Marty"
}