{
  "collections": [
    "Active Duty"
  ],
  "description": "Why, we've got ourselves an old fashioned three way here today on Active Duty!Our guest director Mike has wrangled Dan, Danny and Jason together for some oral action. Though we've only been recently introduced to Danny, he's been speeding right along, trying new things and turning into a great team player for Mike.Even more recently, Mike has brought in new guys Dan and Jason. Now, they got tossed into the mix real fast: Jason only did his first solo for us this past week in the War Chest Update, while Dan (with that rocking body of his), only did his first solo just the week before that.Lucky for Mike -- and us -- these three guys are open to crossing that proverbial line!As the scene starts, all three of the guys have their hands in their respective shorts, jerking frantically, while some off-camera porn blares. In between the squeals of the girl getting banged, Mike tells the guys he knows they are nervous, but that they'll 'get through it.' lol.Jason's a tall drink of water compared to Dan and Danny, as he's got to be at least a good six inches -- if not a foot -- taller than the other two dudes. Even sitting down, you can see just how big of a fella Jason is. Danny is a stiff as a board already, so clearly, something is working for him over there. Dan is the first to make his move, as he leans over and takes Jason's dick into his mouth. It's the first time we've seen Dan suck a dude, and he seems to be a quick learner, slurping down Jason's sizable cock swiftly. Jason reaches around and starts jerking Dan's dick while Dan sucks him, but then soon enough Danny slides over and starts fondling Dan's cock.'You like that cock Dan?' Mike asks. He can't answer, as he's got a mouthful of dick, but Danny -- who is lingering behind him -- smiles that knowing smile at the camera. He can tell Dan likes it.Danny switches position, climbing around Dan, and then takes Dan into his mouth. At this point, the scene is a blur of bobbing heads, slurping sounds and guys making those telling 'aaah' sounds that can only mean one thing.Danny moves around so he can get a taste of Jason's dick -- and Jason's loving every minute of it. The guys start to get a little talky here, with Jason growling at Danny, telling him to 'suck that dick.' After a spell, Dan leans back, and now it's time for Jason to suck some cock.Jason goes to work like his life depended on it, stroking and sucking Dan something fierce. Meanwhile, Jason himself is as hard as a rock, and he's getting jerked off by Jason. After a couple minutes, Jason can't hold back, and he's shooting his load high up into the air -- really. (Danny's mighty surprised by the height that he gets and smiles a big, broad smile. Love Danny's smile!)Jason hops up to clean up, so Danny leans in to help finish off Dan. Before we know it, Dan is tensing up and blasting his load all over his chest. By the end of the video, Mike is joking with the guys, saying how they'll be coming back, and that he 'can't get rid of' Danny. (And he means that in the best way possible, of course!)",
  "models": [
    {
      "name": "Dan",
      "person_id": 35343
    },
    {
      "name": "Danny II",
      "person_id": 35338
    },
    {
      "name": "Jason",
      "person_id": 35344
    }
  ],
  "release_date": "2013-06-09",
  "scene_id": 70677,
  "series": "Covert Missions 20",
  "tags": [
    "Blowjob",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Threesome"
  ],
  "title": "Dan, Danny & Jason"
}