{
  "collections": [
    "Active Duty"
  ],
  "description": "Guest director Mike jumps right into the action, apologizing to Brock and Danny for only introducing them a few minutes ago. Mike says he wants them to do a side-by-side jack-off and 'see where it goes.''Sound like fun?' Mike asks. Danny, who has only shot one scene with another guy, rubs his hands together and says he's 'excited!' while Brock chuckles a bit.Now, in Danny's earlier duo scene, he just laid back and let Bryce do all the work: Danny only got sucked off in that video. Today, things are going to be a little different, as Danny takes a step across the line and gives Brock a blowjob and jerks him off. We haven't seen blond Brock and his big dick in a while, so it's cool to see him back in Mike's open arms. Welcome back Brock!I swear Danny tells Brock that he's 'good looking' before he slips a hand onto Brock's thigh and starts to grope him a bit. Either my hearing is going or Danny mumbles. I, of course, will blame Danny's marble mouth. lol.Danny unbuttons Brock's shorts and slides his hand in, grabbing Brock's growing dick. Brock then takes it upon himself to undo Danny's pants and soon both guys have their hands in one another's pants. Danny shucks off his shorts, undies and T-shirt, leaving him stark naked next to Brock.'He's got a nice cock, don't he Danny?' Mike asks, as Danny jerks Brock. 'He does!' Danny says. Danny tries to chat up Brock a little bit, but he's really shy and a little awkward, but clearly into it.Danny leans down and starts to suck Brock, and as soon as he gets his lips around Brock, he shoots his load! Dang, he's a sensitive one. Mike says, 'can you give me another one?' Brock nods, so Danny keeps going, sucking Brock down until Brock shoots a second load. Then, Brock leans over and works Danny over with his hand. Soon enough, Danny takes over, eventually shooting his load all over his stomach.The post-sex chat with Danny and Brock hints that we get a second go-round with the guys . . . We'll just have to wait and see!",
  "models": [
    {
      "name": "Brock MB",
      "person_id": 35256
    },
    {
      "name": "Danny II",
      "person_id": 35338
    }
  ],
  "release_date": "2013-05-26",
  "scene_id": 70673,
  "series": "Covert Missions 20",
  "tags": [
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay"
  ],
  "title": "Brock & Danny"
}