{
  "collections": [
    "Active Duty"
  ],
  "description": "My long-time guest director Mike shot this video with Dale more than a year ago, and I've honestly had it on my 'to do' list for a long while now. I'm glad I finally sat down and rewatched it, because it's pretty nifty little video. <br /><br />In it, we meet Dale, and the first words out of his mouth are 'yes sir.' Well, ain't that a military man for you? Turns out, one of Mike's previous models, Kenny, suggested Dale for a shoot and brought him on over to Mike's place. Mike didn't know Dale from Adam until he showed up, so we're learning about Dale at the same time Mike does.<br /><br />Dale stands 5'9' tall and weighs in at 165 lbs. He says he's sporting a dick that's about 7' long. He's very nervous about this whole deal and pretty serious. He's so serious that Mike has to tell him to relax, which cracks a little bit of a smile on Dale's face. He says he's ready to get started, but wants to take a shower first. Mike doesn't mind, and says he'll follow him in there and start shooting. As Dale's lathering up, Mike takes it upon himself to cop a feel -- or two, as he slips a finger into Dale's soaped-up ass. <br /><br />They get back to the bed and Mike tells Dale to 'give me something good to watch.'<br /><br />The guys start talking, and Mike asks Dale if he's ever had a guy blow him. Dale says: 'I've let one guy suck my cock. It was kinda weird. I don't know if I'd be able to do it again.'<br /><br />So then Mike brings up how he fingered Dale in the shower. Dale quickly says: 'My girlfriend does that all the time. It feels really good.' But he says he wouldn't let a guy fuck him. Mike asks Dale if he'd be willing to try anything different, but Dale shuts him down real fast, saying that he wouldn't be comfortable doing anything more.<br /><br />On the other hand, he's all for having his ass fingered -- either by his own hand, or by the helpful hand of Mike. And we get a nice little ass show here from Dale before he blows his load.",
  "models": [
    {
      "name": "Dale",
      "person_id": 35342
    }
  ],
  "release_date": "2013-05-15",
  "scene_id": 70670,
  "series": "Bareback Base Camp 5",
  "tags": [
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "Uniform",
    "War Chest"
  ],
  "title": "Dale"
}