{
  "collections": [
    "Active Duty"
  ],
  "description": "We open the scene with director Mike asking Danny how it went the day before -- where he was paired up with Bryce the first time. Mike asks if Danny enjoyed getting his dick sucked by Bryce and Danny says 'oh yeah!' and that he 'enjoyed it.' Well, duh, wouldn't you?Mike, as usual, leaves the guys alone to let them get started without any interruption on his part. Danny swiftly loses his clothes, while Bryce is a slower to reveal his toned body. (Gotta love Bryce's fun boxer briefs -- lime green and tight in all the right places.)As the straight porn plays in the background, the two guys start to jerk their meat. Danny says he's a 'little bit' nervous. We can tell Bryce is anything but nervous, considering he's got a massive hard-on in his shorts already. Bryce reaches over to give Danny a hand, copping a feel and letting his hand wander. It's Bryce's hand that brings Danny's dick to life, as it gets hard fast in his hands. Bryce leans down and starts slurping on Danny's growing cock. Bryce is a pro by now at this, and Danny's in good hands (and mouth). Mike asks Danny, 'You've come this far, would you give it a try?' Try, as in, try sucking Bryce's dick. Bryce leans back and Danny reaches his hand over and grabs Bryce's mammoth dick. I swear, his dick gets bigger every time I see it. 'It's a big one ain't it?' Mike says to Danny, as Danny's fish only covers up less than half of Bryce's shaft.Danny starts to go down on Bryce, prompting Bryce to let out some moans of pleasure. Danny's tentative, naturally, but he's catching on fast. He jerks Bryce some more with his hand, alternately going back and forth between sucking and jerking. 'It's not so bad, is it?' Mike asks Danny, and all he does he laugh and shake his head side to side, indicating no.You'll have to watch and see how the scene turns out! I will tell you that there's a little surprise ass action at the end of the video, with just a touch of rimming. Who rims who? Well, you'll just have to check it out for yourself and see!",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Danny II",
      "person_id": 35338
    }
  ],
  "release_date": "2013-06-02",
  "scene_id": 70675,
  "series": "Bareback Base Camp 5",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay"
  ],
  "title": "Bryce & Danny II"
}