{
  "collections": [
    "Active Duty"
  ],
  "description": "'Got you back here,' director Mike says to Dan and Wayne, who are sitting on the bed, side by side. 'Two of my favorite victims,' Mike jokes.Now, despite how Mike makes it seem like we're familiar with Wayne, we've yet to meet this fine young man before. Unless, that is, my eyesight and memory are completely failing me, which is within the realm of possibility. lol. Wayne is sporting a big ol' cock that's already tenting his bright pink boxer briefs. When he hauls it out and starts swinging it around, Dan glances at it and I swear his eyes widen. The guys keep stealing looking at one another's dicks, trying to feel out where all this is going to go. (Mike told them to 'surprise' him with where their scene goes today, so we'll see what surprises they have in store.)The guys reach over and start stroking one another's dicks with gusto. That soon leads to some kissing, when then leads to their respective shirts coming off. Some more mutual jacking and smooching ensues, before Dan leans over and starts to give Wayne a blow job. Wayne is clearly loving it, asking Dan in a low murmur, 'Like sucking on my dick?' Dan lifts off Wayne's cock to respond with an 'Oh yeah,' before quickly slurping Wayne's member down once more. Wayne gives Dan a reach-around as he's getting blown, which leads to they men switching around so Wayne can give Dan some serious oral attention. Dan's in heaven, as his head is thrown back, eyes closed, and all he can do is moan 'oh yeah, oh yeah' as Wayne makes love to Dan's dick.Dan goes in once more for Wayne's dick, sucking it down. Wayne then asks, 'Want me to fuck you?' It's Dan's lucky day, it seems, as he readily agrees, hopping up on his knees and swings around to straddle Wayne -- facing him. Dan applies some lube to Wayne's dick and slides it in and start aggressively bouncing on Wayne. 'You like my dick in your ass?' Wayne says to Dan, as Wayne pumps in and out of Dan. All Dan can do is moan, sigh and say 'fuck yeah' under his breath as Wayne drives his big dick into him. Soon, Dan starts grinding his ass into Wayne, trying to get more of Wayne inside him. You'll have to see how things finish for yourself, but by the end of the scene, Wayne says he might be coaxed into coming back for an encore fucking good time. Let's hope Mike can lure him back -- that dick, that body, and those hips need to be put to work!",
  "models": [
    {
      "name": "Dan",
      "person_id": 35343
    },
    {
      "name": "Wayne",
      "person_id": 35346
    }
  ],
  "release_date": "2013-06-16",
  "scene_id": 70679,
  "series": "Bareback Base Camp 4",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing"
  ],
  "title": "Dan & Wayne"
}