{
  "collections": [
    "Active Duty"
  ],
  "description": "'You guys look good,' director Mike says to Dan and Wayne, who are sittin' and strokin' side-by-side on the bed. 'You alright Wayne?' Mike asks to the buff dude stroking his already stiff dick through his boxer briefs. 'Just fine,' he answers. 'Probably don't know what to think, do you?' Mike says. Wayne chuckles a bit and says, 'Eh . . . it's different,' but seems totally comfortable with his surroundings. 'You done good on your solo shoot yesterday,' Mike says, and Wayne concurs, 'I thought I did good!' lol. Got a love a guy with a positive attitude. (His solo has not been posted to the site, so stay tuned for it!)'Big nice cock,' Mike says, referring to Wayne's hidden monster. Wayne laughs, 'I try.''Dan,' Mike says to the other fella sitting on the bed, 'I don't know what to say about you. I can't get rid of you. You're always at my door!'Mike tells the guys to have some fun, and they say 'will do,' and Mike excuses himself for a moment. The guys get to it get quickly, shucking their briefs and they start jerking one another. Dan gets to the good stuff fast, diving down and engulfs Wayne's dick in his mouth. Wayne's totally into it, sighing and breathing hard and whispering approvals to Dan. 'Yeah, suck that big hard cock,' Wayne says to Dan as Wayne thrusts his hips into the air.After a while, Dan takes a break to lean back and stroke his own dick. Wayne isn't satisfied with that set-up for too long, as he waves his dick at him, saying 'Wanna suck my dick some more?' Dan jumps on Wayne's cock in about two seconds, slurping him down like he's just found water after going thirsty all day.Some time goes by and Dan once again leans back to focus attention on himself. Before you know it, Dan is blowing a high-spurting load all over his chest. Dang! Wayne follows, sending cum flying towards his dog tags.Turns out, this was Wayne's first time getting head from a guy, and he says 'It was pretty great.' And, as we already know, Wayne returned for another scene -- again with Dan. So make sure to check it out!",
  "models": [
    {
      "name": "Dan",
      "person_id": 35343
    },
    {
      "name": "Wayne",
      "person_id": 35346
    }
  ],
  "release_date": "2013-06-23",
  "scene_id": 70681,
  "series": "Bareback Base Camp 4",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off"
  ],
  "title": "Dan & Wayne (Oral)"
}