{
  "collections": [
    "Active Duty"
  ],
  "description": "Director Mike brings back two of his most valuable players this week: Bryce and Marty. Now, we've seen the sparks fly between these two previously, but tonight, Marty gets to do something he's never done with Bryce -- fuck him! (And then, for good measure, Bryce fucks Marty!)<br /><br />Mike opens the scene, greeting the gents: 'I heard back from both of you guys, and you said that you'd like to meet up with each other again, so, here we are . . . '<br /><br />Bryce and Marty look at one another, and then back at the camera, nodding their approval.<br /><br />'What do you think?' Mike asks -- about what, I'm not sure. lol.<br /><br />Bryce asks the question for us: 'What do you want us to do today?' (If only it were always that simple, am I right?) Mike says that he wants them to do whatever they want to do, and that he's going to leave them alone and let them do their thing. <br /><br />Bryce chuckles a bit at the situation, before immediately shoving his hand into his jeans. Marty joins him and starts to grope himself inside his pants. (Meanwhile, the straight porn is booming in the background, though I think Marty and Bryce are more interested in the porn that's developing in their pants!)<br /><br />The guys shuck off their jeans and get in close. They start to grope one another and make out, which is super hot. They've been together before you know, and I remember that seeing them kiss was a revelation then. And it still is! Bryce peels off his shirt while Marty eyes his chest, practically licking his lips. <br /><br />The underwear comes off and out come their big honkin' dicks -- Bryce and Marty have two of the biggest ones in Mike's stable of guys. Bryce dives down and starts sucking Marty, who sighs and moans 'Yeah!' in response to Bryce's skills. Marty leans over to take Bryce's salami into his mouth, and Bryce is loving every second of it. (Bryce's dick is huge. Like, 'slap you around silly' huge.)<br /><br />After some more oral action, the guys move around so that Bryce is on his back and Marty is lubing him up a bit. Bryce slides down to the edge of the bed to give Marty easy access, who approves: 'Just like that,' and then Marty drives into Bryce with his big dick. Bryce moans and grunts in response, while Marty blurts out, 'Damn!' Bryce responds by gripping the bedsheets as he throws his head around.<br /><br />Soon, Marty is pounding Bryce, and Marty whispers, 'About to cum!' A little more frantic thrusting, and Marty pulls out and shoots his load over Bryce. Both of the guys are a heaving mess, but the fun ain't over yet.<br /><br />Marty is up on his hands and knees now, while Bryce is behind him, getting ready to take his turn. Bryce has the equivalent of a German sausage between his legs, so he needs a lot of lube. lol. He slathers it on and slowly slides his meat into Marty. Bryce grabs hold of Marty's ass cheeks to guide himself in, and soon, he's up in him to the hilt. 'Ooh, fuck!' Marty hisses at Bryce, who slaps his ass in response. Marty bounces back onto Bryce's dick, continually wincing and grimacing at the pain (and pleasure) that Bryce is causing him. <br /><br />After some more energetic thrusting, it's time for Bryce so spew his load, which sails over Marty's lower back and ass. Whew!",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 35051
    },
    {
      "name": "Marty",
      "person_id": 35307
    }
  ],
  "release_date": "2013-07-14",
  "scene_id": 70687,
  "series": "Bareback Base Camp 6",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Duo",
    "Gay",
    "Kissing",
    "Smooth"
  ],
  "title": "Bryce & Marty - Flip-Flop"
}