{
  "collections": [
    "Active Duty"
  ],
  "description": "Big ol' thick-dicked Jason returns for his third scene with us, this time getting paired up with the sexy Wayne. I just love Jason's smooth, aw-shucks purdy chest. It's just *golden* in the light in this scene. He's pretty quiet as he starts jerking off his heavy piece of meat -- though he often looks up and around at what we *don't* see happening.What's happening that we don't see? Well, it would seem director Mike -- as he's known to do -- is off camera, whispering to an as-yet-unseen second guy. For all we know, he's jive talking someone into possibly sucking off Jason. (Or, he could be ordering pizza -- you just never know with Mike.)About mid-way through the scene, Mike comes back behind the camera and asks Jason how he's doing. He gasps, 'Pretty good,' as he spits into his hand and continues to self-lube his cock. Jason's balls hang seriously low, and bounce around as he works on his dick. Fans of low-hangers must love them some Jason, I tell you what.'Some big ass balls you got,' Mike says. Jason grabs his nuts, saying how he 'Got 'em from my Daddy.' 'You want some help?' Mike asks Jason. He practically hisses in return: 'Yeah!' We then hear a little whispering off camera, and then from out of nowhere, in comes Wayne.'Aw suck that!' Jason says, who has suddenly come alive once Wayne's mouth has engulfed his dick. Jason makes lots of guttural moans, blurting out 'fuck yeah!' in between deep sighs.Wayne takes matters into his own hands for a second, jerking Jason off, as Jason looks at Wayne with *that look* in his eyes. We think for a second that they might cross the line a bit further, but not today.When Wayne starts to choke on Jason, he knows it's time to step away from the festivities and let Jason stroke himself off. 'Just let me know when you're ready,' Mike tells Jason.  'Aw fuck, FUCK!' Jason yells, 'I'm about to fucking cum!' And cum he does, sending his load flying straight up into the air. Dang! 'How was that Jason?' Mike asks. 'Fucking good!' he says. And we're out!",
  "models": [
    {
      "name": "Jason",
      "person_id": 35344
    },
    {
      "name": "Wayne",
      "person_id": 35346
    }
  ],
  "release_date": "2013-07-07",
  "scene_id": 70685,
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off",
    "Smooth"
  ],
  "title": "Jason & Wayne"
}