{
  "collections": [
    "Active Duty"
  ],
  "description": "The Behind The Scenes disc is comprised of the best of the best narrowed down to two full hours of what happened when the camera's were supposed to be off. We captured so much hot stuff that is was hard to decide what to save, but I think we did a damn good job of saving the best. This to me is the highlight of the entire project as we get to see first hand what does happen when the camera's are supposed to be put away. Watching these guys and their crazy antics is as close to actually being there as it gets. Here's some of the highlights featured on the Behind The Scenes disc of Summer Recruits:In the kitchen, playing with meat. The boys have a debate and David and Dorian tell us what it means to be a Marine, David decides he's no camera man and passes the camera off so he can be in the spotlight. We take pictures of the guys with my iPhone so I can twitter them for your enjoyment. A late night, after-the-bars AD fashion show begins to unfold as David brings out some of his sexy underwear and bathing suits. The boys all seem eager to try them on so we have a fashion show of sorts.The fashion show soon turns into a five man circle jerk at 3 am with Dorian, Kaden, Brian, David and Domenic. These five recruits give it their all and David makes his rounds as the 'fluffer' as each guy unloads a huge wad. David moves over and takes Brian's hot load in his throat and Brian passes out in the chair right where he is. Dorian decides to take a Sharpie and write, 'I love cock' on Brian's chest. Hilarious barracks behavior right here at the beach.One of the hottest things for me in the Behind The Scenes footage was when Dorian gave Brian an official regulation Marine high and tight. I could barely keep myself breathing. All I could do was watch in amazement as Dorian showed off some serious barber skills. We took this barber shop visit to the next level and Dorian shaved Brian's asshole with the same clippers he'd used on his head. I fainted as I watched Dorian's cock rub against Brian's thigh as he cut his hair. Ever feel your barbers cock rub against your arm? Well, hopefully it was as hot as this.Conrad was stung by a few jelly fish out in the water during this trip and suffered some pain and discomfort from it. We put him in the bath tub and poured vinegar all over him. We threatened to piss on him and he didn't seem too against the idea. The disc ends with Conrad waving by to the camera as he sits in the tub soaked in vinegar.There's a ton of other great stuff on the Behind The Scenes disc, but I just wanted to highlight some of it here for you. You'll have to watch it yourself to see what else happened.",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "David",
      "person_id": 35073
    },
    {
      "name": "Kaden",
      "person_id": 35022
    },
    {
      "name": "Domenic",
      "person_id": 35080
    },
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Conrad",
      "person_id": 35066
    }
  ],
  "release_date": "2006-12-15",
  "scene_id": 70689,
  "series": "Summer Recruits",
  "tags": [
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Gay",
    "Group",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Straight",
    "Tan",
    "Tattoos",
    "Twink",
    "White Butt"
  ],
  "title": "Summer Recruits: Behind The Scenes Part II"
}