{
  "collections": [
    "Active Duty"
  ],
  "description": "Big ol' Bryce is sitting pretty next to Dan on director Mike's bed, and they are both ready for action. You know I love me some Bryce -- not just because he's hauling a mack truck between his legs either. He's just aw-shucks adorable cute, with a smooth body to boot.Bryce is already hard as a rock before we're even a minute into the scene, as his dick struggles against the fabric of his red underwear. He hauls out his cock and starts frantically jerking it, as Dan keeps on working his own cock. The guys strip out of their shirts and get closer to one another, shoulders touching. Now the briefs come off, and finally, the gents are buck naked together. And they get closer. And then they get handsy, as they both reach over and start giving one another hand jobs. Dan leans in for a kiss, and the passion ignites as the guys grab and grope one another as they make out and jerk each other. After a spell, Bryce heads south and starts sucking on Dan's dick. The latter throws his head back, eyes closed, moaning at the sensation.The guys lean back for a moment, and Bryce nonchalantly asks Dan, 'Wanna fuck me?' You don't have to ask Dan twice, as he immediately says 'yeah!' and the guys flips around and start getting ready. Before you know it, Dan is lubed up and fucking Bryce doggy style. Dan is pounding Bryce from behind, and we get to see Bryce's cute butt jiggle with every thrust into him.'Aww, you like that cock?' Dan says as he's pounding into Bryce, who blurts out, 'Yeah!' It isn't long before Dan is blowing his load all over Bryce's gorgeous ass. Bryce says 'You'll let me get you next time?' -- meaning, let him fuck him. Dan's game, but Mike says that he might have bitten off more than he can chew. So, we seem to know what's in store . . .",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Dan",
      "person_id": 35343
    }
  ],
  "release_date": "2013-06-30",
  "scene_id": 70683,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Smooth"
  ],
  "title": "Bryce & Dan"
}