{
  "collections": [
    "Active Duty"
  ],
  "description": "Today we get introduced to Vic, who is a 21-year old brunette stud that stands 5'10' and weighs about 180 lbs. The muscled, inked-up guy is paired with Drew for this scene -- who you met last week when he debuted on the site (and got fucked by new guy Corey!). Now, Vic's scene starts off as a solo -- his second, technically, for us. It's his second because Mike already filmed a solo with Vic, but we haven't shared it with you yet. We wanted to get straight into the good stuff -- and this is some good stuff, let me tell you!Vic yanks off his grey tank top and black track pants to reveal a sexy body, with just the right amount of hair on it. He's breathing hard as he jerks his dick and plays with his nipples -- focusing his eyes on the cock in his hands. When the scene started, Mike clearly says that Vic was back for another 'solo,' but I think we all know that Mike had other plans. A little bit into the scene, Mike jokes with Vic, asking him, 'when you gonna stop teasing me?' Vic: 'Uh, maybe today?'Luckily enough, Mike has Drew waiting in the wings (well, the shower), ready to go. A little banter ensues between Mike and Vic about what's going to happen, and Vic is down for a blow job, telling Mike to call Drew on in. A couple minutes go by and we hear Mike introduce the off-camera Drew to Vic: 'Vic, this is Drew . . . ' and then asks Drew, 'Can you help him out?' Drew quickly says, 'Sure can!' And we're off to the races!Mike tells Vic to tell Drew what to do, and Drew wastes no time:He waves his dick in the air and says, 'Come suck my cock.' And then, boom, in jumps Drew and away we go. After some oral action for a bit, it isn't long before Vic blurts out, 'Now I'm gonna fuck you.' Well, OK! Drew's all, 'I don't know if I can . . . ' Vic just answers with, 'Turn around.' Drew relents, 'I'll try . . . 'Vic pushes Drew down onto the bed and yanks off his shorts, revealing his smooth, white ass. 'Be gentle,' Drew says to Vic, who already has a tube of lube in his hand, ready to go.You'll have to see how things turn out, but I have to say -- it's pretty darn hot. (And it's clear the guys liked what happened -- Drew was in seventh heaven squirming around on the bed, while Vic's load was mighty impressive. Go watch!)",
  "models": [
    {
      "name": "Drew",
      "person_id": 35351
    },
    {
      "name": "Vic",
      "person_id": 35352
    }
  ],
  "release_date": "2013-08-11",
  "scene_id": 70696,
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay"
  ],
  "title": "Drew & Vic"
}