{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight we welcome back Brock and Bryce to the fold for another sizzling scene between them. But, there's a twist! Strangely enough, while we've seen these fine young gents do a number of things (together, and with others), there is still something that Brock has yet to do . . . But more on that in just a moment. <br /><br />Guest director Mike says that the guys were talking amongst themselves the other night, and they came up with an idea about how they wanted to do something special. Well, I'm all ears already!<br /><br />So, they called up Mike and said they wanted to do a shoot -- but didn't tell him what they wanted to do. 'Are you gonna surprise me?' Mike asks the guys. 'I think so,' Bryce says with a big smile, 'I think you'll be surprised.'<br /><br />'I think I've seen just about everything between you two,' Mike says, 'so this better be a good one.' Both Bryce and Brock chuckle at this, as Mike tells the guys he'll leave them alone for a bit to get comfortable.<br /><br />Now, Mike may have forgot -- but I haven't -- that Brock has yet to suck a dick. Yes, really. Somehow, after all of the scenes he's done for Mike, he's yet put a cock in his mouth. <br /><br />Well, all that changes tonight.<br /><br />After Mike leaves them alone, Brock and Bryce plunge their respective hands into their pants and start groping.<br /><br />Soon, out flops their whopping dicks. I swear, the size of their cocks always surprise me, even though it shouldn't. Bryce's alone is a two-fister (hell, three, if you have small enough hands!).<br /><br />After some mutual jerking, Bryce says, 'You ready for this?' Brock jokes, 'No, not really . . . ' but keeps on smiling. So Bryce says to Brock, 'You wanna suck my dick?' And away we go!<br /><br />Brock goes down on Bryce, keeping one hand on his shaft so he can jerk while sucking. Bryce is loving it, as he moans and sighs in approval. Bryce grabs Brock's head to help guide his mouth down, as Brock furiously sucks and jerks Bryce's huge meat. He comes off Bryce's dick for a moment, smiling a big wide smile, as he continues to stroke Bryce.<br /><br />Bryce pushes Brock over so he can get a taste of Brock's dick, which it almost as big as Bryce's. It isn't long before Brock gets his mouth back onto Bryce though! <br /><br />You'll have to see how things finish up on your own, but here's something to chew on for a bit: Brock says he's ready for the next step: 'getting fucked.'",
  "models": [
    {
      "name": "Brock MB",
      "person_id": 35256
    },
    {
      "name": "Bryce 2",
      "person_id": 35051
    }
  ],
  "release_date": "2013-08-18",
  "scene_id": 70698,
  "series": "Bareback Base Camp 6",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Smooth"
  ],
  "title": "Brock & Bryce - Oral 2"
}