{
  "collections": [
    "Active Duty"
  ],
  "description": "There's a first time for everything. And today, we get to see Jason get fucked for the first time!<br /><br />The lucky gent to take big tall Jason's Active Duty cherry is ultra handsome Wayne, who we've seen just once before in a hard core scene. (When he topped Dan.)<br /><br />Director Mike quickly bails out of the scene once the camera starts rolling, telling the guys that he want to leave them be and let them go at it without distraction. <br /><br />The guys peel off their shirts and start stroking their meat. Meanwhile, the off-camera porn is quietly entertaining the men. Granted, they seem to be slightly more interested in what's happening in their pants than what's happening on screen.<br /><br />After a spell, the guys start jerking one another off. It's fun to see the huge height difference between Jason and Wayne when they sit side-by-side. Jason has at least a foot on Wayne and it's easy to see. Soon, Jason is crawling over to Wayne and slipping his mouth over Wayne's stiff dick. Wayne sighs his approval, 'Ohh yeah,' as Jason goes all the way down on Wayne. <br /><br />For a guy with little facial expression -- Wayne is the strong silent type -- he really seems seriously into sucking Jason's dick with gusto. 'You like that cock, Jason?' Mike asks. All he responds with is a muffled 'mmhmmm,' as his mouth is full of WayneDick.<br /><br />The guys switch it up so Wayne can taste Jason's dick for a while. 'Aw fuck,' Jason blurts out in his deep voice, content with the treatment Wayne's mouth is giving him. They move around to a sixty-nine position, so they can blow one another at the same time. Mike gets some good shots of action here, getting in close and moving the camera around.<br /><br />Next thing you know, Jason is laying back on the bed, getting ready to take Wayne up his ass. Wayne grabs onto Jason's calves, suspending his legs in the air, and drives into Jason. For his part, Jason is holding on to Wayne's thighs as his thrusts forward. Soon enough, Wayne is spurting his load all over Jason's tummy, and then, Wayne jerks Jason off to completion.<br /><br />When all is said and done, Mike asks Jason if he likes getting fucked, and, surprisingly, he says 'a lot.' Mike says this wasn't Jason's first time to tango, but it was the first time he's done it for us -- so it definitely counts as a first time!",
  "models": [
    {
      "name": "Jason",
      "person_id": 35344
    },
    {
      "name": "Wayne",
      "person_id": 35346
    }
  ],
  "release_date": "2013-07-28",
  "scene_id": 70692,
  "series": "Covert Missions 19",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay"
  ],
  "title": "Jason & Wayne - Hardcore"
}