{
  "collections": [
    "Active Duty"
  ],
  "description": "Guest director Mike brings us two fine young finds in Corey and Drew today. We're just jumping into some hard core action with these guys, instead of introducing them to you in solos, as we normally would. Wait until you see their bodies! Lawdy. Toned, tight, pecs, abs. Hello!<br /><br />Mike opens the scene by saying how Corey and Drew are both coming back for a return engagement, and have agreed to do a side-by-side jerk off. (Obviously, that turns into MORE: By the end of this scene, Corey will have fucked a man for the very first time!)<br /><br />Corey's seemingly super eager to get going, as he exclaims: 'Trying something new!' Indeed, they are.<br /><br />Mike excuses himself for a minute while he lets the guys grope around in their shorts at their dicks. (Off camera, were hear the muffled sounds of Mike vacuuming. He's a multi-tasker!)<br /><br />Drew takes his shirt off, revealing a FINE chest. Smooth, broad, solid. Corey quickly follows, revealing his equally great chest and rippling ab muscles. Dang. These guys *might* work out -- just a little bit! lol.<br /><br />They are down to their underwear now, still pawing at their own dicks underneath the fabric. Soon though, Drew reaches over and grabs Corey's cock through his shorts. It's game time!<br /><br />Before you know it, Drew has taken Corey into his mouth and is going to town. Corey says it feels 'awesome' and is a lot 'better than a hand job, that's for sure.' He yanks off his briefs, saying 'That's awesome, let's keep that shit going.' Drew continues to suck Corey off as the latter feels up Drew's back. 'Your cock is huge!,' Drew says to Corey, as he tries to fit it all in his mouth.<br /><br />After a little bit, Drew says to Corey, 'You wanna put it inside me?'<br /><br />Corey: 'Fuck yeah I do.' So Drew starts to move around, as if he's gonna get read to get fucked. But Corey says, 'Not yet. I don't wanna do it quite yet.' Instead, Corey wants to suck Drew off for a little bit.<br /><br />After a little more oral action, Drew gets up on his hands and knees, with Corey behind him. 'You'll be alright,' Corey says to a panting Drew, telling him, 'I'll be gentle.' Drew warns him that he's 'very tight.' Corey lubes up a finger and starts working it into Drew's ass, while Drew just moans and grunts in return. Soon, Corey has two fingers up Drew's ass, telling him to 'just relax.' Corey switches out his two fingers for a thumb instead, as the finger-fucking continues.<br /><br />Drew isn't sure he can do this, saying he 'can't.' Corey isn't taking no for an answer, promising him that he'll be gentle. Drew believes him, as they reposition and Corey gets behind him, dick in hand. 'Ready?' Corey asks. 'Ready,' Drew says.<br /><br />In goes Corey . . . and Drew gasps. 'Feels fucking amazing, don't it?' Corey says. All Drew can say between pants is 'Oh shit! Oh fuck!' as he whips his head back and forth in the air. Mike, who tells Drew not to 'fight it,' gets in close with the camera so we can see Corey moving in and out at an ever-increasing pace. 'You're so fucking tight!' Corey says. 'Your cock is big,' Drew manages to mumble out between gasps.<br /><br />Soon Drew is laying flat on his stomach, head into the mattress, as Corey drives into him from behind. All we hear is frantic breathing and muffled moans. 'You just gotta breathe,' Corey tells Drew, as he massages his shoulders, trying to loosen him up. 'Starting to feel good?,' Corey asks Drew. 'It's still too tight!,' Drew says.<br /><br />As we approach the end of the scene, Drew's feet are curling up and he's muttering 'oh shit!' as Corey tries to get farther inside him. Drew keeps scurrying away from Corey's jackrabbit pumping. If you like watching someone who is actually -- truly -- trying to get used to being fucked for the first time -- this is it. No joke. <br /><br />Soon enough, Corey is shooting his load all over Drew's back, who is exhausted! Corey says Drew was 'tight as hell!,' and Drew says that it was definitely an 'experience!' They guys have a fun little post-sex chat where Drew says it was amazing and that 'practice makes perfect.'",
  "models": [
    {
      "name": "Corey",
      "person_id": 35350
    },
    {
      "name": "Drew",
      "person_id": 35351
    }
  ],
  "release_date": "2013-08-04",
  "scene_id": 70694,
  "series": "Bareback Base Camp 6",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "Smooth"
  ],
  "title": "Corey & Drew"
}