{
  "collections": [
    "Active Duty"
  ],
  "description": "After Kaden introduced us to Jason this past Wednesday in War Chest, the new recruit is back -- and has already been fast-tracked into hard-core action!Jason joins up with fellow newbie Andrew for a sucking-and-fucking good time in the shower, directed once again by Kaden. Andrew is a tan 5'6', compact fella with muscles in all the right places. As the scene opens, Kaden reminds us that Jason has just done his first solo scene, while his new pal, Andrew, also just shot his first scene. But, he skipped straight past a solo and sailed right into hard core. 'You just came right out of the gate,' Kaden says to Andrew. He jokes a bit and says something along the lines of 'Hey, you know, step to the edge of the cliff and jump, right? Can't just stand there.' I can't agree more Andrew!  (The cliff-jumping scene Andrew is talking about will be posted later, so I won't spill the beans on what happened in it, and who it was with.)Kaden says that because of Andrew's experience, he's the one who should be leading Jason along in their scene together. 'He looks a little nervous,' Kaden says, as Jason breaks out a big smile across his face. The guys are watching some off-camera porn, and Andrew notices something, and says, 'See, now that girl, and *that* girl, with a two-sided dildo is just all kinds of fun.' (I'm already picturing what in the world these boys were watching.) 'I mean, I don't know about you,' Andrew says to Jason, 'but I would love to be between that.' Jason smiles, 'Yeah, I would too!' 'And in the shower too,' Andrew continues, 'and we're already in that bathroom. Damn.' (Oh, I can see the wheels spinning in Andrew's head. But alas, there are no ladies to be found today, nor double-sided dildos. Just two dicks waiting to be manhandled. . . )The guys shoot the shit about being in the military and then say how they both need to take a shower and get cleaned up. Off come the T-shirts and some tattoo talk ensues. Andrew asks Jason to show off his physique, since they've both said they've been working out. (I like the way this Andrew fella thinks!)After some more talking, the guys hop into the shower and Andrew starts lathering up Jason. 'You gotta get the hot spots,' Andrew says, 'all the places that are real sweaty,' grabbing Jason's dick. Ok, Andrew ain't playing. LOL. The guys start jerking one another a bit, and Andrew jokes, 'Don't forget to wash it, now!' Jason chuckles at that, but they don't stop working one another's cocks. Andrew is the first to drop to his knees, taking Jason's dick into his mouth. Jason's cock soon comes alive as Andrew sucks him down, eventually pushing him down so he's sitting next to the tub. 'I think I'd like to try that,' Jason says to Andrew, as the guys switch around so Andrew is standing up. Jason grabs onto to Andrew's big dick and starts sucking with gusto. I don't know if Jason's ever done this, and if he hasn't, he's taken to it like a duck to water. 'You're pretty good at that,' Andrew says, before he gets back down on his knees to slurp up Jason some more.'I think I wanna try what they're doing in the porn,' Andrew says to Jason, looking up at him. 'Think I want you to put this in my ass.' Well hot damn! 'I think I might like that,' Jason says, and Andrew smiles a big toothy grin, saying, 'I think I might too!'Andrew's bent over on his hands and knees, with Jason behind him, slowly attempting to enter him. We can hear Andrew panting a little bit, not sure if he can take Jason or not. He gets inside him a little bit, but he can't take it. Jason says that they're 'not quite ready for this,' but that he wants Andrew to try fucking him. 'I can definitely do that,' Andrew says, grinning.They switch positions and we soon see Andrew slink his entire long dick up inside Jason. Damn! No 'oh, just the tip' crap here folks. Kaden is so close to Andrew's head, we can hear him gasping for air as he thrusts inside Jason. Kaden moves the camera around so that he's in front of Jason, so we see both of their faces. Andrew says, 'You like that? Is that what you were curious about? You're so tight.' Jason, being thrust forward by Andrew's fucking, says, 'Yeah! You're so big!' Andrew and Jason switch positions again, so that Jason is on his back and his legs are being held up in the air by Andrew. We get some awesome shots of Andrew's ass thrusting into Jason, as he suspends Jason's legs. Kaden gets the camera overhead so we can see some maximum long-dicking by Andrew into Jason, as the guys thrust towards completion. Soon, both gents are jerking their dicks furiously, with Andrew still hovering over Jason. Andrew shoots all over Jason's thigh and a half-second later, Jason is spewing his load into the air and onto Andrew's chest and abs. Nice job guys!'You cum pretty good there,' Andrew says, laughing, as Jason chuckles back. The scene transitions to the post-show wrap-up with the guys sitting by the tub. Kaden says, 'God, that cum shot was fuckin' magical!' Andrew: 'Right?! Perfect. In sync.' Kaden: 'You can't fake that perfect in a movie!' Andrew: 'That's good chemistry!' 'I gotta say Jason,' Kaden continues, 'you fuckin' surprised us all.' Jason smiles, and seems bashful about what just happened, hanging his head. lol. 'How was that for your first time?' Kaden asks. 'Well,' Jason says, before pausing for a second or two, 'It was different.' Kaden and Andrew laugh, 'It was different!' Jason joins in with the chuckles, saying, 'I'll leave it at that.' Kaden says, 'You didn't enjoy it? At all?' Jason: 'I don't think anybody does their first time. I don't know. Maybe I'll get used to it.'Kaden gets the guys to give a good-bye kiss to the camera. 'Aww, ain't that sweet,' Kaden says. And I agree!",
  "models": [
    {
      "name": "Jason II",
      "person_id": 35353
    },
    {
      "name": "Andrew II",
      "person_id": 35354
    }
  ],
  "release_date": "2013-09-15",
  "scene_id": 70707,
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Shower"
  ],
  "title": "Andrew & Jason"
}