{
  "collections": [
    "Active Duty"
  ],
  "description": "Tito's back again!I'm behind the camera as we open on Tito, who is showering up. I tell him that he surprised me the other night when I met him and he did his first solo for us. 'Why's that?' Tito asks me. 'Well, when you said 'let's stop by the adult store and get a toy. . . ' Suddenly Tito remembers, 'Aw yeah. . . ''You picked out a pretty good sized one,' I continue, and Tito just laughs at the camera. 'And then you manhandled it!' Tito interjects: 'I did alright.' (You should go check out Tito's solo. It might as well be called a duo, since his guest star was a hefty-sized dildo.)I tell him, 'I was like, 'I think somebody's been here before!' Tito chuckles in response, saying to me in that deep voice of his, 'Maybe once or twice.'Well, it's Tito's lucky day, and that 'once or twice' will soon become a third time, as he'll be joined by Riley tonight for some serious man-on-man fucking action. I tell Tito that it's time to put the toys away and get a real man in there -- and that real man is Riley. In comes Riley, already stark naked. The muscular stud has a little bit of ink on him and a devilish smile. He walks up to Tito, inspects the goods, and jokes with me, saying, 'You found me a cute one, didn't ya?' It isn't long before we're off to the races and Tito has Riley's dick in his mouth, slurping and sucking away. Man, Riley's ab muscles are insane -- they flex and bulge out with every little move he makes. 'That's a hard fucking cock,' Tito says as he pops Riley's dick in and out of his mouth. Riley blurts out, marveling at Tito's sucking skills, 'You've done this before!' Tito, in a bit of honesty, says, while shaking his head, 'Not a lot.'Riley lifts up Tito and pushes him back to the side of the tub, sitting him down. 'My turn,' Riley says, as he gets down on his knees to engulf Tito. It isn't long before Riley is asking to see Tito's ass, and Tito is quick to oblige. He stands up, turns around, and bends over. 'You like that little ass?' Tito asks Riley. Riley's in love, soon asking if Tito wants him to fuck him in the ass. Tito's down to burn it down, and before you know it, Riley is slipping his cock inside Tito.'God, you got a tight ass!' Riley says, gasping for breath as he thrusts into Tito. Tito snarls and bucks his ass back, still sporting a big boner while getting fucked. 'You like that?' Riley says, as Tito fucks himself on Riley's 'thick fat cock' (Tito's words!). The guys switch around so that Tito is sitting on Riley's dick, and goes for the ride of his life. Riley jerks Tito off while he's bouncing on his dick, clearly in seventh heaven. I get in close with the camera to see Tito slowing fucking himself on Riley's dick. These guys are seriously enjoying themselves, and it shows. 'Aw, fuck that's deep!' Tito says, as Riley thrusts up and into his ass.Tito starts to slam-fuck himself down on Riley, causing his stiff dick to windmill into the air, flying around, slapping his belly. Dang! 'You like it when I ride it?,' Tito growls at Riley, looking back at him, seemingly seeking approval. Tito is certainly talented in the arena of energetic fucking, that's for sure! Tito's having such a good time, he jerks himself off while riding Riley, sending his load flying into the air and all over the ground. It's Riley's turn to cum, and he stands over Tito, shooting his load all over Tito's stomach -- and 'right into your bellybutton,' Riley jokes. But wait, there's more! We've got some 'director's cut' bonus scenes for you: The guys are back in the shower and Riley is sucking off Tito something fierce. 'Aw, that feels fucking good,' Tito says, looking down at Riley, who is slurping down Tito's dick with gusto. We then switch back over to more fucking, with Tito on his back and Riley standing. We get some glorious views of Riley's muscular legs and ass pumping into Tito that you're just gonna love, trust me.Kaden finishes directing this scene, telling the guys that they did a great job. He asks Tito what he thought of Riley. Tito jokes that Riley is 'a lot to take in, that's for sure.' Riley says they 'had some fun' and that he's 'looking forward to the next time.' Oh really? Well, we shall see when that next time might come! Stay tuned!",
  "models": [
    {
      "name": "Tito",
      "person_id": 35355
    },
    {
      "name": "Riley II",
      "person_id": 35356
    }
  ],
  "release_date": "2013-09-22",
  "scene_id": 70709,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Smooth",
    "Tattoos"
  ],
  "title": "Riley & Tito"
}