{
  "collections": [
    "Active Duty"
  ],
  "description": "'You guys alright?' our guest director Mike asks Drew and Wayne, who are almost buck-naked on the bed.<br /><br />'Yes sir!' says Drew, who is busy groping himself through his thin grey boxer shorts.<br /><br />Mike leaves the guys alone 'for a minute,' as per tradition, and a mere few seconds later, the boxers are off and big erect dicks are sprung at attention. Wayne and Drew start giving one another some mutual masturbation love, and Drew immediately says that it 'feels real good.' It isn't long before his eyes are closed and he's living in the moment. <br /><br />Drew feels Wayne's big thigh, stroking it up and down, admiring his thick leg muscles. He can't resist the temptation of Wayne's third leg though, and dives down to engulf Wayne's dick in his mouth. 'You like sucking that cock?' Wayne asks Drew, as he reaches around to jerk Drew off. 'Mmmhmmm,' Drew affirms, with a mouth full of dick.<br /><br />Drew is doing a mighty fine job sucking Wayne, if I do say so. He's still new to all of this, but he's taken like a duck to water. After a little bit, the guys switch positions so that Drew is up on his knees, and Wayne is leaning down to blow Drew. The loud, slurpy action is pretty hot here, as Wayne goes to it with gusto, alternately jerking and sucking Drew -- who looks to be having a glorious time. <br /><br />'Do you wanna fuck me?' Drew asks Wayne. 'Mmhmmm,' Wayne says, adding, 'Do you *want* me to fuck you?'<br /><br />'Yes,' Drew answers with a little sigh, as he shuffles around on the bed, and lays down on his stomach. <br /><br />We hear the squishing of lube off camera as Wayne slathers up his dick. It isn't long before he's entering Drew from behind. 'Ahh, just like that,' says Drew in a half-moan, as Wayne fills him up.<br /><br />Mike gets in close with the camera so we can see the thrusting up close and personal -- and hear Drew panting like a dog in the summer time. Wayne starts to pick up the pace as Drew grimaces and grips onto the bed, holding on for dear life. 'Oh fuck! Slow down, slow down,' Drew says, but Wayne doesn't -- and just keeps on plowing him hard. 'Fuck, it's too big,' Drew yelps, while Wayne continues to slam him.<br /><br />The guys change positions so Drew is up on his hands and knees, with Wayne still taking him from behind. 'You like that cock in your ass?' Wayne asks Drew, who mutters 'Ooh yeah, it feels good.'<br /><br />Wayne is picking up the pace a bit as we throttle towards the end of the scene, while Drew alternates gasping for air and saying 'Oh shit, oh fuck!' repeatedly. lol. <br /><br />'I'm about to cum,' Wayne whispers, as he thrusts faster (and Drew grabs onto the sheets). Wayne pulls out and shoots a big streaming load all over Drew's back. Whew! 'You like that cum on you?' Wayne asks Drew, who of course says 'oh yeah.'<br /><br />The guys get back onto the bed side by side, as Wayne slaps Drew's chest, saying 'good job! you took it like a champ!' I like it when the guys are encouraging of each other like this! Heh. Wayne starts to jerk Drew off, thus making sure that both gents have shot their wad. Drew finishes himself off as Wayne watches intently next to him (with his own dick standing at attention once again). 'Oh shit, oh shit!' Drew blurts out, and boom, he's blowing his load all over his stomach.<br /><br />Drew's already saying he's ready to go again, so we'll see where he takes us next!",
  "models": [
    {
      "name": "Drew",
      "person_id": 35351
    },
    {
      "name": "Wayne",
      "person_id": 35346
    }
  ],
  "release_date": "2013-09-08",
  "scene_id": 70705,
  "series": "Bareback Base Camp 8",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Smooth"
  ],
  "title": "Drew & Wayne"
}