{
  "collections": [
    "Active Duty"
  ],
  "description": "Guest director Mike wastes no time with introductions as we dive into today's scene -- with familiar favorites Bryce and Dan.After Mike asks the guys if they are ready, he steps away from the camera, letting the men get a grasp of the situation . . . in their pants. (Zing!) I love how Bryce is wearing a Superman T-shirt in this scene -- especially because  he's super hung. I know I always ramble about his package, but I mean, lawd, he's enormous. Once it comes slinking out of his jeans, we get to marvel at its size once more: Yes, indeed, it's as big as a baby's arm.Mike asks Dan what he thinks of Bryce's cock, and he nods happily, 'It's nice.'Then comes a moment that's kind of funny -- and this just adds to the realness of the situation -- we hear some random people passing by outside of Mike's place. Bryce and Dan's eyes quickly dart over to the door, probably wondering, 'what the hell is going on outside?' Luckily, nobody knocks on the door, but we can hear people carousing and carrying on outside.As it turns out, when Mike shot this video, Dan had only filmed a couple scenes -- so he was still pretty new to this. Of course, since then, he's gone on to do hard core for us. But, at this time, everything was still shiny and new for him -- so to speak. The guys start mutually jerking one another, which leads to blow jobs all around and then some passionate kissing. The guys impressively go through a series of positions, letting the camera get lots of views of the action. Bryce and Dan sixty-nine, and then Bryce gets up on his knees so we can get a glorious view of his perfectly-shaped ass while Dan sucks on him from underneath. Dang.You'll have to see how things progress through the scene, but I tell you what: I was happily impressed by the action (and the square footage covered on the bed!).",
  "models": [
    {
      "name": "Bryce 2",
      "person_id": 2
    },
    {
      "name": "Dan",
      "person_id": 35343
    }
  ],
  "release_date": "2013-08-25",
  "scene_id": 70700,
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Twink"
  ],
  "title": "Bryce & Dan - Oral"
}