{
  "collections": [
    "Active Duty"
  ],
  "description": "Guess who is back behind the camera tonight? Kaden!That's right, one of our very favorite Active Duty stars is back in the director's chair, and he's found some hot new talent for us. I'm super stoked about what our dear Kaden has brought us and I can't wait to share his finds with you!First up tonight is Jason, a 24-year old cutie that's never done anything like this before. He says he's a 'little bit' nervous to Kaden, who is manning the camera, quizzing his new friend. Jason hails from Washington, though he's got a little bit of a Southern twang in his voice -- as Kaden points out to him. The 'part city boy' stands 5'10' and weighs in at 157 lbs. and has brown hair and brown eyes, 'obviously,' he jokes.Jason works out every day -- 'twice a day.' Kaden compliments Jason on his physique and then tells him to get comfortable and start perusing the porn that's playing off-camera. 'Don't mind me,' Kaden says, 'I'll just be here . . . watchin'.' Jason settles in and soon peels off his shirt and pants, revealing a toned body and a pair of round pecs that you could just eat up. Soon, his sizable dick is curving into his hand and Jason is popping into the shower to lather up and get squeaky clean. I was surprised when Jason came, because he's such a quiet guy, that when he did shoot, he was grunting up a storm and shooting a whopping load all over his chest.'That was hot Jason!' Kaden tells Jason, who just laughs at Kaden's shock at the volume of cum on Jason's chest. Kaden then asks the big question: 'Do you see yourself ever doing this again?''Yeah I do, actually,' Jason says, 'Thought about this when I was young. Always imagined what it'd be if I could be a porn star. I never thought I had it in me . . . 'Will Jason do more with us? If Kaden has anything to do with it, I bet he will!",
  "models": [
    {
      "name": "Jason II",
      "person_id": 35353
    }
  ],
  "release_date": "2013-09-11",
  "scene_id": 70706,
  "tags": [
    "First Time",
    "Gay",
    "Jerk Off",
    "Shower",
    "Solo",
    "War Chest"
  ],
  "title": "Jason II"
}