{
  "collections": [
    "Active Duty"
  ],
  "description": "Today's scene is a long one! It's 45-minutes \u001f-- so get a drink, some food, and settle in for a lengthy gander and Andrew and Riley.In it, Andrew bottoms a little bit for us, but can't handle it for too long. He's still getting the handle of taking a dick up his ass While he got a bit of Jason up in him, he immediately knew he wasn't ready. Today though, we get some full-on insertion and a bit of fucking before Andrew calls it off. (We'll get him to bottom, for reals, soon enough.) Before Andrew attempts to bottom with Riley, he gets some ass-attention from Riley, who works him over with a little butt plug in order to get him ready for the real thing. Andrew, after the dildo action, basically tells Riley 'so are you going to put your dick in me or what?' Riley says he's ready and the guys go for it -- but Andrew can only hang in there for a little bit. Luckily, Riley is a trooper and offers to bottom for Andrew.You know, I'm thinking this was all Andrew's way of just getting to fuck Riley. lol. Now, I skipped ahead to the ass action here in my little write-up of the scene. Well before that happens, there's of course a lot of action. The guys shoot the shit about the straight porno they're watching, compare bodies (and abs!), and trade blow jobs. But let's get back to the fucking. The guys switch it up and and Riley takes Andrew like a champ. (Though there is a lot of serious panting and deep breathing going on. Remember, these boys are straight. This truly is new territory for them. So I say: Kudos to taking it like a man!)Andrew slowly works up to a pounding thrust that shakes the bed something fierce, before shooting his load all over Riley's chest. The guys canoodle afterwards on the bed, looking like the bestest of new pals. Kaden asks how was their first time, and Andrew says, 'First time's a charm?' Riley jokes that he doesn't think Andrew 'has a girlfriend anymore.' LOL.",
  "models": [
    {
      "name": "Andrew II",
      "person_id": 35354
    },
    {
      "name": "Riley II",
      "person_id": 35356
    }
  ],
  "release_date": "2013-09-29",
  "scene_id": 70711,
  "series": "Ambushed",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Duo",
    "Gay",
    "Tattoos"
  ],
  "title": "Andrew & Riley"
}