{
  "collections": [
    "Active Duty"
  ],
  "description": "'Got my three favorite victims here,' says guest director Mike as we open on today's scene. And said 'victims' (he means it in a loving, term of endearment-way, obviously) are Drew, Vic and Wayne, who have joined together for a very special three-way.'Y'all asked the question, 'what are we going to do?',' Mike says. Surprisingly, he answers their own question for him: 'That's up to you.' I see, it's a self-directed scene today. Well, let's see where these gents take us on their self-directed journey! 'I like to see it just happen,' Mike tells the guys. And buy 'it,' he means the sex, obviously. So, where will 'it' go today? Let's find out.Off come the pants, the shirts and the shorts, and we're left with three stark naked guys with boners at attention. Wayne grabs Drew's dick, Drew grabs Vic's dick, and we've got a little daisy-chain of jerking action. Soon, Drew has leaned over to take Vic's dick in his mouth, while Wayne continues to give Drew a hand job.It isn't long before Drew has relinquished Vic's dick and moved over to Wayne's member, to give him some oral attention. The guys switch things up a bit so that Wayne is up on his knees and Drew is down on all fours in front of him. You may be able to guess what happens next, as Vic slides up behind Drew and starts to slip his dick in. Drew can't take it too long in this position, so the guys move around, giving Vic easier access. Drew has soon turned into a grunting, moaning mess, as Vic thrusts into him from behind. All the while, Drew is filled from both ends -- he's getting fucked by Vic and he continues to slurp down Wayne. 'Ah, yeah, suck that dick,' Wayne growls at Drew, who is bouncing up and down on Wayne's cock.It isn't long before Vic is blowing his load all over Drew's back. But wait, there's more! Now it's Wayne's turn at Drew's ass, as he mounts Drew from the back. Drew is babbling incoherently now, telling Wayne how he wants his 'big load' and how he likes that 'big cock' in his ass. A few minutes go by and Wayne urgently whispers, 'I'm about to cum!' He pulls out and starts shooting his load over Drew's lower back. 'Holy shit,' Drew says, as Wayne covers Drew with his load.The scene closes with Drew and Wayne, side-by-side, with Drew jerking out his own load after Wayne has helped him along a bit. The guys are visibly exhausted and spent -- literally and figuratively!",
  "models": [
    {
      "name": "Drew",
      "person_id": 35351
    },
    {
      "name": "Vic",
      "person_id": 35352
    },
    {
      "name": "Wayne",
      "person_id": 35346
    }
  ],
  "release_date": "2013-10-20",
  "scene_id": 70718,
  "series": "Bareback Base Camp 9",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Gay",
    "Threesome"
  ],
  "title": "Drew, Vic & Wayne"
}