{
  "collections": [
    "Active Duty"
  ],
  "description": "'Back again!' Riley says as his Kaden-directed scene with Jason opens.<br /><br />The two smiling guys are up atop the bed, and Kaden introduces Riley to Jason properly, and the guys shake hands. Kaden says Jason looks a little nervous, but prods at him, wondering why. 'Why you nervous?' Kaden asks Jason. 'It's still new to me,' Jason says, a bit uneasily.<br /><br />Well, luckily, Riley is here to help him along in his journey today. Jason has only done one scene with another guy -- Andrew -- so indeed, all of this still is pretty new to him. But, between Riley and Kaden, methinks Jason is in good hands.<br /><br />Kaden jokes that Riley is the guy 'breaking in the new ones,' and says that he remembers when he 'had that job.' (Careful Kaden, we just may drag you back around in front of the camera!)<br /><br />Kaden asks Riley what he thinks of Jason. The latter tells Jason to take his shirt off so he can inspect the goods. 'Aw, the freckles are cute,' Riley says when he spies Jason's chest. 'Diggin' the furry chest. I can't grow hair on my chest!'<br /><br />'Riley, it looks like you're already riled up, ready to explore Jason,' Kaden says, 'so I think I'll just step out and let y'all get to know each other.' Kaden departs and the guys start shooting the breeze.<br /><br />Riley asks Jason how his first time went, and Jason says 'it was a little different.' (That's the understatement of the week. lol.) Riley says, 'well, you're back again, so, it couldn't have been too bad.' There's a lot of chatter back and forth between the guys, and I think some of you are going to eat it up.<br /><br />We switch into the action, with Riley on his back and Jason slowly inspecting his chest. Jason is hovering over Riley's stomach with his mouth, slowly inching his way down to Riley's dick. Soon enough, Riley's head is thrown back in pleasure as Jason has taken his dick into his mouth.<br /><br />Seemingly surprised at Jason's skill at sucking dick, says, 'So you only did this once before?' Jason comes off Riley's dick to respond, 'Yeah.'<br /><br />The guys change positions so Riley can suck on Jason a while, also getting him up on his knees to get better access to his dick. It isn't long before Riley wants to inspect Jason's ass, and away we go! He presses down Jason's shoulders, so he's farther into the bed, and then gets closer to his hole. Spit is soon dribbling out of Riley's mouth, down to his fingers, and into Jason's tight ass. Riley lubes up Jason, getting him ready for what's about to happen.<br /><br />'Tight little ass!' Riley says, fingering Jason. 'You like that?' Jason grunts out an 'I do' and Riley keeps on working his rear.<br /><br />It isn't long before Riley has slithered his dick up inside Jason. 'Damn, that's tight!' Riley says, as his pistons in and out of Jason. (Well, it should be! This is only the second time he's been fucked!)<br /><br />Jason flips over so that he's on his back, with his legs up in the air, giving Riley -- who is standing off the side of the bed -- easy access. <br /><br />I'm gonna let you see how the guys finish out the scene, but I will say that they spew might fine loads all over Jason's stomach. <br /><br />By the time the scene is over, it's clear that both Jason and Riley will be coming back for more!",
  "models": [
    {
      "name": "Jason II",
      "person_id": 35353
    },
    {
      "name": "Riley II",
      "person_id": 35356
    }
  ],
  "release_date": "2013-10-06",
  "scene_id": 70714,
  "series": "Battle of the Bulge",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "Tattoos"
  ],
  "title": "Jason & Riley"
}