{
  "collections": [
    "Active Duty"
  ],
  "description": "Active Duty is celebrating its 15th Anniversary! My god, can you believe it? I sure can't. Has it really been that many years since I launched this little site that turned into what you see today?Active Duty started in the Autumn of 1998 and truly, my life has never been the same since. I want to thank you -- our valued members and visitors -- who have been faithful through thick and thin. I'm sure some of you were around back then in 1998, when the site was as bare-bones as you could get, with animated gifs of dancing pink flamingos and atrocious green-and-yellow graphics. (Well, some things never change -- that pink flamingo is still on the site, loud and proud -- it's just taken on a different look over the years. lol.)To help celebrate our 15th Anniversary, we had Cole -- that's King Cole to many of you -- edit together a special retrospective video of some of our greatest moments on video. I had some serious flashbacks watching it, I tell you what. So many memories streamed through my mind as I watched it. And, I think a lot of you long-timers out there will really get a kick out of it.And, for you new visitors, it's just a sample of the more than 800 full-length videos that are streaming on demand (and available for DRM-free download) inside the members section of the site.In addition to the video montage, there is also a fun gallery featuring highlights from the last 15 years. Of course, the internet was a different beast then, and you'll probably find the oldest photos mighty tiny and grainy- but super hot nonetheless.",
  "models": [
    {
      "name": "Devon",
      "person_id": 35014
    },
    {
      "name": "Scrappy",
      "person_id": 35143
    },
    {
      "name": "Phoenix",
      "person_id": 35126
    },
    {
      "name": "Lance Bear",
      "person_id": 35110
    },
    {
      "name": "Jameson",
      "person_id": 35094
    },
    {
      "name": "Dirk",
      "person_id": 35078
    },
    {
      "name": "Cliff",
      "person_id": 35062
    },
    {
      "name": "Brian",
      "person_id": 35046
    },
    {
      "name": "Jace",
      "person_id": 35030
    },
    {
      "name": "Trev",
      "person_id": 35159
    }
  ],
  "release_date": "2013-10-02",
  "scene_id": 70712,
  "series": "15 Years Of Active Duty",
  "tags": [
    "Anal Sex",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Hairy",
    "Jerk Off",
    "Jock Strap",
    "Muscular",
    "Smooth",
    "Solo",
    "Straight",
    "Twink"
  ],
  "title": "15 Years Of Active Duty, Scene #01"
}