{
  "collections": [
    "Active Duty"
  ],
  "description": "I was super excited when I heard about this pairing of Corey and Tim, from our guest director pal Mike.<br /><br />You see, both of the guys are essentially brand new to the fold, and both are -- frankly -- super hot. We just met Tim the other day for his very first solo, and Corey has only done one hard core scene (with Drew). Well, the guys go from 0-60 in about two seconds flat today. By the time they are done -- both Corey and Tim have gotten fucked for the first time, both guys suck dick, and both blow big loads all over the place. <br /><br />So, let's get to it!<br /><br />Mike opens the scene, asking 'We gonna have some fun today?,' as both gents are already on the bed, stroking semis in their briefs.<br /><br />'Aw yeah,' both Corey and Tim say, all-smiles. I'm loving this already!<br /><br />'I'm pretty much gonna leave you to your own devices, alright?' Mike says. 'You guys just… see what you can do.'<br /><br />'Can do!' Corey says, seemingly eager and ready to go. Both of the guys are already busy, stroking their dicks. Corey is rock hard, and it isn't more than about, oh, 20 seconds before they're waving their cocks in the air. <br /><br />The guys waste no time, as they each reach over and start jerking one another. Off come the briefs, revealing their super-toned bodies. (Have I mentioned how insane Tim's abs are? I think I have. Repeatedly. lol.)<br /><br />Corey gets up on his knees and starts to blow Tim, who continues to jerk Corey. Man, we are *off* to the races here. Now keep in mind that Tim told us he had never done anything with a guy before, so unless he was fibbing, this is all really new for him. He's taking it in stride, and seems pretty interested in Corey's cock (which is achingly hard throughout).<br /><br />That said, Tim takes to sucking dick like a duck to water, as he goes down on Corey with gusto. Corey leans over Tim, to reach down and jerk him, and then asks Tim, 'How's my dick taste?' Corey gurgles an answer: 'Good.'<br /><br />The guys switch into a 69 position on the bed, with Corey on top, feeding his dick to Tim. Corey is clearly enamored with Tim's dick, as he licks, jerks and engulfs it. Corey fingers Tim a bit, while Tim, meanwhile, focuses his tongue on Corey's ass.<br /><br />Boom! Next thing you know, Corey is splayed out on the bed and Tim is spearing into him from behind. It's a beautiful sight, I tell you. We get a full-frame shot of their beautiful bodies -- and amazing asses -- as they fuck. Corey is in heaven, grunting out 'oh fuck, oh fuck, oh fuck' most of the time as Tim pistons in and out of him. Tim eventually shoots his load all over Corey's face and lips.<br /><br />But wait, we're not through yet. It's Corey's turn to fuck Tim! <br /><br />Corey mounts Tim from behind and slowly enters him. Poor Tim doesn't know what hit him, but Corey is taking it slow. 'There it is!' Corey says, once he's gotten inside Tim. While Corey can't get too far inside Tim without the latter protesting, he gets a good deal of his dick up in there, pumping away. Tim is clenched up and super-tense. He's clearly never done this before. <br /><br />Eventually Corey pulls out and shoots the most massive load all over Tim's lower back and ass. It's like the flood gates opened or something. Tim's ass turns into a big glazed donut by the time Corey's through with him.<br /><br />The guys relax on the bed for the post-sex chat. Mike seems surprised by what just happened, saying it was 'totally unexpected.'<br /><br />Both guys say they'll be back for more work, even though 'it hurt,' says Tim. Corey says he had fun too, adding that 'Pain is pleasure.' Well, alright then!<br /><br />",
  "models": [
    {
      "name": "Corey",
      "person_id": 35350
    },
    {
      "name": "Tim II",
      "person_id": 35358
    }
  ],
  "release_date": "2013-11-17",
  "scene_id": 70726,
  "series": "Bareback Base Camp 10",
  "tags": [
    "Anal Sex",
    "Blonde",
    "Blowjob",
    "Duo",
    "First Time",
    "Gay",
    "Muscular"
  ],
  "title": "Corey & Tim"
}