{
  "collections": [
    "Active Duty"
  ],
  "description": "'What's going on man?' Drew says to guest director Mike, as he gropes his hardening dick inside his shorts.'You guys is what's goin' on,' says Mike from behind the camera.'Got you back here,' Mike continues,' saying, 'you tell me you're gonna give me a good show. So I believed you and paired you up together. Let's see what happens, alright?''Sounds good to me,' says Drew.'How about you Wayne?,' Mike offers.'Let's get it!,' Wayne says, as he strokes his dick.Well alright, let's get it indeed. Mike leaves the guys alone so they can get more comfortable -- as if they needed time to relax. Hell, they're already basically naked. Drew looks over at Wayne's shorts, and not more than a few seconds later, Wayne has hauled out his stiffy. Drew pulls his own cock out and now we've got both gents side-by-side, eyeing one another as they stroke themselves.Drew seems positively in a trance at Wayne's dick, but soon breaks out of his hypnosis, only to grab Wayne's hand to put it on his own dick. 'It feels really good,' Drew says, as Wayne strokes Drew a bit. Drew reaches over and starts jerking Wayne, too, so now we've got some mutual masturbation going on. 'You're rock solid,' Drew says to Wayne, as he continues to tug on him. 'So are you,' Wayne responds. Off come the shorts! Drew leans over and takes Wayne into his mouth, as Wayne thrusts his thighs into the air to meet Drew's mouth. 'You like suckin' my dick?' Wayne asks. 'Mmmmhmmm,' Drew says with a mouthful of cock.We get in close with the camera so we can hear the slurping noises of Drew going to town on Wayne. 'Aw yeah,' Wayne says, as Drew continues to work him over.'One of the best cock suckers ever,' Wayne tells Drew. Now that's a high compliment! It isn't long before Drew is asking Wayne if he wants a dick in his ass. Wayne seems a bit reluctant, but says, 'sure!' And away we go!We get to see Wayne wince and grunt his way through bottoming for Drew. It's clear -- crystal clear -- that this is very new to Wayne. Drew says he's never had an ass this tight before, while Wayne blurts out that Drew's 'cock is so big!'You'll have to see how the scene ends  yourself, but suffice it to say -- both guys are exhausted by the time the camera stops rolling!",
  "models": [
    {
      "name": "Wayne",
      "person_id": 35346
    },
    {
      "name": "Drew",
      "person_id": 35351
    }
  ],
  "release_date": "2013-11-10",
  "scene_id": 70724,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Straight"
  ],
  "title": "Drew & Wayne - II"
}