{
  "collections": [
    "Active Duty"
  ],
  "description": "Whoah boy, have we got a hot guy for you tonight. And he's brand new, and ready to go!<br /><br />Meet Tim! He's 22-years old, stand at a compact 5'4' tall and weighs 140 lbs. As you can see, he also has the most amazing abs ever. This guy is nothing but rippling muscles in his torso. It's insane. <br /><br />Our guest director pal Mike brings Tim to us this evening, and he tells us that Tim is here to 'rub one out.' Mike says that he knows Tim is a bit nervous and that it took him 'a while to come in.' But, as is standard practice for Mike, he says he's going to leave Tim alone for a bit to get comfortable.<br /><br />Tim peels off his shirt and pants and I've died and gone to heaven. Wait, no, I'm still alive. I found my pulse. It's just racing. Maybe that's a stroke I'm having? <br /><br />I swear to God you could grate the hardest cheese on Tim's abs. Or use them as a washboard to get out even the toughest clothing stain.<br /><br />Mid-way through the scene, Mike tells Tim that he's a good looking guy with a good looking cock. Tim smiles, a little embarrassed, and says 'thanks.' Mike asks if Tim gets hit on a lot. Tim coyly answers, 'Sometimes.' Mike furthers the conversation. 'Guys hit on you?' Tim is hilariously uncomfortable at this query, and laughs, 'uh, not really?' <br /><br />Tim says he's never done anything with a guy, and never thought about it either. Well, we'll see if Mike can change his tune later. <br /><br />Mike asks if he jacks off every day. Tim laughs and says he does, usually two or three times a day. 'You're a horny little fucker, aren't you?' Mike says. Tim laughs and agrees with him. <br /><br />By the end of the scene, Mike says he's 'got plans' for Tim. And, jokingly, Mike asks him if that 'worries' Tim. The latter just laughs and says 'nah!'<br /><br />We'll see if Tim will do more with Mike in the future. But until then, enjoy his debut solo for us!",
  "models": [
    {
      "name": "Tim II",
      "person_id": 35358
    }
  ],
  "release_date": "2013-11-13",
  "scene_id": 70725,
  "series": "Bareback Base Camp 10",
  "tags": [
    "Blonde",
    "First Time",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Solo",
    "War Chest"
  ],
  "title": "Tim - Solo"
}