{
  "collections": [
    "Active Duty"
  ],
  "description": "After Ryan's sizzling solo debut the other day, Kaden wasted no time fast-tracking the newbie into hard core action. So, today, he's joined by another new(ish) fella, Riley, for a heated pairing that puts both guys through their paces.As Kaden is telling Riley about how Ryan is pretty new to all of this, Riley says Ryan has nothing to worry about, and grabs Ryan's thigh to comfort him. 'I think Riley's gonna show you the ropes,' Kaden says, and then asks Ryan if he's nervous.'Oh yeah!' Ryan says. Kaden then replies, 'But look at Ryan! That's one handsome-ass . . . he's handsome! I mean, I know it's not a girl, but . . . ' lol. Kaden says he's going to step out of the room and let the guys get to know one another, and he tells Riley, 'don't bite!'The guys start shooting the breeze, watching the off-camera porno. Riley asks to see Ryan's tattoos, so of course his shirt has to come off. 'You got any more tattoos on your thighs?' Ryan says he doesn't, but Riley smiles at the camera and says, 'I don't believe you, you gotta show me,' almost winking at the camera. 'So whatcha got goin' on under there?' Riley says to an underwear-clad Ryan. 'Seem to be all sorts of excited already.' Ryan's a little shy, but starts to grope his dick through his shorts, saying how he's about to pitch a tent because of the porno that's playing. It isn't long before Ryan has gotten real comfortable . . . with his dick in Riley's mouth. Ryan is loving the experience, throwing his head back, enjoying what's happening to him. All those nerves have seemingly melted away! The guys take turns sucking one another, before moving into a 69 position. All sorts of slurping and moaning action ensues, as the guys are splayed out on the bed, taking in one another's cocks. By the time the scene is over with, Ryan is bucking and fucking Riley, slapping his ass, and asking him, 'You like that?! Take that dick!' Man, this guy is a fast learner!",
  "models": [
    {
      "name": "Riley II",
      "person_id": 35356
    },
    {
      "name": "Ryan IV",
      "person_id": 35359
    }
  ],
  "release_date": "2013-11-24",
  "scene_id": 70728,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "First Time",
    "Gay"
  ],
  "title": "Riley & Ryan"
}