{
  "collections": [
    "Active Duty"
  ],
  "description": "'Are you ready to fuck in the morning? Cause that's what we're about to do!'Director Kaden gets things started right with Jason and Tito, as Kaden asks the guys if -- despite the early hour -- they are ready to fuck. Of *course* they are, and we're ready to watch!As soon as Kaden says 'that's what we're about to do,' Tito slaps his hand down on Jason's thigh. I think he's ready to do business.Kaden says he's going to step out and let the two of them get to know one another, as this is their first time meeting one another. Ain't nothing like a first time to get the party started right. 'Well y'all got some catching up to do,' Kaden says, 'see you guys later.'And with that, Jason and Tito are left on their own. Jason says hooking up like this in the early morning is a 'good way to wake up.' No doubt. A little chit-chat ensues about tattoos, before the guys start getting down to business. Tito gets up on his knees to yank off Jason's shorts. 'Well there's my friend for the day,' Tito says, as Jason's dick comes popping out of his boxers. Jason laughs, and then asks Tito, 'Where's my friend for the day?' Crafty Tito responds: 'You gotta pull 'em off,' he says -- meaning his sweats. So Jason does, and now we've got two guys with raging boners side-by-side on the bed. Kaden comes in a few minutes later and says, 'Looks like I came back at the right time!' With that said, it's time for the guys to start getting some dicks in mouths, as Tito grabs behind Jason's head to encourage him to go down on him. He gets the hint and starts sucking on Tito, while the latter slaps on Jason's ass for a bit.Soon, the guys flip around so that Jason is on his back and Tito can give Jason some oral attention. 'Ah, fuck!,' Jason whispers as Tito starts to jerk him off. Tito manhandles Jason's cock with gusto, giving him a good handjob and a slurpy blowjob. We're in there good with the camera too, getting every slurp and sucking noise possible. lol.You'll have to see just how things pan out for the two of them, but I will tell you this -- Jason ends up bottoming for Tito and getting a serious pounding. While he may have grimaced through the scene -- and held on for dear life to the bed while Tito bucked into him -- I think he enjoyed himself! Certainly, their loads don't lie! Both of the gents shoot good-sized loads all over Jason's stomach, exhausted after their workout.",
  "models": [
    {
      "name": "Jason II",
      "person_id": 35353
    },
    {
      "name": "Tito",
      "person_id": 35355
    }
  ],
  "release_date": "2013-10-27",
  "scene_id": 70720,
  "series": "Going Commando 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off"
  ],
  "title": "Jason & Tito"
}