{
  "collections": [
    "Active Duty"
  ],
  "description": "'Hopefully we're gonna have a little fun,' Vic says, as we start our scene. And methinks he might be right!Today the sexy Wayne gets his cherry popped by the studly Vice -- so I think that qualifies as some 'fun.' And neither of these guys has anything 'little' about them, so . . . Heh, heh.Guest director Mike steps away from the camera to let the guys get comfortable. After he leaves the room, the gents start to work at their dicks inside their pants for a while, bringing themselves to attention.Vic is really getting into jerking himself off, as he moans and grunts while he strokes himself. He pulls off his pants to reveal a pair of tented black boxers, clearly sporting a big honkin' dick inside them.Wayne steals a couple glances over at Vic's shorts, taking his cues from Vic about when he should lose his own undies. A few minutes elapse and Wayne starts to feel up Vic's chest and hard abs. He soon works his way down his chest to his rock hard dick, and begins to jerk him off. Wayne doesn't waste much time, as he quickly latches his lips onto Vic's dick and starts going to town. Vic is in heaven, as he throws his head back and starts moaning and groaning at the blowjob.Soon, Wayne decides its time to get a little bit of Vic's dick up inside him, as the guys move on to the fucking portion of our scene tonight. Wayne's on his side, while Vic is up on his knees behind him, all lubed-up and ready to go.They're having to take it nice and slow, since Wayne has never had anything like this happen before. We get some good close-ups of Vic inserting into Wayne, who is concentrating hard on trying to make it through/enjoy the experience. lol. When Wayne starts to help 'ow!,' you know we're doing something right? Or is that wrong? Well, you be the judge. This is reality, folks!",
  "models": [
    {
      "name": "Wayne",
      "person_id": 35346
    },
    {
      "name": "Vic",
      "person_id": 35352
    }
  ],
  "release_date": "2013-11-03",
  "scene_id": 70722,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay"
  ],
  "title": "Vic & Wayne II"
}