{
  "collections": [
    "Active Duty"
  ],
  "description": "Our guest director pal Mike apologizes to Tim and Wayne, saying that they haven't had much of a chance to get to know one another before they got thrown together in the mix today.Amusingly, Mike says to the two guys on the bed: 'You already know that's Tim. And Tim, that's Wayne.' See, introductions over with! Now let's get to work. lol.Mike asks Tim, 'What'd you think of the last shoot you did?' (His last shoot, by the way, was a flip-flop hard core fuck scene with Corey -- the first time Tim had done anything of the sort with a dude.)Tim smiles, raises his eyebrows, and says 'Pretty good!''Do you remember the solo you did?,' Mike asks.'Yes,' says Tim.'What did you tell me? When I asked if you'd ever do something with a guy, what'd you tell me?' Mike queries.'No. . . ' says Tim. Well, obviously, things changed. Mike says he spent a couple days after that shoot, 'romancing' Tim to the idea of guy-on-guy action. A few weeks went by, and Tim and worked up the courage to fool around with Corey -- and it was a winner of a scene, I'll tell you that. Tim says he liked it, so, Mike says, 'Hopefully you'll like Wayne, and we'll see what you guys do today, alright?'Mike leaves the guys alone, and they start groping themselves through their pants. Soon, the jeans are off and underwear is exposed. Few words are exchanged between the two, but they are busy jerking one another off now.Tim leans over and starts to give Wayne head. Then it's Wayne's turn to let Tim lay back and get a blow job. Tim seems to be loving it, as he guides Wayne's head down with his hand and gently grinds his hips upwards into Wayne's mouth.All of this leads to a hot 69 with Tim on top and both men feeding the other their cock. After some 69 lovin', the guys move on to the big moment: Tim getting fucked. He's on his back, with legs thrown up in the air, bracing for impact. Wayne doesn't tip-toe around him either, as it's just a mere handful of seconds before he plunges into Tim. Damn!Tim's trying his best to keep a brave face, but you can tell he's hurting by having Wayne's thick dick shoved inside him. After a while, the guys switch positions, so that Tim is flat on the bed with Wayne bunny-rabbit fucking him from behind. It isn't long though before Wayne is shooting his load all over Tim's lower back. Whew! Wayne then helps out Tim, sucking and jerking him off until he blows his own load.And then, folks, it's a wrap!",
  "models": [
    {
      "name": "Wayne",
      "person_id": 35346
    },
    {
      "name": "Tim II",
      "person_id": 35358
    }
  ],
  "release_date": "2013-12-08",
  "scene_id": 70732,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Tim & Wayne"
}