{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden tells Liam that since I shot his solo, he was disappointed that he didn't get the chance to film him. So, he offered to shoot another solo with Liam.<br /><br />Well, Kaden knows that sometimes, you have to 'spice things up' a little, so he invites Jason into the scene today to see what sparks might fly.<br /><br />'Jason said that he's willing to give you head,' Kaden tells Liam, 'for your first time, if that's something that'd you'd be interested in.'<br /><br />Liam says, 'yeah,' and nods, a little hesitant. Kaden asks, 'You sure?' Liam, coming around to the idea, says 'I'm up for it! Let's do it!'<br /><br />See, I like that attitude. The 'get in there and try something new' attitude works wonders around these parts.<br /><br />Kaden jokes around with Liam, telling him that Jason says 'he doesn't like (giving head), but he's pretty good at it.'<br /><br />Kaden calls Jason in, who plops down on the bed next to Liam. 'Y'all make a cute little match.' Kaden warns Jason that he doesn't want Liam to jump out of the bed and run off. Kaden says that he's in good hands, well, his dick is in good hands, and excuses himself for a bit so they can get to know one another.<br /><br />After a couple minutes of chit-chat, it's time for Jason to go to work on Liam. It isn't long before Liam is hard at attention, and groaning at the pleasure he's receiving. The guys go through a series of positions, including one where Liam is up on his knees, face-fucking Jason, while hissing 'yeah, suck that dick! fuck yeah!' <br /><br />(Here's a random aside: Doesn't Liam look a bit like Shane? It might depend on the angle you're looking at, but at one point, when Liam was laying down on the bed, I immediately thought, 'That's Shane's long-lost brother!')<br /><br />Alrighty, now go enjoy Liam's first taste of dick sucking from a guy! Oh, and we make sure that Jason gets off too (though Liam isn't quite ready to latch his lips onto a cock yet.)",
  "models": [
    {
      "name": "Jason II",
      "person_id": 35353
    },
    {
      "name": "Liam",
      "person_id": 35360
    }
  ],
  "release_date": "2013-12-01",
  "scene_id": 70730,
  "series": "Ambushed 2",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Jerk Off",
    "Tattoos"
  ],
  "title": "Jason & Liam"
}