{
  "collections": [
    "Active Duty"
  ],
  "description": "Back by popular demand, it's Tim and Wayne!I know, I know, we just posted a scene with these two kind of recently, but they were ready to do another scene, so guest director Mike figured why not shoot them again. This time, they're changing it up a bit, as it's a flip-flop scene, so both gents take on one another's big dicks.I have to say, I'm still awestruck by Tim's body. It's SICK. His abs are like a damn cheese grater. We haven't futzed with the Photoshop to make them stand out any more than usual -- that's just how amazingly ripped his torso and muscles are. Insane, right?Anyhow, the guys get down to business and soon enough, the cocks are out, and the stroking has commenced. Wayne starts to suck on Tim, who sighs and moans in appreciation. A few minutes go by, and it's Wayne's turn to get a lickin', as Tim leans over and takes Wayne into his mouth. Really though, the best part is the fucking action. To see Wayne get fucked by Tim doggy style -- and to see Tim's absolutely ripped abs thrust into Wayne -- well, it's a sight. Wayne does his best to not collapse into a heap, as clearly, he's feeling a mixture of pleasure and pain here. (Or maybe it's just pain, lol, I'm not sure…)Wayne grunts and growls his way through the fucking, holding on for dear life as Tim pistons into him from behind. (Note to Mike: Get Wayne a muzzle next time.)'Ow. OW! Fuckin' hurts! Motherfucker.' Those are the sweet words Wayne says to Tim before he pulls out and shoots onto Wayne's back.Mike says, 'We can tell by your moans, Wayne, you really liked it.'Wayne laughs, still with his head buried into the bed, 'Ha. Yeah, we'll go with that.'It's revenge time now though, as it's Tim's turn to get fucked. He grins and bears it through the shtupping, which doesn't last quite as long as when Wayne bottomed for him earlier. A few minutes go by and we hear Wayne whisper, 'About to cum…'He pulls out and shoots, and as soon as the first splash hits Tim's back, we hear Tim say, 'Ooh! Damn! That's a lot.' lol.'Who spilled the quart of milk?' Mike asks, as the guys all laugh. And that's a wrap!",
  "models": [
    {
      "name": "Tim II",
      "person_id": 35358
    },
    {
      "name": "Wayne",
      "person_id": 35346
    }
  ],
  "release_date": "2013-12-22",
  "scene_id": 70736,
  "series": "Military Bareback Files 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay"
  ],
  "title": "Tim & Wayne (Flip-Flop)"
}