{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm super excited to share with you our new video, where that strapping new gent -- James -- crosses the line!<br /><br />We introduced him to you the other day in the War Chest, and I just think he's the bees knees. He looks like an action movie star, with a body that won't quit, a beautiful face, big solid thighs, a hot cock, a pretty smile, blond hair . . . lord, I need to maintain composure here!<br /><br />So, guest director Mike sent over this scene, and, I was pleasantly surprised to see that right off the bat, Mike tells James that today is the day he'll be crossing the line. He's never done anything with a guy before, and finally, today is the day.<br /><br />Notably, Mike says -- as the video starts -- that James has shot a bunch of video with him already, but this is the first time he'll be doing anything with another dude. (Now, we've only posted one solo of James so far, so it would seem that Mike has had to really work at getting James comfortable enough to let another man touch him. I know I'm intrigued already . . . )<br /><br />James throws some cold water onto the proceedings, and tells Drew, 'No offense dude, but you're gonna have to keep it in your pants.' Well, dang, shut down already! James continues, 'This is too weird for me right now.'<br /><br />Mike says that he 'promises' that they'll be alright, and leaves them be, and we're off to the races.<br /><br />As soon as Mike leaves them, Drew reaches over and starts to grope at James' crotch. James helpfully lifts up his shirt, and takes it off, revealing his broad chest and rippling abs. Lawd, I'm feeling the vapors up in here!<br /><br />Drew continues to feel James up and down, and soon, James has unzipped his fly, letting Drew slip a hand into his shorts. James continues to watch the off-screen video, but also maintains a firm gaze on what's going on down below. It's fun to watch this scene and think about what's going on inside James' head. Is he freaking out? Is he loving it?<br /><br />James shucks off his pants, leaving himself just in his bright blue boxers. Drew continues to manhandle him. 'That feel OK for you?' Drew asks. 'Yeah, it feels good,' James replies, as we hear heavy breathing come from the muscled man.<br /><br />Off come the boxers, and down goes Drew. 'Mmm, that feels good,' James says, throwing his head back. Well, if this is 'weird' for James, as he said earlier, he's not seeming to mind what's happening now. <br /><br />I'll let you find out how the scene ends, but I will tell you this.:<br /><br />At the end of the scene, Mike asks James how it went. He says, 'It was good . . .' Mike asks, 'How'd you feel about Drew sucking your cock?' James pauses, and says, 'it was . . . I liked it . . . it was real good. . . . I wasn't expecting it to feel that good.'<br /><br />'You think you can do that again?' Mike asks, hopefully.<br /><br />'It's very possible,' James says, smiling.<br /><br />And with that, we're out!",
  "models": [
    {
      "name": "Drew",
      "person_id": 35351
    },
    {
      "name": "James",
      "person_id": 35366
    }
  ],
  "release_date": "2014-02-09",
  "scene_id": 70748,
  "series": "Military Bareback Files 2",
  "tags": [
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "First Time",
    "Gay",
    "Muscular"
  ],
  "title": "Drew & James"
}