{
  "collections": [
    "Active Duty"
  ],
  "description": "Cory is one horny little devil and just loves sex of any kind. He's one of those guys you just can't put a label on. If it feels good, he's down for it. We all know Kale is a trooper and down for whatever you throw his way. And of course Diego is a tried and true veteran that always helps make a scene even hotter.It doesn't take much coaxing to get these three heroes in the mood. A little porn and some chit-chat back and forth and the cocks are hard in no time and ready for action. Kale can't keep his eyes off the prizes on either side of him as he sneaks a few peeks at Cory and Diego's hard cocks. The anticipation is eating at him as he wonders how things are going to play out. You can tell he's satisfied with the company he's keeping. His eyes keep wandering and finally Diego breaks the ice for him by reaching over and grabbing his cock. This gives him the green light to latch on to Cory's cock and crank it for awhile.What's interesting to know is that this was actually Kale's very first hardcore scene. This was shot before he did the scenes with duo scenes with Dustin and Vance. So he was a real cherry at this point. By the time it's over he's gotten both a mouth and ass full of cock courtesy of Cory and Diego. Things get heated when Diego suggests that Kale suck Cory's cock while Diego sucks Kale's and from there we get to watch Kale take a dick in his mouth for the first time. Cory says he's a quick learner and that he's catching on. If Cory's stiff dick is any indication I'd say Kale is a natural cocksucker.Diego wants to taste Kale's virgin ass so Kale comes up on his knees, Cory comes up on his and feeds him that stiff dick while Diego rims his ass. He gets that sweet, hairy hole all lathered up then moves up to give Cory something to suck on. This is really hot as we watch Cory deepthroat Diego's dick. Diego is raging hard and pumps Cory's throat full as Cory does an amazing job of keeping up with his thrusts. Meanwhile Kale is holding his own on Cory's hard cock and they decide to flip him over and give him some attention. Imagine having both Cory and Diego go down on you for your very first time getting blown by another guy. I'm jealous. Cory mans the balls and Diego does the dick and they switch back and forth making sure Kale is satisfied. Cory moves up and gives Kale a good tonguing to bring in his first man kiss and Diego follows his lead. They are giving this newbie sensory overload I'm sure.We get Kale to show off his flare for gymnastics and throw his legs back, giving the guys easy access to his tight little asshole. Cory moves in and starts tonguing it good as Diego stands over Kale and feeds him his cock. Cory is nose deep in Kale's ass but he doesn't stop there. He moves right up and starts eating Diego's ass too as Kale sucks Diego's dick. Cory goes back and forth, enjoying both asses and it won't be long before somebody is getting fucked.Cory does the honors of lubing up Kale's ass for the first fuck as he fingers it and gets it loosened up. Cory saddles up and moves in for the entry on Kale's virgin ass as Diego feeds him his cock to keep his mind off the pain. It doesn't take long for Cory to work his long, hard cock deep into Kale's tight little hole and before you know it, he's all broken in, ready for the riding. Our cowboy Cory does a fine job of taming this one and gets his fair share of that tight hole, long stroking it as he strokes Kale's hard cock and pumps his ass at the same time.They put him in the doggy style position and continue feeding him cock at both ends. Diego decides he wants another mouth and steps up to Cory while Cory plows Kale, he sucks Diego, too. Cory is slamming into Kale's ass balls deep as Diego slams into his throat balls deep.What happens next is so fucking hot to watch as Cory positions himself on top of Kale, giving Diego access to his ass. Diego moves in and starts fucking Cory's hole while Cory stays balls deep inside of Kale. I almost lost it. Can you imagine how good Cory must be feeling? They go at it in this position for awhile and then Cory decides he wants to try out Diego's ass.They put Diego doggy style and Cory plows him from behind as Kale feeds Diego some dick. Cory is loving that tight hole as he slams him harder and faster. Soon, Cory is blowing his load all over Diego's ass and back. Kale can't hold back anymore and blows his huge load all over Diego's face as Cory strokes Diego's cock fast and hard working him up to a huge cumshot. And it's a wrap folks!",
  "models": [
    {
      "name": "Kale",
      "person_id": 35015
    },
    {
      "name": "Cory",
      "person_id": 35067
    },
    {
      "name": "Diego",
      "person_id": 35077
    }
  ],
  "release_date": "2014-01-26",
  "scene_id": 70745,
  "tags": [
    "Anal Sex",
    "Brunette",
    "Gay",
    "Kissing",
    "Rimming",
    "Smooth",
    "Straight",
    "Threesome"
  ],
  "title": "Cory, Diego & Kale"
}