{
  "collections": [
    "Active Duty"
  ],
  "description": "Corey, Tim and Wayne join guest director Mike today for a sizzling three way. The bodies on these men are just amazing, and I could stare at them all night. This is the first time that the ultra cute Tim and Corey have done a three-way scene, so we're in for a treat. Wayne has appeared in a trio once before, so I guess that makes him an old pro at the ol' menage-a-trois. lol.The scene opens with the three guys lined up on the bed, with Mike asking why the guys look scared. (He's joking of course, but it's always fun to see Mike try to prod these guys into a reaction.)Corey, seated in the middle, quickly says -- while shaking his head -- 'not scared.' All the guys joke a little bit before Mike says, 'Y'all asked the question 'what are we gonna do?'' (Corey and Tim nod their heads up and down in response, so perhaps even they don't know what they're doing yet.)'I told ya I don't know,' Mike says. (Oh, now Mike, we know you better than that. I'm sure you've got a plan up your sleeve…)'I like just to see things unfold,' Mike continues, 'see where you guys take it. Sound good?''Yep,' Tim says. 'Perfect,' Corey agrees. (Wayne, ever stoic, just nods his head quietly.)Mike leaves the guys to get to work, and they all shove their hands inside their underwear. Tim and Wayne are clad in boxers, while Corey is wearing a pair of tight camouflage briefs (already bulging with an erection). Maybe a minute or so goes by, and all three are shirtless, hard, and jerking. Soon, it's all hands on deck, as Corey starts jerking both gents, while they take turns working his dick over. Corey hops up and starts sucking on Tim, and that's when we see he's wearing briefs with the words 'BOOTY CAMP' across his ass. LOL. (Mike, did you get those for him?)After a minute of sucking down Tim, Corey moves on to Wayne, as Tim gets up on his knees and starts to feel up Corey's rear end -- while slipping his briefs off in the process. Soon, Wayne leans over to start slurping down Tim's dick, while Wayne is still being sucked off by Corey. Some position changes happen, and blamo, the next thing you know, Corey is on his back and Wayne is lubing himself up. These boys don't waste any time now do they? Wayne starts fucking Corey bareback, but that position doesn't last too long, so Corey gets up on his hands and knees so he can welcome Wayne from behind. Corey is arching is back like hell, seemingly enjoying Wayne's big dick up inside him. But, he's not going to hog Wayne completely, as it's time for Tim to get some of the Wayne action. Tim gets down on his back and starts lubing up his ass, preparing for the Wayne Invasion. Meanwhile, Corey is busy groping and massaging Tim's bouncing pec muscles -- my god, is this guy built!Wayne is the first to blow his load, and that he does, all over Tim's chest. Now it's Corey's turn to fuck Tim with his big ol' dick -- bareback. Tim does his best lamaze breathing/panting in order not to hyperventilate while being fucked by Corey. (Amusingly, at one point, Tim says 'fuckfuck, ooh!' reacting to Corey going just a bit too deep. And really, when you are as thick as Corey, every centimeter is going to feel like an earthquake up inside you.)Eventually, Corey gets up to a good rhythm, sliding most of his dick up inside Tim at a steady pace (as Tim yelps 'god dammit!'). Soon, both Corey and Tim are shooting their loads all over Tim's eight-pack of ab muscles (damn!).And that's a wrap!",
  "models": [
    {
      "name": "Wayne",
      "person_id": 35346
    },
    {
      "name": "Corey",
      "person_id": 35350
    },
    {
      "name": "Tim II",
      "person_id": 35358
    }
  ],
  "release_date": "2014-01-19",
  "scene_id": 70743,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Gay",
    "Muscular",
    "Smooth",
    "Threesome",
    "White Butt"
  ],
  "title": "Corey, Tim and Wayne"
}