{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm back behind the camera tonight and I've got a super hot new guy to show you -- Orion!<br /><br />Orion's like a bright, shining star in the sky -- he's a special guy, with a body to die for, a glorious smile, and great, sexy personality. I think you're gonna like him.<br /><br />I tell Orion how I've been knowing him for a 'minute' now -- or, has Orion says, probably three or four months.<br /><br />And, you know what that means. If I've known someone for a few months, it's only a matter of time before I sink my claws, I mean, camera, on him. lol. I joke about how I've been 'keeping him all to myself' in that span of time. 'Yes you have,' the 22-year old Orion says, smiling. <br /><br />'I have not been sharing!' I joke with him, saying how when the 'fans find out' that I haven't been sharing something so 'delicious' as Orion, 'they're gonna hate me.' (Naw,  you guys love me, right? Right?! lol.)<br /><br />But now, I tell him, I'm turning him loose and throwing him in the pen with the tigers. Over the past few months I've been getting the 5'10' guy prepared for the road ahead -- and that road should be nice and humpy, I mean, bumpy. <br /><br />Orion takes off his sweatshirt, revealing his skank tank muscle shirt -- where his sleeves are cut out. He teases us a little -- showing off his muscular 165 lbs. frame -- before I tell him to just stop teasing and lose the shirt.<br /><br />He's got an awesome infantry tattoo on his chest, and we get a nice good look up close. I tell him how beautiful he is, and, and what gorgeous skin and nipples he has. I gush more and more about how awesome he is.<br /><br />This is a long, luxurious solo that you have to really settle in for. (It's more than a half-hour long. And worth every minute.) Off come his socks, and Orion starts seductively sucking on his own toes. See, I told you. You're gonna wanna settle in and not fast-forward through any of this.<br /><br />I can't describe every little thing here, but this is hands-down the best solo we've posted in forever. And I'm not saying that just because I shot it either. Orion is a walking sex machine. Hot damn. If his heavy breathing and dirty talk (how he wants 'a rock hard cock in my mouth, choking me…') don't send you over the edge, his fingering his own ass will. <br /><br />Will Orion step over the line with us? You'll have to wait and see!",
  "models": [
    {
      "name": "Orion",
      "person_id": 35367
    }
  ],
  "release_date": "2014-02-12",
  "scene_id": 70749,
  "series": "Pumped Privates 2",
  "tags": [
    "First Time",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Sensual",
    "Smooth",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Orion"
}