{
  "collections": [
    "Active Duty"
  ],
  "description": "'Got you back here, Robby,' guest director Mike says as we start our scene. 'Care if I share somethin'?'<br /><br />Well, I know I certainly don't mind -- and I'm intrigued… wonder what Mike has got up his sleeve?<br /><br />'No, go for it,' our new pal Robby tells Mike.<br /><br />'I brought you in today to do a solo, cause I like how you look and I like to see them big fuckin' loads you shoot … but uh, a couple guys were leaving when you came in. And you asked me somethin'… Right?'<br /><br />And right then, you can see Robby swallow a bit, and the look on his face changes ever so slightly. His experssion shifts from everything-is-peachy to oh-no-what-is-Mike-gonna-say in about a half-second. lol.<br /><br />Robby says, 'Yeah,' as he side-eyes something off camera, trying to focus on something else that isn't Mike.<br /><br />'What'd you ask me?' Mike says. <br /><br />'I was wondering if one of those guys would be willing to blow me,' Robby says. <br /><br />'As a matter of fact,' Mike says, 'I did talk to one of the guys and got my buddy Wayne in here … and he's willing to help you out. Sound like a plan?'<br /><br />'Awesome!' Robby says. And away we go! (Well that was easy, now wasn't it?)<br /><br />Mike says he's going to leave the guys to get at it, and the next thing you know, Wayne has entered the picture. 'Sup man?' Robby says to Wayne, who has already started groping at Robby's chest. 'Sup?' Wayne answers, not missing a beat. <br /><br />You'll have to see how things turn out for yourself, but, as always, things end up pretty … messy.",
  "models": [
    {
      "name": "Robby",
      "person_id": 35363
    },
    {
      "name": "Wayne",
      "person_id": 35346
    }
  ],
  "release_date": "2014-01-05",
  "scene_id": 70740,
  "series": "Military Bareback Files 3",
  "tags": [
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Smooth"
  ],
  "title": "Robby & Wayne - Oral"
}