{
  "collections": [
    "Active Duty"
  ],
  "description": "As soon as our new scene with Chris and Tim opens, both of the guys are naked, under the covers, and in bed. Well, we're already off to a great start!Guest director Mike tells the guys, for our benefit, that Tim has briefly met Chris earlier that day. As is often the case, Mike will give us scenes in a surprising order, so while we're seeing Chris for the first time, he's actually done some work for Mike before (that we just haven't seen yet).That said, Chris is 23 year-old, stands 5'9' and weighs about 160 lbs. He's a midwestern boy, and has got a corn cob-sized dick between his legs.Mike tells the guys to have some fun, and he leaves them be for a bit. Then, all we see are white sheets with bouncing erections under them. Well, it isn't long before Chris is slurping down Tim's dick, as Tim puts his hand behind Chris' head to guide him down. Chris can take Tim all the way down, and seems pretty eager to suck him, so I say Mike has found a winner in this guy.They switch positions so Tim can get a mouthful of Chris, and Tim goes to town, bringing Chris' dick to life. 'Fuckin', god damn!' Chris says under his breath. Mike asks if he likes that, and Chris says 'he's so fuckin' good!'A few minutes go by, and Tim asks if Chris is ready for him to fuck him. Chris says 'yes!' and jumps up to get on his hands and knees. This guy is ready! And if this is his first time at the rodeo, he's doing one mighty fine job.Chris is moaning and groaning something fierce as Tim fucks him bareback from behind. Chris is grabbing at the sheets, yelling 'fuck!' and holding on for dear life as Tim pounds him raw. Mike gets in close with the camera, getting some really good close-up shots of Tim's dick sliding in and out of Chris' ass.'Fuck me! Oh my god!' is what Chris keeps blurting out, getting lost in the moment with Tim. Chris is now biting on the sheets, gnawing at them while panting and groaning under Tim. Hell, you may just want to listen to the audio track of the video. It's like aural sex!Tim pounds Chris for a good 10 minutes until he frantically pulls out, shooting his load all over Chris' back. Mike asks Chris how it was, and he says it was 'It was great. It was awesome.' Mike tells him that they aren't through yet, and Tim swiftly appears, cleaning up his own mess off Chris' back. Well, that was kind of him.Chris lays back, as now it's time for him to blow his load. Tim goes to town on Chris, sucking him off. Mike shoots the breeze in the meanwhile, asking Chris if Tim had the biggest dick he's ever taken. Chris nods affirmatively, and then Mike says he wishes Chris would have let him film the *other* fucking scene that he did for Mike. (Oh? Well, the plot thickens!)Eventually, Chris jerks himself off to completion, and then Mike asks if they want to do more work. Both say yes. Mike asks Chris if he thinks Tim has a nice body, and Chris laughs, saying how 'it's almost not fair!' Ain't that the truth!'I need a cigarette!' Chris says, smiling, as we close out the scene.And that's a wrap!",
  "models": [
    {
      "name": "Chris II",
      "person_id": 35368
    },
    {
      "name": "Tim II",
      "person_id": 35358
    }
  ],
  "release_date": "2014-02-23",
  "scene_id": 70752,
  "series": "Military Bareback Files",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular"
  ],
  "title": "Chris & Tim"
}