{
  "collections": [
    "Active Duty"
  ],
  "description": "Cory Rides Back Into Town ... Funny we just released Cory's War Chest Update last week and we're already back with his hardcore debut. Sometimes that's how things end up in the queue. And I gotta tell ya, I'm glad this scene came up so soon. Cory is adorable and as we get to know more about this hot little cowboy gone Marine Corps fighting man, I just can't seem to get enough. He's enthralling. I could watch him brushing his horse or knockin' cow patties off his boots and I'd be captivated. He's that damn cute. When we got to know Cory in his War Chest update we learned all the things he liked and one of them was something nice and big up his cute little butt. Today, he's gonna ride a horse of a whole new color with the real horse meat hung between Randy's legs. Watching Randy and Diego have so much with this newbie is funny to watch, but don't fool yourself -- Cory can hold his own as well as anyone. I chat Cory up in the beginning because I just love hearing this sexy cowboy talk. He shows me a red lighter that he had whittled the plastic label on the back into an 'M' for Marines and Randy was quick to point out that something like that showed love. He left that lighter here that night and I still have it sitting on my desk. And I agree with Randy, that's love.Getting Up Close And Personal With The Guys ... As I said, Randy and Diego were having a good time giving Cory shit that night, but he was a good sport and it was all in good fun. I was right in there with them making my usual bad jokes. I'd had a few beers before this rodeo and had a few during. These three hit it off immediately and things didn't take long to get fired up. I decided it was best if I make myself scarce and go back a pie. After I left these three took things from there for awhile. Randy suggests that Cory take his boots off and stay awhile. Cory obliges and the clothes are already disappearing. They kick a little small talk back and forth for a bit and loosen things up. It's interesting to watch though that Cory seems more eager than the others to get right down to business. He goes to take a bathroom break and the Diego puts on his cowboy hat and acts crazy. Once he's back from his short break, he gets right in there working on his cock like the other two. Randy helps him unzip and Randy gets right up on his knees and starts rubbing all over Cory's chest as he gets his big cock ready for Cory's hot mouth. He helps Cory out of his jeans and Randy goes down on the newbie to get his comfortable.Open The Gates ... The gates open up and out comes running three horny fellas with cocks in either their hand or their mouths. They're already down to business with Randy sucking Cory and now Cory sucking Diego. Cory is all wild eyed and as he watches while he gets down to business. You can tell he's like a cowboy in a rodeo. He's giving Diego some pretty good head as he also watches Diego suck on Randy's huge dick. You can tell he'd like to take that pony for a try and he will soon enough. Things switch up and Diego goes down on Cory to give Cory a round with Randy's big meat. He gives a great try as Randy fucks his face harder and faster, causing his eyes to water. Randy keeps going in, fucking his face, then letting him break, fucking his face. So hot to watch and Diego is keeping him busy at the other end. Finally Diego comes up to lend his partner a hand and together they master the horse meat. They give it plenty of good attention as Randy throws his O face out in sheer delight. One thing is for certain from here on they'll either love a big cock or they'll hate it. My guess is the former. Diego and Cory stroke each others cocks while they take turns on Randy's. Diego decides Cory needs some more attention and goes down to give it to him.Diego Makes A Feast Out Of Cory's Ass ... They position Cory to get him ready for the next step. On his hands and knees with his back arched, Diego eating his ass and Randy's cock in his mouth, Cory is sure to want more soon. Diego gets right in there like a champ and tongues and licks Cory's hole. He spreads it open and gives us a nice view of tongue on ass while Cory devotes his attention to Randy's cock. Diego and Randy give each other a look and you know what's coming next.A Yeehaw Deflowering ... Next thing we know Randy is standing on the bed above Cory's arched ass about to pile-drive his monster deep in his ass. Cory takes Diego's cock in his mouth and gives Randy full reigns as he saddles up for the ride. Doesn't take long before Randy is deep in his ass, long stroking his huge cock in and out of the Cowboy's tight hole. He keeps pounding harder, faster, deeper. Cory starts backing up on it and meeting Randy in the middle as Randy pounds him good.Cory Saddles Up And Rides The Horse ... We convince Cory to get on top of Randy's big cock and ride it hard and he does one hell of a job at riding. Randy's cock is deep inside with each thrust and Cory is holding his own. He's not gonna let this bronco buck him, he's there for the duration. Cory keeps Diego's cock in his mouth while he rides Randy's donkey. If you haven't fainted yet, hang on to your saddle. This cowboy knows how to ride 'em hard and hang 'em up wet as he takes that cock like a rodeo champion.Ridin' Side Saddle ... They position Cory so that he can eat Diego's ass while Randy pounds him from behind. Talk about endurance? This cowboy has it. He's hanging right in there with these guys and giving it his best. Watching him tongue Diego's ass while he gets pounded is so hot. Diego reaches back and spreads his cheeks wide open to give Cory plenty of access. Cory is stroking his own hard cock as he eats ass and gets fucked.Cory fucks Diego And The Nuts Start to Fly ... Cory gets to fuck Diego for a little while before they all end up in a circle suck. Diego is sucking Cory while Cory Sucks Randy and Randy sucks Diego. Cory blows his load and then helps Randy blow his. Everybody has gotten off and Cory asks the guys if he past the test. They give their nods of approval and it's a wrap.",
  "models": [
    {
      "name": "Cory",
      "person_id": 35067
    },
    {
      "name": "Diego",
      "person_id": 35077
    },
    {
      "name": "Randy",
      "person_id": 35130
    }
  ],
  "release_date": "2009-12-02",
  "scene_id": 70757,
  "series": "Gung Ho",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Deep Throat",
    "Gay",
    "Group",
    "Muscular",
    "Rimming",
    "Sandwich Fuck",
    "Tattoos",
    "Threesome"
  ],
  "title": "Cory, Diego and Randy Threesome"
}