{
  "collections": [
    "Active Duty"
  ],
  "description": "Now, we only introduced you to Orion the other day in the War Chest, but we've moved him along quite fast here. We're not wasting any time with this guy!Things start off in the shower, where Orion stumbles in, not realizing Riley was already lathering up. 'Oh hey!' Riley says, while Orion apologizes for barging in on his shower time. 'Don't just stand there, you wanna get in or what?' Riley says. Orion says that he's never showered 'with a dude before,' so Riley says they can share the shower.And really, this shower is enormous, after all. It's party-sized, really. I need to get more guys in there. Lemme get to work on that … ok, back to the scene!Riley offers to soap up Orion's back side, and then they both start complimenting each other on their tattoos. After a minute of some half-hearted lathering, Riley asks if this is all Orion wants to do. Orion's all, 'I dunno, what were you thinking?' Riley asks if Orion's been with a guy, and Orion says he hasn't, but he's been 'curious' about it. Well, he's in luck!Soon, Riley is down on his knees, asking Orion if he's gonna get hard for him. And then, the sucking begins, with Riley engulfing Orion and working him over. It isn't long before Orion is fully erect and Riley is going to town. Riley moves Orion around so Orion is sitting down, and he shuts the water off. (Now, we can hear every slurp and whisper between the two of them.)It isn't long before Orion's muscled bubble-butt is high up in the air and Riley is fucking him something good from behind. The guys work through a number of positions, with Orion riding Riley for a bit, grinding his ass down on to him. ('Oh shit, god that's deep!' Riley says, as Orion sinks his entire rump down onto his cock.)You'll have to see how things turn out -- and how many positions they work their way through -- but I think we've found a winner in Orion!",
  "models": [
    {
      "name": "Orion",
      "person_id": 35367
    },
    {
      "name": "Riley II",
      "person_id": 35356
    }
  ],
  "release_date": "2014-02-16",
  "scene_id": 70750,
  "series": "Pumped Privates 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Smooth"
  ],
  "title": "Orion & Riley"
}