{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm back behind the camera tonight with a brand spankin' new recruit for you that I'm really excited about: Niko!He's got the prettiest smile you've ever seen -- not to mention a bangin' body and a dick of death. (It's good know I still know how to pick 'em around here! lol.)In this half-hour long video, I run Niko through his paces. But, as (almost) always, we start out on the bed, where I'm chit-chatting with the well-built fella. He says he's excited to get started.He's 23-years old and stands 5'7' (or, as he jokes, '5'8' on a tall day') and weighs around 176 lbs. (He may be a bit on the shorter side, but he's got a frame full o'muscles, I tell you what.) He says he 'certainly tries' to hit the weights a lot -- and you can tell he spends a good deal of time in the gym.He says he'd like to get in the adult business because 'it seems like it'd be fun, and also, the financial part of it never hurts.''You mean the $2 I'm gonna pay you?' I jokingly ask him.He shoots back with a smile, 'You mean the dollar-fifty?' We both get a good chuckle out of this.I mention to him that he told me earlier that he said he was bisexual, and I ask him when he discovered that. He says he was 15-years old, and it was also the same time he had his first bi experience. He says it happened when he was a sophomore in high school, and the guy it was with was a senior at the time. Turns out, the senior was helping him with some biology homework (cue the mwow-chicka-mwow-wow music) and one thing led to another . . . I tell him to hold the hell up, saying that one thing didn't just lead to another. Something must have transpired.Niko relents and says that the guy told him how he had just gotten his dick pierced, and Niko then asked him how bad it hurt. So the guy said 'pull your dick out, I'll show you.' So, Niko says that he pulled his dick out and he said the other dude pinched his head, and Niko was like, 'what the fuck? Ow!' Then -- and here's where it starts getting really interesting -- Niko says the other dude said something along the lines of 'do you want me to kiss it to make it feel better?' Oh lord, wait until you get the rest of the story -- you gotta watch. Niko is a super interesting guy, and is very forthcoming with his stories. I can't tell you about everything he says -- but wait until he tells you about how he hooked up for the first time in college with a dude (thanks to Craigslist). And wait until you hear about his hilarious hotel hook up story. Now, you're gonna have to watch his full video to see what all else happens, but I'll tell you this: His solo scene is just as hot and sexy as his stories. You gotta check Niko out!",
  "models": [
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-03-05",
  "scene_id": 70756,
  "tags": [
    "Brunette",
    "First Time",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Solo",
    "War Chest"
  ],
  "title": "Niko - Solo"
}