{
  "collections": [
    "Active Duty"
  ],
  "description": "'We got a newbie,' director Kaden says, as we start our brand new scene tonight with Tito and Shea.The newbie in question is Shea, who we have yet to see before, but tonight, he goes all-in with Tito. The two take turns sucking and fucking one another something fierce -- and I'm super stoked to post it tonight for you guys.Kaden asks Shea how nervous he is, and he answers, 'On a scale from 1-10? Like, a, 7?' Kaden jokes that Shea is super nervous, but he feels that Tito should be able to 'relax' him a little bit, and 'calm those nerves.'Kaden acknowledges how I'm working a little backwards, and throwing Shea into the mix super fast -- since he hasn't even shot a solo. Well hell, when you've got a guy that's as cute as Shea, why *not* get him into some action asap? I'm doing it for you guys -- the members -- after all. lol.Kaden leaves the guys alone to get to know one another, and it isn't long before the shirts and jeans come off. They start comparing tattoos . . . and their brightly-colored underwear. A handful of seconds go by before Tito starts sliding his hands up and down Shea's inner thighs -- and we're off!'Gonna get you up and running here soon,' Tito growls at Shea, as the two guys start manhandling their briefs-clad dicks. Tito yanks off Shea's underwear and starts going to town. Hell, Kaden has only been out of the room for a hot minute and we're already on to blowjobs. He better get back fast before these guys carry on too far without him. lol.'Doing good so far?' Tito asks Shea, who smiles and says 'Yeah!' That's what I like to hear!Kaden has returned and he starts to get in close with the camera, catching every slurp of Tito's mouth on Shea's sizable dick. It's Shea's turn to go down on Tito, who orders him to 'suck on my balls.' Kaden gets right up in there with the camera so we hear every 'pop!' of Tito's balls as they drop out of Shea's mouth. Shea is able to slurp Tito all the way down into his mouth, which Tito is highly-impressed by. The guys switch it up and get into a 69 position, but soon enough, the guys can't hold back any longer and decide to move on to the fucking.Tito is up first, and he takes his place behind Shea and pounds him hard -- grabbing onto Shea's hips, slapping his ass, and grunting all the way. 'Like it? Huh?!' Tito barks at Shea, who can mostly only groan appreciative moans in response. Soon, it's time for Tito to get his fill -- so to speak -- of Shea's cock up his ass. Shea mans Tito's ass and starts railing him. The guys change positions so that Tito is sitting on Shea and riding him like a cowboy at the rodeo. Aw hell! 'Ooh, fuck yeah!' Shea exclaims, 'Ride that dick!'You're gonna have to watch the scene yourself to see how it ends, but it's safe to say that Shea's first time was a success!",
  "models": [
    {
      "name": "Tito",
      "person_id": 35355
    },
    {
      "name": "Shea",
      "person_id": 35370
    }
  ],
  "release_date": "2014-03-02",
  "scene_id": 70755,
  "series": "Pumped Privates 2",
  "tags": [
    "69",
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay"
  ],
  "title": "Shea & Tito"
}