{
  "collections": [
    "Active Duty"
  ],
  "description": "Our guest director Mike is back with a brand new recruit -- and a hard core bareback scene -- as we meet Roy tonight.Roy is joined by Tim (and Tim's ripped body, which is continually a sight to behold). Mike jokes that he thinks Tim looks nervous, but Tim quickly shoots back, smiling, 'I'm not!' Mike says that he's 'getting used to this,' since he's been around the block a few times now with us.Mike says that Roy has done a solo for him (which we've yet to share with you), and Roy (before he was deployed) even tried to film something with Bruce -- but it didn't work out too well. So, now he's back, after some time, and Tim is going to get a crack at Roy -- so to speak.'Sounds pretty good to me,' Roy says in a deep voice. Mike says he'll leave the guys alone so they can 'have at it.'We watch the guys slip their hands into their pants, as we hear the straight porn playing in the background. Mike asks Roy to take his hat off, and he balks at first, 'do I have to?' Mike says he does, and he yanks it off, throwing it to the side. (Roy does realize he's going to be naked in a few minutes, right? lol.)The guys seem a little nervous, and quiet, as is often the case. They stay focused on the mission at hand -- and the pussy porn on the TV screen. Tim is the first to whip his underwear off, revealing a stiff dick. Roy glances over a few times, side-eyeing Tim's cock.Mike asks Roy, 'what are you thinking?' Roy immediately says, laughing, 'My ass is gonna be hurtin'.' lol. Mike assures him that Tim will take it slow and easy on him.It isn't long before Roy has taken Tim's dick into his mouth and is going to town, sucking him down something good. Tim is enjoying himself, and tells Mike how good Roy is doing. Roy comes off for a bit, taking a breather, but then goes back down. You can tell this is very new for Roy, as every time he stops sucking, he quickly wipes the saliva off his mouth, looking around. It's that, 'I just sucked a dick and I need to wipe all this dick spit off me'-look, you know what I mean?Roy gives Tim a little bit more of a toe-curling blowjob, and then Tim asks Roy if he's ready to get fucked. Roy says 'yeah' and lays down on the bed. The guys waste no time here -- and really the bulk of this scene (which is 26 minutes long) is fucking. Tim grabs the lube, slathers his bareback dick, and starts to dive into Roy. Somewhat surprisingly, Roy is very quiet here, not making barely a peep as Tim plows into him from behind. Soon, we start to hear some grunts and groans from Roy, as he grips the bed's duvet tightly and looks around the room. Tim, meanwhile, has found a steady rhythm and is working Roy over pretty good. Roy gets up on his hands and knees so Tim can stand behind him and start railing his ass. Eventually the guys get up to a pretty decent speed, and Tim whispers, 'Yeah, you like that?' Roy responds 'yeah!' as best he can, as he bounces against Tim's body. Roy is holding on to the bed's duvet something serious -- he's gripping it so tight, that he ends up yanking the duvet off the bed (we hear it go 'pop' as it yanks out from underneath the mattress).Soon, Tim has pulled out and is shooting his load all over Roy's back. Mike asks if Roy liked it, and Roy smiles, and says he did. Mike lets us in on a secret, saying that he gave Roy a toy to practice on -- before he took Tim. Well, no wonder Roy wasn't crawling around the room! He had already had a test run with a toy. Mike jokes that Tim might be a little 'bigger' than the toy. Roy says 'that's an understatement.' By the end of the scene, the guys say they've made a new friend and are down to work together again. Success!",
  "models": [
    {
      "name": "Tim II",
      "person_id": 35358
    },
    {
      "name": "Roy",
      "person_id": 35372
    }
  ],
  "release_date": "2014-03-16",
  "scene_id": 70759,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Roy & Tim"
}