{
  "collections": [
    "Active Duty"
  ],
  "description": "I've wasted no time in hustling our new find Niko into some hard core action. When you stumble upon a guy like this, you don't fritter away the opportunity.Our scene today opens with Niko and Tito getting wet -- in the shower. (They'll get wet in a different way a bit later.) Niko slurps and kisses his way down Tito's body quickly, before engulfing Tito's dick into his mouth. It's super hot to see these guys go at it -- their bodies compliment one another so well. Tito has a nice build, with well-toned muscles and a great chest. Niko is just hot all over with a body that won't quit. I'm even amazed at just the little things -- like watching his biceps flex as he grips Tito's dick. Tito gets his share of Niko's dick too, as Tito gets down on his knees and starts lapping up Niko's big one.Since Niko has told us he's bi, I think there's an extra thrill in watching him with Tito. In that we know Niko has actually sucked dick before and has experienced messing around with guys. Niko goes to town on Tito's dick, working it over something good, as Niko's rippling abs bulge out of his torso. Soon, Niko has Tito turned around, and Niko's face is planted between Tito's ass cheeks. Niko is prepping Tito for what's to come, you see -- and Tito knows it. Tito throws his hand back, placing it behind Niko's head in order to help guide him into his hole. Things switch up for a bit as Tito gets another mouthful of Niko -- and we get an amazing from-below look at Niko's amazing body. His chest is to die for. Those pec muscles! Those abs! He's just all man, baby.Now it's Niko's turn to get his ass licked, as Tito goes in for the kill, spitting and fingering Niko's hole. Tito also busies himself with jerking Niko whilst spitting and lubing up Niko's rear. The guys change it up, and now it's time for the fucking to begin. We get in close with the camera, where Tito is down on his hands and knees and Niko has slid up behind him -- preparing to mount. Niko slides in -- as Tito gasps, but quickly gets used to the fat cock inside him. Niko wastes no time in building a quick rhythm, as he grabs Tito's hips and starts slamming into him.Tito is bouncing around the room as Niko takes him for a ride. It isn't long before the guys have switched positions, and now Niko is sitting down, with Tito planting his ass atop him. We've seen Tito in this position before -- and we know it works wonders for him. Besides, seeing Tito go for a bucking bronco ride like this is always, always hot. A change of position happens again, as Tito is on his back, with Niko between his legs, slam-fucking him to high-heaven. Tito's raging-hard dick is bouncing around in the air as Niko aggressively shoves his cock inside him. Niko keeps slamming into Tito until Tito blurts out 'I'm gonna cum,' and he then shoots a high-spurting load into the air and all over his chest. Damn! Niko keeps on going until it's his turn, and then he pulls out and sprays all over Tito. When all is said and done, Tito tells Kaden that he was impressed by Niko's performance, and, Niko says he's down for Tito to fuck him. I can't wait to see that happen!",
  "models": [
    {
      "name": "Tito",
      "person_id": 35355
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-03-09",
  "scene_id": 70758,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Shower"
  ],
  "title": "Niko & Tito"
}