{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight for our update, we bring you a hard core scene starring that hot new guy that we introduced to you just the other day: James!<br /><br />The big fella is paired up with Niko -- so you know this is gonna be good -- and Kaden is manning the camera. (Maybe we'll get Kaden lured back over to the other side of the lens one of these days?)<br /><br />Kaden tells us that the guys just recently finished a three way with Tito (something we'll see soon enough), but today, we're getting James and Niko all alone.<br /><br />The guys joke around about how Niko 'filed a request' (James' words) to get some one-on-one time with James, so that's why we have these two going head-to-head. Kaden excuses himself to let the guys get 'straight to it,' 'no pun intended.'<br /><br />'Oh shit,' James says, jokingly, 'He's leaving us.' James ribs Niko about what 'porn' he picked out tonight for them to watch for inspiration. The guys start to get comfortable while watching the off-camera porn. After they've shucked their jeans off, we get a good look at just how big their legs are. Truly, James' thighs are like tree trunks. <br /><br />Off come the shirts and the gents start to get in close. James hoists out his big thick one from his boxers and Niko goes to town. James doesn't hesitate with his vocalizations, telling Niko just how good of a blowjob he gives (not to mention complimenting Niko on his amazing ass).<br /><br />'Show the camera that big ass!' James tells Niko, and yanks him around so that Niko's rear is facing the camera. James slaps his cock against Niko's ass cheeks, telling him how he 'can't wait to be in that fucking hole.' But it's not time for the fucking yet, so James stands up on the bed, leans back against the wall, and let's Niko work his cock. It's awesome to see James' full body fill up the entire camera -- it's indeed a sight to behold. The guys sit back down and James starts to jerk Niko while Niko blows him -- all the while, telling Niko how he can't wait to fuck him. <br /><br />Well, as it turns out, a full half of the 30-minute long video is taken up by fucking -- so clearly, James was ready and willing. With Niko face down in the bed, and James planted behind him, the guys work up a vigorous rhythm -- that I swear almost breaks the bed. (Well, it certainly sounds like the joints are going to give way any moment.) Eventually the guys shoot their loads all over Niko's chest and by the time it's all over, 'Wowsers' is the word that's used to describe what just happened. lol.",
  "models": [
    {
      "name": "James II",
      "person_id": 35375
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-04-13",
  "scene_id": 70767,
  "series": "Going Commando 3",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular"
  ],
  "title": "James II & Niko"
}