{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden directed this one, and it's a super hot pairing between Niko and Shea. Niko is so into Shea, that, when the camera starts rolling and Kaden is chit-chatting with them, Niko is already roaming his hands over Shea's body. Clearly, he's already thrilled with what's in store for him today.<br /><br />Kaden exchanges a little bit of chatter with the guys, telling Shea that Niko is pretty brand new to us, and only just did his first scene. Kaden says that we paired Niko up with Shea, figuring that they would compliment one another. Shea nods his head, agreeing, while Niko gives a knowing smile to Kaden. Oh, I think we have a winner here!<br /><br />Kaden steps away to let the guys get to know one another, and that's when the sparks begin to fly.<br /><br />'So you say you got a girlfriend?' Niko asks Shea, as he runs his hands across Shea's chest, feeling his pec muscles. 'Yeah…' Shea says. 'How long y'all been together,' Niko asks, continuing to grope Shea. 'Little while… like… eight months,' Shea answers. 'Oh yeah? Is it pretty serious?' Niko questions. 'Yeah, I guess, but I mean obviously it's not that serious … I'm doing this,' Shea laughs, as does Niko. <br /><br />Shea turns it around on Niko, and asks him if has a girlfriend. Niko says no … and continues to concentrate on running his hands and fingers up and down Shea's arm. Niko says that if she wasn't there for him sexually, what good was she for? Shea says, 'Yeah, I got you…' and then leans in for a kiss… and the two start making out something fierce. This is a *moment* I tell you! We're seeing something really real happening. Dem boys are in love, or, at least lust. lol.<br /><br />Kaden still isn't back yet, but Shea is already undoing Niko's jeans and clothes are starting to come off. If he doesn't come back soon, these guys are gonna be finished before he returns!<br /><br />The bed's a squeaking and creaking as the guys roll around, making out all over the bed. The shirts are off and Shea's pants are next to fall. The men are buck naked now (except for socks), and they're caressing one another like they're on their way to a serious relationship. <br /><br />Kaden returns to the scene, lucky for us, so we get in closer with the camera to get a bird's eye view. Niko is going down on Shea, who is in high heaven. Niko gives a look at the camera like, 'you know want some of this.' The oral action goes for a bit longer, and you can't help but to shake the feeling that Niko is in love. He straddles Shea, kissing him, and grabs his hand and has him slap his ass.<br /><br />After some more oral action -- on both their parts -- it's time for the fucking to begin. Niko's ass is up for grabs first, and he's eager: 'Just like that,' he groans, 'fuck me Shea,' as the latter builds up a rhythm. 'That feels so fucking good baby,' Niko says. The guys move through a couple positions, as Niko's level of pleasure is also levitated to new heights.<br /><br />'It's my turn to fuck you,' Niko says to Shea, who responds, 'Oh is it?' Yes, yes it is. lol. In no time flat, Shea's down on his hands and knees and Niko is slamming into him from behind. Shea is gripping onto a pillow for dear life, as he gets bounced hard by Niko. It isn't long before Niko is shoot a load all over Shea's body, and then Niko sucks off Shea until he too cums. Shea shoots his load all over Niko's face and head. Whew!",
  "models": [
    {
      "name": "Niko",
      "person_id": 35371
    },
    {
      "name": "Shea",
      "person_id": 35370
    }
  ],
  "release_date": "2014-03-23",
  "scene_id": 70761,
  "series": "Battle of the Bulge 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Facial",
    "Gay",
    "Kissing",
    "Muscular",
    "Sensual",
    "Tattoos"
  ],
  "title": "Niko & Shea"
}