{
  "collections": [
    "Active Duty"
  ],
  "description": "We're doing things a little out of order tonight, but I'm sure you won't mind. We just introduced you to Zane the other day in the War Chest Update, where he made his very first appearance in front of a camera -- anywhere. Well tonight, we're getting Zane in his first hard core scene with a guy -- and it's with someone you've never before before: Andre.Zane says he's a little nervous -- hell, wouldn't you be? After all, he's about to have his anal cherry taken by someone he just met. But you know, we have a way of partnering up people that we think will have some good chemistry, so I know he's in good hands.In fact, he's in the hands of directory Kaden (well, not literally, but that *would* be something, now wouldn't it … ?). Both of the guys say they are nervous, but they'll get over that soon enough, methinks.Kaden asks who they think might take over the 'lead' in this situation, and Zane quickly volunteers that he thinks his personality will take the lead.Kaden says to Zane that Andre told him earlier that if Zane does a good enough job, Andre will bottom. Both of the guys have this look of 'wait, what?' because clearly, nothing of the sort was said earlier, and Andrea is wide-eyed with slight panic. lol.Kaden lets the guys start to go at it, and after a bit of chit-chatting and some porn-watching, the clothes start to come off. Zane is the first to go down, as he starts sucking off Andre -- who is clearly enjoying himself. 'Oh man,' he moans, throwing his head back. Andre makes sure to jerk off Zane while he's getting head too, reaching underneath and grabbing his dick. 'Have you ever been sucked off by a guy?' Andre asks Zane, who is going down on him. Zane lifts off Andre's dick and shakes his head, saying 'No.' Andre says, 'Well, maybe I should give you a little taste.' And with that, Zane is off to the races, getting his first blow job from a guy. (Hell, it's a day of firsts for him, considering his about to give up his ass in just a little bit …)It isn't long before Andre is positioning himself behind Zane, getting him ready for what's next: a dick up his ass. Zane's clearly clenched-up, and difficult to get into, but Andre's a trooper. He eventually works his dick into Zane, and the guys work through a series of positions all over the bed. Poor Zane didn't know what hit him, I don't think!By the time all is said and done, a smiling Zane said he had a 'good' time but it was 'exhausting.' Heh. Andre says it was 'amazing.' Sounds like the guys had a good time, and they are all smiles, and saying how they want to come back.",
  "models": [
    {
      "name": "Zane II",
      "person_id": 35374
    },
    {
      "name": "Andre",
      "person_id": 35376
    }
  ],
  "release_date": "2014-06-08",
  "scene_id": 70765,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Smooth"
  ],
  "title": "Andre & Zane, Scene #01"
}