{
  "collections": [
    "Active Duty"
  ],
  "description": "As the scene opens, director Kaden is chatting with the three guys on the bed, telling them how a previous scene with James and Tito worked out so well, they decided to mix things up and throw Niko into the mix. (We'll show you the James/Tito duo in a later update.)Kaden excuses himself, telling the guys to let the 'magic' happen. It isn't long before the guys are buck naked, sucking one another, and James is barking out orders to Niko and Tito. These fellas waste no time whatsoever. Tito services James, while Niko blows Tito. Eventually, things switch up a bit so that Tito is blowing both James and Niko, who are standing on either side of his face -- giving him easy access to their cocks. Next, James takes center stage, as he lays down on the bed, letting both Niko and Tito go to town on his thick dick. Tito stands up and gets his dick near James' cock, and then Niko is able to blow both guys at the same time, getting both of their dicks in his mouth. Hot!It's time for the fucking, and Niko is more than ready! He gets on his hands and knees, shoving his ass in the air to James, who mans him from behind. Niko is busy sucking Tito while he's getting fucked too -- he's doing double duty here. Then, it's Tito's turn to take Niko's ass for a spin, as he slurps down James. Another position change, as it's time for Niko to sit on top of James and go for a ride… but wait, Tito wants more. He's back to fucking Niko, eventually working his way up to an explosive cum shot that he unloads all of Niko's chest. Then, James shoots his load all over Niko's face, covering him with his load. Damn!The guys close out the scene with a bit of post-sex chatter with Kaden, and that's a wrap!",
  "models": [
    {
      "name": "Tito",
      "person_id": 35355
    },
    {
      "name": "Niko",
      "person_id": 35371
    },
    {
      "name": "James II",
      "person_id": 35375
    }
  ],
  "release_date": "2014-04-20",
  "scene_id": 70769,
  "series": "Going Commando 3",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Facial",
    "Gay",
    "Smooth",
    "Threesome"
  ],
  "title": "James, Niko & Tito"
}