{
  "collections": [
    "Active Duty"
  ],
  "description": "We open on Niko, Shea and Tito lathering up in the shower -- and things are already off to a great start. Niko and Shea are soaping up Tito, and all of the guys are already half-hard and on their way to erection heaven. Seeing their bodies glisten under the water is something else, I tell you -- it's very sexy. As they rub and grope each other, Shea leans in for a kiss from Niko, and he responds, and the guys start making out. Meanwhile, Tito reaches around to give Niko a helping hand with his dick, and everybody is hard now. We make sure to pan up and down to get a nice, long look at their bodies -- and their amazing legs. There's a lot of body worship here, and I don't blame them one bit! These boys have got muscles for days, especially Niko and Shea, who I could watch rolling around all afternoon. lol.Tito encourages the guys to get down on their knees to service his dick, and they oblige. Shea and Niko take turns slurping down Tito's dick, licking and and stroking him good. 'You like sharing that dick, huh?' Tito says, and Shea responds with a mouthful of cock, 'Mmmhmmm.'Tito turns around, feeding Shea his dick in full, while Niko dives between Tito's ass cheeks with his mouth. While licking and probing Tito's ass, Niko jerks off Shea, and then dips down to start blowing him, too. These guys get into more positions than a pretzel.A position change ensues, with Niko blowing a standing Tito, while Shea is down on his knees, servicing Niko. Soon, we've changed positions again, and Tito is down between Niko and Shea, servicing both guys.Niko takes it to the next level, as he gets down on his knees and starts sucking both Tito and Shea at the same time, shoving both of their dicks into his mouth. It's Shea's turn to get down on his knees, as he works over Niko and Tito (while Niko licks and kisses on Tito's neck and chest). We've yet to see Tito kiss a guy, but I'll give Niko props on trying his darndest to get Tito to give him some sugar. lol.'Which one of you guys wants to fuck me first?' Niko says. Tito is the first responder, and we immediately cut to Niko bent over the bath, while Tito is pounding him from behind. Meanwhile, Niko is moaning and groaning while sucking on Shea, who is perched on the tub in front of Niko. Soon, it's time for a switch, as Shea takes on Tito's ass (while Niko watches intently on the side, slapping Shea's ass for encouragement). 'I wanna get fucked too,' Niko tells Shea, who pulls straight out of Tito and goes directly over to Niko's ass and plows in. 'You like it when he fucks your little ass?' Tito asks Niko, in his deep voice. All Niko can do is pants 'uh huh,' since he's got a mouthful of Tito's dick and he's being rammed from behind.It's Shea's turn to get plowed, as Tito is doing the honors. Shea is a quivering, moaning mess as he gets fucked to high heaven by Tito. Tito straddles Shea, grabs onto his legs, hoists them in the air, and goes to town, fucking him hard. It isn't long before Shea groans that he's going to cum, and he starts starts shooting while Tito is fucking him. Then Tito barks that he's going to cum, and quickly pulls out, yanks off his condom and starts shooting a major load all over Shea. Niko is the last to shoot, as he sends streams of cum all over Shea's face and chin. Damn!A little chit-chat with director Kaden follows, as the guys have a laugh to close out scene.",
  "models": [
    {
      "name": "Tito",
      "person_id": 35355
    },
    {
      "name": "Shea",
      "person_id": 35370
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-03-30",
  "scene_id": 70763,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Gay",
    "Shower",
    "Smooth",
    "Threesome"
  ],
  "title": "Niko, Shea & Tito, Scene #01"
}