{
  "collections": [
    "Active Duty"
  ],
  "description": "'I don't know! … I'm about to jack off I think!'And that's how we start tonight's scene with 6' tall James, a newbie to these parts, and a hot one at that. He weighs in at 203 lbs and has a nice muscular frame. And -- an amazing ass. (He's also one of those guys that's way more sexy when he's in motion -- his still photos don't do him justice, I swear.)We open on a scene that I directed, and we're smack dab in the middle of a little story where I'm going on and on about some Dink wannabe out there that was putting the make on James. As you all know, there's only one Dink Flamingo, and this Dink Flamingo is super happy that he's got James in front of the camera tonight.'I've got that big Kim K(ardashian) booty,' James says, suggesting that everyone wants to fuck him. 'What's that tell you?' I ask him. 'That I got a great ass,' James answers, matter-of-factly. lol. 'Oh, it's true!' he says, laughing. He's a total card and we got a long great. If you love hearing me blab away with the guys -- the chatterbox that I am -- then you're gonna enjoy this video a lot.'Am I supposed to be sexy now?' James says, as he starts groping his dick in his shorts, joking about how some hanging lights are banging the back of his head. We decide to move over to the 'casting couch,' where James can get more comfortable -- and I can harass him even more. I shoot this scene a bit like a 'if you were there.' Basically, I'm behind the camera, dirty talking my way through it, telling James to slap my face with his dick and to shove it down my throat and so forth. All the while, his dick is front and center in the frame, and he's slapping it around, swinging it back and forth. Trust me -- it's hot. And James' voice is super sexy when he's growing and grunting at the camera. Hot damn, I think I need a fan, y'all!Wait until the end when I have to take matters into my own hands. Literally. It's hilarious.",
  "models": [
    {
      "name": "James II",
      "person_id": 35375
    }
  ],
  "release_date": "2014-04-09",
  "scene_id": 70766,
  "series": "James II - Solo ",
  "tags": [
    "Big Dick",
    "Brunette",
    "First Time",
    "Gay",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "James II - Solo , Scene #01"
}