{
  "collections": [
    "Active Duty"
  ],
  "description": "Guest director Mike opens tonight's scene by joking about how 'two of his favorite victims' are in front of the camera: Corey and James. The guys are all smiles, and are in good spirits. Mike says he's been wanting these two to meet for a while now, and says that he's going to -- as usual -- leave them alone and see what happens. I'll go ahead and give you a spoiler -- James gets only his second blowjob from a guy today. And lucky Corey is the fella that does the honors. Even better -- while James didn't even touch the last guy that gave him a blowjob, in tonight's scene, he jerks off Corey, too. (Little by little, step by step -- we get these guys to cross that line!)Corey is packing a massive tool -- not to mention ripped ab muscles and a toned body. James is a thick, muscular guy with a body that looks like it sees manual labor. When 6'1' James has his hand thrust in his pants and is working his dick up to full-speed, you can see his shoulder muscles flexing and pumping as his hand goes to work. Awesome.The pants come off as the gents get more comfortable, watching the straight porn off camera. Corey steals a glance over at James' dick, and then Mike says the guys 'look good together.' They both say thank you, smiling, while continuing to work their respective cocks.Corey is stiff as a board -- so stiff that we can hear his dick go 'thunk' as it slaps against his stomach muscles. Dang!Corey asks James what he's done with a guy, and he says that he's only gotten head once before. 'And this…' indicating what the guys are doing now. Corey leans over and starts to give James a blow job, as James sighs appreciatively. 'Feel good?' Corey asks. 'Mmhmmm,' James responds. It isn't long before Corey is going to town, giving James a seriously good blow job -- and James is moaning and sighing like he means it. (Corey, meanwhile, is still rock hard -- dick waving in the air as he slurps up James.)Soon, James is jerking himself to completion -- after Corey has finished up his oral obligations. Corey then leans back and lets James jerk him off -- the first time he's ever touched another guy's dick! Soon, Corey is moaning and breathing heavy, saying how it 'feels fucking awesome.' While we're not gonna get James to suck cock today, this was still a pretty big deal. Corey takes over and jerks out his own load, letting it fly all over his ab muscles.'You done good James,' says Mike, telling James how he knows it was out of his 'norm' to do this. 'Yes! It is,' James says, nodding yes, smiling. James says he's down to come back and work some more, so we'll shall see …",
  "models": [
    {
      "name": "Corey",
      "person_id": 35350
    },
    {
      "name": "James",
      "person_id": 35366
    }
  ],
  "release_date": "2014-05-11",
  "scene_id": 70774,
  "series": "Military Bareback Files 5",
  "tags": [
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Tattoos"
  ],
  "title": "Corey & James"
}