{
  "collections": [
    "Active Duty"
  ],
  "description": "It took almost an entire evening (four hours) for the following events to occur. The first part is the main feature, which is followed by a lot of outtakes that help you see how the feature evolved over the course of the evening.  All told, this video clocks in at more than 90 minutes! (Buckle those seat belts!)<br /><br />An easy challenge for Big Jake ...<br /><br />I challenged our man Jake to go out and recruit new guys for us. Jamie was one of the guys that Jake found as he scouted around, looking for what he thought I'd see as the perfect guys. The only thing I forgot to tell Jake before he ventured out was that there would be a second part to the challenge. Jake figures ... 'hell how hard can it be to pass cards and get guys to call back?'. Little did he know that was only the half of it.<br /><br />Establishing the line ... <br /><br />After a provocative photo shoot, Jamie agrees to do a solo jerk off video. I tell Jake that he's to come in and guide him -- as a friendly face -- and then the two of them can do a double side-by-side jerk off.<br /><br />I get Jake downstairs in the bedroom with Jamie and me (he's clearly taken by surprise) and tell him what I've decided. I start joking about someone crossing the line and getting too close and watch the guy's reactions. Jamie makes it clear that he will be crossing no lines tonight but Jake isn't so quick to agree. We all laugh a bit and the two of them hop on the bed together and start watching a straight porn.<br /><br />Issuing the real challenge ... (Out Takes) <br /><br />I get a phone call and see it as an excuse to leave for a bit. I joke with Jamie about bringing out the mysterious 'fluffer' to help him get hard. He agrees if it can get him hard. Jake just laughs. I call Jake into the bathroom and tell him that the real challenge is to tell his new recruit what really goes on around here and what we really do. Back on video, I tell Jake once again that I'm about to leave and that it is his duty to tell his new recruit the real deal. He agrees not to sugar-coat it, but asks if he can have a drink first.<br /><br />Once I'm gone, Jake starts talking to Jamie who asks 'What's the fluffer?' Jake almost chokes on his drink as he explains to Jamie that the 'fluffer' is a dude. The look on Jamie's face is priceless as he proclaims that he is not cool with that at all. But Jake doesn't give up there. He tells Jamie that he's done a few videos with other guys and that it's really not that bad. Jake builds a trust with his new recruit and assures him that it's ok and that it 'doesn't define who you really are.' Listening to Jake as he explains and justifies what he is about to ask his new recruit to do and watching as Jamie slowly becomes more comfortable with the whole idea of it all is fascinating.<br /><br />I return and ask Jake on video how it went as Jamie sits listening. Jake isn't too sure how convincing he's been, but I can clearly see that Jamie is ready to move to the next level. So, I give Jake a little helping hand and talk to Jamie about it more. In this 'out takes' session we get to see how the whole night (nearly four hours) progressed into the main feature. Surprisingly Jake offers to 'help his little partner out' first. I'm as shocked by Jake's offer to suck Jamie's cock as Jamie is. Jamie agrees.<br /><br />Jake crosses the line to meet the challenge ...<br /><br />After it's established that Jamie is game, Jake tells him that he guesses if Jamie isn't going to cross the line first that he'll just have to cross it himself. Big Jake reaches across the line and grabs his new recruit's cock and begins stroking it. It isn't long before he comes up on his knees and takes Jamie's cock into his mouth and begins to caress it with his tongue ring, preparing to take it down his throat.<br /><br />It's so erotic to watch as this big, masculine man makes love to his cute young recruit's cock. Jake, in his determination to meet the challenge, has agreed to suck cock for his very first time ever if it'll get his recruit 'in the mood'. Big Jake is sucking cock like a champ in no time and tells Jamie to jerk him off while he continues to suck him.<br /><br />Eventually, as Jake sees that Jamie is comfortable with jerking him while he sucks Jamie's cock, he tells Jamie that it's time he return the favor. Jamie, eager to please his recruiter, returns the favor without hesitation and Jake talks the boy through getting him off. I give Jake the camera during this scene and let him film Jamie as his new recruit works his cock over and Jake gives him instructions. Jake finally let's loose and his nut explodes right into Jamie's accommodating mouth. Jamie doesn't flinch as Jake unloads, but the cum just oozes out all over Jamie's chest and the comforter. When Jake is finished, Jamie stands up and spits the load out on the floor.<br /><br />But wait, Jamie still has to get off so Jake gets back on his knees and finishes working his recruits cock until he explodes into Jake's mouth. This has got to be one of the hottest things I've ever filmed as our big hero takes the load in his mouth and stands up and growls at the camera with a cum-covered mouth and wipes Jamie's cum all over his chest. The line has been crossed, the challenge has been met and our big hero gives his little recruit a man-sized hug.",
  "models": [
    {
      "name": "Jake (Big Jake)",
      "person_id": 35199
    },
    {
      "name": "Jamie",
      "person_id": 35095
    }
  ],
  "release_date": "2014-04-30",
  "scene_id": 70772,
  "series": "Crossin the Line",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Muscular",
    "War Chest"
  ],
  "title": "Jake & Jamie"
}