{
  "collections": [
    "Active Duty"
  ],
  "description": "Today's scene features James and Shea -- and wow, does Shea get it good from James!The gents start off in the shower, getting nice and squeaky clean before they get … nice and dirty. (Oh, I amuse myself so with the bad jokes!)The guys kid around about working out a little bit, and start slapping each other's asses, horsing around. They help lather one another up as we get to see all of their muscles glisten under the cascading water. (Shea is just glorious under the water -- his pec muscles are amazing. His abs are awesome too. Oh hell, he just has a great body.)Shea starts jerking James as the guys start to get down to business. Shea drops to his knees and starts blowing James under the shower. James reacts strongly, vocally, as he tells Shea how much he likes the attention his cock is getting.The guys switch it up a little bit, and James moves over to the side of the tub -- which is also helpful so that poor Shea doesn't drown under all that water in the shower. Heh. 'I wanna see that fucking ass,' James moans to Shea, who jumps up to show him his rear. James start slapping his butt around, telling him how he 'can't wait' to bend him over and fuck him. 'You ready for that big dick?' James asks. 'Yeah,' Shea says. James jokes back at him, 'You don't sound too excited!' Ha!Next thing you know, James is deep inside Shea, telling him how his ass is 'so tight!' Shea and James are moaning and groaning like cats in heat -- if you like aural sex, you're gonna get a kick out of this scene. When Shea sits atop James dick and goes for a ride, it's pretty amazing. He bounces along, with his dick waving around in the air, swinging back and forth as he drives his ass farther and farther down James' dick. Wait until the end of the scene, when Shea shoots his load *while* being fucked by James … and then when James shoots, it goes flying all over Shea's stomach. Awesome!When all is said and done, the guys are chatting with director Kaden, and Kaden says 'welcome back!' to Shea, saying how we sure did miss him here at Active Duty. And I know I'm glad to see his smiling face (and rocking body) back in front of the camera.",
  "models": [
    {
      "name": "Shea",
      "person_id": 35370
    },
    {
      "name": "James II",
      "person_id": 35375
    }
  ],
  "release_date": "2014-04-27",
  "scene_id": 70771,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Shower"
  ],
  "title": "James & Shea, Scene #01"
}