{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden's directing this scene, and he says that we've got a new guy in our midst -- James! Kaden knows that James has probably been around the block, and jokes that he won't press him to tell all of his 'secrets,' and the guys get a good chuckle out of that. Kaden steps out of the room and lets the guys get comfortable.Tito asks James what kind of porn he's into. James says 'the nasty kind.' Ha! They're looking at some off-camera porn, and James says 'she's a whore … but I guess we are too!' The gents are all smiles as they strip off their shirts. 'Making me pretty hard,' James says, as he gestures at the movie. 'Let me see,' Tito says. And away we go!Tito starts to jerk James, and James reacts loudly -- moaning and groaning at Tito's machinations. Tito moves around a bit to get up on his knees, and in doing so, he gives James easy access to slap Tito's ass a bit. We can see Tito's dick tenting in his black briefs something fierce, too. Kaden hasn't even come back in the room yet, and these guys are off and running! James is a vocal dude, so if you love moaning and groaning and and barking of orders -- you're gonna just love James. Kaden gets some interesting angles -- especially with the cool use of a mirror in the background. Tito's mouth gets a serious workout, as he sucks James seven ways to Sunday.After the oral action is over with, it's time for the fucking, as James lays into Tito hard from behind. The guys work through a bunch of positions -- and James is relentless in his pounding of Tito. But Tito stays nice and hard throughout -- even when he's straddled atop James as he bounces up and down in the air.The guys eventually climax -- with James commanding Tito to shoot his load -- as Tito blows while being fucked. Then James shoots his load all over Tito's torso -- and it's a gusher!As the guys finish up and are chatting with Kaden on the bed, James jokes that there were 'fireworks, man,' between he and Tito. Even a chuckling Tito knows James is laying on the bullshit a bit thick. But in all seriousness, the guys had a great time, and we know they'll be back for more.",
  "models": [
    {
      "name": "James II",
      "person_id": 35375
    },
    {
      "name": "Tito",
      "person_id": 35355
    }
  ],
  "release_date": "2014-05-25",
  "scene_id": 70777,
  "series": "James & Tito",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular"
  ],
  "title": "James & Tito, Scene #01"
}