{
  "collections": [
    "Active Duty"
  ],
  "description": "It's great to see Evan back in action, and this time, he's in front of our old pal Mike's camera with Tim. Make sure you check out some of Evan's earlier scenes for us, including his sizzling work with Kaden and Axl. (His scene with Kaden was his very first time doing anything with a guy. And it was a 'wow' of a scene, indeed!)Anyways, back to today's scene! Director Mike says that Evan's done this before, as has Tim, so he's not going to bother them with instructions, and instead, just let them go at it. Evan looks about the same as he used to, though he's got a number of colorful new tattoos on him.The guys start feeling up their dicks inside their pants as they watch the off-camera porn. Evan reaches over to lift up Tim's shirt, which reveals his washboard abs, and Tim exclaims, 'Damn, look at that!' Clearly, he -- and his wandering hand -- is enamored with the bulging muscles in Tim's stomach. (Aren't well all Evan, aren't we all?)Evan kisses and licks Tim's chest, worshipping his rock-hard muscles, and soon, he's engulfed Tim's dick into his mouth and is going to town. And all this has happened less than three minutes into the scene! After some dedicated oral action, the guys start 69ing, with Evan on top, feeding his dick to Tim. To be fair, the bulk of this 26-minute scene is devoted to actual fucking, as more than half of it is consumed by the guys flip-flopping one another. Tim is the first to get plowed, as he takes Evan's long dick -- bareback -- like a champ, on his back. Well, like a moaning and groaning champ, that is. Evan jerks Tim's massive meat as he fucks him, and bends down to suck him *while* fucking him. Yes, it's super hot. Eventually, Evan shoots his load all over Tim's balls.Then, it's Evan's turn to get fucked -- and I'm guessing it's probably been a while since he's had anything inside him. (Maybe the last time he shot for us a long time ago?) The sounds he make clearly indicate Tim's awfully big for him, but he's a trooper and soldiers through. Granted, Tim's dick is also the size of Texas, so . . . Though, it isn't long before Evan's back into the groove, and is throwing his hands back, grabbing onto Tim's legs as he fucks him. Wait until you see Tim blow his load -- as Evan tickles and fondles his balls from underneath. It's hard to describe, but it's super hot.By the time the guys are done, Mike is asking when he can get the guys back together, and Evan says 'as soon as you want to.' Well, alright! Welcome back Evan!",
  "models": [
    {
      "name": "Evan",
      "person_id": 35082
    },
    {
      "name": "Tim II",
      "person_id": 35358
    }
  ],
  "release_date": "2014-05-04",
  "scene_id": 70773,
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Tattoos",
    "White Butt"
  ],
  "title": "Evan & Tim"
}