{
  "collections": [
    "Active Duty"
  ],
  "description": "'I thought I was here for a solo?' Julian says, as he walks into the bathroom, where Niko is buck naked, showering up and Kaden is already filming.'Oh, no, I'm sorry,' Kaden says, half-joking, 'Niko requested you.' (And what Niko wants, Niko gets, evidently, as we're off and running in this very hot scene!)Niko takes Julian by the hands, guiding him to his naked body. Niko is so super hot -- his body is just insanely well-built. And lord, does it look mighty find while glistening from soapy water. Niko leans in and pulls Julian's shirt off, and then dives in for a kiss or two, or three, or four . . . Before you know it, Niko is slipping his hands into the waistband of Julian's sweatpants, and is pushing them down, revealing that oh-so-juicy ass of Niko's. (Dang, this scene is like a battle of the bodacious asses!) What was that about a solo?Niko leads Julian into the shower, and under the shower head, as the guys start soaping one another up. Niko makes sure to stroke and lather every inch of Julian's muscular body. This is very sensual, and very erotic. (Amusingly, Julian tries to make sure his hair looks good as he sort of combs his wet hair with his hands.)The guys turn away from the camera, giving us a clutch-the-pearls moment where their asses become the star attraction. But, that doesn't last for long, as the guys turn back around and Julian is down on his knees, sucking Niko. Niko is in heaven, as he moans and groans while Julian blows him. The guys trade blowjobs for a while, and continue to make-out something fierce in-between sucking. (If you love watching guys kiss, you'll love the scene, trust me.)After some more oral action, Julian asks Niko if he wants him to fuck him in the ass. Niko is game and the race is on! Niko leans over the tub as Julian starts to slap Niko's ass around, getting him ready for his cock. Soon enough, Niko is impaled on Julian's big dick. Kaden gets in close with the camera -- under the action, around the action, from the side … everywhere. (We get a nice shot of Niko getting fucked from underneath, and his balls sway in time to the pounding he's getting from Julian.)The guys move to a new position, where Niko is riding Julian -- and Niko's dick is flopping around in the air. (This is always super hot to watch.)  The guys finish up with Niko on his back, his legs throw up in the air as Julian spears him from above. The guys work up to a frenzy, and Julian pulls out just in time to shoot his load all over Niko's groin. Then it's Niko's turn to shoot, spewing his cum all over himself.Dang! In the post-scene wrap-up with the guys, both of them clearly enjoyed themselves, and it looks like we'll be seeing more of them in the future. (Kaden jokes, 'I know Niko had fun! He definitely wants to see Julian again.' We shall see if we can make that happen!)",
  "models": [
    {
      "name": "Julian II",
      "person_id": 35378
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-06-01",
  "scene_id": 70778,
  "series": "Battle of the Bulge 3",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Shower",
    "Tattoos"
  ],
  "title": "Julian & Niko"
}