{
  "collections": [
    "Active Duty"
  ],
  "description": "Kaden is directing this scene, and as it opens, he's ribbing Julian about how he's just jumped head-first into things here at Active Duty. 'Are you nervous?' Kaden asks. Julian, smiling, gives a quick 'Yeah!' <br /><br />Kaden says he sees that the two of them have a natural chemistry -- and how they have been already chatting and bullshitting with one another before the camera started rolling -- so he knows this should be a good pairing. He then steps out of the way to let the guys get going, letting them take matters into their own hands.<br /><br />Shea calms Julian a bit, telling him that he, too, was nervous his first time. But, he adds, once things get going, it'll be alright. There's a funny moment where Shea asks Kaden if the 'viewers' know they are watching porn off-camera. Kaden's assures them, 'Yes, they know.' Ha! Really guys, it's alright, we know you have some video assistance.<br /><br />Shea reaches over and starts copping a feel of Julian's dick, joking with him, 'You still nervous?' That gets a good laugh out of him. Less than five minutes have elapsed, and the guys have already yanked off their boxers and are stark naked. You can tell Julian is nervous, as he keeps laughing nervously and commenting about the porno that's playing. Meanwhile, Shea is focused on Julian's dick -- watching him jerk himself. Shea then goes in for the kill and plants a kiss on Julian -- who returns the favor, and the guys start making out. Shea then goes down on Julian, helping bring him to attention, as Julian leans back and enjoys the ride.<br /><br />After a spell, it's Julian's first time to give head. He's tentative at first, but then Shea gives him a little bit of direction, and he starts to get into it. 'Fuck yeah!' Shea says. But soon it's time for the guys to switch positions, so Shea can get Julian's dick nice and hard (he says) so he can fuck him.<br /><br />Julian's got a pretty thick cock, and Shea brings it to standing attention, getting him ready for his first fuck. It isn't long until Julian is up inside Shea, who is panting 'God, your dick is so huge!' as the two bounce and sway on the bed. Shea's so tight, we can hear Julian's dick as is slides in and out of him. (If only we had THX…)<br /><br />I won't tell you every little detail about their fucking, but Julian does a fine job for a first-timer. And lawd, his cum shot is insane. He shoots all over Shea's chest -- spurt after spurt -- getting major distance.",
  "models": [
    {
      "name": "Julian II",
      "person_id": 35378
    },
    {
      "name": "Shea",
      "person_id": 35370
    }
  ],
  "release_date": "2014-05-18",
  "scene_id": 70776,
  "series": "Battle of the Bulge 3",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular"
  ],
  "title": "Julian & Shea"
}