{
  "collections": [
    "Active Duty"
  ],
  "description": "Bring In The Pretty Boys--The Troops Are Horny ... <br /><br />After Mason blows his load in Adam's mouth, Adam says 'Let's go get fucked by those other boys' and they're off to the bedroom to join Brock, Hops and Kasey for one hell of a finale. Mason goes straight for Brock's cock as Adam decides between Hops and Kasey. Kasey makes the decision and says Hops can go first. Adam hunkers down on Hops and sucks his cock nice and deep as Hops just moans. It's musical cocks as Adam moves over to Kasey and Mason over to Hops. Mason loves himself a big dick and Hops has just the fix. Adam is making love to Kasey's cock and Kasey is loving every second of it. Mason can't decide between Brock and Hops so he just services them both equally.<br /><br />Mason And Adam Get Fucked By The Muscles ... <br /><br />Mason can't stand it any longer and tells Hops he wants to ride his cock, Hops saddles up and let's the cowboy on. Mason has mounted himself a wild buck and the huge cock is a bit of a struggle at first. Brock says 'yeah, take that dick.' and Mason says, 'Fuckin' A man, it's the biggest dick here.' He manages to get it in balls deep and Brock stands over Mason to give his mouth something to play with while his ass gets fucked deep by the huge cock. The boys decide to bend the pretty boys over the bed and Hops gets behind Mason while Kasey gets behind Adam and they ram their hard cocks deep into the boys waiting holes. Kasey is fucking Adam hard while Hops bangs Mason. Brock makes his cock available for the pretty boys and they share it while they're getting fucked. Hops is liking Mason's sweet ass and it doesn't take long before he's ready to blow his fat nut all over Mason's ass. And holy fuck what a huge load it is. It must be a gallon. Hops turns the reigns over to Brock who tears into Mason's ass good and hard. Kasey is the next to cum and they decide to use Mason as the cum rag. Brock wants to put his load in Mason's mouth and Mason is all for it. He turns around and Brock delivers a nice gushing load to his hungry mouth. Our Draftee has been fed and it's lights out!<br /><br />",
  "models": [
    {
      "name": "Adam Wells",
      "person_id": 35234
    },
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Hops",
      "person_id": 35087
    },
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Mason Wyler",
      "person_id": 35118
    }
  ],
  "release_date": "2014-06-15",
  "scene_id": 70785,
  "series": "Drafted 2 - Part 2",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Gay",
    "Group",
    "Muscular",
    "Tattoos",
    "Twink"
  ],
  "title": "Drafted 2 - Part 2"
}