{
  "collections": [
    "Active Duty"
  ],
  "description": "'Look at you guys, all ready!' says guest director Mike as our new scene with Brock and newbie Rick opens. 'Very enthusiastic,' Rick says, with a grin.Today's a special day, too -- as Brock gets fucked for the very first time! Bareback! And it's our man Tim (he of the rippling abs and body that won't quit) who gets to do the honors.Now, we haven't actually seen Rick before on the site, but Mike lets us know that this isn't the first scene he's shot for us. (We sometimes release things out of order, y'all.)It's been a couple weeks since Rick has been over at Mike's place, and the last time he was there, he was paired up with Tim. Rick says he was 'great… huge.' Ha! 'You like that, huh?' Mike asks. 'Oh yeah,' Rick answers. Well, that huge dick is about to find its way into an ass that has never had a dick inside it -- Brock's!(Before we move on to the scene, a note about Rick: He's got a pair of big ears, and a big nose, and he's tall and lanky -- so you know what that means… Indeed he's got a big slab o' meat between his legs!)The guys trade some oral action for a spell before Tim surprisingly arrives mid-scene, ready to fuck. And it takes  him no more than a minute to come into frame, and pull Brock over by his ankle. He's ready. Brock's on his back, legs up in the air, and Tim is slowly -- slowly -- entering him. He's taking it slow and steady -- and we hear Mike whisper 'you're doing good, just breathe.' Brock's eyes are closed and he's biting his lip, clearly wincing at the new feeling. Rick slinks in and starts sucking Brock while Tim fucks him. Tim starts to pick up the pace as Brock eventually gets a bit more used to that huge dick up inside him. You'll have to see how everything ends, but Mike closes the scene by telling Brock, 'Be honest with you, it was really nice seeing you get fucked. I've worked so long and hard for this day to happen.' Mike asks Brock how it felt, and you'll have to see how he answers by watching the scene…",
  "models": [
    {
      "name": "Brock MB",
      "person_id": 35256
    },
    {
      "name": "Tim II",
      "person_id": 35358
    },
    {
      "name": "Rick II",
      "person_id": 35380
    }
  ],
  "release_date": "2014-06-22",
  "scene_id": 70787,
  "series": "Military Bareback Files 5",
  "tags": [
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "First Time",
    "Gay",
    "Muscular",
    "Smooth",
    "Threesome"
  ],
  "title": "Brock, Rick & Tim"
}