{
  "collections": [
    "Active Duty"
  ],
  "description": "Mega-hung Ryan returns for just his third hard core scene today, and we've paired him up with muscular sex pot Niko. Needless to say, the results are very hot.After Ryan took a 'little time off,' as he says, he's back from vacation, so to speak, and ready to go. Kaden, who is directing the scene, says Ryan couldn't have picked a better time to come back, as he gets to work with Niko. For his part, Niko says he's having a 'great time' here at Active Duty (words I love to hear!). Kaden says that he's going to excuse himself and let the guys get to know one another. After a few seconds, Niko is already pawing at Ryan's chest and groping his leg -- without a single word spoken. (Really, sometimes chatter is overrated.) Niko starts kissing Ryan's rippling abs, which clearly pleases him. Ryan returns the favor, and soon, the guys have lost their pants entirely.It isn't long until Niko has hauled out Ryan's growing dick and starts sucking him to high heaven. Ryan's loving every minute of it, and his huge dick is rock hard within seconds. It's Niko's turn to get blown, as Ryan yanks Niko's shorts off and goes to town, licking up and down his shaft, head a-bouncin' all over the place. 'Suck that cock, baby,' Niko tells Ryan, who takes Niko all the way down.After a good deal of oral action, Ryan looks at Niko -- whose mouth is filled with Ryan's cock -- and says 'you about ready for it?' It, meaning his dick in Niko's ass. Niko's game, and we're off!Ryan, as we might have pointed out, has an enormous dick, and he tears Niko a new hole when he fucks him. Niko is moaning and groaning like he means it, as Ryan grabs him from behind, holding his ass cheeks steady for balance. The guys switch it up so that Niko is sitting atop Ryan and gets to take him for a ride. It's super hot to watch muscular Niko -- erect dick bobbing around, thick thighs moving in time -- as he bounces on Ryan's dick.Wait until you see the guys shoot their loads! Niko blows his load while being fucked, and Ryan follows shortly after. They're just a pile of sweaty messes by the time Kaden's through with them -- and we wouldn't have it any other way!",
  "models": [
    {
      "name": "Ryan IV",
      "person_id": 35359
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-06-08",
  "scene_id": 70781,
  "series": "Niko & Ryan",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Smooth",
    "Tattoos",
    "White Butt"
  ],
  "title": "Niko & Ryan, Scene #01"
}