{
  "collections": [
    "Active Duty"
  ],
  "description": "Mason Returns For Another Round Of Draftee Training ... This time around we've gathered up a whole squad to help Mason further his training here at Active Duty. Brock, Hops, Kasey and Adam step up to give Mason the extra special attention all troops need in their critical training phase and boy what a true recruit he's become. We all know what a cockhound Mason already is, but when you throw him in the mix with our Active Duty boys, he gets even more dirty and that's just what he likes.Strong Man Contest ... We shot this video at a resort and all the boys were hanging out on the patio before the shoot just shooting the shit so I go out and rustle them up to taking off their shirts. Hops, Brock and Kasey all strip off their shirts to reveal very different and very sexy bodies. Hops is more lean and ripped while Kasey is a real beefcake and Brock has thighs like tree trunks. Mason gives them their physical reviews and points out their assets as he just drools over these hotties. These guys are all just great sports as they laugh and carry on. This is part of what makes Active Duty so special--you actually get to know the guys for more than just the sex.Let The Games Begin ... I decide to pair Mason and Adam up together first in the living room while Hops, Brock and Kasey take up arms in the bedroom. I tell Mason that Adam is a good fit for him because Adam is so passionate and the two of them will hit it off well. Meanwhile back in the bedroom the boys are lined up on the bed with Hops in the middle while they stroke up their cocks and shoot the shit. Back in the living room, Mason and Adam embrace in a long, sensual kiss as Mason sneaks his hand down Adam's pants to check out the goods. It isn't long before these two strip out of their clothes down to their undies and Mason is sporting some hot black CKs. The kissing continues as they play with each other's hard cocks.Hops Starts The Sucking With Kasey And Brock ... Hops says, 'Why don't you guys come over here and let me suck your cocks' and from there, it doesn't take long for Brock to oblige. Kasey follows suit and stuffs his cock in Hops mouth. Brock makes things more interesting by getting down between Hops legs and sucking his fat cock while Hops sucks Kasey. Brock is sucking Hops good as Kasey looks on. Hops strokes Kasey while he gets his own cock polished by Brock. Brock moves over to Kasey's cock and starts sucking it real good. Hops moves up and puts his cock in Kasey's mouth, and Kasey seems to like the big cock.The Kissing Turns To Sucking With Mason and Adam ... Bet you were wondering what was going on out in the living room. Well, the kissing turns quickly to sucking as Mason takes out his fat uncut cock and starts feeding it to Adam who is eager to taste the sweet dick. Mason interrupts Adam's oral attention to give him another long, wet kiss. After the kiss, Mason starts fucking Adam's hungry face and Adam is loving it. After fucking Adam's face good and hard, Mason gets down on his knees in front of Adam to return the favor. Mason is hungry today and it's showing in how he's getting down on Adam's uncut meat. These two are a match made in porn heaven. Adam reaches under and fingers his own ass while Mason services his cock. The two kiss again as the action heats up more and more.Kasey, Hops and Brock Keep The Pace in the Bedroom ... Back in the bedroom our three heroes keep the pace as the cocksucking continues. Kasey is hunkered down on Hops while Brock works over Kasey's hard meat in this three-way suckfest. Hops gets Brock to feed him his cock as Kasey watches and jerks his meat. Kasey doesn't watch long before he's standing up beside Brock with his dick in Brocks mouth while Hops sucks on Brock. The action is heating up nicely as we return for a peek in the living room to find Adam back on his knees sucking Mason's meat. Adam is working it over as he makes love to the cock and sucks and licks on Mason's nipples. Mason wants to know when he can fuck this boy, but Adam wants to worship the perfect uncut meat a little more.Mason Fucks Adam Good And Hard ... Adam bends over and offers his ass up to Mason who proves he can be a very good top fucker as well as a hungry bottom boy. Mason slides his long, thick, uncut meat all the way up Adam's tight, hungry hole, but not without a little fight. This cock proves to be a lot for Adam today as he struggles with the initial pain of getting the monster inside him. Mason is fucking him slow and gentle at first, once it's in and Adam's is liking it, Mason starts slamming it in and out of him.Brock Eats Kasey's Ass ... In the bedroom the boys are playing fine on their own and Brock has positioned himself behind Kasey to eat his ass while Hops jerks his hard cock, just watching at first. Hops plays with Brocks ass while Brock eats Kasey. Brock's ass is so hot as Hops spreads his cheeks apart to give us the full view. Hops gets behind Brock and rubs his fat cock all over Brock's nice ass as Brock keeps eating Kasey's ass. Brock eats Kasey's ass for a good long while. Meanwhile back out in the living room, Mason is slamming hard into Adam's hole as Adam moans loud and takes it good. They kiss again, another long, passionate kiss while Mason is still inside Adam. Mason fucks Adam long and hard for what seems like eternity before Mason finally erupts and explodes his load all in Adam's mouth.",
  "models": [
    {
      "name": "Kasey",
      "person_id": 35026
    },
    {
      "name": "Adam Wells",
      "person_id": 35234
    },
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Hops",
      "person_id": 35087
    },
    {
      "name": "Mason Wyler",
      "person_id": 35118
    }
  ],
  "release_date": "2014-06-15",
  "scene_id": 70784,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Facial",
    "Gay",
    "Jerk Off",
    "Kissing",
    "Smooth",
    "Threesome",
    "Twink"
  ],
  "title": "Drafted 2 - Part 1, Scene #01"
}