{
  "collections": [
    "Active Duty"
  ],
  "description": "Niko is just so fuckin' cute. Dang! We start shooting the breeze about how he was in the other room, talking to Andre, and asking him if he's ever bottomed before. And Andre said 'no…' Heh. I joke with Niko about how I overheard him lathering up Andre, and I thought it was real cute. 'So, you're gonna de-virginize a virgin tonight,' I tell Niko. 'I'm cool with that!' he says. 'Are ya? Something tells me you are. I think you fucking like this. I don't even know why I pay you,' I joke. 'I enjoy it!' Niko says, laughing and smiling.I tell Niko that it's time for him to shower up, and I'm gonna send in Andre for Niko to 'slather the butter on,' so to speak. Niko shucks off his underwear, already stiff as a board. I get in real close, up and under him. Excuse me while I try to regain composure here for a moment. lol. Niko starts soaping himself up -- and in comes Andre. Niko is telling Andre what they're going to do together -- you know, lathering one another up, washing each other down, and so on. 'You cool with that?' Niko asks. 'Yeah!' Andre says, totally cool with what's about to go down. Andre shucks off his clothes and hops in the shower with Niko, who starts soaping him up. Meanwhile, Niko's massive dick is lingering mighty close to Andre's ass. (A hint of things to come…) The guys turn to face one another and embrace, and Andre grabs Niko's dick and starts jerking. But, let's not get too far ahead of ourselves, as Niko asks Andre to soap him up. Well, it isn't long before Andre is down on his knees, slurping up Niko's cock. I get in real close with the camera and by that point, Niko is floating up in the clouds -- reeling in the amazing blow job he's getting from Andre. After a while, he says he can't take it any longer, and it's time for him to give Andre a taste of the action. Down goes Niko to his knees, and he starts gulping down Andre. 'You like the way my dick tastes?' Andre asks. Niko can only answer with mumbles and groans, as his mouth is full of dick. lol.After some more oral action in the shower, the guys move over to the bed where Andre prepares to get fucked for the very first time. Well dang me, he's a fast learner, as Niko slides his dick up him nice and slow -- and before long, he's long-stroking him something good. Niko is slapping his ass, telling Andre how nice it is, and how tight it is. All Andre can do is groan and moan in response.After a good while, Niko says how it's his turn. Well, it looks like we got ourselves a regular flip-flop scene folks! Andre, and his tanlined-butt, start spearing into Niko, who is doing his best not to lose his cool too much. But you can hear him panting and sighing something fierce -- he's enjoying it.'Your ass feels so good,' Andre says. 'Yeah? It's yours, baby,' Niko says. Hot damn!Alright, y'all are going to have to see how the rest of the scene turns out, but let me tell you, it's hot. Niko is just so gosh darn cute, and he looks so good getting fucked. I think you're gonna like this scene, a lot.",
  "models": [
    {
      "name": "Andre",
      "person_id": 35376
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-10-19",
  "scene_id": 70795,
  "series": "Andre & Niko",
  "tags": [
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Shower",
    "Tattoos"
  ],
  "title": "Andre & Niko, Scene #01"
}