{
  "collections": [
    "Active Duty"
  ],
  "description": "We have hit the jackpot with our new recruit Gannon. <br /><br />As it turns out, Gannon has been a fan of Active Duty since before he joined the army. 'Years!' he says. He actually contacted us and wanted to be part of the site. And hot damn, Gannon is super sexy, too! <br /><br />Kaden starts grilling him right away, teasing him about how we're enjoying the fact that he's turned up in his uniform, ready to go. Kaden asks how he got in contact with us, asking him to describe his email exchange with me. Gannon says he sent me an email, because he thought: 'why not go do something that not everyone has the balls to do?' I like that kind of attitude!<br /><br />Gannon says he sent me a few pictures and it was a really fast process from then to now. (I wasn't about to waste any time with this man -- just look at him!) Gannon stands about 5'10' tall and weighs about 165 lbs. In his spare time he enjoys indoor rock climbing and loves animals, too.<br /><br />Kaden asks Gannon to strip down out of his uniform, and when he gets down to his little tight briefs, Kaden jokes about how he's got a 'valuable ass-et.' Gannon agrees, but smiles and says that it's 'government property.'<br /><br />We soon get a nice long look at Gannon's smooth, toned, body. Dang, this guy is dead sexy. He's got an ass that won't quit, I tell you what. It's just  b e a u t i f u l. About halfway through the scene, Kaden tells Gannon that I've come in and dropped off a present for them -- a massive dildo. Why yes, I'm up to some tricks today. I tell Kaden to get Gannon to try to fit that puppy in his ass and Gannon, a trooper, says 'challenge accepted!'<br /><br />'Good luck,' says Kaden. 'Don't need luck,' Gannon replies. Well, ok then! Some lube and a little bit of struggling later, and Gannon has the monster inside him. 'It's definitely in,' he says, moaning a bit as he suspends himself onto the monster dildo. Lawd, this man is going places! So many gears are spinning in my head right now. <br /><br />And holy crap, wait until you see Gannon shoot his load. It goes sailing into the air, hitting the wall next to him. 'Golly,' Kaden says. 'Lick it off the wall.' And he does! <br /><br />In their post-scene chat, Gannon says 'I had a lot of fun. Can't even lie, this was a lot of fun.' <br /><br />I know you guys are gonna love Gannon -- so get on in there and check out his debut scene for us.",
  "models": [
    {
      "name": "Gannon",
      "person_id": 35385
    }
  ],
  "release_date": "2014-07-23",
  "scene_id": 70798,
  "series": "Gannon",
  "tags": [
    "First Time",
    "Gay",
    "Jerk Off",
    "Shower",
    "Smooth",
    "Solo",
    "Tattoos",
    "Uniform",
    "War Chest"
  ],
  "title": "Gannon"
}