{
  "collections": [
    "Active Duty"
  ],
  "description": "We only just met Cruz the other day, but we got along so well -- and he was ready for anything -- that I jumped at the chance to pair him up with Sonny. And the guys go at it -- bareback!<br /><br />Now, you haven't met Sonny before, but I think you're gonna love him. We've got a solo in the can with him that we'll release later, but I didn't want to wait any longer to show you these two in some hard core action. <br /><br />As the scene starts, the guys are on the bed and we're shooting the breeze. I tease them that I can tell there is some 'excitement' already happening with Sonny … as in, between his legs. (He's got a monster-thick beer can dick in his pants, and he's already plumping up in his shorts.) I joke with him that he's a 'good, wholesome Italian' boy and he sorta rolls his eyes at this and says, 'well…' lol.<br /><br />I tell them -- and you -- how these guys are 'brand spanking new' to us. How new? As in yesterday. Like I said, I don't waste time! 'My, how time flies,' I say to them, as Sonny just grins at the camera with a knowing look.  <br /><br />I tell Cruz that 'today is going to be the first day that you put a penis in your mouth.' So, you know we're in for a treat. 'It's good to have a big fucking dick to put in your mouth for the first time.' And lucky for us -- and Cruz -- Sonny is hung like a moo. I challenge Cruz to use his dick sucking lips with all their might. <br /><br />I step away to let the guys shoot the shit and get to know one another and before you know it, Sonny is already planting some kisses on Cruz. We're off and running! By the time the long (50 minute!) scene is over with, there's been rimming and sucking, both guys have gotten fucked bareback, Sonny cums in Cruz's mouth, Cruz shoots his load on Sonny's face and lips, and Cruz probably isn't able to walk straight. lol. (Truly, seeing Sonny fuck a guy is like watching someone get fucked by a butt plug. He's just that thick. Cruz pulled through like a real trooper though, gritting his teeth and panting like he was about to give birth!)<br /><br />Whew!",
  "models": [
    {
      "name": "Cruz",
      "person_id": 35383
    },
    {
      "name": "Sonny",
      "person_id": 35384
    }
  ],
  "release_date": "2014-07-20",
  "scene_id": 70797,
  "series": "Cruz & Sonny",
  "tags": [
    "Bareback",
    "Big Dick",
    "Brunette",
    "Duo",
    "Facial",
    "First Time",
    "Gay",
    "Muscular",
    "Smooth",
    "Tattoos",
    "Twink"
  ],
  "title": "Cruz & Sonny"
}