{
  "collections": [
    "Active Duty"
  ],
  "description": "We've got a really hot scene for you today, where Gannon goes head-to-head in a sizzling flip-flop scene with Niko!Niko is already excited from the get-go, and I joke with him about how ready-to-go he is as we start filming. The guys are planted on the couch together, both clad in white T-shirts. Niko's sporting a pair of blue shorts, while Gannon's in snug blue jeans.(Remember, Gannon was the fella that emailed me, wanting to work with us? So I can only imagine that all of his sex fantasies are coming to life before his very eyes…)I tell Niko how it looks like he's excited about working with Gannon, and Niko exclaims, 'Oh yeah!' I then tell a quick story about how earlier, before we got the camera rolling, Niko told me, 'Dink, look at this,' and he was fucking hard already! And then Niko took Gannon to the bedroom -- and I don't know what they were doing back there. 'Some behind the scenes action,' Niko suggests. 'Were you molesting that boy?' I ask Niko. The guys just smile… 'Was he molesting you?' I ask Gannon, quickly adding, 'It's hard to molest the willing, huh?' 'Exactly,' Gannon says, laughing.Clearly, we got us a pair of live ones today, and I knew there were going to be some serious sparks between these two.I tell Niko to bring Gannon into the fold like only he can, and then I step away for a few minutes to let them get going. About a half-second later, they're already kissing and making out. See, I knew this was going to work just fine. lol.Five minutes into the scene, and Gannon is making a meal out of Niko's dick, sucking it all the way down to the base. Gannon licks and sucks Niko's balls, before Niko pulls him up to embrace and kiss once again. If these boys aren't in love, I sure am fooled! Niko goes in and pulls off Gannon's tiny red briefs, engulfing his dick. 'Oh shit,' Gannon whispers, in love with what's happening to him. It's clear in this scene, that the guys are really into one another. You can see these little moments they have, where they catch one another's eyes, and there's *that* look they share.Gannon is soon bent over across the couch, with his perfect ass up in the air. Niko is teasing him with his tongue, and Gannon is losing his ever-loving mind. (We caught the light just right in this part of the scene, where the guys are lit in a golden glow -- they look amazing, if I do say so.)Soon it's Niko's turn to get his ass eaten, and he's splayed out on the couch. 'Aw yeah, just like that!' Niko blurts out, as Gannon spits and licks at his hole. We get in close with the camera so we can see Gannon's tongue go to town. It isn't long before Gannon has his ass back up in the air, and Niko is plunging his dick up Gannon's ass. Gannon is shaking and shivering -- and loving every second of it. 'It's so fucking big!' Gannon says, panting, as Niko pummels him from behind. 'Take that dick,' Niko growls, and Gannon responds: 'I'll take it all!' And I believe him!Gannon is stiff as a board, jerking off while getting fucked, and he's soon straddled across a sitting Niko, as Gannon bounces atop Niko's cock. Gannon goes for one hell of a ride -- and Niko notices too, telling him how he knows just how to ride a dick. (Watching Gannon gyrate and bump and grind on Niko is magical, I tell you. He's got magic hips!)For the big finale, Gannon asks Niko if he's going to get a chance to fuck him. Of course he is! Niko's face down on the couch and Gannon -- and his luscious ass -- mount him from behind, pounding him something deep! The guys switch positions, and Niko is on his back now with Gannon letting him have it. It isn't long before Gannon has to pull out, as he's about to cum. He shoots his load all over Niko's rippling abs and chest -- and Niko follows shortly with his own load.'That was fuckin' hot,' Gannon says, just before we close the scene. Damn right!",
  "models": [
    {
      "name": "Niko",
      "person_id": 35371
    },
    {
      "name": "Gannon",
      "person_id": 35385
    }
  ],
  "release_date": "2014-08-10",
  "scene_id": 70806,
  "series": "Gannon & Niko",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Muscular",
    "Tattoos"
  ],
  "title": "Gannon & Niko, Scene #01"
}