{
  "collections": [
    "Active Duty"
  ],
  "description": "Have we got a treat for you! Today's War Chest scene with Sonny is directed by our famed King Cole! Yes, indeed, our legendary Cole is back behind the camera, and he's introducing us to our new friend Sonny.(Can we lure Cole back in front of the camera? Only time will tell! As I'm sure you all know, Cole is one of our most valued members of the AD family, and he's been working behind the scenes for a long while now. I'm thrilled to see him behind the camera again!)So, Sonny -- who you already met in his duo scene with Cruz -- hails from Atlantic City, New Jersey and is in the Marine Corps. Cole jokes, 'ooh, tough guy, right?' Sonny laughs and responds, 'I'd like to think so!' Cole explains that Sonny actually contacted us -- just like our other new pal, Gannon. Sonny says he was 'hunting around, and figured 'you know what, shot in the dark, put an application in.' Within five minutes, I got a response!' (You know us, we don't waste time.) As it turns out, Sonny is bisexual, and he tells us all about his first experience with a guy -- way back in high school when he was 16 or 17-years old. He also discusses how he got together with some guys from boot camp (but not while he was IN boot camp).Cole says that he expects a lot from Sonny, since he's experienced. 'i don't think that I will disappoint!' Sonny says. (I'd like to think that maybe -- just maybe -- Sonny might be crushing just a teensy bit on King Cole. Maybe it's just me...)I'm not going to tell you every little detail of what happens when Sonny takes his clothes off, but I will say that his pretty (oh so pretty) butt gets a nice work out with a butt plug ... and that by the time we're done, he says the experience was 'fucking amazing,' adding that he 'would definitely come back and do more.' (Well, we already know that to be true, after his scene with Cruz!)",
  "models": [
    {
      "name": "Sonny",
      "person_id": 35384
    }
  ],
  "release_date": "2014-07-30",
  "scene_id": 70801,
  "tags": [
    "Brunette",
    "Gay",
    "Jerk Off",
    "Smooth",
    "Solo",
    "Tattoos",
    "Twink",
    "War Chest"
  ],
  "title": "Sonny, Scene #01"
}