{
  "collections": [
    "Active Duty"
  ],
  "description": "Big 6' tall Texan Rick gets to tango with Tim today -- and Rick bottoms for the very first time! Bareback!The guys introduce themselves to one another, and they are an interesting contrast. Tim is a big tall gent that weighs around 175 lbs., while Rick is pint-sized at just 5'5' tall and around 145 lbs.But they have something in common: they're both hung like horses. As the scene starts, our guest director Mike says that Tim is going to help guide Rick through for his first time. 'I know this is very new to you,' Mike says to Tim. 'I'm very willing, though,' Tim says, laughing a bit. (Well, now, that's a good sign!)Mike says that they don't know exactly what will happen, and that they are just going to play it by ear. Mike excuses himself, and the guys start to get to work on bringing their dicks to attention. Rick can't help but to gawk at Tim's crotch and how he's working his dick through his pants. I really think Rick is pretty excited to partner up with Tim today. When Tim hoists out his dick, we can hear Rick gasp, 'oh shit,' as he reaches over to get a feel. As the guys start to jerk one another, we hear Mike from behind the camera ask, 'You OK Rick?' Rick looks up, with Tim's dick in his hand, smiles, and says 'I'm living the dream.' I like this kid's attitude!Things really come alive when Rick starts sucking Tim's dick with gusto. You can tell he's loving every second of this. (And really, who wouldn't? You've seen Tim, right?) Rick sucks Tim almost down to the balls -- and that ain't no easy feat. 'You're so fucking hot,' Rick whispers to Tim in-between mouthfuls. After a bit, Tim asks 'You ready to get fucked now?' 'Hell yeah!' comes the response from Rick. And we're off!Rick is in hog heaven getting fucked by Tim. He's whispering sweet nothings left and right while getting fucked from behind -- bareback -- by Tim's huge dick. Rick throws his arms back, grasping at Tim's back and ass cheeks, embracing him the best he can considering their positioning. May I point out just how glorious Rick's skin is? It's pristine. Just so pretty and smooth and amazing. And his ass is just to die for too. These two are a perfect match.",
  "models": [
    {
      "name": "Rick II",
      "person_id": 35380
    },
    {
      "name": "Tim II",
      "person_id": 35358
    }
  ],
  "release_date": "2014-08-17",
  "scene_id": 70808,
  "series": "Military Bareback Files 5",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Tattoos",
    "White Butt"
  ],
  "title": "Rick & Tim"
}