{
  "collections": [
    "Active Duty"
  ],
  "description": "Today's scene is a scorcher! It's definitely one of the best -- and most intense -- scenes we've shot in a while, and I'm stoked to share it with you guys.We've brought back newbie Cruz for another scene, and this time he's paired up with Niko -- and I think it's lust at first sight. Both of the guys are throwing compliments left and right at one another, and before you know it, they're making out. (If you're keeping track at home, the small talk lasts for about one minute and 14 seconds before they're locking lips and going to town. They couldn't keep their hands off one another.)It's always interesting to see how far the guys go once director Kaden has stepped out of the room. (He always removes himself from the scene for a few minutes at the top of the filming, to let the guys chit-chat.) Well, Cruz and Niko waste zero time in the chit-chat department, and by the time Kaden returns, they're both buck naked and sucking cock. (Did I mention the guys are into one another?)The fit bodies of Cruz and Niko compliment one another quite nicely. Both have broad chests, big biceps, and thick muscular legs. I'm convinced their asses are almost identical, too!This is one long scene too -- 40 minutes! The guys suck one another, they both rim with gusto, finger, and fuck each other -- hard. It's a match made in heaven. (When Cruz starts tongue-fucking Niko's ass, you're going to lose it. Niko almost did!)I love it when Niko says 'Quit playing with it!,' as Cruz teases him with a lengthy rim job and his cock head, 'I want you to fuck me!' Well alright then! Cruz doesn't have to be told twice, and it isn't long before Niko is a moaning mess, grabbing on to the sofa for dear life, as Cruz pounds him from behind. When they guys switch positions, and Niko is straddling Cruz, it's awesome -- Niko is rock hard and his dick is just flopping around in the breeze, bouncing as he thrusts himself down on Cruz's cock. 'Fuck that ass, baby!' Niko groans.After a little bit of time, Niko says 'I think it's my turn now baby,' and that's our signal for the guys to switch things up. Niko bends Cruz over to rim and finger him, and taunts his ass with his cock head. Niko slips on a condom, and then slips into Cruz.A few minutes of nice-and-slow fucking goes by … and then all hell breaks loose and Niko starts wailing on Cruz's ass. All we're hearing is the slapping of skin, grunts of men and Cruz panting 'Ooh shit' like he's in heat!Things are taken to a crazy new level when Cruz is on his back and Niko is going to town on him. I think they forgot the camera was even in the room. I'm not bullshitting you. It's just raw, hot, manfucking. DAMN. And when Cruz starts whispering 'deeper, deeper,' he ain't playing. There's something special happening here, I can feel it. And wait until the cum shots! My lord, Cruz is shuddering, shaking and full-on having an attack of the Ultimate Orgasm when he shoots. It's fantastic. And huge!When all is said and done, I think we made a good call with this combination, and I hope to see Cruz back real soon!",
  "models": [
    {
      "name": "Cruz",
      "person_id": 35383
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-08-03",
  "scene_id": 70802,
  "series": "Cruz & Niko",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Muscular",
    "Rim",
    "Rimming",
    "Tattoos"
  ],
  "title": "Cruz & Niko, Scene #01"
}