{
  "collections": [
    "Active Duty"
  ],
  "description": "We wasted no time getting our new dude Gannon hooked up with another guy in front of the camera -- because after all, when you've found a guy like Gannon, you've found something special.<br /><br />As we learned in Gannon's War Chest debut, he's been a fan of the site for years and actually reached out to us. Usually I'm the one having to approach guys. Boy, how the times have changed!<br /><br />So, we open on today's scene -- where we have paired up Gannon with Morgan -- on Morgan in tight-fitting wrestling singlet. Lawd have mercy. <br /><br />(And better -- Morgan is crossing the line today and getting his dick sucked by a guy. And his ass eaten. All for the very first time!)<br /><br />'Why is he in this wrestling singlet?' I ask from behind the camera. Well, as it turns out, Morgan was a championship wrestler back in school, and one of his fantasies was that the loser in a wrestling match would suck the winner's dick. Now, it took me a while to lure this fantasy out of Morgan -- but boy howdy, am I glad I did. <br /><br />Earlier when I asked Morgan to put on the singlet, he had an idea of where I was going -- and he's even got his own plans for sequel videos. lol! <br /><br />If you're a fan of dudes in singlets, you're going to lose your marbles today. My god, seeing Morgan wrestle with his erection (see what I did there?) under his spandex singlet is just so damn not. It's crazy. There's quite a bit of teasing and stroking with his singlet -- you're going to love it. Morgan knows how to get a guy's engines going, that's for sure.<br /><br />After some highly erotic one-man foreplay with the singlet, Morgan says 'Let's get that loser in here.' I joke back, 'What a lucky fuckin' loser.'<br /><br />In comes Gannon -- who is also decked out in a singlet -- and quickly starts going to town on Morgan's dick. Gannon soon pushes Morgan back down onto the tub, sitting him down and getting between his legs. Gannon's a pro, and takes Morgan all the way down to the base of his dick -- and Morgan is loving it. 'Look at me,' Morgan whispers to Gannon, who obliges. Morgan pushes down Gannon's singlet so that only his ass is still covered -- and what an adorable butt it is, let me tell you.<br /><br />After a lot of sucking, Gannon looks up at Morgan and asks, 'You ever had your ass eaten'?' 'Never,' Morgan says. 'Wanna try?' Gannon says. 'You better… loser,' says Morgan, keeping with the wrestling fantasy spirit.<br /><br />Next thing we see is Morgan's ass up in the air and Gannon's face buried between his cheeks. Morgan's loving it, and groans 'You're really good at that.' Gannon jokes back, 'Gotta please the winner…' It isn't long before Morgan is shooting his load … into Gannon's mouth!  Gannon licks and sucks down every last drop, and then shoots his own load. Then for good measure, Gannon kisses up Morgan's leg and body, up his chest, sucking his nipple, and ending with a kiss on the lips. Aww.",
  "models": [
    {
      "name": "Gannon",
      "person_id": 35385
    },
    {
      "name": "Morgan",
      "person_id": 35382
    }
  ],
  "release_date": "2014-07-27",
  "scene_id": 70800,
  "series": "Gannon & Morgan",
  "tags": [
    "Blowjob",
    "Brunette",
    "Duo",
    "Facial",
    "First Time",
    "Gay",
    "Smooth",
    "Uniform"
  ],
  "title": "Gannon & Morgan"
}