{
  "collections": [
    "Active Duty"
  ],
  "description": "As our new scene with Grant and Niko opens, Kaden jokes that Grant is a 'fresh fish' -- since he's brand new to Active Duty. Well, basically brand new -- he's only done a solo scene for us so far.<br /><br />Grant is all smiles, and he says that he's 'excited to get it going on.' Again, I love that optimistic attitude! Kaden says that he knew that Niko was going to pull through and be an excellent first scene partner for Grant. (And really, you can't go wrong with Niko. He's passionate, built, has a big ol' dick and loves fucking with guys. What's not to love?)<br /><br />Grant agrees, saying Niko is 'pretty hot' and that he's 'eager to work with him.' This is music to Niko's ears, as he nods in agreement, growling in that Niko tone of his, 'nice.' <br /><br />'I think he's hot,' Niko says, about Grant, 'I think we're gonna have a good time, I can already feel the chemistry.' And with that, Kaden says he's not going to waste any more time, and says he'll step away and let them get to it. No time is spared, as Niko leans over and starts to paw at Grant, lifting up his shirt, and kissing him. The guys start making out and groping one another, as the shirts come off and the shorts come undone. <br /><br />It isn't long before Niko is standing up in front of Grant, and the latter is worshipping Niko like the god that he is. After a while it's Grant's turn to get some oral action, as he reclines back on the bed, letting Niko go to work. 'I'm ready to fuck that ass,' Niko says, before diving down once more on Grant's dick, as Grant blurts out, 'oh fuck!'<br /><br />Niko starts to work over Grant's ass, spitting into it, tonguing it, and slapping his butt around, getting it ready for a dick. Moments later, Grant is bent over the bed, and Niko is preparing to enter from behind. But first, he has to get him ready with a little fingering -- clearly, he's too tight to just plow Niko's cock straight into him. Poor Grant is nothing but a bundle of grunts, pants and 'aaaahs!' as Niko fucks him from behind.<br /><br />I'll spare you the play-by-play, but know this: the scene ends with Niko shooting his load all over Grant's face, who then sucks the freshly-spent dick. Then, Grant shoots his load into Niko's mouth. Whew!<br />",
  "models": [
    {
      "name": "Grant III",
      "person_id": 35386
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-08-24",
  "scene_id": 70810,
  "series": "Grant & Niko",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Duo",
    "Facial",
    "First Time",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Grant & Niko"
}