{
  "collections": [
    "Active Duty"
  ],
  "description": "'It's been a while,' Jake says to director Kaden, as our scene opens. It sure has. He last did a scene with us more than a year ago, and Kaden says that the viewers are 'definitely' going to be glad to see him back in action. 'I'd say so!' Jake agrees with Kaden, smiling.Kaden introduces Niko to Jake, saying how Niko's the newbie of the two of them. Jake jokes about how Niko might need to be broken in. Kaden starts laughing, saying how Niko 'doesn't need to be broken in … he done broken in everybody! Everybody we could throw at him!' 'Hey, that's what I'm here for!' Niko says, laughing along with Kaden and Jake. Kaden says that he knows with these two guys, things are going to go great, so he's not going to get in there way. 'I'm excited!' Niko says, grinning that big grin of his. Kaden says he's going to step away and let them get to know one another a little better, and in no time flat, the guys are making out something fierce. Hot damn!You know full-well that Niko is probably in seventh heaven over Jake's rockin' body. His abs are just rippling all over the place. There's so much kissing and licking and groping and moaning … Niko -- who is rock hard from the get-go -- is having the time of his life with Jake.Jake's dick is as big as you remember -- it's the size of Tennessee. 'Ooh, that's a fat cock,' Niko says, as he grips it and starts slurping it down. The guys take turn blowing one another -- and Niko nearly takes all of Jake down his throat. Amazing! I think he might have gotten engaged to Jake's dick during this scene -- he's clearly in love with it. lol.The guys give one another's asses some lovin', licking and fingering and slapping … but this is just the preview for Jake to start ramming Niko from behind. Jake's ass, as always, is perfect and seemingly carved from marble. Niko is taking it as good as Jake gives it, telling Jake to 'fuck that ass, baby… that's all yours.' It isn't long before the guys have switched positions, and Niko has lowered himself onto Jake's dick and starts bouncing atop it. 'It's so fucking deep!' Niko says, as he shoves his ass down repeatedly on Jake. Another position change, and Niko is on his back, and Jake is thrusting away … but it isn't long before Jake is breathing real hard, and pants, 'I'm about to cum,' pulling out and shooting all over Niko's abs. Niko's load almost immediately follows. Whew!",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-08-31",
  "scene_id": 70815,
  "series": "Jake & Niko",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Rim",
    "Tattoos"
  ],
  "title": "Jake & Niko, Scene #01"
}