{
  "collections": [
    "Active Duty"
  ],
  "description": "Jake's back today for our brand new scene, and we've paired him up with the ready-for-anything Cruz. Prepare to watch the sparks seriously fly in this flip-flop scene!Kaden is directing the duo, and after his normal greetings and salutations, the guys waste no time in getting down to business.We're less than two minutes into the 40-minute scene, and the guys are already kissing and groping one another. Cruz cops a feel of Jake's firm butt through his sweatpants, grabbing a hold of what he'll get a full serving of later.Cruz lifts off Jake's shirt, and blurts out, 'big guy!' as he checks out Jake's broad chest. The guys quickly get out of most of their clothes until they are only left in their boxers, and then those get yanked off fast, too. Jake starts blowing Cruz, who is leaning back on the bed, taking it all in. Cruz, meanwhile, keeps his own hands busy, jerking off Jake while he sucks. 'Feels so good,' Cruz says, as he throws his head back against the head board. After a while, the guys switch positions, and it's Cruz's turn to give Jake's dick the once-over. Jake is in heaven, telling Cruz that he 'knows what he's doing,' as Cruz attempts to take the entire (long) dick down his throat. Cruz is up to the challenge, and tries his best to shove it all in, laughing a bit at his valiant attempt. He says he can't wait to get it inside his ass. Soon enough, Cruz is bent over on all fours, with his ass up in the air, ready for Jake to start working him over. Jake inspects Cruz's rear, teasing him, as the guys prepare for Jake's big entrance. Jake is a big guy -- he's tall, with a big torso, and a big ol' honkin' dick. It's as big a' round as a baby's arm! As Jake teases Cruz's ass with his dick, slapping his cheeks with his dick, Cruz says to Jake, 'you going to fuck me?' Jake replies, 'You don't have to ask twice,' and Cruz laughs.Next thing you hear is Cruz whispering 'Oh shit…' as Jake starts to slowly enter him from behind. And then we hear lots of muffled grunts and groans from Cruz, who is face down in a pillow, as Jake starts to pound him. Soon, Jake works up to a good, steady rhythm, thrusting in and out of Cruz as he holds on to Cruz's hips for balance.Cruz is soon flipped over onto his back, and we get to see his 'oh my god' faces in full view. Trust me, his mouth-agape, I-can't-believe-this-dick-is-inside-me faces are amazing. 'It's so big,' he yelps, as Jake slinks his dick inside him. Cruz grimaces, closing his eyes, as Jake says 'tight little asshole.' (Well, if you were getting split open by a dick the size of Jake's, you might be reacting the way Cruz does!)'It's my turn,' Cruz says to Jake, and the guys switch positions -- It's time for Jake to get fucked.Jake has his face shoved in a pillow, and it sounds like he's in a mess of pain/pleasure, as he's grunting hard. We haven't seen Jake bottom in a good long while, so it's always a big treat to see him give it up. Jake is panting and grunting and biting the pillow in front of his face, trying to maintain composure. For his part, Cruz is keeping up the pace.'Oooh, there you go,' Jake says, as he finally starts getting used to Cruz's dick inside him. But as soon as he starts to get comfy, it's time to change positions. Now Jake's on his back, with Cruz spearing him. 'Just take it,' Cruz whispers to Jake, who sounds like he's having a panic attack. lol. It isn't long before Jake has his hands covering his face, muffling his own moans and pants as Cruz thrusts away. 'Oh my god, oh my god,' Jake says, as he starts to jerk his dick while being fucked. Cruz slams into him harder, while Jake jerks his own dick faster and faster. 'I'm gonna cum,' Cruz whispers, as he pulls out and starts spurting his cum all over Jake's torso. Right after he's finished, Jake barks 'I'm about to cum too!' and he starts shooting his load. The guys start laughing immediately afterwards at the mess they've made. 'Wow, that was something else!' Kaden says to the guys afterwards. There's some pretty funny chit-chat with the guys (and about how Cruz was freaked out at first by seeing a box of Magnum condoms before the scene started -- ha!).",
  "models": [
    {
      "name": "Cruz",
      "person_id": 35383
    },
    {
      "name": "Jake II",
      "person_id": 35239
    }
  ],
  "release_date": "2014-09-07",
  "scene_id": 70819,
  "series": "Cruz & Jake",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Tattoos"
  ],
  "title": "Cruz & Jake, Scene #01"
}