{
  "collections": [
    "Active Duty"
  ],
  "description": "Oh man, we've brought Ryan and his dick o' death back to Active Duty, and I'm not sure Grant was prepared for what was in store for him. And that's just the way we like it! Ha!<br /><br />Kaden's directing this scene, and he greets the guys on the bed, who are already all smiles. Ryan says he's been 'floating around' here and there, but now he's back. And I know I'm happy about that. And I'm also happy to see the king sized tank in his pants, too.<br /><br />Grant says, 'they say he's got a bazooka,' referring to Ryan's dick. 'He does!' Kaden says, 'he is packin'.' He's got a 'gigantic dick,' Kaden says -- and Grant nervously laughs at that description. And let me tell you what -- Ryan is hung like a giant that's been fed growth hormones. <br /><br />Grant glances down at Ryan's jeans and says that he can already see that he's packing heat, so there 'ain't nothin' to it but to do it.' Kaden likes that go-get'em attitude, as do I, so Kaden cuts the chit-chat and lets the guys go to it.<br /><br />It isn't long before the guys are basically naked and Ryan is getting the blowjob of his life from Grant. And indeed, Ryan's dick is enormous and it's soon hard as granite. He's got one of those dicks where, when it's fully hard, his pressure probably drops in other parts of his body. It's just that big. <br /><br />By the time Grant has his ass up in the air, he's begging Ryan to tease him with the head of his dick, asking for just the tip 'for now.' Ryan obliges (condom-less) as Grant loses his mind and moans and groans and yelps.<br /><br />Enough of the teasing though, as it's time for Ryan to start fucking Grant properly. He slips on a condom and goes to town! Ryan may be as big as a house, but Grant's certainly able to take it -- and in stride. (Sure, Grant is face down in a pillow whimpering a lot -- but he's still demanding Grant to slap his ass, so I think maybe he likes it, a lot?)<br /><br />When all is said and done and the scene is over with, Kaden asks Grant how his asshole feels. He laughs and says, 'uhm, on a scale of 1 to 'fucked the shit of me?',' clearly indicating the latter option. 'I'm completely exhausted. I need to go ice pack my ass!' ",
  "models": [
    {
      "name": "Grant III",
      "person_id": 35386
    },
    {
      "name": "Ryan IV",
      "person_id": 35359
    }
  ],
  "release_date": "2014-09-14",
  "scene_id": 70823,
  "series": "Grant & Ryan",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Smooth",
    "Tattoos"
  ],
  "title": "Grant & Ryan"
}