{
  "collections": [
    "Active Duty"
  ],
  "description": "It's been a while since we've seen little Marty on the site -- and let me tell you, he's not quite so little anymore! The dude has gotten seriously ripped! <br /><br />This scene comes to us courtesy of guest director Mike, and Marty joins Tim for a serious fucking. The guys go through a series of positions, and Marty takes Tim's big dick like a champ!<br /><br />Since Marty's been away, he's gotten more broad in the chest, his ab muscles have grown even larger, and his acquired a new tattoo. Both he and Tim are so fit, there is about 1% body fat between the two of them.<br /><br />Mike says that the guys met the other day and played pool and got to know one another, and now they are going to get to know each other on a whole new level! <br /><br />The guys start groping one another after Mike lets them start doing their thing, and it isn't long before the shirts are off and the abs are popping out all over. Marty has got his hands full of Tim's thickening log. Even semi-hard, it's a hefty handful! <br /><br />After Marty has felt up Tim's rippling chest, he goes down and takes Tim's dick into his mouth. Marty's had a lot of practice, so he's sort of a pro by this point -- if he's not enjoying sucking this cock, he's a mighty fine actor. lol. For his part, Tim is happy as a clam -- and hard as a rock. (At one point, Mike asks, 'you guys having fun?' Tim quickly answers, 'Oh yeah!,' while Marty has his lips around Tim's dick.)<br /><br />Soon, it's time for Tim to blow Marty, and he does so with gusto. It's hypnotic to watch Tim suck Marty -- while Tim's big ol' cock is swinging in the breeze. Oh Tim, if only I could sink my claws into you, I mean, er, have you visit so I could direct you in a video… lol.<br /><br />After some more sucking, it's time for Marty to get royally fucked. First, he sits on Tim, facing away from him, and starts to go for a ride. He can't take too much of that, gasping, 'Damn!,' so he turns around and plants his ass down while facing Tim. Finally, the guys move to the bed, where they can get more comfortable. Tim works up a nice rhythm -- and we get some great shots of his perfectly-sculpted ass pumping in and out of Marty. Hot damn!<br /><br />Tim eventually shoots his load all over Marty's stomach, and Marty quickly follows suit with his own gushing load. Whew!<br />",
  "models": [
    {
      "name": "Marty",
      "person_id": 35307
    },
    {
      "name": "Tim II",
      "person_id": 35358
    }
  ],
  "release_date": "2014-09-21",
  "scene_id": 70827,
  "series": "Marty & Tim",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Smooth"
  ],
  "title": "Marty & Tim"
}