{
  "collections": [
    "Active Duty"
  ],
  "description": "Fantasy Come True - Devon & Luke'It's a typical Saturday around my place as I sit anxiously awaiting a new recruit, Devon, who was referred to me by Luke. Since I'd never seen Devon, I was especially excited about his first visit...those are truly the best for me since it is another model's attempt to give me something he thinks I might like. Luke could not have been more right! Devon arrives a few minutes ahead of Luke and we sit in the living room and chat. That's when I pop the question of how he and Luke met.Turns out the two of them were at a huge barracks party one night one of those where guys just drop in from all over, many of them never having met except through a mutual acquaintance. To make a long story short [too late], Devon woke up the next morning in Luke's arms. I was stunned but that's when Luke shows up and sits down on the couch beside Devon. I give Luke some shit about not having told me this story before and I ask the two of them to lay back and close their eyes and let's all imagine that morning again the way we would have had it turn out. Being two straight boys, I doubt they were imagining what I was, but hey, it's my fantasy and this is how I would have wanted it to be.Fade In ... Luke and Devon are taking a rest in each others arms in their sexy little underwear as the morning sun shines through the blinds and these two beauties look so comfortable and content. Suddenly Luke's hand reaches down for Devon's crotch and the passion begins. Devon turns around, somewhat startled at first, but then takes Luke in his arms and the two begin a hot session of passionate kissing.As the kissing continues, Luke straddles Devon and begins to remove his clothes, not missing a kiss as he does it. Devon responds by rubbing Luke's nice ass and pulling down his underwear to reveal Luke's sweet hole. The two continue kissing and rubbing each other all over and switching places until Devon quietly instructs Luke to get on his knees so Devon can lick his hot ass. Luke does as he is asked and Devon does the best job of rimming that I think I have ever seen a straight guy do. He buries his face in Luke's butt and works it over good.After that he turns Luke over and begins slowly sucking Luke's already hard prick, finally he stands Luke up in front of his face so he can get his cock down his throat better and a serious cock sucking/face fucking moment begins. Devon is obviously enjoying himself at this point...you can see it all over his face and hear it as he talks to Luke while he services his hot cock. Finally Luke can't hold back anymore and he blows his load of straight-boy cum all over Devon's chest and arm. Devon, unaffected by the man-juice all over him, lays Luke back on the bed and continues kissing him and rubbing his cock.The favor is returned ... Luke tells Devon it is his turn now as he gets on his knees behind Devon and tongues his boy-pussy with as much passion and excitement as Devon had done to him. A rim job like Luke is giving to Devon would make anyone cream in their pants. Luke works his tongue like a champ in Devon's straight-boy virgin ass. Then he flips Devon on his back and returns the cocksucking favor, eventually standing Devon up in front of him and taking his cock in his mouth and working it until Devon blows his hot load all in Luke's eager-to-please mouth and the cum just drips down Luke's face as he sucks and sucks, not skipping a beat...Fade out.We all seemed to wake from our dream at the same time and judging by the looks on their faces, maybe their fantasies weren't so different from mine after all. To test it, I ask them to give each other a kiss. They hem and haw a bit, and Devon think's it kind of queer, but they do it. I was expecting a little quick peck, but they give each other a lip-lock that got my dick hard. Now I KNOW they had the same fantasy as me.Straight boys ... go figure!",
  "models": [
    {
      "name": "Devon II",
      "person_id": 35428
    },
    {
      "name": "Luke III",
      "person_id": 35429
    }
  ],
  "release_date": "2014-10-19",
  "scene_id": 70837,
  "series": "Devon & Luke",
  "tags": [
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "Kissing",
    "Rim",
    "Rimming",
    "Sensual"
  ],
  "title": "Devon & Luke, Scene #01"
}