{
  "collections": [
    "Active Duty"
  ],
  "description": "Brock and Marty are back in front of the camera, and Brock's dick came ready to play! Bareback!Brock's dick is the size of a baby's arm and Marty can barely get his hand around it completely. Marty wastes little time in stuffing it in his mouth as soon as he can -- well, after a little bit of mutual jerking off, that is. Marty is looking more and more muscular lately -- his body is just getting seriously ripped. Those abs are amazing!Marty starts to go to work on Brock, sucking him down and stroking him and Brock is loving it. 'Ahh, that feels good!' Brock says, as he throws his head back onto the headboard. 'Keep going.' Guest director Mike asks if Marty likes that cock, and Marty -- dick in his mouth -- looks to the camera and nods, mumbling 'mmhmmm.'Brock's dick is easily a two hander. When Marty puts his hand around the base of it, you realize just how big the damn thing is. And thick, too! 'Can you take it all, Marty?' Mike asks. Marty pauses, and then tries to shove his head all the way down Brock's dick to his balls. He quickly comes off it, slurping noises abounding, saying, 'No, it's too big!' Well at least he tried? lol.After some more sucking, Brock says 'Let me fuck you.' And boom! That's our cue. Marty is on his back, legs flung in the air, and Brock starts to pierce him -- bareback. Poor Marty is a grunting mess, gulping for air and exclaiming 'Damn!' in-between very deep breaths. (At one point, we hear Mike whisper to Marty, 'You ok?' Marty quickly responds, 'I'm good!')Brock starts long-stroking Marty, slowly spearing him, and we see the full length of Brock's dick going in and out of Marty (who is grabbing onto Brock's arms while getting fucked). Suddenly, Brock blurts out, 'I'm about to cum,' and he quickly pulls out and rearranges himself so that he shoots his load onto Marty's chest and shoulder. The guys -- totally out of breath -- embrace, and that's a wrap!",
  "models": [
    {
      "name": "Brock MB",
      "person_id": 35256
    },
    {
      "name": "Marty",
      "person_id": 35307
    }
  ],
  "release_date": "2014-10-05",
  "scene_id": 70833,
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Brock & Marty, Scene #01"
}