{
  "collections": [
    "Active Duty"
  ],
  "description": "We've got a new scene for you today, from our pal Mike, who brings us a duo scene with Alan and Brock! (And -- it's the very first time a guy has blown Alan, too.)<br /><br />I always think it's kind of funny how Mike will throw guys together in front of the camera that haven't really met one another before. And that's what he's done today with Alan and Brock. From behind the camera, Mike tells Alan to introduce himself to Brock, so Alan -- as he starts to fondle himself -- says that he's 26 years old and from Ohio. He stands 5'9' tall and weighs about 185 lbs.<br /><br />Alan says he's nervous, and I suppose I would be too if I had only shot a solo and was now thrust into a scene with another guy! lol. (Previous to this, Alan had filmed just one solo for us, which ran in our War Chest Update a few weeks ago.)<br /><br />Mike says that Alan was willing to come in to do a side-by-side jerk off with someone, and was maybe ok with getting blown. But, Alan says, we'll 'see how it goes.' Mike laughs a little at that, and we can see a smile on Brock's face because he must know what's coming. <br /><br />Well, things start of tentative at first, but half-way through the scene, Alan is squirming and moaning something good as Brock blows him. It isn't too long before Alan's about to blow, so Brock pulls off of him and Alan lets it rip. After that, he jerks off Brock a little bit, before Brock finishes the job and jerks out a nice load of his own. At the end of the scene, Alan says that he had 'a lot of fun' and that 'it's not out of the question' that he could blow a dude. Mike says, 'alright, that's what I like to hear.' Mike takes it further and asks about fucking. Alan answers like he's a politician on a cable news show: 'I think that's something that is also strong possibility.' You can hear the wheels turning in Mike's head already!",
  "models": [
    {
      "name": "Alan",
      "person_id": 35390
    },
    {
      "name": "Brock MB",
      "person_id": 35256
    }
  ],
  "release_date": "2014-10-12",
  "scene_id": 70835,
  "series": "Alan & Brock",
  "tags": [
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay"
  ],
  "title": "Alan & Brock"
}