{
  "collections": [
    "Active Duty"
  ],
  "description": "Cody is brought to us by our guest director Mike, and he is muscular, up for anything, and has a great big smile. He's done a couple scenes already for Mike, but this is the first scene we're sharing with you -- and it's a great one: He gets fucked royally by Tim!Mike says Cody has done a solo and some oral work, but this is his first time doing anything hard core in front of the camera. And, when you're paired up with Tim, you better be ready for a wild ride! Mike says it took a bit of 'coaxing' to get Cody to cross that line to some fucking action, but he's here and ready to go. Mike let's the guys get to it, and, after a few nervous glances from Cody towards the camera, he starts to grope himself and get the party started. It isn't long before both of their dicks are out, and they are jerking one another. 'That's big!' Cody says, laughing, as he grips Tim's dick and starts stroking him. The pants come off next, and in a flash, Cody has engulfed Tim's cock. He's going to town on him and Tim is loving every second of it -- grabbing the back of Cody's head and guiding him down. Cody takes time ALL the way down, repeatedly, deep-throating Tim until Cody's nose is pressed deep into Tim's groin. Dang!It's Cody's turn to get sucked, and Tim leans over -- continuing to jerk himself -- and starts to suck the big strapping Cody. Cody can only take so much of the sucking before he has to get his mouth back on Tim, and he makes a meal out of him. 'Does that feel good?' Cody says, working over just the tip of Tim's dick. 'Oh yeah,' Tim says, moaning and sighing as Cody swallows Tim whole. It's time for Tim to fuck Cody, and poor Cody (who is on his hands and knees) doesn't know what hit him. He's a panting mess of flesh as Tim slams him from behind. Cody grunts and groans into the pillow, and once they get into a groove, we hear Cody blurt out 'fuck me!' and we're off to the races! After a spell, Cody flips over on to his back, and Tim grabs his legs and they get going again. Cody's jerking off with his right hand, and gripping the sheets with his left, as he holds on for dear life. 'I'm gonna cum,' Cody growls, as he starts to spew his load all over his stomach while being fucked. Tim keeps on plowing Cody, even after Cody's shot his wad, and soon Tim pulls out and jerks his cum onto Cody. Whew!Afterwards, Cody says -- with a smile -- the experience was 'pretty painful' but he would do it again. I like that kind of can-do attitude!",
  "models": [
    {
      "name": "Cody",
      "person_id": 35421
    },
    {
      "name": "Tim II",
      "person_id": 35358
    }
  ],
  "release_date": "2014-09-28",
  "scene_id": 70831,
  "series": "Cody & Tim",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Cody & Tim, Scene #01"
}