{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Things are going really well for Jordan Evans and his new man, Arad, and it has come time for him to show off his chiseled, soft-spoken hunk to some of his friends. Markie More and Colt Rivers are great hosts who are sure to put out quite the spread, but when they see Arad, the only spread either one of them can think about has nothing to do with food. As Arad takes a phone call in another room, Markie and Colt pump Jordan for the juicy details: how is he in bed? what's his cock like? etc. So much so that Jordan finally just decides to take matters into his own hands, unzipping Arad's pants when he walks back into the room, then gulping down his cock as Markie and Colt look on stunned and anxious. Colt rubs Markie's crotch, feeling his hard cock through his shorts, and so Colt unzips his lover's pants and begins to suck him off as Arad pushes Jordan's head further and further down onto his cock, before Colt and Jordan switch postions, and Colt gets a taste of Greek. <br> <br/>With everybody sufficiently worked up, Jordan and Colt bend over on an ottoman as Arad and Markie enter from behind. Jordan and Colt embrace as they are both simultaneously penetrated, Jordan grabbing Colt's shoulder as Markie plows him from behind. After partner swapping on the ottoman, the guys return to their originals as Jordan mounts Arad and Markie lays Colt out on his back, fucking him as he sucks on his toes, causing Colt to jizz all over himself as Markie pulls out and wets him down with his own load. Arad and Jordan follow suit, crowding around Colt to shower him with load after load after load. <br> <br/>After all, caring is sharing.<br> <br/>Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Colt Rivers",
      "person_id": 34306
    },
    {
      "name": "Jordan Evans",
      "person_id": 34583
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2014-12-25",
  "scene_id": 70840,
  "series": "NDB - 4529 - Markie More, Colt Rivers, Jordan Evans & Arad",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Orgy",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Cock Tales"
}