{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Joey Moriarty works his land in the hot afternoon sun, it occurs to him how long it's been since he's had a visitor. Almost on call, as if summoned, Joey looks up and sees his old friendly neighbor, Drake Tyler, heading up the pass to come see him. Upon his arrival, the two friends embrace and share a laugh, catching up quickly before moving inside for a beer and to get out of the sun. Once inside, the guys recount their harvest troubles, with Drake making the remark that he's 'hungry'. With that, Joey adjusts his fly and Drake not so subtley takes notice, indicating exactly what he means by 'hungry'. Moments later, Drake is on his knees, peeling Joey's blue jeans off his ass and downing his meaty cock, tonguing the head and then gagging on Joey's thick shafted member. Joey thrusts as Drake continues to suck, until the two farmhands switch, and Joey perches Drake's sun-kissed body up onto the kitchen counter and begins eating his ass. Drake bites his lip from the pleasure as Joey continues to tongue Drake's hole, moistening it up for his hard cock, which he plunges deep inside of Drake as Drake moans with pleasure. Pounding Drake from behind, Joey grabs Drake's shoulders, keeping him from squirming around, as Joey continues to plug away, before they roll over, and Drake mounts Joey, riding him like a good little cowboy, before getting doused in Joey's pent up load, and unleashing one of his own. Sure it's hard country, but it makes the going a little easier when you also have a hard buddy.Enjoy!",
  "models": [
    {
      "name": "Drake Tyler",
      "person_id": 32530
    },
    {
      "name": "Joey Moriarty",
      "person_id": 35535
    }
  ],
  "release_date": "2014-12-11",
  "scene_id": 70973,
  "series": "NDB - 4527 - Joey Moriarty & Drake Tyler",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth",
    "Workers"
  ],
  "title": "Blue Jean Buddies"
}