{
  "collections": [
    "Next Door Twink"
  ],
  "description": "When a boy feels compelled to take to the open road and wander aimlessly, there's a certain horniness that grows inside him.  Being away from home, seeing so many unfamiliar things, learning to be independent...it all can make a young cock hard, and a tight, eager ass hungry.<br><br>When Anthony Scott happened upon a mansion in the hills, he saw the open garage as an invitation.  He didn't know who lived there, or really even in what town he was, but he was tired and it seemed like a perfect place for a nap.  Wealthy young couple, Ashton Miller and Danny Forrest, were relaxing inside their home, and heard items moving around in the garage.  Shortly later, they found Anthony curled up under a blanket out there.  Pissed off, they dragged him inside and demanded answers.  What Anthony did next was the best thing he could think of in order to earn a welcome stay. <br><br>He started by sucking both Ashton's and Danny's cocks simultaneously.  The two could hardly believe a vagrant, although very hot, was on his knees in their house, blowing them!  It was completely abnormal and strange, but the wanderer's mouth felt too good on their stiff dicks to make him stop.  In fact, they decided to go further with the boy.  After Ashton helped himself to a good, long taste of Anthony's thick boner, the couple took turns fucking the street boy's tender, warm ass.  Join this incredibly hot, but unusual sex session and watch the unbridled fun unfold.  <br><br>Enjoy!",
  "models": [
    {
      "name": "Anthony Scott",
      "person_id": 35519
    },
    {
      "name": "Ashton Miller",
      "person_id": 35459
    },
    {
      "name": "Danny Forest",
      "person_id": 34093
    }
  ],
  "release_date": "2014-12-03",
  "scene_id": 71058,
  "series": "NDT - 8270 - Ashton Miller, Anthony Scott & Danny Forrest",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Smooth",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "Runaway Twink"
}