{
  "collections": [
    "Active Duty"
  ],
  "description": "Things are already hot and steamy as we open on Jaxon and Niko in the shower. Now, you haven't met Jaxon yet, but you're getting an eyeful of him today. Both he and Niko are buck naked, dripping wet, hard as a rock and making out under the shower. Hot damn! Niko looks to be in heaven as he explores Jaxon's body, admiring it from every angle possible, and bending Jaxon over to get a good view of his perfect ass. (I know, I know, Niko's ass is breathtaking too, but it's easy to get distracted by fresh meat. I mean, fresh men!) It isn't long before Niko is on his knees, slurping all of Jaxon's dick down his throat. I think Niko's in love! As soon as I find out where they are registered at, I'll let y'all know. lol. Niko goes back up for some more kissing, as Jaxon then heads south to Niko's big dick. If you're a fan of kissing and groping and making out, you're going to be in heaven with this scene -- the guys are very into one another. Niko gets Jaxon over to the tub and starts to investigate his ass, rimming him and sliding an exploratory finger in his rump. But he can't resist blowing him some more, so he turns him back over and takes another swing at his cock. After Jaxon sucks Niko a bit longer, Niko asks Jaxon if he's ready to feel his dick inside him. Jaxon's ready! Next thing, the camera is underneath the guys, Jaxon is hard as a rock, and Niko is fucking him hard and fast. Whew! After a couple of minutes, the guys switch it up, as Jaxon wants to 'ride that,' and he sits down on Niko, and, well, goes for a ride. Jaxon is still stiff as a board, and Niko reaches out and starts jerking him while he bounces in the air. Niko is soon jackhammering into Jaxon, who is loving every second of it. Dang! Then, the tables turn, and Jaxon starts fucking himself onto Niko, backing his ass up onto him. (It's pretty incredible to see Jaxon bouncing in the air with his dick slapping around at high speed.) Now it's Niko's turn to get fucked, as he throws his ass in the air and Jaxon starts plowing him from behind. The guys change positions so that Niko in on his back, legs in the air, while Jaxon is thrusting away. Niko blows his load while Jaxon furiously fucks him, and Jaxon soon follows, pulling out and shoot all over Niko's stomach. The guys kiss and make out as the scene closes and that's a wrap!",
  "models": [
    {
      "name": "Jaxon",
      "person_id": 35518
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2014-11-02",
  "scene_id": 71084,
  "series": "Jaxon & Niko",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Sensual",
    "Shower",
    "Tattoos"
  ],
  "title": "Jaxon & Niko, Scene #01"
}