{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm back behind the camera, directing our latest scene, which features Cruz and Jaxon in a hot flip-flop scene that I think you're gonna love!</br><br>Jaxon is just a real cute dude, a wholesome-looking guy next door -- and I'm super pleased that he's taken a shine to us. He says he had a 'hell of a lot of fun' his first time around (with Niko). 'Niko's a lot of fun.' I tell Jaxon that we've got fun guys all over the place, and he smiles, and says, 'well that's pretty damn good!' </br><br>'We got fun guys hidden in the closets...' and then Jaxon looks over to the closet. lol. No, we aren't having anybody pop out of closets today. (But hey, that does give me an idea...) I tell Jaxon that we've got a guy for him today, Cruz, that's just as much fun as Niko. Jason chuckles a bit at that notion.</br><br>I ask what was his favorite thing about Niko, and he says it was 'probably just him pounding me.' I say, 'Oh yeah?' 'Yeah. It was so damn big! It was a first for me. He broke me (in) good.' I ask if he's been fantasizing about it sense, and he says, 'mmhmm.' Well now! I say, 'Let's see what we can make happen today.' </br><br>Cruz soon comes in, and the guys have a pretty funny exchange, as they get to know one another. As the clothes start to come off, Cruz starts to shuck off his jeans, mentioning his underwear. 'I don't wear any underwear,' Jaxon says. Cruz laughs, 'I noticed!' </br><br>It isn't long until Jaxon is splayed on the bed, and Cruz is going to town on his rock hard dick. Cruz chokes on Jaxon just a little bit, which makes Jaxon laugh. It's Cruz's turn to lay back and get serviced, as his long cock makes its way into Jaxon's mouth. We get some cool angles here where Cruz's dick appears to be as long as Jaxon's face is tall.</br><br>Soon, it's time for the bottoms to start throwing themselves in the air, as Jaxon's rear is presented to Cruz, who rims him until it's nice and wet -- and ready for his dick. Cruz fucks Jaxon from behind, as Jaxon holds on to the comforter for dear life. Jaxon soon flips over, with his feet up in the air, and Cruz long-strokes him nice and slow. Jaxon is taking it like a champ, whispering encouragement to Cruz every so often, eventually leading up to what Cruz has been wanting to hear: 'It's about time I fuck you.'</br><br>Jaxon doesn't have to go as slow on Cruz, and he more vigorously pounds him until Cruz is muttering 'fuck me, oh shit, ah god damn!' over and over while grabbing on to the side of the bed. Soon Jaxon is blowing his load all over Cruz, and then Jaxon sucks off Cruz until it's time for him to let his cum fly. Whew! At the end of the scene, the guys kiss and we fade to black.",
  "models": [
    {
      "name": "Cruz",
      "person_id": 35383
    },
    {
      "name": "Jaxon",
      "person_id": 35518
    }
  ],
  "release_date": "2014-11-16",
  "scene_id": 71087,
  "series": "Cruz & Jaxon",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Rim",
    "Rimming",
    "Tattoos",
    "Twink"
  ],
  "title": "Cruz & Jaxon"
}