{
  "collections": [
    "Active Duty"
  ],
  "description": "Our guest director Mike has delivered us a brand new hard core bareback scene starring Drew (after months and months away!) and Tim. Drew's returning after getting out of the military, and he's ready to turn his ass over to Tim and his massive cock. It's gonna be a good one, folks!It isn't long before the clothes are off and dicks are in hand. I could stare at Drew and Tim's bodies for days. They are so fit -- just perfect specimens of physicality. They start mutually jerking one another, but it's Drew that decides to take the leap and go down on Tim first. It's cute to watch Tim's eyes widen as Drew goes down him -- and guides his head down with a hand behind his head, too. After a spell, it's time for Drew to lean back and get his dick taken for a spin. Tim blows Drew with gusto, as he lets his hand wander over Tim's back and the side of his chest. The look on Drew's face says it all, but he also vocalizes it: 'That feels so good,' telling him to go deeper. And by the way he says it, you know he means it.Soon, Drew is on his stomach, ass in the air, and Tim is slowly -- at first -- entering him from behind (bareback). Tim's dick is quite thick, and it's clear that Drew is struggling a bit with the girth (and hell, length), but he's a trooper! After a good long dicking (with a moaning Drew in full effect), Tim pulls out and shoots his load all over Drew's back. Now it's Drew's turn to cum, and he lays back on the bed to rub one out, quasi-basking in the after glow of the pounding he just got.Whew!",
  "models": [
    {
      "name": "Drew",
      "person_id": 35351
    },
    {
      "name": "Tim II",
      "person_id": 35358
    }
  ],
  "release_date": "2014-10-26",
  "scene_id": 71083,
  "series": "Drew & Tim",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos",
    "White Butt"
  ],
  "title": "Drew & Tim, Scene #01"
}