{
  "collections": [
    "Active Duty"
  ],
  "description": "Our scene opens with Brock and Tim on the bed, while guest director Mike is telling us how this particular pairing came about. As it turns out, Mike asked Tim who he wanted to do a scene with, and Mike says 'he nominated you, Brock.' This prompts a smile from Brock, and Mike continues, saying, 'I think he liked what he had before, and I think he wants some more of it.' 'Yup,' Tim says, and then elbows Brock in the shoulder, asking 'You ready for this?' Ha! Brock replies: 'I'm ready! Let's go for it.'Mike tells the guys to have some fun, and we're off!Hands start to fish around inside jeans, groping for dicks that are quickly coming to life. The guys are focused on the straight porn playing off camera, though we can see Tim repeatedly glance at Brock's package and what he's working with. The shirts and pants start to come off, and the guys start jerking off one another.The guys settle into a 69 position for a spell, sucking on one another's big dicks as things get more heated. (Tim's dick looks particularly huge in this sequence. Not that it already isn't big, but I swear it got even bigger somehow. lol.)It's time for the fucking to commence, and Brock's on his back, legs flung in the air, and Tim is spearing into him -- bareback. (Tim's ass is just absolutely majestic -- when you see his cheeks squeezing and pumping into Brock, it's just awesome.) Brock is grunting and panting like he's going into labor -- I guess that's what a dick the size of Tim's can do to you. (And the end of the scene, he even jokes that Tim's dick is like 'having a baby up my ass.') LOL. Tim gets into a steady rhythm, forcing more and more of his cock inside Brock, as the yelps from Brock ease up a bit.Soon, Brock is on his stomach, and Tim is plowing him from behind. Tim's body is just crazy hot here, and you can see all of his muscles flexing as he fucks Brock in a steady rhythm. (For his part, Brock's cries are mostly muffled by the comforter that's shoved in his face. lol.)It isn't long before Tim pulls out and shoots onto Brock's ass. Now it's Brock's turn to get off, and Tim blows him until Brock shoots -- all over Tim's face.",
  "models": [
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Tim",
      "person_id": 35281
    }
  ],
  "release_date": "2014-11-09",
  "scene_id": 71086,
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Facial",
    "Gay",
    "Tattoos"
  ],
  "title": "Brock & Tim, Scene #01"
}