{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "I knew Casey from college and called him up when I was moving into town and he let me crash with him while I looked for a place, which I was grateful for. What Iwasn't grateful for was that he literally never wore anything besides his underwear. Not that itwasn't a great view, I mean, he was gorgeous, nice legs, tight ass, amazing abs. Watchinghim strut around in practically nothing was certainly not unpleasing... and that was sort of theproblem. I was a guest so I was trying to be polite and respectful but I was constantly catchingmyself staring at him. I never got used to it, and I'm sure he noticed, because he'd catch myeyes, or smile at me wryly. I think he liked the attention, but it made things awkward... at leastfor me... he was obviously completely at ease. So we'd go about that way everyday; me tryingnot to stare and him being a total tease wearing essentially nothing, until one day a few daysbefore I was moving into my new place, I called him out on it. 'Don't pretend for a second thatyou don't like it. I've seen how you check me out all the time.'I tried to deny, but it wasn't much use, since I couldn't stop myself from checking him out even inthe middle of the conversation. So he took it to the next level and started teasing me, pulling thewaistband down a little, turning around to shake his butt. I just laughed at that point, but the truthwas I was incredibly turned on. I think he could tell because he was clearly encouraged. Hepulled them off all the way and bent himself over the couch. 'C'mon, now's your chancebuddy,' he said wagging his tail.I was shocked. This was a new level. He was handing it to me right there in the middle of theroom and I didn't know what to do. But after a few moments I listened to my rock hard dick andplunged my face into his ass.It ended up being just a one time thing. He teases me about it sometimes still, but I'll take it. Itwas completely worth it.",
  "models": [
    {
      "name": "Casey Everett",
      "person_id": 35785
    },
    {
      "name": "Jed Athens",
      "person_id": 35784
    }
  ],
  "release_date": "2015-01-28",
  "scene_id": 71319,
  "series": "Can't Look Away",
  "tags": [],
  "title": "Can't Look Away, Scene #01"
}