{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For salesman Julian Stiles, it's been a few days since he last closed a deal, and he's starting to worry about his bottom line. Things could get pretty lean for Julian if he doesn't figure something out soon. Luckily for him, there is a sucker born every minute, and Julian has just found his personal sucker. Brenner Bolton has been at home slaving away doing some household cleaning, and developing all the aches and pains that go along with that sort of work, so when Julian knocks on his door unsuspectingly offering his relaxation services, Brenner's eager anticipation is palpable. Laying out on the sofa with his ass covered only in a towel, Brenner closes his eyes as Julian rubs his aching back and sore shoulders, and Brenner is viusally aroused. Showing a little chub, Brenner finds himself ready to serve his suitor, and so he helps Julian out of his clothes and begins gagging on Julian's cock. Julian shoves Brenner's head deeper onto his shaft, choking Brenner as the tip of his head tickles Brenner's throat. Then Julian, snapping back into form, reminds Brenner that he's here to help him relax, so Brenner lays back as Julian shows him some advanced relaxation techniques. Brenner is feeling nice and comfortable now, and ready to go all the way, so he mounts Julian's stake and rides him like a horse until he's ready to spit his pent up load, reclining afterwards with all stresses melted away, as Julian begins the paperwork for Brenner's continued patronage.Enjoy!",
  "models": [
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    },
    {
      "name": "Julian Smiles",
      "person_id": 17772
    }
  ],
  "release_date": "2015-01-01",
  "scene_id": 71326,
  "series": "NDB - 4530 - Julian Smiles & Brenner Bolton",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Workers"
  ],
  "title": "The Salesman"
}