{
  "collections": [
    "Active Duty"
  ],
  "description": "New Recruit: Zack is a straight boy...really! He needs the money though and he's adventurous, so when Dink gets him into a session with Lex, the Army's original cock-slut, he's game for some adventure. Lex is down on his knees sucking Zack's cock before you can whistle reveille and Zack is enjoying every second of it.Zack spins around and Lex dives tongue-first into Zack's smooth, straight-boy ass. Listen to Zack tell Lex to eat his ass and suck his cock. This straight boy is liking this gay stuff. Zack's moans tell Lex he is doing everything just right. Paddy joins the party and sucks Lex's cock while Zack face-fucks Lex, sliding his hot cock down the slut's throat.Paddy moves onto Zack's cock and Zack opens up his ass to Lex's tongue work again as he sits on Lex's face. Zack takes turns sucking both Lex and Paddy's cocks and they both agree that Zack is a natural born cocksucker, even if he swears he is straight. Zack is all over Paddy's cock and can't seem to get enough cockmeat now that he has been initiated.Cum Bath #1: Zack disappears for a while, but Paddy and Lex get into it hot and heavy. After a great round of cock sucking Lex shoots a wad all over Paddy's face. The grunts then flip around and Paddy Shoots off in Lex's face and Lex sucks it all up.Zack pops in just long enough to cum all over Paddy and Lex. Lex sucks out the last drops of Zack's cum and then he eats out Zack's ass one last time before Zack leaves to fuck his girlfriend. Damned straight boys!Cum Bath #2: When Zack leaves early, Patrick steps in to get his cock serviced. He feeds his long uncut prick into Lex's wide-open mouth while Paddy is down on the floor sucking Lex's grunt cock and sperm-filled balls.Paddy and Lex double-team Patrick, first they suck his cock together, then Lex moves in behind the muscular Army man and eats his smooth ass. Patrick is having a great time as he sprays his cum all over Lex's face and in his mouth. Lex then sucks in the cum covered cock and licks it clean.All this sex hand cum has Lex so excited that he jerks out a loud and powerful second load all over Paddy's face. Paddy gets up and pulls his pud until he spunks in Lex's mouth to finish off a sweaty night of grunt sex.",
  "models": [
    {
      "name": "Lex II",
      "person_id": 35589
    },
    {
      "name": "Paddy",
      "person_id": 35581
    },
    {
      "name": "Patrick",
      "person_id": 35582
    },
    {
      "name": "Zack",
      "person_id": 35249
    }
  ],
  "release_date": "2014-12-07",
  "scene_id": 71435,
  "series": "Lex, Paddy, Patrick & Zack",
  "tags": [
    "69",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Gay",
    "Group",
    "Hairy",
    "Jerk Off",
    "Muscular",
    "Rimming",
    "Smooth",
    "Tattoos"
  ],
  "title": "Lex, Paddy, Patrick & Zack, Scene #01"
}