{
  "collections": [
    "Active Duty"
  ],
  "description": "Tonight I am sharing something with you that has never been on the site in the members area for download or in its entirety.  It was my very first attempt at making a 'hardcore' video.<br></br>Prior to this, I had only shot solos of the soldiers, sailors and marines that came through my doors as a guest director for Dirk Yates. Once I opened the doors to Active Duty I knew I had to ramp up the offerings if people were going to take my efforts seriously. Shooting a few guys jerking off just wasn't going to cut it if I were to build a true blue porn production company (or art gallery as I like to think of it) and compete in a market that, while not over saturated at the time, still had a large number of players who were producing a lot more hardcore scenes than they were solos. The year was 1999. The Internet was still a virtual wild wild west and only a handful of gay membership sites shooting exclusive content even existed.<br></br>A lot of the larger, well-established studios had yet to even explore the Internet as a viable source of revenue. In fact, many of them didn't even have a 'web page' (as everyone used to call it) at the time. They were still focused on their retail brick and mortar business model and were unsure if this Internet thing was even going to last or if it were just a fad that would quickly die out in a year or two. Many of them didn't see the need to invest the money into something with such a questionable future. For we few renegades without the financial means to build a traditional porn studio, it was our only shot at building a dream. If it didn't work, we were either back at square one or back to our 9 to 5's never to know what we could have become.<br></br>Luckily for Active Duty timing was everything. The absence of the big studios making a huge impression on the internet was still at least a few years ahead and we had a window of opportunity. I did the only thing I knew how to do, the only thing my personality (and wallet) would allow -- and that was to get in where I fit in and try like hell to make the best of it.<br></br>Enter stage left Active Duty's first hardcore release Dink Flamingo's Basic Training 1 with Haus Weston, Hunter and SGT Lex.  Now, the amazing thing about this trio was the fact that none of the background story was made up.  Lex was actually in real life the SGT in charge over Haus and Hunter in their daily Army jobs. I shit you not. Now Lex was as gay as the day was long and he'd had his eyes on both his junior soldiers for quite some time. He just didn't have any idea how to go about getting them in the right situation to fuck his brains out.<br></br>Enter Dink Flamingo stage right. Lex had been doing some solos for me and telling me all about these two hot soldiers in his shop that he worked with every day. His description of Haus Weston in the shower with his long soft dick hanging down his leg and his dreamy recollections of Hunter's pretty greenish blue eyes and perfect cow licked blonde hair were enough to get my interest. I gave him some homework to do and assured him from there I would do the rest. Back then everybody with a computer was on AOL and had a screen name and profile. I assigned SGT Lex with the simple task of getting Haus and Hunter's screen names for me and from there I would handle everything else.  He passed his assignment with flying colors -- well half way -- he was able to get the AOL screen name that Haus used as he surfed the Internet and I quickly saved it on my buddy's list.<br></br>As soon as Haus came online I quickly approached him about doing some modeling and within a couple of days had him standing over me shooting his huge fat load down onto me splashing all over my face as I filmed his first solo.<br></br>Hunter would be a little more of a challenge as he didn't yet have a computer or screen name. Luckily he and Lex already had somewhat of a friendship going outside of work (much against the rules for a SGT like Lex to be fraternizing with a lower ranking soldier) and Hunter would come down to the SGT's barracks room and play video games and have a few beers from time-to-time. So, I had the idea that Lex would invite him over for one of these evenings and that he would just so happen to be wrapping up an online Instant Message with me where we were talking about his next solo shoot.  He would bring Hunter into the conversation and let him read the IM and see if Hunter was interested in making some quick money jerking his dick on camera.  Hunter took the bait hook, line and sinker and was soon at my house jacking his dick in front of my camera.<br></br>Now, Hunter and Haus already had a hunch that the SGT might be batting for both teams and I let the cat out of the bag by confirming both of their suspicions.  I also joked with them both about how hot it would be to see them take their real life SGT who rode their asses so hard at work everyday and bend him over and fuck his ass and use his mouth out of revenge.  They laughed it off at first, but I didn't give up. <br></br>Over the next couple of weeks I would continue to plant the seed in their minds that this is in fact exactly what we should all do.  Lex got on board and assured them that he would be more than down for it and amazingly I was finally able to make it all come together and happen.",
  "models": [
    {
      "name": "Haus",
      "person_id": 35586
    },
    {
      "name": "Hunter",
      "person_id": 35089
    },
    {
      "name": "Lex",
      "person_id": 35222
    }
  ],
  "release_date": "2014-11-23",
  "scene_id": 71436,
  "series": "Basic Training - Haus, Hunter & Lex",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Rimming",
    "Threesome",
    "Uniform"
  ],
  "title": "Basic Training - Haus, Hunter & Lex"
}