{
  "collections": [
    "Next Door Casting"
  ],
  "description": "Waiting nervously on Markie's couch is Johnny, a golden boy with a great attitude and a whole list of things he's never tried with a man. Markie senses Johnny's apprehension and eases him along, slowly kissing him and feeling him out, then losing all pretense and ripping Johnny's clothes off. Johnny takes to things quickly, licking his fingers and beginning to finger Markie's ass, as Markie chokes on Johnny's stiffening cock. Johnny pushes Markie's head down further onto his shaft as Markie gags a bit from the size, before they switch, and Johnny shows Markie how his fast study, wetting Markie's dick with a thick load of saliva before downing it hands free to its base. Markie is marginally impressed, but he's still got a few tests to run before he gives Johnny his full seal of approval. To that end, he flips Johnny over onto his back and begins to pummel him, showing no mercy for Johnny's virgin hole. Johnny strokes feverishly as Markie continues to unleash  a free trip to Pound Town, and Johnny takes it all like a champ, riding Markie reverse and grinding on his cock as Markie fucks the cum right out of him, before launching his load all over Johnny's waiting face. Johnny takes the cumshot like a champ and downs Markie's cock one last time for good measure, milking it for every last drop, and trying to prove that he'll go to any length to prove he has what it takes to fuck like a buddy. But what do you think? Vote early. Vote often.Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Johnny C",
      "person_id": 35578
    }
  ],
  "release_date": "2015-01-09",
  "scene_id": 71468,
  "series": "NDC - C109 - Johnny",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Buddies Casting: Johnny"
}