{
  "collections": [
    "Cody Cummings"
  ],
  "description": "When Cody was finally settled in his plush hotel room, he pulled out his laptop and opened a file he had stored.  It was a video of a young girl he had met weeks earlier.  She was nude, dancing in front of a mirror, moving her body in very sensuous ways.  Cody began masturbating.  He tugged his cock until it grew quite firm.  Just as he was becoming fully immersed in a fantasy involving the girl, a stranger opened the hotel room door and came inside.  Surprised, Cody questioned the man.  His name was Tex, and he had been sent to the wrong room, apparently.  Cody could tell Tex was confused, but also intrigued.  Cody allowed Tex to sit on the bed with him and watch the naked girl on the laptop.  Tex liked the girl very much, but he was uncomfortable jerking his cock next to a strange man.  The entire situation was something Cody, in fact, had enjoyed before, but it was slightly unsettling for Tex...slightly unsettling, but also interesting.  Tex went from watching the girl, to just watching Cody.  He couldn't help but be impressed by Cody's amazing physique and his big, throbbing dick.  Tex began sensing Cody may be on the verge of exploding hot cum from his fat boner.  Out of respect, Tex decided to let his new acquaintance finish in peace.  Cody said goodbye, like a gentleman, but silently wrote him off as too square for the party that was already happening when Tex walked in.  It was a shame though, Cody thought.  He wouldn't have minded Tex, being as attractive as he was, sucking on his pulsating cock.  He wouldn't have minded it one bit.  Enjoy!",
  "models": [
    {
      "name": "Cody Cummings",
      "person_id": 6195
    },
    {
      "name": "Tex D",
      "person_id": 34948
    }
  ],
  "release_date": "2015-02-13",
  "scene_id": 71548,
  "series": "CC - 6331 - Cody Cummings & Tex",
  "tags": [
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Huge Dick",
    "Jerking off",
    "Masturbation",
    "Muscular",
    "Pornstar",
    "Tattoo/Piercing"
  ],
  "title": "Just A Visitor"
}