{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Brenner Bolton's day is about to get a lot more complicated. As he unsuspectingly watches tv, Joey Moriarty & Julian Smiles are scoping all his stuff, well past arrears for missed payments. As collection agents, these guys are used to getting what they came for, but in Brenner's case, it appears they'll be cumming for more than just a microwave. Brenner implores Joey to give him more time to settle his debt, to which Joey replies that Brenner will have to give up something in return, and since it's pretty clear Brenner no longer owns anything but his sweet ass, it looks like that will have to do. <br><br> Hip to the routine, Joey and Julian unzip their coveralls in unison and unfurl a pair of waiting cocks that Brenner alternates between, going down to shaft on Joey, then switching over and showing attention to Julian's balls, licking his head and taking him deep into his mouth, as Joey bends him over a recliner, entering from behind as Brenner continues to take care of Julian. Joey pounds away, placing his hands on Brenner's hips and pulling him closer with every thrust, as Julian throws his head back against the recliner and enjoys Brenner's hardworking mouth. They guys switch, and Brenner mounts Julian's cock, bouncing and grinding on top as Joey gags his mouth simultaneously, before finally just putting Brenner between them both and unleashing a shower of cum on their delinquent financier. Brenner, freshly covered has earned his momentary reprieve, and Joey and Julian warn him one more time to pay, threatening him to come back back the next day if he doesn't, which doesn't sound like the worst thing in the world to Brenner.<br><br> Enjoy! ",
  "models": [
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    },
    {
      "name": "Joey Moriarty",
      "person_id": 35535
    },
    {
      "name": "Julian Smiles",
      "person_id": 17772
    }
  ],
  "release_date": "2015-01-15",
  "scene_id": 71587,
  "series": "NDB - 4532 - Joey Moriarty, Julian Smiles & Brenner Bolton",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock",
    "Workers"
  ],
  "title": "Repo Men"
}