{
  "collections": [
    "Next Door Casting"
  ],
  "description": "Scotty is kind of the strong, silent type, the kind of guy who'd rather let his actions do the talking. As he waits for Markie to enter, he doesn't appear nervous, but he also doesn't seem too interested in a lot of banter, either. No matter, some things are better left unsaid, so Markie stands Scotty up and strips him out of his jeans and shirt, and we see Scotty's sculpted back, his beefy ass and his rock solid arms. Markie sees plenty that he can work with, and so he sits Scotty down and begins to lick Scotty's balls, working his way up the shaft to the head as Scotty pushes him back down to the base. Markie gets Scotty slobbered up and hard as nails, and it's obvious from the look in Scotty's eyes that he's ready to go to Pound Town, so Markie mounts his cock, putting his hand on Scotty's chest as he rides him cowboy style, his dick slapping against Scotty's ribcage with each thrust. Ready to seize control, Scotty bends Markie over an office chair as Markie braces himself against the wall. Scotty unleashes his stroke, grabbing Markie by the hips and going hard as Markie closes his eyes and takes every last inch of it, before moving to a side table, where Markie stretches out as Scotty throws his legs over his shoulders and continues to show his skills, his dick growing to maximum density as he prepares to launch his thick load all over Markie, which he does in a torrential shower of cum that Markie chases with a load of his own.Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Scotty B",
      "person_id": 36125
    }
  ],
  "release_date": "2015-05-27",
  "scene_id": 71743,
  "series": "NDC111 - Scotty (Markie More)",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Smooth",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Buddies Casting: Scotty"
}