{
  "collections": [
    "Active Duty"
  ],
  "description": "Things kick off with our troopers on the bed side-by-side as I chat them up and get the latest from them. Then our little sexy man Riley welcomes Jake to the party and gets right down to removing his pants and boxers (Jakes that is) and goes straight for that big delicious dick that he can hardly wait to get in his mouth.  Shea gets his pants off just in time for Jake to take his cock in his mouth. Then Riley looses his pants. Once Jake notices that his pants are gone, he moves right over to put Riley's cock in his mouth.  Shea shifts to his left a little and takes Jake's cock in his mouth and the carousel of cocks continues with this trio making sure each cock gets it's time down some hot, wet throat.Meanwhile Mr. Riley is making his rounds, he wants to taste both cocks and make sure he gets plenty of each as he goes between Jake and Shea, giving both their cocks equal attention.  Shea watches in awe and says how hard it would be to get a girl to suck two cocks like that.  Jake and Riley just laugh.  Jake comments on how damn sexy it is watching Riley suck their cocks like he's doing and Shea grabs Riley's head to push it down on his, showing a little greed.  But wouldn't you be greedy too if you had Riley going down on your cock?  That's what I thought.As this hot trio continues things just heat up more and more. Jake says he hardly knows what do to with himself having so much hotness to choose from.  He asks who is ready to get fucked first and  Shea wastes no time telling him he is ready and willing.  So, Jake bends Shea over the bed and begins plowing into his tight ass, fucking him hard while Riley feeds  Shea his hard cock on the other end.  Shea's hard cock is swinging in the breeze while Jake plows deeper and deeper, it seems Shea's cock gets harder and harder.It's Riley's turn to ride the monster cock and he hops on top to take the massive meat for a long, hard ride while Shea stands up and keeps him mouth busy with dick while Jake keeps his ass full of fat cock.  So hot to watch our sexy boy as he takes a cock at both ends and seems to love it. Next up, Jake takes on both Riley and Shea's cocks and does it with style.  I'll let you watch that sweet ending to a hot threesome yourself without giving it all away for you.  But trust me, you don't want to miss our man Jake getting plowed by Shea and Riley and the hot cumshots that end out a great shoot.",
  "models": [
    {
      "name": "Jake II",
      "person_id": 35239
    },
    {
      "name": "Riley II",
      "person_id": 35356
    },
    {
      "name": "Shea",
      "person_id": 35370
    }
  ],
  "release_date": "2015-01-25",
  "scene_id": 71784,
  "series": "Jake, Riley & Shea",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Gay",
    "Kissing",
    "Muscular",
    "Smooth",
    "Tattoos",
    "Threesome"
  ],
  "title": "Jake, Riley & Shea"
}