{
  "collections": [
    "Next Door Twink"
  ],
  "description": "After a wonderful evening of telling jokes, playing twister, watching the television, and snacking on junk food, friends Tommy White and Andrew Collins finally are feeling tired.  Andrew's folks are out of town for the weekend and the boys thought they'd have a good time.  Tommy's the first to stretch, yawn, and suggest they tuck in for the night.  Andrew agrees, mentioning tomorrow is a whole day of fun, still ahead of them.A good night's rest was just what they needed.  So much so, Andrew awoke to a plump boner in his underwear.  As he squeezes it, feeling the sensual pleasure, he notices his friend Tommy's dick is also hard, and poking out the elastic band of his underwear.  Andrew pulls down his undies and strokes his fat, morning wood.  When Tommy rouses and sees what's going on, he's flabbergasted.  'What in the hell do you think you're doing?!' he asks.  Andrew, with a calm inflection, tells him simply that it's exactly what it looks like.  With not much convincing at all, Tommy moves to Andrew's bed to help him get the nasty, morning boner juice out so the boys can have an enjoyable day together.  Tommy does some good sucking before they switch so Andrew can help Tommy expel his own nasty, distracting goo.  Tommy certainly likes the feeling of Andrew slurping on his swollen cock.  It's not long before Tommy climbs atop Andrew's thick dong and rides it.  Andrew is so happy Tommy is helping him this morning by taking his fat dick in his tight hole.  It's no surprise that these boys were raised with a hard-work ethic.  They're getting the hard job done before they can both go out and enjoy themselves.  Join them to see how it all pays off in the end when they both benefit from some much needed cum blasts.  Enjoy!",
  "models": [
    {
      "name": "Andrew Collins",
      "person_id": 35680
    },
    {
      "name": "Tommy White",
      "person_id": 35681
    }
  ],
  "release_date": "2014-12-31",
  "scene_id": 71828,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Masturbation",
    "Slim",
    "Smooth",
    "Twink"
  ],
  "title": "Morning Wood"
}