{
  "collections": [
    "Next Door Twink"
  ],
  "description": "They're not just roommates, but friends.  Jackson Taylor is a busy college student and Troy Accola is a hard working dude, just trying to make his way.  Jackson's class schedule can be pretty intense, and that means he has to do things quickly around the house to save time wherever he can.  This morning, he kicked Troy out of the bathroom, then ate Troy's last piece of toast on his way out the door.  Needless to say, Troy was bummed.But when Jackson returns home from school, he knows he has making up to do.  That's why he's having a heart-to-heart with Troy.  Telling his friend that he knows he's sacrificed a lot, and endured much shitty behavior, Jackson hopes Troy will forgive.  Well, due to some strategically placed hands, forgiveness turns into hot, jubilant sex!  Troy is so surprised that Jackson is being so sweet and SEXUAL, his dick hardens like a rock.  Jackson is happy to suck Troy's throbbing beast as a way of saying, 'sorry.' And Troy doesn't hesitate to show his forgiveness by returning the favor.  Jackson is so glad that not only is he out of the doghouse, but definitely IN the right spot!  The boys progress from sucking each other's firm cocks, to some rimming, as Troy enjoys tasting Jackson's tender hole.  He gets it just nice and wet enough to slide his large erection right into the warm pocket.  See Troy fuck his good pal, and sincerely apologetic roommate in this hot, fun, sexy encounter.  Enjoy!",
  "models": [
    {
      "name": "Jackson Taylor",
      "person_id": 22461
    },
    {
      "name": "Troy Accola",
      "person_id": 35635
    }
  ],
  "release_date": "2015-01-14",
  "scene_id": 71839,
  "series": "NDT - 8280 - Jackson Taylor & Troy Accola",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "An Unexpected Love"
}