{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Jaxon Colt goes through his chest workout, he steals a glance at his trainer, Silas O'Hara, as Silas helps another member. Studying Silas' ripped abs and charming little smile, Jaxon feels a chubby emerge in his pants, and he looks down to find the head peeking out of his waistband. Oh what he'd do to that man if ever given the chance... Well, today is Jaxon's lucky day, as he decides to throw caution to the wind and let his trainer known how he feels, fearing rejection or even worse, mockery. And it turns out that Silas is actually flattered by Jaxon's advances, and upon contemplation, decides to see what he's been missing staying on the straight and narrow. Immediately he realizes he will not regret this decision, as Jaxon pulls his pants off and wastes no time downing Silas's meaty cock. Silas is hard from anicipation, harder from excitment, but hardest from how well Jaxon sucks a cock. Silas tells him he's even better than his own girlfriend, to which Jaxon responds that he hasn't seen anything yet.With that, Jaxon mounts Silas' rod and begins to grind away, bouncing up and down on Silas' cock as Silas gives his ass a firm spanking, before bending him up against the lockers and pounding him  from behind, then spreading him out on the bench, grabbing both of his legs and giving him the thourough fucking that he's been dreaming of, before coating Jaxon in a straight boy load that will have him fantasizing for weeks and weeks.Enjoy!",
  "models": [
    {
      "name": "Jaxon Colt",
      "person_id": 27717
    },
    {
      "name": "Silas O'Hara",
      "person_id": 17728
    }
  ],
  "release_date": "2015-01-22",
  "scene_id": 71859,
  "series": "NDB - 4533 - Jaxon Colt & Silas O'Hara",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athlete",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Condom",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Gay in Training"
}