{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Trent Ferris and Sam Truitt enjoy laughing and goofing off every chance they get, especially on a lazy day without much else going on.  When Sam asks Trent if he's ever heard of something called a 'Twunk,' Trent takes a guess that it must refer to a Twink who's a bit more muscular than average. Sam asks if he counts as a Twunk, but Trent teases him by saying Sam needs to spend some more time in the gym first. Then Trent tells Sam that their neighbor, Lucas Knight, is a much better example of a 'twunk.' Then, by extreme coincidence, Lucas shows up at their front door!Poor Lucas was caught in the rain while jogging and wants to use Sam and Trent's phone to call for a ride.  Sam can see exactly what Trent was talking about...Lucas is HOT!  The boys use some quick seduction to get Lucas out of his clothes, although he doesn't put up much resistance.  Trent and Sam both go to their knees and share Lucas's firm erection.  Trent sucks hard for a while as Sam moves up Lucas's body and lands on his mouth where the two kiss passionately.  The trio move to the couch where Lucas continues slurping Lucas's knob and Sam goes around for a nice taste of Trent's hole.  It's not long before Sam slides his massive cock into his boyfriend, Sam's, tender ass.  Lucas gets behind Sam and fucks him at the same time, forming a three-man bang chain.  And this rainy-day romp isn't over until Lucas gets a turn slamming Trent's hot pocket too.  What a way to get more familiar with your TWUNK neighbor! Enjoy!",
  "models": [
    {
      "name": "Lucas Knight",
      "person_id": 19957
    },
    {
      "name": "Trent Ferris",
      "person_id": 33181
    },
    {
      "name": "Sam Truitt",
      "person_id": 33496
    }
  ],
  "release_date": "2015-01-28",
  "scene_id": 72045,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Condom",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "What's A Twunk?"
}