{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For Pierce Hartman, it's been a pretty relaxing day so far. As a guest at the beach resort, he's spent his day mostly hanging by the beach, sipping on drinks and taking in the sun and sights. As his afternoon winds down, he decides to head inside and have one more drink at the hotel bar. And even though he's spent the day taking in the sights, it's the natural beauty of the vision in front of him that has him marveling. Arad is the hotel's hunky bartender and Pierce is immediately smitten with him, leaving him a note on his cocktail napkin to come back to Pierce's room. When Arad shows up and enters, Pierce is naked on the bed, cocktail in hand, waiting. Arad begins to unbutton his shirt as Pierce kisses his neck down to his chest, running his hands down to Arad's pants and unbuckling them. Arad strips out of his clothes as Pierce begins to suck him off, Arad pushing Pierce's head down further and further onto his growing shaft. Then they switch, as Pierce lays back on the bed and Arad goes down on him, spitting on the head and tonguing the tip, until Pierce can stand it no longer, begging Arad to fuck him. Arad obliges, entering from behind, and proceeds to give Pierce the boning of his life, fucking him from behind, missionary, and then finally letting Pierce ride him as he strokes his own cock, then dismounting as Arad blows a load all over him, before shooting off his own load as Arad watches.Quite the shot from Arad, who realizes he should have been back at his bar quite some time ago. Pierce, of course, is fully unapologetic to have distracted him!Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Pierce Hartman",
      "person_id": 34911
    }
  ],
  "release_date": "2015-02-12",
  "scene_id": 72066,
  "series": "NDB - 4536 - Arad & Pierce Hartman",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Body-Builder",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Masturbation",
    "Muscular",
    "Oral",
    "Smooth"
  ],
  "title": "Cocktail Seduction"
}