{
  "collections": [
    "Active Duty"
  ],
  "description": "Deanna, Damien and Cash lay back on the bed giggling about how hot the room is about to get. They get naked and Cash dives in to nibble on Deanna's nipples. Deanna returns the pleasure and leans in to suck Cash's huge cock. Cash gets excited over the blowjob and starts to stroke Damien's hunk of meat.The heat is on as Deanna and Damien take turns sucking Cash off. They lick both sides of Cash's stiff staff from the base up to the head and then tangle their tongues at the top. It is an incredible sight to see as Damien shows his hole off for the camera. Deanna tells Damien that they should have a contest to see who can take Cash's cock deepest in their throat. Damien does a pretty good job but Deanna wins and gags it all the down her throat. Then Cash takes control and grabs Damien by the back of his head and shoves his face up and down on his hard shaft.This room is smoking hot and Damien says, 'I want to be the first to ride that cock.' So he climbs on top of Cash and rides his cock wildly. Deanna kisses Cash while he fucks Damien like a mad man! It is easy to see that three are entangled with excitement. As Cash finger fucks Deanna's little pink pussy and slaps Damien's muscular ass, Damien rides Cash's cock and massages Deanna's titties. Cash spreads Deanna's pussy lips and shows the camera inside her pink wet slit. Deanna moans from the finger fucking. The temperature rises as Cash fucks Damien mercilessly.Next, Cash gives Deanna her turn and rolls her over onto her back, and fucks her tight wet hole. It's Damien's turn again. He lays on his side and Cash pounds his steamy hole. Finally, Cash pulls out and Damien jacks out a huge load then rolls over and Cash shoots his enormous load onto Damien's back. Afterward, the satisfied threesome talk about how fucking hot the sex was!",
  "models": [
    {
      "name": "Deanna",
      "person_id": 35837
    },
    {
      "name": "Cash",
      "person_id": 35024
    },
    {
      "name": "Damien",
      "person_id": 35071
    }
  ],
  "release_date": "2010-01-26",
  "scene_id": 72106,
  "series": "Bi Barracks, Vol 4",
  "tags": [
    "Bisexual"
  ],
  "title": "Bi Barracks, Vol 4, Scene #01"
}