{
  "collections": [
    "Active Duty"
  ],
  "description": "Raven asks her man, Dorian, to spice up their sex life by allowing her friends to join in. He ends up on the receiving end of the deal and is 'oh so grateful' that he gave in to her fantasy. They start the fun by getting naked in their hot tub with Raven's horny guy friends, Sky and Kota. Kota asks Sky what he is thinking about and Sexy Sky stands up to reveal that his huge cock is rock hard. Raven smiles, strokes Sky's shaft, and then teases it with her tongue ring. The party is on!</br><br>The horny foursome moves their sex party into the pool house. Dorian lies back on the bed and enjoys Sky's sucking expertise. Raven strokes Kota's throbbing meat as he massages her firm ass while they stand next to the bed watching. Then Kota climbs on board and sticks his dick in Dorian's mouth. The three guys go at it as Raven watches, then she leans in to help Dorian suck off Kota. The sucking continues and there are lots of moaning and slurping noises as Kota deep throats Sky's meat and Dorian tongues Raven's clit. The sucking, licking, rimming and finger fucking get Raven really excited and she tells Sky that she wants him to fuck Dorian immediately. Sky obeys and shoves his hard cock in Dorian's ass. Raven moans, 'Yeah baby, take it', and tells Dorian he can fuck her next.</br><br>After a long session of Dorian's asshole getting pounded by Sky's thick hard cock, Raven climbs up on Dorian and straddles him. She takes a double penetration with Kota behind her and Dorian underneath her. The fucking and sucking continue until Dorian pulls out and sprays his load all over her back! Then Sky moves in to fuck her while Kota licks Dorian's cum off of her back. Sky pulls out quickly and Kota lays his head on Raven's back while Sky shoots his load into Kota's mouth. Finally, Kota fucks Raven and pulls out just in time for Raven to turn over so he could shoot his load all over her tits and face. Dorian tells Raven that he likes her friends!",
  "models": [
    {
      "name": "Dorian",
      "person_id": 35017
    },
    {
      "name": "Kota",
      "person_id": 35835
    },
    {
      "name": "Raven",
      "person_id": 35836
    },
    {
      "name": "Sky",
      "person_id": 35195
    }
  ],
  "release_date": "2010-01-26",
  "scene_id": 72108,
  "series": "Bi Barracks, Vol 4",
  "tags": [
    "Bisexual"
  ],
  "title": "Bi Barracks, Vol 4"
}