{
  "collections": [
    "Active Duty"
  ],
  "description": "From the initial uninhibited crotch rubbing to the final massive sprays of cum, it's obvious that these three have great chemistry. Brock is one muscular piece of beef cake and Chaz is lean and mean with a round sweet ass. The fun begins when Brock lies back on a chair and Regan starts sucking his fat cock. Chaz gets up next to Brock and sticks his big rod in Brock's mouth. All three are moaning with pleasure and can't seem to get enough of each other.</br></br>Off goes Regan's bikini top and Brock grabs her big tits with both hands. Chaz fucks Brock's face then climbs down between Brock's legs and pays him back. The fun and fury continue as Brock licks and plays with Regan's little pink pussy. All the while, Chaz gags down Brock's hard cock, licks his swollen balls and fingers his tight asshole.</br></br>Regan leans over the back of the chair and shows off her luscious ass. Brock can't resist so he shoves his face between her ass cheeks and slurps her crack up, down and all around. Chaz dives into Brock's ass and his tongue flickers madly back and forth across Brock's hole. After some lickin' and finger fuckin' from Brock, Regan straddles Brock's cock and rides it like a wild stallion. Brock opens his mouth wide and Chaz fucks his face mercilessly. You can tell that the heat is turned up all the way because Brock starts to fucks Regan wildly and Chaz feverishly slams his cock in and out of Brock's mouth.</br></br>Chaz takes Brock by the back of the neck and jams his cock down Brock's throat just before he rams it in Brock's tight ass. Chaz fucks Brock's manhole while Brock fucks Regan's dripping wet pussy with a huge dildo. The pumping intensifies and the moaning becomes louder. Chaz screams that he is gonna cum, pulls his pulsing shaft out and shoots his fat white load all over Brock's ass. Brock gets up and jacks off and sprays a huge load all over Regan while she moans as she rubs her clit and gets off too.",
  "models": [
    {
      "name": "Brock",
      "person_id": 35048
    },
    {
      "name": "Chaz",
      "person_id": 35019
    },
    {
      "name": "Regan",
      "person_id": 35847
    }
  ],
  "release_date": "2009-11-10",
  "scene_id": 72102,
  "series": "Bi Barracks, Vol 3",
  "tags": [
    "Bisexual"
  ],
  "title": "Bi Barracks, Vol 3"
}