{
  "collections": [
    "Active Duty"
  ],
  "description": "Elijah, shirtless and sporting a ripped 6 pack, and super sexy Randy are playing pool and talking about a girl that's coming over. Annie, an exotic hottie, walks in and asks what the winner gets.They look at each other and decide to quit playing with pool balls and get down to the real thing. Annie starts to kiss them one at a time with her big soft lips and they massage her inner muscular thighs. Randy smacks her bouncy bootie when she bends over to suck on Eli's nipples, then reaches over and rubs her clit through her white lacey panties. They undress quickly and the sucking begins. Annie sits on the edge of the couch with both of their hard cocks in her face.She deep throats them one at a time, giving them equal attention. They stand her up and take off her skirt and panties, rubbing her pussy and licking and grabbing her ample ass. She lays back and sucks Randy's big hard cock while Eli eats her sweet pink. Eli stands up and Randy starts to suck him. Annie teases Randy by telling him to try to do better than she does. Eli tells Annie that the better she sucks Randy's dick the better Randy sucks his.Annie climbs on top of Randy and rides him hard, her ample ass bouncing up and down as she rides his massive shaft. Randy fucks her hard as she deep throats Eli and she giggles as Eli says, 'Fuck yeah, this is the life.' Randy looks at Eli and sends him a signal to hop on top. Eli complies and rides Randy's cock moaning with pleasure and pain. Eli's rod hardens as he bounces up and down on Randy's cock, shoving his own cock in and out of Annie's mouth. The fucking and sucking continue until Randy pulls out of Eli's ass and shoots his load on Eli's back while Eli fucks Annie. Eli slaps her ass as he pounds her hard then pulls out and shoots his huge load all over her back and down her ass crack. They end with a passionate 3-way French kiss.",
  "models": [
    {
      "name": "Annie",
      "person_id": 35845
    },
    {
      "name": "Elijah II",
      "person_id": 35841
    },
    {
      "name": "Randy",
      "person_id": 35130
    }
  ],
  "release_date": "2009-11-10",
  "scene_id": 72101,
  "series": "Bi Barracks, Vol 3",
  "tags": [
    "Bisexual"
  ],
  "title": "Bi Barracks, Vol 3, Scene #01"
}