{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As gym member Ashton Webber goes through his chest routine, he decides to push himself and loads a pretty hefty chunk of weight for his reps. Midway through, it's pretty clear he could use a spotter.For trainer Silas O'Hara, it's deja vu all over again, as he immediately has flashbacks to the week prior, where he decided to fool around with one of his clients for the first time. Having never engaged with a man before, it's all Silas can think about now, and so he finds himself snapping out of his day dream to find Ashton struggling underneath the bar and in need of his help. He rushes over and encourages Ashton to finish his set, as Ashton tries not to be distracted by the growing bulge in Silas' shorts. Finishing his lift, Silas catches Ashton eying his package and realizes his client still needs some further attention. Immediately, Silas pulls down his shorts and shoves his cock into Ashton's waiting mouth, who has no trouble dealing with this weight, taking it all the way down his throat as Silas holds onto the bar and crouches over him. Fully erect after Ashton's lip service, Silas returns the favor and shoves Ashton against a wall, ripping his shorts down as his thick meaty cock spills out into Silas' mouth. Silas tongues the tip of Ashton's cock, teasing him for just a moment before diving in face first, gobbling up Ashton as he runs his hands up Ashton's chest. Ashton is more than ready for some trained, hot cock, so he bends over on the bench and grabs the bar as Silas penetrates him from behind. Ashton moans as Silas pounds away, switching positions until Silas is ready to burst, cumming all over Ashton's face as Ashton squirts his load on his chest. Wiping himself clean, Silas realizes that this is one fringe benefit he could start getting used to.Enjoy!",
  "models": [
    {
      "name": "Ashton Webber",
      "person_id": 31805
    },
    {
      "name": "Silas O'Hara",
      "person_id": 17728
    }
  ],
  "release_date": "2015-02-19",
  "scene_id": 72387,
  "series": "NDB - 4537 - Silas O'Hara & Ashton Webber",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock Strap",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Gay In Training Part 2"
}