{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Word is spreading quickly about the masseur at Next Door Spa, as the hunky Arad keeps gaining more and more word of mouth advertising. The phones have been ringing off the hook and Arad is keeping himself pretty busy. Today is no different, as Arad has an appointment with a first timer who has been recommended to the spa. Owen Michaels has heard good things but he's unsure quite what to expect.</br></br> Not to worry. Arad's bedside manner is impeccable, as he lays Owen out and begins a deep sensual massage. Owen could almost fall asleep, that is if his cock wasn't swelling into a raging hard-on. Arad senses this, then flips Owen over to examine his growing appreciation. Owen is a bit nervous, but is quickly assuaged by Arad's delicate touch, and when Arad wraps his lips around the tip of Owen's cock and sucks lightly,  Owen decides to close his eyes and let whatever follows happen. What commences is Arad sucking Owen off until he's nice and hard, flipping him over and eating his ass from behind as Owen holds onto the sides of the massage table, before Arad takes out his cock and plunges it deep into Owen's waiting ass, easing it in at first, and then increasingly harder and harder, as Owen begins to see what all the fuss is about. Owen mounts Arad and rides his fat cock, grinding on him as he lay back on the table, until he's ready to bust his pent up load, which he does all over Arad as the masseur continues to pound away, pulling out and blasting his client with his own well earned load.  As Owen towels himself off, he asks Arad for his future availability. Looks like another return client Arad can add to his books.</br></br> Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Owen Michaels",
      "person_id": 34514
    }
  ],
  "release_date": "2015-02-26",
  "scene_id": 72526,
  "series": "NDB - 4538 - Arad & Owen Michaels",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Greek Massage Part 2"
}