{
  "collections": [
    "Next Door Originals"
  ],
  "description": "For bros Derrick Dime and Jacob Ladder, anticipation is killing them. Waiting for their twink to arrive, they've rigged the room with several cameras to film their unsuspecting bottom, and now all that's left is waiting for the sound of the door.When the bell rings, Derrick snaps into action, bolting for the door to find supple and dirty cockpig Tyler Morgan waiting. The guys bring him in and waste no time stripping him down to his bare essentials, and immediately have him down on his knees, sucking off both of them as they pass their camera back and forth. Tyler swordfights like a champ as Derrick pulls his hair and Jacob shoves his cock down Tyler's throat. Derrick decides he's ready to take that ass, so he props Tyler onto the bed, face down, ass up and begins pounding him, while Tyler continues to suck Jacob off. Jacob's hard on grows uncontrollable and he's ready for his turn but all of a sudden Derrick is in no sharing mood, and tells his friend to get bent. Jacob storms off in a huff, leaving Derrick and Tyler alone, where Derrick really decides to put Tyler through his paces: turning him over and fucking him missionary, then flipping him back over and pounding him out before nutting all over Tyler's kinky little face, leaving him the video as a well earned souvenir.Enjoy!",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Jacob Ladder",
      "person_id": 35874
    },
    {
      "name": "Tyler Morgan",
      "person_id": 31264
    }
  ],
  "release_date": "2015-03-06",
  "scene_id": 72806,
  "series": "NDO - 4540p - Derrick Dime, Jacob Ladder, Tyler Morgan",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Deep throat",
    "Hardcore",
    "Oral",
    "P.O.V.",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Twink",
    "Uncut cock"
  ],
  "title": "POV Plaything"
}