{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Tyler Morgan could be in some real trouble.  Geometry is kicking his ass!  And coach has decided to kick him AND his cheer team partner, Derrick Dime, off the squad if Tyler doesn't pass their next exam.  Fortunately, Derrick is a whiz in math, and an excellent tutor.As Derrick tries yet again to explain a concept to Tyler, he's struck with a genius idea.  He tells Tyler to imagine everything in relation to Tyler's dick!  But Tyler can't quite visualize this because he's never measured his dick.  That's ok, Derrick is here to help.  Tyler pulls his pants down and goes to measure, but Derrick stops him, and explains he needs to measure it when it's hard.  Derrick decides to help his teammate even further by assisting in stiffening Tyler's cock.  It doesn't take much but some gentle tugging to get Tyler's dick quickly hardened.  Derrick laughs at how much he can tell Tyler likes this.  He tells Tyler he wants a reward for all this help.  Tyler has no problem with this, and goes to his knees, pulling down Derrick's underwear to reveal a huge, gorgeous cock.  He sucks it deep for Derrick.  After some passionate slurping, Derrick stands Tyler up and slides his meaty erection into Tyler's tight, Twink hole.  He pounds Tyler nice and hard, making sure to fuck him well so Tyler will have a good idea of just how long an 8 inch dick is.  Sometimes to make the great, you've gotta take drastic measures!Enjoy!",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Tyler Morgan",
      "person_id": 31264
    }
  ],
  "release_date": "2015-03-11",
  "scene_id": 72809,
  "series": "NDT - 8288 - JOT - Derrick Dime & Tyler Morgan",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Slim",
    "Twink"
  ],
  "title": "Drastic Measures"
}