{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Good friends Mark Long and Brandon Moore are returning from a messy game out on the pitch, and their clothes show it. Muddy and sweaty, and not wanting to track a mess all over the house, Brandon tells Mark they've got to strip down before they can sit anywhere. Mark seems a bit incredulous, and also a bit worried of Brandon's motives, but he figures it's no big deal and comes out of his skivvies. <br/>Moments later, Brandon can tell Mark is visibly cold, and in need of a warm up. Resorting to a tried and true method, Brandon nudges Mark's leg in a suggestive gesture, and moments later he's sucking off his friend right there on the couch. Mark is hesitant at first, but he figures what the hell, and besides, Brandon's mouth feels absolutely amazing, so Mark decides to throw his head back and enjoy it.<br/><br/>Brandon takes the opportunity to live out his fantasy with his straight friend, and begins downing his giant cock, choking on it down to the base of the shaft and then spitting and working the head until Mark can no longer hold out. Mark turns Brandon over on his back and begins to pump him full of hot hard cock, as Brandon closes his eyes and absorbs every deep inch of Mark's pounding thrusts. The two guys switch and Mark lets Brandon ride his cock, which Brandon does enthusiatically, grinding on Mark's pelvis as his own hard dick flops against his stomach in a rhythmic cadence, until he takes hold of his dick and lets fly a massive load all over his living room, before getting down on his knees and taking Mark's hot load straight to the face. Looks like they made a mess afterall.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Brandon Moore",
      "person_id": 35927
    },
    {
      "name": "Mark Long",
      "person_id": 18862
    }
  ],
  "release_date": "2015-03-12",
  "scene_id": 72905,
  "series": "NDB - 4541 - Mark Long & Brandon Moore",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Dirty Load"
}