{
  "collections": [
    "Active Duty"
  ],
  "description": "Niko and Sawyer show no mercy on each other as they go to town on every inch of each other's muscular forms. They start with their lips, sucking face and getting each other's nips all perked up. Niko's roaming mouth goes south to Sawyer's throbbing hard-on that's just waiting to be teased. Sawyer's a cock-hungry hunk himself and it isn't long before he wants a boner of his own to suck on. It's an endless battle for dominance as they switch back and forth, each one wanting what the other's packing.'Let me see that ass, baby' Niko moans, and gets Sawyer face-down rump-up for a sensuous tonguing, his fingers stretching Sawyer's hole giving us a perfect view. With all the pumping Niko's doing on his own dong, you'd think he's priming himself to stick it in, but this flip-flop is just beginning!! Next it's Niko who's rearing his perky hole to the camera, and it isn't until Sawyer's stuck just about his whole thumb down that hole that the guys switch things up.So who gets to fuck who first? Well you can tell from the tattoos on the chest peeking out behind those sturdy, shapely ass and legs that it's Sawyer taking a cock up his ass, as Niko delivers steady thrusts right up Sawyer's asshole. Niko even pauses mid-fuck to give Sawyer's cock and mouth some much appreciated attention.But Sawyer wasn't satisfied with just being blown, or just being rimmed, and he wouldn't be satisfied with just getting fucked either. This is a true flip-flop with full reciprocation from both guys, and neither are gonna stop until Sawyer's had his turn on top too. Sawyer's got a huge grin on his face as he makes burly boy Niko his bottom bitch until they're both ready to blow from all that mutual satisfaction!",
  "models": [
    {
      "name": "Sawyer",
      "person_id": 35300
    },
    {
      "name": "Niko",
      "person_id": 35371
    }
  ],
  "release_date": "2015-03-08",
  "scene_id": 72952,
  "series": "Niko & Sawyer",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Kissing",
    "Muscular",
    "Rim",
    "Rimming",
    "Smooth",
    "Tattoos",
    "White Butt"
  ],
  "title": "Niko & Sawyer, Scene #01"
}