{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Cat burglars Jordan and Lucas Knight have found themselves a pretty nice mark to case out, and they are all set to make their move. Discussing an entrance strategy, they are surprised by security guard Justin Star, who is just out making his daily rounds. Justin suspects that the two guys are up to no good so he takes them back to his 'office' Upon arrival, the would-be burglars discover that Justin doesn't have an office, just an old men's room with a bench and a stall. Justin sits back on the bench and gives them an expectant look.  'What are we supposed to do?' Jordan asks, to which Officer Star just answers with a look. With that, the two robbers reluctantly continue their cover as lovers, and Officer Star sits back and takes it all in. Jordan starts by dropping to his knees, taking Lucas' cock into his mouth and beginning to suck it. Lucas is surprised by his unintentional hard on, but decides to go with it, and the next thing he knows, he's on his kness, sucking off not only his cohort, but also the security guard as well, who has decided that watching is only half as much fun as participating. With that, both Jordan and Justin take turns pounding Lucas' sweet ass, as Lucas' giant cock bobs up and down. Fucked three or four different ways, Lucas is ready to explode, riding Jordan while Justin watches, and he launches an epic cumshot sprays the 'office' before taking both of the other guys' loads as they cum all over him.Once satisfied, Officer Star returns to his shift, and our two criminals get a firsthand lesson to the potential pratfalls of a life of crime. Enjoy!",
  "models": [
    {
      "name": "Lucas Knight",
      "person_id": 19957
    },
    {
      "name": "Jordan A",
      "person_id": 35977
    },
    {
      "name": "Justin Star",
      "person_id": 36115
    }
  ],
  "release_date": "2015-04-30",
  "scene_id": 72991,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bald",
    "Brunette",
    "Climax",
    "Facial",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Red Head",
    "Slim",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock",
    "Uniform"
  ],
  "title": "BUSTED!"
}