{
  "collections": [
    "Next Door Twink"
  ],
  "description": "When Kevin Summers becomes concerned about his increasingly looser asshole, he seeks professional help.  Dr. Jaxton Wheeler is the city's most revered proctologist and specializes in examining and diagnosing problems with specifically Twink holes.  By his side always is Johnny Torque, R.N.The examination, which involves Dr. Wheeler's fingers making their way inside Kevin's hole, leads, after a while, to a deeper investigation.  Dr. Wheeler first has Keven help out by sucking Dr. Wheeler's cock.Once it becomes hard, Dr. Wheeler slides it into Kevin's sweet hole in order to achieve a better diagnosis.  After some good, medium fucking, Dr. Wheeler finds it necessary to call in Nurse Torque, as he's very well equipped to deal with Kevin's type of situation.  Nurse Torque is able to really pound Kevin's hole hard, a procedure that inspires hope among the three that there may be a solution to Kevin's Hungry Asshole Syndrome.Kevin continues sucking Dr. Wheeler's swollen dick, as this often helps the process, having a nice firm erection in both ends.  Along the way, Dr. Wheeler sees that Kevin's cock needs attention while his ass is slammed.  He goes in and takes Kevin's ample cock in his mouth and sucks it deeply.Watch this very professional, by-the-book clinical procedure, and find out if this medical technique was effective for Kevin's Hungry Asshole.",
  "models": [
    {
      "name": "Jaxton Wheeler",
      "person_id": 36037
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Kevin Summers",
      "person_id": 36036
    }
  ],
  "release_date": "2015-03-25",
  "scene_id": 73035,
  "series": "NDT - 8289 - Jaxton Wheeler, Kevin Summers & Johnny Torque",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bear",
    "Beefy",
    "Big Loads",
    "Brunette",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "Doctors' Double Dose"
}