{
  "collections": [
    "Cody Cummings"
  ],
  "description": "It's a special treat Alessandro Del Torro will never forget.  Ryan has prepared him for a surprise to arrive at their home.  To Alessandro's chagrin, in walks Cody Cummings, accompanied by his sexy assistant, Tyler Morgan.The service Ryan has ordered is a very intimate class on perfoming top-notch fellatio.  Cody, as a performer in the adult industry, has formulated a cirriculum that implements sure-fire strategies for giving the best head.  And he's brought along a few toys that will allow Cody to most effectively illustrate certain methods of sucking a hard cock.After some background about Cody himself, the four get right down to work.  Ryan begins by taking out the blazing hot Alessandro's large dick.  As he works the swollen knob with his mouth, Cody get right in there, showing Ryan on the toys exactly the most effective ways of slurping, bobbing, twisting, licking, and nibbling.  High on Cody's list of important things to do while RECEIVING a blowjob, is communicating.  Cody advocates letting the giver know what's working and what's not.  When Cody feels the time is right, he instructs his assistant, Tyler, to suck his swelling cock.  Tyler goes right into his routine, without wasting any time.  Cody tells Ryan to observe the interplay between giver and receiver.  With rubber dick still in hand, Cody tells Ryan to focus on the underside of the erect meat.  As he explains, this can be a VERY sensitive zone.  Grab your own accessories and feel free to follow along at home.  Whether you're looking to improve your own 'head game,' or just watch these incredibly sexy men suck each other, get comfortable and enjoy!",
  "models": [
    {
      "name": "Cody Cummings",
      "person_id": 6195
    },
    {
      "name": "Tyler Morgan",
      "person_id": 31264
    },
    {
      "name": "Alessandro Del Torro",
      "person_id": 36049
    },
    {
      "name": "Ryan B",
      "person_id": 36054
    }
  ],
  "release_date": "2015-03-27",
  "scene_id": 73148,
  "series": "CC - 6340 - Cody Cummings, Tyler Morgan, Ryan & Alessandro Del Torro",
  "tags": [
    "Amateur",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Pornstar",
    "Slim",
    "Tattoo/Piercing",
    "Toys"
  ],
  "title": "Oral Instruction"
}