{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Colt Rivers loves having a big sister. Beyond the family bond and the close knit relationship, there are other fringe benefits as well. Chiefly, Colt makes it a habit to try and scam all of her hunky boyfriends, so when she calls and tells him she's running late to meet her latest beau, Jeremiah Dean, Colt's eyebrows perk up and he begins to contemplate a strategy. If everything goes right, Colt plans on testing out Jeremiah's wares before sis and family even get home for dinner. This is, of course, something he's done before, so when Jeremiah knocks on the door, Colt already has the wheels in motion, but he's thrown for a loop when he answers the door. Jeremiah is a little different from most of his sister's boyfriends, but that doesn't dissuade Colt. Quite the opposite. He takes one look at Jeremiah's long, lean build, and immediately begins fantasizing about his cock. Jeremiah, to his credit, is eager to endear himself to his girlfriend's family, so when Colt challenges his prowess, he obliges and shows Colt what he's working with.Now having seen the goods, Colt is more determined than ever to test them out, so he drops to his knees and begins working on Jeremiah's hard-on. Jeremiah instantly realizes that Colt is more of a go-getter than his sister, deep throating his cock without hesitation. Ready to keep it in the family, Jeremiah bends Colt over the kitchen table and fills him 8' of hard cock, as Colt closes his eyes and enjoys every pounding inch. Jeremiah thrusts away as Colt holds on for dear life, before switching up and mounting Jeremiah, grinding on his cock as his Colt's ass slaps against Jeremiah's chest, before Jeremiah flips Colt over onto his back, pounding away at him missionary as Colt loses his load all over himself, then falls to his knees where Jeremiah unloads his batch down Colt's waiting throat, just as his sister's car can be seen in the distance, coming up the hill for dinner.Enjoy!",
  "models": [
    {
      "name": "Colt Rivers",
      "person_id": 34306
    },
    {
      "name": "Jeremiah Dean",
      "person_id": 36102
    }
  ],
  "release_date": "2015-04-03",
  "scene_id": 73256,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Black",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hairy",
    "Interracial",
    "Rimming",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Guess Who's Cumming?"
}