{
  "collections": [
    "Next Door Originals"
  ],
  "description": "He sits there, stroking his massive cock.  Lucas Knight is enjoying a sunny afternoon breeze while relaxing on a quaint, old wooden bench in the garden.  These grounds have their share of luscious boners being tugged.  The peaceful atmosphere has inspired other men to indulge themselves too.  And as Lucas's imagination makes sensuous images dance in his head, Max King watches from the guest cottage.  Max is also a guest at the retreat.  Lucas hadn't seen him before they're eyes had now locked.  Max pulls out his own pulsating erection and jacks it fervently, still with his eyes fixed on Lucas and his incredible cock.  Max shows his ass from across the grass-covered distance.  Lucas knows this signal.  He gets up from the bench and goes toward the cottage.Lucas finds Max nude, laying on a bed.  Without much hesitation, Lucas walks over and allows Max to take his cock in his mouth.  He sucks deep and passionately.  Lucas enjoys the friendly warmth.  Soon they're 69ing.  The intensity builds until Lucas decides he must put his throbbing dong inside this irresistibly sexy man's ass.  Max takes all of Lucas's size and girth.  Lucas lets the pace build until Max is being pounded very hard.  After a while, they switch things up so Max have a bouncy ride on top of Lucas.  You won't believe the explosive energy these two insatiable, firing hot men generate together.  ENJOY!",
  "models": [
    {
      "name": "Lucas Knight",
      "person_id": 19957
    },
    {
      "name": "Max King",
      "person_id": 36067
    }
  ],
  "release_date": "2015-04-10",
  "scene_id": 73397,
  "series": "NDO - 4550 - Lucas Knight & Max King",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Climax",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Latino",
    "Masturbation",
    "Oral",
    "Uncut cock"
  ],
  "title": "The Exhibitionist"
}