{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Markie More is feeling a little mischievous and in the mood for something different. As he peruses his favorite health magazine, he happens across an ad for long deep tissue massage and figures that might satisfy so he calls the listing. Mark Long is a pro, and one of the best in his field, so when Markie calls, he doesn't think much of it, but as the young blonde stud is laid out on Mark's massage table, he realizes he's underestimated his level of enthusiasm. Immediately he begins rubbing Markie down, sponging him off and lavishing him with aromatic oils, rubbing his shoulders and down the small of his back, teasing Markie's covered ass, and then flipping him over and working on his chest. As he rubs away, Markie gets a little stiff beneathe the towel, so Mark indulges himself with a peek, and then a delicate touch. Markie seems responsive, so Mark continues, gripping Markie's cock as it hardens in his palm, then working it back and forth, before abandoning pretense and coming out of his own clothes. Standing naked in front of him, Markie takes Mark's long cock deep down his throat, as it thickens up in his mouth. Mark face fucks Markie while holding the back of his head, but Markie is looking for Mark to go even deeper, so he bends Markie over and plunges deep inside him, pounding him over the massage table as Markie's  eyes roll back in his head. He mounts Mark and begins to ride him, losing his load as Mark pulls out and blasts him in the face with his hot load.Not exactly the happy ending Markie was expecting, but a satisfying conclusion, nonetheless.Enjoy!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2015-04-24",
  "scene_id": 73458,
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "The Long Massage"
}