{
  "collections": [
    "Next Door Originals"
  ],
  "description": "In the Army, authority MUST be respected.  Pierce Hartman and his boyfriend, Colt Rivers, are learning that first hand.<br><br>Pierce was a minor leage basketball player, just shy of making the pros.  Now he and Colt have joined the Army to find a new path and start a new journey.  After settling into their bunks, Colt wants to fool around.  Pierce agrees, but wants to make it quick so they can make it to their first assembly meeting.  As they pleasure each other orally, Seargent Johnny Torque happens upon them.  He doesn't make a sound as he watches suck their fat, swollen dicks.  In fact, Seargent Torque likes the promise he sees in these new cadets.  He takes out his dick from his hidden position and strokes, still silent.  <br><br>When the time is right, Johnny pops out from behind his curtain, startling Colt and Pierce.  They stand at attention for a moment before Johnny tells them to continue as they were.  He positions himself to dip his firm cock into Colt's mouth while Pierce licks Colt's tight butthole.  After some of this, Seargent Torque orders Pierce to fuck Colt's ass.  They follow orders right away, and Pierce slides his massive dick into Colt's warm hole.  Colt takes the solid walloping and takes Johnny's boner into his mouth at the same time. <br><br> Then Seargent Torque gets underneath Colt so he can have a go at slamming this new private.  Join this military welcome session as a couple of new recruits get a taste of action from all fronts!",
  "models": [
    {
      "name": "Colt Rivers",
      "person_id": 34306
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Pierce Hartman",
      "person_id": 34911
    }
  ],
  "release_date": "2015-04-17",
  "scene_id": 73699,
  "series": "NDO - 4552 - Pierce Harman, Colt Rivers & Johnny Torque",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Military",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Private Matters"
}