{
  "collections": [
    "Cody Cummings"
  ],
  "description": "Cody Cummings is certainly someone who encourages couples to try new things.  Cody knows that testing your limits can lead to new realms of pleasure.  Upon meeting up with Markie More in Markie's hotel room, Cody discovers that a very attractive female is waiting for him anxiously.Cody has come by to see how he and Markie mesh and to get a feel for how they'll work together.  Markie brought along his new girlfriend, Lola Castillo.  Lola is a total freak who enjoys watching her man suck fat, hard dicks.  She's seen Cody's work and can't wait to see Markie wrap his mouth around Cody's illustrious cock.  But something more than just the trial blowjob  begins to develop once Cody arrives.  There is MAJOR chemistry between Lola and Cody.  Markie can even sense it and is becoming quite jealous.  When Markie dips out to take a quick shower before sucking Cody, Lola and Cody get VERY friendly.  Markie comes back and he and Cody get down to business.  Lola watches as Markie slurps Cody's enormous erection.  She's turned on as Cody's incredible physique moves rhythmically while Markie licks Cody's hole.  Seeing these two chiseled, male specimens enjoy each other is almost too much for Lola.  Before Cody leaves, she finds another moment to be alone with the Next Door STallion.  She feels his still-pulsating dick with her hands.  She lets Cody look at her ass underneath her skirt.  And she gives Cody her number...TO BE CONTINUED!",
  "models": [
    {
      "name": "Lola Castillo",
      "person_id": 36202
    },
    {
      "name": "Cody Cummings",
      "person_id": 6195
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2015-04-03",
  "scene_id": 73833,
  "tags": [
    "Amateur",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Pornstar",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Path of Seduction"
}