{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Masseur Brenner Bolton is having an auspicious start to his day. Already stranded by car troubles, he's called a ride share to get him to his client, only it turns out his card has been declined. Nuber driver Mark Long isn't really trying to hear Brenner's excuses, so when Brenner's client cancels mid-ride, stranding Mr. Magic Hands without any cash, Mark is inclined to just pull over and let Brenner out to deal with his own problems. Brenner is between a rock and Mark's hard place, and Mark knows it, so rather than strand Brenner out in the middle of nowhere, he devises a plan to trade services, promising to get Brenner where-ever he needs to go in exchange for some personal handling. Brenner is skeptical, but has no other viable option, so he moves up front and applies his patented technique to Mark's hard cock.Brenner's hands feel good, but Mark is more interested in his mouth, and so Brenner begins to suck Mark off as the car barrels down the road. Finding a nice place to pull over, Mark makes one final offer to Brenner: ass for gas, and pulls his ride over in a nice secluded spot. Once stopped, Mark presses Brenner up agianst the side of his van, plunging his massive cock deep within Brenner's ass, filling him with a fuel injected rod and pounding away at him from behind, before flipping him over and grabbing his hips, pulling him closer as he thrusts away, and finally, reclining in the open door bed of the back seat as Brenner mounts and rides Mark's cock to a cum-shooting conclusion, as Mark pulls out and blasts his face with his load, before riding his new friend right back to where he started from. Well, Brenner, tomorrow is whole 'nother day.Enjoy!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    }
  ],
  "release_date": "2015-04-23",
  "scene_id": 73868,
  "series": "NDB - 4553 - Marc Long & Brenner Bolton",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Condom",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Tattoo/Piercing"
  ],
  "title": "Naughty Ride Share"
}