{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Brenner Bolton cleans himself up in his hotel room, he sends off a few nervous texts to a friend. Brenner has plans to check out the resort's bath house, but he's never been so he's pretty anxious as far as what to expect.And even after the welcoming tour from the host, Brenner still feels a bit weary about his surroundings as he begins to undress. Sliding off his shorts by his locker, he has attracted an audience, as Max Sargent, a long-time patron of this establishment, eyes the incoming new meat. Sizing up Brenner's shapely ass, Max sits on a bench and opens his towel to reveal a thick, raging hard-on, which he begins stroking in Brenner's presence. Brenner, unsure how he should feel, is visually nervous.'First time?' Max asks him.'Is it that obvious?' Brenner replies.Hearing this, Max stands and moves closer to Brenner, coaxing him to relax, as he runs his hand down Brenner's back side and squeezes his sweet ass. Max falls to his knees and begins sucking Brenner off, right there in front of the lockers, before laying back down on the bench as Brenner returns the favor. With his cock at maximum density, Max turns Brenner around, pressing up against a wall as he begins to eat his ass, moistening up Brenner's hole for what follows.Max plunges his cock deep inside Brenner as the noob lets out a whimper as it penetrates, and Max proceeds to prod and pound Brenner from behind, then moving to missionary as Brenner begins to stroke his cock in time to Max's thrusts. Switching one more time, Brenner mounts the stranger and strokes himself off as Max continues to pound away, fucking the cum right out of Brenner as he grinds on Max's thick rod. Max pulls out and douses Brenner's face with a hot sticky load, and as Brenner licks his lips with a satisfied look on his face, he wonders why he didn't try this sooner.Enjoy!",
  "models": [
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    },
    {
      "name": "Max Sargent",
      "person_id": 36238
    }
  ],
  "release_date": "2015-05-01",
  "scene_id": 73875,
  "series": "NDO - 4556 - Max Sargent & Brenner Bolton",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Mature",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "My First Bathhouse"
}