{
  "collections": [
    "Cody Cummings"
  ],
  "description": "Here our tale of trickery and seduction culminates in a rich, creamy eruption of intense passion.  As Markie More and his girlfriend, Lola Castillo, hang out at the hotel gym, Cody Cummings is en route to rendezvous with Lola.  Markie doesn't know that she and Cody already hooked up while Markie was distracted the day before.  Cody got one taste of Lola and couldn't resist coming back for more.  He knows Markie would probably flip out if he caught the two of them together.  This time, Lola makes a very risky move, going up to meet Cody in the room while Markie finishes up his workout.  Lola and Cody have only planned a quickie.  As they're just getting down to some hot action, Markie bursts in the room, catching them nude, Cody laying on top of Lola, Lola with her stomach down on the bed.  Markie sees that Cody's huge, throbbing cock was just about to enter his girlfriend.  Markie and Cody did a practice, run-through blowjob a couple days prior, so Markie knows the incredible effect Cody's dick can have.  Now Markie confronts Lola, right there with Cody standing completely naked, only feet from them both.  She expresses that this IS in fact what she wants...to mess around sometimes with other men.  And Markie knows that means she'd like Markie to join in.  Markie rips his shirt off and acquiesces, telling her if that's what she wants, then she can have just that.  Markie tells Cody to jump in and Cody does.  He gets behind Lola as she begins sucking Markie's already hard cock.  Cody licks her as he watches her work Markie's firm dick.  They switch things up so Markie can taste Cody's dick again, this time while it slides around on Lola's ass.  Later, Markie tells Lola to take out their toy, and she does.  She works a large dildo into Markie's ass while he continues to enjoy Cody's mammoth erection.  Then, Lola is positioned in the middle of the men for an incredible finale, three amazing encounters in the making.ENJOY!",
  "models": [
    {
      "name": "Lola Castillo",
      "person_id": 36202
    },
    {
      "name": "Cody Cummings",
      "person_id": 6195
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2015-04-24",
  "scene_id": 73914,
  "tags": [
    "Amateur",
    "Ass Play",
    "Big Dick",
    "Big Tits",
    "Bisexual",
    "Brunette",
    "Condom",
    "Deep throat",
    "Hardcore",
    "Oral",
    "Pornstar",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome",
    "Toys"
  ],
  "title": "Path of Seduction Part Three"
}