{
  "collections": [
    "Next Door Casting"
  ],
  "description": "Markie More has a special candidate lined up for this week's casting call. Paul Canon is a young, energetic stud from Colorado by way of Flordia, and this former surfer turned snow-boarder is more than happy to escape the winter doldrums of the Midwest and bum around the west coast for a bit. Markie is more than happy to accommodate him, as Paul also brings a versatile willingness to do anything (not to mention a positively rockin' bod and a sick head of hair). The chemistry between the two is apparent from the jump, and only gets better as the clothes come flying off. Paul thickens right up as Markie goes down on him, gagging on his rod as he tongue's Paul's shaft from base to tip. Paul eagerly returns the favor, sucking Markie off with polished form, until Markie is piqued and ready for Paul's cannon. Markie mounts Paul as the young stud reclines in a chair, and Markie rides his long cock up and down as Paul gives his ass a hearty smack. Paul bends him over and pounds Markie from behind until he's almost out of energy, and then they switch, and it's Markie's turn do the pounding, pile driving Paul as he balances on his shoulders, his hard cock inverted inches above his face as Markie pounds him to orgasm, which he sprays all over his own face, before Markie pulls out and wets him down with even more cum, dousing his chest with a nice healthy load that Paul rubs into his skin. Afterwards, Markie is thoroughly convinced that Paul has what it takes to come back, but it's not up to him. Does Paul earn your vote? You decide.Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Paul Canon",
      "person_id": 36900
    }
  ],
  "release_date": "2015-04-29",
  "scene_id": 74108,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Buddies Casting: Paul Canon"
}