{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Maybe Kevin Summers is still adjusting to being in a new home, part of a new family.  Or maybe his bad attitude is due to the strict nature by which his new stepbrother, Johnny Torque, treats him.Today, Johnny happened to be walking by Kevin's room when he noticed, through the cracked door, that Kevin STILL had not tidied up his room, even 3 days after Johnny's father, Kevin's Stepdad, had asked him.  Johnny felt it was at this point that his duty as an older stepbrother was calling.  He burst in and yelled at Kevin about the messiness of the room.  Kevin did little but give Johnny a sass mouth and turn over on his stomach while listening to headphones.  This really pissed Johnny off.  He grabbed Kevin by the legs, yanked him close and proceeded to spank the boy.  Kevin screamed in protest, but Johnny just smacked harder.  Eventually, Johnny pulled Kevin's pants down and ripped off his underwear.Swat after swat, Kevin shrieked in agony.  Johnny's spanking soon turned to fingering of Kevin's asshole.  Kevin knew this was wrong and told Johnny so.  But Johnny retorted, reminding Kevin that it was ok since they weren't real brothers.  Kevin agreed to go along with the punishment and allowed Johnny to insert his fat, swollen cock into Kevin's mouth.  Kevin sucked his stepbrother's dick and could feel his own cock growing.Johnny noticed and decided it was time to fuck his little stepbrother's ass.Join these boys as they find a way to adjust to a new family situation, living under the same roof.ENJOY !",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Kevin Summers",
      "person_id": 36036
    }
  ],
  "release_date": "2015-05-06",
  "scene_id": 74100,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Step-Brat"
}