{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For Pierce Hartman, the long hours of hard work have finally paid off. His tryout results have come back, and it seems this tall stud has made his school's basketball team. He rushes over to his friend, Colt Rivers', house to tell him the news, since it was Colt who trained with him, pushing him to achieve his dream. As Colt answers the door, the excitement in Pierce's voice is palpatable and his exuberance is shared when Colt learns the good news. Celebrating in the kitchen, the two guys talk about Pierce's upcoming schedule, but Pierce breaks off this conversation to formally thank Colt for his dedication and friendly support. It seems Colt's inspiration helped push Pierce, and now Pierce wants to return the favor in the only way he knows how.<br></br>He lowers himself and gives Colt a passionate kiss, squeezing his ass as he pulls Colt's shorts down halfway to the floor. Colt knows a full court press when he sees one, and so he instantly gets with the program, falling to his knees and taking Pierce's big cock into his mouth, downing it whole as he presses Pierce against the counter top. Returning the favor, Pierce hoists Colt up onto the counter, alternately sucking him off and eating his ass, until Colt can stand it no longer, and begs for Pierce's cock. Pierce bends Colt over, fucking his meaty ass from behind before turning him over and going man to man missionary, as Colt strokes himself off as Pierce continues his thrusting. Colt mounts Pierce in the center of the kitchen floor, riding him as his rock hard dick bounces against Pierce's stomach. With a few timely thrusts, Colt can't contain himself, and he hoses Pierce down with a pent up load that unleashes all over Pierce's body, as Pierce pulls out and blasts Colt's face with his own batch. Just friends helping friends.<br></br>Enjoy!",
  "models": [
    {
      "name": "Colt Rivers",
      "person_id": 34306
    },
    {
      "name": "Pierce Hartman",
      "person_id": 34911
    }
  ],
  "release_date": "2015-05-07",
  "scene_id": 74107,
  "series": "NDB - 4557 - Pierce Hartman & Colt Rivers",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming"
  ],
  "title": "Tough Love"
}