{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Brenner Bolton has a secret that just keeps getting him in trouble. Stashed in the garage is his box of raunchy gay porn, along with his giant black dildo, and normally this wouldn't be anything to be ashamed of, but Brenner's security relies on his trust fund, which comes courtesy of his father's politicial career, which would be ruined immediately if Brenner's secret were to get out. When mover Matthew Ryan discovers and spills Brenner's stash onto the floor, Brenner is horrified that the jig is up, but Matthew has no interest in blowing up Brenner's spot. Instead, he decides to take advantage of the situation in another way, unzipping his cover-alls and pushing Brenner's head down so that it's level with Matthew's growing cock. Brenner considers the alternative and decides that blowing a stranger in his garage is the least harmful thing that could happen, so he downs Matthew's rod, peeling him out of his cover-alls and deep throat gagging on Matthew's growing cock. Matthew bends Brenner over a chair in the garage and proceeds to pound this silver spoon trustie in his rich ass, thrusting with all his might as Brenner proves he can take it all. Matthew fucks Brenner from behind, his giant cock pounding in and out as Brenner strokes himself off, before Matthew douses Brenner's face with a giant load, as Brenner follows suit launching a load of his own. And even if he can't be sure that Matthew will keep his secret, at least now, it's a secret they share with one another.Enjoy!",
  "models": [
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    },
    {
      "name": "Matthew Ryan",
      "person_id": 36888
    }
  ],
  "release_date": "2015-05-08",
  "scene_id": 75281,
  "series": "NDO - 4558 - Brenner Bolton & Matthew Ryan",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Black",
    "Brunette",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Oral",
    "Tattoo/Piercing",
    "Toys",
    "Workers"
  ],
  "title": "Pack it Tighter"
}