{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Paul Canon is the star football player on campus.  He knows that what he lacks in intelligence, he makes up for on the field.  Unfortunately, Paul's grades have been slipping lately and it's mid season, the most important time for Paul to show he can play at a collegiate level.  Principal Max Sargent is a compassionate man who knows how important the season is to Paul.  But he also must do his job and try to bolster Paul's grades.  The only solution he can think of is pulling Paul from the football team, at least for a couple of weeks, until his grades start to come back up. Paul is not agreeable to this at all.  He knows there will be scouts watching the team during the next few games and he must be on the field, pushing his hardest.  This is a situation that calls for drastic action.  Paul has heard talk that Principal Sargent might be sexually into guys.  Paul puts himself on the line by offering himself to Principal Sargent.  With some coaxing, Sargent acquiesces and the two kiss passionately.  Paul moves to pulling out his principal's large cock and taking it in his mouth.  He does his best job of sucking before taking off his clothes and allowing Principal Sargent to have a taste of his dick.  After some good, deep sucking, Paul decides to move around to the back of Principal Sargent so he can fuck his administrative ass.  Watch the football stud pound this handsome older man's tight hole.  See the look on Principal Sargent's face as he rides Paul's big, hard, youthful cock.  Find out if it's enough to keep Paul on the football field.  It's a private office meeting that no one should know about!",
  "models": [
    {
      "name": "Max Sargent",
      "person_id": 36238
    },
    {
      "name": "Paul Canon",
      "person_id": 36900
    }
  ],
  "release_date": "2015-05-15",
  "scene_id": 75503,
  "series": "NDO - 4560 - Max Seargent & Paul Canon",
  "tags": [
    "Anal Sex",
    "Athlete",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jock",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "The Principal"
}