{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Weddings are expensive, and Abel Archer knows this more than anyone, as he regularly encounters clients with no idea how much a basic wedding costs these days. Not being a totaly dick, Abel usually works with his clients to help ease the sting of such an expensive endeavor. Take Derrick Dime and his wife. The attractive young couple has the wedding all planned out, but Derrick balks at the price he's quoted when Abel comes over to fit him for his tux. Derrick can't believe the extortionist rates Abel is charging, but it appears Abel has him by the short hairs. Abel sees his client's resignation, and offers an alternative payment plan to the studly husband-to-be. Measuring his inseam, Abel lets Derrick know just how he could save a few bucks, and though he is hesitant at first, Abel convinces him it will be worth his while. With that, Abel rips down his shorts and plunges Derrick's cock deep down his throat. Derrick pushes Abel's head further down onto his growing cock, before throwing him down on the sofa and returning the favor, licking Abel's dick from shaft to tip. Abel is smiling from ear to ear, but if Derrick wants the full discount, he'll have to do a little more. With that, Derrick turns Abel over and begins to give him the business. Hard pumping as he pounds Abel, holding him by his tie and manhandling him from behind, Derrick goes deep inside as Abel gets closer and closer to cumming. Derrick leans him up against the full length mirror as Abel shoots his load all over the glass, and Derrick pulls out and blasts his face with a very expensive load, which Abel does not waste.So it turns out Derrick is in good standing with the wedding planner. Now all he needs to do is give a repeat performance tomorrow when the caterer arrives...Enjoy!",
  "models": [
    {
      "name": "Abel Archer",
      "person_id": 36223
    },
    {
      "name": "Derrick Dime",
      "person_id": 32560
    }
  ],
  "release_date": "2015-05-21",
  "scene_id": 75669,
  "series": "NDB - 4561 - Derrick Dime & Abel Archer",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "The Wedding Planner"
}