{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Connor Maguire is a sexy, sociable guy.  Today, he's trying out his new GoPro camera around the Next Door house, and wants you to come along.  His plan is to shoot some cool video for his fans, and to get a handle on how his spiffy new gadget works.  While walking through rooms in the house, he stumbles upon a very attractive new talent being photographed.  Connor apologizes for interrupting the shoot, but is welcomed.  He introduces himself to the new model, Matthew Ryan, and gets some video on his GoPro of the gorgeous boy.  He learns Matthew is just about to shoot a solo scene.  He makes an off-handed comment at this, remarking that 'it's too bad it's just a solo.' But our Next Door director says he's totally ok with making it a duo scene!  Connor takes advantage of the offer and goes right in to kiss Matthew.  The two move to the bed where Connor enjoys sweet Matthew's nipples for a while, by licking and biting them.  Matthew wasn't prepared for a hunk like Connor to sweep him off his feet today, but he doesn't have a problem with it!  After some making out and light stroking of each others' growing cocks, Connor takes Matthew's firm dick in his mouth and sucks.  Matthew LOVES the way Connor works his joystick.  Soon Matthew is slurping Connor's large dong, enjoying the stiff girth between his lips.  It's not long before Connor pushes his boner into Matthew's tight hole.  Matthew is certainly not used to getting pounded like this, but it feels amazing!  They switch things up so Matthew can ride Connor.  Some nice fucking happens like this before Connor picks the boy up and walks him over to a mirror where they continue their blazing hot, impromptu session.  This is an intense position that must been seen to be believed.  Join these incredibly delicious hotties as they meet for the first time and let instinct spontaneously carry them away to a sensuous new realm of ecstasy.",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 26412
    },
    {
      "name": "Matthew Ryan",
      "person_id": 36888
    }
  ],
  "release_date": "2015-05-29",
  "scene_id": 75670,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Black",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "Hairy",
    "Hardcore",
    "Interracial",
    "Oral",
    "P.O.V.",
    "Petite",
    "Red Head"
  ],
  "title": "Short Notice"
}