{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Markie More's Porncast subscription is just not cutting it lately and he is just about fed up. All he's looking to do is bust his nut and he can't seem to get any reception, so he's called for a technician to handle his problem.Lucas Knight shows up promptly, and seems to get Markie's system mostly back in order, and that's when Markie notices that the guy on his screen is the same guy fixing the cable connection. Lucas sees that he's been discovered, and feels embarrassed. but Markie assures him there's nothing to be ashamed of, especially considering the tool that Lucas is packing. Lucas seems relieved but Markie is already envisioning a little extra service from his technician, and Lucas, trying to save the account for Porncast, feels obliged to meet Markie's needs.Markie slams him against the window seat and begins sucking him off, as Lucas' giant cock swells inside Markie's mouth. Markie sucks on one of Lucas' balls as he jacks himself off, and Lucas stands him up and throws him onto the bed, going down to satisfy his customer. Markie pushes Lucas' head down onto his cock and he slobbers all over it diligently. Markie's hard on is insatiable, but first he wants to feel that fat dick inside him, so Lucas lays him down and gives him every inch, fucking him slowly at first as Markie strokes himself, then faster and faster, until Markie is almost ready to bust. Markie then flips Lucas over and takes him from behind, and discovers that Lucas' ass is just as nice as his cock, propping Lucas' legs up on his muscular shoulders as he pounds away, pulling out and launching as they take turns blasting each other with their hot loads. Say one thing about Lucas' technique: he knows how to make a connection. Enjoy!",
  "models": [
    {
      "name": "Lucas Knight",
      "person_id": 19957
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2015-05-22",
  "scene_id": 75703,
  "series": "NDO - 4562 - Markie More & Lucas Knight",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Big Muscles",
    "Bonus",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Fix My Porn"
}