{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "New trainer Arad is a head turner, without a doubt. With ripped muscles and a gigantic chest, this Greek Adonis should have no trouble getting clients, but for some reason he's having a hard time adjusting to the new atomosphere. Long time staffer Ace Stone tells Arad that he has everything it takes to be successful, but he just needs to get a little more comfortable around with his surroundings, and mingle a little more among the staff.Arad thinks he has an idea what Ace means by mingle, but just in case there was any confusion getting lost in translation, Ace grabs Arad's package and cups his balls, feeling his cock underneath Arad's underwear. Arad feels a rush of blood to his cock and raises his eyebrow in a knowing gesture, as Ace falls to his knees, pulling Arad's shorts down as he runs his hands up Arad's rippling body. Ace takes Arad into his mouth, sucking him hard and turning him around, plunging his face deep into Arad's crevice and tonguing his hole, before Arad returns the favor, moistening up Ace for his thick cock. Arad bends Ace over a bench and fucks him like his job depended on it, grabbing Ace by the waist as he pounds him from behind, then moving him to the floor and reverse fucking him from behind, as Ace stares at himself in the mirror, watching Arad's hips pump him full of hard dick. Ace mounts Arad and rides him reverse as he strokes himself off, cumming all over the floor before dismounting and letting Arad blast his face with his hot load. Wiping off, Ace promises Arad a bounty of client work, provided he can maintain his stamina.Arad lifts his eyebrow in a knowing reply.Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Ace Stone",
      "person_id": 36929
    }
  ],
  "release_date": "2015-05-28",
  "scene_id": 75704,
  "tags": [
    "Athlete",
    "Big Loads",
    "Big Muscles",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "The Foreign Stud"
}