{
  "collections": [
    "Next Door Originals"
  ],
  "description": "In the Church, true repentance is necessary in order to keep on the path of righteousness. Father Pierce Hartman has, for years, been a guidepost for young men, directing them to God for forgiveness. Now he sits with a congregation member, Tom Faulk. Tom seeks wisdom from Father Hartman. But as the Father is finding out, Tom's not seeking exactly the type of redemption it first seems.<br></br>Tom puts a personal sex toy on the table. Off the bat, Father Hartman doesn't know what the device is. Tom explains and the good Father understands. Tom goes further by telling the Father that when he uses the toy, he fantasizes about MEN, not women as Father Hartman had assumed.<br></br>While Father Hartman leads them both in prayer, he holds Tom's hand.  Just before the prayer is over, Tom stands up, grabs the Father by the head, and tells Father he saw him checking him out in the shower at the outreach camp. Father Hartman denies it, but Tom presses. He leans in to Father's face, asking if he was aroused when he gazed upon his glistening, nude body. Before the father can answer, Tom pulls his priest in for a kiss. This is too much for Father Hartman to resist. After all, he WAS checking Tom out in the shower!<br></br>Watch Father Hartman's version of service as he takes Tom's strong cock deep in his throat. And Tom returns the favor. Then comes time for the good Father to accept Tom's erection in his tight holiness. It turns out getting fucked is the perfect way to set an example of what Tom should not be doing. It's a passionate, forbidden work-up to Tom's ultimate baptism in erotic majesty.",
  "models": [
    {
      "name": "Pierce Hartman",
      "person_id": 34911
    },
    {
      "name": "Tom Faulk",
      "person_id": 36996
    }
  ],
  "release_date": "2015-06-12",
  "scene_id": 75889,
  "series": "NDO - 4568 - Tom Faulk & Pierce Hartman",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Beefy",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Confessions of Seduction"
}