{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Derrick Dime's wedding is proving to be much more effort than he initially realized, not to mention infinitely more expensive than even his wildest projections. It seems like every time he turns around he has to write a check with too many zeroes on the end of it. It's starting to wear him down, but like a diligent fiance, Derrick is doing everything he can to make his bride to be happy. Today he's at the Bolton Florist, which shouldn't be a big deal... just approve some center arrangements and he's all set, until the itemized bill is presented. Derrick's chagrin at yet another bill has him wondering just what his wedding planner meant by 'all inclusive'. Fortunately for Derrick, Brenner Bolton offers the same 50% discount, provided Derrick qualifies.</br><br> Derrick face palms, but at least he has some experience now, so as Brenner throws him back against the chaise lounge and begins sucking him off, Derrick gets hard as a rock. Might as well enjoy it, he thinks, as Brenner stands and shoves his cock into Derrick's mouth. Derrick sucks his dick as Brenner climbs on top of him, straddling him as he 69s the groom to be. In no time at all, Brenner slides to the foot of the recliner and spreads Derrick's legs as wide as they'll go, propping him up on his shoulders and elevating his meaty ass, tonguing him right in the center as Derrick strokes himself. Derrick's eyes roll back into his head and he's hard as a rock, so Brenner bends over and Derrick goes 'all in', fucking Brenner from behind, every thrust knocking more and more money off his bottom line, and by the time he and Brenner have shot their loads, he's earned his deal and is coming up roses... for now.</br><br>Enjoy!",
  "models": [
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    },
    {
      "name": "Derrick Dime",
      "person_id": 32560
    }
  ],
  "release_date": "2015-06-11",
  "scene_id": 76003,
  "series": "NDB - 4569 - Derrick Dime & Brenner Bolton",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "The Wedding Planner 2: Florist Edition"
}