{
  "collections": [
    "Active Duty"
  ],
  "description": "Jake's 24 and comes to us from Knoxville, Tennessee. He did say 24, right? Because I swear this boy could be fresh off 18 and celebratin' his new ID like it was a License to Fuck. He's got a great youthful face and a cocky big-lipped smile. When he peels off his jeans we get to see his long stiff shaft trying to escape his tight boxer-briefs, and after a bit of prolonged play with his chest and his cock, he finally takes off his shirt and undies to bare his cock in all eight inches of its glory.Jake starts stroking his bare meat eagerly, and his hand goes straight back to his taint and his fingers go right to his asshole and ring that back doorbell! Some of the guys take a bit of convincing before we can get them to explore their holes in solos or with another guy, but I'm glad to see Jake is the kind of guy who figured out for himself how great it feels to play with his ass. It's jack-off sessions like this that are such a treat to watch because you just know that the dude is feeling double the pleasure when he's stimulating all those different parts of himself at once. Throughout Jake's whole jack-off session I don't think I saw his hand leave his butt once! He busts his load a little earlier than some, probably because of how much attention he was putting towards maximizing his pleasure, the greedy little fucker. But don't worry, Mike gets Jake to give us a lot more to work with. He asks Jake to flip onto his knees and stick his fingers deeper into his hole, first one and then two. Jake gives us a bit of the inside scoop on his sexual history while he plays with his behind, and Mike even guides him into putting his fingers in up to the knuckles. It may not seem like a lot to some of you fellas out there but I assure you, for a lot of these straight soldiers, it's a hell of a start!",
  "models": [
    {
      "name": "Jake III",
      "person_id": 37020
    }
  ],
  "release_date": "2015-07-15",
  "scene_id": 76034,
  "tags": [
    "Big Dick",
    "Brunette",
    "Jerk Off",
    "Smooth",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Jake, Scene #01"
}