{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Rey Luis is just about as his wit's end with singer/songwriter Morgan Shades. Morgan has the look and the talent, but lately he just hasn't been delivering the goods and Rey's ass is on the line to produce a hit. Morgan seems to be having writers block at the worst time, and Rey is really feeling the pressure to coax something meaningful out of Morgan. Rather than get upset, Rey tries a different tactic, something to get Morgan's creative inspiration back on track, and so he begins to unbutton Morgan's shirt, unbuckling his belt and sliding his hand down Morgan's pants feeling Morgan's cock get harder in his hand. As they kiss, Rey can feel Morgan begin to come alive, so he drops to his knees and begins to suck Morgan off. Morgan's cock swells up as Rey tongues one of his balls and then the other, and then they switch, as Rey takes off his clothes while Morgan deep throats his dick. Trading blowjobs is a fine start, but Rey knows if he really wants a hit, he's going to have to work it out of Morgan, so he mounts him reverse cowboy style, grinding on Morgan's cock as Morgan throws his head back and continues to plow. Morgan pushes Rey up against his desk and continues to pound away, before moving back over to the recliner for the big ending, pulling out and splashing Rey with a pent up load coats his body. As Rey strokes himself to a thick, milky conclusion, he can see the glint in Morgan's eyes light up, positive that Morgan has all the inspiration he needs to finish his sweet song.Enjoy!",
  "models": [
    {
      "name": "Morgan Shades",
      "person_id": 18461
    },
    {
      "name": "Rey Luis",
      "person_id": 37044
    }
  ],
  "release_date": "2015-06-04",
  "scene_id": 76078,
  "series": "NDB - 4565 - Morgan Shades & Rey Luis",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Climax",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Interracial",
    "Latino",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Creative Juices"
}