{
  "collections": [
    "Active Duty"
  ],
  "description": "Our new boy Bo has undergone quite the transformation in such a short amount of timebut today's when he gets fully indoctrinated into the Active Duty roster, as he teams up with Mike's roster all-stars Tim and Dan for his first threeway! Bo's sandwiched between them grinning ear-to-ear at the chance to be hanging out with the cool crowd, and you can tell he's eager to impress. The guys pass around Bo's slut mouth between them for a little while, until Tim decides he wants to take this to the bed.Ever a consummate professional, Dan's already one step ahead of him and assumes the position, bending over and giving Tim access to his hot muscular ass from behind. Tim sticks his cock right between Dan's meaty buns and goes to town, while Bo moves around the two to get in position on the bed for Dan to suck his stiff prick. Dan looks like a cock hungry whore with a dick at either end of him and greedily taking them both at once. Tim knows what it's like to fuck Dan by now but this is Bo's first time and he's gasping at how good it feels to get his dick worked over by a dude who knows what he's doing.The guys go at it, spit-roasting Dan's beautiful bod from both ends until Tim decides he's ready to bust. He pulls out and creams all over Dan's beefy buttcheeks, and the sight is too much for Bo to handle. He's so turned on he pulls his dick out of Dan's mouth and starts rubbing himself to meltdown, with Dan stroking himself right beside him. Both guys blow their loads all over their chests and then the three cozy up together for their de-briefing.",
  "models": [
    {
      "name": "Tim",
      "person_id": 35281
    },
    {
      "name": "Dan",
      "person_id": 35343
    },
    {
      "name": "Bo",
      "person_id": 36987
    }
  ],
  "release_date": "2015-06-21",
  "scene_id": 76127,
  "series": "Bo, Dan & Tim",
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Straight",
    "Tan",
    "Tattoos",
    "Threesome",
    "White Butt"
  ],
  "title": "Bo, Dan & Tim, Scene #01"
}