{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "It's been a while since Lucas Knight and Drake Tyler have spent time together.  They were good buddies in college, but the winds of fate blew them in different directions after graduation.  Now, Drake is getting married in a few short weeks and he and Lucas have decided to catch up a bit and go for a run.  As Drake tells Lucas about the craziness of planning for the big day, Lucas senses that his old friend is nervous.  Drake explains that he's an awful dancer and expects to look like a fool at his wedding.  But Drake forgot that Lucas used to teach ballroom dancing in college.  It just might be a lucky break!  Lucas invites Drake to come by the studio at Lucas's gym so they can go over some simple moves that should help Drake to look like a stud on the dance floor on his big day.  While they slowly dance together, Lucas holds Drake by his hips, letting his growing erection under his pants brush against Drake's taught ass.  Drake can't stop thinking about the time in college when Lucas and he hooked up.  He can still remember the taste of Lucas's enormous cock as it slid in and out of his mouth.   The light conversation between the two somehow touches on the subject of their chance intimate encounter.  Drake tells Lucas he still remembers it, as it's been the only time Drake has messed around with a guy.  Lucas coaxes Drake into having one more hookup, since he won't be able to once he's married.  Drake doesn't put up much resistance, and is out of his clothes quick.  He goes to his knees to enjoy that fat dick that's been such a prominent memory for several years.  Lucas can tell Drake has been salivating for more ever since their one night of experimentation.  Lucas returns the favor by bobbing on Drake's erection for a while.  Then Drake climbs onto a bench and presents his hole to Lucas.  Lucas pounds his friend's tight ass for a while, being sure to make the experience count.   Join these old pals as they rekindle their relationship and make the most of their reunion.",
  "models": [
    {
      "name": "Lucas Knight",
      "person_id": 19957
    },
    {
      "name": "Drake Tyler",
      "person_id": 32530
    }
  ],
  "release_date": "2015-06-25",
  "scene_id": 76215,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Oral",
    "Smooth",
    "Uncut cock"
  ],
  "title": "Cock and Ballroom"
}