{
  "collections": [
    "Next Door Originals"
  ],
  "description": "They're stepbrothers that share more than just their parents' comfortable home. Cole Christiansen and Aspen are very close. They confide in each other and trust one another to offer sound advice. This morning, as Cole eats his usual bowl of cereal, Aspen joins him and listens to what's on Cole's mind.Cole is suspicious that his frat brother, Johnny, might be gay. He's noticed Johnny giving him lustful glances recently. He knows Aspen is also friends with Johnny. When Cole asks Aspen if he thinks Johnny is gay, Aspen laughs and tells Cole that he sucked Johnny's dick last Summer at the pool party. Cole can't believe it!  Then Cole asks Aspen if Johnny knows about the two of them.You see, Aspen and Cole, although stepbrothers, have been having casual sex with each other for a while now. Aspen doesn't think Johnny knows about it.  As they chat, Aspen can see the longing in Cole's expression. He knows how much Cole must be aching to have his cock drained. They haven't messed around in a while, but this is the perfect opportunity to rekindle the more intimate side of their relationship.  Some deep, passionate kissing turns into hard sucking of Cole's fat, erect dick. Aspen knows exactly how to work Cole's luscious cock. The amazing feeling of Cole's pulsating meat in his mouth makes Aspen's tight hole hungry. Cole is happy to serve up the second breakfast course.  Join these loving stepbrothers as they start the day with some passionate pounding.",
  "models": [
    {
      "name": "Aspen",
      "person_id": 37073
    },
    {
      "name": "Cole Christiansen",
      "person_id": 29120
    }
  ],
  "release_date": "2015-06-19",
  "scene_id": 76214,
  "series": "NDO - 4570 - Aspen & Cole Christiansen",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Family Roleplay",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Brotherly Passion"
}