{
  "collections": [
    "Next Door Twink"
  ],
  "description": "In certain Tantric circles, the art of chastity is a revered practice.  Johnny Torque and Dylan Johnson find themselves together on the last day of a very intense sexual retreat, one in which the only rule is to remain physically abstinent from any sexual activity.   At the Tantric Transcendence Retreat, remaining true to the spirit of the practice is made harder for each individual by the alluring physical qualities of the other participants.  Dylan has been eyeing Johnny since day one, visualizing what he would like Johnny to do to him.  And reciprocally, Johnny has been imagining things he'd like to do to Dylan.    The masters of the retreat do not tell the participants what awaits them on the final day, if they've remained chaste.  Dylan and Johnny are only now finding out that their reward is to be alone together, with the rules of the practice removed, in order that they may indulge their senses. Johnny begins by touching the object of his yearning for the first time, slowly moving in and kissing him.  They enjoy the feeling of each other's bodies for a while before Dylan sucks Johnny's rock hard erection.  Johnny then bobs his mouth up and down on Dylan's incredibly charged boner.  Soon the two are positioned to fuck.  Johnny rubs his pulsating manhood on Dylan's tight, expecting hole.  The eagerness shared between them is almost too much to handle on the earthly plane of existence.  Johnny pushes his cock into Dylan's ass, and they both dissolve into Tantric Transcendence.",
  "models": [
    {
      "name": "Dylan Johnson",
      "person_id": 37118
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    }
  ],
  "release_date": "2015-07-29",
  "scene_id": 76261,
  "series": "NDT - 8298 - Johnny Torque & Dylan Johnson",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Latino",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Sensuous Passion"
}