{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Cole Christensen has had a burning question on his mind for the last few weeks.  He's noticed his frat brother, Johnny Torque, shooting him sexually inviting looks.  Cole has since been wondering if Johnny somehow knows that Cole likes to mess around with guys sometimes, and if Johnny likes to do that too.  If so, it would be freakin' AWESOME, because Cole has always thought Johnny is super hot.  Now, as Cole is looking around for Johnny during a party, with beer bong in hand, he stumbles upon Johnny getting his dick sucked by a young, Freshman pledge named Zach Taylor! <br/><br/>As Cole watches from behind a wall, Johnny glances up and notices him.  Cole already has his own big cock out by the time Johnny sees him.  By the look Cole receives, he knows Johnny wants him to join the little private bathroom party.  Cole drops the beer bong and steps in to share the lips and mouth of sweet, eager-to-please Zach.  Zach is delighted to service another frat brother, as he knows it will increase his chances of making the cut.  <br/><br/>After Zach spends some quality time, switching back and forth between the two lusciously swollen dicks, the three move out into a larger space in the bathroom where Johnny can properly test out Zach's tight ass.  Zach continues to slurp Cole's fat dong while Johnny slides his erection into Zach's ass and slams him hard.  <br/><br/>They move to the bathtub where Cole takes a turn on Zach's ass and Johnny enjoys more of Zach's soft mouth.  For a grand finale, they see how Zach can ride a dick while still sucking a standing Cole, right on the steps of the tub.  <br/><br/>Don't miss this extremely hot, rush week pledge party where all hot Twink Freshman are getting fuck tested by the most badass older frat bros! <br/><br/>Enjoy!",
  "models": [
    {
      "name": "Cole Christiansen",
      "person_id": 29120
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Zach Taylor",
      "person_id": 37106
    }
  ],
  "release_date": "2015-06-17",
  "scene_id": 76470,
  "series": "NDT - 8295 - Johnny Torque, Cole Christensen & Zach Taylor",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Facial",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "Hard Pledge"
}