{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Since wowing his superiors during his initiation, personal trainer Arad is fitting in nicely and building a steady base clientele. To be honest, he's already one of the most requested trainers at the gym... for some reason.Shawn Andrews has heard all about Arad's technique, and one look at Arad's shredded body tells Shawn that Arad knows how to get results, so Shawn is eager for his session. As it begins, it seems normal enough, with Arad walking Shawn through several exercises intended on isolating his focus areas. And that's all well and good, but as he lay on his stomach while Arad works out a kink in his back, Shawn wonders if everything he's been hearing is just rumor. Finally he just comes out with, asking Arad directly if he's gonna play around with stretches or if he's gonna fuck him. With that, Arad gives a wry smile and a smack on Shawn's ass, and the next thing Shawn knows, Arad is running him through a whole different set of positions. Arad peels off Shawn's pants and begins to lick his ass, eating Shawn out as he closes his eyes and enjoys every moment of it.Convinced that his client is properly loosened up, Arad rises to his knees as Shawn crawls closer and begins to suck him off. Arad slams his cock deep down Shawn's throat, but there's another hole that Shawn wants Arad to work out, so Arad turns Shawn over, plunging his cock deep inside of him, pounding him on the floor as Shawn begins to realize why Arad comes so highly recommended. Arad pushes Shawn up against a wall and fucks him like crazy as Shawn's rock hard dick is ready to burst, so he tells Arad to fuck the cum out of him, and Arad does as instructed, pounding Shawn as he sprays his load all over the gym floor, then falling to his knees as Arad blasts him with a load of his own. As Shawn lay there covered in jizz with a smile on his face, Arad just laughs, knowing he's just made another client very very satisfied.Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Shawn Andrews",
      "person_id": 36994
    }
  ],
  "release_date": "2015-07-09",
  "scene_id": 76549,
  "series": "NDB - 4575 - Arad & Shawn Michaels",
  "tags": [
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "The Foreign Stud Part 2"
}