{
  "collections": [
    "Next Door Twink"
  ],
  "description": "In the service industry, valet guys have it rough sometimes.  James Dickson works his cute little ass off for just enough to get by in a fairly exclusive part of town.  Without giving a second thought, big shot executives like Derrick Dime flip James a few bucks when they visit the country club in their shiny, expensive cars.  But when Derrick doubles back for his phone, just after handing James his keys to park his ride, he discovers James has a very strong sexual appetite.  Derrick catches James cock-handed as he strokes his swollen dick while looking at a picture of Derrick on the phone he left behind.  Derrick can't believe what he's seeing.  Although James violated the code of the valet, Derrick has an idea that might make James's day a little more fun.After an explicit proposition, James takes Derrick to a secluded storage room where they can both get more comfortable and more friendly.  Derrick saw the hungry look James had as he jerked off to Derrick's picture, so Derrick is giving this young man the real thing.  After kissing passionately for a while, Derrick is serving this valet his big, thick cock.  James devours the luscious erection.  Derrick moves the two of them to a barrel where James can sit while Derrick gets a nice mouthful of hard dick.  James can't believe he's hooking up with such a high-power business player.  It's not long before Derrick takes full advantage of this eager-to-please service employee, and shoves his girthy boner into James's sweet ass.  Join these two as Derrick learns the meaning of full-service valet!",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "James Dickson",
      "person_id": 37125
    }
  ],
  "release_date": "2015-07-01",
  "scene_id": 76551,
  "series": "NDT - 8296 - Derrick Dime & James Dickson",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blowjob",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Reality",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Valet Serviced"
}