{
  "collections": [
    "Next Door Originals"
  ],
  "description": "He's a dedicated young man with lots of spunk.  He's Ace Stone and he's a missionary for the Church of Next Door Bottoming Saints (CNDBS).  Although Ace loves spreading the Good News, he knows it's sometimes tough work.  On this particular outing, he's biked to the top of a tall hill, where one Mark Long happens to reside.  Mark isn't into hearing about Ace's Faith as much as he's interested in getting into Ace's pants!When Mark answers his door to find young, chipper Ace, he has a feeling Ace is the type of young man who will swallow just about anything.  Mark invites him inside to find out exactly how impressionable this sweet boy really is.Ace is excited to be invited in and goes right into his rehearsed lines.  But Mark isn't like the rest of folks with whom Ace has sat down; Mark wants to strike a very special deal...Mark will read Ace's spiritual literature if Ace will try something new himself.  Ace agrees and discovers that Mark was talking about something that's strictly forbidden by the church.  In fact, it's something Ace has never done before, with anyone.  That's right...Ace is a VIRGIN!Although nervous, Ace decides it's ok, as long as Mark will give the Faith some honest consideration.  Ace starts out by accepting Mark's big, thick cock into his mouth.  Ace does the best he can, sucking Mark's warm, swollen meat.  After a while, Ace kinda starts to enjoy it!  And by the time Mark is shoving his enormous dick into Ace's sweet, tight hole, Ace is realizing he should've tried this a LONG time ago!  Join the ministering session and watch Mark remove Ace's 'sacred garments' and pound his ass hard.  Find out who converts who after this righteous fucking.",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Ace Stone",
      "person_id": 36929
    }
  ],
  "release_date": "2015-07-03",
  "scene_id": 76724,
  "series": "NDO - 4574 - Mark Long & Ace Stone",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Tempting Faith"
}