{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Johnny Torque is doing some garden work around the house at his Uncle Ryan's place. Johnny's worked up quite a sweat, and so Ryan offers him a nice glass of lemonade to cool off. Once indoors, Johnny complains of sore shoulders and Ryan obliges him with a shoulder rub. <br> </br>As he rubs his shoulders, Ryan can't help but get turned on at Johnny's bare chest, his strong muscles and smooth skin begging to be touched. Ryan takes a chance and rubs Johnny's pec, causing Johnny to take notice, asking Ryan what he thinks he's doing. Ryan confesses to knowing about Johnny's girlfriend problems, and offers to help Johnny relieve the stress he probably has built up. Johnny's a little weirded out by his uncle coming onto him, but he figures Ryan is his step-dad's brother so it's not technically taboo, and he really could use a nice blowjob, so he figure what the hell, and lays down on the bed as Ryan begins to undress him, slowly reaching his mouth around Johnny's hard cock. <br> </br>Johnny closes his eyes as Ryan works his magic, and once he's good and hard, Ryan takes control of the situation, shedding his pants and mounting Johnny, riding his hard dick as Johnny thrusts up into him over and over again. Johnny gets into the spirit of things, turning Ryan and over and giving him a proper pounding from behind, then flips him over and continues to ram his Uncle as Ryan strokes himself off. Johnny blasts Ryan with his pent up load as Ryan spooges all over himself in a fantasy come to life. Covered in jizz from both of them Ryan smiles and assures Johnny their little tryst will remain a secret between the two of them. <br> </br>Enjoy!",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Ryan Wilcox",
      "person_id": 37258
    }
  ],
  "release_date": "2015-07-10",
  "scene_id": 76757,
  "series": "NDO - 4576 - Johnny Torque & Ryan Wilcox",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Blowjob",
    "Climax",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Massage",
    "Mature",
    "Muscular",
    "Oral",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "The Gay Uncle"
}