{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Lucas Knight is a very nice boy who's on a trip to visit his grandmother across the state.  After a while on the freeway, he stops at a seedy rest stop to use the bathroom.  While peeing, Lucas notices something on the bathroom stall wall, the likes of which he's never before seen.  Among various graffiti markings, there's a hole big enough to fit a hand through it.  As he walks away, after pulling his pants back up, he hears coughing coming from inside the stall.  He pauses.  Some writing on the wall indicated that coughing meant someone wanted to engage sexually with whoever else was in the bathroom.  Inside the stall is a man named Chris Nox.  He's a local guy who knows this bathroom is a great place to hook up.  When Lucas asks if the coughing was meant for him to hear, Chris asks if this is Lucas's first time trying to get nasty in a rest stop bathroom.  His reticence is painfully obvious.  It's a good thing Chris is an understanding type of pervert, because Lucas is very aroused at the thought of an anonymous blowjob.He sticks his enormous cock through the hole and feels Chris's warm tongue work its way along the shaft and head.  He can't believe the erotic nature of this unexpected encounter.  Chris works his way up to a fervent pace, sucking the luscious dick like a meat-starved prisoner.  After a while, Chris emerges from the stall and Lucas returns the gesture, going to his knees to experience a mouthful of Chris's stiffie.  It's not long before Lucas is repositioning Chris so he can insert his throbbing man pole into Chris's tight, eager hole.Take part in this hot, dirty hook up as Lucas gets initiated into the world of freeway fucking.",
  "models": [
    {
      "name": "Chris Noxx",
      "person_id": 35796
    },
    {
      "name": "Lucas Knight",
      "person_id": 19957
    }
  ],
  "release_date": "2015-07-23",
  "scene_id": 76829,
  "series": "NDB - 4577 - Chris Nox & Lucas Knight",
  "tags": [
    "Anal Sex",
    "Beefy",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Facial Hair",
    "Gay Porn",
    "Glory Hole",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Men's Room Rookie"
}