{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Now that their dads were married and they all lived in the same house, everything was running pretty smoothly... the wedding was beautiful, Lucas and Andy got along really well, and their dads seemed happy. They were actually really cute to see together, it was adorable. Everything was perfect -- here's the thing though. As happy as Andy was for his dads and their new family, Lucas' dad was HOT. It was weird, and distracting. It wasn't like Mitch was his <i>real</i> dad, but it sort of felt like he was... which made it even more confusing that Andy couldn't get over his new dad's hot, hard body.</br></br>Then one night Andy was up late watching TV. Andy was still groggy, and seeing that handsome rugged face, feeling his strong hand pressed against Andy's bare chest, it was almost like a dream. And Andy did something he never would have expected, he pulled Mitch's head in for a passionate kiss. Mitch pulled back, startled, but then his expression changed to a look of pure desire and he leaned in to give his new boy another loving lip-lock.</br></br>Mitch made his way down Andy's smooth muscled chest to the bulge in his undies and pulled them down, giving his boy a passionate sucking with his experienced mouth. As the two shed their clothes and Andy got his cock worked over by his daddy, his real father Nick and step-brother Lucas overheard their moans and watched from the doorway... at first shocked, but then, a little turned on. Mitch tongued Andy's fresh wet hole and then plunged his daddy dick into Andy who begged and moaned for more, until they both shot their loads all over Andy's young smooth chest. Meanwhile, from the doorway, Nick's hands wandered to his new son's chest too, as he and Lucas retired into the main bedroom for their own family fun...",
  "models": [
    {
      "name": "Andy Banks",
      "person_id": 37293
    },
    {
      "name": "Mitch Vaughn",
      "person_id": 28068
    }
  ],
  "release_date": "2015-08-12",
  "scene_id": 76953,
  "series": "My New Brother's Dad: Part One",
  "tags": [],
  "title": "My New Brother's Dad: Part One"
}