{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "The neighborhood gym has been a long-standing sanctuary in Greg Jamison's community.  He comes here to work, play, and relax.  And the fact that there's a gloryhole in the men's room doesn't hurt.  Greg has loved hanging out in the glory stall after strenuous workouts, connecting with like-minded guys.  Today, there's a new dude in the weight room, and he's extremely hot.  He's Orlando Fox and he's been giving Greg some very friendly glances.<br/><br/>  When Orlando asks Greg to spot him on the bench, Greg doesn't hesitate.  As Orlando lifts, Greg positions himself strategically in order to allow Orlando to have a look at his goods.  Orlando definitely likes what he sees.  When Greg apologizes for his growing erection, Orlando laughs it off and tells him it's ok.  Then Greg informs Orlando of the notorious glory hole.  Orlando takes this as an invitation and follows Greg into the bathroom.  Once there, it's not long before Greg has his arm through the hole, stroking Orlando on the other side.  Orlando sticks his big, swollen dick through and Greg wraps his soft lips around it.  After some hard sucking, Greg pushes his own fat cock through so Orlando can have a taste.<br/><br/>  The fervent bobbing leads Orlando to join Greg inside the stall for even more intense action.  Orlando slides his thick, stiff meat into Greg's tight hole and pounds his ass hard.  Greg loves the feeling of a new dick in his sweet pocket.  Orlando takes a seat on the toilet so Greg can take a ride.  Watch through the hole, then get inside the stall with these gym hotties, and experience a first-time encounter that will get you pumped!",
  "models": [
    {
      "name": "Greg Jamison",
      "person_id": 37177
    },
    {
      "name": "Orlando Fox",
      "person_id": 37350
    }
  ],
  "release_date": "2015-07-30",
  "scene_id": 76958,
  "series": "NDB - 4579 - Greg Jamison & Orlando Fox",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "Glory Hole",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Gloryhole Workout"
}