{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "Lucas and Andy's dads were about to get married. The guys had never spent too much time together, but considering they were about to be stepbrothers, they decided to get to know each other better and go shopping for a wedding gift together. Turned out, they really got along great, and they shared a lot of interests - base jumping, rock climbing, scuba diving, they even had the same sense of humor. It really felt like they could have been brothers all their lives. Once they'd picked out a gift, they brought it home to hide it somewhere where their dads wouldn't be able to find it before the wedding day. For the rest of the afternoon, it was just gonna be hanging out in their sweats like a couple of bros. But things got weird when Andy walked in on Lucas still changing. He was just standing there in his undies, his tight chest and humongous bulge jutting out there for all to see. Andy had seen Lucas in his swimsuit before, and he couldn't take his eyes off him then, and just like then, Andy realized he was staring at his step-brother's hot body. The silence became awkward, but Lucas' sheepish smile implied that Andy wasn't the only one with an indecent crush. Seeing this, Andy peeled off his shirt to reveal a pretty nicely packed body of his own, and both guys were waiting for the other to make a move. When both of them realized they wouldn't be able to get sex off the brain until they got laid, they came together for a big sloppy kiss. They fondled each other's packages inside their briefs, and then stripped down to get a full view of their hard cocks. Lucas' dick was so huge compared to Andy's, that he couldn't help get on his knees and worship that big dick with an eager blowjob. Then Lucas pushed Andy on the bed and had his way with this cute boy while he could, before their dads married and they officially became family. Because once they were brothers, things would be very different from then on... but would that be enough to hold back their newfound desires?",
  "models": [
    {
      "name": "Andy Banks",
      "person_id": 37293
    },
    {
      "name": "Lucas Knight",
      "person_id": 32516
    }
  ],
  "release_date": "2015-07-08",
  "scene_id": 76952,
  "series": "My New Brother",
  "tags": [],
  "title": "My New Brother, Scene #01"
}