{
  "collections": [
    "Next Door Originals"
  ],
  "description": "It's the kind of thing every sports trainer dreams of: the stud quarterback, Derrick Dime, has hurt his leg in practice and needs a rubdown to ease the pain. Therapist Ace Stone is on the ball, whipping Derrick's pants and jersey off and setting to work out the kinks in Derrick's thigh. As he rubs Derrick's ass, Derrick spreads his legs just a little, teasing Ace with his hole as he looks back. 'You like what you see back there?' says the quarterback, knowing that Ace approves. Ace stammers a bit, embarrassed, then sees the inviting look in Derrick's eye and just goes for it, grabbing Derrick's cock and stroking it slowly as Derrick closes his eyes and pulls Ace closer. Ace playfully tongue's Derrick's cock and then wraps both lips around the head, downing it in one fell swoop, gagging on it as Derrick grabs him by the back of his head and pushes down. Derrick proceeds to return the favor, but what Ace really wants is for Derrick to pound him from behind with his big meatstick, so he bends over as Derrick shoves his cock deep inside, giving Ace a playful smack on the ass as he continues thrusting, plunging his cock to the bottom as Ace clenches around the side of the training table with every push.Derrick flips Ace over and continues to pound away as Ace strokes himself off, and seeing this turns the quarterback on so much he pulls out and loses his nut all over Ace as the trainer strokes his own cock off and launches his load onto the ground beneath them. Derrick leaves feeling rejuvenated, restored and ready for the big game.Enjoy!",
  "models": [
    {
      "name": "Ace Stone",
      "person_id": 36929
    },
    {
      "name": "Derrick Dime",
      "person_id": 32560
    }
  ],
  "release_date": "2015-07-24",
  "scene_id": 77092,
  "series": "NDO - 4580 - Derrick Dime & Ace Stone",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Sports Rub"
}