{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Connor Maguire goes about his job cleaning the windows of his client, he feels the hot sun beating down against the back of his neck, but he discovers the real hot action when he inadvertently peeks through one of the windows he's washing and discovers Brenner Bolton naked as a jaybird stroking his cock in bed. Connor peers at Brenner, unzipping his cover-alls and reaching for his cock as it gets hard beneath his uniform. He wonders if Brenner knows if he's watching, and no sooner does the thought cross his mind than Brenner looks up and motions for Connor to come around to the door. Connor cracks a smile and enters the room, flipping Brenner over without words and immediately plunging his tongue deep into Brenner's waiting hole. Brenner clutches the pillow as Connor continues to work his ass, but what Brenner really wants his some cock, so he flips over and takes Connor's meat into his mouth as Connor returns the favor. Both guys sucking each off, each getting harder by the moment, it's Connor who breaks off to reload and get a piece of Brenner's tantalizing ass. Brenner gladly obliges, and Connor bends Brenner over, his huge dick ready to tear into Brenner with reckless abandon, which is just how Brenner likes it. As Connor pounds away from behind, Brenner slips a sly little smile, which only grows as Connor fucks the load right out of Brenner, following up by dousing him with a load of his own. As Brenner lay there covered in cum, Connor realizes he has been set up from the get go. Truth be told, he is not that upset about it.Enjoy!",
  "models": [
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    },
    {
      "name": "Connor Maguire",
      "person_id": 26412
    }
  ],
  "release_date": "2015-07-16",
  "scene_id": 77093,
  "series": "NDB - 4581 - Connor Maguire & Brenner Bolton",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Public nudity & voyeur ",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Clean & Jerk"
}