{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Tyler Sky is a solid student who works hard for his good grades.  Tyler was absent due to illness on the day the final exam in Chemistry was given, but he made arrangements with the professor to make it up.  When Tyler shows up for the test, he's surprised to find class clown and hot badboy, Zane Porter, is making up the exam too.  As Tyler works to answer the questions for which he prepared hard, Zane sits behind him, struggling to focus on the boring test that he can hardly even understand.Zane realizes that Tyler, being one of the biggest overachievers in school, probably knows all the answers.  Since the professor is probably napping in the lounge, and won't be back for another hour or so, Zane propositions Tyler.When Tyler denies Zane's first request, Zane decides to offer something in return.  Tyler can't believe Zane when Zane tells him he'll show him his cock.  Tyler laughs at first but turns around to see Zane standing up, with his large, swollen dick in hand.Tyler has had his eye on Zane all semester and this is an opportunity too sweet to pass up.  Before Zane knows it, Tyler is sucking his fat dick.  This is like a dream cum true for Tyler.  Zane enjoys the warm feeling of Tyler's lips around his throbbing dong for a while before pulling out Tyler's big cock and doing some slurping of his own.  When the energy builds to a tipping point, the boys move to a desk where Zane slides his stiff meat into Tyler's tight ass.  Join this exam session where the last thing on these guys' minds is finishing on time.  This is how to exploit the cute, nerdy kid without feeling too guilty!",
  "models": [
    {
      "name": "Tyler Sky",
      "person_id": 37300
    },
    {
      "name": "Zane Porter",
      "person_id": 37299
    }
  ],
  "release_date": "2015-07-15",
  "scene_id": 77096,
  "series": "NDT - 8297 - Zane Porter & Tyler Sky",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Final Exam"
}