{
  "collections": [
    "Icon Male"
  ],
  "description": "JD is pleasantly surprised when out of the blue, his old babysitter Brendan Patrick drops in to visit. It's been years since they'd seen each other, but Brendan was in town for his cousin's wedding. Although Brendan moved back to Europe when he was young, JD has always looked back fondly on the memories he's kept of him. After hours of reminiscing, the conversation eventually turns to girls and relationships, and how neither of them have have found love. Happy to have seen his old friend, JD giddily gives him a hug, and without much thought pecks Brendan on the mouth, much to the surprise of his old babysitter. After confirming that it's OK, the boys stare at each other knowingly, gauging reactions, slowly going in for a kiss.  They quickly move upstairs to make out and explore each other's bodies, the men they'd become. JD's the first to initiate, and takes Brendan's hard cock into his mouth, stopping for but a few moments to make out. Brendan tongues JD's ass, stopping for a moment to kiss, before JD begins to rim Brendan's ass in return, causing Brendan to sit on his face for more. After flipping around again and again, Brendan and JD fuck doggy-style, and JD rides Brendan's cock 'til he nearly comes while inside him. Making sure he'd get his, JD then flips Brendan around, to start fucking him, eventually spraying his load onto Brendan's stomach, soon followed by Brendan's own thick white cum. ",
  "models": [
    {
      "name": "Brendan Patrick",
      "person_id": 36118
    },
    {
      "name": "JD Phoenix",
      "person_id": 36928
    }
  ],
  "release_date": "2015-07-09",
  "scene_id": 77111,
  "series": "Forbidden Encounters 3",
  "tags": [
    "Anal",
    "Big Cock",
    "College",
    "Cumshot/cum",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Masturbation",
    "Mature",
    "Muscular Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Forbidden Encounters 3"
}