{
  "collections": [
    "Active Duty"
  ],
  "description": "This one's a bit of a continued learning process for our boy James.  Michael comes off as confident and dang right excited to connect with James, right off the git go.   It's easy to tell this from their interaction with our eagle-eye scout, Claude.  Before the boys get started, Claude cracks one about James being 'back for more pain' and Michael's the one bringing it!  James has been in only twice before to push limits for us at Active Duty.  His first time doing a solo was the initial hurdle, which he handled nicely, and he followed up not long after by joining a passionate three way. But it's easy to see that James is still learning and is having an adventure getting outside of his comfort zone.  I was just telling Claude how much I like to see match ups like this because of the great dynamic.  Michael is a sweet guy, but also has a part of him that aggressively loves sucking cock and fucking hot young guys.  We get to see him here coaxing James forward, using a nice combo of stern direction and gentle guidance.   Michael gets the ball rolling between the two, after Claude leaves them alone for a quick spell, by taking James's hand putting it right on his swollen cock.  James knows what to do by now, so he jerks Michael's thick meat like a good soldier, always looking to earn more stripes.   He doesn't jack him too long before going down to have a taste.  James has come a long way, as far as properly sucking a fattened dick.  He's honing his technique at every opportunity, and Michael is benefiting from James's practice!  They go back to tugging their boners for a while before Michael goes in to reciprocate.  Michael's body and tattoos really look hot, especially when he's bobbing fervently on a throbbing cock.   Then comes time for the part James was anxiously anticipating.  It's the time when he must take a hard erection into his tight, very tender hole.  Michael, like a good soldier, knows his job here is important.  Join these guys as James gets his sweet ass fucked hard and both guys have a good (although a bit painful) time together, building up to a nice, warm explosion.",
  "models": [
    {
      "name": "Mike",
      "person_id": 35411
    },
    {
      "name": "James III",
      "person_id": 37283
    }
  ],
  "release_date": "2015-07-05",
  "scene_id": 77152,
  "series": "Michael & James",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off",
    "Tattoos"
  ],
  "title": "Michael & James, Scene #01"
}