{
  "collections": [
    "Active Duty"
  ],
  "description": "Back yet again, I'm happy to say, is our smiling soldier, Gage.  This time he's breaking in a much newer recruit, Seth.  We had the privilege of meeting Seth recently, when he chatted with Claude a wee bit, then stripped down and yanked his giant, oily cock.  They get down to just their undies, and Seth goes down for a nice sampling of Gage's sweet cock.  He pulls it out and gets to plumpening that tasty dick.  Gage's  fatty starts popping up nicely and he removes his boxer shorts the rest of the way.  He moves over to have a taste of Seth's hardening boner for a few licks before going up on his knees to allow Seth better access to his delicious erection.  Seth gives it some more caring attention before going to his back so Gage can enjoy that amazing, stiff piece of man meat on Seth.  Gage's sucking turns into a nice 69, where Seth get to bury his face deep into Gage's tight ass.  This leads to Seth slapping his mammoth boner on Gage's hole, teasing everyone a little, then pushing it in nice and slow, the only way a dick that big usually goes.  After that, it's Seth's big moment, what I like to consider his official inauguration.  Gage gets his cock in deep and really works him good.  Boy what a trooper on his first go, Seth is.  He takes Gage's pounding very well, stroking his long, thick cock the whole time.  First he takes Gage from behind, then switches to his back for some extremely hot, very intense action that Claude can't help but get worked up over!I don't wanna spoil nothin', but I will say that each boy's blast is something to truly behold, Seth with that giant, pulsating dong, and Gage with an unbelievably explosive eruption of liquid-hot magma!",
  "models": [
    {
      "name": "Gage",
      "person_id": 35084
    },
    {
      "name": "Seth",
      "person_id": 37310
    }
  ],
  "release_date": "2015-07-12",
  "scene_id": 77255,
  "series": "Seth & Gage",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Duo",
    "Gay",
    "Jerk Off",
    "Kissing",
    "Rimming",
    "Smooth",
    "Tattoos"
  ],
  "title": "Seth & Gage, Scene #01"
}