{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "After the excitement of their dads' wedding, Andy and Lucas and their dads Mitch and Nick were settling into their new place nicely. Everybody was falling into a schedule, running off to work, sports, grabbing food on their way. Andy and Lucas were getting along really well. They were even on the same ball team. And Lucas could tell his dad was really happy with Nick. And honestly he couldn't blame him, he was a total babe. His rippling muscles, and gruff attitude, those big strong arms... It was weird being attracted to his new father figure... he was just Lucas' step dad, but still... But he lived with it, and didn't let it get too awkward. Nick made his dad happy and that's what counts.</br></br>Things really changed for the weirder one night though. Lucas woke up in the middle of the night to get some water, but as he was heading downstairs, he saw Andy getting fucked on the couch. Lucas was already growing a boner before he realized that the guy he was getting fucked by was his dad! Woah... weird... but he couldn't tear my eyes from it. But that's not where the weird ends, because Nick was on his way towards me to see if why I was awake. Lucas was speechless. Nothing he could say would stop Nick from seeing what was going on. Lucas just continued to stare in shock, thinking that Nick was going to lose it. He didn't though. He must have been startled for a minute, but it didn't bother him too much and after a second Lucas could feel Nick's dick press against his ass through his briefs and his hands running over Lucas' smooth young chest and down to his already hard dick. It was all so weird. But Lucas secretly had always wondered what getting fucked by Nick was like.</br></br>Nick was amazing and new exactly what he was doing. He got Lucas on his knees and made him suck that thick daddy dick. Then he threw Lucas on the bed and throated his new boy's big boner like a pro. He even teased and licked his new son's balls, and then did the same with Lucas' pulsing, hungry hole. By the time Nick stuck his dick into Lucas' ass and thrust powerfully, Lucas was puddy in his hands. He couldn't wait for the next time they'd meet up in the middle of the night.",
  "models": [
    {
      "name": "Lucas Knight",
      "person_id": 32516
    },
    {
      "name": "Nick Capra",
      "person_id": 37496
    }
  ],
  "release_date": "2015-08-31",
  "scene_id": 77445,
  "series": "My New Brother's Dad: Part Two",
  "tags": [],
  "title": "My New Brother's Dad: Part Two"
}