{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "What a sweet treat for all you strip dominoes lovers.  The game of 'bones' is played among friends by taking turns positioning dominoes together to accumulate points, based on the rules.  Today, Krave Moore has invited over two friends to have a little fun.  But Rex Cobra and Andre Donovan don't know yet that Krave has another kind of 'bones' in mind!When Rex brings out the vodka, the guys decide to play strip dominoes, with shots to boot.  The first guy peeling his shirt off is Krave.  Not too long after, Rex and Donovan are pulling their pants down and showing off their gradually swelling cocks.  Some horseplay ensues, and Krave is eventually on his knees, enjoying both hard dicks at once.  Since Krave had the most points in the game, he gets to bottom this time.  Krave is a real cock-hungry boner hound and loves being in the middle of the action.  After slobbing on both knobs for a while, he bends over so Donovan can get some nice access to his ass.  While Donovan enjoys tasting Krave's tender hole, Krave continues slurping Rex's fat, swollen cock.  Then they switch things around a bit so Rex can slide his big dick into Krave's ass.  He works his large meat in and builds to a good, solid steady fucking, the proper kind Krave likes.  This gets Donovan eager to slam Krave's tight end, so they switch things around.  Join this friendly round of strip dominoes that turns into a hot and wild fuck party before the game's even over! Enjoy!",
  "models": [
    {
      "name": "Andre Donovan",
      "person_id": 35866
    },
    {
      "name": "Krave Moore",
      "person_id": 33629
    },
    {
      "name": "Rex Cobra",
      "person_id": 37382
    }
  ],
  "release_date": "2015-08-04",
  "scene_id": 77459,
  "series": "NDE - 203 - Andre Donovan, Krave Moore & Rex Cobra",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Big Loads",
    "Black",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Playing Bones"
}