{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Neither Pierce Hartman nor Duncan Black are particularly thrilled about their parents marrying. Both step-brothers are finding that the arrangement cramping their styles. For Pierce, it's hard enough just trying to find a quiet place to jerk off anymore. So when the parents take off for the day, Pierce decides to take advantage with a little quality personal time. But Duncan catches him as he's heading out, and senses that his step-brother is up to something, so as Pierce creeps around the corner to find some privacy, Duncan lurks not too far behind, stealing a view of Pierce as he whips out his giant cock and begins thumbing through the pages of his mag. Duncan pulls out his cock and he's rock hard just watching, stroking it as he imagines what it would be like to sit on Pierce's chubby. Consumed by his desire, Duncan throws caution to the wind, and creeps up on Pierce as he strokes away, eyes closed. Duncan reaches out and grabs Pierce's cock, who is immediately startled and initially freaked out by the whole scene, but Duncan assures him there is no problem, and that it could be mutually beneficial. Pierce is so horny that he gets to a point where he doesn't even care anymore, so long as he busts his nut, and seizing on this opportunity, Duncan falls to his knees and immediately begins sucking off his step-brother. Pierce is new to the whole experience, but the better Duncan sucks him off, the more and more he warms up to the idea, so he offers to return the favor on Duncan. Duncan lays out on a stone wall while Pierce goes down on him, eyeing his sweet hole as he fills his mouth with cock. Duncan closes his eyes and grabs the side of the wall as Pierce slobbers all over him, but what he really wants is Pierce's sweet cock inside him, so he bends over and lets Pierce enter from behind. Pierce grabs Duncan by the back of the neck and pounds away at his perfect little bubble butt, before sitting down and letting Duncan ride him. Duncan grinds on Pierce's cock and it fills him up inch by inch, and as Pierce pounds away, Duncan strokes himself feverishly, losing his load as Pierce pulls out and blasts him with his own long-overdue load. As both brothers clean up, they exchange a knowing look that this is one secret they'll both be glad to keep.Enjoy!",
  "models": [
    {
      "name": "Pierce Hartman",
      "person_id": 34911
    },
    {
      "name": "Duncan Black",
      "person_id": 37371
    }
  ],
  "release_date": "2015-07-31",
  "scene_id": 77458,
  "series": "NDO - 4582 - Pierce Hartman & Duncan Black",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Outdoor",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Brotherly Secrets Part 1"
}