{
  "collections": [
    "Next Door Twink"
  ],
  "description": "What's a better combination than sex and pizza?!  Mark Long is getting hungry.  But after looking in his refrigerator, high and low, he reaches out and orders up a hot pie for delivery.  As you probably know, Mark is one of the most delicious porn stars out there, and is recognized on the street by fans constantly.  Sometimes it's a little nerve wracking, but sometimes the fans are smoking hot themselves.  James Dickson, Mark's pizza boy, is one of the sexy ones.When James Mark opens his door, James nearly pops a fat hard on right on the spot.  He's one of Mark's biggest fans!  But when James expresses his adoration, Mark brushes it off, pretending not to be who James thinks.  Mark realizes he doesn't have enough cash to give James for a tip, so he invites James in to discuss other options.  He explains that he IS in fact James's favorite porn star, and figured that since James is such a huge fan, he would let James suck his dick...instead of a cash tip!James is more than excited and goes right in toward Mark's crotch.  But Mark stops him, and pulls James face towards his own, by James's chin.  They kiss deeply for a while.  Then James finally pulls down Mark's pants and grabs his huge, swelling cock.  He goes to his knees and bobs on the thick erection.  Mark loves pleasing his fans and this couldn't be a more direct experience.  James mouth feels so good working his meat that Mark decides to go a little further and give James something to really tell his pizza-boy, pepperoni pals about.  He sets James up on a couple kitchen stools and shoves his pulsating sausage into James's sweet hole.After pounding him for a while, he repositions the appreciative delivery boy so he can slam him from behind for a bit.  Watch this fan get to fulfill his wildest fantasy when Mark Long runs out of cash and tries to make it right by giving a lot more than just the tip!",
  "models": [
    {
      "name": "James Dickson",
      "person_id": 37125
    },
    {
      "name": "Mark Long",
      "person_id": 18862
    }
  ],
  "release_date": "2015-08-12",
  "scene_id": 77456,
  "series": "NDT - 8299 - Mark Long & James Dickson",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Pornstar",
    "Tattoo/Piercing",
    "Twink",
    "Workers"
  ],
  "title": "Just the Tip"
}