{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Hijinks is always around the next corner at the neighborhood pool, especially when Archer Hart is involved.  As lifeguard, Arad, walks down the gravel pathway toward the pool, he hears a splash, then screams of distress.  Arad is extremely well-trained in water rescue, so he snaps into the mode of proper procedure.  He sprints to the pool, removes his shirt, and dives in.  Archer is floating lifelessly.  Once Arad pulls Archer out and administers mouth-to-mouth, Archer surprisingly begins giggling!  Arad realizes the entire thing was some kind of prank.  Appalled, he asks, 'seriously?' Archer, still smiling, tells Arad that he couldn't help himself, Arad is just too sexy.  Arad's upset, but not made of stone.  He can't turn down the opportunity to have his way with such a luscious Twink.  The two kiss deeply.  Archer moves downward and takes out Arad's hard cock.  Arad feels the warmth moving up and down his swollen meat.  He lets his hands run all over Archer's naked body.They move to a pool chair where Arad lifts up Archer's legs so he can experience his ass and dick.  Archer can't believe he -- sort of -- tricked the hot lifeguard into sucking his cock and licking his ass!  After a little while, Arad stands up and shoves his firm erection into Archer's tight ass.  Oh what a feeling on a hot Summer day!  This is a pairing you won't wanna miss.  Arad's insane body fucking sweet, spirited Archer poolside as warm rays beat down is a memory you'll hold onto to keep warm all year. Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Archer Hart",
      "person_id": 37489
    }
  ],
  "release_date": "2015-08-26",
  "scene_id": 77457,
  "series": "NDT - 8300 - Arad & Archer Hart",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Muscles",
    "Body-Builder",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "The Lifeguard"
}