{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Jace has been having issues with sleeping as of late and can't get any rest at all. His sleepless nights are catching up with him and he really needs to find a solution. In comes Dr. Romero whom after an extensive look at his X-Rays has diagnosed the problem but to make sure he is correct he needs to put Jace under so he can see how exactly he sleeps. Dr. Romero puts the oxygen mask on Jace and has him lay back while he goes out for a few minutes to let the gas kick in. Jace is passed out when Dr. Romero comes back to the room and he makes sure Jace is asleep by waving his hand across his face which gives no response. Dr. Romero notices that Jace has a huge boner under the sheets which is protruding straight up. He looks around and slowly pulls the sheets down and grabs on his fat cock. Just before Dr. Romero is about to wrap his succulent lips around that throbbing cock Jace wakes up horrified to see his doctor about to suck on his dick. Dr. Romero tells him everything will be ok and to just lay back and relax while he eases Jace stress. The doc is in or I should say Jace is in as he face fucks the doctors lovely mouth until his jaw wears out. Dr. Romero wants to feel all the rigidness from that sexy cock so he mounts up onto the bed and slowly sits on Jace's aching cock balls deep. Jace pumps upward into his doctor deep and hard thrusting as much as he can to release the tension being built up. Fully awake now Jace bends Dr. Romero over the doctors table fucking him with all his strength as his balls slap against the soft hairy ass. Jace can now feel his balls filling up with all the juicy creamy cum he flips Dr. Romero over onto his back and finishes pounding his tight hole until they both let loose all the sticky cum that has been built up. Jace feels extremely better after seeing his Doctor but he has to come back for a follow up visit to make sure his sleeping is up to par. <br><br>Enjoy!",
  "models": [
    {
      "name": "Alessio Romero",
      "person_id": 28032
    },
    {
      "name": "Jace Chambers",
      "person_id": 28094
    }
  ],
  "release_date": "2015-08-27",
  "scene_id": 77460,
  "series": "EBD - 485 - Alessio Romero & Jace Chambers",
  "tags": [],
  "title": "Bedside Manner Part 1"
}