{
  "collections": [
    "Active Duty"
  ],
  "description": "My goodness, what a pleasure it is to introduce this young man!  Quentin is the REAL deal, an incredibly sexy soldier who's only been on leave for about a week now.  Claude wrangled this fine recruit and chats briefly with him here on camera.  Quentin seems very at ease talking to Claude, and in fact, looked pretty comfortable stroking his meaty cock for the camera.  We're gonna get to see Quentin again, which is something I know you'll be looking forward to.  This boy is just too delicious to have only one serving! </br></br>Once the pants come off, we get to see Quentin's hard, juicy dick.  He's very well groomed and his cock is exquisitely shaped.  He has a wonderful style of pleasuring himself.  He goes at a steady, medium pace, and most of the time lets his hand run all the way over the top of his erect dick, and all the way back down through the base.  I can't wait to see him employ this technique on a partner!  </br></br>When Quentin turns around and bends over, we get to see his bubbly, shapely ass up close.  He continues stroking, pushing his cock back through his legs, up toward his nice, tight-looking hole.  He knows what we wanna see, and in Quentin's case, he smacked the nail on the head, that's for sure.  Quentin goes back into some nice, deep stroking, then gets to some pillow fucking.  Even when he's humping a pillow, that passion and intensity comes through.  It's also an opportunity to admire a very strong portion of Quentin's physique.  </br></br>This is a strong solo from a very hot, very passionate guy.  My hopes are particularly high for Quentin.  I think you and Claude would agree that this young recruit has amazing, bright star potential.  ",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2015-07-22",
  "scene_id": 77463,
  "series": "Quentin",
  "tags": [
    "First Time",
    "Jerk Off",
    "Muscular",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Quentin"
}