{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Lucas Knight has stopped by the shoot house for one final farewell, as he takes his talents to the world of dance and gives up this life of sordid, sultry affairs. But before he does, Lucas decides to give it one last go. No pretense, no storyline, just him, his giant cock and his favorite scene partner from the past: Drake Tyler. Drake and Lucas were in a scene not too long ago and both guys rank it right up there with their most memorable ever, so they decided to reunite for one final, carnal encounter. <br><br>As soon as Drake enters the room, Lucas' eyes light up and his cock stiffens. Drake wastes no time going for Lucas' crotch, unzipping his pants and pulling off his tiny undies, slipping Lucas' massive cock deep down his throat, gagging on it and teasing the head with his tongue. Lucas strips out of his clothes and is rock hard as Drake gags on his dick, and getting hornier by the second, he pushes Drake onto his back to strip him down and return the favor. Drake hardens up inside Lucas' mouth, and then Lucas flips him over and slides a finger into Drake's hole, finger fucking him from behind as he strokes his cock and prepares for insertion. <br><br>Once plunged inside, Lucas pounds Drake's ass with the kind of passion that could only come from someone laying it all on the line one last final time, and Drake can sense it, as Lucas continues to rock his world, his dick gets hard enough to cut diamonds, and when Lucas throws him onto his side and continues to fuck from behind, Drake jerks his dick, spewing a load as Lucas thrust away, before taking Lucas' final load all over his sweating, cum covered body. Parting is such sweet sorrow. So long Lucas. You're welcome back anytime!<br><br>Enjoy!",
  "models": [
    {
      "name": "Drake Tyler",
      "person_id": 32530
    },
    {
      "name": "Lucas Knight",
      "person_id": 19957
    }
  ],
  "release_date": "2015-08-06",
  "scene_id": 77483,
  "series": "NDB - 4583 - Lucas Knight & Drake Tyler",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral"
  ],
  "title": "Farewell Lucas Knight"
}