{
  "collections": [
    "Next Door Casting"
  ],
  "description": "Markie has busted out his selfie stick and is messing around with GoPro when Rocco informs him he's got a visitor waiting on the casting couch. Harley Hardman is a lean sexy stud with a loose attitude and a jovial nature, not to mention a nice cock that he's ready to show off.Markie immediately is enamored with Harley's body and can't keep his hands off of him, as they begin making out as soon as Markie sits down. Ripping his clothes off, Markie drops to his knees and begins sucking off the noobie, who gets nice and hard inside Markie's mouth. But Harley shows he can give as well he receives when he flips Markie onto his back and returns the favor, downing Markie's hard dick and spitting on the head, teasing Markie's hard on along, before stroking himself hard and bending Markie over. Markie takes Harley's cock deep inside him, as Harley pushes up against his ass, slapping his balls against Markie's stomach as they continue to fuck doggy style on the couch. Once Markie's had his fill, he tests Harley's bottom, mounting him from underneath as Harley bounces up and down on Markie's cock. Harley takes a dick like a real natural, stroking his own hard dick as Markie continues to pound, before they switch up one last time, and Harley tries to fuck the cum right out of Markie. Markie lay on his back while Harley pounds away, and he succeeds as Markie loses his load all over himself as Harley pulls out and explodes as well. With both guys shagged and glistening, Harley's smile lights up the room like a kid in a candy store. Surely he enjoyed himself, but is it enough to make him a full time fixture on the Next Door scene?You decide.Enjoy!",
  "models": [
    {
      "name": "Harley Hardman",
      "person_id": 37383
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2015-08-05",
  "scene_id": 77485,
  "series": "NDC - 126 - Harley Hardman",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Blonde",
    "Blowjob",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Straight Men"
  ],
  "title": "Casting Audition: Harley Hardman"
}