{
  "collections": [
    "Active Duty"
  ],
  "description": "This time, we've got a very well-rounded, very sexy encounter on our hands and we'll need every soldier manning his post!  It's Markie as the pivot man for James & Michael, each of the three bringing wonderfully unique energy to the encounter.  From the gates, Markie and Michael can't keep their hands off each other for long.  As soon as the undies come off, Markie is reaching for Michael, and vice versa.  I think, perhaps, Markie might have sensed James's reluctance here.  I know Michael certainly is acquainted with James's comfortability levels.  But it's not long after Markie and Michael get going that James comes right along, just like a sad puppy dog.  James reaches over to Markie, strokes his leg, and Markie returns the affectionate gesture with some sweet attention.  From there the boys get into some good, deep sucking.  Markie slurps down Michael's fine cock like he'd been down in the barracks for days.  And at the same time, we see James bobbing on Markie's hard dick with some impressive fervor!  It was the first real 'wow' moment for me during this interaction.  It's all a lead up to a BIG first for James...taking a hard throbbing cock at each end!  Yes troops, we're seeing a young soldier's limits pushed back.  This is significant ground gained here.  James takes Markie's dick in his ass while sucking Michael's big dick.  He does the best he can to work Michael's cock with his mouth, but after a while, the pounding from Markie becomes too intense.  We see that James's hole is still very tight.  He ends up putting all his energy into enduring the hard pounding from powerful Markie.  Look at those goosebumps on James's ass while getting fucked!  Boy, these are the first encounters James won't ever forget...and neither will these other recruits!Before they each blow their hot cum loads, they line up on the bed next to each other so they can enjoy watching each other blast.  Enjoy the action!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 37269
    },
    {
      "name": "James III",
      "person_id": 37283
    },
    {
      "name": "Michael II",
      "person_id": 37370
    }
  ],
  "release_date": "2015-07-19",
  "scene_id": 77515,
  "series": "Markie, Michael & James",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "First Time",
    "Gay",
    "Jerk Off",
    "Kissing",
    "Muscular",
    "Sandwich Fuck",
    "Smooth",
    "Tattoos",
    "Threesome"
  ],
  "title": "Markie, Michael & James, Scene #01"
}