{
  "collections": [
    "Pride Studios"
  ],
  "description": "Billy is off on a long needed vacation to a cabin he rented deep in the woods. He thought it would be a great idea to get away from city life and all the daily drama but he finds himself lost on the road not being able to read a map as well as he thought and eventually makes it to the cabin where he finds out that it is pretty much a dump. He has no internet no nothing and begins to doubt himself. This could have been the worst idea Billy has ever acted on until a strong, tall hunk of a man shows up one day. Josh lives not far away from Billy and can see that he is a city slicker with no clue how to go about daily life out in country. He offers some friendly advice and lets him know that he can come by anytime he wants. Bugs are frequent, the heat is insane and the humidity is driving Billy crazy. He goes to meet up with Josh to see if he can help him with cutting some wood for a fire later but Josh tells him the wood is soggy from the hot rains the other night and that he should wait another day before cutting it. Billy agrees and walks off into the dense country side. Minutes go by than hours as he realizes that he is lost and can't find his way out of the thick brush. He yells for help but nobody is around for miles and his frustration kicks in amidst the uncanny heat he is facing. It's becoming darker and darker so he finds a spot to lie down and uses an old palm tree flon to cover himself up with. Josh can't find Billy at his cabin and begins to worry that the city boy has lost his way so he goes out to find him and sees him passed out on the dense woodsy ground from possibly dehydration. He lifts him up and takes him back to his cabin where he undresses him and waits for him to wake up. Finally Billy wakes up confused but coherent and thanks Josh for saving him. Billy has wanted Josh since they first met and now is the best time to make his move. Billy moves in for the kiss and they both begin to caress and kiss all over each other's hot steamy bodies. It's a sultry man on man fantasy where Billy gets all he wants from the country boy and fucks him passionately. They both gaze into each other's eyes as they fondle, suck and worship one another's chiseled bodies. The intimate passion finally concludes with both sexy men releasing the built up cum residing in their balls all over Josh's chest. Looks like Billy might be cuming back to his cabin retreat for some more relaxation. <br><br>Enjoy!",
  "models": [
    {
      "name": "Billy Santoro",
      "person_id": 32561
    },
    {
      "name": "Josh Peters",
      "person_id": 37366
    }
  ],
  "release_date": "2015-07-29",
  "scene_id": 77516,
  "series": "Pilot 2 - Billy Santoro & Josh Peters",
  "tags": [],
  "title": "Timberwood Escape"
}