{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Joey Moriarty stumbles into his living room, he finds his wife's brother Dante doing some summer cleaning. Dante, never the shy one, dusts in his skivvies as he listens to his headphones, shaking his sexy tight ass as he goes along. Joey stops short when he sees Dante dancing on a table, and decides to watch his brother in law and see what  he's got. To his surprise, Dante is actually quite the dancer, so when he turns around and catches Joey spying on him, Joey quickly shifts the conversation away from perving out on his family to Dante's prowess as a dancer, asking him for a few pointers or tips on the dance floor. Dante obliges, and guides Joey through some basic steps, grabbing his less coordinated hips and personally moving them himself. Dante's hard on brushes up against Joey's back, and as Joey notices, he seems a little taken aback but not necessarily all the way put off, so Dante uses the opportunity to explore Joey's intentions, and whether or not he'd be willing to learn a few more choice moves. Seconds later, Dante and Joey are locked in a kiss, shedding layers of clothing and making their way to the sofa, where Dante rips off Joey's shorts and begins to suck him off, his own underwear half pulled off him as he gags on Joey's straight hard dick. Joey pushes his head down further, choking Dante as spits all over the shaft, and with his cock sufficiently hard, Joey flips the tables on Dante- literally- laying him out on the coffee table as he lifts his legs and begins to eat him out. Joey tongues Dante's hole until its ready for Joey's meatstick, and when Dante can stand it no longer, Joey gives him the high hard one, pumping him deep in missionary on the table as Dante strokes his own cock.  Joey shifts him onto the bed, hitting Dante's perfect bubble butt from behind as Dante takes every inch like a champ. Joey fucks Dante as hard as he can, much harder than his wife would ever allow, and Dante never flinches, pushing Joey back onto the coffee table and mounting him reverse, grinding against him, riding his cock as he strokes his own into orgasm, launching his load all over the room as Joey continues to pound away from behind. When it's Joey's turn, he pulls out and blasts his load all over Dante's waiting face, and as he opens his eyes from the release, he realizes Dante has not only unlocked his inner dancer, but perhaps something else as well.  Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Joey Moriarty",
      "person_id": 35535
    }
  ],
  "release_date": "2015-08-07",
  "scene_id": 77542,
  "series": "NDO - 4584 - Dante Martin & Joey Moriarty",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Brunette",
    "Climax",
    "Condom",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Straight Men",
    "Uncut cock"
  ],
  "title": "My Wife's Gay Brother"
}