{
  "collections": [
    "Active Duty"
  ],
  "description": "Boy, am I glad to be bringing you this gem of a match up.  Two of my favorite recent recruits, Quentin and Michael, finally together, just as I had imagined, after I first saw Quentin's solo.For me, and I would wager most of you dedicated troops as well, Quentin is simply irresistible.  From that first solo, I've been waiting with dick in hand to see him bottom for a take-charge type of recruit, exactly like Michael.  I can tell Quentin is a fast learner and is eager to mix with fellow recruits.  Claude did another bang-up job this time; I couldn't have squeezed better moments myself from this encounter.  My impressions of Quentin really came from Claude's great interactions with him.  'You like that big cock in your ass?' we hear Claude ask Quentin while Michael is slow-thrusting in and out.  This was an incredibly hot moment.  He smiles that wickedly cute smile and tells the camera that he 'loves' getting fucked by Michael.  Michael definitely loves to make full use of his lusciously large dick.  His focus and intensity were two of the things that contributed to making this pairing so choice.  I can tell that in a different situation, Quentin would easily adapt to being fucked by a more laid-back recruit, but I think getting slammed by someone like Michael for his first time was a great thing to see.  It was a nice yin and yang blending that made it work so well.  After seeing this, I think Quentin would do very well with someone like Gage.  Gage is, by now of course, very comfortable and has become such a great member of our Active team.  Gage is so full of great, fun energy that I think he would do a number on Quentin to bring out his natural, happy-go-lucky personality that I know is there.  Hmmmm, perhaps the two of them sharing nice, stiff cock??  I think that would work!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Michael II",
      "person_id": 37370
    }
  ],
  "release_date": "2015-07-26",
  "scene_id": 77627,
  "series": "Quentin & Michael",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Quentin & Michael, Scene #01"
}