{
  "collections": [
    "Extra Big Dicks"
  ],
  "description": "Dr. Romero is having a study to find out if big dicks cum more than the average cock and his two specimens have some very nice big cocks for this experiment. Jace and Peter are waiting patiently in the waiting room to find out exactly what this program entails.  Dr. Romero arrives and tells them what to expect and to make sure they get their full load in the tiny jar he gives them. They have magazines and lube to assist them while they both masturbate in separate rooms. The nurse comes in and leads them to their rooms. Peter is excited and pulls his pants down as soon as he sees the magazines. He searches for the lube as he pulls on his limp dick making it grow bit by bit. His cock his hard as a rock now and fully lubed so his hand glides along his shaft as he strokes it.  All of a sudden Jace comes barging in and scares Peter but he tells him not to worry because it's probably more fun if they are in the same room together. They both grab each other's cocks and give a helping hand. Rubbing their big fat cocks together stroking them with ease and then Dr. Romero comes walking in rather surprised since they are in the same room. Jace tells the doc to join in and with no hesitation the doc is on his knees service the two big juicy cocks. Down on his knees with a cock on each side of him Dr. Romero goes back and forth sucking, stroking and spitting on their sexy dicks. His jaw is getting tired trying to stuff these big dicks in his mouth so he stands up and bends his ass over and waits for Peter to push deep into his ass. Both of the subjects take turns fucking Dr. Romero in a few positions until they blow their loads all over him and then they all realize that they will have to come back again to actually fill the bottles up.   Enjoy!",
  "models": [
    {
      "name": "Alessio Romero",
      "person_id": 28032
    },
    {
      "name": "Jace Chambers",
      "person_id": 28094
    },
    {
      "name": "Peter Fields",
      "person_id": 37564
    }
  ],
  "release_date": "2015-09-17",
  "scene_id": 77684,
  "series": "EBD - 488 - Alessio Romero,Jace Chambers & Peter Fields",
  "tags": [],
  "title": "Bedside Manner Part 4"
}