{
  "collections": [
    "Active Duty"
  ],
  "description": "Hey Troops,Well this one went even better than I woulda betcha, and if you recall what I had said before about Brad, that ain't nothin' to sneeze at!  Wow, Brad really surprised the heck outa me.  And of course, Markie knocked it outa the park, as we're learning is sorta his thing.  At Active Duty, I tend to put our soldiers into loose categories, at least in my own mind.  Markie is sliding himself right into a spot as one of our strongest platoon leaders.  This was an excellent opportunity for Markie to shine, and he certainly grabbed the bull by the...horn!Brad plays it very cool from the get go.  Claude leaves the boys and Brad goes right on chewing his gum, then eventually pulls his big, gorgeous cock out.  By that time, of course, Markie had already been completely naked and enjoying his raging hard on.  They stroke together on the couch for a little while and we catch Brad stealing quick glances at Markie's dick.  Claude comes back and suggests they move to the bed to get even more comfortable.  Before too long, Brad is diving in...head first.  He pulls the trigger and takes Markie's deliciously swollen erection into his mouth.  My golly, the sight of these chiseled bodies working on each other is enough to give any honest man a case of the vapors.  Markie's body is ridiculous -- he couldn't be more perfectly defined.  And Brad is just as unbelievable.  For lovers of strong, well-built servicemen, this one's as peachy as it gets!  And I was so glad Claude swooped around so we could get a tight look at Brad's ass before Markie goes where no man had before. Then it finally comes time.  Brad puts his massive cock into Markie's ass for the first time he would ever fuck a man (and hopefully not the last).  Claude get nice and tight again and we see Brad's plump ass really cranking.  Markie is a joy to watch and hear get fucked.  He's truly a lover of sex and he wears his ecstasy on his sleeve.  I love when Claude moves up and gets a view from over Brad's big shoulders.  From here we see Brad pumping like a real soldier, trained to adapt to new situations.  In these first moments, we see Brad really get into the sex.  He's determined and stalwart...and enjoying himself more than he thought he would!Finally, we join the two in bed for a finishing jerk off, side by side.  It's a cathartic final stretch for these soldiers.  They each came into this with their own expectations and feelings.  They both closed the session stronger recruits.  I couldn't be happier about Brad's progress.  He continues to be willing, eager, and determined.  And in Markie, I think we may have a near-future, high-ranking dude on our hands.  Only time will tell how they each will grow and move toward realizing their fullest capabilities.  For now, I'm just glad we got to watch this one!",
  "models": [
    {
      "name": "Brad Banks",
      "person_id": 37394
    },
    {
      "name": "Markie More",
      "person_id": 37269
    }
  ],
  "release_date": "2015-08-02",
  "scene_id": 77819,
  "series": "Brad & Markie",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Brad & Markie, Scene #01"
}