{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "When Jay Black requested a dominant, thick-dicked boy to come over and fuck him, they sent Bam Bam.  Jay asked that a 'prepper' show up ahead of the main course in order to bind his wrists and feet.  The service accommodated and by the time Jay's order arrived, everything was in place.<br/><br/>Jay began to drift off as he waited.  When Bam Bam entered his bedroom though, Jay became completely awake.  He looked him up and down.  <br/><br/>'They sure got it right this time,' Jay thought to himself.  <br/><br/>Bam Bam was gorgeous.  He was extremely well hung and had desire in his eyes.  Jay could tell Bam Bam had engaged in similar behavior before.  This wasn't new to him, but he could tell Bam was very hungry for his ass.  <br/><br/>Bam laid atop Jay and they grinded against each other, kissing passionately.  Bam's enormous cock grew harder as it rubbed between Jay's balls and thigh.  Bam Bam began sucking Jay's fat dick as he still lay there bound.  Bam then untied Jay's feet and fucked his asshole with his tongue.  It all felt so good.  It was scratching the itch Jay had had for quite some time.  <br/><br/>Then he untied Jay's hands.  Jay moved down and sucked Bam Bam's gargantuan erection.  Bam flipped onto his stomach and allowed Jay to continue sucking, while enjoying some of Bam's ass simultaneously.  <br/><br/>Next, Jay pushed his swollen cock into Bam's hole.  He fucked slow, then quite fast and hard.  Bam Bam lamented loudly in ecstasy.   Jay threw his head back and let his hips slam into Bam with great power.  <br/><br/>And then they switched.  Jay laid back down on his back, tied his dick and balls up with some of the rope that had been around his wrists.  What Bam Bam does from there must be witnessed to be believed.  Join these two and watch.  It's an incredible end to a very extraordinary sexual encounter.  <br/> <br/>Enjoy!",
  "models": [
    {
      "name": "Bam Bam",
      "person_id": 3033
    },
    {
      "name": "Jay Black",
      "person_id": 30932
    }
  ],
  "release_date": "2015-08-18",
  "scene_id": 77818,
  "series": "NDE - 204 - Bam Bam & Jay Black",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Black",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Knotty Boys"
}