{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Realty is a cutthroat industry, and a good agent will do whatever he can to close the deal. Abel Archer lives by this mantra, and it has served him well. Alex Greene is still learning the ropes of the industry, but the up and comer has got Abel's attention, for more reasons than just business, so when the two of them arrive at the same listing, there is more than just comptetitive juices flowing. Alex can sense Abel's scheming ways, but he really wants the commission from this listing, so when Abel makes him an offer to 'share interests', Alex stands firm in attention.Luckily, that's just what Abel has in mind, as he drops to his knees and unzips Alex's pants, letting his massive cock fall out of his shorts and taking it deep into his mouth. Abel downs the cock in front of him as Alex fucks his mouth, gagging Abel with his length before flipping him over onto the bed and moistening up Abel's hole. Abel bends over as Alex preps him for penetration, and he's rock hard as his protege' licks him up and down, pulling out his cock and shoving it into Abel as he crouches on the bed. Alex fucks him hard, grabbing his tie and holding Abel in place as he continues to pound away, then they flip and Abel rides Alex's meatstick to his heart's content, grinding on Alex's rod as his ass slaps Alex's stomach. Alex flips Abel around one last time, hovering over him as he thrusts his dick in and out of Abel's sated body, pulling out to blast Abel with a load to the face that drips from his lips and down his chin. Enjoy!",
  "models": [
    {
      "name": "Abel Archer",
      "person_id": 36223
    },
    {
      "name": "Alex Greene",
      "person_id": 37421
    }
  ],
  "release_date": "2015-08-20",
  "scene_id": 77848,
  "series": "NDB - 4587 - Alex Greene & Abel Archer",
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Condom",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Rimming"
  ],
  "title": "Cocky Realtors"
}