{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Kyle Evans is the new boy in town.  He's been too shy so far to introduce himself to other guys he's seen, especially Scott Harbor.  Scott is the hot boy who's a whiz on the basketball court.  Kyle heard Scott was on the Senior Varsity team at his school and is probably the coolest guy alive.  When Kyle finds himself at the park with Scott, things get very interesting.As Scott shoots hoops by himself on the court, Kyle looks on from a tire swing.  Kyle admires Scott's meat, bouncing all around underneath the thin layer of his gym shorts.  When Scott notices Kyle checking out his junk, he does a very conspicuous 'readjust' and gives Kyle a wink.  This made Kyle so nervous, he thought his heart would pump right out of his chest!  Then Scott actually came over and introduced himself.  Kyle could hardly look him in the eye.  He told Scott he was new in the area and Scott seemed to have a wonderful idea.  He lead Kyle over to an old barn nearby and took him around the back.  When they were out of plain sight, Scott told Kyle that he wanted him to suck his dick.  Kyle couldn't believe what he was hearing.  His first instinct was to bolt.  But he knew how much he would regret it, even if it meant pushing past his nerves.  Scott saw how freaked Kyle was, so he did his best to talk calm him down.  Scott asked if he was a virgin, and Kyle replied that he was.  This made Scott ecstatic, and finally Kyle went to his knees, pulled down those gym shorts and took Scott's hardening cock into his mouth.  He sucked, just like he had seen done in dirty movies.  Scott threw his head back and smiled, enjoying the virgin lips pleasuring his thick muscle. Scott pulled Kyle to his feet, spun him around, and pulled his pants down.  'You won't be needing these,' he said to Kyle with a grin.  Scott spread Kyle's ass cheeks apart and tasted his sweet, tender hole.  It felt so good, Kyle thought his dick might burst right then!  But it didn't, and Scott began sucking Kyle from behind.  After some of this, Scott stood up and slid his pulsating erection into Kyle's ass.  It felt even bigger than it looked.  Kyle couldn't believe he was losing his virginity to SCOTT HARBOR!  This was his ultimate fantasy.  Join them both behind the old barn and find out what it's like to fuck the hottest guy in town, and what it takes to be cool.",
  "models": [
    {
      "name": "Kyle Evans",
      "person_id": 37541
    },
    {
      "name": "Scott Harbor",
      "person_id": 37540
    }
  ],
  "release_date": "2015-09-09",
  "scene_id": 77874,
  "series": "NDT - 8301 - Scott Harbor & Kyle Evans",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Outdoor",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "How To Be Cool"
}