{
  "collections": [
    "Next Door Originals"
  ],
  "description": "It's just another day at the office for Harley Hardman. As he pores over speadsheets and progress reports, the afternoon slog catches up to him and he feels himself start to crash. It is just at this moment that his secretary informs him there is an officer present to see him. Though he cannot think what it could be about, Harley sees the officer immediately, and his first thoughts are that Arad is both a hunk of cop and also the strong silent type. For his part, Arad says nothing and carries a big stick. Well, two big sticks if you count the one in his pants. Harley is visibly concerned when Arad sits him on the couch for interrogation, but his reluctance turns to confusion when the officer begins to undress him. By the time Arad has his cock in his mouth, Harley is fairly sure this isn't a regular cop, so he decides to go with it, pushing Arad's mouth down further onto his cock as his dick gets harder and harder. However, Arad didn't come just to hand out justice, but also to recieve it as well, so Harley reciporcates head, blowing Arad as he begins to take off his uniform. Harley still has his tie on when Arad bends him over his desk and fixes him with cuffs, pinning Harley's hands against his back as Arad plunges his cock deep inside the waiting executive. Harley bites his lower lip as Arad contiues to pound, bringing him back over to the sofa and banging him missionary, letting Harley out of the cuffs just in time for him to stroke himself off, before Arad pulls out and blasts him with a load of his own, discharging his weapon and emptying his pistol all over Harley, before answering the call of duty at another location, leaving Harley to wonder what exactly just happened.",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Harley Hardman",
      "person_id": 37383
    }
  ],
  "release_date": "2015-08-21",
  "scene_id": 77975,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Hardcore",
    "Interracial",
    "Masturbation",
    "Mature",
    "Oral",
    "Slim",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Office Surprise"
}