{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Zane Porter has an important decision to make. On one hand, he can get married to the fiance that his parents have picked out for him. On the other hand, he can run away with Drake Tyler. Choice A means he will inherit the trust fund, the brunches, the sad sex on a bear skin rug while he secretly dreams of an escape. Choice B means he trades in all the luxuries for the privilege of having Drake at his side, and to be honest, Zane is leaning this direction, but he has to know for sure that he's made the right choice, so he's asked to speak to Drake in private.Upod seeing his secret flame, Zane's body tenses up, and he wants nothing more than to attack his crush with every ounce of energy inside him. Drake can sense the electricity between them, and pulls Zane in closer. They kiss as Drake runs his hands down Zane's back, and Zane quickly falls to his knees, taking Drake's cock into his mouth. Zane pushes Drake up against a tool shed and it makes a dull thud as Drake's cock grows harder and harder. Drake turns the table on Zane, and with pants around his ankles he drops and takes Zane's rock hard dick into his mouth. Zane closes his eyes has he imagines a lifetime of this sweet sweet feeling, but just then, the guys hear footsteps in the distance.They hurry into the gym and Drake keeps lookout as Zane penetrates him from behind, pumping and pounding his ass like it could be the last time. Drake feels every inch of Zane as he slides in and out, and Zane slaps Drake on his ass and really gets into it, before they move over to the bench and Drake rides Zane's cock like there was no tomorrow. Zane flips Drake over and grabs the bar for leverage, pounding away at Drake missionary style, fucking the cum right out of Drake as he spooges all over himself, before Drake pulls out and coats him with his load of Destiny. In the throes of the aftermath, it becomes clear to Zane the choice he must make.And that's the last anyone saw of either Zane Porter or Drake Tyler.Enjoy!",
  "models": [
    {
      "name": "Drake Tyler",
      "person_id": 32530
    },
    {
      "name": "Zane Porter",
      "person_id": 37299
    }
  ],
  "release_date": "2015-09-03",
  "scene_id": 77976,
  "series": "NDB - 4591 - Zane Porter & Drake Tyler",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Tattoo/Piercing"
  ],
  "title": "Love Or Money"
}