{
  "collections": [
    "Icon Male"
  ],
  "description": "Dirk Caber is out on the deck in the Autumn sun, gazing down the road at a young athletic man, Wolf Hudson, walking up the driveway wearing denim and work boots. Dirk gestures for him to come toward the house, inside. Wolf is friends with Dirk's son, which is why they've been hiding their attraction to each other. Dirk expresses how long he's wanted to touch him, and is honestly surprised that Wolf decided to come out to the cottage. Knowingly, Wolf leans in and initiates a kiss which soon turns into a heavy make-out session. Wolf licks Dirk's ear driving him wild, but not quite as much as when he licks the older man's nipple. Daddy is in bliss as they dry hump, and he licks the younger man's armpit. It isn't long until Wolf tears off Dirk's pants and starts to lick and suck his balls. Dirk, unable to contain his excitement reaches out and palms Wolf's ass through his jeans, soon reaching inside to discover this forbidden young man's thick rod. Wolf plays with Dirk's ass, fingering it with his wet index, and sucks his dick voraciously. Wolf flips his buddy's dad onto his stomach and takes him from behind, fucking him and kissing him sensually. As Wolf is pounding Dirk's ass, streams of precum are flowing from the tip of the older man's cock, and Wolf flips him fully onto his back from his side and passionately pounds his ass, hitting his prostate on every thrust. Dirk finally lets himself go and cums all over his stomach. Watching the older man come is enough to bring Wolf over the edge, and he cums right over Dirk's stomach. Sweatily they embrace, lips locked.",
  "models": [
    {
      "name": "Wolf Hudson",
      "person_id": 36284
    },
    {
      "name": "Dirk Caber",
      "person_id": 36926
    }
  ],
  "release_date": "2015-08-27",
  "scene_id": 77986,
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Mature",
    "Muscular Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex"
  ],
  "title": "Guys Kissing Guys, Scene #04"
}