{
  "collections": [
    "Icon Male"
  ],
  "description": "Sugar Daddy Adam Russo doles out cash to Wolf Hudson as they're setting the mood and getting ready for a night of drink, cash and kink, featuring three sided debauchery. Money flies as JD Phoenix dances for Adam, shaking his tight ass in his blue and white briefs while Wolf humps suggestively, teasing his Sugar Daddy. Adam is a dominant who prefers to keep company with younger guys, and isn't shy about greasing the wheels. Wolf is more than happy to oblige him, because older guys know what they like and it helps him pay the rent. But, when JD is looking for a little more money, Adam wants a piece of his ass in return. JD starts to suck Wolf's dick on Adam's command, while he pulls down those briefs to expose his pink hole and Daddy dives face first into the boy's sweet ass. It's a feast for the senses, and everyone's got something to play with. Adam watches while Wolf Fucks JD first, stretching him just enough for Daddy to take his turn. JD is loving every second of the pounding he's getting, eventually getting his own turn at penetrating his benefactor, sharing Adam's Daddy-hole with Wolf. After being pounded while watching JD jack his young cock, Adam cums all over his hairy belly. As he's coming, his pulsating asshole brings Wolf to the edge, and isn't far behind, pulling out to blow a second load all over Adam's stomach. JD is last to come but not least, sharing his seed coming on and in Adam's mouth. He leans in for a tender kiss sharing his come, tasting himself on Adam's tongue and in his beard.  JD and Wolf are lying in bed, reflecting on the freaky goings-on of the evening. Wolf gives JD some advice, to milk it while it lasts.. Sugar Daddies love to pay to play while they're young. JD exclaims that he loves his job, but Wolf has been in the game longer and sees the nonsense in it.",
  "models": [
    {
      "name": "Adam Russo",
      "person_id": 35627
    },
    {
      "name": "Wolf Hudson",
      "person_id": 36284
    },
    {
      "name": "JD Phoenix",
      "person_id": 36928
    }
  ],
  "release_date": "2015-08-11",
  "scene_id": 77987,
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "College",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex",
    "Threesome"
  ],
  "title": "Sugar Daddies, Scene #01"
}