{
  "collections": [
    "Icon Male"
  ],
  "description": "Conner comes over to find Mike Demarko sitting on the stoop. He needs to talk for a few minutes, but Mike is hesitant. Mike just found out that Conner is set to marry his sister, who he started dating her behind his back. Conner came to apolgize, but Mike makes hurtful comments, touching a nerve in him when he says that Conner was just experimenting with him. Mike tells Conner to go, but he just puts his hand on Mike's thigh, waiting for a response, subtly asking whether that's what he really wants...<br><br>Conner knows Mike is hurt, and he moves in for a deep kiss, the electricity between them like sparks jumping a short circuit. Conner pushes Mike onto his back and kisses on his chest, tonguing his nipples. His mouth slowly moves down to the bulge in his jeans, and he kisses it gently, taking them off to reveal tenting white briefs. Conner takes Mike's stiff member into his mouth, moving up and down the stiff shaft. <br><br>Mike stops Conner, and he begins to reciprocate, kissing him passionately as his hands explore, touching his chest, his firm cheeks.. Conner lays Mike down on the bed and begins to fuck his furry ass. As the momentum increases Mike moans in ecstasy. Climbing on top of Conner, he begins to ride him as their lips lock, and their tongues intertwine. Conner flips Mike onto his back and Mike explodes onto his belly, thick white ropes of cum. Conner cums shortly afterward, and lays down on the exhausted bottom, kissing him passionately.",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 35738
    },
    {
      "name": "Mike Demarko",
      "person_id": 35781
    }
  ],
  "release_date": "2015-08-06",
  "scene_id": 77983,
  "series": "Guys Kissing Guys",
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex"
  ],
  "title": "Guys Kissing Guys"
}