{
  "collections": [
    "Active Duty"
  ],
  "description": "Well, thanks to Claude's very special charm, we've been blessed with another appearance from Christian.  You might remember how enamored I was with Christian's beautiful, tight hole.  I said then that I was hoping he would be back, and paired up with someone aggressive, who might help Christian start to come out of his shell a bit.  What a winning match up!  When Michael's big, strong cock came out to play, Christian couldn't hold himself back.  He pounced on that juicy boner like a cock-starved animal!</br><br>Michael likes to show these fresh, timid recruits that he's boss right from the get go.  And I'll be damned if they don't take orders well every time.  We see Michael here tell Christian plainly but sternly, 'Suck my cock.' Christian was already salivating!  He wraps those nervous lips around Michael's meaty cock and takes it deep, like a soldier willing to accommodate any request from such a dominant, hungry fellow recruit.</br><br>  After we have the privilege of seeing Christian fucked for a good little while, Claude gets him to lay on his belly and spread that tasty ass apart.  He sure shows us the goods.  Claude gets nice and tight, and we get another good look at his inviting, eager hole.  Yummy!  It's just after that when we see Michael really get serious and deliver a nice, hard fucking.  I love the sounds Christian lets out.  You can tell he's struggling to take such a large dick.  This is a wonderful opportunity to witness some excellent progress.  Kick back and savor these moments that are sure to prove instrumental in the personal development of both these fine recruits!",
  "models": [
    {
      "name": "Christian III",
      "person_id": 37411
    },
    {
      "name": "Michael II",
      "person_id": 37370
    }
  ],
  "release_date": "2015-08-09",
  "scene_id": 77991,
  "series": "Michael & Christian",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Michael & Christian"
}