{
  "collections": [
    "Icon Male"
  ],
  "description": "Ian Levine is lounging out in Nick Capra's bed, enveloped by luxury bedding, musing about where his life has taken him in the last 24 hours. Nick comes into the bedroom carrying breakfast for him and sensually, he feeds him a strawberry. Nick's introduction to the world of a kept boy intrigues Ian, and Nick is clear that his boy will need to get used to the pampering he can offer, and asks Ian if he's willing to help him. Because as long as he will help Nick, he will help Ian in return. <br><br>Ian's unsure about the arrangement and asks how he could possibly help Nick out. The older man puts him at ease, saying he wants to be able to worship his little prince, while touching Ian's smooth stomach. As long as Ian lets him enjoy his youth and beauty he is helping him. Ian can't help but worry about what he's getting himself into, but he thinks of his boyfriend and what it could mean to be this man's paramour. <br><br>Nick kisses Ian, and slowly moves down to his hard dick. Ian's tight abs flex as he's enjoying what his daddy is doing. Nick slaps Ian's dick upon his face, teasing and sucking hard on the boy's domed helmet. After playing with his dick for a few minutes, Nick slides up the bed and makes out with his young prince as he plays with his dick. Pulling the boy closer, he applies pressure to his boy hole and gestures for him to move down and suck on his enormous cock. Ian climbs on top of the man, sucking his dick while he has his tight pink hole tongued. Ian humps back on the older man's face, as he enjoys the sensations he's giving him. <br><br>When Nick is ready, he flips Ian over, and slowly enters the boy. As the younger man loosens up, he fucks Ian harder and harder, and takes what he wants from him. The boy submits to the older man, kissing him while he's being penetrated, moaning with pleasure. Nick moves The boy onto his stomach and pounds his ass, the boy moaning in agreement. What began as one man enjoying another, becomes a mutually loving affair, Ian enjoying the thick cock inside him.  Nick finally has his way with the boy and cums all over his back. slowly rubbing his jizz into the boy. As he plays with Nick's cock, Ian jerks himself over the edge, Nick helping, grabbing between his legs<br><br>Ian and Nick cuddle, while Ian is thinking about where this will take him, contemplating the selfish game Nick is playing. Gifts granting a way for Nick to keep Ian in his debt, able to take what he wants from him. Ian understands the rules of the game and he's willing.",
  "models": [
    {
      "name": "Ian Levine",
      "person_id": 35736
    },
    {
      "name": "Nick Capra",
      "person_id": 35574
    }
  ],
  "release_date": "2015-09-01",
  "scene_id": 77990,
  "series": "Sugar Daddies",
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "DILF",
    "Daddies",
    "HD",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex",
    "Twinks"
  ],
  "title": "Sugar Daddies"
}