{
  "collections": [
    "Active Duty"
  ],
  "description": "This offering is what I would describe as FINGER LICKIN'! Jeremy Diesel is definitely one of the yummiest new recruits we've ever had at Active Duty, and as you probably know, that's sayin' something. He came in wearing a pair of black boxer briefs. When Claude leaves, Jeremy gets to plumpening up nice, thick erection for us. I will admit I liked his style of getting his meat to swell up.  He has a semi-aggressive rubbing style that's fun to watch.  He's not on the bed for very long before getting to his feet and pulling those briefs off. And POW! What a luscious dick! Jeremy is hung so nicely, my mouth was watering. A large, girthy, exquisitely shaped cock is just the right match for Jeremy's chiseled physique. He's a true work of beauty!Claude did some awesome work this time, getting good, tight shots of everything we wanna see.  We have a nice look from the top, where we get to see Jeremy's large, masculine hands tugging his boner. He wears a pair of bright, neon green socks, which I thought was a fun touch. Jeremy does a great job, particularly for a first-timer, of giving the camera some nice eye play.  He flirts with us a lot during this solo and I loved it.  He's such a handsome recruit, I wanted to see his face just as much as the rest of him. There's also some very sexy stuff happening from a low angle. We get to look upwards at him as he occasionally peeks around his big stiffy, giving us that smile.Then we get some ol' fashioned pillow fucking. This is a great opportunity to enjoy Jeremy's fine buttocks as they thrust into the bed. There's a LOT of power in those thighs and ass. Enjoy this great session with Jeremy, a fine recruit we'll be seeing again soon!",
  "models": [
    {
      "name": "Jeremy Diesel",
      "person_id": 37462
    }
  ],
  "release_date": "2015-08-12",
  "scene_id": 77992,
  "series": "Jeremy Diesel",
  "tags": [
    "Big Dick",
    "Brunette",
    "Jerk Off",
    "Muscular",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Jeremy Diesel, Scene #01"
}