{
  "collections": [
    "Active Duty"
  ],
  "description": "One thing that get my motor runnin' is good chemistry, and I bet you're probably the same. Well there probably isn't a finer example of that than what we have here with Quentin and Markie. These gorgeous recruits have become swell chums during their time so far as promising, fresh Active Duty prospects.</br><br>  Quentin doesn't waste too much time before wrapping his mouth around Markie's throbbing cock. He goes right to town, enjoying that hard boner he's probably been dreaming about tasting for a while now. As he works Markie's hard dick, Markie tugs Quentin's raging hard on. The boys reposition after a little of this so Markie can enjoy Quentin's nice, tight ass.</br><br>  Boy, Markie really knows how to enjoy an ass!  And that's great news for us, because it translates so well on camera. We see Quentin's incredible hole licked while his soft skin is squeezed, slapped, and spread apart. While Markie does his thing, Quentin continues to take Markie's meat deep. Then they move into a nice 69 position and work into a nice, steady pace of slurping on each other. </br><br> Markie starts with some extended teasing of Quentin's hole. It'll definitely induce you to pre cum, so watch the fuck out! Once Markie slides his cock into Quentin, you'll be ready to see the hard pounding that ensues. There's just so much good sex in this scene, it's hard to describe it all without sounding too jazzed up. After Markie fucks him from behind for a while, Quentin climbs atop Mount Markie and takes a ride. This is also some intense fucking. This kissing is deep and the touching is out of this world.  Claude scoops around from behind Quentin and catches Markie's hands as they lift Quentin's sweet cheeks up and down on his stiff dick.</br><br>Then we get into the good stuff, my favorite stuff. Quentin uses those powerful legs to help him fuck Markie good. And Markie, true to form, LOVES it! I can't remember a soldier I've seen in a while that enjoys being reamed like our boy Markie. First Quentin fucks him from behind, then climbs up on the bed for more leverage so he can slam him even harder. For a finger-lickin' finish, we get to watch Markie erupt while being fucked on his back.  It's a truly explosive experience you'll be thinkin' bout for a while I reckon.",
  "models": [
    {
      "name": "Markie More",
      "person_id": 37269
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2015-08-16",
  "scene_id": 78026,
  "series": "Markie More & Quentin",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Tattoos"
  ],
  "title": "Markie More & Quentin"
}