{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Mark Long exits the vehicle and surveys the spread, it becomes clear that his old high school friend, Graham Addison, has done quite well for himself since leaving their hometown. Graham's success, however, is still rather empty, since he harbors a secret and is not sure how Mark will react. </br></br>To his credit, Mark always seemed like an understanding friend, so when Graham confesses that he's gay, it doesn't surprise him that Mark is rather nonchalant about the revelation. What does catch Mark off guard though, is that Graham confesses that he's always had a crush on Mark. Now Mark begins to reel, as Graham rests his hand on Mark's thigh. Mark feels his pants tighten as the blood rushes to the head of his cock, but the idea of being with a man is completely new to him. Graham assures him he won't have to do anything he doesn't want to, and begins to unzip Mark's pants. Mark is skeptical, but also notes that Graham's hand feels nice, and so as Graham begins to suck on it, Mark decides to just go with it, and he closes his eyes, placing his hand on the back of Graham's head and pulling him closer.</br></br>Graham does not hesitate to seize the opportunity, gagging on Mark's growing 8' cock until it's hard and wet. Mark is too hard to turn back now, so he goes all in, plunging his virgin cock into Graham's waiting ass, and slamming him underneath the hot sun. Graham smiles a coy smile as Mark pounds him from behind. And as Mark blasts Graham with his hot load, fantasy and reality coincide, and as he busts his own load in the glistening sunlight, he realizes the effort was well worth the wait.</br></br>Enjoy! ",
  "models": [
    {
      "name": "Addison Graham",
      "person_id": 32786
    },
    {
      "name": "Mark Long",
      "person_id": 18862
    }
  ],
  "release_date": "2015-08-27",
  "scene_id": 78028,
  "series": "NDB - 4589 - Mark Long & Graham Addison",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Blowjob",
    "Brunette",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Tattoo/Piercing"
  ],
  "title": "High School Crush"
}