{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Imagine it: you're Jin Powers and you've had your eye on your close friend, Rex Cobra. Although you lust after Rex on a regular basis, you know Rex isn't sexually attracted to guys. Well what would you do if Rex one day, while chilling together on your couches at home, told you that he wants to see what it's like to fuck a guy in the ass?!<br/><br/>That just happened to Jin, and he is psyched! He knows that Rex brought it up because he wants his first guy on guy encounter to be with him. Rex starts by slowly removing his shirt. Jin knows exactly what to do to ease himself into this, without scaring Rex away. He gently begins kissing Rex's chest and stomach, working his way down toward the goods. Soon, he's pulling Rex's jeans down and taking his enormous cock into his mouth. It's even fatter and harder than Jin had dreamed. He takes down as much as he can, feeling his own erection growing.  <br/><br/>After some pleasuring of Rex's once forbidden dick, Jin removes his pants and carefully sits down atop Rex, working that huge, firm cock into his tight, hungry hole. Jin takes it for a good, sensual ride.  Rex can't believe he waited this long to try fucking a guy! Maybe it's because they're good friends, but this is the best sex he can ever remember having.  <br/><br/>They move to the couch so Rex can pound his friend Jin even harder. He gets the right leverage and lets his body take over. Join these guys as two friends take their relationship to an unexpected next level by heating things up beyond their wildest fantasies.<br/> <br/>Enjoy!",
  "models": [
    {
      "name": "Jin Powers",
      "person_id": 32845
    },
    {
      "name": "Rex Cobra",
      "person_id": 37382
    }
  ],
  "release_date": "2015-09-01",
  "scene_id": 78083,
  "series": "NDE - 205 - Jin Powers & Rex Cobra",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bald",
    "Black",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Muscular",
    "Slim",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Trying Guys"
}