{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "For Colton Casey, the move west has been slow and sort of boring. Relocating from his home out to this remote area is fine, but not knowing anyone sure does make the time pass slowly. As he sits on the side of the road kicking rocks, Garrett Cooper rides up on his quad, and the two guys immediately hit it off. Garrett shows Colton around and invites him to a party later that evening.Colton is excited for the party, but moreso, he's excited to finally know someone local. As he gets ready for the party, Garrett spies him through a window, as Colton shakes his cute little ass in front of the mirror. Garrett gets a few ideas of what he'd like to do with that, letting out a whistle that startles Colton. He runs to the door to let Garrett in, and the chemistry between the guys makes it apparent that the party will have to wait. Garrett clutches Colton and pulls him in closer, kissing him hard on his lips and working his way down Colton's body. Colton lets his towel fall off his body and exposing his cock, which Garrett falls on and begins to suck. Colton throws his head back against the hallway wall when Garrett turns him around, eating out his ass before they switch, and Colton falls to his knees to suck Garrett off. Garrett blows a quick load all over Colton's face, before they go back into Colton's room. There, Colton lays Garrett down on his back, sliding his hard dick deep inside of Garrett, thrusting back and forth as Garrett strokes his cock. After getting his pound on, Colton mounts the boy next door, and Garrett finally has his way with the new kid on the block, as Colton strokes himself off, jizzing all over Garrett's stomach as he pulls out and blasts Colton with another load to the face. As he lay there, cum covered and exhausted, Colton realizes there's plenty to do to pass the time out in the country, and that he'll be just fine in his new town.Enjoy!",
  "models": [
    {
      "name": "Colton Casey",
      "person_id": 37415
    },
    {
      "name": "Garrett Cooper",
      "person_id": 37542
    }
  ],
  "release_date": "2015-09-24",
  "scene_id": 78141,
  "series": "NDB - 4593 - Garrett Cooper & Colton Casey",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Brunette",
    "Climax",
    "Condom",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "The Boy From Next Door"
}