{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Ah yes, the perfect day for a massage treatment.  Osiris Blade likes to work his body to the MAX.  He's always had a great physique and he enjoys keeping it that way.  Today, he feels like he may have pulled a muscle in his back.  On the way home from the gym, he's stopped into a little hole-in-the-wall massage parlor that he's always wondered about.  The proprietor is a man named Brandon Jones.  And Brandon is more than a little excited when he sees Osiris walk through his door. Brandon pleasantly instructs Osiris to become nude and lay on his back on the massage table.  Brandon leaves and returns with oils and preparations for the rub down.  It's not long before Brandon has pulled the towel away from Osiris's mid-section and is rubbing around his giant cock.  Brandon notices Osiris's dick is becoming slightly fatter.  He takes this as a sign that Osiris would probably appreciate a bit of special treatment.  He slowly goes in for the luscious cock, eventually landing his lips right on it.  Brandon begins sucking and taking the growing meat deeply.  Osiris sighs, letting Brandon know this special attention on the cock muscle feels VERY good.   The mood heats up a bit when Brandon takes off his own clothes and mounts Osiris, continuing to stroke his mammoth dick.  The two kiss for a while and Osiris gets his hands on Brandon's big, hardening member.  Brandon turns his body around on top of Osiris so he can suck his dick some more while Osiris has a taste of his tight hole.  Once it's nice and wet,  Eventually, Brandon turns back the other way, facing Osiris, so he can ride that huge erection.  They fuck for a while in this position before standing up so Osiris can really deliver a hard pounding with that incredible dick.   Join them and feel every muscle in your body become tighter and tighter, along with these studs, then feel that powerful release, just as you plunge with them into deep, satisfying relaxation.  Enjoy!",
  "models": [
    {
      "name": "Brandon Jones",
      "person_id": 20071
    },
    {
      "name": "Osiris Blade",
      "person_id": 37349
    }
  ],
  "release_date": "2015-09-15",
  "scene_id": 78142,
  "series": "NDE - 206 - Osiris Blade & Brandon Jones",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Bald",
    "Black",
    "Brunette",
    "Climax",
    "HD Movies",
    "Hardcore",
    "Interracial",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Special Treatment"
}