{
  "collections": [
    "Active Duty"
  ],
  "description": "This time we have two young men paired together, both coming up through our Active Duty recruitment very fresh.  This is Brad and Christian.  Together, these boys are absolutely firing hot.  <br> </br>Brad sensed Christian's reticence, but helped him ease into the tub, so to speak.  Brad invites Christian to taste his hard dick.  Just after they fire up their hard-ons, Christian dives right in, fervently slurping big, sexy Brad's hard cock.  Once that awkward ice starts melting, Christian is a starved, fiend-for-dick!  Boy, he knows how to properly service a large erection in need.  Watch the way he goes to town!<br> </br>It's not long before Christian is easing down onto Brad's thick dong and working his ass up to a steady, hard bounce.  Watching Brad's face, I can see he's being turned on in ways he certainly did not expect.  When Brad slides that hard dick into Christian from behind, he does it slow and easy.  We get to watch that perfect body gradually work up to a strong, hard pounding...I know it's just what Christian had been waiting for.  Once Brad goes hands-off-the-cock, he really lets his power open up.  Take a look at that throbbing dick work!  Claude, on top of his game as usual, gets right into the mix, getting a great, tight underneath angle for us.  We see awesome, hard fucking from underneath, with Brad's face peeking around his dick at us, looking intensely focus on the passion.  <br> </br>Eventually, Brad and Christian settle back down on the bed together, just how they started this little adventure for today.  See what we're all about here as these two push themselves outside of their comfort zones and experience something special, together in the line of Duty.  ",
  "models": [
    {
      "name": "Brad Banks",
      "person_id": 37394
    },
    {
      "name": "Christian III",
      "person_id": 37411
    }
  ],
  "release_date": "2015-09-06",
  "scene_id": 78146,
  "series": "Brad & Christian",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Brad & Christian"
}