{
  "collections": [
    "Pride Studios"
  ],
  "description": "Kory is in talks with his therapist about how he likes public sex and the thrill of being caught or someone watching. He can't get enough of the thrill and begins to explain in detail to his therapist his latest encounter at a clothing store. Kory was cruising the clothing store when he saw a super sexy man looking back at him. He followed him around the store until Angel gave him the nod and Kory followed him to the dressing room. No employees in sight so they went behind the curtain and he got down on his knees and began sucking Angel off. His beautiful uncut cock was driving Kory crazy as he yanked and nibbled on the foreskin while stroking his long shaft. He couldn't get enough of that dick and was in heaven as Angel began to face fuck him. Right in the middle of this hot encounter the employee calls out to them to make sure everything is all right which of course it is but that freaked out Angel so they stop and pull their pants up and head into the stock room for some more fun. Now in the stock room Angel rips Kory's pants off and bends him over the metal table and dives in face first lubing up his ass with his wet tongue. The encounter is intense and neither wants to get caught before they get the chance to fuck. Kory pulls out a condom and instantly Angel puts it on and slowly goes deep into that eager ass. Luckily for Kory Angel takes it easy on him in the beginning but once he is warmed up and his cock harder than a rock he goes deep and hard and from being bent over to having Angel flip him over onto his back and being fucked even more was everything plus more that Kory could ask for. Kory blasts a thick white nut on his chest and Angel leaves his juices all over him as well and they both scurry to put clothes back on and run out of the stock room before being caught. Enjoy!",
  "models": [
    {
      "name": "Angel Rock",
      "person_id": 31517
    },
    {
      "name": "Kory Houston",
      "person_id": 37495
    }
  ],
  "release_date": "2015-09-07",
  "scene_id": 78197,
  "series": "Pilot 3 - Angel Rock & Kory Houston",
  "tags": [],
  "title": "Public Sex Confessionals"
}