{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Pop sensation Markie More is no treat to work for. His spoiled, rude entitlement is on full display before he even eats breakfast, so needless to say, body guard Derek Maxum's days are long and hard. Quite frankly, it's all Derek can do to keep from grabbing Markie by the shoulders and shaking some sense of reality into him.   So when Markie asks to see what Derek is packing, Derek doesn't know if his employer has finally crossed the line, or if Derek will finally get to put his plan into action. As Markie begins to bob on Derek's thick shaft, Derek has his answer. He quickly pushes Markie's head down further onto his cock, and as it grows past 8 inches, Markie realizes he may have bargained for more than he can handle. Derek turns Markie over, eating out the spoiled brats tight ass, moistening up the songwriter, and then plunging his giant cock deep within Markie, who begins to sing a different tune now that Derek is in control.  Derek pounds Markie from behind, grabbing him by the back of his head and thrusting even harder, before turning him over and finishing the job. He runs his hands down Markie's chest as Markie strokes himself to the brink of cumming, then Derek pulls out and they race to see who can lose their load first: Markie spraying his load all over himself as Derek follows by unleashing a massive load of his own.  Markie may be the one signing checks, but there's one area where Derek will always be the boss. Enjoy!",
  "models": [
    {
      "name": "Derek Maxum",
      "person_id": 34949
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2015-09-04",
  "scene_id": 78267,
  "series": "NDO - 4592 - Derek Maxum & Markie More",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Black",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Interracial",
    "Oral",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Loaded Bodyguard"
}