{
  "collections": [
    "Active Duty"
  ],
  "description": "We have someone very special and near to my heart back with us. If you've been hanging around the Active Duty barracks for a little while now, you no doubt know of this delicious, eager soldier named Sawyer.  He's hitched up this time with a brand new recruit, Dominic. If you know the level of sexy to which Sawyer naturally cranks the action, you know you're in for quite an extraordinary treat.Once Claude leaves, Sawyer suggests to Dominic that, 'it's too hot for those pants.' Dominic, obviously, knows exactly what Sawyer's after, and the two nervously laugh just a bit. It's not long after Sawyer's playful suggestion that Dominic has lips wrapped around Sawyer's fattening dick.  From there, Sawyer climbs atop Dominic and we see Sawyer eeeeaaaase that dick into his hole ever so gently until it's ready for a good ol' ride. And boy does he enjoy it. I think this was really great for Dominic to see, especially being his first time here with us at Active Duty. Any first-time jitters melted away quickly once he saw how much fun Sawyer was having.As Sawyer takes Dominic's hard cock, Claude tells him not to worry, as he'll be pounding Dominic's ass very soon! And indeed he does. The boys switch so Sawyer can try out this fresh recruit's tender hole.  He lets Dominic take a ride and BOY! For a first timer here at Active Duty, Dominic knows how to have a good time riding a nice cock! He ends up spraying his hot cum while Sawyer works his hole. This is a  great, feel-good hook up that reminded me why I've missed Sawyer so much. And it's also got me anticipating the next time we'll get to see this cute, willing recruit, Dominic. He did an amazing job for his first time and I'm thinking he took some mental notes on Sawyer. Perhaps we'll see these two together again at some point. The chemistry was certainly right!",
  "models": [
    {
      "name": "Dominic",
      "person_id": 37534
    },
    {
      "name": "Sawyer",
      "person_id": 35300
    }
  ],
  "release_date": "2015-08-23",
  "scene_id": 78268,
  "series": "Dominic & Sawyer",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Gay",
    "Jerk Off",
    "Tattoos"
  ],
  "title": "Dominic & Sawyer, Scene #01"
}