{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Bam Bam loves getting naughty in the sack before bedtime, but his REAL-LIFE boyfriend, Krave Moore, is often too tired to fool around after a long day at the office.  But Bam knows that he can usually coax his handsome beau into engaging in some sexy action...with a little work, of course!As Krave lays with his eyes closed, telling Bam to knock it off and go to sleep, Bam gently kisses his neck.  He knows this spot usually melts Krave into acquiescence.  Slowly, Bam works his way downward, Krave's protests wilting.  He reaches the cock to find it already very stiff.  Bam carefully wraps his wet lips around the throbbing dick and begins sucking and bobbing his head.  By this time, Krave has accepted it.  Bam can feel his lover enjoying the warm blowjob.  He brings his head up and two kiss passionately.  Their hard cocks rub together as they make out.  They move into a 69 position on the bed, where Bam continues enjoying Krave's enormous erection, and Krave sticks his tongue deep into Bam's sweet hole.  Then Bam lays on his back while Krave slurps his fat dick.  The feeling of Bam's strong boner in his mouth makes Krave's asshole yearn to be fucked, so he climbs atop his boyfriend, eases his large, throbbing cock into his ass, and begins bouncing, gradually picking up the pace.  They work up to a hard, intense pounding before switching things up so Bam can get plowed by Krave's incredibly huge cock.  From there, they let their passions permeate every bit of their beings, allowing natural, instinctual desire to take over as they switch and flip flop between positions.  Join these true-life lovers on an amazing erotic adventure, all in the privacy of their own shared bedroom.",
  "models": [
    {
      "name": "Bam Bam",
      "person_id": 3033
    },
    {
      "name": "Krave Moore",
      "person_id": 33629
    }
  ],
  "release_date": "2015-10-13",
  "scene_id": 78266,
  "series": "NDE - 208 - Krave Moore & Bam Bam",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Black",
    "Climax",
    "Condom",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Sugar Before Bed"
}