{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Paul Canon loads up the laptop and steadies the web cam, Johnny Torque eyes his beautiful ass from the corner of the room. Once the cam is up and running, Paul looks over his shoulder and asks Johnny if he's ready, and with that, Johnny and Paul make their first sex tape together. Johnny is turned on by the idea of someone watching, but it's really Paul's beautiful body that has him rearing to go.<br><br>Johnny slowly peels Paul's boxers off of him, teasing Paul's cock with delicate tonguing around the head, slowly down the shaft, before downing it in one fell swoop, as Paul closes his eyes and enjoys the moment.<br><br>Paul readjusts the camera and the two of them switch, as Johnny leans up against the headboard while Paul deep throats his boyfriend's perfect dick.<br><br>Paul wants it badly, so Johnny bends him over slowly working Paul's hole at first, then increasing more and more, until Paul lay flat on his stomach as Johnny pounds him from behind. They switch, and Paul rolls up onto his shoulders while Johnny plunges his cock from above. Paul can feel every inch and his hard cock shows it. Johnny strokes Paul's cock as he fucks his ass, and Paul nearly comes too soon, but he implores Johnny to slow down and try one more position.<br><br>Paul lays on his back while Johnny goes for the big ending, stroking Paul off and watching as he jizzes all over himself in a quivering mess, which sets Johnny off in just the right way, so he pulls out and blasts his lover with a gargantuan load of his own, almost blacking out the camera in the process. As Johnny and Paul lay cum covered and exhausted, Paul hits save and preserves their perfect fuck for future enjoyment.Enjoy!",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Paul Canon",
      "person_id": 36900
    }
  ],
  "release_date": "2015-09-10",
  "scene_id": 78323,
  "series": "NDB - 4595 - Johnny Torque & Paul Canon",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Muscular",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Homemade Sex Tape Part 2"
}