{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Joey Moriarty has been thinking about his wife's brother ever since the two of them hooked up one afternoon a few weeks ago. Joey loves his wife, but he can't stop thinking about the way Dante's mouth felt on his cock, or how nice it was pounding Dante's little bubble butt. And though he recognizes the potential for trouble, his lust gets the better of him, and he thinks maybe he and Dante can rekindle that moment. Unfortunately, as Joey heads over to clean the pool, Dante doesn't seem to be around. Trying to contain his disappointment, he goes about filtering the pool, until Dante sneaks up behind him and nudges him in. Splashing as he comes up in the cool water, Joey wipes the water from his eyes and sees Dante jumping into the pool behind them, and before he knows it, the two of them are pressed up against one of the pool sides, with Dante's tongue pressing down his throat.<br></br>Joey quickly lifts Dante out of the water and peels his trunks off, revealing Dante's hard cock. Joey begins to suck it right there by the pool, as Dante pushes his head down further and further. Dante returns the favor, leaning Joey up against a boulder, and downing his hungry cock, but what Joey really wants is that sweet ass, so he bends Dante over and begins to eat him out, tossing Dante's salad before shoving his meaty cock deep inside. Dante bites his lip from the pleasure as Joey grabs his shoulders and begins to pound. <br></br>The heat of the sun warms their golden skin as they lay by the pool, Joey on top, Dante on his back, stroking his cock. Joey continues to pound away as Dante loses his load, and Joey pulls out and splashes Dante with his own load, before the two of them roll back into the pool to wash away the evidence of the secret between them.<br></br>Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Joey Moriarty",
      "person_id": 35535
    }
  ],
  "release_date": "2015-09-11",
  "scene_id": 78321,
  "series": "NDO - 4594 - Joey Moriarty & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Climax",
    "Dark Hair",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Smooth",
    "Straight Men"
  ],
  "title": "My Wife's Gay Brother Part 2"
}