{
  "collections": [
    "Active Duty"
  ],
  "description": "Well Claude has been very busy lately working with incoming recruits and keeping things at the Active Duty San Diego bunker running full steam ahead.  He's been knockin' 'em outta the park with these new guys, and managing to pair them up very nicely.  This time, we take a look at a very nice recipe Claude has put together, using two very hot ingredients! Jeremy doesn't have any trouble getting hard once Quentin wraps his mouth around that fat cock.  Wow, does Quentin enjoy that thick ol' thang!  He bobs real nice and deep for a while.  Jeremy, like I said, is certainly not standoffish.  He gets right in there and jerks Quentin's dick while enjoying the thorough sucking.   Afterwards, Quentin fits that huge erection into his tight hole, he rides it real good.  I couldn't wait to see how Jeremy did with his dick inside a man, and oh YES did he exceed my expectations! From there, the duo repositions so Jeremy can slam him from behind.  This way seems a bit more familiar to Jeremy, but maybe it's only because he's pushed past those initial first-penetration jitters.   Then we get to the real meat of it.  Just as Jeremy is sitting down on Quentin's cock, the very first time he's had a dick inside him, he looks at Claude with a big smile and says, 'This is it, first time real deal.' All three guys laugh and Jeremy gets on with it. We get to see him slowly work his virgin hole up and down while on top of Quentin for a while.  Then he goes to his back and Quentin takes the power role.  This is the best.  Quentin doesn't hold back much, and really delivers a good pounding.  Claude even remarks, 'He's earning his money.'  Join these two beautiful recruits for an explosively good time, and enjoy seeing them spray their warm loads for a great finish.",
  "models": [
    {
      "name": "Jeremy Diesel",
      "person_id": 37462
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2015-08-30",
  "scene_id": 78327,
  "series": "Quentin & Jeremy",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Tattoos"
  ],
  "title": "Quentin & Jeremy, Scene #01"
}