{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Texas Holcum is always complaining about his landscaping job.  'It's too hot out, it's boring, they don't pay me enough.' Well today, he's getting quite a nice bonus!  As he moves with a leaf blower around to the back porch of the palatial estate where his crew is working for the day, he notices an open window.   Texas keeps sweeping the red, clay tiles, but can't help but steal quick peeks into the window.  He sees a bed and soon after realizes there's a well-defined, nude male body lying in it.  He also realizes that the man is relaxing face down.  He figures that if he can stay quiet, he can creep closer to the window for a better look at what appears from a distance to be a great ass.Texas puts down the broom, gets closer, and sees that it is indeed a wonderfully plump rump.  He decides to pull his cock out, since no one else is around.  He jerks for a few minutes, getting it totally nice and hard.  Since he's been able to go this far without being discovered, he figures 'why not climb inside the window and get an even closer look.   So he does.  And once inside, he can't keep his hands and mouth off that tempting ass.  He leans down, still with his stiff dick out, spreads the cheeks and licks that stranger's hole.  Resting Derrick Dime, owner of the home, perks up, but doesn't move at first, partly because this tonguing feels so, so good, and partly because he knows if he waits a few moments, he can get this punk intruder right where he wants him. Derrick flips onto his back after a while.  Texas, wrapped up in the moment, takes the opportunity to sample a tasting of Derrick's fine-looking cock.  'Wow can this guy suck!' Derrick thinks.  But just as Texas begins getting even more comfortable with this strange man's dick in his mouth, Derrick springs into action.   He grabs Texas by the neck and throws his face down onto the bed.  He whispers in his ear, just before he bites it, that Texas is about to get more than he bargained for.  Derrick spits into Texas's ass and then rubs his wet hole with his thumb.  Texas never could've expected this, but he's definitely liking it!  Derrick inserts his swollen, meaty cock into Texas's eager hole and gradually works up the pace into a nice, steady, hard fucking.   After a while, Derrick decides he wants a taste of Texas's dick, so he lays him down and bobs on his firm piece for a while.  Then he instructs Texas to climb atop his erection and ride it.  He does for a while, then goes to his back so this guy can slam his ass some more.   Join this pair as they let the adrenaline boost their intense sexual passion.  And just after the amazing, explosively hot climax, find out what makes Texas freak the fuck out!!",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Texas Holcum",
      "person_id": 37600
    }
  ],
  "release_date": "2015-09-23",
  "scene_id": 78358,
  "series": "NDT - 8302 - Derrick Dime & Texas Holcum",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Caucasian",
    "Climax",
    "Condom",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Lusty Landscaping"
}