{
  "collections": [
    "Icon Male"
  ],
  "description": "As Duncan lathers his body in the shower, he is deep in thought, his mind wandering to what he'd heard the night before. Tommy's sister joins her brother in bed while she's waiting for Duncan to finish, and they have a heart to heart. She worries about Tommy and feels that she is responsible for him now that their Mom is gone. Duncan's entrance into the room interrupts their conversation, and he climbs into bed as well. Tommy notices the affection between the long haired fiancee and his sister. Later, Tommy is awoken by his sister convincing Duncan to have sex in his bed with him sleeping next to them. <br><br>The next morning Arden is awake and getting ready. Applying her makeup, says she is leaving to go see a friend. But soon after leaving, she pulls off the road to answer a call from her ex. <br><br>Back home, Tommy sits down and offers Duncan a drink. Tommy asks him if he's ready for marriage. He's happy she agreed but is unsure about it. Tommy reassures him that they're both good for her. Duncan has questions about Tommy's past and opens up about an experience he had with a guy at a party. Tommy reaches over and plays with Duncan's hair, rubbing his chest. Duncan looks over at him, and puts his hand on his belly. Tommy unzips his pants, and pulls out his massive dick, which Duncan starts stroking. Tommy puts his hand down the back of Duncan's jeans as Duncan sucks on the giant member. Tommy grabs the back of his head and moves it up and down, encouraging him to work his pole. <br><br>Arden comes home and sees her man sucking her brother's dick. Shocked, she doesn't say a word. Only after Tommy blows a huge load all over Duncan's face, does she angrily slam the door. Tommy scrambles to put things away, but an arguement ensues.",
  "models": [
    {
      "name": "Duncan Black",
      "person_id": 37583
    },
    {
      "name": "Tommy Defendi",
      "person_id": 35565
    }
  ],
  "release_date": "2015-09-22",
  "scene_id": 78499,
  "series": "His Sister's Lover",
  "tags": [
    "Big Cock",
    "Bisexual",
    "Closeted Boyfriend/Caught in the act",
    "Closeted/Straight",
    "College",
    "HD",
    "Hairy Guys",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob"
  ],
  "title": "His Sister's Lover"
}