{
  "collections": [
    "Icon Male"
  ],
  "description": "Dreamy jock Ty Roderick is coaching aspiring football player Asa Shaw so that he can make the football team. Even though Asa fumbles every catch, Ty encourages him to keep trying. But it isn't long before Asa gets discouraged and wants to take a break. Truthfully, he doesn't really care about sports. To Asa, the football team is the best way to get noticed... by a guy. Ty is straight, and has never fooled around with a guy. When Asa asks if he can suck his dick he isn't even sure he can keep it up. Convinced to give it a try, he insists on standing eyes closed, while Asa practices his blowjob skills. Asa tentatively reaches over to the front of the jock's jogging pants, and slowly pulls them down to reveal the object of his obsession. Although it doesn't seem to be working at first, eventually the Jock's dick rises to full attention while Asa teases his balls and works the pole with his lips and tongue. Ty keeps his eyes shut, but it isn't long before curiosity and horniness get the best of him and he peeks down at the service he's getting. Ty lifts Asa up off his knees and tosses him chest down onto the bed. He tugs down on the back of Asa's pants, exposing his smooth bubble but. Although he doesn't have any experience getting fucked, Asa takes it without too much complaint as Ty greedily pushes in and fucks him hard. Moving Asa onto his back, he discards the boy's pants and shoes in the process, and the jock coach resumes pounding ass. Intensity and intimacy grow as the boys stare into each other's eyes. Ty pulls out of the younger boy, and leans back on the headboard while Asa continues to give him his first blow job. Ty grabs the back of his head and pulls it down on his stiff cock, shoving it to the back of his throat. As the boys spoon, it isn't long before Asa cums onto his smooth belly, and Ty comes right on top of Asa's.",
  "models": [
    {
      "name": "Ty Roderick",
      "person_id": 35566
    },
    {
      "name": "Asa Shaw",
      "person_id": 37579
    }
  ],
  "release_date": "2015-09-24",
  "scene_id": 78496,
  "series": "Straight Boy Seductions",
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "College",
    "Cumshot/cum",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Muscular Guys",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex",
    "Twinks"
  ],
  "title": "Straight Boy Seductions, Scene #04"
}