{
  "collections": [
    "Icon Male"
  ],
  "description": "Muscular Robert Axel and his ex have just split up and he's moving out. Lance Hart is helping him pack but as the conversation turns to sex, Robert commenting that he's looking forward to freedom and getting freaky. Lance sees a golden opportunity and tells him about a bi experience he had at a swinger's party, where he had the best blowjob he'd ever had, and surprisingly it was from a man. As he is getting increasingly turned on, he states that he'd even take one of his ex's crappy blowjobs, but with a knowing glance and a hand on his knee, Lance tells him he doesn't need her.Convinced, Robert undoes his pants and leans back, letting his buddy reach into his pants and pull out his increasingly thick black dick. He moans as his dick is sucked up and down, before Lance pulls off his pants and gets right back to work he enthusiastically sucks his dick deep into the back of his throat.Rubbing Lance's back encouragingly they lean in for kiss, eyes closed. Robert reaches down and grabs his firm cheeks before standing up and letting him worship his dick then reaches over, rubbing Lance's dick. Robert kisses down his arms, and hesitantly takes Lance's dick into his mouth, trying hard to get him nice and stiff before getting behind Lance, and inserting his big dick between his buddy's white cheeks. Pushing into his inexperienced hole, Lance takes Robert's dick and moans louder and louder as the intense pleasure builds. Robert pushes him down onto his stomach and fucks him with long powerful strokes. Lance blows his load while he's being penetrated by the muscular black stallion, and Robert pulls out and, spent, he spews his load onto his ripped body.",
  "models": [
    {
      "name": "Lance Hart",
      "person_id": 35564
    },
    {
      "name": "Robert Axel",
      "person_id": 37459
    }
  ],
  "release_date": "2015-09-10",
  "scene_id": 78494,
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "Ebony",
    "HD",
    "Interracial",
    "Jerking Off",
    "Masturbation",
    "Muscular Guys",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex"
  ],
  "title": "Straight Boy Seductions, Scene #02"
}