{
  "collections": [
    "Icon Male"
  ],
  "description": "Adam Russo, dressed in a tweed jacket, is reading quietly but his patience is wearing thin. He is a college professor and Ty Roderick who's passed out next to him is one of his lousiest students. A bargain was made, but Adam is sure that the jock in his bed is attempting to get out of his obligation; having bartered sex for an A in his class to keep his athletic scholarship. As he wakes up, Adam knows that Ty's innocent act won't save him from what he agreed to and threatens to advise the registrar of a grading error, rescinding the A if he backs out. Trapped in a corner, Ty threateningly chokes his professor for jeopardizing his future. But Adam is not fazed, he's well aware of the stakes for Ty if this doesn't go forward. Besides, the boy will soon find out that choking turns him on. Realizing that his threats are useless, Ty quickly reaches into his jeans and pulls out his stiff cock. Wanting to get it over quickly, he repeatedly slams it to the back of his professor's throat. Adam is relishes the opportunity to take this stud's cock, deep throating it's length. Without delay, Ty rips off Adam's clothes and inserts his throbbing cock Adam's ass, pounding him with a healthy dose of hatred. His hands find themselves back on Adam's throat as he punishes his prof's ass. Adam couldn't be happier, taking every inch of his energetic student's discipline. Ty pulls Adam on tip of him and with an avid intensity squeezes the older man's pecs, pinching his nipples. They take turns sucking each other, and Adam shoves Ty's head to the base of his dick, wetting the length and causing Ty to choke. The slick members are rubbed together, while Ty kisses Adam's beard. Adam tongues Ty's balls, tasting the his musk as he jerks his cock all the way to completion. It isn't long before Ty's load comes gushing out, feeding him his cum.",
  "models": [
    {
      "name": "Ty Roderick",
      "person_id": 35566
    },
    {
      "name": "Adam Russo",
      "person_id": 35627
    }
  ],
  "release_date": "2015-09-03",
  "scene_id": 78493,
  "series": "Straight Boy Seductions",
  "tags": [
    "Anal",
    "Ass to Mouth",
    "Closeted/Straight",
    "Cumshot/cum",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Masturbation",
    "Mature",
    "Muscular Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex"
  ],
  "title": "Straight Boy Seductions, Scene #01"
}