{
  "collections": [
    "Icon Male"
  ],
  "description": "Dirk Caber and Adam Russo indulge in good drinks and cigars in the executive lounge. Talk turns to shopaholic wives and children engrossed in phones and video games. Unlike their families, these gentlemen appreciate good conversation and old fashioned eye contact. Dirk toasts to their success and their experience, and drinks are freely poured. Adam is happy to get together with his friend but warns driving home won't be an option if he keeps drinking, and jokes about having a bad influence.  Dirk takes advantage of his friend's naivety. His hand rests on his leg and he compliments the hard strong thighs he's been working out. Adam is visibly uncomfortable, confused by his compliments and innuendo, but Dirk continues to test just how far he can push his old friend. Adam isn't sure whether or not he's misreading his actions but it's plainly laid out on the table; He tells him the only thing missing from their evening of indulgence is sex. An activity for which they don't need their wives! Dirk reaches towards Adam feels his firm chest through the soft wool of his business suit. Staring intently into his eyes, he seductively reaches between Adam's legs and rubs his inner thigh. Pulling on his necktie after unbuttoning his shirt, the silver fox strokes the hair on Adam's bare chest. Although he doesn't look very comfortable, he isn't fighting Dirk's insistence. Bit by bit Adam gives in, and as Dirk moves his hand to the front of his pants, he relents. Adam allows his big cut cock to be pulled from his pants, It's stroked before Dirk leans forward to lick the tip and bring it into his mouth. As he sucks on the stiff cock, he places Adam's hand on his ass, where Adam untucks the shirt from his pants. As Dirk sucks on his straight friend's dick, his inhibitions increasingly dissipate. Adam hesitantly but curiously unbuttons Dirk's shirt and licks his exposed nipples. This makes Dirk moan with pleasure, and Adam reticently lowers his mouth onto Dirk's prick. With a bit of encouragement, he reaches towards his ass hole, fingering it while he sucks it while thumbing his balls.  Adam moves Dirk on to his hands and knees and continues to loosen his hole with his wet fingers. Soon he stands up and pulls his dick out of his pants, excitedly ready to ram the other gentleman. Steadily pumping into Dirk's ass, he makes him cum all over himself, and it isn't long before Adam is ready to cum himself, blowing his load on Dirk's engorged cock.",
  "models": [
    {
      "name": "Adam Russo",
      "person_id": 35627
    },
    {
      "name": "Dirk Caber",
      "person_id": 36926
    }
  ],
  "release_date": "2015-09-17",
  "scene_id": 78495,
  "series": "Straight Boy Seductions",
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Masturbation",
    "Mature",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex",
    "White Collar/Suits"
  ],
  "title": "Straight Boy Seductions, Scene #03"
}