{
  "collections": [
    "Active Duty"
  ],
  "description": "It's not always that I have such a fun time checking out a new recruit.  Well this time, I certainly did.  This is Johnny and I can't remember the last time I saw such an eager, energetic new addition to the Active Duty platoon.    <br> </br>Johnny is nice and lean, with great muscle tone.  It's easy to see this young man puts in his time at the barracks gym.  In my humble Southern opinion, he has just the right amount of hair...not overboard, but enough to enjoy.  I'll admit I was a little surprised when Johnny pulled out his cock.  It was already VERY hard, and BOY is that thing thick!  I wouldn't be surprised to learn that he lifts heavy weight in the gym with that big dick.  And it looks so strong.  The best part is how much delight Johnny gets from stroking it.  After only a little while, Claude was needing to caution him about blowing his load too soon.  But those looks of ecstasy on his face and the permanent grin really show how much this boy likes to jerk his oiled-up cock..  <br> </br>Then we have Johnny on the couch, fucking some pillows.  My goodness, that's a plump rump!  We see some nice action as he does a few slow thrusts.  It sure made me excited to think about that sweet, bubbly ass being fucked by one of Johnny's hardened fellow recruits.  <br> </br>Finally, Johnny blows his hot, gooey load all over himself and just after says, 'I needed that!' with a hearty laugh.  Claude laughs too and Johnny tells him he hadn't nutted in nearly a week.  'You did need that!' Claude tells him.  Then Claude gets in tight for a slow-moving shot of our cum-slathered rookie soldier.  He lays on the couch, breathing in deeply and exhaling with relief, in accomplishment and satisfaction.",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 37613
    }
  ],
  "release_date": "2015-09-16",
  "scene_id": 78505,
  "series": "Johnny",
  "tags": [
    "Big Dick",
    "Brunette",
    "First Time",
    "Jerk Off",
    "Muscular",
    "Shower",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Johnny"
}