{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Addison Graham has the house all to himself for the week, while his parents are off on vacation. It's such a beautiful day that Addison decides he could use a little rest and relaxation as well, so he orders himself a four handed massage from a local service provider. When Jake Karhoff and Ivan James arrive at Addison's house, they're blown away at the grounds, the property and most of all the pool, as Addison leads them out to the deck.Ivan is already eyeing Addison's bubble butt as he rubs his back, and as Jake sneaks a peek under Addison's towel, he sees the host is already half hard from his double rub down, so Jake begins to push the envelope, running his hand along Addison's crack, and then licking the inside of his thigh. Ivan has already removed his shorts and has his dick in Addison's mouth, and as he sucks away, the guys realize their host is down with the program, so they shed all pretense and both Ivan and Jake begin to have their way with Addison. Ivan fucks Addison's mouth while Jake eats his asshole, licking him up and down before shoving his cock deep inside.  Addison continues to suck on Ivan as Jake pounds away, but Ivan is clearly jealous and wants a piece, so they switch up, and Ivan goes to town as Jake kisses Addison. Jake watches Ivan do his business but before he busts, he'd like one more crack at Addison's crack before he loses his nut, so Addison flips over and Jake finishes him off missionary, slamming into Addison with thrust after thrust as Ivan begins to spray his load all over Addison's glistening body. Jake pulls out and blasts Addison with a double dose of jizz before Addison completes the trifecta with his own well massaged release. With all three of them sated and satisfied, they hop in the pool to wash off and cool down. Enjoy!",
  "models": [
    {
      "name": "Addison Graham",
      "person_id": 32786
    },
    {
      "name": "Ivan James",
      "person_id": 37374
    },
    {
      "name": "Jake Karhoff",
      "person_id": 37028
    }
  ],
  "release_date": "2015-09-18",
  "scene_id": 78501,
  "series": "NDO - 4596 - Jake Karhoff, Ivan James & Addison Graham",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Condom",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Outdoor",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Poolside Massage"
}