{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "When Garrett Cooper first rested his eyes upon Drake Tyler at a boutique cheese shop in Monterey, California, he knew he had found love.  That was 3 short years ago today, and now Drake has returned home to find a romantic, anniversary surprise waiting for him.  Not only did Garret know it was love, he also felt a strong yearning in his dick.  For at that moment, his cock began swelling faster than it ever had before.  He wanted to be deep inside Drake.  And so after the usual courtship, Garrett and Drake began a passionate relationship full of hot, intense sex.  Today, Garrett has prepared for him a bath with rose petals, and lit several candles in the bathroom to create just the right romantic atmosphere.   Drake comes into the house and finds Garrett nude, next to the tub, waiting for him.  Drake gets in and Garrett washes his body.  They kiss for a while before Garrett wraps his mouth around Drake's pulsating erection.  He sucks him for a while as Drake pokes his dick out of the bathwater.   Then Drake stands up in the tub so Garrett can continue servicing his big cock.  After a while, Drake gets hungry for Garrett's dick.  Drake pulls him up, kissing him all the way, then Garrett sits on the edge of the tub so Drake can slurp his swollen meat.   Drake is sure to work Garrett's cock with passion, just the way Garrett did for him.  But Drake also wants his wonderful boyfriend to pound his tight hole.  He climbs atop Garrett's stiffie and slowly works up a good pace, feeling every inch of Garrett's amazing dick.   Garrett soon moves to the floor where he really gets into a fervent pounding rhythm.  The excitement and the ecstasy lead both of them to erupt from the intense pleasure.  Join them as they celebrate their love and perform the ancient ritual of intertwining kindred souls.",
  "models": [
    {
      "name": "Drake Tyler",
      "person_id": 32530
    },
    {
      "name": "Garrett Cooper",
      "person_id": 37542
    }
  ],
  "release_date": "2015-09-17",
  "scene_id": 78520,
  "series": "NDB - 4597 - Drake Tyler & Garrett Cooper",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral"
  ],
  "title": "A Deep Love"
}