{
  "collections": [
    "Next Door Originals"
  ],
  "description": "When Markie More and boyfriend Quentin return home for a reunion with their childhood mates, they do so with a big secret. Years removed from the group, Markie and Quentin have become exclusive, and it is Quentin's hope that this will be the weekend they tell the rest of the gang. They discuss this as they walk hidden paths and trails, which leads them to an old church. Quentin is all for exploring but Markie has reservations, so Quentin decides to loosen Markie up a bit with a little fun, and he presses Markie up against the building and they begin to make out.</br><br>Fresh out of the shower after 3 days of driving, Paul Canon is ready to mingle, so he goes out after the guys in hopes of maybe catching up with them on their hike. Needless to say, when he stumbles upon them at the church, naked as jaybirds as Quentin sucks Markie off, Paul is surprised. Not only did he not know the guys were together... he didn't even know either one of them was gay. Paul hides around a corner and watches, getting hot and bothered in the process, so he takes out his wang and begins to stroke it.</br><br>Unbeknownst to Paul, Markie and Quentin can hear him, and Markie catches him wacking it, so he takes Paul by the hand the three of them finish together, stroking, sucking each other off, and then running a train on each other as the rest of the guys begin to show up. Going to be one hell of a weekend, if this is how it starts.</br><br>Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Paul Canon",
      "person_id": 36900
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2015-09-25",
  "scene_id": 78563,
  "series": "NDO - 4598 - Markie More, Quentin & Paul Canon",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "The Reunion: Playful Boyfriends"
}