{
  "collections": [
    "Active Duty"
  ],
  "description": "Well this one will certainly be an adventure to remember. We have Jeremy, who came on and joined Quentin just recently, and we also have Ivan, who's a brand new recruit (and cute as a button!).After Claude, our man on the front lines, chats the boys up for just a bit, the two strip down, side-by-side on the bed, and ripen up their luscious cocks for our eyes to consume. That dick on Jeremy just won't quit. It's exquisitely shaped and looks so hot being stroked in his masculine hands. Ivan obviously liked it, as he didn't waste much time before leaning over and wrapping his mouth around the throbbing thing.  Then we have Jeremy leaning over to suck Ivan's hard meat. Jeremy makes great eye contact with Claude's camera as he pleasures his new buddy. Before too long, Ivan is working the stiff cock on Ivan into his tight hole.  Jeremy had to help him with the initial penetration, and also help him work into a good rhythm. Once they get going, we see this team work cohesively as Ivan bounces on Jeremy's cock while Jeremy jerks Ivan. At one point, Jeremy lets Ivan's swollen dick bounce on his chest.  Then they switch things up so Jeremy can fuck Ivan's ass from behind. 'It must feel good, 'cause his dick is hard,' Claude observes out loud at one point. At this, Jeremy reaches for Ivan's cock to find Claude's words to be ringing true.  He jacks Ivan some more while they fuck. Finally, Evan goes to his back so Jeremy can pound him a bit more before they switch. Ivan enjoyed fucking Jeremy's ass so much. I think he had built up a good haul of anticipation. And he sure makes the most of it! I enjoyed very much the verbal back-and-forth these two had while Ivan was pounding him. 'Do you like that?' Ivan asks. 'I love it,' Jeremy tells him.  And I know that boy wasn't lying!",
  "models": [
    {
      "name": "Jeremy Diesel",
      "person_id": 37462
    },
    {
      "name": "Ivan James",
      "person_id": 37630
    }
  ],
  "release_date": "2015-09-20",
  "scene_id": 78570,
  "series": "Jeremy & Ivan",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "First Time",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Tattoos"
  ],
  "title": "Jeremy & Ivan, Scene #01"
}