{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Thaaaaat's right, fuck fans!  It's Big Dick Sunday, and these three sizzling-hot guys are fired up.  We have the tall, sexy Mark Long, the cock-hungry and gorgeous Dante Martin, and the incredibly chiseled Brad.  They've each been working 'hard' recently, so director Rocco Fallon is giving them a treat!  The boys don't know what to expect, but once they're all in the same room, ready to go, Rocco is filling them in on the plan.  They're being rewarded with the chance, in Rocco's words, to remove all the porn distractions, like dialogue, premise, etc., and getting the chance to get as wild and crazy with each other as they want!  You want it and they want it.  This is real, natural sex, the way it's best enjoyed. Dante is the man in the middle for this adventure and he does NOT hesitate to jump in head first.  If you know Dante's style, you know he's always full steam ahead, eager to have his holes fucked.  Getting to play with two big dicks at once, with no rules, is right up his alley.   The guys start out slow and passionate, taking turns kissing Dante and feeling each other all over.  Then the shirts come off and dicks harden up a bit.  After Dante enjoys nibbling Brad's hard nipples for a while, the pants all come off and Dante strokes both guys at once.  It's a breathtaking sight to see such a hot guy jerking two enormous, stiff cocks. Then Dante goes to sucking one at a time.  He starts by taking deep mouthfuls of Mark's fat meat, then going over to take Brad's erection.  This gets Brad curious about Dante's ass, so he leans over and flicks his tongue in there while Dante goes back to slurping Mark's dong.   The feeling of Brad tonguing his hole gets Dante eager to be fucked.  He wraps his lips around Brad's dick again and presents his tender ass to Mark to be ravaged.  And boy does Mark take advantage!  He slides his throbbing cock into Dante from behind and rocks him hard and deep. Dante goes from getting banged by Mark to riding Brad on the couch.  Brad helps him out by bouncing his bubbly ass up and down on his thick boner.   Dante goes to his back so Brad can continue slamming his hole while Mark sticks his meat into Dante's mouth again.   Join in, fuck fans, for an epic encounter where anything is allowed and the boys have a real field day with each other.  And when these amazing dudes each erupt all over Dante, you're gonna wanna right there in the middle!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Brad A",
      "person_id": 37626
    }
  ],
  "release_date": "2015-10-01",
  "scene_id": 78625,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Condom",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Big Dick Sunday"
}