{
  "collections": [
    "Active Duty"
  ],
  "description": "This one turned out to be a real blast, in more ways than one!  It's Quentin, Dominic, and Sawyer, and not a one of 'em has ever been part of a threesome on camera.  I loved this mix from the jump.  The chemistry was definitely there in a big way, and it was an all-around sexy good time.This one started off with a ton of great energy, and the vibe continued through the rest of the time they spent together.  This was just a good group that meshed well.  I think Sawyer was the most dominant of these boys and definitely the most vocal.  He kicked things into gear when he asked Dominic, 'can I borrow that mouth for a second?' And how could Dominic resist that wry little grin?!  He didn't hesitate to wrap his lips around Sawyer hard cock.  It wasn't long before Quentin was on all fours on the bed, presenting his ass to Dominic.  Dom went in pretty slowly, like a young gentleman, and worked up his pace a bit.  Only moments after sliding his dick in, Sawyer joined the party and made it a three-man FUCK train!  What I enjoyed a lot was the contrast of skin tones while they all worked together.  We had nicely tanned Sawyer bringing up the ol' caboose, then Dominic in the middle with his gorgeous fair skin, and Quentin, who's pretty much in between.  For a fuck train, the action got pretty wild and hot, especially considering all three were popping their threesome-on-camera cherries.  Wow, we're lucky to have these boys on our recruitment roster, that's for damn sure!The train led to Quentin on his back, taking Sawyer's cock in his ass and Dominic feeding Quentin a mouthful of boner.  Then it was Sawyer's turn to get pounded, so he gave Dominic, our freshest soldier, fuck his eager ass.  Join this three-man-squad as they have a great time making new friends, pushing their boundaries, and blasting hot loads, side-by-side!",
  "models": [
    {
      "name": "Dominic",
      "person_id": 37534
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Sawyer",
      "person_id": 35300
    }
  ],
  "release_date": "2015-09-13",
  "scene_id": 78661,
  "series": "Dominic, Sawyer & Quentin",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Blowjob",
    "Brunette",
    "Gay",
    "Jerk Off",
    "Kissing",
    "Muscular",
    "Sandwich Fuck",
    "Smooth",
    "Tan",
    "Tattoos",
    "Threesome",
    "Twink"
  ],
  "title": "Dominic, Sawyer & Quentin, Scene #01"
}