{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Tension mounts as prodigal son Johnny Torque returns. Markie, Quentin and Paul were hoping that their tryst behind the church would stay a secret, but it appears Johnny also caught a glimpse of the fun, and it's put Markie in between a cock and a hard place. As he and Johnny make the bed, their past feelings are evident, and as one thing leads to another, Markie finds himself pinned beneath Johnny in a passionate embrace that makes him remember why they were involved in the first place. Johnny slips down to Markie's waist and begins sucking him off. Markie gets hard immediately, and Johnny can sense his hunger. Markie pushes Johnny up against the head board and deep throats his ex's dick, spitting on the head and slobbering all over the shaft, then throwing him down on the bed and mounting him. Markie rides Johnny's dick like he was making up for lost time, but Johnny wants control, so he flips Markie over and pounds him from behind, running his hands along Markie's back before grabbing him at the waist and thrusting long and hard. Markie wants to see Johnny's face as he cums, so he flips over into missionary and begins to stroke himself off as Johnny continues to hammer away. Markie spits his load all over himself, dousing his stomach as Johnny pulls out and blasts him with a load years in the making.But wait? Is that Quentin creeping just outside the doorway?Enjoy!",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2015-10-02",
  "scene_id": 78660,
  "series": "NDO - 4600 - Johnny Torque & Markie More",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "The Reunion: Hard Mistake"
}