{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Mark Long is quite a horny young man.  So horny, in fact, he's jerked off in semi-public places more than a few times.  He's never been caught, but there've been a few close calls.  Today, as Mark waits in the community laundry room for a load of laundry to work through a cycle, he gets that feeling where he's just get off!Jake Karhoff is a fellow condo resident and is having a nice, lazy laundry day.  But when he discovers that the door to the laundry room has been locked, he must find Pete, the building manager, to unlock the door.  When Jake enters the room to find Mark, mid stroke, Jake stays cool and doesn't act too excited.  Mark, on the other hand is extremely embarrassed.  He pulls up his pants and turns beat red.  Jakes certainly likes the look of Mark's enormous cock.  And in this particular situation, he can pretty well guess that Mark might be game for some fooling around, seeing as he must be very horny.  When Jake suggests they hookup, Mark doesn't hesitate accept his advances.  Jake goes to Mark and they kiss passionately.  Soon, Mark's dick is making its second appearance, and Jake is slurping it as deep as his throat will allow.  Mark can't believe his luck!  The hot guy he's seen around the condos is sucking him off.  It's not long before Jake is presenting his tight hole for Mark to fuck.  Once Mark squeezes his swollen dick into Jake's ass, the action intensifies quickly.  Mark bangs Jake's hole while Jake props his foot up on a dryer.  After a while, they move to a chair where Jake climbs atop Mark and goes for a good, stiff ride.  Mark loves how much Jake enjoys taking his fat cock.They move back over to the dryer to finish things off with a hard fuck session, where Jake ends up getting blasted in the face with Mark's hot, sticky cum.  Now this was a load worth waiting for!Enjoy!",
  "models": [
    {
      "name": "Jake Karhoff",
      "person_id": 37028
    },
    {
      "name": "Mark Long",
      "person_id": 18862
    }
  ],
  "release_date": "2015-10-22",
  "scene_id": 78684,
  "series": "NDB - 4605 - Jake Karhoff & Mark Long",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Masturbation",
    "Muscular",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Laundry Room Hookup"
}