{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Rod Peterson is such a sweet, loving boyfriend.  He woke up early this morning to make breakfast for his beau, Alexander Gustavo.  When Alexander sees the lovely spread, his heart is filled with love.  When he tastes Rod's delicious cooking, his mouth is filled with flavor.  And when he shows his appreciation, his ass gets filled with cock! Once finished eating, Alexander thanks his man, and tells him to join him in the bedroom in about 5 minutes for a surprise.  When Rod comes to him, Alexander is laying nude on their bed, stroking his big, hard dick.  'Look at THAT big breakfast sausage!' Rod says with delight.  They kiss, and Rod makes his way down Alexander's body, finally wrapping his mouth around Alexander's throbbing meat.  They look deep into each other's eyes as Rod takes that cock down his throat.  Then Rod goes to his knees so Alexander can have a helping of HIS special breakfast sausage.  And boy is there plenty to go around!  Alexander slurps Rod's erection for a while before they move into a 69ish position where Alexander gives Rod's tight hole a nice, thorough tonguing.  Next, Alexander stands up and inserts his throbbing dong into Rod's sweet ass.  He bangs his lover good and hard.  Rod loves feeling his man fuck him without mercy.  The amazing feeling makes Alexander's own ass hungry to be slammed, so Rod lays down and Alexander climbs on top of him for an intense ride.  Finally, they switch and Alexander takes to his back so Rod can really deliver a fast, hard fucking.  This leads them both to the peak of ecstasy together.  Join them and experience how these true lovers celebrate their passion for one another by indulging in some serious breakfast sausage!",
  "models": [
    {
      "name": "Alexander Gustavo",
      "person_id": 27416
    },
    {
      "name": "Rod Peterson",
      "person_id": 37677
    }
  ],
  "release_date": "2015-10-08",
  "scene_id": 78728,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Blowjob",
    "Brunette",
    "Condom",
    "Deep throat",
    "Gay Couple",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Breakfast Sausage"
}