{
  "collections": [
    "Next Door Originals"
  ],
  "description": "After finding his boyfriend Markie in bed with Johnny Torque, Quentin decides to spend the night on the couch, which is precisely where Paul Canon finds him in the morning as he sits down to enjoy his coffee. Quentin stirs awake, but when Paul asks him why he's on the sofa, it becomes obvious that Quentin is in no mood for talking. He quickly grabs Paul's hand and leads him outside, where the two of them make off on the quad. After riding in silence for a while, Quentin brakes beneath a tree, and without explanation, begins to kiss Paul feverishly. Paul is confused, and Quentin explains that he caught Markie cheating. Paul's confusion melts away as he consoles Quentin, with his hands already finding their way down Quentin's shorts. Paul reaches into Quentin's pants and pulls out his cock, wrapping his lips around it as it gets hard in his mouth. Quentin fucks Paul's face and then pushes him up against the ATV as he takes off Paul's clothes. After sucking him off, he begs Paul to fuck him, so Paul leans back and Quentin mounts his revenge fuck, grinding on Paul's giant cock as Paul shows no mercy.Paul bends him over and slams him from behind as Quentin grabs a hold of the bars for leverage, and then finally Paul turns him over and they embrace before Paul pounds away one final time, fucking the cum out of Quentin and then blasting him with his own wet mess. As the sun begins to turn to midday, the guys realize someone's probably looking for them so they promise to keep their tryst a secret and head back to the house.Enjoy!",
  "models": [
    {
      "name": "Paul Canon",
      "person_id": 36900
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2015-10-09",
  "scene_id": 78798,
  "series": "NDO - 4602 - Paul Canon & Quentin",
  "tags": [
    "Anal Sex",
    "Athletic",
    "Blowjob",
    "Brunette",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "The Reunion: Sexual Revenge"
}