{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As the weekend kicks into full swing, almost everyone has made it back home. Johnny found Arad and Dante in town, and after the ruckus of the afternoon bar-b-que, things are starting to quiet back down around the house, as Arad and Dante wind down with a glass of wine by the pool. The moon shimmers off the water as Dante catches Arad up on all of the latest gossip. Without warning, Dante sheds his shorts and hops into the pool, goading Arad to do the same. Arad is hesitant but complies, and the brisk water invigorates both of them, charging them with renewed energy.  After years of subdued urges and a secret crush on Arad, Dante finally just throws caution to the wind and makes his move on Arad, swimming over to him as he leans on the pool ledge. Maybe it's the wine, or the moment, or maybe the feeling has always been reciprocal, but for whatever reason, Arad does not resist, and Dante throws his arms around Arad and they share a kiss in the pool.   Ever the opportunist, Dante immediately goes to Arad's cock, slowly growing harder to Dante's touch, and becoming fully erect as Dante slips his lips around its head. Dante deep throats as Arad pushes his head down the shaft. Dante gags and sucks Arad's balls, and then they set up poolside on a towel as Arad returns the favor, before flipping Dante over and plunging his cock deep inside the bubble butt before him. Arad pounds away as Dante savors every moment, flipping around onto his back as Arad continues to thrust away, admiring every inch of Arad's beautiful physique, and taking every inch of his pounding penis.  Dante cums all over himself as Arad pulls out and shoots a hefty load all over him, rolling back into the pool together to refresh from their messy and long overdue liason.   Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Arad",
      "person_id": 34440
    }
  ],
  "release_date": "2015-10-16",
  "scene_id": 78799,
  "series": "NDO - 4604 - Arad & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Caucasian",
    "Climax",
    "Condom",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Outdoor",
    "Smooth",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "The Reunion: Wet Seduction"
}