{
  "collections": [
    "Next Door Twink"
  ],
  "description": "In a world where every massage experience is an uncharted course for adventure, Ian Levine makes himself comfortable on a table belonging to one Alex Greene, of the Vineyard Spa.  Ian's heard stories, in fact he's heard particular yarns involving Alex.  That's why he's taken special precautions to ensure that Alex will be massaging him today.  Once they meet, Alex turns his back so Ian can get comfortable and settle in for a soothing rubdown.  Ian chose to wear something scant, sexy, and fun: a playful jockstrap that displays his plump, rounded buttocks nicely.Alex is indeed enticed at the first site of Ian's gorgeous rear end.  He gets right into the rubbing.  As the pressure increases, Alex, only after receiving the green light from Ian, pushes the towel off of Ian's backside, completely exposing his sweet cheeks.Alex massages in an increasingly presumptuous manner, titillating will and eager Ian.  It's not long before Alex is face deep in Ian's ass.  He licks the tight, pink hole, taking breaks to use his thumb to play with it.  Ian is delighted to have such a hot guy enjoying his tender hole.  When Alex moves around to the front of the massage table, where Ian's face is, he pulls out his swollen cock and Ian gladly accepts It into his mouth.  All the ass play was making Ian hungry for fat dick, and it came just in time.  After slurping and licking Alex's fine erection, it's Ian's turn to put his throbbing meat into Alex's mouth.  Alex gives Ian the royal treatment, taking the firm cock deep into his throat.  Then it becomes time for Ian to get the 'deep' treatment.Alex lifts Ian's legs, slides his dick inside that tight pocket, and fucks it hard.  Ian can scarcely believe the power Alex can generate.  Every thrust felt like it was coming harder and faster than the last.  Soon it was time for Ian to flip over so Alex could pound him doggystyle on the table.  Join this extremely intimate massage session at the Vineyard Spa and find out why the special rubdown packages are being booked so regularly!",
  "models": [
    {
      "name": "Alex Greene",
      "person_id": 37421
    },
    {
      "name": "Ian Levine",
      "person_id": 34468
    }
  ],
  "release_date": "2015-10-07",
  "scene_id": 78821,
  "series": "NDT - 8303 - Alex Greene & Ian Levine",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Facial Hair",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Outdoor",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Bubble Butt Massage"
}