{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Almost all the guys have made it back home for the reunion, but unfortunately for Pastor Pierce, they're all off in town. Derrick Dime, luggage still in hand, finds him alone his room reading, and they share the warm embrace of long time friends. As Derrick sits down and eases in, Pierce catches him up on all the news. Derrick's clearly a bit shocked to find out so much shennanigans have taken place, but he shifts the conversation to Pierce. Pierce informs him that he's now a pastor and the look on Derrick's face sinks a bit. He asks Pierce how that effects his sexual behavior and Pierce assures him the two are cohaibitable inspirations. With that, he grabs Derrick and they begin to make out on the bed. Derrick struggles to get out of his tight clothes because he's halfway consumed with getting at Pierce's cock. Ripping the pastor's jeans off him, Derrick sucks Pierce to a sweaty frenzy before repairing to his knees and watching Pierce return the favor. Pierce gags on Derrick's huge cock but what he really wants is a nice penitent pounding, so Derrick bends him over obliges. Derrick's cock feels good as sin to Pierce, who pushes back against Derrick's body, taking his dick to the base, before mounting him and grinding away with a conviction that borders on fanatical. Pierce lets loose his holy seed as Derrick blasts him with a second coming, and they bask in the glory of abundance, they realize they are both in good hands going forward.Enjoy!",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Pierce Hartman",
      "person_id": 34911
    }
  ],
  "release_date": "2015-10-23",
  "scene_id": 78849,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "The Reunion: Arousing Faith"
}