{
  "collections": [
    "Next Door Originals"
  ],
  "description": "The culmination of a long overdue reunion has finally commenced, and with it, the opportunity to exorcise some old demons, as the guys finally get to confront their childhood bully, Brad. To his credit, Brad doesn't chicken out when Torque and the gang ask him to meet at Pierce's church, and as the guys tie him down to a chair and begin to cut away his clothes, he realizes this is a night he will never forget.As Johnny taunts him with his past deeds, Brad's cock surges and gets hard underneath his shorts. Johnny senses Brad's nervousness and teases him further, as Quentin, Paul, Ivan and Dante slowly rub him down with oil. Freshly anointed, he is ready for his initiation, as Paul and Quentin begin to suck him off. The rest of the guys fan out around them- Dante and Arad rekindling their new found romance, Markie and Derrick together in a corner- as Johnny shoves his cock inside Brad's mouth. Brad tries to resist but his heart isn't into it, and Johnny just shoves his cock deeper down Brad's mouth, as Ivan begins to mount him. Ivan works his ass against Brad's rock hard dick as Derrick fucks Markie in one of the pews. Arad spreads Dante out, slowly stroking his cock as he penetrates him on the altar. Pierce has his way with Paul, as Paul sucks Quentin off, and Johnny steps back and admires it all, proud to have orchestrated such a sacred and cathartic gathering.Enjoy!",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Brad A",
      "person_id": 37626
    },
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Ivan James",
      "person_id": 37374
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Paul Canon",
      "person_id": 36900
    },
    {
      "name": "Pierce Hartman",
      "person_id": 34911
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2015-10-30",
  "scene_id": 78867,
  "series": "NDO - 4608 - ORGY",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Deep throat",
    "Facial",
    "Hardcore",
    "Latino",
    "Masturbation",
    "Oral",
    "Orgy",
    "Pornstar",
    "Tattoo/Piercing"
  ],
  "title": "The Reunion: Holy Gathering"
}