{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "They're 2 peas in a pod and they're making a big splash!  When these two Buddies get together, you can bet there's gonna be some laughter and fun.   As sexy Rob Ryder soaks up rays, poolside, his mischievous friend, Alex Greene, dives in and swims toward unsuspecting Rob.  Alex surfaces and splashes cold pool water on Rob, quickly rousing him from a pleasant daydream.   Rob never lets Alex get one over on him without payback, so a wild dunk battle ensues.  As they horse around, both Alex and Rob become amorous from their nearly nude bodies rubbing against one another.  They slow things down, drift toward the edge of the pool, and start the hot make out session. Things heat up even more when Alex pulls down Rob's shorts and takes his throbbing cock into his mouth.  Rob loves the feeling of hot sun while enjoying a deep-throat blowjob from his most attractive friend.  And boy does Alex know how to handle a hard dick! They move outside of the pool, where Rob pulls out Alex's incredible large dick and returns the favor.  Rob savors the fat, swollen meat on his lips as he slurps it with pleasure.   Alex wants to get fucked really badly after the hot oral, so he lays back and allows eager Rob to slide his fat cock into that sweet, tight hole.  Rob really goes to town on that sexy ass.  But Alex isn't the only one at the pool who likes to get his hole banged...the guys soon switch so Rob can take a pounding too. It's a playful, hot day in the sun as these amazing boys let the heat lead them into intensely sexual territory.  Please join them...but don't forget to wear sunscreen!",
  "models": [
    {
      "name": "Rob Ryder",
      "person_id": 9023
    },
    {
      "name": "Alex Greene",
      "person_id": 37421
    }
  ],
  "release_date": "2015-10-15",
  "scene_id": 78864,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Climax",
    "Condom",
    "Facial Hair",
    "Hardcore",
    "Oral",
    "Outdoor",
    "Rimming",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Cum Splash"
}