{
  "collections": [
    "Active Duty"
  ],
  "description": "There's some real chemistry going on here between Quentin and Bridger.  Right off the bat, they're kissing goes from nothin' to a hundred, fast.  Bridger takes advantage of the situation and really makes the most of this opportunity to heat things up with a Quentin.  Not long after they start making out, both sets of pants are off and Quentin's head is in Bridger's lap, with his lips locked around Bridger's mammoth dick.  As a fresh recruit, this is all very new to Bridger, and it's easy to tell from his face.  While Quentin enjoys that big, throbbing cock, Bridger can't help but smile and laugh frequently.  It was great to see such ecstatic, natural reactions.  And from Quentin, too!  'You've got a really nice cock, man,' Quentin looks up and says with a big smile, making Bridger chuckle a little. From there, Quentin climbs atop Bridger, guiding his large erection into his tight, eager ass.  Quentin starts slow, gets acquainted with Bridger's impressive girth, then takes off for a nice ride.  'Fuck yeah, you're deep now,' Quentin says, just before the two kiss again.  The frequent, tender kisses are one of the easiest ways to spot the real connection these two dudes have. They move to a standing position so Bridger can really leverage some of the power from his tall, well-built frame.  He pounds him hard and Quentin takes the punishment very well.  Another hot kiss happens near the beginning, and we see some of Bridger tendency to nibble and bite.   Finally, the guys jerk the hot, sticky loads out, side-by-side.  This is such a great match up, and I'm glad we could get these boys together, particularly as it's one of Bridger's first times.  I know after a powerful experience like this, he'll certainly be back for more, looking to meet even more like-minded recruits like Quentin!",
  "models": [
    {
      "name": "Bridger",
      "person_id": 37598
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2015-09-27",
  "scene_id": 78910,
  "series": "AD - 28 - Quentin & Bridger",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Jerk Off",
    "Kissing",
    "Muscular",
    "Tattoos"
  ],
  "title": "Quentin & Bridger"
}