{
  "collections": [
    "Active Duty"
  ],
  "description": "Meet Austin, a fresh-faced new recruit who, I'm glad to tell you, is dipping his toe in the water here at Active Duty.  After you see his solo debut here, I can guarantee he'll be your newest favorite, and the soldier you're most eager to see mix it up with fellow platoon members. I've got to hand it to Claude...he's been scoring big time lately, and Austin might be one of his finest recruits so far.  When I say this boy is handsome, you'll see why that's an understatement.  Austin is smoking hot, from his head, down to the tip of his nicely shaped cock.  He's a tried-and-true military boy and his incredibly chiseled body can back that up.  Check out his sexy tattoos.  Austin tells Claude, after Austin jerks off and is taking a shower, that the heart frequency ink on his chest is one he gave to himself.  Now that's talent! In addition to having a knack for body art, Austin seems to have a pretty darn good handle on stroking his hard dick.  Claude sets him up on the couch, where Austin goes from rubbing himself, fully clothed, to eventually seated butterfly style, tugging his meat and fingering his tight hole.   Austin has beautiful skin.  I've always been a sucker for a slight farmers' tan, and it looks like Austin's been wearing shorts lately.  Claude gets some great shots from Austin's POV, giving us a great view of his gorgeous cock getting jacked.   And finally, we get a nice, hearty blast from his fine recruit.  He even fills up his cute li'l belly button with warm, sticky cum.  During his shower, we get more a sense of Austin's personality.  It's easy to see, from his chat with Claude here, that Austin had a great time.  I think it's safe to say we'll be seeing this gorgeous new AD addition back real soon!",
  "models": [
    {
      "name": "Austin III",
      "person_id": 37775
    }
  ],
  "release_date": "2015-09-30",
  "scene_id": 78920,
  "tags": [
    "Blonde",
    "Jerk Off",
    "Smooth",
    "Solo",
    "Tattoos",
    "War Chest",
    "White Butt"
  ],
  "title": "Austin"
}