{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "The guys are killing time around the table, playing a few rounds of cards before night fall. Without much to bet, the game grows stagnant, so Alex concocts the stakes for a high risk game: loser bottoms for the other two. Immediately eyes dart about the table, as each guy sizes up the competition. Alexander is confident, while Rob is borderline cocky and Alex is downright calm. As the cards fall, it becomes clear Rob is not much of a poker player, as he quickly loses his shirt and pants, then loses his underwear in the hand that follows, and with all three guys stripped down to their skivvies, the final hand is dealt, and for the Alex's it's all aces as Rob comes in with the low hand. Celebrating, they high five and bend Rob over the table. Alex shoves his dick into Rob's mouth as Alexander moistens up his hole for the pounding. Rob chokes down on Alex's meaty cock, growing hard as he does, while Alexander enters from behind, thrusting into Rob and pumping him full of dick. The guys have Rob roasted like a pig on a spit, before they switch places, and it's Alex's turn to have his way. Rob mounts Alex and rides him like a horse as Alexander comes close to spitting his load.Alex fucks the cum right out of Rob, who shoots his load as Alex pounds away, and then Alex and Alexander both douse Rob's face with a pair of loads that leaves him dripping in jizz. Soaked and satisfied, it's hard to tell who really won this bet, and who really lost.</br><br>Enjoy! ",
  "models": [
    {
      "name": "Alex Greene",
      "person_id": 37421
    },
    {
      "name": "Alexander Gustavo",
      "person_id": 27416
    },
    {
      "name": "Rob Ryder",
      "person_id": 9023
    }
  ],
  "release_date": "2015-11-05",
  "scene_id": 78921,
  "series": "NDB - 4609 - Alex Greene, Alexander Gustavo & Rob Ryder",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Deep throat",
    "Facial",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "Hard Poker"
}