{
  "collections": [
    "Icon Male"
  ],
  "description": "Adam Russo visits Matt Stevens while he's reading in bed. Adam can't sleep and he's not used to being alone. Sensing that he's disrupting Adam's life with Sean, Matt offers to move out to get out of their hair. Matt's ex-stepson Cody is visiting, and was invited to stay, but his ex-wife is protesting it.Adam begs him not to go, he needs someone his own age around to talk to. Loneliness gets the best of them, as they scoot closer together. Adam's hand strokes Matt's thigh, rubbing his hand, enjoying their closeness. Slowly, the sexual tension builds and as Adam plays with Matt's beard. They kiss, excitement building as they caress their hairy bodies as Adam's dick tenting out his gray jogging pants, which Matt soon pushes his face into, licking the stiff cock through the material.Matt frees the dick and sucks takes every inch into his mouth before Adam stands him up, stopping to suck on his nipples and ending in a deep rim job, his tongue circling his hole between the muscular cheeks. The fit daddies kiss again and Matt climbs onto Adam, sliding his muscular ass down onto the thick waiting pole. Matt's cock is rock hard, pre-cum glistening as it leaks from his dick while he fucks up and down.Adam spreads Matt's cheeks, before pounding him deep and hard. As they embrace, every inch of their bodies pressing against each other, Adam slides his thick dick back into Matt's waiting hole as it greedily takes every inch. Matt wanks himself to completion, his cum dripping over his belly and Adam has a roaring orgasm.",
  "models": [
    {
      "name": "Matt Stevens",
      "person_id": 35619
    },
    {
      "name": "Adam Russo",
      "person_id": 35627
    }
  ],
  "release_date": "2015-10-08",
  "scene_id": 79006,
  "series": "The Stepfather 2",
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Muscular Guys",
    "Oral/ Blowjob",
    "Reality",
    "Rimming",
    "Safe Sex"
  ],
  "title": "The Stepfather 2, Scene #02"
}