{
  "collections": [
    "Icon Male"
  ],
  "description": "Black muscle hunk Osiris Blade hangs out with his girlfriend, nervously waiting for her handsome daddy Adam Russo to get home. After quickly meeting his father in-law, Osiris invites his girlfriend and her Dad up to his Mother's remote New Hampshire cottage for the weekend. Osiris and his daughter have only been dating a few months and Adam feels going up to the cottage is premature, but he's finally convinced and he and his daughter make their way up to the cottage for a weekend of fun, and family bonding.When Adam goes down to the local lodge for a drink, a flashback brings Osiris back to the time he went down to the lodge and met hunky bartender, Nick Capra. Osiris looked like he had the weight of the world on his muscular shoulders, and Nick knew just how to solve his tension. When Nick pries to get to the source of his frustrations, Osiris doesn't do a great job at hiding it. Nick is convinced Osiris' problem is that he's dealing with being gay. He can't fool his bartender. Nick leans in for a kiss and reaches under Osiris' polos, rubbing his firm stomach before feeling his growing erection. Osiris nervously unbuttons Nick's shirt, and Nick undoes his pants letting his big cut cock jump out of his black briefs. Osiris takes it into his mouth and Nick returns the favor, sucking on Osiris' cock and balls. Nick helps Osiris up off the couch and grabs his firm ass before turning him around and cock-slapping his cheeks with his huge meat. Nick lays Osiris down on the couch and positions his cock to slide into him,  penetrating him slowly, his dick hard as stone. Osiris relaxes as his bartender slips into him with a moan. Nick uses his leather belt as a gag, holding the big black stud down while he fucks his ass. Nick can't hold himself back any longer and pulls out of his ebony patron, before jerking himself while Osiris plays with his balls and blows his thick load all over his hands. Nick is primed to return the favor, making out with him, his fingers grazing his nipples, and before long a fountain of cum erupts from his long black cock.",
  "models": [
    {
      "name": "Nick Capra",
      "person_id": 35574
    },
    {
      "name": "Osiris Blade",
      "person_id": 37742
    }
  ],
  "release_date": "2015-10-13",
  "scene_id": 79010,
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "College",
    "Cumshot/cum",
    "DILF",
    "HD",
    "Hairy Guys",
    "Interracial",
    "Jerking Off",
    "Muscular Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex"
  ],
  "title": "His Daughter's Boyfriend 2, Scene #02"
}