{
  "collections": [
    "Active Duty"
  ],
  "description": "We have a very cute little story on our hands this time.  It seems our man Claude threw a small mixer at his place recently, and invited a few AD recruits.  Ivan and Quentin were in attendance and hadn't met each other before the party.  Apparently, they talked, sparks flew, and they approached Claude with a request: they wanted to hookup on camera as soon as Claude could arrange it!</br><br>Although Ivan's a newer recruit, he  seems to feel comfortable with Quentin, who starts things off right away by taking out Ivan's hard cock and putting it into his warm, salivating mouth.</br><br>We catch a glimpse here of Ivan's incredibly cute smile.  He  throws Claude's camera a few of these throughout the video.  After Quentin enjoys Ivan's fat dick, and boy is it a nice cock, Ivan goes in and returns the favor.  </br><br>And Ivan doesn't wanna wait too long before fucking that sweet bubble butt.  Ivan lays on his back on the bed and Quentin pushes his throbbing dick into Ivan's tight, pink hole.  Wow, you're gonna love the way Quentin works his way up to a good, steady fucking.  He starts out nice and easy, but by the time they switch things up, Ivan is getting pounded pretty good...and loving it.  Even Claude chimed in during this bang session, telling Quentin, 'Yeah, pound him hard.  Make him earn his money.'</br><br>When Quentin decided it was time for his own ass to get fucked, he climbed on top of Ivan and squeezed Ivan's strong erection into his hungry hole.  He spreads Quentin's cheeks apart some of the time, thrusting some good pressure upward, giving Quentin a hell of a cock ride!  Check out the way Quentin jerks his own rod as he takes Ivan deep.  </br><br>This very hot action led to Quentin repositioning so Ivan could really get a good rhythm happening, fucking Quentin from behind.  From here we see some really awesome, passionate kissing.  'His dick is so big, oh my god.  It's stretching my little ass,' Quentin tells the camera while Ivan pounds him.  </br><br>Finally, before they finish things off, they each get one last taste of each other's big dicks.  It's a little whip cream and cherry on the top of this...well I guess you could call it a real date!  Boy, I wish more dates ended with a powerful, sticky blast like this one does.   ",
  "models": [
    {
      "name": "Ivan James",
      "person_id": 37630
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2015-10-04",
  "scene_id": 79034,
  "series": "AD - 30 - Ivan & Quentin",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Muscular",
    "Tattoos"
  ],
  "title": "Ivan & Quentin"
}