{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Everyone knows that when it's King B's birthday, there's gonna be a party!  King decided to chill with his friends, Ramses and Staxx this year on his special day.  They've been waiting for this all year.  When King asks them what gifts they have for him, he gets a mouthful of fat cock!King starts out by switching back and forth between Ramses's and Staxx's swelling dicks.  The guys make both at once a little more accessible by standing up and presenting their hard boners to King while he stays on his knees.  Boy does King take advantage of his birthday!  He crams both big cocks into his mouth at once and enjoys them thoroughly.  Staxx decides to move around back to get a nice taste of King's ass.  He licks his hole while King continues slurping back on Ramses's stiff meat.  It's not long before Ramses is slamming King's sweet hole, just how he knows he likes it.  After all, it is King's special day!  The guys soon switch things around so Staxx can pound the birthday boy.  He fucks him good while Ramses enjoys King's tongue in his ass.  It's a very special with come true for King on his birthday.  Now these are what I call good friends! Enjoy!Disclaimer: King B was a wonderful performer and beloved by his many fans. Originally released shortly after his death, this scene was removed out of respect for him and his loved ones. After careful consideration, we believe he would have wanted his work to eventually be made available to his fans. And so, we've decided to re-release it. King B you will be missed. May you rest in peace.",
  "models": [
    {
      "name": "Ramsees",
      "person_id": 32527
    },
    {
      "name": "King B",
      "person_id": 34494
    },
    {
      "name": "Staxx",
      "person_id": 37784
    }
  ],
  "release_date": "2015-12-22",
  "scene_id": 79165,
  "series": "NDE - 209 - King B, Ramses & Staxx",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Black",
    "Climax",
    "Condom",
    "Dark Hair",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Wishes Cum True"
}