{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Markie More goes about his usual morning routine, prying eyes are watching. It seems Markie's wife doesn't think he's being honest with her, so she's hired Rod to find out whether or not Markie is into guys. As Rod snoops around, Markie hops into the shower. Rod pays special attention to Markie's physique as he watches his subject shower, and as Markie begins to get dressed, Rob's curiosity gets the best of him as he tries to sneak a little closer to get a better view, and that's when Markie catches him.  To Markie's credit, he handles it in stride, and instead of freaking out, he calmly questions Rod as to his purpose. When he finds out that Rod has been hired by his wife, he figures the best way to teach her a lesson is to turn the tables, and sensing Rod's enticement, he lures Rob closer until the two of them are lip locked in embrace.   Rod pushes Markie onto the bed and begins to kiss down his chest, making his way to Markie's cock. Rod sucks it down in one mouthful, bobbing up and down on Markie's dick as Markie pushes his head further down the shaft. Rod flips Markie over and proceeds to tongue his ass, fantasizing about what it will feel like to fuck Markie's sweet hole.   Moments later, fantasy becomes reality as Rod hits Markie from behind. Markie's eyes roll back into his head as Rod continues to pound away, and then the guys switch, and Markie lines up behind Rod's muscular physique, remarking that if his wife thought he was gay she shouldn't have sent such a hot private dick.   Markie slips inside of Rod and then the flip over and Rod grinds and rides Markie's hard dick until he spits his load all over his client, as Markie pulls out and sprays him down with the evidence of Markie's guilt. As they lay there sweating, Rod promises not to tell Markie's wife anything, but Markie has had all the confirmation he needs.  'Nah, make sure to tell her everything that happened,' he says with a cum drenched smile.  Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Rod Peterson",
      "person_id": 37677
    }
  ],
  "release_date": "2015-10-29",
  "scene_id": 79166,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Pornstar",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "She Hired Me"
}