{
  "collections": [
    "Next Door Twink"
  ],
  "description": "He's new in Hollywood, but he's determined to make it.  With a yearning hunger for fame, Preston Burgess is contacting every talent agent he can, taking every opportunity he sees to be seen.  Today, he's made a call to a casting director named Abel Archer.  Preston received Abel's simple, plain-looking business card from a friend.  This is his 6th call of the day.  Abel is surprisingly friendly on the phone, making Preston feel at ease from the start.  And to his great surprise and chagrin, Abel is casting AND has an opening to see Preston today!  Preston cannot believe his luck.Preston arrives at his comfortable-but-professional office and Abel invites him right in.  Being from Montana, Preston isn't used to big-city buildings, nor is he accustomed to meeting with influential men like Mr. Abel Archer.  Preston only tells Abel a little bit about himself before Abel tells him that he's quite impressed.  He asks Preston for any headshots, but he hasn't had any taken and wouldn't be able to afford having them done.  But it's OK.  Abel is a professional and seems to have such confidence in Preston, he's willing to take them for him himself, right now.   During the photoshoot, Abel explains to Preston that in Hollywood, he needs to expect to be doing things he wouldn't normally do.  This is how anyone ever makes it in the entertainment biz.  Preston is curious about this.  When he asks Abel what he means exactly, Abel reaches down and begins rubbing Preston's cock from outside his pants.   At this point, Preston has already taken his shirt off for the photos.  And by Abel's actions, he now understands just what he had meant.  He decides to allow Abel to continue making sexual advances without stopping him.   The rubbing lead to Abel pushing down Preston's pants and underwear, and taking out Preston's penis.  Here, with Preston laying on his side on a couch, Abel goes to his knees, leans in, and wraps his mouth around Preston's member.   That's when the sucking begins.  Abel bobs his head up and down, back and forth while sucking Preston's meat.  Preston can't stop  his penis from becoming increasingly swollen while enduring Abel's treatment.  Preston realizes that it does, in fact, feel very good, so he decides to just relax and enjoy it.  If this is what it takes to become famous, this ain't bad at all!  Next, Abel positions Preston on the couch so he can spread his butt cheeks apart.  Preston continues rolling with the punches.  Abel, now shirtless, grips Preston's penis tightly and jerks it a bit.  While doing this, Preston feels Abel's face in his ass, with Abel's tongue flicking around near his sensitive hole.  'Wow,' Preston thinks.  This is a sensation he never even could've imagined.  'Only in Hollywood!' Preston remarks to himself.    Abel stands up and pulls his pants down, then pushes Preston's face into his own cock.  Preston does what he thinks is expected and sucks on the dick.  It gets harder and harder while he works it.  After doing this for a while, Abel sets him back on the couch and sticks his stiff cock into Preston's tight hole.  From there, Abel fucks Preston's ass hard and good for a while.  Halfway through, Abel flips Preston around and pounds him while Preston is on his back.  It was sure a learning experience for Preston, and hopefully it will land him his first role!",
  "models": [
    {
      "name": "Preston Burgess",
      "person_id": 27314
    },
    {
      "name": "Abel Archer",
      "person_id": 36223
    }
  ],
  "release_date": "2015-10-21",
  "scene_id": 79190,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Facial Hair",
    "Hairy",
    "Mature",
    "Oral",
    "Rimming",
    "Slim",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Hollywood Scandal"
}