{
  "collections": [
    "Active Duty"
  ],
  "description": "Now this has to be a contender for one of my all-time favorites.  By now, we've seen Bridger jerk his meat for a sexy solo, and we watched him fuck Quentin's sweet, plump ass.  We know how much fun he can be and that body just won't quit!  This time, Bridger is breaking in newer recruit, Austin.  And MY GOLLY does it turn out hot!  Some deep kissing started up right off the bat and neither held back.  It wasn't long at all before they were completely stripped down, with Bridger on top, kissing each other like untamed animals.  They couldn't control themselves!  Bridger's big cock hardened up quick and was going in and out of Austin's sweet, soft mouth just after the naked make out.   Bridger decided he wanted to taste Austin's dick, so they moved into 69 position.  This really made Bridger eager to fuck!  He moved around to the edge of the bed, letting Austin stay on his back, and shoved his throbbing cock inside that little hole.  They switched things up and Bridger pounded Austin from behind, still on the bed.  They work up to a real intense pace and Austin still seems like he wants more and more hard cock.  The boy was just insatiable.  'His dick is rock hard,' Claude says at one point.  Indeed it was.  Bridger reached down right then and jerked Austin's erection while continuing to punish his sweet ass. Bridger decided to make use of a very substantial toy Claude had brought along.  Not long after working the thick cock into Austin, Bridger was vigorously banging him while Austin double-hand jerked his meat, taking the incredibly intense toy fucking.  I reckon this is the best dildo play we've seen in...I can't remember! The encounter ends with Bridger erupting onto Austin's face, jizz splattering aplenty.  This is definitely one you'll be coming back to for a while.",
  "models": [
    {
      "name": "Bridger",
      "person_id": 37598
    },
    {
      "name": "Austin III",
      "person_id": 37775
    }
  ],
  "release_date": "2015-10-11",
  "scene_id": 79214,
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Kissing",
    "Rimming",
    "Smooth",
    "Tattoos"
  ],
  "title": "Bridger & Austin"
}