{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Orlando Fox has a room for rent, but the spacious amenities come with a slight catch. Zane Porter isn't quite sure what Orlando's angle is, but he senses that this might not be such a standard rental agreement. Truth be told, the place is a bit beyond Zane's means, and Orlando sense that. He places his hand on Zane's knee and with a look he implores Zane as to whether or not a compromise can be reached.Zane is reluctant but eager to secure housing, so he relents, and immediately Orlando seizes upon the opportunity and unzips Zane's pants, grabbing for his cock and instantly going down on him. Zane realizes that he's in a Win/Win situation, and embraces the experience, especially as Orlando deep throats his cock and spits on the head, sucking Zane's balls and then working his shaft, before turning him over and eating his ass. It's all a new experience to Zane, but one that he doesn't dislike, so he pushes his limits further, falling down onto Orlando's cock and nibbling at it before swallowing it down his throat in one big gulp. Orlando's cock is rock hard and Zane's curiosity is piqued, so he lets Orlando penetrate him as he slowly grinds on top, riding his potential roommate like a horse as he works his ass back and forth. Orlando closes his eyes and smiles as Zane grinds away, but what Orlando really wants is some of that new dick, so the guys switch and Zane positions himself behind Orlando, pumping him full of hard cock as Orlando grips the sheets. Zane flips Orlando over and proceeds to fuck the cum out him before blasting him with such a big load Orlando wonders who did who the favor. Doesn't matter... there will be plenty time for repayment in the months ahead.Enjoy!",
  "models": [
    {
      "name": "Orlando Fox",
      "person_id": 37350
    },
    {
      "name": "Zane Porter",
      "person_id": 37299
    }
  ],
  "release_date": "2015-11-06",
  "scene_id": 79217,
  "series": "NDO - 4610 - Zane Porter & Orlando Fox",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Climax",
    "Condom",
    "Deep throat",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Roommate Auditions Part 1"
}