{
  "collections": [
    "Next Door Twink"
  ],
  "description": "As Ian sits with his hands folded and eyes closed, Pastor Peterson finishes up Sunday morning service with a prayer.  The Pastor's son, Rod Peterson, sits behind Ian, over his left shoulder.  Ian has the strange feeling that eyes are on him during the final moments of the prayer.  He turns around slightly and notices Rod is staring at him intently.   When the prayer wraps up and the congregation filters out into the foyer, Ian goes into the bathroom to relieve himself.  Rod sees this as an opportunity.  He hurries everyone out into the garden and locks the door to the sanctuary.  When Ian emerges, he and Rod are alone.  Ian asks Rod about the stares during the service.   The night before, Ian thought he was sending someone from an anonymous chat room nudes of himself, along with a message about how much he'd like to have sex with a man.  It turns out, however, the anonymous guy was actually Rod, the Pastor's son!  Rod works his way up to telling Ian that it was him, and Ian is completely shocked.  But Rod has been planning to make Ian feel at ease. He starts by telling Ian that the two of them have the same inclinations.  Rod moves in close and the two kiss passionately.  Soon they're sitting on a pew, making out and undressing each other.  Ian doesn't waste much time before going down and taking Rod's dick into his mouth.  Wow, Rod's hard cock tastes better than he could have  imagined.  Rod can't believe the church goody-two-shoes is slobbing his knob!   Next, Rod gets a taste of Ian's fine dick.  Then he turns him around and licks his sweet hole.  He gets it nice and wet for what's next -- Rod's big, throbbing erection.  Rod slides it in carefully at first, then works up to a good, hard pounding.  After slamming Ian from behind for a while, Rod lays down on the pew and lets Ian take a ride.  Watch Ian and Rod connect on a brand new level for the first time as they discover how much fun church activities can really be!",
  "models": [
    {
      "name": "Ian Levine",
      "person_id": 34468
    },
    {
      "name": "Rod Peterson",
      "person_id": 37677
    }
  ],
  "release_date": "2015-11-04",
  "scene_id": 79267,
  "series": "NDT - 8305 - Rod Peterson & Ian Levine",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Twink"
  ],
  "title": "The Pastor's Son"
}