{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Officer Kaden Alexander is just trying to keep the streets safe, but if every now and again that translates to a few fringe benefits, well... who's gonna blame a cop for using his stick every now and again, right?Such is the case as Officer Alexander happens upon Abel Archer pulled over on the side of the road. As he approaches the vehicle, Kaden sees that Abel is taking a little personal break, indulging in a bit of me time, and is more than a little flustered when Officer Kaden knocks on his window. Abel, knowing he's been caught red handed (literally) scrambles around to get himself out of trouble, offering to take care of the officer in exchange for some lenience.Officer Kaden, usually above a bribe, takes a long look at what Abel is packing and decides this might be an offer worth taking up, so the two of them move to a more private location and Abel immediately begins sucking off the cop. Kaden returns the favor but decides if he's going to forgive Abel's transgression, then Kaden's gonna need to get his dick wet, so he bends Abel over his car and proceeds to pound his delinquent ass in the hot sun. They move to a nearby tire swing and Abel mounts Kaden, bouncing up and down on his hard cock, then sitting down and grinding on it, shooting his hot load all over the ground as Kaden pulls out and blasts him with his pistol, sprayng jizz all over Abel as a reminder to follow the law a little more closely next time.Enjoy!",
  "models": [
    {
      "name": "Abel Archer",
      "person_id": 36223
    },
    {
      "name": "Kaden Alexander",
      "person_id": 37821
    }
  ],
  "release_date": "2015-11-13",
  "scene_id": 79280,
  "series": "NDO - 4612 - Kaden Alexander & Abel Archer",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Black",
    "Climax",
    "Condom",
    "Hairy",
    "Hardcore",
    "Interracial",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Uncut cock",
    "Uniform"
  ],
  "title": "Caught Cum-Handed"
}