{
  "collections": [
    "Active Duty"
  ],
  "description": "Well this is a humungous treat for me. We have a favorite recruit from way back, who's come to reacquaint himself with our fine platoon. Brian is back with us and he's very excited to be matched up with more recent favorite, the smoking hot Quentin.So once the fun started, Brian's dick seemed to get harder and (as if it was possible) bigger. Quentin certainly took his time enjoying the massive erection too. After that, Brian went to his knees to return the nice favor. Wow, Brian must've continued a strict training regimen while in retirement because he still has the magic!  He went to town on Quentin's cock, giving it all the care and love a nice stiffy deserves. I sure am proud of both of these soldiers.The two moved to the bed where Quentin finally sat on Brian's throbbing member and slowly worked up to a good riding pace. My goodness is that thing a hole stretcher!  Claude did a byoot of a job getting nice shots. Eventually, Brian eased his way into an intense pounding, thrusting hard upwards into Quentin.  Next, Quentin laid on his back and Brian inserted his now-pulsating-more-than-ever cock. My goodness, Quentin looks handsome getting fucked on his back. His tattoos, that gorgeous face, maybe the lighting did something too, but that super huge dick working in and out is really not to be missed. When Brian ended this part of the pound session, he pulled out and let Claude get in for a tight shot. We see Quentin's amazingly tight hole, with Brian's fingers rubbing it as he remarks, 'it's so tight, and god, it spreads so wide.'  Then Quentin bends over and we enjoy a solid pounding -- just the kind we'd hoped for when we first feasted our eyes on Brian's incredible slab of meat.",
  "models": [
    {
      "name": "Brian II",
      "person_id": 37754
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2015-10-18",
  "scene_id": 79293,
  "series": "AD34 - Quentin & Brian",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Muscular",
    "Smooth",
    "Tattoos",
    "Twink"
  ],
  "title": "Quentin & Brian"
}