{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "This is an awesome story about a guy named Marlone Star.  Marlone was chillin' at home one afternoon on his birthday.  He had assumed all of his friends had forgotten it was his birthday, because he hadn't received ANY calls and NO happy beeday wishes on Facebook (he didn't have his birthday information entered).  But to his chagrin, he received an anonymous call from someone, only identifying himself as 'an old friend.' The voice told him a gift was on its way.  Before he could even thank the person and hang up the phone, there was a rapping at his door.  Marlone opened it to find a super-hot guy named Brandon Jones on the other side.  Marlone knew Brandon was the gift.  Brandon followed Marlone inside (Marlone backed back in) and then pushed Marlone back down onto his couch.    Brandon sang a few bars of the birthday song as he slowly pulled his jeans down, revealing his plump, fuckable rear end.  Marlone didn't waste time diving right into his present.  First, the guys kissed for a while, as Marlone squeezed those luscious butt cheeks.  Then, Brandon pulled out Marlone raging hard on and sucked on it.  Brandon took the hard cock very deep, way down into his throat.  'What a wonderful birthday gift!' Marlone thought to himself as Brandon gagged on his stiffy.    Next, Marlone spent some time slurping deeply on Brandon's big dick.  Marlone enjoy how it felt in his mouth.  Then, Marlone bent Brandon over the arm of his couch, slid his cock into Brandon's ass, and pounded away.  He knew it was ok to fuck him as hard as he wanted, because it was HIS birthday, and that's how you fuck a deliciously got stranger on your birthday.    After that, the two heated things up even more.  Join this party-for-two as the handsome Marlone makes the most of his special day and his gift from an anonymous 'old friend.'   Enjoy!",
  "models": [
    {
      "name": "Brandon Jones",
      "person_id": 20071
    },
    {
      "name": "Marlone Starr",
      "person_id": 21914
    }
  ],
  "release_date": "2015-10-27",
  "scene_id": 79294,
  "series": "NDE - 210 - Marlone Star & Brandon Jones",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Big Muscles",
    "Black",
    "Brunette",
    "Climax",
    "Deep throat",
    "Hardcore",
    "Interracial",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Uncut cock"
  ],
  "title": "Just Popping In"
}