{
  "collections": [
    "Active Duty"
  ],
  "description": "We've had the wonderful pleasure of a few nice, healthy doses of Bridger lately, and every time just gets better!  Bridger came to us quite a while back and blew us all away with his incredible eyes, strong build, and amazing cock.    This is, in fact, Johnny's first time engaging with another man in sexual contact, and it's not to be missed.  As soon as Claude gave them the go-ahead, Johnny kissed Bridger like a fish-out-of-water that needed the kisses in order to breathe.  He buried his face into Bridger's chest and did all he could to get Bridger's shirt off at the same time.  Soon, Bridger's dick was out and Johnny wrapped his lips around the his very first cock.   After a little while, Bridger gets on top of Johnny and takes his dick in his mouth for a nice 69 session.  Wow!  A first-time hookup and Johnny Is learning quickly!  He continues to have a little trouble taking Bridger's swollen meat deep into his throat, but bless his earnest heart...he's sure as hell trying.   They reposition and take turns servicing each other.  After trying to do like he's seen the seasoned vets do in the videos for a while, and sharing a few laughs with Bridger in the process, Johnny finally decides to go for it.  He climbs on top of Bridger's massive, firm dick and works it into his tight, virgin hole.   Surprisingly, he doesn't have too much trouble getting himself started.  And once he does, Bridger decides to really show him what it's like to get fucked.  He works up to a good, steady upward-thrusting pace and jerks Johnny's cock at the same time.  It's not too long before Johnny needs a little break, but MY GOSH, does Johnny do a fantastic job handling that intense pounding! Bridger sucks Johnny some more, just before Claude gets a very nice, very close shot of that freshly devierginized hole.  But then Bridger goes in for more.  Hang out with these studs for a while and share this once-in-a-lifetime memory that neither Johnny, nor Bridger will ever forget.",
  "models": [
    {
      "name": "Bridger",
      "person_id": 37598
    },
    {
      "name": "Johnny Riley",
      "person_id": 37613
    }
  ],
  "release_date": "2015-10-25",
  "scene_id": 79369,
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Duo",
    "First Time",
    "Jerk Off",
    "Kissing",
    "Muscular",
    "Shower",
    "Smooth",
    "Tattoos",
    "White Butt"
  ],
  "title": "Johnny & Bridger"
}