{
  "collections": [
    "Next Door Twink"
  ],
  "description": "It's not easy being in school, dealing with class, parents, teachers, and a daily flood of hormones.  It's especially tough if when your classmate is Arad.  For Cody Blake, the struggle is way too real.  Cody's had a monster crush on the brain-meltingly hot new fellow student since the first moment he laid eyes on him.  He knows Arad is from somewhere very exotic and far away, but he's not exactly sure where.  He's noticed Arad hasn't made too many friends so far this year.  Cody knows how Arad feels.  Being gay, Cody's never felt totally comfortable at his school, particularly around most of the muscle-bound jocks that are always acting macho and making inappropriate remarks.  Cody has been dreaming of Arad constantly, and imagining the two of them together, making passionate love.  Although Arad is the star of his daydreams, Cody's just too shy to introduce himself.He does, however, sometimes follow Arad around the school athletic complex as he works out.  Cody records video of Arad as he jogs, stretches, and runs speed building drills.  The sight of Arad's shirtless body, working hard outside makes Cody's dick stiffen harder than any other time.  Today, Cody's been keeping his distance as usual as he follows Arad around yet again.  While recording Arad with his phone, from behind a big, old oak tree, one of the assholes from the football team, Markie More, catches him.  Markie yells to Arad, 'Hey, this kid is filming you!'Cody panics, drops his backpack, and runs off, completely embarrassed and distraught.  After Arad tells Markie off, he finds Cody to return the backpack.  Cody can't believe Arad was kind enough to return his things, but is still so upset, he can't even look at Arad.  Arad can see exactly what's been going on.  He lovingly lifts Cody's chin and pulls his face close.  Cody's mind rushes as they kiss.  The kissing becomes more passionate and, without thinking much at all, Cody goes to his knees from the bench they were sitting on, and pulls down Arad's pants.  His cock is already hard.  Cody takes it into his mouth, just as he's imagined so many times, and feels it throbbing between his lips.  He sucks Arad's hard cock for a while before Arad stands him up and returns the favor.  'Wow!' Cody thinks. 'He must have done this many times before!'The next thing Cody knows, Arad is pounding his sweet, tight hole.  Be a part of this once-in-a-lifetime, fairytale experience, as Cody's wildest, schoolboy fantasies cum true.  Watch the incredibly sexy Arad fuck Cody's tight, eager Twink ass until both boys erupt in ecstasy.",
  "models": [
    {
      "name": "Arad",
      "person_id": 34440
    },
    {
      "name": "Cody Blake",
      "person_id": 37895
    }
  ],
  "release_date": "2015-11-18",
  "scene_id": 79519,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Blowjob",
    "Climax",
    "Condom",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Muscular",
    "Oral",
    "Twink"
  ],
  "title": "Schoolboy's Crush "
}