{
  "collections": [
    "Active Duty"
  ],
  "description": "When I saw these two on the couch, right at the get-go, it struck me: 'Why in the heck has it taken so long for this pairing?!'  Boy, these are two of my favorites and it fills me with joy to show all you troops this delightfully hot encounter.  Quentin Gainz (just 'Quentin' 'til now) is really becoming one of the best recruits we've ever seen.  And Brad Banks (just 'Brad' before)...well check out that incredible body!  Claude doesn't him 'n' haw too much before letting these soldiers march into action.  They do take a pinch of time at first to fatten up their lovely dongs before Quentin goes in for a tasting of Brad's.  My goodness, Brad gets his large dick crankin' and pulsatin'!  Quentin, I think you'll be able to tell, is just in heaven with such a nice, swollen cock to occupy his cute mouth.  They go from laying on the bed to Brad on his feet and Quentin on his knees.  Claude does a great job of showing us what Brad is seeing.  Quentin's gorgeous eyes look up at us and Brad as he takes that hard piece of erect meat all the way down his throat. Then, we have Quentin on top of Brad, working that fat stiffie into his ass.  Once he gets comfortable, he gets into an excellent groove quickly (another testament to Quentin's continuing skill-improvement).  Claude captures a really great shot of Brad on his back during this position, which I found sexy, especially combined with the dirty talk Quentin is throwing out during the moment, which include comment on Brad's 'big soft lips.' Then Quentin goes to his back for a proper drilling.  Claude goes in for a tight shot of Quentin's face at one point, and Quentin says right to us, 'He's fucking me good,' while wearing that irresistible smile.  Finally, the guys settle down next to each other on the bed to crank their shafts and pop out some hot cum, side-by-side, the way two solid recruits should.",
  "models": [
    {
      "name": "Brad Banks",
      "person_id": 37394
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2015-11-01",
  "scene_id": 79559,
  "series": "AD - 38 - Quentin Gainz & Brad Banks",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tan",
    "Tattoos"
  ],
  "title": "Quentin Gainz & Brad Banks"
}