{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Ushering in the start of the new season, teammates Jake Karhoff and Hunter Stone have decided to engage in a friendly little competition. QB Jake has wagered that he looks better in his uniform than tight end Hunter, who takes issue with this challenge, since he's been hitting the weight room all off-season. Hunter is convinced his hard work and hard body will win him the bet, but once he sees Jake in his tight pants, he's less concerned with winning the battle and more concerned with a different reward- seeing what's underneath Jake's uniform. Jake is likewise confident his hard work will put him over the top, but when he sees his receiver dressed in full fatigues he also abandons the spirit of competition in lieu of something a little more collaborative, as he and Hunter embrace and slowly strip out of their gear. Jake drops to his knees, unlacing Hunter's pants and grabbing his package, then licking it up and down before full on deep throating it. Hunter returns the favor, going down on the quaterback before bending over and letting Jake have his way with him. Jake pounds Hunter against a bench, surrounded by fall foliage and the setting sun, and Hunter closes his eyes and takes every pleasurable inch of Jake's offering, stroking himself off as Jake pounds away. Jake sprays his load all over Hunter and then pulls out and sucks him off, swallowing every last drop as Hunter convulses from the sensation. As both guys wipe the sweat from their brow and watch the sun's final light descend the horizon, they concede that everyone here is a winner.",
  "models": [
    {
      "name": "Jake Karhoff",
      "person_id": 37028
    },
    {
      "name": "Hunter Stone",
      "person_id": 37903
    }
  ],
  "release_date": "2015-11-20",
  "scene_id": 79667,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Condom",
    "Cum swallow",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Slim",
    "Tattoo/Piercing"
  ],
  "title": "Battle Buddies"
}