{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Sitting at the kitchen table and swilling on beers on a rainy afternoon, Mark Long is prodding his friend Zane Porter about Zane's employment status. Fielding question after question has Zane on the defensive, and he wonders aloud what angle Mark is working. Mark finally just comes out and confronts Zane, asking him if he's gay. Zane protests, but Mark reveals that he has seen the porn that Zane has shot, and asks again if Zane is gay. Zane flips the script on Mark, asking him if he's  gay, which Mark affirms. Armed with this new knowledge, Zane sits speechless, unsure what the next move is. Luckily Mark makes it for him, grabbing him by the back of his head and pulling him in closer for a kiss. They embrace at the table and then quickly Zane falls to his knees as Mark pulls out his massive 8' dick. Zane sucks on the head, and can barely fit the whole thing in his mouth, deep throating Mark as he lay on the kitchen table. Zane flips him over and begins to eat his ass, as Mark closes his eyes and enjoys the moment.  Zane takes care of Mark but what he really wants is some of that big hard dick, so he bends over as Mark plunges it deep inside of him. Mark pounds away as Zane feels every inch, stroking his cock as he lay on his back looking up at Mark fucking away. They move to a chair, where Zane reverse rides Mark, stroking his cock as Mark continues the tour of Pound Town, and he launches his load all over the floor as Mark keeps going.  Mark pulls out and blasts Zane with a hot load just as Mark's parents are pulling up. The guys hurry to Mark's room with their jizz stained bodies and their new shared secret. Enjoy!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Zane Porter",
      "person_id": 37299
    }
  ],
  "release_date": "2015-11-26",
  "scene_id": 79677,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Blonde",
    "Brunette",
    "Condom",
    "Facial Hair",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "My Friend Does Gay Porn"
}