{
  "collections": [
    "Icon Male"
  ],
  "description": "Adam Russo impatiently awaits his potential buyer. Frustrated, he's late for a dinner with boyfriend who's waiting for him. Wolf Hudson eventually shows up. Late and looking like a convict, Adam looks down his nose at him and insinuates he could never possibly afford the property. Regardless, he agrees to show the place. It's not long before they find themselves in the master bedroom, where Wolf confronts Adam about his dismissive attitude. Discounting him for not being flashy will cost him big, and Adam realizes his mistake and feebly tries to apologize to Wolf, bringing focus back to the house for sale. But feeble attempts at apology will get him nowhere, and he shows the older Daddy who's really in charge. Shoving the older man onto the bed he climbs on top of him, taking control. Pulling off the older man's expensive clothes he pushes him to his knees, cramming his huge dick down the real estate broker's throat. Wolf tears the pants off him and shoves him against the bed. He wants a taste of his ass before he moves forward and deep licks his hairy asshole. Punishingly, Wolf makes sure the older gentleman likes it before holding back what the broker really wants. Ready to take his long thick member, Wolf pushes it into the Daddy's ass, breathing heavily. Wolf licks his ear as Adam moans, as his stiff cock pushes into the bed. Pounded by the thuggish young buck Adam's eyes roll back in pure pleasure, but Wolf pulls out of the older man, cumming onto Adam's hairy stomach. As one of his hands pulls on his shaft, and the other on his balls, he takes no time at all to finish all over himself, covered in pools of cum.",
  "models": [
    {
      "name": "Adam Russo",
      "person_id": 35627
    },
    {
      "name": "Wolf Hudson",
      "person_id": 36284
    }
  ],
  "release_date": "2015-11-03",
  "scene_id": 79687,
  "series": "Daddy's Big Boy 2",
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "Hairy Guys",
    "Jerking Off",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex",
    "White Collar/Suits"
  ],
  "title": "Daddy's Big Boy 2, Scene #01"
}