{
  "collections": [
    "Icon Male"
  ],
  "description": "Nick Capra has hired Hunter Page to help him out with some projects around the house. Hurting himself in the garage while Nick was inside, Nick's nurturing instincts are sparked. Urging Hunter to lay down to ice his hand, Nick checks on the injured youth following a hot shower, finding him asleep. Standing in a towel, dripping wet, Nick looks him up and down, admiring the boy's tight stomach. Awakening, Hunter groggily comments on the dreamy view providing distraction from the throbbing pain in his hand.  Nick moves his hand massaging the inside of Hunter's thigh before rubbing over his houseboy's lithe frame. Hunter teases the older man as their lips move closer, touching softly as they make out. Climbing on top of Daddy, the boy's boxers bunch above the tops of his pants. Nick reaches up and grabs both his cheeks with full palms, as his worker gasps in pleasure. Hunter pushes his pelvis into Nicks's stomach, pressing on Daddy's erect cock before sliding down Nick Capra's hairy chest to service the massively thick waiting dick, his tender lips wrapping around it, Nick pulling his head onto his girthy cock. Tearing off Hunter's pants, Nick licks his balls before sucking the boy's long dick, flipping him onto his back. Their lips hardly leaving each other's, as Hunter feels Nick's muscular thighs, encouraging him to push into his furry hole. As he thrusts into him Nick reaches around to stroke his helper's stiff dick.Pulling out of him, Nick cums all over his stomach as his young helper strokes his hairy chest and nipples. After watching Nick cum, Hunter brings himself over the edge, cumming all over his furry toned stomach,  as Nick encourages him before kissing.",
  "models": [
    {
      "name": "Nick Capra",
      "person_id": 35574
    },
    {
      "name": "Hunter Page",
      "person_id": 37900
    }
  ],
  "release_date": "2015-11-10",
  "scene_id": 79688,
  "series": "Daddy's Big Boy 2",
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "Hairy Guys",
    "Jerking Off",
    "Muscular Guys",
    "Oral/ Blowjob",
    "Twinks"
  ],
  "title": "Daddy's Big Boy 2, Scene #02"
}