{
  "collections": [
    "Icon Male"
  ],
  "description": "Muscle Daddy Myles Landon and smooth muscle twink Ian Levine are nothing if not an unconventional pairing. Myles and Ian cuddle playfully, their taut muscular bodies pressing up against one another. Myles can't get enough of his smooth young trophy boy, his hands slick with massage oil, rubbing every inch of his body. Hands sliding down his toned back, his smooth bubble butt framed by his jockstrap are revealed. Myles strokes his thighs, servicing his boy, his tongue  moving along Ian's chest and up to his ears. Kissing him passionately, Ian passively relishes the affection before Landon moved down to focus on his boy's tool and hole. Ian climbs on Myles, his cheeks spread, we see his smooth hole. Ian sucks on Myles' big uncut dick. Myles kisses Ian before, licks his ass, and sucks his dick while Ian is face down. His nose plunges into the young man's hole. Myles rubs his stiff cock on Ian's smooth hole, opening him up, he works him in and out. Ian moans in pleasure as the thick rod plunges into his submissive hole. Myles pulls his boyfriend close, kissing him as he pounds his ass harder and harder. Fucking in many positions before lifting Ian's ass to help position his hole, Myles fucks the cum right out of his his younger boyfriend, his hot thick load spewing onto his smooth stomach. Scooping the cum off his young friend before letting him tease himself off his tongue. Myles only increases in intensity, bringing himself closer to climax as he rails his boyfriend to bring himself to the edge.Holding his arms, he pounds his hole as Ian thrusts back into his throbbing dick, moving his bubble ass into his daddy. As Myles gets closer, he blows his load all over Ian's back. Ian relieved and happy that he made his boyfriend cum.",
  "models": [
    {
      "name": "Ian Levine",
      "person_id": 35736
    },
    {
      "name": "Myles Landon",
      "person_id": 37894
    }
  ],
  "release_date": "2015-11-19",
  "scene_id": 79699,
  "tags": [
    "Anal",
    "Bareback",
    "Big Cock",
    "College",
    "Cumshot/cum",
    "DILF",
    "Mature",
    "Muscular Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming"
  ],
  "title": "Real Couples Bareback, Scene #04"
}