{
  "collections": [
    "Icon Male"
  ],
  "description": "Witness a true intimate encounter between porn power couple Billy and Seth Santoro. With absolutely no holding back, hot real-life passionate bareback sex follows an interview that fans won't want to miss. From the physicality of first impressions to the nurturing nature of unconditional love.Pulling his shirt over his head, Seth reveals his pert nipples on a smooth muscular chest. Pulling his husband close to him, Billy kisses his husband from top to bottom, kissing his smooth stomach, his hand caressing his abs up and down. Billy carefully pulls off Seth's pants, exposing toned thighs lightly dusted with hair. Sliding off his partner's briefs, his thick lips savor Seth's stiff rod from base to tip before taking his whole cut cock into his mouth. Seth grabs his husband's ass, before he takes Billy's shaft in hand, working his lips up and down over Billy's domed cockhead. Billy giving his husband earnest glances before kissing intently, Billy pulls Seth's thighs closer to him, urging him into a humping motion. Seth penetrates his hairy hole, pushing into him as Billy thrusts back onto his stiff rod. Billy climbs on top, riding his husband bareback, his hips rocking back and forth as his ass strokes the raw cock inside him. Propping billy up with a pillow, Seth fucks his muscular bottom with an increasing tempo. Pulling Seth into him encouragingly, the intensity builds to a crescendo, passionately making out before Seth pulls out and shoots all over Billy's abs. Seth light rubs Billy's chest and abs, Billy trembling with intensity as he cums his thick load onto his own stomach.",
  "models": [
    {
      "name": "Seth Santoro",
      "person_id": 35572
    },
    {
      "name": "Billy Santoro",
      "person_id": 35626
    }
  ],
  "release_date": "2015-10-29",
  "scene_id": 79696,
  "tags": [
    "Anal",
    "Bareback",
    "Big Cock",
    "Cumshot/cum",
    "Hairy Guys",
    "Latino",
    "Mature",
    "Muscular Guys",
    "Oral/ Blowjob"
  ],
  "title": "Real Couples Bareback, Scene #01"
}