{
  "collections": [
    "Icon Male"
  ],
  "description": "Tayveon Martin and and Kory Houston are sitting in bed with Brad Kalvo, who is forced to come clean to his boys about the fun he's been having with each other on the side. Although Kory puts up a fight when Brad suggests that they try something between all three of them, his mind is changed when Brad showing passionately kisses him. Neglecting Tayveon is not an option and Brad kisses him with equal intensity. But Kory doesn't like to be replaced so pulling down Brad's shorts, he sucks on the furry Daddy's hard dick, before being pushed aside by Tayveon, demanding his own turn at sucking it.  <br><br> Tayveon works his Daddy's dick, sucking it hard as strings of precum flow from the tip. As Brad is being sucked by the other boy, Kory presents his smooth boy ass to his Daddy. Brad fingers his tight hole, and Tayveon notices this competition is going on, also presenting his bubble ass to his Daddy. Brad pushes his middle finger into their waiting asses. Backing his ass onto the stroking finger, Brad rims Tayveon's ass, as Kory takes another turn servicing his thick cock. Getting it wet, Kory isn't sure he can take Daddy's dick, but Brad pushes it into him slowly, Kory taking it up his ass. <br><br>His other boy vying for his attention he rubs his furry chest, and Brad makes out with him. Motioning to move onto the bed, and Tayveon kneels down, and moves his black bubble ass onto Brad's thick meaty dick. Grabbing his slender hips and pulling him into him, the boy bounces his sweet ass on his daddy's dick.<br><br>Kory, feeling left out, comes around and cock slaps Tayveon's forehead, who takes his long white dick in his mouth eagerly. Brad flips Tayveon onto his back, and fucks the cum right out of his thick cut black dick. Watching the tick cum pulse out of him, Brad pulls out and unloads his thick creamy seed onto the younger man's taught ebony stomach. Kory and Tayveon take turns making out with brad as the scene cuts out.",
  "models": [
    {
      "name": "Brad Kalvo",
      "person_id": 35628
    },
    {
      "name": "Kory Houston",
      "person_id": 37898
    },
    {
      "name": "Tayveon Martin",
      "person_id": 37899
    }
  ],
  "release_date": "2015-11-24",
  "scene_id": 79690,
  "series": "Daddy's Big Boy 2",
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "DILF",
    "Hairy Guys",
    "Interracial",
    "Jerking Off",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex",
    "Threesome",
    "Twinks"
  ],
  "title": "Daddy's Big Boy 2"
}