{
  "collections": [
    "Icon Male"
  ],
  "description": "Ian Levine is hanging out in his room when he sees Rodney Steel walk by, and calls him in to show him his girlie magazine. This sexually charged moment is cut short by Ian's mother scolding him again. Rodney wants to be with Beau, but the mother is a recurring problem. Rodney comes back to the bedroom after a short drive. Ian hops up into bed, and happily alone he starts flipping through the magazine. Visibly excited, Ian's shorts are tenting. Rodney encourages him to get comfortable, telling him it's OK if he plays with himself. Rodney licks his lips rubs his crotch, sliding closer to the boy, pressing his face on the boy's and reaches over to help the boy stroke his stiff dick.Rodney slowly comes closer to the boy, and his lips find their way closer to Ian's. With increasing passion, they start slowly. Rodney strips of his starched white shirt, and Ian reaches beneath his undershirt to feel the older man's muscular body. Rodney pulls off his white briefs, humping Ian, dick to dick.Caressing the boy's face, Rodney runs his tongue over his smooth body. Taking the boy's dick into his mouth, he slides it in and out before tonguing his hairless balls as Ian plays with himself. The older man slowly penetrates the boy's tight young ass, thrusting into him with his thick cock with long sure strokes. Pulling up on the boy's toned legs he gently thrusts into him, pressing on his lover's prostate, urging the thick white cum to erupt from Ian's cock. Rodney takes his turn, pulling out of his lithe young lover, he kisses him passionately as he cums onto the boy's smooth abs.",
  "models": [
    {
      "name": "Ian Levine",
      "person_id": 35736
    },
    {
      "name": "Rodney Steele",
      "person_id": 37971
    }
  ],
  "release_date": "2015-12-15",
  "scene_id": 79704,
  "series": "Baby Boy",
  "tags": [
    "Anal",
    "Cumshot/cum",
    "HD",
    "Jerking Off",
    "Masturbation",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Baby Boy, Scene #03"
}