{
  "collections": [
    "Active Duty"
  ],
  "description": "We're lucky enough to have one of our finest, newest recruits back.  Johnny joined the Active Duty platoon, just planning initially on doing an on-camera jerk off, but decided to stay due to his piqued curiosity.  And boy are we glad he did!  We saw from that solo session how amazing his body is and we had a nice taste of his spunky, fun energy.  He's meeting up with Ivan James this time, and I think it's a match up that's already overdue.  <br></br> 'You sexy motherfucker!' Johnny says with a big ol' grin as Ivan takes his massive, swollen cock down his throat.  Ivan goes from slurping Johnny's gargantuan cock to getting on top and carefully squeezing it into his super-tight, very pink hole.  My goodness, Claude did such a bang-up job shooting this.  He gets such nice 'n' close shots of Ivan struggling to take Johnny's large girth.  We hear Johnny say that this is his very first time with someone riding him in this position.  <br></br>They shift gears and Ivan gets in a doggystyle position on the bed.  Johnny has just a tad bit of experience with this, so he wisely used this as an opportunity to hone his topping skill from behind.  Claude gets nice and low here so we see Johnny's big, stiff cock ramming Ivan very hard and fast.  Johnny really has some wonderfully powerful legs, and he knows how to use 'em!<br></br>The guys take a break from the intense pounding in order to regroup.  Johnny uses the time to get a taste of Ivan's erection.  <br></br>After that, they fuck doggystyle a tad more before Ivan goes to his back.  This position looks like a real blast for both of them.  You can see how much Johnny enjoys tugging his partner's dick as he fucks.  <br></br>And it's not over yet!  Ivan needs a few more mouthfuls of that luscious boner.  He goes to his knees and Claude gets a POV shot...fantastic!  He directs Ivan to look up into the camera every once in a while and we see those big, sweet eyes.  <br></br>The two finish things off side-by-side, jerking their hard cocks fervently.  It's an amazing finish to an incredibly hot encounter.  Saddle up and join these fine recruits.  You'll certainly be glad you did.   ",
  "models": [
    {
      "name": "Ivan James",
      "person_id": 37630
    },
    {
      "name": "Johnny Riley",
      "person_id": 37613
    }
  ],
  "release_date": "2015-11-08",
  "scene_id": 79701,
  "series": "AD - 40 - Ivan James & Johnny",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Gay",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Ivan James & Johnny"
}