{
  "collections": [
    "Icon Male"
  ],
  "description": "Awoken from his slumber by sounds of sex in the next room, Rodney quietly steps to the other end of the house and finds his lustful prize in bed with two others. Face down on the mattress, Ian Levine's expression is unsure but excited as his hole is eagerly eaten out by JD Phoenix. Daddy-bear Brad Kalvo leans over to lick JD's hole and forms a line of ass eating. Surrounded by hot dicks, JD moves away from Ian and sucks on muscle daddy Brad's. Who, built like an ox, sucks on Ian's stiff cock. Going from daddy dick to young man dick, JD can hardly decide which he wants more, both so stiff and tasty. He sucks them off one after another, and moves to kiss Ian. Daddy watches, helping out JD by wetting down his young hole. Getting it nice and wet, Brad takes him from behind. His long daddy dick slides in between JD's hairless cheeks, and JD begs for more, a deeper pounding from his Sir, who tells him to lick Ian's ass. He does as he is told and keeps tongue-fucking Ian's smooth hole. JD's pleasureful moans come out muffled from between Ian's cheeks as Brad pounds his hole. As JD is sucking on Ian's dick, he explodes onto his stomach his body shaking from the intenity of the orgasm, amidst yelps, yiffs and growls. JD kisses his Master, and positions himself to take Brad's load. Moving over JD's mouth, Brad cums his thick sperm on to JD's chin as he licks his hairy balls. Watching two beautiful men cum puts Ian over the edge and he cums just a few moments later onto JD's stomach.The next day, Ian goes to visit Rodney and asks him for a ride to the store. Rodney heard what happened the night before, and he's not happy about it. He's ready to take what he wants.",
  "models": [
    {
      "name": "Brad Kalvo",
      "person_id": 35628
    },
    {
      "name": "Ian Levine",
      "person_id": 35736
    },
    {
      "name": "JD Phoenix",
      "person_id": 36928
    }
  ],
  "release_date": "2015-12-22",
  "scene_id": 79705,
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Masturbation",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex",
    "Threesome"
  ],
  "title": "Baby Boy, Scene #04"
}