{
  "collections": [
    "Icon Male"
  ],
  "description": "New step-brothers Ethan Slade and Wolf Hudson meet for the first time, and have the house by themselves. Ethan's first time away from the dorms in four months, he can't wait to get outside and get back to nature. After coming in from their adventure, Wolf walks in on Ethan, dripping wet and freshly washed and dressed in nothing but a towel. Wolf is grateful for his new brother showing him around, he was bored out of his mind before the beautiful boy showed up. Kissing passionately, Wolf pulls Ethan close, who pulls at the bearded stud's white shirt longingly, and lets the towel around his slender waist fall to the floor. Wolf's sweet tooth craves a taste of hot prep school boy, and pushes him down onto the bed, his hand touching his smooth body, stroking the boy's stiff dick. Ethan takes his turn, climbing on top of Wolf, kissing his toned stomach as Wolf removes his pants. Ethan takes Wolf's hefty cock into his mouth, sucking it down to the base. Ethan lays down on the bed as Wolf tongues his ass, his bubble cheeks ready for fun. Wolf sucks Ethan's dick from behind, before flipping him over to continue blowing his long dick.Making out, they grind their dicks together before Wolf positions himself over the young man's body, and pumps his huge dick into his tight waiting ass. Wolf builds in intensity, taking him from on top and driving his tool deep into the shoolboy. Ethan climbs on top of Wolf, and stroking his long shaft, he guides it into his ass. His smooth cheeks bounce on the dick as his own rubs on Wolf's stomach. Pulling Ethan into him as he thrusts deep, Wolf fucks the cum right out of him. Ethan wants it even more, as he keeps going, wolf flips him over and starts fucking him intensely. As the boy's cum slides down his own abs, he explodes, shooting puddles of cum onto the boy's stomach.",
  "models": [
    {
      "name": "Wolf Hudson",
      "person_id": 36284
    },
    {
      "name": "Ethan Slade",
      "person_id": 37966
    }
  ],
  "release_date": "2015-11-26",
  "scene_id": 79757,
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "College",
    "Cumshot/cum",
    "Fratboys",
    "HD",
    "Oral/ Blowjob",
    "Reality",
    "Rimming"
  ],
  "title": "Schoolboy Fantasies 3, Scene #01"
}