{
  "collections": [
    "Icon Male"
  ],
  "description": "Sam Truitt comes by the shop, but mechanic Tony Salerno is surprised to see him still dressed in his college uniform. Tony tells him to go change, but sadly Sam didn't come by to work. Unexpectedly, he tells Tony that he won't be able to work at the garage anymore. His dad made it clear his focus should only be on school. Over pizza and drinks they reminisce about the good times. Tony has grown close to Sam, like the son he never had. Tony nervously reaches over and touches Sam's knee, gripping it with his hand. Leaning over for a kiss, Sam nervously kisses him back. Realizing it's what they both want, they share an intimate moment. Rolling around on the shop floor, Tony removes the boy's tie and Sam reaches up to feel the older man's abs, tight and toned from physical work. Reaching for his pants button Sam feels lower, pawing at the older man's stiff tent. Tony pulls him on top, but not before pulling the thick college sweater over his head and stripping him of his school clothes. Making out, they explore ach other's bodies. Tony pulls down Sam's white briefs, sucking on the boy's long stiff cock. Sam feeds it to Tony, who relishes his balls, wanking himself. Moving into a 69 position, Tony rims sam's ass, taking in the boy's aroma. Sam sucks on the older man's stiff cock.Sam fucks Tony on the shop floor, pushing his long dick into his mentor, pounding him steadily. Tony gets close to the edge, and cums onto the shop blanket beneath him. Sam pulls out and cums onto Tony's back just moments later.",
  "models": [
    {
      "name": "Sam Truitt",
      "person_id": 36117
    },
    {
      "name": "Tony Salerno",
      "person_id": 37744
    }
  ],
  "release_date": "2015-12-03",
  "scene_id": 79758,
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "College",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Oral/ Blowjob",
    "Reality",
    "Rimming",
    "Twinks"
  ],
  "title": "Schoolboy Fantasies 3, Scene #02"
}