{
  "collections": [
    "Icon Male"
  ],
  "description": "Brandon Wilde is sitting down for an afternoon study session when a surprise knock at the door interrupts him. It's Wolf Hudson, who's come by to check on the sound system at Brandon's mother's request. Brandon is suspicious. His mother never told him her stereo was having issues, but Wolf convinces him to let him inside to take a look. <br><br>Brandon's suspicions are confirmed a few moments later by text. He asks him to leave, but the conversation turns creepily sinister as Wolf reveals that he's been stalking him for a long time, watching him and thinking about kissing him.  <br><br>Reaching up, Wolf caresses the boy's face but as Brandon fights, Wolf pushes his down onto the couch. His hands feel the schoolboy's toned body through his uniform, and Brandon increasingly relents. Letting him get seduced buy his stalker, getting flipped over on top and stripping him slowly of his clothes. <br><br>Brandon grinds his ass on the front of Wolf's pants, before unzipping them to discover the huge throbbing uncut cock within. He teases the dick, sucking on Wolf's foreskin. Wolf lays down next to the boy, stealing his kisses before leading his warm mouth back to his cock. <br><br>Wolf pushes Brandon down, licking his boy hole and playing with Brandon's stiff cock from behind. In heaven, Brandon pulls Wolf's face deeper into him, fucking Wolf's face with his ass. Brandon sucks on Wolf's dick, his hand working the pole like a stripper on Saturday night. Pulling Brandon on top of him, Brandon bounces op and down on his thick dick. <br><br>Leaning Brandon over the couch, Wolf drives his throbbing cock into the college boy's ass, who thrusts back into him, eagerly. Licking his lips in pleasure as wolf caresses his smooth body. Brandon is once more flipped onto his back and as Wolf fucks him, he cums all over his stomach. It's not long after Brandon cums that Wolf pulls him close and puts himself over the edge, blowing his load onto Brandon's stomach as they make out.",
  "models": [
    {
      "name": "Brandon Wilde",
      "person_id": 35638
    },
    {
      "name": "Wolf Hudson",
      "person_id": 36284
    }
  ],
  "release_date": "2015-12-10",
  "scene_id": 79759,
  "series": "Schoolboy Fantasies 3",
  "tags": [
    "Anal",
    "Ass Play",
    "Big Cock",
    "College",
    "Cumshot/cum",
    "HD",
    "Oral/ Blowjob",
    "Reality",
    "Rimming"
  ],
  "title": "Schoolboy Fantasies 3"
}