{
  "collections": [
    "Active Duty"
  ],
  "description": "Here's an outstandingly handsome recruit who's joining us for the very first time.  Boy, this Brad Davis is the quintessence of the strong, lean soldier's body.  I'm excited to see all that he brings to the table for us.  I can tell he's gonna have a whole bunch to offer.  And what a great job he does here for his first time on camera!Brad starts fattening his cock up under his shorts right away.  He looks straight into the camera with his big, gorgeous brown eyes.  This is around the point when I realized what potential Brad has for commanding attention merely with his presence.  He definitely has what it takes.  Eventually, Brad stands up from the bed and steps out of the camo shorts.  He sits back down and continues squeezing his cock underneath his boxer briefs.  After getting just a bit more comfortable, he takes his shirt off and shows us more tattoos and his unbelievably hot physique.  Brad is built just the way we like our go-to soldiers.  It's easy to see he packs plenty of strength. Finally, that cock comes out and Claude gets in nice and tight while Brad strokes himself on the bed.  We see that big, stiff dick getting jacked, and Brad's handsome face behind it, sometimes peeking around and looking at us.  I like Brad's hand tattoos, especially from this angle. Then Brad stands up and Claude gets an angle from Brad's perspective.  Brad's cock is so nice.  It's thick, and just like him, looks like it could do some damage!  I like the way it looks in his hands, too.  He has rough-looking hands that also have an aesthetically pleasing quality.  I'd wager another cock would look great in his hands as well! Claude is really bringing in so many awesome recruits lately!  Guys like Brad are such treats for our platoon and are exactly how we've kept troop morale sky-high.  Sit back and join him for this excellent debut, as Brad joins the squadron of the finest men engaged in Active Duty!",
  "models": [
    {
      "name": "Brad Davis",
      "person_id": 37920
    }
  ],
  "release_date": "2015-11-11",
  "scene_id": 79790,
  "series": "AD - 39 - Brad Davis",
  "tags": [
    "Big Dick",
    "Brunette",
    "First Time",
    "Jerk Off",
    "Solo",
    "Tattoos",
    "War Chest"
  ],
  "title": "Brad Davis"
}