{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As a naked housekeeper, Luke Milan has to think on his feet, since he never can be sure just what he's gotten himself into. Quentin Gainz seems like a quiet client, but since it was Quentin's wife who hired Luke, Quentin has no idea that Luke's services are a bit more stripped down than the average housekeeper. This comes to a head in the living room, when Luke enters to tidy up and Quentin is visibly disturbed at Luke's semi-hard penis just dangling in the breeze. Luke explains to Quentin that all of this is detailed in his ad, and Quentin assures Luke that his wife probably did not read the ad too thouroughly.   What remains is a bit of a stand-off, albeit with one of the guys standing there naked as a jaybird. After some prodding, Luke discovers that Quentin and his wife are experiencing a bit of a lull in the bedroom, and so Luke suggests that perhaps Quentin could make better usage of Luke's time. Quentin seems confused and so Luke puts his hand on Quentin's thigh to help him understand.  Quentin gets the message but is reluctant, so Luke tells him to close his eyes and just enjoy it, as he unzips Quentin's jeans and begins to slowly suck on the tip of his cock. Quentin throws his head back as Luke works his balls into his mouth, sucking on one and then moving to the other, tonguing up the shaft as Quentin grows hard as a rock. Luke rocks Quentin's legs all the way up in the air and plunges his tongues deep into Quentin's virgin hole. Quentin moans at the strange pleasure as Luke strokes his cock hard.  With Quentin's curiosity piqued, Luke suggests Quentin go for a ride, and so Quentin mounts the housekeeper as Luke pumps up and down. Quentin bounces on Luke's massive cock until he's nice and broken in, and then Luke flips him over, pounding him from behind as Quentin clutches the sofa pillows.  Quentin is hard as he's ever been as Luke fucks him missionary, pulling out as Quentin is ready to bust and then watching as his client sprays his load all over himself.  Exhausted and cum covered, Luke has yet another satisfied customer, but now he also has a new mess to clean up. Enjoy!",
  "models": [
    {
      "name": "Luke Milan",
      "person_id": 27174
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2015-12-03",
  "scene_id": 79791,
  "series": "NDB - 4617 - Luke Milan & Quentin Gainz",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Naked Housekeeper"
}