{
  "collections": [
    "Next Door Casting"
  ],
  "description": "Coming to us from the Jersey Shore by way of Florida, Dimitri Kane's a hairy-chested stud who's ready give the Next Door Casting couch his best shot! Markie is visibly into Dimitri's tanned body, running his fingers over Dimitri's nipples before kissing down his chest and unzipping his pants. Markie sucks him off immediately and Dimitri starts to sweat, pushing Markie's head further down onto his cock. Dimitri returns the favor, deep throating Markie on the sofa until he's good and hard. With Markie fully erect, the guys spoon as Markie enter from behind, pumping Dimitri hot and hard before throwing him on the floor and taking him to PoundTown, population: Dimitri Kane. Thoroughly fucked sideways, it's Dimitri's turn to show what he's got, and so he lays Markie out on the floor and gives him some of the east coast cock, filling Markie up as he strokes himself to climax on the floor, jizzing all over himself has Dimitri pulls out and blasts the host with a continental load that's sure to please. Enjoy! Disclaimer: It is with the utmost respect that we have decided to release this previously unseen footage. At only 20 years old, the late Dimitri Kane had already garnered a strong fan following for his passionate performances and we believe he would have wanted his work to eventually be made available to his fans. Dimitri, you left too soon, may you rest in peace.",
  "models": [
    {
      "name": "Dimitri Kane",
      "person_id": 37921
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-08-09",
  "scene_id": 79792,
  "series": "NDC - 133 - Dimitri Kane (Markie More)",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Pornstar",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Casting Audition: Dimitri Kane"
}