{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Derrick Dime has weathered the storm and finally made it to his wedding day. The hoops he's had to jump through just to get to this day have been almost too much for one man to endure, but he's said his vows and next he's off with his bride to start their honeymoon. There's just one small detail left to be attended to, and DJ Garrett Cooper is knocking on the door now to see to it. <br/><br/>Looking to get paid, Garrett flashes a knowing look as Derrick searches his empty pockets for cash. Derrick suggests he might have cash in the car and Garrett asks him if by now he hasn't figured out how to handle these sort of situations. Derrick catches his meaning, checks the window to make sure it is clear, and then falls to his knees, whipping out Garrett's cock and sucking him off. Garrett strokes his cock as Derrick licks his balls, up the shaft and then to the head, downing it like a man determined. <br/><br/>Garrett appreciates the head, but he's looking for the full monty, so he mounts Derrick and instructs the new groom to fuck his brains out. Derrick obliges, bouncing Garrett up and down on his rock hard cock as Garrett strokes himself off, before the guys switch and Derrick bends Garrett over, pounding him from behind as Garrett bends over an ottoman. Ready to bust his nut, Garrett lay on his back stroking his dick as Derrick pumps him full of married cock, every thrust bringing Garrett closer to climax until he finally explodes all over himself, as Derrick pulls out and blasts him with his matrimonial load, knowing he may have his straight married life ahead of him, but he'll always have his secret connection to remember his wedding for the rest of his life.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Garrett Cooper",
      "person_id": 37542
    }
  ],
  "release_date": "2015-11-27",
  "scene_id": 79832,
  "series": "NDO - 4616 - Derrick Dime & Garrett Cooper",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blowjob",
    "Cum swallow",
    "Dark Hair",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Oral",
    "Slim"
  ],
  "title": "The Wedding Planner Part 3"
}