{
  "collections": [
    "Next Door Ebony"
  ],
  "description": "Osiris Blade is being held captive in a humid dungeon somewhere underneath the bustling city. Marlone Star is his warden, and this warden doesn't like prisoners to be comfortable.  Every evening around 7pm, just before Marlone retires to his quarters to eat dinner, he works up a ravenous hunger by 'dealing' with his only inmate. Osiris has come to sense when these fuckings are going to happen. It's his only indicator of the time of day, as his room has no windows or clocks.  This time, Marlone is especially horny and has been planning all day to ravage Osiris's ass extra hard. He starts by licking all over Osiris's body, then grabbing Osiris's dick underneath the medieval-style prison bottoms. Osiris likes this part of the day very much.  Soon, Marlone is shoving his dick in and out of Osiris's appreciative mouth. The girth and hardness excite Osiris.  He loves pleasing his master. On days when he sucks Warden Star's dick extra good, he receives a larger helping of mashed gruel.  It should be said that Osiris possesses an unimaginable gift -- a cock so large that Marlone Star has become addicted to sucking on it. It's unprecedented massiveness is something that has indeed become quite the subject of discourse among Marlone and his fellow wardens. Many have asked to see it, but Marlone is too cock greedy to even share a quick peek! He does, however, annoy the other wardens with notebooks full of drawings he's made of Osiris's dick. They are not very good, and only serve to frustrate the whole group at picnics and outings.  Anyway, after Marlone gets a nice oral pleasuring from his prisoner, he goes to his knees in order to enjoy an appetizer of fresh, plump cock. He takes his time tasting Osiris's ass and firm dick. He likes to do this before pounding that sweet, tight hole.  From there, Warden Star proceeds as he usually does, by bending Osiris over on the floor and slamming his ass hard and swiftly. He stands the prisoner up and continues the punishment as he helps Osiris jack his enormous dong. Join these two down in this dank cell where dark pleasure is in abundant supply. Enjoy!",
  "models": [
    {
      "name": "Marlone Starr",
      "person_id": 21914
    },
    {
      "name": "Osiris Blade",
      "person_id": 37349
    }
  ],
  "release_date": "2015-12-08",
  "scene_id": 79862,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Bald",
    "Black",
    "Climax",
    "Condom",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Leather",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "The Prisoner"
}