{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Preston Burgess is so tired of hearing his mom and her boyfriend fuck! Her room is right next to his and their amorous, nocturnal activities have been keeping him up lately. But it's not only the fact that he can't sleep.  You see, Preston has become jealous of his mom. Her boyfriend, Pierce Hartman, is one of the hottest guys Preston has ever seen. He wishes he could get the kind of hard pounding he hears his mom taking every night!<br/><br/>When Preston wakes up on a weekend morning, he's surprised to happen upon a nude Pierce making coffee in the kitchen. Pierce doesn't see him, so Preston watches quietly, from behind a cracked door. When Pierce finishes and heads off to the master bathroom for a shower, Preston follows. He continues his morning of peeping by watching Pierce in the shower for a little while.<br/><br/>  While Pierce is occupied, Preston takes the opportunity to sneak into his mom's bedroom and sniff all up on Pierce's underwear. Oh, they smell just like he expected! While poking around in there, he also sees a dildo under the bed.<br/><br/>When Pierce returns to the room, he finds Preston with the underwear on his face and the dildo deep in his ass. As Preston strokes his cock, Pierce hears him saying how he wants Pierce to fuck him. Preston realizes Pierce has returned and is quite startled. 'I didn't hear the shower turn off!' is all he can blurt out.<br/><br/>  Pierce tells him to relax, because he won't tell Preston's mom. Instead, he takes a cue from Preston and gingerly takes Preston's cock in one hand and cautiously continues the dildo banging with the other. Preston can't believe what's happening! But he's not about to stop it, that's for sure.<br/><br/>  From there, the two become engaged in passionate kissing. It's not long before Pierce is sucking on Preston's happy, stiff cock. He goes from enjoying that dick, to licking Preston's tight, Twink hole. After a while, Preston returns the favor by slurping on Pierce's fat dong, the same one he's fantasized about for months!  <br/><br/>Then Pierce has Preston turn around and take Pierce's big dick, right in his tender ass. What happens next is even more than Preston could've dreamed. Check out this cock-hungry Twink getting just what he wished for when his mom's incredibly hot boyfriend decides to take advantage of the perfect situation. It's the good, hard fucking he deserves for putting up with all the late-night noise!",
  "models": [
    {
      "name": "Pierce Hartman",
      "person_id": 34911
    },
    {
      "name": "Preston Burgess",
      "person_id": 27314
    }
  ],
  "release_date": "2015-12-02",
  "scene_id": 79863,
  "series": "NDT - 8307 - Preston Burgess & Pierce Hartman",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Hardcore",
    "Masturbation",
    "Mature",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Toys",
    "Twink"
  ],
  "title": "Sniffing My Mom's Boyfriend"
}