{
  "collections": [
    "Active Duty"
  ],
  "description": "It doesn't get any hotter than this, boys!  We have two newcummers matched up with an Active Duty soldier I think I can confidently call a veteran by now.  It's Allen Lucas and Shawn getting a trial by fire, led by our stalwart and trustworthy Quentin Gainz!This time, we see even more of that as the chemistry here steadily builds to a point of complete eruption.  Quentin, being the vet, jumps right into the sweet, sweet action by taking Allen's enormous, pulsating cock in his mouth and taking it deep.  Shawn enters the water slowly, starting out by getting into some passionate kissing with Allen.  Once the intensity really starts building, Shawn makes his way around to the other side of Quentin, where he goes in for a taste of his nice, tight hole.Eventually, Shawn moves upward and shares Allen's superb cock with Quentin for a while.  Allen has both tongues licking up and down for a while, and he sure enjoys it thoroughly, before Quentin gets up on his knees so Allen can take some dick in his mouth.  He gets a good taste of Quentin's hard cock, then turns him around to lick his ass.  I'm sure he could taste Shawn's mouth too while rimming that sweet hole.As Allen takes his time tonguing Quentin's ass, Shawn moves to sucking Quentin's big dick.  This gets Shawn good 'n' eager for his hole to get fucked.  Quentin takes the reigns and has the rookie Shawn climb on top of Allen for a good ol' fashioned pole ride.  Once everything is running smoothly, Quentin pops his dick into Shawn's mouth.  Shawn, like a good newbie, eager to please, keeps right on riding Allen's cock while taking Quentin's too.  Claude gets in tight and captures some wonderful views of Allen's truly large erection making its way in and out of Shawn's ass.They decide to switch things up so Quentin can bang Shawn.  Allen gets in there on the other end, being sure Shawn has a good mouthful of his swollen dick.  Claude really enjoyed seeing this great chemistry.  He asks Shawn, 'you like having a big dick in your mouth and one railing your ass?' Shawn looks at him with a big smile and says, 'it feels great!' What a champ!  Allen and Quentin use the opportunity to get into some very hot kissing over Shawn's back.Then it was the icing on the cake: Quentin lays on his back and wraps his lips around Shawn's dick while Allen gets back to licking Quentin's amazing ass.  'I feel like I'm being worshipped,' Quentin tells Claude as both guys treat his body like a wonderland.  But it's not long before Claude calls for Shawn to take some more breaking in.  'I think it's time for you to put that big dick in his hole,' he says.  Quentin has a dick in his mouth, but Allen answers with a hearty affirmative.Quentin steps into position and pounds Shawn again.  It's not long after this point that Allen assumes the position and takes a solid banging from Quentin.Well this one is sure a doozy!  It's a great time and one that'll sure go down in the books as a favorite three way among the whole platoon.",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 37870
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    },
    {
      "name": "Shawn III",
      "person_id": 37890
    }
  ],
  "release_date": "2015-11-15",
  "scene_id": 79965,
  "series": "AD - 42 - Quentin Gainz, Allen Lucas & Shawn",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Gay",
    "Group",
    "Jerk Off",
    "Muscular",
    "Rimming",
    "Sandwich Fuck",
    "Smooth",
    "Tattoos"
  ],
  "title": "Quentin Gainz, Allen Lucas & Shawn"
}