{
  "collections": [
    "Active Duty"
  ],
  "description": "Well Claude has been hard at work lately, making sure our latest recruits are the absolute cream of the crop.  And my goodness, he's done a helluva job this time!  Meet Matt, the most recent stud to enlist with our fine platoon.Matt is nice 'n' hard, right as soon as he gets down to stroking that big, excited cock.  He starts out seated on the couch, then Claude has him stand up.  This solo session is one where we get to see a brand new recruit loosen up quite a bit.  By the end of this jerk off, Matt was definitely enjoying himself and had probably forgotten a little bit that he was tugging his meat for the first time on camera.Claude took the liberty of getting a very nice angle over Matt's shoulder.  Matt has such a nice, thick dick.  I'd love to see him come back and have some more fun, particularly with one (or more) of our hungry-assed recruits.  I think it would be a real adventure to see a big, strong soldier like Matt pair up with another that has a similar build, like Jeremy, to give a hungry bottom a good pounding.  We get some nice shots of Matt enjoying his impeccable physique in the mirror while he jerks his swollen cock.  It's right after this that Matt shoots an incredibly massive load all over the leather couch.  He came so much, in fact, that Claude sat Matt down after the Vesuvius-like eruption to talk about it.  Claude explains that Matt hadn't had orgasmed in over 2 weeks!  When you see the size of his warm, thick explosion, you'll see the amazing fruit of his abstinence.  It's here that we really get a good taste of Matt's uninhibited personality, and I can't say I'm more excited to see this sweetheart of a hulk return to do some more experimenting and push his boundaries even further.",
  "models": [
    {
      "name": "Matt III",
      "person_id": 37975
    }
  ],
  "release_date": "2015-11-18",
  "scene_id": 80021,
  "series": "AD - 41 - Matt",
  "tags": [
    "Big Dick",
    "Brunette",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Solo",
    "Tan",
    "Tattoos",
    "War Chest"
  ],
  "title": "Matt"
}