{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Brenner Bolton has a repuatation for his work as a tattoo artist, so when Alexander Gustavo saunters into his shop with a recommendation, Brenner takes Alexander for a cool guy. As they go over the details for what Alexander would like to have done, Brenner notices his lean body and nice, tight ass. When Alexander lets slip that he is low on cash, Brenner assumes Alexander is familiar with Brenner's alternative payment system, and slips his hand between Alexander's legs, fingering his taint. Alexander shoots off the table in shock, and Brenner seems confused. Apparently Alexander wasn't aware of how things are done around here, but upon hearing the offer- unlimited tattoos for a little bit of extra 'attention'- Alexander finds himself contemplating something he never thought he'd do. Moments later, Alexander is back at the table, as Brenner slowly begins to fondle his cock. Alexander proves hard as a rock, especially for someone contending to not be interested, and Brenner just smiles with a knowing look on his face as he devours his customer's cock. Alexander closes his eyes as Brenner works his dick better than any woman ever has, and little by little, he realizes that Brenner is doing him more than one favor here, so when Brenner asks him to reciprocate, Alexander finds himself strangely into it, falling to his knees as he begins to suck Brenner off. Brenner guides him through the process and Alexander does really well for his first time, but what Brenner really wants is some of that hard cock, so he advises Alexander to bend him over the table and fuck him silly, which is definitely more than Alexander bargained for, but definitely something he can get into, as he pounds and prods Brenner's ass with reckless abandon, fucking the cum out of Brenner before jizzing all over himself. As they clean themselves up, Alexander realizes he's going to be covered in ink in no time.Enjoy!",
  "models": [
    {
      "name": "Alexander Gustavo",
      "person_id": 27416
    },
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    }
  ],
  "release_date": "2015-12-10",
  "scene_id": 80168,
  "series": "NDB - 4619 - Alexander Gustavo & Brenner Bolton",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "His Crown Jewels"
}