{
  "collections": [
    "Active Duty"
  ],
  "description": "I'm sure most everyone remembers Brad Davis, who, not long ago, graced our squadron with his unforgettable style, nicely chiseled body, and mouth-watering cock. Well just as I had hoped, Brad is back! And this time, he's jumping into action with a recruit who's become the most fun ball of energy among the whole outfit -- Johnny!<br/><br/>Once Claude gives them the green light, Brad and Johnny pull out their already very hard dicks and get right into some nice, tight-fisted stroking. Side-by-side, these fat erections are truly impressive. Both of these soldiers are working with some serious firepower! Johnny, being the dick-hungry, brand new cocksucker he's become, doesn't waste too much time before planting his two lips around Brad's throbbing dong. He's so eager to get all that erect meat into his mouth, he takes it a little too deep a few times.<br/><br/>  Brad started out slamming Johnny from behind, up against the side of the bed.  Pretty much right from the get go, Brad was using those lean muscles to drill Johnny good.  Claude captured some excellent shots from underneath, where we get to see Johnny's hole getting good 'n' stretched by Brad's powerful fucking.<br/><br/>  Then, Johnny climbs on top for a ride. He bounces hard on Brad, playing with his own rock-hard dick as he takes Brad's. Claude tells Johnny to let that beautiful cock bounce on its own for a while and boy do we get some great footage of Johnny here! I love seeing a stiff boner slapping on another soldier's chiseled stomach.<br/><br/>  The boys reposition into a wheelbarrow style, where Johnny really gets lit up by powerful Brad. Even Claude says, 'He's railing you now!' and all Johnny laughs as Brad delivers a serious pounding. Johnny lets his ass take a break for a few minutes so he can get another taste of Brad's cock, this time after it's been fucking his tight hole. Johnny's really expanding his field of experience lately, and I just love it.<br/><br/>  Before going back to the bed, Brad fuck Johnny on a chair, from behind. Here we see a continued drilling from Brad, who seems to be unstoppable at this point! Back on the bed, Johnny takes Brad's dick while on his back this time. We get to watch Brad pound the cum out of him and boy does Johnny have a good time working up to this epic eruption.",
  "models": [
    {
      "name": "Brad Davis",
      "person_id": 37920
    },
    {
      "name": "Johnny Riley",
      "person_id": 37613
    }
  ],
  "release_date": "2015-11-22",
  "scene_id": 80217,
  "series": "AD - 44 - Johnny & Brad Davis",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Johnny & Brad Davis"
}