{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "When Quentin Gainz's tractor breaks down on the farm, Dante Martin, who's taking a tour of the property, happens upon him.  Dante LIKES what he sees!  He especially likes Quentin's nice, plump ass and strong physique.  Dante decides to see if he can help Quentin out.Quentin is a bit surprised at first to encounter Dante, but he's glad someone is willing to help him get the tractor back in working order.  As Dante takes a look at the gears, Quentin notices how nice Dante's ass looks.  Dante calls him out on it and Quentin is totally embarrassed.  But Dante reassures him that it's totally cool.  In fact, Dante can see that this is a perfect opportunity to talk a straight guy into crossing some boundaries.Quentin is reluctant, but Dante says just the right things to get himself into those tight jeans.  Quentin agrees to let him suck his fattened dick.  Boy, that country-boy cock tastes so good in Dante's wet mouth.  After Quentin lets his guard down a little more, Dante convinces him to return the favor.  Quentin goes to his knees and takes Dante's throbbing erection down his throat.  Hey, not bad for a first timer!Quentin decides that since he's gone this far, he might as well let Dante lick his ass.  The feeling is better than Quentin had imagined.  It feels so good, in fact, that Quentin gives Dante the ok to fuck his virgin, country-boy hole!  That's right, Dante is lucking out and getting himself some sweet, down-home flavor!  Watch these two have a good old time as Quentin learns a thing or two about what getting pounded on the farm is really like!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2015-12-17",
  "scene_id": 80328,
  "series": "NDB - 4621 - Quentin Gainz & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Condom",
    "Deep throat",
    "Facial",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Tattoo/Piercing",
    "Uncut cock",
    "Workers"
  ],
  "title": "Straight From The Country"
}