{
  "collections": [
    "Active Duty"
  ],
  "description": "This time we have Ivan James and Brad Banks. Ivan is a lot of fun and we've all enjoyed seeing him blossom. When Claude gives the go ahead, Ivan jumps right into the line of fire, wrapping his lips around Brad's massive, girthy meat. After a little while, Brad moves from laying down to kneeling on the bed. We get a wonderful view here of Ivan's plump cheeks as he sucks! And they obviously caught Claude's eye. He says to Ivan as he works Brad's erection in and out of his mouth, 'that fat dick's gonna go into your ass in a second.' Ivan affirms with an eager, 'mmm hmmm!'<br/><br/>Then we get some excellent shots of Brad enjoying Ivan's large dick. Brad likes to do lots of work on the head of the swollen dicks. I have, however, noticed lately that Brad is diligently working to stretch his abilities further.<br/><br/>Next is one of my favorite moments from this experience. Ivan worked so hard this time to get that fat dick into his ass! But once he did, he let's go of his inhibitions and rides that cock like a pro. And true to form, Brad certainly makes it a challenge for sweet Ivan. His dick is so unrelentingly firm for Ivan and Brad sure doesn't hold anything back.<br/><br/>  Then Brad took a standing position to fuck Ivan on his back. 'I love that fat dick!' we hear Ivan say as Brad works up a nice pace. Ivan's dick sure stayed nice and hard while he took his medicine. Even Claude mentions this when he says Brad must be hitting Ivan's prostate. I think part of it is Ivan's becoming more comfortable getting fucked.<br/><br/>  Then comes Ivan's reward! Ivan has been having so much fun mixing it up with all these luscious recruits and he has LOVED getting to fuck his new friends' tight holes. Brad lays on his back and allows Ivan to push his throbbing cock into that meaty, muscular ass. Brad has become very good at stroking his erect dick while being fucked lately.<br/><br/>  This is an awesome encounter between two great guys that are really progressing. Seeing this one really gets my mind working, thinking about what great combination of boys we might see next. Enjoy!",
  "models": [
    {
      "name": "Brad Banks",
      "person_id": 37394
    },
    {
      "name": "Ivan James",
      "person_id": 37630
    }
  ],
  "release_date": "2015-11-29",
  "scene_id": 80349,
  "series": "AD - 46 - Ivan James & Brad Banks",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Tan",
    "Tattoos",
    "White Butt"
  ],
  "title": "Ivan James & Brad Banks"
}