{
  "collections": [
    "Next Door Originals"
  ],
  "description": "After hearing about Markie More's exploits in Father Gabriel's confessional glory hole, Dante Martin is excited to give it a go himself. Dante decides that he's going to fuck with whichever straight guy ends up in the box, so when Johnny Torque wanders in, Dante takes a very ceremonial tone, confusing Johnny, til Dante lets him off the hook. Johnny looks a bit nervous, and it's obvious the setting is making him nervous, but Dante quickly assuages him of those concerns, reaching through the hole and massaging Johnny's cock through his pants, before unzipping his jeans and pulling his hard dick through the glory hole. Dante sucks Johnny off, sucking on the head and then licking down the shaft as Johnny pushes against the sides of the wall to get traction. Dante coaxes Johnny to try fucking him, and though Johnny initially protests, he decides to give it a try, and so Dante mounts him through the hole. Johnny likes the fucking waaaaay more than he thought he would, closing his eyes as he begins to ram Dante. Dante feels every inch of Johnny's increasing enthusiasm and decides to push the envelope, coming over to Johnny's side making contact. Johnny resists at first but by now he's all the way sprung for the fucking, so Dante has him where he wants him, which is seated in a chair, hard cock pointing to the Heavens, ready to be mounted, and that's just what Dante does.Riding and grinding on Johnny, Dante strokes his cock hard, then lets it go as he watches it beat against his stomach in rhythmic pounding as Johnny fucks away below. Johnny wants to be in control, though, so he flips Dante over onto his back, legs akimbo as Johnny pounds missionary, while Dante beats himself off and cums all over himself. Johnny pulls out and absolutely drenches Dante with a pent up load tells Dante everything he needs to know about how 'into it' Johnny really was. 'He'll be back,' Dante thinks, as Johnny plays it cool.",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    }
  ],
  "release_date": "2015-12-25",
  "scene_id": 80401,
  "series": "NDO - 4624 - Cheating Faith - Dante Martin & Johnny Torque",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Dark Hair",
    "Facial Hair",
    "Gay Porn",
    "Glory Hole",
    "Jerking off",
    "Masturbation",
    "Oral",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Cheating Faith: How Does It Feel?"
}