{
  "collections": [
    "Active Duty"
  ],
  "description": "One of my favorite types of guy (for obvious reasons) is the strong Southern gentleman. They ooze a special, old-world flavor that's so unique and charming. Jerry Price is just that type of gentleman.<br/><br/>  Once Claude leaves Jerry alone to get comfortable (and naked), Jerry moves to a more comfy chair and strips on down to what the Lord gave him. My sweet goodness, those abs are divine!  And take a look at that herculean cock. If we're lucky enough to have Jerry jump into the mix with our other recruits, he'll definitely be in the running for hottest bod on the squad!<br/><br/>  After Jerry gets a bit more loose and a lot more lubed, Claude comes back and gets us some really nice, tight shots of Jerry's face. I love that Jerry frequently licks his lips while looking into the camera. He has a luscious mouth and a very aesthetically-pleasing bone structure.<br/><br/>  I'm certain y'all will be surprised when Jerry erupts, in his words, 'like a volcano' after only about five minutes of tugging his swollen meat. It is truly an epic explosion of hot juices, and one of the most outrageously heavy loads I've ever seen. Don't worry though, at this point Jerry is FAR from ending this stroke session. Like a stalwart soldier, Jerry advances further into battle, jacking his fat stiffie with even greater fervor than we'd seen.<br/><br/>  Claude gets nice and low for an underneath angle that allows us to look up at the jerking Jerry, as if we were waiting for his second blast to bless us as a nice, warm shower. But it's not at this point that we see a follow up.<br/><br/>  Jerry moves to the couch, where he seems to get even more comfortable, partially kicking up a leg and relaxing one arm across the back of the couch. After getting good 'n' tight on Jerry, really showing off the dick-hardening intricacies of his chest and stomach, Claude comes over Jerry's shoulder to give us a POV shot.<br/><br/>  Around this point, we get another wonderful cumshot from Jerry. 'It's another gusher every five minutes!' Claude says. Then Jerry moves back to the chair to CONTINUE stroking his fat cock!  We get some more incredibly hot solo action from Jerry before he explodes AGAIN!!!  ",
  "models": [
    {
      "name": "Jerry Price",
      "person_id": 38068
    }
  ],
  "release_date": "2015-12-02",
  "scene_id": 80453,
  "series": "AD - 43 - Jerry Price",
  "tags": [
    "Brunette",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Solo",
    "Tan",
    "Tattoos",
    "War Chest"
  ],
  "title": "Jerry Price"
}