{
  "collections": [
    "Icon Male"
  ],
  "description": "JD Phoenix visits Tony Salerno at a secret location away from the Church. Privately, JD confesses his forbidden desires and sins to the older man dressed in his priestly robes. JD finds it odd that they met away from the church, but understands discussions such as these require privacy. When Tony learns that the boy decided not to go through with his urges, he's disappointed, but decides to use it to his advantage. He explains that everyone has secrets, but it is OK since they are discreet in their goings-on. The truth is that punishments relate to getting caught. JD understands what he means, and as he reaching over to the younger man comforting, he relishes the contact he has with him. He grips the young man's shoulders, massaging them. JD presses his face up against the priestly robes, looking up with his big eyes, trustingly. Tony rubs the younger man's shoulders, before unsnapping the front buttons of his vestments. JD rubs his hands over the priestly uniform, as Tony unbuckles his pants. His dick is rock hard, it's head sticking up out of the top of his black briefs. JD breaths in deeply, the smell of man leading him into temptation, overcoming him. He sighs with tremendous pleasure and licks the stiff cock before him. Bringing it into his mouth, sucking on it.  Moving towards the bed, Tony leans backwards, careful not to interrupt the blow-job he's receiving from the altar boy. JD sucks on his dick head as Tony unbuttons his shirt, exposing his furry stomach. Their lips meet for the first time, electric sparks fly as forbidden lust takes hold. JD's smooth young body presses on Tony's. Tony pulls him on top of him, keeping a firm hold on his cheeks, as his tongue explores his young ass. Penetrating the young parishioner, Tony fucks him on the bed, his stiff cock sliding in and out of his tender hole. Taking him deeply, JD grabs the back of his head, encouragingly. Rolling over to kiss slowly, Tony jerks himself off with fervor, as JD brings himself over the edge, spurting onto his stomach, the sight of which pushes Tony over the edge.",
  "models": [
    {
      "name": "JD Phoenix",
      "person_id": 36928
    },
    {
      "name": "Tony Salerno",
      "person_id": 37744
    }
  ],
  "release_date": "2016-01-14",
  "scene_id": 80497,
  "series": "Forgive Me Father 3",
  "tags": [
    "Anal",
    "Closeted/Straight",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Jerking Off",
    "Masturbation",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Forgive Me Father 3, Scene #04"
}