{
  "collections": [
    "Icon Male"
  ],
  "description": "Altar Boy Kory Houston is in training to become a priest, but he fears rejection from the church for bringing men to the bedroom. Wanting to end what he has with parishioner Tony Salerno, Kory has a plan that will allow Tony to keep having sex with other altar boys, so he can use the stories as fuel for his fantasies.  Stripping him of his gowns, Tony makes out with the smooth young man. He feels his chest and erect nipples as the boy strips him of his own Sunday best. Kory gets down on his knees and takes the older man's thick dick into his mouth. Sucking it earnestly, deep-throating it, he tongues the bottom of his shaft.Taking his turn, Tony sucks the young man's beautiful long cut cock. Slurping the shaft from the base to the tip of the head, he follows with a thorough stroking with his hands. Climbing into bed, they press their excited taut bodies together, Kory sucks on Tony's nipples before taking his throbbing rod back into his mouth, choking himself with pleasure.Stiff as a board, Kory kisses Tony once again, before positioning his ass for a thorough tonguing. Stroking Tony's cock while he's being sucked, the married man holds firm, massaging his smooth luscious ass cheeks. After getting nice and wet, Kory climbs under his Daddy and takes his thick cock in deep even strokes. Crying out in pleasure as he's being fucked, Kory looks at Tony longingly, who kisses his cheek lovingly. Passionately making out, they flip it over and Tony takes the younger man's long stiff cock. Kory watches his long white pole disappear into Tony's hot ass, exploring it. Tony takes the pounding, enjoying the long thrusts into him. Getting closer and closer, he explodes everywhere. His cum sprays all over Kory and himself. Kory pulls out of the older man and finally cums onto his stomach with a trembling release.",
  "models": [
    {
      "name": "Tony Salerno",
      "person_id": 37744
    },
    {
      "name": "Kory Houston",
      "person_id": 37898
    }
  ],
  "release_date": "2015-12-24",
  "scene_id": 80494,
  "tags": [
    "Anal",
    "Ass Play",
    "Closeted/Straight",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Jerking Off",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Rimming",
    "Safe Sex",
    "Twinks"
  ],
  "title": "Forgive Me Father 3, Scene #01"
}