{
  "collections": [
    "Icon Male"
  ],
  "description": "It would be terrible for Brandon Wilde if his Sugar Daddy found out about the secret affair he's having. If he only knew his boy-toy was meeting his own son Andrew Fitch in a hotel room he would disown him, and the good times would be over. Nevertheless, the secret rendez-vous turns them both on and Andrew and Brandon kick off their secret tryst. Making out passionately, Brandon pulls his forbidden lover closer as Andrew caresses his bubble ass. Climbing on top of him, Brandon he strips off his shirt while Andrew kisses his smooth toned chest. They kiss lovingly before Brandon strips him down to his white undies. Taking off his own pants, he reveals his own tenting white boxers before pulling them down. Brandon takes his Daddy's son's dick in his hot little mouth, it's big head glistening slick with saliva. Moaning in pleasure Andrew reaches for the back of Brandon's head and guides it down, pushing it to the base of his cock, moaning with pleasure. Brandon gets his turn and Andrew flips him onto his back to begin sucking on the boy's cut dick, before turning him onto his stomach to licks the hot little hole. Brandon's stiff cock presses into the mattress and while grinding his ass into his lover's face. Wet, Andrew presses his glistening dick into his boy's ass quickly going where his own father has been before. He presses on but Brandon is ready to take it! Rubbing his boy's back pushes into him, Brandon pulling at his thigh encouragingly. Andrew's bubble asses flexes with each thrust. He fucks him slowly, the pressure in his ass pressing his insides. Brandon's dick explodes from the repeated slow deliberate pressure. Brandon's cum shoots from his dick, his toes curling in pure ecstasy. Needing his own release, and turned on by making is Dad's boy-toy shoot, he cums on Brandon's face, taking part of the load down his throat.",
  "models": [
    {
      "name": "Andrew Fitch",
      "person_id": 36116
    },
    {
      "name": "Brandon Wilde",
      "person_id": 35638
    }
  ],
  "release_date": "2016-01-19",
  "scene_id": 80493,
  "series": "Sugar Daddies 2",
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "HD",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Sugar Daddies 2, Scene #04"
}