{
  "collections": [
    "Icon Male"
  ],
  "description": "Brendan Patrick sits in his living room. Reading carefully, he sips a steaming cup of tea when a knock comes at the door. Coming by to talk, Trent Ferris explains how people at school are talking about Brendan leaving the Church. Worried that what they had done to him at school made him leave is nagging at him. Feeling guilty, Trent wishes he had gotten to know him better, and apologizes as they sit across from each other.Brendan tells him not to worry, that the boys wasn't the reason. They embrace, and as Trent is getting ready to leave Brendan tells him a secret. He never forgot about him, or the time they tag-teamed him at school. Trent takes advantage of this chance and makes the first move, kissing Brendan. Rubbing their hands over each other's bodies, they move to the bedroom. Brendan's hips gyrate into the young man's, as they kiss each other on the bed.Pulling off his shirt, Brendan fumbles with the boy's necktie before kissing again. Stripping the young student of his shirt, he tongues his nipples. Taking the ex-priest's veiny dick into his mouth, Trent sucks as the engorged, stiff-as-a-board member.Brendan takes his turn, sucking on Trent's long, youthful dick. Sucking him all the way to the base,  his lips glide over his shaft, Trent's dick throbbing in enjoyment. Flipping the younger man over, Brendan starts fucking the boy's ass. Trent moans as the older man pumps in and out of his young hole. Laying close to Trent, his chest on his back he feels him moans. Looking into his eyes as he's being fucked, Brendan pounds into him and massages an orgasm from the young man's thick cock. The ex-priest pounds into him, getting closer and closer to the edge before blowing his thick cum all over Trent's lithe frame.",
  "models": [
    {
      "name": "Brendan Patrick",
      "person_id": 36118
    },
    {
      "name": "Trent Ferris",
      "person_id": 36119
    }
  ],
  "release_date": "2015-12-31",
  "scene_id": 80495,
  "series": "Forgive Me Father 3",
  "tags": [
    "Anal",
    "College",
    "Cumshot/cum",
    "HD",
    "Hairy Guys",
    "Older on Younger",
    "Oral/ Blowjob",
    "Reality",
    "Safe Sex",
    "Twinks"
  ],
  "title": "Forgive Me Father 3, Scene #02"
}