{
  "collections": [
    "Icon Male"
  ],
  "description": "Wolf Hudson sits on the edge of the bed, buttons his shirt, and wants to slip out early morning. Nick Capra wonders why he doesn't sleep in with him, and leaves so early after staying the night. He's in search of human affection, and has grown to care about Wolf, who treats him like an ATM. Wolf is defensive, saying Nick knew the terms when they made their arrangement. Threatening to break it off, Nick tells him they should stop seeing each other. But, Wolf can't give it up. Jumping up on the bed, Wolf decides to give him what he wants. Angrily he stares into Nick's eyes and tells him he loves him. Nick feels Wolf's body, grabbing his lower back and reaching into his pants. They make out passionately as the older man unbuttons the shirt he just finished buttoning. Moaning in ecstasy, Nick cries out as the younger man tongues his pert nipple poking from underneath a thick covering of chest hair.As he disrobes, Nick exposes his tanned muscular ass. Taking his thick sugar daddy dick into his mouth, Wolf licks it up and down. Tonguing his balls, he gives them extra attention along with his big thick cock's head while his hand is buried in the patch of thick curly hair at the base.Wolf takes his turn, shoving his thick young dick into Nick's waiting mouth, spitting on his dick as it enters Nick's mouth, Nick is happy to take as much as he can. Laying Wolf down on the bed, he sucks the sugar boy's cock before sliding his big Daddy dick into his hole for some slow deep fucking.Wolf loves the big cock slowly stretching his hole. Laying him on his stomach, he reenters from behind he picks up the pace, pounding him with long deep strokes. His face flushed with pleasure, Wolf pulls on Nick's muscular forearm, encouraging him. Nick takes his turn on the bottom, and Wolf pounds into his ass. Soon, Nick explodes! His cum sprays everywhere, and making out, Wolf jerks his cock and sprays a big stream of cum into the hair on Nick's stomach.",
  "models": [
    {
      "name": "Nick Capra",
      "person_id": 35574
    },
    {
      "name": "Wolf Hudson",
      "person_id": 36284
    }
  ],
  "release_date": "2015-12-29",
  "scene_id": 80490,
  "series": "Sugar Daddies 2",
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Masturbation",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Sugar Daddies 2, Scene #01"
}