{
  "collections": [
    "Icon Male"
  ],
  "description": "Etan Slade sits at the bar, sipping his drink. He glances back at muscular Nick Capra as he knocks some balls around on the pool table behind him. As he's walking back to the bar, Ethan notices Nick's broad muscular chest beneath his shirt. Nick notices that someone covered his drink, and strikes up conversation with the college boy beside him. Ethan looks at Nick curious and unsure. Connecting about busy college life, Ethan feels that he has something in common with the built Daddy. Nick tells him about his experience in college with an older man. He has fond memories of his sugar daddy and wants to pay it forward.Ethan looks around unsure about the proposal that Nick is offering, but Nick convinces him to come see his winter place and they leave the bar. When the tour makes its way to the bedroom, it ends. Nick's hands explore the younger man's body, his strong thighs and ass humping the slender boy's frame.Helping Ethan with his shirt, he pulls him up onto him, holding him around his back, kissing his nipples. Ethan's abs are dusted with hair, and flex as Nick's mouth explores his chest. Kissing his arm pit. Nick strips Ethan of his pants, exposing his tight white briefs, he kisses his smooth foot, sucking on the younger man's toes, rubbing his feet on his bulging crotch.Nick works his way up the younger man's physique, kissing him tenderly.Nick presents his thick dick, giving it a few slaps, before putting it in Ethan's hungry mouth. Nick returns the favor, mouthing Ethan's long cut cock, before flipping him over to lick his smooth ass.Pushing into him slowly, they make out as Nick fucks him, the younger man's back arched and pushing back into his Daddy, enjoying every thrust. Nick pulls him into him as he reaches up and caresses his face. The younger man's stiff dick rubs against the bed, as he's being lovingly pounded from behind. Ethan begs Nick to fuck him harder, and spurts puddles of cum onto his lightly hairy chest. Nick scoops up some of Ethan's cum and uses it as lube before blowing a load onto his fuzzy stomach.",
  "models": [
    {
      "name": "Ethan Slade",
      "person_id": 37966
    },
    {
      "name": "Nick Capra",
      "person_id": 35574
    }
  ],
  "release_date": "2016-01-12",
  "scene_id": 80492,
  "series": "Sugar Daddies 2",
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Jerking Off",
    "Masturbation",
    "Mature",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Sugar Daddies 2, Scene #03"
}