{
  "collections": [
    "Active Duty"
  ],
  "description": "This one turned out to be such a fun hookup, with two guys that clearly enjoy being a part of our squad.  We have our veteran, the strong 'n' handsome Quentin Gainz, and joining him is a newer recruit, Allan Lucas, who I think has shown some of the top potential we've seen lately.<br></br>Once Quentin unleashes his thick, swollen snake, Allen wastes NO time wrapping his mouth around it.  And boy is Quentin glad.  By now, I can tell when he's especially happy to have his cock inside a fellow recruit's mouth, and this is one of those times.  As he works on Quentin's large boner, Quentin says, 'I can't wait to feel you eating my ass.' Allen takes that as his cue!  He goes right in for a good, long taste of Quentin's famously luscious hole.<br></br>Soon Quentin has his own lips wrapped around Allen fat dong and is sucking real good.  I should say that Allen's cock is truly massive.  A bit of this sucking inspires the boys to move into a 69 position so they can each get the best of both worlds at the same time. <br></br>From here, we see a little more ass eating from Allen.  Claude does a great job capturing this hot moment.  He sneaks up, nice and tight from underneath and get some beautiful stroking from Quentin as Allen enjoys that tender hole.  It's all in an effort to prep Quentin's ass for a good pounding.<br></br>Then we have my favorite part: Quentin climbs on top of Allen and take that hard fattie for a ride.  This is a great position, as we catch some nice upward thrusting from Allen into Quentin as he stretches his cheeks apart with his hands.  <br></br>The riding serves as a nice little warm up for Allen to take more of an in-charge position.  Quentin goes to his back and Allen gets to some good, hard fucking.  He pushes that massive dick deep into Quentin and doesn't hold back.  Quentin like that kind of solid pounding, and he jerks his firm erection the whole while.  <br></br>They switch things up a bit and Quentin bends over the bed and lets Allen bang him from behind.  This one is always one of my favorites because I so enjoy the way Quentin's ass looks when he's being fucked.  It's plump, but muscular, and reacts just right to the hard slams.  Allen likes it too, as evidenced by his monstrous boner.  Claude, as usual, sneaks underneath the boys and shoots some real nice footage from underneath.  We also get some beautiful shots of Quentin's cock getting jerked as he takes Allen's hard meat.",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 37870
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2015-12-06",
  "scene_id": 80506,
  "series": "AD - 48 - Quentin Gainz & Allen Lucas",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Gay",
    "Jerk Off",
    "Rimming",
    "Tattoos"
  ],
  "title": "Quentin Gainz & Allen Lucas"
}