{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Gabriel Cross has had some interesting encounters during his time as a dancer at the club, but when Dylan Knight came in a few nights ago, Gabriel realized he was up against something entirely different. Dylan is a busy man who doesn't have a whole lot of time to spend in pursuit of personal pleasures, so when he came home from the club and emptied his pockets, he was pleasantly surprised to find that Gabriel had slipped him his number.And now here they are, both seated on Dylan's sofa as the lights of the city flicker below. Dylan's place is impeccably furnished and it is obvious he's a success at whatever he does, but right now Dylan's sole focus is on Gabriel, who begins to dance a private dance for him in the living room. <br/><br/>Stripping out of his clothes, Gabriel has Dylan right where he wants him, unfastening Dylan's tie and using it to control him, slowly grinding his ass against the inseam of Dylan's tailored slacks. Dylan's bulge grows as Gabriel kisses down his chest, and slowly unzips his fly.Moments later they are in Dylan's bedroom, as he throws Gabriel down on the bed and begins to kiss down his body, stopping at Gabriel's hard cock and downing it whole. Gabriel closes his eyes as Dylan does whatever he wants, flipping Gabriel over and fingering his hole before flipping him back over and mounting him, riding Gabriel's big hard cock as he strokes himself off.<br/><br/>Gabriel watches Dylan's hard cock bouncing against his stomach and begs Dylan him to fuck him with it, so they switch up, and Dylan fucks Gabriel hard and fast from behind as Gabriel clutches the pillow and closes his eyes.<br/><br/>Dylan is hard as a rock but he wants to cum with Gabriel's cock inside him, so they switch one more time as Gabriel pounds Dylan missionary, fucking the cum out of him and then sopping it up, licking up every drop before losing his own load all over Dylan's face.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Dylan Knight",
      "person_id": 31577
    },
    {
      "name": "Gabriel Cross",
      "person_id": 32093
    }
  ],
  "release_date": "2015-12-24",
  "scene_id": 80509,
  "series": "NDB - 4623 - Gabriel Cross & Dylan Knight",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Caucasian",
    "Climax",
    "Dark Hair",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Oral",
    "Rimming"
  ],
  "title": "Big Dick Business"
}