{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Father Gabriel Cross has got quite the plot hatched in for friends Markie More and Dante Martin. It seems Father Gabe has been perusing a few cheating sites for married men looking to cross over, and though his religious pledge keeps him celibate in practice, it doesn't mean that Gabriel cannot indulge in a bit of vicarious living, so he's set up his confessional as a meeting place, and posed as his friends in order to lure them.Bridger Watts is one of these men. Married to a woman who will not indulge his anal fantasies, Bridger has turned to the internet to satisfy his lust, and that search has brought him here, in the dark enclosure of the confessional, as Markie waits on the other side.Bridger confesses his desires to Markie, and Markie instructs him to stick his cock through the glory hole that Gabriel has installed. Bridger obliges and Markie takes him into his mouth, sucking him hard has Bridger pushes up against the wall. Bridger is hard as a rock and Markie asks him how far he wants to push his fantasy. Bridger tells Markie he wants to go all the way, so they switch and Bridger sucks Markie off through the glory hole, while stroking himself up to fuck. Markie bends over and Bridger penetrates him without being able to see him, fucking him through the hole in the wall as Markie moans deeply.Turned on, both guys decide to ditch the safety and the barrier of the confessional and move out to the pew, where Markie rides Bridger's straight hard cock as Bridger watches Markie's ass bounce up and down, before turning him over and fucking the cum right out of Markie as he lay on his back. Bridger pulls out and blasts Markie with his own load just as they hear sounds of someone approaching in the distant hallway. They quickly scurry back to the confessional as the janitor sweeps through on his nightly rounds, and while they hide silently, Bridger wonders when he'll get a chance to do this again, while Markie wonders just who this strapping, silent janitor is, after all.",
  "models": [
    {
      "name": "Bridger Watts",
      "person_id": 38083
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2015-12-18",
  "scene_id": 80502,
  "series": "NDO - 4622 - Cheating Faith - Markie More & Bridger Watts",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Gay Porn",
    "Glory Hole",
    "Jerking off",
    "Masturbation",
    "Oral",
    "Red Head",
    "Smooth",
    "Tattoo/Piercing"
  ],
  "title": "Cheating Faith: I Wanna Fuck Some Gay Ass"
}