{
  "collections": [
    "Next Door Twink"
  ],
  "description": "Max Penn is bummed out because he doesn't think he'll have a date for prom.  He WANTS to go with Garrett Cooper, who's been a good friend for a while now, but neither his own, nor Garrett's parents know either of them are gay!  <br><br>When Max's dad surprises Max by telling him he already knows he's gay, and that Max should go ahead and ask Garrett to prom, Max thinks his dreams are coming true!  But Garrett's parents aren't nearly as cool as Max's dad.  Garrett tells Max he can't go to prom with him because his parents would surely find out and kick Garrett out of the house.  Max is hurt so badly, he can barely even leave the house.  <br><br>Garrett, however, musters the courage to be who he is.  He hates upsetting Max, his friend and secret crush, so he decides to tell his parents and see what happens.  To his chagrin, they're OK with it!  Max and Garrett have a blast at the dance, and wind up at Max's house afterwards, where things really heat up!!<br><br>Since they're both virgins, Max and Garrett go slowly at first, even though their lust for each other is uncontrollable.  Max goes down and gets a mouthful of Garrett's swelling cock.  It feels even better than Max had fantasized.  Then it's Garrett's turn.  He enjoys slurping on Max's hard dick before flipping his date over and tasting his tight hole.  <br><br>It's pretty much the best feeling Max thought he'd ever felt!  But then Garrett slid his fat, erect cock into Max's ass and it blew Max's mind!  Wow, what an incredible sensation.  Garrett loved how tight and warm Max's ass felt on his firm cock.  Max used his gymnastics skills and did the splits while bouncing up and down on Garrett's pulsating boner.  Once Garrett was ready, he let Max fuck him. <br><br>Max pounded Garrett's hole harder than he had planned.  The passion overtook him and he was lost in the moment.  <br><br>Join these young lovers and experience together with them a once-in-a-lifetime night of first-time, after-prom sex!!",
  "models": [
    {
      "name": "Garrett Cooper",
      "person_id": 37542
    },
    {
      "name": "Max Penn",
      "person_id": 38088
    }
  ],
  "release_date": "2015-12-15",
  "scene_id": 80515,
  "series": "NDT - 8308 - Garrett Cooper & Max Penn",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Brunette",
    "Climax",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Slim",
    "Twink"
  ],
  "title": "Prom Virgins"
}