{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "When Brendan Phillips listed his entertainment console for sale, he hardly expected such an immediate response, much less from such a hot buyer, but when Bridger Watts sees something he wants, he goes right after it. Only problem is, Bridger has no way to load the thing into his house once he leaves, so Brendan, ever the opportunist, himself, slyly offers to help Bridger with his load.  With the console safely unloaded, Bridger and Brendan rest on Bridger's porch, drinking a beer. Bridger cannot express his gratitude enough to Brendan who assures him its not a big deal. But Bridger persists, and Brendan gets the feeling maybe this is about more than an entertainment console, and when Bridger volunteers to rub Brendan's sore shoulders, Brendan's suspicions are confirmed. As Bridger runs his strong hands up and down Brendan's body, Brendan can feel himself getting hard, and Bridger can sense it too, suggesting that Brendan remove his pants. Brendan obliges and Bridger suspends all pretense, sliding Brendan's hard cock into his mouth. Brendan does not object, so Bridger continues, sucking Brendan off until he is nice and hard, before flipping him over and eating his ass. Brendan is definitely ready to see what Bridger is made of, so the guys move to Bridger's bedroom where Bridger spreads Brendan out and pumps him full of hard cock, pounding him from behind as the sweat pours off of both of them. Bridger then flips Brendan over and pile drives him, grabbing both his legs for leverage as he thrusts long and deep into Brendan's waiting hole. Brendan is hard as a rock as Bridger pulls out and absolutely coats him with his jizz, which turns Brendan on so much he explodes right after, leaving him covered in cum, and completely shagged out from the days events. Enjoy!",
  "models": [
    {
      "name": "Bridger Watts",
      "person_id": 38083
    },
    {
      "name": "Brendan Phillips",
      "person_id": 38107
    }
  ],
  "release_date": "2015-12-31",
  "scene_id": 80541,
  "series": "NDB - 4625 - Bridger Watts & Brendan Phillips",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming"
  ],
  "title": "Heavy Load"
}