{
  "collections": [
    "Active Duty"
  ],
  "description": "Now here're two fine recruits that are gonna really get yer engine started! It's one of our newest, and one of my most recent favorite soldiers, Jerry Price returning! He's matched up with another very special recruit, who's coming in with a tad more experience, the handsome and charming Allen Lucas.<br/><br/>Jerry is definitely not accustomed at ALL to getting sexual with other guys, let alone on camera. I'm glad we get to see him here with such a laid back dude, with a bit more experience, who certainly seems eager to show Jerry the ropes. It's not 2 seconds that Jerry's cock is out before Allen is wrapping his soft lips around it. You absolutely have to watch this part. Jerry's face shows his feeling of sheer disbelief at how good it is to have this mouth lapping and sucking at his dick and balls. I've never seen a reaction like this!!<br/><br/>Once Jerry calms down just a bit, he gets up from the bed and stands so Allen can continue enjoying his hardening cock. Not much later, Jerry braves the waters -- so to speak -- and goes in for a taste of Allen's throbbing, needy erection. As one of the first dicks Jerry has ever attempted to suck, this is a monumental moment. I mean this not only because it's one of the first, but because Allen's cock is so massive, it's nearly the size of a standing national monument! But Jerry is not dissuaded. He marches forth, putting the huge, girthy meat pole into his mouth and bobbing as best he can.<br/><br/>  All this fun loosens them both up a bit more, and they move into a 69 position on the bed. Finally, Allen ends up climbing atop Jerry and taking that nice boner for a ride. Allen really gets into an excellent groove here, and Jerry does a wonderful job fucking. My favorite shots of the whole experience happen here, when Claude gets in tight on Jerry's face and chest as Allen rides him, and we see Allen's fat, stiff cock bouncing on Jerry's impeccably shaped chest.  ",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 37870
    },
    {
      "name": "Jerry Price",
      "person_id": 38068
    }
  ],
  "release_date": "2015-12-13",
  "scene_id": 80580,
  "series": "AD - 50 - Allen Lucas & Jerry Price",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "Jerk Off",
    "Muscular",
    "Smooth",
    "Tattoos"
  ],
  "title": "Allen Lucas & Jerry Price"
}