{
  "collections": [
    "Active Duty"
  ],
  "description": "These boys together is a sight too sweet for words.  Our resident firecracker, Johnny Riley is here with new recruit, Johnny Thompson.  Yes, it's Johnny and Johnny, and it's the first time we're seeing handsome and willing Thompson experiments on camera!  Who better than Riley to make him feel welcome and comfortable, and also to show him how to loosen up!<br><br>Once Claude gives them the go-ahead, the Johnny's start things off by getting their hands dirty.  Their big, hard dicks come out and the boys begin by slowly jerking each other with nice, tight grips. <br><br>It isn't too long before Riley is giving Thompson the lip service of his life.  I think this was when Thompson really gave in to the sheer ecstasy of the experience and lost himself in the pleasure.  They move into a 69 position and continue heating with intensity.  Gosh, these recruits are the perfect size for each other!<br><br>  From there, Mr. Riley climbs atop Thompson and takes that freshly inducted AD cock for a test spin.  Boy, does it turn out to have some incredible potential!  Thompson does an excellent job of giving Riley the good time he was hoping for, and surely makes him proud as a mentor. <br><br> Thompson goes to his back and lets Riley continue the session.  'Oh yeah, you feel great,' Riley tells Thompson, and Thompson seems to rest his head back on the bed, in relief.  I can't blame him.  His nerves must still be pretty wound, hoping that his mentor is enjoying his hole.  When Riley tells him earnestly that his ass does feel great, I can imagine that satisfaction. <br><br>Claude gets some wonderful shots of Thompson's hard dick as Riley pummels his hot pocket, just before Thompson gets back in the driver's seat.  By this point, Johnny T has loosened up and is really having a blast!  'You like a cock up your ass!' Claude says as we watch Riley get drilled.  Wow, Riley has learned how to tolerate a no-punches-pulled fucking very nicely!  <br><br>Finally, we have Riley back on top, taking more stiff cock in his ass as he jerks the warm load out of his own throbbing dick.  I'm so pleased with how this one turned out, and how well both Johnny's did!  From Johnny Thompson, I can easily imagine a long, fruitful tour of Active Duty.  As for Johnny Riley, I don't need to tell you how much amazing action we have in store from this robust cadet.  I think it's clear that with these two on the squad, we can count on a fun ride ahead!",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 37613
    },
    {
      "name": "Johnny Thompson",
      "person_id": 38110
    }
  ],
  "release_date": "2015-12-20",
  "scene_id": 80587,
  "series": "AD - 52 - Johnny Riley & Johnny Thompson",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "First Time",
    "Jerk Off",
    "Shower",
    "Smooth",
    "Tattoos",
    "Twink"
  ],
  "title": "Johnny Riley & Johnny Thompson"
}