{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Father Gabriel's game of catfish heats up, he no longer is intrigued by run of the mill straight guys, and instead begins searching out for guys with particular needs. Derrick Dime is one such fellow, fostering curious inclinations with no outlet at home. Fed up with his wife's delicate sensibilities, he's turned to the Church for guidance, and found deliverance in the form of Markie More. Markie enters the confessional as Derrick's mind races. Nervously he professes his desires to Markie, who assures Derrick that he can help him. Derrick seems skeptical, especially when Markie tells him to undress, but Derrick obliges, taking Markie's direction to slip a finger inside his own hole, as Markie looks on from the other side. Derrick throws his feet up and spreads his legs, fingering himself as Markie watches. Derrick has never been so turned on in his life, and Markie can tell he's willing to go further just by the sound of his moans, so Markie unzips his pants and slips his cock through the glory-hole, instructing Derrick to give him head while he continues to finger himself.  Derrick does as he is told, licking Markie's hard cock from base to tip before downing it no handed. Markie is hard as a rock and he asks Derrick if he'd like the real thing. Derrick can't answer 'YES!' fast enough and before he knows it, he's backed his ass up to the glory-hole as Markie slips his cock into Derrick's virgin ass. Derrick moans from the pain at first but as Markie gently slides it all the way in, pain gives way to pleasure. Derrick can't get enough of Markie's cock, and the glory-hole is getting in the way, so the guys move out to the pew so Derrick can give up the ass nice and proper. Markie pumps him full from behind, eyeing Derrick's giant hard cock with a bit of envy, so they switch, and Markie gets his fill of Derrick's cock before unleashing his load all over Derrick's waiting chest. Markie dismounts and Derrick coats his face with his own pent up load, one long over-due and every bit as satisfying as Derrick had fantasized. As they head back to the confessional to clean up, Markie realizes that maybe there's a real service being provided here, after all. Enjoy!",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-01-01",
  "scene_id": 80620,
  "series": "NDO - 4626 - Markie More & Derrick Dime",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Climax",
    "Cum swallow",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Muscular",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "Cheating Faith: She Won't Play With My Ass"
}