{
  "collections": [
    "Next Door Twink"
  ],
  "description": "For Phenix Saint, life has been getting more and more crazy every day, as his wedding approaches.  It's a good thing his future wife's family is so much fun and easy to get along with.  His soon-to-be brother-in-law, Max Penn is always up to some kind of mischief, but Phenix loves spending time with him.  And Max's boyfriend, Alexander Gustavo, is a perfect complement to Max.  He's always encouraging Max to run some kind of clever scheme...often seduction is involved.On a sunny day, when Phenix's woman is stuck at work, Phenix decides to join Max and Alexander down by the pool for a little bonding time.  They welcome him and cook up a plan as he sunbathes shirtless next to the pool.  Max finally convinces Phenix to come in the pool, wearing a pair of Max's swim shorts, since Phenix didn't bring over a pair.  Saying they were small on him would be a huge understatement.  As the three casually toss around a volleyball and make wisecracks at each other, Max announces he'll be right back.  He walks out of the pool slowly so Phenix gets a good look.  Then, to Phenix's astonishment, Max pulls his shorts down and gives both guys a good show of his tight asshole!  Alexander laughs at Phenix's nervous reaction.  When Max gets back in the pool, he tries to get Phenix to take off his shorts too, but Phenix does NOT see this as appropriate.  Max takes matters into his own hands and submerges, swims over to Phenix, pulls his shorts off and quickly gives Phenix's cock a little suckle.  It all happened too fast for Phenix to realize what had happened.  Max then jumps out of the pool and motions for Phenix to follow him behind the pool house.  Phenix jumps out, naked and confused and goes after Max.  Max grabs his arm and pulls him behind the house where they seem to be alone.  There, Max convinces Phenix to let him suck his dick!  It took a little convincing, but Max takes advantage of the opportunity to the full extent.  And Alexander takes a prime position for watching, hidden behind a support beam, jerking his hard meat.After a few minutes, Max brings Phenix back poolside and Alexander joins them.  Phenix figures that this has already become so out of control, he should at least finish off the whole encounter with a nice cum blast.  Max continues to slurp Phenix's cock while Alexander licks Max's butthole.  Then, Max lets Phenix experience his first ass.  Phenix slides his fat boner into Max's sweet hole and fucks him good.  Alexander stuffs Max's dick-hungry mouth on the other side.  Join this wild pool party and see these guys really bond in the best way, just before they all become one big happy family-in-law!",
  "models": [
    {
      "name": "Alexander Gustavo",
      "person_id": 27416
    },
    {
      "name": "Max Penn",
      "person_id": 38088
    },
    {
      "name": "Phenix Saint",
      "person_id": 4914
    }
  ],
  "release_date": "2016-01-12",
  "scene_id": 80696,
  "series": "NDT - 8309 - Alexander Gustavo, Phenix Saint & Max Penn",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Beefy",
    "Brunette",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Outdoor",
    "Rimming",
    "Slim",
    "Straight Men",
    "Tattoo/Piercing",
    "Threesome",
    "Twink"
  ],
  "title": "My Sister's Fiance"
}