{
  "collections": [
    "Next Door Originals"
  ],
  "description": "The old adage of best laid plans often going awry has proven itself yet again, as the snag in Father Gabriel's scheme has finally begun to unravel. As Dante reports the news of Arad, the janitor, catching him in the act with his last mark, both Father Gabe and Markie More begin to understand the weight of the situation. Do nothing, and they run the risk of being uncovered. But acting on this new information could also lead to implosion. The one thing going for the guys is Dante's revelation that he had a smile on his face while he watched, which makes Father Gabriel think that just maybe he can pulled into the fray. So they organize a meeting and Arad, though nervous, sits calmly as Father Gabe lays it out for him. Arad, through limited English, communicates that he's seen nothing out of the ordinary going on at the church, which Dante directly challenges him on. Confronted, the look in Arad's eyes confess that he is both aware of what is going on late at night behind the veil of the Confessional, and that he is not necessarily objecting to its continuation.The look is all the Father Gabriel needs, as he pounces on the close, inviting Arad to join the group. Arad feigns confusion until Markie strokes his leg and Dante rubs his arm as Father Gabe begins to slowly unzip his cover-alls. Dante falls to his knees as Markie and Father Gabe undress.As Dante sucks him off, Arad watches as Gabriel and Markie engage, with Gabriel deep throating Markie's hard cock. Arad's cock grows hard inside Dante's mouth, as he begins to finger Dante's ass in anticipation. Father Gabe watches all of this stroking his cock and decides he wants to give Arad first crack, mounting him reverse as Arad holds onto his legs and pumps with his virgin cock. Markie bends Dante over and fucks him doggy-style hard as Arad looks on.Suddenly, Arad unleashed, takes control of the situation, ordering all three guys down on the ground ass up, as he systematically goes down the line, fucking the hell out of all three of them before pairing off with Dante for one last piece of unfinished business. After all, it was Dante who enticed Arad with the look from the Confessional, so it only seems appropriate that he should take Arad's first load. Markie pounds the cum right out of Father Gabe and then coats him with his own load as Dante jacks his nut all over himself while Arad keeps fucking, finally pulling out and covering Dante with his virgin seed, forming a covenant between the four of them, which will surely bind them together in future endeavors. Enjoy!",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Gabriel Cross",
      "person_id": 32093
    },
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Arad",
      "person_id": 34440
    }
  ],
  "release_date": "2016-01-15",
  "scene_id": 80699,
  "series": "NDO - 4630 - Gabriel Cross, Markie More, Dante Martin & Arad",
  "tags": [
    "Amateur",
    "Ass Play",
    "Athletic",
    "Big Dick",
    "Big Muscles",
    "Blonde",
    "Brunette",
    "Climax",
    "Dark Hair",
    "Gay Porn",
    "HD Movies",
    "Oral",
    "Orgy",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Cheating Faith: The Virgin Mark"
}