{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Having waited nearly 2 months just to secure a meeting with a potential investor, inventor Mark Long has his pitch and product all set for presentation, but unfortunately, his audience is a bit distracted. Damien Michaels, or Mr. Michaels, as he is known around these parts, is having some personal problems at home that are preventing him from staying focussed on the meeting in front of him. He keeps looking out the window, staring off into space, and is not paying any attention to Mark's pitch. Mark senses that his presentation is going down the drain but he's determined to salvage some sort of working relationship with Mr. Michaels, so he engages him in a bit of personal conversation, where Damien reveals that he's just been divorced this morning, with the paper work coming through not too long ago. Mark can see the glum look on Damien's face and suggests maybe they ditch work and go loosen up over drinks.<br/><br/>Several hours and several drinks later, both Mark and new bestie Damien make it back to Damien's place, where they both fall onto the bed talking. Damien thanks Mark for the night out, and Mark assures him that it's nothing, as he eyes the pleat in Damien's pants, running his fingers along the hem line and brushing against Damien's fly. Damien looks down and finds Mark playing with his cock through his pants. He's taken aback by it, but also must admit that it feels pretty good. Damien mildly protests but Mark quickly talks him out of his reservations, and the next thing you know, both guys are stroking their cocks on the bed. Damien eyes Mark's gigantic dick and curiosity gets the better of him, so he asks if he can suck it, and Mark obliges. Damien downs Mark's long dong and begins to finger his hole in anticipation of what might follow. Sure enough, Mark is down to pound, and Damien is more than willing to give it a go, so Mark bends over the big bossman and proceeds to fuck him silly, pile driving Damien into the floor before laying him down on his back and fucking the cum right out of him, then pulling out and blasting him with his own pent up load.<br/><br/>Enjoy!",
  "models": [
    {
      "name": "Damien Michaels",
      "person_id": 37846
    },
    {
      "name": "Mark Long",
      "person_id": 18862
    }
  ],
  "release_date": "2016-01-07",
  "scene_id": 80752,
  "series": "NDB - 4627 - Mark Long & Damien Michaels",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Muscular",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Hard Divorce"
}