{
  "collections": [
    "Dylan Lucas"
  ],
  "description": "It's a beautiful sunny day in California and Trenton is outside in his backyard relaxing in his shorts and spraying himself down with some tanning spray. He's under his sun umbrella enjoying a nice read when he hears splashing in the neighbor's yard. He goes and peaks over the fence to see Chris who is much younger then Trenton swimming around in his pool. Chris visits his Dads house every summer and Trenton is great friends with him so they've hung out before at some friendly BBQs and the closest he's come to him was laying a hand on his shoulder one day just passing by. Chris has no idea that Trenton has the hots for him. Trenton keeps watching the young stud from his fence being sneaky and quiet. He begins to fantasize about how great Chris would feel against him and his hard cock deep in that young college boy's ass. This summer it's finally going to happen so Trenton walks into the backyard with the excuse of, where's your Dad? Chris tells him that his Dad is out running errands and will be back soon. Trenton doesn't care and makes the remark ,'I think you missed a spot with the lotion', that one remark opens the door up for Trenton and he finally gets his manly hands on the smooth young buck. He can't contain himself and slowly pulls Chris shorts off with no hesitation and Chris is going with the flow. Trenton sees how hard that young cock is and uses his wet eager mouth to get it nice and lubed up. Sucking and rubbing his balls he bends Chris over and begins to milk him from behind while rimming that sexy furry hole. The energy is picking up and they take the action inside where Chris gets his big cock deep in his mouth before Trenton bends him over the kitchen counter and fucks that young tender ass.  Enjoy!",
  "models": [
    {
      "name": "Chris Abbot",
      "person_id": 38177
    },
    {
      "name": "Trenton Ducati",
      "person_id": 32299
    }
  ],
  "release_date": "2016-01-11",
  "scene_id": 80754,
  "series": "DL - 6 - Trenton Ducati & Chris Abbot",
  "tags": [],
  "title": "Summer Voyeur"
}