{
  "collections": [
    "Next Door Originals"
  ],
  "description": "With Father Gabriel's little cat and mouse game working wonders, Dante Martin wonders what his next mark will be like, and almost on call, Dante's phone blows up with the info. Gabriel instructs Dante to wear a jock strap since the mark has a secret fetish for them.<br/><br/> Dante obliges, but as he finds himself across the confessional from Dylan Knight, he realizes that Dylan has never acted on any fantasies of his own, much less any involving men. Dylan is nervous and almost reconsiders, but Dante assures him he's in a safe place and quickly undresses, showing off his tight ass in his custom jock. Perhaps letting his desires over-ride his good sense, Dylan decides to stay, and is immediately rewarded with Dante's giant cock, slipped through the hole, and into Dylan's mouth, as he gags on Dante's hard on through the glory-hole. Dylan sucks Dante off while stroking himself hard, then Dante backs his ass up to the glory-hole for Dylan to sample. Dylan fucks him through the wall before they decide to ditch the glory-hole and get together. Dylan wants to try taking it so he bends over for Dante, who eases his cock into Dylan's virgin hole. Dylan winces from the pain at first but in no time he's pushing back against Dante's rod, begging him for more.<br/><br/>Dante fucks him hard from behind, but decides to switch it up one more time and let Dylan have what he came for. Dante mounts Dylan out in one of the pews, grinding against his cock and busting his nut as Dylan enjoys every minute of it, pulling out and blasting Dante with his seminal load, and vowing to leave his wife as soon as he gets home. Dante tells him to slow down and think about it a little, realizing he's created a cock-hungry monster. <br/><br/>Enjoy! ",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Dylan Knight",
      "person_id": 31577
    }
  ],
  "release_date": "2016-01-08",
  "scene_id": 80753,
  "series": "NDO - 4628 - Dante Martin & Dylan Knight",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "Glory Hole",
    "HD Movies",
    "Hardcore",
    "Jock Strap",
    "Masturbation",
    "Oral"
  ],
  "title": "Cheating Faith: The Bigger, The Better"
}