{
  "collections": [
    "Next Door Twink"
  ],
  "description": "It's tough for a young man growing up without a solid father figure.  It's a good thing sweet Jackson Cooper's mom is together with Damien Michaels now.  Jackson sees Damien as such a strong, mature guy.  What Jackson doesn't know about Damien, is that he used to hook up with a few of his fellow frat buddies in college.  Now, as Jackson has just been caught by Damien, masturbating to gay porn, Jackson feels he should open up to Damien about some feelings he's recently been having.   As Jackson explains to Damien that he might be attracted to guys, Damien's ears perk up and his dick begins swelling.  And when Jackson explains that he's more interested in older guys, Damien comes up with an idea.  Damien tells Jackson that what he's feeling is normal and ok.  He swears he won't tell his mom, and brings Jackson in for a hug.  But as the hug turns into something more, Jackson realizes his wildest fantasy is coming true! They start off with some passionate, deep kissing.  Jackson moves down Damien's body, unbuttoning his shirt, and kissing all over his chest and stomach.  Then Jackson decides to see what a dick tastes like for the first time.  Damien guides him in his exploring.  Then Damien returns the favor by slurping on Jackson's stiff, virgin cock.  What a sensation!  Jackson can't believe Damien is naked and sucking on his dick. After some 69ing, Damien has Jackson sit on his dick and ease It into his super tight hole.  It's not easy at first, but Jackson works up his pace and can't believe how good it feels!  Join this learning experience and find out what happens when a sweet boy finally finds a loving fatherly figure.",
  "models": [
    {
      "name": "Damien Michaels",
      "person_id": 37846
    },
    {
      "name": "Jackson Cooper",
      "person_id": 38267
    }
  ],
  "release_date": "2016-02-09",
  "scene_id": 80859,
  "series": "NDT - 8310 - Damien Michaels & Jackson Cooper",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Brunette",
    "Climax",
    "Condom",
    "Facial",
    "Facial Hair",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Tattoo/Piercing",
    "Twink",
    "Uncut cock"
  ],
  "title": "Fatherly Figure"
}