{
  "collections": [
    "Active Duty"
  ],
  "description": "Looks like we have Ivan back out in the battlefield and this time with Allen Lucas. Allen has been a soldier with us testing out some recruits as well and finally we got these two muscle studs together for a war story you won't ever forget.<br> <br> Last time we saw Ivan with another soldier it was Brad Banks who got to squeeze his fat cock into that smooth ass of Ivan's. Ivan never had so much fun sucking on that meaty dick let alone having it deep inside him.<br> <br> Allen is back to teach Ivan some new tricks this time around. Last time we saw him in the line of action was with Jerry Price and boy was that a show for the rookie. Allen knows how to bring the new recruits up to speed especially if it's their first time with another man. Allen had Jerry in the line of fire the whole time and even got his cock deep into Allen's ass just the way he likes it.<br> <br>  Once the pants are off Ivan wraps his mouth around Allen's stiff cock ready to suck and lick every inch of that rock hard dick. Ivan can't get enough of that cock as he deep throats it feeling Allen's balls on his face. Claude gets a great angle from above as the two hunker down in 69 position. Allen wants to be the first soldier to get fucked so he ready's his fellow soldier by deep throating him until he gags and lots of spit comes flowing off Ivan's now rock hard dick. Allen is a deep throat master just as good as any sniper hiding in the brush.<br> <br> Claude is up close and personal in the front lines with some amazing camera angles. You have to give it to him though because you never know when one of these soldiers is going to explode. Ivan is hard and ready to take Allen's eager ass for a trip no new recruit could handle. This scene is for Vets only as Allen gets a pounding with his legs spread extremely far just like hiding from machine fire. <br> <br> You never leave another soldier behind and that's why Allen takes charge and bends Ivan over to take a new position where he has the top view. Face in the bed with an enormous smile on his face Ivan loves how the cock is going in and out of his ass. Nothing like seeing these chiseled men go head to head for an ultimate climax no soldier would ever forget.",
  "models": [
    {
      "name": "Allen Lucas",
      "person_id": 37870
    },
    {
      "name": "Ivan James",
      "person_id": 37630
    }
  ],
  "release_date": "2016-01-03",
  "scene_id": 80936,
  "series": "AD - 56 - Ivan James & Allen Lucas",
  "tags": [
    "69",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Muscular",
    "Rim",
    "Rimming",
    "Smooth",
    "Tattoos"
  ],
  "title": "Ivan James & Allen Lucas"
}