{
  "collections": [
    "Active Duty"
  ],
  "description": "Now this is what it's all about, my friends.  This is an extremely special event!  It's Jerry Price and Quentin Gainz together, and I'll tell you why this is such a special encounter.  <br><br>Claude says that Jerry's wife is allowing him to get into some action with other dudes on camera, but she has apparently forbidden him any contact with females.  Quentin laughs and says he hopes she won't be angry when Jerry realizes he sucks a better cock than she does hahaha!  From Jerry's response, he's certainly not dismissing the possibility.  <br><br>When they pull their dicks out, Quentin does hesitate to brave uncharted territory by wrapping his mouth around Jerry's meat.  Not long into his first blowjob from a guy, Jerry, with that smile and wide eyes says, 'goddamn, I know what I've been missing out on now!' From then on, Jerry's cock gets increasingly harder while Quentin works his magic.  Jerry continues to have his mind blown more as each moment unfolds with his stiff erection inside Quentin's loving mouth.  <br><br>They move positions in the room after a little while, and finally Jerry is persuaded to kiss Quentin.  You just have to see the absolutely wonderful reaction both boys (and Claude) have after this kiss happens!  It's just a magical moment that I know I'll revisit on days when I need cheering up.  'Is he a good kisser,' Claude asks Jerry.  Jerry affirms, and asks Quentin, 'What about me, bro?' Of course, Quentin let's everyone know Jerry did so well. <br><br>And after that, Jerry was itchin' to push his limits even further.  'He's about to taste his first dick!' we hear from Claude, just before Jerry leans down and takes Quentin's hard cock between his lips.  He starts off a bit timid, but after a few minutes, he's up and riding! <br><br>Then Claude suggests they take things to an even more fun level, and the guys get into a 69 position.  This really gives Jerry a chance to find out what it's like to get into a symbiotic groove.  This is training that'll stay with him for the rest of his time here with us.  <br><br>And believe it or not, we work our way up to Jerry allowing Quentin to actually sit on his cock!  That's right, we have Jerry losing his man-on-man virginity, fucking Quentin's exquisite hole.  For this go-around, Quentin takes the reigns and bounces on Jerry, doing most of the hard work. <br><br>Well, I don't think I need to tell you how much I can't wait to see Jerry's Journey.  This is the beginning of what I hope will be a long, adventurous run with us here at Active Duty.  ",
  "models": [
    {
      "name": "Jerry Price",
      "person_id": 38068
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2015-12-27",
  "scene_id": 80948,
  "series": "AD - 54 - Jerry Price & Quentin Gainz",
  "tags": [
    "69",
    "Anal Sex",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "First Time",
    "Jerk Off",
    "Kissing",
    "Smooth",
    "Straight",
    "Tattoos"
  ],
  "title": "Jerry Price & Quentin Gainz"
}