{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Brenner Bolton is in need of some protective eyes at his residence, so he's called a specialist out to install some security cameras around the yard. Phenix Saint has seen a lot of things in his time as a surveillance specialist, but as he installs the final cam by the front door, one image in particular catches his attention: that of Brenner standing in the doorway with his cock in his hand. It seems Brenner's insatiable lust has over-taken his sense of decorum, and so Phenix opens the door to find his customer jacking off in the entry-way. With a look, Brenner can tell that Phenix is picking up what he's putting down, and with barely a word between them, Brenner finds himself sucking Phenix off in full view of the front door cam. Phenix is hard as a rock and so Brenner suggests they move inside to be more comfortable. Once inside, both guys come out of their clothes, laying side by side inverse as they 69 each other. Brenner can feel Phenix's hard cock sliding down his throat but he really wants is to feel it deep inside him, so he bends over as Phenix pushes his dick all the way in to the base of the shaft, pounding Brenner's hot ass without regard. Phenix grabs Brenner by the shoulders as he pulls himself closer, fucking him hard from behind before switching up for some mounted cowboy action. Brenner grinds and bounces on Brenner's cock as he strokes himself, before Phenix takes matters into his own hands, flipping Brenner over and banging him missionary as Brenner spits his hot load all over himself just as Phenix pulls out and coats Brenner with his own load. Sitting there cum covered, Brenner's boyfriend sees them through the window and bangs on it angrily. Looks like Brenner better figure out how to use those security cameras sooner than later.Enjoy!",
  "models": [
    {
      "name": "Phenix Saint",
      "person_id": 4914
    },
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    }
  ],
  "release_date": "2016-01-22",
  "scene_id": 80958,
  "tags": [
    "Anal Sex",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Masturbation",
    "Muscular",
    "Tattoo/Piercing"
  ],
  "title": "Deep Surveillance"
}