{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Jack Hunter has a dark secret.  He must always be careful when daring to indulge his deep, lustful yearning.  Today, he's plotted a course of events: first, his wife will leave for work.  Next, he'll notify one Markie More that the coast is clear.  Then, he'll simply wait.  Once Markie arrives, the fun can start.  You see, Jack likes to have his tight hole banged nice and hard by a firm, bare cock.  Markie has no problem pounding Jack's hungry ass.  From the pictures in Jack's email, Markie was thrilled to help this poor, unsatisfied married guy get what he needs.  And when Markie showed up, Jack knew he had scored a serious hunk.After leading Markie to the master bedroom, Jack removed his wedding ring.  'You take off your ring before you get fucked?' Markie asked with a wry smile.  It's just something that allows Jack to be fully in the moment as he takes that stiff erection in his mouth and ass.  He likes to enjoy being fucked, without any distractions that may remind him of his wife.Markie started out by undressing Jack, laying him on the bed, and feeding him dick.  Both guys became quite hard.  Then Markie leans in to get a mouthful of swollen cock for himself.  They 69ed for a while before Markie decided to lick Jack's hole for a while.  He wanted to make sure it was ready for what came next.Markie stood up and slid his bare cock into Jack's sweet, tight hole.  In and out, and in and out, he repeatedly pulled his throbbing erection all the way out, then plunged it back in deep.  Jack couldn't believe how bold Markie was, fucking him without inhibition.  He could feel Markie was being guided by raw lust.Join them and find out just how intense it gets when a married man arranges to be pounded by the thick, swollen, BARE cock of a stranger he met online.",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Jack Hunter",
      "person_id": 48318
    }
  ],
  "release_date": "2016-01-06",
  "scene_id": 81013,
  "tags": [
    "Anal Sex",
    "Ass Play",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Muscular",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "She's gone...Breed My Hole"
}