{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Derrick Dime loves his boyfriend, Lukas Grande, very much.  He tries hard to do romantic things, like leave rose petals around their bed, make homemade cards with love poems inside the fold, and of course, make fires in the den for them to enjoy together. When Lukas arrives home on this particular blustery afternoon, Derrick has just finished stoking the flames up to a nice roar.  Logs crackle as Derrick welcomes his handsome man home and sits him down in front of the warm blaze.  'This fire is making me really hot,' Derrick tells Lukas.  Lukas, a bit confused, tells Derrick that he's not surprised and it's really not that hot, but Derrick interrupts in order to clarify what he meant.  Derrick was trying to tell Lukas that his cock is becoming plump, as it so often does around the holidays, and that he would like Lukas to suck it.  Lukas realizes what his guy was talking about as the two press their lips together and smooch passionately.  They remove each other's clothes and Lukas moves down and takes Derrick's behemoth, swelling dick into his mouth.  Derrick enjoys the warmth he was craving, just in the right place. After a while, Lukas lays down on the leather bench they had been using, and lets Derrick do some deep sucking for himself.  Lukas loves to watch his handsome Derrick bob on his rock hard erection.  Then Derrick sits on the bench and Lukas squeezes Derrick's huge boner into his tight, eager hole.  Get together to enjoy the Season's warmth with this happy, horny couple as they make the most of a chilly, windy day.  Nothing beats the comforts of a roaring fire and a good, loving fuck from the guy who loves you most.",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Lukas Grande",
      "person_id": 38320
    }
  ],
  "release_date": "2015-12-16",
  "scene_id": 81018,
  "series": "NDR - 4 - Derrick Dime & Lukas Grande&#65279;",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Climax",
    "Facial",
    "Facial Hair",
    "Gay Porn",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Raw Romance"
}