{
  "collections": [
    "Active Duty"
  ],
  "description": "Our Veteran Quentin Gainz is back with a new recruit who has never been with a man before but ready to explore all options. We broke Guy in with a very sensual solo and now hes back to feel how a real soldier handles the front lines. Guy will be working his way through this until hes comfortable enough to give Quentin what hes been waiting for.<br></br>Claude gives them the run down and lets the soldiers loose on each other at their own pace. Quentin is not shy at all and Guy has come a long way from his solo cause we thought he would take some time before he let Quentin on his cock but nope right off the bat Guy asks him if hes ready to suck on his cock and of course Quentin does not hesitate. Last time we say Quentin riding a fellow recruit was with Allen Lucas and we all know how great that was seeing his ass get rimmed and plowed. <br></br>After some extensive cock sucking from Quentin and some amazing deep throating skills that almost sends Guy over the edge the flip switches and Guy tries his first time sucking on a sexy meaty stick. Right off the bat he's a pro and Quentin can't believe how good he is for a rookie. <br></br>Guy is fully packed with a beautiful hard dick as he aims for a direct shot into Quentin's eager ass awaiting the penetration. Nice and slow he enters for the first time and he is amazed how great it feels. The smooth bare skin pushing open his wet hole and wrapping back around his cock as Guy pumps deep and hard into Quentin..<br></br>Claude never lets a good moment go to waste and shows off the beauty in a few camera positions as the two sexy men fuck around the room.<br></br>The pounding is long and hard but every soldier needs a break so these two hunker down next to each other to stroke out their edged up balls releasing some of the biggest loads we have seen yet.<br></br> Enjoy!",
  "models": [
    {
      "name": "Guy Houston",
      "person_id": 38217
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37369
    }
  ],
  "release_date": "2016-01-10",
  "scene_id": 81031,
  "series": "AD - 58 - Guy Houston & Quentin Gainz",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Deep Throat",
    "Duo",
    "First Time",
    "Jerk Off",
    "Smooth",
    "Straight",
    "Tattoos"
  ],
  "title": "Guy Houston & Quentin Gainz"
}