{
  "collections": [
    "Next Door Raw"
  ],
  "description": "When freshman pals, Bridger Watts and Rod Peterson, receive invitations to pledge for the coolest fraternity on campus, they're stoked!  But will NDX really offer everything they've heard about through myths and legends?  Will there really be unlimited chicks to bang?  Frat chairmen Markie More and Derrick Dime are showing them what really goes on behind the closed Greek Row doors.  Upon arrival at the NDX house, Markie More is very short with the boys, telling them to go into the living room, strip down to their underwear, and wait for instruction.  Moments later, NDX President, Derrick Dime shows up in a hooded cloak, ready to begin the pledge test.  Rod and Bridger are blindfolded, so all they hear are Markie and Derrick's voices.  They're instructed to hold each other's dicks, which seems very strange at first.  Then, after failing to correctly answer a series of trivia questions about the ancient order of NDX, Rod and Bridger are required to lick Markie's and Derrick's asses!!! They get in there deep, making sure to please the NDX elders so they'll be accepted into the brotherhood.  Next, the blindfolds come off and the blowjobs begin.  Bridger and Rod suck the elder dicks as a rite of passage.  Once Markie and Derrick reciprocate, Rod and Bridger begin feeling more confident about their chance of become new members of NDX. The four are soon on the couch.  Derrick squeezes Bridger's massive, bare cock into his tight hole.  The guys can't believe they're doing so well at this grueling pledge initiation!  What a wild ride so far!  Derrick bounces on Bridger's stiff erection, and jerks Markie and Rod at the same time.  Once the boys realize how good this activity actually feels, they forget for a while that this isn't supposed to be so much fun!   Next, Derrick gets down on all fours and lets Markie pound his sweet hole for a while, to let the new recruits know exactly what a proper fucking looks like.  Then, Bridger takes a turn and, despite being nervous, does a great job of banging the frat president's tight ass.   And to cap off the whole pledge test, Derrick sticks his hungry hole up in the air and lets each guy fill it with their hot, meaty cum loads.  Find out if Bridger and Rod make the cut in this wild, unpredictable four-man adventure, where a couple of excited freshman are getting a lesson in who rules the school!",
  "models": [
    {
      "name": "Derrick Dime",
      "person_id": 32560
    },
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Rod Peterson",
      "person_id": 37677
    },
    {
      "name": "Bridger Watts",
      "person_id": 38083
    }
  ],
  "release_date": "2016-02-03",
  "scene_id": 81034,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Facial Hair",
    "Fraternity",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Orgy",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Becumming Brothers"
}