{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "When Jake Karhoff approached Johnny Riley at the gym and suggested he could be a model with the right portfolio, Johnny never expected to be ass out in a jock strap in Jake's studio, but that's where he finds himself. Johnny can feel the hunger in Jake's gaze as he snaps his photos, and can feel the desire in Jake's touch as he re-positions Johnny on a rolling chair. Jake feels the work Johnny has been putting in at the gym as he runs his hands down Johnny's back, but what he really wants is to plunge is tongue deep between the cheeks of Johnny's hot ass.</br><br>Jake makes his play, and can sense Johnny is hesitant, but he assures Johnny this is the quickest way to become a real model, taking advantage of the newbie's naivete, and Johnny relents. Instantly Jake begins kissing down Johnny's back, spreading him out on the chair and diving deep into Johnny's virgin ass with his mouth. Johnny doesn't know what to expect but must admit Jake's mouth feels amazing, so when Jake turns him over and pulls his cock out of that jock strap, Johnny decides to just go with it. Jake sucks him off until he's hard as a rock, before standing up to give Johnny his first taste of cock. Johnny sucks on Jake's balls, tonguing him from underneath and then downing Jake's rock hard dick all the way to the base, spitting on the head as he fondles Jake's balls. Jake is nice and hard now, so he bends Johnny over and fucks him hard from behind, plowing him into the back of the chair before turning him over and mounting him. Johnny fucks Jake reverse cowboy as Jake strokes himself. He's almost ready to burst when Johnny pulls out and blasts his face with a dripping load that Jake takes to the face like a champ, stroking himself all the while and launching his load onto his stomach as Johnny's cum drips from his face. </br><br>Johnny decides right then and there that the modeling life is for him.</br><br>Enjoy!",
  "models": [
    {
      "name": "Jake Karhoff",
      "person_id": 37028
    },
    {
      "name": "Johnny Riley",
      "person_id": 38266
    }
  ],
  "release_date": "2016-02-11",
  "scene_id": 81095,
  "series": "NDB - 4637 - Jake Karhoff & Johnny Riley",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Pose For Me"
}