{
  "collections": [
    "Next Door Originals"
  ],
  "description": "As Luke Milan stands bound and blindfolded at interrogator Johnny Torque's request, it occurs to him that he may be fucked, figuratively speaking. After all, desertion is not a crime the military takes lightly, and Johnny seems to have a particular hard about getting Luke to confess his treacherous behavior. But when Johnny rips Luke's shirt off of him and gives his tanned chest a smack and a pinch, it finally dawns on Luke that he might be fucked literally, as well, which is definitely something Luke has some experience with. Johnny slaps at Luke's cock, gripping it and man-handling it before falling to his knees and downing Luke's huge dick. Johnny's nearly choking himself as Luke's cock swells to maximum density, before throwing his prisoner onto the ground and having him return the favor. Luke sucks Johnny's dick like his freedom depended on it, but Johnny isn't letting Luke get off so easily, so he bends him over the interrogation table and proceeds to pound him from behind, smacking Luke's ass as he fucks a form of punishment out of Luke. Luke mounts Johnny's dick, bouncing up and down as Johnny sits in a chair, before Johnny throws him onto the table for one final push, fucking the cum out of Luke as he lay on his back, and then absolutley blasting Luke in the face with a thick load of soldier jizz. Luke assumes he's free to go, but now that Johnny knows he's got a willing fuck slave, he orders the guards to take Luke back to his cell for future 'interrogation'.",
  "models": [
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Luke Milan",
      "person_id": 27174
    }
  ],
  "release_date": "2016-02-05",
  "scene_id": 81094,
  "series": "NDO - 4636 - Johnny Torque & Luke Milan",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Big Dick",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Military",
    "Oral",
    "Smooth",
    "Tattoo/Piercing",
    "Uniform"
  ],
  "title": "Dirty Interrogation"
}