{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Garrett Cooper heads down the dusty old road leading to his parents' farm, he sees a wayward soul by the side of the road. Dirty, dusty and tired, Markie More has been walking for days and looks like he could use a nice bath and warm place to rest his head, and while Garrett can only extend so much hospitality, he offers what he has to the stranger in need. As Markie rinses off, Garrett spies the stranger from the barn, and Markie can feel a set of eyes on him. After washing off, Markie finds Garrett in the barn and can sense some nervousness. Markie asks him if he ever brings girls back to the barn and Garrett tells him there aren't many available, so Markie asks him about guys. Garrett gets even more nervous, and Markie prods him, reaching out and running his finger across Garrett's fly. Garrett stutters and stammers, but Markie has already got his cock out and he shoves it in Garrett's mouth. Garrett doesn't even offer resistance, immediately downing Markie's cock and going to town on it, sucking off this stranger in his parents' barn. Markie shoves his cock deep down Garrett's throat, putting his hands on Garrett's head and pushing him all the way down on it, before pushing Garrett up against a ladder and eating out his virgin ass. Garrett strokes his cock as Markie tongues his hole, standing up as he strokes his hard cock to show Garrett what he's about to take. Garrett is still nervous but goes along with it, as Markie slides his dick deep inside Garrett, who bends over more to accomodate Markie further. Markie pounds Garrett's ass from behind, before moving to a chair and letting the farm boy take a ride on his plow, Garrett grinds on Markie's dick but what he really wants is to have a turn for himself, so he asks Markie if he can fuck him, and Markie says yes. Garrett bends him up against the side of the barn and proceeds to thrust away, fucking for as long as he can before he spills his load, as Markie stands up and blasts him with a load to the face. As both guys stand there sweaty and covered in cum, it becomes obvious they'll have to clean up again before the day is done.Enjoy!",
  "models": [
    {
      "name": "Markie More",
      "person_id": 32875
    },
    {
      "name": "Garrett Cooper",
      "person_id": 37542
    }
  ],
  "release_date": "2016-02-04",
  "scene_id": 81093,
  "series": "NDB - 4635 - Markie More & Garrett Cooper",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Blonde",
    "Brunette",
    "Climax",
    "Condom",
    "Deep throat",
    "Facial",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Rimming",
    "Tattoo/Piercing",
    "Twink"
  ],
  "title": "Dirty Hitchhiker"
}