{
  "collections": [
    "Icon Male"
  ],
  "description": "Nick Capra types away at his novel, but his writer's block is getting the best of him. Distracted, he calls down to the concierge for assistance with his fireplace. Hot young jock Andrew Fitch comes to give him a hand. It isn't more than a minute before the problem is found. Flipping the switch to the gas, the flames spring to life. Having solved the problem, the young man leaves. But, it isn't long though before boredom creeps in, his mind wandering to the hot young man who came by to help him out.<br><br>Hatching a plan to have him come by again, Nick hides his phone charger and calls back down for assistance. He convinces the young man to come by, have a drink and read some of his work. Andrew is surprised, but he really enjoys his writing, having mis-judged him by his fit muscular body. <br><br>Conversation turns to life, love, marriage and missed opportunities. Nick reaches over and rubs the young man's shoulders, his hand stroking up and down his neck. Leaning in for a kiss, their eyes both close they make out, their hands both exploring the bulges in their pants. Their shirts come off in the breaks between passionate kissing and Andrew's lustful eyes yearn for more of the writer's hulking body and soft lips. Nick strips the younger married man of his pants, releasing his long hard rod from it's material cage. Nick takes the member into his mouth, playing with his balls before standing to receive the same treatment from him. Andrew lays the studly man down on the couch, and sucks his big thick cock. Andrew doesn't waste any time, and explores the space between the writer's muscular half globes.<br><br>Teasing Nick with his dick, he pushes into his ass, slowly, loosening him up with his thick hard cock. Nick loves every inch, asking for more and more as he gets pounded by Andrew's thick cock. They explore position after position before Andrew fucks Nick on his back, rubbing his hairy chest and fucking him deep and hard. Nick climbs up on Andrew, bouncing up and down on his stiff cock. Nick cums first, shooting thick cum out onto his stomach. His hot load spraying up sends Andrew into an uncontrollable body orgasm, his load splashing up on his chest and stomach.",
  "models": [
    {
      "name": "Andrew Fitch",
      "person_id": 36116
    },
    {
      "name": "Nick Capra",
      "person_id": 35574
    }
  ],
  "release_date": "2016-01-21",
  "scene_id": 81104,
  "series": "Straight Boy Seductions 2",
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "Hairy Guys",
    "Oral/ Blowjob",
    "Safe Sex"
  ],
  "title": "Straight Boy Seductions 2"
}