{
  "collections": [
    "Icon Male"
  ],
  "description": "After going through a rough breakup, poor depressed Brendan Patrick decides to have a drink at a bar. Sitting on the stool next to him, Jaxton Wheeler, throws a casual glance at Brendan. Seeing how unhappy Brendan is, he takes that opportunity to invite him over to his place to watch the game. Brendan respectfully rejects his offer and tells Jaxton that he doesn't follow sports. Refusing to give up, he introduces himself to Brendan and wonders why he's never seen him at this bar before. The dejected bar patron next to him tells him about the breakup and how difficult it has been on him. To take his mind off of his bad situation, Jaxton challenges him to a game of pool.<br><br>After defeating his challenger at this friendly game of pool, Brendan decides to call it a night. He tells Jaxton that he needs to find a place to stay for the night, because his friends can't accommodate him anymore. Jaxton offers to let him crash at his place, and would definitely appreciate the company. Brendan is wary of the idea of staying at a stranger's house, but knows he could use the help. He decides to take Jaxton's offer, and they both leave the bar together. <br><br>At the house, Brendan is getting ready to go to bed. Alone in his room, he takes off his clothes, leaving nothing on but his underwear, and gets under the bed sheets. Seconds later, Jaxton walks in and starts to undo the buttons on his shirt. Confused to why he is undressing himself there in front of him, Brendan asks if this was the room he was meant to sleep in. The hulking muscular host gets under the bed sheets next to Brendan, stating there's more than enough space for both of them there. <br><br>Trying to overlook this, Brendan turns over on his side of the bed and closes his eyes, but a hand placed on his body keeps him awake. Then, he feels a pair of lips kissing him on the neck. Brendan doesn't know if he should say anything. He is unsure whether he likes it or not. The hand starts to move further down Brendan's body, reaching for his cock. Giving in to the temptation, Brendan turns around to look at Jaxton, but before he could say anything, Jaxton places his lips on Brendan's, and they begin to make out. Placing his hand over Brendan's crotch, he feels this straight boy's hard cock. They both remove their underwear and Brendan decides to take it further. Going down on this stranger's hot dick, he puts it in his mouth, sucking it, unsure. Then grabbing Brendan using his big muscles, he throws him on his back. Now it's his turn to please Brendan by sucking on his cock. <br><br>After his discovery, seeing how this straight guy enjoys getting a blowjob by another man, Jaxton makes out with him some more as his cock slowly penetrates Brendan's virgin hole. Once inside of him, nothing stops the powerful seducer from giving this straight boy a good pounding, one which no doubt will leave him begging for more! Brendan's moaning is only getting Jaxton more excited and motivates him to keep fucking him in as many ways as possible. When the boys are ready to ejaculate, Brendan lays down next to Jaxton. Both are jerking off until they cum all over Jaxton's hairy body. Tonight will finally mark the first night of restful sleep since his breakup.",
  "models": [
    {
      "name": "Brendan Patrick",
      "person_id": 36118
    },
    {
      "name": "Jaxton Wheeler",
      "person_id": 38281
    }
  ],
  "release_date": "2016-02-11",
  "scene_id": 81107,
  "series": "Straight Boy Seductions 2",
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "Hairy Guys",
    "Jerking Off",
    "Muscular Guys",
    "Oral/ Blowjob",
    "Safe Sex"
  ],
  "title": "Straight Boy Seductions 2"
}