{
  "collections": [
    "Icon Male"
  ],
  "description": "The whole gang is out playing sports, and Kory Houston gets hungry, and decides to head back to the house with Professor Rodney Steele. Chatting on the couch with his Dad's mentor they chat about how they're similar. Rodney reaches out to the boy's thigh, caressing it slowly, touching each other unsure at first. Making out, Kory holds the professor close, their lips intertwined. Stumbling from the couch into the bedroom, Kory pulls at the older man's shirt, stripping it off his muscular frame. They kiss deeply, their excitement is palpable, both breath heavy in this moment of passion. Rodney reaches into Kory's pants, playing with his sizable bulge before climbing up onto the boy, feeding him his lengthy dick. Shoving it to the back of his throat, the boy gladly chokes on it.Switching things up, Rodney tears off the boy's cloths and briefly swallows his dick before getting into a passionate 69.  Sucking on his dick, balls and rimming his smooth ass, Rodney pulls the boy on top of him, and rubs their shafts together. This frotting has them both bursting with excitement and Kory humps down into him. Rodney climbs over the boy, fucking him doggiestyle, pushing his long meaty cock into the young man's ass. Pumping it in and out, Kory moans in ecstasy as he gets fucked, taking his dick like a champ. Rodney pulls the young man into him, their bodies pressed against each other in full body contact as he penetrates him from behind. Laying on top, he pounds his boy hole before laying the boy onto his back. Fucking him with stiff and hard strokes, he pounds him until Kory shoots his cum onto his toned stomach. Pulling out of him, Rodney cums onto him, kissing him with deep satisfaction.",
  "models": [
    {
      "name": "Kory Houston",
      "person_id": 37898
    },
    {
      "name": "Rodney Steele",
      "person_id": 37971
    }
  ],
  "release_date": "2016-02-02",
  "scene_id": 81109,
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Masturbation",
    "Older on Younger",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Fathers And Sons 3, Scene #02"
}