{
  "collections": [
    "Icon Male"
  ],
  "description": "After his wife catches him jerking off to gay porn, Brendan Patrick visits his therapist, Rodney Steele. Brendan is ashamed and afraid his life is over. To help him get to the root of his troubles, Rodney asks a series of questions. Their discussion leads to no definitive answer, and the question still remains; Why does Brendan prefer to watch two men have sex? Rodney puts forward the suggestion to conduct an unorthodox experiment to separate theory from practice. Standing, he instructs his patient to watch closely what he's doing. Brendan keeps his eyes fixed on his doctor as Rodney strokes the front of his pants. Confused at first, Brendan can't help but look away, increasingly though he's drawn to the action in front of him. Massaging the front of his pants, Rodney's bulge builds in length and clearly creates a tent. Dropping his trousers, he pushes his underwear to mid-thigh. Brendan gazes down at the long hard dick in front of him. Inching closer to the stiff rod in front of him, he's pulled into it by his doctor. Feeling an incredible amount of excitement, he sucks the member up and down. Taking a moment to look at the massive dick before him, he strokes it furiously between moments of intense sucking. It glistens in the pale light of the psychiatrist's office. Stroking his patient's hair, he pulls his Brendan onto his dick, and pushes his cock all the way to the back of Brendan's throat. Excitement clouds Rodney's judgment and he moves in for a powerful kiss. Experiencing the soft lips and chiseled features of his patient first hand, he reaches into his pants. Stroking it for a moment, he bends forward to suck on his dick. Switching places, with lust in his eyes, Brendan grinds his ass onto Rodney's hard cock. Rodney teases Brendan's hole, pushing it in only partway at first, before building in intensity, his hips push his full length into his patient's waiting hole. Brendan finally breaks through the barriers holding him back and achieves a monumental breakthrough.Brendan receives tender loving from his doctor, whose hard cock probes Brendan's virgin insides. Reaching around, the good doctor jerks his patient's. Helping him reach orgasm is the best part of his treatment. Cumming on Brandon's chest, Rodney finishes in a flurry of sweat and sweet satisfaction.",
  "models": [
    {
      "name": "Brendan Patrick",
      "person_id": 36118
    },
    {
      "name": "Rodney Steele",
      "person_id": 37971
    }
  ],
  "release_date": "2016-01-28",
  "scene_id": 81105,
  "tags": [
    "Anal",
    "Big Cock",
    "Closeted/Straight",
    "Cumshot/cum",
    "Doctor",
    "Hairy Guys",
    "Jerking Off",
    "Oral/ Blowjob",
    "Safe Sex"
  ],
  "title": "Straight Boy Seductions 2, Scene #02"
}