{
  "collections": [
    "Icon Male"
  ],
  "description": "Kory Houston and his Dad head up to the mountains to bond. His dad was never around, but when he got caught having sex with an older man in the school washroom his mother freaked. Maybe having a father-son retreat to the mountains would set the boy right. Getting to the site, they run into his Dad's old college professor, there with his son Armond Rizzo. After an evening of chatting in the cabin, the fathers and sons make plans to go out and collect biology specimens the next morning. Wanting to make it an early day they decide it's best if they all sleep over.Armond and Kory Houston are in bed, ready to head to bed early when they get to chatting about their lives. Armond tells Kory about the time he was at a party and hooked up with his friend's Dad, Tony Salerno.It was at a party, Armond and his buddy's dad had an immediate attraction and later in the party make their way to a secluded corner of the house, making out. Getting on his knees, Tony unbuttons the younger man's pants and starts worshiping the younger man's long tanned dick. Armond's bulging pecs and washboard stomach flex in pleasure as the older man works on his stiff throbbing cock. Tony is more than happy to help him get off, rubbing his ripped stomach as Armond massages his thick load from his hard dick.Telling Armond that the story is getting him all hot and bothered, Kory jumps at Armond's offer to tell him a bedtime story. As he climbs from one bed to the other, his pajamas are already tenting out. Armond notices, and starts rubbing his chest as he tells him his fairy tale bedtime story. As they make out, Armond pays close attention to Kory's nipples. He reaches into the tenting bottoms and Kory's dick twitches as the young biology major's hot tongue glides across his shaft. He takes his cut cock into his mouth, sucking it up and down. The boys kiss the other boy passionately; Armond's own long johns prominently tenting. It's Kory turn to suck on his prize, Armond's long uncut cock. He teases his foreskin, before deep throating his long dick. Armond plays with the beautiful ass in his face, tonguing his hole, before Kory takes his turn playing with Armond's. Kory gets the hole wet before plunging his long cock into his hole. Kory pounds him, taking him to town, Armond pushing back into him, kissing him while the tall beautiful man slams his hungry ass.Riding him, his cock hard Armond climbs off Kory, flip-fucking him. From a push-up position, he uses every muscle in his toned core. Kory moans with pleasure as Armond's big dick slams his awesome young hole. Blowing his load all over his stomach, Armond's cock massages him from the inside as he pushes into him slowly. Pulling out of him Armond cums onto Korey's smooth stomach, his cum leaking out from behind his lengthy foreskin. Smearing the cum between them, they kiss goodnight.",
  "models": [
    {
      "name": "Armond Rizzo",
      "person_id": 35573
    },
    {
      "name": "Kory Houston",
      "person_id": 37898
    },
    {
      "name": "Tony Salerno",
      "person_id": 37744
    }
  ],
  "release_date": "2016-01-26",
  "scene_id": 81108,
  "series": "Fathers And Sons 3",
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "HD",
    "Latino",
    "Masturbation",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Fathers And Sons 3, Scene #01"
}