{
  "collections": [
    "Icon Male"
  ],
  "description": "Armond and Nick are back at the cottage and are resting on the couch. Nick tells Armond how he enjoyed their day together. Armond agrees and is also satisfied about the specimens they found. He looks over to Kory's dad and likes what he sees. He places a hand on top of Nick's leg and thanks him for helping him out today, which meant a lot to him. They both stare into each other's eyes, unable to look away. Then Nick thanks him for the invite and says that it meant a lot to him too. Armond understands why he was his dad's favorite student. Armond sits closer to Nick and tells him that he would really enjoy kissing him, but is unsure whether that would be crossing the line. Nick confirms that it would. Armond looks away looking very upset. But Nick continues by telling him that you should do it anyways. Armond turns to look at Nick again, and then smiles. They both lean in and start to make out. Nick grabs Armond's ass and pulls him on top of him. Moving into the bedroom, Nick lifts Armond up and places him gently on the bed. As they make out, Nick removes Armond's shirt before taking his off. Nick's big muscular arms are wrapped around Armond's body. He takes off Armond's shoe, and starts to lick his foot, sucking every toe. Armond takes him turn by kissing Nick's hairy chest while Nick takes off own pants. Now that their clothes are off, Armond lays down on the bed and is sucking Nick's huge cock. Then Nick grabs the young boy's legs, swings them over Armond's head, and starts to eat his hole. This hairy dad knows how to uses his tongue to go deep inside Armond's hole to loosen it up. Nick rubs his cock over Armond's hole and teases Armond before fucking him. Then Nick places Armond at the head of the bed and slides his dick inside of him. After being fucked in many different positions, Armond places himself on top of Nick and cums onto Nick's cock. Nick puts his cock back inside of Armond some more before he jerk off and cums on himself.The dads and their sons are packing the car, getting ready for the drive home. Saying their goodbyes, they get inside their cars. Nick and Kory have decided to keep these events between father and son, a bond forever between them.",
  "models": [
    {
      "name": "Armond Rizzo",
      "person_id": 35573
    },
    {
      "name": "Nick Capra",
      "person_id": 35574
    }
  ],
  "release_date": "2016-02-09",
  "scene_id": 81110,
  "tags": [
    "Anal",
    "Big Cock",
    "Cumshot/cum",
    "DILF",
    "Daddies",
    "HD",
    "Hairy Guys",
    "Latino",
    "Masturbation",
    "Oral/ Blowjob",
    "Rimming",
    "Safe Sex"
  ],
  "title": "Fathers And Sons 3, Scene #03"
}