{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "As Bridger Watts rifles through his dinner options on a lonely winter's night, he stumbles across an email from his wife. Immediately he calls his friend Alex and requests a sit down. He confronts Alex with a print out of the email from his wife, detailing how she is having an affair with Alex's wife. Alex does not look very concerned, and tells Bridger that he's aware of the situation. Bridger seems confused, and Alex realizes Bridger's wife has not disclosed her sexual liasons with her husband. It's at this point that Alex lets Bridger know that he's bi-sexual, asking Bridger if he's ever considered sex with another man. He places his hand on Bridger's knee for consolation, but he can tell Bridger is confused and a little wary.<br><br>Alex eases Bridger's concern with a light touch on the face, and then begins to kiss at Bridger's neck. Still reeling, Bridger decides to go with it just to see what happens, as Alex slides Bridger's pants and shoes off of him, taking Bridger's cock into his mouth and beginning to suck him off. Bridger gets much harder than he would have anticipated, a cue that Alex takes as a sign to continue.<br><br>Undressing, Alex guides Bridger, kissing up his body and then watching as Bridger goes down on him, wrapping his lips around Alex's hard cock while he strokes himself off. Bridger seems to be increasingly more comfortable with the proceedings, so Alex mounts his friend and rides him, bouncing up and down on Bridger's virgin cock, as Bridger closes his eyes and takes in the sensation. <br><br>Passive pleasure is nice and all, but now Bridger hits his stride and decides to take control, turning Alex over and bending him up against he sofa, Bridger pounds Alex from behind, grabbing him by the shoulders and really fucking him hard, then finally turning him over one last time and banging him out missionary style as Alex strokes himself to orgasm, painting his own stomach with jizz as Bridger drenches Alex with his own secret load. Now at least, the husbands and wives are on equal footing, and Bridger couldn't be happier about the new arrangement.<br><br>Enjoy!",
  "models": [
    {
      "name": "Alex Greene",
      "person_id": 37421
    },
    {
      "name": "Bridger Watts",
      "person_id": 38083
    }
  ],
  "release_date": "2016-01-28",
  "scene_id": 81111,
  "series": "NDB - 4633 - Bridger Watts & Alex Greene",
  "tags": [
    "Amateur",
    "Athletic",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hairy",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Straight Men"
  ],
  "title": "Our Wives Are Cheating"
}