{
  "collections": [
    "Next Door Raw"
  ],
  "description": "This is the tale of a cock-loving boy with a wandering eye, and his protective, jealous boyfriend's BROTHER.  Yes, sometimes even the family of a significant other isn't off-limits...especially when there's a family member as hot as Zane Porter! When Johnny Riley meets his Zane for the first time, he tells his boyfriend, 'your brother is HOT!' And from that point, Johnny didn't stop imagining the ways he'd like to cheat with Zane.  But his boyfriend would hit the ROOF if he found out!  Oh well...accidents happen.It was an accident when Johnny and Zane ended up alone in the house at the same time.  Johnny's bf was at work, but left Johnny the key to the backdoor.  Zane was jerking his hard dick to a porno movie when Johnny came into the house and happened upon the nude and stroking Zane.  Zane jumped when he saw Johnny.  But Johnny used his killer instinct to stay cool and act quickly in order to take advantage of this incredible opportunity.  He sat down next to Zane and smooth talked him into letting Johnny suck his fat cock.  Zane acquiesced reticently, but once Johnny's wet lips were tightly wrapped around his throbbing erection, Zane was hardly protesting.  The porn continued playing as Johnny enjoyed his boyfriend's brother's nice, stiff dick in his mouth.  Zane lost himself in the moment, grabbed the back of Johnny's head, and began fervently thrusting his hard cock repeatedly upwards into Johnny's mouth, hitting the back of his throat.  Johnny liked this a lot.  Next, Zane bent Johnny over, doggystyle, and inserted his bare dick into Johnny's tight, waiting hole.  Wow, Johnny had never been fucked so raw and mercilessly before...it felt amazing!  He was beginning to realize he had bagged the wrong brother.  After some good, hard pounding this way, Johnny and Zane moved to the couch in the family room so they'd have a little more room to stretch out.  Johnny laid on his back and Zane fucked his sweet hole even more vigorously.  After a while, Johnny climbed on top of Zane's pulsating cock and took it for a wild ride.  Experience a forbidden, but ultra-sexy hookup between these two as passion becomes too strong to deny and the lines of appropriateness go out the window!",
  "models": [
    {
      "name": "Johnny Riley",
      "person_id": 38266
    },
    {
      "name": "Zane Porter",
      "person_id": 37299
    }
  ],
  "release_date": "2015-12-23",
  "scene_id": 81128,
  "series": "NDR - 2 - Zane Porter & Johnny Riley",
  "tags": [
    "Anal Sex",
    "Athlete",
    "Athletic",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Family Roleplay",
    "Gay Porn",
    "HD Movies",
    "Jerking off",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing"
  ],
  "title": "My Boyfriend's Brother"
}