{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Since the reunion a couple years back, Johnny and his old high school pal, JJ Knight, have been passionate lovers. In fact, they've moved in together and are planning on getting married! As they packed their things in the car this morning, Johnny received a phone call from Mark Long, also a friend from high school. Johnny forgot that Mark was planning a visit for this weekend! Johnny tells JJ and the two decide to stay home for the weekend and host their dear old friend, Mark.Mark is surprised to see his old friends involved together in a sexual relationship. He didn't know either of them even liked guys! Mark makes a trip to the store for beer, and as he's coming back to the house, he witnesses through a window JJ sucking Johnny's hard cock! He's surprised by the sight, and even more surprised that the scene made his own dick stiffen up.  Once he's back in the house, JJ notices Mark's boner and lets Johnny in on the swollen dick. Johnny likes what he sees and Mark decides to just go with the flow. 'Playtime, Daddy?' Johnny asks JJ. 'Whatever baby wants,' JJ replies, and the fun begins.First, Johnny uncovers Mark's enormous cock and wraps his lips around it, sucking deep. Soon, Johnny is bouncing on his boyfriend's fat erection and slurping down Mark's at the same time.  Not too long after, Mark is having a turn, sliding his bare, firm dick in and out of Johnny's tight hole.  These boys didn't get nearly this much action back in high school! It all cums together in an amazing finish, when Johnny lets his man and his old buddy pile drive his ass until they both erupt with pleasure all over Johnny's luscious hole!  Join these three as they get reacquainted by getting naked and fucking like they always wanted to back in school!",
  "models": [
    {
      "name": "Mark Long",
      "person_id": 18862
    },
    {
      "name": "Johnny Riley",
      "person_id": 38266
    },
    {
      "name": "JJ Knight",
      "person_id": 38286
    }
  ],
  "release_date": "2016-02-24",
  "scene_id": 81132,
  "series": "NDR - 11 - Mark Long, Johnny & JJ Knight",
  "tags": [
    "Anal Sex",
    "Ass to mouth",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "Facial Hair",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing",
    "Threesome"
  ],
  "title": "Double Playtime"
}