{
  "collections": [
    "Next Door Raw"
  ],
  "description": "There's no mystery about what goes on down at the Breeding House.  It's the city's most active bathhouse and Quentin Gainz has recently become a regular.  Johnny Torque and his partner in sexual adventure, JJ Knight, are visiting the place tonight for the first time. A little while after Quentin arrives and gets nice and comfortable with a big, anonymous cock in his mouth, courtesy of whoever's on the other side of the glory hole wall, Johnny and JJ enter the establishment.  As they're checking in at the front desk, Quentin happens to be taking a little break, having a look at the latest dudes to drop in.  He and Johnny lock eyes for only a few moments, but from that point, Johnny knows exactly whose hole he wants to breed.  They find Quentin inside and convince him to do what they say.  Soon, Quentin is switching back and forth between two enormous cocks.  He's only had dicks in his mouth before, and is very nervous these boys want more.  He's right.  After taking Johnny and JJ's stiff erections hard and deep in his mouth, Johnny bends him over and slides his bare cock into that tight, virgin hole.  This is NOT what Quentin had bargained for!  It's happening now, and Johnny and JJ wouldn't like it if he raised a fuss, so Quentin does his best to take their massive dicks in his tight ass.  After Johnny pounds his hole for a while, JJ takes a turn slamming him with his uncovered boner.  Join them as JJ and Johnny teach Quentin a lesson about proper behavior at a bathhouse.  You'll see Quentin realize in just what type of activity he's really become involved when these no-nonsense, RAW fuckers erupt their hot loads all over this gentle sweetheart who was just looking for a good time.",
  "models": [
    {
      "name": "JJ Knight",
      "person_id": 38286
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    },
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    }
  ],
  "release_date": "2015-12-30",
  "scene_id": 81130,
  "series": "NDR - 3 - Johnny Torque, Quentin Gainz & JJ Knight",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Deep throat",
    "Facial",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Tattoo/Piercing",
    "Threesome",
    "Uncut cock"
  ],
  "title": "The Breeding House"
}