{
  "collections": [
    "Next Door Buddies"
  ],
  "description": "Alex Tanner is about to get a taste of the real world, as landlord Bridger Watts has served him with a 7 day notice to either pay or vacate the premises. Alex is taken unawares, as his parents normally fund his lifestyle, but Bridger has just informed Alex that his parents have instructed Bridger they will no longer be financing Alex's debt, which leaves Alex between a rock and a hard place. Luckily for Alex, that hard place is located in Bridger's pants, which is something Alex knows all about. As he slides his hand across Bridger's thigh, he assures his landlord they can work something out, and as he unzips Bridger's trousers, it seems as though reality isn't the only thing young Alex will be tasting today. Bridger's cock falls out of his pants, semi-hard and ready for action. Alex takes it into his mouth and downs it as Bridger begins to come out of his clothes. Alex checks out Bridger's ripped arms and chest and gets horny just thinking about those big strong arms wrapped around him. But he doesn't have to imagine it for very long, as soon after, Bridger is bending Alex over, pounding him from behind and making sure he gets his money's worth. Alex takes every throbbing inch that Bridger has to dish out, mounting him and grinding his ass against Bridger's thrusts, as Alex jerks himself off and spews his load onto the floor below, before Bridger pulls out and coats his face with a load that just earned Alex at least 30 more days of occupancy. Enjoy!",
  "models": [
    {
      "name": "Alex Tanner",
      "person_id": 38001
    },
    {
      "name": "Bridger Watts",
      "person_id": 38083
    }
  ],
  "release_date": "2016-02-18",
  "scene_id": 81206,
  "tags": [
    "Amateur",
    "Anal Sex",
    "Ass Play",
    "Athletic",
    "Brunette",
    "Climax",
    "Condom",
    "Facial",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Jerking off",
    "Red Head",
    "Rimming",
    "Slim"
  ],
  "title": "Where's the Rent?"
}