{
  "collections": [
    "Next Door Originals"
  ],
  "description": "Markie More is not exactly thrilled at the thought of his mom dating the guy she is seeing, mainly because the guy's son, Brendan Phillips, always seems to be creeping on Markie. Though he can't prove it, Markie always gets the feeling that Brendan is undressing him with his eyes, and it makes the situation a little awkward. Such is the case as Markie's mom goes for the night, leaving Brendan and Markie all alone for the night. Brendan is stoked but Markie is visibly skeptical. As they begin to watch a little television, Brendan steals a glance over at Markie, eyeing his athletic build and muscles rippling underneath his clothes. Brendan feels his shorts get tight, and tells Markie he needs to use the restroom. On his way, he sees Markie's bedroom door ajar, and takes a quick peek inside, where he finds Markie's used jock laying on the floor. Looking over his shoulder to make sure Markie isn't suspicious, Brendan helps himself to a spot on the floor, massaging his cock through his shorts as he takes a full deep breath, inhaling Markie's odor and essence as his dick gets hard as a rock. Overcome, Brendan loses all sense of caution and pulls his dick out and begins to stroke himself off in Markie's bedroom. </br><br>Back in the living room, Markie notices that Brendan's been gone for quite some time, and calls out to him. When he hears no answer, Markie gets up to investigate, only to discover Brendan sitting in his room, half naked with wearing Markie's jock around his face. Obviously pissed, Markie immediately tackles Brendan onto the bed, asking him if his parents know what he's into. Brendan feigns ignorance as Markie seeks to punish him for the transgression, tying his hands behind his back with his ass up in the air. Markie asks him if this is what he wants, and the sly smile that steals across Brendan's face betrays his attempts to downplay his eagerness, and Markie realizes this is was Brendan's plan all along. Looks like it's gonna be a hard afternoon for both of these brothers.</br><br>Enjoy!",
  "models": [
    {
      "name": "Brendan Phillips",
      "person_id": 38107
    },
    {
      "name": "Markie More",
      "person_id": 32875
    }
  ],
  "release_date": "2016-02-19",
  "scene_id": 81272,
  "series": "NDO - 4640 - Markie More & Brendan Phillips",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Big Dick",
    "Big Loads",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Oral",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Sniffing His Jock"
}