{
  "collections": [
    "Next Door Raw"
  ],
  "description": "What a day for a daydream, and what a day to get fucked in the ass by Johnny Torque's throbbing, BARE cock!!  Brenner Bolton is a bit of a super fan.  He's seen all of Johnny's films and has yerked his healthy meat to each one, several times.  Brenner's friend Petey gave him a thick new dildo for Christmas and Brenner's trying it out while watching his favorite Johnny scene.  It's a three way and Brenner just lets his dick fatten up with little manipulation, until Johnny enters the scene.  Once Johnny, this time playing a nurse, is fucking the tasty Twink bottom featured in the scene, Brenner really gets to tugging his boner and slapping his hungry hole with his new toy.  After sucking the rubber dong for a while, he finally inserts It into his tight ass, fantasizing that it's Johnny Torque's fat cock penetrating him.  As Brenner bangs himself passionately, he suddenly realizes he's not alone.  Johnny is here with him.  Without any hesitation, he takes Johnny's dick into his mouth and feels it grow quickly into a fully-flared, raging erection, thriving in the moist, hospitable environment just inside his wet lips.  Johnny thrusts fervently in and out of Brenner's mouth, Brenner taking the hard cock with immense pleasure.  Before long, Johnny is returning the favor by slurping on Brenner's happy, stiff boner.  After just a bit of this, Brenner finds himself bent over his couch as Johnny pounds his raw dick into Brenner's tender, sweet hole.  This leads Johnny to sit down on the couch and allow Brenner to mount him and slide that firm, uncovered dong into his hole for more, harsh fucking.  In a seeming whirl of fog and movement, Brenner finds himself laying on his back on the floor, taking more punishment from Johnny's swollen, angry dick.  And just after they work up to a moment of ecstatic eruption, and share a blissful coalescing, he's back.  Brenner is awake again.  It seems to have all been a dream...but how is he covered in this much cum?!?!",
  "models": [
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    }
  ],
  "release_date": "2016-02-17",
  "scene_id": 81388,
  "series": "NDR - 10 - Johnny Torque & Brenner Bolton",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Big Loads",
    "Climax",
    "Deep throat",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Oral",
    "Tattoo/Piercing",
    "Toys",
    "Twink"
  ],
  "title": "I Dream of Johnny"
}