{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Johnny Torque and Dante Martin wrestle on Dante's bed, Johnny grabs for a pin and instead comes up with a handful of Dante's hard cock. Weirded out, Johnny sits up and asks Dante why he's hard. Dante tries to play it off that he just got worked up, but Johnny asks him point blank, 'Are you gay?' What commences can only described as a deeply introspective meditation on the meaning of life and/or sexual identity, but the end result is that Dante somehow ends up with his face shoved (not so) squarely into Johnny's crotch. If this all sounds confusing to you, then welcome to the enigma that is the mind of Johnny Torque. <br><br>As Dante tries to figure out how he got into this predicament, Johnny takes down his pants revealing his meaty ass, giving it a smack for good measure. Dante begins to suck Johnny off as Johnny fingers Dante's hole, before they flip over into a 69 and continue. With Johnny's dick nice and hard, and Dante's hole more than ready for a good fucking, Johnny gives it to Dante raw dog style, pounding him from behind as Dante moans from the pleasure of every bare inch sliding in and out. Dante mounts Johnny reverse and strokes his cock as he rides Johnny hard, grinding on his cock as Johnny runs his hands up Dante's back. The hair on the back of Dante's neck stands up as Dante reaches his shoulder blades, and Dante throws his head back in pleasure as Johnny flips him over to take final control of the situation. With Dante's legs in the air, Johnny pile drives Dante as Dante strokes himself off, cumming all over his own face just as Johnny pulls out and double drenches him.",
  "models": [
    {
      "name": "Dante Martin",
      "person_id": 31241
    },
    {
      "name": "Johnny Torque",
      "person_id": 8927
    }
  ],
  "release_date": "2016-01-13",
  "scene_id": 81386,
  "series": "NDR - 5 - Johnny Torque & Dante Martin",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Athletic",
    "Bareback",
    "Big Dick",
    "Brunette",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Masturbation",
    "Oral",
    "Smooth",
    "Straight Men",
    "Tattoo/Piercing"
  ],
  "title": "Are You Gay?"
}