{
  "collections": [
    "Next Door Raw"
  ],
  "description": "As Quentin Gainz navigates the back roads of his friend's vacation home, he spies a wayward drifter on the side of the dusty path. Zane Porter looks a bit tired from walking, and Quentin's car is a sight for sore eyes and feet. When Quentin offers him a ride, Zane doesn't even ask, 'Where to?' he just hops in the car. Back at Quentin's place, neither guy is interested in playing hard to get, and Zane asks Quentin if he regularly picks up strangers on the side of the road. Quentin assures him it's not a totally regular thing, but Zane is already too busy taking off Quentin's pants to hear the answer. Zane sucks Quentin off, who gets nice and hard before he unzips Zane's jeans to see what he's packing. As Zane unfurls his cock, Quentin thinks he's hit the lottery, and Zane is feeling lucky as well, choking out this stranger with his long cock, as Quentin deep throats Zane and begs for his cock.Zane is down to fuck but neither guy has a condom. Quentin mentions that he's into it if Zane is, and with that, Zane plunges his raw cock deep into Quentin's virgin ass, fucking him missionary as Quentin closes his eyes. He remarks that he's never had a raw cock before, and Zane pounds even harder, before shifting to let Quentin hitch a ride for a change. He bounces up and down on Zane's cock, grinding on it as he feels it pulse in and out of him, before Zane flips him over onto the sofa and proceeds to pound him out doggy-style, pulling out to wet Quentin with his load, and then shoving his cock right back in to finish the job, fucking the cum out of Quentin as he shoots his load off onto the table below, just in time before Quentin's buddy comes home to catch them in the act.Enjoy!",
  "models": [
    {
      "name": "Quentin Gainz",
      "person_id": 37574
    },
    {
      "name": "Zane Porter",
      "person_id": 37299
    }
  ],
  "release_date": "2016-02-10",
  "scene_id": 81387,
  "series": "NDR - 9 - Zane Porter & Quentin Gainz",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Caucasian",
    "Climax",
    "Facial Hair",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Muscular",
    "Oral"
  ],
  "title": "Hitch a Load"
}