{
  "collections": [
    "Active Duty"
  ],
  "description": "When Logan James came in and sat down to chat with Claude for the first time, I'm told he was a tad nervous, but was clearly excited about the prospect of stripping down and tugging his meat for a viewing audience.  Claude's impression was that Logan would be a perfect addition to our little platoon and our other recruits would be more than happy to welcome him into the fold...Active Duty style!After the usual chit chat with our boy Claude, Logan pulls off his gray camo underwear and begins fattening up his meat.  Claude starts out with a nice shot that frames Logan's sophisticatedly handsome-looking face and his swelling cock being jerked.  hungry recruit that loves to be fucked hard.  Well at least that's why MY fingers are crossed!!Next, Claude shoots over Logan's shoulder for what I like to call a 'stroker's-eye view.' Boy, what a excellent dick on this recruit.  Logan has oiled up that beautiful erection just perfectly and is, by this time, losing himself in the moment, enjoying that feeling when the dick grease is starting to warm up!  Claude then comes underneath Logan to show us a nice look at Logans balls.  This shot always makes me anxious for that hot load, but I know we're still just getting comfortable with this newbie.  We get some more action from Logan in his socks, while looking down on him on the couch, then we get another great underneath view, this time as Logan is on his feet.  Claude takes full advantage of this, and ends up swinging around to Logan's back side to get a nice look at his...well, backside haha!  And my goodness, what a strong derriere on this sexy recruit!  He has the type of ass that certainly begging to be pounded.  Before Logan erupts all over himself, Claude catches another great moment that showcases Logan's tasty-looking balls.  This is when I noticed how hot Logan's hands are!  They're masculine, but with a refined elegance...qualities I might guess of the hands belonging to a well-trained musician.  I guess his story checks out!",
  "models": [
    {
      "name": "Logan James",
      "person_id": 38363
    }
  ],
  "release_date": "2016-01-27",
  "scene_id": 81414,
  "series": "AD - 63 - Logan James",
  "tags": [
    "Big Dick",
    "Brunette",
    "Jerk Off",
    "Solo",
    "War Chest"
  ],
  "title": "Logan James"
}