{
  "collections": [
    "Active Duty"
  ],
  "description": "Most of you know how much I've been enjoying Ivan James, and I know everyone else has has been too.  He has a very special cute, spunky energy and a nice, plump ass to which I can't say 'no'!  This time, he's paired up with a less experienced recruit, Guy Houston.  But what Guy may lack in experience, he makes up for with passion!Just like he did with Quentin, Guy asked Ivan to wrap them soft lips around his cock, right from the get go.  Ivan suuuuure likes that suggestion and Guy's dick fattens up inside Ivan's mouth quickly.  'You sure do like a hard cock in your mouth,' Claude remarks to Ivan as he goes to town on Guy's luscious meat.  'Mmm hmmm!!' Then it's Guy's turn and we get to watch this wild man in action!  Guy really tosses his inhibitions out the window when he sucks cock, and it's a beautiful thing.  Boy, Ivan gets extremely hard during this intense slurping and Guy loves it.  The boys don't spend too much time before getting down to that good, hard fucking they've been looking forward to.  We know Ivan enjoys getting pounded hard, by fat erections, and now Guy sure knows it too haha!  We soon go to a tight shot of Ivan's precious ass getting fucked, as Ivan lays on his back.  Then we get a nice, wide look that includes Guy really having fun with this cute, energetic boy.  I really like the way Guy isn't afraid to get in there and dominate with his power.  Guy likes to fuck, and I'm certainly glad to have him back and jumping right into the line of fire.  I can't wait to see him paired up with another smaller bottom...perhaps Johnny Riley would enjoy receiving some punishment from this strong enforcer!Before Ivan climbs on top for a ride, Guy gets a few more mouthfuls of Ivan's big, swollen cock.  Claude moves in close to really show us that wonderful intensity from Guy.  Then, once Ivan mounts his new squad buddy, the action picks back up.  They do a bit more fucking, this time standing as Guy bangs sweet Ivan from behind.  Then, of course, the two finish side-by-side on the bed.  Both of these fine recruits are really great parts of the troop and I know we'll see some nice stuff from each of them in the near future.",
  "models": [
    {
      "name": "Ivan James",
      "person_id": 37630
    },
    {
      "name": "Guy Houston",
      "person_id": 38217
    }
  ],
  "release_date": "2016-01-31",
  "scene_id": 81460,
  "series": "AD - 64 - Ivan James & Guy Houston",
  "tags": [
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blowjob",
    "Brunette",
    "Duo",
    "Jerk Off",
    "Smooth",
    "Tattoos"
  ],
  "title": "Ivan James & Guy Houston"
}