{
  "collections": [
    "Next Door Raw"
  ],
  "description": "Brenner Bolton likes this local haunt because it's usually pretty easy to pick up here, but today the place seems particularly empty, which has him kind of bumming. Luckily, his fortunes turn around when Wesley Woods grabs the stool next to him, and when Wesley begins complaining about his boyfriend being out of town, Brenner realizes he's got this sad stud right where he wants him. Moments later the two of them are heading back to Brenner's place for a little night cap, as Brenner throws Wesley onto the bed. Wesley is a bit hesitant at first but before he can protest Brenner already has his pants off and his dick in his mouth. Wesley closes his eyes as Brenner gives him some very inspired head, deep throating this broken-hearted stranger as he positions himself for 69, hovering over Wesley's face as he grinds his ass on Wesley's mouth. Wesley tongues him nice and hard but Brenner is more interested in Wesley's big hard cock, so he mounts this stranger raw and goes to town, riding him reverse cowboy as he bounces up and down on it. Wesley then flips him over and they go at it missionary, as Brenner strokes himself while Wesley pounds away, fucking the cum out of Brenner who wets his stomach befroe pulling out and blasting this stranger with his much needed release, before shoving his cock right back into Brenner's waiting ass for round 2. <br/><br/>Enjoy!",
  "models": [
    {
      "name": "Brenner Bolton",
      "person_id": 34164
    },
    {
      "name": "Wesley Woods",
      "person_id": 38354
    }
  ],
  "release_date": "2016-01-27",
  "scene_id": 81477,
  "series": "NDR - 7 - Brenner Bolton & Wesley Woods",
  "tags": [
    "Amateur",
    "Anal Sex",
    "Bareback",
    "Big Dick",
    "Blonde",
    "Brunette",
    "Caucasian",
    "Climax",
    "Deep throat",
    "Gay Porn",
    "HD Movies",
    "Hardcore",
    "Masturbation",
    "Rimming",
    "Tattoo/Piercing"
  ],
  "title": "Happy Hour Hook-Up"
}