{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 7849
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This shit is fucking hot, dudes! Ever think your boyfriend's younger brother was hot?! Ever go there? Well this dude did. He decided to fuck his asshole ex boyfriend's younger brother for some well deserved revenge but after seeing the younger dude's cock, decided to let him do the fucking! This cock is pretty, just plain pretty. Perfect, thick, well-shaped schlong, with big balls and all!!! This hot out-doors scene starts with a tall, cute dude getting his nipples sucked on by the hungry younger dude as he is leaning against a fence with his arms behind his head. They decide to get more comfortable and make their way over to a lounge chair. This is when we find out that the younger dude, who we think is gonna be the bottom, pulls out his AMAZINGLY big, fuck stick! The other dude had no choice, who would pass up the chance to be this beautiful cock's fuck hole-Not many! The top, now the bottom, has a difficult time sitting on his ex boyfriend's brother's HUGE dick! As he lowers himself down on this big dick he moans: \"Oh damn,\" and cant stop himself from \"oohing\" and \"awing,\" totally worth it though, right?! Talented fuck hole this dude must have because he takes the whole dick all the way to its base and we hear the lovely sound of top dude's big balls slapping against the bottom's ass. Then they decide to fuck standing up and lean against the wall. The bottom pleads the top to: \"Fuck me!\" And fuck him, he does, pounding him out real good! Dude does get a taste of the younger brother's ass by tongue-fucking it, mmmmm, its a nice ass, yo. It all ends with 2 creamy, wet facials and them cleaning the cum off each other in the out door shower! All in all, this video is worth the fact that a relationship had to end, its too good of a fuck scene not to be shared",
  "models": [
    {
      "name": "Kaleb Carmo",
      "person_id": 20680
    },
    {
      "name": "Nathaniel Andrews",
      "person_id": 20682
    }
  ],
  "release_date": "2011-04-07",
  "scene_id": 2835751,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Backyard Boogie"
}