{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 7776
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "Verbal anyone?! This hot ass scene is so verbally hot that it would be hard to make it all the way through to the end before creaming all over the keyboard. Not only is the top dude verbally hot but the bottom dude is sooo fucking fine, just his face and bod are enough to j/o to! He looks like some hot white thug dude, you know the type! And he fits it to a tee \"bag!\" Pun totally intended! I don't think anyone could resist this dude. From start to finish there is hot verbal action! Starts off with the thug dude, who again, is soo hot, sucking his soon to be top's dick. The guy demands: \"suck on my hotdog!\" Sexy thug replies: \"yeah.\" He sucks good dick before the top demands: \"show me that ass!\" Thug obeys and reveals one tasty looking ass. I don't know which is better seeing his ass in his tight white underwear or seeing the actual booty! Shit is HOT! Thug dude is slim, toned and way sexy. He bends over and shows a nice set of low hangers and a slightly hairy ass crack! \"Just let me do this real quick,\" the top guy demands. \"I gotta get back to work,\" thug replies, bending over just the same. The dick on the top is nice but the star is the thug bottom. The top exclaims: \"Come on baby! You know how to do this-arch your back, ready?!\" As the cock slams into thug dude, he simply moans with pleasure. Yeah, dude likes his prostate poked! Cant blame him and the top is definitely good at his job. \"Push back into it, you've done this plenty of times!\" The next scene is so hot! Thug is on all fours and looks back at his top! His face all thug and cute like and the sweat glistening off his perfectly formed back and shoulders is totally dope! \"How you like that shit?\" the top asks and the reply is, of course: \"feels so good!\" Thug dude loves every inch of the cock that's imbedded into his ass and he moans the whole time until the top dude pulls his cock out of the warm, sexy ass and cums all over the thug's prefect little ass checks! Too bad the thug went back to women and snubbed the top dude. But, in revenge, this video is online and many a cock is thankful for that!",
  "models": [
    {
      "name": "Brenden Black",
      "person_id": 22460
    },
    {
      "name": "Perry Pierce",
      "person_id": 21848
    }
  ],
  "release_date": "2011-02-24",
  "scene_id": 2835511,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Hot Sausage"
}