{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 7800
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "FUCKING HOT! This video displays the sexual escapades of some seriously sexy men! So this supposedly straight guy goes to a friend of a friend for a massage. At first the dude didn't really think much about the fact that the dude about to give the massage was shirtless because it was outside and very hot, well, hot it was! And it only got hotter! This dude decides to suck his client's cock, right there on the massage table, outside and everything. The dude just goes with the flow, cause lets be honest, a mouth is a mouth, is a mouth! Right?! But this massage dude is SO fucking hot that things begin to escalate. The straight dude decides to \"experiment\" and begins sucking the massage dude's cock. And a mighty fine cock it is! Did I mention the AMAZING body on the masseur! We are talking cut like a fucking brick house! He is not just sporting a 6 pack, dudes got a fucking 12 pack! And his nipples! Oh my god! He has nipples that you could suck on for days! We are talking god-like, dudes! So one cock sucking session leads to another and before we, and the \"straight\" dude knows it, the hot masseur is poking the dude's ass! He doesn't even need to ask or anything. He is the kinda guy that anyone would let do whatever he wants. So Mr. Straight dude is not so straight anymore. He got pounded out good! You gotta check this video out. Five minutes into it and you'll be cummin' all over your computer screen and whats more is that the masseur, who was in the closet, turned the straight dude into a regular bottom bitch. However the hot masseur guy decided that one fuck session was enough and moved onto more experienced manholes. Good thing there was a hidden camera cuz the former straight dude decided to seek revenge and we are all the better for it.",
  "models": [
    {
      "name": "Lance",
      "person_id": 20362
    },
    {
      "name": "Zac",
      "person_id": 20484
    }
  ],
  "release_date": "2011-09-22",
  "scene_id": 2835651,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "The Meat Massage"
}