{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 7775
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "Ever stumble on a hot str8 dude lying on the beach?! And u wonder if he might be \"curious\" or \"bi?!\" Well then this clip is for you. And really for any dude that likes dudes, or at least likes to fuck around with them. This clip was sent in by a dude who randomly found some hot guy to suck his cock on the beach. The great thing is that the guy sucking the dick didn't know he was being video taped on the guys cell phone! Gotta love technology, right?! So this dude is walking on the beach and sees a guy lying in the sand, yeah, lying in the sand, as in buried in it. So, of course, one wonders what kind of bod the dude has, right?! No disappointment here guys! The dude, videotaping the whole time approaches the guy and to his lucky surprise finds the dude to not only have a hot ass body but is apparently bi, or at least one of those random dudes that happens to like to suck a cock! They go to a secluded spot, and during the walk there we see the \"buried\" guys hot body, all covered in sand and well built. The dude, videotaping, tells the guy to: \"come on, suck my dick, babe!\" the str8 acting guy gets on his knees and begins to suck some good dick! He must have had more than one cock in his mouth before. After getting blown for awhile the guy says: \"want me to cum on your face?\" \"Yeah,\" is the response. \"Lick my balls, get 'em wet,\" as the hot dude is lapping up the tasty ball sack, video dude is jerking off and asks: \"want me to shoot?\" Without hesitation, the guy moans in ascent and a big load is blown all over the side of his face. With hot gobs of it dripping into his mouth! This scene is hot dudes and why the guy felt the need to post this online, we'll never know, but be eternally grateful for giving us a \"helping hand!\"",
  "models": [
    {
      "name": "John",
      "person_id": 20396
    },
    {
      "name": "Zachary",
      "person_id": 20394
    }
  ],
  "release_date": "2011-03-10",
  "scene_id": 2835501,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Covered Up"
}