{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 7777
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "You gotta check this video out! Ever see a dude in his tighty whities, whether in the locker room or your dorm bathroom? And all you wanna do is grab that sweet ass that is lying just beneath that thin white clothe? Here is that fantasy, domination style. This video starts out with a cute-ass dude brushing his teeth in the bathroom of his apartment. He is wearing only a pair of tighty whiteys and white t-shirt. So the camera dude walks in and see the underwear hottie brushing his teeth and minding his own business. Only problem is, once he has seen this hottie's ass he cant help but grab it. Trust me! This dude has a serious booty on him. Tighty whitey dude is trying to tell his boyfriend, as he is being touched, that he has to get to work and has no time for fucking around. Doesn't matter because after fondling his sweet ass for a minute or two the sexy undies guy is pushed into the shower. Next thing we know there is a private wet t-shirt contest going on. This dude is sweet as pie, the kind you wanna fuck til all the filling cums out, or should I say, all YOUR filling cums out!? Dude has a thick uncut cock but that's nothing compared to his sweet ass. Before you know it there is a hot stand-up doggie style fucking going on. The dominate camera dude bends undies dude over and begins to fuck his brains out. This video is hot. This hot fuck scene ends with a beautiful cum spray all over the hot bottom's hairy round ass! Too bad for them that they ended their relationship. I guess the bottom got a taste of something he liked, being dominated. And to his boyfriend's disdainful surprise was caught prancing all over town waiting to be dominated by anyone in any public bathroom he could find.",
  "models": [
    {
      "name": "Chris Wolf",
      "person_id": 22490
    },
    {
      "name": "Parker Perry",
      "person_id": 22492
    }
  ],
  "release_date": "2011-10-20",
  "scene_id": 2835521,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Grab Something"
}