{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 7781
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This revenge video is hot as hell. These two guys were dating for awhile and all seemed to be going well until the bottom realized that his big, phat booty was sexy enough to get any cock it wanted. His booty had a mind of its own, if you know what I mean!? So they broke up and the top put this online and sent it to the bottom's mother! Yeah. He was in the closet, oh well, now he can really get whoever he wants cuz the talent his booty displays here in phenomenal. This beautiful booty boy is lying on his stomach in a bed when a hung-ass dude with a camera walks in and starts playing with his ass. And let me tell you that this ass, although on a thin guy, is HUGE! So fuckable it is hard to believe it exists at all. It's the kind of ass you wanna motorboat for days! A kind of ass that has so much cushion that no matter how big your dick is, no way its gonna get all the way up inside. And that's where all the fun is. Trying to prod your way into a fleshy, mounded booty! These dudes have an amazing fuck fest. I am talking about an ass pounding, booty jiggling romp! And not only does the bottom have that ass but his cock is almost as big as his top's cock. And his balls are HUGE! They are almost as unnaturally big as his ass is, either way, this dude is sexy as fuck! The top asks the bottom: \"Do you want it deep?\" Silly question, right?! With an ass like this dude has you know he has been around the block a few times. Perfect for some good ass fucking. Nice and ready to go whenever \"it,\" (his booty,) finds a cock it wants to swallow. This video is hot and I'm sorry to see they broke up but this shit is so hot I really don't care.",
  "models": [
    {
      "name": "Richard",
      "person_id": 21477
    },
    {
      "name": "Zakk",
      "person_id": 21479
    }
  ],
  "release_date": "2011-11-03",
  "scene_id": 2835561,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Bone Squeeze"
}