{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 7807
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This recent submission is totally hot! It starts off with a hot, toned dude taking a shower! Nothing like watching a cute nicely built dude getting all wet and soapy in the shower! Dudes got a big cock too. Rubbing his wet body all over and getting all clean, just to get dirty all over again in a few minutes! He dries himself off and walks naked into the other room and begins making out with a fine-ass, curly-haired guy. Dude sucks a good dick! He doesn't need much direction but is offered this motivation: \"that's a good boy-lick it!\" Dude just lays back and gets his cock worshipped by the previously wet and soapy guy. He sucks the dudes cock all the way down to his big, tasty looking balls all laid back with his nice, thick thighs spread and enjoying every minute of the orally talented guy's mouth. After the mouth gets used a bit, its time for his other hole to get some pleasure. The cock sucker straddles the hot cocked top and slides up and down on his big pole, moaning all the while. After bobbing up and down for a few minutes with a huge erection himself, the bottom turns around and gives us and the top a back view. While he is riding in the other direction we see a nice, big cock disappearing and re-appearing between the riders smooth, hot buns! This position is totally hot! \"Oh yeah, ride it!\" the top shouts as he rubs his hands up and down the riding bitches tight, toned back and buns! Not only does it look like an amazing ass and fuck hole but the top exclaims: \"I love that ass!\" Totally believable because after changing a few different positions, one being a hot doggy-style and the end one being a hot missionary, the hot bottom blows his load all over his tight abs as his top finishes thrusting in and out of his fuck hole. The top pulls out and sprays the dude in his face with a big load of creamy, white cum! This video was put online by the cute top dude, who although loved to fuck the bottom's ass, found out he wasn't the only dude around who had that pleasure. This revenge kind of back fired on the top because the bottom gets even more cocks stuffed up his ass because of this online display of his hole's talent! Back fired revenge but \"back shots\" galore for the hot bottom!",
  "models": [
    {
      "name": "Sam",
      "person_id": 20522
    },
    {
      "name": "Tommy",
      "person_id": 20524
    }
  ],
  "release_date": "2011-06-30",
  "scene_id": 2835701,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Ass Please"
}