{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 7801
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This recent revenge submission is all a dude would ever need, but who are we kidding, right?! It's all about variety. Anyway you know the video you are about to see is going to be good when you see in the 1st 5 seconds, a cock of stupendous size! I mean this fuck stick is thick as Fuck! Dude is gifted with an amazing piece of man meat. And the dude sucking it is just as gifted. It isn't easy to swallow such a fat cock but this orally talented cock sucker takes it like a pro. As the cock sucker is bent over scarfing down this delicious piece of man meat the hung dude begins to finger fuck him! And not just one finger, but two. Dude takes 2 fingers up his manhole like its nothing. Apparently he has been fucked more than once by this hung dude or, most likely, by many other cocks of all shapes, sizes and colors! MMMM...hot! Then comes the real fun, well the fun before the main event that is. Dude gets dildo fucked for a good 5 minutes. We are talking about a thick, long dildo being shoved and swirled around in his manhole by the dude with the meaty phallus. After his ass is nice and dildo loosened up the hung guy slides his thick cock right up the bottom's hungry hole. Prodding into the very depths of his bottom bitch's insides. This fuck scene is hot as hell. The bottom takes this thick cock like a champ. All the bitch manages to mumble are sighs and moans of delight. They screw in all different positions and the view is spectacular. Watching a thick piece of meat splaying the bottom bitch in half over and over again is a cum fest waiting to happen. And it ends just as hot as it began! The top pulls out his giant tool and creams all over the bottom's face! This isn't just a regular load, too, this is like a weeks worth of man seed. He spews what seems like gallons of thick creamy gizz all over his bitch's face. Whats more is that the bottom wipes it all up with his fingers and begins to eat it! They broke up shortly after this amazing fuck fest and the top posted this online. Thank God for revenge, right?!",
  "models": [
    {
      "name": "Nic",
      "person_id": 21389
    },
    {
      "name": "Rob",
      "person_id": 22048
    }
  ],
  "release_date": "2011-10-06",
  "scene_id": 2835661,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Helping Hand"
}