{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 7805
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "Locker room fantasy anyone?! Yeah. Fucking in the locker room. Every cock hungry dude's dream! And this video does not disappoint. This submission was sent in, not by the dudes doing the fucking, but by the dude in the background who couldn't join in and had to be the look out. Poor guy, he is fucking hot too. Nothing like well built dudes in tight wife beaters, right?! The best! So this hot ass dude sucks cock in the locker room of the school they all go to. There are 3 guys in this vid, but as I said, one was left out, though he does j/o in the background. The orally talented cock sucker gets a cock good and hard. This is a nice cock too, guys. Once his mouth has had its fill its time for his equally talented ass! The dude getting the head says: \"let me fuck that ass!\" Dude doesn't say anything, but as any good bottom bitch does, he simply sits on it! Dude rides like a stallion. No way he is gonna get bucked off! Though he sure is getting fucked off! As the bottom bounces up and down on his own personal cock ride, the top pulls up his wife beater and reveals a toned and tight set of abs! Not a bad view at all, especially for the top guy. \"Fuck me like that,\" the bottom moans and the video then ends with the top pulling out his cock and spurting thick gobs of glistening cum all over his nice thick pubs! All the while this fuck fest has been going on the hot dude in the back, the look out, is totally beating his meat. Kinda sucks to be him but then again voyeurism is sometimes satisfying all on its own. But obviously he wanted in on the action cuz he posted this video online. Guess he doesn't like being left out of the game. But at least we benefit from his loss.",
  "models": [
    {
      "name": "Cole Harvey",
      "person_id": 20909
    },
    {
      "name": "Jared King",
      "person_id": 20907
    },
    {
      "name": "Jordan",
      "person_id": 20905
    }
  ],
  "release_date": "2011-07-28",
  "scene_id": 2835681,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "One-on-One",
    "Blowjob",
    "Tattoo",
    "Slim",
    "Latin",
    "Black Hair",
    "Blond Hair",
    "Anal",
    "Gay"
  ],
  "title": "Taste Test"
}