{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9423
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This recent submission has one of the hottest cocksuckers you've ever seen. This boy is seriously cute as fuck. It is one thing to get your cock sucked but it is a totally different story when the dude is hot. There is nothing as hot as looking down at a sexy boy sucking and slurping on your cock. Seeing a good-looking dude bob up and down on your cock is enough to make you loose your nut sooner than you might want. And in this recent video not only is the cocksucker cute but the cock he is sucking on is big, fat and, by the looks of the video, extremely tasty. Apparently this cocksucker found naked pics on his boyfriends phone and decided to seek a little revenge. He decided to find one of the biggest cocks he could and service it better than he ever did with his boyfriend's cock. And by the look of this cock it can't be too difficult to enjoy servicing it. And this cute cocksucker is very orally talented. He can swallow this big cock balls deep and apparently has no gag reflexes. The dude with the big cock loves every minute of his cute cocksucker servicing him. So if you like to watch a cute dude sucking a big cock than you have to cum see this recent submission. This video will get your cock as hard as this cocksucker has gotten this cock. And your cock will be ready to bust in no time. Try to hold off till the end though because you are gonna wanna see this cock bust a nut all over this cute cocksucker. The dudes' nuts must have been extremely full because he drenches this boy's face with loads and loads of creamy, hot jizz. You need to cum check out this movie. You and your cock will not be let down.",
  "models": [
    {
      "name": "Hefty",
      "person_id": 22184
    },
    {
      "name": "Matthew King",
      "person_id": 21242
    }
  ],
  "release_date": "2012-08-30",
  "scene_id": 2836921,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "Masturbation",
    "Blowjob",
    "Muscular",
    "Blond Hair",
    "Gay",
    "Shaved"
  ],
  "title": "King Dong"
}