{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 8901
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "If you like young, hot dudes, and who doesn't, than this recent submission is perfect for you. These boys are so smoking hot and their bodies will have you on your knees and begging to touch them yourself. And another hot aspect is that these two hotties are cocky as hell. They know they are hot shit and they love showing off their tight, young bodies. And not only are they cute but these dudes can suck serious cock. They can take a cock all the way down to the balls. These deep-throating champs gag on cock like it is their jobs. Apparently these two decided to make this video to piss off the one dude's boyfriend. Supposedly the boyfriend cheated on him with his cousin. And the cousin was even hotter than this dude. They went to a family birthday party together and his boyfriend took one look at the cousin and decided he was going to have his way with him. He didn't know if the cousin was gay or not but he decided to start partying up while his boyfriend was out front with the older relatives. The cheating boyfriend then got his wish. And it is too bad we don't have that video. Cuz it was off the hook. And we know that because the two made so much noise fucking that the rest of the family wondered what the racket was going on in the backyard. That's how this cute dude found out his boyfriend cheated on him. Standing there with his family while his boyfriend's cock was in his cousin. Needless to say the party was ruined. All the aunts and uncles left and the now bottom-bitch cousin ran off as soon as everyone saw the hot action. He literally pulled off of his top's cock and ran into the woods. Now this cheating boyfriend was left standing naked, cock swinging in the breeze, with his boyfriend staring at him. After a very long conversation they decided to stay together and figure things out. Unfortunately for them the jaded dude couldn't stand being cheated on and decided to meet up with some random dude and have their cock-sucking session video taped and sent to his boyfriend. After viewing this incredibly hot video the boyfriend decided to post it online and embarrass both boys. Not everyone embarrasses easily and this video is way too hot to feel ashamed. So thanks for posting cuz this video is fucking hot.",
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 17515
    },
    {
      "name": "Marc Peron",
      "person_id": 22341
    }
  ],
  "release_date": "2012-03-08",
  "scene_id": 2836531,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "One-on-One",
    "Facial",
    "Blowjob",
    "Hairy",
    "Brown Hair",
    "Gay"
  ],
  "title": "Extra Long"
}