{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9238
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "It is one thing to watch two young college dudes sucking cock and fucking but it is an entirely different thing when the guys are as hot as these two. These dudes are the perfect examples of what college dudes should look like. The top has a big, perfect cock and the bottom's ass is a perfect tight, little fuck hole. You will love this video. You know how horny you get after a workout, right? Well not everyone has worked out but if you haven't than you need to if only for the hormonal rush. This video starts out with a cute, little twink trying to buff up his body. There is always a need for a hot, little twink but lets be honest, we all love a shredded, muscular body. Anyway this boy gets done working out and begins to jerk his cock. Totally hot! He sits down and shoves his sweaty hands down his pants and starts playing with his hot, moist junk. As he is jacking his hot, young meat some dude shows up with a camera. Apparently these dudes are friends but have never fucked before because they have both always had boyfriends. Well here cums their chance. The dude with the camera decided to fuck this dude to get back at his boyfriend. Supposedly his boyfriend did something to piss him off. We aren't sure what but who really cares. As long as we have this hot video that is all that matters. And did we mention the hot, little twink is wearing tightie whities! We don't see good ole fashioned tightie whities so much anymore but once you see this dude you are gonna bust your nut. Tightie whities totally need a cum back. And after this video they just might. So this hot twinkie treat begins to suck and slurp on a magnificent cock. And not only is his mouth talented but wait till you check out his ass. OMG. This ass is fucking tight as hell. Smooth and round with just a hint of hair in his tight, hot crack. And as tight as his ass is it can certainly take an intense cock pounding. This hot top slams his big, hard cock balls deep up his bottom with no restraint. And the bottom can handle every cock shot his top can muster. Not only are these dudes hot but they are verbal too. You gotta love a good verbal fuck. These boys might only be in college but they sure know how to make a cock spit loads of hot, sticky cum. You have to cum see these boys in action. They will have your own cock spitting loads of hot, sticky cum. This recent submission is a must see, hot, slim twinks and big, hard cocks, doesn't get better than that.",
  "models": [
    {
      "name": "Dominic",
      "person_id": 20402
    },
    {
      "name": "Tex",
      "person_id": 20404
    }
  ],
  "release_date": "2012-06-21",
  "scene_id": 2836771,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "One-on-One",
    "Blowjob",
    "Slim",
    "Black Hair",
    "Anal",
    "Gay"
  ],
  "title": "Big Tex"
}