{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 8805
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "If you like to watch a hung black dude fuck a little white boy then you gotta check out this recent submission. This video is fucking hot. Watching a huge black cock sliding in and out of a tight, smooth white ass is a thing of beauty. And this white boy is a definite power bottom. He glides his ass down on his top's thick, hard, throbbing cock with the greatest of ease. He simply moans with pleasure as his top thrusts his cock balls deep into his sweet ass. If bottoms received awards for top notch cock poundings then this boy would be the life time achievement winner. These dudes were roommates in college, perfect match, right? After all there can be no better match for college roommates than having a top living with a bottom. It didn't take long for these dudes to realize they had a lot in common. Well not so much in common as having just one very important shared trait. The white boy loved to suck cock and get rammed in the ass and the black dude loved getting head and fucking little, white dudes. If you like a good verbal top then this video will certainly satisfy that fetish. And the top is muscular and sexy as fuck. Its definitely enough that a dude is hung let alone possessing everything a gay boy could want in a fuck buddy. So these two had a great situation going. But when they came back from spring break the shit hit the fan. Apparently the bottom roomie hadn't realized that his ass belonged to his top roomie. So while on spring break he did what any young, sexy bottom boy would do...cock! This bottom took so many cocks in his ass during one week in Mexico that he became a local legend. And a good ambassador from America to Mexico. Well suffice to say the hot top found out about his cock fest and decided to post this video online. They made this before spring break and since the video doesn't reveal the top's face it was perfect. So now the bottom is outted and looking for a new roommate. But after seeing his cock taking abilities in this hot video it shouldn't be a problem finding a willing roommate. Enjoy.",
  "models": [
    {
      "name": "Johnny Rocks",
      "person_id": 22305
    },
    {
      "name": "Travis Kelly",
      "person_id": 20436
    }
  ],
  "release_date": "2012-02-09",
  "scene_id": 2836461,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Get It Good"
}