{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9279
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "Big, floppy cocks are the best kind of cocks. And if you like to play with a floppy cock than you gotta check out this recent submission. This cock is thick and long and that is only when it is soft. And that's what makes a floppy cock so great. Cuz we all know that if a cock is big and floppy when it's soft then it's gonna be huge when it's hard. And that is when the real fun begins. This dude video tapes himself in the mirror playing with his floppy. Just watching the beginning of this video is enough to make you bust a nut. This young, hard dude wiggles and flops his cock to all of our delight. Teasing us with the length and thickness. This cock will make you want to climb through your screen and take it for your own intimate pleasure. Apparently this dude put this online to get back at his boyfriend. Supposedly this boy's ex dicked him over hardcore. And we aren't using that phrase in some hot, kinky way. This dude's ex was caught sucking his brother's cock. And did we mention the brother is straight? So that makes it even hotter, too bad this dude didn't agree. Then again if you catch your bf blowing your brother you are prolly not gonna be turned on either. So this floppy dicked dude decided to video tape himself getting sucked off by his and his ex's friend. This friend always had a crush on this dude and who could blame him? The ex was always paranoid that they would get it on so therefore he cheated first. Little did he know that it was not going to happen. Then again, now it has, but he brought that on himself. So at least we get to enjoy the demise of this relationship. How could we not? This cock is so tasty. Long, thick and with a big head; this cock was meant to be played with, sucked on and ridden like a cowboy. And this lucky bastard gets a chance at exactly that joy ride. Watching this cute and orally talented cock sucker will get your dick hard and ready to nut. You should totally wait till he blows his wad though. He puts his cock sucker on the floor and finishes up by spraying him down like a hose. Big, shiny gobs of thick, glistening jizz flies all over this extremely lucky friend. And if you think this cock sucking is hot wait until you see this flopper fuck. You do not want to miss out on this new video. These dudes are young, sexy and horny as fuck. Cum watch them worship cock and blow nut.",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 20480
    },
    {
      "name": "Dirk Tomas",
      "person_id": 20482
    }
  ],
  "release_date": "2012-07-05",
  "scene_id": 2836801,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Meat Eater"
}