{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 8939
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This recent submission will grab your attention and make you grab your cock. These two boys could be porn stars. And who knows, after this submission, maybe they'll get a chance to perform more amazing acts of hot gay sex on camera. These boys sure know how to work over the male body. And they must not know what gag reflex means because they take cock balls deep down their throats. Besides the bottom being a deep-throating specialist his ass puts his mouth and throat to shame. Much to the satisfaction of his hung top's fat, juicy cock. So if you like to watch hot, hung and sexy-ass young dudes suck and fuck each other than this video is for you. Apparently these two hot fuckers used to be best friends and they lived together their first year in college. They were such great friends that even when one of them came out as a cock-loving gay dude the other dude didn't care and stayed his best friend. A problem, however, came up the next year when they decided to room together again. But more about that later. Like they say college is just an excuse to try everything at least once. So having that in mind the straight roomie had no problem getting blown by his gay best friend. However the suck session turned into a hot, sweaty ass-pounding hour of power and unbeknownst to the str8 dude the whole thing was being recorded. Now the reason this video was posted came as a result the following year. Everything was great between these two friends for about a year and a half until one fateful night. The gay roomie was out of town for the weekend and one night there was a knock on the dorm room door. At the door was a very horny gay boy from down the hall. He had over heard their fuck session the previous year and decided to try his luck at bagging a str8 boy. As luck would have it his plan worked. What they didn't know was that the gay roomie walked in on them because he came back early. He was so shocked that he quietly left and plotted his revenge. He went straight down to the common room and posted this hot video of him and his roomie from the previous year. Too bad for the str8 dude but this video is so hot, who the fuck cares, right?",
  "models": [
    {
      "name": "Brian",
      "person_id": 21457
    },
    {
      "name": "John",
      "person_id": 21459
    }
  ],
  "release_date": "2012-03-22",
  "scene_id": 2836561,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "Blowjob",
    "Anal",
    "Gay"
  ],
  "title": "Heres Jon"
}