{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9018
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "If you like big, thick tasty cocks than this recent gay revenge video is right up your alley. This dude has a cock that no one could say no to. And not only that but he knows just how to use it to please anyone. This guy's hung cock can probe and thrust with the greatest of ease. And his bottom, who is his boyfriend's best friend could not resist the temptation to play with it. But then again he gave him a good enough reason. This hung dude's boyfriend fucked him over hard core on an assignment they had for one of their classes. They decided to be partners for this class because they were boyfriends and figured they'd have a better shot at a good grade together than with some random classmate. Well they were certainly wrong. This dude seeking revenge did all the work and the boyfriend's only job was to turn in their assignment to their professor. Well the boyfriend was out partying and forgot to turn in the assignment. So they both got Fs for that week's assignment. Therefore this dude decided to fuck his boyfriend over by fucking his best friend. It sucks that this happened this way but fuck the boyfriend these two put on an amazing suck and fuck fest. The best friend apparently has had his eye on this dude because he gobbles down this hung cock like he needs it to live. And he bends his hot, tight ass over with pure excitement. The boyfriends have now broken up but now these two fuck on a weekly basis. And hopefully we will get to see another video cuz this shit it totally hot. They both have tight, muscular bodies that move into each other like they are two pieces of a puzzle. Cock piece to ass piece! This shit is perfection. The hung top plows his cock-hungry bottom and the bottom can only moan in pleasure. He begs for more and the top is only too happy to oblige. You have to cum check this out. You and your cock will love these hot, muscular young dudes. Revenge might not always be pretty but this video sure is hot enough to suggest that fucking your boyfriend's best friend out of revenge will turn out hot as hell.",
  "models": [
    {
      "name": "Matt Wellington",
      "person_id": 20340
    },
    {
      "name": "Ty Tucker",
      "person_id": 20342
    }
  ],
  "release_date": "2012-04-19",
  "scene_id": 2836631,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "One-on-One",
    "Cum On Ass",
    "Masturbation",
    "Blowjob",
    "Outdoors",
    "Tattoo",
    "Muscular",
    "Black Hair",
    "Anal",
    "Gay"
  ],
  "title": "Sweet Dick"
}