{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9193
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This recent revenge video has everything you could possibly ask for in a hot video. This bottom dude can take a cock like it's his job. The way he slides his tight, slim twinkie butt up and down on his top's thick cock will have you jerking your dick in no time. This boy's idea of revenge was to have the brother of his ex boyfriend fuck his brains out on video. And that task is accomplished to a tee in this video. Whether it's his brother or not the ex would still be turned to complete and utter jealousy. Rightly so because the ex totally deserves revenge. So screw him, right? Apparently the ex stole his car and wrecked it. So in revenge this dude decided to get his ass wrecked by his asshole ex boyfriend's brother. And when you watch this video you are going to be blown away by the aggression and talent of this hot, little bottom. This dude's ass was made to be anally dominated and destroyed. And all he can do is whimper and ask for more cock. It would be one thing if his top's cock wasn't big, however, it is deliciously big and thick. So this bottom decided to email this video to his ex and show him what he would be missing out on in the future. Not too mention that it's his brother's cock that's being plunged up his ex's ass. These two studs fuck like the young hormone-charged boys that they are; screwing, sweating and cumming all over the place. So if this sounds good to you and how couldn't it? Than you have to cum check out these boys. And although the ex put this online and therefore screwed these boys over this video is still a success. We are all greatly benefitting from this hot-ass video. And not too mention the sexy-ass, anally talented bottom boy has a tasty looking uncut cock. This cock is deliciously thick and featuring a thick, tasty foreskin. So if you like to see a hot uncut cock or if you like to chew on foreskin than this video is right up your alley. Their bodies are firm, tight and toned. We are talking about sexy, young college boys who fuck like porn stars.",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 20480
    },
    {
      "name": "Joel",
      "person_id": 20847
    }
  ],
  "release_date": "2012-06-07",
  "scene_id": 2836741,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "On The Pole"
}