{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 8761
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "If you like to watch hot, young dudes suck cock and fuck ass then this recent submission is right up your alley. Or if you are a horny bottom, right up your ass. Either way, top or bottom, this video will impress you and your hard cock. These boys are sexy and they know it. Tight, muscular bodies, cute faces and thick, pretty cocks! And wait till you check out what they can do with their bodies. After a long afternoon they decided to settle a bet. The bet was to see who could last the longest without cuming. Who hasn't played that game? It is a great way to test the bi-curious waters. Only one of these 3 dudes is actually gay and out of the closet. The other two knew he was gay but didn't care because they had to prove themselves after the bet was made. Unknown to the two straight dudes the gay friend was video tapping this whole circle jerk. He figured he had a safety net for the future and a private porno starring himself and his hot friends. But to the gay boy's surprise he ends up getting his ass porked by his straight friends! Every gay dudes fantasy, right? You will love this video. The gay bottom boy loves every minute and every inch of the cocks that are inside of his hot, little body. And needless to say one of his friends pissed him off so he decided to post this video online. He warned his former top not to fuck with him but he didn't heed his warning. So thanks to all three of these hot, young dudes we have this hot new revenge video. Thanks boys!",
  "models": [
    {
      "name": "Mike King",
      "person_id": 21667
    },
    {
      "name": "Mohamed",
      "person_id": 21915
    },
    {
      "name": "Ryan",
      "person_id": 21913
    }
  ],
  "release_date": "2012-01-26",
  "scene_id": 2836441,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "Cum On Ass",
    "Facial",
    "Blowjob",
    "Outdoors",
    "Latin",
    "Black Hair",
    "Brown Hair",
    "Anal",
    "Gay"
  ],
  "title": "Cock Circle"
}