{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9517
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "What would you do if you caught your boyfriend cheating on you? It depends on the type of person you are and how long you had been with that person. Who the other person was would also determine how you would feel about the situation. For instance if your boyfriend was fucking some slutty gay boy from the local bar, eh, sure it'd suck but nothing compared to if he was fucking your best friend. Cheating is never a good idea. No matter who the person is and what the circumstances are but unfortunately for gay dudes sex comes way too easily. That was a ludicrous statement, wasn't it? Point is that temptation surrounds us all in everyday life. That is exactly what happened to this boy and his, now ex boyfriend. They had been dating for about a year or so when our innocent protagonist found his boyfriend plowing his best friend's ass in their own bed. Some people would go ballistic and some people would curl into a ball and cry. Well this young boy decided to get revenge. And fortunately for him he knew about GayRevenge. The best place on the internet to show your asshole ex boyfriend how very over him you are and what you can do now that you are single. This is all a very sad situation but when you get a look at this dude in the video you will soon forget the sad story behind the video. Not only is this boy beautiful, slim, young and sexy but he is one talented bottom boy. It is too bad for his ex because most dudes would never give up a hot power bottom for a one nightstand. And let us not forget how hot the dude is that is fucking him and what amazing ass fucking skills he demonstrates. If you want to see two of the hottest dudes in a gay porn video then you need to check out GR's recent submission. Not only do these two boys end the video with ecstatic cum shots but you will also be shooting your own wad across the room. Check out these sexy, young boys deep throat and fuck each others' brains out.",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 20480
    },
    {
      "name": "Hunter Van Heise",
      "person_id": 20738
    }
  ],
  "release_date": "2012-09-27",
  "scene_id": 2836991,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "Gay"
  ],
  "title": "Doing Dallas"
}