{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 8718
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "You have to cum check out this recent submission to GayRevenge. Not only are these boys hot, young and sexy but the top dude is fucking hung. Check out that big, thick fuck stick of his. This dude can do some serious damage to an ass. And it is a good thing that he picked this bottom boy for that challenge. This video starts out as a simple dual masterbation session but soon turns into much more than that. These boys might be young but they sure know how to have some rockin gay sex. Apparently these two dudes decided to make a video of them jacking each other off and send it to the bottom's ex boyfriend. It was meant as a simple ploy to get them back together. Just to give the ex a reminder of how hot his recently dumped boyfriend is but as you will see these two got a bit out of control. It is one thing to jack another dude off but it is an entirely different thing to let another dude fuck you. Like anyone could blame either one of these boys for going over board. They are both hot and the bottom is a bit of a size queen and after stroking his partner's huge cock for a bit he needed it up his ass. Who could disagree that? Before you know it this hungry bottom bitch is practically torn in two and looks as though he is impaling himself on a human stake! But the way he easies his ass around his top's huge cock you know he is one hell of a talented bottom. Needless to say after this fuck fest these two decided to get together and to send the tape to the ex just for laughs. They didn't think he'd put it online but we thank him for it nonetheless.",
  "models": [
    {
      "name": "Binx Tanner",
      "person_id": 21669
    },
    {
      "name": "Mike King",
      "person_id": 21667
    }
  ],
  "release_date": "2012-01-12",
  "scene_id": 2836391,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Dual Masterbation"
}