{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9055
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This twinky treat is everything you could possibly want in a twink. You have got to check out this new update, especially if you prefer twinks. And this isn't just any twink. This boy is not only slim, slender and pretty. This treat has a toned body. So he isn't just slim he is cut up. This boy is enough to turn anyone into a twink fan. And after your first glimpse of him you will most ardently agree. And not only is he more than you could possibly ask for, visually speaking, but this dude is one talented like fuck bottom. Not to mention he can suck a mean dick. You are gonna wish this was your dick getting worked over by such a hot guy. Especially when the dude with the camera orders him around. Check this out. This hot-ass, twink-alicious treat will blow your mind. He can take some serious ass pounding. And the best part is he can take all the abuse his butt fucker can muster. He bends over, takes a breath and opens his hot, sweet fuck hole. And apparently this twink has an amazing ass. His hole not only blows his top's load but also his mind. You will love watching this talented bottom twink taking some hot ass pounding. And the top's body is fucking hot as hell. But the true star of this hot video is the twink, specifically his twinky fuck hole. The dude with the camera decided to take revenge on his ex so he decided what better way than to fuck his brother. Yeah. this twink is this top's boyfriend's bro. Apparently this twink's brother was supposed to mail in his boyfriend's car payment while he was away for work. And he was away only because of the boyfriend and his brother whom had recently moved in with them. He had been gone for 2 months and when he came back he found that his car had been repoed. So he came back from his work trip only to find his car impounded. And the best revenge was to fuck his asshole boyfriend's brother. Especially since he had been mooching off the dude. So you gotta cum check out this video. These two hot dudes fuck like you will not believe. And when the boyfriend watched this video he kicked his little bro out but the fucking top went with him! Ha! It is so awesome. But the joke is on these two amateurs because the dumbass boyfriend who got replaced by his brother posted this online. We'd say no one wins in this scenario but the two dudes in this video certainly did cuz they still fuck to this day and we all benefit from this hot video. So hell yeah.",
  "models": [
    {
      "name": "Casper",
      "person_id": 22419
    },
    {
      "name": "Tyler",
      "person_id": 20714
    }
  ],
  "release_date": "2012-05-02",
  "scene_id": 2836661,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Big Cock Casper"
}