{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9456
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This recent revenge update is one of the most intriguing we have received. The dudes in this submission are extremely hot and involved in a very well thought out revenge plot. The way things went down for this one dude is quite sad and his ex deserves what is coming to him. The ex of whom we speak did something so unforgiveable and disgusting that this dude has every right to annihilate and humiliate him to the fullest extent humanly possible. This asshole, ex boyfriend, cheated on him with the dude's younger brother. The brother was visiting them during his spring break from college and the boyfriend just couldn't resist him. Granted this brother was hot as fuck but still you don't fuck your boyfriend's family members. Apparently this dude never heard about this unspoken rule so he seduced, more like fucked the brains out of, his boyfriend's younger brother. About halfway through their torrid lovemaking the brother walked in on them and there was no way to explain or lie about the situation. It is hard to explain why you are naked with your erect cock inside your boyfriend's brother's ass without seeming like a complete asshole. Needless to say this dude was devastated. He immediately kicked his boyfriend out and sent his brother packing. He bought his brother a ticket home and began to plot his revenge. It soon dawned on him that his boyfriend had always had the hots for the cute gay boy that worked at their local coffee haunt. Before he knew what he was doing he grabbed his phone and headed down to the coffee shop. He waited for the cute boy to go on break and told him all that had transpired. Luckily for this scorned lover the coffee shop boy had always had a crush on him. So the revenge plot was going superb. They went back to the dude's apartment and began their video debut. Their sexual escapades lasted hours and both dudes finished with wild abandon. The video was so long that they decided to send half of it to the ex and the other half into us. Be for warned that this is an extremely hot video. These two boys are fucking hot as hell and although the circumstances surrounding this intrigue are shady this video is nevertheless an astoundingly hot amateur gay porn.",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 20184
    },
    {
      "name": "Parker Brooks",
      "person_id": 20831
    }
  ],
  "release_date": "2012-09-13",
  "scene_id": 2836951,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "One-on-One",
    "Cum On Ass",
    "Blowjob",
    "Slim",
    "Blond Hair",
    "Anal",
    "Gay",
    "Shaved"
  ],
  "title": "Parker Play"
}