{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9154
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "If you dig straight looking dudes who suck cock and take it up their hot, masculine asses than you have to cum check out this video. This dude looks like he fucks chicks and would kick your ass for checking him out but you can't judge a book but its cover. Or should we say you can't judge a dude by his masculinity. And not only is he tough acting and sexy as fuck but this dude sucks cock like you will not believe. Dude gets on his knees and slurps up cock like is a fucking tasty popsicle. And he likes the big ones. So cum see this dude choking on huge, fat cocks. So apparently this dude has a boyfriend. Most likely just keeps him around for a fuck but a boyfriend none the less. So this boyfriend of his cheated on him with his own dad. Yeah. So this dude's, now ex, got porked in the ass by his bf's dad. And if you think this hot dude is sexy you should check out his dad. But that's a whole different story. In the name of revenge this dude video taped himself sucking on his ex's best friend's huge cock. And you should totally check out this cock. The picture just does not do it justice. It is so thick, long and, oh yeah, uncut. We are talking thick, salty, chewy foreskin. There are few things better in this world than a fat, uncut dick. Watching this video will have you pulling your pud furiously. Serious cum see this dude deep throat. He worships this cock like he needs it to cum for him to survive. Totally hot. Oh, and yeah, the cock sucking, str8 acting dude has a fucking ripped body. We are talking hard, tight six pack and high, hard pecs. Not too mention his amazing, big, pink nipples. Nipples you could chew and suck on for days! And when he kneels down in front of this huge, uncut shlong your cock is gonna lose it. And hopefully your nut can last till the end. The perfect finale is a creamy, hot facial. When this uncut cock jizzes all over his cock sucker's face you are gonna lose it. So basically this is a 2 nut movie. Cum check out this hot ass video. It's fucking hot!",
  "models": [
    {
      "name": "Alexander Greene",
      "person_id": 20184
    },
    {
      "name": "Blake Savage",
      "person_id": 21112
    }
  ],
  "release_date": "2012-05-24",
  "scene_id": 2836711,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "Twink"
  ],
  "title": "Cock Surprise"
}