{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9344
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This is one of the hottest videos online right now. These dudes are hot and fucking horny as fuck. This recent submission was sent in by a scorned lover looking to exact revenge from his loser-ass boyfriend. The great thing about this video is that the cocksucker who bobs and weaves up and down on a delicious cock is one orally talented dude. This guy has absolutely no gag reflexes. He simply crouches down and dives head first into an amazing crotch. This cock that this dude gets to suck and slurp on is an amazing piece of man flesh. It is a perfect prick. Long, thick, veiny featuring a huge mushroom head and a set of low hanging balls about to burst with man juice. This cocksucker might look straight but he sure gives good head. Apparently his ex-boyfriend royally fucked him over. And not in a good way. This dude cheated on him with his own brother. They were all camping out in the woods a few weeks ago and this dude actually fucked his boyfriend's younger brother. The younger brother is in his early 20s and was confused about his sexuality. He knew his brother was gay and had wondered about himself for quite sometime. It only took an hour or two with the boyfriend and a few beers to determine what he longed for. And apparently what he longed for was a big, throbbing cock up his virgin ass. So out of revenge this dude decided to suck off his ex's best friend. He has always had a thing for the dude but never acted on it because it was his boyfriend's friend. Well after he found out about his boyfriend and his brother he decided to tape the hot cocksucking action. It sucks that this all had to go down but it is awesome watching this dude go down. Pun totally intended. This hot cocksucker blows some amazing cock. It is too bad he broke up with his ex and now his ex has to see this hot video. He must realize that he just lost one of the best cocksuckers around. You have to cum check out this video. The cocks are big, the dudes are cute and the action is way sexy. There is nothing quite like watching a cute dude sucking a huge cock. And that is exactly the plot of this hot new video.",
  "models": [
    {
      "name": "Jacques",
      "person_id": 20228
    },
    {
      "name": "Seth Haus",
      "person_id": 20620
    }
  ],
  "release_date": "2012-08-02",
  "scene_id": 2836861,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Tough Cock"
}