{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 8959
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This recent submission is fucking hot as hell. Not only are these dudes hot, hung and young but the background behind this video is just as hot. These dudes had been dating for about a year or so and things had been going well until one night when the two were out at a club. They spent the night dancing and grinding shirtless on each other. About half way through their night out the one guy said he needed to run out to get some smokes. However he didn't really need any cigarettes at all. What he needed was the bouncer at the door whom had eye fucked him the whole time he and his boyfriend waited in line to get into the club. After leaving his boyfriend on the dance floor this hot dude sniffed out the bouncer. And this bouncer was fucking hot as hell so it's hard to blame him for his lust. This bouncer was in his late 30s. Tall, broad shoulders and a true seasoned veteran of hot, gay sex. Of course this part was not discovered until the cheating actually began. The bouncer and the boyfriend went into the bathroom and selected a stall to begin their passion play. And these dudes sucked, rimmed and fucked each others' brains out. However a friend overheard what he thought to be his friend in the stall and assumed it was he and his boyfriend. He was wrong and stormed onto the dance floor and told the dancing boyfriend who had been blissfully ignorant of his lovers sexual transgression going on in the club's bathroom. Needless to say when the boyfriend and the bouncer came out of the bathroom the boyfriend was standing there waiting for them. As they walked out, adjusting their clothes and glowing from orgasims, they ran right into the accusing boyfriend. As they walked back home from the club these two guys fought, screamed and shouted at each other much to the chagrin of their sleeping neighborhood. As they lay in bed that night the wronged boyfriend came up with an amazing revenge to enact upon his cheating boyfriend. He took his camera phone with him the following day and sought out his boyfriend's hot ex. They both had a lot of reasons to seek revenge and so they videotaped themselves fucking and sent it to the cheating boyfriend.",
  "models": [
    {
      "name": "Raphael Cartel",
      "person_id": 22036
    },
    {
      "name": "Ricardo",
      "person_id": 22034
    }
  ],
  "release_date": "2012-04-05",
  "scene_id": 2836581,
  "series": [
    "Gay Revenge"
  ],
  "tags": [
    "One-on-One",
    "Blowjob",
    "Outdoors",
    "Tattoo",
    "Muscular",
    "Black",
    "Black Hair",
    "Anal",
    "Gay",
    "Shaved",
    "Doggystyle"
  ],
  "title": "Booty Buddies"
}