{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 8858
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "This recent submission is one of the hottest videos gay revenge has received. These dudes are muscular and hung. And not only are they hung and muscular but they are young, college boys. Young, firm and full of hormones. These studs suck cock like you will not believe. There is nothing quite like watching a buff, straight-acting dude suck a dick. With big, meaty pecs and a tight six pack he doesn't hesitate to get on his knees and service his friend's cock. And this cock is long, thick and perfect. The way these dudes choke on dick will have your cock aching to cum. Apparently the hung dude getting his cock sucked made this video to piss off his ex boyfriend. Since they broke up over sex why shouldn't they seek revenge on each other using sex. But somehow I think this dude is gonna win the fight. It can't be easy watching your best friend sucking your ex boyfriend's cock. Yeah. This cock-hungry cock sucker is the ex's best friend. Or rather, was his best friend before this video was sent to him. What is worse for the ex is that he didn't even realize his best friend was gay. Well not so much gay but just one of those cock sucking bi-curious dudes. Of course it wasn't these two dudes that sent this video into gay revenge. They pretty much screwed themselves. And no pun intended. This video turned out to be a double revenge story. The ex was extremely pissed off to view his best friend sucking his ex's cock but he was smart enough to turn it on them and post this online. It's a good thing the hot and muscular bi-curious dude likes to suck cock because after this video it won't be easy for him to find a chick to date. But after all when a dude can suck a dick this good he has no business trying to be straight. Cum check out this hot, new video.",
  "models": [
    {
      "name": "Joey Baltimore",
      "person_id": 20434
    },
    {
      "name": "Travis Kelly",
      "person_id": 20436
    }
  ],
  "release_date": "2012-02-23",
  "scene_id": 2836501,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Underwater Lovers"
}