{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9747
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "What is the best way to get back at a cheating boyfriend? There are a few options that could work but the very best payback is finding a dude to fuck on camera and sending the footage into GayRevenge. And the best person to fuck, or get fucked by, is a good friend of your ex, or even, a relative of that ex boyfriend. Rarely just picking some random dude will not anger your ex, at least not as much as someone close to him. There is always the exception that if the random dude is way hot, then you might strike a cord, but most likely you need to bang someone he cares about. In this recent submission a dude caught his boyfriend cheating on him with one of their neighbors. The cheating boyfriend was stupid enough to leave text messages on his phone and his boyfriend found them. Cheating is never a wise thing to do but if you are going to cheat at least be wise enough to hide the evidence. Well this dude's ex is pretty stupid and left all his text messages on his phone and therefore was found out. The cute boy who sent in this video was so enraged that he decided to seduce the one person his ex would be most upset about. And that person was his younger brother. So this boy went to the college the brother goes to and explained the situation. Now the younger bro is not gay but, he is in college and he hates his brother as much as this boy. After working out the details the younger brother decided to fuck this boy on camera. There was on condition though; the bottom had to be on all fours and get boned doggie style so he could pretend he was fucking a chick from behind. Before we give away all the juicy details, and by juicy, we mean the cum soaked fuck fest, these dudes really got into it. About half way through their anal escapades the top soon forgot he didn't want to fuck a dude and really let lose. They say angry sex is the best and by the looks of this video, the it's a true statement. This top punishes his bottom's ass beyond belief and fucks his guts so hard that the bottom just whimpers in ecstatic delight. You need to cum see this recent submission. If you are into watching hot, young dudes fuck hardcore then this video will leave you just as satisfied as these two boys. Cum watch an angry brother fuck his bro's hot ex boyfriend.",
  "models": [
    {
      "name": "Aaron",
      "person_id": 22530
    },
    {
      "name": "Hayden Richards",
      "person_id": 18073
    }
  ],
  "release_date": "2012-12-20",
  "scene_id": 2837181,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "The Good Dick"
}