{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9705
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "When dudes wanna get revenge on their cheating boyfriends there is only one place they can turn. And that place is right here, GayRevenge, is the perfect platform to execute revenge against a boyfriend or an ex. This recent submission was sent in by this cute little bottom. He walked in on his boyfriend fucking their roommate. You are suppose to share a lot of things with your roomie but not your boyfriend. This cute bottom has been a fan of GR for quite sometime so he finally got his chance to submit a video. Of course the events that led to this submission suck but it's still a hot video. This bottom decided to find a dude with a big cock to fuck him. His boyfriend didn't have a very big cock so he knew it would make him jealous to see him getting boned by a big ole cock. He definitely succeeded. Wait till you see this cock. There is nothing better than getting fucked by a large cock. They say it's not the size but the motion that counts. Well sometimes that's true but sometimes it couldn't be more wrong. And this cock fucks better than most you've seen in action. The bottom in this video can only lie back and moan in pleasure as he gets rammed up his warm guts by this big, thick cock. The top dude lays into his bottom's ass with excellent form. He fucks the cum out of his bottom and then pulls his big meat out and covers him with globs of shiny, salty cum. Then there is the hot, sweaty clean up. You can't just wipe up cum with a cloth after sex. Waste not, want not. This greedy, slutty bottom gobbles up every drop of tasty cum. If you want to see hot, new porn then you need to check out this video.",
  "models": [
    {
      "name": "Evan Hart",
      "person_id": 20710
    },
    {
      "name": "Josh",
      "person_id": 20712
    }
  ],
  "release_date": "2012-12-06",
  "scene_id": 2837141,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Beat The Meat"
}