{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9636
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "Hot dudes from all over the country send in homemade videos of themselves in order to get back at their ex boyfriends. Usually the ex did something stupid like cheat on them or destroy some property. This recent GayRevenge video is no exception. It is actually one of our greatest. This dude's ex was a total douche bag and left info on his computer. The info that was found was proof that this dude had been fucking a friend of theirs from another college. When this boy found all the pics and emails he went into a jealous rage. First he contemplated his options. He could set the dude's car on fire, he could out him to his grandparents or he could post a video online. He actually did a combination of all three. He didn't fuck with the dude's car but he did destroy everything left in the apartment that was his and he sent a letter with pictures to the grandparents of his ex. The greatest part was that he picked a dude to fuck him, videotape it and send it into GayRevenge. GayRevenge is the best site online to exact revenge on a former lover. So this dude, who is really cute and has a nice body called up their mutual friend, told him the dealio and they decided to fuck on camera. The best thing about picking the friend was that he knew his ex would be pissed off. He had always been afraid they would hook up and so he decided to cheat himself instead. They say everything happens for a reason and maybe none of this would have happened if the dude hadn't been so insecure. The two boys in this video are very cute and they have tight, firm young bodies. Cum see this cute boy seeking revenge. He slobbers and gobbles up this massive cock and then rides it hard. He slides his tight asshole onto the big cock and bounces up and down until the top busts his sweet nut all over his fucked open ass. This is a great new submission and these boys will definitely help get you off.",
  "models": [
    {
      "name": "Evan Hart",
      "person_id": 20710
    },
    {
      "name": "Landon Stone",
      "person_id": 21253
    }
  ],
  "release_date": "2012-11-08",
  "scene_id": 2837091,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Suck Em Down"
}