{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 9593
    }
  ],
  "collections": [
    "Reality Dudes"
  ],
  "description": "When seeking revenge on someone who has wronged you there are a few simple steps one must take in order to achieve ultimate success. First you must know your target. You must know this person so wholly that you know all of their buttons and exactly what will piss them off. You cannot properly get to someone if you don't know them well. This is why GayRevenge is so successful, well one of the reasons why. First and foremost because we have hot dudes fucking, of course, and secondly because our dudes are getting revenge on their ex boyfriends. And if you don't know the inner workings of your former lover than you obviously weren't close with that person. GayRevenge is so awesome because these boys know who to fuck in order to piss off their exes. In this recent submission although there is no anal sex there is an extremely orally talented little cocksucker. This cocksucker can deep throat dick like you will not believe. He eagerly gets on his knees and begins to slurp, slobber and swallow the big cock that is shoved in his face. No one can blame him just wait till you get a look at this cock. What a lucky bastard. And this dude's ex must be a world-class idiot to cheat on a boyfriend that has such an amazing cock. Not only does this video feature an amazing cock and cocksucker but these two dudes are also hot with awesome, banging bodies. This dude knew just how to piss of his ex and found the perfect dude to help him out. You will totally enjoy watching this hot piece of revenge being acted out. The ex isn't too happy, but fuck him anyway. Enjoy this hot cock sucking action.",
  "models": [
    {
      "name": "Dallas Reeves",
      "person_id": 20480
    },
    {
      "name": "Grayson James",
      "person_id": 21693
    }
  ],
  "release_date": "2012-10-25",
  "scene_id": 2837051,
  "series": [
    "Gay Revenge"
  ],
  "tags": [],
  "title": "Open Up"
}