{
  "description": "When Jess found out we pay a referral to people who find us hot boys, his eyes got wide.\n\"Oh, man, dude,\" he said, in that fast-motion way of his. \"I could totally do that!\"\nSo he went home and talked it over with his girlfriend, who was also all about it.\n\"You mean all we have to do is find hot guys?\" she reportedly said.\nSo, the two of them put on their swim wear and flip-flops and bicycled down to the beach. They approached a few guys without success, and then they saw a cute guy with glasses and headphones, shirtless and by himself, reading a book.\nApparently, the girlfriend took the lead and went over to the guy. I don't know what she said, but it must have worked, because he let her take some pictures. She's really pretty, too, so I'm sure that didn't hurt!\nWhen I saw the pictures, I was impressed. The guy was clean cut, with a big, white smile, a handsome, chiseled face, and a lean, muscular bod. I was also impressed that Jess was so successful so quickly!\nSo, Jess set it up for me to meet him in person. Turns out his name is Ethan and he lives in a house by the beach with a bunch of other hot, young guys.\nEthan was super polite when we met and he ended his responses to my questions with \"sir.\"\nI got to know him a little better and then I asked if I could see him naked. Surprisingly he didn't hesitate or seem nervous at all. He simply smiled and said, \"Sure.\"\nHe stood up, undid his pant and let them drop. As he stood there butt-ass naked, I realized why he wasn't shy.\nHis dick is HUGE.\nEven soft, it hung halfway down his leg. Seriously.\n\"Want me to get hard?\" he asked, politely.\nHe did, and his monster got even bigger. It had to be at least nine inches, probably closer to ten. I was in heaven! Thank you, Jess!",
  "models": [
    {
      "name": "Ethan",
      "person_id": 712
    }
  ],
  "release_date": "2010-12-10",
  "scene_id": 1154,
  "tags": [
    "Big Dick",
    "Jock",
    "Solo",
    "Uncut"
  ],
  "title": "Ethan"
}