{
  "collections": [
    "Sean Cody"
  ],
  "description": "\"You have such low hanging balls!\" Phillip said as he saw Marshall's nuts for the first time. \"They better be filled up and ready to shoot!\"\nI knew this was going to be fun. They had barely met and already Phillip was an agressive little cock sucker!\n\"Yeah... all over your face!\" Marshall responded. Both of them laughed.\nWe were discussing some ideas for what we wanted to do. I decided to just throw it out there...\n\"How do you feel about getting rimmed? OK?\" I asked Marshall.\n\"Of course!\" he said.\nWell, that was easy! And I'm not really surprised that he knew what it meant, too!\n\"You better be!\" Phillip shouted from the other room. \"That furry ass looks delicious!\"\nSome guys might have been embarrassed, but not Marshall. He just laughed and shook his head.\nPhillip definitely took advantage of Marshall's hairy butt, giving it plently of attention. Not just eating it, but also tongue fucking it, and slapping it a lot!\n\"How do you like my blowjob skills?\" Phillip asked sheepishly while taking a break.\n\"Better than any girl who's ever sucked me off,\" Marshall said. \"Most girls use their teeth... but you go down all the way and no teeth. It's fucking great!\"\nMarshall got to where he was fucking Phillip's face so hard that every time Phillip tried coming off his huge cock for air, Marshall shoved him back on!\nFinally, Marshall couldn't hold it any more and he blew a huge load all over Phillip's face.\n\"Did you get that on film?\" Marshall asked.\n\"Get what?\"\n\"Where it was squirting way over his shoulders?\"\n\"Oh yeah. I definitely got it with my camera.\"\n\"Yeah. It was a lot,\" Marshall said with a big smile!",
  "models": [
    {
      "name": "Marshall",
      "person_id": 840
    },
    {
      "name": "Phillip",
      "person_id": 832
    }
  ],
  "release_date": "2012-04-15",
  "scene_id": 1403,
  "tags": [
    "Anal",
    "Behind the Scenes",
    "Big Dick",
    "Cum Swallowing",
    "Facials",
    "Jock",
    "Muscles",
    "Uncut"
  ],
  "title": "Marshall & Phillip"
}