{
  "collections": [
    "Sean Cody"
  ],
  "description": "There is a saying that \"opposites attract\" and with these two it couldn’t have been more true. Grayson brought his high, goofy energy, while Marshall brought his pure aggressive dominance. Mix those two together and you get a lot of fun!\nMarshall was carrying some stress from a busy week, and he was happy that Grayson offered to give him a massage.\n\"You have a flawless body,\" Grayson said, unable to keep his hands off Marshall. He was literally exploring every nook and cranny!\n\"Shhhh... go back to rubbing my back,\" Marshall winked at him, smiling and pulling his hands back on his bare skin.\nGrayson was chomping at the bit, until he saw Marshall's dick for the first time.\n\"Wow! I'm having second thoughts about being a bottom! That thing is HUGE!\"\n\"Yeah, it has its own heartbeat!\" Marshall replied. He loved the attention!\nFrom that point on it was almost impossible to get Grayson to do anything but play with Marshall's cock.\n\"Its huge,\" Grayson said. \"Its like my own personal play toy. I can slap it, wear it like a watch, bounce things off it, it's fucking ridiculous!\"\nOnce they started fucking, though, Grayson just focused on that huge cock penetrating his hole.\n\"How does it feel now that you've ridden it?\" I asked.\nHe took a deep breath and said, \"It feels sooooo fucking good!\"\n\"Biggest cock you've ever had in you?\"\n\"By a fucking mile!\"\nThe fucking went on, with both men sweating all over each other. It seemed each thrust went deeper than the previous one. Marshall was able to drill two loads out of Grayson's cock — back to back!\n\"I feel used and abused,\" Grayson moaned. \"And I like it!\" He rolled off the couch with a big smile and crawled, exhausted, into the other room!",
  "models": [
    {
      "name": "Grayson",
      "person_id": 793
    },
    {
      "name": "Marshall",
      "person_id": 840
    }
  ],
  "release_date": "2012-07-20",
  "scene_id": 1451,
  "tags": [
    "Anal",
    "Bareback",
    "Behind the Scenes",
    "Big Dick",
    "Jock",
    "Muscles"
  ],
  "title": "Marshall & Grayson: Bareback"
}