{
  "description": "Peter and Curtis are both very playful. They had purchased some new toys and couldn’t wait to try them out.\n“Let’s go fly a kite!” Curtis said with a smile.\n“Are you sure you know how to put these together?” Peter asked once they got outside. They seemed to be struggling.\n“I think I lost the directions,” Curtis admitted in his shy southern drawl.\n“Well, you know, I just need a really strong man, with some big muscles to help me out!” Peter was purposefully trying to get Curtis to crack up, and it was working!\nThey were hitting it off really well, but it was obvious that Curtis was getting antsy. Apparently, he had somehow caught a prior glimpse of Peter’s big cock.\n“It’s the only thing I can think about,” he whispered as we watched Peter run around the field, kite string in hand.\nOn the ride back to the house, the guys were very sharing...\n“I have trouble convincing people to give me head,” Peter said. “They complain and whine.”\nClearly, he hadn’t seen Curtis’ dick sucking abilities!\n“I’m really good at deep throating,” Curtis said, just barely avoiding eye contact with Peter. “I can take the whole thing and lick the balls at the same time.” Peter was intrigued!\nNow, we all knew that Curtis loves nothing more than to ride a nice big dick, and Peter definitely has a whopper. So Curtis wasted no time getting that dick balls deep into his hole!\n“You know you like that dick!” Peter was thrusting and talking dirty the whole time.\n“I love it. I fucking love this!” Curtis moaned while Peter dripped sweat all over him.\nAfter a few deep poundings, Curtis just starting spurting, hands free!\n“I couldn’t help it,” Curtis said, out of breath. “I think I died and went to heaven!”",
  "models": [
    {
      "name": "Curtis",
      "person_id": 462
    },
    {
      "name": "Peter",
      "person_id": 869
    }
  ],
  "release_date": "2012-08-09",
  "scene_id": 1461,
  "tags": [
    "Anal",
    "Bareback",
    "Behind the Scenes",
    "Big Dick",
    "Jock",
    "Red Heads"
  ],
  "title": "Peter & Curtis: Bareback"
}