{
  "collections": [
    "Sean Cody"
  ],
  "description": "“Well, well!” I said with my eyes wide. “Look who we have here.”\nBrodie rushed up out of his chair and gave me a big hug.\n“It’s really good to see you!” he said.\nIt had been a while. I had been trying to get him back repeatedly to, well, get fucked... raw. He had said ‘no’ many times, but I am persistent!\n“What if I put with you with someone who is really hot?” I asked him on the phone. “And nice too?”\nThere was a long pause. He didn’t say ‘no’ again and I knew what he was thinking.\n“What if he has a ‘husband-sized’ dick?”\nBrodie laughed. He knew what I meant. I joke sometimes that a ‘husband-sized’ dick is one that’s just the right size... not too big and not too small.\nSo that was why he was there, giving me a hug, ready to get fucked!\nBrandon was also there. “And you look happy!” I said to him.\n“I always am when I’m here,” he replied, looking at the floor. I’m always surprised that Brandon is so shy, especially considering how hot he is. However, he’s not shy when he’s naked and he was ready to fuck!\nWe didn’t waste any time, and it turned out that Brandon’s cock was a perfect match for Brodie. Brandon was pushing all the right buttons, because Brodie was close to cumming pretty much the entire time.\n“It feels weird, but in a good way,” he explained. “I feel tingly!”\n“It’s probably because he’s hitting your sweet spot!” I said.\nBrandon’s balls were slapping Brodie’s ass, and Brandon was pounding hard. Before we knew it Brandon was pushing his warm load into Brodie’s hole.\n“It feels like a warm ass massage!” Brodie said. He seemed to really enjoy knowing Brandon’s cum was deep inside him!",
  "models": [
    {
      "name": "Brandon",
      "person_id": 756
    },
    {
      "name": "Brodie",
      "person_id": 699
    }
  ],
  "release_date": "2012-08-29",
  "scene_id": 1471,
  "tags": [
    "Anal",
    "Bareback",
    "Behind the Scenes",
    "Jock",
    "Muscles"
  ],
  "title": "Brodie & Brandon: Bareback"
}