{
  "collections": [
    "Sean Cody"
  ],
  "description": "I recently took a trip down to Rio de Janeiro, Brazil because I hadn't had a vacation in a very, very long time. I had no intention of working while I was there, but I always believe in having my camera with me (just in case).\nLucky thing too, because Rio is man candy as far as the eye can see. When I arrived, my jaw just about hit pavement as we walked along the beach in Ipanema... just so many beautiful men! I approached a couple of them and I quickly discovered that most of them don't speak English. I don't speak Portuguese, but I wasn't about to let this opportunity pass me by. So, we set out searching for a translator.\nAfter a very curious sequence of events, we met a charming young lady who agreed to help us. With our new friend we set out to have some fun and see whom we could find.\nAs we were walking, I noticed a very attractive young man in the distance heading toward us. He was wearing nothing but board shorts and as he got closer, I saw that he was young, with a gorgeous face, thick curly hair, and a nice, defined body.\nTo make a long story short, we talked with him for a while and eventually headed back to our hotel. We found out that his name is Bruno and he is a student. He had lots of questions and we chatted for a long time... through our translator, of course, as Bruno knows very little English.\nBruno agreed to do a video for us, but he was very nervous. When we started, he was very stiff and uptight. He was quite fond of our translator friend, though, and before long he was rock hard and talking dirty to her in Portuguese. I had a video playing for him, but he was more interested in the real thing.\nI had a great time in Rio and I couldn't help recruiting a few more guys after Bruno (coming soon!). I guess if I want to get any rest on my next vacation I should consider going to the South Pole!",
  "models": [
    {
      "name": "Bruno",
      "person_id": 12
    }
  ],
  "release_date": "2003-07-11",
  "scene_id": 171,
  "tags": [
    "Jock",
    "Latin",
    "Solo"
  ],
  "title": "Bruno"
}