{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 110
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>I really enjoyed filming \"Rudy & Tyler\", so I thought it would be fun to add a couple more studs to the mix and have them fuck each other.</p>\n<p>Randy (the cute dark-haired one) had been eager to perform with Rudy. Jack (who is straight) just wanted to be in a movie.</p>\n<p>At first I was hesitant to include a straight boy because I wasn't sure how the dynamics would work. Sure enough, it was very awkward at first (notice in the first picture below that the three gay boys are on one side and Jack is on the other). Watch Jack's face in the first few minutes of the movie. He's really uncomfortable but he's making an effort to give it a try.</p>\n<p>I was really surprised at how Jack did. We had some pussy porn going for him in the background, but it wasn't long before he was ignoring it and enjoying the attention his young cock was receiving. The other guys seemed to like him and before I knew it Jack had his cock up Tyler's ass. The most amazing thing about Jack's performance, though, was the fact that he came three times... not bad for a straight boy!</p>\n<p>We had to shoot the end of this movie a little unconventionally. Everyone but Tyler had shot their loads and the room was hot and smelled like sex. Tyler is very sexy and he's a total bottom, but he's also very shy (go figure). We tried to get him to cum with everyone there, but he got real nervous and couldn't do it. Then we tried it with just Randy and me in the room. No good. Well, I just had to get him to cum, so I got out the trusty tripod and left Tyler alone with a porno and the sweat-soaked sheets. With the pressure off, he was able to bust his nut. Ah, amateur video!</p>",
  "models": [
    {
      "name": "Jack",
      "person_id": 18895
    },
    {
      "name": "Rudy",
      "person_id": 18481
    }
  ],
  "release_date": "2002-08-30",
  "scene_id": 2690291,
  "series": [],
  "tags": [
    "Gangbang",
    "Twink",
    "Muscular",
    "Anal"
  ],
  "title": "Fuckfest"
}