{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 484
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>God, the Midwest keeps pumping out some fucking hot young men!</p>\n<p>Danny had never been out of his home town, so coming to southern California was a big deal for him.  He was completely wide eyed and amazed at every little thing.  The palm trees, the beach, the blonde girls with the big boobs and butt tattoos &#8212; everything was new to this sexy little farm boy with the innocent smile.</p>\n<p>&ldquo;Do you have a girlfriend?&rdquo; I asked.</p>\n<p>&ldquo;Yes,&rdquo; he said, looking away.</p>\n<p>&ldquo;Does she know you&rsquo;re doing this?&rdquo;</p>\n<p>&ldquo;Yes, but she&rsquo;s not happy about it,&rdquo; he replied.</p>\n<p>That was the fun part about Danny.  Everything you asked him embarrassed the shit out of him. But you could tell he liked it.  He liked being dirty.</p>\n<p>It was mid-morning and we ended up taking him to a friend&rsquo;s pool.  We put him in a tight little swimsuit that barely covered anything.  He was splashing around, with a big smile on his face, having the time of his life.  Of course, I couldn&rsquo;t resist asking him to put on a little show.  He&rsquo;s got a sweet, tight ass and his balls are real nice too.</p>\n<p>While I'm filming I like to keep a tight leash on the guys.  If you give them too much freedom they get into trouble and fuck up the shoot.  Afterwards, though, I encourage them to have some fun and they inevitably find the part of town where the girls are easy and there is a bar on every corner.</p>\n<p>Danny was no exception.</p>\n<p>The morning after his shoot I called him to make sure he was ready to catch his flight.  I could tell by the tone of his voice that he was grinning from ear to ear.</p>\n<p>&ldquo;What&rsquo;s up with you?&rdquo;  I asked, &ldquo;You sound chipper&hellip;&rdquo;</p>\n<p>&ldquo;I met two girls last night.&rdquo;</p>\n<p>Apparently he fucked both of them all night, and in the ass too.  All of this after he&rsquo;d already gotten off twice in one day for me.  Man, to be 20 again&hellip;</p>",
  "models": [
    {
      "name": "Danny",
      "person_id": 17593
    }
  ],
  "release_date": "2007-05-29",
  "scene_id": 2693851,
  "series": [],
  "tags": [
    "Solo",
    "Muscular",
    "Athlete/Jock"
  ],
  "title": "Danny"
}