{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 491
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>I don't think I've ever worked so hard to hook up with a model!</p>\n<p>Roman is from Indiana, and he'd never flown before.  In fact, he'd never even been to an airport and was really afraid of the whole process. I kind of had to talk him through it and, to be honest, I wasn't sure if we'd ever actually get him out here.</p>\n<p>When he finally did arrive, though, this 20-year-old muscle boy's eyes were wide with excitement. He couldn't wait to see the ocean, so we took him there first. On the ride over, we learned that he's in college and is studying to become a P.E. teacher.</p>\n<p>&quot;So what do you do out in Indiana?&quot; I asked him.</p>\n<p>&quot;Well, I've fucked like three moms,&quot; he said, smiling.</p>\n<p>&quot;What do you mean?&quot; I asked.</p>\n<p>&quot;I fucked my best friend's mom and he was really pissed. He wanted to kick my ass...&quot; Interesting. </p>\n<p>So, we finally get to the ocean and Roman was like a little kid, splashing around in the waves.</p>\n<p>After tossing around a football with him I asked, &quot;What else do you like?&quot;</p>\n<p>&quot;I love Japanese culture.&quot;</p>\n<p>&quot;What do you like about it?&quot;</p>\n<p>&quot;I have, like, every Godzilla movie that's ever been made.&quot; Kind of a limited view of Japanese culture, but cute nonetheless!</p>\n<p>&quot;Do you want to have kids someday?&quot; I asked.</p>\n<p>&quot;Yeah, I want at least four kids. And my wife has to be Asian.&quot; Apparently, he loves the &quot;ethnic&quot; women.</p>\n<p>&quot;I want to, like, go around and just have sex... just... one girl from every race,&quot; he said with a big grin.</p>\n<p>God, he's cute. And I wanted to get him naked. I love naked flexing and Roman isn't shy at all.</p>\n<p>&quot;My nickname is 'Guns',&quot; he said, &quot;because of these bad boys here...&quot;</p>\n<p>He flexed his biceps and they stuck out like baseballs. &quot;Seventeen and a half inches all the way around,&quot; he said proudly.</p>\n<p>My favorite part, though, was Roman's cock...</p>",
  "models": [
    {
      "name": "Roman",
      "person_id": 18297
    }
  ],
  "release_date": "2007-06-19",
  "scene_id": 2693921,
  "series": [],
  "tags": [
    "Solo",
    "Muscular",
    "Athlete/Jock",
    "Behind The Scenes",
    "Big Dick"
  ],
  "title": "Roman"
}