{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 483
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>We had finished filming Rodney's solo video earlier that day and I was driving him to the airport. He was kind of subdued and I could see that he was absorbing the experience he had just had.</p>\n<p>&quot;So we'll see you again?&quot; I asked.</p>\n<p>&quot;Yeah, probably,&quot; he said, then smiled nervously.</p>\n<p>I waved to him as he collected his sole piece of luggage and headed to the gate. Man, I wanted to get him out again! Such a cute boy and flexible too.</p>\n<p>So, I waited a few days before I called him. You don't want to seem too desperate when talking straight boys out of their pants.</p>\n<p>&quot;You given any thought to what we talked about?&quot; I asked, taking the direct approach.</p>\n<p>&quot;What do you mean?&quot;</p>\n<p>&quot;You know... getting head from another guy...&quot;</p>\n<p>I'll forego posting a transcript of our conversation but suffice it to say Rodney was a tough sell. He was afraid that his buddies at school would find out. But I am nothing if not persistent...</p>\n<p>On the other side of the coin we have Cole. He's one guy who's definitely grown on me. I love his chiseled (but slightly nerdy) looks and bringing out the &quot;gay&quot; side of his &quot;bisexuality&quot; has definitely been fun!</p>\n<p>I knew that Cole would click with Rodney. I was hoping that a nice, oily massage and blow job would ease Rodney into the world of man sex. Oh yeah, and some rimming too...   </p>\n<p>&quot;Rodney, you ever had your ass eaten?&quot;</p>\n<p>&quot;No.&quot;</p>\n<p>&quot;Cole, you ever eaten an ass?&quot;</p>\n<p>&quot;Just a girl's.&quot; Hmm.</p>\n<p>And away they went. Damn, Cole had his face planted into Rodney's crack so hard I couldn't tell where one guy ended and the other began. And Rodney liked it too... his dick gave him away...</p>",
  "models": [
    {
      "name": "Cole",
      "person_id": 18111
    },
    {
      "name": "Rodney",
      "person_id": 17737
    }
  ],
  "release_date": "2007-05-25",
  "scene_id": 2693841,
  "series": [],
  "tags": [
    "Facial",
    "Swallow",
    "Massage",
    "Blowjob",
    "Athlete/Jock"
  ],
  "title": "Blowing Rodney"
}