{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 498
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Danny and Ford had met for the first time. Danny, from &quot;Hicksville&quot; (as he put it) and Ford, the ex-military guy who loves cars, were grinning at each other.</p>\n<p>&quot;So what are you doing with the money you're making?&quot; I asked Ford.</p>\n<p>&quot;Putting it into my Camaro,&quot; he replied. He gave a very technical explanation about how he had just modified and installed a super-charged Corvette engine. Now, I opened the hood of my car when I first bought it and haven't seen inside since. So I listened politely and pretended to understand...</p>\n<p>Danny seemed to be enjoying what Ford was saying.</p>\n<p>&quot;I like cars too,&quot; he said. He's so fucking cute!</p>\n<p>&quot;Ford, I would have never, never, never pegged you for someone who would be getting fucked. But here you are today!&quot; I said.</p>\n<p>&quot;Hey, it is what it is,&quot; he replied nonchalantly, smiling.</p>\n<p>&quot;How do you think it's going to be?&quot;</p>\n<p>&quot;I think it will be fun,&quot; he said.</p>\n<p>&quot;This is your first time?&quot;</p>\n<p>&quot;Yep.&quot; Big smile.</p>\n<p>Danny was grinning the whole time.</p>\n<p>&quot;What are you thinking about all of this?&quot; I asked.</p>\n<p>&quot;He seems like a cool guy,&quot; he said, referring to Ford. Danny smiled at Ford and Ford smiled back.</p>\n<p>Nice! So they were getting along at least.</p>\n<p>A little big of weight lifting to get the blood pumping and soon Danny had Ford pinned against the wall, probing his ass.</p>\n<p>Danny is a hot little top. I was really surprised at how much fun the two of them had...</p>",
  "models": [
    {
      "name": "Danny",
      "person_id": 17593
    },
    {
      "name": "Ford",
      "person_id": 17739
    }
  ],
  "release_date": "2007-07-13",
  "scene_id": 2693991,
  "series": [],
  "tags": [
    "Muscular",
    "Athlete/Jock",
    "Anal"
  ],
  "title": "Danny & Ford"
}