{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 477
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Woody is a straight guy who is very laid back. I met him in a night club where he was bartending. He had been partaking in the &quot;inventory&quot; (if you know what I mean) so he was a little buzzed and quite friendly.</p>\n<p>I  told him that I thought  he looks like a lot like Chris Evans from &quot;Fantastic Four&quot;. He replied that he gets that a lot. He was wearing a tight t-shirt and I asked him to lift it up so I could see how his body compared to Chris'. Lean build, hairy chest, and nice treasure trail... all there.</p>\n<p>Lest you think Woody was just a little too flirty for a straight guy, let me tell you that I had informed him about what I do early in the conversation. Of course, he was full of questions and as the conversation drew on his interest level increased.</p>\n<p>He wanted to know about pay and things like that and my stock answer is usually &quot;it depends.&quot; When he asked &quot;on what?&quot; I took the opportunity to say, &quot;on how big your dick is.&quot;</p>\n<p>He smiled and told me to lean forward. The club wasn't crowded at all and he opened up his pants slightly so I could see. Hairy bush, thick cock... all there. Man, I love impromptu shit like that. </p>\n<p>So we were both in agreement that he had to do a film.</p>\n<p>About a week later he was in the studio. I had him get undressed and the full, naked package was really, really nice. I love hairy chests and his really fit the bill.</p>\n<p>He didn't think that doing the shoot was going to be a big deal, but once the camera turned on he got a little shy and struggled for a bit. But part of my job is getting the guys to laugh and have fun and soon enough he was stroking away at his beautiful hard   dick...</p>",
  "models": [
    {
      "name": "Woody",
      "person_id": 19280
    }
  ],
  "release_date": "2007-05-08",
  "scene_id": 2693781,
  "series": [],
  "tags": [
    "Solo",
    "Hairy",
    "Athlete/Jock",
    "Big Dick"
  ],
  "title": "Woody"
}