{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 496
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Boyce recently started a new job that keeps him busy during the week. Fortunately, that means I get him on the weekends!</p>\n<p>It was a Saturday afternoon and he and Rodney were relaxing on the sofa.</p>\n<p>&quot;So what do you do at your new job?&quot; I asked.</p>\n<p>&quot;Accounting work.&quot;</p>\n<p>&quot;Sounds pretty stuffy,&quot; I joked. &quot;Do they know how much you like to get fucked?&quot;</p>\n<p>&quot;No.&quot; Boyce smiled. He has the cutest smile. Rodney was grinning from ear to ear.</p>\n<p>&quot;So Boyce,&quot; I said, changing the subject, &quot;Is your butt plug in?&quot;</p>\n<p>Rodney looked at Boyce and then looked at me. He wasn't sure what I was talking about. Boyce had a sheepish look on his face.</p>\n<p>&quot;Boyce likes to keep a butt plug in his ass for a while before a shoot,&quot; I explained to Rodney. &quot;It keeps him ready.&quot;</p>\n<p> I knew that's only part of the reason. Boyce loves having things in his ass.</p>\n<p>&quot;You have a dildo in your ass right now?&quot; Rodney asked.</p>\n<p>&quot;Yeah...&quot;</p>\n<p>They both laughed.</p>\n<p>&quot;Do you ever have the butt plug in at work?&quot; I asked.</p>\n<p>&quot;Sometimes,&quot; Boyce said (and I believed him).</p>\n<p>So, we got things set up and we were ready to go. The butt plug was still in.</p>\n<p>Boyce stood up, pulled down his pants, turned around, and there it was. He pulled at the base and out popped a pretty big butt plug.</p>\n<p>&quot;Damn,&quot; Rodney said.</p>\n<p>Next it was Rodney's turn to get naked. Off came the clothes and Boyce was staring intently at Rodney's cock and muscular body. They were both hard within a minute.</p>\n<p>Rodney is a gymnast and it shows. He stuck his cock in Boyce's hole and the hard fucking began. I love the positions Rodney chooses when he fucks. His whole body gets into it.</p>\n<p>Make sure that your speakers aren't turned up too high on this one. Boyce is a very vocal bottom!</p>",
  "models": [
    {
      "name": "Boyce",
      "person_id": 17709
    },
    {
      "name": "Rodney",
      "person_id": 17737
    }
  ],
  "release_date": "2007-07-06",
  "scene_id": 2693971,
  "series": [],
  "tags": [
    "Athlete/Jock",
    "Anal"
  ],
  "title": "Rodney & Boyce"
}