{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 506
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>I've known Gage for a while now, and I've never passed up an opportunity to ask him when he's going to give up his cherry.</p>\n<p>&quot;You know, people would love to see a dick up that muscle butt of yours,&quot; I said to him the last time he was out.</p>\n<p>But, he was training for a bodybuilding competition, then he was starting a new job in a hospital, and then it was some girl that wouldn't let him do it.</p>\n<p>Sometimes taking a break in a relationship is a good thing. I told him, &quot;Well, you have my number. If you're up for getting fucked then give me a call.&quot;</p>\n<p>So one night a few weeks ago my phone rang. It was Gage.</p>\n<p>&quot;Hey, do you have a cam?&quot; he asked.</p>\n<p>&quot;Yeah, I do,&quot; I said. He knows I do.</p>\n<p>&quot;Let me show you something.&quot;</p>\n<p>We connected up and there he was in his bedroom with his ass up in the air. He had a small butt plug in one hand which he inserted it into his ass as he looked back at the camera, smiling.</p>\n<p>Damn, he looked good. His fur was all grown back and he had been practicing with his hole.</p>\n<p>So he was ready. The only requirement he had was that he didn't want his first time to be with some guy who had a giant cock.</p>\n<p>My first thought was Danny. He's hung perfectly for breaking in a new bottom and he's so sweet he can make anyone feel comfortable.</p>\n<p>Finally, they met. I had them hang out for a while the night before their shoot. The next morning I asked them how they got along.</p>\n<p>&quot;I know he likes Mustangs, so he's a good guy. That's my type I guess,&quot; Danny said.</p>\n<p> Gage laughed.</p>\n<p>&quot;That's kind of weird coming from a straight guy,&quot; he said.</p>\n<p>&quot;We're both <strong>basically</strong> straight,&quot; Danny said.</p>\n<p>&quot;Yeah, we're both basically bitches,&quot; Gage added.</p>\n<p>They began to kiss awkwardly as they got undressed. Gage took Danny's cock pretty easily. I guess all that practice at home paid off... </p>",
  "models": [
    {
      "name": "Danny",
      "person_id": 17593
    },
    {
      "name": "Gage",
      "person_id": 17943
    }
  ],
  "release_date": "2007-08-10",
  "scene_id": 2694071,
  "series": [],
  "tags": [
    "Hairy",
    "Muscular",
    "Athlete/Jock",
    "Anal"
  ],
  "title": "Gage Gets Fucked"
}