{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 505
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Nicolas is a 22-year-old student who is currently pursuing a  Master&rsquo;s degree in Chemical Engineering.</p>\n<p>He&rsquo;s incredibly smart, and definitely full of surprises.</p>\n<p>With clothes on, he&rsquo;s a little bit on the cute-dorky side.&nbsp; I was really curious as to what he looked  like naked, so I had him strip down.</p>\n<p>&ldquo;Wow, you&rsquo;ve got a pretty full bush there!&rdquo; I said. (And he did. If you&rsquo;re a bush lover you&rsquo;re in for a treat!)</p>\n<p>&ldquo;Yeah, I can shave it if you want,&rdquo; he said.</p>\n<p>&ldquo;No, no. It&rsquo;s really  sexy on you. I like the hairy legs too.&rdquo;</p>\n<p>Now I thought I had seen everything. Lots of times guys will bring their own lube,  or their own porn, and on more than one occasion, their own fluffer. But here was a first&hellip;</p>\n<p>&ldquo;I wanted to ask you about something,&rdquo; he said with a sheepish look on his face.</p>\n<p>&ldquo;Yeah?&rdquo;</p>\n<p>&ldquo;I brought a toy with me that I&rsquo;d like to use.&nbsp; It helps me get off.&rdquo;</p>\n<p>&ldquo;OK, let me see it,&rdquo; I said.</p>\n<p>So he went to his luggage, fished around a bit, and then  pulled out the biggest, bluest dildo I think I&rsquo;ve ever seen. The fucker must have been at least 8 inches in circumference.</p>\n<p>&ldquo;Wow, OK, that&rsquo;s big,&rdquo; I said. My first thought was that it might be a  little too extreme.</p>\n<p>But there he was, standing butt-ass naked, holding his toy,  with the cutest smile on his face. How could I refuse?</p>\n<p>We started filming and he was rubbing lube all over his toy. He got excited really quickly and then all of  a sudden he blew a big load of cum all over his toy. Then he laid back on the bed and rested for a minute.</p>\n<p>Now this next part is  hard to believe, but I  swear it&rsquo;s true. He grabbed his toy, and  without any preparation and using only his own cum as lube, he stuck the thing  right up his ass. He then fucked himself with it for 20 minutes or so before he blew another load. Fucking amazing&hellip;</p>\n<p>Nicolas says he&rsquo;s straight. I&rsquo;m just the messenger.</p>",
  "models": [
    {
      "name": "Nicolas",
      "person_id": 17945
    }
  ],
  "release_date": "2007-08-07",
  "scene_id": 2694061,
  "series": [],
  "tags": [
    "Solo",
    "Sex Toys"
  ],
  "title": "Nicolas"
}