{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 575
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Emory is a fan of the website. He'd contacted us a while back and the thing that impressed me the most about him was his enthusiasm.</p>\n<p>He likes to be submissive and he likes to get fucked. Hard.</p>\n<p>&quot;I'm a little nervous,&quot; he told me the first time we met.  &quot;This is my first time on film.&quot;</p>\n<p>He was, however, very excited to be with Harley.  He confided that he's had a crush on Harley since he first appeared on the site.</p>\n<p>Like other viewers, he had lots of questions about Harley.  But one of them stood out more than the others:</p>\n<p>&quot;Do you think he can be aggressive with me?&quot; he asked.</p>\n<p>&quot;Yeah, I'm sure he can,&quot; I replied. &quot;What did you have in mind?&quot;</p>\n<p>Well, he wanted his hair grabbed, for starters, and he wanted Harley to slap his ass while he fucked him.</p>\n<p>Harley's up for (almost) anything, so I knew it wouldn't be problem.</p>\n<p>&quot;I'm always having a good time here,&quot; Harley said after they finally met. They were hitting it off pretty well, joking and kidding around.</p>\n<p>We got them to talk about what they like.</p>\n<p>&quot;I actually kind of like eating ass,&quot; Emory said, &quot;the most, honestly.&quot;</p>\n<p>Always direct and ready to start fucking, Harley said, &quot;I want a blow job and a little ass eating.&quot;</p>\n<p>From the start, Emory said he wanted to be fucked hard. Harley did just that &#8212; hard, deep, and long.</p>\n<p>I don't think I've ever seen a bottom have so much fun!</p>",
  "models": [
    {
      "name": "Emory",
      "person_id": 18107
    },
    {
      "name": "Harley",
      "person_id": 17735
    }
  ],
  "release_date": "2008-01-31",
  "scene_id": 2694761,
  "series": [],
  "tags": [
    "Athlete/Jock",
    "Anal",
    "Big Dick",
    "Uncut"
  ],
  "title": "Harley & Emory"
}