{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 500
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>It's hard to believe, but this week's update marks our <strong>500th film</strong>! I can't wait to see what (and whom) the next 500 brings! </p>\n<p>Now I am particularly fond of this episode because it's kind of a story of two worlds meeting.</p>\n<p>Brady is a gym rat  and bad boy who isn't big on conversation. William is a college gymnast who is a bit of a bookworm.</p>\n<p>I loved Brady's first video. As you may remember, Brady ejaculated in a glass of water and then spontaneously drank the water. One of my camera guys accidentally caught the drinking part on film. At the time, Brady asked that we not use it, but didn't give a reason why.</p>\n<p>I watched the footage of him drinking this water he'd just ejaculated into and it was hot! Shaky, but hot. I was curious as to why Brady didn't want it shown so I gave him a call.</p>\n<p>&quot;So, what's this I hear about you not wanting people to see you drinking your cum?&quot; I asked.</p>\n<p>&quot;I dunno. I don't want people to think I'm dirty.&quot;</p>\n<p>But he is a dirty boy! And that's what I like most about him (OK, besides the muscles bulging everywhere).</p>\n<p>It wasn't hard to convince him that it would make a hot end to a hot video.</p>\n<p>&quot;While I have you on the phone,&quot; I said, &quot;I have a hot little gymnast that I want you to come out here and fuck.&quot;</p>\n<p>&quot;OK&quot;</p>\n<p>Easy enough. And the hot little gymnast I had in mind was William.</p>\n<p>As fate would have it, both of them were on the same connecting flight into San Diego. They'd seen each other in pictures and had already connected on the flight.</p>\n<p>I picked them up at the airport and the minute we got into the SUV Brady's hand was on William's thigh.</p>\n<p>&quot;OK, you guys need to be good tonight, right?&quot; I admonished. Sometimes it's so fucking hard to keep horny boys apart.</p>\n<p>They agreed and got dropped off at separate hotels.</p>\n<p>The next morning they were all smiles. Brady is kind of quiet, but aggressive nonetheless. He just couldn't wait to get his dick up William's ass...</p>",
  "models": [
    {
      "name": "Brady",
      "person_id": 17633
    },
    {
      "name": "William",
      "person_id": 18489
    }
  ],
  "release_date": "2007-07-20",
  "scene_id": 2694011,
  "series": [],
  "tags": [
    "Muscular",
    "Athlete/Jock",
    "Anal"
  ],
  "title": "Brady & William"
}