{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 527
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Danny gets fucked &#8212; by Parker!</p>\n<p>I've grown quite attached to Danny and I really wanted his &quot;first time&quot; to be something special.</p>\n<p>The big question: who was going to  take his cherry? I wanted someone who was experienced, who would be aggressive, but gentle when necessary. I wanted someone who could give Danny's hole what it needed.</p>\n<p>I thought about it and thought about it and the guy who kept coming to mind was Parker. He's a pro at making people feel relaxed and he's got an incredible set of equipment that can really do the job.</p>\n<p>I also wanted the location to be special. So, we loaded up the SUV and took off for my friend's lakeside condo in the Sierra Nevada Mountains.</p>\n<p>It was a hot summer day and the guys wanted to play around a bit before they had sex. We had a kayak which they took into the water, followed by some skinny dipping and diving.</p>\n<p>Danny didn't seem nervous. But then he never does.</p>\n<p>On the way back to the hotel Danny and Parker were cracking jokes about how they were going to do it.</p>\n<p>&quot;Are you horny?&quot; I asked Parker.</p>\n<p>&quot;Yeah, man, I can't wait. I need to fuck.&quot;</p>\n<p>Danny giggled, then looked out the window. &quot;Yeah, I'm pretty horny too. I hope it doesn't hurt too much,&quot; he said.</p>\n<p>&quot;I'll be gentle &#8212; at first!&quot; Parker said. Such a nurturer!</p>\n<p>Back at the condo the boys took a shower and soaped each other up. Then Parker started to explore Danny's asshole.</p>\n<p>Then, when Danny was ready, Parker slid his big cock right into Danny. There was a little pain at first, but then Danny just seemed to let go and enjoy it...</p>\n<p>It was a beautiful thing!</p>",
  "models": [
    {
      "name": "Danny",
      "person_id": 17593
    },
    {
      "name": "Parker",
      "person_id": 17723
    }
  ],
  "release_date": "2007-10-04",
  "scene_id": 2694281,
  "series": [],
  "tags": [
    "Muscular",
    "Athlete/Jock",
    "Anal"
  ],
  "title": "Danny Gets Fucked!"
}