{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 501
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Rory is a laid-back straight guy who loves to bicycle.&nbsp; He is a friend of another model and he&rsquo;s  local, so I asked him to come in for a meeting.</p>\n<p>He arrived on his bicycle, almost 45 minutes late, wearing  nothing but skimpy runner&rsquo;s shorts.&nbsp; He  was really, really sweaty (it was the middle of summer) and as he dismounted  his bike he took a tank top out of his pack and put it on.</p>\n<p>&ldquo;Dude, sorry about that,&rdquo; he said as he walked in.</p>\n<p>&ldquo;That&rsquo;s OK,&rdquo; I said, eyeing his muscular, sweaty body.&nbsp; &ldquo;Do you bicycle everywhere?&rdquo;</p>\n<p>&ldquo;Yeah, dude, I don&rsquo;t even own a car.&rdquo;</p>\n<p>So I got Rory some water and we sat down at a table to talk.&nbsp; I noticed right away that he had a big scrape  on his forearm.</p>\n<p>&ldquo;How did you get that?&rdquo; I asked, pointing at the injury.</p>\n<p>&ldquo;Oh, I got this last week,&rdquo; he replied.&nbsp; &ldquo;I was getting a little gnarly around a  corner and went down pretty hard.&rdquo;</p>\n<p>&ldquo;I dunno,&rdquo; I said.&nbsp; &ldquo;We  might want to let that heal up before we film you.&rdquo;</p>\n<p>&ldquo;OK, dude, whatever.&nbsp;  But the girls think it&rsquo;s hot&hellip;&rdquo;</p>\n<p>He had a big smile on his face as he looked at the scrape  and then looked up at me.&nbsp; It just  worked.</p>\n<p>&ldquo;OK, we&rsquo;ll leave it,&rdquo; I said.&nbsp; &ldquo;Speaking of girls, do you have a girlfriend?&rdquo;</p>\n<p>&ldquo;Ummm, I have a chick I&rsquo;m fucking three times a week,&rdquo; he  said.</p>\n<p>&ldquo;But she&rsquo;s not your girlfriend?&rdquo;</p>\n<p>&ldquo;No.&rdquo;</p>\n<p>So, the next day we filmed Rory, scrape and all.</p>\n<p>Of course, I couldn&rsquo;t resist taking him out into the woods.&nbsp; He was all over the place with his bike.&nbsp; It was hot and he was sweating.</p>\n<p>Afterward, I took his hot, sweaty ass to a friend&rsquo;s empty  garage.</p>\n<p>&ldquo;Damn, dude, you got a thick cock!&rdquo; I commented as he was  stroking it.&nbsp; &ldquo;How do you get that shit  in your friend&rsquo;s pussy?&rdquo;</p>\n<p>He just smiled, tensed up, and then dumped his load all over  his bicycle seat&hellip;</p>",
  "models": [
    {
      "name": "Rory",
      "person_id": 18679
    }
  ],
  "release_date": "2007-07-24",
  "scene_id": 2694021,
  "series": [],
  "tags": [
    "Solo",
    "Muscular",
    "Athlete/Jock",
    "Big Dick"
  ],
  "title": "Rory"
}