{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 524
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>As our visit at the desert house was winding down, we were sitting around bullshitting, eating, and drinking beer. Billy, Terry, and Ford were there. It was late afternoon. The sky was dark and foreboding, and the smell of rain was in the air.</p>\n<p>We were giving Billy a hard time. He's openly advertised that he's a bottom.</p>\n<p>&quot;You have a nice dick,&quot; Terry said to Billy. &quot;You should fuck someone with it.&quot;</p>\n<p>Terry smiled. We all knew what he meant.</p>\n<p>Now, we hadn't really planned on doing a film that afternoon. We had already shot that morning.</p>\n<p>But when you have two gay guys and an open (?) one sitting around drinking beer things are bound to happen.</p>\n<p>Terry wanted to get fucked. That was all there was to it. And Billy, shy as  he is, wanted to take him up on his dare.</p>\n<p>The guys went outside for a dip in the pool and within a few minutes, it was a torrential downpour. But the guys were laughing and playing around in the water. Then they started making out.</p>\n<p>I have to tell you &#8212; seeing these three hot guys all over each other in the rain was one of the most erotic things I've ever seen!</p>\n<p>Then they moved inside. To be honest, we didn't have time to set up the lights because we didn't want to break the mood. So the lighting isn't perfect.</p>\n<p>But it's a fun impromptu fuck session that shows Billy really can top!</p>",
  "models": [
    {
      "name": "Billy",
      "person_id": 17931
    },
    {
      "name": "Ford",
      "person_id": 17739
    },
    {
      "name": "Terry",
      "person_id": 17625
    }
  ],
  "release_date": "2007-09-26",
  "scene_id": 2694251,
  "series": [],
  "tags": [
    "Gangbang",
    "Facial",
    "Swallow",
    "Twink",
    "Muscular",
    "Athlete/Jock",
    "Anal",
    "Sex Toys"
  ],
  "title": "Billy, Terry & Ford"
}