{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 680
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Ross is back!!!!</p>\n<p>It has been an unbelievable three years since we last saw Ross, our tall, lanky hunk with the monster cock.</p>\n<p>As I recall, he had disappeared because of a girlfriend or something. Those damn girlfriends!</p>\n<p>I always get a big kick out of hearing from my old school guys. Kind of out of the blue, Ross sent me an e-mail (still using his same e-mail address no less) asking me if I'd be interested in casting him again.</p>\n<p>I was really excited to see what he looked like. People can change a lot in three years and you just never know. I asked him to send me some recent photos, which he did, and it didn't look like he'd changed all that much.</p>\n<p>And, most importantly, his dick was still huge!</p>\n<p>When he finally did arrive, it was like no time had passed at all. He did look a little more mature, but the most sup rising change was in his personality. He was such more mellow and calm!</p>\n<p>We hadn't really talked via e-mail about what he was going to do. In person, he asked about getting fucked.</p>\n<p>I immediately remembered the last time he got it up the ass, which was an intense experience to say the least.</p>\n<p>But after talking to him for a bit and getting to know this new Ross, I almost felt like he was asking because he really wanted to do it.</p>\n<p>I wanted to put Ross with a newbie. And Jake was the first guy to come to mind. They both have have tall, lean builds and they both have big, thick cocks!</p>\n<p>We didn't make any plans beforehand as to who was going to do what. Both Ross and Jake were up for fucking or getting fucked.</p>\n<p>Did someone say flip-flop?!!</p>\n<p>I think that this new Ross makes a    really good bottom. With his first time long since out of the way, he really seemed to just relax and enjoy it.</p>\n<p>I was really surprised when he kept asking Jake to &quot;<strong>put it all the way in</strong>,&quot; to &quot;<strong>go faster</strong>,&quot; and to &quot;<strong>do it harder</strong>!&quot;</p>",
  "models": [
    {
      "name": "Jake",
      "person_id": 18123
    },
    {
      "name": "Ross",
      "person_id": 18733
    }
  ],
  "release_date": "2008-10-03",
  "scene_id": 2695811,
  "series": [],
  "tags": [
    "Athlete/Jock",
    "Big Dick",
    "Uncut",
    "Flip Flop"
  ],
  "title": "Ross & Jake"
}