{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 792
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Man am I excited about this one!</p>\n<p>In his short time with us, Matt has become  one of my all-time favorite guys. And what's not to like? A perfect, muscular body on a hot nerd-jock nice guy. And a big, luscious dick on top of it all!</p>\n<p>From the beginning, I was teasing him about how hot it would be for him to do another guy.</p>\n<p>&quot;God,&quot; I told him. &quot;Do you know how many people would love to see you get in on with another guy?&quot;</p>\n<p>&quot;Oh, I dunno,&quot; he said, being coy. &quot;I'm not sure that's something I could do.&quot;</p>\n<p>But I had spent quite a bit of time with him myself, and I quickly realized that 1) he is very proud of his body, and rightly so; and 2) he isn't shy.</p>\n<p>So over dinner he started asking questions.</p>\n<p>What would he have to do? What would it would be like? And so forth...</p>\n<p>We talked and talked, and finally the ground rules were set. He didn't want to get fucked, but anything else was OK.</p>\n<p>&quot;I love to fuck a nice hole,&quot; he said, laughing in a way that almost signaled relief. &quot;I think this is going to be fun!&quot;</p>\n<p>I wanted to set him with someone who had experience getting fucked. After all, I wanted Matt's first experience to be very easy. You know, slip it in and go to town!</p>\n<p>Of course, the first guy who came to mind was Tobey. He doesn't have the charisma of Harley, for example, but stick a nice big dick in him and he's in heaven!</p>\n<p>I think Matt really enjoyed fucking Tobey. I think that the only thing he didn't like was the condom. After all, he's used to raw butt sex with his girlfriend(s)!</p>",
  "models": [
    {
      "name": "Matt",
      "person_id": 17621
    },
    {
      "name": "Tobey",
      "person_id": 18029
    }
  ],
  "release_date": "2009-05-01",
  "scene_id": 2696931,
  "series": [],
  "tags": [
    "Twink",
    "Muscular",
    "Athlete/Jock",
    "Anal",
    "Big Dick"
  ],
  "title": "Matt & Tobey"
}