{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 746
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>I read and hear a lot of comments from people about the sexual orientation of the guys on this site. Often times it's something like &quot;All your guys must be gay because straight men don't suck cock,&quot; or &quot;Straight men don't get fucked.&quot;</p>\n<p>I think it's funny that people would think that. Hell, I'm 100% gay and I've had sex with a chick or two in my time! So why not the other way around? </p>\n<p>I've said it before: I'm just the messenger. The guys tell me what they're into and I report it. I respect what they tell me and don't make public assumptions about its veracity.</p>\n<p>That said, I also find that some guys come in and identify with one side of the spectrum and then end up on the other side (or somewhere in between). And they admit it. That's when things get really fun!</p>\n<p>When Curtis first came in he had a girlfriend and he said he was straight. He fucked another guy and then got fucked and then got fucked again. And each time it became increasingly obvious that he liked it.</p>\n<p>So as he was sitting on the bed next to Shane, it was not a surprise when he said, &quot;I love what I do here.&quot;</p>\n<p>To which Shane added: &quot;I do too. It's pretty fun.&quot;</p>\n<p>So it was time to corner Curtis just a little bit and ask him where he thought he was sexually.</p>\n<p>&quot;I'm bi,&quot; he said quietly.</p>\n<p>&quot;Yeah, I'm bi too,&quot; Shane     said. &quot;Well, more gay actually.&quot;</p>\n<p>Then we asked Curtis what he liked best.</p>\n<p>&quot;I'm a bottom,&quot; he said, totally comfortable with the vernacular. &quot;I like the way it feels.&quot;</p>\n<p>&quot;You like getting roughed up?&quot; our camera guy asked.</p>\n<p>&quot;Yeah,&quot; he said with a smile...  </p>",
  "models": [
    {
      "name": "Curtis",
      "person_id": 17769
    },
    {
      "name": "Shane",
      "person_id": 18005
    }
  ],
  "release_date": "2009-01-29",
  "scene_id": 2696471,
  "series": [],
  "tags": [
    "Red Head",
    "Athlete/Jock",
    "Anal",
    "Big Dick"
  ],
  "title": "Shane & Curtis"
}