{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 816
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Pete met Harley a few months ago, before they got together to do this film.</p>\n<p>There were both out over the weekend doing separate films, but ran into each other at the pool. I think the guys have learned that when they see another hot guy at the hotel, the chances are high they are here for us!</p>\n<p>Anyway, they struck up a conversation and spent the afternoon hanging out.</p>\n<p>Apparently, Harley made a big impression on Pete.</p>\n<p>I was talking to Pete the day after he met Harley, and Pete kept hinting that he wanted to be in a film with Harley. Finally, he just came right out and said it.</p>\n<p>I was making him work for it, because I suspected one thing:</p>\n<p>&quot;You have a little crush going there, don't you?&quot; I asked with a smile.</p>\n<p>&quot;Yeah,&quot; Pete said. &quot;I really like him.&quot;</p>\n<p>So I knew I wanted to get them together. However, Harley is busy with a lot of different things, so it can take some time to get his sexy ass out here.</p>\n<p>I don't know for sure, but I think that the two of them had exchanged numbers and were talking in the meantime. Because it seemed every time I saw Pete he was more anxious to hook up with Harley.</p>\n<p>So the day finally arrived, and we just had to tease Pete a little:    </p>\n<p>&quot;So is it true that you have a little man crush on Harley here?&quot;</p>\n<p>&quot;A little bit,&quot; he said with a shy smile on his face. </p>\n<p>&quot;What do you find attractive about him?&quot;</p>\n<p>&quot;Everything!&quot; he said. Straight to the point! </p>\n<p>I could tell Harley was flattered. But he's hot so he probably gets that all the time! </p>\n<p>&quot;I'm looking forward to having a good time,&quot; Harley said. &quot;It looks like Pete is going to enjoy today and I think I'm going to do the same.&quot;</p>\n<p>Awwww!</p>\n<p>&quot;I'm anxious,&quot; Pete replied. &quot;I want to do this...&quot;</p>\n<p>&quot;Have you seen his weiner yet?&quot; we asked. </p>\n<p>&quot;I have,&quot; Pete said.</p>\n<p>Hmmm. Wonder when that took place?  </p>\n<p>&quot;How big is it?&quot;</p>\n<p>&quot;It's pretty big,&quot; Pete replied. &quot;So yeah, I'm eager...&quot;</p>",
  "models": [
    {
      "name": "Harley",
      "person_id": 17735
    },
    {
      "name": "Pete",
      "person_id": 17653
    }
  ],
  "release_date": "2009-06-10",
  "scene_id": 2697171,
  "series": [],
  "tags": [
    "Facial",
    "Twink",
    "Athlete/Jock",
    "Anal",
    "Behind The Scenes",
    "Big Dick"
  ],
  "title": "Pete & Harley"
}