{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 877
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Hot daddy!</p>\n<p>OK, so Dennis is only 30, and that's a little young to be considered a &quot;daddy.&quot;</p>\n<p>But he's just so nice and sweet and calm, and he has a very &quot;wise&quot; way about him.</p>\n<p>I liked him the minute I met him. He just has one of those personalities.</p>\n<p>Dennis currently lives in the midwest and has been there for about ten years. But he was born and raised in the south.</p>\n<p>He's lost his accent, but his roots are very apparent.  </p>\n<p>I took him out to dinner the evening he arrived. We went to a seafood restaurant and he ordered Texas red fish with fried green tomatoes, creamed corn, and rock shrimp!</p>\n<p>His career path has led him down some interesting roads:  </p>\n<p>&quot;When I got out of high school I went into the Air Force,&quot; he said. &quot;I did exercise physiology.&quot;</p>\n<p>After that he did a stint as an accountant at his father's (high-end) motorcycle dealership, and then he found his true love: being a motorcycle mechanic.</p>\n<p>He seemed very open-minded to me, and had an interesting comment when I asked him about:</p>\n<p>&quot;I am Ronald Reagan conservative from the neck up,&quot; he said, laughing. &quot;From the neck down, well, that's another story.&quot;</p>\n<p>He says he's straight, but likes to try new things. Awesome!</p>\n<p>He told us he's watched gay porn and actually enjoyed it, especially when it was in the company of his girlfriend.</p>\n<p>&quot;It gave her ideas,&quot; he said.</p>\n<p>One of those ideas: an 8-inch strap-on which she used to fuck him.</p>\n<p>&quot;It hurt at first,&quot; he said. &quot;But then it felt really good!&quot;</p>",
  "models": [
    {
      "name": "Dennis",
      "person_id": 17727
    }
  ],
  "release_date": "2009-09-18",
  "scene_id": 2697781,
  "series": [],
  "tags": [
    "Solo",
    "Old",
    "Muscular",
    "Big Dick"
  ],
  "title": "Dennis"
}