{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 949
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Gabe is 18, and just graduated from high school this spring.</p>\n<p>&quot;I was kind of the cool kid on campus,&quot; he said, describing his experience. &quot;So everyone knew who I was.&quot;</p>\n<p>For such a young guy, though, he seems to have a pretty good head on his shoulders.</p>\n<p>He just started college and he already knows what he wants to do.</p>\n<p>&quot;I want to be in Human Physiology,&quot; he said. &quot;So I'm going to go into either Sports Medicine or Orthotics.&quot;</p>\n<p>He's not shy and once he agreed to meet us he didn't have a problem telling people he knew.</p>\n<p>&quot;Yeah, a couple of friends know,&quot; he explained. &quot;And my dad knows, but not my mom.&quot;</p>\n<p>Unusual, but it's cool that he has such a close relationship with his father!</p>\n<p>&quot;I just told my dad that I'm basically going to film porn,&quot; he said. &quot;He was like, 'Hey if I could be a porn star I'd be one too, but I'm 50!'&quot;</p>\n<p>Another interesting thing about Gabe is that he says he's &quot;a little bit bisexual.&quot;</p>\n<p>When we asked him what kind of guys he likes he said: &quot;Ummm, tan guys. Latin, Italian.&quot;</p>\n<p>He doesn't have a lot of experience yet.</p>\n<p>&quot;I've only done something with another guy one time... and I definitely liked topping.&quot;</p>\n<p>So they fucked!</p>\n<p>The guy was someone he knew from school, and the encounter started off with a game of &quot;you show me yours and I'll show you mine!&quot;</p>\n<p>&quot;He started sucking me off first,&quot; Gabe said.</p>\n<p>&quot;Did you suck him off?&quot;</p>\n<p>&quot;Yeah, I did.&quot;</p>\n<p>&quot;How did you like sucking a dick?&quot;</p>\n<p>&quot;I was a little weird, but I still like a dick in my mouth for some reason.&quot;</p>\n<p>&quot;What's something you're looking forward to?&quot;</p>\n<p>&quot;I've never had balls in my mouth, so maybe that...&quot;</p>\n<p>Cool!</p>",
  "models": [
    {
      "name": "Gabe",
      "person_id": 18653
    }
  ],
  "release_date": "2010-01-09",
  "scene_id": 2698491,
  "series": [],
  "tags": [
    "Solo",
    "Latin",
    "Athlete/Jock",
    "Big Dick"
  ],
  "title": "Gabe"
}