{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1064
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Talk about your tall, dark and handsome! Jonathan is a confident, masculine, &ldquo;guy&rsquo;s guy&rdquo; who has experimented with both girls and guys. Admittedly, he prefers sex with guys, even though he&rsquo;s somewhat new to gay sex. </p>\n<p>&ldquo;So what&rsquo;s your favorite thing you&rsquo;ve done with a guy?&rdquo;</p>\n<p>&ldquo;Double penetration,&rdquo; he replied. </p>\n<p>&ldquo;Really! Were you being double penetrated or...&rdquo;</p>\n<p>&ldquo;I was NOT being double penetrated, fortunately,&rdquo; he smiled. &ldquo;It was actually my friend.&rdquo; </p>\n<p>Wow, that&rsquo;s quite the friend. Jonathan has obviously met a cast of characters for just being 22. It&rsquo;s no surprise given he&rsquo;s traveled all over the world. He spent a year studying in Japan and actually speaks Japanese. He hasn&rsquo;t decided what he wants to do yet for a career, but he knows it&rsquo;s going to be something in the health field. </p>\n<p>He&rsquo;s also an avid runner and his body definitely shows it. He&rsquo;s in great shape, ripped, lean, big calves and a nice meaty ass. When he flexes you can see the definition in almost every muscle. Add to that, his big, thick, rock hard cock that shoots quite the load and you've got the complete package.</p>\n<p>After he shot his first load, I took him to a park for a nice run by the beach. Still full of energy, I could tell he was anxious to blow another load. Jonathan&rsquo;s primarily been a top with guys, but on rare occasion he bottoms. I asked him if he ever bottomed for a guy who had a bigger dick than his.</p>\n<p>&ldquo;Once,&rdquo; he said.</p>\n<p>&ldquo;How was it?&rdquo;</p>\n<p>&ldquo;Pretty painful,&rdquo; he said. </p>\n<p>&ldquo;Think you&rsquo;d do it again?&rdquo;</p>\n<p>He laughed. &ldquo;Possibly.&rdquo; </p>\n<p>That&rsquo;s what I like to hear!</p>",
  "models": [
    {
      "name": "Jonathan",
      "person_id": 19059
    }
  ],
  "release_date": "2010-07-08",
  "scene_id": 2699641,
  "series": [],
  "tags": [
    "Solo",
    "Twink",
    "Big Dick"
  ],
  "title": "Jonathan"
}