{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1086
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Esteban and Jamie have a lot in common. They both wrestled in high school, and both are extremely hot and very horny! I thought it would be fun to get them together and although Jamie has always liked to get fucked by  very large cocks (like Esteban&rsquo;s), this time I wanted to let Jamie expand his horizons. Jamie and I were both very excited as this would be Jamie's first time as a top! </p>\n<p>&ldquo;Well, I&rsquo;m usually the top,&rdquo; Esteban said, referring to his limited experience so far. &ldquo;But today, I&rsquo;m going to do something new.&rdquo; </p>\n<p>&ldquo;Are you excited, a little nervous, what&rsquo;s going through your head?&rdquo;</p>\n<p>&ldquo;I&rsquo;m a little nervous,&rdquo; he replied. </p>\n<p>Jamie was really sweet with Esteban &#8212; making out with him and sucking his cock. I saw Jamie&rsquo;s eyes when he noticed how large Esteban&rsquo;s cock is &#8212; almost as if he was second-guessing being a top this time around!</p>\n<p>Esteban   worked Jamie&rsquo;s dick with his lips and tongue before sitting on it. I was surprised by how good Jamie was at fucking, and Esteban really seemed to enjoy it! </p>\n<p>Jamie pounded into Esteban and  stroked his big uncut dick, until finally Esteban came while Jamie was still inside him. Jamie eagerly licked up Esteban&rsquo;s cum and then gave him a long, deep kiss.</p>\n<p>Esteban finished Jamie off by fingering his asshole, making Jamie shoot his load all over his stomach. Although I still think Jamie loves to get fucked, he definitely loved this taste of something new!</p>",
  "models": [
    {
      "name": "Esteban",
      "person_id": 18669
    },
    {
      "name": "Jamie",
      "person_id": 17733
    }
  ],
  "release_date": "2010-08-15",
  "scene_id": 2699861,
  "series": [],
  "tags": [
    "Swallow",
    "Latin",
    "Athlete/Jock",
    "Anal",
    "Big Dick",
    "Uncut"
  ],
  "title": "Jamie & Esteban"
}