{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1047
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Yuri had so much fun on his last visit, he was really excited to come back. He&rsquo;s a lot of fun to be around, and he has a ton of energy.  I wanted to pair him up with a hot, enthusiastic guy who likes to get fucked hard!</p>\n<p>Of course, Jamie seemed to be the perfect choice.  He&rsquo;s always eager to please a hot new top, and as he&rsquo;s gained more &ldquo;experience&rdquo; he&rsquo;s gotten better and better at it.</p>\n<p>I just knew that the guys would get along really well, so I wanted to take them out to the beach for some pre-sex activities. Once we got there, it almost seemed like a little competition between the two of them -- who could ham it up more for the camera?</p>\n<p>We brought one of those long, thick tug-of-war ropes, and Jamie had it wrapped around him, ready to walk to the beach.</p>\n<p>&ldquo;Doesn&rsquo;t he look cute with that rope wrapped around him?&rdquo;</p>\n<p>&ldquo;Yes,&rdquo; Yuri said with a big smile.  &ldquo;He does!&rdquo;</p>\n<p>It was a short walk onto the sand, and both of them were talking about who was going to win. They have similar builds (lean and muscular), so I wasn&rsquo;t sure...</p>\n<p>The actual tug-of-war was really hot!  Their muscles really worked under the hot sun, and all that tugging really made their muscles stand out!</p>\n<p>Yuri was the winner (twice).</p>\n<p>&ldquo;I guess that means I get to bottom,&rdquo; Jamie joked.  Well, that was going to happen anyway!</p>\n<p>The boys seemed extra horned up, so we headed back.</p>\n<p>Jamie started out by giving Yuri some head, which Yuri loved.  Then, Yuri really fucked the hell out of Jamie.</p>\n<p>Jamie finally ejaculated, and it was big and messy!</p>\n<p>Yuri was next, cumming all over Jamie&rsquo;s face and neck.  The best part was the make-out session afterward, with Yuri licking up every drop of cum!</p>",
  "models": [
    {
      "name": "Jamie",
      "person_id": 17733
    },
    {
      "name": "Yuri",
      "person_id": 17895
    }
  ],
  "release_date": "2010-06-12",
  "scene_id": 2699471,
  "series": [],
  "tags": [
    "Facial",
    "Swallow",
    "Muscular",
    "Athlete/Jock",
    "Anal",
    "Uncut"
  ],
  "title": "Jamie & Yuri"
}