{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1060
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>It was an overcast day and I was in the mood for something fun. Seriously, we had gone through a week of cloudy days which was like winter for us.</p>\n<p>Russ and Yuri had just met, and Yuri was full of energy &#8212; kind of like a little kid who's had too much sugar!</p>\n<p>So an idea just kind of popped into my head. Yeah, it's crummy weather, but let's go rent a jet ski and let the guys race around the harbor!</p>\n<p>When I told the guys what we were going to do, they were both really excited. But especially Yuri. He gets excited easily.</p>\n<p>We loaded up into the truck and went down to the water. Wave runners are really easy to off load, so the guys were out and about before you knew it.</p>\n<p>I forgot to tell them to keep it to a reasonable speed &#8212; something I instantly remembered as I watched a Harbor Police boat approach with its lights flashing.</p>\n<p>Busted! The guys were pulled over for a good twenty minutes. Fortunately, they got off with a warning, and both of them were giggling about the experience when they returned.</p>\n<p>We didn't want to press our luck so we left. The guys were in the back seat, happy as could be, and ready to fuck!</p>\n<p>Once we got back, they decided to wash the salt water off. The two didn&rsquo;t even make it out of the shower before the flirtation started. Yuri was fascinated with Russ' ass, and after they toweled off, Russ dropped to his knees and started blowing Yuri. </p>\n<p>Then they moved to the sofa, where Yuri fucked Russ until he shot his load all over his stomach. And then, when Yuri was ready to blow, he raised Russ&rsquo; feet in the air, came on them and then licked them clean! </p>\n<p>When they were done, I asked Yuri if he&rsquo;d always had a foot fetish.</p>\n<p>&ldquo;No, it&rsquo;s something new, and something incredible,&rdquo; he laughed. </p>\n<p>And, even though Russ was ticklish, I think he enjoyed it too!</p>",
  "models": [
    {
      "name": "Russ",
      "person_id": 18447
    },
    {
      "name": "Yuri",
      "person_id": 17895
    }
  ],
  "release_date": "2010-07-02",
  "scene_id": 2699601,
  "series": [],
  "tags": [
    "Swallow",
    "Muscular",
    "Athlete/Jock",
    "Anal",
    "Big Dick",
    "Uncut"
  ],
  "title": "Russ & Yuri"
}