{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1065
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Jess' &quot;try anything once&quot; mentality, big dick and great smile have made him fun to work with. Pete has always enjoyed the big dicks so I knew this would be good!</p>\n<p>I asked both of them how much of what they do here on camera gets taken home with them. </p>\n<p>&ldquo;Pretty much all of it,&rdquo; Jess said.</p>\n<p>&ldquo;Yeah, definitely,&rdquo; Pete agreed. </p>\n<p>&ldquo;I mean, I&rsquo;ve always kind of been into freaky shit like this, but lately it&rsquo;s just been kind of off the chart. My girlfriend is starting to notice and she&rsquo;s getting a little upset,&rdquo; Jess said with a laugh. So I asked him when he was going to give it to her like he&rsquo;s been giving it to the guys here and he said with a smile, &ldquo;probably, definitely later tonight!&rdquo;</p>\n<p>Pete immediately grabbed Jess&rsquo; head and started making out with him. Jess couldn&rsquo;t wait to get Pete out of his clothes and you could tell they were into each other. Pete started feeling Jess&rsquo; cock through his jeans and then sucked the head as it peeked out of them.</p>\n<p>After Pete sucked Jess' dick, Jess flipped him over on the couch and started fingering and eating his hairy hole. Then, Jess slid his cock into Pete. You can really tell when Pete&rsquo;s getting worked up because his cheeks (the ones on his face) start getting rosy red and flushed.</p>\n<p>They moved to the floor to experiment in a few new positions. Finally, Jess jumped on top and fucked the cum out of Pete. Jess then pulled out and used Pete's cum to jerk his big dick off all over Pete's stomach. </p>\n<p> Jess is pretty good at this. If the curling of Pete&rsquo;s toes is any indication, I think he&rsquo;d agree!</p>",
  "models": [
    {
      "name": "Jess",
      "person_id": 17665
    },
    {
      "name": "Pete",
      "person_id": 17653
    }
  ],
  "release_date": "2010-07-10",
  "scene_id": 2699651,
  "series": [],
  "tags": [
    "Tattoo",
    "Muscular",
    "Brown Hair",
    "Short",
    "Big Dick",
    "Twink",
    "Athlete/Jock",
    "Anal"
  ],
  "title": "Jess & Pete"
}