{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1074
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>East coast born and bred, Donnie is a pretty serious guy. He was stiff at first &#8212; very nervous, actually &#8212; and it took a little bit of work to break through his shell. Once we did, we found out he&rsquo;s a nice guy with a really sensitive side that you can see in his character and expressions. But, he&rsquo;s also pretty fearless and quite often tests the limits of fate.</p>\n<p>Donnie&rsquo;s a mechanic, which means he&rsquo;s very good with tools. He primarily likes to work on motorcycles and has an old one he completely rebuilt that he&rsquo;s very proud of. He&rsquo;s also an avid rugby player and loves the sport because &ldquo;it never stops&hellip;and there&rsquo;s less padding.&rdquo;</p>\n<p>He works out about two or three days a week but is more of a cardio guy than a weights guy. It definitely shows when he&rsquo;s naked. He&rsquo;s ripped &#8212; not muscular huge &#8212; but very toned with great pecs, long hairy legs, huge low hanging balls, and a nice long, thick cock. He sat on the floor stroking his dick before kneeling on the sofa and letting it go all over the cushions.</p>\n<p>Donnie wanted to go for a hike so we took a drive to some back trails. He took off his shirt and got warmed up with some push-ups before we went hiking. He said he&rsquo;d been hiking in upstate Virginia about three weeks earlier at a park that was notorious for black bear sightings. </p>\n<p>&ldquo;What would you do if you ever encountered a bear?&rdquo;</p>\n<p>&ldquo;I&rsquo;d run like hell,&rdquo; he said. </p>\n<p>When we got back, he started opening up a little more about his past sexual experiences, and that got him kind of horned up. He started by massaging his dick until it was hard, and then he started rubbing himself all over and feeling every stroke. When he came, he shot all over himself &#8212; stomach, neck and face &#8212; with some even getting in his eye. Wow!</p>",
  "models": [
    {
      "name": "Donnie",
      "person_id": 19412
    }
  ],
  "release_date": "2010-07-24",
  "scene_id": 2699741,
  "series": [],
  "tags": [
    "Solo",
    "Muscular",
    "Athlete/Jock",
    "Big Dick"
  ],
  "title": "Donnie"
}