{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1046
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Russ is an Air Force vet who&rsquo;s well mannered, genuine, and really nice. Now, he&rsquo;s in college and devoted full-time to his studies. Russ is ambitious and, one day, wants to be a chef. He also wears his heart on sleeve and admits that may be a reason he&rsquo;s perpetually single. For Russ though, a relationship isn&rsquo;t high on his priority list. He&rsquo;s focused on his studies but likes to casually date&hellip;just as long as the girl doesn&rsquo;t get on his nerves.</p>\n<p>&ldquo;What annoys you most about women?&rdquo; </p>\n<p>&ldquo;Not able to hold a conversation, too uptight, not laid back enough, can&rsquo;t take a joke, things like that,&rdquo; he answered. </p>\n<p>He learned a lot from the military and you can tell by his demeanor. He got to travel the world in the Air Force and plans to do much more when he&rsquo;s finished with school.</p>\n<p>Russ spends a lot of  time in the gym, too. When he started undressing, the first thing I noticed was he wasn&rsquo;t wearing underwear. Then I noticed how tight his body was. Ripped abs, nice meaty, hairy legs, a thick cock and big low-hanging balls. </p>\n<p>Russ was fun to watch, and he&rsquo;s got a very unique jack-off method, a style I can only describe as the &quot;over under two hander.&quot; He stroked his cock until he shot his load not only on his shoulder, but all over the chair!</p>\n<p>Later on, we hit the beach but it was really chilly that day so we didn&rsquo;t stay for long. When we got back at home, I talked a little bit about his experience in the military &#8212; what his favorite thing about the Air Force was and what he hated.</p>\n<p>&ldquo;I really hated getting up so early in the morning,&rdquo; he said. </p>\n<p>Somehow I knew he wasn't a morning person!</p>",
  "models": [
    {
      "name": "Russ",
      "person_id": 18447
    }
  ],
  "release_date": "2010-06-10",
  "scene_id": 2699461,
  "series": [],
  "tags": [
    "Solo",
    "Athlete/Jock",
    "Big Dick"
  ],
  "title": "Russ"
}