{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1178
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p> I have heard some in-depth conversations regarding careers around here. These guys show up, wide eyed and excited about trying something new. They share their goals and aspirations. It&rsquo;s very refreshing. Some want to be chefs, firefighters, accountants and even lawyers. It turns out Curtis wants to be a trauma surgeon. </p>\n<p>&quot;Do you go to school?&quot; I asked Curtis.</p>\n<p>&quot;Yup. Started in January.&quot; </p>\n<p>&quot;What are you studying?&quot;</p>\n<p>&quot;Well, I'm getting my A.A. right now in pre-med biology.&quot;</p>\n<p>&quot;What do you want to do with that?&quot; I curiously asked. </p>\n<p>&quot;Trauma doctor.&quot;</p>\n<p>Well, if he is as dedicated to his studies as he is to cock, then I have no doubt that he will be a great doctor! Just ask Oscar. Curtis swallowed his thick cock with ease. It's great to see how much Curtis enjoys dick. It seems like the bigger it is, the more excited he gets and Oscar fits the bill of a nice big fat dick.</p>\n<p>Curtis' hard-on bounced around in every direction as he rode Oscar. His cock stayed hard the whole time and he was getting fucked properly in every way &#8212; until his load blasted over his head and onto his chest. That must have turned Oscar on beyond the point of no return&hellip; he pulled out of Curtis' ass and also shot all over Curtis' head, face and chest. </p>\n<p>&quot;You, my friend,&quot; I teased Curtis, &quot;have cum in your hair, in your mouth and I think it's in your eye and it's in your nose!&quot;</p>",
  "models": [
    {
      "name": "Curtis",
      "person_id": 17769
    },
    {
      "name": "Oscar",
      "person_id": 18843
    }
  ],
  "release_date": "2011-01-27",
  "scene_id": 2700781,
  "series": [],
  "tags": [
    "Facial",
    "Latin",
    "Red Head",
    "Athlete/Jock",
    "Anal",
    "Big Dick"
  ],
  "title": "Curtis & Oscar"
}