{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1116
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Jamie just keeps looking better each time I see him. And, he&rsquo;s always eager to get at least a glimpse of the new guys. Jonathan is still relatively new to gay sex and even though he&rsquo;s had fun (mostly) topping other guys, he&rsquo;s finding quite a bit of pleasure exploring versatility. Jamie, however, has taken quite a liking to being on the bottom bunk. Something about the idea of these two together said it was going to be a fun ride!</p>\n<p>&ldquo;How big is your hole&hellip; in your butt?&rdquo; I asked Jamie.</p>\n<p>&ldquo;It can handle&hellip;much,&rdquo; he replied. </p>\n<p>The look on Jonathan&rsquo;s face was priceless. &ldquo;Much&hellip;&rdquo; he responded back to Jamie with just as much question in tone as matter-of-fact &#8212; like, &ldquo;I&rsquo;ve seen his videos, I know what he can handle!&rdquo;</p>\n<p>Jonathan appeared to be quite smitten with Jamie (almost borderline nervous) making me think he might have a little crush on him. </p>\n<p>&ldquo;I guess we&rsquo;re going to put his dick in your ass,&rdquo; I said to Jamie.</p>\n<p>&ldquo;YES,&rdquo; he said nodding intently. </p>\n<p>&ldquo;Are you excited about that?&rdquo; I asked Jonathan.</p>\n<p>&ldquo;I&rsquo;m very excited,&rdquo; he replied, smiling while fingering Jamie&rsquo;s forearm. </p>\n<p>&ldquo;What about you?&rdquo;</p>\n<p>&ldquo;Every time, no matter what,&rdquo; Jamie said. </p>\n<p>Jonathan&rsquo;s becoming quite a bit more experimental with sex and recently has been bottoming more. He&rsquo;s getting more and more comfortable having fingers, toys and cocks in his ass. </p>\n<p>&ldquo;What turns you on most about Jamie?&rdquo;</p>\n<p>While squeezing Jamie&rsquo;s pecs, he replied, &ldquo;They&rsquo;re big!&rdquo;</p>\n<p>Things heated up right away. These two had no reservations. They sucked each other, used butt plugs, and fucked on the stairs. Jamie even ended up getting fucked with a blindfold on! It was great watching them both cut loose and enjoy themselves...</p>",
  "models": [
    {
      "name": "Jamie",
      "person_id": 17733
    },
    {
      "name": "Jonathan",
      "person_id": 19059
    }
  ],
  "release_date": "2010-09-30",
  "scene_id": 2700161,
  "series": [],
  "tags": [
    "Twink",
    "Athlete/Jock",
    "Anal"
  ],
  "title": "Jonathan & Jamie"
}