{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1112
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>If you think about the boys of summer &#8212; those jocks and surfers you see at the beach all day long &#8212; Rick definitely fits the bill. He&rsquo;s a very handsome, jock beach boy with a nearly perfect body and a big, beautiful white smile. </p>\n<p>Rick is a die-hard sports fanatic. He grew up playing baseball, tennis and golf. I guess you could say, anything with a stick that he can swing, he&rsquo;s all about it. He also spends a lot of time outdoors, but only in the warm weather. He really hates snow! </p>\n<p>Rick&rsquo;s personality is very cool and upbeat and talking with him is easy. </p>\n<p>&ldquo;So, how often do you get head?&rdquo;</p>\n<p>&ldquo;About twice a month,&rdquo; he replied with a smile. </p>\n<p>&ldquo;That&rsquo;s pretty good. You&rsquo;re like a good boy all the way around.&rdquo;</p>\n<p>&ldquo;I do my best.&rdquo;</p>\n<p>&ldquo;What kind of sex are you into?&rdquo;</p>\n<p>&ldquo;Nothing freaky,&quot; he replied. &quot;But maybe a little spanking!&rdquo;</p>\n<p>&ldquo;Do you get spanked or do they get spanked?&rdquo;</p>\n<p>&ldquo;Oh hey, either way, that&rsquo;s cool.&rdquo; </p>\n<p>Rick is ripped and tan all over. His body is incredible and his cock is thick and cut.  And, he&rsquo;s a sprayer when he cums &#8212; it shoots everywhere!</p>\n<p>Rick is straight, but he enjoys the gay community. He&rsquo;s extremely close with his gay uncle and his uncle&rsquo;s partner, three lesbian cousins and three of his best friends. And, he goes out to the gay clubs with them a lot. </p>\n<p>I'm not sure if that means we&rsquo;ll see him getting it on with a guy or not... but, one can hope! </p>",
  "models": [
    {
      "name": "Rick",
      "person_id": 18133
    }
  ],
  "release_date": "2010-09-24",
  "scene_id": 2700121,
  "series": [],
  "tags": [
    "Solo",
    "Muscular",
    "Athlete/Jock"
  ],
  "title": "Rick"
}