{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1157
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>I will be the first to admit that I had every thing I could cross, I had crossed in hopes that Ethan would be willing to come back and put that HUGE dick to good use. I didn&rsquo;t care if I had to film him picking daisies naked &#8212; I wanted him back! I was a bit worried though. He was shy during his first video and I didn't get the impression that he was, shall we say, &ldquo;open.&rdquo; But, it seemed like he had relaxed by the end of it all and had a good time so I went for it and I could not have been happier that I did.</p>\n<p>Calvin has absolutely no problem sucking dick, taking it in the ass, or giving someone a good fuck. I think he loves putting on a show for sure. Ethan sat there, next to him &#8212; almost like he couldn&rsquo;t believe like this was really about to happen. His cheeks flushed as Calvin helped take his shirt off. I wonder if in the back of his mind he was thinking... &ldquo;I wonder if he&rsquo;s going to be in shock when he takes my pants off?&rdquo; The surprise on Calvin&rsquo;s face said it all!</p>\n<p>But Ethan didn&rsquo;t let Calvin have all the fun. He was willing to try it all, too. He sucked on Calvin&rsquo;s dick, getting it ready for his white muscled butt. I loved how Ethan&rsquo;s cock dripped pre-cum with every thrust he received as he got fucked. </p>\n<p>Once the roles were reversed and Calvin started riding Ethan&rsquo;s dick, all bets were off. It was as if Calvin wanted to take all of Ethan in. He grabbed onto him and pushed back as hard as he could. Every muscle in Ethan&rsquo;s body flexed with every deep stoke he pounded into Calvin&rsquo;s ass. There is no doubt that having that much dick inside him, gave him one of the most mind-blowing orgasms ever! </p>\n<p>I&rsquo;d say that the two of them had a very good male bonding experience &#8212; one that they sealed with a kiss&hellip; right after Ethan shot his load on Calvin&rsquo;s face!</p>",
  "models": [
    {
      "name": "Calvin",
      "person_id": 17763
    },
    {
      "name": "Ethan",
      "person_id": 17795
    }
  ],
  "release_date": "2010-12-16",
  "scene_id": 2700571,
  "series": [],
  "tags": [
    "Facial",
    "Swallow",
    "Athlete/Jock",
    "Anal",
    "Big Dick",
    "Uncut",
    "Flip Flop"
  ],
  "title": "Ethan & Calvin"
}