{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1146
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>I have to admit that Jess and Calvin are two of the most entertaining guys I&rsquo;ve worked with. There&rsquo;s always a joke or a or a prank or a funny story. I wanted them to have some fun before we started, so I asked them to come up with a game. Our crew had been shopping the week before and we all kinds of fun stuff &#8212; sports equipment, outdoor gear, and so forth.</p>\n<p>I let them have free reign, the only requirement being the stakes: winner gets head, loser gets to suck it! </p>\n<p>Now, for many guys, the competition itself sounds like a win-win. But, we&rsquo;ve all seen the size of Jess&rsquo; dick and I can understand how it might be a jaw-aching challenge for someone&rsquo;s mouth. The guys had a great time sorting through the toys and coming up with ideas. At last they both agreed &#8212; it would be a &ldquo;modified&rdquo; ring toss.</p>\n<p>Calvin was off to a great start. His first shot landed right in the box. But things for him started going downhill after that and guess who ended up with a huge dick in his mouth? And that is when the fun really started. Calvin made it a personal challenge to see how much of Jess&rsquo; dick he could take and he took it like a true champ in every way! And that just got him warmed up for the sex...</p>\n<p>In the end, Calvin went from a ring toss loser to a well-fucked, cum-drenched  bottom ready for everything Jess had for him. I hadn&rsquo;t heard an orgasm come out of Calvin like this before. He was here to please. He was hungry. He drained every last drop out of Jess&rsquo; dick. This ended up being a game where no one lost!</p>",
  "models": [
    {
      "name": "Calvin",
      "person_id": 17763
    },
    {
      "name": "Jess",
      "person_id": 17665
    }
  ],
  "release_date": "2010-11-26",
  "scene_id": 2700461,
  "series": [],
  "tags": [
    "Facial",
    "Swallow",
    "Twink",
    "Athlete/Jock",
    "Anal",
    "Big Dick"
  ],
  "title": "Jess & Calvin"
}