{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1170
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>I really thought I&rsquo;d never see Curtis again.</p>\n<p>The last time he was here with Shane\n, he gladly and excitedly admitted how much he loved getting fucked and then... he disappeared. Maybe he got scared that he was liking dick too much? Who knows...</p>\n<p>Recently, almost two years after his last visit, he sent me an e-mail asking about doing more films. He sent some pictures, and he hadn't changed a bit. He still had that same smooth butt, big dick and muscled body that was always ready for a good fuck.</p>\n<p>Once he arrived, I noticed that his personality hadn't changed either. His demeanor is still shy and quiet, but if anything, his hunger for dick has grown even more. He  admitted to keeping tabs on the site, jerking off and fantasizing about some of the guys &#8212; most recently, Ethan and his huge cock. </p>\n<p>Ethan is also a bit reserved. He was really relieved once he found out Curtis had some prior experience with some pretty big dicks. He jokingly told Curtis that only one person had ever been able to deep throat his massive cock. </p>\n<p>&ldquo;Have you seen or heard how big his dick is?&rdquo; I asked Curtis.</p>\n<p>&ldquo;Yeah, I think I can take it,&rdquo; he replied with his sweet southern accent.</p>\n<p>That&rsquo;s the Curtis I remember and exactly what I wanted to hear. There was no waiting for this. Curtis sprung on Ethan&rsquo;s cock just as fast as it sprung out of his shorts. Two years is a long a time to go without some dick. And judging by the way Curtis deep throated it... I&rsquo;d say he was more than ready!</p>",
  "models": [
    {
      "name": "Curtis",
      "person_id": 17769
    },
    {
      "name": "Ethan",
      "person_id": 17795
    }
  ],
  "release_date": "2011-01-10",
  "scene_id": 2700701,
  "series": [],
  "tags": [
    "Red Head",
    "Athlete/Jock",
    "Anal",
    "Big Dick",
    "Uncut"
  ],
  "title": "Curtis & Ethan"
}