{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1124
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Oscar is a fascinating guy. He&rsquo;s intellectual to the point of being &ldquo;geeky,&rdquo; yet he's incredibly social, friendly, and outgoing &#8212; not to mention he&rsquo;s cute and has a great body. As a kid, he was obsessed with the ocean and he fantasized about becoming a marine biologist. Now that he&rsquo;s an adult, he&rsquo;s changed gears a bit and now has a passion for nutritional science, and hopes to eventually get his Ph.D. </p>\n<p>So, not only is he smart, he also has a great sense of humor and isn&rsquo;t afraid to make fun of himself. He takes care of his body by working out, running, biking and eating healthy. But that does not stop him from chowing down on chips or fries if he gets a craving. He says it&rsquo;s all about balance and not being afraid to indulge every once in a while. </p>\n<p>There&rsquo;s a bit of a wild streak in him too. Not in the party sense, but more the adventurous kind. Oscar&rsquo;s not one to back down from a challenge, especially if it will test his endurance. And, he gets a big kick out of accomplishing things that people tell him he can&rsquo;t do. Oscar&rsquo;s least favorite word is &ldquo;no&rdquo; and, because of that, he got a tattoo on his 20th birthday that reads, &ldquo;No Means Yes&rdquo;. </p>\n<p>I was curious about that, particularly because of where the tattoo is placed &#8212; right above his pubes. I wondered if he put it there as some kind of  a joke for when he&rsquo;s getting head. Well, I was surprised by his answer: </p>\n<p>&ldquo;When somebody tells me not to do it, it might be for a good reason but you should find out for yourself because it&rsquo;s going to take you places. Good or bad, you have to find out.&rdquo;</p>",
  "models": [
    {
      "name": "Oscar",
      "person_id": 18843
    }
  ],
  "release_date": "2010-10-14",
  "scene_id": 2700241,
  "series": [],
  "tags": [
    "Solo",
    "Latin",
    "Athlete/Jock",
    "Big Dick"
  ],
  "title": "Oscar"
}