{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1135
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Brodie is very interesting to watch in action. There is a side of him that is very explorative and cocky but there is still that hint of shyness in him about it all. I followed up with him after his blow job experience with Jess and wanted to know what else he was willing to try. He said he loved the blow job and was excited to go further!</p>\n<p>The mood was very playful between Calvin and Brodie. They compared bodies, dicks and balls, frequently joking in between. </p>\n<p>&ldquo;You&rsquo;ve got some low hanging balls...what&rsquo;s your favorite thing about your balls?&rdquo; I asked Calvin.</p>\n<p>&ldquo;Well I hear when the left one hangs lower, that means you&rsquo;re more creative.&rdquo;</p>\n<p>&ldquo;Really. I&rsquo;ve never heard that before! That&rsquo;s interesting. So you&rsquo;re saying you&rsquo;re a very creative person?&rdquo;</p>\n<p>&ldquo;That&rsquo;s what my balls tell me.&rdquo; </p>\n<p>That playfulness quickly turned into an intense cock sucking session. Brodie flung Calvin onto the bed, guiding his Calvin's mouth onto his dick. It was great to see Calvin hungrily beg for it. He was so excited that he was even &ldquo;air fucking&rdquo; as he sucked on it. </p>\n<p>Brodie  prepped Calvin&rsquo;s hole with an intense rim job and then plunged deep into it with his hard cock. He was aggressive but sweet at the same time. He took control of Calvin&rsquo;s ass and showed that he was capable of putting it to work, flipping it, slapping it and fucking it until they both ended up completely drained! </p>",
  "models": [
    {
      "name": "Brodie",
      "person_id": 17817
    },
    {
      "name": "Calvin",
      "person_id": 17763
    }
  ],
  "release_date": "2010-11-05",
  "scene_id": 2700351,
  "series": [],
  "tags": [
    "Muscular",
    "Athlete/Jock",
    "Anal",
    "Big Dick"
  ],
  "title": "Brodie & Calvin"
}