{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1235
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Franklin has an amazing set of balls! They left me speechless and I really had to see them in action after witnessing the huge load they were packing! I remember having a similar reaction with Dennis &#8212; his balls are also quite impressive.</p>\n<p>They hit it off right away. There was a certain glimmer of excitement in Franklin's eyes about it all. Dennis, the veteran that he is around here, was obviously excited to meet the &quot;rookie&quot; as well. </p>\n<p>&quot;So we got a new one?&quot; Dennis asked. &quot;I haven't seen your video yet but they were telling me about it.&quot; </p>\n<p>&quot;Did you hear about the balls?&quot; Franklin asked Dennis. He hadn't. It almost felt like they forgot there were cameras on them so I had to jump in back into the conversation.</p>\n<p>&quot;Should we have a Ball Off?&quot; And just like that, a new term for friendly ball competition was born.</p>\n<p>There was no hesitation. There was some joking while Dennis focused intently on Franklin as he pulled his pants down for the big reveal.</p>\n<p>&quot;Holy shit!&quot; Dennis remarked as Franklin's balls flopped out. &quot;Has me beat...I am losing the Ball Off here&quot;.<br />\n\t<br />\nAfter that, it was like watching two best friends (that let their curiosity get the best of them) take it all the way. The ball jokes turned into a stretching session. That led to Dennis rubbing and kissing on Franklin's neck, finding the &quot;sweet spot&quot; and giving him a hard-on that was waiting for a mouth to please it. Dennis' cock stayed rock hard the whole time and it bounced around as he got fucked. And Franklin? Well, there wasn't a spot on Dennis' back that wasn't covered in cum by the end of it all!</p>",
  "models": [
    {
      "name": "Dennis",
      "person_id": 17727
    },
    {
      "name": "Franklin",
      "person_id": 18459
    }
  ],
  "release_date": "2011-05-20",
  "scene_id": 2701351,
  "series": [],
  "tags": [
    "Old",
    "Muscular",
    "Latin",
    "Athlete/Jock",
    "Anal",
    "Big Dick"
  ],
  "title": "Franklin & Dennis"
}