{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1266
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Liev is a walking contradiction, but in a good way. When I first met him, he actually almost banged the door out of the wall when he knocked. It was actually a bit intimidating! I wondered why he didn't just use the door bell? I let him in and he had a friend with him. I figured it was for moral support but I had to let him know that his friend would have to wait somewhere else since we never know how long a shoot will take.</p>\n<p>No problem. This big &quot;intimidating&quot; man was actually one of the sweetest guys I've met in a long time. In fact, he was so nervous, he was actually a bit shaky. Now I understood why he brought his friend with him. I never would have thought that a guy with a gorgeous uncut cock, perfect body (great calves by the way), and adorable face would be a little scared of a guy holding a camera!</p>\n<p>But it all passed very quickly. Nerves turned into excitement and he couldn't wait to show me what he was hiding under his clothes. He opened up about his life in Russia, his love for the gym, soccer, and best of all, his curiosity about  having sex with another guy!</p>\n<p>&quot;Sexuality wise...gay, straight, bi, not sure?&quot; I asked.<br />\n\t<br />\n\t&quot;I'm probably bi-curious!&quot; he replied with a huge smile.</p>\n<p>&quot;Have you ever had any bi-curious experiences?&quot;</p>\n<p>&quot;Yeah. I've had a few...farthest I've gone, I kissed a dude. I told my buddy, he said one of his friends is gay and he'll 'test' me out. So...&quot;</p>\n<p>So that conversation seemed to be getting him excited again, and his cock was starting to bulge through his shorts. He was ready to get off! </p>",
  "models": [
    {
      "name": "Liev",
      "person_id": 17987
    }
  ],
  "release_date": "2011-07-23",
  "scene_id": 2701661,
  "series": [],
  "tags": [
    "Solo",
    "Muscular",
    "Athlete/Jock",
    "Big Dick",
    "Uncut"
  ],
  "title": "Liev"
}