{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1255
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>This film is all about &quot;The Battle of the Jeffs,&quot; as it was so jokingly put as I first introduced them to each other. That actually served as a quick and easy ice breaker! Both Jeff and Jeffrey tried to figure out what stakes to set to make this friendly  &quot;competition&quot; more interesting. </p>\n<p>&quot;How are you guys doing? Let's talk about Jeff &amp; Jeffrey...&quot;</p>\n<p>&quot;It's going to be a little bit of Jeff-on-Jeff action here!&quot; Jeffrey smiled.</p>\n<p>&quot;We should turn this into a little friendly competition and see who the better Jeff is.&quot;</p>\n<p>&quot;Oh... I like that!&quot; Jeff excitedly agreed.</p>\n<p>All name resemblance joking aside, these two guys have proven that they can hold their own. Jeffrey is very competitive and is great at fucking. Jeff, I've noticed, is more subtle and likes to please. He was very touchy and wanted to give Jeffrey a nice massage before the real fun started. He really liked feeling every part of Jeffrey &#8212; rubbing on him and kissing on him until his lips landed on Jeffrey's hard cock. </p>\n<p>True to form, though, Jeffrey wanted to show he could suck a good dick too and when it's as big as Jeff's, it's bound to be a challenge! And c'mon, that big dick looks just as good when it is flopping up and down while riding on a hard dick too.</p>\n<p>The Jeffs couldn't get enough of each other! On the bed, to getting slammed on the floor, and back to the bed again. If I had to declare a &quot;winner&quot; here, I'd have to give it to Jeff. He took every pounding like a champ, shot his load onto his chest and over his head and then took Jeffrey's nice thick load on his face! Even after they were done, I couldn't keep them off one another!</p>",
  "models": [
    {
      "name": "Jeff",
      "person_id": 18683
    },
    {
      "name": "Jeffrey",
      "person_id": 17591
    }
  ],
  "release_date": "2011-07-01",
  "scene_id": 2701551,
  "series": [],
  "tags": [
    "Facial",
    "Hairy",
    "Athlete/Jock",
    "Anal",
    "Big Dick",
    "Uncut"
  ],
  "title": "Jeff & Jeffrey"
}