{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1239
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>When I met Jamie, Jake had already done quite a few films. I remember wanting to have them together but their schedules never lined  up and it felt like the opportunity to have these two studs fuck each other had passed.</p>\n<p>But things have worked out in my favor! Jamie has become a little fuck stud and Jake's surprise return has been very exciting. Since their first appearances, both have grown and have become even sexier &#8212; more hair, more muscles, and more sexual. In fact, Jamie is probably one of the sexiest, hungriest, most aggressive bottoms I've ever had the pleasure of filming! He knows it and loves it! Jake can take as good as he gives, and of course and it's always hot watching his big uncut cock in action. They were literally flipping with excitement to get each other naked.</p>\n<p>They sat in the car talking about their experiences with other guys. The consensus? Jake has been evenly versatile. Jamie can count the times he has topped.</p>\n<p>&quot;How many times have you bottomed man?&quot; Jamie asked Jake.</p>\n<p>&quot;I've probably bottomed maybe on half the videos I've made. Pretty versatile. Half and half.&quot;</p>\n<p>&quot;I've topped three times... four times... that's about it,&quot; Jamie replied.</p>\n<p>&quot;I think the bottom is the most important role you know. Anybody can top really...&quot; Jake added, almost like he was acknowledging Jamie's skill at taking it.</p>\n<p>Jamie agreed with a smile. &quot;Yeah, anybody can top. What makes the video is the bottom!&quot;</p>",
  "models": [
    {
      "name": "Jake",
      "person_id": 18123
    },
    {
      "name": "Jamie",
      "person_id": 17733
    }
  ],
  "release_date": "2011-05-28",
  "scene_id": 2701391,
  "series": [],
  "tags": [
    "Facial",
    "Massage",
    "Athlete/Jock",
    "Anal",
    "Big Dick",
    "Uncut"
  ],
  "title": "Jake & Jamie"
}