{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1245
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Jarek loves extreme sports and adrenaline pumping activities. Maybe that's why he's always so eager to fuck? But he also admits to being a bit on the quiet side. Not today. I wanted him to try something new, and I was hoping that he would be willing to get fucked!</p>\n<p>He mentioned that he enjoys getting rimmed, but other than that, had never gone further. It couldn't hurt to ask. The answer was surprising &#8212; he was ready for it! Jeffrey had done a thorough job of fucking Donny for his first time so I knew that he'd do just as well with Jarek. They really hit it off. I wanted to see what the guys have been up to but I kind of got cut off by Jarek! </p>\n<p>&quot;Too much talking...I wanna get naked,&quot; he said with a huge grin on his face.</p>\n<p>&quot;I'll help you out...but you gotta help me out too!&quot; Jeffrey jumped in.</p>\n<p>&quot;I'll take my time on this one.&quot;</p>\n<p>Jarek is very subtle when he flirts but knows what he wants and Jeffrey was it. Jeffrey was very attentive to all of Jarek &#8212; working his way down his chest, his uncut cock, his balls, and finally ending up at his asshole. I hadn't heard Jarek moan like this before and it just got better. </p>\n<p>There was heavy anticipation on Jarek's part. Goose bumps covered his whole body the instant Jeffrey's cock started pounding into his hairy hole and they didn't go away! If that wasn't a sign that Jeffrey's dick in his ass was hitting the right spot and that he was more than loving it, then I don't know what is!</p>",
  "models": [
    {
      "name": "Jarek",
      "person_id": 17785
    },
    {
      "name": "Jeffrey",
      "person_id": 17591
    }
  ],
  "release_date": "2011-06-11",
  "scene_id": 2701451,
  "series": [],
  "tags": [
    "Hairy",
    "Athlete/Jock",
    "Anal",
    "Big Dick",
    "Uncut"
  ],
  "title": "Jarek & Jeffrey"
}