{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1363
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>&quot;Wow, his ass is hairy!&quot; Jeffrey said, looking at Raymond's muscular, furry ass. &quot;I hope I don't get a hair ball.&quot;</p>\n<p>Raymond laughed. &quot;Yeah, it's pretty hairy!&quot;</p>\n<p>Jeffrey started licking Raymond's hole lightly, and then just kind of dove in. Raymond and Jordan were already in a 69 position. That was perfect, because it let Jeffrey alternate between Raymond's ass crack and sharing Raymond's cock with Jordan.</p>\n<p>Then, without notice, Jeffrey slipped his hard cock into Raymond. Raymond looked a little surprised, but then continued going down on Jordan. You could tell Raymond liked it!</p>\n<p>What came next was a little bit of a surprise.</p>\n<p>&quot;I want to fuck both of them,&quot; Jeffrey said, nodding his head toward Jordan and Raymond. And that's what he did... the two bottoms in a sort of &quot;leap frog&quot; position with Jeffrey fucking one, then the other, and then back again.</p>\n<p>The biggest surprise came a little later.</p>\n<p>&quot;How about we get you double stuffed?&quot; I said to Raymond.</p>\n<p>He looked like he didn't know what I meant.</p>\n<p>&quot;You mean... two dicks?&quot; he asked. &quot;I don't know if I can...&quot;</p>\n<p>&quot;Hey, let's at least try!&quot;</p>\n<p>I knew he could do it and he did. Jordan came in from underneath, and Jeffrey came in from the back. It was tight at first, but Raymond's hole loosened up even more and he was able to take it!</p>",
  "models": [
    {
      "name": "Jeffrey",
      "person_id": 17591
    },
    {
      "name": "Jordan",
      "person_id": 17685
    },
    {
      "name": "Raymond",
      "person_id": 18105
    }
  ],
  "release_date": "2012-01-26",
  "scene_id": 2702631,
  "series": [],
  "tags": [
    "Gangbang",
    "Facial",
    "Hairy",
    "Muscular",
    "Athlete/Jock",
    "Anal",
    "Bareback",
    "Behind The Scenes"
  ],
  "title": "Jordan, Jeffrey & Raymond: Bareback"
}