{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1382
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Phillip is from a former Soviet bloc country. He came to America in search of adventure.</p>\n<p>&quot;I consider that change is very good, and I'm not afraid of changes,&quot; he said.<br />\n\t<br />\n&quot;Well, obviously, you moved to a whole new country!&quot;</p>\n<p>&quot;Yes!&quot; he said with a smile.<br />\n\t<br />\n\t&quot;How many languages do you speak?&quot;<br />\n\t<br />\n\t&quot;Fluently, three. And I speak some Polish too,&quot; he replied. &quot;It just helps to get around.&quot;</p>\n<p>Although he's made the United States his home, he still likes to travel.<br />\n\t<br />\n\t&quot;I'm just trying to learn some French right now because I'd really like to go to France.&quot;</p>\n<p>Phillip is gay and he came out shortly after turning 18.<br />\n\t<br />\n\t&quot;When I was 18 I had five guys all together,&quot; he told us. &quot;I just came out and five guys right away! It was great!&quot;</p>\n<p>He's very sexual and he wasn't shy about what he likes.<br />\n\t<br />\n\t&quot;I like very good oral so if a guy can give very good oral then that's a great plus,&quot; he said. &quot;Probably deep throating.&quot;</p>\n<p>On his sexual partners:<br />\n\t<br />\n\t&quot;I like them to be flexible, go I can come from any spot I want, from behind, from the side, from, you know, the top.&quot;<br />\n\t<br />\n\t&quot;So you're a top, you like to fuck?&quot;</p>\n<p>&quot;I like to fuck!&quot; he said, and then repeated: &quot;I like to fuck.&quot;</p>\n<p>Phillip has a nice uncut dick with a full bush.</p>\n<p>&quot;How big do you get when you get hard?&quot;</p>\n<p>&quot;I think it's about seven and a half... I don't know, I've never measured,&quot; he said. &quot;Usually, when I enter a guy, he's like... 'that feels good,' so I know it's good. I don't have to measure it, per se.&quot;</p>\n<p>&quot;You judge by their reactions?&quot;</p>\n<p>&quot;Yeah, I judge by the way, how they moan.&quot;</p>\n<p>On how guys react to his hairy chest:</p>\n<p>&quot;They like it. I've never shaved, so they like to sleep on it,&quot; he said. &quot;After, you know, after I cum and after they cum, he just lays on top of me, and puts his head on my chest like a little puppy. It's kind of fun, I like it!&quot;</p>",
  "models": [
    {
      "name": "Phillip",
      "person_id": 18579
    }
  ],
  "release_date": "2012-03-04",
  "scene_id": 2702821,
  "series": [],
  "tags": [
    "Solo",
    "Hairy",
    "Athlete/Jock",
    "Behind The Scenes",
    "Uncut",
    "Sex Toys"
  ],
  "title": "Phillip"
}