{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1319
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Jed is an adorable little muscle stud!</p>\n<p>He's 21 years old and describes himself as a &quot;movie buff.&quot; He's actually a writer, and at one point he had aspirations to be an actor. He had dabbled in some theatre, but he's super shy and eventually he found that his strengths were behind the scenes... writing the story and learning how to direct it with the cameras.</p>\n<p>He's also from a small, rural town.</p>\n<p>&quot;Yeah,&quot; he told us. &quot;There's nothing to do there.&quot;</p>\n<p>That could explain the reason for his vivid imagination and his willingness to share so much!</p>\n<p>Jed has a lot of things going for him. He's charming and friendly, and he has a great smile. And then there's his body... it's amazing! He has a big, muscular torso, great arms, an uncut cock, and a full bush with untrimmed treasure trail!</p>\n<p>&quot;You look really good,&quot; I said, stating the obvious. &quot;How often do you work out?&quot;</p>\n<p>&quot;Pretty consistently. I guess I just have an overabundance of testosterone… I guess I kinda scare people when I work out. It's really intense. I zone out and think about my movies and writing and different scenarios and  kind of pretend I am in a life threatening situation. But in high school I was 120 pounds soaking wet.&quot;</p>\n<p>&quot;Has anyone ever complimented you on your gigantic butt?&quot;</p>\n<p>&quot;Yes. I don't know so much as complimented me as made fun of me. It's kind of its own entity,&quot; he joked. &quot;If I do any kind of workout, it blows up.&quot;</p>\n<p>I don't think he realizes that is not a bad thing at all!</p>",
  "models": [
    {
      "name": "Jed",
      "person_id": 19220
    }
  ],
  "release_date": "2011-11-05",
  "scene_id": 2702191,
  "series": [],
  "tags": [
    "Solo",
    "Muscular",
    "Athlete/Jock",
    "Uncut"
  ],
  "title": "Jed"
}