{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1395
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>&quot;He has such a great ass I wish I was able to fuck it,&quot; Phillip said, pointing to Brodie.  &quot;Guess I'll just have to settle for eating it!&quot;</p>\n<p>The shower was running. Hot water was flowing, and the boys were stripped down to their underwear.</p>\n<p>They stepped under the shower head, and you could see their hard-ons through their wet underwear.</p>\n<p>Phillip was all about exploring every inch of Brodie's body with his mouth... he had his face shoved in Brodie's pits, his crotch and even his feet.</p>\n<p>&quot;I saw a pair of underwear in front of me and right away wanted to shove it in my mouth,&quot; he said, laughing. &quot;I love the way a guy smells!&quot;</p>\n<p>Brodie took charge, and he was having a great time throwing Phillip around the shower.</p>\n<p>&quot;Its like our very own water park,&quot; Brodie said, moments before he picked Phillip up and carried him to the other side of the room.</p>\n<p>Before Brodie started fucking Phillip he really took his time and aggressively fucked his face... at times almost making him beg for it.</p>\n<p>&quot;He has a really great cock and I can't get enough!&quot; Phillip told us.</p>\n<p>Both guys loved the water and they had fun trying to figure out the best way to fuck in a hot, wet setting!</p>\n<p>When Brodie came he really wanted to shoot all over Phillip's face and into his mouth.</p>\n<p>&quot;Cum tastes great!&quot; Phillip explained. He likes to spit the cum out over a guys dick and start to suck it again... almost like &quot;turning it into lube&quot; (as he put it)!</p>",
  "models": [
    {
      "name": "Brodie",
      "person_id": 17817
    },
    {
      "name": "Phillip",
      "person_id": 18579
    }
  ],
  "release_date": "2012-03-30",
  "scene_id": 2702951,
  "series": [],
  "tags": [
    "Facial",
    "Swallow",
    "Muscular",
    "Athlete/Jock",
    "Anal",
    "Behind The Scenes"
  ],
  "title": "Brodie & Phillip"
}