{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1443
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>&quot;Wow! Marshall and Brandon...&quot; I said as the guys were sitting together. &quot;You know, this is, like, a dream come true?&quot;</p>\n<p>&quot;Whose dream?&quot; Marshall asked, flashing a smile.</p>\n<p>&quot;Everyone's... I don't want you to get big heads or anything, you know!&quot;</p>\n<p>They laughed. Marshall looked at over at Brandon and said, &quot;Well, he's perfect... so I'm excited.&quot;</p>\n<p>Brandon was already pitching a tent in his pants. So I knew he was excited too!</p>\n<p>&quot;Here,&quot; Marshall said, moving to the floor. &quot;Let me give you a foot massage. It will feel good!&quot;</p>\n<p>As he started rubbing Brandon's foot, you could feel the sexual tension increasing.</p>\n<p>&quot;I've never had a foot massage before,&quot; Brandon said.</p>\n<p>&quot;How's it feel?&quot; Marshall asked.</p>\n<p>&quot;It's perfect!&quot;</p>\n<p>Marshall was ready to get fucked. &quot;I've been thinking about this for a while,&quot; he said. &quot;Just go full bottom!&quot;</p>\n<p>Brandon was gentle with him at first, but not for long.</p>\n<p>We had to take breaks here and there, because Marshall kept wanting to pop.</p>\n<p>&quot;Man, THAT is the spot,&quot; Marshall said, out of breath.</p>\n<p>&quot;On your side?&quot; Brandon asked. &quot;That felt good?&quot;</p>\n<p>&quot;Yeah, I was getting so close!&quot; Marshall replied. &quot;I had to keep thinking of grandmas and trees to keep me from cumming!&quot;</p>",
  "models": [
    {
      "name": "Brandon Cody",
      "person_id": 17595
    },
    {
      "name": "Marshall",
      "person_id": 18326
    }
  ],
  "release_date": "2012-07-04",
  "scene_id": 2703431,
  "series": [],
  "tags": [
    "Facial",
    "Swallow",
    "Muscular",
    "Athlete/Jock",
    "Anal",
    "Bareback",
    "Behind The Scenes",
    "Big Dick"
  ],
  "title": "Marshall & Brandon: Bareback"
}