{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1467
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>“I like to get out and have fun,” Jarek said, looking at Christian. “It helps me bond with the guy I’m about to fuck!”</p>\n<p>Christian nodded his head in agreement. They were getting to know each other and they really opened up once we got out in the woods.</p>\n<p>“I feel like Tarzan looking for my Jane, or I guess in this case my John!” Jarek joked. He was rocking the facial hair, and with his muscular torso he definitely looked the part.</p>\n<p>“I’ll be your John any day!” Christian said, his blue eyes sparkling in the sun. He was clearly ready!</p>\n<p>The sexual tension was building. On the car ride back they couldn’t keep their hands off each other.</p>\n<p>The shirts quickly came off once we got back to the house.</p>\n<p>“You have great muscles,” Christian said, sliding his hands across Jarek’s chest and abs. “Nice and toned.”</p>\n<p>But it was Jarek’s dick that got the best reviews from Christian.</p>\n<p>“His dick is pretty amazing,” I commented during a piss break. “What do you think?”</p>\n<p>“Thick... long... and rock hard!”</p>\n<p>“And you like it?”</p>\n<p>“I do very much,” he said. “It slid right in!”</p>\n<p>Jarek was a few feet away with a huge smile on his face as Christian talked about getting fucked. </p>\n<p>“That’s awesome,” I said. “What’s been your favorite part so far?”</p>\n<p>“It was hot when he went balls deep. I could feel him all the way inside me.”</p>\n<p>Jarek chimed in. “Wait ‘til I cum in your ass!”</p>\n<p>That’s exactly what Jarek did. He was fucking Christian hard when all of a sudden he got this intense look on his face and his nuts tightened up. He shot his load deep into Christian’s hole.</p>\n<p>“Wow that looked pretty hot!” I said. Cum was dripping out of Christian’s ass.</p>\n<p>“I could feel him cumming inside me!” Christian said. “It felt warm... I could get used to this!”</p>",
  "models": [
    {
      "name": "Christian",
      "person_id": 18197
    },
    {
      "name": "Jarec Wentworth",
      "person_id": 17785
    }
  ],
  "release_date": "2012-08-21",
  "scene_id": 2703671,
  "series": [],
  "tags": [
    "Creampie",
    "Hairy",
    "Muscular",
    "Athlete/Jock",
    "Anal",
    "Bareback",
    "Behind The Scenes",
    "Big Dick",
    "Uncut"
  ],
  "title": "Christian & Jarek: Bareback"
}