{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1404
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>&quot;So, you're really blushing... do you always get bright red?&quot;</p>\n<p>&quot;Yeah, a lot,&quot; Harrison responsed. &quot;For the most part I'm really shy, but when I'm horny or embarrassed I get all flustered!&quot;</p>\n<p>&quot;And what are you now?&quot;</p>\n<p>&quot;A little bit of both!&quot;</p>\n<p>You could definitely tell he was a bit flustered as he fumbled around taking his shorts off. But once they came off... well  it was worth the wait!</p>\n<p>Harrison has a large, perky, bubble butt!</p>\n<p>&quot;Wow! Your ass is massive!&quot;</p>\n<p>&quot;Thanks...&quot; he responded as he turned bright red again.</p>\n<p>As we got underway I couldn't help but notice that Harrison was dripping a lot of precum... so much so that he was using it as lube.</p>\n<p>&quot;Um, that's a lot of precum!&quot;</p>\n<p> &quot;Yeah,&quot; he laughed. &quot;It's really awkward when I start leaking in class. I get up and there is a huge wet spot on my pants!&quot;</p>\n<p>Harrison is in college trying to get the most out of life and taking advantage of what adventures come his way.</p>\n<p>He has a tattoo which explains his philosoply.</p>\n<p>&quot;One life, one chance,&quot; he explained as he showed it to us.&quot;I got it as a reminder to always take risks, and never to settle!&quot;</p>\n<p>&quot;That must be what brought you here today then?&quot;</p>\n<p>&quot;That and a chance to play with my balls!&quot; he replied. </p>\n<p>Harrison's balls were big and he liked to tug on them a lot. And when he came, he shot almost all the way to his face!</p>\n<p>&quot;Does it ever hit you in the mouth?&quot;</p>\n<p>&quot;Once or twice... maybe three times,&quot; he said. His cheeks instantly got red again!</p>",
  "models": [
    {
      "name": "Harrison",
      "person_id": 19817
    }
  ],
  "release_date": "2012-04-17",
  "scene_id": 2703041,
  "series": [],
  "tags": [
    "Solo",
    "Muscular",
    "Athlete/Jock"
  ],
  "title": "Harrison"
}