{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1459
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>One of my favorite things in life is hanging out with our guys. We went to breakfast with Troy and Jarek at a really great little beach cafe and then I took them over to explore the rocky coast line. Once there, they turned into little kids!</p>\n<p>“I love that your’e doing this in flip flops!” Troy said to Jarek.</p>\n<p>“I love that you’re doing this in nice jeans, glasses and a fancy watch!” Jarek replied.</p>\n<p>Troy knew he’d been called out and he blushed. I thought it was hilarious!</p>\n<p>Jarek stripped down to his undies and he flashed the camera a few times. The two romped around the rocks for a while, skipping stones and exploring. At one point, Jarek just sat down and got soaked by the waves.</p>\n<p>“This is fun!” he said, with a big, big smile!</p>\n<p>Once we got back to the house, Troy decided that he wanted to do something different. He went into the bathroom, got out the shaving cream and razor, and started to shave off his scruff.</p>\n<p>“Wow... you’re being adventurous,” I said. “How long has it been since you shaved?”</p>\n<p>“Dude it’s been so fucking long,” he said. “Like literally 5 years... I’m probably gonna look like a little boy.”</p>\n<p>Once he was finished, he did look very innocent!</p>\n<p>I think that Troy was a little nervous about taking Jarek’s big dick, so Jarek used his tongue to prep Troy’s hole.</p>\n<p>“Damn, I’m working up a sweat over here!” Troy said. “Let’s do that some more!”</p>\n<p>Jarek smiled mischievously and then shoved his tongue back into Troy’s hole.</p>\n<p>Jarek was eager to fuck, and once they got going Troy’s nerves faded and he really started enjoying himself.</p>\n<p>“Damn, he can fuck an ass!” Troy said, looking back at Jarek.</p>",
  "models": [
    {
      "name": "Jarec Wentworth",
      "person_id": 17785
    },
    {
      "name": "Troy",
      "person_id": 18009
    }
  ],
  "release_date": "2012-08-05",
  "scene_id": 2703591,
  "series": [],
  "tags": [
    "Latin",
    "Athlete/Jock",
    "Anal",
    "Bareback",
    "Behind The Scenes",
    "Big Dick",
    "Uncut"
  ],
  "title": "Troy & Jarek: Bareback"
}