{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1473
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>“I have to be totally honest with you,” Joshua said, nodding his head toward Aidan. “I have a man crush on him. A huge one!”</p>\n<p>“Really?”</p>\n<p>“Yeah! I mean he’s the hottest guy I’ve been with yet! Hands down!”</p>\n<p>Aidan overhead us talking and looked over with a smile.</p>\n<p>Joshua met his gaze and said, “There is something about you... I just... damn I just wanna kiss those lips!”</p>\n<p>I joke with Joshua that every time he’s here he gets a little more gay, and this day was no exception.</p>\n<p>“I think by the time you leave here today you will be 100% gay!”</p>\n<p>“Fuck that,” Joshua said. “I think by the time my lips touch his I’ll be there!”</p>\n<p>I loved that Joshua was excited. Aidan had been kind of quiet, but I could tell he was excited too.</p>\n<p>“I’ve totally jerked off to your films before,” he finally said. Both of them laughed.</p>\n<p>They were both adorable and it seemed the longer we filmed, the more these two wanted each other. At one point they hijacked our cameras and filmed each other when we weren’t in the room. You could hear Joshua growling over Aidan’s arms. </p>\n<p>“I love nice arms,” he said. “Muscles are sexy. I just want to be in your arms.”</p>\n<p>Joshua had his way with Aidan until he couldn’t hold it any longer. He shot load all over Aidan’s hole and then went right in.</p>\n<p>“I have this need to fill him full of cum,” Joshua said. “I don’t know what it is... I can’t get enough!”</p>",
  "models": [
    {
      "name": "Aidan",
      "person_id": 18117
    },
    {
      "name": "Joshua",
      "person_id": 18151
    }
  ],
  "release_date": "2012-09-02",
  "scene_id": 2703731,
  "series": [],
  "tags": [
    "Athlete/Jock",
    "Anal",
    "Bareback",
    "Behind The Scenes",
    "Big Dick"
  ],
  "title": "Aidan & Joshua: Bareback"
}