{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1466
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Ashton has had some very interesting experiences in his life.</p>\n<p>“I used to be a pirate!”</p>\n<p>“Wait...” I said. ‘“A pirate?” I was confused.</p>\n<p>“Yeah when I was younger I was a pirate,” he explained. “My family and I were like a traveling circus. My dad would dress me up in a pirate costume! I had a little wooden sword and everything.”</p>\n<p>Everything about Ashton is entertaining -- his personality, his jokes, and his life stories. Being in the same room with him just puts a smile on your face. </p>\n<p>“I was in the Marines, I was a pirate, a skateboarder, and a student... I was gay for a while too!”</p>\n<p>He tried to get that one by without me noticing!</p>\n<p>“Yeah in high school I used to swing back and forth!”</p>\n<p>“Like a swing!”</p>\n<p>He laughed. “I guess so, like a swing. I just liked each equally. They brought different things to the table!”</p>\n<p>“So what’s on your table now?”</p>\n<p>“Right now,” he said, pausing for a moment... “Well it’s been a while since I’ve been with a guy. I guess that’s why I’m here!”</p>\n<p>One thing I figured out right away is that Ashton loves to be watched. And he loves to keep things interesting.</p>\n<p>“I like to get creative when I jerk off,” he said. “Sometimes I aim for my mouth... it adds a little bit more to the experience.”</p>\n<p>“What do you do when it gets in your mouth?”</p>\n<p>“Swallow!” he said. “Spitting is for quitters!”</p>\n<p>He just kept on surprising us!</p>",
  "models": [
    {
      "name": "Ashton",
      "person_id": 17687
    }
  ],
  "release_date": "2012-08-19",
  "scene_id": 2703661,
  "series": [],
  "tags": [
    "Solo",
    "Muscular",
    "Athlete/Jock",
    "Behind The Scenes",
    "Big Dick"
  ],
  "title": "Ashton"
}