{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1469
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Ashton admitted during his first visit that he'd been with other guys, but not recently. He was definitely ready to jump back on to that boat!</p>\n<p>“He’s got nice lips,” he said, standing next to Jordan. “Let’s see what they can do!”</p>\n<p>I thought that Ashton and Jordan made a really cute pair. They even look kind of similar. Both have deep tans and sculpted bodies. Right away they hit it off, and I even noticed a bit of flirting.</p>\n<p>Ashton was rock hard while he passionately kissed Jordan.</p>\n<p>Jordan wasted no time, and dropped to his knees to worship Ashton’s dick. He put his lips around Ashton’s cock and swallowed the whole thing... all the way to the base!</p>\n<p>“You took the whole thing!” I whispered, pleasantly surprised. “That’s something!”</p>\n<p>“Yeah, I’ve been practicing.”</p>\n<p>He wouldn’t say exactly how he had been “practicing,” but I saw him taking Ashton’s dick off camera a few times.</p>\n<p>“I wanted to make sure I did a good job,” Jordan said. He was blushing, with a smile from ear to ear.</p>\n<p>Jordan didn’t stop there. He went on to Ashton’s hole, shoving his face in deep.</p>\n<p>“It tickles and feels fucking great at the same time,” Ashton said. “I can’t hold it much longer!” </p>\n<p>That just made Jordan go faster and harder, until Ashton unloaded all over Jordan’s face. They both looked spent, and they shared Ashton’s cum in their mouths.</p>\n<p>“I’m a mess,” Jordan said. “I feel like I’m covered in spit and cum!”</p>\n<p>“That’s ‘cause you are,” Ashton laughed.</p>",
  "models": [
    {
      "name": "Ashton",
      "person_id": 17687
    },
    {
      "name": "Jordan",
      "person_id": 17685
    }
  ],
  "release_date": "2012-08-25",
  "scene_id": 2703691,
  "series": [],
  "tags": [
    "Blowjob",
    "Muscular",
    "Athlete/Jock",
    "Behind The Scenes",
    "Big Dick"
  ],
  "title": "Ashton & Jordan"
}