{
  "alt_ids": [
    {
      "name": "spartan",
      "value": 1517
    }
  ],
  "collections": [
    "Sean Cody"
  ],
  "description": "<p>Ryan is such a horny bottom that he tends to turn every situation into a sexual one, including a nice relaxing dip in the hot tub.</p>\n<p>“This would totally be a great place to get my ass pounded,” he said as he splashed in the hot bubbling water.</p>\n<p>Jarek laughed and leaned over and gave him a kiss.</p>\n<p>“Damn, you’re adorable!” he said.</p>\n<p>It was cold outside and when they got out of the water the chill of the evening air hit them quickly. They ran inside, their swim trunks wet and plastered against their skin.</p>\n<p>Ryan’s eyes were wide. “I could tell through his shorts earlier that he had a big dick,” he said, staring at Jarek’s cock, the outline of which was plainly visible. “But damn!”</p>\n<p>Ryan reached over and stroked his partner’s cock.</p>\n<p>“Are you impressed?” I asked.</p>\n<p>“Fuck yeah!” he said. “That thing is as thick as my wrist!”</p>\n<p>All that talk about his cock had Jarek hard right away. Ryan pulled Jarek’s swim trunks down to his knees.</p>\n<p>“I’m not sure it’s gonna fit,” Ryan said, opening his mouth wide. “But I’m gonna try!”</p>\n<p>That just got Jarek started. He quickly spun Ryan around and started to fuck him hard.</p>\n<p>“I could feel him pump that cum deep in me,” Ryan said shortly after Jarek busted his first nut inside him.</p>\n<p>“How much do you think is in there?” I asked.</p>\n<p>“I don’t know.”</p>\n<p>“Well show me!”</p>\n<p>Ryan turned around and pushed out the warm load that Jarek had left inside of him.</p>\n<p>“Whoa!”</p>\n<p>That was all I could think to say!</p>\n<p>But that wasn’t the end. You’ve simply got to see what what Ryan does with the second load Jarek dumps in his ass!</p>\n<p>“What can I say,” Ryan said with a grin. “I’m a dirty boy!”</p>",
  "models": [
    {
      "name": "Colt Rivers",
      "person_id": 17667
    },
    {
      "name": "Jarek",
      "person_id": 17785
    }
  ],
  "release_date": "2012-11-29",
  "scene_id": 2704171,
  "series": [],
  "tags": [
    "Creampie",
    "Hairy",
    "Athlete/Jock",
    "Anal",
    "Bareback",
    "Behind The Scenes",
    "Big Dick",
    "Uncut"
  ],
  "title": "Ryan & Jarek: Bareback"
}