{
  "description": "It was early in the morning and the driver had just dropped off Parker. He was wearing a worn polo shirt with sweat pants that didn't match. But I didn't really care because his pecs were popping out from behind his shirt and he had a big smile on his face. He is always so happy to see me...\nI gave him a big hug and it was all I could to resist reaching down and grabbing his beautiful ass. I can be dirty that way... but not with Parker because I respect him too much.\nWe talked shit for a bit and I realized that with every shoot he does he likes it more and more.\n\"I always have fun with you guys.\" I've heard him say that many times before.\nThis time I asked, \"What, you like the work or you like the sex?\"\n\"A little of both,\" he replied.\nTerry had already arrived and was prepping himself in the back. Parker asked if he could watch, just on the off chance that if he ever decided to bottom he'd know what he was in for (although at this point I'm wondering if that will ever happen).\nI introduced the two of them, and even though Terry had a big dildo in his ass they cordially exchanged 'hellos'.\nAround here, Parker is kind of the class clown. He reminds me a lot of Sam the Eagle from the old Muppets show (if you were born after 1980 please disregard that reference). But damn, is he sexy and charming. And Terry though so too. As they were sitting there conversing — Parker fully clothed and Terry completely naked — Terry's dick got hard and starting dripping. I could tell our sexy bottom boy wanted Parker.\nThere wasn't a whole lot of set up from there. Terry got dressed and the cameras started rolling.\nParker was cracking jokes and then, quite unexpectedly, he got this mischievous grin on his face and stuck his tongue in Terry's mouth. That was hot!\nA shower was next, and Terry got Parker hard and masterfully worked his cock and low-hanging balls.\nAnd then the fucking... well, see for yourself. I always love it when two models genuinely enjoy themselves and I think it really shows in this one!",
  "models": [
    {
      "name": "Parker",
      "person_id": 265
    },
    {
      "name": "Terry",
      "person_id": 350
    }
  ],
  "release_date": "2007-05-18",
  "scene_id": 481,
  "tags": [
    "Anal",
    "Behind the Scenes",
    "Jock",
    "Twinks"
  ],
  "title": "Parker & Terry"
}