{
  "collections": [
    "Sean Cody"
  ],
  "description": "Danny has a really nice set of nuts. Perfect orbs in a smooth, loose, buttery nut sack that lets you see the fluid movement of each testicle.\nHe's also looking very cut and muscular, and the ripped wife beater he was wearing when we picked him up at his hotel showed it all. Absolutely perfect pecs.\n\"You look a lot more tan than last time,\" I commented.\n\"Yeah, I've been working outside a lot,\" he replied.\n\"Doing what?\"\n\"Building grain silos.\" Wow. Midwest perfection at it's finest.\nNext stop: Terry's hotel. Terry jumped into the car with a big smile on his face. He hadn't seen Danny yet and he tried not to stare at the hot young muscle boy sitting next to him.\nAs an ice breaker, we had Danny slide off his pants, right there in the car. Terry went straight for the nuts. I knew he would. I would too.\nIt wasn't long before they were both inside. Danny flexed his muscles while Terry poured oil all over him.\n\"Show off your body,\" I instructed lightly. But I didn't have to because it was obvious Danny loves showing off.\nThe progression of this film is interesting.\nDanny started off with a curious look. \"OK, someone is licking my asshole.\" You can almost see the thought going through his head.\nThen it progressed and progressed until Danny finally grabbed the back of Terry's head.\n\"Suck it!\" he ordered, as his nuts slapped against Terry's chin. Then a change of position and our straight boy was tea bagging for the very first time!\nTerry was so horned up from servicing Danny that immediately after Danny dropped his load into Terry's mouth, Terry shot so far and hard that he splattered Danny's thigh...",
  "models": [
    {
      "name": "Danny",
      "person_id": 357
    },
    {
      "name": "Terry",
      "person_id": 350
    }
  ],
  "release_date": "2007-06-15",
  "scene_id": 490,
  "tags": [
    "Blow Job",
    "Cum Swallowing",
    "Facials",
    "Jock",
    "Massage",
    "Muscles",
    "Twinks"
  ],
  "title": "Danny & Terry"
}