{
  "description": "Every day, I get a lot of e-mail from guys who want to model. It really runs the spectrum.\nAbout a month ago I received an e-mail with a bunch of pictures attached.\nThe guy in the pictures was really cute, with a muscular body and long, uncut dick. His face was handsome and distinctly eastern European. The last picture was the most interesting — him kneeling on a bed with his ass straight up the air, showing off his hole.\nHis name is Jurek. He had given a phone number in the e-mail, and I called him immediately. A lot of times I just get voice mail, but not this time.\n\"Hello?\"\n\"Hi, is this Jurek?\" I asked.\n\"Umm... yeah...\"\n\"Hey Jurek it's Sean Cody. You sent your pictures in.\"\n\"Oh, wow! Hey how's it going?\"\nHe seemed surprised that I actually called.\nFrom his pictures, I expected a thick Russian accent. Jurek actually has a very east coast way of speaking, almost a mix of Boston and New York.\n\"So I really like your pictures and I want to get you out here.\"\nHe laughed nervously. He's shy. I like that.\nA week or so later I finally got to meet him in person. Dang, he's cute. I had him get naked and my eyes were immediately drawn to the big piece of meat hanging between his legs. It's thick, long, and veiny, and it has a large head that his foreskin can barely contain.\nNow, I like to talk to a model when he's naked. People are much more real when they're naked.\nI discovered that Jurek was born in Russia, near Moscow, but his family immigrated to the United States when he was four. He's been working construction for the past four years.\nThen the usual question: \"Are you gay or straight?\"\nHe looked away. There was a long pause. Then he looked back at me.\n\"I'm straight,\" he said. His big dick was swinging slightly and the head was peeking out a little more.\n\"You ready to do a film?\" I asked.\n\"Yeah.\"\nHe was a natural. A little shy at first but a great performance.\n\"Do you think you might come back for more?\" I asked. I think he knew what I meant.\n\"That depends on you... if you guys like it,\" he said, and smiled at the camera...",
  "models": [
    {
      "name": "Jurek",
      "person_id": 362
    }
  ],
  "release_date": "2007-07-03",
  "scene_id": 495,
  "tags": [
    "Jock",
    "Muscles",
    "Solo",
    "Uncut"
  ],
  "title": "Jurek"
}