{
  "description": "Rory is a laid-back straight guy who loves to bicycle. He is a friend of another model and he’s local, so I asked him to come in for a meeting.\nHe arrived on his bicycle, almost 45 minutes late, wearing nothing but skimpy runner’s shorts. He was really, really sweaty (it was the middle of summer) and as he dismounted his bike he took a tank top out of his pack and put it on.\n“Dude, sorry about that,” he said as he walked in.\n“That’s OK,” I said, eyeing his muscular, sweaty body. “Do you bicycle everywhere?”\n“Yeah, dude, I don’t even own a car.”\nSo I got Rory some water and we sat down at a table to talk. I noticed right away that he had a big scrape on his forearm.\n“How did you get that?” I asked, pointing at the injury.\n“Oh, I got this last week,” he replied. “I was getting a little gnarly around a corner and went down pretty hard.”\n“I dunno,” I said. “We might want to let that heal up before we film you.”\n“OK, dude, whatever. But the girls think it’s hot…”\nHe had a big smile on his face as he looked at the scrape and then looked up at me. It just worked.\n“OK, we’ll leave it,” I said. “Speaking of girls, do you have a girlfriend?”\n“Ummm, I have a chick I’m fucking three times a week,” he said.\n“But she’s not your girlfriend?”\n“No.”\nSo, the next day we filmed Rory, scrape and all.\nOf course, I couldn’t resist taking him out into the woods. He was all over the place with his bike. It was hot and he was sweating.\nAfterward, I took his hot, sweaty ass to a friend’s empty garage.\n“Damn, dude, you got a thick cock!” I commented as he was stroking it. “How do you get that shit in your friend’s pussy?”\nHe just smiled, tensed up, and then dumped his load all over his bicycle seat…",
  "models": [
    {
      "name": "Rory",
      "person_id": 365
    }
  ],
  "release_date": "2007-07-24",
  "scene_id": 501,
  "tags": [
    "Big Dick",
    "Jock",
    "Muscles",
    "Solo"
  ],
  "title": "Rory"
}