{
  "collections": [
    "English Lads"
  ],
  "description": "Now here is a match made in heaven; two straight boys, Rich is a Personal Trainer and has a surprise in his pants as he is hung like a horse and enjoys having his big uncut cock being played with, so who better than naughty boy Chris! Chris is lean and toned and nicely tanned and leading this shoot he is soon in Rich’s boxers and pulls out Rich’s 9 inch uncut cock and manages to down nearly the whole thing. How did he do that, though when you see him sit down on Rich’s uncut cock; how the hell did he manage that?! It didn’t go all in straight away, but after a little expanding straight pup Chris slides down the whole of massive Rich’s cock and check out his facial expressions! Anyone gay guy that can ride horse hung Rich is impressive, so to see Chris do this is amazing, since he has only had a little poke around in our shoot in Spain. Today it is in deep and full and check out how Chris rides it and judging how much cum explodes over him, he didn’t mind Rich probing his back alley! Lots of fun these two, Rich pulls out and does his own impressive real intense cum shot! Real straight boys having gay sex, it has to be seen to be believed.",
  "models": [
    {
      "name": "Chris Little",
      "person_id": null
    },
    {
      "name": "Rich Wills",
      "person_id": null
    }
  ],
  "release_date": "2014-11-08",
  "scene_id": 1707,
  "tags": [
    "wanking",
    "video of photo shoot",
    "uncut cock",
    "twink",
    "str8 lad duo",
    "str8 guy sucking",
    "str8 guy getting sucked",
    "str8 guy getting fucked",
    "str8 guy fucking",
    "smooth body",
    "indoor",
    "fucking",
    "extra big cock",
    "defined body",
    "cock sucking",
    "cock fighting",
    "cheeky banter",
    "cheeks spread",
    "big cock",
    "action in underwear",
    "2 in 1 hand"
  ],
  "title": "Bonus Video of Photo Shoot - Naughty Chris Gets Fucked by Rich's 9 Inch Uncut Cock!"
}