{
  "collections": [
    "English Lads"
  ],
  "description": "This package is a streaming version of an entertaining 50 minute 'Making of the calendar, part 2. Eight of our hottest lads got down and dirty in Dorset for the weekend of a lifetime while making our super sexy 2017 calendar - with only one rule: they had to spend the entire duration of the trip naked. Contains full frontal nudity. The hunks leave nothing to the imagination during their stay in the grand house - as they enjoyed a series of entertaining activities that will leave jaws on the ground. Part two of the video, starts with a group shower as all lads squeeze into one bathroom. In the following 50 minutes it’s full of raunchy action and includes loads of flying balls on the tennis courts and even more of it when three take to the trampoline! Take eight young men to the beach when it’s a scorching hot day and it’s bound to be full of mischief as they play naked games in the sea! At the beach house it’s all calm for a game of naked giant jenga, real competitive and fun. After all this activity the lads come inside to relax, as they all hang out, quite literally, in the manor house in the evening for a chill out session, and have some light-hearted banter and play a bit of music - baring themselves in more ways than one. You’ll also be given the chance to get to know the lads a bit better in the video. This access-all-areas video also shows the hunks play fighting, bonding and just occasionally they each pause for a moment to talk to us! See our gorgeous models from every angle - with nothing censored - in a fun-filled 50 minute video, which is classified by the BBFC as certificate 18, and available to stream. You’ll also be able to see every inch of flesh in as much dirty detail as possible, as the footage was filmed in 4K – which offers eight times more clarity than HD, from both drone and multiple videos on the ground.",
  "models": [
    {
      "name": "Aaron Janes",
      "person_id": null
    },
    {
      "name": "Caspar Hamilton",
      "person_id": null
    },
    {
      "name": "Dan Fellows",
      "person_id": null
    },
    {
      "name": "Danny McCaw",
      "person_id": null
    },
    {
      "name": "Jack Ashton",
      "person_id": null
    },
    {
      "name": "Joel Jenkins",
      "person_id": null
    },
    {
      "name": "Travis Banfield",
      "person_id": null
    }
  ],
  "release_date": "2017-06-20",
  "scene_id": 2082,
  "tags": [],
  "title": "Making of the Ripped and Stripped 2017 Calendar - Part 2 - Streaming"
}