{
  "collections": [
    "English Lads"
  ],
  "description": "A download version of an entertaining 55 minute 'Making of' video, part 1. Eight of our hottest lads got down and dirty in Dorset for the weekend of a lifetime while making our super sexy 2017 calendar - with only one rule: they had to spend the entire duration of the trip naked. Contains full frontal nudity. The hunks leave nothing to the imagination during their stay in the grand house - as they enjoyed a series of entertaining activities that will leave jaws on the ground. Part one of the video includes the young men arriving and being greeted and asked to strip; once naked they all get limbered up for a group stretching session, meaning we got to see them in some extremely compromising positions, before applying sun-cream to each other in preparation for a day in the sun. Now it’s time to get to know each other better, some body painting, where they all got up, close and personal with each other's sticky body parts before helping each other try and wash it off. This dry body paint doesn’t seem to come off very easily! Now nicely wet and the guys play around in the pool, some great underwater filming adds to fun as their high spirits mean there are many things all happening at once! This access-all-areas video also shows the hunks play fighting, bonding and just occasionally they each pause for a moment to talk to us! See our gorgeous models from every angle - with nothing censored - in a fun-filled 55 minute video, which is classified by the BBFC as certificate 18, and available to download or stream. You’ll also be able to see every inch of flesh in as much dirty detail as possible, as the footage was filmed in 4K – which offers eight times more clarity than HD, from both drone and multiple videos on the ground. Part two is a whole different film.",
  "models": [
    {
      "name": "Aaron Janes",
      "person_id": null
    },
    {
      "name": "Joel Jenkins",
      "person_id": null
    },
    {
      "name": "Travis Banfield",
      "person_id": null
    },
    {
      "name": "Dan Fellows",
      "person_id": null
    },
    {
      "name": "Danny McCaw",
      "person_id": null
    },
    {
      "name": "Caspar Hamilton",
      "person_id": null
    },
    {
      "name": "Jack Ashton",
      "person_id": null
    }
  ],
  "release_date": "2017-06-26",
  "scene_id": 2085,
  "tags": [],
  "title": "Making of the Ripped and Stripped 2017 Calendar - Part 1 - Download Version"
}