{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Director's Pick: Re-lease of Past Summer Vengeance matche. This match is from season 7. Its the the Quarter Finals of the 2010 Summer Vengeance Tournament! The top 16 wrestlers battle it out in single elimination! ISIS LOVE\nThe Goddess\nHT: 5'6\nWT: 124lbs\nSeason record (5-0)\nRanked 7thDRAGONLILY\nThe Dragon\nHT: 5'4\nWT: 124lbs\nSeason record (4-0)\nRanked 1st\nThis is by far the best match we shot this year. Both wrestlers went undefeated this season. Both wrestlers are veterans from the very first season of Ultimate Surrender, actually the only ones on the roster from the first season. These are two of the most experienced wrestlers this franchise has to offer.\nThe Dragon dominates and humiliates The Goddess. Amazing hold after amazing hold is put on Isis and she is helpless to defend her pussy or her pride. Head scissors, body scissors, and holds only the Dragon can perform are all used on Isis. Dragon fingers Isis and has her moaning on the mat early and often. Isis is just overpowered and outclassed at almost every turn.\nThe Dragon traps Isis in a unique hold and fingers her to two earth shattering ORGASMS on the mat! Isis is reduced to a cumming whore and she is powerless to defend herself! The Dragon doesn't stop there, in RD4 Isis is brutally fucked to more orgasms and made to squirt all over herself. All pride and past glory erased in one single match. Isis is beaten, defeated, and left spasming alone on the mat.\nThis is Isis' last match for Ultimate Surrender. Show your support for all she has done for this sport and leave a parting comment for one of the best wrestlers we have ever had the pleasure of watching.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "DragonLily",
      "person_id": 3433
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    }
  ],
  "release_date": "2013-07-15",
  "scene_id": 10040,
  "tags": [
    "Asian",
    "athletic",
    "big tits",
    "Bizarre",
    "bondage",
    "brunette",
    "champion",
    "domination",
    "Facesitting",
    "femdom",
    "Fingering",
    "hair pulling",
    "Hitachi",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "oral sex",
    "Pussy Eating",
    "small tits",
    "smothering",
    "straight",
    "strap on",
    "submission",
    "tattoo",
    "tournament",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Isis Destroyed on the Mat! Dragon Makes her Cum Blast from the Past"
}