{
  "collections": [
    "Kinky Bites"
  ],
  "description": "Korra Del Rio is enjoying her new apartment. She barely had time to unpack her bags before Casey Kisses gave her a good fucking. Now Korra is about to get to know her other roommate, Kylie Le Beau. Any questions Korra may have had about Casey and Kylie’s unique living arrangement are quickly answered when Kylie spreads her legs on her clean, white sofa for Korra. Korra enjoys sucking on Kylie’s pussy. A few smacks of a leather crop gives a sting that turns Kylie on. Korra decides now is a good time to get to know Kylie better, and what better way than to thrust your hard cock into your roommate’s sexy mouth? Kylie’s mouth welcomes Korra in that special deep throat way, and she doesn’t flinch when Korra continues to smack her tender pussy with the crop.\n\nThere is more to Kylie than just a hungry mouth and deep throat, and Korra has her turn around to inspect her backside. Time to get that pussy wet with a little dildo action while Korra runs her tongue up and down Kylie’s anus. Before you know it Kylie’s pussy is dripping wet and ready for Korra’s hard cock. Kylie gets fucked hard and deep from various positions on the once clean sofa. Korra can’t believe her luck that she stumbled upon such a great apartment with such sexy roommates.\n\nThe next day Korra makes a shocking discovery- somebody has left a laptop open on the kitchen table playing a movie of Korra alone in the bathroom. Korra’s roommates have been secretly filming her ever since she moved into the apartment! It’s upsetting but Korra can’t stop herself from looking at more movies showing her and Casey fucking in the privacy of Korra’s bedroom. Korra is outraged and humiliated, yet she can’t help but notice how sexy she looks, remembering how much she enjoyed getting fucked by Casey. Watching the spy cam movies is turning her on. Now Korra has a choice to make- either report Casey and Kylie to the police, or plan her own surprise for her two lusty roommates.\n\nAll 3 episodes in this series:\nVoyeur Cam: Part 1\nVoyeur Cam: Part 2\nVoyeur Cam: Part 3",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Korra Del Rio",
      "person_id": 56019
    },
    {
      "name": "Kylie Le Beau",
      "person_id": 62859
    }
  ],
  "release_date": "2020-10-30",
  "scene_id": 101049,
  "tags": [
    "Blowjob",
    "Crop",
    "Dildo",
    "Kinky",
    "Leather",
    "Pussy Eating",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Voyeur",
    "white"
  ],
  "title": "Voyeur Cam Pt. 2: Kylie Le Beau Sucks and Fucks Roommate Korra Del Rio"
}