{
  "collections": [
    "Kinky Bites"
  ],
  "description": "On this episode of Exclusive Story we find starlets Ella Nova and Juliette March deeply embroiled in a heated Hollywood feud. After pleading their cases in this tabloid expose, these women truly have it out, in a hot lesbian switch scene. Ella punishes Juliette for embarrassing her in the interview by spanking her round butt until it is bright red. She pulls down her shorts and pulls her skimpy underwear into a wedgie while Juliette screams out for her to stop. Despite her protests, Juliette’s wet pussy gives her pleasure away when Ella fingers her and presses the vibrator onto her cunt. Juliette bucks her hips and gasps for air as Ella pulls multiple orgasms out of her. She is then spanked with an Ella Nova brand, heart covered paddle. After tying Ella’s arms and legs Juliette gets her turn. She teases her with the Hitachi on the outside of her underwear as she smothers her with her ass. She insists that Ella lick her ass between her hurried breaths. As Juliette toys with Ella’s air she crops her thighs and clit. Ella drools through her gag and all over her tits with her ass in the air begging for Juliette’s strapped on cock. Juliette obliges and fucks her deeply in doggy. Ella wrestles the strap on away to put it on herself. She fucks Juliette with the familiarity only a best friend has. She knows how to make her come and does so over and over. These women go back and forth one upping the other until they are rolling around covered in sweat and kissing. All is forgiven, for now.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "Juliette March",
      "person_id": 22072
    }
  ],
  "release_date": "2020-09-21",
  "scene_id": 101044,
  "tags": [
    "Ball Gag",
    "Bondage",
    "Crop",
    "Dildo",
    "Facesitting",
    "Fingering",
    "Gag",
    "Hitachi",
    "Lesbian",
    "multiple orgasms",
    "Nipple Clamps",
    "Paddle",
    "Smothering",
    "Spanking",
    "Strap On",
    "switch",
    "Vibrator"
  ],
  "title": "Exclusive Story: Ella Nova and Juliette March"
}