{
  "collections": [
    "Kinky Bites"
  ],
  "description": "This real-life kinky couple role play starts with Charlotte Sins sleeping in lingerie on an early morning. The sheets are pushed aside exposing her long tan legs and bubble butt. Uncle Alfie is a creepy intruder who stands above her breathing heavily, taking a moment to just watch her before grabbing her with leather gloves, pulling her out of bed and into the living room. He binds her to the couch with cuffs on her wrist and bondage tape on her ankle. He easily pins her down so he can lick, finger her cunt, and hold a vibrator on her clit. Initially she resists, kicking and screaming, but it doesn’t take long for her to grind against the toy as he pulls orgasms out of her. He slaps her face and spits in her mouth before putting her on the couch with the 4 cuffs locked behind her. He shoves his hard cock in Charlotte’s mouth and fucks her throat until his cock and her mouth are both dripping with her drool. He rubs the spit all over Charlotte’s face with his dick as he crops her ass. He flips her onto her knees and continues to face fuck her. Charlotte is bent over and spanked until her ass has a nice pink glow. She screams out in pleasure and pain. Alfie instructs her to spread her ass cheeks open so he can watch as his cock thrusts deep inside her. He flogs her thighs and ass as he fiercely fucks her tight pussy. He easily manhandles her onto her back so she could watch him as he comes on her pussy before thrusting inside, depositing more of his load in hopes of breeding with the beauty he has conquered.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Charlotte Sins",
      "person_id": 62327
    },
    {
      "name": "Uncle Alphie",
      "person_id": 63080
    }
  ],
  "release_date": "2020-09-04",
  "scene_id": 101043,
  "tags": [
    "BDSM",
    "blond",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Couple",
    "Creampie",
    "Domination",
    "drool",
    "Flogging",
    "gloves",
    "Kinky",
    "Leather",
    "Leather Gloves",
    "Lingerie",
    "Pain",
    "Role Play",
    "Rough Sex",
    "Slapping",
    "spit",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "The Creep"
}