{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Baby Sid wants to show her desperate sub, Heavybondage4life, what a good fucking from a real man truly looks like. She has orgasm after orgasm, riding H3ll4sl00tz’s face and cock as her sub struggles in a dark room on a bare mattress. Chained to the wall and bound at the ankles and wrists, Heavybondage4life’s bondage points his exposed eyes in the direction of the old television hanging by chains above him. Taunted by what he can never have, this sub has no choice but to watch his mistress take her bull’s hard cock in her mouth. Baby Sid sits on H3ll4sl00tz’s face as he licks her cunt and asshole. While she always loves H3ll4sl00tz’s tongue flicking her wet pussy and clit her pleasure is only heightened knowing her sub is watching while he jacks his pathetic little dick. Her sub sees the muscles on her ass twitch as she moans louder and louder building to a climax. She teases him with her smooth flawless ass and pussy before she calls her bull over to have the privilege of fucking her. A privilege Heavybondage4life will never know. Sid fucks her bull hard, coming on his cock and talking shit the entire time. After getting pounded on all fours Sid rides his rock hard cock in reverse cowgirl. Her perky huge tits bounce up and down. She comes a final time drenched in sweat with a big beautiful smile on her face. You see, making pathetic worms watch her get fucked as she laughs is Sid’s favorite pastime!",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Baby Sid",
      "person_id": 61679
    },
    {
      "name": "H3ll4SL00tz",
      "person_id": 61686
    },
    {
      "name": "Heavybondage4life",
      "person_id": 62351
    }
  ],
  "release_date": "2020-08-14",
  "scene_id": 101041,
  "tags": [
    "Blonde",
    "Bondage",
    "Chains",
    "Corset",
    "Cuckolding",
    "gloves",
    "Pussy Eating",
    "smooth",
    "Sub",
    "Tattoo",
    "the wall",
    "Vibrator"
  ],
  "title": "Stroke Your Ugly Little Cock and Watch Me Come"
}