{
  "collections": [
    "Sweet FemDom"
  ],
  "description": "Pierce Paris comes to in a white and well lit room. He’s all alone. He does not know how he got there and does not see a door to exit. He’s in his underwear.\n\nAkira Shell struts in suddenly wearing shiny pantyhose, fishnets, a high cut leotard, heels and a corset. She looks hot AF. She tells him that there is no escape. There is no where to go. There is nothing more after this. He is only there to do what pleases her now. Then she hits him in the balls.\n\nAkira starts light, but picks up the brutality and starts kicking him really hard after she makes him strip off her high heels. She laughs when he falls.\n\n“Oh this is nothing. I’m going to get way worse…”\n\nDays have passed. Pierce still doesn’t know what is going on. He’s starting to break. Akira returns to him, this time with a HUGE pink strap on. She hits him in the face with it and giggles when he winces.\n\nAkira bends him over and slides her giant cock inside him, stretching him out completely and filling him up. She fucks him slow and fast with long strokes, smiling the whole time.\n\nShe fucks him on his back and strokes his massive hard on. She has not let him cum or jerk off since he arrived. With all the pounding on his prostate, he’s begging to cum. She denies him and leaves him with a stretched hole and blue balls.\n\nNow Akira is wearing a white leotard, shiny pantyhose, fishnets and sneakers. She got her giant pink strap on cock ready for fuck Pierce’s brains out again. He is on his back in a sling with his legs up and spread wide, completely vulnerable.\n\n“You wanted to cum so bad? Well when I’m done, you’re going to be begging me stop making you cum.”\n\nAkira slides her giant pink cock inside him and starts to stroke his cock after pounding his hole for a while. He quickly begs her to cum. She stands up, bends over and starts sucking his cock. He can’t believe it. This beautiful woman who has been tormenting him for so long has his cock in her mouth. She smiles when he loses control and blows his load in her mouth. She spits it on his stomach, then tells him the deal.\n\nI’m not done here. I’m going to keep fucking your ass, stroking and sucking your cock until you are completely empty. This might even feel good the second time, but after the 3rd, 4th, 5th… it’s going to really hurt from the inside of your dying balls to the tip of your sensitive cock…\n\nAkira keeps her word and laughs while she pounds his ass and makes him cum over and over and over. She spits his cum on her own leg, on her leotard, and still looks powerful covering both of them in every last drop of his cum while she fucks his brains out with an oversized strap on.",
  "directors": [],
  "models": [
    {
      "name": "Akira Shell",
      "person_id": 63068
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2020-07-29",
  "scene_id": 101037,
  "tags": [
    "Anal",
    "CBT",
    "CFNM",
    "Corset",
    "Domination",
    "Facesitting",
    "Femdom",
    "Fishnets",
    "High Heels",
    "Orgasm Denial",
    "Pegging",
    "Slave",
    "Strap On",
    "white"
  ],
  "title": "Life as a Slave for Akira Shell"
}