{
  "collections": [
    "Kinky Bites"
  ],
  "description": "Casey and Kylie are sneaky, slutty, perverted pornographers who find unsuspecting, sexy roommates to move in on the cheap. They don’t need a deposit or credit check, just loose morals and a willingness to fuck in every room in the house. Korra is the newest in a long line of hot roommates.\n\nAfter lingering in the hallway as she watched Kylie and Casey kissing, fingering and sucking on each other, Korra runs to the bathroom flustered, incredibly turned on by the hot couple. She gathers her composure, wraps a towel around her body, and goes to her new bedroom. To her delight and surprise she finds Casey hanging out on her bed in a bikini. Casey has already set the sneaker camera up and it is recording.\n\nCasey tells her she thinks they wear the same size lingerie and wants Korra to play dress up with her. After Korra puts a black lacy set on, Casey quickly puts her over her knees and spanks her ass. Korra loves every minute of it as she grinds her hard cock onto Casey’s thigh. Korra hungrily licks and sucks Casey’s throbbing cock as her own bursts out of her sexy black underwear. And that’s not all Casey entices Korra to try on.\n\nCasey pulls out open mouth gag in the shape of lips that she immediately spits into once it’s on Korra. She bends Korra over and thrusts her dick deep into her ass eliciting a breathy moan. She then blindfolds an innocent trembling Korra and continues to pound her ass as she strokes her cock. Korra begs for more. She has never done anything so kinky before and she loves it. Casey has her completely in her control. She comes on Korra’s beautiful face dripping hot white come down her chin and into her mouth. Korra licks it up like a good girl. This new housing situation is going to work out just fine.\n\nAll 3 episodes in this series:\nVoyeur Cam: Part 1\nVoyeur Cam: Part 2\nVoyeur Cam: Part 3",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Korra Del Rio",
      "person_id": 56019
    },
    {
      "name": "Kylie Le Beau",
      "person_id": 62859
    }
  ],
  "release_date": "2020-10-21",
  "scene_id": 101047,
  "tags": [
    "Anal",
    "Blindfold",
    "Blowjob",
    "Couple",
    "Crop",
    "Domination",
    "Facial",
    "Fingering",
    "Gag",
    "Kinky",
    "Lesbian",
    "Lingerie",
    "Spanking",
    "spit",
    "TS",
    "Voyeur",
    "white"
  ],
  "title": "Voyeur Cam Pt. 1: Casey Kisses Seduces New Roommate Korra Del Rio"
}