{
  "collections": [
    "Missionary Boyz"
  ],
  "description": "The mischievous Elder Ence (Micahel DelRay) is beginning to realize that being obedient can have it’s upsides. Before he began his long journey towards joining The Order, he had always reacted badly to the idea of serving a master. In Sunday school, seminary and the MTC his teachers seemed to respond to his independent spirit with lessons that drew from scriptures about obedience and submitting to the will of the father. But the lessons about submissiveness and meekness never really sank in. He was his own master. As a missionary he didn’t know what to call it, but around the other missionary boys he thought of himself as an alpha male. He wanted to be in charge, and he wanted to seduce each and every beautiful young missionary in the field. So when he was paired with Elder Dudley, he just did what came naturally to him. Elder Ence loved watching the other missionary boys writhe and moan as he filled their holes with his throbbing cock. He felt powerful after taking a boy’s virginity. It felt like this was his calling in life. But everything got turned upside down when he learned about the secret priesthood order, and the steps of initiation. He realized something. He loves being controlled. During his inspection, President Nelson, the intimidating muscle daddy bent Ence over a table and slammed him remorselessly with his thick horse cock and Ence had no choice but to take it. And today, he was brought to the temple veil where he serviced a mysterious stranger while the dashing President Oaks, goaded him on. He opened his mouth as wide he could and took the veiny pulsing dick so deep, tears poured down his face. As he felt the stranger’s balls press against his chin, President Oaks knelt behind the boy and teased his hole. Ence was so turned on it didn’t take long before he opened and allowed Oak’s thick shaft inside him. Elder Ence slurped on the veiled man’s cock as President Oaks groaned and pulled the boy to him. The stranger grunted and gave a few last thrusts before pulling his cock away from Ence’s hungry lips and spilling his load all over the boys face. Now it’s just Ence and the President and he can feel the President’s renewed lust. “You’ve been a good boy at the veil,” he whispers, “But now my dick is swollen and my nuts ache for release. And I’m going to unload them by pounding this gorgeous of ass yours.” Oaks pulls open the boy’s cheeks and fucks him hard from behind. Ence feels the President’s balls slapping against his ass. He can smell the man’s musky sweat. He can still taste the stranger’s cum on his lips. It makes Ence desperately want to be filled with cum. “I want to see your face as I fuck you,” the President says, pulling out. He flips Ence onto his back and lifts his legs in the air. Ence thrills at how strong Oaks his. The man holds both his whole lower body up as it is nothing but a feather. “Ride me, boy,” The President smiles. “Ride me until I cum.” Ence does as he’s told, eagerly thrusting his hips up and down, feeling every inch of the man’s cock inside of him. The President grits his teeth and throws his head back. He is so close. Ence watches the man and feels a freedom he’d never realized was possible. It is the freedom of service, the freedom of knowing he is nothing but a vessel for this powerful man’s pleasure.\nAs a missionary he didn’t know what to call it, but around the other missionary boys he thought of himself as an alpha male. He wanted to be in charge, and he wanted to seduce each and every beautiful young missionary in the field.\n\nSo when he was paired with Elder Dudley, he just did what came naturally to him.",
  "directors": [],
  "models": [
    {
      "name": "Braxton Ryan",
      "person_id": 62916
    },
    {
      "name": "Michael DelRay",
      "person_id": 61138
    },
    {
      "name": "President Oaks",
      "person_id": 62914
    }
  ],
  "release_date": "2020-09-03",
  "scene_id": 101167,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Bareback",
    "Blowjob",
    "Discipline",
    "Facial",
    "Fetish",
    "Gay",
    "Hairy",
    "master",
    "Muscle",
    "Rimming",
    "Role Play",
    "Slapping"
  ],
  "title": "Elder Ence: The Endowment RAW"
}