{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "High-powered real estate saleswoman Veruca James is showing Jason Brown potential locations for his new strip club. They finally find the perfect place- brand new everything, adult zoning and a large, secure parking lot. They hear back to her office to seal the deal. Jason wants a break on the commission, and Veruca seems willing to work with him on it, after all, there are other ways to pay besides money. Jason comments on what a great assistant Veruca has, and she chuckles, he’s not my assistant, he’s my husband. It seems the Veruca’s husband, Jimmy Broadway, will do anything to make her happy, and to prove it he tells hime to worship her feet right there in the office. He drops to his knees and starts kissing her shoe. Jason is a little startled when she tells Jimmy to get his cock ready for her, but with the prospect of fucking the lovely Veruca, he doesn’t protest too much when Jimmy takes his monstrous dick into his mouth. Jason kisses Veruca and sucks on her firm, creamy tits. Now Veruca reveals another secret. Not only does Jimmy have a tiny little wiener, but she keeps it locked up in chastity to make it even easier for her to get all the big, cock she wants. Now its Veruca’s turn to suck Jason’s dick, and she does so with vigor, tugging on the chain around Jimmy’s pathetic penis as does. Jimmy crawls beneath her, and begins to lick her luscious pussy as she takes Jason’s cock deep down her throat.  Now that everyone is good and warmed up, Veruca is ready to get fucked hard, and Jason is happy to comply! (Part 1 of 2)",
  "directors": [],
  "models": [
    {
      "name": "Jason Brown",
      "person_id": 53616
    },
    {
      "name": "Jimmy Broadway",
      "person_id": 19688
    },
    {
      "name": "Veruca James",
      "person_id": 43570
    }
  ],
  "release_date": "2020-08-20",
  "scene_id": 101122,
  "tags": [
    "big dick",
    "Bisexual",
    "Blowjob",
    "Brunette",
    "Chastity Play",
    "Confined Cock",
    "Cuckolding",
    "Deepthroat",
    "Domination",
    "Facesitting",
    "Facefucking",
    "Feet",
    "High Heels",
    "Humiliation",
    "Interracial",
    "Nylons Stockings",
    "Rimming",
    "Small Tits",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "Real Estate Cuckold (Part 1)"
}