{
  "collections": [
    "House of Taboo"
  ],
  "description": "Busty porn star Damaris from Spain gets humiliated, spanked, and fisted in today’s House of Taboo premium BDSM porn by DDF Network! Check out that busty babe’s impressive anal cramming talents and watch her being choked by David Perry and Mugur!The two masters of hardcore spanking make that big-titted milf suck their naked toes and pinch her hard nipples after making her 42C / 95D jugs shake all over the place. Today’s fetish porn threesome is packed with hardcore anal sex and you get to see David Perry’s massive dick entirely disappear inside that blue-eyed bombshell’s tight asshole. The Romanian stud Mugur crams her deep throat with his dong and shovels his dick down her face while David Perry keeps licking her gaping asshole!Time to lube up her fingers to make them slide deep up her anus! That horny submissive milf fists her own butthole and crams her ass with her entire hand before Mugur unplugs her wrist and stuffs it down her throat. After quick ass dildo ride, the two lads bang her both holes and double penetrate that horny slut on the couch. Two loads of cum in her mouth finalize today’s BDSM adventure.",
  "directors": [],
  "models": [
    {
      "name": "Damaris",
      "person_id": 56227
    },
    {
      "name": "David Perry",
      "person_id": 33542
    },
    {
      "name": "Mugur",
      "person_id": 33526
    }
  ],
  "release_date": "2020-08-31",
  "scene_id": 101154,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "BDSM",
    "big dick",
    "Collar",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "Facefucking",
    "Facial",
    "Fetish",
    "Fisting",
    "foot fetish",
    "Foot Worship",
    "Footing",
    "Gaping",
    "Hair Pulling",
    "Hand Gagging",
    "High Heels",
    "Humiliation",
    "Leather Cuffs",
    "MILF",
    "Nylons Stockings",
    "Rough Sex",
    "shaved",
    "Spanking",
    "Spit Roast",
    "Stud",
    "Threesome",
    "Vaginal Penetration"
  ],
  "title": "Fisted, Spanked & Penetrated"
}