{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Skylar Snow wants to fuck. Good thing her obedient sub Stu Pendus’ only reason for living is to be her human dildo. He will be hard when she wants, fuck her in every position she is in the mood for and cum on command. Skylar reiterates that his job is to please her while her only job is to torment him as she squats above him in sexy black lingerie and knee high boots. She has him fuck her soft pink pussy. Her big natural tits bounce as she increases the intensity and speed of the sex, bringing poor Stu so close to cumming he must pull out.\n\nShe spreads her shaved pussy lips so he can look deep inside her. She instructs him to fuck her from behind. She wags her round ass at him, reaching back to spread her ass so he can see both of her glistening holes. All the while taunting him with her description of his throbbing cock and full, heavy balls. She loves toying with him. That’s half the fun, watching the agony on his face as he does everything he can to keep it together. He better not cum before she allows. He will be replaced in no time. There’s a long line of desperate needy men that would sell their soul to be Skylar Snow’s sex toy. Lucky for him, Stu’s a good boy today. He fucks her hard, while she cums on his hard cock. When she’s had her fill she finally lets him cum all over her sweet pussy then instructs him to use his dick to shove the sticky white mess deep inside her.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Skylar Snow",
      "person_id": 60403
    },
    {
      "name": "Stu Pendus",
      "person_id": 63110
    }
  ],
  "release_date": "2020-11-06",
  "scene_id": 101110,
  "tags": [
    "Big Natural Tits",
    "Blowjob",
    "Creampie",
    "Dildo",
    "Edging",
    "Femdom",
    "Lingerie",
    "shaved",
    "Sub",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Skylar Snow Torments Her Pathetic Plaything, Part Two"
}