{
  "collections": [
    "Submissived"
  ],
  "description": "Nina Nirvana is a hot white chick who just can’t keep her mouth shut at work. She snitches on a huge male co-worker and gets him fired. She had no idea he would get even with her. Nina comes home from work and immediately starts stripping naked for a shower. Our assailant is parked in a car watching and sees this as an opportune time to break into her home. He busts into the bathroom where Nina is standing there in just her tiny panties. She is shocked and scared that the dude she just got shit canned is standing there and ready to overpower her. He picks her up and drags her to her bed. He throws her mostly naked body down as she shouts at him. He demands that she call or text their boss to tell him that she made up the story that got him fired. She denies knowing what he is talking about and suggests that he got himself fired. This does not sit well with this dude. He starts slapping her and being very rough with her petite body. He spends time slapping her pussy and tits and eventually makes her suck his cock. He makes her suck his cock and throat pokes her. All the while, he is saying demeaning things to Nina who has gone from stuck up office girl to flailing nude slut. He starts hate fucking in a very rough way. She gets put on her back and choked while he fucks the shit out of her pussy. She gets slapped, ridden, and humiliated in an epic hatefucking. When he is done getting his hatefuck revenge, he finally hits her with last degrading cum blast all over her sorry little face.",
  "directors": [],
  "models": [
    {
      "name": "Karlo Karrera",
      "person_id": 35221
    },
    {
      "name": "Nina Nirvana",
      "person_id": 63137
    }
  ],
  "release_date": "2020-09-16",
  "scene_id": 101191,
  "tags": [
    "big dick",
    "Brunette",
    "Deepthroat",
    "Facefucking",
    "Facial",
    "Fetish",
    "Fingering",
    "Hair Pulling",
    "Petite",
    "PIV",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Small Tits",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Hatefucking A Snitch"
}