{
  "collections": [
    "SW Nude"
  ],
  "description": "Jaro Vykvet and Roman Hendrik are paired in a submission wrestling match. They start by warming up with some stretching exercises and running. Then they get right into the wresting and are quickly rolling around on the floor. Jaro is the first to submit giving Roman a point. Then each guy removes his underwear as they begin round two. Cocks flail as the continue the wrestling with Roman able to gain another point fairly quickly. He is soon on his back and looking vunerable to Jaro as they restart, but he still manages to force the submission to take a 3 point lead. Roman is not about to give up though and strains his muscles to the limit in round round and is rewarded with his first point. His ass is on show nicely as he kneels over the recumbent Roman in round five. But Roman is able to escape and they grapple all over the mats until Roman manages a headlock with his legs to earn another point. A pattern is developing with Jaro on top, ass cheeks parting to show his hole, and Roman on the mats, legs trying to wrap around his opponent. He is very quick and as Jaro moves away he trips him and quickly gains another neck hold to win the round. They strain their muscles in round 7 as each tries to get a decent hold and it is Roman who prevails and wins the point. But Roman is still determined to maintain hie lead and works hard to get the next two points. Leading 8-3 stands as they take a break, with Jaro rubbing oil all over him. Then they switch with Roman oiling Jaro. Then the resume the match, and gripping each other is more difficult with their slippery bodies. Jaro is victorious in round 13 but is quickly in another head hold when they restart, giving Roman the point. He continues his winning ways to take the overall victory. Then after Jaro has acknowledged Jaro’s win, graciously, they settle down for a wank-off. As they wank they reach over and tug on each other’s cocks for a while. Then they rever to wanking themselves and it is Jaro who is first to shoot his creamy load, letting it squirt everywhere. Then Roman’s big cock lets go its’ big load too, shooting it all over the mats. Then clean each other’s sticky dicks with wet wipes before going off to the shower to wash off all the sweat and oil.",
  "directors": [],
  "models": [
    {
      "name": "Jaro Vykvet",
      "person_id": 63009
    },
    {
      "name": "Roman Hendrik",
      "person_id": 63010
    }
  ],
  "release_date": "2020-09-24",
  "scene_id": 101282,
  "tags": [
    "Athletic",
    "BDSM",
    "CBT",
    "Domination",
    "Facesitting",
    "Gay",
    "Jockstrap",
    "Pain",
    "Role Play",
    "Submission",
    "switch",
    "top",
    "Wrestling"
  ],
  "title": "Roman vs Jaro - WRESTLING"
}