{
  "collections": [
    "Ashley Fires SciFi Dreamgirls"
  ],
  "description": "Missy stomps into the living room only to find her ‘Mommy” in a very compromising position. Her panel was open for all to see with bright lights coming out of her fingers and her mouth was filled with flashing strobes! Missy was in shock. She called to her Mommy but she did not answer nor did she even acknowledge Missy was there. She just stared off to space while her lighted hands worked on her stomach! Missy finally yells at her! Mommy blinks, turns her head and smiles “Yes Dear?” She can not believe her eyes! She asks her Mom what the hell was going on? Her Mom tells her that she is a Robot and was created to serve her Master, her Daddy. Missy does not understand so her Mom sits her down and shows her the open C-Panel and how it works. Missy starts to grasp the situation. But is still skeptical. She sees her Mom has a wire sticking out and decides to pull on it. MommyBot starts to shake and convulse. Missy quickly reconnects the wire. Her Mom closes her C-Panel before Missy does anything else and says not touch Mommy’s circuits. Missy finally realizes what her Mother is. But Mom says there is more she has to tells her. That she was a Robot too! She was not Missy but MissyBot. Missy laughs and tells Mom that was impossible. That she had flesh and memories of her whole life. Mom explains that those are programs and her skin was a latex. Missy starts to freak out so Mom has to give her a time out by freezing her. She does this a few times and manually programs MissyBot to become self aware. MissyBot is turned back on, panel opened, and is ready for programming. Mom tells her that she is going to override her maturity program. She will age her and give her breasts and a vagina. She increases her boob size a little too much and dials back to a proper size. Then she gives her a nice pink pussy. Now that she has all of her new mature female parts it was time for sexual programming. She would have to learn to please Daddy like Mommy Does!",
  "directors": [],
  "models": [
    {
      "name": "Ashley Fires",
      "person_id": 20856
    },
    {
      "name": "Mistress Missy",
      "person_id": 61800
    }
  ],
  "release_date": "2020-09-22",
  "scene_id": 101274,
  "tags": [
    "Blonde",
    "Family Roleplay",
    "Fetish",
    "Latex",
    "Lesbian",
    "master",
    "masturbation",
    "Older/Younger",
    "Small Tits",
    "Vibrator"
  ],
  "title": "Ashley Fires SciFi Dreamgirls Episode: “My Mommy is a Robot”"
}