{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Massive muscle man Brad Kalvo ties up inked sex pig Jessie Colter to a St. Andrew’s cross before breaking out a flog that he throws against Jessie’s back. Jessie closes his eyes and - initially - quietly endures the first few strokes of Brad’s beating, his back slowly reddening under the blows. Brad pulls off Jessie’s neoprene shorts to reveal Jessie’s rock hard tool, rubbing up against the wooden cross. Brad, his own proud cock standing at attention, slowly works Jessie with the flog, pounding him with heavier strokes that bring out the grunts in Jessie. Brad, in a leather harness and jock, uses his powerful shoulders and arms to beat Jessies’ back and now ass until his skin is red-hot. Brad lays down on his back beneath Jessie, points Jessie’s still-hard cock down, and lets himself get sprayed in Jessie’s piss. He swallows and spits out the river of piss, then returns to beating Jessie’s butt. Brad works up a sweat, changing up his strokes and punishing Jessie’s perfect fuzzy ass, getting the captive, horned-up bottom to grunt and cry out from the heavy blows. Brad finally unties Jessie, bends him over a padded bench, then kneels down and tongues Jessie’s red, abused ass and hole. Brad strokes his hungry tool as he pushes his tongue inside Jessie’s hairy hole till both studs are dripping for more. Brad stands and works his hard meat into Jessie’s eager upturned ass, pushing down on the sexy bottom’s back to penetrate deeper and feel every tight inch clamped down on his cock. He flips Jessie on his back and plunges back into his steamy hole, working him with slow, deep strokes and jacking Jessie’s achingly hard cock. Jessie sprays his load over his own chest before Brad marks Jessie’s chest with his own thick load.",
  "directors": [],
  "models": [
    {
      "name": "Brad Kalvo",
      "person_id": 39188
    },
    {
      "name": "Jessie Colter",
      "person_id": 34311
    }
  ],
  "release_date": "2020-09-11",
  "scene_id": 101210,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Boot",
    "Gay",
    "Leather",
    "Muscle",
    "Pain",
    "Piss Play",
    "harness",
    "Rimming",
    "Single Tail",
    "Whipping"
  ],
  "title": "LOUD AND NASTY: Brad Kalvo and Jessie Colter"
}