{
  "collections": [
    "CFNMEU"
  ],
  "description": "Miro Danek arrives home with his girlfried. Both claim to be very tired as he collapse onto the bed. Miro then complains of a bad back, saying he needs a massage. The girl is happy to oblige, so his takes off his tee shirt and lays, face down. She straddles his ass and begins massaging his back. Then she moves to the side and, with his jeans lowered, massages Miro’s sexy ass. He turns over, onto his back, and reveals his throbbing cock. The girl takes hold of the dick and strokes it, and then slaps it. Miro removes his jeans completely and the girl returns to wanking and slapping his big cock. Her fingers crawl all over his sexy chest too. Miro wants to play and the girl has a surprise in store for him, it seems. Out of her suitcase she takes a large metal hook that she rubs all over him, cupping his balls with it. She has more tools too and takes some clothes pins and attaches them to Miro’s balls and nipples. She slaps the balls with the pins on, making Miro writhe and jerk. She sees that Miro is enjoying it so she goes further, as he holds his legs in the air. She spanks his sexy ass and rubs the hot hole. Then she slides the hook into his tight hole as she also gives the ass a spank or too. Removing the hook she slides a vibrator into Miro’s hot hole. He moans as she fucks his ass with the toy. With the hole loosened she then uses a thicker toy, stretching the ass wide and fucking it deep. Miro is then turned onto his knees and gets more of that vibrator in his hole. It goes in easily and pulls out to go back in again. Then Miro rides the toy, as the girl holds it upright so his ass can slide up and down on it. With his ass well fucked Miro then lays on the bed for the girl to wank him to a lovely big cum shot, the creamy jizz shooting out from his dick.",
  "directors": [],
  "models": [
    {
      "name": "Iryna",
      "person_id": 63018
    },
    {
      "name": "Miro Dalek",
      "person_id": 63019
    }
  ],
  "release_date": "2020-09-17",
  "scene_id": 101249,
  "tags": [
    "Anal",
    "Ass Hook",
    "big dick",
    "Blowjob",
    "CBT",
    "CFNM",
    "Clothespins",
    "Dildo",
    "Femdom",
    "Fetish",
    "Handjob",
    "Male Sub"
  ],
  "title": "Miro Dalek - CFNM"
}