{
  "collections": [
    "Kinky Bites"
  ],
  "description": "Maid Rebecca Vanguard is hurrying to finish cleaning Wrex Oliver’s bathroom when Wrex approaches. Wrex asks if the toilet is clean and then pushes Rebecca to her knees to inspect the toilet. Rebecca’s insistence it’s clean isn’t enough for cruel Wrex who gets his jollies by dunking poor Rebecca’s head in the toilet. Her long brunette hair now dripping wet, Rebecca again assures him it is. This only antagonizes Wrex. He demands she lick the toilet bowl to get it completely clean.\n\nWithout a chance to clean herself, Rebecca is thrown over Wrex’s knees and gets spanked on her bare bottom. Her clothes are torn and removed. Her ass glows pink from Wrex’s firm hand. Rebecca’s cries of pain only increase Wrex’s desire and he whacks her ass with a paddle.\n\nWrex binds his poor maid’s wrists to her ankles, leaving Rebecca vulnerable and exposed. He pushes a little pink vibrator against his maid’s clit and this drives Rebecca crazy. Wrex strips and stands over his helpless maid, his cock inches from her face. Rebecca knows to open her mouth to please her employer. Wrex fucks her mouth and then he fucks her pussy. He flips Rebecca over, ass up, head down. Wrex fucks her deep and slaps her ass. Rebecca moans with joy. She’s enjoying this too much.\n\nWrex lights a candle and watches the hot wax drip down on her ass. He demands Rebecca not move but she squirms, unable to keep still as the hot wax meets her sensitive flesh. Wrex slides his fat cock back into Rebecca’s dripping wet cunt. The he puts her on her knees and slides his cock into her mouth. Rebecca is helpless as Wrex presses her mouth against his groin. She repeatedly takes his cock deep into her throat with ease. This isn’t her first time enduring this kind of humiliation. Wrex rewards Rebecca with the little pink vibrator, pressing it up against her clit and bringing her to orgasm. He fucks her again and cums all over his poor little maid before telling her to finish cleaning.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Rebecca Vanguard",
      "person_id": 60911
    },
    {
      "name": "Wrex Oliver",
      "person_id": 62926
    }
  ],
  "release_date": "2020-11-18",
  "scene_id": 101272,
  "tags": [
    "BDSM",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Deepthroat",
    "Dunking",
    "Fishnets",
    "Flogging",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "natural boobs",
    "Oral Sex",
    "OTK",
    "Paddle",
    "Pain",
    "Role Play",
    "Vaginal Penetration",
    "Vibrator",
    "Water Tank"
  ],
  "title": "The Maid: Rebecca Vanguard Fucked and Humiliated"
}