{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Here sits Cherry Torn in a bright red latex dress with her freshly painted toes ready to tell you just how pathetic you are. You sit at her feet while she tells you just how much pussy is better than dick and how you, her little cuck, are so desperate to be near her that you’d watch her have hot lesbian sex over and over again just to be in her presence. Arrives Sophie Monroe, Cherry’s sexy accomplice. She’s got a black latex jacket open revealing her giant cleavage. Together they laugh at what a sorry little man you are while Cherry begins to pet her pussy. You know you’re lucky just to be in the room and that nothing belongs to you but your ability to beg to these two mistresses. You see they own you, they own your pathetic little dick, and they know you’d love just one sniff or lick of Cherry’s wet, throbbing pussy. With Sophie’s strict discipline you must sit and watch as these two dommes enjoy themselves. To serve, please, and worship your goddess while Cherry pulls at her own big tits and perky nipples. You’re the luckiest little fucking slut that you’re even able to beg to sniff Cherry’s pussy. You are instructed to show gratitude as you hope that you get to jerk that tiny, freshly out of chastity cock just a little bit. Sophie fingers Cherry’s dripping wet pussy so you can see exactly what you’re missing. And then to exemplify just how useless you are Sophie gets her giant fucking dick on a stick to drive it deep into Cherry’s hungry cunt. Now while Cherry gets fucked you have to beg to get hard. But don’t touch it. No you just watch as she gets pounded over and over again until her legs shake. You could never do that now could you?",
  "directors": [],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Sophie Monroe",
      "person_id": 20940
    }
  ],
  "release_date": "2020-09-24",
  "scene_id": 101201,
  "tags": [
    "Big Ass",
    "Big Tits",
    "Cuckolding",
    "Discipline",
    "Feet",
    "JOI",
    "Kinky",
    "Latex",
    "Lesbian",
    "masturbation",
    "POV",
    "shaved",
    "Vibrator"
  ],
  "title": "Kinky JOI: Lesbian Cuckolding"
}