{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Poor Dillon Diaz has been locked in chastity for so long he can’t remember what life was like before Helena Locke put him in his cage. He is so desperate to have an orgasm he has contacted his Domme to offer up anything she asks of him to come just once. Domina Helena is a busy woman and has no time for horny little subs following her around, begging for sexual gratification. Lucky for Dillon she is willing to negotiate. If he will slap himself until he is beet red, flog his back HARD, deepthroat a dildo, and beat his cock with a wire hanger she will consider allowing him one orgasm.\n\nHelena is an absolute bombshell in red latex. She teases him with peeks of her glorious ass and pink pussy but then snatches it away as soon as his distraction affects his self flagellation. His desire cannot get in the way of the task at hand, entertaining Helena. The harder he hits himself the harder she laughs, taking delight in his whimpers and moans. This sub is so eager to please that he starts their session with a vibrating buttplug already switched on and in his butt. He thought Helena would be happy that he took initiative but he was sorely mistaken. Helena did not give him permission to think for himself. She has him fuck his own ass by riding a dildo with nipple clamps on. She tells him to put his hard cock on the chain attached to both clips. There will be no pleasure without pain today. He should know by now the very basic rules set for him. He is not to have free will or creative thought, If he is allowed to come he must eat it, and he goes back in his cage when she is done with him.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    },
    {
      "name": "Helena Locke",
      "person_id": 59793
    }
  ],
  "release_date": "2020-09-25",
  "scene_id": 101235,
  "tags": [
    "Athletic",
    "Black",
    "Blonde",
    "buttplug",
    "Cage",
    "Chastity Play",
    "Deepthroat",
    "Dildo",
    "Femdom",
    "Humiliation",
    "JOI",
    "Latex",
    "Nipple Clamps",
    "Pain",
    "Sub"
  ],
  "title": "Keep Your Distance: Helena Locke and Dillon Diaz"
}