{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Cassidy Lynn convinces her friend Natasha Nice to visit a seedy adult book store in the Tenderloin. What could possibly go wrong?\nAs the girls buy their way down into the catacombs of filth, the cell phone cameras turn on and the guys start filming. It's not everyday that girls come to these places after all. As soon as they hit the glory holes, guys are watching, following. Cassidy goes into a booth and when her friend tries to join her she makes her get her own booth. Humiliated Natasha runs as fast as she can into another booth.\nThe guys circle like sharks, the sound of sex from the movies fills the air as the girls are watching porn in their own rooms. The smells, the sounds all start working on the girls. As cocks start appearing in the holes the girls have little resistance left not to indulge their curiosity and play. After all, no one will know, no one will see.\nWhat the girls don't realize is the doors do not have locks, and soon the girls are in over their heads with cock. The guys are relentless and do not stop until each girl is totally fucked, helpless and moaning like whores, taking cock after cock.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Cassidy Lynn",
      "person_id": 26263
    },
    {
      "name": "Natasha Nice",
      "person_id": 26297
    }
  ],
  "release_date": "2010-09-03",
  "scene_id": 10132,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Chains",
    "Choking",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Double Penetration",
    "Facefucking",
    "Female Slave",
    "Gangbang",
    "glory hole",
    "Humiliation",
    "Interracial",
    "Leather",
    "Nipple Torment",
    "Orgy",
    "Public",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Straight",
    "Sub",
    "Submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "What would happen if 2 hot girls wandered into a sex store"
}