{
  "collections": [
    "Kinky Bites"
  ],
  "description": "Little Spittle is abducted from earth and transported onto the glowy blue deck of a spaceship. After their clothes are transformed into a skimpy latex bikini and boots they yell out a plea to go home. A disembodied voice tells them if they do everything that the alien beings tell them to do they will be let go.\n\nThe self administered inspection starts with Little Spittle sitting down on a sybian. They are instructed to use the controller to turn it to a speed of their liking. Little Spittle removes their slick black latex and rubs their pussy and ass on the intense vibrations. Sweat covers their face and drool drips from their mouth as they orgasm and convulse.\n\nThe second portion of the testing features an anal probe, also self administered. Spittle shoves a huge dildo at the end of a fucking machine up their ass and sets it to thrust deep inside their hungry ass. They turn up the speed and hold a vibrator on their clit, giving the aliens the orgasms they demand for their experiments.\n\nNext is the pain test. The beings are specifically interested in how pain intersects with arousal in the human. There are nipple clamps, a leather flogger, an electric zapper, and a violet wand. Spittle is instructed to use them on themselves going from left to right. The pain takes Little Spittle over the edge. They beat, shock and pinch themselves with rough abandon until they are so turned on they cant help but to come as they pull on their nipple clamps and shock their inner thighs.\n\nTrembling from having so many orgasms Little Spittle uses a second fucking machine to fuck their pussy hard and fast until they squirt all over the platform and collapse in the puddle, exhausted.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Little Spittle",
      "person_id": 62011
    }
  ],
  "release_date": "2020-11-02",
  "scene_id": 101310,
  "tags": [
    "Anal",
    "Boot",
    "Clover Clamps",
    "Dildo",
    "drool",
    "gloves",
    "Latex",
    "Machine Dildo",
    "masturbation",
    "Nipple Clamps",
    "Pain",
    "Squirting",
    "Sybian",
    "Tattoo",
    "Vibrator",
    "Violet Wand",
    "Zapper"
  ],
  "title": "Little Spittle: They Are Not Here To Help Us"
}