{
  "collections": [
    "Submissived"
  ],
  "description": "Liza Rowe is a rich and very spoiled princess. She is too good for everyone and prissy as all Hell. She is one of those hot girls that is so stuck up that you wish you could see her get fucked like cheap trash just because of how obnoxious she is. She is in the car with the bodyguard her dad has keeping an eye on her every move. She is on the phone bitching to her friend that she can’t go to a concert because of this brainwashed bodyguard who won’t let her out of his sight. He drives her home while ignoring her pleas of wanting to go to the concert. He makes her enter her home while he guards the door. She asks him to come in and so he does. She asks him for a ride to the concert and says he has to do what she wants in a very bitchy tone. You can tell the bodyguard just wants to tell her to shut up. He also wouldn’t mind fucking her and smacking her spoiled ass around. She asks if there is anything she can do to get him to take her to the concert. He tells her to get on her knees and suck his dick. He immediately pulls up her shirt and exposes her tits. He starts slapping them and slamming her head on his dick. He clearly hates her and is going to be very rough with her. She is already getting choked and slapped. Now he make her get up. He pulls off her pants and slaps her naked body all over the place. She is not enjoying this, but she wants to go to the show. Carlo, however, is loving every minute of getting to demean and humiliate her spoiled ass. He slaps her perfect curvy body and ass. Then he hatefucks her pussy hard. He talks shit to her for all the crap she put him through. She is bent and mistreated while being fucked in every position. He finally blows a load all over her rich girl face and then informs her he won’t take her to the concert. Carlo finally put her in her place by humiliating her and not doing as she asked.",
  "directors": [],
  "models": [
    {
      "name": "Karlo Karrera",
      "person_id": 35221
    },
    {
      "name": "Liza Rowe",
      "person_id": 57666
    }
  ],
  "release_date": "2020-10-07",
  "scene_id": 101394,
  "tags": [
    "big dick",
    "Blowjob",
    "Choking",
    "Curvy",
    "Deepthroat",
    "Facefucking",
    "Facial",
    "Hair Pulling",
    "Latinx",
    "PIV",
    "Rough Sex",
    "Slapping",
    "Uncircumcised",
    "Vaginal Penetration"
  ],
  "title": "Driving Miss Rowe"
}