{
  "collections": [
    "Pascals Sub Sluts"
  ],
  "description": "Here’s another newbie. Sexy one too. Eva Johnson, Romanian, great body, never had rough sex before, really wanted to try. Nervous as hell at the beginning of the day but bit by bit we warmed her up. We were doing a content-swap – shooting a scene for her, then a PSS shoot for us. We did hers first and she started trusting me a bit. Boy was she wanting it. Full of fire.\n\nThen – this is the kind of luck we’re having at the moment – all the lights in the house conk out. Sun’s going down outside, fuse box is fucked. We phone the owner and she says there’s no way to fix it. Says she sits in with the telly and the cat and a bunch of candles every night. Eh?!! So we get a cab, go back to Andy’s, and yeah by the time he’s switching the camcorder on to get going finally the lights gone out of her eyes just a little bit. But she’s still revved, still eager, never had it before and wants it right now.\n\nAnd she’s a great sport with it. Lets me give a good thwacking, redden her arse up. Really gets off being called names. And she’s a great squirter, which she didn’t realize before. We shot lots of that. Just one of those really sexual girls, the ones who are such a pleasure because it’s all comes so natural to them, so instinctively, and when you’ve playing with one who still doesn’t know herself completely – who’s thinking that she might like something but doesn’t know yet and wants to experiment – it’s just so hot.\n\nMay need to have her back, finish the job off. I think there’s still a fair amount of gas in that tank.",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Eva Johnson",
      "person_id": 63126
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2020-10-08",
  "scene_id": 101402,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Choking",
    "Creampie",
    "Lingerie",
    "Nylons Stockings",
    "Petite",
    "Rough Sex",
    "Small Tits",
    "Swallow",
    "Vibrator"
  ],
  "title": "Anal Hussy Eva Johnson Craves More Dick"
}