{
  "collections": [
    "House of Taboo"
  ],
  "description": "Today’s House of Taboo XXX fetish porn by DDF Network is packed with all the goodies you don’t want to miss out on. Watch our deviant doctor Mugur spank schoolgirl Monika Wild in his doctor’s office, or should we call it the chamber of pain? He gags her with a gagball and chokes that young redhead who wears a sexy schoolgirl uniform. The Doc lifts her mini-skirt and starts spanking that peach-like curvy ass while rubbing his hard big dick all over her tight butt cheeks. Gagging and spanking lead to fisting and fucking! See Monika Wild cram her tight young asshole with her entire hand. Unbelievably hot and horny, this young schoolgirl submissively follows the Doc’s orders and gets her gaping asshole licked before he fists her as well. Time to plow that anus with his hard cock on the examination table. The Dominator Mugur introduces an enormous black dildo to the scene and stuffs various sex toys up that submissive redhead’s asshole while she moans ecstatically with her long legs spread wide apart. He fucks her face balls deep and slides his big cock down her deep throat until she chokes and spits. Finally, Doc Mugur pumps his cum all over that young girl’s face and pees directly into her mouth. Happy Golden Shower ending, Y’all!",
  "directors": [],
  "models": [
    {
      "name": "Monika Wild",
      "person_id": 100032
    },
    {
      "name": "Mugur",
      "person_id": 33526
    }
  ],
  "release_date": "2020-11-27",
  "scene_id": 101468,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Big Toy",
    "Bondage",
    "Curvy",
    "Deepthroat",
    "Destruction",
    "Dildo",
    "Doctor",
    "Domination",
    "Facefucking",
    "Fetish",
    "Fisting",
    "Gaping",
    "Humiliation",
    "Kinky",
    "Pain",
    "Redhead",
    "Rough Sex",
    "Shackle",
    "Spanking",
    "uniform"
  ],
  "title": "Gagging > Spanking > Fisting > Fucking"
}