{
  "collections": [
    "Str8Hell"
  ],
  "description": "Karel Opec is in custody, controlled by Petr Jarena. These two str8 guys look so good. As Petr questions Karel about why he is being held Karel denies any wrong doing. Petr says that he must call the police and Karel’s parents, and needs to look inside his bag. In the end Karel hands over his bag for Petr to check. Petr admits to stealing a tee shirt and Petr decides that he must do a more personal check to see if there is anything else hidden. Petr has to take off his clothes, so he strips down to his underwear. He declines to remove the underwear but the threat of calling the police makes him rethink. The underwear comes off and Petr stands naked. He puts his hands behind his head, revealing his soft cock, balls and nice thick bush. Petr makes an offer, if Karel will do something for him he wont call anyone. He takes Karel’s hand and places it on his groin. Karel complains but not much. Petr pulls his cock out and makes Karel wank it for him. He reaches over and rubs Karel’s big, soft, cock too. Petr’s cock is rock hard as Karel wanks it and soon he is sucking it too. His mouth wraps around the cock as he sucks well. Petr pushes Karel’s head down onto his cock making sure he gets it all. Petr removes his shirts, showing off his hot chest as Karel keeps sucking. Then he pushes the pants down too and starts to fuck his cock into the hot mouth. Then Petr moves Karel, bending him over to check his ass. He slides his throbbing cock into the tight hole and starts to fuck it as Karel moans. Petr fucks deep into the tight ass as Petr keeps moaning. Petr fucks that ass hard and spanks it too, pulling Karel’s hair too. He pulls Karel onto his rock hard cock, fucking hard and fast. Then Petr moves Karel, laying him on his back and fucks him some more. Karel wanks his own cock as he takes Petr’s dick deep in his hole. He wanks hard, keeping up with Petr’s fucking. Then Karel releases his cum with Petr’s dick deep in his ass. Petr continues to fuck until he is ready to cum too. Then he pulls out and shoots his cum onto Karel’s cock and balls. Then he sends Karel on his way.",
  "directors": [],
  "models": [
    {
      "name": "Karel Opec",
      "person_id": 63015
    },
    {
      "name": "Petr Jarena",
      "person_id": 63016
    }
  ],
  "release_date": "2020-10-08",
  "scene_id": 101403,
  "tags": [
    "Anal",
    "Bareback",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Bush",
    "buttplug",
    "Chains",
    "Domination",
    "Gay",
    "Humiliation",
    "Pain",
    "Rimming",
    "Rough Sex",
    "Submission",
    "uniform"
  ],
  "title": "Karel & Petr - YOUNG OFFENDERS RAW"
}