{
  "collections": [
    "PegHim"
  ],
  "description": "Ella Nova is an award winning anal queen, she loves to stretch, gape, and fill slutty holes of all shapes and sizes. Siouxsie has been bragging about Michael Vegas’s hole to Ella for years, and this adorable sleepover was the perfect time to show her friend just how much this pig daddy hole can take. First the girls model their larger than life strap-ons, teasing Michael until he can’t take it anymore, so Siouxsie gets behind the camera and Michael gets face down, ass up in his white jock strap–ready for his hole to be owned by tiny, athletic Ella, and buxom brunette Siouxsie. Siouxsie eggs Ella on, as she watches her go almost elbow deep into her man’s hungry asshole. Of course Siouxsie can’t help but slide her hands (and giant strap on cock) in there too–she loves to see him be double, triple, and quadruple penetrated whenever possible. The girls then move on to object insertion: Siouxsie has two giant BUTTerNUT squashes that she attempts to fit inside Michael’s ass–watch and see if they achieve the seemingly impossible. As Siouxsie once told GQ Magazine, Michael Vegas has the “strongest butthole in America,” so as far as she is concerned, anything is possible.",
  "directors": [],
  "models": [
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "Michael Vegas",
      "person_id": 47624
    },
    {
      "name": "Siouxsie Q",
      "person_id": 34821
    }
  ],
  "release_date": "2020-10-28",
  "scene_id": 101539,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Athletic",
    "Big Ass",
    "Big Natural Tits",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Bush",
    "Curvy",
    "Destruction",
    "Dildo",
    "Double Anal",
    "Double Penetration",
    "Farts",
    "Feet",
    "Fetish",
    "Fisting",
    "Foot Worship",
    "Gaping",
    "Hair Pulling",
    "Hairy",
    "Handjob",
    "jock",
    "Kinky",
    "Pegging",
    "Prolapse",
    "Prostate Stimulation",
    "Punching",
    "Rimming",
    "Straight",
    "Strap On",
    "Tag Team",
    "Threesome",
    "white"
  ],
  "title": "PEGHIM: Ella Nova, Siouxsie Q, Michael Vegas 1"
}