{
  "collections": [
    "Pascals Sub Sluts"
  ],
  "description": "As Brittany Bardot readily admits, she’s got the kind of face that makes a guy’s dick twitch just by laying eyes on him. This isn’t the face of a slut or a whore – there’s never any guarantee with sluts and whores they’re going to be good in the sack. No, it’s the face of a woman of sin and skill, a woman who loves big hard cocks in all her holes and knows how to play them. And the same goes for her cunt. Brittany’s cunt is downright lascivious. Fresh out of her knickers, it looks like it just got fucked five minutes ago. It’s got whiskey on its breath, it sneers at you and stares you out. It’s beautiful.\n\nBrittany is 35 years old, single with two kids. In the scene, she plays the mother of a girl I got pregnant and abandoned. She bumps into me outside Andy’s flat and starts freaking out. I push her up into the flat. Andy films surreptitiously from the other side of the office door while the bitch turns into a banshee, grabbing at my cock and mocking it, slapping me in the face. I lock her arms tight and start snogging her. She submits. Soon after, I’ve got her on her knees and I’m facefucking her. Hard, nasty facefucking, taunting her by wondering out loud if the mother’s as good as the daughter. I fuck her cunt then I fuck her asshole. I get the dildo and stuff it up her baby-hole while I keep on ramming her shitter. She cums, squirts, she swallows my jizz, she gets told to fuck off. That’s the way it rolls. That’s the kind of woman Brittany Bardot is and she loves every filthy second of it.",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Brittany Bardot",
      "person_id": 63122
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2020-11-19",
  "scene_id": 101588,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Blonde",
    "Dildo",
    "Domination",
    "Facefucking",
    "Hair Pulling",
    "Humiliation",
    "MILF",
    "multiple orgasms",
    "Rimming",
    "Rough Sex",
    "Slapping",
    "Small Tits",
    "Spanking",
    "Squirting",
    "Swallow",
    "Vaginal Penetration"
  ],
  "title": "Slag Fucking My Girlfriend's Mom, Brittany"
}