{
  "collections": [
    "Hot Legs & Feet"
  ],
  "description": "Get ready for lots of kink when busty babes Alexandra Cat and Tigerr Benson team up for a little bondage foot worship, sole whip, and shoe adoration. First, we see both girls in their beautiful corsets–Alexandra’s pink and Tigerr’s red. After binding Tigerr’s wrists with furry handcuffs and tying her ankles down to a table, Jordan whips Tigerr’s nylon-sheathed legs, takes off the Asian beauty’s black shoe, and sniffs it. Then she takes off Tigerr’s corset, feels up her boobs, and stretches the Asian doll back on the table. Tigerr struggles against her bonds as Jordan whips her feet with a black cat-o-nine-tails. Then Alexandra turns Tigerr around, puts her in the doggie mode with her ankles still tied with pink velvet ribbon, and sniffs her feet. Then comes the best part of the action when Tigerr demonstrates her own love for feet as she first worships Alexandra’s lucite platform shoe then kisses and licks her feet through her nude-colored stockings. Tigerr’s tongue is really busy on those soles and her lips work hard to pleasure Alexandra’s spiky shoes as well. Finally, Alexandra’s nylons come off and Tigerr can enjoy the bare feet of her blonde dominatrix. In huge close-ups we see her tongue working its way between Alexandra’s hot pink polished toenails. Then Tigerr sucks on the nylons before licking Alexandra’s ass and pussy. And what’s Miss Benson’s reward? Her asshole gets rubbed by one of her own black shoes which she then sucks and licks clean. So check out the wild twists and turns of this encounter!",
  "directors": [],
  "models": [
    {
      "name": "Alexandra Cat",
      "person_id": 62201
    },
    {
      "name": "Tigerr Benson",
      "person_id": 62275
    }
  ],
  "release_date": "2020-11-26",
  "scene_id": 101595,
  "tags": [
    "Asian",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Corset",
    "Dominatrix",
    "Feet",
    "Fetish",
    "Flogging",
    "Foot Worship",
    "Footing",
    "footjob",
    "High Heels",
    "Kinky",
    "Lesbian",
    "Lingerie",
    "Nylons Stockings",
    "Pussy Eating",
    "shoe licking",
    "shoe worship",
    "Shrimping",
    "Sniffing"
  ],
  "title": "Getting Busy on Her Soles!"
}