{
  "collections": [
    "Str8Hell"
  ],
  "description": "Handsome Gerasim Spartak has a new, and very sexy Young Offender to deal with. That is sexy str8 guy Miro Dalek. Gerasim brings Miro into the office and sits him down. It seems that Miro has been stealing from a cash register. Eager to avoid the police and his parents being informed he follows Gerasim’s instructions, stripping down to his underwear. As he turns around Gerasim spots something in the underwear. Miro takes off the underwear and the stolen money is revealed. Miro is desperate to avoid the police being informed and promises to do anything. Gerasim likes that idea and rubs his nightstick over Miro’s cock and balls. Then he pushes Miros hand into his pants, making him grope. Gerasim soon pulls out his stiff cock and wants Miro to suck it. Miro is reticent but does wank the cock as Gerasim pushes him down towards the dick. Miro takes the stiff cock in his mouth and sucks it a little, protesting. His head is pushed down onto Gerasim’s dick and he sucks it. Gerasim removes his shirt, to be fully naked, and pushes Miro back down onto the throbbing cock. Miro is then made to kneel on the chair, showing off his sexy ass. Gerasim knows what he wants and slides his rock hard pole deep into that tight ass. Mireo moans as he takes the cock deep in his hole. Gerasim fucks that ass hard and fast, spanking too. He grabs Miro’s hair and pulls himself deep into the ass. His hand spanks the ass, leaving a red imprint. Then he moves Miro, laying him on the table and fucks his dick deep into the ass again. Miro’s face is grimacing as he takes the cock all the way in his hole. Gerasim then unloads his hot cum into Miro’s hole and withdraws to let the cream load seep out. Then Gerasim relents and lets Miro sit on the chair and wank himself. He rubs the nightstick over Miro’s balls as the cock gets rock hard and soon delivers the cum.",
  "directors": [],
  "models": [
    {
      "name": "Gerasim Spartak",
      "person_id": 100106
    },
    {
      "name": "Miro Dalek",
      "person_id": 63019
    }
  ],
  "release_date": "2020-12-03",
  "scene_id": 101658,
  "tags": [
    "Anal",
    "Anal Creampie",
    "Bareback",
    "BDSM",
    "Blowjob",
    "Bondage",
    "buttplug",
    "Chains",
    "Domination",
    "Gay",
    "Humiliation",
    "Pain",
    "Rimming",
    "Rough Sex",
    "Spanking",
    "Submission",
    "Tattoo",
    "uniform"
  ],
  "title": "YOUNG OFFENDERS:Gerasim Spartak & Miro Dalek - RAW"
}