{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Mistress Charlie Kicks lounges in their dungeon caressing a pair of old nylons. They rub the pantyhose all over their body, including on their pussy, and armpits so the stockings can absorb as much scent as possible. Aptly situated below the cage Mistress Charlie is perched upon, is their property, Carlos Deth, displaying his best behavior. Charlie dangles the pantyhose to torment the desirous Carlos as he begs for just a whiff.\n\nAfter enough groveling, Charlie releases Carlos from his cage and places the nylons over his head, ripping a hole with their teeth to get access to Carlos’s mouth. Some worship is in order, so Charlie instructs Carlos to lick and kiss their boots. He also is allowed to worship Charlie’s long legs and those wonderfully aromatic unshaved armpits. What a good boy! His foot, leg, and armpit worship was adequate enough to graduate to worshiping Charlie’s latex clad ass. He breathes in Charlie’s ass and is suffocated by their fleshy cheeks.\n\nHe’s so utterly aroused he starts to touch himself without permission. Mistress Charlie notices and there is no way that discretion will go unpunished! Charlie pinches Carlos’s nipples hard enough for him to scream and slaps him with stingy latex opera gloved hands to inflict more pain on him, followed by a good old fashioned paddling. Mistress Charlie grabs him by the balls, spins him around, and applies an acrylic ball smasher to his genitals, all while smiling in sadistic pleasure as he begs for mercy. Charlie only yields to his pleads in exchange for his freedom. He will be in chastity until their next session!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Carlos Deth",
      "person_id": 59928
    },
    {
      "name": "Charlie Kicks",
      "person_id": 63238
    }
  ],
  "release_date": "2021-01-01",
  "scene_id": 101638,
  "tags": [
    "Blonde",
    "Cage",
    "CBT",
    "Chastity Play",
    "Clothespins",
    "Collar",
    "dungeon",
    "Femdom",
    "gloves",
    "Latex",
    "Nipple Torment",
    "Paddle",
    "Pain",
    "Rimming",
    "Sadism",
    "shoe licking",
    "Slapping",
    "Tattoo",
    "unshaved"
  ],
  "title": "Property of Mistress Charlie Kicks, Part 1"
}