{
  "collections": [
    "Kinky Bites Men"
  ],
  "description": "Sexually deprived Ricky Larkin sneaks into a dilapidated old factory for some much needed release. The spray paint of his surrounds reads “Fuck Covid”… exactly!\n\nIsolated Ricky drops his dirty ripped jeans to reveal his blood-engorged, horny cock already restrained in rubber cockring tied around his hard dick and balls. After some light CBT with a leather slapper, Ricky undoes the rubber cockring to challenge his nuts to something more intense. He pulls thin rope from his pocket and begins to tie around his balls engorging them with blood, then up around his ever-growing cock. After the rope is tight around his big dick and nut sack, he pinches his nuts with wooden clothespins and spanks his dick and pinned balls with the small leather paddle.\n\nRicky bends over letting the texture of the rope rub on his wincing asshole as his restrained big dick slaps the side of his muscular thigh. As he stands back up, he feels the load growing in his balls inspiring him to tie his throbbing junk to an overhead pipe to test his limits by nearly suspending his entire body by his dick and balls. Rocking back and forth on his tiptoes, the intensity of his groin alternates between pain and pleasure. Finally when his cum-filled nuts are turning purple and about to explode, Ricky edges himself until he can’t take it anymore.\n\nRicky strokes his giant cock until blows his load. As he shakes with orgasmic intensity, Ricky unties his dick and balls, allowing all the blood to flood his loins for one last surge of pleasure. Feeling fully satisfied, Ricky pulls up his pants, tucking his happy cock into his stinky jeans and wanders off into the abyss.",
  "directors": [
    {
      "name": "Mr. Pam",
      "person_id": 126
    }
  ],
  "models": [
    {
      "name": "Ricky Larkin",
      "person_id": 35556
    }
  ],
  "release_date": "2020-12-08",
  "scene_id": 101611,
  "tags": [
    "big dick",
    "CBT",
    "Clothespins",
    "Edging",
    "Hairy",
    "Muscle",
    "muscular",
    "Paddle",
    "Pain",
    "slapper"
  ],
  "title": "Alone: Ricky Larkin Ties Up His Cock & Balls in an Abandoned Factory"
}