{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "After picking the lock to his cage, Ruckus snoops around Aiden Starr’s dungeon. He’s obviously forgotten his training. He knows very well that Aiden does not allow her submissives the luxury of wandering around whenever they feel like it. Her booming voice startles him as he paws her floggers and canes. She Immediately explains to him exactly how he is going to pay for this infraction. With his cock locked away his sore nipples are snapped in rat traps and once he can’t take that anymore he is then tormented with clover clamps. Aiden laughs sadistically as she has him pull on the chain, eliciting screams and apologies. He flogs his inner thighs and slaps himself across his own face, all at Aiden’s command.\n\nAfter he has proven himself to take the pain at will, Ruckus is allowed out of his cock cage. He knows the rules in Ms. Starr’s dungeon. If his cock is not locked up it must be rock hard and ready for his mistress to have her way with him anytime the fuck she wants. He strokes his throbbing cock as she tells him how her twisted fantasies are going to play out. You see, Aiden is ovulating. Her pussy is wet as she tells him he will be inseminating her. Ruckus struggles to maintain his composure as she taunts him with this story all the while showing off her huge tits and pink pussy. After thoroughly fucking his mind Aiden Starr decides it’s time for one of her machines to fuck his asshole. Ruckus moans in pleasure as he gyrates his hips into the dildo thrusting in and out of his ass. He turns up the speed at Aiden’s command. He lies there taking the pounding all for his mistress. Once she tires of watching him get plowed Aiden tells her puny slave it’s time for him to come in his hand and eat his own filth. And eat it he does.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    }
  ],
  "release_date": "2020-12-04",
  "scene_id": 101624,
  "tags": [
    "Big Tits",
    "Blonde",
    "Cage",
    "Caning",
    "Chastity Play",
    "Clover Clamps",
    "Dildo",
    "dungeon",
    "Edging",
    "Femdom",
    "Flogging",
    "Humiliation",
    "Nipple Clamps",
    "Pain",
    "Slave"
  ],
  "title": "Keep Your Distance: Aiden Starr and Ruckus"
}