{
  "collections": [
    "Kinky Bites Men"
  ],
  "description": "Hot hairy beefcake Draven Navarro is trapped in the middle of the desert and subject to the whims of his sadistic captor Ricky Larkin. Ricky pulls a bound Draven from his cell. Draven struggles, pleading with Ricky to let him go. Ricky isn’t about to free his muscled toy just yet but promises if Draven is good, he’ll let him go.\n\nHe makes Draven smell his junk through his dirty jeans before pulling out his hard cock and telling Draven to suck. Draven obeys and once Ricky has his fill he pushes Draven into an abandoned tower. Ricky strings Draven up and pulls his body flush against a plastic street. Draven struggles to breathe as Ricky holds him by the face and admires his work.\n\nHe takes his time running his hands all over his boy and smelling his hairy armpits before feeding Draven his cock. Draven moans as Ricky fucks his mouth. He knows once Ricky is done with his mouth, he’ll want his ass.\n\nRicky comes up behind Draven and pushes his cock into Draven’s well-used hole. Draven gasps as Ricky penetrates him and rides his ass. Draven’s little cries only make Ricky’s cock harder and he brings Draven to his knees to suck his cock and lick his balls. Draven soon gets a mouth full of Ricky’s cum and holds it in his open mouth for inspection. Ricky laughs and holds Draven’s mouth shut until he swallows all of it.",
  "directors": [
    {
      "name": "Mr. Pam",
      "person_id": 126
    }
  ],
  "models": [
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Ricky Larkin",
      "person_id": 35556
    }
  ],
  "release_date": "2020-12-31",
  "scene_id": 101674,
  "tags": [
    "Anal",
    "Athletic",
    "Bondage",
    "Boot",
    "Domination",
    "Gay",
    "Hairy",
    "jock",
    "Muscle",
    "muscular",
    "Oral Sex",
    "Outdoors",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Swallow",
    "Tied Outside",
    "toned"
  ],
  "title": "Desert Captive: Ricky Larkin Fucks Draven Navarro Raw"
}