{
  "collections": [
    "Submissived"
  ],
  "description": "Chad has been finding his luck with the ladies to be a bit under par lately, so hes been turning to escorts for some quick fun. He stumbled across Jenna, whose ad really spoke to him, so he invited her over for a candle lit dinner. He tries to find out more about her, like how she got into the escort game, but she seems a bit distracted. After telling Chad about how she loves the thrill of it, Jennas focus once again escapes her. All she can keep her eyes on are the candles. Shes fascinated by fire, but admits that she has yet to do anything crazy with it, but would definitely like to. Jenna was oblivious to the fact that Chad was a super kink, until he starts putting her finger closer to the flame. He then uses her finger to put out the flame, asking if Jenna might like that feeling over her body. LET THE WAX PLAY BEGIN! Chad lit up two exquisite ivory candles and started dripping wax from Jennas tits all the way down to her tight pussy. Watching her skin turn red and breath get heavy was quite the enticing experience. At that point, Jenna was wet (and warm) enough to receive one hell of a dick down. The sex was just as intense as the wax play, and the only thing harder to peel off your body than some from freshly melted wax is some freshly conjured jizz cream, but Jenna doesnt seem to mind one bit.",
  "directors": [],
  "models": [
    {
      "name": "Chad Alva",
      "person_id": 39074
    },
    {
      "name": "Jenna Reid",
      "person_id": 59562
    }
  ],
  "release_date": "2020-12-02",
  "scene_id": 101654,
  "tags": [
    "BDSM",
    "black hair",
    "Bondage",
    "Brunette",
    "Deepthroat",
    "Facefucking",
    "Facial",
    "Fetish",
    "Hair Pulling",
    "High Heels",
    "Hot Wax",
    "Lingerie",
    "PIV",
    "Redhead",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Small Tits",
    "Spanking",
    "Vaginal Fisting",
    "white"
  ],
  "title": "The Wax Play Agenda"
}