{
  "collections": [
    "KinkMen Classics"
  ],
  "description": "Jerking himself off to some sweet yule-time slumber, straight stud Zach Clemens falls to sleep, all while two holiday thieves break into his kitchen. The two can’t find any valuables, but they stumble across something better: Zach’s peaceful, delicious cum-covered body. Next thing Zach knows, he’s blindfolded, strung up in rope bondage and Christmas lights, and groped all over by these horny burglars. Brandon’s mouth gets Zach’s cock at full attention as the burglars fit his sensitive nipples with tight clamps. Sebastian pulls out a fleshjack and brings the boy to the edge over and over again. They cover his body in a festive zipper of painful clothespins and ornaments, all the while making him purr with a vibrating sheath on his dick. Just as Zach thinks he’s gonna blow, they rip the zipper from his body and throw him onto the bed.\n\nZach begs to cum while Brandon rims his hungry hole. Sebastian takes advantage of Zach’s spread legs and sticks a vibrating dildo deep into the boy. Zach can’t handle so much pleasure on his prostate, so Brandon shuts him up with his huge cock. Sucking off Brandon, Zach finally lets a huge load burst all over Sebastian’s hand before. Sebastian cleans up the mess with one of santa’s cookies and feeds it to the straight stud, despite his struggle. Ending their night, the thieves wrap up Zach under the tree as they celebrate another wonderful Christmas.\n\nStill beats a lump of coal.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Branden Forrest",
      "person_id": 29020
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Zach Clemens",
      "person_id": 55314
    }
  ],
  "release_date": "2020-12-28",
  "scene_id": 101743,
  "tags": [
    "BDSM",
    "Blindfold",
    "blond",
    "Bondage",
    "christmas",
    "Clothespins",
    "Dildo",
    "Edging",
    "Gay",
    "holidays",
    "Oral Sex",
    "Pain",
    "Prostate Stimulation",
    "remastered",
    "Rope Bondage",
    "Straight",
    "Straight Stud",
    "Stud",
    "Tickling",
    "Zipper"
  ],
  "title": "Zach Clemens: Straight Stud Gets an Edging Surprise for the Holidays!"
}