{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Hairy-chested Xavier St Jude, blindfolded in a red bandana, kneels in jeans and boots before Ethan Hudson, deep-throating the top’s thick pipe. Ethan, in rubber chaps that hug his muscled thighs, confidently yanks the bottom’s chain collar, guiding Xavier’s mouth from his cock to his balls to his hole. Ethan pushes Xavier onto a wooden chair and ties his hands behind him with rope, kissing him and playing rough with Xavier’s nips. . Then Ethan lubes up a silicone sleeve and slides it down over Xavier’s hard cock. jacking him, alternating quick and slow strokes and bringing the bound bottom to the edge over and over as he whispers a stream of filth into Xavier’s ears. Ethan slowly pushes it in deeper, the toy’s girth thickening in sections, Xavier’s long, constant moan letting Ethan know his gratitude. Ethan plays with Xavier’s greedy hole, then jacks him again with the silicone sleeve until the bottom’s cries turn violent, jets of cum bursting from his cock, his entire bound body convulsing in ecstasy. But Ethan’s nowhere near finished, and he ties Xavier bent over the chair, then aims a full geyser of piss all over Xavier’s back and ass, soaking his hole like a stallion before pushing the wet cock into Xavier’s mouth, then slamming it up Xavier’s primed hole, pounding him and reveling in the bottom’s loud groans of pleasure. Xavier, still blinfolded and bound to the chair, his legs shuddering, can do nothing but take the cock plowing relentlessly in and out of his hole. Ethan jacks himself with the lubed sleeve until he sprays his cum all over the floor, then finally pulls the bandana off Xavier so they can swap spit, both sweaty, spent, and satisfied.",
  "directors": [],
  "models": [
    {
      "name": "Ethan Hudson",
      "person_id": 29881
    },
    {
      "name": "Xavier St-Jude",
      "person_id": 18504
    }
  ],
  "release_date": "2021-01-01",
  "scene_id": 101761,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "bottom",
    "Collar",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Edging",
    "Facefucking",
    "Gay",
    "Hairy",
    "Handjob",
    "Leather",
    "Piss Play",
    "Rope Bondage",
    "spit",
    "Strokers",
    "the chair",
    "top"
  ],
  "title": "SUBMIT: Xavier St Jude and Ethan Hudson"
}