{
  "collections": [
    "Submissived"
  ],
  "description": "Trisha finds yards on yards of rope in her mom’s pantie drawer. She shows it to Chloe, who is also very intrigued by it. She suggests that maybe Trishas parents are into kink, and she might be right. After gazing at the rope for a few minutes, they both decide that maybe this is something they should try, but they have no idea how it’s done. They look up online how to do it properly, and when Chloe gives Trisha the first wrap around, she starts getting excited right away. Turns out Chloe isn’t the best at BDSM knots, so they decide to call Richie who they know is super good at that kind of stuff. As soon as he gets there, they immediately lure him to the bedroom to explain the deal. Richie’s a little bit perplexed. He gets the tying up part, but what else? The girls basically leave it up to him, and that’s the worst possible idea they have had all day. Turns out Richie was a closet sick sadistic fuck who took overbearing control right away as soon as it was given to him. He lifts Chloe by the hair and sternly tells them both to take their fucking clothes off. Trisha tries talking back, but he firmly grabs her by the mouth, lays down the rules, and demeans the girls every chance he can. He throat fucks the shit out of Trisha while Chloe is made to watch. She tries to get up, but it’s of no use. Richie proceeds to brutally cock slap both of these sluts so they can get a dose of what true kink is all about. He then gets them both on the bed, just in time to start brutally slapping, fish hooking, and fucking them both in quite a raucous manner. After that ordeal AND a demoralizing shared load to the face, it’s safe to say these little adventurers might stick to vanilla next time they go to the ice cream shop.",
  "directors": [],
  "models": [
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Richie Black",
      "person_id": 48126
    },
    {
      "name": "Trisha Parks",
      "person_id": 58246
    }
  ],
  "release_date": "2020-12-23",
  "scene_id": 101714,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "Choking",
    "Deepthroat",
    "Facesitting",
    "Facefucking",
    "Facial",
    "Fetish",
    "Gag",
    "PIV",
    "Rope Bondage",
    "Slapping",
    "Small Tits",
    "Vaginal Penetration",
    "white"
  ],
  "title": "All Tied up"
}