{
  "collections": [
    "SW Nude"
  ],
  "description": "We have a great pairing in a wrestling match. Bradley Cook and Michael Red are both very well built guys. Then start off with some warming up. Then it is onto the match, with the guys quickly down on the mats grappling to gain an advantage. It is Bradley who prevails and wins the first point. Then the underwear comes off before they resume the match. Bare-assed they get to grips with each other again, as cocks flair too. Bradley. Bradely’s massive cock flops around a lot as Michael tries to get his first score on the board. He does just that in round three. After Bradley has won another round we get a great view of Michael as he lays on top of Bradley, with both guys asses spread beautifully, particularly showing Michael’s hot hole. With Bradley building a big lead Michael resorts to some underhand tactics to ensure that he scores again. After Bradley wins another round though they take a break to oil each all over. They resume the match with Bradley extending his lead despite Michael still employing the cock pulling techiniques. Bradley takes a well deserved victory and they settle down for a wank off. They wank each other for a few seconds too, despite Michael’s reservations. Then it is back to wanking themselves and Bradley quickly shoots the cum from his massive cock, all over the mats. Michael keeps wanking himself and soon delivers his own cumshot, squirting the hot juice all over the mats as well. Then it is off to the showers to clean up!",
  "directors": [],
  "models": [
    {
      "name": "Bradley Cook",
      "person_id": 60772
    },
    {
      "name": "Michael Red",
      "person_id": 62519
    }
  ],
  "release_date": "2020-12-30",
  "scene_id": 101762,
  "tags": [
    "Athletic",
    "erotic wrestling",
    "Facesitting",
    "Gay",
    "Humiliation",
    "jock",
    "Jockstrap",
    "muscular",
    "Pain",
    "Role Play",
    "Squirting",
    "Submission",
    "top",
    "Wrestling"
  ],
  "title": "Bradley Cook vs Michael Red WRESTLING"
}