{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "WELCOME TO THE START OF A BRAND NEW SEASON.\nSeason Eight Match\n\nARIEL X\nThe Assassin\nHT: 5’3\nWT: 110 lbs\nSeason record (0-0)\nLifetime record (15-5)\n\nCHLOE CAMILLA\nThe Conqueror\nHT: 5’6\nWT: 130lbs\nSeason record (0-0)\nLifetime record (0-0)\n\nSeason Eight is now upon us. All new rookies, all new rivalries. Ultimate Surrender brings you the ONLY non-scripted competitive sex wrestling in the world. The only league of its kind in existence.\n\nAriel X was denied a second championship after being eliminated by Vendetta in the Summer Vengeance tournament. She took the loss as a wake up call, and vowed to come back this season stronger, better trained, and determined to win Season Eight.\n\nChloe Camilla is your typical rookie: she comes in bigger than her opponent and thinks she’s kind of a badass. She thinks she might lose, but a part of her thinks she can make it through, after all she is a lot bigger than that tiny Ariel X\n\nIt takes about 3 minutes for Chloe to realize she has no hope and is getting her ass thoroughly kicked! Ariel schools the rookie, she makes Chloe tap out and submit to crushing legs scissors. She uses figure four head lock and fingers a helpless and beaten Conqueror on the mat. Ariel face sits and rubs her wet pussy all over Chloe’s face, and she is helpless to stop her. Chloe is turned into rag doll as Ariel X pulls off hold after hold that Chloe cannot escape. After humiliating and beating the bigger girl, Ariel X strap-on fucks the pathetic loser in one of the most brutal round fours we have ever seen. Welcome to US Chloe…",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Chloe Camilla",
      "person_id": 22493
    }
  ],
  "release_date": "2010-09-24",
  "scene_id": 10304,
  "tags": [
    "Anal",
    "blond",
    "Blonde",
    "bottom",
    "Brunette",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Chloe Camilla is destroyed and humiliated on the mat Non-Scripted brutal real wrestling."
}