{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "WELCOME TO THE START OF A BRAND NEW SEASON.Season Eight Match\nGIA DIMARCO\nThe Fountain\nHT: 5'5\nWT: 103 lbs\nSeason record (0-0)\nLifetime record (0-1)EMMA HAIZE\nThe Avenger\nHT: 5'4\nWT: 100lbs\nSeason record (0-0)\nLifetime record (0-0)\nSeason Eight is now upon us. All new rookies, all new rivalries. Ultimate Surrender brings you the ONLY non-scripted competitive sex wrestling in the world. The only league of its kind in existence.\nGia DiMarco is back, and her experience in the Summer Vengeance tournament has turned her into a formidable competitor. One of the smallest on the roster, Gia shows great improvement already over last season.\nWelcome Emma Haize to Ultimate Surrender. This tiny, sexy ball of energy tells us she can be a tough little bitch when she needs to be, however sometimes talk is talk. She might think she can be tough, but this is the place where the talk meets the walk and you can't fake the end result.\nLittle Emma is dominated from the start. She is sexually molested at Gia's will, and can do nothing to stop her from finger fucking her. Emma is just a play toy for Gia to use and abuse on the mat. In round 4 Gia finds the largest strap om we have and brutally fucks the loser's ass into oblivion and back! Now that is how you welcome a loser to US.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Emma Haize",
      "person_id": 29618
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    }
  ],
  "release_date": "2010-10-01",
  "scene_id": 10315,
  "tags": [
    "Anal",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Emma Haize gets her ass kicked... Then ass fucked with the biggest strap-on we have."
}