{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "WELCOME TO THE START OF A BRAND NEW SEASON.Season Eight Match\nCOFFEE BROWN\nThe Grinder\nHT: 5'5\nWT: 135 lbs\nSeason record (0-0)\nLifetime record (0-1)RAIN DEGREY\nPoison\nHT: 5'9\nWT: 124lbs\nSeason record (0-0)\nLifetime record (1-4)\nSeason Eight is now upon us. All new rookies, all new rivalries. Ultimate Surrender brings you the ONLY non-scripted competitive sex wrestling in the world. The only league of its kind in existence.\nCoffee Brown is back for Season 8. This local girl is almost all solid muscle. She wrestled back in Season 6 and lost her first match to a stronger Yana Jordan. Coffee has the body type to do very well if she can put in the time and get the mat experience.\nRain DeGrey is back for the new season as well; what makes Rain different from almost every other returning Season 7 rookie is the extra training Rain has gotten off the mat. Rain has a personal wrestling trainer and works out once a week with him. This is how you succeed at Ultimate Surrender.\nRain dominates her stronger opponent from the start. Using crushing leg scissors, Rain makes Coffee submit multiple times. Rain's crushing legs are just too much for the Grinder to handle. Rain also brings the smack-talk to mat. Not only does she destroy her opponent but she rubs it in at the same time.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Coffee Brown",
      "person_id": 17352
    },
    {
      "name": "Rain DeGrey",
      "person_id": 16817
    }
  ],
  "release_date": "2010-10-15",
  "scene_id": 10507,
  "tags": [
    "Anal",
    "Black",
    "black hair",
    "blond",
    "Blonde",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "Muscle",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Blond battles stronger black girl The only non-scripted competitive sex wrestling in the world"
}