{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the Final of the 2010 Summer Vengeance Tournament! The winner will be the undisputed Season 7 Champion. DIA ZERVA\nThe Assassin\nHT: 5'5\nWT: 145lbs\nSeason record (3-0)\nRanked 3rdVENDETTA\nVendetta\nHT: 5'6\nWT: 130lbs\nSeason record (3-0)\nRanked 4th\nThis is the first meeting of these two powerhouses in single competition. They have met before in Tag Team action and many believe Vendetta has gotten the best of those exchanges over the years. Both wrestlers are undefeated this year with similar records.\nDia Zerva is riding a wave of victory at the highest level. She won her two Summer Vengeance matches against two elite wrestlers with combined scores of 2699-128. Dia is sporting the highest power rating of any wrestler in the history of Ultimate Surrender, her lifetime record is (8-1)\nVendetta looks the best she has in years. She has trimmed down and is as fit as she has ever been. With a lifetime record of (21-3) Vendetta is no stranger to the pressure of championship matches. Vendetta had to beat last year's Champion to get to this match up.\nThis is what the entire season is about, 28 girls entered the league this year, the top 16 went into the tournament and after 14 weeks of grueling non-scripted sexual wrestling, these two warriors face off to see who will be the Season Seven undisputed Ultimate Surrender Champion!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Dia Zerva",
      "person_id": 16038
    },
    {
      "name": "Vendetta",
      "person_id": 8300
    }
  ],
  "release_date": "2010-09-10",
  "scene_id": 10536,
  "tags": [
    "Anal",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Season 7's Championship Match up! The only non-scripted real wrestling on the net."
}