{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Halloween is my favorite holiday. To celebrate on this fantasy filled time of year I wanted to do something different to get all Divine Bitches members in the spirit. La Semence Des Vampires (The Seed of the Vampires) is an ode to vampire movies of the past and all their cinematic delight paired with a femdom twist.\nAiden Starr; the head vampire, finds her power diminishing day by day. Aiden realizes she needs more than blood to survive and only an innocent piece of man meat has what she needs to feed. For their mistress, Bobbi Starr and Nika Noire leave the comfort of their dilapidated crypt in order to seek out the young flesh and seed of John Jammen who unbeknownst to him is seduced by the striking beauty and sultriness of the vampires. John is sucked into an underground world of BDSM, punishment and fetish sex where femdom vampires not only feed off of his blood but painfully milk his cock and balls raw till every last drop of his seed is their own.\nOn top of the higher production you will enjoy all of your favorite fem dom nuances including flogging, humiliation, nipple torture, pantyhose, ass worship, ruined orgasms, CBT, foot worship, CFNM, raw milking, strap-on ass fucking, heavy caning, painful zippers, breath play, sex in bondage and much more!\nHappy Halloween,\nM.M.~",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    },
    {
      "name": "John Jammen",
      "person_id": 22596
    },
    {
      "name": "Nika Noire",
      "person_id": 17418
    }
  ],
  "release_date": "2010-10-27",
  "scene_id": 10745,
  "tags": [
    "Athletic",
    "BDSM",
    "Blonde",
    "Bondage",
    "brunet",
    "Brunette",
    "Caning",
    "CBT",
    "CFNM",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fetish",
    "Fingering",
    "Flogging",
    "Foot Worship",
    "halloween",
    "Humiliation",
    "Male Sub",
    "multiple orgasms",
    "natural boobs",
    "Nipple Torment",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "versatile",
    "white",
    "Zipper"
  ],
  "title": "La Semence Des Vampires"
}