{
  "collections": [
    "Divine Bitches"
  ],
  "description": "This is something special we've never seen in the history of Divine Bitches. New sub Leo Forte has just moved to San Francisco two weeks ago and finds himself on the doorstep of the Kink.com Armory. Leo has hidden his need, want and desire to be dominated, humiliated and fucked from everyone he knows in his middle America town. And now here he is right at the foot of two of the sexiest dominant Bitches ever to walk the earth. The shoot starts off normally with a little fantasy role play, some ass worship, strap-on buttfucking, OTK spanking, humiliation and CFNM. But, when the Bitches hit Leo with some hot wax and a cane he falls. I don't mean literally I mean this sub falls so deep into subspace that I decide to stop the shoot at some point because of the intensity. Leo said to me after and I quote, \"I've been hiding this want all my life. I've been told I was wrong for having these feelings and then BAM here you are telling me it's ok to feel this way. You've even encouraged me to explore it and celebrate it. What on earth am I supposed to do with feelings like that? I have no idea where to put it.\" Leo is doing well and coming back to Divine Bitches soon with his new found enlightenment but first we get to witness his first taste of real BDSM. Don't miss the closing and emotionally charged closing interview!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Dia Zerva",
      "person_id": 16038
    },
    {
      "name": "Felony",
      "person_id": 17502
    },
    {
      "name": "Leo Forte",
      "person_id": 22142
    }
  ],
  "release_date": "2010-11-03",
  "scene_id": 10839,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blonde",
    "Bondage",
    "Brunette",
    "CBT",
    "CFNM",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Hairy",
    "Hot Wax",
    "Humiliation",
    "Latin",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Slave",
    "Spanking",
    "Straight",
    "Stud",
    "Sub",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "New male sub falls deep into sub space like never seen before on Divine Bitches."
}