{
  "collections": [
    "TS Seduction"
  ],
  "description": "There is something for everyone in this fantasy Halloween orgy, sci-fi fuck fest, staring the unbelievably sexy, Nika Noire as the mad doctor, the cock of horror proportions - Honey Foxx as Catalina, and the tall, dark and naive stranger - Chris Ockham.\n\nThere is sexy deviance brewing on the hill in that dark house no one dare enter. Nika Noire is hard at work on her latest advancement in total world domination - Catalina - a thin, toned, 10 inch cock wielding woman. She’s finally done it. Catalina lives, breathes, fucks…her cock is thick, hard and dripping pre-cum. Nika slips Catalina’s cock inside her and cums form the pleasure of knowing she built her. Now she must teach her how to seduce new recruits.\nAs the women doll up and get ready for a night on the town, a wicked storm blows in the census guy who clearly has no idea to avoid this house. He drips with rain and eagerness as Nika - who never missing a step or opportunity whispers - “rarely is the meat delivered….”. With that Chris is captured and strapped to the operation table while the girls suck his dick, fuck his face and draw cum from him like a fountain.\nOne more sip of the slave elixir and the orgy begins. Every position possible from Nika’s strap-on and Catalina’s girthy dick. All three fuck like sweaty dogs milking more cum out of Chris, orgasms from Nika’s greedy pussy and a thick wad of jizz from Catalina’s dick.",
  "directors": [],
  "models": [
    {
      "name": "Chris Ockham",
      "person_id": 25254
    },
    {
      "name": "Honey FoXXX",
      "person_id": 20864
    },
    {
      "name": "Nika Noire",
      "person_id": 17418
    }
  ],
  "release_date": "2010-10-27",
  "scene_id": 10835,
  "tags": [
    "69 Position",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Tits",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Collar",
    "Corset",
    "Doctor",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fetish",
    "halloween",
    "High Heels",
    "Hitachi",
    "Kinky",
    "Latex",
    "Lingerie",
    "Male Sub",
    "Medical Fetish",
    "mixed",
    "natural boobs",
    "Orgy",
    "Pussy Eating",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Small Tits",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "Threesome",
    "toned",
    "TS",
    "TS Fucks Female",
    "TS Fucks Male",
    "unshaved",
    "Vaginal Penetration",
    "versatile",
    "white"
  ],
  "title": "Mad, Mad Science The Making of The Ultimate Woman"
}