{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Season Eight is now upon us. All new rookies, all new rivalries. Ultimate Surrender brings you the ONLY non-scripted competitive sex wrestling in the world. The only league of its kind in existence. Season Eight Match\nDARLING\nThe Grappler\nHT: 5'4\nWT: 112 lbs\nSeason record (1-0)\nLifetime record (16-5)\nRanked 3rdTORI LUXE\nThe Phoenix\nHT: 5'2\nWT: 120lbs\nSeason record (0-0)\nLifetime record (0-0) Darling is a returning veteran of the mat. This is her sixth season with US. Darling is one of the top 5 elite wrestlers. She is a shining example of what dedication, hard work and a winning attitude can get you. This will be her second match of the new season.\nTori Luxe comes into Ultimate Surrender with a big sports background. She was the star of her collage track and volleyball teams. She works out almost every day and has been wanting to wrestle here for years. Now that she is in the industry her wish can be granted.\nTori honestly thought she might win this match. Confident in her strength, conditioning and toughness, what she underestimated was the skill involved. Darling wipes the mat with this cocky upstart. Using brutal leg scissors, head locks and painful submission holds, Tori is abused, beaten and fingered on the mat. And that's nothing compared to the vicious RD4 poor Tori endures as Darling brutally fucks the living hell out of her!!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Tori Lux",
      "person_id": 26264
    }
  ],
  "release_date": "2010-11-19",
  "scene_id": 10909,
  "tags": [
    "Anal",
    "Big Tits",
    "black hair",
    "blond",
    "Blonde",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "toned",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Big titted blond with killer Jiu Jitsu skills Destroys porn star Tori Luxe on the mat."
}