{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Season Eight Match\nTIA LING\nJADE\nHT: 5'1\nWT: 100 lbs\nSeason record (0-0)\nLifetime record (4-3)MAHINA ZALTANA\nThe Wild Samoan\nHT: 5'1\nWT: 127lbs\nSeason record (0-0)\nLifetime record (0-0)\nTia Ling is back in single competition for the first time this season. She is pound for pound the strongest wrestler we have on the roster, she is also one of the smallest, but she does not let this handicap effect her much at all. This girl kicks ass, and can hang with the most experienced bigger girls. Tia is 100% energy all the time!\nWelcome Mahina Zaltana., this sexy Hawaiian gets on the mat for the first time. She is strong, cut and very confident she can take her tiny Asian opponent. Mahina grew up with brothers and is used to rough housing. However, Ultimate Surrender is not your big brother, and if you lose you're going get your ass fucked!\nMahina learns in the first 10 seconds that she is in some serious trouble. It takes about that long for Tia to jam her fingers up her pussy and ride her like a whore on the mat. You have to give credit to the new girl - she never gives up, but she is helpless to the much more experienced smaller girl who humiliates her on the mat then fucks her like a common slut in RD4! Using amazing scissor-leg head-locks and submission holds, Tia really whips up on the bigger rookie!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Tia Ling",
      "person_id": 17361
    },
    {
      "name": "Mahina Zaltana",
      "person_id": 28012
    }
  ],
  "release_date": "2010-12-17",
  "scene_id": 11181,
  "tags": [
    "Asian",
    "Cut",
    "domination",
    "Facesitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Tiny Asian takes on bigger Hawaiian, non scritped action"
}