{
  "collections": [
    "Device Bondage"
  ],
  "description": "Sergeant Major is back, this time to fuck with Sloane Soleil. Sloane is a sexy little cock-tease, and the Sarge hopes a little rough handling will help straighten her out. If that pussy wants attention, that pussy’s gonna get it. Lots.\n\nThe Sarge straps her arms and hands together with leather, cuts off her trampy clothes, and whips her ass and tits. He gags her with a rope tied to a cold metal hook shoved deep in Sloane’s tight ass. Sloane cums hard, whimpering on the floor like the whore she is.\n\nSloane gets strung up by her ankles, arms belted tight to her sides. She is gagged and helpless to stop the brutal flogging that colors her pussy and ass red. Sarge clothespins her sweet little puffy tits, fills her wet cunt with dick, and chokes her while she cums hard upside-down.\n\nSloane’s pussy gets more punishment on the wooden horse, with her weight pressed down on that sore little clit. The Sarge flogs and vibrates Sloane’s oversensitive cunt. Sloane drools all over herself while clothespins are clipped up and down the front of her body, then whipped off one by one. The Sarge rips a couple more intense orgasms from that poor little spent pussy.\n\nSarge pushes Sloane’s puffy red cunt over the edge by binding her on the Sybian. Sloane helplessly cums again and again, while Sarge continues to overwhelm her with breath play and pussy flogging.",
  "directors": [],
  "models": [
    {
      "name": "Sloane Soleil",
      "person_id": 22611
    }
  ],
  "release_date": "2011-02-11",
  "scene_id": 11392,
  "tags": [
    "BDSM",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Couple",
    "Domination",
    "Fingering",
    "Flogging",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "other hair color",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "switch",
    "Sybian",
    "Tattoo",
    "white"
  ],
  "title": "Pussy Punishment"
}