{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Season Eight Match\nSLOANE SOLEIL\nThe Red Threat\nHT: 5'4\nWT: 114 lbs\nSeason record (0-0)\nLifetime record (0-0)\nJESSIE COX\nThe Cheerleader\nHT: 5'2\nWT: 108lbs\nSeason record (1-0)\nLifetime record (3-1)\nWelcome Isis Love as the new Ultimate Surrender referee. With 6 seasons of mat experience, she was the perfect candidate. Matt Williams is still the Director, scheduler and now commissioner of Ultimate Surrender. With Isis taking over the referee position, Matt is free to create another website for Kink.\nJessie Cox has dropped some weight and now she looks faster then ever. Jessie is one of the best of the feather weights. This former gymnast and [REDACTED] is full of energy on and off the mat. Jessie has learned a great deal from the last season's Tag Team League as she was partnered with Dia Zerva. Look for great things coming from Jessie this year.\nSloane Soleil comes to us from the underground blood wrestling pit of the Citadel. This red jello league competes monthly. It is a no-rules anything-goes blood bath of hell where the meanest etch out a life for themselves in pain and suffering. Ok, maybe that's a touch dramatic but you get the idea. Sloane plays \"The Red Threat\" in the pits, a tough nasty Russian girl.\nSloane soon realizes that life in the pit is easy compered to the trained gladiators of Ultimate Surrender. Our little Cheerleader punishes the street fighter. Great headlocks, body scissor holds and brutal leg locks. Jessie makes \"The Red Threat\" submit 3 times, and gets fingers in her pussy early and often.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Jessie Cox",
      "person_id": 18739
    },
    {
      "name": "Sloane Soleil",
      "person_id": 22611
    }
  ],
  "release_date": "2011-01-07",
  "scene_id": 11429,
  "tags": [
    "domination",
    "Face Sitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tag team",
    "the pit",
    "Vaginal Penetration",
    "weights",
    "wrestling"
  ],
  "title": "Former collegian cheerleader, takes on street tough rookie, in a non-scripted wrestling match."
}