{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Season Eight Match\n\nHOLLIE STEVENS\nThe Amazon\nHT: 5’7\nWT: 145 lbs\nSeason record (1-0)\nLifetime record (6-7)\n\nMAHINA ZALTANA\nThe Moon\nHT: 5’1\nWT: 127lbs\nSeason record (0-1)\nLifetime record (0-1)\n\nHollie is oldschool Ultimate Surrender, a 6 year veteran. This hot blond athlete loves the sport but most of all she loves to lay the smack down on other hot girls. With the size and the strength of an Amazon, Hollie knows how to use her legs to crush and squeeze the fight out of you in seconds.\n\nWelcome back Mahina Zaltana. This sexy Hawaiian loved her first match up and is now addicted to this unique sport. She never gives in never gives up, this hot blooded dark erotic beauty fights to the final whistle. You can’t ask for more than that from any Rookie! There are dues to pay on the mat, a lesson every veteran knows, but Mahina is catching on quicker than most.\n\nThe bigger and more experienced Amazon had some trouble with the smaller rookie. Not much, but it wasn’t the smashing victory she assumed she would get. Mahina put up a good fight, but in the end Hollie’s size and strength was too much, brutal scissor holds crushed the fire and bejesus out of the Rookie. Hollie had her fingers in her opponent often and made it count, as the pleasure of the fingers weakened the helpless rookie. Isis Love steps in and helps Hollie humiliate and double fuck our loser. In the end, Mahina is beaten, fucked and left on the mat trying to recover from the brutal orgasms that were just fucked out of her.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Hollie Stevens",
      "person_id": 1572
    },
    {
      "name": "Mahina Zaltana",
      "person_id": 28012
    }
  ],
  "release_date": "2011-02-11",
  "scene_id": 11738,
  "tags": [
    "Anal",
    "blond",
    "Blonde",
    "Brunette",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaped",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Blond Amazon destroy & humiliates Sexy Hawaiian on the mat Finger fucking during the wrestling"
}