{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Mistress Bobbi Starr\nSub: Sparkles\nNew submissive, Sparkles has his limits pushed, his attitude adjusted and his cock denied by tough and sexy domme Mistress Bobbi Starr. Sparkles is put into \"The Wall\" and has his cock and balls tortured, his feet caned and his entire body spanked and manipulated while Bobbi Starr beams at him with her beautiful smile. The second scene is so damn sexy when Bobbi plays Sparkles like a fiddle giving him just what he desires by agreeing to wrestle him but her energy is to powerful for him to resist. Sparkles soon finds himself pinned to the floor with a strap-on deep in his ass being fucked only like Mistress Bobbi Starr can! Sparkles can't control himself once Bobbi straps him down and makes him lick her ass clean. Bobbi decides to take his slave cock for a ride for only her pleasure. She slowly grinds on his dick to orgasm as he begs over and over to cum. Bobbi milks his dick to the last possible second and right before his balls are about to bubble over SMACK totally denied!\nReturn to Divine Bitches to see Sparkles and his second day of training with the next Divine Bitch!\nMaitresse's Evaluation\nGoals\nstress positions and strength\nendure \"The Wall\"\nnew sensations\nconquer fear of new experiences\npleasure tool\nbecome an efficient tool for female pleasure\nClosing assessment\nnew experiences create fear which in turn creates an attitude and doubt\nmust continue to push limits in order to break that wall\nhighly usable as a tool for pleasure\nexceptional anal abilities",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    },
    {
      "name": "Jessie Sparkles",
      "person_id": 27566
    }
  ],
  "release_date": "2011-03-16",
  "scene_id": 12015,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight",
    "Sub",
    "the wall"
  ],
  "title": "Breaking The Boy: Episode 1"
}