{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Many have tried. Some have failed. Some made it through the final day of training. In this update Maitresse Madeline searches for new meat for the Bitches LIVE! This is the edited version of the live shoot where three potential amateurs submit for the chance to go through full training with the Divine Bitches. The boys are put to the test with CBT, CFNM humiliation, spanking, flogging and cat-o-nine tails right to the cock! They are all examined on their anal abilities with a brutal strap-on ass fucking. In the end only one can win the big reward, the honor of training with the Bitches and licking Maitresse Madeline’s ass clean while she strokes his cock to the edge. Watch as the winner shows his lack of training by begging Madeline to put his cock inside her. She teases him with her pussy so close and strokes him to the edge but slaps the hell out of his cock denying him any pleasure. Bad slaveboy!\n\nIf you are interested in the full version of this live show complete with in between the scenes Q and A with Madeline it’s available streaming. Just click on the LIVE SHOW link.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Jack Thunda",
      "person_id": 29198
    },
    {
      "name": "Jesse Carl",
      "person_id": 29074
    },
    {
      "name": "Jessie Sparkles",
      "person_id": 27566
    },
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 17872
    }
  ],
  "release_date": "2011-02-23",
  "scene_id": 12011,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "brunet",
    "CBT",
    "CFNM",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "New Slaveboy Tryouts LIVE with Maitresse Madeline"
}