{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Ultimate Surrender brings you the ONLY non-scripted competitive sex wrestling in the world. The only league of its kind in existence.Season Eight Match\nCHEYENNE\nThe Wrangler\nHT: 5'5\nWT: 127lbs\nSeason record (0-0)\nLifetime record (0-0)CECE STONE\nThe Cyclone\nHT: 5'10\nWT: 150lbs\nSeason record (0-2)\nLifetime record (0-2)Cheyenne is a veteran of wrestling, but a rookie on the Ultimate Surrender mat. Ultimate Surrender has a style and unique set of rules she has not yet mastered, however, she is learning and learning fast. She will be ranked in the top ten easily after this match.\nCece is one of this seasons toughest, new rookies. She never gives up, never stops fighting even when greatly outmatched. I wish I had ten like her. Cece is strong, fit, tan, sexy and loves the sport.\nCece puts up a strong fight but is overwhelmed by the strength of Cheyenne. Cheyenne dominates Cece at all turns and keeps her helpless and horny on the mat as Cheyenne gets fingers into Cece's pussy often. Isis love Love joins RD4 to help the winner bring a brutal fucking to the loser. What's left of Cece is a broken sex puppet, beaten and abused and left on the mat for the janitorial staff to deal with at the end of the night.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Cece Stone",
      "person_id": 18495
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    }
  ],
  "release_date": "2011-03-11",
  "scene_id": 12046,
  "tags": [
    "Anal",
    "Brunette",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Two tough street girls go head to head in non-scripted wrestling to see who is the toughest bitch."
}