{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Season Eight Match\nDIA ZERVA\nThe Iron Maiden\nHT: 5'5\nWT: 135 lbs\nSeason record (2-0)\nLifetime record (10-1)HOLLIE\nThe Amazon\nHT: 5'7\nWT: 145 lbs\nSeason record (2-0)\nLifetime record (7-7)\nDia Zerva is the current bad ass Champion of Ultimate Surrender, she has adapted her skills to this sport and now she looks unbeatable. She destroyed The Dragon by 1600pts in last year's tournament and went on to win the title easily. This former Marine loves this sport and is at the top of her game.\nHollie Stevens is a 6 year veteran and one of the biggest, strongest girls on the the roster. She is currently ranked 5th and is undefeated this season. Her legs are devastating, her determination to win unmatched, this girl hates to lose.\nThe Champion proved why she is the number one ranked wrestler for season 8. She over powered Hollie in every way. She had fingers in Hollie almost the entire match. Hollie was helpless, beaten and humiliated on the mat. To Hollie's credit she did score some points, but Dia was just too much for the Amazon to handle.\nOne thing Dia loves is brutally fucking girls who lose to her and when we say brutally, we mean it! Hollie is fucked into the mat like a rag doll. Dia brings the humiliation, the pain and the dick down to Hollie. The loser is left moaning on the mat like a common slut after Dia uses her like a humping post.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Hollie Stevens",
      "person_id": 1572
    },
    {
      "name": "Dia Zerva",
      "person_id": 16038
    }
  ],
  "release_date": "2011-03-25",
  "scene_id": 12045,
  "tags": [
    "Anal",
    "blond",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pain",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "2 blond Amazons battle. Smaller girl destroys bigger. Fingers her on the mat then fucks her."
}