{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to Tag Team Tuesdays. This is round 1 of 4 of the live CHAMPIONSHIP match up between Team Ice and The Dragons.\nTeam Ice fought its way back from a 2-2 record to make it to the championship match! To face off against the undefeated Dragons.\nThe Dragons have not seen a loss all year, they have not been fucked in front of the live audience. It's true that all their matches have been close ones, mostly decided in the last minutes, however this shows their confidence as a team. Can they hold off a team that right now has momentum on their side?\nTeam Ice has fought back and won their playoff match and are now warmed up and ready for the undefeated Dragons. Ariel X is the smallest wrestler on the mat by far and will have to step up big time if Team Ice has any chance against the powerhouse Dragons.\nAriel X faces off first against the Dragon and gets the best of her one on one. The Dragon allows fingers in her early and often, as Team Ice hopes to [REDACTED] the Dragon to cum during the double teams.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "DragonLily",
      "person_id": 3433
    },
    {
      "name": "Hollie Stevens",
      "person_id": 1572
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    }
  ],
  "release_date": "2011-02-01",
  "scene_id": 12106,
  "tags": [
    "Anal",
    "Asian",
    "Big Tits",
    "Blonde",
    "Brunette",
    "Curvy",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "Tattoo",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "RD 1 of the 2010 TAG TEAM CHAMPIONSHIP Match up! The only non-scripted wrestling site on the net!"
}