{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "This months live Ultimate Surrender pits the undefeated Pirates against the once beaten team Ice\nThe Pirates: Led by Ariel X (18-2) this team won its first match against the Dragons in an all out war. They won by less then 100pts and it was a close battle the entire match up. Rookie Chloe Camella (0-3) has learned and grown. She breaks into the top 16 of Ultimate Surrender wrestlers and now will make the Summer Vengeance Tournament!\nTeam Ice: Led by Darling (18-5) this team was destroyed by The Goddesses in their first match up. Darling is a top ranked veteran wrestler, but is new to the Tag Team League. Her partner Iona Grace (1-0) is a rookie with the least amount of mat experience of any other member of the Tag Team League. This team has much to overcome and has little time to do it.\nFull nelsons, head scissors, body scissors, figure four head locks, a modified camel crutch, these are just a few of the amazing holds that each team punished the other with. Non-scripted wrestling in Tag Team format, the only thing like it in the world. The best part, when one girl has the other helpless on the mat, she gets fingered and molested for points. Join Ultimate Surrender today, the worlds last and best original sport!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Iona Grace",
      "person_id": 25204
    },
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Chloe Camilla",
      "person_id": 22493
    }
  ],
  "release_date": "2011-06-28",
  "scene_id": 12327,
  "tags": [
    "Anal",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Brutal 4 girl Tag Team Match up! Non-scripted, sexual submission wrestling Crushing scissor holds"
}