{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the NEW 2011 Tag Team League. All new teams, all new rivalries. Each team will face off once against each other, and the top three teams will make the playoffs. Totally non-scripted, all in front of a live audience, all broadcast live to members.\nIt's the Ninjas vs The Goddesses in non-scripted brutal Tag Team Action. The Only Tag Team non-scripted sex wrestling league in the world!\nThis year the Ninjas are lead by 7 season veteran Wenona (11-6). Wenona is one of the strongest, fittest wrestlers we have on the roster. If Wenona gets her powerful legs wrapped around your body, you're going to submit! Gia DiMarco rounds out the team. This sexy 95lbs beauty is a hellcat in the ring, do not underestimate her because of her size, this girl can bring it.\nThe Goddesses are lead by 4-season veteran Dia Zerva (10-1) and current Ultimate Surrender Champion. Dia is one wrestler you don't ever want to be alone with on the mat, she is that good. Rookie Allie Haze rounds out the team. Allie might be the rookie of the year, this one is all fire and go.\nRound 4 goes over the top as Isis love jumps into the action, but she is not alone. Princess Donna is the audience and she decides she wants to jump in and dominate some losers. Soon the two losers are getting the fuck fucked out of them! Donna is making girls squirt all over the place, it is pandemonium in the squared circle!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Dia Zerva",
      "person_id": 16038
    },
    {
      "name": "Allie Haze",
      "person_id": 21518
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Wenona",
      "person_id": 4485
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    }
  ],
  "release_date": "2011-05-31",
  "scene_id": 12326,
  "tags": [
    "champion",
    "domination",
    "Facesitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "orgy",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tag team",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "6 Girl gang bang orgy from hell: The losers are getting fucked, fisted, made to cum & Squirt!"
}