{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Season Eight Match\n\nROSEMARY RADEVA\nThe Pixie\nHT: 5’4\nWT: 91lbs\nSeason record (0-0)\nLifetime record (0-0)\n\nEMMA HAIZE\nThe Avenger\nHT: 5’4\nWT: 100lbs\nSeason record (0-2)\nLifetime record (0-2)\n\nWelcome Rosemary Radeva to Ultimate Surrender. This Featherweight rookie is as small as they come. Rosemary is the smallest wrestler to date to ever step on the mat. She is smart, she listens and she is very competitive, but will it be enough?\n\nEmma Haize is back on the mat and for once in her life she faces an opponent smaller than herself. Emma is (0-2) and needs a win. Since this is Rosemary’s first time Emma is confident today will be that day.\n\nBoth girls give it their all, and in the end Rosemary wanted it more. Rosemary listened to Isis’ instructions between rounds and used that information to get her first US win! Emma is going to be ground into a pulp at US if she doesn’t improve her skills and improve quickly!\n\nRound 4 is brutal! The new rookie shows how she can bring it and enlists the help of Isis to fuck the living shit out of the loser. Emma is double fucked into the mat, humiliated and made to cum like a common whore.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Emma Haize",
      "person_id": 29618
    },
    {
      "name": "Rosemary Radeva",
      "person_id": 31235
    }
  ],
  "release_date": "2011-04-08",
  "scene_id": 12347,
  "tags": [
    "Anal",
    "Asian",
    "bottom",
    "Brunette",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "Vaginal Penetration",
    "Weights",
    "white",
    "Wrestling"
  ],
  "title": "Battle of the Featherweights 2 rookies go head to head to see who gets to double fuck the other."
}