{
  "collections": [
    "Bound in Public"
  ],
  "description": "After meeting online, married football coach Ethan Hudson shows up at Matthew’s house for what he thinks will be an afternoon of raunchy fun. What Ethan doesn’t know is that Matthew is actually an actor and we have set up hidden cameras to catch the sexual predator in action. Ethan catches on to our set up and tries to escape, but an entire police squad takes him down hard and drags him back into the house to administer their own form of justice and teach the perv a lesson he won’t soon forget. The nasty coach is stripped down, face-fucked, bound and made to endure shocks from the zapper all over his body in front of a bunch of onlooking neighbors. The officers carry him to the living room where he must service them by licking their boots clean and sucks their dicks while wearing a rat tail butt plug. After an intense flogging, the perv is dragged to the bedroom where he’s tied to the bed and gang fucked by many huge cocks. The officers finish up their lesson by cumming all over the coach’s face and subjecting him to cum denial as they repeatedly push him to the edge.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Ethan Hudson",
      "person_id": 29881
    },
    {
      "name": "Josh West",
      "person_id": 20861
    }
  ],
  "release_date": "2011-05-20",
  "scene_id": 12435,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "brunet",
    "Cock Worship",
    "Domination",
    "Facial",
    "Flogging",
    "Gangbang",
    "Gay",
    "Hairy",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Public",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "To Catch a Pervert",
    "top",
    "unshaved",
    "versatile",
    "Voyeur",
    "white",
    "Zapper"
  ],
  "title": "Perverted Punishment - Ethan Hudson"
}