{
  "collections": [
    "Hogtied"
  ],
  "description": "Live Show Mondays brings you part 1 of 4 of the February live show that featured Rain DeGrey, Felony and sexy co-tops Princess Donna and Isis Love. ORGASMAGEDDON is here.\nThis is part one of ORGASMAGEDDON. When we did something like this last year with just Rain, Howard Stern spent about a week on and off talking about it, and well he should have, it was not something you see everyday, or ever for that matter. Now we have added Felony to the mix, and plan on making these two girls come beyond what any sane person has ever done in their lifetime. We will make these girls cum until they either pass out, or become un-responsive, a shell or zombie if you like. We will make them come until what ever the human body does protectively or defensively to stop a person from being orgasmed to death.\nIn this installment, the girls prepare and talk to the members, telling them their fears and fantasies about what is about to happen. Then we tie the girls in such a way that, during the madness that will consume their brains, their struggling will not injure them in any way. Then we set off teasing them, not letting them come, beautiful and intense orgasm DENIAL for the first 15 minutes. The girls are begging, pleading to cum, little do they realize what they are truly asking for. The first orgasms by both girls are so intense, both girls screaming, thrashing and squirting. This is just the first, we will MAKE these girls cum over and over for the next 45 minutes. Hell has just started for these girls, a sweet beautiful Hell to be sure..",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Felony",
      "person_id": 17502
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Rain DeGrey",
      "person_id": 16817
    },
    {
      "name": "Princess Donna Dolore",
      "person_id": 5235
    }
  ],
  "release_date": "2011-04-04",
  "scene_id": 12590,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Orgasm Denial",
    "Rope Bondage",
    "Squirting",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "ORGASMAGEDDON: Part 1/4 The beginning of 2 girls who will almost literally be orgasmed to death."
}