{
  "collections": [
    "Kink Test Shoots"
  ],
  "description": "This is the event the world cried out in one voice to see, and Hogtied.com made this once in a lifetime event a histrionic reality.\nYou have never witnessed anything like this, nor will you ever again. Even your wildest imagination and dreams fall short of the reality we created when we totally destroyed Rain DeGrey and Felony with the ultimate orgasm overload, the likes of which the human race has never seen. This event will become the cornerstone that all future live events will be weighed and measured against, and they will all be found wanting.\nThis live show will go down in the annals of human history as the day the world stopped and for one collective moment everyone was stunned to the point of total disbelief. Two girls were orgasmed non-stop for about an hour at the expense of their sanity, beyond what any normal human could endure.\nHowever, these two are not normal, as they have a gift or curse, that we exploited until both girls were reduced to a the basic level of human primality. To the very edge of consciousness, to the very edge of the void, to the edge of sanity, these two were made to cum, until they lost their individuality and become something processed of another reality, a reality you will witness, but will be unable to understand.",
  "directors": [],
  "models": [
    {
      "name": "Felony",
      "person_id": 17502
    },
    {
      "name": "Rain DeGrey",
      "person_id": 16817
    },
    {
      "name": "Princess Donna Dolore",
      "person_id": 5235
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Chloe Camilla",
      "person_id": 22493
    }
  ],
  "release_date": "2011-03-14",
  "scene_id": 12701,
  "tags": [
    "Belly Punching",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Brunette",
    "Chains",
    "Destruction",
    "Domination",
    "Dominatrix",
    "Fetish",
    "Hair Pulling",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "multiple orgasms",
    "Rope Bondage",
    "Slapping",
    "Straight",
    "Submission",
    "Tattoo",
    "Vaginal Fisting"
  ],
  "title": "To the edge of consciousness, to the edge of the void, to the edge of sanity"
}