{
  "collections": [
    "The Training Of O"
  ],
  "description": "Maitresse enters and it becomes evident that dolly has had a bad day, before it even starts. dolly is apprehensive about this because she has never bottomed to a FemDomme, and knows that she is going to get a taste of her own medicine from a seasoned pro. Madeline takes control instantly and dares dolly to get out of line. No binds, except for the grasp Madeline has on dolly’s mind. After raining down on dolly’s milky skin with a single tail, Madeline puts this slut on her back and fists her for the first time ever.\n\nPrincess Donna starts the next scene with more mind fucking, and then gives dolly the ultimate test of endurance. dolly is made to use every bit of her upper body strength to avoid one of her biggest fears…electricity! She is made to hold buckets filled with water until she can’t any longer and then the fun begins when Donna introduces dolly to Her cattle prod.\n\nHow do you follow something like that? I do my best, but by the time I get to her, I can only stir the puddle of meat that they left for me. dolly proved that she has the determination to become a good submissive. She proved this by begging for the one thing she hates.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 17872
    },
    {
      "name": "Princess Donna Dolore",
      "person_id": 5235
    },
    {
      "name": "Sophie Monroe",
      "person_id": 20940
    }
  ],
  "release_date": "2011-04-22",
  "scene_id": 12763,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "Brunette",
    "Cattle Prod",
    "Corporal Punishment",
    "Discipline",
    "Electrical Play",
    "Female Slave",
    "Femdom",
    "Gimp",
    "Humiliation",
    "master",
    "mind fuck",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Single Tail",
    "slim",
    "Straight",
    "Tattoo",
    "The Pope",
    "top",
    "white"
  ],
  "title": "Day 3 - dolly meats Princess Donna and Maitresse Madeline Take Their Turn"
}