{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Season Eight Match\nSERENA BLAIR\nThe Jockey\nHT: 5'0\nWT: 105 lbs\nSeason record (0-1)\nLifetime record (0-1)TARA LYNN FOX\nThe Shortstop\nHT: 5'7\nWT: 145lbs\nSeason record (1-0)\nLifetime record (1-3)\nSerena Blair is back and once again has drawn a larger opponent. Entering just her second match up, Serena has shown great potential. She did well against Bella Rossi even after giving up almost 50lbs and a lot of experience. Serena has the stuff we look for in a great wrestler- heart and determination. Now she faces another veteran wrestler.\nTara Lynn Fox is back on the mat and looking as sexy as ever. This fun spirit loves to throw down and get physical. Tara is undefeated this season and is hoping to get a great ranking for the upcoming Summer Vengeance Tournament that starts next week!\nSerena fought well and fought hard. She scored style and even held control, however it was Tara who controlled most of the match up and came out with a tough win. This match up had great scissor holds, head locks and submission attempts. Both girls battled to the end and Tara even got fingers in Serena to add to her humiliation.\nNEXT WEEK IS THE START OF SEASON 8's SUMMER VENGEANCE TOURNAMENT, WHERE THE TOP 16 BATTLE IT OUT TO SEE WHO WILL CLAIM THE OVERALL ULTIMATE SURRENDER CHAMPIONSHIP!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Tara Lynn Foxx",
      "person_id": 20997
    },
    {
      "name": "Serena Blair",
      "person_id": 31165
    }
  ],
  "release_date": "2011-05-27",
  "scene_id": 13098,
  "tags": [
    "Anal",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Amazing back & forth action between 2 sexy combatants Sexiest nonscripted wrestling on the planet"
}