{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SUMMER VENGEANCE TOURNAMENT OF CHAMPIONS!\nSERENA BLAIR\nThe Jockey\nHT: 5'0\nWT: 105 lbs\nSeason record (0-2)\nLifetime record (0-2)\nRanked 11thMAHINA ZALTANA\nThe Moon\nHT: 5'1\nWT: 120lbs\nSeason record (0-2)\nLifetime record (0-2)\nRanked 12th\nSerena Blair is back and this time ranked 11th. Even though she did not win a match we felt she did extremely well in her fights. She is feisty and participates in extreme sports. If there is one thing Serena hates more then anything in life it is losing, and this girl will fight like a badger when cornered with losing.\nMahina has taken to our sport. She has picked up a wrestling trainer and is looking to make a name for herself at US. Look for a much different Mahina on the mat than what you are used to.\nMahina dominated early and dominated often. Her training off the mat was evident from the start. Serena was outmatched, outgunned and totally humiliated. She was further humiliated in RD4 as Mahina got bored of fucking her, tied her up with her own bands then had Isis come in.\nMahina had Isis fuck her while a bound (loser) Serena had to watch, cold and helpless on the mat. Physically Serena was fine, however mentally was another story. Serena takes frustration and losing to heart, and it will be interesting to see of she returns next season at all. We all hope she will.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Mahina Zaltana",
      "person_id": 28012
    },
    {
      "name": "Serena Blair",
      "person_id": 31165
    }
  ],
  "release_date": "2011-06-17",
  "scene_id": 13249,
  "tags": [
    "champion",
    "domination",
    "Facesitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tournament",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "12th vs 11th: 2 feisty rookies battle to see who moves forward"
}