{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SUMMER VENGEANCE TOURNAMENT OF CHAMPIONS!\nSLOANE SOLEIL\nThe Red Threat\nHT: 5'4\nWT: 114lbs\nSeason record (0-1)\nLifetime record (0-1)\nRanked 13thCHLOE CAMILLA\nThe Conqueror\nHT: 5'6\nWT: 122lbs\nSeason record (0-3)\nLifetime record (0-3)\nRanked 14th\nWelcome to the first round in the SUMMER VENGEANCE TOURNAMENT OF CHAMPIONS. The top 16 competitors of Season 8 battle in a single elimination tourney to determine the overall Season Champion! If you lose, you go home well fucked and humiliated. If you win, you move forward to face a more dangerous opponent!\nSloane Soleil only had one match this season but she looked good, fought well and was ranked 13th. What she lacks in experience she makes up for in strength and determination. Sloane is confident and definitely thinks she can take the smaller blonde who has lost every match she wrestled this season.\nChloe Camilla (0-3) has yet to taste victory in single competition. She took a long break from the season and is now back. Don't let her record fool you like it has Sloane, Chloe has been active in the Tag Team League and that experience is the fast lane to becoming competitive in a hurry.\nChloe dominates the cocky redhead from the start. Crushing leg scissors brutalize Sloane and make her submit. Chloe uses the old-school girl pin to great advantage and Sloane is helpless as Chloe's pussy finds a home all over Sloane's pretty loser face.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Chloe Camilla",
      "person_id": 22493
    },
    {
      "name": "Sloane Soleil",
      "person_id": 22611
    }
  ],
  "release_date": "2011-06-10",
  "scene_id": 13250,
  "tags": [
    "blonde",
    "champion",
    "domination",
    "Face Sitting",
    "Fingering",
    "leg scissors",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "redhead",
    "straight",
    "strap on",
    "submission",
    "tag team",
    "tournament",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "SV TOURNEY: 14th vs 13th"
}