{
  "collections": [
    "Hogtied"
  ],
  "description": "Darling, Katie Kox, and their amazing huge tits are back at Hogtied. If you have ever wondered why Hogtied is the biggest, best bondage site, on the net, wonder no more, this is something you don’t see every day.\n\nDarling is bound to the beam underneath, then suspended up by her ankles in a brutal back arch, Katie is bound to the other side of the beam spread out and pulled up to her toes. Katie’s neck is bound down, basically blinding her to all we will be doing. Both girls have their massive boobs bound. Katie’s are evilly bound and pulled tight, out and away.\n\nWe abuse both girls a bit with the flogger however the bondage itself is the real tormentor here. With Princess Donna on set, both girls are made to cum over and over. Katie, with her neck rope, is slowly losing the ability to keep herself on her toes (so she can breathe) from all the orgasms. Darling is coming so hard, that she too, is suffering from the brutal back arch as we make her cum over and over.\n\nIn the end, a double crotch rope is pulled tight between the girls and they share the same rope. The slightest movement of either makes the other suffer as the rope bites in to their poor sensitive pussies..",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Katie Kox",
      "person_id": 21378
    }
  ],
  "release_date": "2011-06-16",
  "scene_id": 13504,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Crotch Rope",
    "Domination",
    "fake boobs",
    "Fingering",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "2 girls, massive tits, bound, 1 suspended, 1 neck tied down & arched. Both made to brutally cum!"
}