{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Clothed Female Naked Male\n\n[klohthed fee-male ney-kid meyl]\n\n-noun\n\n\nOne-sided male nudity is considered a form of sexual objectification of men whereby the male assumes the subservient sex role.\n\n\nMaitresse Madeline invites Mistress Lorelei Lee and DragonLily to her theater for a little entertainment Divine Bitches Style! Barney is a Californian surfer boy who has dreamed of being dominated by three gorgeous women and now he gets his chance! This whole shoot is centered around CFNM; clothed female naked male. The objective is that Barney is denied the sexual pleasure of seeing the women in the same state of undress bringing him further into helpless submissiveness. He’s cock and balls are put in the cock stock and he’s whipped while the women cheer from the crowd. Madeline uses her teasing skills to get his cock dripping with excitement only to deny him by request from the rowdy audience. The women strap-on ass fuck Barney and spank his little ass. Then all three dominatrices join in teasing his dick and milking his prostate while he is made to lick Dragonlily’s beautiful ass and feet in a queening chair. Lorelei’s fingers dance on his hard cock while Madeline pushes all the right buttons on his prostate and commands orgasm after orgasm out of his cock. He ends up cumming without even being touched! His cock won’t stop and the girls find it hilarious ruining his orgasms and milking him raw till he can’t stand it anymore!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Barney",
      "person_id": 32452
    },
    {
      "name": "DragonLily",
      "person_id": 3433
    },
    {
      "name": "Lorelei Lee",
      "person_id": 758
    },
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 17872
    }
  ],
  "release_date": "2011-07-27",
  "scene_id": 13717,
  "tags": [
    "Asian",
    "Athletic",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "CBT",
    "CFNM",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Tattoo",
    "top",
    "white",
    "Yes, Mistress"
  ],
  "title": "Visual Sensation: CFNM FemDom Theatre"
}