{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SUMMER VENGEANCE TOURNAMENT OF CHAMPIONS!\nCHEYENNE\nThe Wrangler\nHT: 5'5\nWT: 127 lbs\nSeason record (2-0)\nLifetime record (2-0)\nRanked 6thJESSE COX\nThe Cheerleader\nHT: 5'2\nWT: 108lbs\nSeason record (2-0)\nLifetime record (4-1)\nRanked 10th\nJessie Cox is coming off her best season to date. This former Collegian athlete is undefeated this year and has her first ever tournament win under her belt. With the experience she gained during last year's tag team league with partner Dia Zerva, Jessie has increased her strength, skill and endurance immensely.\nCheyenne came late to the dance, stepping in mid-season, but this rookie brought a world of wrestling skill with her. In just her second match she destroyed a 5 year veteran and is the dark horse to watch in this year's Tournament of Champions.\nCheyenne is pure muscle and skill, and Jessie Cox never had a chance. Right from the start Cheyenne takes control and begins finger fucking Jessie into oblivion. Cheyenne open a huge can of whip ass all over Jessie in the form of multiple submission holds. From brutal Grapevines, to smothering leg scissors. Jessie even suffers in a Camel Clutch until she submits to the agonizing pain. Jessie is finger fucked, bent, crushed and broken on the mat.\nNot satisfied with turning Jessie into her personal rag doll on the mat, Cheyenne puts on a big strap on and fucks the living hell out of the loser in a great RD4. Jessie gets worked over yet again, helpless and humiliated by the superior opponent!",
  "models": [
    {
      "name": "Jessie Cox",
      "person_id": 18739
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    }
  ],
  "release_date": "2011-07-15",
  "scene_id": 13743,
  "tags": [
    "domination",
    "Face Sitting",
    "Fingering",
    "leg scissors",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "muscle",
    "pain",
    "Pussy Eating",
    "smothering",
    "straight",
    "strap on",
    "submission",
    "tag team",
    "tournament",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Brutal grapevines, Camel clutches, Crushing leg scissors destroy Jessie Cox."
}