{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SUMMER VENGEANCE TOURNAMENT OF CHAMPIONS!\nBELLA ROSSI\nThe Annihilator\nHT: 5'5\nWT: 155lbs\nSeason record (2-0)\nLifetime record (6-1)\nRanked 5thJULIETTE MARCH\nThe Centaurus\nHT: 5'1\nWT: 120lbs\nSeason record (0-0)\nLifetime record (0-0)\nRanked 16th\nJuliette March is the newest rookie we have on the roster, and a couple weeks ago won her first match against a higher ranked and extremely more experienced wrestler. Juliette is a competitive spirit who hates losing, loves winning, and is very strong and well conditioned. However, a wrestler ranked 15 is much different from a wrestler ranked 5.\nBella Rossi is the big bully of Ultimate Surrender. She loves nothing more than kicking the shit out of her opponents, smothering them with her monster breasts and crushing them into submission with her powerful legs. She taunts and plays with her opponent like a cat plays with a mouse. Bella is big, strong and uses every advantage she has on the mat. If you wrestle Bella, no matter who you are, you're in for a rough fight.\nRight off the first whistle Juliette found out that she was over matched, out gunned and in serious trouble for the next 24 minutes. Bella abused her opponent with countless submission holds, camel clutch, and brutal body scissor holds. She simply crushed the hopes and dreams out of the rookie's helpless body. Juliette was beat down, finger fucked and [REDACTED] to submit multiple times to the Annihilator! If there is one thing Bella loves doing more than almost anything, it is fucking a loser. Juliette receives a fucking she will never forget, as she is tossed around the mat like a rag doll. Bella sexually destroys the 'Centaurus' in a brutal must see round 4.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Juliette March",
      "person_id": 22072
    }
  ],
  "release_date": "2011-07-01",
  "scene_id": 13998,
  "tags": [
    "couple",
    "domination",
    "Face Sitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "smothering",
    "straight",
    "strap on",
    "submission",
    "tournament",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "16th vs 5th"
}