{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SUMMER VENGEANCE TOURNAMENT OF CHAMPIONS!\nRAIN DEGREY\nPoison\nHT: 5'9\nWT: 124lbs\nSeason record (2-0)\nLifetime record (3-4)\nRanked 8thCHLOE CAMILLA\nThe Conqueror\nHT: 5'6\nWT: 122lbs\nSeason record (0-3)\nLifetime record (0-3)\nRanked 14th\nWelcome to the Second round in the SUMMER VENGEANCE TOURNAMENT OF CHAMPIONS. The top 16 competitors of Season 8 battle in a single elimination tourney to determine the overall Season Champion! If you lose, you go home, well fucked and humiliated. If you win, you move forward to face a more dangerous opponent!\nRain DeGrey was last year's Rookie of the year/ Since then she has obtained a personal wrestling trainer and has been working hard off the mat, training for this very tournament. Rain is driven to win, hates losing and possesses brutally strong, skinny legs. You do not want to get caught inside her legs. If you do, chances are your about to submit to some brutal pain.\nChloe dominated in her last match and advanced to face off against a mid-ranked opponent. Chloe has improved exponentially after her Tag Team experience. She is fast, determined and never gives up for in even a second.\nRain got legs wrapped around Chloe early and often. As tough as Chloe is, even she could not withstand the brutal leg scissors applied to her midsection. Rain dominated the match and almost [REDACTED] Chloe to come from a brutal finger attack on her pussy during RD3. In the end Isis joins Rain in RD4 and give Chloe one of the most brutal fucks we have seen in a while.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Chloe Camilla",
      "person_id": 22493
    },
    {
      "name": "Rain DeGrey",
      "person_id": 16817
    }
  ],
  "release_date": "2011-07-08",
  "scene_id": 14044,
  "tags": [
    "Anal",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "Pain",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Last years Rookie of the year fucks up this years ranked 14th Brutal submission holds, nasty RD4!"
}