{
  "collections": [
    "Hogtied"
  ],
  "description": "Welcome to another installment of the Hogtied feature movie series. These movies are real life fantasies of the girls who appear in the films, played out in a safe and sane environment for your viewing pleasure. This month's installment is \"The Limo\" starring Princess Donna Dolore.\nRich powerful women dominate through sheer will, beauty and intelligence. They are used to getting what they want, when they want it. However, today Donna Dolore, CEO of an up and coming Internet company will find herself powerless, helpless and all alone. Someone has set her up. The betrayal runs deep, very deep; it plays into Donna's deepest darkest fantasies. Being powerless, being a sex toy, a slave to cock. Something that she cannot find in her private life. Something that speaks to the primal urges of the human psyche. Who paid for the abduction? Who set up the powerful CEO? The answer will surprise you, baffle you, and in the end, make perfect sense.\nWARNING: THIS FANTASY FEATURE MOVIE PORTRAYS VERY ROUGH SEX AND INTENSE BONDAGE, HARD ANAL AND BRUTAL FACE FUCKING. THIS CONSENSUAL FANTASY MOVIE IS NOT FOR THE FAINT OF HEART.",
  "models": [
    {
      "name": "James Deen",
      "person_id": 8935
    },
    {
      "name": "Princess Donna Dolore",
      "person_id": 5235
    }
  ],
  "release_date": "2011-08-23",
  "scene_id": 14065,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "big tits",
    "bondage",
    "brunette",
    "Corporal Punishment",
    "crying",
    "destruction",
    "domination",
    "Double Penetration",
    "female slave",
    "fetish",
    "Fingering",
    "gag",
    "hair pulling",
    "Handler",
    "humiliation",
    "Kidnapping",
    "Kink's Darkest Scenes",
    "nipple clamps",
    "nipple torture",
    "rope bondage",
    "Rough Sex",
    "sadism",
    "slapping",
    "slave",
    "smothering",
    "spanking",
    "straight",
    "submission",
    "tattoo",
    "throat fuck",
    "Vaginal Penetration",
    "whipping"
  ],
  "title": "\"The Limo\": A Hogtied Feature Movie."
}