{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Mistress Lorelei Lee\nSlave: Drake Temple\nI was fed up with slaveboys and handed the keys over to Mistress Lorelei Lee for an entire week! Mistress Lorelei Lee is a lifesaver and guest directed all my shoots that week! Upon my return I was completely amused by this video. You see, I've seen Drake Temple types before. He's the type of guy that acts \"too cool\" to be there but keeps coming back for more. Funny enough the way we found Drake Temple was because he skateboards with his hip crew out front The Armory. If his friends knew he was getting fucked like a little bitch and liking it within the walls of the castle steps that they board on the humiliation would be to much for this little pussyboy to handle. This makes every time Mistress Lorelei whips, clamps or strap-on fucks him more fun to watch! You can see his bad attitude turn into frustration over him battling his true feelings of submissiveness. I think I need to get my hands on this little pussy, bend him over my knee and give him the spanking he deserves.\nMaitresse's Evaluation\nGoals\nacceptance\ncome to terms with submissive desires\nhumiliation\nhumble slave\npleasure\nbecome useful for something\nClosing assessment\ncute bad attitude\nin over his head\nneeds total humiliation\ninteresting use of his mouth as a vibrator",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Drake Temple",
      "person_id": 31831
    },
    {
      "name": "Lorelei Lee",
      "person_id": 758
    }
  ],
  "release_date": "2011-08-31",
  "scene_id": 14181,
  "tags": [
    "Athletic",
    "BDSM",
    "blond",
    "Blonde",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "foreskin",
    "Hairy",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Spanking",
    "Straight",
    "switch",
    "the wall",
    "unshaved",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "Mistress Lorelei Lee takes over Divine Bitches for a Week!"
}