{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SUMMER VENGEANCE TOURNAMENT OF CHAMPIONS!\nRAIN DEGREY\nPoison\nHT: 5'9\nWT: 124lbs\nSeason record (2-0)\nLifetime record (3-4)\nRanked 8thARIEL X\nThe Assassin\nHT: 5'3\nWT: 109lbs\nSeason record (3-0)\nLifetime record (18-2)\nRanked 2nd\nWelcome to the second round of the SUMMER VENGEANCE TOURNAMENT OF CHAMPIONS. The top 16 competitors of Season 8 battle in a single elimination tourney to determine the overall Season Champion! If you lose, you go home, well fucked and humiliated. If you win, you move forward to face a more dangerous opponent!\nRain DeGrey was last year's Rookie of the Year, and is undefeated this season. She has been training off the mat, and is great shape. Rain has a 6 inch and 15lb advantage over her opponent and hopes to use her long legs to great effect.\nAriel X is also undefeated this season and has one thing Rain does not, an Ultimate Surrender Championship trophy on her wall. Ariel might be tiny, but this is one girl you do not want to mess with on a mat.\nAriel held nothing back. Rain was in trouble early and often from Ariel's powerful legs. Submission hold after submission hold was placed on Rain, each with devastating effect. Ariel made Rain cum on the mat and cum hard. Not only did Rain get her ass kicked by a smaller opponent, but that opponent made her cum like a whore during the wrestling. Ariel went on to further humiliate the loser with a brutal ass fucking in RD4. Ariel X moves on to the quarter finals, Rain heads home in defeat and shame.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Rain DeGrey",
      "person_id": 16817
    },
    {
      "name": "Ariel X",
      "person_id": 10464
    }
  ],
  "release_date": "2011-08-05",
  "scene_id": 14314,
  "tags": [
    "Anal",
    "Ariel X's Favorite XXX Takedowns",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Ariel makes Rain cum on the mat, goes on to brutal victory"
}