{
  "collections": [
    "The Training Of O"
  ],
  "description": "Our little trainees have been prodded, shocked, caned, tied down, made to endure mind fucks and relentless orgasms all so we could get a sense of their abilities. We have vanity, brat, o, and meow well figured out as submissives, but we are still not sure what they can do with a hard cock. Time for some sexual testing.\n\nWe throw James Deen in with the girls and see how they fare. Nothing could have prepared us for the fuck festival and depravity these gorgeous girls are capable of. One girl who refuses to service men on camera offers herself for some face fucking, two ANAL VIRGINS offer themselves for anal for the first time ever. And the most experienced whore of the group is told to grind against the wall jealously with no attention at all. We are literally in shock at the lengths these girls will go to impress their trainers.\n\nThere is not one moment of time when these tight sluts aren’t sitting on each others faces, sucking dick, taking punishment, workings cock into their ass, or squirting on the floor. Regardless of their efforts, only one trainee can get the cum.\n\nWatch to find out who it will be.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Akira Raine",
      "person_id": 31645
    },
    {
      "name": "James Deen",
      "person_id": 8935
    },
    {
      "name": "Odile",
      "person_id": 33692
    },
    {
      "name": "Rozen Debowe",
      "person_id": 13273
    },
    {
      "name": "Sofia Lauryn",
      "person_id": 32617
    }
  ],
  "release_date": "2011-09-30",
  "scene_id": 14657,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "mind fuck",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "other hair color",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Squirting",
    "Straight",
    "switch",
    "Tattoo",
    "the wall",
    "toned",
    "unshaved",
    "white"
  ],
  "title": "4 Girl Auditions Sexual Testing"
}