{
  "collections": [
    "Divine Bitches"
  ],
  "description": "For those of you who missed Maitresse Madeline's and Goddess Aiden Starr's LIVE and PUBLIC birthday bash you will wait no more! This is the third LIVE and PUBLIC femdom party Madeline has hosted and by far the best! This version is edited straight to all the best footage of the wild and crazy night! 40 women join Maitresse Madeline, Goddess Aiden Starr, Mistress Lorelei Lee and Mistress Gia Dimarco along with 3 muscle bound slaveboys for a night of total femdom debachery. All of the women participate with whipping, spanking, humiliation, CBT, foot worship, ass worship and a strap-on anal gang-bang with 40 women! At the end of the night the birthday girls and their best friends use their pleasure slave. Each of them fucking him and milking his prostate until he can barely hold his fat load inside! This is one femdom extravaganza you DON\"T want to miss! The full unedited version of this shoot is available streaming by clicking on the live show link.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Parker London",
      "person_id": 22006
    },
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Dutch Bardoux",
      "person_id": 30063
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "DJ",
      "person_id": 20225
    },
    {
      "name": "Lorelei Lee",
      "person_id": 758
    },
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 17872
    }
  ],
  "release_date": "2011-09-28",
  "scene_id": 14724,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "CBT",
    "Corporal Punishment",
    "dominatrix",
    "Facesitting",
    "femdom",
    "Fingering",
    "foot worship",
    "humiliation",
    "Male Sub",
    "muscle",
    "orgasm denial",
    "Pegging",
    "Prostate Stimulation",
    "public",
    "Pussy Eating",
    "Reverse Gangbang",
    "Rough Sex",
    "slave",
    "spanking",
    "straight",
    "whipping"
  ],
  "title": "The most intense public FemDom pajama party ever!"
}