{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SUMMER VENGEANCE TOURNAMENT OF CHAMPIONS!SEMI-FINALS\nCHEYENNE\nThe Wrangler\nHT: 5'5\"\nWT: 127lbs\nSeason record (2-0)\nLifetime record (2-0)\nRanked 6thARIEL X\nThe Assassin\nHT: 5'3\"\nWT: 109lbs\nSeason record (3-0)\nLifetime record (18-2)\nRanked 2nd\nThis is a brutal SEMI-FINAL match up. The winner goes on to the Championship, the loser gets fucked and sent home for the season. It's all or nothing. Which wrestler wants it more, who came better prepared, who is going to get fucked like a common slut for losing? It all comes down to this.\nCheyenne Jewel is a rookie to Ultimate Surrender but not to wrestling. She is a competitive wrestler, trains off the mat and takes this sport very seriously. She was undefeated this season, easily besting her opponents.\nAriel X is also undefeated this season and has one thing Cheyenne can only dream of, an Ultimate Surrender Championship. Ariel studies in multiple forms of grappling techniques off the mat and is in a gym 5 times a week.\nCheyenne never had a chance, Ariel was too powerful, too fast, and too determined. Cheyenne felt the fingers in her pussy early and often. Ariel's legs trapped, crushed and even [REDACTED] Cheyenne to submit. Another brutal RD 4 as Ariel X fucked and humiliated Cheyenne all over the mat. Cheyenne was nothing but a rag doll compared to the brutal power of the ASSASSIN!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    }
  ],
  "release_date": "2011-08-26",
  "scene_id": 14840,
  "tags": [
    "Anal",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "tournament",
    "Vaginal Penetration",
    "workitout",
    "Wrestling"
  ],
  "title": "Semi-Final match up: Loser is totally dominated, finger fucked, & leg scissored into submission."
}