{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Mistress Gia Dimarco\nSlave: Jesse Carl\n\nJesse Carl has always been a slave with a cocky attitude and a smirk on his face. He doesn’t say much but his feelings are written all over his face. For his third day training with the Divine Bitches I found it best to stick him with our newest bitch Gia “The Rebel” Dimarco. Gia is a rebellious renegade type of chick who can dish it out like you’ve never seen before. All of this bad ass coming from a petite hard bodied package any man would die to have a piece of. Jesse has his balls tied tight, receives an OTK spanking and is totally teased with no mercy with Gia’s hot body. As if that’s not enough like you have never seen on Divine Bitches before Gia milks Jesse’s prostate so hard he cums without her ever touching his cock once! She then uses his cock for her pleasure riding his dick till she squirts like a bitch in heat. Jesse begs to cum again like a greedy whore but Gia has other plans for his cock.\n\nJesse Carl has decided to leave porn! We will see how long he can stay away from The Bitches!!\n\nMaitresse’s Evaluation\nGoals\n\n\nhumble\nwipe the smirk off his face\n\n\nprostate milking\ncum without any cock stimulation\n\n\npleasure\ngive orgasms to mistresses selflessly\n\n\n\nClosing assessment\n\n\ncould still use some attitude adjusting but see improvements\n\namazing control of prostate and anal abiities\n\nvery receptive to male G spot play\n\neager to service a woman’s ass but still much too messy and impatient\n\nable to use as a pleasure slave needs to stop thinking of his own needs",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Jesse Carl",
      "person_id": 29074
    }
  ],
  "release_date": "2011-09-07",
  "scene_id": 14855,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Tits",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Cage",
    "CBT",
    "cock and ball torture",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Flogging",
    "Foot Worship",
    "High Heels",
    "Hitachi",
    "Humiliation",
    "Lingerie",
    "Male Sub",
    "Orgasm Denial",
    "OTK",
    "Pegging",
    "Petite",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rimming",
    "Rough Sex",
    "shaved",
    "Shrimping",
    "Slapping",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Gia FUCKING Dimarco gives a prostate milking so intense you have to see it to believe it!"
}