{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Whipped Ass Presents is proud to introduce The Debasement Of Lori Lansing, our first high production feature film. This sordid tale features pornstar Hall of Famer Julia Ann as Lori Lansing, a devastatingly sexy sex starved step-mom and Rachel (Gia Dimarco) her spoiled co-ed art snob step daughter. Lori finds herself neglected and vulnerable when Frank, Rachel's dad, suggests Lori to visit her at the art academy. College is more then meets the eye and Rachel and her crew of perceived high brow art aesthetic followers are more busy one upping each other with their lesbian escapades then to worry about whether Matisse or Caravaggio had the better brush stroke. Lori finds herself caught in a scandalous triangle where manipulative seduction, hardcore lesbian sex, BDSM and punishment is just another notch in the belt and one more rung in the social clique ladder. This is skillfully shot in high definition with great acting and includes an intense all girl strap-on double penetration gang bang!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Sofia Lauryn",
      "person_id": 32617
    },
    {
      "name": "Missy Minks",
      "person_id": 27930
    },
    {
      "name": "Akira Raine",
      "person_id": 31645
    },
    {
      "name": "Julia Ann",
      "person_id": 32896
    }
  ],
  "release_date": "2013-12-26",
  "scene_id": 15027,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Dominatrix",
    "Double Penetration",
    "Facesitting",
    "Female Slave",
    "Femdom",
    "Fingering",
    "Gangbang",
    "Hitachi",
    "Humiliation",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "Orgy",
    "Pussy Eating",
    "Rope Bondage",
    "Slave",
    "Small Tits",
    "Smothering",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "Whipping"
  ],
  "title": "Classic Archive: The Debasement Of Lori Lansing: A Whipped Ass Feature Presentation Starring Julia A"
}