{
  "collections": [
    "Hogtied"
  ],
  "description": "Welcome to another installment of the Hogtied feature movie series. These movies are real life fantasies of the girls who appear in the films, played out in a safe and sane environment for your viewing pleasure. This month's installment is \"Into The Darkness\" starring Rylie Richman.\nIn the fall of 2005 a small Berkeley college was accepting new pledges to their sorority. Rylie Richman was 20yr old transfer student from a prestigious southern College. Wanting to fit in, she pledged the most popular Sorority on campus.\nAll she needed to do was spend one night in the Historical Armory building on Mission Street in San Francisco. One simple night and she would be in the coolest Sorority in all of the East Bay. With her flashlight, candles, pillow and blankets, she snuck in through a side entrance.\nTwo weeks later Riley was found alone and wandering the Streets of the Tenderloin. No memory of the previous two weeks, no memory of the events that transpired that night she stole into the Armory on Mission Street...",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Audrey Rose",
      "person_id": 31792
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Mark Davis",
      "person_id": 8200
    },
    {
      "name": "Rain DeGrey",
      "person_id": 16817
    },
    {
      "name": "Rylie Richman",
      "person_id": 32146
    }
  ],
  "release_date": "2011-09-27",
  "scene_id": 15181,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Cage",
    "Corporal Punishment",
    "Domination",
    "Extreme Torment",
    "Facefucking",
    "Fetish",
    "Fingering",
    "Hair Pulling",
    "Handler",
    "Hitachi",
    "Hood",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "Mask",
    "Nipple Torment",
    "Pierced Pussy",
    "Role Play",
    "Rope Bondage",
    "Slapping",
    "Small Tits",
    "southern",
    "Spanking",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Whipping"
  ],
  "title": "\"Into The Darkness\": A Hogtied Featured movie. A fantasy BDSM abduction movie starring Rylie Richman"
}