{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SUMMER VENGEANCE TOURNAMENTSEASON 8 CHAMPIONSHIP MATCH\nARIEL X\nThe Assassin\nHT: 5'3\nWT: 109lbs\nSeason record (3-0)\nLifetime record (18-2)\nRanked 2ndBELLA ROSSI\nThe Annihilator\nHT: 5'5\nWT: 155lbs\nSeason record (2-0)\nLifetime record (6-1)\nRanked 5th\nThe entire season comes down to one brutal match. 24 solid minutes of un-scripted sexual wrestling. The only site in the world with real sex wrestling. The only site in the world with a non-scripted format that leads to one overall season champion. The biggest, most popular girl wrestling site on the net! Ultimate Surrender, no other site compares!\nAriel X (18-2) is a 6 season veteran. She has won 2 featherweight Championships, a lightweight Championship and 1 overall Ultimate Surrender Championship! Today she is wrestling for her second US Championship, a feat no other wrestler in the history of the site has accomplished. To win today she will need to overcome a girl who is experienced, has 2 inches and 45lbs on her. Can she do what no one before her has ever done and win a second title?\nBella Rossi (6-1) is a 3 season veteran of the site. Today she is wrestling for her first ever Ultimate Surrender Championship. Bella is big, strong and knows how to push around little opponents. This is her first time in the Championship round, and she plans on making her first time count. There is no surrender in this girl, and she uses every advantage she has to win a match. Bella is one of the most feared wrestlers on the roster and for good reason.\nThis match had everything you would expect from a Championship match. Submissions, finger fucking, tears, pure determination to win, it was an all out 24 minute war from hell. One girl took it all home, one girl got fucked and humiliated as a loser in a dirty bathroom.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Ariel X",
      "person_id": 10464
    }
  ],
  "release_date": "2011-09-02",
  "scene_id": 15238,
  "tags": [
    "Anal",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "SEASON 8 CHAMPIONSHIP MATCH: Ariel \"The Assassin\" X vs Bella \"The Annihilator\""
}