{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the beginning of SEASON NINE!\nIONA GRACE\nTenacious DD\nHT: 5'3\nWT: 114lbs\nSeason record (0-1)\nLifetime record (0-1)EMMA HAIZE\nThe Haizer\nHT: 5'4\nWT: 92lbs\nSeason record (0-0)\nLifetime record (0-3)\nWelcome to the start of a new season. Season Nine of Ultimate Surrender is upon us. New wrestlers, new rivalries, forgotten faces, and a brand new race to crown a champion.\nIona Grace finished Season 8 ranked 15th, she had only one match up in single competition but was very active in the Tag Team league. She is looking for her first win in single competition. Iona is in great shape and should have picked up valuable experience in the Tag Team league.\nEmma Haize is back for a new season. Last season she was 0-3 and did not make the top 16 to get into the tournament. This year she comes in even lighter. The one thing that impresses everyone who watches this girl wrestle is her determination. She never gives up, she wrestles hard to the end no matter what the score.\nIona's experience and size and tenacious double-D's won the day. Emma gave it all she had, but could not overcome the strength and experience of Iona. Submission holds, head locks, grape vines, and crushing leg scissors were just some of the hell Emma endured in her loss. Iona gave a good ass fucking to the loser in RD4. If you lose at this sport, you're going to get humiliated and fucked like a whore on the mat.Ultimate Surrender the only non-scripted real wrestling league on the net.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Iona Grace",
      "person_id": 25204
    },
    {
      "name": "Emma Haize",
      "person_id": 29618
    }
  ],
  "release_date": "2011-09-16",
  "scene_id": 15349,
  "tags": [
    "Anal",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "2 veterans w/o a win battle for their first singles victory"
}