{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SEASON NINE BEGINS TODAY!\nRAIN DEGREY\nPoison\nHT: 5'9\nWT: 124lbs\nSeason record (0-0)\nLifetime record (3-4)HOLLY HEART\nThe Honey Badger\nHT: 5'6\nWT: 135lbs\nSeason record (0-0)\nLifetime record (1-5)\nWelcome to the start of a new season. Season Nine of Ultimate Surrender is upon us. New wrestlers, new rivalries, forgotten faces, and a brand new race to crown a champion.\nRain DeGrey was Season 7's Rookie of the year. Since then she has obtained a personal wrestling trainer and has been working hard off the mat. Rain finished Season 8 ranked 7th. She is strong, determined, and has great endurance. If you wrestle Rain you are in for a very tough, full 24 minutes of hard work. She will shit talk you the very second she gains an upper hand, and will fuck the living shit out of you if you lose. Rain is a seasoned veteran and a [REDACTED] to reckon with at Ultimate Surrender.\nHolly Heart is back! After disappearing off of the face of the earth for a year, Holly is back with a new nickname and attitude. Holly is one of the strongest wrestlers on the roster with legs of steel. The only thing stopping Holly from the next level is her endurance. If this girl ever increases her cardio so she can go all 24 minutes at 100%, we might have a new ultra elite wrestler\nThis was a great back and forth match up. Both giving and receiving some brutal holds. In the end it was endurance and conditioning that won out over strength. Rain wore down the \"Honey Badger\" and brutalized her on the mat. Smack talking and a deep punishing ass fucking is what Holly got her first match back at US. Rain gets the win and the number one ranking, or now..",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Holly Heart",
      "person_id": 20472
    },
    {
      "name": "Rain DeGrey",
      "person_id": 16817
    }
  ],
  "release_date": "2011-09-09",
  "scene_id": 15350,
  "tags": [
    "Anal",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "START OF SEASON 9 Nasty leg scissors, head locks & submissions, loser gets brutally ass fucked!"
}