{
  "collections": [
    "Kink Test Shoots"
  ],
  "description": "The Merriwood Psychiatric Program is committed to provide high quality, cost-effective psychiatric treatment for inmates within the California Department of Corrections. To achieve this we hold close to our motto of Co-operation, Communication and Compliance. Privately owned, Merriwood Hospital will continue to develop state-of-the-art treatment programs while guaranteeing minimal costs to the California taxpayer.\nDr. Helen Grossman, Executive Director of Merriwood Hospital\nPsych Ward 93 is a test shoot for a scripted Women-In-Prison/ Medical Fetish series starring Isis Love as Paula Jordan, a cop who goes undercover to investigate the disappearance of a Senator's daughter. Also featuring Princess Donna as Dr. Helen Grossman, Dana Vixen as Head Nurse Sandoval, and The Williams as Dr. Frank Metzger.\nHistory (taken from Wikipedia):\nFounded by Bertram Merriwood as a Home For Unwed Mothers, 1881-1912; The home is closed after horrific crimes of abuse shock the nation. The State of California re-opens the facility as the Merriwood State Hospital 1914-1952; becomes a Women-only facility, 1952. Closed in 1994. Re-opens as a privately-owned facility contracted by the State Dept. of Corrections, 1998-present. Rumors of torture and abuse continue to plague the hospital, but no evidence has ever been brought before a court.",
  "directors": [
    {
      "name": "Malcolm",
      "person_id": 36769
    }
  ],
  "models": [
    {
      "name": "Emma Haize",
      "person_id": 29618
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Maestro",
      "person_id": 11928
    }
  ],
  "release_date": "2011-11-04",
  "scene_id": 15584,
  "tags": [
    "BDSM",
    "Big Ass",
    "Big Natural Tits",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Choking",
    "Cop",
    "Corporal Punishment",
    "Discipline",
    "Doctor",
    "Domination",
    "Facefucking",
    "Femdom",
    "Fetish",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Leather Cuffs",
    "Leather Gloves",
    "Lesbian",
    "LezDom",
    "Medical Fetish",
    "Metal Bondage",
    "Nipple Torment",
    "Nurse",
    "Oral Sex",
    "Pain",
    "Pain Slut",
    "Role Play",
    "Shackle",
    "Slapping",
    "Small Tits",
    "Spanking",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo"
  ],
  "title": "Psych Ward 93"
}