{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "ULTIMATE SURRENDER SEASON NINE!\nMAHINA\nThe Moon\nHT: 5'1\nWT: 125lbs\nSeason record (1-0)\nLifetime record (1-2)SOFIA\nThe Leopard\nHT: 5'7\nWT: 145lbs\nSeason record (0-0)\nLifetime record (0-0)\nWith the loss of 3 elite wrestlers this season, we are grooming what we hope is the next generation of talent. Mahina is one that we hope can step up to the next level. She loves this sport, she trains off the mat and takes wresting very seriously. The same behavior we have seen in past elites.\nWelcome Sofia Lauryn to Ultimate Surrender. Sofia is making the jump from Kink Live cam girl to wrestler. Sophia is tall, strong, and solid, a bit of a bully. She thinks her size and strength can win the day. She will soon find out that experience trumps size and weight any day.\nMahina gave up 6 inches and 20 lbs. Her experience and training off the mat was the difference in this match up. Sofia was determined not to give in or up for even a second. Even when Mahina got fingers up inside Sophia, she never gave into it. Sofia found out the hard way what RD 4 is like on Ultimate Surrender - a lesson she will not soon forget.\nUltimate Surrender is a real, non-scripted, dangerous sport. Any girl who gets on this mat deserves our respect and admiration. They are the elite of the porn industry the toughest of the tough.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Mahina Zaltana",
      "person_id": 28012
    },
    {
      "name": "Sofia Lauryn",
      "person_id": 32617
    }
  ],
  "release_date": "2011-10-14",
  "scene_id": 15765,
  "tags": [
    "Anal",
    "blond",
    "Brunette",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "Redhead",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Hot Island girl takes on big blond bully. Blond bully gets her ass kicked, then brutally fucked."
}