{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "ULTIMATE SURRENDER SEASON NINE!\nJESSIE COX\nThe Cheerleader\nHT: 5'2\nWT: 109lbs\nSeason record (0-0)\nLifetime record (4-1)\nKAYLEE\nThe Comet\nHT: 5'7\nWT: 115lbs\nSeason record (0-0)\nLifetime record (0-0)\nJessie Cox is back for her 3rd season at Ultimate Surrender. This former cheerleader is high energy, high octane. She has lost only one regular season match in her entire career. Jessie is pound for pound one of the toughest girl on the roster.\nWelcome Kaylee Hilton to Ultimate Surrender. This smoking hot blond has an amazing body. Kaylee saw Ultimate Surrender and asked us if she could wrestle. This girl is not afraid of hard work or getting roughed up.\nAs you would expect the veteran dominates the match. Jessie gets her strong legs wrapped around Kaylee's skinny body often. However the tough and scrappy Kaylee took everything Jessie could through at her and kept fighting back. It's fun to hear Kaylee moaning like a whore as Jessie finger fucks her while stuck in a classic [REDACTED] pin. Kaylee will make a fine addition to the roster.\nRD4 had Jessie brutally fucking Kaylee's pussy and ass, then making her cum over and over with a vibrator. However that wasn't the end of it, Jessie picked up Kaylee by the hair and pulled her over to suck a hard cock. Kaylee was left on the mat beaten, fucked and with cum all over her face. Losing is not recommended at Ultimate Surrender.",
  "models": [
    {
      "name": "Kaylee Hilton",
      "person_id": 31754
    },
    {
      "name": "Jessie Cox",
      "person_id": 18739
    }
  ],
  "release_date": "2011-10-07",
  "scene_id": 15814,
  "tags": [
    "domination",
    "Face Sitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "Vaginal Penetration",
    "vibrator",
    "wrestling"
  ],
  "title": "2 blonds battle to see who gets 2 fuck the other. Brutal scissor submissions, headlocks & grapevines"
}