{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "ULTIMATE SURRENDER SEASON NINE!\nLYLA STORM\nThe Jaguar\nHT: 5'8\nWT: 120lbs\nSeason record (0-1)\nLifetime record (0-1)TIA LING\nJADE\nHT: 5'1\nWT: 100lbs\nSeason record (0-0)\nLifetime record (5-3)\nLyla Storm is back! Since her first match against Ariel X, Lyla has gotten a tag team under her belt and now has experience to draw upon. Tall and lanky gives a moderate advantage over smaller wrestlers, if you can use those long legs and greater reach. Lyla is still a rookie and Tia is here to remind her of that very fact.\nTia Ling is back after a very successful maternity leave. Lets welcome back our very own sexy ass-kicking Mom. Tia has been away from the mat for about a year. What has she forgotten? Will she be more timid? Has she lost her endurance? These are all valid questions that are about to be answered with deeds not words.\nIf any one ever doubted the age old saying that experience will win against size, doubt it no more. Our returning veteran gave up 7 inches and 20lbs to the rookie. All that mattered for nothing. Tia dominated early and brutally. Multiple submission holds, body and neck scissors. Crushing legs and fingers in the pussy was what the rookie faced. The fingers took the biggest toll on the rookie. Its hard to put up a fight when you're trying your best not to cum like a whore during wrestling. Welcome back Tia!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Lyla Storm",
      "person_id": 33882
    },
    {
      "name": "Tia Ling",
      "person_id": 17361
    }
  ],
  "release_date": "2011-11-11",
  "scene_id": 15813,
  "tags": [
    "Anal",
    "Asian",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Veteran destroys rookie Brutal submission holds, finger fucking, scissor locks, Loser is fisted!"
}