{
  "collections": [
    "Whipped Ass"
  ],
  "description": "This storyline was a request made by a member named yooli. Thanks, yooli for the suggestion! Also, the long awaited female chastity update requested by many members is also included! Enjoy!\nWhat happens when you are too perfect? A fall from grace? Sarah Shevon is perfect in every way everyday of her life. Everything needs and has to be just so until she meets a women who turns her world upside down. She's introduced to lesbian sex and her life is changed forever. She can't get her out of her mind.\nBeing type A and a bit sheltered, her mind wanders and she starts to have crazy dreams about what people would think if they found out a perfect angel such as herself was wrapped up into the darker side of sex. Her dreams continue to get deeper and darker and the humility is almost to much to bear. But that doesn't stop her mind from wandering to the darkest loneiest spot it can find. Female chastity, finger banging, pussy licking, spanking, flogging, nipple torture, orgasm denial, lesbian cuckolding and strap-on anal sex are all included!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Kelly Divine",
      "person_id": 21690
    },
    {
      "name": "Sarah Shevon",
      "person_id": 19605
    }
  ],
  "release_date": "2012-01-20",
  "scene_id": 16657,
  "tags": [
    "Anal",
    "BDSM",
    "Bear",
    "Blonde",
    "Bondage",
    "Brunette",
    "Chastity Play",
    "Corporal Punishment",
    "Cuckolding",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Nipple Torment",
    "Orgasm Denial",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "white"
  ],
  "title": "Lezdom Chastity Cuckold"
}