{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "**ULTIMATE SURRENDER SEASON NINE!\n**\n\nDARLING\nThe Grappler\nHT: 5’4”\nWT: 130 lbs\nSeason record (0-0)\nLifetime record (18-5)\n\nCHARISMA\nThe Animal\nHT: 5’2\nWT: 115lbs\nSeason record (0-0)\nLifetime record (0-0)\n\nDarling is back on the mat in single competition. Darling is one of Ultimate Surrender’s most skilled wrestlers and is a 7 season veteran with 18 victories in regular season match ups. She is fast, brutal and knows how to destroy rookies without hurting them.\n\nWelcome Charisma Cappelli to Ultimate Surrender. This sexy former collegian softball player is athletic, fast, strong and beautiful. A deadly combination, however she lacks mat experience. Her nickname on the softball field was “the Animal” and it carries over today as Charsima steps on the mat for her first, but not her last Ultimate Surrender appearance.\n\nDarling dominates the former athlete with ease. Hold after hold, Darling controls the helpless rookie. From brutal submission holds to finger fucking, from back breakers, pile drivers, to head locks, body scissors, chin locks and more. Charisma moans like a whore on Thanksgiving while Darling finger fucks her early and often.\n\nRound 4 is hot as Darling and then Isis strap on and give this rookie a proper dick down worthy of Ultimate Surrender. We look forward to Charisma’s return.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Charisma Cappelli",
      "person_id": 36230
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2011-11-18",
  "scene_id": 16672,
  "tags": [
    "Anal",
    "Athletic",
    "Big Tits",
    "Blonde",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "thanksgiving",
    "toned",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "2 big titted blonds battle in non-scripted wrestling. Submission holds, face sitting, finger fucking"
}