{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to Tag Team Tuesdays. Totally non-scripted, all in front of a live audience, all broadcast live to members. Today's update is RD 4 of 4. This was October's live match now edited for your enjoyment!\nPrincess Donna jumps out of the audience, Isis Love straps it on and the two losers are now getting brutally fucked and fisted by 4 girls. It's 4 on 2. A massive 6-girl orgy and the losers are getting destroyed sexually in front of a live crowd.\nBoth losers are made to deep throat as they are brutally fucked by the best! The losers get fisted, are made to squirt, and then feel the sting of humiliation that only Ultimate Surrender, with it's live audience, can deliver. Gia DiMarco has so many fists in her little pussy she almost forgets her name. Isis Love with her fist up to the wrist in Gia's pussy \"drives\" Gia around the mat. steering her internally, making her crawl and cum like a dog.\nGia lives up to her wrestling name \"The Fountain\" as she squirts so often and so much the well dries up and all Gia can do is scream as orgasm after orgasms is fisted from her tiny body.\nThis is one of the most intense brutal RD4's we have ever filmed!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Serena Blair",
      "person_id": 31165
    },
    {
      "name": "Emma Haize",
      "person_id": 29618
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Lyla Storm",
      "person_id": 33882
    }
  ],
  "release_date": "2011-11-22",
  "scene_id": 16900,
  "tags": [
    "domination",
    "Face Sitting",
    "Fingering",
    "fisting",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "orgy",
    "Pussy Eating",
    "squirting",
    "straight",
    "strap on",
    "submission",
    "tag team",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "6 girl massive orgy fisting gang bang from hell"
}