{
  "collections": [
    "Wired Pussy"
  ],
  "description": "For years electricity has been on Cherry Torn's no-list. Meaning, under no circumstance is anyone allowed to use it on her during a shoot. However, today Cherry has given up full and complete control to Bobbi Starr and her assortment of familiar and exotic electric BDSM implements. Luckily, Bobbi is more than willing to show sweet Cherry what it means to be under the thumb of a hardcore dom and is ready to educate Cherry in new heights of pleasure and new lows in submission.\nBobbi starts off with her own twist of electro sex, putting Cherry in a cage that's wired to spark when she reaches for a vibrator, while her pussy's also hooked up to electricity. That initial introduction to the rough stuff might be too much for some, however, Cherry squirms on and continues her education in lesbian bondage and electro BDSM. Bobbi fucks her with the Samurai, as sticky pads are on Cherry's ass cheeks hooked up to a nine volt box and clover clamps, live with electricity, dangle from the nipples topping her all-natural tits. She learns that for an ounce of pleasure, there's hell to pay in the delicious second go-around.\nClass concludes with Bobbi applying the Violet Wand all over Cherry's body then has her compare and contrast with the Zapper. Though she's no expert, Cherry gets into a groove from the give and take involved with Mistress Bobbi. Before sending her on her way to further her studies as a good sub, Bobbi offers a little extra credit in the way of the Electro Strap-On, giving Cherry a ride her exhausted body won't soon forget.",
  "models": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    }
  ],
  "release_date": "2011-12-29",
  "scene_id": 17596,
  "tags": [
    "lesbian",
    "bondage",
    "violet wand",
    "cage",
    "clover clamps",
    "submission",
    "bdsm",
    "electricity",
    "Cherry Torn"
  ],
  "title": "A Test in Electro Sex for Cherry Torn"
}