{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Stefanos introduces slave pistol to the Sunday brunch crowd, groping her naked body and making her crawl across the table to display herself. Though she has a reputation as an excellent sex slave, pistol is made to place her head under the table top and allow her holes to be violated by another slave before she will be deemed worthy for use by a guest. Slutty slave tramp is more than happy to fuck pistol mercilessly with a strap on while the guests cheer.\n\nOnce the party moves into the lounge, real life D/s couple Alpha and omega get into a deep disciplinary scene in which omega is reduced to sorrowful apologies while Alpha corrects her with a strict paddling and a tazer. Hot little bonnie gets horny and curious about the upper floor fucking machine, and soon finds herself cumming uncontrollably with the machine on high. Josh and pynki enjoy the finer points of the violet wand, fucking pynki with a glowing hot electrical wand and making her lick her juices off. The afternoon concludes with mickey mod shoving his cock down nerines throat and using his belt to hold her tight against him.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Beretta James",
      "person_id": 33659
    },
    {
      "name": "Dylan Ryan",
      "person_id": 10069
    }
  ],
  "release_date": "2012-04-13",
  "scene_id": 17895,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "brunch",
    "Corporal Punishment",
    "Couple",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Humiliation",
    "master",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "Paddle",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Tattoo",
    "Threesome",
    "top",
    "Violet Wand",
    "white"
  ],
  "title": "Stefanos' Brunch"
}