{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Ash has spent months in relative chastity after a serious misstep. For 3 months she has been denied any cock while in service to The Upper Floor, and must approve all her sexual ventures with her Master, The Pope. After she takes her final punishment, brutal shock therapy and humiliation, she is handed to Marco Banderas to be used as a fuck doll and cum rag. Ash is simply delighted to remember the privilege of providing sexual service for the House.\nMeanwhile, house slave kaos is put through a test to see if she may become the next slave consort. While she may be exhibiting fine training, house slave tramp's self control is in question after she squirts all over ash's face because all the fucking has her so excited. She is placed on a fucking machine with Marco's cock inches from her lips and slave ash's mouth latched onto her pussy. Can she resist squirting again, or will the rug and her reputation lay in ruins?\nAll of this debauchery has the guests in an excited state, and some of the house favorites take off their clothes and get dirty. It is Pynki's 25th birthday and her Master places her on the sybian for a brutal 25 orgasms. Many women are intrigued by the sybian and allow the Steward to place them for their first ride on the most powerful vibrator. Several beautiful slaves are bound in tight suspensions and detailed shibari, obediently take intense whippings, and have their throats and holes fucked for the camera. This party is the ultimate celebration of obedience, restraint, and sex.",
  "models": [
    {
      "name": "Skin Diamond",
      "person_id": 31494
    },
    {
      "name": "Krysta Kaos",
      "person_id": 25624
    },
    {
      "name": "Dylan Ryan",
      "person_id": 10069
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2012-03-02",
  "scene_id": 17892,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "Chastity",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "humiliation",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "squirting",
    "straight",
    "suspension",
    "sybian",
    "The Pope",
    "vibrator",
    "whipping"
  ],
  "title": "Restriction Lifted"
}