{
  "collections": [
    "The Training Of O"
  ],
  "description": "Bobbi is here to show 010 some humility. 010 is known for being one of the most athletic models at Kink.com. She is fit and trained in MMA, so she knows how to defend herself. Bobbi starts by making her stand there and be physically pushed around. Her face shows frustration as she is shoved and when Bobbi sees this she takes 010 to the ground and climbs on top of her. She then rains down brutal and sadistic punishment. 010 attempts to defend herself, but the point of this is to show submission.\nNow suspended in a hogtie, she is defenseless against Bobbi and her massive strap on cock. 010 has a high opinion of her ability to suck cock, so Bobbi puts her to the test. It's quickly apparent that she does not live up to her said ability. After toying with her for a bit Bobbi fucks her in to oblivion, pushing her closer and closer to an exploding orgasm, only to deny her in the end.\nBobbi moves on to test her pain management by abusing her pussy while she is bound in a pile driver position. Flogging, slapping, clamps and the cattle prod are used to tenderize her pussy. More foot torment is issued and then Bobbi sadistically tortures her body with a cattle prod until 010 proves her toughness by taking the cattle prod to her pussy. She is now allowed to cum as much as she wants with Bobbi's fist inside of her abused pussy.",
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    }
  ],
  "release_date": "2012-04-13",
  "scene_id": 17964,
  "tags": [
    "anal",
    "Ariel X",
    "athletic",
    "bdsm",
    "bondage",
    "cattle prod",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "fisting",
    "flogging",
    "Gimp",
    "humiliation",
    "lesbian",
    "master",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "slapping",
    "slave",
    "straight",
    "strap on",
    "submission"
  ],
  "title": "Lesbian Slave Training Ariel X"
}