{
  "collections": [
    "The Training Of O"
  ],
  "description": "Applicant Profile\n\nWeight:\n105 lbs.\nMeasurements::\n32-24-34\nHeight:\n5’5’’\n\nFears:\nName calling, degradation, electricity, and failure\n\nStrengths:\nStamina, composure, and pain endurance\n\nWeaknesses:\nEmotionally labile, easily distracted, and is verbally quiet\n\nTrainee ID:\n004.\n\nObservations:\nShe seems eager to please and is excited to be trained, but lacks confidence. Also, she seems very nervous, which causes fidgeting and a lack of conviction when answering questions.\n\nRecommendations:\nSadistic tests of her pain tolerance level to see how she processes pain, as well as how her composure is during said testing. Find out what her reservations are about electricity and work to overcome her fear of it. Work on building her confidence and focus.\n\nThe Queen of sadistic torment has arrived to assist in finding 004’s limits. 004 is inspected by Aiden and it’s easy to see she admires 004’s beauty. The one disadvantage to our trainee, is that Aiden will not be swayed by her beauty, and makes that clear instantly.\n\n004 is statuesque with her composure so far and we want to find what it takes to change that. We want to break her down, so that we can build her back up the way we want her, which is a well trained slave.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Beretta James",
      "person_id": 33659
    }
  ],
  "release_date": "2012-02-10",
  "scene_id": 17971,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Discipline",
    "Electrical Play",
    "fake boobs",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "mixed",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "Training Beretta James Day 2 Processing the Pain to Become a True S&M Slave"
}