{
  "collections": [
    "Electrosluts"
  ],
  "description": "Competitiveness weeds out the wheat from the chaff in any profession. If you’re complacent and comfortable, you’ll let your skills stagnate and ambition will atrophy. There’s always openings for new Dommes at Electrosluts and I pit two would-be Tops in a battle royale for the opening.\n\nThe rules: they both have access to the same electrosex equipment, the same restraints and they will be judged on their creativity, ability and skill to restrain the sub and talent to make her submit.\n\nIn one corner, I have Lorelei Lee, aka “The Veteran.” In the other, Sinn Sage, or “The Underdog.” In the middle of The Competition (as I like to call it), Kristina Rose, the submissive test bed for their dark creativity. Sinn has first crack at Kristina, then Lorelei Lee shows off her chops.\n\nKristina proves herself to be a tough sub to crack for both Sinn and Lorelei, this is The Competition, after all. However, rules don’t stop the two determined would be Eletrosluts Dommes from making their mark on Kristina. Watch and see what happens when two hot-headed Dommes are pushed competitively and how they make their sub submit.",
  "directors": [],
  "models": [
    {
      "name": "Kristina Rose",
      "person_id": 20560
    },
    {
      "name": "Lorelei Lee",
      "person_id": 758
    },
    {
      "name": "Sinn Sage",
      "person_id": 19154
    }
  ],
  "release_date": "2014-03-27",
  "scene_id": 18139,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Brunette",
    "Cattle Prod",
    "Corporal Punishment",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "Femdom",
    "Humiliation",
    "Latinx",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "Tens Unit",
    "white",
    "Zapper"
  ],
  "title": "The Competition: An Electrosluts Reality Film"
}