{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "ULTIMATE SURRENDER SEASON NINE!\n**\n**DARLING\nThe Grappler\nHT: 5’4”\nWT: 130 lbs\nSeason record (1-0)\nLifetime record (19-5)\n\nHOLLY HEART\nThe Honey Badger\nHT: 5’6\nWT: 136lbs\nSeason record (1-1)\nLifetime record (2-6)\n\nDarling steps back on the mat buffer and more ripped then ever. Darling has 19 regular season match up wins to date. She is strong, fast and skilled. No wrestler brings the smack-talk quite like Darling, when she is kicking your ass she will let you know it!\n\nHolly Heart comes in looking for her second win of the season. This sexy fitness and porn model is strong, determined and is currently ranked 7th out of all current Ultimate Surrender wrestlers. The Honey Badger has the strength and the experience to get a win over a higher ranked opponent today.\n\nDarling come to the mat ready to destroy. Holly and her amazing strength pose no threat to the season ripped veteran. Darling almost had Holly cumming on the mat during wrestling. Darling humiliated, dominated and totally controlled a helpless Holly Heart.\n\nDarling brings the pain and humiliation to RD 4. Holly is fucked to multiple orgasms. Not content with only fucking Holly’s tight pussy, Darling rams her cock into Holly ass, and rides her like a stallion. Holly can only moan like a whore as Darling plows her ass with a huge strap on!.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Holly Heart",
      "person_id": 20472
    }
  ],
  "release_date": "2012-01-27",
  "scene_id": 18298,
  "tags": [
    "Anal",
    "Big Tits",
    "blond",
    "Blonde",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "2 hot blond fitness models battle in a hardcore, sexual, non-scripted, submission wrestling match!"
}