{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SEASON NINE MATCH UP!\nDRAGONLILLY\nThe Dragon\nHT: 5'4\nWT: 127lbs\nSeason record (1-0)\nLifetime record (33-5)LYLA STORM\nThe Jaguar\nHT: 5'8\nWT: 108lbs\nSeason record (0-3)\nLifetime record (0-3)\nThe Dragon is back after a brief medical leave. The Doctors have cleared her to wrestle, once again she is ready to destroy any poor girl who is foolish enough to meet her on the mat. The Dragon has the largest arsenal of exotic holds, all designed to put a opponent in a position to be finger fucked to orgasm during wrestling. However, she has a serious weakness and the secret is out: If you get fingers in the dragon she cannot resist the pull of pleasure..\nLyla Storm is one of the most exciting rookies on the roster. She never gives in, she never gives up, she is 100% all the time. No one looks so good at losing as Lyla. Her long legs, her amazing ass. The look on her face when she is being finger fucked while totally helpless makes Lyla a fan favorite!\nThe Jaguar started the match feisty, so the Dragon locked down the girl, then finger fucked her at will. Lyla was totally helpless against the veteran. Time and time again the Dragon got Lyla in a hold that was completely inescapable and finger fucked her without mercy. The Dragon does have a weakness and Lyla exploited it on a couple occasions! But in the end Lyla was totally defeated physically and sexually. Rd 4 was most brutal as the Dragon fucked the hell out of the loser rookie in devastating fashion!Ultimate Surrender, the only non-scripted real wrestling league on the net.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Lyla Storm",
      "person_id": 33882
    },
    {
      "name": "DragonLily",
      "person_id": 3433
    }
  ],
  "release_date": "2012-02-03",
  "scene_id": 18299,
  "tags": [
    "Anal",
    "Couple",
    "Doctor",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Tall skinny rookie, physically & sexually destroyed on the mat! Devastating! Brutally fucked in RD4."
}