{
  "collections": [
    "Wired Pussy"
  ],
  "description": "Masturbation addict Audrey Rose thinks admitting her problem is the first step to her recovery. However, therapist Gia DeMarco's approach to treating Audrey's fingers wandering into the pink, wet folds of her pussy isn't talking about it, it's tying her up and making her submit to some lesbian BDSM and electrical toys.\nGia straps Audrey up with electrical nipple clamps and TENS units for a little therapy. With rough fucking with electrical dildos while Audrey's restrained to her bed, Gia works the first of many mind-altering orgasms to bring Gia on the path of recovery.\nBut Gia's not done. Sensing a better use for the fuck addicted slut, Gia straps a ball gag on Audrey and uses the addict to please her own carnal cravings, sucking Gia's clit until she cums. Gia rewards Audrey with a shocking double penetration that ends with an even more intense climax with the assistance of the magic wand.\nFinally, Audrey is suspended with leather straps, while Gia violates her wet and willing holes with an electrical strap-on. Though Audrey began her session with the need for self-gratification, Gia's replaced it with a greater need for electrical stimulation.",
  "directors": [],
  "models": [
    {
      "name": "Audrey Rose",
      "person_id": 31792
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    }
  ],
  "release_date": "2012-02-23",
  "scene_id": 18570,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "bottom",
    "Brunette",
    "Cattle Prod",
    "Corporal Punishment",
    "Dominatrix",
    "Double Penetration",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Latin",
    "Leather",
    "Lesbian",
    "LezDom",
    "masturbation",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Pussy Eating",
    "shaped",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "Tens Unit",
    "toned",
    "white",
    "Zapper"
  ],
  "title": "Electroshock Therapy for Sex Addiction"
}