{
  "collections": [
    "Wired Pussy"
  ],
  "description": "Remember “Full Metal Jacket”? Of course you do, it’s that movie with a fat Vincent D’Onofrio and why R. Lee Ermey is legally obligated to only play drill sergeants. Much like D’Onofrio’s Private Pyle, all-natural and bespectacled Penny Pax is a new recruit to porn and she has a permanent smile on her face, even in the face of an intimidating lesbian BDSM session with Aiden Starr.\n\nAiden, who like Ermey is obligated by law to dominate new girls, dedicated herself to wiping that smirk off her face and breaks out the toys in Penny’s first BDSM experience and her first electro sex scene. But being tied up, zapped and orgasming at the whim of Aiden aren’t the only firsts for Penny, this is also her first very time with another woman!\n\nWith that in mind, Aiden is set to make an impression. With Penny’s arms restrained behind her, Aiden initiates the X-rated newbie with some zaps to the ass, then takes the violet wand to shock her clit and nipples. Aiden moves Penny’s training in lesbian BDSM along with her tied to a staircase and making her ass dance with a TENS unit. Penny’s butthole is violated by a sparking dildo, but that’s just a prelude to Aiden’s fist going where the sun most definitely doesn’t shine (until now). Bent over and bound in the doggie position, Aiden give the all natural cutie a sweet-hello to the most feared device we have, the Cattle Prod. Then applies more volts to Penny’s ass and fucks her mercilessly with a strap-on, teaching her how to give up her orgasms to her mistress.",
  "directors": [],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2012-02-16",
  "scene_id": 18944,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Cattle Prod",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "Tens Unit",
    "Violet Wand",
    "white",
    "Zapper"
  ],
  "title": "First Time with a Girl. First Time with Electrosex!"
}