{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Kink.com proudly presents the first installment of a monthly Sex and Submission feature movie series! Starring the sophisticated and beautiful, Brooklyn Lee, with her perfect all natural body and powerful reactions. Also starring the one and only Nacho Vidal with his unique and passionate style of sexual domination! Get ready for intense kinky sex with a high production storyline!\nMarcy Mikelhoff is a criminal defense attorney. She believes everybody deserves a fair trial, even the most brutal of hardened killers. One such man is her client, Dax Klezko.\nKlezko is on trial for murder. Winning this case wont be easy. Dax doesnt deny his guilt, in fact, he boasts that the punks deserved it. Most decent people would be happy to flip the switch that fries Klezkos ass, but not Marcy. Her heart bleeds for savages like him, believing that all it takes is a little kindness and understanding to change a vicious animal like Klezko into a productive member of society.\nDax isnt interested in redemption, but he is interested in Marcys fine ass. Where others see an educated lawyer, Dax sees a hot broad in need of a hard fucking.\nMarcy will soon learn the painful lesson that when you show scum like Dax the tiniest bit of kindness, they see it as weakness and happily take advantage of it, and Marcy is taken, again and again! Even her husband and sister cant change Marcys mind, as she continues to fight to win Dax his freedom, hoping that once hes free he will turn his life around.\nStory written by Malcolm Sherwood from the erotic softcore series \"Cruel Romance\" on KOD.",
  "directors": [
    {
      "name": "Marty",
      "person_id": 50
    }
  ],
  "models": [
    {
      "name": "Brooklyn Lee",
      "person_id": 25796
    },
    {
      "name": "Nacho Vidal",
      "person_id": 34792
    }
  ],
  "release_date": "2012-03-16",
  "scene_id": 18977,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Choking",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Facefucking",
    "Fetish",
    "Foot Torment",
    "Gag",
    "Humiliation",
    "Kidnapping Play",
    "Kinky",
    "Leather",
    "Pain",
    "Rimming",
    "Role Play",
    "romance",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "Vaginal Penetration"
  ],
  "title": "\"Convict Lust\" A Featured Presentation: A Lawyer Brutally Fucked and Dominated by a Vicious Criminal"
}