{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "ULTIMATE SURRENDER SEASON NINE!\nDARLING\nThe Grappler\nHT: 5'4\"\nWT: 130 lbs\nSeason record (2-0)\nLifetime record (20-5)YASMINE LOVEN\nThe Lightning Bolt\nHT: 5'2\nWT: 130lbs\nSeason record (0-0)\nLifetime record (0-0)\nDarling is one of the most experienced wrestlers on the current roster. With 20 regular season wins, she is often called upon to break in the rookies. She is tough on the new girls but also teaches and mentors them through the process. A rookie that gets Darling as her first match is a better wrestler for it.\nWelcome 18yr old Yasmine Loven to Ultimate Surrender. Yasmine is a scrapper. She wrestled some in the past. She is strong, healthy, and has endurance, pride and huge tits. She honestly thinks she can win the match based on her bad assness in her normal life. Scrappy is the best word to describe the new rookie out of the gate.\nYasmine soon realizes that skill will always win over cockiness. Darling teaches our newest 18yr in form, technique and humiliation. Multiple submission holds and head locks and body scissors take their toll. Soon the rookie is tired, and when that happens, fingers slip in the pussy. A good solid win for the veteran. A great learning experience for the rookie.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Yasmine Loven",
      "person_id": 37660
    }
  ],
  "release_date": "2012-02-24",
  "scene_id": 18971,
  "tags": [
    "Anal",
    "Big Tits",
    "black hair",
    "Blonde",
    "Curvy",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "US welcomes a new rookie with great potential. 18yr Yasmine is strong, has huge tits & some skill!"
}