{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Francesca’s loving husband puts together a surprise celebration for her birthday complete with champagne, cake and presents. Unbeknownst to her he has also set up the best present a woman could ever ask for, a hot sexy stud with a rock hard cock ready to give her all the orgasms and pleasure she deserves! Francesca and Henry are totally in love yet they both accept the fact that he can’t please her sexually so Henry’s boss Christian is the man for the job! Francesca locks her husbands cock away in chastity and whips, spanks and torments his balls in front of Christian. She humiliates Henry by sucking Christian’s cock then spits her cock laced saliva all over Henry’s face and chastity belt. Henry is fucked in the ass while he is unwillingly made to suck his bosses cock to get it ready for his wife to fuck. Finally Francesca rides Christian’s dick while her husband is made to watch every orgasm. Francesca takes Christian’s full load into her mouth then spits his man juice all over her husbands face while he is made to tell her Happy Birthday!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Francesca Le",
      "person_id": 36526
    },
    {
      "name": "Henry Jacob",
      "person_id": 33551
    }
  ],
  "release_date": "2012-02-29",
  "scene_id": 19174,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Bondage",
    "brunet",
    "Brunette",
    "Brutal Cuckolding",
    "CBT",
    "Chastity Play",
    "Corporal Punishment",
    "Cuckolding",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Latinx",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "Slave",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Francesca Le's Birthday Cuckold"
}