{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Join the Upper Floor for a celebration of squirt, with fierce competition between Tomi Knox, The Pope, and Princess Donna for who will be crowned the Squirt Whisperer! On hand the House has slaves tramp, ash, and kaos, as well as a volunteer slave: leggy girl next door Mallory Malone. All four girls are placed in a kiddy pool and made to squirt on each other to determine who needs a little assistance. They are humiliated and treated like creatures in a petting zoo by the boisterous guests.\nAfter warming up with the busty guest Ruby Reaper, the contestants are set loose on their prey, who scream, twist, and orgasm as every drop of squirt is milked from their pussies with aggressive fisting, double fisting, and toys. Even Mickey Mod is able to make the line of girls squirt with a good hard fucking while Princess Donna works their assholes with her tongue.\nWatch to see who will win the title of Squirt Whisperer. See which slave will win Mickey Mods cum with the best blow job, or if all the slaves will be shown up by Princess Donna Dolore.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Krysta Kaos",
      "person_id": 25624
    },
    {
      "name": "Skin Diamond",
      "person_id": 31494
    },
    {
      "name": "Dylan Ryan",
      "person_id": 10069
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    },
    {
      "name": "The Pope",
      "person_id": 27779
    },
    {
      "name": "Mallory Mallone",
      "person_id": 32943
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Tomi Knox",
      "person_id": 33917
    },
    {
      "name": "Princess Donna Dolore",
      "person_id": 5235
    }
  ],
  "release_date": "2012-04-20",
  "scene_id": 19336,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Fisting",
    "Humiliation",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "The Pope",
    "Threesome",
    "Top Squirting Videos"
  ],
  "title": "House Party: Donna's Squirt Festival!"
}