{
  "collections": [
    "Device Bondage"
  ],
  "description": "Scene 1\n\nBound up from head to ankles with shiny, clear PVC straps and gag, sexy Sarah tries to escape the brutal snap of the single tail. Red whip marks criss-cross all over her hot body leaving her all marked up and nowhere to go. Claire gives her the cattle prod until she is squealing, and then attaches nipple clamps to her thigh straps. The more Sarah reacts to the shocks, the more pain her nipples get! Then, in comes the dick on a stick with a vibrator to send Sarah shaking into orgasmic bliss.\n\nScene 2\n\nOn her back, in a straight jacket, on a dirty mattress, Sarah’s legs and feet are chained and bolted to the floor. Her feet and inner thighs get covered with a “special sauce” that burns HOT. Then she gets her pussy sealed shut with red hot candle wax until Claire flakes it off with a brutal caning. Next, painful, tickling foot torment and scary, big ass clamps stretch and expose Sarah’s vulnerable pussy while she gets a nice hard DP fucking with our good friend dick on a stick until she is purring like a ravaged kitten as she comes and comes.\n\nScene 3\n\nWow. Sarah is quite a sight hanging from the ceiling in a pipe swing, with her head enclosed in a tight latex hood with a tiny breathing hole. She gets whipped while clothes pins pinch her tits and pussy. Then more fucking and orgasms galore. Focus. Slow down and regulate your breathing Sarah, or you’re going to hyperventilate! Nerve racking breath torment!",
  "directors": [],
  "models": [
    {
      "name": "Sarah Shevon",
      "person_id": 19605
    }
  ],
  "release_date": "2012-03-23",
  "scene_id": 20173,
  "tags": [
    "BDSM",
    "Big Ass",
    "Bondage",
    "Brunette",
    "Caning",
    "Cattle Prod",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Foot Torment",
    "Gag",
    "Handler",
    "Hood",
    "Hot Wax",
    "Humiliation",
    "Latex",
    "Metal Bondage",
    "multiple orgasms",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "shaved",
    "Single Tail",
    "Straight",
    "Straitjacket",
    "Submission",
    "Tattoo",
    "Tickling",
    "Vibrator",
    "white"
  ],
  "title": "Sexy Sarah gets Fucked Hard in Brutal Bondage with Nerve Racking Breath Play"
}