{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SEASON NINE MATCH UP!\nDRAGONLILLY\nThe Dragon\nHT: 5’4\nWT: 127lbs\nSeason record (2-0)\nLifetime record (34-5)\n\nRAIN DEGREY\nPosion\nHT: 5’9\nWT: 124lbs\nSeason record (2-0)\nLifetime record (5-4)\n\nThe Dragon is back on the mat. No other wrestler on the roster has more wins or matches. The Dragon wrestles with two speeds, one for rookies and one for veterans. When she settles down on a veteran watch out, it’s hard to believe someone can move that fast and pull out so many outstanding inescapable holds and then fingerbang a skilled wrestler to multiple orgasms on the mat.\n\nRain DeGrey is no pushover, she even held the number one spot briefly this season. She is cocky and a bit of a bully on the mat. She enjoys her shit talking when she is winning and will fuck the death out of you in RD 4 if you lose to her.\n\nRain discovered the true meaning of “elite” at Ultimate Surrender today. She was dominated from the first whistle. The Dragon’s arsenal of moves and cat-like quickness had Rain wrapped up and helpless most of the match. Give some credit to Rain, she did not give up and fought well. However, in the third round the Dragon got her fingers in and made Rain orgasm twice on the mat. The ultimate humiliation for a veteran wrestler.\n\nUltimate Surrender, the only non-scripted real wrestling league on the net.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "DragonLily",
      "person_id": 3433
    },
    {
      "name": "Rain DeGrey",
      "person_id": 16817
    }
  ],
  "release_date": "2012-03-09",
  "scene_id": 20195,
  "tags": [
    "Anal",
    "Asian",
    "Blonde",
    "Brunette",
    "Curvy",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Cocky, high ranked wrestler, discovers the true definition of elite. Sexually destroyed on the mat!"
}