{
  "collections": [
    "Hogtied"
  ],
  "description": "Cassandra in the last part of her live show is bound pile driver style, with her knees to her shoulders and arms in strappado bound to the floor like an inverted letter T. Adding some nice color, Matt canes her calves getting thin stripes to appear. Isis enters and pounds her cunt with a thick strap on, slapping her ass as she rams her cock in deep.\n\nCassandra’s cunt hole is so open and eager to be stuffed that Isis easily slips her fist in and cunt punches her hard. Her ass looks nice and willing too, so Isis adds a finger and starts fucking her asshole while vibrating her clit. Matt stipulates that for every 10 seconds Cassandra does not cum, she is going to get a cane stroke. He definitely delivers on that promise.\n\nIsis gets bored and decides to go back to pounding her cunt. Matt asks Isis to give Cassandra one minute of her best. Cassandra does not get to cum, but definitely endures a challenging position. At the end, we get to see her candid closing interview and thoughts about the whole show from beginning to end.\n\n“How does it feel to be a 19 year old whore?” Members ask.\n“The Best” Cassandra says.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Cassandra Nix",
      "person_id": 36857
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    }
  ],
  "release_date": "2012-04-23",
  "scene_id": 20441,
  "tags": [
    "19-Year-Old",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "bottom",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "fake boobs",
    "Fingering",
    "Handler",
    "Humiliation",
    "mixed",
    "natural boobs",
    "Rope Bondage",
    "shaped",
    "shaved",
    "Slapping",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Cassandra Nix Live Show Part 4"
}