{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Lesbian cuckolding is all the rage as of late and here at WhippedAss.com we like to deliver to you the newest in lesbian domination and sex! Jessie Palmer has spent the weekend at a attending a boring corporate convention when she returns to her hotel room to curious noises coming from the adjoining room. Jessi can’t help but investigate and finds that the door is surprisingly unlocked. Much to her liking she notices a kinky lesbian couple having really rough sex! Jessi touches herself and dreams of being lucky enough to get fucked like that by another woman. When she’s caught by the dominate female she thinks that her chance has finally arrived but the kinky couple has something more twisted in mind.\n\nJessi’s yearning wet cunt is locked away in chastity and is only allowed to have her ass plugged. She’s made to watch the woman have hot kinky sex while humiliated, clothed pinned, whipped and spanked. She does however have the pleasure of erotic foot worship with Aiden which only seems to tease her locked away cunt even more. Jessi’s pussy drips with excitement after being teased and denied and made to watch the other girls have hot anal sex! In the end she’s made to believe she will finally get hers but the strict dominatrix only banishes the corporate slave to a world where she is nothing more than a little lesbian cuckold bitch!",
  "directors": [],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Eva Fenix",
      "person_id": 39275
    },
    {
      "name": "Jessi Palmer",
      "person_id": 23628
    }
  ],
  "release_date": "2012-05-18",
  "scene_id": 20977,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "Brunette",
    "Chastity Play",
    "Corporal Punishment",
    "Couple",
    "Cuckolding",
    "Domination",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Foot Worship",
    "Humiliation",
    "Kinky",
    "Latinx",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "white"
  ],
  "title": "Little Lesbian Cuckold Bitch"
}