{
  "collections": [
    "Device Bondage"
  ],
  "description": "Kristina gets installed into her final position for the Live Show. She is placed on her back with her legs spread and affixed to a metal spreader bar system and strapped down to the board under her back. JP starts terrorizing her with the cattle prod… scaring her… terrifying her…\n\nIsis comes in and starts licking Kristina’s pussy. JP lets Kristina choose the way she is going to be tormented. Isis works over her ass with her hands, slowly finger fucking her, then ramping it up. Working her hand in deeper and deeper, she fists tiny Kristina’s ass hole. Kristina overwhelmed by pleasure, cums deeply.\n\nMaestro comes in and fucks her pussy while Isis’s fist is still in Kristina’s ass. Its amazing to see. Maestro moves to her asshole and fucks it nice and hard. Isis steps in and fucks her ass while Maestro assaults her face with his cock. JP delivers the last 7 strokes that she earned at the beginning of the show on her feet with the cane and the paddle. She writhes in pain as her holes are still fucked, completely helpless.\n\nIsis steps back and administers more pain and Maestro steps in for a final face fucking to cream all over her ravaged face hole… this filthy whore suffers for us.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Kristina Rose",
      "person_id": 20560
    }
  ],
  "release_date": "2012-04-25",
  "scene_id": 21140,
  "tags": [
    "Anal Fisting",
    "BDSM",
    "Bondage",
    "Brunette",
    "Cattle Prod",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "Double Penetration",
    "fake boobs",
    "Feet",
    "Fingering",
    "Fisting",
    "Handler",
    "Humiliation",
    "Latinx",
    "Metal Bondage",
    "mixed",
    "natural boobs",
    "Paddle",
    "Pain",
    "shaped",
    "slim",
    "Straight",
    "Submission"
  ],
  "title": "Kristina Rose - Filthy Whore - Live Show Part 4"
}