{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Bobbi Starr and Lorelei Lee reminisce about the good ole days when the men they were with were well hung and great in bed when Lorelei unexpectedly runs into Bobbi’s old boyfriend, Rod. Lorelei cooks up a devious plan to keep Bobbi’s husband away while Bobbi takes a ride on Rod’s enormous cock. When Sebastian comes home to find his wife in bed with another man he’s made to watch the entire filthy act. Sebastian loves his wife and Bobbi loves him however, a woman needs to get off even if that means by the cock of another man!\n\nLorelei joins in on the fun handcuffing Sebastian to the bed whipping and tormenting his ass and balls while his wife is on the ride of her life. He’s bent over the bed and butt fucked while Bobbi instructs him to prepare her stud with his mouth for her.\n\nBobbi takes her stallion for one last ride and makes her husband suck and clean her feet while she bounces up and down on Rod’s cock to multiple orgasms. He’s even made to lick her pussy while Rod is inside her! Finally, Lorelei jerks Rod off on to Bobbi’s feet and Sebastian is made into a sponge cleaning up every drop of another mans cum from his wife’s feet!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    },
    {
      "name": "Lorelei Lee",
      "person_id": 758
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Shaun Diesel",
      "person_id": 18801
    }
  ],
  "release_date": "2012-05-16",
  "scene_id": 21251,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blonde",
    "Bondage",
    "brunet",
    "Brunette",
    "Brutal Cuckolding",
    "CBT",
    "Corporal Punishment",
    "Cuckolding",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "multiple orgasms",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "slim",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "Whipping",
    "white"
  ],
  "title": "Cuckold Surprise!"
}