{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Ash is truly wearing her birthday suit when this evening starts. Sitting among the other slaves with their collars still on she has no idea what she will endure to celebrate her coming of age and a new position in the house. Her and the Pope reach a new level of intensity as she has uncontrollable orgasms and screams for mercy under his crop.\n\nMeanwhile, darla rapunzel is placed in extreme shibari and released to the painful ministrations of Mistress UV. As darla contorts and howls in the complex bondage she only makes matter worse for herself. UV has a cane in her hand and no mercy in her game. Kate is placed in leather restraints and must keep her balance as her dominant Kenishiro spanks her and makes her crawl across the floor on her knees.\n\nThe Upper Floor has a visitor, slave sin, who volunteers to be used by the imperious Isis Love and horny Mark Davis. The dominant couple are a fierce duo, and soon have sin swinging onto Marks cock by her wrists. This first half of a two part update is an excellent illustration of the intense connection between a slave and a Master.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Krysta Kaos",
      "person_id": 25624
    },
    {
      "name": "Mark Davis",
      "person_id": 8200
    },
    {
      "name": "Skin Diamond",
      "person_id": 31494
    },
    {
      "name": "Sparky Sin Claire",
      "person_id": 29494
    }
  ],
  "release_date": "2012-03-28",
  "scene_id": 21482,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Bondage",
    "bottom",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Couple",
    "Crop",
    "Curvy",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "foreskin",
    "Humiliation",
    "Leather",
    "master",
    "mixed",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "other hair color",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "The Pope",
    "Threesome",
    "top",
    "white"
  ],
  "title": "Slave Birthday Party Part 1"
}