{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The Upper Floor Steward has invited the local BDSM community to have brunch with The House. Immediately one cheeky female guest has some questions about the dining tables capabilities, and has her head fastened in the table stocks with her ass exposed in the air. Her Master makes sure to answer all her questions with a flogger while slave kaos rips orgasms from her vulnerable pussy.\nOnce everyone moves into the lounge, Christine tears into Moriel with a female friend, caning, flogging, and ripping a zipper from her tender flesh. Eden Alexander plays the switch, starting the day helpless and tickle tortured in a straight jacket, ending the day strap on fucking a female sub with Scorpio. Master John and slave sue delight with heavy impact play and a brutal clothespin zipper, lovingly removed by Stefanos and John. The ever horny and gorgeous Simone has three males friends to play with, Jack Hammer to bind and beat her, and her Master Steve and a friend to suck, fuck, and please with her squirting orgasms. Nerine and slave kaos get into some antics with a giant whisk and roll of plastic wrap. There is female wrestling, Beretta topping for the first time on The Upper Floor after cumming for the guests, and a beautiful suspension flogging with Torque and Pynki.",
  "models": [
    {
      "name": "Beretta James",
      "person_id": 33659
    },
    {
      "name": "Krysta Kaos",
      "person_id": 25624
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    }
  ],
  "release_date": "2012-06-15",
  "scene_id": 21968,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "brunch",
    "caning",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "flogging",
    "humiliation",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "squirting",
    "stocks",
    "straight",
    "straight jacket",
    "strap on",
    "suspension",
    "wrestling",
    "zipper"
  ],
  "title": "Stefanos' Brunch"
}