{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Sometimes a new girl comes along that is so adorable and new to everything that watching every filthy thing she’s made to do almost feels illegal. Naidyne is just that! First porn! First BDSM experience! First strap-on and best of all NEVER had sex with a woman! You wouldn’t know it by the way her pussy drips on the floor but her adorable doe eyes and eager willingness gives her secret away.\n\nNaidyne’s curiosity gets her in trouble when she finds herself compelled to touch her mistress’s tools while she’s waiting for her to arrive. A felony in any dungeon. Naidyne is collared and made to strip to Mistress Aiden’s delight then given a harsh OTK spanking. She’s tied tight in rope bondage having her perfect voluptuous 19 year old tits sucked deep into a pair of tit suckers and brutally caned while worshiping feet. She’s strap-on fucked for the VERY first time while having her ass penetrated with an acrylic dildo.\n\nThis is a HOT movie documenting FIRST experiences with realism only a newbie can pull off!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Naidyne",
      "person_id": 37796
    }
  ],
  "release_date": "2012-06-01",
  "scene_id": 22053,
  "tags": [
    "19-Year-Old",
    "Anal",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "Collar",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mixed",
    "Pussy Eating",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Adorable 19 year old has a tough first ever lesbian experience on WhippedAss.com!"
}