{
  "collections": [
    "Hogtied"
  ],
  "description": "Iona Grace. Gorgeous body, tough attitude, ready to go, was wanton for punishment in this update. She wanted it hard, with marks, and no mercy… be careful what you wish for!\n\nSCENE 1\nIona is bound with her tits to her knees and wrists pulled high and harshly above her. Nipple and clit suction, arm pit caning, kicking, cumming. She is just getting warmed up and already is reaching her limit of enduring the pain and torment. She wants to please Claire so badly, but Claire is far from impressed.\n\nSCENE 2\nBound against the brick wall, Iona’s round ass is plump and just sticking out there waiting for torment. A nice cold ass hook is slid into her vulnerable asshole. Her neck is tied to her ankles and she is made to watch all of the pain and pleasure laid out before her.\n\nSCENE 3\nHer tits are bound in leather and her body in a HogTie. Laying down on breast bondage is pretty uncomfortable and Claire enjoys this fact and makes Iona writhe as much as possible on those tender tits. Challenging Iona’s capabilities of endurance, she is suspended in an extremely difficult suspension.\n\nSCENE 4\nIona is bound kneeling with her ankles to her thighs and her breasts and hair to a suspension point. She is hoisted up just by her hair and tits and lowered onto a sybian. The unforgiving machine winds up and gives her quite the ride in a sybian finish.",
  "directors": [
    {
      "name": "Claire Adams",
      "person_id": 46
    }
  ],
  "models": [
    {
      "name": "Iona Grace",
      "person_id": 25204
    }
  ],
  "release_date": "2012-07-05",
  "scene_id": 23302,
  "tags": [
    "Ass Hook",
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Bondage",
    "Breast Bondage",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "natural boobs",
    "Pain",
    "Predicament Bondage",
    "Rope Bondage",
    "shaved",
    "Straight",
    "Submission",
    "Suspension",
    "switch",
    "Sybian",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Big Titted Slut Iona Grace Suspended and Tormented on HogTied.com"
}