{
  "collections": [
    "Electrosluts"
  ],
  "description": "It’s Justine Joli’s party, and if the birthday girl wants to be tied up in electrosex bondage, she’ll be tied up in electrosex bondage!\n\nAs the attendees look on, Maitresse Madeline and I work over Justine into electro BDSM ecstasy. But adding to her agony is my cattle prod, the zapper in each of Maitresse’s hands and, most of all, the mercury switch on her ankle that activates the sticky pads running along Justine’s inner thighs.\n\nJustine works hard to prove she is an electroslut so that she receives the privelage of eating out Madeline’s asshole. That being said, I make sure I get my share of satisfaction as well, by masturbating with a Hitachi Magic Wand and applying the cattle prod to her pussy.\n\nThere’s no holding back the other partygoers who want a piece of this lezdom action. They smother Justine with their feet to worship and taking turns fucking her with dicks-on-sticks while I rick her with an electrified strap-on!\n\nBut wait, does it seem like you’re missing something?! Because you are!! An entire Lebian BDSM position of intense action!! Want to see it? Go to WhippedAss.com and don’t miss a minute from this memorable live shoot!",
  "directors": [],
  "models": [
    {
      "name": "Audrey Rose",
      "person_id": 31792
    },
    {
      "name": "Beretta James",
      "person_id": 33659
    },
    {
      "name": "Justine Joli",
      "person_id": 8211
    }
  ],
  "release_date": "2012-08-10",
  "scene_id": 23595,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Bondage",
    "bottom",
    "Cattle Prod",
    "Corporal Punishment",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Hitachi",
    "Humiliation",
    "Latinx",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "Redhead",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "Tens Unit",
    "toned",
    "white",
    "Zapper"
  ],
  "title": "HAPPY BIRTHDAY JUSTINE JOLI!!!"
}