{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Kristina Rose is a hot shit porn star and all around LA princess, but unfortunately for her she doesn't check her contracts carefully. After shining in her basement training, she carelessly agrees to train as an Upper Floor slave and serve The House.\nShe shows up with an attitude, and is brutally acclimated to what a 24/7 BDSM environment means. Our slaves kaos, tramp, and pistol arent having any of her shit. They immediately throw away her personal items, strip her naked, chain her, and bring her in to polish the silver. When they discover she cant even do that, they punish her holes with strap ons and laugh at her pathetic servitude.\nFor afternoon inspection she is dragged before The Pope and Steward where blunder after blunder land her a spanking and cum rag while the house slaves are rewarded with orally serving the Steward. Thoroughly humbled and covered in filth, she is handed over to the Butler, who hoses her down. Once clean and shackled , he uses her to wipe down the mens room and polish his cock with her tight holes. Rather than have her muck around the house any longer, the Butler locks her away in a trunk to await her Initiation.\nPlease enjoy The Upper Floors first feature, where we let you spend some more personal time with The House.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Beretta James",
      "person_id": 33659
    },
    {
      "name": "Kristina Rose",
      "person_id": 20560
    },
    {
      "name": "Krysta Kaos",
      "person_id": 25624
    },
    {
      "name": "Dylan Ryan",
      "person_id": 10069
    },
    {
      "name": "Jack Hammer",
      "person_id": 18499
    },
    {
      "name": "The Pope",
      "person_id": 27779
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    }
  ],
  "release_date": "2012-08-31",
  "scene_id": 24184,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "humiliation",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "Rough Sex",
    "shackle",
    "slave",
    "spanking",
    "straight",
    "strap on",
    "The Pope"
  ],
  "title": "Poor Little Porn Princess"
}