{
  "collections": [
    "Divine Bitches"
  ],
  "description": "What you don’t understand is that I did this to you purposely, just to watch you suffer. Your weak attempts at worship and devotion bore me and I decided to do something evil. Rather than physically punish you I chose to completely ignore you. You see, training men is similar to training dogs in the sense that any attention is good attention so failing to acknowledge your existence is a much crueler punishment. I chuckled at your pathetic begging asking for my return. I’ve been amused reading you’re lost without my company. I know you’ve missed me with my elegance and divine beauty and I’ve decided it’s time to grace you, my dear viewer with my presence. It’s time to get down on your knees and bow at the place where you were born to be. At the queen’s feet!\n\nI chose Tyler as my first lucky victim after a long hiatus. Young, built, uncut and in need of a woman like me. As I rise from the depths of The Armory, Tyler’s pulse quickens just by the sound of my footsteps. I start out slow teasing him with my body, my hands, my tongue and my lips. Just as quickly as I get his cock rock solid I strike with an energy so powerful Tyler instantly understands he’s in the presence of greatness. After sexy fierce flogging, cat o’ nine, face slapping, foreskin torment and OTK spanking I choose to sink my nails in deeper and do what I do best, using pleasure as as the evilest torment! I drive my strap-on cock so deep in his ass hitting his prostate like he’s never felt before and teetering him back and forth between orgasm and denial where he can barely contain himself, and he doesn’t. Tyler pours over with cock filth without me even stroking his meat, much to my satisfaction. I even consider taking his well hung uncut cock for a ride. I sit on his face demanding ass and pussy worship. Plenty of foreplay for me. I even use a Hitachi vibrator on his cock while I rub my finger on his prostate in slow, deep circles just to make sure his cock is nice and ready for my pussy. Unfortunately, for Tyler I have such control over his orgasms by way of his prostate that last minute I deny him my pussy, press on his prostate with my little finger and yet again his cock erupts with a bubbling load of slave filth.\n\nTsk, tsk, tsk dear viewer, you actually thought I was going to fuck him? Let me guess, you imagine yourself in his position while watching this movie and just like him your little head thinks for your big head and you loose all control under the power of a woman like me.\n\nNice try darling but not this time. Let’s see how long you will keep my attention now.\n\nxoxo,\n\nMaitresee Madeline",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 17872
    },
    {
      "name": "Tyler Alexander",
      "person_id": 39382
    }
  ],
  "release_date": "2012-07-11",
  "scene_id": 24196,
  "tags": [
    "Athletic",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "foreskin",
    "Hitachi",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "OTK",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "Uncircumcised",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "Maitresse Madeline returns with a vengeance!"
}