{
  "collections": [
    "Hogtied"
  ],
  "description": "Thats right, welcome Hollly Michaels to HogTied. This week James thoroughly violates bondage newbie Holly Michaels in challenging suspensions and predicament bondage. First up, Holly is installed in our brown leather single arm binder and suspended in a hogtie. James throttles her face thoroughly and we get to see how many orgasms we can squeeze our of her cunt. At the end of the suspension, James removes half of her support straps and challenges her to endure a much harsher hogtie suspension. In scene two, Holly is bound face down, legs spread wide for easy access. James terrorizes her with tazappers, her beatiful face contorted in agony. In scene three, Holly is challenged with a wrist ankle only, open hairpin suspension. Pushing her limits to the max, her breasts are bound tightly and weights added. The pain is unbearable to Holly and she is made to forget her pain in relentless fucking and orgasms. In the final scene, her tits are bound to the saw horse, making it impossible for her to sit up. She is pushed to her breaking point with clothespins, rubber bands, a punishing face fuck where she takes a large load on her face, and so many orgasms even we lose count!",
  "directors": [
    {
      "name": "Claire Adams",
      "person_id": 46
    }
  ],
  "models": [
    {
      "name": "Holly Michaels",
      "person_id": 40156
    },
    {
      "name": "James Deen",
      "person_id": 8935
    }
  ],
  "release_date": "2012-08-16",
  "scene_id": 24208,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Best Bound Breasts",
    "big dick",
    "Bondage",
    "brunet",
    "Brunette",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "natural boobs",
    "Pain",
    "Predicament Bondage",
    "Predicament Shoots",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "unshaved",
    "Vaginal Penetration",
    "Weights",
    "white"
  ],
  "title": "First Time Bound Holly Michaels Gets Crazy Bondage Predicaments"
}