{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The house slaves have a terrible habit of avoiding discovery of their mistakes, which typically lands them in even more trouble. Tonight is no exception. From the get, the slaves forget to serve dinner to the guests promptly and the mistakes continue to roll out from there. Orgasms are stolen, incorrect answers given, and lies are told. Luckily, James Deen was not there for dinner, but for domination. James has his eye on the girls the entire time and makes sure to keep them occupied with foot service, cock worship, and entertainment. Woe is the slave who makes James bored. Tramp learns this lesson quickly as she has her mouth held open by Annika Albright and Remy LaCroix, making more room for James to fuck her throat. When she cannot take it any longer, tramp is thrown on the floor and fucked in front of all the guests. Meanwhile slave pistol humiliates herself by sneaking an orgasm on the main dining table while Stefanos uses her for the guests amusement. Fallen from grace, she is handed off the James for punishment, which he happily doles out to both the girls in total sexual subjugation and degradation. Meanwhile, the guests busy themselves with rope suspensions and latex worship and Jack Hammer and Eden Alexander play rough and fuck even rougher.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Beretta James",
      "person_id": 33659
    },
    {
      "name": "Dylan Ryan",
      "person_id": 10069
    },
    {
      "name": "James Deen",
      "person_id": 8935
    }
  ],
  "release_date": "2012-09-28",
  "scene_id": 24312,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Cock Worship",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "fake boobs",
    "Female Slave",
    "Humiliation",
    "Latex",
    "master",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Suspension",
    "Tattoo",
    "Threesome",
    "unshaved",
    "white"
  ],
  "title": "Community Dinner With James Deen"
}