{
  "collections": [
    "Device Bondage"
  ],
  "description": "Welcome back Mia Lelani. Gorgeous, tan, nice thick body... muscular, and ready to get violated. Her Live Show was no cake walk. Starting on her back on the box, her legs are pried open with metal. Her back is arched high with pipe, and her neck and wrists are pinned down with metal restraints. Mz Berlin rips her clothes off and Claire starts working on her large tits and cunt, tormenting Mia with our especially painful wax candles. Mz grabs a cane and the tag team pain is nothing short of hell for this cunt. In the second position, Mia is strapped, suspended, face down like a spider monkey. Mz Berlin goes after her tits and she is given the opportunity to cum with decoration Bella lapping at her cunt in tight tit bondage. In the third scenario, she is in a sitting position with her legs spread wide. Cooling gel is applied to her tender soles, suction to her nipples, clothespins, and finally the cane. In the fourth set up, Mia gets a sybian ride while balancing upright with tight hair bondage and legs pried open with a spreader bar of sorts. Bella joins her as the scene cucky and gets her own special reward at the end. You suffered Mia and we loved you for it!",
  "directors": [
    {
      "name": "Claire Adams",
      "person_id": 46
    }
  ],
  "models": [
    {
      "name": "Mia Lelani",
      "person_id": 21648
    },
    {
      "name": "Mz Berlin",
      "person_id": 14228
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2012-08-21",
  "scene_id": 25282,
  "tags": [
    "BDSM",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "muscular",
    "Pain",
    "Straight",
    "Submission",
    "Suspension",
    "Sybian",
    "Tag Team"
  ],
  "title": "Mia Lelani - Big Titted Cunt Tormented - Complete Edited Live Show"
}