{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "TsPussyHunters.com presents its FIRST feature update, \"The Curse of Dullkight\" starring Eva Lin, Ts Foxxy, Rain DeGrey and Gia DiMarco. Ts Foxxy and Eva Lin fuck Rain and Gia senseless in this two part series shot all outdoors. Around a campfire in the secluded hills of Northern California, Gia and Rain inadvertently summons the powers of Dullkight and awaken two hot TS woman to their little weekend getaway. If sexy women show up on your doorstep with two sybians in their hands, it is DEFINITELY too good to be true. Gia and Rain are made to suck cock and get fucked in the blazing California sun. \"Part 1: Find Them\" is an hour of hardcock fucking and screaming orgasms. Be forewarned - Rain DeGrey and Gia DiMarco do NOT go gently into cum space, they scream louder than you can imagine, so you may want to watch this with your free hand on the speaker volume. We did all we could, but at some point, it's just the nature of a good orgasm. \"Part 2: Destroy Them\" includes an epic outdoor orgy. Sit back and dive into the highest quality production of Ts porn on the net.",
  "directors": [],
  "models": [
    {
      "name": "Eva Lin",
      "person_id": 21010
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Rain DeGrey",
      "person_id": 16817
    },
    {
      "name": "TS Foxxy",
      "person_id": 20055
    }
  ],
  "release_date": "2012-10-12",
  "scene_id": 25766,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Asian",
    "Athletic",
    "BDSM",
    "Big Tits",
    "black hair",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "Brunette",
    "Cock Worship",
    "Domination",
    "Facefucking",
    "fake boobs",
    "Fetish",
    "halloween",
    "Interracial",
    "Kinky",
    "Latin",
    "Orgy",
    "Outdoors",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Submission",
    "switch",
    "Sybian",
    "Tattoo",
    "toned",
    "TS",
    "ts cock",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Curse of Dullkight: Transsexual Women Summoned to Fuck Pussy"
}