{
  "collections": [
    "Electrosluts"
  ],
  "description": "There's nothing like a live sex show, the spontaneity, the energy and the ways the girls get in your face. Trouble is that every perv wants to see one at least once in their lifetime, but they're hard to find. Thank god for the Internet.\nIn this scene, originally shot in September, Lorelei Lee binds Katherine Kane in lesbian bondage then overpowers her with electro BDSM in a recording of a live webshow. It's shot continuously and without breaks, just like you are there.\nLorelei ties up the electroslut in a lesbian BDSM chest harness, binding her legs and wrists with bondage tape. Katherine's feet are exposed to Lorelei's electrosex exploration with a cattle prod, but Lorelei winds up worshipping the perfect peds.\nAfter that brief respite, Lorelei comes back with a vengeance. Lorelei wires up Katherine's stainless steel nipple piercings and attaches electro pussy clamps, then straps on a dildo gag. Lorelei is harsh femdom, and expects her wet, horny pussy to be given all the respect, devotion and worship from Katherine that it deserves, or there will be hell to pay.\nFinally, Lorelei stuffs Katherine's head into a stocking. Not knowing what's coming next, Lorelei shoves the Samurai, then her fist up Katherine's ready asshole giving her anal orgasmic relief.",
  "directors": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    }
  ],
  "models": [
    {
      "name": "Lorelei Lee",
      "person_id": 758
    },
    {
      "name": "Katharine Cane",
      "person_id": 35830
    }
  ],
  "release_date": "2012-10-05",
  "scene_id": 25835,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Cattle Prod",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "Feet",
    "Femdom",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pierced Nipples",
    "Pussy Eating",
    "harness",
    "Slave",
    "Straight",
    "Strap On",
    "Tens Unit",
    "Uncircumcised",
    "Uncut",
    "Zapper"
  ],
  "title": "Electrosluts LIVE with Katherine Cane!"
}