{
  "collections": [
    "Electrosluts"
  ],
  "description": "In this very special one hour update of Electrosluts, we have not one, but two new brunette first timers to electrosex! Tegan Tate and Trinity St. Clair may think they’re porn stars, but they don’t know what’s coming when they meet up with blonde veterans Aiden Starr and Lea Lexis in this session.\n\nRigging them up in lesbian BDSM rope restraints with one leg in the air for easy access, Tegan and Trinity are wired up with an amazing amount of sticky pads. Aiden takes a violet wand to them, while Lea makes them learn how to properly adore their new lezdom masters.\n\nBut it doesn’t end there. Aiden and Lea each pick up a Samurai to fuck and electrify the sopping wet pussies of Tegan and Trinity. The two young brunettes learn that for every ounce of pleasure there’s a pound of electro BDSM pain, and bitch that’s giving that pain! Reinforcing this lesson, Aiden and Lea put dildo gags on Trinity and Tegan, then fuck their faces to their own satisfaction while their slaves’ cunts are repeatedly zapped by electrified pussy clamps.\n\nFinally, out two Doms pick up a electro dick on a stick and strap on a rocket, giving Tegan and Trinity a send off that keeps their wet electroslut holes sparking with electricity and orgasming to heights they never imagined!",
  "directors": [],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Lea Lexis",
      "person_id": 17836
    },
    {
      "name": "Tegan Tate",
      "person_id": 42885
    },
    {
      "name": "Trinity St Clair",
      "person_id": 32284
    }
  ],
  "release_date": "2012-10-26",
  "scene_id": 25854,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "bottom",
    "brunet",
    "Brunette",
    "Cattle Prod",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "First Timers",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "Tens Unit",
    "toned",
    "Violet Wand",
    "white",
    "Zapper"
  ],
  "title": "Breaking In Brunet Electrosluts!"
}