{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Katharine Cane has finished her training in the dark bowels of The Armory and comes to The Upper Floor, begging to serve as a house slave. Our brunch guests are charmed by her porcelain skin and lithe body, but soon her clumsy responses and over confidence shadow her sex appeal and she is in a world of trouble. Out come the canes, the head box, the foot tickling from slave o, and the incessant sexual torture from slave chrome.\nKatharine is reduced to tearful begging and made to endure her least favorite punishment in order to enjoy the relief of an orgasm. This petitioner s trial by cattle prod leaves the guests impressed, but ambivalent on her petition.\nThere is a sadistic and sexually charged couple looking for a good time, and we are more than happy to feed them both slave chrome and petitioner cane. Chrome does what she does best: sucking, fucking, begging, and suffering. She is made to swallow cock over and over again with a demanding Mistresses hand at the back of her head. When chrome can perform no longer she offers her pussy for the Master s enjoyment.\nPetitioner cane is made to watch chrome endure much humiliation and denied orgasms, and when the Mistress becomes bored beating her, she has her face shoved into chromes ass. Despite her best efforts, the jury is still out on petitioner cane, leaving The House with another happy occasion to evaluate the slut in the future.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Katharine Cane",
      "person_id": 35830
    },
    {
      "name": "Lyla Storm",
      "person_id": 33882
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Odile",
      "person_id": 33692
    }
  ],
  "release_date": "2012-11-16",
  "scene_id": 25867,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Bondage",
    "bottom",
    "brunch",
    "brunet",
    "Brunette",
    "Cattle Prod",
    "Corporal Punishment",
    "Couple",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "Latin",
    "master",
    "natural boobs",
    "Oral Sex",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Swallow",
    "switch",
    "Tattoo",
    "Threesome",
    "Tickling",
    "toned",
    "white"
  ],
  "title": "Slave Petition: Katharine Cane"
}