{
  "collections": [
    "Hogtied"
  ],
  "description": "Skin Diamond is a blend of unique beauty and maso-slut. Today, we challenge her with endurance bondage and predicament pain. In scene one, Skin is bound in a standing spread eagle in high heels. She gets a punishing tape gag, and is slowly stripped of her clothing and shoes. Finally we write words, her words, all member suggestions all over her body. Cunt, whore, trollop, cum trough… you’ll have to watch the update to find them all. Finally in come the buckets. Claire attaches one to a crotch rope, and the other two to nipple clamps and happily adds water to them. Skin has to endure this painful torment to get her reward… the best orgasms are induced under duress and this is no exception. In scene two, she starts in a hogtie-asphyx pose. The bondage is too extreme to do anything other than watch this hot cunt suffer… then in comes the crop and an anal hook with a transition into a more classic hog. Claire goes after Skin’s feet, repetitively cropping them and choking Skin until she has her first orgasm from foot torment. As a reward, she is hoisted into the air into a hogtie suspension. Finally Skin is bound in a frog/pile-driver/strappado tie. Precariously perched, more member requests are fulfilled with the wartenburg wheel and then a very challenging single leg suspension.",
  "directors": [
    {
      "name": "Claire Adams",
      "person_id": 46
    }
  ],
  "models": [
    {
      "name": "Skin Diamond",
      "person_id": 31494
    }
  ],
  "release_date": "2012-10-30",
  "scene_id": 26085,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Black",
    "black hair",
    "Bondage",
    "Choking",
    "Corporal Punishment",
    "Crop",
    "Crotch Rope",
    "Domination",
    "Feet",
    "Fingering",
    "Foot Torment",
    "Gag",
    "Handler",
    "High Heels",
    "Humiliation",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Rope Bondage",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "Vaginal Penetration"
  ],
  "title": "Skin Diamond Live Show - Complete Edited Version"
}