{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Darling is an experienced Ultimate Surrender wrestler who trains multiple disciplines when she's not on our mats. Adrianna Luna is an experienced MMA fighter with big dreams of showing porn sluts how real MMA fighters bang it out! Little does Adrianna know that Darling trains more than your average porn slut and knows our rules inside and out. Darling uses her mouthpiece to do some of the most memorable on-the-mat trash talking we've ever heard from her. It's clear she really enjoyed dominating this particular gal especially since Darling sways away from her tried and true technique of catch and release before the 1:30 mark. In this match we get some rare submissions done by our Grappler, Darling. She hardly ever goes for submissions but she had something to prove today. She pulled out all the stops against this MMA babe. This match isn't even close. Darling even finds a new ways to score style points in making her opponent worship her muscle while she immobilizes her. As if submitting to muscle domination and losing at a competitive wrestling match to a \"porn slut\" wasn't bad enough, Darling take the humiliation one step further and demands Adrianna strap on and fuck HER. Darling needs to see if Luna can do *something* good because she certainly isn't good at wrestling. What a treat for us viewers. We hardly see the winner get fucked and Darling sure deserved to get off after this match",
  "directors": [],
  "models": [
    {
      "name": "Adrianna Luna",
      "person_id": 35882
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2013-01-11",
  "scene_id": 26954,
  "tags": [
    "Anal",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Muscle",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "2 MMA trained babes bang it out on the mats in a sex wrestling match"
}