{
  "collections": [
    "TS Seduction"
  ],
  "description": "Another incredible threesome on TsSeduction.com debuting Nicki Hunter to the site and starring TS Venus and new talent, Chad Diamond. The Cops are hot on the trail of a local Dominatrix who has a dungeon in her house. Her clients are powerful men and the Cops want to expose this disgusting sex ring and shut her down. They secretly planted a camera in her dungeon and staged a stake out in her neighbors apartment. The plan is simple, the plan is set, the plan is about to fail. Caught in a sex ring with The Dom and her partner, Agent Diamond wakes up tied to the bed in inescapable rope with two women looking down at him with hungry eyes and vengeance. Nicki Hunter uses her whip tongue and punishing Dom skills to humiliate her bound cop. And her partner, Venus uses her cock to fuck Nicki while Nicki explains very explicitly why his cock would never be as big, as hard, or as satisfying as Venus's cock. The fucking goes on through the night until both Doms are convinced their little Copper friend confessions that he is truly turned on he is by all this sick punishment. Nicki allows him to fuck her pussy while Venus fucks her ass and the girls take turns fucking his mouth and ass with a great double anal fucking to stretch him out enough so Nikki can shove her vibrator in his ass and make herself squirt all over him while he is propped helpless in pile driver. That is not even the end - after Nicki squirts all over him, Venus pops a huge, streaming, never-ending load on his face and then the girls make him cum on his own face. Two loads of cum and a burst of squirt cover him and his face.",
  "directors": [],
  "models": [
    {
      "name": "Chad Diamond",
      "person_id": 42305
    },
    {
      "name": "Nicki Hunter",
      "person_id": 36853
    },
    {
      "name": "Venus Lux",
      "person_id": 41417
    }
  ],
  "release_date": "2013-01-09",
  "scene_id": 27850,
  "tags": [
    "Anal",
    "Asian",
    "black hair",
    "Blowjob",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Cop",
    "Dominatrix",
    "Double Anal",
    "dungeon",
    "fake boobs",
    "Male Sub",
    "Role Play",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "switch",
    "Threesome",
    "toned",
    "top",
    "TS",
    "TS Fucks Male",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "Feature Update:The Dom Next Door Turns Sting Operation into Threesome"
}