{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The Upper Floor dedicates its annual Halloween Party to commemorating The Popes work on TUF and welcoming back James Mogul. The House is introduced to James and o is assigned to be his personal slave for the evening. Lucky o is led around by some tight clover clamps on her nipples and made to entertain, which includes many clothespins and mental evaluations.\nMeanwhile, piggy and pistol are assigned to show off their skills as sex slaves for James and Master Acworth. Both sluts choke on cock and submissively offer their pussies to the lucky male guests as Peter interrogates them.\nThe party is packed to the roof with esteemed and salacious guests. Goddess Soma enjoys a long and tortured scene with her girl slave involving plastic mummification, breath play, squirting, crops, and clamps. A newcomer is tied up by Torque and used by four male guests as a sex toy. The Pope breaks out fluffy for one last go at kaos, who is suspended upside down and servicing Jack Hammer as she weathers the blows with grace. The night is filled with exciting bondage, single tails, blow jobs, cruel games, and lots of fucking. This is not an update to be missed, nor is its second half coming next week.",
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Lily LaBeau",
      "person_id": 25162
    },
    {
      "name": "Odile",
      "person_id": 33692
    },
    {
      "name": "Krysta Kaos",
      "person_id": 25624
    },
    {
      "name": "Beretta James",
      "person_id": 33659
    },
    {
      "name": "Dylan Ryan",
      "person_id": 10069
    },
    {
      "name": "Jack Hammer",
      "person_id": 18499
    },
    {
      "name": "Soma Snakeoil (Goddess Soma)",
      "person_id": 16475
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    },
    {
      "name": "James",
      "person_id": 10539
    }
  ],
  "release_date": "2012-11-23",
  "scene_id": 27869,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "clothespins",
    "clover clamps",
    "Corporal Punishment",
    "crop",
    "discipline",
    "female slave",
    "Hard Parties",
    "humiliation",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "Rough Sex",
    "single tail",
    "slave",
    "squirting",
    "straight",
    "The Pope"
  ],
  "title": "House Celebration: Welcome Back Mogul p. 1"
}