{
  "collections": [
    "Device Bondage"
  ],
  "description": "Nikki and Katharine are two of our toughest models and their live show was a solid example of what these bitches can take. In scene one they are bound in identical rigs and both get to face one another riding the wooden pony. Nipple torment, tickling of the feet, and single tail are all on the menu. Their gags are the panties from the other girl and these helpless bitches are worked up into a frenzy until they are finally fully suspended by the board nestled hard in their crotches!\n\nSecond, both girls give us their best spreads, face up and face down. Nikki is on top and Katharine’s face is right at pussy height. Katharine’s whole objective is to be a good cunt licker and get discerning Nikki off. The bitches are tormented with canes and rubber bands and Katharine is given an intense breath play predicament and pussy hook. Both are made to only cum at the same time. The pressure is on for each cunt to be a good fucked whore.\n\nFinally we revive a DeviceBondage classic position - the double sybian. Both Katharine and Nikki are bound for an intense joy ride and neck play predicament they will not soon forget. Both Mz Berlin and Claire Adams work the girls over with pain and pleasure. This is Nikki’s first time on a sybian and we get to observe what her surprise and awe is over the intense vibration. Keeping up score, the sybian adventure does not end until both girls have cum the same amount. The other has to keep riding in torment!",
  "directors": [
    {
      "name": "Claire Adams",
      "person_id": 46
    }
  ],
  "models": [
    {
      "name": "Katharine Cane",
      "person_id": 35830
    },
    {
      "name": "Mz Berlin",
      "person_id": 14228
    },
    {
      "name": "Nikki Darling",
      "person_id": 42508
    }
  ],
  "release_date": "2013-02-19",
  "scene_id": 28199,
  "tags": [
    "BDSM",
    "Big Tits",
    "Black",
    "black hair",
    "Bondage",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "fake boobs",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "Nipple Torment",
    "Pain",
    "Redhead",
    "shaved",
    "Single Tail",
    "slim",
    "Straight",
    "Submission",
    "switch",
    "Sybian",
    "Tattoo",
    "Tickling",
    "top",
    "white"
  ],
  "title": "Nikki Darling & Katharine Cane - Complete Edited Live Show"
}