{
  "collections": [
    "Device Bondage"
  ],
  "description": "In scene one, Andy is strapped to a kneeling x frame. A tight leather posture collar and shirt are wrapped around her head and neck. Claire adds water to Andy's new face mask, making it difficult to breathe. If you suck in air too fast, you suffocate. Control is key. She is stripped of her clothing, well most of it... and then her torment begins. Clothespins are placed all over her body. A vibrator is added to distract her from her discomfort and then the clothespins are removed with the single tail. Andy gets finished off with a thorough cunt fucking. Second, Andy is bound on a perch of sorts. She is very flexible in the hips, so her feet are bound together with leather straps and attached to her chest. Her knees are pulled open. She can struggle as much as she wants but there is no escape. There never really is escape from Device Bondage. Painful clamps are attached to her pussy and it is pulled open in a quadrant. Andy loves the pain and the pleasure is intensified with a firm paddling to her ass and thighs. She cums hard, long, and heavy. Her breath again is restricted through the breathing tube only and her moans echo through the room. Finally she is bound doggy on the table. The pussy hook returns and is now tied to Andy's hair - making Andy elevate into an uncomfortable arch. Andy is challenged with a very intense throat fucking and face slapping session. Her face beams with the pleasure from the pain and the orgasms are the most intense of the day. Welcome back Andy. We missed your cunt.",
  "directors": [
    {
      "name": "Claire Adams",
      "person_id": 46
    }
  ],
  "models": [
    {
      "name": "Andy San Dimas",
      "person_id": 14476
    }
  ],
  "release_date": "2013-01-25",
  "scene_id": 28193,
  "tags": [
    "Amazing Orgasms",
    "BDSM",
    "Bondage",
    "Clothespins",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Mask",
    "Metal Bondage",
    "Paddle",
    "Pain",
    "Single Tail",
    "Slapping",
    "Straight",
    "Submission",
    "Vibrator"
  ],
  "title": "Andy San Dimas - Control Is Key"
}