{
  "collections": [
    "Bound Gods"
  ],
  "description": "It’s the January Bound Gods Live show and we’re doing something we’ve never done before. In this 3 hour role playing event we feature Leo Forte and Sebastian Keys as the subs for Dom Morgan Black.\n\nThe state of Kinkistan has apprehended two hikers claiming to be models from the neighboring country of Moldavia. They are charged with espionage and their interrogation is broadcast live on the internet for the citizens to decide their fate. Under the supervision of Cmdr. Morgan the boys are given a thorough cavity search. Still pleading innocent the interrogation is amped up as the two spies are made to suck cock. Still claiming to be hikers, the boys fate lies in the audience decision. The verdict: guilty. The two are tied up to bamboo and fucked by the Commander while suspended in the mid air. Resigned to the fact that they are now sex slaves for the country of Kinkistan they beg for Cmdr. Morgan’s load then blow their own loads on the Commander’s foot and lick it clean.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "John Jammen",
      "person_id": 22596
    },
    {
      "name": "Leo Forte",
      "person_id": 22142
    },
    {
      "name": "Morgan Black",
      "person_id": 34934
    },
    {
      "name": "Scratch",
      "person_id": 30441
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Van Darkholme",
      "person_id": 15862
    }
  ],
  "release_date": "2013-02-28",
  "scene_id": 28343,
  "tags": [
    "Anal",
    "Asian",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "Hairy",
    "Humiliation",
    "Latinx",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Hikers or Spies - The audience hands out the verdict"
}