{
  "collections": [
    "The Training Of O"
  ],
  "description": "I the Task\nI am all for teaching a trainee about humility and dignity in manual labor, but four days of bagging this filthy hay is taking it's toll. She really needs to finish cleaning up this old barn set. This hay hangs in the air, it smells like shit and it is really unpleasant for the crew, me, and the slave slut trainee. I put a mask on her and tell her to hurry the fuck up while I whip her ass for motivation.\nII Shaving that Pussy\nShe is filthy and she stinks like horse shit. I drag her ass to the shower, and prepare to hose her off. I plan to teach her a few details about positions, like how to press the mound of of her cunt up into the air for a hand or a whip. When I reach down to grab a handful of that sexy mons pubis, I am shocked to find, what...stubble! What kind of slave shows up on graduation day with an unshaven pussy! I loose my shit, but manage to teach her a lesson on the value of a well groomed cunt that she will not soon forget.\nIII Sloppy Face Fuck\nWhen it come to sex, I usually need to see the slave girl doing the work. But not always. Sometimes I like to tie them down and see them pummeled mercilessly into sexual delirium. To wit, Pax's face fucking.\nIV Anal Orgasms\nWhat better way to finish an anal slut's training than to present her ass and pound her slutty asshole with a huge hard cock while vibrating her twitching little twat into multiple convulsive orgasms. Well done Pax. Now tell us, what did you learn this week?\nThis update contains: erotic manual labor, filthy slave girl discipline, slave shower, pussy shaving in chain bondage, erotic humiliation, sloppy face fucking, drooling blow job, anal orgasms in bondage, anal bondage, ass fucking the slave slut, anal slave training.",
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Rob Blu",
      "person_id": 39067
    }
  ],
  "release_date": "2013-05-10",
  "scene_id": 28388,
  "tags": [
    "humiliation",
    "bondage",
    "anal",
    "mask",
    "slave",
    "discipline"
  ],
  "title": "The Training of an Anal Slut, Final Day"
}