{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "See how the Season 10 Tag Teams Started. This is a republish of the Prelim for the Tag Teams for Season 10. This was first published in Feburary of season 10. Tag Finale for Season 10 in it’s entirety will be released 9/03/13. Don’t miss it!!!!\n\nWhat else could we name this epic battle??? This is the\nSuper Mega Awesome Battle Dream Supreme!!!!!!\n. We’ve got the “A team” on the mat. Some of today’s and yesteryear’s all stars clash on the mats in the most Epic shoot ever in the history of Ultimate Surrender. Dragon Lily and Syd Blackovich are this season’s team captains. They are 2 experienced team captains attempting to coach their teams to victory. They each get 5 girls on their team all of which are hand picked by them as part of the competition. The teams picked in this match are the permanent Tag teams for season 10 but today they battle in individual matches for their teams. The Coaches each have very different training methods for getting their teams ready for battle on the mats but both are extremely militant coaches. We have some scripted sexual training but we also have footage of the real “behind the scenes” of the coaches doing real strategizing and training with their teams.\nAll the Wrestling is 100% unscripted\n. Life is stranger than Fiction and no one would have written a script better than the reality these all-star wrestlers brought to the mats on their own.\n\nThere’s a coin toss. The winner of the coin toss is allowed to chose whether she wants to pick her first wrestler or if she wants to pick the first match up. Dragon wins the coin toss and she decides to pick the first wrestler. We go back and forth allowing the captains to pick their teams. For this Match, each girl must wrestle one 8 minute round. The losing team captain of the round gets to decide the next match up to give her an advantage in hopes of keeping this a closely contested battle. And close battle this is. Every single match has nail biting exciting moments. Because each girl only wrestles one 8 minute round, the rounds are much faster and more furious than a regular round of U/S. These girls put everything they have into their one round.\nThe score board is all over the place with both teams racking up points in every match. And just when you think the drama is over; just when you think you know who has won, there’s a surprise. The first EVER DQ in ultimate surrender history puts the DQ’ed wrestler’s teams at risk for getting fucked in the bitter end!!!!! This is the most intense and boldest shoot ever made in the history of Sexual Wrestling. The wrestling is elite level competitive grappling and the Orgy Prize round is masterfully executed by true winners who obviously have experience taking their spoils after victory\n**\n**\nBONUS**\n**\nEXTRA GANG BANG SCENE FOR YOUR PLEASURE\n**\nIzamar vs. Mistress Kara\nBella Wilde vs Odile\nBella Rossi v Cheyenne Jewel\nBerretta James v Serena Blair\nSahara Rain v. Tia Ling\nSyd Blackovich vs. Dragon Lily\n\nin over 2 hours of nonstop sexy action excitement the whole frat house can enjoy! This battle may be over but the war goes on. Tune in all year to see who wins the TAG TEAM Championship and gets to fuck the loser while they wear their belts!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Bella Wilde",
      "person_id": 39990
    },
    {
      "name": "Beretta James",
      "person_id": 33659
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "DragonLily",
      "person_id": 3433
    },
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    },
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Odile",
      "person_id": 33692
    },
    {
      "name": "Sahara Rain",
      "person_id": 36730
    },
    {
      "name": "Serena Blair",
      "person_id": 31165
    },
    {
      "name": "Syd Blakovich",
      "person_id": 7618
    },
    {
      "name": "Tia Ling",
      "person_id": 17361
    }
  ],
  "release_date": "2013-08-29",
  "scene_id": 28439,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Asian",
    "Athletic",
    "Big Ass",
    "Big Natural Tits",
    "Big Tits",
    "Bizarre",
    "black hair",
    "Blonde",
    "Blowjob",
    "bottom",
    "Brunette",
    "Champion",
    "Choking",
    "Curvy",
    "Discipline",
    "Domination",
    "Double Penetration",
    "Facesitting",
    "Facefucking",
    "fake boobs",
    "Fingering",
    "Hair Pulling",
    "Humiliation",
    "Interracial",
    "Latinx",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "mixed",
    "Muscle",
    "muscular",
    "natural boobs",
    "Nipple Torment",
    "Orgy",
    "other hair color",
    "Pain",
    "Pussy Eating",
    "Redhead",
    "Rimming",
    "shaped",
    "shaved",
    "Slapping",
    "slim",
    "Small Tits",
    "Spanking",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tag Team",
    "Tattoo",
    "toned",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "See how the Season 10 Tag Teams Started Super Mega Awesome Battle Dream Supreme"
}