{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Audrey Rose\n“The Thorn”\nHt: 5’5”\nWT: 130lbs\nnot including this match Season W/L record ( 0-0)\nLifetime W/L record (1-2)\n\nMissy Minx\n“The Miracle Maker”\nHt: 5’5”\nWT: 130lbs\nSeason W/L record (0-0)\n\nAudrey “the Thorn” Rose is back for her second season making this her 4th US match. Missy “The Miracle Maker” Minx is here for her very first match for Ultimate surrender. She’s hoping to pull off a miracle and take down the vet in her first match ever. Audrey has a little bit of ring rust. It’s been a while since she’s been on the mats and it shows in this match up. This is the Miracle makers first match and it’s a close one in the final round. Audrey has the heart of a lion in this match. She refuses to lose, especially to a rookie. But this rookie is named the “miracle Maker” for a reason. She’s been known to pull of miraculous deeds in real life and she thinks she can get the win today. She gets Audrey into some tough spots but her lack of knowledge of our points rules may be her demise. Will she be able to be the Miracle Maker today or will a loss today forever be “the Thorn” in her side, haunting her record for the rest of her life?",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Audrey Rose",
      "person_id": 31792
    },
    {
      "name": "Missy Minks",
      "person_id": 27930
    }
  ],
  "release_date": "2013-02-22",
  "scene_id": 28446,
  "tags": [
    "Anal",
    "Brunette",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Latinx",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Awesome Light Weight match up with \"the Thorn\" vs \"The miracle Maker\""
}