{
  "collections": [
    "Device Bondage"
  ],
  "description": "Hot and willing Cassandra wants to get pushed as hard as she can take it. Today is no exception. In a no holds live shoot there is no recanting, breaks, moments she can catch her breath. Nothing. She submits and she endures.\nFirst, our bitch du jour is bound in a chair style position as Asa Archer is bound in a standing spread eagle watching. A tall and severe metal neck collar keeps Cassandra tightly in position. Claire adds to the predicament by adding nose and mouth hooks. When Cassandra tries to close her mouth, it pulls on both hooks. Mean clover clamps are added to Cassandra's labia and then attached to another set at her nipples. Claire and Mz take turns tormenting and administering pain until immense squirting orgasms are wrenched from this more than eager to cum whore.Next, Cassandra's head is bifurcated and trapped under the neck stockade she is kneeling on, with her arms in a very strict strappado. The worst thing about the bifurcation game is never knowing when the pain is going to come and always breaks even the toughest girls. Cassandra crumbles from fear, as expected but its incredibly hot to watch her try and maintain composure over the hell she is enduring. Claire canes and single tails while Mz plays the \"good cop\" with the vibrator until both assault her hungry cunt for more cum.Still not stopping, Cassandra is finally bound in the scavenger's daughter bilbos. A very severe metal mouth gag is installed deep into Cassandra's mouth, taking all of her attention to not gag on the ball on the metal bar. Claire adds a zipper to Cassandra's extended leg and talks serious trash, degrading and humiliating our princess for your viewing pleasure. Mz is relentless with the vibrator and hands deep inside Cassandra's willing cunt. Orgasm after orgasm Cassandra's only purpose is to give us a show, and indeed she does.",
  "models": [
    {
      "name": "Cassandra Nix",
      "person_id": 36857
    },
    {
      "name": "Mz Berlin",
      "person_id": 14228
    },
    {
      "name": "Asa Archer",
      "person_id": 41051
    }
  ],
  "release_date": "2013-03-08",
  "scene_id": 28821,
  "tags": [
    "bdsm",
    "bondage",
    "clover clamps",
    "collar",
    "cop",
    "Corporal Punishment",
    "domination",
    "Fingering",
    "gag",
    "Handler",
    "humiliation",
    "metal bondage",
    "pain",
    "single tail",
    "squirting",
    "straight",
    "submission",
    "vibrator",
    "zipper"
  ],
  "title": "No Holds - Cassandra Nix"
}