{
  "collections": [
    "Bound Gods"
  ],
  "description": "Sebastian is working down by the docks at Pier 49 as a mysterious man, Rob Yaeger, dressed in leather walks by. Confused, Sebastian goes back to his work. Rob turns around to ask for directions before enquiring why Sebastian's there working all alone. After discovering that Sebastian's co-worker called out, Rob sees his window of opportunity. He pounces on the dockworker and wrestles him to the ground and knocks him out. When Sebastian comes to he finds himself bound with duct tape around his mouth. Rob tears a hole for the mouth and shoves his cock down Sebastian's throat before flogging him from front to back. Bound on a shipping crate, Rob bends his new sub over and fucks his ass to the sounds of Sebastian's muffled screams. The bound ginger has clothespins clipped to his whole body as they're tied down to the shipping crate. Rob suspends Sebastian and the crate in mid-air before letting the crate go, ripping a full body zipper off of the screaming stud. On his knees, Sebastian takes a final fucking before receiving Rob's cum all over his face. Rob milks a load out of Sebastian's cock before leaving him tied up, covered in cum for his co-workers to find.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Rob Yaeger",
      "person_id": 45103
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2013-07-18",
  "scene_id": 29071,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Redhead",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Sub",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white",
    "Zipper"
  ],
  "title": "Dockworker gets taken down and fucked by a leather dom"
}