{
  "collections": [
    "Foot Worship"
  ],
  "description": "FootWorship.com is all about bringing you firsts and this week we have another footastic first for you! Footsploitation, nunsploitation, lesbians and FULL FOOTING! You saw it here first a full foot filling a foot hungry pussy!\nGia Dimarco plays a reformed bad girl training for the nun hood yet she can't seem to get her filthy, kinky foot fetish thoughts out of her head. Maitresse Madeline, the head nun has invaded sister Gia's thoughts and Madeline worships, licks, sucks and sniffs sister Gia's beautiful toesies and arches. She masturbates with them hidden away in her quarters ashamed for her taboo lesbian foot fetish tendencies. Sister Gia worships Madeline's gorgeous French pedicure and both nuns take each others toes inside their pussies and assholes! Double penetration with both feet! And, as if that weren't enough Madeline fucks Gia's hungry pussy with her feet for a FULL FOOTING until she squirts all over Madeline's digits!\nThis shoot has it all! Hot nun lesbians, taboo, foot worship full footing and squirting female ejaculation all over feet, toes and arches! Don't miss out on the dirtiest foot fetish fantasy of your life!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 17872
    }
  ],
  "release_date": "2013-12-26",
  "scene_id": 29102,
  "tags": [
    "Blonde",
    "bottom",
    "Brunette",
    "Dominatrix",
    "Double Penetration",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fetish",
    "foot fetish",
    "Foot Worship",
    "Footing",
    "Hood",
    "Kinky",
    "Lesbian",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Squirting",
    "Straight",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Classic Archive: A Convent Of Foot Sinners: Footsploitation, Nunsploitation, Blasphemy and FULL FOOT"
}