{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Bella Rossi\n“The Annihilator”\nHT:5’5\nWT:135\nLifetime W/L (8-3)\nSeason Record (1-1)\n\nAlice Frost\n“The Killing”\nHT:5’7\nWT:135\nLifetime W/L (2-0)\nSeason Record (2-0)\n\nSpoiler alert! Bella wins. Surprising I know. Alice has been improving as she spends more time on the mats. Today she tries really hard not to give up the pussy. She locks her legs closed and gives Bella a hard time. Bella is bored with this cake walk of a match and we see a rare mean streak come out. She goes for 3 leg scissor submissions and gets them. After the first submission we see Alice’s demeanor change a bit. She realizes she’s in for a working over like she’s never had at U/S before. She feels a pressure she’s never known and it takes a toll on her mentally from the get-go. This match is a fascinating mental game. Sure we knew Alice was going to lose to Bella but we had no idea what a toll those submissions would have on Alice. She”s sick of losing now; she wants to win. After feeling the power of Bella’s thighs, she’s totally inspired. Alice wants that power. We predict she will be back stronger than ever in her next match.\n\nRound 4\nBella does her trade mark Standing 69 on the sexy blond. She then leg lifts Alice up and down onto a dick on a stick then strap on fuck’s Alice’s asshole so good she makes Alice have 4 anal Orgasms while she tosses Ariel’s Salad",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Alice Frost",
      "person_id": 33888
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2013-04-05",
  "scene_id": 29257,
  "tags": [
    "69 Position",
    "Anal",
    "Big Tits",
    "blond",
    "Blonde",
    "Curvy",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "I'll have my Salad Tossed please Alice Frost"
}