{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Season 10 prelim for WW tournmant\nwinner gets the #5 spot in the single elimination seeded tournament and chance to be crowned Champion AND gets the Loser’s\nAnal Virginity\n\nYasmine Loven\n“The Lightening Bolt”\nHT:5’3\nWT:135\nLife Time W/L (2-2)\nSeason W/L (1-1)\n\nElizabeth Thorn\n“The Dil-Dozer”\nHT:5’7\nWT:135\nLife Time W/L (0-0)\nSeason W/L (0-0)\n\nWelterweights are often the\nBest Selling\nmatches we have. The combatants are strong, calculating and technical or sometimes just down right bullies who bull-doze their way to a dominant position. These two babes don’t disappoint.\nThey use their size and weight on each other to completely physically and sexually dominate each other.\nThis is Elizabeth’s very first match but she’s fit and as a youth she earned student black belts in taekwondo, Bjj and Eskrima. But it’s been a long times since she’s used any of her “fight” skills and U/S is a different ball game. One must learn how to be dominant while still doing things of a sexual nature to her opponent. It’s a lot harder than it sounds, especially for a traditional martial artist.\n\nYasmine has been doing extremely well. Her only loss this season was to our #1 ranked wrestler. She’s working her way to the top. Elizabeth is coming into U/S late in the season. She does not have a spot in the much anticipated first ever official US welter-weight tournament but neither does Yasmine. These two battle babes need to scrap it out today to see who will make it into the Welter Weight Tournament. As if losing your spot in a tournament and having someone take a job from you wasn’t bad enough, the loser gets a solid first time anal fucking with a good sized dong. Is Yasmine going to strike her cock like a “lightening bolt” in to Elizabeth butthole? or does Elizabeth’s get to Dil-Doze-her opponent in the Starfish?",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Elizabeth Thorn",
      "person_id": 40429
    },
    {
      "name": "Yasmine Loven",
      "person_id": 37660
    }
  ],
  "release_date": "2013-03-29",
  "scene_id": 29348,
  "tags": [
    "Anal",
    "black hair",
    "Champion",
    "Curvy",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Latinx",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Weights",
    "white",
    "Wrestling"
  ],
  "title": "Adrenaline Pumping Welther Weight Battle for the tournament #5 spot"
}