{
  "collections": [
    "Device Bondage"
  ],
  "description": "Andy is a relentless submissive beauty that wants it all, badly. To the extreme that DeviceBondage can dish out and Orlando can deliver, she is mercilessly beat, put in amazing bondage, and fucked to where she forgets her name... all live, with NO holds. There is no forgiveness. This is the real deal.SCENE 1\nThe brunette cunt is bound intricately in a standing spread eagle metal pipe assembly. Her hair is bound tight and fanned across the pipe structure, preventing Andy from ever possibly moving her head. Orlando re-introduces the cunt to intense breast flogging, heavy labial weights, nipple weights, and this is just the warm up.SCENE 2\nCunt is plastered in an open frog position with pipes against a wood platform. A rope is tight across its neck and a blindfold obscures its eyes. A black clip zipper is threaded across the creamy skin and the neck choke is increased and decreased... choking. The skin on its face gets bright red and then the rope is released. A vibrator is installed on its cunt. There is no choice but to cum. Again and again and again.SCENE 3\nAndy is bound on her knees, like the dirty whore she is. She is in fuck position. Orlando sadistically canes her ass as Lola looks on, watching the spectacle. We've been waiting for this moment... to see the whore's cunt get filled and rammed with the fucking machine, hand held and wielded by Orlando. Drunk from cum, she is filled to the brim with pain and pleasure sensations.BONUS\nThere is an additional scene added after the interview for you. It features the interaction between Mz Berlin and Deco Hottie Lola Marx .",
  "directors": [
    {
      "name": "Claire Adams",
      "person_id": 46
    }
  ],
  "models": [
    {
      "name": "Andy San Dimas",
      "person_id": 14476
    },
    {
      "name": "Orlando",
      "person_id": 16649
    },
    {
      "name": "Mz Berlin",
      "person_id": 14228
    },
    {
      "name": "Lola Marx",
      "person_id": 32739
    }
  ],
  "release_date": "2013-04-05",
  "scene_id": 29527,
  "tags": [
    "BDSM",
    "Blindfold",
    "Bondage",
    "Brunette",
    "Caning",
    "Choking",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "Pain",
    "Straight",
    "Submission",
    "Vibrator",
    "Weights",
    "Zipper"
  ],
  "title": "Relentless - Andy San Dimas "
}