{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Stats at time of post: Yasmine Loven\nranked 5th\n\"The Lightening Bolt\"\nHT: 5'2\nWT:140\nSeason record (2-1)\nLifetime record (3-2)Penny Barber\nRanked 4th\n\"The Tarrasque\"\nHT:5'6\nWT: 145\nSeason record (2-0)\nLifetime record (4-1)\nWelcome the to the first EVER welter weight tournament for Ultimate Surrender. the Top 5 girls of each weight class will battle it out in Season 10 to determine who the best of the best of their size is.\nToday, Yasmine Loven meets Penny Barber. Yasmine is ranked 5th. She's going against Penny who is Ranked 4th and likes to Lactate on girls during the match. The winner of the match goes on to meet Mistress Kara ( ranked 1st) in the Semi finals.\nWelter weight matches are some of our best selling matches. Men and women alike love to see two big strong women clash on the mats. And today the men and women get what they want. This match is so action packed, so energy driven that it was destined to end early because things got too intense. This match does go 2 full rounds but the ref calls an early stoppage with concern for model safety. The victor gets her prize and even has a consolation prize for the poor loser who is now out of the tournament. The winner baked the loser a cake, feeds it to her through all her holes and makes her wash it down with Lactated milk",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Yasmine Loven",
      "person_id": 37660
    }
  ],
  "release_date": "2013-04-19",
  "scene_id": 29529,
  "tags": [
    "Anal",
    "black hair",
    "Brunette",
    "Curvy",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Weights",
    "white",
    "Wrestling"
  ],
  "title": "Super Voluptuous Welter Weights battle it out in the Quarter finals."
}