{
  "collections": [
    "Electrosluts"
  ],
  "description": "Live show for your pleasure: Lorelei Lee and Aiden Starr team up as wicked blondes with devious intentions. Annika is a seasoned slave making a special appearance on Electrosluts, and Wenona brings her own unique sexiness to the scene.\n\nRight away the girls are made to service Aiden and Loreleis beautiful pussies while enjoying the pain of the Violet-wand, Zapper, Sticky-pads and\nmore cruel surprises\n. Wenona glistens with sweat as the electricity passes over her toned body. Annika stoically endures as her voluptuous curves are methodically teased and tormented with electrical currents.\n\nFor the pleasure of the viewers- this is a beautifully symmetrical composition with the girls clamped together by their whorish pussy lips while simultaneously licking and sucking Lorelei’s cunt. Of course their hungry holes are not forgotten: Aiden and Lorelei fuck them with electric dildo’s and stuff their asses with electric butt-plugs. The sluts are wild with electricity and can’t help but cum again and again!",
  "directors": [],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Annika",
      "person_id": 27904
    },
    {
      "name": "Lorelei Lee",
      "person_id": 758
    },
    {
      "name": "Wenona",
      "person_id": 4485
    }
  ],
  "release_date": "2014-04-13",
  "scene_id": 29538,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "bottom",
    "Brunette",
    "Cattle Prod",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Domination",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Tattoo",
    "Tens Unit",
    "toned",
    "white",
    "Zapper"
  ],
  "title": "Live! Beauties submit to wild electric domination."
}