{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the the First EVER ultimate surrender Welter weight Mini Tournament. We gathered the top five girls of each weight class and they are battling it out to see who the toughest of tough is.\nToday we have a rematch long in the waiting. Back in 2011, Izamar ( La Diabla) waltzed on to the U/S mats for the first time as a rookie and destroyed Bella Rossi. This was devastating for Bella. This loss stays on her permanent record. Her record is forever tarnished and she is humiliated after losing to a \"rookie\". Today Bella is out for Redemption. She knows that if she wins she gets a chance to go against Mistress Kara. Both Izamar and Bella have losses to M. Kara this season. Both want nothing more than the chance to meet Kara in the finals and show dominance once and for all and get their records straight.Bella Rossi \"The Annihilator\"\nranked 3rdHT:5'5WT:145Season Record ( 2-1)\nLifetime Record (9-3)Izamar Gutierrez\"La Diabla\" Ranked 2nd\nHT:5'3\nWT:145\nSeason Record (2-1)\nLifetime Record (4-2)both girls want this win bad. But one wants it just a little more. Even though this match puts 2nd against 3rd, it's almost like we put a rookie with a vet again. This is basically a squash match. One wrestler dominates so much the ref gives the losing wrestler \"shame\" points. The loser loses sooooo badly that the Ref decides she doesn't even want to see the loser get fucked. She decided the loser gets to sit and watch her fuck the winner while the loser sits and watches the whole thing. Poor fucking loser. Loser get's turned into a cuckold for the first part of the prize round. Poor bastard!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2013-05-03",
  "scene_id": 29531,
  "tags": [
    "Anal",
    "Cuckolding",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Welter Weight Semi-final match La Diabla vs The Annihilator V2.0"
}