{
  "collections": [
    "The Training Of O"
  ],
  "description": "I First Impressions\nShe looks hot in that little dress. Tits press hard against the fabric, straining for release. Her ass jiggles in tight sheer panties underneath. Combined with that slutty, submissive gaze my dick hardens just looking at her. This is the new trainee, Audrey Hollander.\nShe has been taking it in the ass and deep thoating cock on porn sets for 8 years, but her knowledge of our world is limited. She is skittish, used to getting slapped around by heavy handed porn dudes for the fuck of it. It is safe to say we need to build a little trust if this is going to work.\nII the Interview\nI decide to start slowly with this one. First things first, I tie up those round, full tits and cut her out of that slutty little dress. A flogger gets me the information I need to begin building a training plan. She is eager to please but unsure of how much latitude to give me. So I show her I can play nice.\nIII Slutty Asshole\nOne thing I am sure of is that she likes it in the ass the best. Bend her over a bench with her legs spread wide, and tie her tightly into place. Her sluttle asshole is pulled open by the coarse hemp rope, and her hips are immoble. I find the largest rubber dick in the cart and begin to fuck her ass with it to illustrate just how much she likes it.\nIV Nipple Training\nHer nipples are super sensitive and she thinks that is a weakness. She protects them. As a dominant, the best way to get what you want from a submissive is to show it is in the submissive's best interest to let you do what you want. And I want those tits and nipples. So I make a pitch to train her to orgasm from nipple stimulation. Open, says me.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Audrey Hollander",
      "person_id": 11450
    }
  ],
  "release_date": "2013-04-26",
  "scene_id": 29657,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Slave",
    "Straight",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "The Training of a Party Girl, Day One"
}