{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to Season 10 Summer Vengeance. We have a very special match up today with two European babes on our mats. This match could possible be the start of world war 3.\n\nBella Wilde\n“the Wolf”\nranked 11th\n5’4 125lbs\n\nLea Lexis\n“The Romanian Rager”\nranked 12th\n5’4 125lbs\n\nThe Romanian vs the German, this match is action packed with control moving back anf forth between the wrestlers. What it comes down to is one wrestler knowing how to score points a little better than the other. It’s always sad when someone performs well, overpowers another wrestler only to lose because she allowed the fingers to get in her pussy. That’s what happened today. I smell rematch in the near future but for today one is out of the tournament and the other moves on to meet Darling. good luck.\n\nThe Loser of this match was so genuinely humiliated and upset just from losing, the winner felt she didn’t need to fuck her in a manner that was over the top humiliating. Both these girls are gymnasts. The winner wanted to show off her acrobatic abilities and does some unique lifts for round 4. Winner fucks the loser how she wants and this winner wanted to use and abuse, bend and stretch her opponent in all kinds of ways. But we had to have some humilation to our round 4. The Loser can’t get off\nthat\neasily. The loser gets snap mared and stretched then squirted on and laid down with a clothes line.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Bella Wilde",
      "person_id": 39990
    },
    {
      "name": "Lea Lexis",
      "person_id": 17836
    }
  ],
  "release_date": "2013-07-05",
  "scene_id": 29680,
  "tags": [
    "Anal",
    "Blonde",
    "Domination",
    "Facesitting",
    "Fingering",
    "German",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Summer Vengeance Season 10, European Battle on US mats"
}