{
  "collections": [
    "Bound in Public"
  ],
  "description": "In this epic BIP episode: The cells are full of loud, horny prisoners and every officer is keeping watch. A new troublesome inmate, Jeremy Stevens, is brought in. Jeremy is told to remove his clothes and spread his legs for the strip search. The officers check his hairy pink hole for any contraband or weapons. Once he is cleared, the warden informs the officers that Jeremy is a \"high-risk\" sex offender, and should be held in solitary confinement. Jeremy becomes enraged, stripping down to his underwear, tearing apart his cell and when the guards yell at him he throws his bucket of piss right in their faces. Immediately the officers put on their riot gear and prepare for cell extraction. Jeremy is wrestled down and made to suck cock, gasping for air from one cock to the next. Jeremy is fucked by one of his fellow inmates while the officers pin him down. Cocks are lined up the stairway as the guards each fuck the prisoners mouth all the way down his throat. The guards then take turns fucking his tight hole one more time before blowing their loads all over his face and muscled body.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 46426
    },
    {
      "name": "Hayden Richards",
      "person_id": 47285
    },
    {
      "name": "Jeremy Stevens",
      "person_id": 40364
    }
  ],
  "release_date": "2014-12-12",
  "scene_id": 29924,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "brunet",
    "Cock Worship",
    "Domination",
    "Facial",
    "foreskin",
    "Gangbang",
    "Gay",
    "Hairy",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Public",
    "Redhead",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "Stud",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Voyeur",
    "white"
  ],
  "title": "Lockup, Cell Extraction & Prison Gang Fuck"
}