{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Its the second match for the tag team season.\nTeam Dragon\nSerena Blair (wrestler)\nMistress Kara (wrestler)\nDragon Lily ( coach)\npoints last match 818\ntotal season points 818\n\nTeam Nightmare\nIsamar Gutierrez(wrestler)\nBeretta James (wrestler)\nSyd Blakovich (coach)\npoints last match 1278\ntotal season points 1278\n\nThe Team Captains are also back to help coach their teams to victory from the side lines. Team Nightmare won the last match with 1278 points to Dragon’s 818. This puts Nightmare in the lead by 460pts. A great way to the season. The points are added up month by month towards the final score. For this match the score board will start at 0-0. Winners of individual matches still get to fuck the losers but at the end of the season it doesn’t matter if you won your individual matches. If you lose in the end you’re getting fucked in the end. Team mates will be hating each other if they get fucked because their teammates screw dont work hard enough in their matches. If you slack you get the plastic dildo nut sac!\n\nIsamar and Kara are bitter rivals. The are both use to being on top and winning but when they clash on the mat at US there can only be one dominant wrestle. Anal virginity is on the line for this match. Both wrestlers are confident that they will lead their team to victory; they are putting their money where their virginity is. They stay in for almost half of this first round before either uses a tag. Was it mutual despise for each other that kept them in? was it that they didn’t trust their team mate to be able to handle business on the mat? or was it that they really have big girl boners for each other and can’t get enough of each other so they forget anyone was in the room and had a little almost violent romance on the mat? I’ll let you decide but this can not go without saying. This is a must see!!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Beretta James",
      "person_id": 33659
    },
    {
      "name": "DragonLily",
      "person_id": 3433
    },
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    },
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Serena Blair",
      "person_id": 31165
    },
    {
      "name": "Syd Blakovich",
      "person_id": 7618
    }
  ],
  "release_date": "2013-03-26",
  "scene_id": 30082,
  "tags": [
    "Anal",
    "Asian",
    "black hair",
    "bottom",
    "Brunette",
    "Curvy",
    "Dildo",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Latinx",
    "Lesbian",
    "LezDom",
    "mixed",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "romance",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tag Team",
    "Tattoo",
    "toned",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Team Dragon vs. Team Nightmare Match #2 for Season 10"
}