{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Stats day of shoot\n\nPenny Barber\nRanked 4th\nrecords at time match posted:\nSeason W/L (3-0)\nLifetime W/L (5-1)\n\nMistress Kara\nRanked 1st\nrecords at time match posted:\nSeason W/L (3-0)\nLifetime W/L (3-0)\n\nYasmine Loven was one of the most promising wrestlers this season and Penny Barber Squashed her with ease in their last match. Penny moves on in single elimination seeded tournament. She’s been improving greatly with each match and we’re pretty sure that has something to do with being coached by Dragon while she’s in the tag matches. However, Today she is going up against our #1 welter Weight, Mistress Kara. Although Kara is considered a “rookie” to Ultimate Surrender, she’s been mopping the floor with elite wrestlers left and right and she is ranked #2 in the all arounds, just under Syd Blackovich. Penny tries her Lacticts in this match but they just don’t work. Kara even gives Penny an opportunity to make up for being such a horrible sex gladiator by challenging Penny to a submission wrestling match just after they finish round 3. The submissions in this segment do NOT count on Kara’s record since they are NOT in the competitive rounds 1 2 or 3. The only submission Penny is able to even get close to getting on Kara is “Smoother by milk” and she even Fails at that.\n\nBonus Submission challenge in the Prize round. Kara Mops the floor with Penny in rounds 1 2 and 3 then challenges her to a submission match before she fucks her and ties up up in a camel clutch and dunks Penny’s face into a pie.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    }
  ],
  "release_date": "2013-04-26",
  "scene_id": 30099,
  "tags": [
    "Anal",
    "Brunette",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "shaped",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Welter Weight Semi Finals Penny Barber vs. Mistress Kara"
}