{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Over the years there have been many men who've walked through the Armory doors wanting to adore me. Many of them were amazingly talented and awesome and many of them completely unworthy of my attention but never someone like Will Havoc. You see, Will is in another category, a category all his own. Seriously, this is the type of man I would date!\nI reckon you've learned during the four years of my reign as head mistress and director of Divine Bitches that being a dominatrix doesn't mean you have to swear off sex, be cold as ice and never touch another man sexually nor does it mean you are some man hating feminist, quite to the contrary actually. It infuriates me when people consider this stereotype about a dominatrix that almost puts us in this asexual category as if we're faltering if we show our sexual needs or we can't be tough while exposing that side. I find it sexy that I AM horny ALL the time. I yearn for sex and HAVE to have it. I celebrate LOVING men. I adore men. I want to fuck men and most of all I love to hurt men from the bottom of my heart and with all the passion in my soul.\nWill is the first man that walked through these doors with all my non negotiables in tact. Cool confidence, unabashed kinkiness, intelligence, rugged attitude, impossibly handsome looks and he studied ballet for god sakes! This is one well rounded cultured dude! All I really wanted to do was ask him out, climb on top of him and do dirty, filthy things to him while he slid his cock inside me, not sock him in the nuts! But, like all good dominatrix I remained professional and did what I do best which was seduce the fuck out of this guy, make all his wildest fantasies come true, show him what it feels like to be at the mercy of a strong woman and milk his prostate like there's no tomorrow. The only unfortunate thing is for you because once the shoot was over, the real fun began and the cameras weren't rolling. I suppose you'll just have to let YOUR dirtiest fantasies wander.\nJust like I did mine...................\nFor the love of kink,\nM.M.~",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 17872
    },
    {
      "name": "Will Havoc",
      "person_id": 46285
    }
  ],
  "release_date": "2013-04-24",
  "scene_id": 30165,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blonde",
    "Bondage",
    "bottom",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "slim",
    "Straight",
    "Tattoo",
    "top",
    "unshaved",
    "white"
  ],
  "title": "One In A Million..........."
}