{
  "collections": [
    "Device Bondage"
  ],
  "description": "Straight from Japan, Marica Hase is a famous starlet in her native country. She also has experience working with some of the best Japanese bondage riggers. Today, she gets a lesson on DeviceBondage - American style. Each scene has an element which ties into her cultural references of feeling disgraced: objectification, humiliation, and bukkake.BUKKAKE\nMarica starts her day on Device already clearly well used. The white oozing nectar drips from her chin, collecting in a pile on the floor. Naturally, we have to follow in the footsteps of clearly where others have been. Marica is tormented with the cane, nipple clamps, face torment, and made to jerk a thick black cock off.HUMILIATION\nShe is bound in a forward bend strappado with hooks in her nose and mouth, made to stare at herself in the mirror. Labial clamps are attached to the nipple clamps. She is flogged, hard. Her ass and cunt get violated at the same time as she gets a vibrator on her clit. She drools on her reflection.OBJECTIFICATION\nMarica is bound in a strict leather single arm binder and strap bondage. Her binds form her into a ball of sex. Completely helpless her only use is to be a sex object. Her ass is spanked a nice cherry red and she is hoisted into the air. The object is spinned and single tailed. A dick on a stick with a vibrator is tied into it. It cums because it knows that is its purpose and all it is good for.",
  "directors": [
    {
      "name": "Claire Adams",
      "person_id": 46
    }
  ],
  "models": [
    {
      "name": "Marica Hase",
      "person_id": 44408
    }
  ],
  "release_date": "2013-05-03",
  "scene_id": 30174,
  "tags": [
    "BDSM",
    "Bondage",
    "bukkake",
    "Corporal Punishment",
    "Domination",
    "Facial",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "Nipple Clamps",
    "Single Tail",
    "Straight",
    "Submission",
    "Vibrator",
    "white"
  ],
  "title": "Cum Whore"
}