{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Stats at time of shoot\nAudrey Rose\n“The Thorn”\nranked 1st\nHT: 5’5\nWT:114\nSeason record (0-1)\nLifetime record (0-1)\n\nSerena Blair\nRanked 4th\n“The Jockey”\nHT:5’0\nWT: 100\nSeason record (2-0)\nLifetime record (2-3)\n\nSerena isn’t just one of the smallest competitors for Summer Vengeance, she’s even one of the smaller wrestlers in the feather Weight Tournament which is saying something cause those feather weights are tiny as all hell. She’s giving up at least 14 lbs for this match against Audrey. Serena has been busting her ass in grappling classes and she’s got her eye on the prize. She wants that belt and she doesn’t care if Audrey is just one more giant standing in her way. She’s ready to take what she wants. Audrey is stepping in to our tournament last minute on account that Tia Ling dropped out. She’s on a winning streak since she’s come back to US. She doesn’t seem to care much for the tournament, she’s more in this to beat up on little girls. Audrey is the BIGGEST feather weight in this tournament.\nThis is one of the most heart breaking matches I’ve ever witnessed. Very early on in the match it’s clear that one of these wrestlers wants to win more than the other. There is sweat and tears shed on this mat in a bitterly close rivalry. It’s back and forth action for 22 minutes of the match. at the last minutes of this match you can literally see one of the wrestlers mentally break and the match is decided just about 1 minute before the buzzer goes off. You will laugh, you will cry. These girls put their heart and souls into this game and it’s always heart breaking to see anyone lose when they put THAT much of themselves into a match. This match will go down in history as one of the GREATEST wars in U/S history and we smell rematch in season 11.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Audrey Rose",
      "person_id": 31792
    },
    {
      "name": "Serena Blair",
      "person_id": 31165
    }
  ],
  "release_date": "2013-05-17",
  "scene_id": 30413,
  "tags": [
    "Anal",
    "Brunette",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Latinx",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaped",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "tournament",
    "Vaginal Penetration",
    "Weights",
    "white",
    "Wrestling"
  ],
  "title": "Feather Weight Semi Finals #2 vs #4 only 1 can move on to finals"
}