{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Just a reminder that the Welterweight finals are going to be shot LIVE May 17th 12pm PST. This week’s update marks the start of the feather weight Tournament. If you miss the live WW bout, you will have to wait for it to update. You do NOT wanna miss the live show!!!\n\nstats at time of shoot:\n\n**Nikki Darling\n**ranked 5th\n“Trickie”\nHT: 5’3\nWT:110\nSeason record (0-1)\nLifetime record (0-1)\n\nSerena Blair\nRanked 4th\n“The Jockey”\nHT:5’0\nWT: 100\nSeason record (2-0)\nLifetime record (2-3)\n\nSerena Blair is officially the smallest girl on our roster. Tia Ling had to drop out of the tournament so Serena has No one her size to fight anymore. But with Tia out, that gives Serena an open window to take the belt. Nikki Darling has only had one US match. She probably has no business being in this tournament however, Berretta James couldn’t do the match and Nikki Darling was the only FW willing to step in last minute to fill the spot. It take balls to enter a tournament last minute and it takes balls to talk the mean game Nikki talks. Nikki doesn’t have as much experience but she still has a size advantage over Serena which could make the difference.\nThis is one of the sexiest matches we’ve seen on U/S in a long long time. One of the wrestlers is able to trap her opponent on the mat for over 5 minutes and rip 4 orgasms out. Then the buzzers goes off after round 2, they restart for round 3 and again the wrestler is trapped and getting finger blasted to orgasm.\n6 ORGASMS\non the mat and one of the highest scores ever posted on US score boards! This match will go down in history.\n\nLosers get’s stretched in a double bow and arrow. Her legs worn down with a figure four leg lock while the winner makes her eat winner pussy!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Nikki Darling",
      "person_id": 42508
    },
    {
      "name": "Serena Blair",
      "person_id": 31165
    }
  ],
  "release_date": "2013-05-10",
  "scene_id": 30411,
  "tags": [
    "Anal",
    "Black",
    "black hair",
    "Brunette",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Feather Weight Quarter finals Match up. First Featherweigth Matchup!!!"
}