{
  "collections": [
    "Sadistic Rope"
  ],
  "description": "Sahara finds herself bound in a stressful tie atop the stairs awaiting my arrival. She struggles to free herself with no luck of escaping and her mind begins to go to that place of fear and uncertainty. She is subjected to non-stop spanking and nipple torment before the vibe is applied to her already wet pussy and powerful orgasms are ripped out of her.\n\nShe is then spread wide on her back and left helpless to the dance between pleasure and pain as her pussy is fucked and vibed while her feet suffer from rubber band bastinado. She is losing control due to this extreme torment, not knowing if she can continue from the pain, yet wanting to orgasm so badly.\n\nNext she is suspended upside down, and the suffering is more brutal than before. She is pulled through the air by her nipples and her screams become louder and louder. A plug is inserted in to her tight asshole and she is tormented with more spankings. The scene ends with her hanging from one knee increasing her suffering, and left alone and helpless.\n\nThe sybian is the most powerful vibe that is made and Sahara is tied to it and orgasms flow from her more than willing cunt. The torment is unforgiving, but her pussy has taken control of her body and can’t stop the orgasms, no matter how hard she tries.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Sahara Rain",
      "person_id": 36730
    }
  ],
  "release_date": "2013-04-04",
  "scene_id": 30454,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Extreme Torment",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Nipple Torment",
    "other hair color",
    "Pain",
    "Rope Bondage",
    "shaped",
    "slim",
    "Spanking",
    "Straight",
    "Submission",
    "switch",
    "Sybian",
    "Tattoo",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Relentless Brutality"
}