{
  "collections": [
    "Hogtied"
  ],
  "description": "What do you do with a hot tan babe with an amazing rack that is lively, eager, and ready? One of Claire’s favorite activities is binding women’s breasts. The tautness of the boobs swelling, looking so plump and ripe, peaked with color and pushed to the max. The humiliating aspect of controlling a woman just by her breasts is a huge turn on. In scene one, Courtney starts with her hands bound behind her back sitting in a chair. The bondage gets more complicated and eventually she is transitioned into a standing breast and hair bondage predicament. If she loses balance she will either put a lot of uncomfortable weight on her hair or her breasts. Its incredibly hot to watch this bitch struggle and even more hot to see her cum.\n\nSecond, from her athletic experience, she is a flexible forward bend lady. She is a pleasure model, not inclined to much pain, but Claire wants to give her a good taste of discomfort by caning and tickling her feet. Adding clamps to her labia and then attaching them to her nipples, it discourages Courtney from wanting to struggle, so of course the pain game continues. After thoroughly enjoying her discomfort its time to see her live up to her pleasure model title. Orgasms are ripped from her cunt and clit in an inescapable frenzy of pleasure. The comfort of her chair is taken away and she is suspended in the complete forward bend unassisted with no choice but to continue to focus on the incredibly distracting pleasure of Claire’s hand and the vibrator.\n\nFinally she is bound to the throne with her statuesque body and amazing curves on display. She gets to experience how uncomfortable the pantyhose hood is. Leather is wrapped around her tiny neck at attached to the pulley. She also gets an introduction to the tazapper. Taking it like a champ, she impresses Claire enough to have the vibrator locked on her cunt to be turned on. Immediately multi orgasmic Courtney is already begging to cum. Again and again she explodes with intensity. Oil glistening over her skin and tight rope digging into her breasts and biting at her nipples. Claire plays with Courtney’s neck with the pulley. Every time she gets close to cumming, the pulley increases tension on the neck rope, making the orgasms that much better.",
  "directors": [
    {
      "name": "Claire Adams",
      "person_id": 46
    }
  ],
  "models": [
    {
      "name": "Courtney Taylor",
      "person_id": 29307
    }
  ],
  "release_date": "2013-06-27",
  "scene_id": 30677,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Domination",
    "fake boobs",
    "Feet",
    "Fingering",
    "Handler",
    "Hood",
    "Humiliation",
    "Leather",
    "Pain",
    "rack",
    "Rope Bondage",
    "slim",
    "Straight",
    "Submission",
    "Tickling",
    "Vaginal Penetration",
    "Vibrator",
    "white",
    "Zapper"
  ],
  "title": "Busty California Blonde Courtney Gets Bent, Fucked & Challenged!"
}