{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Team Nightmare pulls even further in the lead for the season. It could be all over for dragon. There are only a few more matches left in the season.\nNightmare won fair and square and by a LOT. it's time for them to get their prize but first, it's time to figure out who the biggest loser is. Two wrestlers on the losing team do a best-of-3 indian leg wrestling match. The biggest looser is determined and the two wrestlers on the mat have to massage the two winning wrestlers.\nAudrey Rose if finally brought on to the mats to accompany her two loser team mates. Like a scene out of Shakespeare's \"Titus Andronicus\"( but done porno style) she comes out unable to speek and with hands bound so she can not write down nor tell us how bummed she is to be a loser. But we sure can see it in her eyes. She is put in stress positions and used. The winners get to ride her vibrator hands.\nSeeing how stressed Audrey Rose is, the Ref offers to give her a hand ( a hand right into her pussy). Audrey is fisted in front of the audience while her team mates are brutally fucked next to her. Darling terrorizes Cheyenne with a huge dildo cock, making cheyenne scream out \" YOUR COCK IS SO BIG\". A fucking of Epic Proportions.\nnew score:\nNightmare : 2441\nDragon: 1688",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Audrey Rose",
      "person_id": 31792
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Syd Blakovich",
      "person_id": 7618
    }
  ],
  "release_date": "2013-05-07",
  "scene_id": 30783,
  "tags": [
    "Indian",
    "Anal",
    "April",
    "Dildo",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Vaginal Penetration",
    "Vibrator",
    "Wrestling"
  ],
  "title": "Round 4 April Tag match. Nightmare is Nobody's fool"
}