{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Team Dragon ( total points this season 818 )\nPenny Barber ( co captain filling in for Dragon)\nCheyenne Jewel ( wrestler)\nAudrey Rose ( wrestler)Team nightmare( total points this season 1281)\nSyd Blackovich (wrestler and coach)\nDarling (wrestler)\nThe Last Tag match did not go the full 3 rounds and is Scratched from the record. It stays as an update as an exhibition match for your enjoyment only. The points scored will NOT be reflected on the total scores for the teams for the season.\nSahara Rain is out for the season with a knee injury. Team Nightmare snatched Darling up quickly to fill Sahara's spot for the team. The last match was cut short do to injuries, Team dragon narrowly took home the victory. Syd was NOT happy about the loss last match. She wants to solidify an even bigger lead for the season so she's stepping onto the mats again. Mean while, Dragon Lily is stuck at home sick and has asked her co-captain, Penny Barber, to step up and coach from the side lines. 3 of our top lightweights show of why they are stars in this first round. Cheyenne Jewel shocks the world with her legit skills, holding her own against two of U/S's legendary wrestlers",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Audrey Rose",
      "person_id": 31792
    },
    {
      "name": "Syd Blakovich",
      "person_id": 7618
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    }
  ],
  "release_date": "2013-04-16",
  "scene_id": 30780,
  "tags": [
    "Cut",
    "domination",
    "Face Sitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "Vaginal Penetration",
    "weights",
    "wrestling"
  ],
  "title": "Nightmare not pleased with loss comes back with vengeance"
}