{
  "collections": [
    "Bound Gods"
  ],
  "description": "Tanner Wayne is driving down the road when he notices Hayden Richards hitchhiking. Tanner picks up the hot stud. Unfortunately for Tanner, Hayden is disoriented from the war and believes Tanner is an enemy soldier that has been tracking him down. Tanner finds himself bound and hooded with his cock exposed as he hears Hayden’s footsteps approaching. Hayden begins interrogating the boy, demanding why Tanner was following him. When Tanner tries to explain the misunderstanding, that only makes Hayden angrier. He clamps down Tanner’s nipples and covers his balls with clothespins. Exhausted from his interrogation Tanner dreams he’s held down by mysterious hands as Hayden shoves his cock down Tanner’s throat. Later in his dream, a bound Tanner finds his wings of desire. Hayden breaks free from his angelic wings and begins fucking Tanner’s hole. Hayden then stretches Tanner’s hole using large toys to prepare him for Hayden’s fist. Pleased, The Fisting Angel fucks Tanner’s ass again before showering Tanner’s face in cum.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Hayden Richards",
      "person_id": 47285
    },
    {
      "name": "Tanner Wayne",
      "person_id": 40517
    }
  ],
  "release_date": "2013-07-04",
  "scene_id": 30813,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Athletic",
    "BDSM",
    "big dick",
    "Bizarre",
    "Blowjob",
    "Bondage",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Extreme Torment",
    "Fisting",
    "Gay",
    "Hood",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Nipple Torment",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Wings of Desire - A Bound Gods Feature Presentation"
}