{
  "collections": [
    "Naked Kombat"
  ],
  "description": "Cameron Kincade\n“The Kin-Killer-Cade”\nHt: 5’10”\nWT: 155lbs\nSeason W/L record ( 1-1)\n\nConnor Patricks\n“The Pulverizer”\nHt: 5’10”\nWT: 160lbs\nSeason W/L record (1-0)\n\nConnor “The Pulverizer” Patricks is back after his first win against Chase “The Champ”. His only fighting background is here on Naked Kombat and he plans on putting it to good use against his opponent. After finally tasting victory with his first win against Dayton “The DOC” O’Connor, Cameron “The Kin-Killer-Cade” is back and hungry for more. The Pulverizer is relentless catching Cameron in cradle after cradle. But when Connor shoots for Cameron’s legs he quickly deflects it and counterattacks by shoving a finger in the Pulverizer’s hole. Moving onto the third round, their determination and will are as hard as their cocks. Connor catches the Kin-Killer-Cade in a leg lock around the head, but Cameron pulls on The Pulverizer’s balls till he breaks free, holding Connor down as he sucks on his cock. Once the points are revealed, the loser becomes the winner’s bitch for the day, enduring a pony ride and a harsh ass spanking before having his ass plowed and his cock edged by the victorious winner.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cameron Kincade",
      "person_id": 47006
    },
    {
      "name": "Connor Patricks",
      "person_id": 47357
    }
  ],
  "release_date": "2013-07-03",
  "scene_id": 30811,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "BDSM",
    "Blowjob",
    "bottom",
    "brunet",
    "Cock Worship",
    "Domination",
    "Facesitting",
    "Gay",
    "Humiliation",
    "Jockstrap",
    "muscular",
    "Rimming",
    "Role Play",
    "Rough Sex",
    "shaped",
    "Spanking",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white",
    "Wrestling"
  ],
  "title": "Cameron \"The Kin-Killer-Cade\" vs Connor \"The Pulverizer\" Patricks"
}