{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Welcome smoking hot MILF, Syren De Mer to Whipped Ass and welcome back the knock out redhead Elle Alexandra! Elle comes home from a night of partying where she caught her boyfriend fucking another women and Elle's dad, Syren's husband is out on another one of his \"business trips\" with his secretary. The ladies have a little too much whiskey mulling over the fact that they are giving up on men and going to only pursue women from now on. Elle sneaks into her stepmom's room late at night and eats her pussy but once they wake in the morning Syren can't believe what she has done with her stepdaughter! Elle isn't very happy about that and dominates her stepmom demanding they be lesbian lovers! Elle ties her stepmom up spanks and whips her. She canes her thighs until she's covered in red stripes, sits on her face making her lick her pussy then fists her until she orgasms uncontrollably. Finally she strap-on ass fucks her stepmom hard leaving her in a puddle of her own cum.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Elle Alexandra",
      "person_id": 47752
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2013-05-31",
  "scene_id": 30932,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Bondage",
    "Breast Bondage",
    "Caning",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Family Roleplay",
    "Femdom",
    "Fingering",
    "Flogging",
    "Foot Torment",
    "Hitachi",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "MILF",
    "natural boobs",
    "Petite",
    "Pussy Eating",
    "Redhead",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Small Tits",
    "Smoking",
    "Spanking",
    "St Patrick's Day",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "toned",
    "Vaginal Fisting",
    "white"
  ],
  "title": "MILF stepmom dominated and ass fucked by bitchy daughter!"
}