{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Wenona\nranked 4th\n\"The Gymnast\"\nHT: 5'8\nWT:134\nSeason record (1-0)\nLifetime record (12-7)Syd Blackovich\nRanked 1st\n\"The Nightmare\"\nHT:5'2\nWT: 118\nSeason record (0-0)\nLifetime record (11-2)\nSyd hasn't wrestled for U/S since Season 5. In Season 5 she dominated, was undeafeated and took out Dia Zerva in the finals of Summer Vengeance to be crowned season 5 all round champion. At 5'2 and 118lbs she is pound for pound the most skilled wrestler on the roster. She ranked #1 in the lightweight and summer vengeance tournaments. She is currently the only active wrestler on the roster to have ever won a summer vengeance tournament.\nWenona missed season 9 but she's back and more tone and sexy than ever. She blasted her last opponent with a blow out victory. She has more mat time on the U/S than syd does. She's wrestled for 3 seasons longer than syd. Wenona is confident that her having more experience with U/S rules will definitely play its part in her victory today. BONUS OIL MATCH and a super sexy spanking. The winner of this match challenges the loser to a nude oil match with pins. If the loser can get the pin on the match winner, the loser will get to use the strap on on her.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Syd Blakovich",
      "person_id": 7618
    },
    {
      "name": "Wenona",
      "person_id": 4485
    }
  ],
  "release_date": "2013-06-07",
  "scene_id": 31058,
  "tags": [
    "Anal",
    "Brunette",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Spanking",
    "Straight",
    "Strap On",
    "Submission",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Sexy, Fit and Skilled. Light Weight Semi Finals Match up."
}