{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Aleska is not a model employee - she flirts with vendors, she fucks around on Facebook all day, she texts and tweets to friends and fucks up nearly all of her tasks. Working late to catch up on data entry that she should have had done hours earlier, Aleska opens a distracting email from a friend that shows a spitting image look alike of her in a porn! It's too good not to look at, just to see if she really does look like the girl in the porno. Not only does Aleska look like the girl, the porn is so hot she starts to rub her clit under her stockings and actually jerks off at her desk. The following morning, her boss just KNOWS something is up and sneaks a peak at Aleska's browser history. Sure enough, there it is, porn on the server. Jessica finally has enough reason to fire her terrible employee. But why not blow off some steam first with this annoying insuppordinant. Jessica grabs Aleska by the hair, makes her watch the porn while she bends her over the desk and spanks her. No one will believe Aleska, so Jessica doesn't care. She whips out her hard cock and slaps Aleska's shocked face with it. Aleska's shocked face with it, then fucks her every which way she wants, humiliating Aleska and making her spread herself and crawl and beg. Jessica demands Aleska rub her clit while she cums on her, making her re-enact what she did the night before at her desk only this time, when Jessica cums all over her tits and face, Aleska's well fucked pussy squirts all over the floor.",
  "models": [
    {
      "name": "Aleksa Nicole",
      "person_id": 36518
    },
    {
      "name": "Jessica Fox",
      "person_id": 17013
    }
  ],
  "release_date": "2013-08-09",
  "scene_id": 31375,
  "tags": [
    "blowjob",
    "Cock Worship",
    "role play",
    "squirting",
    "Stockings",
    "straight",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Busted Watching Porn at Work-Boss Punishes Bad Employee w/Her Own Cock"
}