{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Brunch is served as Casey Calvert is presented to the household. The hot little cock slut is stripped naked and tied into a painful squat that presents her to the room full of hungry strangers. A vibe is crushed against her hot pussy. House guests tear zipper after zipper off her pretty tits and thighs. Questions keep coming at her - Why do you want to serve? What are you here for? What are you good for? She struggles to maintain as the orgasm builds.\nMeanwhile, alumni House slave Bella Rossi's huge natural tits teeter around the room on high heels as she serves champaign and amuses the guests.\nAfter brunch service, Bella leads the prospective new meat into the lounge to be felt up and manhandled by the guests. Casey's tight little slutty asshole is plugged and she is told to get the dicks hard and the pussies wet.\nWhen the two horny sluts reach Maestro, they find a cock that needs more than a heavy petting. Casey's sweet pussy, face and ass are all fucked and used by demanding dick, and Bella is there to see to it that there is plenty of boy / girl / girl action on tap to get off on.\nIs the slutty new meat Casey Calvert good enough to be a collared Upper FLoor house slave? You decide.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Maestro",
      "person_id": 11928
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2013-08-02",
  "scene_id": 31531,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "brunch",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "High Heels",
    "Humiliation",
    "master",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Threesome",
    "Zipper"
  ],
  "title": "Gorgeous Anal Sex Slave Petitions to Serve the House"
}