{
  "collections": [
    "Bound Gods"
  ],
  "description": "Christian Wilde, Master Avery and Van work over the house slaves for the Bound Gods 5 year anniversary live show. The corporal play continues as the slaves are beaten with the cane and flogger as they're commanded to get their cocks hard. After the slaves present their cocks, slave 477 with a soft cock endures Master Avery's cane, while slave 427 the winner with a hard cock gets to service Christian's huge cock. Van begins tying each of the slaves up with muscled bodybuilder Derek Pain suspended in the air as the center piece of his bondage sculpture. Once the slaves are let down, Van leads them to the dungeon bed where Christian, his two gimps and their hard cocks await. Bound to the bed each slave takes a hard fucking before Christian sprays his massive load on all five slaves. After the slaves receive each of the gimps loads on their face, Van awards each of the boys with a Kinkmen medallion for all their hard work. Afterwards, the champagne is broken out as each of the guys join Van in a toast thanking the crew and the members for an amazing five years here on Bound Gods.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Derek Pain",
      "person_id": 17904
    },
    {
      "name": "Dylan Deap",
      "person_id": 21477
    },
    {
      "name": "Holden Phillips",
      "person_id": 36020
    },
    {
      "name": "John Jammen",
      "person_id": 22596
    },
    {
      "name": "Lief Kaase",
      "person_id": 32465
    },
    {
      "name": "Randall O'Reilly",
      "person_id": 39427
    },
    {
      "name": "Rowen Jackson",
      "person_id": 47295
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Van Darkholme",
      "person_id": 15862
    }
  ],
  "release_date": "2013-06-27",
  "scene_id": 32042,
  "tags": [
    "Anal",
    "aprilfools-fooled-ya-bitch",
    "Asian",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "blond",
    "Blowjob",
    "body builder",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "other hair color",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slave",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "BG 5 Year Anniversary Live Show - Bondage Extravaganza - Part Two"
}