{
  "collections": [
    "Bound Gods"
  ],
  "description": "It's our 5 year anniversary here on Bound Gods and Christian Wilde is our main dom assisting Van in the slave auction. For the special occasion we have 5 house slaves ready to present their holes and service however their master's seem fit. Once the slave's are given their numbers, Master Avery surprises us with a visit and assists Christian in tenderizing the slaves. The auction begins for the viewers at home (the winning bidders) to have 5 minutes to do whatever they please with their winning slaves. After the auction is over, the slaves are handed back to Van. He pushes the boys to see who can withstand ice in their ass and rewards the winner with Christian's beautiful hung cock plunged deep into their hole. We're surprised by yet another visitor, body builder Derek Pain who's ready to join in on the action. Bound on a pedestal like the greek god he is, Derek endures a zipper attached all over his body in every direction. Rather than a fast relieving zipper, Derek slowly rotates having each clothespin painfully tear off one by one. But Van has one more trick up his sleeve, he attaches a zipper from Derek's balls to slave #316's collar. With the help of the cattle prod, #316 rips the zipper of Derek's balls as he screams at the top of his lungs. Our two gimps reward the slaves with cum after all their hard work, but the fun is just getting started...",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Van Darkholme",
      "person_id": 15862
    },
    {
      "name": "John Jammen",
      "person_id": 22596
    },
    {
      "name": "Holden Phillips",
      "person_id": 36020
    },
    {
      "name": "Lief Kaase",
      "person_id": 32465
    },
    {
      "name": "Randall O'Reilly",
      "person_id": 39427
    },
    {
      "name": "Derek Pain",
      "person_id": 17904
    },
    {
      "name": "Dylan Deap",
      "person_id": 21477
    },
    {
      "name": "Rowen Jackson",
      "person_id": 47295
    },
    {
      "name": "Christian Wilde",
      "person_id": 21037
    }
  ],
  "release_date": "2013-06-13",
  "scene_id": 32041,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "cattle prod",
    "collar",
    "Corporal Punishment",
    "domination",
    "gay",
    "humiliation",
    "Male Sub",
    "master",
    "pain",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "slave",
    "submission",
    "zipper"
  ],
  "title": "Bound Gods 5 Year Anniversary Live Show - The Slave Auction - Part One"
}