{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Cheyenne Jewel beat one of U/S's best and brightest stars, Darling (The Grappler) to earn her spot in the finals for the LightWeight title. Syd Blakovich has been on a 5 year hiatus but quickly reminded fans of her champion caliber skills in her match up with Wenona as well as in some of this season's tag matches.\nCheyenne and Syd had a brief encounter with each other during a tag team match up ( see match 30783) Seeing Cheyenne hold her own against Syd in this tag match left the fans craving a full match between these two. Today Fans get their wish to come true in this amazing lightweight title fight. This is the Lightweight bout that was shot LIVE on July 17th. This is NOT a summer Vengeance match. It is highly likely these two could meet in the summer Vengeance finals for a rematch if Syd can get pass Sophia Fiore and if Cheyenne can beat Izamar. IF that happens it will not be for the lightweight belt, it will be for the summer vengeance championship. If Cheyenne wins SV10 we could see cheyenne vs. Syd III for the light weight belt very early on in Season 11.\nThere is so much heart and soul in the match. Syd refuses to lose. She's a former Champion and a legitimate Brown Belt in the art of Brazilian Jiu Jitsu. Losing today would be utterly humiliating. Cheyenne's got something to prove. Time and time again people keep underestimating her. She wants to show the world she can hang with \"THE ELITE\". This battle is back and forth action up to the bitter end. When we streamed this match Live on July 17th 2013, twitter was blowing up with fans posting about the intensity of this match. This match is already marked by some fans as the greatest match ever released!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Syd Blakovich",
      "person_id": 7618
    }
  ],
  "release_date": "2013-09-10",
  "scene_id": 32138,
  "tags": [
    "champion",
    "domination",
    "Facesitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tag team",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "One of the greatest Battles on U/S mats. Lightweight Title Bout!!!!"
}