{
  "collections": [
    "The Training Of O"
  ],
  "description": "They way that fear makes pussies wet. When I push the cattle prod in her face and ram my thumb up her cunt, I know it is true. This little slut girl is so terrified of electricity that I can think of nothing better. The more she squirms in fear, the harder my dick gets, the more I want more, and the cycle goes on and on. Wonderful.\nI want her thighs to burn like fire without putting a finger on her. I want her to learn that it is the slave that does the work around here, and I want that lesson etched into her muscle memory like a hot poker against her supple, tender, white flesh. The dick stand serves us well, and delivers a lesson her pretty thighs will not soon forget.\nI choke her throat with dick and make her say the nastiest shit while her mouth is stuffed. As the dick gets harder, it stretches her pretty lips further and further, distorting her innocent face into that of a grotesque cock sucking slut.\nWatching that thick cock slide in and out of her puffy pink pussy is good, but all the better when she is suffering through it for the sake of the lesson. And when she needs motivation, Mr. Zapper is there for her, like a True Friend.\nShe is nearly in tatters by the time I strap her to the dog fuck bench. I tell her that her tight little asshole is going to take that big cock, or it gets the cattle prod. Her reaction is delicious.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Mike Hawke",
      "person_id": 50609
    },
    {
      "name": "Alani Pi",
      "person_id": 36290
    }
  ],
  "release_date": "2013-08-16",
  "scene_id": 32141,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "cattle prod",
    "cock sucking",
    "Corporal Punishment",
    "discipline",
    "electricity",
    "female slave",
    "Gimp",
    "humiliation",
    "master",
    "muscle",
    "oral sex",
    "role play",
    "rope bondage",
    "slave",
    "straight",
    "Zapper"
  ],
  "title": "Scaring the Fuck Out of Alani Pi, Day 2"
}