{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "This is a tag match on a temporary set. The US girls are ready and willing to fight on any mat any time, anywhere!!!\nTeam Dragon just hasn’t had any luck this season. They did fantastic in the super mega awesome battle dream supreme but they have only won one tag match and they have fallen desparately behind in total points for the season. Not only are they behind but they have had several of their members retire mid season. Audrey rose is out for the rest of the season and if Dragon wants to stay in this game they need to recruit a new girl and put her in at least one match. Today they recruit Daisy Ducati. She’s new to US but has a lot of wrestling experience. She’s beating several of our US vets in submission wrestling. And in this first round she holds her own against Bella Rossi and Izamar Gutierrez.\nThe scoring system is the same however the app used for matching on “tour” only scores 1 point per click where the regular score board count 2 points per click. The scores for the total season will be what you see at the end of the match.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    }
  ],
  "release_date": "2013-06-18",
  "scene_id": 32152,
  "tags": [
    "Anal",
    "Big Tits",
    "Brunette",
    "Curvy",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Latinx",
    "Lesbian",
    "LezDom",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "Redhead",
    "shaped",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Dragon Vs Nightmare Tag match on the Road round 1"
}