{
  "collections": [
    "latest updates"
  ],
  "description": "This is the first Tag Match of Season 11. The teams for this season have yet to be decided. The first few tag matches of this season are more like Try-outs to see who will be eligible for teams and who will be team captains. Today Rilynn Rae is the fresh meat. She only has a few singles matches under her belt and one tag match from last season. We are hoping she will be able to make it on one of the permanent teams this year. We partnered her up with Last year's tag team Champion/ lightweight Champion and Summer Vengeance Champion, Syd Blakovich ( you can't get a better partner than Syd). We knew Syd would have the know how on how to coach Rilynn in a tag match but will it be enough for Rilynn to get her first taste of victory?\nIt wont be an easy task for Syd and Rilynn. They are going up against Cheyenne and Wenona. Rilynn is slightly intimidated by Wenona after she lost to her in Season 10. But since Rilynn felt Wenona was a one trick pony with her head lock which is now illegal going forward in season 11, Rilynn thinks she can take Wenona.\nThese teams Clash hard on the mats. We see Wenona in top form tonight against Rilynn AND Syd. Tag matches are begining to allow these girls to really shine. Each month we see girls wow and amaze us in tag matches. Sleepers who are mediocre in singles matches, really start to impress us in these tag matches. If you weren't a fan of Tag matches before, season 11 will make you a fan now\nThis match is bitterly close. You can blink for a moment or you'll miss the action. Just when you think one team has it in the bag, the other team leaps ahead. Winners brutally fuck the loser. Ride them like ponies, make them clean each other's wrestling feet and spread them wide with 8 fingers inside",
  "models": [
    {
      "name": "Wenona",
      "person_id": 4485
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Syd Blakovich",
      "person_id": 7618
    },
    {
      "name": "Rilynn Rae",
      "person_id": 39210
    }
  ],
  "release_date": "2013-10-15",
  "scene_id": 32694,
  "tags": [
    "champion",
    "wrestling",
    "tag team",
    "lesbian"
  ],
  "title": "Season 11 Tag Team Prelim Syd + Rilynn Rae vs. Cheyenne + Wenona"
}