{
  "collections": [
    "Device Bondage"
  ],
  "description": "Welcome back flexible gymnast Wenona. What is not to like about this fit slut? She is flexible, tough, and loves to cum. Up for the challenge, she endures very strict bondage, pain and pleasure.In scene one, Wenona is custom fitted to a made to measure frame in a legs behind the head/open pile driver position. Perfect for pussy flogging, Claire gets her mound nice and hot pink. She also introduces a cruel nipple to labia predicament with clamps and twine so Wenona cannot fully relax into the stretch. Once satisfied, Claire attaches the pulley and fully inverts Wenona. Going after her ass only, she is finger banged and vibrated until the cunt can't cum any more.Scene two, Wenona is bound in a kneeling offering pose. So submissive with her ass trapped up in the air. Perfect for the cattle prod. Her ass gets a nice thick steel hook in it that is also bound to her hair. After the cattle prod comes the cane and the single tail. Claire wants to make sure Wenona has her full attention. Now, for the cunt. Finally Claire slides her thick hand into Wenona's willing cunt. Pummeling her. Writhing in pleasure, Wenona has no choice but to cum all over Claire's hand and the vibrator.Finally, Wenona endures one of the most challenging suspensions Claire can think of - a chain only straddle split suspension. Chain is cold, uncomfortable, and like the rigid restraints - not forgiving. Spread wide open, her nipples get tied to her toes, the cane comes out, and finally the sybian. With a sybian finish, cum hungry and insatiable Wenona gets to do nothing but be overwhelmed by pleasure as Claire chokes her from behind with leather around her neck. Watch her muscles intensely contract an the sweat pour down her body as it can't help but have orgasm after orgasm.",
  "directors": [
    {
      "name": "Claire Adams",
      "person_id": 46
    }
  ],
  "models": [
    {
      "name": "Wenona",
      "person_id": 4485
    }
  ],
  "release_date": "2013-07-26",
  "scene_id": 32720,
  "tags": [
    "BDSM",
    "Bondage",
    "Cattle Prod",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "Muscle",
    "Pain",
    "Single Tail",
    "Straight",
    "Submission",
    "Suspension",
    "Sybian",
    "Vibrator"
  ],
  "title": "Claire Adams vs Rough Rider Wenona"
}