{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Penny and Cheyenne perform flawlessly today under their coach's instruction. Dragon is finally catching a break this season. They dominate Nightmare for this match and score some much needed points going into the finals Next month.\nThat's right. The Tag Team Season 10 finals will be shot Next month LIVE August 2nd 7PM PST. Dragon needed the points from today's win. The new score is Nightmare: 5230 Dragon: 4818\nAugust 2nd is our first tag match in the new set. It is the BIGGEST TAG MATCH is US history.\nSyd will be out of the country but she hand picked Jayogen to step in as captain in her absence. The other members of Team nightmare that will be pressent include:\nJayogen\nDarling\nBella Wilde\nBella Rossi\nIsamar\nBerretta James\nFor team Dragon:\nDragon lily\ncheyenne Jewel\nPenny Barber\nDaisy Ducati\nserena Blair\nand filling in for mistress Kara, Sophia Fiore ORGASMS WORTH TWICE AS MANY POINTS\nEach girl wrestles with a partner of her team for 1 round. This means the action will be fast and furious as no one will gas out. It also means there will be NO breaks between wrestling rounds, We will shoot the wrestling straight through so viewers at home don't lose interest between rounds.\nThis also means there is a massive gang bang at the end.\nTune in LIVE Aug 2nd 7pm PST!!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Syd Blakovich",
      "person_id": 7618
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "DragonLily",
      "person_id": 3433
    },
    {
      "name": "Bella Wilde",
      "person_id": 39990
    }
  ],
  "release_date": "2013-07-30",
  "scene_id": 32746,
  "tags": [
    "Anal",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Dragon Maintains Lead for this Match. Big time Catch up done today"
}