{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Dr. Cherry Torn conducts medical research experiments on the physical and emotional effects of pain and humiliation on the male specimen. Dr. Torn takes a twisted interest in subject #214 (Sean Spurt), who has a particularly intriguing reaction to the doctor’s sexy and sadistic techniques.\n\nThroughout the course of the six-month experiment, 214 develops an attachment to his beautiful and commanding doctor as well as affection for her. While 214 is slapped, clamped and electrocuted in bondage, his cock drips with a remarkable amount of precum. He reluctantly entertains her fascination with the humiliating effects of feminization, including full transformation, a “pelvic exam” with an anal speculum and some hard strap-on anal fucking.\n\nDr. Torn pushes subject #214 to the limits of his ability to withstand humiliation, testing his reactions to the unwanted bisexual acts of blow jobs and cum eating before binding him to the bed and cuckolding him with her hot and hung colleague, Dr. Wolf Hudson.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Sean Spurt",
      "person_id": 21434
    },
    {
      "name": "Wolf Hudson",
      "person_id": 14471
    }
  ],
  "release_date": "2013-08-28",
  "scene_id": 33134,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Bisexual",
    "black hair",
    "Bondage",
    "bottom",
    "CBT",
    "Corporal Punishment",
    "Cuckolding",
    "Doctor",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "foreskin",
    "Humiliation",
    "Latinx",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Sissification",
    "Slave",
    "slim",
    "Speculum",
    "Straight",
    "Strap On",
    "Tattoo",
    "unshaved",
    "white"
  ],
  "title": "Dr. Torn's FemDomme Laboratory: Pushed, Probed, Fucked and Cucked!"
}