{
  "collections": [
    "Bound in Public"
  ],
  "description": "Over a hundred horny men show up for our Pre-Dore Alley Party to kick off the weekend and hot southern stud Jordan Foster is the main attraction. Jordan is completely blindfolded as we pass him around for everyone to grope. He’s so aroused from all the attention that the guys notice his pre-cum already soaking through his underwear. The crowd gets busy and starts tearing away his clothes. After Jordan’s beaten red with the flogger we have him crawling on his hands and knees, whipping out as many cocks as he can find. The crowd shoves three cocks in his mouth as his ass gets fucked for the whole party to see. Bound on a net of chains, Jordan screams in pain as clothespins are attached all over his body before having every single one smacked off with the crop. With his body sore from the clothespins, the whole party jumps up and rubs a million hands all over him, giving him the mixture of pain and pleasure. After the guys take turns fucking his hole to the sounds of the cheering crowd, everyone lines up their cocks to cover the greedy whore with their loads. Cum dripping down his face, Jordan crawls to the back room where the party’s just getting started.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 46426
    },
    {
      "name": "Hayden Richards",
      "person_id": 47285
    },
    {
      "name": "Jordan Foster",
      "person_id": 43867
    }
  ],
  "release_date": "2013-08-02",
  "scene_id": 33175,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "bottom",
    "brunet",
    "Chains",
    "Clothespins",
    "Cock Worship",
    "Crop",
    "Domination",
    "Facial",
    "foreskin",
    "Gangbang",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Public",
    "Redhead",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "southern",
    "Stud",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Voyeur",
    "Whipping",
    "white"
  ],
  "title": "Southern stud gets fucked and showered with cum in front of 100 men!"
}