{
  "collections": [
    "Sadistic Rope"
  ],
  "description": "Serena is a super hot girl with a real taste for suffering. she signed up to be our September live shoot girl, but had no idea that I was bring one of the most sadistic female tops to assist me in her demise. Aiden Starr is like dynamite; lots of power in a small package. Aiden is just as much of a sick fuck as I am, and that's why I brought her in on this shoot. She's not here as a fem domme, but just a sadistic top to destroy poor little Serena.\nWe start the day with the least amount of rope as possible to show that it doesn't take much to fully immobilize your captive. She is instantly helpless to our evil desires. She screams and attempts to escape, with no success. Her entire body falls under our sadistic torment, and we keep the level of brutality high all day.\nNext she is in a predicament position that leaves her body exposed, so that we can assault her skin with heavy impact. She eventually is released, but we decide to ripp more orgasms from her during a little manhandling scene.\nThe final scene, we have her in a very exposed position and Aiden decides that Serena is going to be fisted. The pain and screams continue throughout the final scene, and then we put the finishing touches by lifting Serena in to a hardcore suspension for one last orgasm.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Serena Blair",
      "person_id": 31165
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2013-10-23",
  "scene_id": 33226,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "fake boobs",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Rope Bondage",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Bratty Whore Experiences Brutal Suffering-Live Show Edited"
}