{
  "collections": [
    "latest updates"
  ],
  "description": "If you've been watching all season long, you know that Nightmare has been clobbering Dragon in the tag matches all season. Before the tag season started we explained the rules for the finale in our forum. Each month the teams would meet and battle it out on the mats. We keep score month to month. The individual tag matches start with a score of 0-0 however the score is kept so that at the end of the season the cumulative score they earned all season would be what they walk into the finals with. With that said, Nighmare has a 412 pt advantage going into the finales after dominating almost every single tag match this season. They start with 412 pts on the board\nSophia Fiore could possibly single handily take on all of team nightmare in one round. She's the tallest strongest wrestler we have on the Roster. At 5'10 165lbs, she towers over her partner for this match, Serena Blair. But size doesn't do much for her here. Beretta and Bella are on her like spider monkeys ; holding on to her for dear life, not wanting to let go. With a body like hers, we can't blame Beretta and Bella for wanting to hang on for as long as possible.\nStay tuned for round 2 which gets updated next tuesday: Team Nightmare has Darling and Bella Rossi on the mats. Team Dragon puts Penny Barber and Daisy Ducati on the mats.\nRound 3 will be updated in 2 weeks. On the mats for Nightmare is Jayogen and Isamar and for team dragon, Dragon Lily and Cheyenne Jewel.",
  "models": [
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Serena Blair",
      "person_id": 31165
    },
    {
      "name": "DragonLily",
      "person_id": 3433
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    },
    {
      "name": "Bella Wilde",
      "person_id": 39990
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Jayogen",
      "person_id": 23291
    },
    {
      "name": "Beretta James",
      "person_id": 33659
    },
    {
      "name": "Sophia Fiore",
      "person_id": 47358
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    }
  ],
  "release_date": "2013-08-13",
  "scene_id": 33259,
  "tags": [
    "tag team",
    "lesbian"
  ],
  "title": "Tag Team finale Round 1 Bella Wilde and Berretta vs Sophia Fiore and Serena"
}