{
  "collections": [
    "Bound Gods"
  ],
  "description": "Two Redz captives, Jessie Colter and Alessio Romero, are dragged front and center, hoods on their heads and their hands cuffed behind them. Once unmasked both subs are put right to work, servicing Onyx doms of the house Christian Wilde and Hayden Richards, shoving their big hard cocks down their throats. In the Onyx lair, both Redz are then bound in the center of the room as Van gives them a taste of the single tail on their backside. The torment continues as Christian and Hayden drip hot wax all over Jessie and Alessio's torso, burning the pubes on their balls as they scream in pain. Their holes are opened for their masters as Christian and Hayden relentlessly fuck them. Both subs are brought to their knees as they service their master's feet. On the sybian's, Alessio and Jessie have clothespins attached all down their torso as they're ordered to see who can cum first. First one to cum gets the clothespins taken off and rewarded with cum all over his face, while the loser has his clothespins cropped off one by one.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Van Darkholme",
      "person_id": 15862
    },
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Jessie Colter",
      "person_id": 34311
    },
    {
      "name": "Alessio Romero",
      "person_id": 20463
    },
    {
      "name": "Hayden Richards",
      "person_id": 47285
    }
  ],
  "release_date": "2013-10-17",
  "scene_id": 33347,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Feet",
    "Folsom",
    "Folsom Gay",
    "Gay",
    "Hot Wax",
    "Humiliation",
    "Male Sub",
    "Mask",
    "master",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Single Tail",
    "Submission",
    "Sybian"
  ],
  "title": "Onyx vs Redz - Pre-Folsom Street Fair Live Show"
}