{
  "collections": [
    "Bound in Public"
  ],
  "description": "The bar is crowded and everyone is cheering as hot go-go stud Isaac Hardy shows off his moves. When the crowd tries to tip Isaac, he just tosses it back in their face as if he’s too good for their money. Isaac is fed up with the crowd and decides to go on break. When the crowd refuses, they gang up on him and fight him to the ground. Isaac kicks and screams but his resistance goes unmatched as the guys tie his hands up and tear off his shorts. The crowd gathers round as Isaac is made to suck everyone’s cock. Back and forth he tries to catch his breath as more cock gets shoved in his mouth. Isaac is then bent over the laps of bar patrons as the guys spread his hole, taking turns fucking him like a rag doll. Isaac is then passed around as the crowd feels him up and even takes turns sucking his cock. Down on the floor with his ass in the air, Isaac submits and begs at the top of his lungs for someone to fuck his ass. Isaac gets fucked from behind as he services cock, taking load after load of cum all over his face. On his knees Isaac crawls out of the bar, showing everyone his cum-covered face on the way out.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 46426
    },
    {
      "name": "Dayton O'Connor",
      "person_id": 45656
    },
    {
      "name": "Isaac Hardy",
      "person_id": 49267
    }
  ],
  "release_date": "2013-08-23",
  "scene_id": 33506,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "brunet",
    "Cock Worship",
    "Domination",
    "Facial",
    "foreskin",
    "Gangbang",
    "Gay",
    "Hairy",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Public",
    "Redhead",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "Voyeur",
    "white"
  ],
  "title": "Gangbang and cum for a stuck up go-go boy"
}