{
  "collections": [
    "Naked Kombat"
  ],
  "description": "This special update features six smoking hot fighters fighting for the right to fuck. First off we have Alessio \"El Lobo\" Romero going against newcomer Rogue \"Showtime\" Status. Showtime may be new to Naked Kombat compared to his muscled opponent, but he was captain of his wrestling team and is more than confident he has the chops to take the big lug down. Next off we have two hot newcomers, Joey Rico fighting toe to toe with the latin hunk Ray Han. Unfortunately both matches resulted with injuries, but to top off these hot match ups we have body builders Jaxton \"Chaos\" Wheeler and Joey \"The Cowboy-Killer\" Carter in a smoking hot oil round. These muscled gods slip and slide all over each other as they wrestle with hard cocks to see who's ass gets fucked. When the points are tallied up, the loser gets slammed on his back after choking on cock. The winner celebrates his victory with a ferocious fuck before covering the loser's face with cum!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Rogue Status",
      "person_id": 51589
    },
    {
      "name": "Alessio Romero",
      "person_id": 20463
    },
    {
      "name": "Jaxton Wheeler",
      "person_id": 53352
    },
    {
      "name": "Joey Rico",
      "person_id": 51709
    },
    {
      "name": "Ray Han",
      "person_id": 51659
    },
    {
      "name": "Joey Carter",
      "person_id": 53626
    }
  ],
  "release_date": "2014-06-18",
  "scene_id": 33976,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "BDSM",
    "Blowjob",
    "Choking",
    "Cock Worship",
    "Domination",
    "Facesitting",
    "Gay",
    "Humiliation",
    "Jockstrap",
    "Latin",
    "Muscle",
    "Rimming",
    "Role Play",
    "Rough Sex",
    "Smoking",
    "Submission",
    "top",
    "Wrestling"
  ],
  "title": "3 Matches in 1! 6 smoking hot hunks fight for total sexual domination!"
}