{
  "collections": [
    "Bound Gods"
  ],
  "description": "Trenton Ducati picks up a hot boy, Jordan Foster from the gas station and brings him back to his place. Trenton pounces on the boy and tears his clothes off to bind and gag him. The bound stud has clothespins clamped across his chest as Trenton teases the boy’s cock. So turned on, Trenton takes out his hard cock and fucks Jordan’s ass as he screams for help. Trenton drags Jordan back to his hidden padded cell and locks the boy up in chains. When Trenton discovers that Jordan has escaped his restraints, he torments the boy with the zapper before shoving his cock down Jordan’s throat. Jordan’s arms are tied up to the ceiling as Trenton flogs him all over. Back in Trenton’s bedroom, Jordan is mummified with his cock exposed as Trenton teases his captive’s cock. The muscled pervert teases Jordan’s nipples before tearing a hole on Jordan’s ass, ready for a fucking. Trenton rams his cock up the boy’s ass before milking all the cum out of his cock. Jordan’s finished off with Trenton’s cum all over his face before he’s carried off back to the padded cell.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Jordan Foster",
      "person_id": 43867
    },
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    }
  ],
  "release_date": "2013-11-21",
  "scene_id": 34015,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Chains",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Slave",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "the padded cell",
    "versatile",
    "white",
    "Zapper"
  ],
  "title": "Muscled pervert turns his captive stud into a sex slave"
}