{
  "collections": [
    "Naked Kombat"
  ],
  "description": "The best of the best here on Naked Kombat have fought balls to the wall in efforts of being crowned champion in our first ever Summer Smackdown Tournament. After eight intense matches it all comes down to Doug \"The Destroyer\" Acre taking on the veteran, Leo \"The Force\" Forte! Fighting alongside \"The Destroyer\" is Randall \"The Rock\" O'Reilly for the Blue Team. \"The Rock\" was defeated by \"The Force\" in the semifinal match, and today he's planning his revenge, ready to shove his cock down Leo's throat. \"The Destroyer\" defeated Landon \"The Law\" Conrad in the semifinals as well but due to complications \"The Law\" couldn't make the fight so fighting in his place is Sebastian \"The Tiger\" Keys over on the Red Team. The crowd roars as these four kombatants step out onto the mat, holding nothing back as they wrestle for sexual domination. The stakes are high and only one man can be named champion and win that gold belt, while the losing team is beaten, fucked and humiliated in front of the cheering crowd.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Doug Acre",
      "person_id": 47153
    },
    {
      "name": "Leo Forte",
      "person_id": 22142
    },
    {
      "name": "Randall O'Reilly",
      "person_id": 39427
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2013-11-06",
  "scene_id": 34082,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "blond",
    "Blowjob",
    "bottom",
    "brunet",
    "Champion",
    "Cock Worship",
    "Domination",
    "Facesitting",
    "Gay",
    "Hairy",
    "Humiliation",
    "Jockstrap",
    "Latin",
    "Rimming",
    "Role Play",
    "Rough Sex",
    "shaped",
    "shaved",
    "Stud",
    "Submission",
    "switch",
    "Tag Team",
    "Tattoo",
    "the wall",
    "top",
    "tournament",
    "unshaved",
    "versatile",
    "white",
    "Wrestling"
  ],
  "title": "The Summer Smackdown Tournament Finale - Live Audience Tag Team Bout!"
}