{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "It's Officially the End of Season 10. This is the final match of the season and the final match of the summer Vengeance Tournament. Through all the trials and tribulations of this year's tournament, Two wrestlers toughed out through it all and come face to face for one last battle.\nCheyenne Jewel had a tough road here. She was ( arguably) on the tougher side of the bracket, taking on some of U/S's finest, like Izamar Gutierrez and Darling. Cheyenne won all her matches with ease. Syd had some what of a cake walk to the finale. 3 wrestlers on her side of the bracket dropped out the tournament ( The First was Berretta James, Second was Mistress Kara who was the biggest threat for Syd, and then when Sophia Fiore stepped in to replace Kara, she too had to drop out after an outstanding win over wenona)\nCheyenne and Syd met earlier in this season to battle for the lightweight division championship belt. These two were almost even for the first two rounds of that match. It wasn't until round 3 that Syd was able to solidify the win when she was able to gain access to Cheyenne's bever and finger blast it gain the highly covetted \"pussy fingering\" points.\nCheyenne learned a lot from that match and she's been training for today's Final. She refuses to lose AGAIN. Syd has other plans for Cheyenne. She saw some wholes in her own game in the last match and she's cleaned up her act a little.\nThe battle comes down to Heart. Who wants it more and who will push themselves to the limit to get the win. This is back and forth action from start to finish. This match is so technical that Cheyenne forgets to remove Syd's bikini top in the first round and loses the 10 pts she would have gotten. This forces Cheyenne to work twice has hard to make up for those points. It makes for THE MOST EXCITING MATCH IN ULTIMATE SURRENDER HISTORYWinner Pounds loser in the ass and the ass smoothers her. This is an ALL ANAL round four",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Syd Blakovich",
      "person_id": 7618
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    }
  ],
  "release_date": "2013-10-11",
  "scene_id": 34107,
  "tags": [
    "anal",
    "champion",
    "domination",
    "Face Sitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tournament",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Summer Vengeance Finals: REDEMPTION. Syd takes on Cheyenne Jewel again"
}