{
  "collections": [
    "Hogtied"
  ],
  "description": "In all my years doing this shit I have never seen a girl squirt as much as I witnessed with Serena Ali. She told me that the vibe makes her squirt, but I had no idea that we would extract over 70 squirting orgasms from her gushing cunt in one session. Unfuckingbelievable.\nBut let me back up a bit - her Huge Natural Tits are the first thing that I notice and I waste no time in tying them up as tightly as I can. Cutting those big tits out of her slutty dress makes her fat nipple stand straight up, begging for attention. When I tie the vibe to her quivering cunt and jack her knee up to her ear, I begin to realize that this girl is strong - real strong. It takes all I have to get her off like this, but come she does - several times.\nI now realize that I am working way too hard here and call for the heavy artillery - the Sybian. I bind the cruel device tight between her thick thighs, paying close attention to making sure shit is secure. I turn it on and she is off and running like a fucking race horse. Again - I need more rope to tame this twat.\nAt last I put her on her back, spread wide open and I tie the fuck out of her, right down to her toes. Her big tits and slutty snatch are right there for the taking and I start my work. When she starts to squirt out her orgasms I start to count. By the time we are done the count is over 70 and the set is covered in quarts of come from her gushing cunt. Unfuckingbelievable.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Serena Ali",
      "person_id": 41123
    }
  ],
  "release_date": "2013-10-31",
  "scene_id": 34112,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Nipple Clamps",
    "Rope Bondage",
    "Squirting",
    "Straight",
    "Submission",
    "Sybian",
    "Vaginal Penetration"
  ],
  "title": "Unfuckingbelievable Soaking Wet Squirting Snatch and Huge Natural Tits"
}