{
  "collections": [
    "Bound in Public"
  ],
  "description": "The BIP crew is front and center on the Kink stage at San Francisco’s 30th Annual Folsom Street Fair. In front of thousands of people, the guys hold Sebastian down as Master Avery warms his backside up with the flogger. Van takes over from there, beating Sebastian down anyway he can as the crowd cheers: “HIT HIM HARDER!” The main attraction, Cameron Kincade crawls onto the stage for his first Folsom Street fair, gazing upon the colossal size of the crowd. His head is shoved into Sebastian’s ass as he endures the flogger, screaming sounds of pleasure rather than pain, or else he’s beaten even harder. The guys get so horned up on stage that they drag Cameron to a nearby sex shop and quickly whore him out. They drag him around sucking cock before taking turns ramming their cocks up his ass. Jessie Colter breaks out the double ended dildo and starts dual fucking Cameron as the crowd chants ASS TO ASS! They finish Cameron off by hosing his face down with cum before taking him out back for some more Folsom fun!",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Cameron Kincade",
      "person_id": 47006
    },
    {
      "name": "Connor Maguire",
      "person_id": 46426
    },
    {
      "name": "Jessie Colter",
      "person_id": 34311
    }
  ],
  "release_date": "2013-10-11",
  "scene_id": 34132,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "bottom",
    "brunet",
    "Cock Worship",
    "Dildo",
    "Domination",
    "Facial",
    "Folsom",
    "Folsom Gay",
    "foreskin",
    "Gangbang",
    "Gay",
    "Get Sprung",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Public",
    "Redhead",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "Voyeur",
    "white"
  ],
  "title": "Sexy stud Cameron Kincade - The Folsom Street Whore"
}