{
  "collections": [
    "Bound in Public"
  ],
  "description": "Damien Moreau has taken cigarette breaks all day and his boss Bryan Cavallo is sick and tired of Damien's laziness. Bryan rallies the rest of the crew together when Damien's out back smoking another cigarette. The guys smack it out of his hand and pounce on him, tearing away his clothes and binding his hands behind him. They rip off his underwear and gag him with it as everyone comes up to grope the boy. The guys tie up his balls and attach boots at the end for Damien to drag behind as he crawls around for cock. The guys take turns with his mouth before Bryan shoves him into the dirt, licking boots clean as he opens up Damien's ass with his uncut cock. Damien's then spread out, limbs bound as he endures the flogger for everyone's viewing pleasure. Clover clamps are attached to his nipples and balls before Damien gets a taste of the electric zapper all over his body. After a relentless flogging the guys slap a hood on the delinquent before dragging him to the back storage. He's bent down, face down ass up, licking boots while the guys fuck his hole. Everyone lines up and covers the boy with their loads, cum dripping down his hood as he's made to suck every cock clean.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 46426
    },
    {
      "name": "Bryan Cavallo",
      "person_id": 51815
    },
    {
      "name": "Damien Moreau",
      "person_id": 51956
    }
  ],
  "release_date": "2015-02-27",
  "scene_id": 34158,
  "tags": [
    "Anal",
    "AprilFools",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "Clover Clamps",
    "Cock Worship",
    "Domination",
    "Facial",
    "Flogging",
    "Gag",
    "Gangbang",
    "Gay",
    "Hood",
    "Humiliated Hunks",
    "Humiliation",
    "Male Sub",
    "master",
    "Public",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Smoking",
    "Submission",
    "Uncircumcised",
    "Uncut",
    "Voyeur",
    "Zapper"
  ],
  "title": "Lazy employee abused and humiliated by coworkers at Stompers Boots "
}