{
  "collections": [
    "The Training Of O"
  ],
  "description": "We welcome our bad girl Lyla Storm back for a second grueling day in the basement. She is to be tested for endurance, resolve, and knowledge of the rules. She will do this with trays tied to her hands, gigantic metal weights pulling her down. She proves willing to sweat through her ordeal, but makes a serious misstep. She offers a lazy answer. “Whatever you want Sir.” The rest of the scene is spent with her vainly begging to keep her hair from a shearing and cumming under great duress. Our defective little whore is getting better. She may even have the rules down.\n\nWhen her verbal self degradation grows boring, her big mouth is stuffed with gimp cock. Despite her failings in the rules and regulations department, the trainee can suck some dick. With her cheeks bulging she fills the drool trough and keeps the gimp grunting. She may earn back the right to slavehood yet.\n\nHaving worked so hard, she is allowed to display her greatest asset, that greedy pussy. Those long legs prove to be a hinderance when delivering a good disciplined fuck, but she perseveres, sweating like a racing horse and cumming all over our gimp. Just when she thinks she is done, she is grabbed by the throat and shown what a true slave performance looks like, bouncing on the cock until she begs for release. Her spent body is nailed to the floor and her ass flogged while she begs for an anal punishment. She can only watch helplessly as the gimp crams giant dick into her tiny body. Seems like a good time for a chat about the slave positions, wouldn’t you agree?",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Lyla Storm",
      "person_id": 33882
    },
    {
      "name": "Owen Gray",
      "person_id": 39181
    }
  ],
  "release_date": "2013-12-06",
  "scene_id": 34217,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "drool",
    "Female Slave",
    "foreskin",
    "Gimp",
    "Humiliation",
    "Latinx",
    "master",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "versatile",
    "Weights",
    "white"
  ],
  "title": "Punishing The Bad Girl, Day Two"
}