{
  "collections": [
    "The Training Of O"
  ],
  "description": "It is a sad day indeed when a defective House Slave is sent back to the basement to be re-trained. The House rules, the positions, the discipline - these things are in place for a reason. They provide a coherent structure, a sense of organization, they are the spine of the House itself. A properly functioning House Slave is more than a fuck slut, more than a well disciplined hole to fuck. A House Slave is a Symbol for the Traditions of the Leather Culture. A nod to the Elders. A House Slave is a reminder that we are all servants to something greater than ourselves. When this Symbol is tarnished, it is our Duty to take note. To pick that degraded slave up and improve it. Polish it. Empower it. But first, it must be Punished.\n\nLyla Storm’s recent performance on TheUpperFloor.com was an embarrassment to the House. She is a disgrace to her position and to her uniform. She has been busted from Senior House Slave of the Upper Floor to lowly Trainee in the Basement. She is defective. She not only broke the rules, she does not even remember what the rules are. I take this an affront and I consider it my personal duty fix this broken piece of property.\n\nThe Defect is humiliated and conditioned to understand that she was indeed and Bad Girl. She is to be torn down and re-built again, better than before. By the time we are through she will never forget those three little words again: Honorific, Eyeline, Deportment.\n\nHer cunt and mouth are reamed with a huge rubber cock, her body is tied, twisted and bound into horrible positions of endurance and pain. Her orgasms are denied and then overwhelming. She is made to sweat buckets and squirt puddles of cunt juice out onto our filthy floor. She is a bad, bad girl. But she will get better.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Lyla Storm",
      "person_id": 33882
    }
  ],
  "release_date": "2013-11-15",
  "scene_id": 34216,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "Latinx",
    "Leather",
    "master",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "switch"
  ],
  "title": "Punishing the Bad Girl, Day One"
}