{
  "collections": [
    "Bound in Public"
  ],
  "description": "As we celebrate our Pre-Halloween party the horny party goers await as Jason Miller, bound and blindfolded, is brought center stage. The crowd gathers around, tormenting Jason's cock and balls with ice cold drinks poured all over his junk. Jason's chained by the neck in all directions, the crowd cheering him on as he's flogged front to back. The bound stud has his nipples tormented with the clover clamps before he's brought to his knees, being dragged around to service the horny crowd. Jason's tied down to the stage again as Christian rams his giant cock up Jason's ass for the whole party to see. Jason endures hot wax poured all over his body before he begs for more cock. The guys throw him in the laps of the horny crowd and take turns fucking him before he's dragged back to the stage to receive everyone's load all over his face. The festivities aren't over yet, the guys zap the cum covered slut with the electric zapper, chasing him off to the bathroom for even more torment.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Jason Miller",
      "person_id": 17619
    },
    {
      "name": "Connor Maguire",
      "person_id": 46426
    },
    {
      "name": "Big Red",
      "person_id": 29981
    }
  ],
  "release_date": "2013-10-25",
  "scene_id": 34268,
  "tags": [
    "anal",
    "bdsm",
    "blindfold",
    "blowjob",
    "bondage",
    "boot worship",
    "clover clamps",
    "Cock Worship",
    "domination",
    "Facial",
    "gangbang",
    "gay",
    "halloween",
    "Hot Wax",
    "humiliation",
    "Male Sub",
    "master",
    "muscle",
    "public",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "Stud",
    "submission",
    "Voyeur",
    "Wax Play",
    "Zapper"
  ],
  "title": "Horny Crowd Torments Bound Muscled Stud for BIP's Pre-Halloween Party"
}