{
  "collections": [
    "DDF Network"
  ],
  "description": "Nick Lang has a unique breed of cat living in his own home pet clinic. He’s always been a fan of the cat , and the kitty, the latter referring to that lovely body part on a women that purrrs when you touch it. Lucky for him he found out that two of his girlfriends, Kathia Nobili and Liz, both have a distinct set of fetishes. They enjoy latex, leather, dressing like sexy cats, domination and being enslaved! What a jackpot for nick as these vivacious vixens love for him to cage them up, and they wouldn’t be cats without a tail! That’s where the anal insertion comes in handy. Butt plug with a tassel makes a perfect tail! Today one of the cat girls needed her vitamin D, but refused to drink, so after a trying to coax her with a vigorous pussy licking of her sweetly trimmed twat, it was time to bring this upon her. Nick restrains the naughty kitty and fondles her clit while the other kitty sticks a syringe up her ass and shoots a nice stream of milk in there. Nick teaches her a lesson by gaping her asshole and pulling her buttplug aka cat tail in and out a few times. She actually purrs with enjoyment and signals to the other cat girl to be submissive and both start working his meat stick with their tongues. Nick is getting real turned on by now and commands the cat girl to sit on his face so can munch out on her tasty twat and bury his tongue in her asshole. The other cat girl assists him, and fucks her with a pink strap on dildo while he thrashes her clit with his mouth. The action is non stop as the three get into a huge fuck fest with double penetration and a climax ending with both cat girls getting a huge load of cum squirted all over their pretty little mouths!",
  "directors": [],
  "models": [
    {
      "name": "Aliz",
      "person_id": 20400
    },
    {
      "name": "Kathia Nobili",
      "person_id": 62240
    },
    {
      "name": "Nick Lang",
      "person_id": 62241
    }
  ],
  "release_date": "2019-12-03",
  "scene_id": 34312,
  "tags": [
    "Anal",
    "BDSM",
    "Brunette",
    "buttplug",
    "Cage",
    "Dildo",
    "Domination",
    "Double Penetration",
    "Facesitting",
    "Fetish",
    "Gaping",
    "Kinky",
    "Latex",
    "Leather",
    "natural boobs",
    "Pussy Eating",
    "Role Play",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Partner Studio",
    "white"
  ],
  "title": "Nick Lang tames 2 beauties in cat role play"
}