{
  "collections": [
    "Device Bondage"
  ],
  "description": "We start by putting Elise in a back breaking arch. Her legs are spread wide for easy access to her cunt, but that comes later. First is her suffering. The Pope takes a bamboo cane and terrorizes her exposed body, her nipples, armpits, her legs, and even caning her ribs. Her masochism may be her enemy today.\nElise is mounted on a sybian with her legs spread wide and shackled to wooden columns. All of her weight is resting on her cunt and her arms are sleeved and pulled into a strappado that prevents her from leaning back to escape the intense vibrating torment. The zipper is applied to her body, starting at her ear lobes and continuing all the way to her ankles. Most would tap out at this point, but not Elise. The zipper is ripped from her flesh and the room fills with screams of agony. She is then blindfolded and zapped on her fresh wounds to intensify her suffering. Still not tapping out, we turn the sybian up to full speed and sit back and watch as she slowly starts to give out.\nThis has been on of the most intense days of her life, and we still have one more scene planned for this whore. Now Elise is folded in half to expose her bottom two whore holes. She is pinned against the wall and at the point of will breaking. She refuses to give up and suffers through intense bastinado and a severe ass beating. Her reward for the day is having both of her whore holes filled, double penetrated and mind blowing orgasms.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Elise Graves",
      "person_id": 28827
    }
  ],
  "release_date": "2014-01-17",
  "scene_id": 34359,
  "tags": [
    "BDSM",
    "black hair",
    "Blindfold",
    "Bondage",
    "bottom",
    "Caning",
    "Corporal Punishment",
    "Director's Picks: JP The Pope",
    "directorspicks",
    "Domination",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "Shackle",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "switch",
    "Sybian",
    "The Pope",
    "the wall",
    "white",
    "Zipper"
  ],
  "title": "Annihilation of Elise Graves"
}