{
  "collections": [
    "Bound Gods"
  ],
  "description": "Dirk Caber brings Damien Moreau to his play space and shoves the boy’s face into his armpit. Neither one willing to submit, Dirk and Damien go back and forth to determine who’s exactly in control. Dirk overpowers the boy and grabs Damien’s hands, locking them up above his head. Mr Caber kneels down to Damien’s rock hard cock and bites down on it as Damien screams for mercy. He’s then brought to his knees for Dirk to teach him a lesson in how to suck cock. Damien swallows his master’s cock as Dirk beats the boy down into submission. Suspended in the air, Damien swings back and forth as Dirk pulls him by the balls before bringing him down to cock sucking height. He shoves his hard cock down the boy’s throat before shoving an electric butt plug up Damien’s ass with electrodes stuck to his thighs. Damien’s hard cock throbs as electricity surges through him as he’s let down and chained to the wall for a flogging. The boy’s screams fill the room as Dirk beats him front to back with the flogger. Chained down on the bed with a ball gag in his mouth, Damien’s hole is presented for Dirk’s hard cock. He fucks Damien hard in the ass before spraying his cum all over the boy’s face and having him suck it clean.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Damien Moreau",
      "person_id": 51956
    },
    {
      "name": "Dirk Caber",
      "person_id": 27341
    }
  ],
  "release_date": "2014-01-09",
  "scene_id": 34370,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Flogging",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Redhead",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "Tattoo",
    "the wall",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Power Play"
}