{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Two hot brunettes on one big hard cock! This Sunday's Brunch serves up super sexy Belle Noir and Hot pain slut Bonnie Day servicing one giant dick and loving every inch of it. But first, let's attend to some House Business.\nWe have a new house slave: Bonnie Day. Miss Day is a fine specimen of a pain slut and a sexy, submissive cock loving fuck beast. But one thing is missing - she has not been getting any orgasms lately and is feeling a little worried about her ability to come on command for today's show. No Problem. We have the technology to see to it that this little tramp is pushed over the edge of orgasm multiple times - in fact she comes so hard and so many times that she has to beg us make them stop!\nOnce Slave Day gets all the Hard Fucking Machine sex she can stand, we move our attentions to sweet and sexy Belle Noir and her fabulous, fuckable, voluptuous body. Great big tits, juicy nipples and full round ass. And fat cock sucking lips. We see to it that this fine beauty is slipped so much dick that she can hardly walk away at the end of the shoot, and Miss Day is there to take up any slack. Both sluts take dick all afternoon and they inspire the sexy party crowd to get naked and fuck right along with them.\nThe Upper Floor brings you the dirtiest submissive sluts doing the nastiest shit in front of a LIVE party audience, and we stream is live right to you. This is the best live sex party on the web!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Owen Gray",
      "person_id": 39181
    },
    {
      "name": "Bonnie Day",
      "person_id": 39894
    },
    {
      "name": "Belle Noire",
      "person_id": 46776
    }
  ],
  "release_date": "2014-01-10",
  "scene_id": 34395,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blowjob",
    "Bondage",
    "brunch",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "master",
    "Oral Sex",
    "Pain",
    "Pain Slut",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Threesome"
  ],
  "title": "Two Beautiful Cock Sluts Entertain the Sunday Brunch Crowd"
}