{
  "collections": [
    "Hogtied"
  ],
  "description": "Penny Barber is well known for two items: Her gigantic beautiful tits and her big mouth The secret is that Penny does like to submit, but first one has to beat her beyond words. Luckily she comes to Hogtied asking for some marks and to see if she has a limit for orgasms. I was happy to oblige.\n\nThe first scene find our classic beauty hanging by her jugs, toes barely touching the floor, with a couple pounds on metal hanging off her pink labia. Add a vibrator and some flogging and now we have a babbling Barber. She still managed to sneak in some smart ass remarks, but a flogging on her sore nipples helped with her compliance. In the second scene I bound Penny in a tight kneeling position, tits out and tightly bound for maximum sensitivity. Another ten screaming orgasms in and she found she was no longer committed to finding her orgasm limit, but she was convinced to recommit after a strict caning all over her tight body. This lady can take it! And I am more than happy to give it. The last scene I put a worn out Penny on her back, legs in a spread frogtie, and took her round ass for a ride with two big rubber dicks. She resisted until the very bitter end, but on her umpteenth orgasm she was willing to admit, “I’m a double penetration anal slut MILF!”\n\nFinally we agree on something!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Penny Barber",
      "person_id": 6664
    }
  ],
  "release_date": "2014-02-20",
  "scene_id": 34410,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Couple",
    "Domination",
    "Double Penetration",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "MILF",
    "natural boobs",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Busty MILF's hot little mouth gets her in trouble"
}