{
  "collections": [
    "Bound in Public"
  ],
  "description": "Bound in chains, Tripp Townsend sits in the bathroom of a porn shop, blindfolded with a hard cock as the public approaches him. They take turns playing with his cock as clothespins are attached all over his torso. When Tripp starts to get a smart mouth the guys shut up with a cock in his mouth and add clothespins right onto his balls. One by one each clothespin is cropped off as Tripp screams in pain before the guys take him out of his chains and throw him against the sink. Connor Maguire holds him down and hand gags his mouth as the horny crowd comes up to fuck the boy from behind. With his arms tied above his head, Tripp endures Christian Wilde's flogger as he's mercilessly beaten red. The guys bend him over for Christian to ram his giant cock up Tripp's ass as they take turns shoving his head down on their cocks. The crowd then breaks out the fucksall and shoves the toy up Tripp's ass as they milk a load out of his cock. All horned up the guys push Tripp to his knees and make him beg for cum as they each cover his face with their loads.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Tripp Townsend",
      "person_id": 52066
    },
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Connor Maguire",
      "person_id": 46426
    }
  ],
  "release_date": "2014-01-24",
  "scene_id": 34420,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "Chains",
    "Clothespins",
    "Cock Worship",
    "Crop",
    "Domination",
    "Facial",
    "Gag",
    "Gangbang",
    "Gay",
    "Hand Gagging",
    "Humiliation",
    "Male Sub",
    "master",
    "Pain",
    "Public",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Spoiled Brats",
    "Submission",
    "Voyeur"
  ],
  "title": "Bathroom pig whored out to the horny public"
}