{
  "collections": [
    "Sadistic Rope"
  ],
  "description": "Sahara is back for another round of brutal torment. She is dragged on to set, slammed into the wall and given direction on how her day will go down. There will be no warm up, there will be no taking it easy, and there will definitely be no mercy. She is thrown to the floor and toyed with before being put in the most restrictive hogtie she has ever experienced.\nNext, she is in a partial suspension, her arms in a strappado, and balancing on one foot. Her ass is begging for a beating and I oblige. Once her pussy is brought into the equation, we see her willing whore hole explode with a squirting orgasm. She is then lowered to the floor and made to clean her pussy juices off of the floor. To finish, she is lifted into the air and suspended until she can't handle the pain.It's decided that if her cunt wants to play, then that's what's going to happen. She is spread wide and a zipper is applied to her leg, then hot wax is poured over her sensitive flesh. Her cunt falls under a brutal assault from The Pope, yet not letting her suffering ever decrease. Again when The Pope grow bored with this slut, and she is lifted into a suspension, but this time in the most brutal suspension. The only thing holding her up is a rope around one ankle, and she hangs there until her body gives out.\nSahara made it clear that she liked breath play and The Pope gives her more than she can handle. The entire scene is her being taken to the edge, but never allowed to go over. You get to see this slut getting more than she bargained for, yet being the pain slut she is and wanting even more....greedy little slut.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Sahara Rain",
      "person_id": 36730
    }
  ],
  "release_date": "2014-01-15",
  "scene_id": 34423,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Flogging",
    "Gag",
    "Handler",
    "Hot Wax",
    "Humiliation",
    "natural boobs",
    "other hair color",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "shaped",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "Submission",
    "Suspension",
    "switch",
    "Tattoo",
    "The Pope",
    "the wall",
    "Vaginal Penetration",
    "white",
    "Zipper"
  ],
  "title": "Taken to the Next Level - Extreme suffering, intense bondage, and squirting orgasms!"
}