{
  "collections": [
    "Bound in Public"
  ],
  "description": "Crawling on his hands and knees Brandon Moore brings in drinks for the crowd on a platter that's plugged in his ass. His ball gag and the platter are removed as Hayden Richards drives Brandon's head into the crotches of horny party goers. The guys shove as many cocks in his mouth as they can fit before Hayden has Brandon tied down on the fuck box. With their cocks out the guys line up for Brandon to suck them off while Hayden plows him from behind. Back in the center of the room, Brandon's hands are tied above his head with a spider gag in his mouth as the guys suck and stroke his hard cock. Brandon has clover clamps on his nipples and ordered to bite down on the chain as Hayden and Sebastian give him a dual flogging. The guys untie Brandon's hands as he's pushed down face first onto a couch full of horny dudes as he services their cocks while getting fucked from behind. The guys then drag him onto a table, pinning him down and shoving their cocks in his mouth as Brandon's hole opens up for a fist. They fist Brandon's ass and milk a load out of his cock before giving him some painful post-orgasmic torment. Back by the fireplace the guys circle around the community slut and douse his face with all their cum.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brandon Moore",
      "person_id": 51997
    },
    {
      "name": "Hayden Richards",
      "person_id": 47285
    },
    {
      "name": "Jessie Colter",
      "person_id": 34311
    },
    {
      "name": "Joey Rico",
      "person_id": 51709
    }
  ],
  "release_date": "2014-01-17",
  "scene_id": 34521,
  "tags": [
    "Airtight",
    "Anal",
    "Anal Fisting",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "bottom",
    "brunet",
    "Clover Clamps",
    "Cock Worship",
    "Domination",
    "Facefucking",
    "Facial",
    "Flogging",
    "foreskin",
    "Gag",
    "Gangbang",
    "Gay",
    "Handjob",
    "Humiliated Hunks",
    "Humiliation",
    "Latin",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Public",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Sadism",
    "shaped",
    "spider gag",
    "Stud",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Voyeur",
    "white"
  ],
  "title": "Horny party goers gangbang and fist a bound stud's ass"
}