{
  "collections": [
    "Bound in Public"
  ],
  "description": "At a well known cruising bathroom, horny dudes line up in the stalls, playing with each other’s cocks when janitor Marcus Isaacs comes in to clean. Irritated, the janitor ignores all the perverts When one of the cruisers approach him, Marcus gets mouthy and shoves him away. Even though the cruisers think he’s hot, they don’t like his attitude at all and agree they need to teach him a lesson. Marcus is tackled from behind as he’s taken to the ground, the crowd tearing away his clothes and gagging him as he screams for help. They get his cock hard and tenderize him with the crop as the crowd holds him down. Marcus endures a flogging before being pushed to his knees with cocks rammed down his throat. The guys then tie his arms up in the stall and bend him over for a rough fuck. The gang fucked janitor is then suspended in the stall, sucking and stroking cock as the guys take turns fucking his hole. They cover his face in cum before dragging him off, kicking and screaming for more punishment.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Big Red",
      "person_id": 29981
    },
    {
      "name": "Eli Hunter",
      "person_id": 51998
    },
    {
      "name": "Leo Forte",
      "person_id": 22142
    },
    {
      "name": "Marcus Isaacs",
      "person_id": 47853
    }
  ],
  "release_date": "2014-01-03",
  "scene_id": 34540,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "body builder",
    "Bondage",
    "Boot Worship",
    "bottom",
    "brunet",
    "Cock Worship",
    "Crop",
    "Domination",
    "Facial",
    "Flogging",
    "Gag",
    "Gangbang",
    "Gay",
    "Hairy",
    "Humiliation",
    "Latinx",
    "Male Sub",
    "master",
    "muscular",
    "Public",
    "Redhead",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "Voyeur",
    "white"
  ],
  "title": "Pissed off janitor fucked in bondage by horny bathroom cruisers"
}