{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Today's update if the full tag team match that was streamed Live earlier this month. Every First Friday of the month, We stream our tag team matches LIVE If you miss the matches live, we update them on the 3rd Tuesday of the month.\nToday we bring you Team Doomsday which includes fan favorites Daisy Ducati and Lyla Storm. Daisy is quickly making a name for herself this season. She's imposing orgasms out of opponents in singles matches left and right. She is joined today by Lyla Storm. Lyla has showing great improvement this season. These two make a great team\nTheir opponents today are Team Beast. This team is made up by \"The Beast\", Jayogen and new-cumer, Mona Wales. We saw how dynamic Daisy an Mona are when the go against each other and we brought the two together again to get more of that action. Mona Wales was completely mortified from her loss against Daisy last week. She went out and got some training. Mona Wales shows great promise. With Jayogen as her Team Captain, it's possible Mona may get her first taste of victory today.\nThe Winners fuck the losers until they are a sweaty puddle of shame. The losers aren't allowed to cum until the live audience gives permission. Our audience is a kind audience. The fans of ultimate surrender show mercy on our losers and they are eventually allowed to come only AFTER they make our losers cum first.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Jayogen",
      "person_id": 23291
    },
    {
      "name": "Lyla Storm",
      "person_id": 33882
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2014-01-21",
  "scene_id": 34582,
  "tags": [
    "Anal",
    "Ariel X's Favorite XXX Takedowns",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Team Doomsday take on Team Beast in a close tag team match up"
}