{
  "collections": [
    "Bound Gods"
  ],
  "description": "Tyler Sweet sits at the bar, sipping his drink when a muscled hunk, Trenton Ducati, joins him at the bar. As Tyler admires Trenton’s outfit, he learns it’s for a bondage club called The Onyx Tribe. Intrigued, Tyler follows Trenton as he warps the two of them to his lair. Trenton morphs into his Onyx uniform and orders the boy to remove his clothes. On his knees Tyler worships Trenton’s boot as the muscled Onyx crops the boy’s ass. Trenton grabs the boy by the neck and throws him up against the wall before throwing him down to his knees to suck Trenton’s hard cock. Chained to the wall Tyler’s bent over as Trenton rams his cock deep in his ass, pounding him harder and harder to the boy’s screams. Trenton then takes out his flogger and whips Tyler into submission before binding him down on the table. Tyler feels the violet wand against his skin as Trenton sucks on the boy’s cock and shoves a metal plug in his ass. Trenton then removes Tyler’s plug and fucks him again, using a pulley system around the boy’s neck as he rides Trenton’s huge cock. Tyler blows his load onto the Onyx members chest before Trenton throws the boy down and cums all over him.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    },
    {
      "name": "Tyler Sweet",
      "person_id": 50927
    }
  ],
  "release_date": "2014-01-16",
  "scene_id": 34604,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Boot",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Metal Plug",
    "Muscle",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "Tattoo",
    "the wall",
    "versatile",
    "Violet Wand",
    "white"
  ],
  "title": "Onyx Recruit"
}