{
  "collections": [
    "Naked Kombat"
  ],
  "description": "Cameron Kincade\n“The Kin-Killer-Cade”\nHt: 5’10”\nWT: 160lbs\nSeason W/L record ( 1-2)\n\nTripp Townsend\n“Takedown”\nHt: 6’1”\nWT: 165lbs\nSeason W/L record (0-0)\n\nBack for another action packed fight for sexual domination we have Cameron “The Kin-Killer-Cade”. Kin-Killer feels pretty confident after gaining his first win against Dayton “The DOC” O’Connor and of course, once you taste sweet victory, you’re dying for more. Attempting to knock his opponent down a few pegs, we have the hung newcomer Tripp “Takedown” Townsend. With years of wrestling experience, Takedown’s confident he has the skills to take down his opponent. The whistle blows and the match fires up as Kin-Killer is relentless with his improving suplex, slamming Takedown to the mat as he goes for the balls. Takedown returns the favor by shoving his balls in Kin-Killer’s face and beating his ass red for some extra points. After three balls to the wall rounds, the winner is rewarded with a victory fuck and ties up the loser’s hands to fuck him from behind and give him a face full of cum. After getting a face full of cum the loser’s treated with some post-orgasmic torment before he’s left defeated, and covered in cum.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cameron Kincade",
      "person_id": 47006
    },
    {
      "name": "Tripp Townsend",
      "person_id": 52066
    }
  ],
  "release_date": "2014-01-22",
  "scene_id": 34646,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "bottom",
    "brunet",
    "Cock Worship",
    "Domination",
    "Facesitting",
    "Gay",
    "Humiliation",
    "Jockstrap",
    "Rimming",
    "Role Play",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "takedown",
    "Tattoo",
    "the wall",
    "unshaved",
    "versatile",
    "white",
    "Wrestling"
  ],
  "title": "Cameron \"The Kin-Killer-Cade\" VS Tripp \"Takedown\" Townsend"
}