{
  "collections": [
    "TS Seduction"
  ],
  "description": "Jessica and Bella hatch a pay back plan on a creepy gym guy who constantly hits out on them in their local gym.\nHe’s condescending and obnoxious with an attitude that white guy attitude that completely erases the hotness of his muscles.\n\nThe girls have had enough, it’s time for the gym rat to get his ass reamed by Jessica’s hidden cock and Bella’s bootylicious ass!\nWith wrestling moves and crazy strengthen that Eli does not even think girls could possess, Bella pins him to the bed while Jessica ties his legs and arms with skipping ropes. Then Jessica rams her cock all the way into his ass and he screams through the choke hold Bella has on his neck. It is ON. This feature threesome is full of hard cock double pounding - Jessica’s dick fucking Eli’s ass while Eli’s hard cock is in Bella’s pussy moving with every thrust of Jessica’s hips. Eli is a rag doll for these girls as they use him like a sweat towel! He is made to cum twice and Jessica shoots a load all the way up Bella’s body! And of course, sexy Bella has epic, leg shaking orgasms.\n\nThe whole update ends with a skipping rope up Eli’s ass! This gym lesson is over!",
  "directors": [],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Eli Hunter",
      "person_id": 51998
    },
    {
      "name": "Jessica Fox",
      "person_id": 17013
    }
  ],
  "release_date": "2014-02-05",
  "scene_id": 34803,
  "tags": [
    "Anal",
    "Athletic",
    "Big Tits",
    "Blowjob",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Curvy",
    "Latinx",
    "Male Sub",
    "Muscle",
    "muscular",
    "natural boobs",
    "other hair color",
    "Role Play",
    "shaved",
    "Straight",
    "switch",
    "Tattoo",
    "Threesome",
    "toned",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "versatile",
    "white",
    "Wrestling"
  ],
  "title": "TS Jessica Fox & Bella Rossi Fuck the daylights out of a Cocky Gym Rat"
}