{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Today is the 1000th update for FuckingMachines.com. The site began in a basement in the year 2000 and has been everywhere from Japan to Poland to Howard Stern!\n\nWe were Gia DiMarco’s first ever porn shoot (Dec 18, 2009.) we’ve fucked Sasha Grey, Cytheria, Lorelei Lee, Princess Donna, Kristina Rose, Charlie Chase, Charley Lane, we’ve shagged the girl busted with Charlie Sheen - Capri Anderson. We’ve taken more girls porn virginity than we can count and we have YOU to thank.\nThank you for watching Fuckingmachines.com through the years, for buying shoots and memberships and for being great, loyal fans.\n\nWe must thank the over one thousand girls who made us so horny and so happy for the last 14 years.\n\nToday is an extraordinary example of the incredible, genuine amazing machine orgasms here on FM. We put Savannah Fox and Bella Rossi in a room together with machines and watch as squirt flies and dildos pound. They fist each other, they cum until we literally have to stop because Savannah is about to pass out - she doesn’t!\nWe even have a “blooper” that we left in because it happens right as Savannah cums. Bella is licking Savannah’s pussy and as she starts to cum, she pushes the cock out and BAM right in Bella’s kisser - cock slapped at 350 RPMs! Bella is fine and Savannah still manages to finish her epic orgasm. Now, go on and watch this GREAT shoot.",
  "directors": [],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Savannah Fox",
      "person_id": 47440
    }
  ],
  "release_date": "2014-03-19",
  "scene_id": 34843,
  "tags": [
    "Big Tits",
    "bottom",
    "Curvy",
    "Fisting",
    "Machine Dildo",
    "natural boobs",
    "other hair color",
    "Redhead",
    "shaved",
    "Squirting",
    "Straight",
    "Tattoo",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Incredible Squirting, Fisting, G/G Machine fucking, Orgasm Overload!"
}