{
  "collections": [
    "The Training Of O"
  ],
  "description": "Milcah Halili arrives with a high pain tolerance, ready to be trained. She already has experience in the lifestyle and a working knowledge of her limits. This is the type of trainee that you can get into some real detail work with, and so we delve in with extremely tight bondage and painful predicaments in order to shake some answers out of the girl. While she answers some basic questions about her goals and prior training her calves suffer and quiver under her socks. Her legs are captivating, and receive a great deal of attention from the crop, cane, zapper, whatever is on hand really. Add a buckets of rocks hanging off of a a merciless crotch rope and plus a vibrator jammed against her clit, she is ready to give up control and hang in the air, coming helplessly and beautifully.\nClearly the trainee can suffer and speak at the same time, but can she suck dick? And stand on her toes? In a crouch? Carrying heavy rocks? Bound in chain? You get the idea. No dick is ever easily earned on the Training of O, but Milcah may have had to pay forward more than most. She really does look lovely screaming with a dick in her mouth.\nMany pain sluts can take the corporal all day long, but put them in reverse cowgirl and they are ready to beg for mercy. Milcah really shine in the this scene, tied to a giant rod of bamboo and told to ride the dick until I am satisfied. She bounces, begs, comes, and screams.\nOne of the most fascinating things about our intrepid trainee is her porn anal virginity. How she has managed to keep it so long is beyond me, but in exchange for her training she offers it up to you viewers. The scene opens with her on her back, legs spread, begging for the cock in her virgin ass. We let our big dicked gimp take it out on her tight asshole until she is pleading for the come. Well done Milcah. We look forward to Day Two!",
  "models": [
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Milcah Halili",
      "person_id": 45665
    }
  ],
  "release_date": "2014-02-21",
  "scene_id": 34883,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "crop",
    "crotch rope",
    "discipline",
    "Faces Of Pain",
    "female slave",
    "Gimp",
    "humiliation",
    "master",
    "oral sex",
    "pain",
    "pain slut",
    "role play",
    "rope bondage",
    "straight",
    "vibrator",
    "Zapper"
  ],
  "title": "Training of a Pretty Little Pain Slut Day One"
}