{
  "collections": [
    "Whipped Ass"
  ],
  "description": "In December Maitresse Madeline auctioned off a one hour cam show for an astounding $42,000! It all went to her head and she needed to be brought down hard, but by who?!?!? Who is capable of bringing down this wicked dominatrix? We bring in legendary porn star and sexpert, Nina Hartley, to do the dirty work!!!! Nina blind sides Madeline when she least expects it dragging her through the Armory and humiliating her in front of all her colleagues and even in front of her boss, founder and CEO of Kink.com, Peter Acworth! Once Nina gets Madeline all to herself she strips her of her throne, Madeline is made to worship Nina's boots, she's strapped in bondage, whipped, slapped and finger banged! Nina sits on Madeline's face and makes her sniff and lick her pussy. Then to top it all off Madeline is caned hard until stripes are running across her body then she's humiliatingly anally violated by Nina's strap on cock then spit on by her crew and made to clean up the filthy mess she made! Cameo appearances by many of your favorite Kink.com stars! Don't miss this rare chance to see Maitresse Madeline on the bottom and used like a filthy whore left to rot!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 17872
    },
    {
      "name": "Nina Hartley",
      "person_id": 25371
    }
  ],
  "release_date": "2014-03-28",
  "scene_id": 34932,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Ball Gag",
    "BDSM",
    "Best of Maitresse Madeline",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "Brunette",
    "Caning",
    "Cattle Prod",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Female Slave",
    "Femdom",
    "Fingering",
    "Flogging",
    "Foot Torment",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Lesbian",
    "LezDom",
    "MILF",
    "natural boobs",
    "Nipple Torment",
    "Oral Sex",
    "Pet Play",
    "Pussy Eating",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Submission",
    "Tattoo",
    "top",
    "Vaginal Fisting",
    "white"
  ],
  "title": "Retribution: Maitresse Madeline taken down, dominated and anally fucked by Nina Hartley!"
}