{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "Veruca is a spoiled BRAT with major Daddy issues. She wants everything handed to her - her dinner at the television, her stepmother's diamond necklace, and most importantly one of Willy Wonka's five golden tickets. But just because she's spoiled doesn't mean she doesn't know how to get what she wants! By a twist of fate, Veruca catches her conniving stepmom, Princess Donna, having an affair. The smart little brat records the entire interaction, including Donna assuring her lover that as soon as she gets all of her husbands' money she will leave him. Using the recording as blackmail Veruca tries to put mommy in her place. But Princess Donna isn't easily outsmarted and gets her lover who works at Wonka's factory to procure one of the tickets to shut Veruca up. The plan is successful and soon Veruca is off with her daddy to Wonka's factory adorned in her mommy's fur. Watch this Willy Wonka Parody as Veruca gets what she really wants this time! Intense face-fucking, anal, hardcore double penetration, daddy's girl stuffed air tight by oompaloompas, and bukkake! All in The Room of Pure Imagination.",
  "directors": [
    {
      "name": "Princess Donna Dolore",
      "person_id": 47
    }
  ],
  "models": [
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Toni Ribas",
      "person_id": 38962
    },
    {
      "name": "Astral Dust",
      "person_id": 43670
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Veruca James",
      "person_id": 43570
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    }
  ],
  "release_date": "2014-08-27",
  "scene_id": 35040,
  "tags": [
    "Air Tight",
    "anal",
    "bdsm",
    "Blow Bang",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "Double Penetration",
    "gangbang",
    "parody",
    "role play",
    "Rough Sex",
    "straight"
  ],
  "title": "Veruca James and The Room of Pure Imagination!"
}