{
  "collections": [
    "30 Minutes of Torment"
  ],
  "description": "Straight, East coast, stud Jay Rising begins his test in The Pit where Van works over all 10 inches of his fat cock. After getting hard from some ball squeezing Van promises to bring things full-circle before punching Jay's abs and chest. An intense flogging brings Jay to the brink and earns him his next chamber, The Padded Cell.In a full leather harness Jay is helpless as he's tossed around the room like a rag doll. The impacts bring him to his knees and with his ass exposed Van introduces the bamboo cane. Jay's ass, chest, and thighs, welt beautifully from the deceivingly painful whacks. Another round of slamming the cocky stud around the room gives Jay the impression the station is over, until Van returns with the crop to slap the sensitive welts all over Jay's body until he screams.Gagged in The Electric Chamber, Jay gets an electrified butt plug shoved up his ass while he endures the electric pads on his thighs. The Violet Wand agonizes the stud as the current from the plug fucks his ass. After using the mini-taser all over his body, including his tongue and cock, Jay has finally made it through his 30 minutes. Van maintains his promise to bring the ball squeezing full-circle as he grips Jay's nuts hard while the stud's monster cock oozes cum.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Jay Rising",
      "person_id": 52397
    }
  ],
  "release_date": "2014-12-02",
  "scene_id": 35108,
  "tags": [
    "anal",
    "bondage",
    "Brutal Punishment",
    "CBT",
    "Corporal Punishment",
    "crop",
    "flogging",
    "gag",
    "gay",
    "leather",
    "Male Handler",
    "pain",
    "punching",
    "harness",
    "rope bondage",
    "straight",
    "Stud",
    "taser",
    "the electric chamber",
    "the padded cell",
    "the pit",
    "violet wand"
  ],
  "title": "Stud with a 10 inch fat cock gets torment to the extreme"
}