{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "This is republish. Tomorrow you will see the Tag Finale. Today we remind you of what happened in the beginning of season 11 and how these teams were made\nTHIS IS MARCH MADNESS and we are bringing you Sexual Submission in the Mission\nThis is the full update of our 12 girl March Madness series. The teams chosen today will be the teams going forward for the rest of the season.\nMistress Kara is the team captain for the Queens, She choses the following wrestlers for her team :Kara's Team:\nPenny Barber\nJuliette March\nSasha Princess BanksDaisy Ducati\nElizabeth ThornCheyenne's team:\nBella Rossi\nParis Lincoln\nMona Wales\nRilynn Rae\nElla Nova\nCheyenne wins the coin toss and gets first pick of wrestler. Kara gets to pick the first match up. The team who wins the match gets to pick the match ups. Kara's first match up choice forround 1 Mona Wales vs. Sasha Princess Banks. Neither Wreslter have a great deal of experience but both have a ton of heart.round 2 Two tall sexy strong babes go at it, Daisy Ducati and Rilynn Rae. These leggy babes brutalize each other with leg holds and body scissors round 3 Petite girls, Juliette March and Paris Lincoln go at it so hard that Paris must call it quits, Mona wales finishes up the round on behalf of Team Wranglerround 4 The team Captains go at it. Kara lays the pain on Cheyenne in front of her entire team round 5 Ella Nova and Elizabeth Thorn....lizzy is pickup up some skill but the Noobe, Ella isn't a push over. She is able to reverse a lot of Elizabeth's holds but the pussy fingering is just too much for her to over cum Round 6 One of the best rivalries in US history is Penny Barber and Bella Rossi. These two have a love hate relationship. They love to hate each other. These two go back and forth in victories. Today the winner of this match really wants to rub it in on the looser....but winning the individual match isn't enough if the rest of your team really fucking sucked for their rounds.\nWinners and Losers. Girls who won their rounds still have to get fucked. The Prize round is one of the most brutal fuck fests that US has ever seen. Dick swapping in all the pussies. Every pussy gets fucked by every cock!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Paris Lincoln",
      "person_id": 50243
    },
    {
      "name": "Sasha Banks",
      "person_id": 46429
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Juliette March",
      "person_id": 22072
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Rilynn Rae",
      "person_id": 39210
    },
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "Elizabeth Thorn",
      "person_id": 40429
    }
  ],
  "release_date": "2014-10-27",
  "scene_id": 35246,
  "tags": [
    "Anal",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Orgy",
    "Pain",
    "Petite",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "SEXUAL SUBMISSION IN THE MISSION 6 rounds of wrestling 1 hard core orgy"
}