{
  "collections": [
    "The Training Of O"
  ],
  "description": "The MILF is the most difficult subject to train because they have more shit to undo than other subjects. This also makes them the more interesting and challenging. Case in point, Miss India Summer, aka MILF of the Year. The lady is special, but slave training is the Great Equalizer. We all find humility eventually, and I am here to take Miss Special Snowflake down a notch.\nSummer is hooded and taken to the basement prisoner style where she is bound, clipped and grilled to come up with her own Principles of Servitude. These principles will underpin her curriculum moving forward, and everything she does will reflect them.\nOnce she makes it through her daily lesson, she is allowed to earn her training collar. A training collar bears great weight, and she is made to fuck while wearing 50 lbs. of chain to reflect this truth. In the end she is filthy, sweaty and beaten but emerges with collar in hand. Her reward for a job well done is to be tied down and fucked in the ass while reviewing the days work.\nAll in all, and good day's work for our newest trainee. She is properly used and learned something along the way. Now go to your room and do your homework: What is ego and how does it relates to submission?",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Cliff Adams",
      "person_id": 50469
    },
    {
      "name": "India Summer",
      "person_id": 16909
    }
  ],
  "release_date": "2014-06-20",
  "scene_id": 35685,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "blond",
    "Bondage",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "foreskin",
    "Gimp",
    "Hood",
    "Humiliation",
    "master",
    "MILF",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "shaped",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "India Summer's Principles of Servitude, Day One"
}