{
  "collections": [
    "Captive Male"
  ],
  "description": "Busty Brunette FemDomme Sandra Romain is running the show in her dark dungeon room. She is stunning dressed in tight blue stockings with high heeled boots. Her beautiful big round ass controls your attention. And you will give her your attention as she trains her Secret Agent. Tall black and hung, this man is ready to be dominated. Tied up in tight rope bondage suspension and faced covered in leather. This hungry bottom will do anything to please his dominant mistress. Corporal punishment is up first. A brutal flogging from Sandra gets Secret screaming. Next the Femdom Sadra Romain focuses on Agents pierced hung hard cock. His cock and balls are brutally tormented. Stretched and abused.His thick black pubes ripped out with screams of pleasure. She puts her sex toy on the ground and ties him tight. Sandra uses her full body weight to crush her pet under those tall high heels. Stomping on his body he begs for more. Sandra delivers her dripping wet divine pussy to smother his face. Her obedient toy delivers pussy licking, but that is just to tease and torment him. She returns to punish the rest of his body before 69ing and taking what she needs. Finally on her twisted mind, she gets the black gloves out to stretch out this toys anal hole. She must get that ass ready and stretched before she puts on her strap-on. He is ready and begging for a pegging. Sandra Romain delivers a brutal strap on fucking to her willing pet bottom. Blindfolded he has no idea what's to come, but he loves and devours every second of it. Do not miss this deviant and twisted, captive male. This one will deliver all your darkest fantasies for fem dom and male torment.",
  "directors": [],
  "models": [
    {
      "name": "Sandra Romain",
      "person_id": 10239
    },
    {
      "name": "Secret Agent",
      "person_id": 52735
    }
  ],
  "release_date": "2017-06-24",
  "scene_id": 35758,
  "tags": [
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "dungeon",
    "Femdom",
    "Flogging",
    "gloves",
    "High Heels",
    "Leather",
    "Male Sub",
    "Nylons Stockings",
    "Pegging",
    "Rope Bondage",
    "Straight",
    "Strap On",
    "Suspension",
    "thirdparty"
  ],
  "title": "Fingered And Fucked: Sandra Romain Trains Secret Agent"
}