{
  "collections": [
    "Bound in Public"
  ],
  "description": "Kirk Cummings lost his Naked Kombat fight against Dominic Pacifico and now Kirk’s punishment is just getting started.. Dominic leads him down the street, bound and blindfolded until he spots a playspace to whore Kirk out at. A line of horny dudes wait to enter the playspace when all of a sudden Kirk is busted through the door, shoved to his knees and his face buried in their crotches. Aroused, the guys whip out their cocks and put the bound stud’s mouth right to work before taking him upstairs to the glory holes. The crowd tears away Kirk’s clothes and bend his ass over to get fucked like a spit roast. Next the guys line up their cocks as a spider gag pries Kirk’s mouth open, ready to suck every dick in sight. They use his mouth like the whore that he is before tying him down with a hood on his head. The horny crowd pours candle wax all over Kirk’s torso as he screams in pain. They handgag his mouth to shut him up as Dominic gives his hole a final fuck before the guys line up and give the bound bitch a nice bukkake all over his face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Aleks Buldocek",
      "person_id": 52632
    },
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    },
    {
      "name": "Kirk Cummings",
      "person_id": 44246
    }
  ],
  "release_date": "2014-05-30",
  "scene_id": 35789,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blindfold",
    "Blowjob",
    "body builder",
    "Bondage",
    "Boot Worship",
    "bottom",
    "brunet",
    "bukkake",
    "Cock Worship",
    "Domination",
    "Facial",
    "Gag",
    "Gangbang",
    "Gay",
    "Hood",
    "Hot Wax",
    "Humiliation",
    "Latinx",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Public",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "spider gag",
    "Spit Roast",
    "Stud",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Voyeur",
    "white"
  ],
  "title": "Shut up and take our cocks you fucking loser!"
}