{
  "collections": [
    "Kink Features"
  ],
  "description": "Barbarella: A Kinky Parody\nWatch all of Lorelei Lee starring as Barbarella in this complete release of Kink.com's first ever cross site web series.\nOn Planet Ultimate Surrender, pervy twins tear each other's clothes off and sexually assault each other as Barbarella becomes victim to their forbidden crimes of lust. Four beautiful wrestlers gangbang Lorelei Lee before she is carried off by a masked amazon.\nBarbarella submits to three of the hottest dommes on Electrosluts. Aiden Starr, Chanel Preston, and Ariel X co-star as evil electric dolls that shock, zap and fuck Lorelei until she can barely take any more. Fisting, pussy licking, violet wand fucking, double penetration with samurais, anal electric plug, double cattle prod, taser, and more!!!\nAs this kinky adventure continues Lorelei Lee finds herself in the lair of the Black Queen portrayed by Maitresse Madeline. Hungry for the Essence of Man, Kip Johnson is whipped, beat, and humiliated for the pleasure of the Black Queen. Lorelei Lee finally succumbs and uses Kip for her own desires. Made to worship her pussy and ass, Kip is ultimately used as a human dildo.\nStrapped in bondage Lorelei withstands whipping, flogging, caning, ass slapping, rimming, pussy licking, fisting, choking, nipple torture, boot worshipping, and anal strap-on fucking all until orgasms are uncontrollably ripped from her cunt by the Black Queen. The tables are turned when an escape allows Lorelei to switch roles and dominate the evil mistress with some of her own strap-on punishment.\nBarbarella lands Lorelei Lee on planet Sex and Submission where she submits to unforgiving bondage and merciless rough sex! In this very intense scene, Lorelei pushes her limits and shows that she is one of the hottest and toughest girls in the BDSM world. She endures the physical challenge of the \"Wall Stockade\" the helplessness of a Japanese rope suspension and the vulnerable display of a wide leg spread position all while Ramon goes to town fucking and pulverizing her pussy, ass hole and mouth!\nFinally, since the dawn of FuckingMachines.com in 1999, members, fans, crew, and models have asked us to shoot the scene from Barbarella with the Orgasmatron - the machine that is supposed to be death by orgasms for the fearless sex crusader, Barbarella. Our extraordinarily talented crew of set designers, production staff, editors and models have recreated Barbarella as a cross site feature update. This is the final sex machine face off for the evil Dylan Ryan and the angel, Lorelei Lee.",
  "directors": [],
  "models": [
    {
      "name": "Lorelei Lee",
      "person_id": 758
    }
  ],
  "release_date": "2014-07-09",
  "scene_id": 35819,
  "tags": [
    "69 Position",
    "Airtight",
    "Anal",
    "Asian",
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Bizarre",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Boot",
    "Boot Worship",
    "Brunette",
    "Bush",
    "Caning",
    "Cattle Prod",
    "CBT",
    "Champion",
    "Choking",
    "Clover Clamps",
    "cock and ball torture",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Dominatrix",
    "Double Penetration",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "Facefucking",
    "Female Slave",
    "Femdom",
    "Fetish",
    "Fisting",
    "Flogging",
    "Gangbang",
    "High Heels",
    "Hitachi",
    "Interracial",
    "Kinky",
    "Latex",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "Lingerie",
    "Machine Dildo",
    "Male Sub",
    "Mask",
    "multiple orgasms",
    "Nipple Torment",
    "Nylons Stockings",
    "Pain",
    "Pain Slut",
    "Parody",
    "Pussy Eating",
    "Reverse Gangbang",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Scissoring",
    "Slapping",
    "Slave",
    "Small Tits",
    "Stocks",
    "Straight",
    "Strap On",
    "Submission",
    "Suspension",
    "switch",
    "Taser",
    "Tattoo",
    "Vaginal Fisting",
    "Violet Wand",
    "Whipping",
    "Wrestling",
    "Zapper"
  ],
  "title": "Barbarella: A Kinky Parody. Starring Lorelei Lee as Barbarella."
}