{
  "collections": [
    "Electrosluts"
  ],
  "description": "Newcomer Freya French burst out the gates of Electrosluts running: she says she likes pain, and Chanel Preston uses our heaviest electro toys on her. Freya is wrapped in transparent latex and tied in predicament bondage, straddling an electrified copper pipe that shocks her pussy and ass while another shocking pipe is wound between her arms and back, electrifying her sensitive, nipple-clamped tits. Mistress Chanel furthers the punishment with our meanest violet wand attachment, one only few girls can stand. Freya takes it all over her trembling body and is finger fucked hard, taking nearly Chanel's entire hand until she cums over and over. As a reward, she is allowed to worship Mistress Chanel's pussy while being mercilessly zapped and tazed. The pain only makes Freya work harder, so Chanel bends her over and turns the electricity up higher and higher. She fucks her pussy with the samurai, stretches her ass with an hard strap-on ANAL electrofuck, and delivers the most brutal cattle prodding we've seen in a long time. Painsluts like Freya cum but once in awhile-- this shoot is not to be missed!",
  "directors": [],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Freya French",
      "person_id": 52233
    }
  ],
  "release_date": "2014-07-31",
  "scene_id": 36019,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Brunette",
    "Cattle Prod",
    "Cop",
    "Corporal Punishment",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Humiliation",
    "Latex",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pain",
    "Predicament Bondage",
    "Predicament Shoots",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "Tens Unit",
    "Violet Wand",
    "white",
    "Zapper"
  ],
  "title": "Hardcore Latex Painslut Electrofuck"
}