{
  "collections": [
    "Electrosluts"
  ],
  "description": "Mia Li is an innocent college student looking to earn some extra money. What better way than an invasive medical study?\nPerverted doctor Isis Love is researching what makes horny young sluts cum and she searches Mia's holes for an answer. First, she shocks her tight ass with the zappers and taser, then tests Mia's orgasm endurance by stuffing her pussy with an electrified dick-on-a-stick. Dr. Love was shocked to find Mia could cum from electricity...again and again and again. And that was just the first part of the study.\nMia can't stop squirming so she is put into bondage and hooked up to the electrical pads, which make her entire athletic body convulse. See her muscles shake and tremble as she is subjected to a pussy and ass eating test, then gets smothered by Dr. Love's tits. An enormous electro prod is inserted into Mia's pussy and she cums some more, earning her a final showdown with the cattle prod.\nDr. Love then has a real breakthrough in the field of orgasm research. Mix one part athlete with one part desperate, young slut and you get Mia Li: a rare subject who cums harder from being shocked to the core. Mia takes the prod like a champ and is left tied to the table, shaking and cumming all over the lab.",
  "directors": [],
  "models": [
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Mia Little",
      "person_id": 51496
    }
  ],
  "release_date": "2014-08-28",
  "scene_id": 36059,
  "tags": [
    "Anal",
    "Asian",
    "Athletic",
    "BDSM",
    "black hair",
    "Bondage",
    "Brunette",
    "Cattle Prod",
    "Corporal Punishment",
    "Curvy",
    "Doctor",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mixed",
    "Muscle",
    "Pussy Eating",
    "shaped",
    "Slave",
    "Straight",
    "Strap On",
    "switch",
    "Taser",
    "Tens Unit",
    "toned",
    "Zapper"
  ],
  "title": "Deep Electro Examination"
}