{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Sultry new slave girl Audrey Holiday is publicly humiliated with metal butt plugs, strict spanking, tied tight and fucked in the ass with a huge cock. Aiden Starr gets hungry and jumps in as senior slave, stealing all the cock for her pussy, making Audrey take a huge cum load down her throat and lick up the mess.\nThe House is in disarray. One slave is so late, she is sent home by Stefanos, leaving only one piece of fresh slave meat and no senior slave. To make matters worse, Governess Aiden Starr is visiting ands has been promised two latex slave during her stay. She wastes no time laying in sultry Audrey Holiday, quickly destroying her ego and humiliating her in front of the sex party crowd. Made to cum on her knees with a weighted metal plus in her ass, Audrey looks sexy and desperate within minutes.\nAiden is still not satisfied, and appoints herself defacto senior slave for the evening, partially to teach the new girl and partially because she is a horny bitch that loves dick. A house guests with a hard dick is located, and Aiden soon is sliding her red lips around in a sloppy blow job while Audrey licks balls and cleans Aiden's ass.\nThe Governess decides to place Audrey on further fuck training, and only allowing her to lick boots and practice on her strap on. Insatiable male guests can't stop watching Aiden's bouncing ass, and eventually The Governess getting fucked in her perfect pussy with Audrey groveling underneath her.\nSatisfied, Aiden allows Audrey to take a hard butt fucking in a painful rope predicament. Followed with a kinky threesome in which Aiden uses Audrey to lick her pussy and fluff the cock until she has had all the orgasms and is ready have hot cum sprayed down the back of her throat.",
  "models": [
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Audrey Holiday",
      "person_id": 57661
    }
  ],
  "release_date": "2015-06-05",
  "scene_id": 37350,
  "tags": [
    "public",
    "slave",
    "latex",
    "pain",
    "spanking",
    "kinky",
    "strap on",
    "threesome",
    "anal",
    "butt fucking"
  ],
  "title": "Latex Slave Girl Anally Debased By Dick Hungry Governess"
}