{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "CiCi Rhodes’ husband knew he married a frisky girl, but never imagined she’d wait til their honeymoon to unveill exactly what kind of raging whore she was. After nearly getting caught fucking in the public sauna at their resort, she lets it slip that maybe she would’t mind if some other guys watched…or even…joined in! Ever the supportive hubby, her new man delivers just that… straight into all her holes!\n\nDripping in chains and bondage, CiCi is taken down by five men at the massage parlor. They fuck her face silly then flip her over to begin the hardcore fuckfest she wants so badly. An endless chain of cocks stuff her newlywed ass while even more invade her cunt, double penetrating this bride into an airtight, orgasming version of her former self.\n\nForget “I do”; at the end of this ceremony she is begging to be covered in load after load of hot cum. Once again her wish is granted: a giant bukkake circle and full facial for what’s left of the lovely bride.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Bill Bailey",
      "person_id": 46601
    },
    {
      "name": "CiCi Rhodes",
      "person_id": 33887
    },
    {
      "name": "Gage Sin",
      "person_id": 53344
    },
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Will Powers",
      "person_id": 6308
    }
  ],
  "release_date": "2015-05-13",
  "scene_id": 37457,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "bukkake",
    "Chains",
    "Corporal Punishment",
    "Double Penetration",
    "Facial",
    "foreskin",
    "Gangbang",
    "muscular",
    "natural boobs",
    "Public",
    "Redhead",
    "Role Play",
    "Rough Sex",
    "shaped",
    "shaved",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "Honeymoon Gangbang: Till 5 Cocks Tear Her Apart"
}