{
  "collections": [
    "The Upper Floor"
  ],
  "description": "It's a beautiful Sunday Brunch and The House is packed with our most salacious local BDSM players. Service should be impeccable, with senior house slaves Darling and Gabriella on hand.Their only job is to handle 19 year old all natural newbie Sydney Cole and serve strawberries, blow jobs, entertaining orgasms, and let the guests clamp their tits. Quickly the Steward's orderly celebration is in ruin. Gabriella can't stop smirking with a hard cock in her mouth, the new girls squeaks like a mouse when she cums, and Darling keeps losing the butt plug out of her slutty ass while serving strawberries.\nEmbarrassed by this display of inept delegation and grace, the Steward seizes Gabriella's collar and placed her in heavy chains as the Drool Slave. If she can't stop smirking, her mouth will be of use lubing Darling's ass for a punishment fucking. Darling has lost her collar as well and as is strung up in a brutal suspension to be used anally by our horny house guest.\nOnce Darling has suffered beautifully and earned her place as senior slave back it is Gabriella's turn to be stuffed with dick in tight leather restraints. Gabriella's shocked face is priceless as she takes a monster cock in her ass and apologizes for her smirking ways. Meanwhile, Darling tries to prepare Sydney for sexual service by teaching her rules with a vibrator and crop. Guests become horny and create a series of rousing BDSM play scenes with rope bondage, paddling, CBT, and blow jobs.\nOnce Gabriella and Darling are both back in their collars, having suffered and apologized appropriately, they finish the day teaching innocent little Sydney how to keep the crowd happy and make a cock cum.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Gabriella Paltrova",
      "person_id": 41906
    },
    {
      "name": "Karlo Karrera",
      "person_id": 35221
    },
    {
      "name": "Sydney Cole",
      "person_id": 57458
    }
  ],
  "release_date": "2015-04-24",
  "scene_id": 37599,
  "tags": [
    "19-Year-Old",
    "Anal",
    "BDSM",
    "big dick",
    "Big Tits",
    "black hair",
    "Blonde",
    "Bondage",
    "brunch",
    "CBT",
    "Chains",
    "Collar",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "drool",
    "Female Slave",
    "Humiliation",
    "Leather",
    "master",
    "mixed",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Paddle",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Suspension",
    "Threesome",
    "Vibrator",
    "white"
  ],
  "title": "Disorderly Anal Slaves Disciplined"
}