{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The House opens its doors to a throng of horny guests all gathered around fresh faced 18 year old Ashley Adams and our well trained Anal slave Penny Pax. It is Maestro Stefanos' birthday, and gift wrapped slave girls sent from Peter Acworth jump into Stefanos' lap, ready to deliver birthday blow jobs and anything else he may desire. The crowd cheers as all four bound slave girls get on their knees and deliver skillful blow jobs to male guests while mercilessly whipped and vibrated to orgasm. All four beauties are taught to stand and cum in unison while professing their dedication to The House.\nWith the birthday boy seated and being sexually serviced by his slave girls for the night, Ashley and Penny are bound tightly with rope and told to struggle out of their bind in a competition for dick. Ashley shows off her gorgeous body and voracious appetite for cock with two male guests, while Penny Pax takes the punishment and anal fucking of a seasoned House Slave!\nThe end of the night is a orgy of slave flesh, with Penny Pax teaching Kink Newcomer Ashley how to deliver a strict reverse cowgirl fuck while birthday sex slaves Bella Rossi and Siouxie Q cum over and over again with their bouncing breasts flogged. The crowd shouts encouragement as our well trained slaves coax cum out of the male guests with tit jobs and hungry mouths. Well done ladies!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Ashley Adams",
      "person_id": 57457
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Siouxsie Q",
      "person_id": 34821
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2015-04-17",
  "scene_id": 37593,
  "tags": [
    "18-Year-Old",
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "master",
    "Oral Sex",
    "Orgy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Threesome"
  ],
  "title": "Hardcore Anal Celebration of Sexual Service"
}