{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Butler Bill Bailey steps into the Master bedroom to enjoy a drink and finds a pair of hapless slaves locked in punishment bondage. These brand new girls managed to anger Governess Aiden Starr and have been stripped of their uniforms and left naked with a note requesting Bill make them earn their clothes back. Bill is not the sort of man to turn down a good time and makes good use of 19 year old Melissa and slutty cock sucker Karmen. Both girls drool and beg as he runs his gloved hands over their vulnerable flesh and shoves his cock deep in their gagged mouths. Karmen screams as bill violently fucks her in the body stocks and whips her tight body with a flogger.\nKarmen is set in a predicament, holding both girls uniforms on silver trays that she must keep balanced in the air. If she drops them, innocent little Melissa will be zapped mercilessly while fucking hard dick. It's an impossible challenge, even for a well toned slave. Karmen has tight nipple clamps and a hitachi tied tightly to her pussy creating helpless orgasms in waves. Melissa begs her to keep her arms up as she exhausts herself bouncing on Bill's dick, but eventually gravity wins and Karmen is apologizing to Melissa's pussy with her tongue as both slaves are zapped repeatedly.\nBill has been thoroughly amused with the whole affair, and gives the slaves back their newbie uniforms. Then he ties them both on a table with their sweet asses in the air for a proper reaming. These newbies learn how to properly serve the House with many orgasms and faces covered in cum.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Karmen Karma",
      "person_id": 48674
    },
    {
      "name": "Bill Bailey",
      "person_id": 46601
    },
    {
      "name": "Melissa May",
      "person_id": 56252
    }
  ],
  "release_date": "2015-05-01",
  "scene_id": 37598,
  "tags": [
    "19-Year-Old",
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "drool",
    "Female Slave",
    "Gag",
    "Hitachi",
    "Humiliation",
    "master",
    "Nipple Clamps",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Stocks",
    "Straight",
    "Threesome",
    "toned"
  ],
  "title": "Fresh & Useless: New Girls Sexually Used"
}