{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Sweet and obedient Cadence Lux arrives for a romantic get away with her fiance Tommy so they may finish their wedding vows. However, Tommy has his own wedding vows planned and has ordered devious sex slave Dani Daniels to provide some much needed training for his future wife. Cadence has always dreamed of submissive sex and eases into her new life of sexual service and slave training.\n\nShy at first, Cadence meekly presents her pussy for eager Dani to lick and service while Tommy whips Dani’s tightly tied bubble butt and uses her perfect slave pussy. Wide-eyed Cadence asks if it can always be like this? All honey moons must end, and Cadence enters into the truth of her marriage in the next scene, mercilessly strapped down with rope while Dani rides her shocked face and her fiance whips her pussy until it is raw and pink, then ruthlessly fucking her until she is begging. Dani’s sadistic slave side begins to emerge as she spits in her trainee’s face, slapping and choking her into many painful orgasms.\n\nDani has had enough of training this sweet young lady, and steals her husband-to-be’s cock for a rousing ride while humiliating and beating on Cadence. Taking Tommy’s cum in a cream pie she allows Cadence to lick it out while staring into her pleased fiance’s eyes.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    },
    {
      "name": "Dani Daniels",
      "person_id": 47540
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2015-04-10",
  "scene_id": 37661,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Choking",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "Latinx",
    "master",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Threesome",
    "toned",
    "white"
  ],
  "title": "To Honor & Obey: Virginal fiance trained for Sexual Slavehood"
}