{
  "collections": [
    "Bound Gods"
  ],
  "description": "Derek Scott tried to evict Sebastian Keys, but Sebastian had something else in mind. Now after relentless edging, Derek remains suspended and hogtied in Sebastian’s fuck den for days now. Back at Derek’s office, a resentful Christian Wilde gets dispatched to find his missing rival colleague – that same arrogant Derek Scott who stole Christian’s promotion. As Christian uncovers the lurid scene in Sebastian’s apartment, he gets some twisted ideas of his own. Helpless to do anything else, Derek submits to Christian, deep-throating huge cock and giving a sloppy rimjob. Christian swings Derek by his balls before fucking his ass. Christian next allows Derek to stand on his feet again, although bound and blindfolded, and delivers a brutal flogging before once more suspending his prick coworker as the flogging continues. The field work isn’t complete without an evaluation of the apartment’s power grid, so Christian has Derek test an electro buttplug and stimulation electrodes. Satisfied with the tests, Christian gets back to a vicious fucking before blowing his load all over Derek’s ass. Derek gracious accepts Christian’s cum, and begs for his own orgasm. Christian obliges, and Derek finally gets his release. The torment hasn’t ended, however, as Christian manhandles Derek’s sensitive cock head and balls.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Derek Scott",
      "person_id": 56668
    }
  ],
  "release_date": "2015-04-09",
  "scene_id": 37708,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blindfold",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "buttplug",
    "Corporal Punishment",
    "Domination",
    "Edging",
    "Feet",
    "Flogging",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Arrogant techie dominated & revenge fucked by his spiteful coworker"
}