{
  "collections": [
    "Bound Gods"
  ],
  "description": "Head to toe in his tight leather uniform, Christian Wilde admires a new deerskin crop. Doug Acre, house slave #153 stands at attention to Christian's left, stuffed in a cramped cell. They await the arrival of Adam Ramzi, who will undergo dom training today. With Adam's arrival, Christian presents #153 to Adam, outlining the essential concepts of BDSM as he smacks the slave with his hands and crop. Christian has the boy get to boot blacking as he explains to Adam the importance of keeping the slaves tasked with chores. #153 sets down the polishing rag and gives Mr Wilde a proper spit shine with his tongue. Mr Ramzi learns first hand how a slave properly services his master's cock as #153 begs for more. While sucking Mr. Ramzi, Christian stands the slave up and fucks him from behind, as he struggles to balance on one leg. Christian then brings Doug back to his knees and blows a hot load all over his face. Adam then tries his hand at flogging, delivering a vicious treatment in tandem with Christian as #153 endures every blow. With his slave all to himself, Mr Ramzi binds & blindfolds his boy to a fuck platform, legs spread upward, hole at full presentation. #153 feels every inch of his master's uncut cock ram inside him before Mr Ramzi blows his load all over the bound stud's fat cock. On his knees, #153 is ordered to cover the new house dom's boots and lick it up clean.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Adam Ramzi",
      "person_id": 53722
    },
    {
      "name": "Doug Acre",
      "person_id": 47153
    }
  ],
  "release_date": "2015-05-07",
  "scene_id": 37706,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Boot",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Flogging",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Stud",
    "Submission",
    "Uncircumcised"
  ],
  "title": "Welcome to the House Mr Ramzi"
}