{
  "collections": [
    "Men On Edge"
  ],
  "description": "Sebastian meets up with Hugh Hunter today, a KinkMen fan who fantasizes about receiving a bondage experience beyond anything he’s had before. Sebastian obliges, tying Hugh to a chair and slowly stripping the clothes from his muscled body. Sebastian places a blindfold over Hugh’s eyes to intensify the sensations and starts worshipping the nipples on Hugh’s bulging pecs. Hugh moans as Sebastian takes his time on Hugh’s throbbing cock, agonizingly teasing it with his mouth before finally peeling it out. Sebastian edges Hugh again and again, making Hugh taste the precum from his diamond-hard dick. Even with a double-Hitachi treatment on his nipples and dick – followed by an extended foot worshipping – Hugh still is not allowed to cum. Next, Hugh is taken from the chair and bound to the pool table, face down, ass up. With his balls tightly wound in red twine, Hugh takes a vibrating dildo up his tight hole. The ass fucking makes the cum denial more and more unbearable, but Sebastian continues the edging. Now flipped over on the pool table, Hugh has his toes worshipped a second time as Sebastian jerks his swollen dick. Hugh gets the large prostrate massager in his ass and receives more edges. Pushing Hugh to the limit, Sebastian finally allows the hunk to cum all over his bound abs before tormenting his sensitive cock head and tickling the hell out of his feet.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Hugh Hunter",
      "person_id": 57059
    }
  ],
  "release_date": "2015-04-28",
  "scene_id": 37709,
  "tags": [
    "BDSM",
    "big dick",
    "Blindfold",
    "body builder",
    "Bondage",
    "brunet",
    "Dildo",
    "Edging",
    "Feet",
    "Gay",
    "Hitachi",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "switch",
    "Tattoo",
    "the chair",
    "Tickling",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Hot KinkMen fan gets the full treatment as he's bound & aching to cum"
}