{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Slutty Syren De Mer is the perfect sex slave, but is selfish and only serves her own cunt. When she fails to train the newbie know nothing slut Katerina Kay we take away her slave collar AND her orgasm privileges. Orgasm denial is pure torment for a squirting MILF whore like Syren, so she gets right on her task. Unfortunately the sadistic Butler won’t let her have it that easy, and bangs her trapped cunt in bondage while she tries to teach a gagged Katerina the House Rules. To make matters worse, Butler Bill has a penchant for stretching holes, and soon has his massive fist crammed in Syren’s tight pussy, causing her to lose control and squirt all over the furniture.\n\nKaterina is a good slut and soon shows that she know’s the rules while enduring a deep pounding in front of all the guests. Syren is pleased to earn her collar back, but is a strict senior slave and sets to making Katerina sweat in a reverse cow girl fuck to prepare the Butler’s cock for her ass. Syren is a true anal slut, and will not be satisfied until Bill’s cock is deep in her ass she has her own face face deep in Katerina’s butt, licking her sweet asshole.\n\nTruly, Syren is one of the finest MILF sex slaves we have on hand, and she has delivered a perfect performance as both senior slave and slutty anal submissive. Thank you ladies!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Bill Bailey",
      "person_id": 46601
    },
    {
      "name": "Katerina Kay",
      "person_id": 58184
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2015-07-10",
  "scene_id": 37859,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "blond",
    "Blonde",
    "Bondage",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Gag",
    "Humiliation",
    "master",
    "MILF",
    "natural boobs",
    "Oral Sex",
    "Orgasm Denial",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Squirting",
    "Straight",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "white"
  ],
  "title": "Slutty Anal Slave Squirts with Butler's Fist in Her Cunt"
}