{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Chanel Preston is reduced to begging for hard dick in her greedy ass. Bianca Breeze tries to steal dick where she can, eagerly fucking in tight bondage and taking Chanel's sloppy seconds. The anal queen joins the slave ranks for a day so she can fuck like a true submissive.\nChanel Preston visits The Upper Floor as a guest and enjoys every inch of her male companions cock in sumptuous surroundings. As she is taking a horny ass fucking, she sadistically torments her slave Bianca Breeze. Bianca is degraded with Chanel's ass juice rubbed all over her face and taunted with dick and nipple clamps. Anything Chanel wants she gets, and she wants Her slaves disciplined and all cocks in her holes.\nBianca is a cunning little cunt, and manages to seduce Marco into fucking her on the pool table, but is quickly caught with her tight hole stuffed with stolen cock. Chanel puts the slave on the floor and uses her mouth to clean the cock every time is comes out of her perfect asshole. A stiff face fucking is not enough to satisfy Chanel that Bianca has learned her lesson. Strapped to a table with belts and a tight leather straight jacket Bianca is cropped, tormented with relentless orgasms, fucked silly, and used as a cock stand for Chanel's dripping pussy.\nHowever, Chanel is more of a horny slut than she is dominant, and when Marco proposes she join Bianca as an anal slave we find Chanel on her back, legs spread, begging for cock like any desperate submissive. Marco claims Chanel's ass in a rough fuck that leaves Chanel's breathless and screaming from painful orgasms.",
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Bianca Breeze",
      "person_id": 53995
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    }
  ],
  "release_date": "2015-05-29",
  "scene_id": 37852,
  "tags": [
    "bondage",
    "straight jacket",
    "crop",
    "slave",
    "nipple clamps",
    "leather",
    "submission",
    "anal",
    "pain",
    "straight"
  ],
  "title": "Chanel Preston's Anal Submission"
}