{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Perfect blond slaves is not all it takes to please The Governess. She is a filthy Mistress and requires those asses to shake. Bubble butt slaves AJ Applegate and Cali Carter desperately bounce their cheeks while sexually servicing female guests, but eventually they both land on blow job duty and deliver a sloppy performance in form of the entire party.\nThe Governess ties AJ down to the table in a grueling rope bondage position nd sticks her entire fist in AJ's tight pussy, resulting in a fireworks display of squirting and begging. Cali receive's a sexual punishment all her own, being slapped around a violently fucked by one of our esteemed guests.\nAJ is a squirming slut, so it is decided she will be latched intila doggy position with her big ass cranked wide open with tight rope. Her asshole is ravaged with hard dick, while Cali cleaned up all the juices from a strict squat in there stocks. Her only relief is a refreshing breather in The Governess' ass and a relentless hitachi on her exposed cunt.\nAJ must finally give back to The House, and teaches Cali how properly bounce on cock while licking The Governess' pink pussy to orgasm. These hot blond slut slaves finally earn a rewarding load of cum and the audience's applause.",
  "models": [
    {
      "name": "AJ Applegate",
      "person_id": 45997
    },
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Cali Carter",
      "person_id": 58121
    }
  ],
  "release_date": "2015-07-24",
  "scene_id": 37858,
  "tags": [
    "anal",
    "bdsm",
    "big ass",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Hitachi",
    "humiliation",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "squirting",
    "stocks",
    "straight"
  ],
  "title": "Squirting Anal Slave AJ Applegate Tied Tight & Fucked"
}