{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Dahlia Sky is a lovely obedient slave, so it seemed only natural that when The Upper Floor needed a maid she would be a perfect candidate for promotion. A new all natural ballerina named Cassidy Klein was sourced to serve as untrained slave flesh for our esteemed guests. Cassidy is fucked and flogged while hanging like a helpless doll in an unforgiving rope suspension, Dahlia is shining the glassware with her nipples firmly clamped.\nThrough out the day Dahlia drifts off into a nymphomaniac dream land where she sexually ravaged by the guests and has the new girl's face firmly planted on her pussy while she performs cleaning duties. Over and over again she is caught day dreaming and punished with a strict spanking, a big butt plug in her ass, and reprimands. As Cassidy has her fresh young body pillaged and fucked, Dahlia insinuates herself in the sex until our guest finally takes pity on her and demotes submissive Dahlia back to her preferred position: Anal Slave.\nThe last scene finds Dahlia happily back in The House slave uniform, tied with her long legs spread wide. The guest makes her beg to be made an anal slave and lick her ass plug clean before he takes her ass in a brutal fucking. Cassidy happily laps at Dahlia's clit and cleans the guest's cock until he is ready to decide if she get's her cuffs back after all.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Cassidy Klein",
      "person_id": 54867
    },
    {
      "name": "Dahlia Sky",
      "person_id": 45819
    },
    {
      "name": "John Strong",
      "person_id": 17050
    }
  ],
  "release_date": "2015-05-15",
  "scene_id": 37851,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "master",
    "Nympho Maid",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Spanking",
    "Straight",
    "Suspension",
    "Threesome"
  ],
  "title": "The Nympho Maid Dreams of Anal Ravaging"
}