{
  "collections": [
    "Men On Edge"
  ],
  "description": "Special agents Keys and Wilde are on the hunt for Ivan Gregory. The studly jewel thief has struck again, this time taking an ancient erotic artifact-- the MOUTH OF ANUBIS. After capturing Gregory, Keys and Wilde whisk the thief to a black site for an enhanced interrogation. In the dingy room, far outside official jurisdiction, Ivan is bound with duct tape across his mouth. Keys wakes the perp with a bucket of ice cold water, and the two agents begin some off-the-books techniques, groping and teasing the criminal for their own amusement. They strip away his soaking clothes, revealing a huge, uncut dick. Ivan's will gets put to the test as Keys and Wilde edge him repeatedly, licking his nipples and toes before bringing out a double hitachi torment. After the first round of torment, the criminal is placed in an inverted suspension over a sawhorse while the agents play with his tight hole. Gregory is made to suck Agent Wilde while Keys fucks Ivan with a dildo. Keys inserts a vibrating prostrate toy into the criminal's hole and brings out the Mouth of Anubis to edge Ivan with. Agent Wilde warns Keys against this, citing the legends about the artifact, but Keys dismisses the protests as pure superstition. After so many cruel edgings, Ivan Gregory finally blows his load with the Mouth of Anubis wrapped around his throbbing dick. With that rocking orgasm, the room shakes: Anubis has awakened, and there's hell to pay.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Ivan Gregory",
      "person_id": 55549
    }
  ],
  "release_date": "2015-05-05",
  "scene_id": 37896,
  "tags": [
    "BDSM",
    "Bondage",
    "Dildo",
    "Edging",
    "Gay",
    "Hitachi",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Suspension",
    "Tickling",
    "Uncircumcised",
    "Uncut"
  ],
  "title": "Muscled jewel thief has his uncut cock edged with the Mouth of Anubis"
}