{
  "collections": [
    "Bound Gods"
  ],
  "description": "Bound to a post and blindfolded, Micah Brandt trembles as he waits for what house dom Connor Maguire has in store for him. Mr Maguire starts playing with his new sub, tormenting Micah's tender nipples, hard cock and even his balls with the zapper. Micah is moved to the ass splitter while three painful clover clamps pinch on each nipple. Having the slut admit that he loves the pain, Connor delivers more brutal zaps before tearing the clamps off while Micah screams at the top of his lungs. Hanging on the St. Andrew's cross, Micah endures a harsh flogging, while he's reminded to show his gratitude. Still bound to the cross, Micah is flipped over and rammed from behind by his dom's massive cock. On his hands and knees, with a collar around his neck, Micah worships Connor's beautiful feet. Decided that Micah finally earned the right to service his cock, Connor pulls his sub up to his dick and fucks the back of Micah's throat. Connor then throws Micah to the floor, having his sub jerk off while again sucking Connor's toes. Using his foot, Connor smears Micah's load all over his cum-hungry face before he's brought to his knees for one final fuck. Begging for cum, Micah's rewarded with his master's load.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 46426
    },
    {
      "name": "Micah Brandt",
      "person_id": 57628
    }
  ],
  "release_date": "2015-04-30",
  "scene_id": 37892,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Clover Clamps",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Flogging",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Sub",
    "Submission",
    "the cross",
    "top",
    "Zapper"
  ],
  "title": "\"I love the pain sir!\""
}