{
  "collections": [
    "Hogtied"
  ],
  "description": "I've been waiting for a long time to get Chanel tied up so that I could do hardcore shit to her. I met her early in her career and have watched her over the years blossom into a very powerful Domme. That's not what she is here for today, but rather just the opposite. The plan is to make her totally helpless in tight bondage and, torment her, and make her orgasm harder than she ever has before.\nWe begin with her in a spider web of rope in a standing position. Her clothes are ripped away exposing her amazing body. I slap, flog, pinch, and prod her to get a feel for what this slut can take. She seems like she can take a little more pain that I originally thought, so the torment begins.\nNext she is in a partial suspension, bent over, and her arms pulled up into a stappado. Her ass gets spanked, then flogged, and then her hungry pussy is fucked, but not before we fill her ass with a metal hook and tie it to her hair.\nIt's time to make this slut fly, so we put her in an inverted hogtie suspension. Her wrists are tied to her ankle and she hangs there helplessly while I have my way with her slutty body and pussy.\nIn the final scene we put her in a position that best represents her as the slut that she is. She is on her back with her legs spread wide and after a little pain I fuck her and finger bang her so hard that she is speaking gibberish. Her mind is blown with non stop orgasms!!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2015-06-11",
  "scene_id": 38016,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "fake boobs",
    "Fingering",
    "Handler",
    "Humiliation",
    "Pain",
    "Rope Bondage",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Chanel Preston Returns to Hogtied!!"
}