{
  "collections": [
    "Bound Gods"
  ],
  "description": "Hunk Drake Tyler has just turned 19 and can’t wait to serve the Church of Latter Day Saints overseas on his mission, but first he seeks the approval of his bishop, Connor Maguire. Noting that a good Mormon missionary has to be ready for whatever the world gives him, Bishop Maguire orders Drake to undergo a physical exam. The bishop “fortunately” has the authority to conduct it himself, and orders Drake to strip naked. Something just doesn’t seem right as Bishop Maguire starts to fondle Drake’s ripped body and gropes Drake’s cock. The bishop retrieves a riding crop and orders Drake on his knees; now something’s definitely not right. The bishop’s warm demeanor turns cruel and perverse as he crops and facefucks Drake in the name of the church. The exam continues to push Drake’s physical limits as he’s bound and flogged in a stress position, balancing one-legged on a stack of books. Drake takes Bishop Maguire’s cock once more in his mouth and ass. The bishop moves the boy over to his desk, fucking him doggy style while zapping his tender body & tormenting the boy’s shoulders with clover clamps. Bishop Maguire tears the clamps from a wailing Drake and busts a hot load onto the boy’s tight ass before feeding Brother Tyler all of his cum. For the final test, Drake spreads his seed all over the Book of Mormon before cleaning every drop of cum off with his tongue.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Connor Maguire",
      "person_id": 46426
    },
    {
      "name": "Drake Tyler",
      "person_id": 57234
    }
  ],
  "release_date": "2015-07-02",
  "scene_id": 38102,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "body builder",
    "Bondage",
    "bottom",
    "brunet",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "foreskin",
    "Gay",
    "Humiliation",
    "jock",
    "Male Sub",
    "master",
    "muscular",
    "Redhead",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "white",
    "Zapper"
  ],
  "title": "Hot Mormon Jock Fucked in Bondage to Prove His Devotion to the Church"
}