{
  "collections": [
    "Bound Gods"
  ],
  "description": "Coby Mitchell sways in ropes, hung from the racks in a meat locker. His tormentor, Christian Wilde arrives in a latex apron to inspect the suspended man-meat. Christian crops Coby up and down before stretching Coby's balls with a heavy cluster of weights. He attaches a clover clamp chain onto Coby's nipples and adds more weights to it. Coby can barely handle the pressure on his balls and nipples as Cristian resumes cropping. Christian brings Coby back to earth and has the stud worship his massive cock. He brings out the flogger and warms up Coby's body. Rock hard from Coby's blowjob and his screams, Christian plunges deep inside his captive. Christian decides to give his meat a good cleaning, so he chains Coby to the wall and fits more clamps all over his torso and thighs before spraying him down. The harsh, freezing water from the hose knocks the clamps from Coby. Now that Coby's all clean outside, Christian inserts an enema hose inside Coby before fucking him deep again and covering his ass in hot cum. Coby eats a handful of his own cum and gets turned around to have his balls milked. He blows a thick load right before Christian resumes the torment, slapping his body all over and spraying him down again.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Coby Mitchell",
      "person_id": 57203
    }
  ],
  "release_date": "2016-01-14",
  "scene_id": 38106,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Chains",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Enema",
    "Flogging",
    "Gay",
    "Humiliation",
    "Latex",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Stud",
    "Submission",
    "the wall",
    "Weights"
  ],
  "title": "Christian Wilde's Latex Meat Locker"
}