{
  "collections": [
    "Bound Gods"
  ],
  "description": "Wolf Hudson can’t stand his new stepbrother Brendan Patrick, he keeps badgering Wolf to let let him tag along with his buddies, but Wolf spurns him repeatedly. Dejected and horny, Brendan looks through Wolf’s underwear drawer, discovering a stash of kinky toys and rope. Wolf walks in on Brendan’s snooping and captures his stepbrother in a rage. Brendan has his hands bound behind his back and gets the taste of Wolf’s zapper, flogger and hard cock. Wolf then takes Brendan out to the living room, suspending him horizontally from the staircase. There, Wolf fucks his stepbrother’s face and edges him before tormenting the annoying pervert with a zipper of clothespins. Brendan is taken back to the bedroom and takes an electric buttplug up his tight hole. Wolf taunts Brendan as he crops him all over and intensifies the electric current, Brendan screaming for mercy at the top of his lungs. His hole prepared by the TENS unit, Brendan bites down on the ball gag shoved in his mouth as Wolf slides his fat, uncut cock deep in the boy’s ass. His hole freshly fucked, Brendan’s fed his own cum before receiving his stepbrother’s hot load all over his face and sucking his cock clean.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brendan Patrick",
      "person_id": 55528
    },
    {
      "name": "Wolf Hudson",
      "person_id": 14471
    }
  ],
  "release_date": "2015-05-21",
  "scene_id": 38103,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "buttplug",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "foreskin",
    "Gag",
    "Gay",
    "Humiliation",
    "Kinky",
    "Latinx",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "Tattoo",
    "Tens Unit",
    "top",
    "Uncircumcised",
    "unshaved",
    "versatile",
    "white",
    "Zapper",
    "Zipper"
  ],
  "title": "Brotherly Love"
}