{
  "collections": [
    "The Training Of O"
  ],
  "description": "This is not a joke. It is for real. Just look at her face. Submissive Women come to Training of O to be challenged - physically, mentally and sexually. That's real sweat, anguish, pain and focus your seeing. There is no script, only the most scant planning. It's all about that girl, in that moment, and the stuff of which she is actually capable.\nWhy do we push them so hard?\nA Slave is forged under intense pressure and heat. It Hurts. It leaves Marks. And, it instills Fortitude. Accomplishment. Self Actualization. The pinnacle of Maslov's Triangle. For those that seek to serve, there is no other way, but The Hard Way.\nThis update features beautiful and fit Rilynn Rae really going to the wall for you here. She is bound tight into a painful squat to teach her the Four Points of a Formal Blowjob. The nipple clamps very cruel for Rilynn, and I almost feel bad for her. But she needs to feel she has earned this. So I clamp those tender little buds tight and start whipping.\nThe reverse cowgirl is a staple because it is so hard to do. As the sweat forms, again I pin her bouncing tits with the clamps. If she can get through this, the rest will be easy. Or not.\nThe final missionary pussy fuck is great because she is wide open for us to plunder what remains of her tattered ordinary virtue, make room to instill what really matters: Fortitude, Discipline, Accomplishment.",
  "models": [
    {
      "name": "Rilynn Rae",
      "person_id": 39210
    },
    {
      "name": "Owen Gray",
      "person_id": 39181
    }
  ],
  "release_date": "2015-06-12",
  "scene_id": 38210,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Gimp",
    "humiliation",
    "master",
    "nipple clamps",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "slave",
    "straight",
    "the wall",
    "whipping"
  ],
  "title": "Forging a Slave"
}