{
  "collections": [
    "Bound Gods"
  ],
  "description": "Cassius was late. The Dominus hates late slaves. Fearing the worst, Cassius scurries into the hall with his Dominus' grapes. Where Cassius expected rage, he instead finds a sly, penetrating gaze on his master's face. The Dominus receives the grapes and dismisses the slave. Just as Cassius believes he dodged \"attention\" from his master, the Dominus reverses course, ordering the subligaria removed from Cassius' loins. He commands Cassius to get an erection and kicks Cassius to the cold ground for not doing it fast enough. The Dominus cruelly stomps Cassius' balls, finally bringing his slave to full attention. He coats Cassius' lean body in hot wax, making his slave squirm in agony as the wax drips on his balls and tongue. Feeling generous, the Dominus offers grapes to Cassius-- straight into Cassius' hungry asshole. After Cassius tastes the grapes from his ass, the Dominus penetrates him with a gigantic cock. Cassius next finds his arms suspended above his head, bound in a harness over a plank of wood splitting his ass open while enduring an excruciating beating with the 30lbs flogger. Cassius next is crucified with clothespins all over his body; the Dominus helpfully removes them with a cat o' nine tails until he takes the slave back to the throne. One more vigorous fuck brings the Dominus to the point of ecstasy before glazing his slave's face in hot cum.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cass Bolton",
      "person_id": 56316
    },
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    }
  ],
  "release_date": "2015-07-09",
  "scene_id": 38228,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "Hot Wax",
    "Humiliation",
    "Male Sub",
    "master",
    "harness",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Submission"
  ],
  "title": "Roman slave offers his entire body to the whims of his cruel Dominus"
}