{
  "collections": [
    "Bound Gods"
  ],
  "description": "Connor Patricks has been locked away for days in Adam Herst’s workshop, stripped of his clothes and dignity. Adam rouses Connor from sleep in a cramped cage, and face fucks the boy through the bars. Harder thrusts answer Connor’s pleas for release. Adam binds Connor upright, blindfolding the boy with arms outstretched to hold heavy weights. Connor’s tormentor warns him against dropping the load as he licks Connor’s torso and legs with a riding crop. Adam raises the stakes with a clothespin zipper on both sides of Connor’s body, tying the line to the weights. He puts Connor’s nerves to the limit with the threat of a cattle prod and finally sticks his plaything. Gravity wins. The falling weights tear the clothespins from Connor’s body. Legs dangling overhead, Adam next traps Connor under piping, contorting the boy into an inverted spread eagle. Adam delivers a caning and foot torment before a rough fucking. He continues the fucking into the night, splitting Connor’s legs wide apart with belts on a platorform. Connor has the cum worked from his balls as Adam rams his giant cock deep into the boy’s hole. By now, Connor’s spirit has totally broken, and he accepts Adam’s cum with a willing mouthful.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Adam Herst",
      "person_id": 39639
    },
    {
      "name": "Connor Patricks",
      "person_id": 47357
    }
  ],
  "release_date": "2015-06-18",
  "scene_id": 38230,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Cage",
    "Caning",
    "Cattle Prod",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Foot Torment",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Metal Bondage",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Weights",
    "white",
    "Zipper"
  ],
  "title": "Tormented Without Mercy - Connor Patricks suffers tight metal bondage"
}