{
  "collections": [
    "Hogtied"
  ],
  "description": "We are always trying to up the standard of real bondage and brutal torment. Today we take it up a big notch and add water to the equation. This is a level that is not to be taken lightly; it's the most dangerous type of torment. We begin with Juliette standing with her hands above her head and a crotch rope. She is attacked with a heavy flogging, lifted and made to hang from just the crotch rope, and then gets her first of a day full of breath play.\nNow that this slut is primed up we start with the water. She is bound with pegs placed on her tits and torso and then the high pressure towers are turned on. This is the most grueling torment poor little Juliette has ever endured. The sweet cock slut turns into a spitting demon from all of the pain, but that doesn't stop the brutality.\nNext she is confined to a cage that is barely big enough for her to fit in. It is suspended over a tank that allows the cage to fit in perfectly. She is dropped in and the fear sets in as she realizes that there is no escape.The dunking continue until she is allowed to have an orgasms, then dunked one final time and left submerged in fear.\nIn the final scene her hands and ankles are bound and she is thrown into a massive tank. The dunking starts and only becomes more extreme as the scene goes on. Juliette is made to cum over and over as she is constantly shoved under water.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Juliette March",
      "person_id": 22072
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2015-07-23",
  "scene_id": 38270,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "cage",
    "Corporal Punishment",
    "crotch rope",
    "domination",
    "dunking",
    "Fingering",
    "flogging",
    "Handler",
    "humiliation",
    "pain",
    "rope bondage",
    "straight",
    "submission",
    "Vaginal Penetration"
  ],
  "title": "Tight Rope, Grueling Punishment, Extreme Water Torment, and Screaming Orgasms!!!"
}