{
  "collections": [
    "The Training Of O"
  ],
  "description": "Savannah Fox is a hardcore double penetration anal nymphomaniac bondage and cock slut that needs kinky sex to function! Her all natural big ass bounces on hard cock like it is the last dick on earth, and her pussy squirts like a fountain. Savannah swallows cock deep throat style like it is candy, and takes the nipple clamps, the crop and the flogger like the good little hardcore, pussy dripping painslut that she is.\nSavannah's big round ass it tight in rough ropes that spread her ass cheeks wide open. The gimps hard rod slides right into that wet, submissive pussy for a hard doggie fuck in tight rope bondage. Ball gagged and drooling Savannah dangles helplessly in bondage while hard dick rams her slave cunt.\nWhen Savannah is tied down pile driver style, her wide ass spreads open to take a double penetration with huge dildos that makes her slutty pussy squirt all over her own face. Slave girl Savannah Fox endures harsh slave training on the basement of the Armory and earns her stripes in servitude at the hands of sadistic slave trainers.Savannah Fox is is nymphomaniac anal sex, bondage and cock slut that needs kinky sex to function! Her all natural big ass",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Savannah Fox",
      "person_id": 47440
    },
    {
      "name": "Alex Legend",
      "person_id": 55861
    }
  ],
  "release_date": "2015-05-22",
  "scene_id": 38276,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "big ass",
    "bondage",
    "Corporal Punishment",
    "crop",
    "discipline",
    "Double Penetration",
    "female slave",
    "gag",
    "Gimp",
    "humiliation",
    "kinky",
    "master",
    "nipple clamps",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "slave",
    "squirting",
    "straight"
  ],
  "title": "Big Ass Double Penetration Squirting Bondage Slave, Savannah Fox"
}