{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "Bored of studying, the deliciously gorgeous goth Arabelle Raphael opens a book that transports her into a wonderland of creatures, surprises, and FIVE THICK MAGICAL COCKS. Hungry cunt Arabelle chokes on dick after dick, eyes rolling back in her head as she gargles and slobbers on a full mouth of meat! Have you ever seen the White Rabbit, the Mad Hatter, and the King of Hearts each shove a thick cock into all of this whore's dainty pink holes?! Not until today! This is the DOUBLE PENETRATION ANAL POUNDING OF YOUR DREAMS. This slut does not let a cock go untouched! Three in her mouth! One in her cunt! One in her ass! One in each hand! Five dicks slapping across her eager tongue and inviting, innocent big eyes! And finally FINALLY, with a delicious ANAL CREAMPIE oozing out of her tight ass and a face covered in bukkake mess, this whore drinks up a serving of cum from her tea cup that packs five times the punch!\nDid you miss your invite to Arabelle's tea party?! Bet you can guess what's she's serving up....",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "Owen Gray",
      "person_id": 39181
    },
    {
      "name": "Bill Bailey",
      "person_id": 46601
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Mark Wood",
      "person_id": 31058
    }
  ],
  "release_date": "2015-07-15",
  "scene_id": 38286,
  "tags": [
    "Anal",
    "Anal Creampie",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bukkake",
    "Corporal Punishment",
    "Creampie",
    "Double Penetration",
    "Gangbang",
    "Role Play",
    "Rough Sex",
    "Slapping",
    "Straight",
    "TS",
    "white"
  ],
  "title": "Arabelle's Wonderland of Cock"
}