{
  "collections": [
    "Hogtied"
  ],
  "description": "Ariel returns after almost three years and she proves that it was well worth the wait. We begin with her in a brutal stress position that puts her toned body to the test. She is tied in a squatting position with her neck tied up to keep her from cheating her way through the scene.\nThat is followed up with an even more intense predicament. She is made to stand on her toes with her arms back making her arch her amazing body. A crotch rope is added along with nipple clamps. The cane is introduced and Ariel finds out that there are more than the normal places that can be caned to inflict suffering.\nNext we put her in a side hogtie suspension that puts her on display. Her legs are tied open to ensure full pussy and ass penetration. After a several grueling minutes of torment, her pussy and ass get stuffed full of a massive dildo. Her pussy starts to show signs of enjoyment by squirting like a cock hungry slut.\nIn the final scene Ariel is on her back and her legs spread as wide as we can stretch them. The fucking begins and this time Ariel can't help but squirt all over the room. Her squirting becomes so powerful that she begins to squirt herself in the face.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2015-07-09",
  "scene_id": 38344,
  "tags": [
    "April Showers",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Crotch Rope",
    "Dildo",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Nipple Clamps",
    "Rope Bondage",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "Suspension",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Ariel X - Extreme Bondage, Brutal Torment, and Squirting Orgasms!!!"
}