{
  "collections": [
    "Hogtied"
  ],
  "description": "Take two of the most willing pain sluts, add rope and a sadistic fuck and you will have today's update. Mia and Nikki both have the desire to suffer at the hands of The Pope and will now do it together. They will be used against each other to increase the suffering and increase the orgasmic pleasure.\nThey begin bound to columns across from each other and little by little they become more connected than they ever thought they could be. They share a crotch rope with extreme weight hanging from it, and their nipple clamps are tied together to ensure that when one of them moves the other feels it.\nNext we have Nikki on her back with her legs spread and Mia tied in a position that has her sitting on Nikki's face. Nikki being the slut that she is can't help but to lick Mia's sweet pussy. The pain comes in the form of caning, bands and bastinado on both of these willing slaves.\nWe finish the day with both whore mounted atop sybians. Both sluts start to orgasm uncontrollably, then they both get a massive helping of face fucking. They are constantly face fucked while orgasming against their will.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Mia Austin",
      "person_id": 56906
    },
    {
      "name": "Nikki Darling",
      "person_id": 42508
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2015-08-20",
  "scene_id": 38450,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Crotch Rope",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "switch",
    "Sybian",
    "Tattoo",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Double Your Pleasure Double Your Fun"
}