{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Spoiled rich college girl Samantha is sent on vacation to The Upper Floor, to be served faithfully by Butler Michael and Head Slave Tate. However, when Tate makes a mistake and receives swift punishment Samantha finds herself curious to watch and spies on a heavy flogging of Amanda while rubbing her wet pussy. The clever Butler finds her hiding place and invites Samantha to join the game, as Amanda receives a punishment fucking and Samantha works her cunt and accepts a proper apology.\nHowever, it's not apologies that Samantha wants, but a chance to give up control and live in the collar and cuffs like a slave. She begs for her leather on her knees like a good girl, but is not prepared for the ferocious degradation and violent fucking she will receive at the hands of a sadistic Butler and vengeful slave. Her pearls are slowly rolling across the floor as she gags and slobbers through her first face fucking of the day. Thrown on the bed, she is held down and made to beg for her first of many orgasms.\nThe rest of her ordeal is spent in tight bondage, fucked without regard for her pleasure, and toyed with by her fellow slave. Made to beg, made to grovel, and serve cock truly for the first time in her life, Samantha is a portrait of submission.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Amanda Tate",
      "person_id": 51443
    },
    {
      "name": "Michael Vegas",
      "person_id": 47624
    },
    {
      "name": "Samantha Rone",
      "person_id": 56253
    }
  ],
  "release_date": "2015-08-14",
  "scene_id": 38476,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Flogging",
    "Gag",
    "Humiliation",
    "Leather",
    "master",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Submission",
    "Threesome"
  ],
  "title": "Spoiled Little Rich Girl Fucked Like a Slave"
}