{
  "collections": [
    "The Upper Floor"
  ],
  "description": "House Maid Warner is sent to turn down the beds and makes a terrible error when she finds the lead nympho slave in a strict rope deprivation punishment. Veronica is practically slavering all over her tightly bound tits. It’s been two weeks since she was last given sex, and she will do anything to get it.\n\nOnce she manages to make herself enough of an obstacle to cleaning that she must be untied, Veronica jumps the maids nubile young pussy and gets her fill of innocent flesh. Master Banderas comes in to find his deprivation experiment ruined and his slutty MILF subject’s fist deep in the maids trapped pussy.\n\nSexual punishment is due, and both the maid and the nympho slave will be subjected to a thorough and violent fucking. Tits tied tightly, clamps applied painfully, and fists deep in tight asshole and wet cunts squirting, these women get more sex than either of them bargained for, leading to Banderas’ new experiment: Can a nymphomaniac MILF ever get filled with enough cock? Watch to find out.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Kasey Warner",
      "person_id": 56865
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    },
    {
      "name": "Veronica Avluv",
      "person_id": 22663
    }
  ],
  "release_date": "2015-07-31",
  "scene_id": 38477,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Deprivation",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Fisting",
    "foreskin",
    "Humiliation",
    "kink-dirtymaid",
    "master",
    "MILF",
    "mixed",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Nympho Maid",
    "Oral Sex",
    "Orgy",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Squirting",
    "Straight",
    "switch",
    "Threesome",
    "white"
  ],
  "title": "Nymphomaniac Slave Punished with Double Pounding"
}