{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Gorgeous and petite slave initiate Mystica Jade has submitted herself to the will of The House, with her asshole as an offering. MILF senior slave Cherie Deville is on hand to lead our initiate by her tight little nipples around the crowd to show off the goods. Mystica blushes as Phoenix Marie spanks her round ass and offers her blow job pointers. With such a tiny throat it is a wonder she can fit the Butler's fat cock all the way in, but Miss Deville provides a wonderful example and has her trainee stuffed full of hard dick in no time.\nSubmissive blow jobs and exhibitionism aren't all it takes to be a slave. Cunning and strength are needed, and Mystica is put on the spot to answer questions and hold heavy trays so that her Senior Slave can enjoy a good fucking at the hands of the Butler. For such a tiny girl Mystica is determined and struggles through several screaming orgasms while holding position before dropping her trays. Naturally she apologizes to Miss Cherie's denied pussy with a sloppy series of kisses.\nThe final Hours of the night find our initiate trapped on her back, legs spread wide, rope tied tightly around her as the Butler and Miss Deville explore her ass with cocks and fists until the crowd is satisfied she has paid her dues and allow both slaves on the furniture to finish milking the Butler's balls and entertaining the House with a series of nipple and clit torment games.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Bill Bailey",
      "person_id": 46601
    },
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "Mystica Jade",
      "person_id": 56747
    }
  ],
  "release_date": "2015-08-07",
  "scene_id": 38482,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "blond",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Humiliation",
    "master",
    "MILF",
    "natural boobs",
    "Oral Sex",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "white"
  ],
  "title": "The Anal Initiation of Mystica Jade"
}