{
  "collections": [
    "Bound in Public"
  ],
  "description": "After his thorough fucking on the pool table at the bar, Alexander Gustavo goes out on the bar patio to be a human table, serving drinks off a tray firmly secured in his ass. Alexander also wears an ashtray-gag, giving his clientele a convenient place to put out their cigarettes. The patrons respond to his helpful service with cropping and hard cocks. They remove the table and gag, offering their own dicks and feet to fill Alexander’s mouth. Alexander takes clothespins all over his body as he sucks half a dozen strangers’ toes, dutifully continuing as the pins are cropped off. The patrons take Alexander back to their booth for another round of fucking. They place him in a bound spitroast as the bar cheers on the slut. After customer’s glaze his face in hot cum, Alexander returns to the stage to ride a sybian and takes more loads to the face. The crowd gives Alexander a round of applause as he busts a load on the sybian’s highest intensity and eats up all the mess.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Alexander Gustavo",
      "person_id": 55166
    },
    {
      "name": "Jessie Colter",
      "person_id": 34311
    },
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    }
  ],
  "release_date": "2015-10-02",
  "scene_id": 38647,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "bottom",
    "brunet",
    "Clothespins",
    "Cock Worship",
    "Crop",
    "Domination",
    "Facial",
    "Feet",
    "Foot Worship",
    "foreskin",
    "Gag",
    "Gangbang",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Public",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Shrimping",
    "Smoking",
    "Submission",
    "switch",
    "Sybian",
    "Tattoo",
    "versatile",
    "Voyeur",
    "white"
  ],
  "title": "Go-go dancer serves his bar with mouth & ass for SF Pride"
}