{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Keira Nicole is a sexy amusement: delicate, beautiful, and brand new to BDSM. This sweet babe is quickly stripped naked, clamped, and made to humiliate herself with uncontrollable orgasms in front of a laughing crowd. She tries desperately to hold silver trays and control her pussy, but soon she falling to her knees and cumming without permission. Meanwhile her senior slave is enjoying some hard cock in her ass from a horny male guest, but eventually must come to her trainee's aid with a instructive spanking. The newbie keeps the cock hard in her mouth as she takes her punishment and promises to do better.\nOur intrepid blond trainee slave is tied with her long legs spread wide so everyone can see her fresh pussy. John Strong makes quick use of her cunt, giving her a hard fuck as Roxanne tries not to giggle at her shocked expression and rolling orgasms. Roxanne isn't giggling for long, and soon finds herself tied in a strict pretzel tie with John's hard cock deep in her perfect round ass. The newbie is quick to lap up the mess, cleaning both John's dick and Roxanne's wet pussy in turn.\nThe crowd calls for Keira to serve once more, and she mounts the couch for an athletic service fuck in which she rides the cock, begs for all her orgasms, and waits to cum with permission like a good girl. Roxanne continue to be the brazen slut slave we all enjoy and guides her trainee in coaxing the cum out of John with her wet mouth and begging eyes.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Roxanne Rae",
      "person_id": 50987
    },
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Keira Nicole",
      "person_id": 57342
    }
  ],
  "release_date": "2015-09-18",
  "scene_id": 38766,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "blond",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Spanking",
    "Straight",
    "Threesome"
  ],
  "title": "The Innocent Doll & Anal Slut Slave"
}