{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Cassidy Klein is passionate about service and sex, so we had to call in our sluttiest anal senior slave to guide her through her initiation: Holly Heart. Both these long haired beauties thrill the brunch crowd with their desperate orgasms and fumbled service resulting in brutal punishments. Unsurprisingly, Cassidy lands her senior slave in a great deal of trouble and has Holly eating strawberries off the floor with pins whipped off her swollen tits while Cassidy enjoys having her tight asshole fucked by the Butler.\nBoth slaves are to be punished, and the crowd is quite eager to strip off their clothes and fall into a summer time orgy as the slaves are tied down the to the table and caned for everyone's viewing pleasure. It's a simple game: one slave takes a huge cock in her ass and the other a cane on her vulnerable tender feet until one begs to switch. Both slaves are thoroughly fucked and sweaty and chastised by the end of the scene.\nCassidy finally has her ballerina's body put the test in a tight unforgiving rope tie that leaves her bouncy ass ripe for the fucking. Holly guides her through the ordeal with a wet tongue and encouraging words as the guests cheer her on. Can she properly recite the rules, beg for an orgasm, and deliver a correct orgasm in TUF form? Will The House vote for this young filly to join our ranks?",
  "models": [
    {
      "name": "Holly Heart",
      "person_id": 20472
    },
    {
      "name": "Cassidy Klein",
      "person_id": 54867
    },
    {
      "name": "Bill Bailey",
      "person_id": 46601
    }
  ],
  "release_date": "2015-09-04",
  "scene_id": 38768,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "brunch",
    "Corporal Punishment",
    "discipline",
    "Feet",
    "female slave",
    "humiliation",
    "master",
    "oral sex",
    "orgy",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight"
  ],
  "title": "Anal Initiation of Cassidy Klein"
}