{
  "collections": [
    "latest updates"
  ],
  "description": "These Team Captains have been going at it all season long. It's been a back and forth battle all season. Just when one team gets ahead in points, the other team cums from behind and closes the gap. Today the Grapplers come in with less than a 300 point lead. Tarrasque has some strong players on their team tonight and they are hoping to get the victory and give Darling the gang bang she deserves.\nRound 1 is mona wale and Mia Li for Team Tarrasque taking on Daisy Ducati and Julietter March for Team Grapppler\nRound 2 is Lisa Tiffian and Yasmine Loven for Team Tarrasque taking on Holly Heart and Angel Allwood for Team Grappler\nRound 3 is Penny Barber and Cheyenne Jewel for Team Tarrasque and Darling and Izamar for Team Grappler Round 4 is a brutal gang bang of the losing team. Fucked Hard, Turned into human dildos to be used to make the winner cum. Mutiny for the losing Captain as her team turns on her and gang bangs her. Hard fisting from her team!",
  "models": [
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Lisa Tiffian",
      "person_id": 55478
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Mia Li",
      "person_id": 51496
    },
    {
      "name": "Holly Heart",
      "person_id": 20472
    },
    {
      "name": "Juliette March",
      "person_id": 22072
    },
    {
      "name": "Angel Allwood",
      "person_id": 52348
    },
    {
      "name": "Yasmine Loven",
      "person_id": 37660
    },
    {
      "name": "Syd Blakovich",
      "person_id": 7618
    }
  ],
  "release_date": "2015-09-29",
  "scene_id": 38841,
  "tags": [
    "fisting",
    "lesbian"
  ],
  "title": "Team Tarrasque and Team Grappler Go out with a Bang for season12"
}