{
  "collections": [
    "Bound Gods"
  ],
  "description": "Held captive and edged all night in Jessie Colter's house, Mormon missionary Jack Redmond can't imagine how his situation could get any more intense. Jessie can. He binds the captive missionary back under the stairs, bent over, ass on full display. Jessie gapes Jack's ass to the limit, jamming a fist deep into the boy. The fist enters Jack a little too easy for Jessie's liking, so he adds his other hand to the hole. Jessie frees his hands for flogging with a silicone fist for Jack, leaving it far inside the boy while beating his cheeks red. Still trembling from the flogging, Jack finds himself blindfolded in Jessie's bedroom doorway. Unsure where the next painful hit from Jessie's crop will land next, Jack submits to the crop marks painting his pale skin before swallowing Jessie's hard cock. After the cropping, Jack finds himself bound with leather belts, while taking a cold steel rod deep into his pisshole. Jessie finishes him off with brutal zaps and a rough fuck before coating hot cum all over his face and making him polish off every drop.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jack Redmond",
      "person_id": 57765
    },
    {
      "name": "Jessie Colter",
      "person_id": 34311
    }
  ],
  "release_date": "2015-09-24",
  "scene_id": 38939,
  "tags": [
    "Anal",
    "Anal Fisting",
    "BDSM",
    "big dick",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Crop",
    "Daylight Savings",
    "Domination",
    "Fisting",
    "Flogging",
    "Gaping",
    "Gay",
    "Humiliation",
    "Leather",
    "Leather Belt",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Pain Slut",
    "Redhead",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "Sounding",
    "Submission",
    "Tattoo",
    "white"
  ],
  "title": "Bound missionary gets split wide open with double fisting & sounding"
}