{
  "collections": [
    "Men On Edge"
  ],
  "description": "Logan Stone is a hot electrician who loves getting edged. He joins Jessie and Sebastian for a session in the Armory, where they waste no time in stripping Logan to his skivvies. The outline of Logan's cock bulges prominently as Sebastian ties Logan across the front of a four-post bed. Jessie gets a taste of Logan's meaty nipples and moves to his massive dick. With Logan blindfolded, Jessie holds out a fleshjack for Logan to fuck to completion, if only he could find it. Logan's cock chases the toy, finds it, and finally brings himself to cusp of orgasm -- right before Jessie tears it away. Sebastian repeats the torment with a vibrating sheath, bringing Logan to the edge and then tickling the stud at his most vulnerable moment. Jessie and Sebastian move Logan to the other side of the room and invert him. Logan has his tender cock sucked as he receive nipple suckers and a bit gag. Begging to cum through the gag, his tormentors plow his ass with a dildo before tying it off to his leg and making the stud fuck himself with it. Logan finally receives their permission to cum and blows a load all onto his face. Still in a daze from cumming, Logan is perfectly vulnerable for the last piece of torment. He twists and fights against his restraints as they tickle his body and polish his sensitive cock head.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Logan Stone",
      "person_id": 58113
    }
  ],
  "release_date": "2015-11-10",
  "scene_id": 38949,
  "tags": [
    "BDSM",
    "big dick",
    "bit gag",
    "Blindfold",
    "Bondage",
    "brunet",
    "Dildo",
    "Edging",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "muscular",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Stud",
    "switch",
    "Tickling",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Greedy for edging: Tall hunk Logan Stone shoots a load in his own face"
}