{
  "collections": [
    "Bound Gods"
  ],
  "description": "Facing accusations of perving on his football players, Coach Chris Burke receives a stern warning from his boss, Christian Wilde. However, Chris feels more horny than worried about his job. He drifts into a fantasy of punishment beyond administrative reprimand, into a dark world of chains and leather. He crawls to Mr. Wilde, seated on a throne of books and accepts his submission, licking Mr. Wilde’s boots and admitting his perversions. In response, Mr. Wilde facefucks and crops the coach before leading him to a rope suspension. Mr. Wilde works a raging boner from Chris before hoisting his bound body high above the ground and covering it in clothespins. Chris swings in the darkness as Mr. Wilde cleans the pins off with a vicious flogging. Mr. Wilde brings Chris back to earth for a brief moment to encage him, but swiftly returns the coach to the air, legs jutting out of the cage, vulnerable to an extended bastinado. Chris receives a deep dicking through the cage as Mr. Wilde hangs from it. With his boss ready to cum, Chris is led on his knees back to the throne and gratefully takes a hot load on his face. In return, Mr. Wilde commands him to jizz on his boots and then lick them clean. Hungry for more cum, Chris dutifully complies.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Chris Burke",
      "person_id": 58819
    },
    {
      "name": "Christian Wilde",
      "person_id": 21037
    }
  ],
  "release_date": "2015-10-15",
  "scene_id": 38950,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "Cage",
    "Chains",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Flogging",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Suspension",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Coach Burke's Twisted Fantasy"
}