{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Mona Wales has found another eager little nympho who needs to be publicly fucked and degraded. Naked and exposed Nikki Litte begins her Public Disgrace as a public ashtray. Tramping up and down a courtyard, Nikki pleads with every smoker she can find to use her. In exchange for their ash she spreads her legs, giving anyone a peek at her excited cunt. Mona then takes her enthusiastic attention whore to the boardwalk. Nikki’s Barefoot, bare pussy and bare ass illicit many reactions from the passing crowd. Some stare with disgust while others stop in their tracks to watch Nikki’s perky little titties bounce as she skips on by. After Mona is satisfied with Nikki’s public display she takes her little slut to the closest bar to see if she can find some cocks to pound Nikki’s cunt. As soon as Mona and Nikki walk into the bar the flies go down and the dicks get up. Nikki gets to work and wraps her tits around a cock, jerking the tip directly into her mouth. It isn’t long before Nikki is bent over a table getting her cunt pounded as everyone in the bar gropes her breasts and grabs her ass. Once thoroughly used up, Nikki finishes the throbbing cocks with her throat. Slurping their balls till they unload all over face and into her gaping mouth. Mona smiles, content with her work.",
  "directors": [],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Nick Moreno",
      "person_id": 20193
    },
    {
      "name": "Nikki Litte",
      "person_id": 59138
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "release_date": "2016-01-01",
  "scene_id": 39047,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blonde",
    "Blowjob",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Feet",
    "Female Slave",
    "foreskin",
    "Gaping",
    "Humiliation",
    "Latinx",
    "natural boobs",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "slim",
    "Smoking",
    "Straight",
    "Sub",
    "Submission",
    "switch",
    "unshaved",
    "Vaginal Penetration",
    "Voyeur",
    "white"
  ],
  "title": "Nikki Litte Loves Being a Public Ashtray"
}