{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Today on Public Disgrace we open our adventure with Mona Wales pondering on the true nature of women. Mona believes that all women are just dirty fuck rats born of sin. She knows in her little domme heart that all these fuck rats have been put on this earth with an insatiable need to be to be publicly fucked and humiliated. As Mona basks in her dreams of domination a curious little fuck rat walks up to her lifts her skirt and shows Mona her true nature. Zenda Sexy shows off her heavy tits and little pink pussy as she is publicly suspended in rope bondage. Mona hates Zenda's polkadot dress, so she strips her completely naked and makes her crawl along the filthy ground as punishment for her true nature. After Mona is satisfied with Zenda's punishment she takes her to small boutique to attempt to find Zenda clothing slutty enough to entice someone to stick their dick in her sin hole. The shop quickly fills up to watch Zenda cower in the corner as Mona threatens her with a zapper. The lesbian shop girl is so excited she drops to her knees and starts blowing customers as Zenda opens her holes to be filled by all. By the end of this shopping trip, Zenda squeals as she gets her face covered in cum.",
  "directors": [],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Zenda Sexy",
      "person_id": 57829
    },
    {
      "name": "Rob Diesel",
      "person_id": 56144
    },
    {
      "name": "Valentina Bianco",
      "person_id": 57990
    }
  ],
  "release_date": "2016-02-05",
  "scene_id": 39048,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "brunette",
    "Corporal Punishment",
    "discipline",
    "domination",
    "electricity",
    "female slave",
    "humiliation",
    "lesbian",
    "outdoors",
    "public",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur",
    "Zapper"
  ],
  "title": "Busty Brunette Extremely Afraid of Electricity Gets Shocked Outdoors"
}