{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Valeria Blue volunteers to be the main attraction at a Euro sex expo. With a crowd of thousands of onlookers Valeria is dragged onto the main stage like a dog. Naked and ready to fuck Valeria displays her awaiting holes as thousands of cameras flash. Ramon Nomar gets this public orgy going by shoving his huge cock all the way down Valeria's throat. Like the all-star whore she is, Valeria holds Ramon's cock in her throat through multiple gags. Saliva streams out of her mouth, down her full breasts, onto her soaking wet fuck hole. Unable to contain themselves, two girls from the crowd jump on stage to suck and fuck along side Valeria. Ramon moves from one cunt to the next, filling every wet hole with his thick cock. Valeria loses herself in the chaos of this public orgy. During the final moments Ramon picks Valeria up, spreads her legs to the crowd as Mona shoves her entire fist inside Valeria's cunt. For the grand finale of this incredible orgy all five perverts move their fuck fest into the throngs of the crowd. Layers upon layers of dudes with cameras push to get close to the flood of cum that is deposited into the three open hungry mouths. This is a public disgrace you will not want to miss.",
  "directors": [],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Valeria Blue",
      "person_id": 58390
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2016-05-13",
  "scene_id": 39052,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "Corporal Punishment",
    "discipline",
    "domination",
    "female slave",
    "gag",
    "humiliation",
    "orgy",
    "public",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Two Dicks, Three Pussies and Thousands of Onlookers "
}