{
  "collections": [
    "Bound Gods"
  ],
  "description": "Josh Peters should have had the barn cleaned out, but the country pervert decides to rub one out instead. The boss, Christian Wilde, shows up in a rage and apprehends Josh. As he strips Josh down, Boss Wilde insults and humiliates him for wasting worktime with a cock in hand. Josh goes to his knees and takes a vicious spanking over a hay bale. Christian makes a deal for Josh: If he wants to keep his job, he’s gotta serve Christian’s cock. Josh obliges, struggling to fit all of Boss Wilde’s dick down his throat before receiving sharp bites from the boss’ belt. Boss Wilde still has a way to go before Josh learns the value of hard work, so he strings up Josh sideways and covers his balls in clothespins. He gives the stud a flogging he’ll never forget before ramming his cock all the way into Josh’s ass. Josh begs for the clothespins to come off, so Boss Wilde rips them from Josh’s tender balls. The barn fills with Josh’s screams as the flogging resumes. Boss Wilde gags Josh and throws him back over a hay bale for a deep fucking. He has the stud jerk himself while taking the stings from a mean crop. All is going to Boss Wilde’s delight, so he pulls out of the stud and douses his face in hot cum. Now Josh finally has permission to blow a load and shoots a gigantic line down Boss Wilde’s thigh. Josh licks his boss’ leg clean before taking a tasing as a final reminder to stay focused at work.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Josh Peters",
      "person_id": 58676
    }
  ],
  "release_date": "2015-11-19",
  "scene_id": 39077,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Flogging",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Spanking",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Farmboy punished for jerking off on the job"
}