{
  "collections": [
    "Men On Edge"
  ],
  "description": "Officer Josh Peters can't stand perverts. When he receives a case on a sketchy massage parlor run by Sebastian Keys and Christian Wilde, Peters goes undercover to investigate. Sebastian and Christian creep on Officer Peters as he strips down to his underwear for his massage. They spot his badge and hatch a scheme to capture and edge the officer. As they rub and knead Peters' ass, they reveal the ruse and strap him to the table. Now at the perverts' mercy, Peters can only moan as Sebastian and Christian run their hands all over his cock and feet. They plow his straight ass with a vibrator, leaving the cop begging to cum. Now flipped over, gagged and with his nipples adorned with clamps, Sebastian offers a special cock massage and works the stud with a fleshjack. Just as Officer Peters is about to blow his load, Christian rips the clamps from Peters and joins Sebastian in tickling their captive all over. They bring Peters back to the intake and bind him in ropes and bamboo. No longer thinking of anything but shooting a wad of thick cum, Josh fucks two hitachis held by Sebastian and receives more painful edges. With the massage drawing to a close Sebastian finally decides to give the muscled hunk his happy ending and milks out a gallon of hot jizz. The relief is short lived for the officer, however, as Sebastian quickly rubs down his sensitive cockhead while Christian holds him down. The pervs taunt Officer Peters as they walk out, daring him to bring more of his cop buddies for another session next week.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Josh Peters",
      "person_id": 58676
    }
  ],
  "release_date": "2015-11-24",
  "scene_id": 39076,
  "tags": [
    "BDSM",
    "Bondage",
    "Cop",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "Oral Sex",
    "Pain",
    "Prostate Stimulation",
    "Rope Bondage",
    "Straight",
    "Stud",
    "Tickling",
    "Vibrator"
  ],
  "title": "Undercover cop begs to cum in an sketchy massage parlor"
}