{
  "collections": [
    "Bound Gods"
  ],
  "description": "Cass Bolton plays it safe with his hookups, but he has no way to protect himself from the occult. After a wild night, he receives haunting visions of dark figures throughout the day. Figuring himself crazy, Cass spends a sleepless night, paranoid of what lurks in the dark. The shadows get closer– two dark demons materialize and waste no time in their torment. Cass has his ass violated by one as the other shrieks in his face. In a flash, Cass finds himself in a twisted hell, chained to a wall and flogged mercilessly. The demons move Cass to a Y-cross, mixing pain with pleasure to the point where neither begin or end, just forming one evil whole. Cass has his feet caned and cock sucked before taking more demon dick in his ass as hot wax pours all over his chest and tongue. One dick isn’t enough for these demons, so they mount Cass over a coffin and plunge both of their stiff rods deep inside Cass. They glaze Cass’ case with their evil seed and lock him away in his coffin for an eternity of torment.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cass Bolton",
      "person_id": 56316
    },
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Jessie Colter",
      "person_id": 34311
    }
  ],
  "release_date": "2015-10-29",
  "scene_id": 39078,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "foreskin",
    "Gay",
    "halloween",
    "Hot Wax",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Redhead",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "The Cursed and The Damned"
}