{
  "collections": [
    "Bound Gods"
  ],
  "description": "The cruel workshop has finally gone silent. Even bound at the wrists and ankles, DJ knows this is his best chance for escape. He worms his way to the exit and straight into his tormentor, Wolf Hudson. Wolf doesn’t take kindly to such brazen, insubordinate acts. He drags the worm back to the center of the cold floor and fucks DJ’s face, kind enough to give him a 69 in the process. Turning from pleasure to pain, Wolf strings DJ from the ceiling and flogs him relentlessly. He takes DJ to the far side of the workshop for a more demanding suspension. Hanging flat from pipes overhead, DJ serves his master’s cock as he takes electric stings all over his sensitive feet and meaty ass. Wolf tests DJ again with the flogger, giving DJ a hurricane of lashes from the merciless leather. As a gift for DJ’s compliance and etiquette, Wolf places DJ on his knees and pounds his eager asshole. DJ moans in gratitude for his master’s cock as Wolf pulls out to let a thick load loose all over DJ’s face. Wolf milks the cum from DJ’s balls before flogging him into the night…",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "DJ",
      "person_id": 20225
    },
    {
      "name": "Wolf Hudson",
      "person_id": 14471
    }
  ],
  "release_date": "2015-11-12",
  "scene_id": 39083,
  "tags": [
    "69 Position",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Facefucking",
    "Feet",
    "Flogging",
    "foreskin",
    "Gay",
    "Hairy",
    "Humiliation",
    "Interracial",
    "Latinx",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Sadism",
    "Straight",
    "Submission",
    "Suspension",
    "Tattoo",
    "unshaved",
    "white"
  ],
  "title": "No Escape"
}