{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Nickey Huntsman is a precocious Human Sexualities major coming to the darkly sensuous Upper Floor to study female submission and the BDSM lifestyle. Dahlia’s pleasure in consensual sexual slavery and desperate need to let the Butler have his way with her gorgeous body and mind beguile the young student. Soon Nickey’s glasses are off and her eyes are wide as she is inducted into the slave lifestyle. Hard cock shoved deep in her throat and ass as she learns to play the power games and keep her fellow slaves’ pussy happy while she takes her punishment flogging. Nickey’s empathy gets in her way, and she finds herself holding silver trays attached to Dahlia’s nipple clamps and getting fucked after her dress is cut away from her perfect body. In the slave training collar she has her round ass beaten and her face used to please Dahlia’s pink pussy. Both slaves have their asses fucked and shocked in turn by the Butler until Nickey learns to beg like a depraved slave for the cum.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Dahlia Sky",
      "person_id": 45819
    },
    {
      "name": "Nickey Huntsman",
      "person_id": 54179
    },
    {
      "name": "Xander Corvus",
      "person_id": 46000
    }
  ],
  "release_date": "2015-10-16",
  "scene_id": 39109,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "Female Slave",
    "Flogging",
    "Humiliation",
    "master",
    "natural boobs",
    "Nipple Clamps",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "Threesome",
    "top",
    "white"
  ],
  "title": "Nerdy College Girl Turned Depraved Anal Slave"
}