{
  "collections": [
    "Hogtied"
  ],
  "description": "Anal Queen, Roxy Raye loves to push her limits with how much she can shove in her ass. Today she is met with one of her biggest challenges to date; The Pope's fist. There are only seven other girls that have ever been able to take his massive fist, but this will be the first anal fisting.\nShe is spread eagle against a wall flogged, and then a crotch rope with a bowling ball tied to it is applied to ensure her suffering. She starts off a bit timid, but that all changes as the day goes on.\nNext she is in a predicament doggy position. All of her weight is balancing on one knee, her other leg is pulled in the air to expose her pussy and ass. She is tormented more and then the anal stretching begins. We grab the biggest toy we have on set and fill her ass with it.\nNext we do an ankle suspension with this slut inverted and completely helpless. She is toyed with and shocked with a zapper before she is made to cum.\nIn the final scene, Roxy is as exposed and helpless as she is going to get. This position allows the ideal angle for The Pope to shove his entire fist inside of her ass. He doesn't stop there and keeps adding more fingers in her pussy to make her as full and tight as possible. You've heard of the \"shocker\" well this is called the \"mini van\"; 2 in the front and 5 in the back. You're welcome!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Roxy Raye",
      "person_id": 35595
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2015-11-26",
  "scene_id": 39164,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Anal Stretching",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Crotch Rope",
    "Director's Picks: JP The Pope",
    "Domination",
    "Fingering",
    "First Anal",
    "Fisting",
    "Flogging",
    "Handler",
    "Humiliation",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Devastating Anal Fisting in Brutal Bondage"
}