{
  "collections": [
    "The Upper Floor"
  ],
  "description": "4 Sexually Submissive Slaves serve 1 Cruel Mistress, 190 BDSM Swingers and many hard cocks in this explosive update celebrating the BDSM lifestyle and sexual liberation. Ember and Ella have their work cut out for them representing the virtues of Bondage and Discipline. Ember is firmly tied down in rope bondage and fucked into a state of hysterical screaming orgasms while Ella attempts to keep her orgasms in and hold her service tray straight while eating her Mistress' pussy. It isn't long before Ella' loses her tray and has her face used to clean up the sex of her slave sister. Both slaves are offered up for spankings from the crowd as punishment. The crowd is wonderfully horny at this point and find themselves fucking all over the room in tight rope bondage, using whips, electrical toys, and floggers. Once the slaves bottoms are properly pink, Ella had a huge cock shoved in her ass and is made to perform for the crowd's amusement while Ember takes a ride on the furious hand of Aiden Star. When the other 2 slaves Joseline and Savannah enter the lounge the sex goes off like fireworks and transforms the party into a screaming avalanche of orgasms and wild sex. Parties like this one only happen once in a great while, don't miss it.",
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    },
    {
      "name": "Ella Nova ",
      "person_id": 51866
    },
    {
      "name": "Joseline Kelly",
      "person_id": 58721
    },
    {
      "name": "Ember Stone",
      "person_id": 58670
    },
    {
      "name": "Savannah Fox",
      "person_id": 47440
    }
  ],
  "release_date": "2015-11-27",
  "scene_id": 39193,
  "tags": [
    "bondage",
    "rope bondage",
    "slave",
    "bdsm",
    "orgy",
    "swingers",
    "straight",
    "discipline",
    "Cut",
    "female slave",
    "master",
    "humiliation",
    "role play",
    "anal",
    "Corporal Punishment",
    "oral sex",
    "Rough Sex",
    "spanking",
    "trans"
  ],
  "title": "Anal Slut Slaves Serve a BDSM Swingers Orgy "
}