{
  "collections": [
    "The Upper Floor"
  ],
  "description": "It's all tits and asses on deck as two senior slaves teach two dick hungry newcomers how to fuck, suck, and suffer like a true slave girl. It's Folsom Street Fair, the kindest wildest BDSM celebration in the world, and The Upper Floor is full of hot lifestyle players and kinky swingers filling the room with rope suspensions, hot sex, whips cracking, and submissive players moaning. James Mogul and Aiden Star have their hands full with with these sexy little submissives trying to use their bouncing tits and round asses to keep themselves out of trouble and on the cock, but no party would be complete without some pain with the pleasure. Newbie Joseline Kelly finds out that a sensitive clit can be too much of a good thing as beautiful dominant women from the crowd torment her wet pussy with a vibrator while she latched down to a table. Savnnah Fox has her firm ass tied up tight like a christmas ham and fucked hard while Ella Nova and Ember Stone try to suck cock with skill and fortitude, but find themselves under the punishing flogger of their Governess Aiden Star. Joseline really shines when her perfect little pussy is trussed up and fucked as she learns how to beg and beg and beg for the multiple loads Marco pills on her pretty face... look forward to footage from our second camera in part two coming soon.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    },
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "Joseline Kelly",
      "person_id": 58721
    },
    {
      "name": "Ember Stone",
      "person_id": 58670
    },
    {
      "name": "Savannah Fox",
      "person_id": 47440
    }
  ],
  "release_date": "2015-10-30",
  "scene_id": 39192,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Hard Parties",
    "humiliation",
    "kinky",
    "master",
    "oral sex",
    "orgy",
    "pain",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "suspension",
    "swingers",
    "vibrator"
  ],
  "title": "Hot Kinky Slave Orgy "
}