{
  "collections": [
    "Bound Gods"
  ],
  "description": "Special Agent Chris Harder was the first to put Wolf Hudson away, and he's hellbent on being the last. Now that he finally has Wolf in custody, Agent Harder thinks the nightmare has ended. Agent Harder should know better, Wolf Hudson doesn't go down so easily. Breaking free of the agent's clutches, the sexual deviant makes a run for it hopping rooftop to rooftop. When Harder catches up, the two wrestle to the ground before he's overpowered by the sex crazed criminal. He struggles with duct tape across his mouth as Wolf taunts and shocks him. Harder's screams echo over the rooftop as Wolf tears his briefs out and plows into his asshole. Wolf binds Harder to a chimney as he takes out his flogger and lets the cruel implement loose all over Harder's body. Wolf fucks Harder's tenderized ass before furiously flogging the agent once more. Agent Harder's will completely shatters as Wolf gives him a third dicking, now in a rope sling on the side of the roof. The agent moans in ecstasy as his captor slaps and punches his body and reams his ass. Wolf covers Harder's abs in hot jizz and smears the load into Harder's mouth. Harder is dragged back to the center of the roof and takes Wolf's command to cum onto his boot with gusto. Wolf, satisfied with breaking another cop, makes Agent Harder clean the boot as he delivers more electric shocks.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Wolf Hudson",
      "person_id": 14471
    },
    {
      "name": "Chris Harder",
      "person_id": 57401
    }
  ],
  "release_date": "2015-12-03",
  "scene_id": 39202,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "cop",
    "Corporal Punishment",
    "domination",
    "flogging",
    "gay",
    "humiliation",
    "Male Sub",
    "master",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "submission",
    "Wolf Hudson on the Run"
  ],
  "title": "Hot Pursuit: Special Agent Chris Harder takes on Wolf Hudson"
}