{
  "collections": [
    "Bound Gods"
  ],
  "description": "Slaves #998 and #782 (Eli Hunter & Scott Riley) await Master Wilde and Master Keys, chained to a cold platform. Today these two miserable sluts will compete to prove their devotion to the house. Their masters order each onto their knees, testing both on their knowledge of BDSM as the sting of the crop and cat-o-nine tails whips against their flesh. The winner of this round has the honor of sucking off Master Wilde. For the next test, Master Keys orders both to get hard under duress of cropping, followed by another seeing which hungry slave can take more of the double dildo. The slaves are bound to a hamster wheel and trade time with each master, #998 tied facing outward with a hard cock and #782 with his ass on full display. #998 takes a vicious flogging as #782 prepares to take Master Wilde's cock deep inside. Master Keys makes #998 watch in jealousy as #782 has his hole ravaged first. The Masters take the slaves over to the iron bed and stack #998 over #782 to give Master Wilde his choice of ass to fuck. The slaves drop to their knees and run their tongues over his feet before one last test: Who can cum first? They blow their loads onto their master's feet and lick up the mess. The winner is rewarded with Master Wilde's hot load all over his face.",
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Scott Riley",
      "person_id": 57782
    },
    {
      "name": "Eli Hunter",
      "person_id": 51998
    }
  ],
  "release_date": "2015-12-24",
  "scene_id": 39207,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crop",
    "dildo",
    "domination",
    "Feet",
    "flogging",
    "gay",
    "humiliation",
    "Male Sub",
    "master",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "slave",
    "submission",
    "threesome"
  ],
  "title": "Newcomer vs Veteran - Slaves Compete to Satisfy Their Masters"
}