{
  "collections": [
    "Bound Gods"
  ],
  "description": "Scotty Zee is a filthy little whore.\n\nHorny for punishment, Scotty finally musters the courage to call Jessie Colter for his expert services. The boy arrives at Jessie’s lounge and quickly falls under Jessie’s spell. Standing by the roaring fireplace, Scotty strips at Jessie’s command. He peels down his boxers to reveal his hard dick standing at attention. Jessie crops the boy and makes him declare just how much of a filthy whore he is. Scotty hungrily gags on Jessie’s dick as Jessie promises that the torment’s only begun. Jessie takes Scotty to the far side of the lounge, covers his body in rope and fixes him to the ceiling. Blinfolded, Scotty only gets harder as he feels Jessie’s rough touch. Unknown to Scotty, Jessie has his flogger in hand. Jessie twirls Scotty’s dick before letting the flogger loose all over his body. Scotty’s legs are brought up from the floor while Jessie covers Scotty in clothespins. Jessie removes the pins one by with his crop, the power of each blow making Scotty swing in the suspension. Now that Scotty’s warmed up, Jessie takes him to the stockade and paints Scotty’s ass with hot wax before ramming his whole length into Scotty’s tight hole. Jessie milks a load from the boy and swings around to the front of the stocks to cover the boy’s face in cum. As a parting gift, Jessie drips more wax onto a cumdrunk Scotty.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jessie Colter",
      "person_id": 34311
    },
    {
      "name": "Scotty Zee",
      "person_id": 58735
    }
  ],
  "release_date": "2015-12-10",
  "scene_id": 39212,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Gag",
    "Gay",
    "Hot Wax",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Stocks",
    "Submission",
    "Suspension",
    "Tattoo",
    "unshaved",
    "white"
  ],
  "title": "Scotty Zee's Submission"
}