{
  "collections": [
    "Bound in Public"
  ],
  "description": "After being punished by his gym manager, Connor Maguire, for overdue membership fees, Aarin Asker now works his debt off working Connor's gym. As he goes through his cleaning duties, Connor brings his friends over to fuck with the gym slave. When Aarin tries to stand up to his tormentors, Connor and the gang knock the boy to the floor and strip him down. He struggles against the the strong grip of a half dozen men pinning him to the floor as they grope and tickle his body. Connor and his buddies bring Aarin back to his feet to give him a rough wedgie and a mouthful of their cocks. Gulping down two huge cocks at the same time, he takes another impossibly large dick from behind. Ready for more fun with Aarin, they take him to the pull up bars and suspend him, legs spread for the fucksaw. Connor sits back and enjoys the scene, having Aarin worship his toes and another stranger's cock at the same time. They take turns pounding Aarin's ass and coating his face in hot jizz and making sure he cleans up every drop off of Connor's toes.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Aarin Asker",
      "person_id": 58219
    },
    {
      "name": "Connor Maguire",
      "person_id": 46426
    },
    {
      "name": "Logan Taylor",
      "person_id": 58799
    }
  ],
  "release_date": "2015-11-13",
  "scene_id": 39328,
  "tags": [
    "Airtight",
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "Cock Worship",
    "Dildo",
    "Domination",
    "Facial",
    "Feet",
    "fucksaw",
    "Gag",
    "Gangbang",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Public",
    "Punching",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Shrimping",
    "Slave",
    "Spanking",
    "Submission",
    "Suspension",
    "takedown",
    "Tickling",
    "Voyeur"
  ],
  "title": "Connor Maguire's Gym Slave Takes on a Weight Room Full of Cocks"
}