{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Part Two of The Upper Floor's legendary Halloween Costume Ball: Anal slut Audrey Holiday teaches young Goldie how to scream in a stress position on the vibrator while Audrey takes a hard fucking in her ass. Goldie obediently licks every bit of cum up while being electro punished and made to cum relentlessly as the guests laugh at her predicament and cheer for Audrey's deep anal reaming. In the other room beautiful women enjoy anonymous blow jobs behind masks, rope suspensions, tight rope bondage take downs, and being held down while they cum. Gorgeous slave girls take single tails and suffer beautifully for their masters. Once again all the slaves are brought together in a sweaty fuck competition, Tits are bouncing every where, slave girls cumming again and again as Aiden Starr rides each of their faces in turn. Both our male guests have any one of four perfect slave asses to choose from, and the resulting fuck orgy is unbelievably hot. Covered in cum and sweat, which of these two new slave girls will be collared and kept by The House?",
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Audrey Holiday",
      "person_id": 57661
    },
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Aidra Fox",
      "person_id": 58677
    },
    {
      "name": "Goldie Rush",
      "person_id": 58292
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    },
    {
      "name": "John Strong",
      "person_id": 17050
    }
  ],
  "release_date": "2016-03-04",
  "scene_id": 39335,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "collar",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "halloween",
    "humiliation",
    "mask",
    "master",
    "oral sex",
    "orgy",
    "role play",
    "rope bondage",
    "Rough Sex",
    "single tail",
    "slave",
    "straight",
    "suspension",
    "swingers",
    "vibrator"
  ],
  "title": "Slutty Slave Anal Orgy"
}