{
  "collections": [
    "Device Bondage"
  ],
  "description": "Roxanne is a little fucking brat that thinks she can have everything she asks for. Today she thinks that she is getting her way again because she begged for me to dominate her with a hot Fem Domme. The part she doesn’t know is that I’m the one who’s getting everything the way I want it. From the first moment, Roxanne is terrorized with extreme punishment from both Daisy and myself. Daisy uses Roxanne’s face as a squirt receptacle while I brutalize the rest of her body.\n\nNext we have Roxanne on her back with her legs spread with, and the brutality continues. It seems Daisy has spent a little too much time as a top and forgot her place when she is around me, so she is taken down a notch and made to lick Roxanne’s pussy. Roxanne is utterly fucking destroyed, but I’m not finished with either one of them.\n\nIn the final scene I have both of these sluts chained to sybians. I make them face each other so that they can see the others suffering. I torment them and now Roxanne has clearly had enough, but I’m still not satisfied, so we continue. They both beg for it to stop. They can’t take it any longer, so I leave them there for another five minutes or so before I finally release them.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Roxanne Rae",
      "person_id": 50987
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2016-01-15",
  "scene_id": 39417,
  "tags": [
    "BDSM",
    "big dick",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Redhead",
    "shaped",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "switch",
    "Sybian",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Turning the Tables"
}