{
  "collections": [
    "Bound Gods"
  ],
  "description": "Rikk York is some hotshot prick with a million-dollar deal on the line, so he’s gotta make the next flight. Boarding started fifteen minutes ago; he doesn’t care about some dumb janitor saying the bathroom’s closed. Big mistake. Jessie Colter, the janitor on duty, busts through the stall and chains the smug jackass to the urinals. Jessie gets a taste of Rikk’s huge cock before returning the favor, stuffing Rikk’s face full of dick. Jessie commands Rikk to crawl through mousetraps and present his ass. Rikk’s asshole gets filled with an electric buttplug, sending painful shocks through his whole body. Jessie hogties Rikk’s body over a sawhorse and fits clothespins between each of Rikk’s toes before plowing his ass with a fucksaw. With Rikk’s hole readied by the fucksaw, Jessie goes deep and hard into Rikk. Jessie covers Rikk’s ass in hot cum and smears the load onto his face. Rikk gets edged multiple times before Jessie milks a load from the stud and punishes his senstive cock. As he struggles against his ropes, Jessie leaves Rikk for security to handle.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jessie Colter",
      "person_id": 34311
    },
    {
      "name": "Rikk York",
      "person_id": 58784
    }
  ],
  "release_date": "2016-02-25",
  "scene_id": 39519,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "buttplug",
    "Chains",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "fucksaw",
    "Gay",
    "Hairy",
    "Humiliation",
    "kink-pov-gay",
    "Latinx",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Rude Businessman's Airport Bathroom Nightmare"
}