{
  "collections": [
    "Bound in Public"
  ],
  "description": "Santa's hosting a big party, and he's invited everyone to help him judge whether this whore called Rex Cameron has been naughty or nice. Bad Santa in a black robe rolls into the party and makes it clear that Rex has been nothing but dirty this year. Proving his point, Rex hungrily gags on Bad Santa's enormous dick. Made to wear a chastity cage, Rex gets passed around the crowd until Santa's little helpers show up and stuff two cocks into his mouth. Rex gets on his knees and rims more of Santa's boys to the party's roaring delight until Bad Santa gets up to fuck his naughty hole. As he takes Bad Santa's dick, Sebastian fits Rex's mouth with a dildo gag and rides the slut's face. Bad Santa trades out with one of his dudes as another covers Rex's face in cum. The crowd decorates his body in clothespins and ornaments with zip lines attached. As Rex submits to his treatment, the crowd tears them away. Santa's helpers drag Rex back to Santa's throne and swing him from dick to dick in a sideways suspension over the party. Mr. Claus jerks his hard cock, presiding over Bad Santa and crew taking turns fucking the trapped whore and glazing his face in holiday cum.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Rex Cameron",
      "person_id": 58982
    },
    {
      "name": "Vinnie Stefano",
      "person_id": 59052
    },
    {
      "name": "Connor Maguire",
      "person_id": 46426
    }
  ],
  "release_date": "2015-12-25",
  "scene_id": 39592,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "Cage",
    "Chastity Play",
    "christmas",
    "Clothespins",
    "Cock Worship",
    "Dildo",
    "Domination",
    "Facial",
    "Gag",
    "Gangbang",
    "Gay",
    "holidays",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "Public",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Suspension",
    "Voyeur"
  ],
  "title": "Muscled submissive whored out by santa for the holidays"
}