{
  "collections": [
    "30 Minutes of Torment"
  ],
  "description": "30 Minutes of Torment returns in full sadistic flourish with straight stud Zane Anders.\n\nTHE WALL: Locking Zane to the wall at at his ankles, Van nevertheless puts Zane’s fate in his own hands. He’ll have to hold tight to chains while taking a brutal beatdown, shocking and cropping. If he lets go from the pain and torment, his ass is toast.\n\nTHE PIT: Zane has his balls squeezed into a parachute tightly anchored to the platform. He must stand perfectly straight as Van unleashes a flurry of hits from the flogger or face double the pain as the parachute pulls to the ground. Van generously lines Zane’s chest in clothespins before making the stud endure the two-handed flogger.\n\nTHE GIMP STATION: Zane finds himself rigged face-down, ass-up to rigid pipes, with a boot clamping his face to the platform. Van stripes Zane’s ass and feet red with a cane before the gimp comes to plow his straight ass. As the gimp pumps away, Van torments Zane with his flogger. After the gimp glazes Zane’s ass in cum, Zane gets flipped onto his back and must get hard while Van tramples and flogs his body. All challenges met, Zane finally blows his load.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Zane Anders",
      "person_id": 55730
    }
  ],
  "release_date": "2016-02-19",
  "scene_id": 39622,
  "tags": [
    "Anal",
    "Asian",
    "Athletic",
    "Belly Punching",
    "big dick",
    "blond",
    "Bondage",
    "Boot",
    "Brutal Punishment",
    "CBT",
    "Chains",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Electrical Play",
    "Feet",
    "Gay",
    "Gimp",
    "Male Handler",
    "Male Sub",
    "Nipple Torment",
    "Pain",
    "Rope Bondage",
    "Sadism",
    "shaped",
    "southern",
    "Straight",
    "Straight Stud",
    "Stud",
    "switch",
    "Tattoo",
    "the pit",
    "the wall",
    "versatile",
    "white"
  ],
  "title": "Straight Southern Boy Endures a Hard Beating & Humiliating Ass Fuck"
}