{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Simone is both sly and slutty. When she catches a look at the elegant new maid, she hatches a plan to get the girl out of her maid uniform and onto the bottom of the hierarchy. The Butler isn't hard to convince. A nice sloppy blow job in the coat room and he's on board. Simone quickly is stripped the girls creamy white skin naked, applying tight bell clamps, and making her clean her pussy silently. Soon Katy is screaming and jingling as the Butler brutally fucks her against the piano, making her cum again and again in her painful pussy clamps. Simone may have gotten her way, but the road is still lined with punishment. Soon her clever little bell test is applied to her own body. In a low squat, an anal plug connected to her ankles, she must hold the house bells silently in a tormenting position and teach her new subordinate the house rules before she can get a fat cock in her ass. Luckily the new girl is a quick learner, even she her pouty lips are getting fucked, and soon everyone is playing bondage and sex games in the guest room, shocking Katy's beautiful body in tight restraints, making her serve the house again and again.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Katy Kiss",
      "person_id": 59216
    },
    {
      "name": "Simone Sonay",
      "person_id": 34687
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2016-02-19",
  "scene_id": 39680,
  "tags": [
    "18-Year-Old",
    "Anal",
    "BDSM",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "master",
    "MILF",
    "Nipple Clamps",
    "Nympho Maid",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Threesome",
    "white",
    "Zapper"
  ],
  "title": "Anal Slave Degrades Young Maid on The Butler's Cock"
}