{
  "collections": [
    "30 Minutes of Torment"
  ],
  "description": "Jackson Fillmore is a full-time BDSM lifestyler. Is his experience enough to help him endure 30 minutes of excruciating sadistic torment until he blows his load? THE PIT - Strapped down to the platform, balls secured tight to the front, Jackson stands completely immobile and must face a serious torrent of corporal punishment. Van starts with open palms and fists to tenderize Jackson's flesh before flogging it raw. THE CHAIR - Jackson sits in the electric chair, his lower half already starting this round with a painful current through his thighs. The torment intensifies with more electrodes clamped to his balls and an electrified butt plug deep in his hole. Van zaps Jackson's erect cock and runs electric arcs from a violet wand all over Jackson's body and straight into Jackson's ass. At the final moments, Van fries Jackson with the electrodes turned up to full power.THE GIMP STATION - Jackson has to make his cock hard for the gimp's arrival while Van lands sharp hits from the crop all over Jackson's ass. The gimp plows into Jackson with a raging hard-on as Jackson grits his teeth and moans. With his back splattered in hot wax, Jackson rides the gimp as he jerks off. Jackson successfully blows his load, but the clock is still ticking. His face gets smothered in the gimp's cum and Van finishes Jackson's 30 minutes with a wicked beating.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Jackson Fillmore",
      "person_id": 56833
    }
  ],
  "release_date": "2016-04-15",
  "scene_id": 39988,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Bondage",
    "brunet",
    "Brutal Punishment",
    "CBT",
    "Corporal Punishment",
    "Crop",
    "Destruction",
    "Electrical Play",
    "EMS Pads",
    "Extreme Torment",
    "Flogging",
    "foreskin",
    "Gay",
    "Gimp",
    "Hair Pulling",
    "Hot Wax",
    "Male Handler",
    "Pain",
    "Rope Bondage",
    "Sadism",
    "shaped",
    "Straight",
    "switch",
    "Tattoo",
    "the chair",
    "the pit",
    "versatile",
    "Violet Wand",
    "white"
  ],
  "title": "No Mercy for Jackson Fillmore: Beaten, Electrified, Humiliated & Fucked"
}