{
  "collections": [
    "Divine Bitches"
  ],
  "description": "She does the cooking. The cleaning. She makes sure the bills are paid on time; your shirts are pressed for work. She decorated every damn inch of the house, planned out all the stops on your last vacation, and looks fucking hot as hell doing it. Your friends congratulate you on snagging such a \"catch,\" and to them you chuckle and say \"thanks.\" But do you ever thank HER, this gorgeous goddess that is your wife?\nDOUBT IT.\nYou'd probably crumble like the pathetic babyman you actually are if she went out of town for a few days. And that is exactly what happens today, when MAITRESSE MADELINE leaves on a 7-day business trip. The whole house falls to shit, bringing forth magical MONA WALES to the rescue. She appears, a little devil over Mike's shoulders, and lets loose a hurricane of shame on him for being so helpless. Mona spanks him over her knee with a wooden spoon, sploshes him with food, and downright punches his guts. In his own kitchen.\nThey then move to the filthy living room where she fucks him up the ass then shoves her hand up inside him and orders him around, fist-first, as he cleans up the place like a little meatpuppet. He does eventually get close to her pussy--or rather, his tongue does, which she exploits to get herself off over and over again before Madeline gets home.\nWhen the cat's away, the mice don't play. They suffer.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Mike Panic",
      "person_id": 41034
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2016-05-13",
  "scene_id": 40091,
  "tags": [
    "BDSM",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight"
  ],
  "title": "The Spoiled Stepford Husband"
}