{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "House Slaves' Revenge: Part 1 -\nToday is independence day for house slaves Mona Wales and Cherry Torn!!!! They fight back against the tyranny of the evil house mistress, Kelly Klaymour. Kelly has been having her slaves do all the hard work while she reaps all the benefits. While Kelly is busy running an empire, Mona and Cherry have fallen in love with each other and they practice the submissiveness to each other. When Kelly walks in on the two lesbians playing around without her blessing, Kelly decides to teach these two whores a lesson. Kelly makes the girls abuse each other. They cry as they have to watch Kelly fuck the love of their lives right in front of each other. Kelly's huge cock slays both of these blond submissives. After a day of bondage, cuckolding, spanking, and abuse the girls desperately pray for help. Their Fairy Goth Mother hears their pleas and she gifts them a very special power. The Fairy Goth Mother turns their vaginas into power dick eating machines. Cherry and Mona sneak up on Kelly and fuck her dick off! Now without her big huge cock, Kelly can no longer abuse them and now they drag her on the Whipped ass to give HER the abuse!! Head on over to Whipped ASS to watch Mona and Cherry get their revenge.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Kelly Klaymour",
      "person_id": 53469
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2017-07-03",
  "scene_id": 40113,
  "tags": [
    "Big Tits",
    "blond",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cock Worship",
    "Cuckolding",
    "Dominatrix",
    "dungeon",
    "fake boobs",
    "natural boobs",
    "other hair color",
    "Role Play",
    "shaped",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Evil Dungeon mistress gets her Dick fucked off by the perfect slaves"
}