{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\n\nProgress Review:\nDay one revealed the trainee’s pain processing is weak, but reactions are very nice and strong. She is willing to follow when led, and gives hints of a deeper masochism struggling to get out. Cock sucking and fucking skills are good, and the trainee possesses an innate sex appeal and beauty that could prove irresistible if tempered and properly presented. Training has confirmed a deep fear of hoods that sends the subject into a nearly unresponsive, panic state. Due to the reality of not knowing what will happen next, the trainee is having difficulty eroticizing some aspects of training. Recommend providing just enough information beforehand to increase her receptiveness.\n\nTraining Goals:\n\n\nTake large objects in pussy.\n\n\nImprove verbal skills - ‘talking dirty’.\n\n\nPrepare her for rope bondage suspensions.\n\n\nImprove anxiety associated with small spaces.\n\n\nProvide opportunity to experience light submission.\n\n\nProvide instruction on processing pain.\n\n\n\nRecommendations:\nTie her into tight predicament bondage that puts her on her toes and gives her two choices: a steel hook pulling her ass open or biting clamps tearing at her nipples. Whip her while reviewing her homework, the principal obedience, and instill this cornerstone of erotic servitude. Work on her fear of hoods by enclosing her full in a canvas sack and suspending her from the ankles. Generously apply the single tail whip and other painful implements, getting her to rely on pain processing techniques. Offer relief by stuffing a hard cock in her mouth and ordering her to suck till she is convincing in her desire to get down. Tie her to the training table to stretch her pussy with large objects, and command her to vibrate her clit well past orgasm while being whipped. Plug her pussy and send her to her quarters in a locked chastity belt to complete her video journal and assignments.\n\nExtra Studies:\nRead an essay on the principal of transparency. Send her to quarters with a rubber fist to practice stretching her cunt.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    }
  ],
  "release_date": "2007-06-16",
  "scene_id": 4012,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Chastity Play",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Predicament Bondage",
    "Role Play",
    "Rope Bondage",
    "Single Tail",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "top",
    "unshaved",
    "white"
  ],
  "title": "The Training of Bobbi Starr, Day Two"
}