{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\n\nProgress Review:\nThe previous two days of training show that our trainee is timely and concise in her homework assignments, delivering good recitations while under the whip. She seems willing to push beyond her perceived limits and exhibits courage and a sincere determination to satisfy.\n\nGoals Progress:\n\n\nPussy stretching:\nBeginning to accommodate large objects, producing very real and vocal orgasms with the help of the magic wand.\n\nVerbal skills:\nDirty talk is proving very challenging for our trainee. Stiffer motivation is required.\n\nClaustrophobia:\nProgress is tenuous. The previous day’s canvas sack proved very challenging and the cock sucking was cut short. Trainee requires more work in a hood.\n\nPain processing:\nImproved along with increased ability to eroticize the training experience.\n\n\nRecommendations:\nPredicament bondage on the vibrating bamboo pony. Blindfold her, gag her and gang up on her with Mr. Stone, flogging her as her pussy is vibrated and grill her on past homework assignments. Work to instill the cornerstones of erotic servitude.\n\nSwitch to a tight suspension tie and turn Evan Stone loose to fuck her silly. Apply a generous whipping to illicit filthy talk from her, make her beg for it. In a second suspension, present both her mouth and pussy. Blindfold and fuck her mercilessly at both ends, continually switching ends to overwhelm her cock. Leaving her hanging in ropes and covered with come till she is ready to accept her reward - a well stretched pussy and screaming orgasms that leave her happily well used.\n\nHood training: continue working on her irrational fear of hoods with 2 minutes in a leather hood. Be prepared for a challenging scene.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    },
    {
      "name": "Evan Stone",
      "person_id": 10920
    }
  ],
  "release_date": "2007-06-22",
  "scene_id": 4013,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Flogging",
    "Gag",
    "Gimp",
    "Hood",
    "Humiliation",
    "Leather",
    "master",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Predicament Bondage",
    "Role Play",
    "Rope Bondage",
    "slim",
    "Straight",
    "Suspension",
    "switch",
    "top",
    "unshaved",
    "Whipping",
    "white"
  ],
  "title": "Training Report, Day Three of Four"
}