{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report, Final Day\nProgress Summary:\nVerbal Skills: Previous days training with electricity, whipping and vigorous fucking have considerably improved the trainee's skills at talking dirty.\nPussy Stretching: Unable to completely take the rubber fist but cetainly has succeeded in pushing her cunt open.\nClaustrophobia: Have prepared her with hoods, blindfolds and canvas sack - today's scene will tell us how well the training has taken effect.\nPain Processing: General improvement with the basics but more time is needed to deepen her ability to satisfy any significant sadistic desires outside of raw, sexualized punishment.\nSubmission: Trainee's understanding of erotic power exchange has markedly improved and she is open to further training in this area.\nRope Bondage: Provided training up till today in tight positions - today's suspension will tell.\nRecommendations: Complete her training by binding her wrists, putting her in a coffin and submerging her in a tank of water. Because this scene is a complete surprise to her, she may freak out once she realizes what is happening. Be prepared, talk her through it, and she will be repaid for her composure with a strong sense of accomplishment. After she recovers, put her through a Japanese bondage suspension that leads her to a blindfolded encounter with a huge black man. He fucks her silly and she gets a chance to demonstrate her skills as a submissive, dirty talking fuck slut who begs for his come all over her tits.\nRecommendations for Future Use: Possible placement as a novice slave. Trainee would require work on protocols, pain processing and endurance. She does possess a remarkably captivating sex appeal and she genuinely enjoys getting fucked and sucking cock. She enjoys fucking strangers and is open minded. These assets along with her beauty, intelligence, tight pussy and inviting mouth make her an excellent candidate to be loaned out, gang-banged, or used as a pleasure slave.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    },
    {
      "name": "JR Langdon",
      "person_id": 11748
    }
  ],
  "release_date": "2007-07-06",
  "scene_id": 4014,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blindfold",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "Electrical Play",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "top",
    "unshaved",
    "Whipping",
    "white"
  ],
  "title": "The Training of Bobbi Starr, Day Four"
}