{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The epic conclusion of Stefanos' Birthday party, in which he demands the horny crowd of BDSM swingers and beautiful anal slave whores to deliver him 45 orgasms - He will now live forever, because this wild night provided him 55 years to grow on. Perfect slave girl Veruca James hangs helplessly in brutal suspension while being fucked from behind, her mouth stuffed with cock while her newbie trainee eagerly laps at her ass. Both girls deliver many tormented orgasms in bondage, screaming for mercy and delighting the crowd. Cute as a button, and quiet as a mouse, slave Sydney Cole must learn to scream and entertain as her pussy pleasured and punished. Her anal slave charge, Nora Riley Has her tight pink asshole stuffed with hard cock and must hold her orgasms and endure electro torment until her senior slave can learn how to cum like a good slut, loudly and eagerly. The final conclusion is a complete fuck fest with plenty of anal, cruel lesbian sex, facials, single tailing, and a final 45 clamp zipper that leave our slaves breathless and cumming in a pile in front of our appreciative guests. Don't miss the bonus crowd action with plenty of dirty play and rope suspension!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Bobbi Dylan",
      "person_id": 59345
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Nora Riley",
      "person_id": 58748
    },
    {
      "name": "Sydney Cole",
      "person_id": 57458
    },
    {
      "name": "Veruca James",
      "person_id": 43570
    }
  ],
  "release_date": "2016-06-24",
  "scene_id": 40243,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "Lesbian",
    "master",
    "Oral Sex",
    "Orgy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Single Tail",
    "Slave",
    "Straight",
    "Suspension",
    "Swingers",
    "Threesome",
    "Zipper"
  ],
  "title": "100 Orgasm Slave Girl Orgy"
}