{
  "collections": [
    "Bound Gods"
  ],
  "description": "Kyler Ash awakens to find himself tied to a meat hook in Trenton Ducati's lair. Trenton comes towards his new sex slave to see what kind of meat he's packing. Trenton lets loose Kyler's thick cock, and slides it down his throat. Kyler sways in the air, begging to cum. Trenton instead takes Kyler off the meathook, and slams him onto a pile of meat. Trenton pulls out his throbbing dick, and rams it up Kyler's tight hole. Trenton leaves his mew meat locked in a cage for a while, before taking him out for a quick walk using a chain leash and zapper as incentive. Trenton leads his pet over to the meat cleansing station, where he makes Kyler lick his cock clean before chaining him to the ceiling and brutally flogging him. Trenton's flogger freshly tenderizes Kyler. Kyler is packed in a Maxcita sleep sack, while electricity is sent through his cock and nipples. The electric current hardens Kyler's cock while the rest of his body tingles with anticipation. Trenton decides it is time to open up Kyler's asshole, and sticks an electrified butt plug in to soften the little hole up. Kyler's ass is finally ready for Trenton's big cock. Trenton fucks the cum out of Kyler, and then pulls out his cock, and showers his hot load all over Kyler's face.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Kyler Ash",
      "person_id": 59359
    },
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    }
  ],
  "release_date": "2016-05-26",
  "scene_id": 40248,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cage",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Electro Clamp",
    "Flogging",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Pet Play",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Submission",
    "Twink",
    "Zapper"
  ],
  "title": "Perverted Butcher torments and abuses his handsome captive"
}