{
  "collections": [
    "Bound Gods"
  ],
  "description": "Max Cameron has one day left in prison before going on parole, and Officer Trenton Ducati makes sure to give the parolee a proper send off. Officer Ducati puts Max over his knee and spanks him for everyday he has spent in prison. He then pulls Max’s face down to his lap, and has him polish Trenton’s meaty cock. Officer Ducati suspends Max and brutally flogs him. Max takes the flogger like a good prison bitch, so Officer Ducati presses him against the cell bars and starts binding his arms and legs with belts. The belts hold Max to the cell while Officer Ducati covers his body with saran wrap. Officer Ducati then fills Max’s cock with different electric devices. Officer Ducati sends electricity through Max’s most sensitive areas until Max is begging to cum. Officer Ducati then rips Max off the cell wall and throws him onto the prison bed, where he sticks his hard cock up Max’s tight ass. Trenton makes sure Max knows that no matter where he is, he will always be a prison bitch to Officer Ducati, and his gaping hole will be indisputable proof. Trenton fucks Max’s ass until he can’t take it any longer and shoots his cum all over Max’s wet tongue. Max spends his final moments before becoming a free man blowing his sticky load all over himself.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Max Cameron",
      "person_id": 57500
    },
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    }
  ],
  "release_date": "2016-06-09",
  "scene_id": 40253,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Gaping",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Prison Punk Scared Straight by Perverted Officer Ducati"
}