{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Nora Riley is a doe-eyed beauty and natural submissive. She comes to our wild brunch party ready to serve and have her ass ravaged and fucked in front of a live audience of horny BDSM players who are extra excitable on this day. Naked women line up to spank her butt red before Seth put's his cock deep in her ass and rides her until she learned to come for the cock and not for herself. Charlotte is a perfect Senior slave, licking tears off Nora's face, reciting the house rules while in an intense rope bondage bridge position, and getting fucked while licking her initiates perfect pink cunt. The look of sheer desperation on Nora Riley's face as she tries to keep heavy silver trays lifted high while seated on a sybian that is wracking her body with involuntary orgasm after orgasm is what service is all about.\nThis day is a great deal of fun with guests hanging each other in tight rope suspensions, pretty girls cumming with their friends and joining in as the House Staff canes Nora's ass, leaving beautiful red stripes and leaving her with a reminder of her lessons well learned before she is latched down to a table and made to cum over and over again as she recites her rules pledges her ass to the House.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Charlotte Cross",
      "person_id": 58806
    },
    {
      "name": "Nora Riley",
      "person_id": 58748
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2016-07-22",
  "scene_id": 40274,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Bondage",
    "bottom",
    "brunch",
    "brunet",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "master",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "Stud",
    "Suspension",
    "Sybian",
    "Tattoo",
    "Threesome",
    "toned",
    "white"
  ],
  "title": "Innocent Girl Made Depraved Anal Slave"
}