{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "Kacie Castle wants to push boundaries. The art world’s, her own, and the audience’s. Inspired by Marina Abramovich’s piece\nRhythm Zero\n, Kacie subjects herself to a room full of men, a table of 72 objects, and no rules. She takes full responsibility for whatever happens. Let the chips fall as they may.\n\nAndddd it doesn’t doesn’t take long for the chips to fall into an all out, no holds barred fuckfest. The men start out nice, curious even, until they realize what a horny slut this little artist really is. They explore all her tight holes, stretching out her ass and pussy til she’s begging to be DP’ed. Her performance props are completely wrecked as she delivers sloppy, inspired blowjobs and gets the men off for the sake of art. The day isn’t done til all her holes are gushing with the audience’s cum, and Kacie returns to her stance where she will wait until the gallery closes. Or the next batch of men enter. Whichever happens first for this arty whore…",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "Kacie Castle",
      "person_id": 59236
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    },
    {
      "name": "Mark Wood",
      "person_id": 31058
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Stallion",
      "person_id": 58525
    }
  ],
  "release_date": "2016-05-25",
  "scene_id": 40323,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "foreskin",
    "Gangbang",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "Rhythm Zero'd: Slutty Performance Artist Fucks Her Audience"
}