{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When hot and slightly snooty Summer Day starts her very own first real estate company, her rich daddy seeds her venture with a freshly acquired parcel of rental units in the Potrero district of San Francisco. The entire block has been evicted and is ready to be gentrified by Summer’s new company, but there is one stubborn tenant that will not vacate. Summer is determined to close this deal and make her daddy proud. She is fed up waiting and drives over there where she confronts Xander Corvus and The Eviction.\n\nHot take down action between two hot performers! Xander ties Summer’s wrists tight with a guitar cord before ripping out her tits and fucking her pretty face with his huge cock. Summer’s sexy resistance build till she is unable to resist opening her throat to Xander’s penetrating cock.\n\nXander decides to keep the snooty entrepreneur for a while and puts her on ice in the basement. Summer is suspended among the motorcycles, gagged, helpless and a vibe teasing her pussy. Xander takes his time with it and gives Summer a good dicking in tough rope bondage.\n\nThe anal action trimmed out with bondage and a ball gag sends Summer into a different zone. Hot ass, hot bondage, hot BDSM action - Xander and Summer Day kill it in this sexy porno drama!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Summer Day",
      "person_id": 59412
    },
    {
      "name": "Xander Corvus",
      "person_id": 46000
    }
  ],
  "release_date": "2016-07-29",
  "scene_id": 40353,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Humiliation",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "toned",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Eviction"
}