{
  "collections": [
    "Men On Edge"
  ],
  "description": "Skating over to the Armory on a hot summer day, Jackson wants impromptu edging session, and Van is more than happy to oblige. Jackson melts into the bed as Van and Joshua James take him to the edge over and over. Jackson tries fucking Joshua’s mouth as hard he he can, but only finds frustration when Joshua pulls away at the last moment. When Van wraps the tight fleshjack over his dick, he’s ready to fill the sleeve with a gallon of cum. But Van and Joshua won’t let Jackson off so easily, and instead tickle his body and rock his prostate with a vibrator. When they finally let him bust, Jackson covers his whole torso in hot jizz. Fast forward to the next week: After helping Van with another hot Men on Edge session, Sebastian feels too horny to go home. He wants a session for himself, so Van secures him to the bed and teases Sebastian with slow strokes. It doesn’t take long before Sebastian is raging hard and ready to burst. Still, Van continues with long, drawn out edges, making Sebastian go crazy. Van takes Sebastian to his limits with two hitachis secured against his boner at full power. But the day is starting to get away from them, so he finally decides to let Sebastian cum with a hitachi pressed hard against his balls.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Jackson Fillmore",
      "person_id": 56833
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2016-07-12",
  "scene_id": 40448,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "brunet",
    "Edging",
    "foreskin",
    "Gay",
    "Hitachi",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "shaped",
    "switch",
    "Tattoo",
    "Tickling",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "Men-on-Edgers Sebastian and Jackson Get Edged!"
}