{
  "collections": [
    "Bound Gods"
  ],
  "description": "Trenton Ducati just found himself a new fuck slave: Alexander Gustavo. Trenton quickly picks Alexander up and takes him back to his lair for a hot evening of rough beatings and hard fucking. Trenton keeps his cock whore nice and quiet by wrapping him up in duct tape. Trenton sucks his taped slut's clean cock, and bombards Alexander's chest with hard hits to keep his sexy moans going. Alexander is freed from his duct tape, and tied to the stairwell, so Trenton can take his sweet time attaching a zipper line of clothespins across Alexander's tight body. The clothespins are quickly torn off and Trenton uses the opportunity to get easy access to Alexander's ass. Trenton Ducati turns his whore into an anal whore as he fills Alexander's hole with his meaty cock. Trenton then takes Alexander down to the bathroom to get him cleaned up. Trenton chains and leaves Alexander waiting in the bathroom, before returning with a flogger in tow. Trenton brutally flogs Alexander until echoes of his screams fill the room. Trenton needs to keep his new toy quiet so he ties him down to a bed and fills his throat with thick cock. Trenton then grabs the romantic candles from his bedside and covers Alexander with hot wax. Alexander's body is gradually drenched in melted wax until the only bare area left is his asshole. Trenton fucks Alexander's ass until Alexander blows his load all over his wax covered body. Trenton then adds his hot cum to the mix leaving Alexander stuck in a mess of cum, and wax.",
  "models": [
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    },
    {
      "name": "Alexander Gustavo",
      "person_id": 55166
    }
  ],
  "release_date": "2016-07-14",
  "scene_id": 40452,
  "tags": [
    "anal",
    "bondage",
    "chains",
    "clothespins",
    "hot wax",
    "wax",
    "zipper",
    "slave",
    "flogging"
  ],
  "title": "Anal Whore taken for a Candlelit Night of Hot Wax and Hard Flogging"
}