{
  "collections": [
    "Bound Gods"
  ],
  "description": "Jordan Boss is a straight guy out looking for some hard corporal and little bondage. Jordan comes to the dungeon of Sebastian Keys in order to seek out his pleasures, but on one condition: no sex. Mr. Keys could care less about Jordan's desires and ties him to a rack where he can do whatever he wants to the muscular sex toy. Jordan soon finds out that his sexuality has no meaning once Mr. Keys beats his cock with a crop before strokes it to the point where Jordan begs to cum. Mr. Keys then suspends Jordan on a Lazy Susan, and viciously flogs him in all directions. Jordan feels euphoric as Mr. keys bombards him with the flogger, that is until Mr. Keys pulls Jordan's head down, and has him suck some hard dick. Jordan is then suspended in the air for another round of hard flogging. Mr. Keys gives Jordan the chance to lie down as he is affixed to Mr. Key's bondage table, with a rope pulling at his balls, and clothespins covering his body. Jordan has given up on his no sex motto and fully embraces Sebastian's hard cock up his tight hole. Jordan feels new levels of pleasure from the ass fucking and unleashes his cum all over the bondage table before Mr. Keys' hot cum fills his mouth.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Jordan Boss",
      "person_id": 59434
    }
  ],
  "release_date": "2016-06-30",
  "scene_id": 40453,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "clothespins",
    "Corporal Punishment",
    "crop",
    "domination",
    "dungeon",
    "flogging",
    "gay",
    "humiliation",
    "Male Sub",
    "master",
    "rack",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "straight",
    "straight stud",
    "Stud",
    "submission"
  ],
  "title": "Straight stud wants only bondage but he's made to take cock up his ass"
}