{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Cherry Torn and Lorelei Lee are entrepreneur billionaire moguls who have found a sustainable way to feed the world forever. They have contacted the tech expert for the Bounty Babes to help them get the good News out to the world. Kelli Lox develops an app that will stream a message to everyone’s electronic device to tell them about the news that the evil illuminati are trying to keep from us all….or so that’s what Kelli thinks. Soon after making the app, the tables are turned on Kelli. The bounty babe has been hunted and trapped by the beautiful Blonde evil ladies. Cherry and Lorelei capture Kelli, tie her up, suck her cock foot job her cock, slap her around and fuck her with a strap on all the mean while streaming the entire thing to everyone using the app that Kelli Developed. Cherry and Lorelei call out the other bounty babes to try to come help their friend….but is it another trap?One thing is for sure, After you watch this video, you will be Under Lorelei Lee’s Spell…. stay tuned for upcoming Bounty Babe shows featuring, bondage, anal strap on, food jobs, blow jobs, and pussy fucking.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Kelli Lox",
      "person_id": 37743
    },
    {
      "name": "Lorelei Lee",
      "person_id": 758
    }
  ],
  "release_date": "2016-10-10",
  "scene_id": 40461,
  "tags": [
    "Anal",
    "Athletic",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cock Worship",
    "Director's Picks: Ariel X",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "toned",
    "TS",
    "TS Fucks Female",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Kelli Lox is tricked, put in bondage then fucked in front of the world"
}