{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Gina Valentina is one of the best initiates we have had in years, willing to sweat and endure much suffering for her collar and cuffs. Weighed down with heavy chains and made to squat with a vibe on her sensitive 19 year old clit she makes lovely ladies in crowd orgasm through their panties and eventually laps up the cum from her senior slave's freshly fucked cunt while getting a reward pounding. Her tiny little frame shakes with effort and sexual energy every time she cums for the house.\nThe rest of the day is spent learning what service truly means. Crawling on the floor to fetch drinks, drooling for an amused crowd, bouncing on hard cocks until she is about to drop Gina had the aptitude, but unfortunately for Ella Nova, she does not have the actual verbage of the House Rules, for which Ella Nova's beautiful round ass it beaten red and fucked in bondage. Gina happily gobbles up Marco's hard cock sloppy from anal, and earns herself a first hot load early in the day.\nAfter all she has been taught, one final lesson remains: controlling those unbridled orgasms. Gina can't seem to ever ask in time, so we tied her little body down to a fuck table, set Ella on her clit with a vibe, and edge her orgasmic little pussy until she is begging and waiting like a filthy good girl slave. Well done Gina and Ella!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "Gina Valentina",
      "person_id": 58814
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    }
  ],
  "release_date": "2016-05-14",
  "scene_id": 40533,
  "tags": [
    "19-Year-Old",
    "Anal",
    "BDSM",
    "Bondage",
    "Chains",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Threesome"
  ],
  "title": "19 Year Old Wet Hole For Service"
}