{
  "collections": [
    "Sex And Submission"
  ],
  "description": "While taking a guided tour of the San Francisco Armory, Dallas Black picks up a famed Hitachi Magic Wand Vibrator from the Kink.com gift store. But when back in her bed, when the magic moment is at hand, her new toy sputters out and fails her, denying her hungry pussy the orgasm she craves!\n\nBack at the Kink store, Dallas meets customer service girl Lilith Luxe, who is more than happy to help Miss Black find a better way to get off. After penetrating Dallas’ sweet little asshole with kinky rubber toys and burying her delicious cunt into Dallas’ hungry mouth, Lilith admits that she cannot fix the broken vibrator. But the guys in the shop might be able to help her.\n\nWhen Dallas brings her broken vibrator to the Kink shop for repairs, Mr. Pete puts the fix in and lines up Dallas’s cunt with tight rope bondage and amazing vibrator orgasms. Dallas pays for the repairs with deep throat cock sucking with tied up kneeling on the dirty shop floor. What a slut.\n\nPete takes a shine to the little hottie, and gives her his own version of a guided tour on the Armory. He finds an empty set and toes the slut down to a fuck box for some more hardcore BDSM and anal action.\n\nDallas Black gets the VIP tour: fucked hard while tied down, gagged and naked in the Armory basement by the shop guy’s big dick. But in the end, even though Dallas got fucked in the ass by Customer Service, she woke up a happy customer with a new toy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Dallas Black",
      "person_id": 58922
    },
    {
      "name": "Lilith Luxe",
      "person_id": 55114
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2016-07-01",
  "scene_id": 40588,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "foreskin",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "mixed",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Dallas Black's Customer Service Experience is Fucked Up!"
}