{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Summer has come to Barcelona, bringing with it a fresh batch of european sluts who want nothing more than to be publicly fucked and humiliated. The first girl to spread her legs for this season of Public Disgrace is Alexa Nasha.\nPart one:\nPerky Teen Alexa Nasha, in a white summer dress, is bound with rope from a tree in a public park. Couples sit at picnic tables enjoying the gorgeous summer weather. Slowly, people begin to notice that something interesting is going on as Steve Holmes, Silvia Rubi and Juan Lucho descend upon their bound teen beauty. Alexa squeals with excitement as the group of three tormentors begin lifting up Alexa's skirt to reveal her dripping wet tight cunt. Several folks move away from the exposed girl in pure disgust while others gather around Alexa in amazement. With her hands tied Alexa is unable to resist as she gets passed between the three. The feeling of two uncut cocks sliding in and out of her completely exposed public holes causes Alexa to moan with pleasure. This is only the beginning.\nPart Two:\nAlexa Nasha puts her face on the beer soaked floor of a crowded Barcelona bar. She squeezes her eyes shut as everyone in the bar looks at her swollen teen cunt. She winces at the idea that everyone can see how excited she is. Her asshole clenches as someone reaches down and slides a finger from her throbbing clit to her dripping hole. Pushing her hips back, Alexa's body begs to get fucked hard and fast. A man yanks her head off the ground by her hair and yells something in a language she doesn't understand. Opening her eyes to a throbbing cock in front of her mouth she knows exactly what the man needs her to do. With her mouth gaping one man fucks her throat while another penetrates her tight cunt. The crowd chants as she submits to her rightful place as the cum spittoon for the bar.",
  "directors": [],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Silvia Rubi",
      "person_id": 57227
    },
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Alexa Nasha",
      "person_id": 59585
    }
  ],
  "release_date": "2016-06-17",
  "scene_id": 40594,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Corporal Punishment",
    "Couple",
    "Discipline",
    "Domination",
    "Female Slave",
    "Gaping",
    "Humiliation",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Sub",
    "Submission",
    "Uncircumcised",
    "Vaginal Penetration",
    "Voyeur",
    "white"
  ],
  "title": "Perky Teen Alexa Nasha is Fucked in front of a Chanting Crowd - Part 2"
}