{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Melody Petite is a perky slut in a box - Part 1\nMistress Minerva has a present for Steve Holmes! It's Melody Petite, a perfect perky little slut all wrapped up in a box! This barefoot whore sluts her happy tight ass all over the city for everyone to get a taste! Mistress Minerva loves playing with her toy and delivers some corporal punishment for the crowded city to see. Melody is soo hot from this Steve even has to dunk her in the public fountain to cool down.\nFugitive Biker Bar Gets Serviced! - Part 2\nTied up in rope bondage, Melody Petite's smiling pussy becomes a perfect tourist destination! Everyone at this rowdy bar wants to get a picture with her. After a round of flogging, Mistress Minerva brings out the electric zapper and makes Melody scream with orgasmic pleasure! Melody is still so hot, Minerva has to spit cold water on her face and pussy. After Melody's high heels come off, one lucky patron gets to fulfill all his foot worshipping pleasures and suck on her tiny toes. But don't let those feet get away yet, Melody is ticklish and gets tormented by Mistress Minerva! Finally a round of blowjobs for bikers and fucking by big dicks that are almost too big to fit in her tight pussy, Melody gets drenched in cum!",
  "directors": [],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Oliver Pina",
      "person_id": 59694
    },
    {
      "name": "Melody Petite",
      "person_id": 59695
    },
    {
      "name": "Mistress Minerva",
      "person_id": 59696
    }
  ],
  "release_date": "2016-08-29",
  "scene_id": 40599,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "domination",
    "Feet",
    "female slave",
    "flogging",
    "Get Sprung",
    "high heels",
    "humiliation",
    "Petite",
    "public",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur",
    "Zapper"
  ],
  "title": "Perky Little Slut in a Box - Part 1"
}