{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Part 1 - Spanish Slut Fucked Outdoors\nFrida Sante is a pretty Spanish slut who loves to take it hard for everyone to see. Fully outdoors in front of a crowd she gets fucked, spanked, and put to work! This gorgeous slut can really take it from both ends while strangers gasp at the hard face fucking happening right before their eyes! This scene ends up being soo hot for Frida in her tight black dress, stockings and latex garter that she needs to take a public dip in the local fountain!\nPart 2 - Underground Goth Club turns into a wild fuck party!\nSteve Holmes drags Frida to a crowded underground goth bar, where the patrons are ready and horny for any action they can get! The sexy goth sluts at this club take turns flogging Frida's perfect round ass before making her crawl on her hands and knees to sniff every hot ass in the joint. Unable to control herself one of the hot petite whores at the club strips naked and goes in for some lesbian pussy licking and face sitting. As the night goes on the whole bar gets their tits out and joins in the party. Frida needs to be tied up in tight rope bondage to be fucked with an anal plug while the audience gets flogged before a huge cum shot cock sucking for everyone to enjoy.",
  "directors": [],
  "models": [
    {
      "name": "Frida Sante",
      "person_id": 59765
    },
    {
      "name": "Melody Petite",
      "person_id": 59695
    },
    {
      "name": "Pablo Ferrari",
      "person_id": 59621
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "release_date": "2016-09-26",
  "scene_id": 40601,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Facesitting",
    "Female Slave",
    "Flogging",
    "Get Sprung",
    "Humiliation",
    "Latex",
    "Lesbian",
    "Nylons Stockings",
    "Outdoors",
    "Petite",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Straight",
    "Sub",
    "Submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Spanish Slut Frida Sante Fucked Outdoors"
}