{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Part 1 - Spanish Slut gets disgraced like a pig!\nPerky Nerea Falco is ready to be disgraced. But little does she know Max Cortes and Liz Rainbow are there to turn this slut into a fuck pig! Suspended in rope bondage, Max and Liz both take turns aggressively slapping the fuck out of Nerea until she learns how to properly respond like a pig. Once they let her down, she is then made to worship and lick Liz's sexy high heals and feet. Every good pig needs an anal tail, which is shoved down this sluts tight ass hole. She is then made to crawl on her hands and knees in front of a crowded park.\nPart 2 - Spanish Bar turns into a Filthy Fuck Party!\nNerea is dragged into a filthy bar and is soaked in freezing cold water. She is then made to lick up and scrub clean the dirty floors with her body and tongue. The bar goes wild! Patrons get their horny hands all over these sluts. Even Liz gets her clothes torn off and gets into the action! Ass eating, hair pulling, face spitting, aggressive deep throat, hard anal, this bar gets it all! Dicks are pulled out and suck off, tits come out and get slapped! Champagne is sprayed over everyone! Finally Nerea is drenched in cum, while a bar patron wipes it all over her filthy face.",
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Liz Rainbow",
      "person_id": 59028
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Melody Petite",
      "person_id": 59695
    },
    {
      "name": "Pablo Ferrari",
      "person_id": 59621
    },
    {
      "name": "Frida Sante",
      "person_id": 59765
    },
    {
      "name": "Nerea Falco",
      "person_id": 59766
    }
  ],
  "release_date": "2016-09-12",
  "scene_id": 40603,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "domination",
    "Feet",
    "female slave",
    "Get Sprung",
    "hair pulling",
    "humiliation",
    "lesbian",
    "public",
    "rope bondage",
    "Rough Sex",
    "slapping",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Beautiful Spanish Slut Gets Disgraced Like a Pig! - Part 1"
}