{
  "collections": [
    "Bound Gods"
  ],
  "description": "After his earlier encounter with two horny home invaders, all Zane Anders can think about is a good fuck. One day Zane stares out the window admiring his sexy gardener, Sebastian Keys', hard body. Zane makes his move, and Sebastian is quick to accept, but on his terms. Sebastian likes it rough, and quickly grabs hold of Zane, ripping his clothes apart. Zane's cock grows in Sebastian's gripped hand, while Mr. Keys' other hand pummels his chest and tugs on his balls. Before Zane realizes what's happening, he is down on the floor with a spider gag in his mouth, and Sebastian's cock in his face. The hard cock slips past the spider gag and fills Zane's whore mouth. After some intense cock sucking, Sebastian pulls Zane's mouth off his cock and ties Zane to the stairwell. Zane is flogged front and back until his body is red, and he is screaming in agony. Sebastian soothes him by fucking his tight hole on the stairwell, before sending him upstairs. Zane gets to spend some quality time chained in his closet while Sebastian attaches forceps all across his body, and beats him with a crop. Zane finally gets a chance to rest in his bed while Sebastian fucks his ass, and strokes his cock. Euphoria overcomes Zane as he lets his cum fly across his chest. The gardener is satisfied with his work on Zane, and finishes things by filling Zane's mouth with hot cum.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Zane Anders",
      "person_id": 55730
    }
  ],
  "release_date": "2016-08-18",
  "scene_id": 40641,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Flogging",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "southern",
    "spider gag",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "Perverse Gardener Brutally Torments Southern Straight Boy"
}