{
  "collections": [
    "Bound Gods"
  ],
  "description": "Tyler Phoenix awakens in a tiny cage, as a shadowy figure peers out from another cell. This caged beast is Trenton Ducati, and he controls this place. He exits his lair and walks towards Tyler. Tyler's only clothing left is quickly ripped away, leaving him exposed and ready. Trenton toys with Tyler's huge uncut cock before pulling his balls through the cage for a better view. Trenton lets the quick stings of the zapper guide Tyler across the floor, so Trenton can chain him a against a cage and pummel every inch of him. Trenton climbs up the cage face face fucks his fuck slave, until he is fully submissive to his new master. Tyler crawls to his master, dragging lengthy chains attached to his wrists and feet. Trenton attaches the chains to a bar, and picks out his preferred flogger to test on his pet. Trenton arcs around Tyler and flogs him from every angle releasing every kind of scream imaginable from Tyler's whore mouth. Trenton quiets the room by making Tyler tongue fuck his asshole. Trenton soon decides it's time to give some attention to Tyler's hole, and sticks his huge cock inside. Trenton is pleased with his new cage slave, and christens him with hot cum. Tyler thanks his master by shooting his load across his shiny leather boots.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    },
    {
      "name": "Tyler Phoenix",
      "person_id": 59544
    }
  ],
  "release_date": "2016-09-01",
  "scene_id": 40757,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Cage",
    "Chains",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Sub",
    "Submission",
    "Uncircumcised",
    "Zapper"
  ],
  "title": "New Sub, Tyler Phoenix: Caged and Tormented"
}