{
  "collections": [
    "Bound Gods"
  ],
  "description": "Alex Mecum is obsessed with watching hot studs beat and fuck each other, but he's nervous about trying it out. Christian Wilde is about to change all that. First he chains Alex to a platform in the center of a dungeon, and plays with his huge cock. Alex is still too tense for a good flogging so Christian softens his tight muscles with some hard smacking. The flog strikes Alex rapidly and at random. They hit from every angle until Alex cries out for mercy, but is given Christian's huge cock instead. Alex feels the massive cock fill up his throat. Christian then pulls Alex off his cock and flogs him until he can barely stand on his own two feet. Christian then bends him over, and fucks him to the floor. Alex is bound to the dungeon bed, as Christian, with his crop in hand, watches him wriggle. Alex handles the crop well, until Christian covers his tender body in clothespins and smacks them off. Christian moves in close and gives Alex an intimate open hand beating, in order to fully test his limits. On his back, Alex watches as his master slides a long steel rod deep into his pisshole. The bound hunk loves being sounded and nearly cums with the metal still in him. Christian pulls out the metal sound, and shoves his huge cock into Alex's tight hole. Alex can't hold it back and unleashes his cum across his chest before having his mouth pried open to receive every drop of Christian's load.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Alex Mecum",
      "person_id": 59595
    }
  ],
  "release_date": "2016-09-22",
  "scene_id": 40759,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Chains",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Feet",
    "Flogging",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Submission",
    "Teacher"
  ],
  "title": "The One and Only, Alex Mecum "
}