{
  "collections": [
    "Bound Gods"
  ],
  "description": "Jessie Colter's been dreaming of beating and fucking some sexy new meat, so when he finds Scott DeMarco, he immediately takes him home. At first Jessie keeps Scott as the prime display piece in his dungeon. A St. Andrew's cross binds Scott to the wall, so Jessie can admire his submissive's giant package. Jessie walks over to his new toy, and grips on it's hard cock. Jessie then switches focus to Scott's balls, and covers them in painful clover clamps. Scott is then flipped around, with his ass out and ready. The cold steel of a metal plug penetrates Scott's tight hole, prying him open for later. Jessie ties Scott to the ceiling, and flogs him mercilessly. Now Jessie wants Scott's ass, so he tosses aside his flogger, and takes it. Scott is power fucked around the room, before Jessie resumes the brutal flogging. Jessie then ties Scott down on the bed, and plays with his ass some more. Scott gets to feel one of Jessie's favorite toys, the Violet Wand, pushed deep into his open hole, and shocks his insides. Scott feels the electricity moving through his ass, until Jessie quickly switches things up and fills Scott's hole with his throbbing cock. Scott shoots his load and hot cum covers his chest. Jessie pulls his dick out of Scott's ass, and lets loose his cum across his new fuck slave's begging face.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Scott DeMarco",
      "person_id": 59206
    },
    {
      "name": "Jessie Colter",
      "person_id": 34311
    }
  ],
  "release_date": "2016-09-15",
  "scene_id": 40760,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Electrical Play",
    "Flogging",
    "Gay",
    "Handjob",
    "Humiliation",
    "Male Sub",
    "master",
    "Metal Plug",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Sub",
    "Submission",
    "the wall",
    "Violet Wand"
  ],
  "title": "The Return of Jessie Colter"
}