{
  "collections": [
    "Bound Gods"
  ],
  "description": "Lieutenant Christian Wilde dedicated this entire week to making sure that his perp, Micah Brandt, spends a long time in the nearest penitentiary. Lieutenant Wilde's belief in the justice system is challenged when the Chief informs him that Micah is gonna be freed on Monday. Lieutenant Wilde realizes that it's time to dish out some justice, Bound Gods style. First he pins Micah to a holding cell door, and rips his flimsy clothes apart. Clover clamps attached to the cell door pinch Micah's nipples and hold him in place while Lieutenant Wilde torments his cock and balls. Micah is pulled off the cell door and takes Christian's massive cock down his throat. Lieutenant Wilde suspends his prisoner to the ceiling with his ass out and unleashes his just wrath across Micah's body as he flogs him without remorse. He then pulls out his night stick, and fills Micah's hole with the solid black rod. Micah thinks back fondly to his relaxing cell, when the night stick is quickly yanked from his ass, and he is barraged by the flogger. Micah happily takes solace in a new cell, with some extra rope restraints. Lieutenant Wilde doesn't like how relaxed Micah is, and decides to wake him up with the help of some hot wax. Lieutenant Wilde gleefully rams his giant cock deep in the inmates hole. The fucking is intense, but Micah can't help but shoot his cum across his chest. Micah then feels Lieutenant Wilde's cum flood across his face, as he awaits two more days worth of cum and torment in Lieutenant Wilde's holding cells.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Micah Brandt",
      "person_id": 57628
    }
  ],
  "release_date": "2016-08-25",
  "scene_id": 40795,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "clover clamps",
    "Corporal Punishment",
    "domination",
    "flogging",
    "gay",
    "hot wax",
    "humiliation",
    "Male Sub",
    "master",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "submission",
    "Wax Play"
  ],
  "title": "Lieutenant Wilde's Extreme Justice"
}