{
  "collections": [
    "Everything Butt"
  ],
  "description": "Poor little Milcah Halili has been abducted from her rich family and is being held for ransom. Milcah is an all natural beautiful asian honey with a loose asshole, so it's no wonder her abductors have hidden her in a basement to have all kinds of fun on her ass. Lisa Tiffian is a hot all natural ebony dominatrix who just can't get enough ass. When the hot blonde, all natural, brains of the operation Aiden Starr comes into the basement she finds Lisa already messing with the merchandise. Lisa's teases of Milcah's asshole has gotten Milcah all horny and turned on and not wanting to go home to daddy. Aiden is going to have to show the two anal whores what happens when they can't follow orders. She's going to have to break her foot off in someone's ass. Aiden gapes the ebony asshole so the beautiful Asian Milcah can put her tongue deep into the dark hole. Both girls get their tight little assholes punched open with anal fisting. Milcah get's the foot up the ass. As punishment for being a horrible lookout, Lisa Tiffian is fucked tirelessly until she cums again and again. Both girls are taken to the enema room for final clean up so they can be sent back home to their families now that they are useless damaged goods.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Lisa Tiffian",
      "person_id": 55478
    },
    {
      "name": "Milcah Halili",
      "person_id": 45665
    }
  ],
  "release_date": "2017-07-14",
  "scene_id": 40828,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Asian",
    "Black",
    "black hair",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Ebony",
    "Enema",
    "fake boobs",
    "Fisting",
    "Gaping",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Prolapse",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Tattoo",
    "white"
  ],
  "title": "Useless Damaged Goods - All Natural Anal!"
}