{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Senior slaves Bella Rossi and Mona Wales show the ropes to two incredibly eager newcomers in a competition orgy of epic proportions! James Mogul and Aiden Starr have their hands full teaching two cock hungry newbies how to fuck, suck and serve in a roomful of lifestyle players and kinky swingers. Lilith Luxe and Kira Noir are pushed to their limits, enduring an endless stream of pussy and ass torment, all while being teased with the coveted red and black collars reserved for deserving senior slaves. In this, the first of two installments, Lilith Luxe explodes with orgasms while being fisted by Aiden and covered with a string of clothes pins that the house guests ultimately rip from her as she screams in ecstasy. This delicious, greedy trainee is then zapped, caned and fucked, while Mona Wales helps her through her ordeal, taking on a serious ass pummeling for herself by Mickey Mod's enormous cock. Will Lilith learn to control her endless orgasming and earn her collar? Can Mona keep this trainee slut in line? Stay tuned for part two, coming soon.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Lilith Luxe",
      "person_id": 55114
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    }
  ],
  "release_date": "2016-08-23",
  "scene_id": 40976,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "collar",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Hard Parties",
    "humiliation",
    "kinky",
    "master",
    "oral sex",
    "orgy",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "swingers"
  ],
  "title": "A Slave Orgy Like No Other"
}