{
  "collections": [
    "Bound Gods"
  ],
  "description": "Eli Hunter is at the hottest sex club in town looking for some action. He keeps on hounding the ladies, asking for some good lovin’ but the only attention he ends up getting is from the club owner, Jaxton Wheeler. Jaxton’s been hearing a lot of complaints about Eli, so he tracks him to the alleyway and shows him a night he will never forget. Jaxton rips away Eli’s clothes, and lets him know he is in for a wild ride. Before they can really play, Jaxton makes sure to get rid of Eli’s messy chin beard with the help of some clover clamps, ball weights, and an electric shaver. Eli’s torment continues with some more corporal and hard fucking. Eli is then brought inside the club, away from the cold night air, and duct taped in a horizontal suspension. Jaxton stands over Eli and flogs him mercilessly. He then fills Eli’s screaming mouth with hard cock to shut him up. Eli is relieved to be strapped to a sex swing instead of taped up against the wall, until he notices Jaxton dangling a cattle prod in front of him. The cattle prod zaps his body repeatedly until he furiously shakes and tries to break free from the fuck swing. Eli runs out of energy and accepts whatever comes next, which happens to be round 2 of Jaxton’s hard cock. The vicious fucking makes Eli’s cock harder as his hole is filled and stretched to the limit. Eli releases a cum eruption across his chest, and then lies in wait to receive Jaxton’s hot load. Jaxton strokes his cock until cum blasts all over Eli’s ass and balls.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Eli Hunter",
      "person_id": 51998
    },
    {
      "name": "Jaxton Wheeler",
      "person_id": 53352
    }
  ],
  "release_date": "2016-09-29",
  "scene_id": 40985,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Cattle Prod",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Slave",
    "Submission",
    "Suspension",
    "switch",
    "Tattoo",
    "the wall",
    "unshaved",
    "versatile",
    "Weights",
    "white"
  ],
  "title": "Sex Club Owner Fucks and Torments an Obnoxious Party Goer"
}