{
  "collections": [
    "Strapon Squad"
  ],
  "description": "The hot girl next door into kink is quite rare to find. We're truly blessed to know one quite well. Rose Red, one hot and amazing woman with too many fetishes and desires to count, is no stranger to Fetish Network. Guess who happened to fall in like with Rose Red. Well, two for this one lovely lady: Lexy Villa and Brooklyn Daniels. They heard she liked to be bound tight with rope. These sexy, feisty and shockingly mean Mistresses wanted to give our favorite Red Rose a rope bondage session to test her limits. She's been in the dungeon for awhile, tied up to stay sat on her mat with a potato sack over her head. She seems a bit nervous. Lexy and Brooklyn finally shake up their new sex slave, drag her to a post, tie her neck and wrists tight through steel hooks and taunt her a bit. They love calling their sub sluts cunt, bitch, whore, spank her for being a dirty girl. These BDSM vixens have something for Rose Red: Huge 10\" Black Strapon Dildos dangling between their legs. Lexy shoves her big black rubber cock deep in Red's mouth, fucking her throat, making her slob all over it. The spit allows Brooklyn to pile in her rubber dick deeper in Red's throat. Spit is dripping down the post. The Mistresses have another surprise for their Red Rose: a wall rope suspension. Rope is wrapped around her hips, knees, ankles and wrists, legs spread apart, feet off the floor. What happens next is one of the hottest moments on Fetish Network. Lexy and Brooklyn have full access to her sweet pink pussy, her Pink Rose. With the same XXL dildos, the two mean girls pound her pussy in, fucking her rough, taking turns, one helping the other to fuck Red deeper. They use the rope to pull her forward onto their black dicks. Red loves it. She swings herself, ball gag in her mouth the entire time, hands gripping her neck. Her clit gets a bit of vibration torment, cumming more times she can handle. I'm sure this threesome will happen again. We'll make sure of it.",
  "directors": [],
  "models": [
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Lexy Villa",
      "person_id": 53826
    },
    {
      "name": "Rose Red",
      "person_id": 53699
    }
  ],
  "release_date": "2017-08-03",
  "scene_id": 41031,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Bondage",
    "bottom",
    "Breast Abuse",
    "Breast Bondage",
    "Choking",
    "Deepthroat",
    "dungeon",
    "Feet",
    "Femdom",
    "Fetish",
    "Fingering",
    "Gag",
    "gloves",
    "Hitachi",
    "Latin",
    "LezDom",
    "natural boobs",
    "Redhead",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "Sybian",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "white"
  ],
  "title": "Strapon Squad: Rose Red, Lexy Villa, and Brooklyn Daniels"
}