{
  "collections": [
    "Strapon Squad"
  ],
  "description": "We all thought Mistress Isa Mendez let her sex slave Nikki Bell go after their last rope bondage training session. Nope! Isa kept Nikki tied sitting on the sybian fucking machine with a big ball gag muffing her mouth. Isa starts the session off with the sybian. Nikki can't move so she will endure every bit of vibration Isa gives her, teasing her with the control panel. Nikki begs to orgasms over and over, soaking the vibration pad. It makes Isa jealous. So she straps on her favorite dildo, makes Nikki spit on it and shoves it deep down her throat. Isa loves watching the spit spill out of Nikki's mouth, pleased to see Nikki going mad with all her orgasms. The lesbian domination doesn't end there. Isa ties Nikki on the mattress on her back, legs pulled back, vibrator tied in place to torment her clit. Isa takes her dildo and makes Nikki cum a few times with it, making her clean it with her mouth, deep down her throat, making Nikki gag up more spit. Isa does step over and sits on Nikki's face and enjoys the rimming Nikki does so well. She then continues the rough sex and spreads Nikki's legs and practically wrecks her hole, pounding in every inch. She fucks her rough, deep and hard, on the floor and sofa. She even pulls out a flogger and spanks some ass and tits. Nikki loves being used by her Mistress, cumming whenever Isa tells her to, backing up on the rubber dick. Isa leaves Nikki trembling. But she isn't done with her yet. She gives her sex slave a few sweet kisses, ramps up the vibrator and will probably return later on. Hopefully!",
  "directors": [],
  "models": [
    {
      "name": "Nikki Bell",
      "person_id": 54279
    },
    {
      "name": "Isa Mendez",
      "person_id": 53665
    }
  ],
  "release_date": "2017-08-04",
  "scene_id": 41033,
  "tags": [
    "Ball Gag",
    "Bondage",
    "Breast Bondage",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "dungeon",
    "Femdom",
    "Flogging",
    "Gag",
    "Lesbian",
    "LezDom",
    "Redhead",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Slave",
    "Small Tits",
    "Straight",
    "Strap On",
    "Sub",
    "Sybian",
    "thirdparty",
    "Vibrator"
  ],
  "title": "Another Round of Lesbian Domination with Nikki Bell & Isa Mendez"
}