{
  "collections": [
    "Strapon Squad"
  ],
  "description": "The submissive and obedient sex slave Isa Mendez has been begging us to end up in the dungeon again. She seems addicted to lesbian domination, threesomes if possible. She loves being slapped and spanked, gagged and fucked roughly, deep and hard down her throat and pussy. We definitely have everything Isa wants. Brooklyn Daniels and Lexy Villa heard about her desires and took it upon themselves to bring their kinky Latina hottie over. They place a tight leather collar around her neck, cuffs on her wrists, linking them to the collar. They brought out the sofa this time, sitting Isa on it, yet her legs chained apart. Brooklyn and Lexy come in and slap her pussy awake. They want her to cum a few times before they double penetrate her. A vibrator usually does the trick. They lube her cunt and spread the wand all over her clit and pussy lips. Lexy climbs up on the sofa and stuffs her hung strapon deep down Isa’s throat. She can’t focus on cumming and giving Lexy’s big black rubber cock a proper deep throat blowjob. She keeps gagging up spit. Our hot BDSM Mistresses unchain Isa’s ankles and flip her over, her arms, shoulders and head over the back of the couch. Lexy lubes up her cock and pushes it deep inside Isa’s pussy. Isa tries to get away but only ends up taking Brooklyn’s rubber cock in her mouth. Isa’s hot body spread out doggy style, double penetration with huge strapon dildos, will make everyone cum in their pants. They flip her over and keep fucking her rough. They flip her over again and keep the rough sex going. Isa can hardly move, slapped into the position they want her in. Seems this sex slave does need more training. They pull her off the couch and takes turns fucking her throat. Isa keeps begging for more. What a good slut she is!",
  "directors": [],
  "models": [
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Isa Mendez",
      "person_id": 53665
    },
    {
      "name": "Lexy Villa",
      "person_id": 53826
    }
  ],
  "release_date": "2017-08-07",
  "scene_id": 41032,
  "tags": [
    "BDSM",
    "black hair",
    "Blowjob",
    "Choking",
    "Collar",
    "Deepthroat",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Femdom",
    "Fingering",
    "gloves",
    "Hand Gagging",
    "High Heels",
    "Hitachi",
    "Kinky",
    "Latinx",
    "Leather",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "Mouth Spreader",
    "natural boobs",
    "Rough Sex",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Partner Studio",
    "Threesome",
    "Vibrator",
    "white"
  ],
  "title": "Isa Mendez Takes Double Penetration from Brooklyn Daniels & Lexy Villa"
}