{
  "collections": [
    "DDF Network"
  ],
  "description": "Appearances can be deceiving. What looks like a situation where a female is in charge of a male can actually be a scenario where the exact opposite is the case! At first, Aleska Diamond looks like a controlling mistress in her latex outfit, and Choky Ice, chained to the wall, at first looks like her slave in black latex duds. But when we see Aleksa insert a red-jeweled butt plug in her bottom, even as her “slave” observes, it becomes clear that this is a unique situation where she has merely kept her master restrained to the wall at his own request, so he will be faithful to her with his wildly in-demand porn stud cock! She is really HIS slave, the servant of that dick. Aleska takes down his latex pants so she can suck his meat, and then rub it between her thighs once she lifts up her lavender skirt. When she unchains him and has him kneel behind her ass to remove the buttplug with his teeth, he is not subservient but merely being practical–because if he didn’t take out that plug, there would be no room in her rectum for his rod, which plunges immediately afterward into her depths. In another unmistress-like move, Aleska sucks his shaft right from her asshole. Although he then kneels before her to remove her skirt, this too is only practicality; he soon stands behind her and wraps his chains around her neck. Then she rides his cock cowgirl-style with her sphincter, and sucks him off until he gives her a gooey goatee. The jeweled buttplug is returned to her behind as she displays her creamy chin for all to see! She has served him well indeed.",
  "directors": [],
  "models": [
    {
      "name": "Aleska Diamond",
      "person_id": 61972
    },
    {
      "name": "Choky Ice",
      "person_id": 61881
    }
  ],
  "release_date": "2019-10-22",
  "scene_id": 41107,
  "tags": [
    "69 Position",
    "Anal",
    "Blonde",
    "Blowjob",
    "bottom",
    "buttplug",
    "Chains",
    "Dominatrix",
    "Facefucking",
    "Facial",
    "Gimp",
    "Latex",
    "Leather Cuffs",
    "Mask",
    "master",
    "Slave",
    "spit",
    "Straight",
    "Stud",
    "the wall",
    "Partner Studio"
  ],
  "title": "Alpha Mistress demands Hard Anal: Aleska Diamond and Choky Ice"
}