{
  "collections": [
    "Device Bondage"
  ],
  "description": "Lorelei is no stranger to bondage. She has done some of the most intense on-camera BDSM scenes ever filmed. Perhaps this is what makes cyd push the limits with the severity of Lorelei's shoot.\nShe starts off on all fours. A metal collar around her neck is held in place by chains going off in four different directions. Chains hold her wrists and ankles in place with metal cuffs while a metal belt around her waist makes her back down and her ass up. She is already wet and nothing has even happened yet. cyd begins to cane her ass and she cries out in muffled sobs, her eyes wide with surprise at the severity of her punishment. She finds the metal allows her no motion as red marks swell up on her ass. But Lorelei's pussy gives her away; it is dripping and hot. Next, the singletail adds just a dash of stinging pain to her welts. As a reward she gets the attitude adjuster deep in her cunt and the vibrator increases the stimulation until she can’t hold back any more. She knows her place, asking politely to come. Her reward doesn't last long. An ass hook is thrust into her anus and her asshole is chained tightly to a pole above her head, leaving her even more immobilized than she thought possible.\nNow leather straps bind her legs apart, arms up in the air. Her tits & pussy are flogged as Lorelei's gaze remains steadily on the floor. She can handle pain, but something in her face says perhaps this was a bit more than she was expecting. Clothespins pinch tender bits of flesh on her breasts, torso, and pussy and Lorelei lets out shaky moans through her gag. She holds her own, challenging him in the depths of her eyes. So he raises it a notch, ripping off all the clothespins at once, leaving Lorelei to come in a drooling, moaning heap. He's won again.\nLater on, Lorelei finds herself face down again, strapped to a sawhorse. She is skewered like a pig, stuck fast, with one pole down her throat and another in her cunt. Lorelei's still-tender ass is flogged once again. She cries and fights through the gag, wiggling her feet in defiance, but they are the only thing she can move. Nosehooks are the final humiliation, and yet still there is a challenging look in her eyes.",
  "directors": [],
  "models": [
    {
      "name": "Lorelei Lee",
      "person_id": 758
    }
  ],
  "release_date": "2007-02-26",
  "scene_id": 4115,
  "tags": [
    "Ass Hook",
    "BDSM",
    "Blonde",
    "Bondage",
    "Chains",
    "Clothespins",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "heavymetal",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "Straight",
    "Submission",
    "Vibrator",
    "white"
  ],
  "title": "Chained and Caned"
}