{
  "collections": [
    "DDF Network"
  ],
  "description": "Fully outfitted in her red latex suit and mask, Latex Lucy relaxes with her friend Frank M., with Katia De Lys acting as their serving girl in beige head-to-toe latex. Katia stands ready with Frank’s daily whiskey whenever he wants it. After Lucy presents him with his drink, he’s eager to take her on, enjoying her spirited cocksucking while he fingers her pussy through the hole in her suit. After fucking Lucy doggie style, he calls over Katia so he can fondle her fanny through the latex. He kisses Katia while Lucy blows him, then he fucks Lucy while Katia stands by closely to observe. Finally, Frank is in the mood for even more kinkiness, so Lucy binds Katia’s wrists in yellow rope and then pulls her onto her knees to suck Frank. Katia is then placed doggie-style on the bed so that her pussy, exposed through the crotch hole in her latex suit, can be penetrated by Frank’s mighty meat. Lucy supervises the boffing of Katia, then places her ass in Katia’s face for some cunny-lapping. Soon Katia is taking the tool in her tush while her wrists are pulled upward by Lucy, and then the lady in red bends over to lick Katia’s snatch while Frank’s prick moves in and out of the De Lys derriere. Finally Frank holds the rope to Katia’s wrists while Lucy completes the scene by bringing Frank to a blast of cum all over Katia, who lays submissively below!",
  "directors": [],
  "models": [
    {
      "name": "Frank M",
      "person_id": 62522
    },
    {
      "name": "Katia De Lys",
      "person_id": 62523
    },
    {
      "name": "Latex Lucy",
      "person_id": 61550
    }
  ],
  "release_date": "2019-12-17",
  "scene_id": 41187,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Big Tits",
    "Blowjob",
    "Brunette",
    "Facefucking",
    "Facial",
    "fake boobs",
    "Female Slave",
    "Fetish",
    "High Heels",
    "Interracial",
    "Kinky",
    "Latex",
    "Mask",
    "master",
    "Pet Play",
    "Rope Bondage",
    "slim",
    "Straight",
    "Partner Studio",
    "Threesome",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Subby Latex Pets serve Master: Latex Lucy, Katia De Lys, & Frank Major"
}