{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Join the Upper Floor for the second half of a wild night of BDSM players and swingers filling our halls with orgasmic bondage, single tail play, shibari rope, homemade fucking machines, electrical domination, and good old fashioned sex piles. Our house slaves are tied down tightly for some training: Eliza is to learn to control her waves of orgasms while getting fucked with hard cock until she can remember her rules. Busty babe slave Lauren Phillips meanwhile has her perfect ass size trained with large shining metal toys and Syren De Mer's curious tongue. Both the trainee slaves do such a good job we throw Syren on her back to her anal reward, a hard fucking from John Strong, followed by Aiden Starr's fist and a delicious young slave pussy in her face. Meanwhile gorgeous first timer Quinn is restrained in beautiful belt bondage by Jesse and tormented under the whip and rewarded with dick to the delight of the party. As our trainees go through their final endurance test before earning their collars there is literally no surface not covered in people suffering, fucking, and cumming. Please enjoy. We did.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Eliza Jane",
      "person_id": 59596
    },
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2016-11-04",
  "scene_id": 41252,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Big Tits",
    "Blonde",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "fake boobs",
    "Female Slave",
    "Folsom",
    "folsomfever",
    "folsom_st",
    "Humiliation",
    "master",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Orgy",
    "Petite",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Single Tail",
    "Slave",
    "slim",
    "Straight",
    "Swingers",
    "switch",
    "Tattoo",
    "Threesome",
    "toned",
    "unshaved",
    "white"
  ],
  "title": "The Fantastic Fucking Folsom Orgy Pt. 2"
}