{
  "collections": [
    "Bound Gods"
  ],
  "description": "It's closing time in the sex shop, and Alexander is ready to call it a night... But his boss Jaxton has other plans for his handsome muscular employee; who has yet to settle up with Jaxton for the very generous loan he was given. Alexander knows he has no choice but to submit to Jaxton's demands, and before long he's down on all fours with his tight toned ass up in the air worshipping Jaxton's leather boots and bare feet, soon moving up to suck Jaxton's fat cock while being cropped mercilessly. Next Jaxton strings Alexander up by his wrists and torments his gorgeous uncut cock, slapping and smacking it before hanging heavy ball weights from clover clamps latched tight on Alexander's balls and then flogging him from all sides with a hefty flogger while Alexander struggles not to move, lest he bring more pain to his aching junk. Finally Jaxton decides it's really time for some compensation and splays Alexander out on a leather horse and fucks his hot tight ass relentlessly until Alexander can't take it any more and blows his thick load all over himself, and Jaxton is soon to follow, blasting Alexander's blindfolded face with buckets of cum and leaving him naked and spent with even more mess to clean up before he can close up the shop.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Alexander Gustavo",
      "person_id": 55166
    },
    {
      "name": "Jaxton Wheeler",
      "person_id": 53352
    }
  ],
  "release_date": "2016-11-17",
  "scene_id": 41261,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Flogging",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Submission",
    "toned",
    "Uncircumcised",
    "Weights"
  ],
  "title": "Alexander Pays His Debts With His Holes"
}