{
  "collections": [
    "Bound Gods"
  ],
  "description": "Eager and horny, Grayson Frost waits in his apartment for his online hookup to show. When Christian Wilde walks through his door, Grayson is in awe. Christian can tell the boy is a little nervous so he gets right to business, telling him: “When I play, I play rough. Don’t waste my time.”\nBefore he knows it, Grayson is pushed to his knees. His arms bound behind his back before taking every inch of Christian’s hard cock down his throat all while being beaten with his own belt. Bound for the first time in full bondage, Grayson attempts to touch his cock but Christian has other plans for him. He edges the boy’s hard, uncut cock before ramming a giant plug up his ass to pry him open for Christian’s cock. Grayson feels the leather paddle beat his flesh while servicing Christian’s cock once more.\nHot wax all over his balls and clover clamps across his chest, Grayson bites down on his ball gag as Christian removes the giant plug and replaces it with his giant rod. Once the clover clamps come off, Christian pulls the gag out of the boy’s mouth and rewards him with a massive load.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Grayson Frost",
      "person_id": 59557
    }
  ],
  "release_date": "2017-01-19",
  "scene_id": 41266,
  "tags": [
    "Acrylic Plug",
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "buttplug",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Facefucking",
    "foreskin",
    "Gag",
    "Gay",
    "Hair Pulling",
    "Hand Gagging",
    "Hot Wax",
    "Humiliation",
    "Kinky",
    "Leather",
    "Male Sub",
    "master",
    "Paddle",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "switch",
    "Tattoo",
    "Uncircumcised",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Online hookup turns into a night of kinky sex for BDSM virgin"
}