{
  "collections": [
    "Device Bondage"
  ],
  "description": "The metal is cold and excruciating against my flesh. It digs into my neck, wrists, and ankles like bare bones grinding against each other at the joint. It becomes more unpleasant with every adjustment I try to make. I must make myself become accustomed to this metal structure, to feel as though it is an extension of my skeletal structure, a part of me. Every sensation is an exquisite mixture of pleasure and pain. I feel his eyes watching me, his smirk, his pleasure in my discomfort and pain. I find that I am turned on by this in spite of myself. He knows where every tender part of my body is and he makes sure to exploit that knowledge. I have no choice but to give in, a slave to sensations.\nLater on, I am completely immobilized with all my weight supported by a bar between my legs. With my head and arms severely tied back I find it difficult to catch my breath and before long I am rasping and gasping for air. He lets my head up, but at the price of the singletail's licks. All I can think about is how badly I want him to hit me harder. This position is so painful that the only thing capable of delivering relief is more pain. It takes all my concentration just to withstand it. I am so distracted that I forget to thank him when he provides me with something to stand on to displace the weight. He calls me ungrateful I am immediately consumed by so much guilt that I want to cry. I want to make it up to him and just endure it, but the pain is too great. My internal conflict is almost worse than the actual position.\nI want to forget this transient pain and to just tolerate my situation and please him, but I can't let go of the feeling and the desire to physically end it. It is such a turn on to have my mind and body engaged simultaneously in this way. It proves my lack of control and that is something I like very much. Finally I cannot take any more. I have to ask to stand on the boxes again. This time I will not forget my manners. My reward is relief and a string of screaming orgasms, leaving my chest heaving with gratitude. I thank him once aloud because I am too exhausted to repeat it, although it is all that rings in my ears.",
  "models": [
    {
      "name": "Sarah Jane Ceylon",
      "person_id": 12772
    }
  ],
  "release_date": "2007-03-01",
  "scene_id": 4127,
  "tags": [
    "gag",
    "pain",
    "slave"
  ],
  "title": "Inaugural"
}