{
  "collections": [
    "Everything Butt"
  ],
  "description": "In 2006, Francis M Fesmire, recieved an IG nobel Prize for making a study that demonstrated that rectal massage was a cure for \"intractable hiccups. We have absolutely no idea how the studies were made but when we learned that massaging your asshole cured hiccups, we figured that it probably happened almost exactly like this.\nLily Lane is a scientist with a cute young hiccuping patient. Alexa Nova has non stop hiccups. The hiccups are so bad, that Alexa's social life is suffering. During a standard exam, Lily finds a correlation between Alexa's asshole being fondled and the hiccuping seising. To Marvel at their discovery, Lily and Alexa head over to Ella Nova's office to demand a Prize for their discovery. Ella needs to see if this is for real so all three ladies head back to the clinic for some deep Anal penetration. Lily soon discovers that she will not be able to permanently cure hiccups unless she can get these girls' asshole left gapping open. Lily gets Ella and Alexa's asshole to open wide. She puts the entire Slink deep into each girls asshole. She even DP's Ella with the Slink and her arm. The Novas are spectacular in their anal abilities. Both girls are strap on fucked and cured of hiccups. Anal Fisting tends to lossen the butthole up. The girls are left with gapping assholes and no hiccups.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Alexa Nova",
      "person_id": 57359
    }
  ],
  "release_date": "2017-01-13",
  "scene_id": 41305,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "buttplug",
    "Dildo",
    "Director's Picks: Ariel X",
    "Dominatrix",
    "Fisting",
    "Gaping",
    "Lesbian",
    "LezDom",
    "Prolapse",
    "Role Play",
    "slink",
    "Straight",
    "Strap On"
  ],
  "title": "DP with Giant Slink AND an ARM, The Nova's are Anal Stars!"
}