{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "Petite, all natural newcomer, Mercy West, gets all her small holes turned inside out in her very first gangbang ever! Once Mercy gets around 5 cocks all at the same time she’s uncontrollable and depravity drips from every orifice.\n\nIn this fantasy based in the 1970’s, Mercy plays a journalist who’s on the verge of getting fired from her job unless she can get the scoop. She decides to go undercover as a dude and investigate drug use in the California basketball league. She fools them at first but by a stroke of luck the coach catches Mercy naked in the shower and she’s got tits! He spanks her cute round ass raw and demands she confesses everything to him and the team. They man handle her and slap their dicks all over her face and down her pretty little throat until strings of saliva are dripping from her chin. This little spinner is thrown from cock to cock with anal and double penetration. She’s a total ravenous whore and her ass opens up wide to form a nice big gaping hole. Then the bitch is covered in 5 huge loads of cock juice until she’s completely dick drunk!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "D. Arclyte",
      "person_id": 59025
    },
    {
      "name": "Mercy West",
      "person_id": 56853
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Owen Gray",
      "person_id": 39181
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Will Havoc",
      "person_id": 46285
    }
  ],
  "release_date": "2016-12-28",
  "scene_id": 41341,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "First Gangbang",
    "foreskin",
    "Gangbang",
    "Gaping",
    "Latinx",
    "muscular",
    "natural boobs",
    "Petite",
    "Role Play",
    "Rough Sex",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "Petite journalist gangbanged into a gaping anal slut!"
}