{
  "collections": [
    "Device Bondage"
  ],
  "description": "Claire is a world renowned BDSM player, a switch with a history of working with cyd that spans several years and multiple companies. From a scene where she asked cyd to punch her to orgasm with lead weighted gloves to another where he pierced her with over a hundred needles and attached them to tension rods, immobilizing her in a 360 degree sphere around her, it's clear she gets off on extreme restraint and severe bondage. She smiles when she hears what her shoot has in store. Claire projects strength and self-confident in her actions. She is disciplined in dealing with pain and discomfort. cyd likes nothing more than peeling back her protective layer bit by bit, to where the poker face melts off and the vulnerability runs wild.\nA seductive latex striptease is follwed by an examination of some new piercings. Claire is made to lock herself in a collar and handcuffs. Her movements are confident and it is obvious that she wants to please. She is chained to the ceiling with her neck and wrists in a fiddle. She struggles in her heels to get away from the cane, her ankles held wide apart by a spreader bar. cyd offers to stop the pain if she can stay still for only ten strokes, but soon another bargain is made - relief in one spot in exchange for more pain in another. The removal of her shoes makes her predicament more difficult to endure, but Claire is stubborn. She claims it\n\"doesn't suck enough yet.\" Music to cyd's ears, after working with an endless list of porn girls with no submissive or masochistic interest in BDSM at all.\nAfterwards, her reward is the vibrator and her breathing becomes rasping gasps and screams as she comes. Claire's eyes show only her will to endure as she struggles to make it through her ordeal astride a wooden pony and she manages to come hard from an amazing chest slapping session. Another uncomfortable contortion, followed by a flogging, a butt plug and inflatable dildo complete this set. Although she screams and begs, Claire will never tell you to stop.",
  "directors": [],
  "models": [
    {
      "name": "Claire Adams",
      "person_id": 378
    }
  ],
  "release_date": "2009-08-27",
  "scene_id": 4134,
  "tags": [
    "BDSM",
    "Bondage",
    "Collar",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Fingering",
    "Flogging",
    "gloves",
    "Handler",
    "Humiliation",
    "Latex",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "Redhead",
    "shaved",
    "Slapping",
    "Straight",
    "Submission",
    "switch",
    "Vibrator",
    "white"
  ],
  "title": "Devil's Bargain"
}