{
  "collections": [
    "Whipped Ass"
  ],
  "description": "House Slaves' Revenge: Part 2 -\nBONUS UPDATE! Newly liberated house slaves, Mona Wales and Cherry Torn waste no time getting their revenge on their previous Mistress, Sally Snatch. Sally is cuffed, collared, dressed like a maid, and ready to serve! Mona and Cherry slap, punch, beat, spank, and bite Sally everywhere -- her nipples, her chest, her stomach, her thighs, her wet little cunt. Sally apologizes for her previous behavior and laps at Mona's boots like a willing little pet as Cherry flogs her cute ass. Next, Mona and Cherry tag team Sally's ass and spank every square inch of it. Sally licks Cherry's pussy while Mona plays with her cunt and continues to spank her ass, making it rosy and red. Then her two Mistress' chain Sally to the St. Andrew's cross and cane her belly and thighs, leaving crisp red stripes. Sally is a true pain slut, getting off to being powerless and beaten as Mona rubs her throbbing cunt. Now it's time for Sally to get to work and service both her Mistress'. Sally is tied down as Mona rides her face and Cherry crops her all over. Writhing in pleasure and pain, Sally begs Mona and Cherry to touch her cunt as both Mistress' beat her and come all over this eager slut's face. But Mona and Cherry aren't done yet. Sally worships her owners' feet and takes their strap-on cocks deep in her pussy. Sally loves getting fucked and begs to get filled in her dirty little ass, so Mona and Cherry double stuff this slut from both ends! Cherry rides Sally's ass while Sally greedily sucks her filth off Mona's cock. Sally's insatiable sluttery has her begging for more as Mona and Cherry fuck, flog, and torment her as she once did them. Payback is a bitch!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Sally Snatch",
      "person_id": 59902
    }
  ],
  "release_date": "2017-07-03",
  "scene_id": 41364,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Pain",
    "Pain Slut",
    "Pussy Eating",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tag Team",
    "Tattoo",
    "white"
  ],
  "title": "House Slaves' Revenge: Insatiable Painslut gets beaten and fucked!"
}