{
  "collections": [
    "Strapon Squad"
  ],
  "description": "If you're caught up with one of our favorite sub sluts Sheena Rose, she came back for another go with our BDSM Mistresses, hoping for a challenge. Well, she's still in the dungeon, her rope bondage fun still in session. Mila Blaze has invited one of the best lezdom hotties we have here at Strapon Squad, Brooklyn Daniels. They want to fulfill their promise of offering an experience like no other. They've left Sheena's wrists tied to the wall, breasts tied, waist tied to a post behind her, leaving her standing and vulnerable. Her pussy is begging for a big cock to fill it up. She knows we have all sizes, yet don't control the massive thick rubber dildos attached to Brooklyn and Mila's strapons. The duo shake her up, push her around, test out the ropes keeping her place. They slap her tits, spank her, trying to make her fall. The lube comes out and shines up the rubber dicks for an easy slide in and out of Sheena. They take turns fucking her rough and hard, pounding every inch inside her, making her take it like a good sex slave. Their dicks on a stick reach Sheena's mouth and cunt perfectly, a fun double penetration amongst all the hole usage. Everything goes down her throat and pink slit deep, pulling out plenty of slobbery spit and vagina juice. Seems this lesbian domination threesome is wearing Sheena out. Will this be the day she's broken? Only one way to find out.",
  "directors": [],
  "models": [
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    },
    {
      "name": "Sheena Rose",
      "person_id": 52312
    }
  ],
  "release_date": "2017-08-08",
  "scene_id": 41360,
  "tags": [
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "Corporal Punishment",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Femdom",
    "Flogging",
    "gloves",
    "Hair Pulling",
    "Hand Gagging",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Redhead",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "the wall",
    "thirdparty",
    "Threesome",
    "white"
  ],
  "title": "Sheena Rose Endures More Domination from Mila Blaze & Brooklyn Daniels"
}