{
  "collections": [
    "Bound Gods"
  ],
  "description": "Hot muscular athlete Brian is exhausted from his workout and just wants to take a nice hot shower away from the prying eyes of the creepy janitor, but Brian's smooth tanned naked body is just too much to resist! The janitor jumps on Brian, slamming him up against the lockers and tying his wrists before throwing a collar around his neck and shoving an anal hook deep in his tight resistant asshole. After a thorough paddling and face fucking, Brian is strung up against the showers and flogged mercilessly until the janitor adorns his writhing body with numerous clothespins, taunting him and teasing the clothes pins with his hands as a gagged Brian groans and curses in waves of pinching agony. Just as Brian is getting used to the pain, the janitor fires up the hose and subjects Brian to a merciless stream of freezing water straight on the clothes pins! Our soaked captive is then drug into the sauna and bound precariously in the middle of the room, where he faces even more torment in the form of the janitor's massive cock in his mouth and ass and hot wax all over his chiseled chest, washboard abs and even on his tongue! Once the janitor has blown his load all over Brian's face, he stashes him in with the dirty laundry so he can play with his poor victim again and again!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brian Huggins",
      "person_id": 59207
    },
    {
      "name": "Christian Wilde",
      "person_id": 21037
    }
  ],
  "release_date": "2016-12-29",
  "scene_id": 41418,
  "tags": [
    "anal",
    "ass hook",
    "bdsm",
    "blowjob",
    "bondage",
    "chastity device",
    "clothespins",
    "collar",
    "Corporal Punishment",
    "domination",
    "flogging",
    "gay",
    "Hot Wax",
    "humiliation",
    "Male Sub",
    "master",
    "paddling",
    "pain",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "Smooth",
    "straight",
    "submission",
    "Waterboarding",
    "Wax Play"
  ],
  "title": "Straight Boy in the Locker Room is Abducted and Fucked!"
}