{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Ravenous Anal Slut Slaves are turned out and rode hard at the annual Kinky Halloween Ball. Sadie Santana and Amara Romani are perfect material for trainee submissive: eager to please, explosive orgasms, and perfect toned bodies. Their senior slaves are both well seasoned service whores, but neither have unlocked their anal capabilities, leaving the House with the question of how one teaches something they do not yet do themselves? Luckily the language of raw sexual desire and complete sexual submission is understood by all, and Kasey and Ember have their trainees trembling with well earned anal orgasms soon into the evening. Other moments to look forward to are Sadie Santana being introduced to the concept of orgasm control and The Sybian at the same time, Kasey Warner's tiny ballerina body rammed with hard cock under the cane, Ember Stone resuming her lesbian devotion to a cruel Aiden Star holding a strict crop, and sweating screaming begging Amara Romani being fucked in the ass in tight bondage doing anything she can to hold her orgasms back. Meanwhile, the crowd is spectacular tonight, riding the fucking machines, suspended and single tailed in tight shibari, shocked into orgasm with strange machines, submissive blowjobs, and plenty of swingers fucking on every available surface. Please enjoy.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Amara Romani",
      "person_id": 59034
    },
    {
      "name": "Ember Stone",
      "person_id": 58670
    },
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Kasey Warner",
      "person_id": 56865
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Sadie Santana",
      "person_id": 53272
    }
  ],
  "release_date": "2016-12-30",
  "scene_id": 41429,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "Female Slave",
    "halloween",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Squirting",
    "Straight",
    "Submission",
    "Swingers",
    "Sybian",
    "The Pope",
    "Threesome",
    "toned"
  ],
  "title": "Anal Slaves Serve Kinky Costume Ball"
}