{
  "collections": [
    "Bound Gods"
  ],
  "description": "Greedy bathroom-pig Connor is perched in a grungy stall in the public bathroom anxiously awaiting more steaming golden showers when Max comes in, armed with a giant cock and an extra full bladder. Max drenches Connor, letting his fluids stream down the dirty sluts body and into his steadily filling funnel gag before dragging his filthy new plaything out of the stall and throwing him to the floor. After shoving his crotch in Connor’s face and throat fucking him with his thick hard cock, Max spanks and hand gags Connor while playing with his tight pink asshole, enjoying Connor’s screams as they echo throughout the bathroom. Connor is then tied up tightly and flogged mercilessly while gagging on Max’s dick, his own spit dribbling down his body as he struggles helplessly. Finally Max decides it’s time to give his boy his just desserts, and fucks him hard and fast against the urinals until Connor blows his load all over Max’s boots. After Connor has licked all of his cum off of Max’s boots, he sucks and worships Max’s cock until he’s rewarded with a huge thick load all over his face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Connor Patricks",
      "person_id": 47357
    },
    {
      "name": "Max Cameron",
      "person_id": 57500
    }
  ],
  "release_date": "2017-01-12",
  "scene_id": 41423,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "Hand Gagging",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Piss Play",
    "Piss Play",
    "Public",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Hung stud finds a dirty bathroom pig to worship his giant cock"
}