{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The witching hours of our annual Halloween BDSM ball were chocked full of beautiful local BDSM players riding the fucking machine, taking floggings from their Master's and fucking on all the furniture. Meanwhile our nympho house slave Amara has her hungry little pussy clamped wide open to the floor as her senior slave Ember strains in tight bondage and begs loudly for hard cock. The sadistic Governess torments poor Amara's exposed clit with a crop until she is desperately begging to learn the house rules so that she may cum from the pain Aiden Starr delivers. Anal slave babe Sadie Santana endures one of the hardest sex suspensions we have seen to date by our visiting Master, The Pope. She has her gorgeous holes stuffed with hard dick while her senior slave keeps her on task with titty torment and lots of pussy licking. The night culminates in all the horny locals gathering in one room to see our bartender Pink made to cum against her will with sweet little slave girls lapping at her nipples, the depraved anal slut slaves riding and waiting their turn to orgasm. From there the anal fisting of Amara and all slaves on the floor begging for cum for their Governess is an image that will haunt our fantasies for a long time.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Amara Romani",
      "person_id": 59034
    },
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Sadie Santana",
      "person_id": 53272
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Kasey Warner",
      "person_id": 56865
    },
    {
      "name": "Ember Stone",
      "person_id": 58670
    }
  ],
  "release_date": "2017-02-03",
  "scene_id": 41430,
  "tags": [
    "Anal",
    "Anal Fisting",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Director's Picks: Ex Libris",
    "Discipline",
    "Female Slave",
    "Fisting",
    "halloween",
    "Humiliation",
    "master",
    "Oral Sex",
    "Orgy",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Suspension",
    "The Pope",
    "Threesome"
  ],
  "title": "Evil & Hot Halloween Orgy"
}