{
  "collections": [
    "Everything Butt"
  ],
  "description": "Sheena Rider is a bad ass biker bitch looking to impress the Biker Bar Boss Lady, Lea Lexis, by bringing in a cute innocent prospect for the biker gang. Sheena proudly drags in a super cute, tiny Asian wanna be tough girl into the lesbian biker bar in hopes of impressing the mean Boss. Lea is intrigued by the adorable little asian prospect, dressed in a red leather jacket and slutty biker girl clothing. The Biker Gang is quick on getting little miss Marica Hase undress, her bottom stripped naked and bent over a bar stool. Lea and Sheena take turns spanking Marica's cute bubble butt. They put a hook in her ass and make her take anal punishment while she's made to eat and sniff ass. Marica wasn't expecting this kind of a Hazing but she's willing to do what ever it take to make it in to the lesbian biker gang. Since Marica's butthole is too tiny to impress Lea, Lea demands that Sheena get on all fours to show Marica what kind of a gapping asshole she expects out of her affiliates. Sheena take one for the team taking big toys and fingers in the ass. She wants to impress her boss so badly that she even tries to take Lea's entire fist. She struggles and grunts, groans with pain and pleasure. She sweats through the struggle but never gives up. If Sheena can impress Lea, the Lea will allow Sheena to try to get her fist into the little butthole of Marica Hase. Marica must take things really slow as Sheena prods her asshole with fingers and hand. Marica loves pushing herself. She is in ecstasy has Sheena fingers her asshole. Lea lexis isn't impressed with the fisting the girls take so she breaks out her strap on and fucks each of these girls until they are cumming all over each other. The girls are tormented with hard dildo cock being rammed in and out of the already abused buttholes.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Lea Lexis",
      "person_id": 17836
    },
    {
      "name": "Marica Hase",
      "person_id": 44408
    },
    {
      "name": "Sheena Ryder",
      "person_id": 35620
    }
  ],
  "release_date": "2017-08-11",
  "scene_id": 41457,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "Asian",
    "buttplug",
    "dildo",
    "dominatrix",
    "fisting",
    "gaping",
    "leather",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "prolapse",
    "spanking",
    "straight",
    "strap on"
  ],
  "title": "Beautiful Asian Biker Babe Prospect gets an Anal Hazing from Bikers"
}