{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Hot MILF Simone and her little blond step-brat for the week end Chloe Couture are at each other's throats. Ramon recognizes the need for some good old fashioned discipline, reminding Simone that she has a brat streak a mile wide and also deserves to be grounded. Making the mistake of using teeth during a blowjob lands Simone face down not the floor, ass red from a serious paddling, apple shoved in her slutty mouth, face covered in squirt, fucked on the breakfast table until she is begging to cum. Licking her squirt off of his shoe Simone finally looks like the content submissive whore that she can be.\nChloe meanwhile uses her little pink pussy to try to get her way out of being grounded, but Ramon clips that little slit shut and fucks her mouth instead. Properly spanked and screaming for mercy, Chloe has her pussy released just enough so that she can have her deep red ass bouncing on Ramon's cock. Simone is hardly impressed when she find's her step-daughter trying her best to please a real man's dick and shows her little brat how to really work a cock. Tied up tight like a little slut, Simone get's her round ass fucked while her step-daughter vibes her pussy and beg's to be taught the house rules, cleaning Simone's ass off Ramon's cock for every wrong answer. Tired of sloppy mistakes Ramon brings out the cattle prod electro torments his little blond angels until he is pleased with answers and fucks Chloe's tight little ass tied in bondage while Simone teaches her how to take it.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Simone Sonay",
      "person_id": 34687
    },
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    }
  ],
  "release_date": "2017-03-07",
  "scene_id": 41578,
  "tags": [
    "Anal",
    "BDSM",
    "blond",
    "Blowjob",
    "Bondage",
    "Boot",
    "Cattle Prod",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Humiliation",
    "master",
    "MILF",
    "Oral Sex",
    "Paddle",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Threesome"
  ],
  "title": "Daddy's Discipline"
}