{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Penny Barber is Ultimate Surrender’s favorite big tittied MILF who loves to get fisted. Mona Wales is Ultimate Surrender’s Favorite leggy blond bombshell who loves to be fucked hard and humiliated. This match is exciting back and forth action with grapevines, giftwraps, sweeps, reversals and hard core competitive action at all times it’s hard to know who will be the winner by the end of the match. One thing is for certain, no matter what the outcome, Penny Barber is going to get fisted. Mona wales weighs all of 114lbs while Penny Barber is 145. There are no weight divisions in the Big 10 tournament. It’s just raw talent put on display in 100% real competitive erotic wrestling. Will the long bendy legs of Mona Wales be able to sweep Penny Barber and gain control, or will Penny Barber use her infamous giftwrap hold to disable her opponent and have her way with her? The action is back and forth. Both girls finger each other relentlessly. One girl gets the other to cum on the mats against her will with a coveted Orgasm on the Mat maneuver!. The winner gets to do what ever she wants to the loser. Winner face fucks the loser, throw her into doggy and fucks her pussy while she shoves a thumb up the losers ass. Loser is face sat until the Winner CUM!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    }
  ],
  "release_date": "2017-07-05",
  "scene_id": 41606,
  "tags": [
    "Anal",
    "blond",
    "Blonde",
    "Brunette",
    "Domination",
    "Dominatrix",
    "erotic wrestling",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "MILF",
    "natural boobs",
    "Pussy Eating",
    "shaped",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Close Match. One Wrestler Almost Makes a Cum from Behind Victory"
}