{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "This is ass vs. Tits today. We have two of our most powerful welterweight wrestlers on the mats today. The big ass, beautiful MILF latina, Izamar is ranked #1 in our tournament for the summer. She is taking on our #4 ranked wrestler, the beautiful, voluptuous red head with big bountiful tits, Bella Rossi. This match gives us something we dont' see a lot on Ultimate Surrender. A vet is made to cum with an orgasm on the mat. The score is close and after a technicality, the winner is determined. The winner puts the loser in bondage, ties up the losers tits with her wrestling bands. The loser is fully naked and humiliated with Spanking, Hair pulling, Fish hooking, Hand gags, choking, face slapping and hard strap on fucking. The technicality leads to some interesting antics and the winner and loser are giving the opportunity to have a good ole fashion, lesbian sex fight, using their bodies to make their opponent cum. The two girls trib fuck each other until they both are exhausted from orgasms.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    }
  ],
  "release_date": "2017-07-26",
  "scene_id": 41607,
  "tags": [
    "Anal",
    "Big Ass",
    "Big Tits",
    "Bondage",
    "Brunette",
    "Choking",
    "Curvy",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Hair Pulling",
    "Humiliation",
    "Latin",
    "Lesbian",
    "LezDom",
    "MILF",
    "muscular",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "sex fight",
    "shaved",
    "Slapping",
    "Spanking",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "top",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Big Round Latina Ass vs. Big Red Head Tits"
}