{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Kelli Lox has been a long time, loyal minion for her mistress of the night, Jet Setting Jasmine. Jasmine is a sexy ebony vampire who recruits Kelli Lox into bringer her fresh young blood to suck. Kelli has been so loyal for so long and she’s getting eager for Jasmine to turn her into a vampire but Jasmine just never thought Kelli was worthy. When Kelli reveals a few secrets of her own to Jasmine, Jasmine, lust for blood and orgasms are insatiable. Jasmine ties up her long time assistant who is dressed in skin tight red and black latex that compliments her perfect lean body. Jasmine reveals Kelli’s huge pulsating cock. All the blood pumping through Kelli’s cock drive’s Jet setting jasmine insane. She sucks on the cock and gets her undead pussy ready to take the whole pounding cock. Jasmine takes off her corset and moves her fishnet body stocking away just enough for Kelli’s cock to slide in and out around it. Jasmine rides Kelli’s hard throbbing cock until both ladies cum hard. Knowing how special Kelli is, Jasmine is going to finally turn Kelli so these two hot lesbian vampires can suck each other off all the time. Hot bondage blowjob followed by passionate fucking!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Jet Setting Jasmine",
      "person_id": 59795
    },
    {
      "name": "Kelli Lox",
      "person_id": 37743
    }
  ],
  "release_date": "2017-07-31",
  "scene_id": 41618,
  "tags": [
    "Athletic",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cock Worship",
    "Corset",
    "Ebony",
    "Latex",
    "Lesbian",
    "muscular",
    "natural boobs",
    "Role Play",
    "shaved",
    "Straight",
    "switch",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Beautiful Mistress of the night has a thirst for Virgin Blood"
}