{
  "collections": [
    "Everything Butt"
  ],
  "description": "Lea Lexis is a classy house wife. She likes her things to be perfectly clean and in order. When her sink gets clogged, she has to call up a plumbing service to get some help. Lea Lexis is very particular about any of the service she gets in her beautiful, Palatial estate. Lea requests a plumber with a good clean ass who smells good and who will not show up with her buttcrack hanging out. Lea Lexis can not handle plumber asscrack at all. It drives her absolutely insane. When her beautiful ebony plumber arrives, things seem to be going very well, until Daisy Ducati ( the plumber) bends down to check out the pipes and exposes her buttcrack. Lea Lexis must take this matter into her own hands and she must punish the bad sexy plumber for not listening to instructions. Lea Lexis take the beautiful, red headed plumber into the master bedroom for some extreme anal fun. Daisy's pants are dropped down right below her plump tan buttchecks so that Lea can spank Daisy and insert fingers into Daisy's asshole. Then Lea pops a solid heavy metal toy in and out of Daisy's tight little asshole until that asshole is no longer tight rather is left with a tiny little gape. Now that Daisy's asshole is gaping, Lea knows she can put her fist right into Daisy's accommodating butthole. Lea then needs to set an example for Daisy. Lea makes Daisy put a big toy into Lea's asshole and then lick it clean. The toy is popped in and out and each time it comes out of Lea's beautiful, perfect asshole, Daisy licks it clean. Now that Daisy can taste what kind of an asshole Lea is expecting Daisy to have, Daisy can please Lea by taking a good hard anal strap on fucking",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Lea Lexis",
      "person_id": 17836
    }
  ],
  "release_date": "2017-07-28",
  "scene_id": 41613,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Big Toy",
    "Blonde",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Ebony",
    "Gaping",
    "Lesbian",
    "LezDom",
    "master",
    "mixed",
    "natural boobs",
    "Prolapse",
    "Redhead",
    "shaped",
    "shaved",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Lea Lexis Orders a Plumber to fix her sink and the Lea lays pipe."
}