{
  "collections": [
    "30 Minutes of Torment"
  ],
  "description": "Brian starts against the wall, his cock already bulging out of his underwear before Sebastian tears them away. He starts Brian with some light CBT before pounding away on the stud’s chest with leather gloves. It’s not until the flogger comes out that Brian starts screaming from the pain, before moving onto the pit.\nBrian is sprawled out and exposed for Sebastian to work him over with a caning. With a few good stripes down Brian’s legs, Sebastian decides to add a series of clothespins to his chest to match. Brian can hardly handle the pain as the cat-o-nine tails whips against his flesh, so Sebastian rips the clothespins off and beats down the tender flesh before finishing him with one more whipping.\nBlindfolded and bound to the ass-less chair, Brian drools all over himself as a spider gag pries his mouth open. He feels the sting of the electric zapper prodding him all over his body and on his exposed ass. Sebastian then jams his hand up Brian’s ass and fucks him without mercy. With a hand in his ass, Brian screams at the top of his lungs while being finished off with the zapper for one more round of abuse. After all three challenges, Brian has his cock milked until his cum is sprayed all over the floor.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brian Bonds",
      "person_id": 33737
    }
  ],
  "release_date": "2017-01-27",
  "scene_id": 41626,
  "tags": [
    "Anal",
    "Athletic",
    "Belly Punching",
    "blond",
    "Bondage",
    "Brutal Punishment",
    "Caning",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Electrical Play",
    "Extreme Torment",
    "Foot Torment",
    "Gag",
    "Gay",
    "gloves",
    "Hairy",
    "Handjob",
    "Handler",
    "Leather",
    "Leather Gloves",
    "Male Handler",
    "Mouth Spreader",
    "Nipple Torment",
    "Pain",
    "Rope Bondage",
    "spider gag",
    "Stud",
    "switch",
    "the pit",
    "the wall",
    "top",
    "unshaved",
    "versatile",
    "Whipping",
    "white",
    "Zapper"
  ],
  "title": "Brian Bonds takes the 30MT Challenge!"
}