{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Dahlia Sky is a fucking dream wife: submissive, gorgeous, and a voracious anal slut. Plucked fresh from the sex slave stock of The Upper Floor, she finds herself back again a year later with her Dominant to retrain. Married life has made her lazy in her submission and the epicly hot and toned Kira Noir is on staff to show her how to beg, crawl, and earn her way back onto her husbands cock.\n\nOur submissive heroine is subjected to a body inspection and interrogation. Does she think she is above earning her husband’s cock and attention? Loaded down with heavy weights, cropped, and made to sweat and beg as she watches Kira happily gorge herself on her husband’s cock, Dahlia really let’s her submissive desire take hold as she cries out and truly degrades herself. Allowed to taste cock out of Kira’s mouth and drool, she obediently waits until her husband is ready to fuck her beautiful face. He rails her hard while she licks Kira’s pussy and makes her trainer cum over and over again.\n\nDisallowed from cumming without permission Dahlia is placed in extreme partial rope suspension. Her husband takes her ass with his cock while Kira greedily waits to slurp up his dick anytime it comes out of Dahlia, amusing herself with shocking Dahlia whenever she must wait too long. The only way Dahlia is allowed to cum is when she lifts her foot, submitting to full painful suspension and cumming in the air like a little fuck puppet. Having cum more than a girl should in training, she is placed on sex toy duty while Tommy takes Kira’s perfect ass and makes her cum over and over in tight bondage. Dahlia may only amuse Kira’s pussy and clean up her husband’s cock when requested. Kira shows us what a good girl looks like as she thanks Tommy for her beating and heavy anal fucking over and over again.\n\nLast scene of the day finds both sluts in a playful nipple clamp and slap fight for Tommy’s cock, with Dahlia reigning victorious and submissive, riding high on her husband’s cock and making Kira eat up all the cum from her pussy.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Dahlia Sky",
      "person_id": 45819
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2017-04-18",
  "scene_id": 41636,
  "tags": [
    "Anal",
    "BDSM",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Discipline",
    "drool",
    "Female Slave",
    "Humiliation",
    "Latinx",
    "master",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "Tattoo",
    "Threesome",
    "toned",
    "Weights",
    "white"
  ],
  "title": "Duties of a Submissive Anal Wife"
}