{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Most divorces are messy, but this BDSM love affair gone awry is a sexual black hole sucking in everything in its path, including nubile and curious Mediator Joseline Kelly. Mona Wales is a sexy and anally submissive wife, scorned by her dominant husband and out for revenge. When Joseline grows curious about what fuels the white hot fire of their arguments she opens the door to her new life as a owned submissive, throat fucked, made to beg, weighed down with nipple clamps and cumming on the floor like a craven slut. Caught by Mona in the Master bedroom, Joseline become a confused little pawn, spanked, mind fucked, hate fucked by Mona. The final day of the divorce, Joseline caught between sides until the warring couple put aside their differences in interest of playing with their new toy together. Blow job training, slobber, degradation and belt bondage are just the beginning for Joseline. With a face full of her new Mistress' pussy she screams and is pumped full of cock. Turned over, she is introduced to hot wax and flogging for the first time ever, just before being used as a little fluffed for Mona who is hot and ready to climb back on her husbands cock for the first time. The rest of the day is anal punishment fucking for Mona in intense bondage while Joseline plays a constant guessing game of which Dominant to listen to. Mona squirts on her husbands dick over and over while having intense breath control orgasms and tight zippers, only taking breaks to mount her new little toy on Tommy's cock and shock her repeatedly until she properly begs for cum like a little sex toy should.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Joseline Kelly",
      "person_id": 58721
    }
  ],
  "release_date": "2017-05-16",
  "scene_id": 41637,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Couple",
    "Director's Picks: Ex Libris",
    "Discipline",
    "Electrical Play",
    "Extreme Torment",
    "Female Slave",
    "Flogging",
    "Hot Wax",
    "Humiliation",
    "master",
    "Nipple Clamps",
    "Nipple Torment",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Threesome",
    "white"
  ],
  "title": "Crazy Couple Torments & Trains the Divorce Mediator"
}