{
  "collections": [
    "The Upper Floor"
  ],
  "description": "In part two of this salacious holiday season insatiable Kimber Woods earns her collar in an epic display of anal submission and oral degradation in tight bondage. Riding her slutty little face is senior slave Roxanne Rae, her pert nipples painfully clamped and held on a short leash by the Governess Aiden Starr. Both sexy submissives are rode hard as Kimber has all her holes fucked and learns to beg and get permission for her orgasms like a good girl. Roxanne wait for cock fresh from her sister slave’s tight holes and licks up all the cum.\n\nMeanwhile, the rest of the floor is filled with sexy swingers riding the fuck machines to capacity, fucking on the couches, suspended in the air in sadistic shibari, single tailed, flogged, spanked and used. Everyone is truly letting loose for the holidays and the sounds of pleasure and pain fill the room. The Steward has a present for Dan’O’Rama: It’s Iona Grace wrapped as a present to be unwrapped with a single tailing. Iona is as beautiful and well behaved as her previous years as a house slave and makes her mouth available for deep throat fucking and takes her dragon tailing and flogging like a champ in a bit of predicament bondage.Â\n\nIt seems to us that Kimber can take even more than her first challenge, so the Governess straps up and gives that bitch a large dildo in the ass while Xander uses her pussy. As Kimber endures her double penetration to the crowds screams and delight, Roxanne shoves her pussy in Kimber’s face and demands oral service as she takes her punishment from the The Steward. The result is a wet and wild orgy with plenty of anal, pussy licking, and a huge holiday load for the grateful house slaves.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Kimber Woods",
      "person_id": 54178
    },
    {
      "name": "Roxanne Rae",
      "person_id": 50987
    },
    {
      "name": "Xander Corvus",
      "person_id": 46000
    }
  ],
  "release_date": "2017-05-30",
  "scene_id": 41659,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Dildo",
    "Discipline",
    "Double Penetration",
    "Facesitting",
    "fake boobs",
    "Female Slave",
    "Flogging",
    "holidayparty",
    "holidays",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Orgy",
    "Pain",
    "Predicament Bondage",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "Swingers",
    "switch",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Horny Whores Holiday Orgy"
}