{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Petite 19 year old Holly Hendricks is heart broken after another bad college affair and is home to receive solace and advice from her MILF Step-Mom, Syren de Mer. Nuzzled in her female role models huge tits she confesses she never wants to see another boy again and maybe isn't cut out for this dating thing. Syren nods knowingly, consoling Holly as she rubs her slutty thighs together and waits desperately for Holly to leave so she can go back to fucking her sadistic Butler Xander Corvus.\nOnce Holly is tucked safely back in her room, Xander sets in on his buxom prey, tying Syren's huge tits up tight and tormenting her nipples with the terrible clover clamps. Howling for mercy, Syren has her mouth filled with hard cock and her pussy clamped as well. Thrown over the family pool table and caned, anally violated, and made to cum Syren is finally put in her rightful place as a submissive anal whore.\nHowever, Xander has not had enough until he posses both women in the family and sets about seducing an indignant Holly, whose tight body and curious mind betray her in the end. Agreeing to try out the blindfold and give up control for a moment, Holly finds herself wailing under a downpouring of hot wax on her tiny pert nipples, a storm of flogger hits, and throat full of hard cock. Handcuffed, she can only try to hold the position against the onslaught and contain her delight and surprise when she finds that her beloved Step-Mother is in the room and ready to guide her through her first BDSM sexual experience. The rest of the day is celebration of women training eachother in the art of submission, desire, and sex. An afternoon of anal fisting, hardcore threesome fucking, orgasm control, and it seems that Holly is ready to go out and try dating again as a fully mature submissive slut.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Xander Corvus",
      "person_id": 46000
    },
    {
      "name": "Holly Hendrix",
      "person_id": 58890
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2017-06-13",
  "scene_id": 41652,
  "tags": [
    "19-Year-Old",
    "Anal",
    "Anal Fisting",
    "BDSM",
    "Blindfold",
    "Bondage",
    "Clover Clamps",
    "Corporal Punishment",
    "Discipline",
    "Facefucking",
    "Family Roleplay",
    "Female Slave",
    "Fisting",
    "Flogging",
    "High Heels",
    "Hot Wax",
    "Humiliation",
    "master",
    "MILF",
    "Oral Sex",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Threesome"
  ],
  "title": "Facts of Desire: Petite 19 Year Old Trained by Anal Slut Step-Mom & Sadistic Butler"
}