{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Stella Cox is a long term fan of The Upper Floor and jumped at the chance to be our big titted slut trainee for the day. Wowed by the historical porn palace and TUF staff who are now serving as tour guides, she uses her gorgeous body and submissive manner to seduce our staff into giving her one final anal training at The Armory. As she exchanges flirtations with The Maid in perfect French and runs her curious little hand over the Butler's cock straining against his pants Stella feigns an innocent curiosity, but is betrayed by her devious eyes. Soon the door is locked and she is crawling with her ass high in the air, begging for cock, and having her face buried in the Maid's curvy ass instead.\nLesson One: Tourists don't just walk in and get fucked on The Upper Floor. One must always earn cock. Stella will be earning hers in a terrible squat in hard bondage, her head locked in stocks, a vibrator firmly tied to her cunt, and the simple command to beg for and hold her orgasms. The Maid laughs at her plight while enjoying a deep anal fucking and crop beating from the Butler. She laughs until she finds that in fact she will be paying for all of Stella's stolen orgasms with a strict caning. Stella need only look pretty and scream around Xander's cock fresh from Arabelles ass. However, if she wants that dick she must learn her rules and hold those wild orgasms back like a good girl. Perhaps a bit of electrical discipline will help.\nNext scene finds Stella tied wide open on a chair, getting all her holes plundered by the Butler as Arabelle attempts to teach her Lesson Two: Eyeline. This curious little slut cannot stop looking at people and must learn her place. Luckily she can learn while being double stuffed and tormented by the Maid, but in Scene Three she is not so lucky. The very strenuous bondage has her in a complete strappado, her elbows touching in tight rope, arms yanked far above her head as she is anally ravaged by The Butler. She struggles to learn her Final Rule: Deportment. However The Maid seems hell bent on distracting her with pussy in her face, vibes on her cunt, and verbal humiliation.\nWhat training day would be complete without the trays and a cattle prod? Last Scene finds Stella in a painful squat, astraddle on the Butler's huge Cock, trying to balance trays, her beautiful tits bouncing in rope while she begs and cries and drops tray after tray. No matter, the Maid simple places the items back in her bands and shocks that pussy with the cattle prod while laughing withy sadistic joy. Eventually Stella Earns her collar and a place licking the Maid's pussy as she enjoys one last round of anal orgasms on the Butler's cock. It is indeed a special day, so Stella is treated to a face full of cum and left as every fan girl should be: locked naked in a cage for further use in the future.",
  "models": [
    {
      "name": "Xander Corvus",
      "person_id": 46000
    },
    {
      "name": "Stella Cox ",
      "person_id": 59424
    },
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    }
  ],
  "release_date": "2017-07-11",
  "scene_id": 41653,
  "tags": [
    "anal",
    "AprilFools",
    "bdsm",
    "big tits",
    "bondage",
    "cage",
    "caning",
    "cattle prod",
    "collar",
    "Corporal Punishment",
    "crop",
    "curvy",
    "Director's Picks: Ex Libris",
    "discipline",
    "female slave",
    "humiliation",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "stocks",
    "straight",
    "vibrator"
  ],
  "title": "Gorgeous Fan Girl uses Big Tits to Get The Final Anal Slave Training "
}