{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The decks are stacked for sexual deviance in this Holiday Upper Floor affair. Aiden Star has a greedy TUF fangirl Kimber Woods in her clutches, and that fit little bitch is going to earn every inch of dick. Upper Floor favorite Roxanne Rae is gobbling up cock like it's her last meal while the crowd cheers her on and laughs at Kimber's desperate attempts to shake her ass, beg, grovel, and lick shoes to get the cock. Thoroughly humiliated by the crowd of BDSM swingers is the only way that horny little cunt is getting anything.\nMeanwhile, hot lady guests ride the fucking machines and their Master's dicks. Dominant women spank their subs asses red while some truly inspiring shibari rope suspensions lit the room up. We are gifted with guests of honor Jack Hammer and Barbary Rose who are a real life D/s couple. Jack stuffs Barbary's throat with cock, ties her wide open and punishes her pussy with electrical shocks, slaps, and teases her with orgasm and sex until she is begging for Daddy's dick. Kimber entered her training, but how will she beg her way out of the terrible flogging and crop punishment she has earned by not knowing the rules. Her slutty senior slave Raoxanne is way too busy getting her tight little ass pounded to even notice her slave sister's plight- that is until the cane comes her way...",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Kimber Woods",
      "person_id": 54178
    },
    {
      "name": "Roxanne Rae",
      "person_id": 50987
    },
    {
      "name": "Xander Corvus",
      "person_id": 46000
    }
  ],
  "release_date": "2017-03-31",
  "scene_id": 41658,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Couple",
    "Crop",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Flogging",
    "holidayparty",
    "Humiliation",
    "master",
    "natural boobs",
    "Noose",
    "Oral Sex",
    "Orgy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Swingers",
    "switch",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Holiday BDSM Slut Orgy turns Fangirl to Sex Slave"
}