{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Mean and sultry BDSM Mistresses Mena Li and Brooklyn Daniels spotted hottie and sultry dancer Kimber Woods the other day. That's all it takes around here for a lesbian domination threesome. Kimber ends up on top of the sybian fucking machine, chained down by her collared neck and cuffed wrists. Brooklyn enters the dungeon and flips on the sybian while Mena introduces Kimber to her big black strapon dildo, excavating deep down her throat, practically fucking her skull. Kimber wasn't expecting such huge sex toys. She should have know better. Brooklyn raises the vibration and joins Mena in feeding Woods another 10\" big black rubber dick. The Mistresses take turns intensifying the vibration, distracting Kimber from taking strapon cock face fucking, slapping her face and tits, bobbing her head on their rubber black dicks, pushing her down onto the sybian, clit pulsed with intense vibrations. After multiple orgasms soaked in her own spit, Kimber's ass is lifted off the sybian. Since her neck is chained in place, Woods is kept bent over and ass up. Mena and Brooklyn inspect their sex slave's pussy and asshole, pleased to see pretty pink. Their black rubber dicks will look great against her sweet pink pussy. Double penetration is the perfect test. This first time with her bondage Mistresses training, Woods becomes an obedient sex slave, following every order, taking every inch of cock, rough and deep, begging for forgiveness for being a dirty whore. Kimber stops asking to cum and her Mistresses notice. Time for squirting torment, vibrator and dicks on a stick come, Brooklyn fingering Kimber for a few squirts of pussy juice. Kimber grasps onto her chains begging to cum desperately. Should she? Watch to find out.",
  "directors": [],
  "models": [
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Kimber Woods",
      "person_id": 54178
    },
    {
      "name": "Mena Mason",
      "person_id": 53759
    }
  ],
  "release_date": "2016-12-30",
  "scene_id": 41663,
  "tags": [
    "Asian",
    "Ball Gag",
    "BDSM",
    "black hair",
    "Bondage",
    "Breast Abuse",
    "Brunette",
    "Chains",
    "Collar",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Femdom",
    "Fingering",
    "gloves",
    "Hair Pulling",
    "Hitachi",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "natural boobs",
    "Redhead",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Smothering",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Brooklyn Daniels and Mena Li Train Kimber Woods to be a Sex Slave"
}