{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Some girls need to be handled with caution like a wild animal, and Lydia Black is one of them. She is a sex slave in training, but still appears to operate on basic instincts.. While she is also capable of coherent speech, she seldom vocalizes more than shouts, primal grunts and lusty moans. Like a wild animal, she must also be bound securely with chains to a sturdy set of posts so Master Bruno can assert his total domination over her and bring her to a state of complete submission so is she fit to be around others. He achieves this through various methods such as applying several clothespins to her nipples, slapping her face, spanking her, and making her give him an airtight deepthroat blowjob whenever he likes. When she becomes crazed on his cock, he spanks her pussy to calm her down and fucks her while she is wearing a ballgag and leather blinders. He punctuates his fuck thrusts with hard slaps to her tits and ass. Bruno’s methods are tried and true, but will they work on this hard case?",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Lydia Black",
      "person_id": 60714
    }
  ],
  "release_date": "2017-11-23",
  "scene_id": 41687,
  "tags": [
    "Airtight",
    "Athletic",
    "Ball Gag",
    "big dick",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Chains",
    "Clothespins",
    "Collar",
    "Deepthroat",
    "Discipline",
    "Domination",
    "dungeon",
    "Facefucking",
    "Facial",
    "Female Slave",
    "Fingering",
    "gloves",
    "Hair Pulling",
    "Latinx",
    "Leather",
    "Leather Belt",
    "Leather Cuffs",
    "Male Handler",
    "master",
    "natural boobs",
    "Rough Sex",
    "Slapping",
    "Slave",
    "slim",
    "Small Tits",
    "Spanking",
    "Squirting",
    "Straight",
    "Sub",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Sex Slave in Training: Lydia Black"
}