{
  "collections": [
    "Electrosluts"
  ],
  "description": "Ela Darling is all tied up in Electro-Goddess Arabelle Raphael's lesbian dungeon. She has e-stim sticky pads on her inner thighs and a hunger for the touch of her Mistress. Arabelle begins by finding all her toy's sensitive parts. She tickles and shocks Ela's armpits, and runs the violet wand through her electro-doll's beautiful golden hair. Ela yelps and struggles in her bondage as the violet wand and the zapper make contact with her skin. Goddess Arabelle sits on Ela's face as she continues to zap her doll's milky white skin with electricity. Ela loves licking her Goddess' cunt and pleasures her Goddess to a body shaking orgasm. Arabelle rewards Ela by smothering her in her luscious tits, and shocking her through her nylons with the violet wand. But Ela forgets to ask for permission before she comes and now she's in for punishment. Ela gets fucked in her pretty pussy with the metal Samurai! She screams as the cold metal electro-cock shocks her from the inside. This time, she'll ask permission to orgasm. Ela begs her Goddess for release as the electricity runs through her cunt, and gets to come hard on electricity. After Ela's pussy gets filled and fucked, Goddess Arabelle has her eyes on one last hole -- Ela's asshole. She puts an electric anal plug in her doll's ass and continues to shock Ela all over with the violet wand. Ela loves her Goddess and takes all the electricity so well that her Goddess lets Ela worship her feet. Ela licks Arabelle's feet all over, sucks her toes, and gags as she takes Arabelle's feet as far down her throat as they'll go! Arabelle comes hard as her doll licks her pussy and suffers beautifully for her.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "Ela Darling",
      "person_id": 21149
    }
  ],
  "release_date": "2017-07-13",
  "scene_id": 41700,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "black hair",
    "Blonde",
    "Bondage",
    "Cattle Prod",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "Dominatrix",
    "dungeon",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "Feet",
    "Femdom",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Smothering",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "Tens Unit",
    "Violet Wand",
    "white",
    "Zapper"
  ],
  "title": "Oh My Goddess!: Lesbian Electrosex Domination"
}