{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Violet Monroe and Stefani Special are at a bumping pool party. They got a VIP cabana so they can sit in it and take selfies while the party happens around them, like all the hot chicks do. Violet needs to put some lotion on her porcelain skin and she asks her long time girl to apply apply it. While Stefani is rubbing the lotion all over Violet perfect milky white skin she is getting strangely arouses. Stefani has had a long time crush on Violet but she has never been able to tell Violet. Stefani has a secret she’s been keeping from Violet and she’s not sure how Violet would handle it. Violet decides it’s her turn to apply lotion onto Stefani and tells stefani to show off her hot body a little more. The two girls start to horse play and one thing leads to another and wouldn’t you know it, Stefani’s boner is revealed. Violet is astonished when she see’s her Beautiful girl friend with a big throbbing cock. Violet is first mad that Stefani has been hiding this from her for so long. The heat from outside, The music from the party and the idea that anyone could be watching them gets the two girls extremely aroused and they start sucking and fucking each other. Violet sucks on Stefani’s big cock. Stefani eats Violets pussy. These two are sucking for so long that they miss the entire pool party. Everyone has left the estate and the two girls are left alone to go into the Jacuzzi for some more fun. Stefani pounds Violet in the water. She has heard about Violet’s sex life for so long from Violet herself that she knows exactly what Violet likes. Stefani chokes Violet and fucks her hard until she cream pies into Violet’s pussy",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Stefani Special",
      "person_id": 49148
    },
    {
      "name": "Violet Monroe",
      "person_id": 20284
    }
  ],
  "release_date": "2017-09-11",
  "scene_id": 41767,
  "tags": [
    "Blowjob",
    "bottom",
    "Brunette",
    "Choking",
    "Cock Worship",
    "Creampie",
    "natural boobs",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Pool Party Surprise, Besties explore a secret one has been hiding"
}