{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Chelsea Marie is going door to door selling makeup. She comes to a home, knocks on the door and is greeted by a beautiful, petite latina named Moka Mora. Moka invites Chelsea in to see what makeup she is selling and to get her makeup done for free. After the makeup session, Chelsea is eager to make a big sale. She is positive Moka has a ton of money based off of her home. Moka confesses that she is merely house sitting and that she has no money to buy the makeup. Furious about having her time wasted, Chelsea agrees to accept payment in other ways. Chelsea whips out her cock and makes Moka make payment with a blowjob. After a nice sloppy blow job, the girls wonder into the home owners bed room where Moka give Chelsea a foot job, more blow jobs and they move on to good fucking. Moka bounces on Chelsea's cock with enthusiasm since she's never been with a beautiful woman with a cock before. After some fucking, Chelsea decides to blind fold and put Moka into pink rope bondage where she proceeds to fuck her good and hard until Chelsea is to explode hot woman cum all over Moka. Chelsea teases Moka and has her try to guess where she is going to take the hot load of cum. Moka can not see the cum but she feels it goo onto her pretty, young pussy. Chelsea leaves Moka tied up with cum all over her so that the home owners can see what a bad girl Moka has been while they were gone. Moka is stuck on the bed with a wad of cum cemented into her pubes. It's going to be so humiliating for her to be found, bound and used with wet feet from giving foot jobs.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Chelsea Marie",
      "person_id": 40544
    },
    {
      "name": "Moka Mora",
      "person_id": 59853
    }
  ],
  "release_date": "2017-08-28",
  "scene_id": 41772,
  "tags": [
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cock Worship",
    "Feet",
    "Latin",
    "natural boobs",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Guess Where I'm cuming while you're blind folded"
}