{
  "collections": [
    "Device Bondage"
  ],
  "description": "I‘ve been looking forward to this shoot ever since I left the last one. My previous experience was so deliciously hot that the wait to come back was tormenting. With my neck and wrists in a fiddle and my ankles shackled and chained to back of my neck, pulling my neck head in an awkward angle it begins. I am lying on my stomach, hip bones and elbows digging into the harsh wood and I can’t seem to get comfortable. I try rolling on my side, which makes my elbows feel momentarily better, but I am still straining to find that unattainable tolerable position. cyd begins the interview with me like this and I feel my excitement begin to rise as we discuss the possibilities of the day. I will get to do a scene in my favorite set, a dingy old public bathroom. I am overjoyed at the suggestion of an enema. That kind of humiliation gets me wet just thinking about it.\n\nIt is dark and cramped. I must be in some sort of box. My head is smashed against a wall in front of me and my feet scrape the wall behind me. I am restrained by leather straps which keep my body curled into a little ball. Two dildos protrude from what I can only assume is the wall right behind me. One is shoved deep in my already dripping pussy and the other is stuffed in my ass. The box begins to move, jolting and bumping along as though it is rolling over uneven ground. It sounds like there are things in the box with me, below my head, that are rattling around as we move. I make small noises and try to cry out through the gag in my mouth. Suddenly there is a blinding light. The doors to my little box have been flung open and he appears and begins to pet my head in an almost tender way. He produces a pulley and attaches it to a point in the ceiling. I frown, confused. What could he be planning? I don’t have to wait long to find out, as he hooks the pulley to one of the leather straps binding me and I am quickly suspended from the ceiling, dangling like a piece of meat on a fishing line. Exposed completely and at his mercy. Eventually he lowers me onto a cart, unhooks me, and wheels me away.\n\nTo fulfill my fantasy in the filthy bathroom, I am bound and gagged on the cold floor. It is pitch black, save for one harsh light blinding any hope i may have of seeing my surroundings. He smokes a cigar and waves it around in my face. The excitement of not knowing what will happen next is turning me on to unbelievable extents. Then something is shoved in my ass. It gets frighteningly hot, then cools again. It is thrilling and terrifying all at once, and my excitement grows. I want more. But I am quickly left alone on the floor.",
  "directors": [],
  "models": [
    {
      "name": "Sarah Jane Ceylon",
      "person_id": 12772
    }
  ],
  "release_date": "2007-02-26",
  "scene_id": 4179,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Enema",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Public",
    "Shackle",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "the wall",
    "white"
  ],
  "title": "Boxed Bitch"
}