{
  "collections": [
    "Strapon Squad"
  ],
  "description": "We haven't tried any cosplay in the dungeon with our beloved Strapon Squad. Thankfully we ran into naughty and oh so sexy schoolgirl Alby Rydes, who went straight to the strip club, skipping all her classes. Seems like a perfect thing that deserves a bondage punishment, a job for BDSM Mistresses Mila Blaze and Isa Mendez, a sub slut at heart. But she needs to get some lezdom fun out of her too. Alby Rydes is bound to a desk, dressed in her school uniform, potato sack over her head. She's shaken up and bent over Mila's knee for an old fashion hand spanking. Alby has to count off ten while Isa stuffs her mouth with her big black strapon dildo, one she knows well. Alby seems to be enjoying herself, counting each slap against her ass cheeks, slobbering on Isa's rubber cock. What a good sex slave! Her Mistresses throw her on the floor, face down and ass up for a pussy and asshole inspection done with a vibrator. Alby moans and screams, begging to cum instantly, especially with all the fingers wiggling in her pussy. She needs to feel their big black cocks before she can cum. Mila and Isa take turns pounding her hole in, each turn rougher than the last, making Alby scream in mercy. They pull her up off the floor and bend her over the desk for some double penetration fun, making her beg for their cocks, reciting what a horny slut she is. She's enjoying her dungeon classroom lesbian domination threesome. When they make her ride their rubber dicks, she does it with ease, making sure every inch fits in her pussy. She's then thrown on her back, dicks on a stick pulled out and stuffed deep in her holes, taking them deep down her throat and pussy. When they finally leave, she's left in her own tears, sweat and pussy juice, trying to stop from trembling.",
  "directors": [],
  "models": [
    {
      "name": "Alby Rydes",
      "person_id": 52316
    },
    {
      "name": "Isa Mendez",
      "person_id": 53665
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    }
  ],
  "release_date": "2017-02-11",
  "scene_id": 41807,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Femdom",
    "Fingering",
    "gloves",
    "High Heels",
    "Hitachi",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "Slave",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "Vibrator"
  ],
  "title": "Naughty Schoolgirl Alby Rydes is Punished by Mila Blaze & Isa Mendez"
}