{
  "collections": [
    "Device Bondage"
  ],
  "description": "Shackled to a post, she wriggles around, trying in vain to adjust herself in her uncomfortable crouching position. She likes to play to the camera, exaggerating her movements. When I call her on it, she admits as much. She says struggling is fun. I listen to her talk about herself, distracted; my mind is on what I can do to make this harder for her. I want to make her struggle for real. I tell her to take off her heels so she has to crouch on the balls of her feet. Now she's suffering. She quickly requests the vibrator. I can tell she's used to being in control of her scenes. She won't be in control today. I tell her the vibrator will wait. She can come if she works for it.\nThe discomfort of Darling's initial position is nothing compared to what is coming to her. I play with her flesh, easily reddening and welting its pallor. Finally she's been through enough to earn an orgasm. She'll have to beg for it and describe it before I let her have it though.\nBefore she has a chance to recover, I strap her into a chair I built. It's designed to keep her thighs spread as far apart as humanly possible. She looks lovely in the gas mask I put on her face, and I enjoy hearing her struggle for each labored breath. I place the fucking machine between her legs and listen to her muffled cries. I make her cry and I make her sing. I make her uncomfortable, mark her body, and make her dance for me. She does everything I tell her to. She is obedient because she is aching to come again now....her whole body begs for it.",
  "directors": [
    {
      "name": "Cyd Black",
      "person_id": 12661
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2007-02-22",
  "scene_id": 4181,
  "tags": [
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Mask",
    "Metal Bondage",
    "Shackle",
    "Straight",
    "Submission",
    "Vibrator"
  ],
  "title": "Cockateel"
}