{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "We've come across a young Southern Bell with a hot rocker edge, beautiful curvy body covered in tattoos. She's a bit shy, yet curious of what we have to offer. To sweeten this deal, this is her first appearance in a porn clip. We have the perfect challenge: rope bondage slave training. Sexual Disgrace presents Montana Sky. Montana is tied on top of the sybian fucking machine, arms and legs tied bent, flesh pad right on her clit. Her new BDSM Master enters the dungeon and flips on the sybian while introducing her to hung cock, excavating deep down her throat, practically fucking her skull. Beautiful Sky wasn't expecting such a huge dick for her domination. She should have known better. Her Master raises the vibration and wraps his hands around her neck, choking moans out of her, making her apologize for being a slut while gagging on his cock. The breath play seems to be a turn on for Montana, making her cum on the flesh pad, begging for dick. Her pussy gets creamy from the torment. He raises the sybian higher, slaps her face and tits, bobbing her head on his meat, pushing her down onto the sybian, clit pulsed with intense vibrations. After multiple orgasms soaked in her own spit, Montana is pulled off and placed on her elbows and knees, her ass up in the doggy position. He inspects his sex slave's pussy and asshole, pleased to see pretty pink. Montana has no choice but to be an obedient sex slave, following every order, taking every inch of cock, rough and deep penetration sex, pounding her pussy in, begging for forgiveness for being a dirty whore while making her give him more blowjobs. Montana is struggling through her disgrace. The only way to see if she survives is to press play!",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Montana Sky",
      "person_id": 61352
    }
  ],
  "release_date": "2017-12-21",
  "scene_id": 41854,
  "tags": [
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "brunet",
    "Choking",
    "Curvy",
    "Deepthroat",
    "Domination",
    "dungeon",
    "First Porn Shoot",
    "Latin",
    "master",
    "multiple orgasms",
    "natural boobs",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "southern",
    "Spanking",
    "Straight",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "thirdparty",
    "top",
    "versatile",
    "white"
  ],
  "title": "Montana Sky's First Porn Video in Bondage for the Sybian & Rough Sex"
}