{
  "collections": [
    "Device Bondage"
  ],
  "description": "Leather straps constrict her body in a tight hogtie, face down on the padded box. New to bondage with only a handful of shoots in her past, she’s never experienced helplessness like this. I watch as sweat begins to bead on her face. She’s nervous. She gasps and claims it’s difficult to breathe, but I know she’s lying. She's just desperately seeking a way to gain back some of the control she gave up.\nThe exaggerated gasping doesn’t have the intended effect on me so next she starts pleading, first with her voice and then with her eyes, but that doesn’t work either. I’ve seen this act before. Her feigned suffering makes me want to pull the straps tighter, to show her how easy I’m being on her, to show her how bad it can get, but I resist the urge. For now, anyway. If I'm patient, I can lure her in deeper.\nLater on, with a thick dildo buried deep in her cunt and a vibrator pressed hard against her clit, she gives in to the relentless buzzing and throbbing between her legs. I watch with faint amusement as she easily sucks air into her lungs in long full breaths, her attempts at deception now forgotten. She screams as her body writhes and convulses in orgasm. Her eyes glaze over with pleasure and now she is gasping for real, exhausted from the muscle contractions in her abdomen and thighs. All traces of the fear and hesitation that existed before are gone now, replaced with something else...raw lust. She's hooked, and there is no going back.",
  "directors": [
    {
      "name": "Cyd Black",
      "person_id": 12661
    }
  ],
  "models": [
    {
      "name": "Alexa Von Tess",
      "person_id": 12340
    }
  ],
  "release_date": "2007-02-28",
  "scene_id": 4186,
  "tags": [
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "Muscle",
    "Straight",
    "Submission",
    "Vibrator"
  ],
  "title": "Strapped and Muzzled"
}