{
  "collections": [
    "Electrosluts"
  ],
  "description": "Blonde and blue-eyed Riley Reyes is bound to a St. Andrew's cross, awaiting her Mistress Cherry Torn. No stranger to electricity, Riley is hungry with anticipation and can't wait for Ms. Torn to begin. Cherry starts with the zapper and violet wand touch plate, which allows her to shock her slave merely by touching. Cherry runs her fingers all over Riley, touching all her sensitive areas, including her cute toes. Riley squirms and moans as Ms. Torn shocks her and yelps as she gets zapped. Riley's limits are pushed as Cherry brings out a conductive metal cane and plays Riley like a violin. Cherry also runs a conductive metal pinwheel all over this lucky electroslut, causing sparks to fly as the sharp metal comes in contact with Riley's soft pale skin. All of this pain and pleasure has Riley begging to come as Cherry plays with her wet cunt. Next, Riley is bound, gagged with rope, and decorated with closepins on her breasts and a zipper along her side. Cherry knows exactly what this little slut needs -- a deep electric fucking with the Samurai! Riley's pussy is her first hole to be fucked with electricity, and Riley can't get enough. Overwhelmed by sensation, she begs to come on Cherry's electrified metal cock. But what's pleasure without some pain? As Riley comes hard, Cherry rips the zipper off her slave, relishing the marks the close-pins leave behind. But Riley can't satisfy her Mistress with her pussy alone. Cherry takes her electroslut's ass as well, filling it with cold metal and electric current. Riley comes hard, thanking her Mistress for being so generous. Now it's time for Riley to work! Conductive copper strips circle Riley's legs and are alive with current, shocking the wearer. Riley must work through the pain and service Ms. Torn with her tongue. Cherry rides Riley's face while shocking her with the zapper. Riley licks Cherry's pretty pussy and asshole while Cherry comes hard all over her face. Then Cherry dials up the electricity, and makes Riley come over and over as she vibrates her slutty wet cunt.",
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Riley Reyes",
      "person_id": 55057
    }
  ],
  "release_date": "2017-06-29",
  "scene_id": 41872,
  "tags": [
    "bdsm",
    "blonde",
    "cattle prod",
    "Cherry Torn",
    "Corporal Punishment",
    "dominatrix",
    "electrical play",
    "electricity",
    "electro clamp",
    "electro dildo",
    "electro plug",
    "Face Sitting",
    "femdom",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "Pussy Eating",
    "slave",
    "straight",
    "strap on",
    "TENS Unit",
    "violet wand",
    "Zapper",
    "zipper"
  ],
  "title": "Cherry Torn Plays with her Masochistic Electro-Painslut"
}