{
  "collections": [
    "Hogtied"
  ],
  "description": "What to do, what to do, what to do...with an insatiable slut that hates to be told what to do or to be out of control? The Pope knows exactly how to handle a young slut like Kimber Woods in her first ever Hogtied shoot. Kimber starts her day standing on one leg with the other tied wide open, exposing her tight-teeny-pink pussy. But before anything can begin Kimbers loud mouth and gift of gab first must be taken care of with a classic red ball-gag that shuts her up and makes her finally appreciate the predicament that she has submitted to. The Pope begins to slowly work her over and examines all the parts of her body. He methodically tests how this new slut reacts as his giant hands work her over, adding nipple clamps, slapping her thighs and punching her perfect round ass. This gets her attention. Kimber quickly comes alive and begins to feel The Popes full wrath as he tenderizes her body with floggers and terrorizes her exposed foot with pointed-pain like she has never felt before. The Pope senses her hunger and tests her pussy to see if it has gotten moist. He discovers that it is dripping wet as this pain slut takes what she deserves. Nestled in the loving embrace of his choke-hold, she gasps and quivers has he leads her to repeated hitachi-fueled orgasms. And when she reaches an ecstatic peak The Pope walks away and leaves her in denial. This is about what he wants; her pleasure will be at his discretion if and only if he thinks she has earned it. She then finds herself tied to a chair which leaves her inner thighs and chest exposed to a constant barrage of slapping and hitting. As she reaches a frenzied state from the impact play, The Pope crams a vibrator onto her clit; switching back and forth between pleasure and pain until he finally lets her cum. Having barely caught her breath she then finds herself tied-up in a rigorous suspension that tests the limits of her endurance. The Pope attacks her feet, causing her to squirm and shake, which only intensifies the agony of the predicament. To seal the deal he rams a dildo into pussy and watches with with delight, as he tears a brutal orgasm from quivering whore-hole. Having already run a marathon, this young slut ends her day as all hungry whores should; on her back with her legs tied wide open. The Pope never lets up and attacks her feet and toes with reckless abandon. She quickly returns to a heightened state of arousal as she experiences pain as she never has before. And just when she can not take another second of The Popes sadistic hands, she finally earns the orgasms that she has diligently worked for all day. The Pope plunges her with a big dildo and then crams his hand into her pussy and manually drives her g-spot into the biggest orgasm of her life. The camera never lies and the feeling of exhaustion and defeat is palpable as we watch Kimber quiver in a pool of her mess. Kimber is a pain slut of the divine order!!! Welcome to the Kink.com family!!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kimber Woods",
      "person_id": 54178
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-05-11",
  "scene_id": 41884,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Belly Punching",
    "Bondage",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Feet",
    "Fingering",
    "First Porn Shoot",
    "Foot Torment",
    "Gag",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Nipple Clamps",
    "Nipple Torment",
    "Noose",
    "Pain",
    "Pain Slut",
    "Punching",
    "Rope Bondage",
    "Slapping",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "New Pain Slut Proves her Worth to The Popes High Expectations"
}