{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Sadie Santana is no stranger to extreme fucking. She has done and seen it all: gang-bangs, public-sex, extreme-anal-probing...just to name a few. However, there was one glaring void in her incredible slut-resume: FUCKING MACHINES!!! Watch as this tall vixen takes her first ever machine fucking!! She is shy at first and unsure of what to expect. But her curiosity draws her in. Her body glistens. She spreads her legs wide and hungrily devours her first machine. She instantly becomes enchanted by their power. The dildo pulls in and out showing off the inside of her perfect-little-pink pussy. The pace quickens and she starts panting...she has never been fucked for such a long duration. Then the machine gets to work and she starts having one long extend-sexual-orgasm that does not let up as the machine only knows one speed: GO!!! All she can do is just lay back and let the machine bring her into a ecstatic state she can not begin to describe. And, that was just the first round. Next she bends over and shows off her long-toned-never-ending legs. The machine creeps in slowly and begins to probe parts of her pussy that she did not know existed. Quickly the speed increases and the sweat begins to glisten across her back. As the machine plows relentlessly forward her legs quiver and her gasps of joy quicken. Unable to sense where one orgasm ends and the next one begins; she crumbles and surrenders to the ceaseless dildo that she finds owning her hungry pussy. And, as if this was not enough, she ends her day on her back with the biggest, fastest, hardest machine in our arsenal. Her body sways in and out of back arches and her taut skin flexes across her toned body. The scene quickly kicks into high gear and the only thing this hungry whore can do is grab her ankles and hold on for dear life. Sadie gets the porn fucked right out of her and experiences a day like nothing she could have ever imagined!!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Sadie Santana",
      "person_id": 53272
    }
  ],
  "release_date": "2017-05-10",
  "scene_id": 41886,
  "tags": [
    "Anal",
    "black hair",
    "Dildo",
    "fake boobs",
    "Latin",
    "Machine Dildo",
    "Public",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "toned",
    "Vaginal Penetration"
  ],
  "title": "Tall and Long-Legged Latin Goddess Gets Machine-Fucked!!"
}