{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Welcome to part two of our wildest BDSM party to ever be held in the historic SF Armory. 300 gorgeous swingers, dominants, and submissive fill out resplendent lounge with the sounds of sexual pleasure, exquisite pain, and playful partner swapping. This episode starts with Cherry Torn receiving a swift reminder of her place on The Upper Floor after she humiliates herself by cumming without permission with Ramon Nomar’s thick cock in her ass. Ramon throws her on the floor, interrogates her with a crop, and ride fucks her around the lounge like little pony while the guests laugh at her predicament. One hot young couple become the focus of the game as Cherry begs them desperately for permission to cum while they giggle in her face and watch Ramon torment her pussy. Eventually with permission granted Cherry screams with relief as she is pounded into orgasmic oblivion.\nMeanwhile in the next room gorgeous house slave alumni Nerine Mechanique descends upon her prey dressed in a perfect latex gown with sex on her mind. Devi Lynn is a clever little submissive and maintains a charming exchange of quips and flirtation between her screams from lesbian domination, single tail whipping, fisting, corporeal, and athletic bondage predicament. It all ends with a kiss as the excited crowd cheers. With the extremely hot inspiration the room lights back up in a cavalcade of latex sex, spankings, squirting, rope suspensions, flogging, fucking machine fun, and lesbian swinging.\n\nThe final scene finds Nora Riley in a tight spot. Tied up in an extremely painful kneeling rope suspension she must finally prove that she is worthy to petition as the Last Armory Slave in front of Cherry Torn. In order to make the cut she must hang like a piece of sex meat in the air and survive an onslaught of electrical torment, zappers, and cattle prods all while begging to have her will debased. If she can offer herself with enough submissive grace she will be rewarded with Cherry Torn’s approval and her anal use at the hands of Ramon Nomar.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Nora Riley",
      "person_id": 58748
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2017-06-27",
  "scene_id": 41933,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Couple",
    "Crop",
    "Discipline",
    "Domination",
    "fake boobs",
    "Female Slave",
    "Fisting",
    "Flogging",
    "Humiliation",
    "Latex",
    "Lesbian",
    "master",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "other hair color",
    "Pain",
    "Pony Play",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Single Tail",
    "Slave",
    "slim",
    "Squirting",
    "Straight",
    "Stud",
    "Suspension",
    "Swingers",
    "Tattoo",
    "Threesome",
    "Titty Fucking",
    "toned",
    "Vaginal Fisting",
    "Whipping",
    "white"
  ],
  "title": "Armory Upper Floor Finale Part 2: Nora's Debasement"
}