{
  "collections": [
    "The Upper Floor"
  ],
  "description": "In this last installment of the final Armory Orgy party, Nora finally earns her right to serve by Cherry's side. In Aiden's words, \"If you have to lick every foot in this place, that's what is going to happen.\" Nora lowers her beautiful tits to the floor and grovels, licks boots, holds hitachi's on hungry pussies, Has her huge ass spanked and receives a tight clamp for every act of humbling. By the end her taught tits are covered in clothespins, which she begs to have flogged off before receiving a strap on anal fucking from Aiden Starr. She moans, and begs, and squirms, but the crowd makes her wait until she receives permission and laughs at her attempt to hold the orgasms back. Meanwhile, the rest of our gorgeous guests are deep in BDSM space, making each other cum in intricate rope suspensions, degraded in public humiliation, zapped with electro toys, spanked, and so may submissive blowjobs we lost count. The fucking machine is on the high setting and the air is alight with the sound of female orgasms. The final orgy is no exception, with what might be the largest group orgasm we have ever seen. Thank you ladies, for being our first and our last.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Nora Riley",
      "person_id": 58748
    }
  ],
  "release_date": "2017-07-25",
  "scene_id": 41934,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Hitachi",
    "Humiliation",
    "master",
    "Oral Sex",
    "Orgy",
    "Public",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Strap On",
    "Threesome"
  ],
  "title": "The Final Armory BDSM Orgy with a huge group orgasm!"
}