{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Alas, all parties must come an end, but what an end it will be. We invited 300 of our perviest, hottest BDSM swinger friends to celebrate what has been a magical 7 years of incredible service. Of course we had the pleasure of inviting the original house slave, Cherry Torn, who is looking just as gorgeous if not more so than when she had her humble start training with us. She is given a simple directive: get all the dick you can. She gets her thick bouncy ass tied up tight and is anally reward fucked well into the night by the incredible Ramon Nomar. She begs and sweats and bounces her tits all over the room like the Cherry we know and love. Meanwhile, another house slave Casey Calvert has brought her real life play partner and Dominant to the party and treats us to their first time fisting her tiny little ass EVER. It's a real treat to see her genuine and filthy BDSM lifestyle displayed for us on screen. The governess has her hands full with pretty little humiliation queen Nora Riley, who will be our last slave to serve the floor. In this first installment, she will endure one of the first slave training devices Cherry ever suffered through: 20 min of the trays. This night has one entire camera dedicated to the sexy crowd and their play. Please enjoy all the caning, blowjobs, rope suspensions, and creative BDSM play this wild crowd has to offer.",
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Nora Riley",
      "person_id": 58748
    }
  ],
  "release_date": "2017-04-28",
  "scene_id": 41932,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "caning",
    "Cherry Torn",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "First Fisting",
    "fisting",
    "humiliation",
    "master",
    "oral sex",
    "orgy",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "swingers"
  ],
  "title": "The Final Upper Floor Orgy P. 1"
}