{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Alessa Snow, hot and curvy sub slut nerd, wants to explore her BDSM and bondage curiosity. And she happens to find her other women sexy and fun to play with. Get ready for the perfect lesbian domination threesome video to freshen any porn collection. Sex slaves turned Mistresses Kimber Woods and Isa Mendez take care of this kinky cutie, drop her onto the bed they set up, wrists cuffed behind her back. Her back is to remain arched so her ass can pop up beautifully for strapon dildos our Mistresses never leave at home. If she fails, she'll definitely get a hard spanking, cropping and plenty hits of the electro wand. Kimber and Isa take turns using Alessa's pussy and mouth, double penetration majority of her time on the mattress. They don't stop taunting her, making her apologize for being such a whore, slap her face and tits, yank on her nipples, crop and smack her ass more, fuck her rough, make her gag up spit which only allows the rubber dicks to slide down her throat easier. Hearing Alessa gag and screaming she's a dirty slut will make anyone cum in their pants. Kimber is so turned on, makes out with her poor sex slave, slapping Alessa's face between spit swapping and swallowing. They want Alessa to cum a few more times no matter what it takes. The pain play, deepthroat skull fucking and rough sex seem to be working just fine. We're sure we'll be seeing more of this trio.",
  "directors": [],
  "models": [
    {
      "name": "Alessa Snow",
      "person_id": 52051
    },
    {
      "name": "Isa Mendez",
      "person_id": 53665
    },
    {
      "name": "Kimber Woods",
      "person_id": 54178
    }
  ],
  "release_date": "2017-04-25",
  "scene_id": 41944,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Natural Tits",
    "Bondage",
    "Breast Abuse",
    "Chains",
    "Choking",
    "Collar",
    "Crop",
    "Curvy",
    "Deepthroat",
    "Domination",
    "Double Penetration",
    "Electrical Play",
    "Femdom",
    "Gag",
    "gloves",
    "High Heels",
    "Kinky",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "Pain",
    "Pierced Nipples",
    "Redhead",
    "Rough Sex",
    "Slapping",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "Zapper"
  ],
  "title": "Pain Sub Slut Alessa Snow Endures Lesbian Domination"
}