{
  "collections": [
    "Strapon Squad"
  ],
  "description": "We’ve paired bondage Mistresses Isa Mendez and a new recruit to unleash some Lesbian BDSM fun on the kinky girl next door, Layla Price. Can she handle a lesbian domination threesome? Only one way to find out. They start Layla on the sybian fucking machine, tied down with leather cuffs and chains. She struggles and tries to get off but she isn’t going anywhere. These two Mistresses know what they’re doing. Price swears she has incomparable deep throat and pussy swallowing talents. When she sees the strapons her Mistresses are wearing, she rethinks taking dick all together. She has no choice. She’s deep throat-ed within seconds, both mean girls taking turns fucking her skull in. Both turn the vibration and speed up and down, tormenting Layla’s clit. They slap her tits and want to hear her say what dirty whore she is, a nasty bitch. It takes a few slaps and throat pounding to get it out of her. They finally pull her of the sybian and tie her to a wood slab, wrists and ankles keep her in place, kept in the doggy position. Everyone knows it’s perfect for rough double penetration sex. Layla really experiences two massive rubber dicks entering both ends at the same time. Maybe Price will think twice before doing another scene with us.",
  "directors": [],
  "models": [
    {
      "name": "Isa Mendez",
      "person_id": 53665
    },
    {
      "name": "Layla Price",
      "person_id": 48143
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    }
  ],
  "release_date": "2017-04-11",
  "scene_id": 41942,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "Chains",
    "Collar",
    "Deepthroat",
    "Domination",
    "Double Penetration",
    "fake boobs",
    "Femdom",
    "gloves",
    "Hair Pulling",
    "Kinky",
    "Latinx",
    "Leather",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Redhead",
    "shaved",
    "Slapping",
    "slim",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Sub",
    "Sybian",
    "Tattoo",
    "Partner Studio",
    "Threesome",
    "white"
  ],
  "title": "Girl Next Door Layla Price Gets Bound & Dominated"
}