{
  "collections": [
    "Bound Gods"
  ],
  "description": "Dangling from the ceiling, with his head locked in a stock, Chance Summerlin awaits for house dom Jessie Colter. Master Colter inspects his boy and demands to hear how he intends to please his new master. As Chance struggles to respond, Jessie pulls on the boy's cock and balls, swinging him in the air until he hears a proper response. With his gloved hands, Master Colter punches his plaything in the torso before working up his cock, only to place clothespins on his balls. Balancing on one foot, Chance struggles in his bondage with gag in mouth as his master warms him up with the flogger. Spinning back and forth, the new house slave dances in the air as the leather whip beats against his supporting leg. The gag is removed for Jessie to enjoy his boy's mouth with full access, fucking the boy's willing face as he swings back and forth in the bondage. Finally, Chance gets a taste of full suspension as his master fucks his ass from behind. More clothespins cover across Chance's chest as the ass pounding continues, all while his master edges the boy's cock in mid-air. When Jessie denies his slave of having any pleasure, he instead coats the boy's eager mouth with a big load of cum. The boy begs once more for sweet release, but his master answers by leaving him dangling helplessly in the air.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Chance Summerlin",
      "person_id": 60103
    },
    {
      "name": "Jessie Colter",
      "person_id": 34311
    }
  ],
  "release_date": "2017-03-16",
  "scene_id": 41956,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "Humiliation",
    "Latin",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Slave",
    "Submission",
    "Suspension",
    "white"
  ],
  "title": "New house slave offers himself to the sexual desires of Master Colter"
}