{
  "collections": [
    "Bound Gods"
  ],
  "description": "Training day is upon us here at Bound Gods and not only do we have a new muscle sub, Pierce Hartman, but house dom Jaxton Wheeler has his protege, Lance Hart by his side to help break in the new boy. After educating their new sub on proper etiquette, Jaxton uses Pierce’s mouth to show Mr. Hart the oral portion of their training. Lance jams his hard cock down his slave’s mouth, looking down on the boy’s hungry eyes as he swallows it to the hilt. Next begins the ass training; sliding up and down on a huge dragon cock, Pierce must endure a brutal flogging from all directions as Mr. Hart learns the way of the whip. The muscled slave licks the juices off the Bad Dragon dildo before he’s blindfolded, bound in rope as he’s mounted on top of Jaxton’s hard cock. The dragon dick was only the beginning for Pierce as Lance slides in from behind, DP’ing the bound hunk as he moans in ecstasy. Finally Pierce worships his new master’s foot before blowing his load all over it and licking up every drop.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jaxton Wheeler",
      "person_id": 53352
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2017-03-30",
  "scene_id": 41957,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Toy",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Dragon Dildo",
    "Feet",
    "Flogging",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Mouth Spreader",
    "Muscle",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slave",
    "Sub",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "versatile",
    "white"
  ],
  "title": "Training Day - Dom in training gets to break in a ripped, new slave"
}