{
  "collections": [
    "Public Disgrace"
  ],
  "description": "It is just another beautiful day in Barcelona and Melody Petite is the kind of tiny submissive slut that loves to take full advantage sunny day. She first is paraded around a stunning old world plaza that looks like a classic Renaissance painting. Marble stone work and pristine architecture serve as the backdrop for this wanton sluts public shame. From the hem of her tiny dress one can see the ends of the horse tail peeking out that is attached to her anal plug. Her mistress Silvia Rubi quickly shames her and makes Melody flaunt her exposed ass to the prying of eyes of locals and tourist as they sip lattes and cool off with gelato. Shocked and mortified by the obscenity of Melody's public disgrace, they gawk and point fingers, while covering their eyes. But secretly Melody knows that these unsuspecting people love what they see and wish that they were being flaunted about like a disposable whore. Despite the heat, Melody follows the every whim of her mistress as she gets chained to a tree so her bare ass can be spanked with a black leather riding crop. Melody purrs and says thank you. Tired of Melody's desperate need for public attention, Mistress Silvia drags her to local bar where she meets some of the local patrons. The crowded bar is full of people trying to escape the heat by drowning themselves in cold beer. The loose crowd takes one look at Melody and know that she is ripe for the picking. One can sense the palpable sexual energy corse immediately through the room. Everyone knows that they are going to get a piece of this little slut. The crowd gropes and spanks, reminding this greedy whore that she is their piece of meat for the afternoon. Her clothes are quickly torn off and she begins to fuck and suck the throbbing cocks of two lucky men. The crowd goes wild and soon other young sluts start to gag on the cocks, hungry for their piece of the action. Clothes file off and in a heated mess Melody cums again and again as she is fucked senseless from behind. Without skipping a beat she is then tied up in tight rope bondage that exposes her teeny pink pussy to whole room. She is then fucked in her mouth and her cunt over and over by the massive cocks of hungry bar patrons. The crowd gets involved and jams a hitachi onto her clit and Melody begins to have a ceaseless parade of orgasms that climate with a giant squirt that soaks the room in her shameless cum drunk pussy excretions. Breathless, she is then thrust to the ground and crowd cheers as both men cum all over her face. She licks them both clean and smiles a grin of joy that can only come from the satiated desires of a public whore. Melody Petite gets humiliated and fucked in public streets of Barcelona and loves it!!",
  "directors": [],
  "models": [
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Melody Petite",
      "person_id": 59695
    },
    {
      "name": "Silvia Rubi",
      "person_id": 57227
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "release_date": "2017-08-07",
  "scene_id": 41965,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "Domination",
    "Female Slave",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Petite",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Sub",
    "Submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Submissive, Slut Melody Petite Gets Humiliated and Fucked in Public!"
}