{
  "collections": [
    "Public Disgrace"
  ],
  "description": "What would a beautiful young woman with classical features do while enjoying the sights and sounds of Barcelona? Some might go touring about, soaking up the food and culture of this magical old world city. However there are some young whores who dream of experiencing the city in much different and more hands on fashion. Francesco DiCaprio is the kind slut that wants to take off her clothes and let the tourists gawk at her divine curves and supple skin. Steve wastes no time and quickly has Francesca prancing about and flaunting her private areas to an unsuspecting public. With an anal plug securely in place, she is made to clean her dom's shoes with a brush that has been shoved into her mouth. She pouts and begs for approval but she finds no solace in the stern desires of her public masters. But secretly her pussy grows moist from the public degradation and she hungers for more. At the next stop of Francesca's sightseeing tour she finds herself in front of stunning marble sculpture of a nude woman posed in delicate perfection. She is instructed to strip naked and mimic the statues form however once again Francesca fails to impress her Dom's exacting desires. They quickly march her to a gigantic fountain and make her walk through water, and expose herself to myriad of people eating their lunches and enjoying the beautiful day. Having grown tired of her Francesca's shameless public displays, Steve and Silvia bring her to a local BDSM workshop where she serves as the demo model for a rope bondage lesson. Quickly the class goes from a teaching exercise to a hands on laboratory where the students get a taste for the real thing. She is spanked and tickled repeatedly with a mean leather flogger. She screams when nipple clamps brutally smash her tender breasts into sensitive targets for her handlers to attack. Once she is warmed up she gets gang banged in her teeny pink pussy and her tight asshole while having her throat fucked by massive cocks. She gets banged senseless, helplessly dangling in bondage while the public stares and laughs at her shameless slutty ways. Silvia jams an hitachi onto her tender clit and Francesca has the first wave of rolling muliple orgasms that crescendo when two stiff rods blow massive loads of cum all over her face. She smiles, says thank you, and parades around the room so everyone can see just how big of a slut that she is.",
  "directors": [],
  "models": [
    {
      "name": "Francesca DiCaprio",
      "person_id": 60609
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Silvia Rubi",
      "person_id": 57227
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "release_date": "2017-10-02",
  "scene_id": 41969,
  "tags": [
    "Anal",
    "BDSM",
    "Bisexual",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Female Slave",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Mouth Spreader",
    "Nipple Clamps",
    "Pet Play",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Sub",
    "Submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Young Whore Francesca DiCaprio Shamed, Tied-Up, and Fucked in Public!"
}