{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Steve Holmes, Silvia Rubi, and Max Cortes are all sharing a beautiful Barcelona view while\nGabriela Flores, a cute skinny Latina from Cuba squats beneath them with her dress pulled up exposing her ass and pussy. Steve, Max, and Silvia gaze out at the beautiful landscape as Gabriela gets face-fucked, balancing on tall heels, her hands bound behind her back with rope. Intermittently they embarrass Gabriela and tell her to walk around and say hi to the tourists, and to dance for them. We later find Gabriela naked with her hands tied above her head, standing in front of a bar with a bunch of rowdy horny people watching. The beautiful Silvia Rubi applies nipple clamps to Gabriela's small tits, twisting, pulling and contorting them. Silvia canes Gabriela's ass until its's striped red. Steve unties Gabriela's hands and him and Max take turns shoving their cocks down her throat. Steve then bends Gabriela over the bar and fucks her pussy from behind. Max Cortes takes a seat, grabs Gabriela's hair while she gets fucked and makes her suck his cock while tattooed hottie Silvia Rubi spanks Gabriela's ass. Later we find Gabriela swinging back and forth like a pendulum, her whole body bound by rope in a crazy predicament, suspended with her hands tied behind her back and one leg awkwardly bent. Silvia Rubi flogs her ass and legs. Max Cortes climbs up the ropes from behind and wildly fucks Gabriella while making gorilla noises. Max then shoves pizza in Gabriela's mouth and rubs it all over her face while Steve has his turn with Gabriela's pussy. Max then grabs a bucket of ice and shoves it in Gabriela's face. The bar patrons grab cubes of ice and start rubbing her nipples pussy and ass with them. After untying Gabriela, Max and Steve both sit while Gabriela fucks their cocks in reverse cowgirl. Steve flips Gabriela upside down in a pile drive position with her back on the concrete floor and finger-bangs a couple orgasm out of her until she wets herself. After getting drenched with two hot loads, Steve Holmes makes Gabriela Flores walk around outside amongst the public with cum dripping from her face.",
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Gabriela Flores",
      "person_id": 60359
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Silvia Rubi",
      "person_id": 57227
    }
  ],
  "release_date": "2017-07-10",
  "scene_id": 41963,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "Corporal Punishment",
    "couple",
    "discipline",
    "domination",
    "female slave",
    "humiliation",
    "nipple clamps",
    "Petite",
    "public",
    "rope bondage",
    "Rough Sex",
    "small tits",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Petite Shy Latina Gabriela Flores' First Public Fucking "
}