{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Francys Belle is a hot slender brunette from Brazil who is excited for her first time here on Public Disgrace. We start in Barcelona on a hot sunny day with Irene Vega and Steve Holmes on a corner, having a smoke while their submissive slut for the day Francys Belle kneels on the concrete next to them holding an ashtray gag in her mouth wearing a very slutty maids outfit. Next Irene and Steve head to a quiet place outdoors with a nice view to meet Max Cortes. There they spank and paddle Francys' ass while Steve and Max each take turns sticking their cocks down her throat covering her big bare tits in spit. After that they head to the beach where Francys is told to get totally naked and walk slowly ahead of them so everyone can stare at her big tits, small round ass and shaved pussy. Wearing only glasses she waves at the passing public loving the attention. Finally we find ourselves at a bar where a gaggle of hot ladies cant help but immediately get their hands and mouths on Francys once her clothes come off. They suck her tits, poor drinks her, and rub ice on her pussy. Max has Francys get on her knees and fucks her face till his cock and her face are covered in spit. Steve lies down and Francys hops onto him in reverse cowgirl and slides Steve's fat cock in her little pussy like a true pro. With her pussy thoroughly fucked Irene stuffs Steve's cock in her ass and Francys cums hard while Steve pounds her and Irene crops her pussy and legs. Max positions himself the spread-eagle Francys and shoves his dick in her pussy with Steve's cock still buried in her ass. Irene rubs Francys' clit as she's getting pounded in both holes and gets sent into outter space with a multitude of huge orgasms.",
  "directors": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Francys Belle",
      "person_id": 60483
    },
    {
      "name": "Irina Vega",
      "person_id": 60580
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    }
  ],
  "release_date": "2017-09-04",
  "scene_id": 41967,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blowjob",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Female Slave",
    "Gag",
    "Get Sprung",
    "Humiliation",
    "Outdoors",
    "Paddle",
    "Petite",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Sub",
    "Submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Petite Brunette Brazilian Gets DP'd in Public "
}