{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Barcelona is a shameless city that bears the flesh of its citizens with great pride. Margout Darko has secretly fantasized about being humiliated in public for all the world to see for many years and has dreamed of the day that Kink.com’s sadistic masters would get their hands on her. She is self conscious and is embarrassed to expose her secret slutty self to the whole world. She is paraded down the street will being shocked and prodded along with electric zappers. She is laughed at and ridiculed by onlookers as she is made to kneel in front of a picturesque building with her perfect natural breasts hanging out of her torn dress. She can feel the eyes of repressed people judging her for her wanton ways. And, amidst her shame and the glaring judgement of the public her pussy grows wet with hunger and desire. Her masters then parade her through a public fountain and make her look ridiculous by being made to carry her shoes in her mouth. Jaws drop and people stop in their tracks as this shameless whore sheepishly shuffles by them while being ridiculed by her dominant task masters from behind. Once Margout is warmed up, she is escorted to a public party where hungry guest greedily disrobe her with their prying eyes. Quickly she is stripped bare and punished for her transgressions in public. The crowd cheers on and laughs at her while her back is relentlessly punished by a thick wooden cane. She is then tossed around and slapped in the face until her gaze meekly scans the floor of the room in search of some solace. But there is no mercy to be found. She is then tossed to the floor and two hung guys jam their massive cocks down her throat making her gag and spit up all over herself. Her drool and filth gets wiped all over her face as she begs for more cocks to face fuck her. Once all the cocks in the room are rock hard she gets tied up in restrictive and tight rope bondage. The ropes dig into her skin, abrading her flesh every time that she moves. Before she can catch her breath the first cock penetrates her tight pink pussy while a woman from the audience shoves their pussy into Margout’s face. The men take turns fucking her tight whore hole and mouth while she gasps for her air. And when she reaches the heights of bliss she squirts all over herself and cries out as the multiple orgasms roll from one to the next. When the crowd grows bored of her, the men blow massive loads of cum all over her disheveled face. The crowd laughs at how ridiculous her jizz coated face looks, making her shame complete and her disgrace a complete success. Margout Darko gets punished and humiliated in public and fucked by two dom’s while restrained in tight rope bondage!!",
  "directors": [],
  "models": [
    {
      "name": "Margout Darko",
      "person_id": 59143
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Silvia Rubi",
      "person_id": 57227
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Susy Blue",
      "person_id": 59993
    }
  ],
  "release_date": "2017-09-18",
  "scene_id": 41968,
  "tags": [
    "69 Position",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Bisexual",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Caning",
    "Choking",
    "Clothespins",
    "Cock Worship",
    "Collar",
    "Corporal Punishment",
    "Destruction",
    "Discipline",
    "Domination",
    "Dominatrix",
    "drool",
    "Facesitting",
    "Facefucking",
    "Facial",
    "Female Slave",
    "Fetish",
    "foreskin",
    "Gag",
    "Hair Pulling",
    "Hand Gagging",
    "Handler",
    "High Heels",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Latinx",
    "Leather",
    "Leather Belt",
    "Leather Cuffs",
    "multiple orgasms",
    "natural boobs",
    "Nylons Stockings",
    "Oral Sex",
    "Orgy",
    "other hair color",
    "Pain",
    "Petite",
    "Pierced Nipples",
    "Public",
    "Pussy Eating",
    "Rope Bondage",
    "Rough Sex",
    "Sadism",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "Sub",
    "Submission",
    "switch",
    "Tattoo",
    "Threesome",
    "unshaved",
    "Vaginal Penetration",
    "Vibrator",
    "Voyeur",
    "Voyeurism Fantasies",
    "white",
    "Zapper"
  ],
  "title": "Petite Natural Whore Shamed in Public and Gang Fucked in Rope Bondage!"
}