{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Public Disgrace is back in Barcelona and Steve Holmes is accompanied by the stunning Blonde Cherry Kiss. The two of them have a young perky french brunette slut that loves anal sex. Luna Rival, in her short red dress, sheer stockings and bright red high heels. Her lips with bright red lipstick highlight her beautiful smile. This public slave is ready to serve. Steve stars by shackling her ankles with metal cuffs. This anal beauty isn't getting away. That beautiful smile is definitely missing something and Steve knows just the thing. An open mouth gag signifies this slut is ready for servicing Steve and Cherry. Hundreds of tourist on the busiest streets witness this slut in action. The dirty filthy streets are her runway and everyone wants a photo of that beautiful smile. But, Steve knows what her best features are and pulls up her clothes revealing that stunning bare ass. The perfect photo op! Her tight trimmed pussy is exposed for the public camera as well, Luna is made to walk of shame with her dress held high for all to see. This slut needs some red marks to match that bright red dress and lipstick. Cherry takes Luna to a crowded park down by the docks and ties her up with tight rope bondage suspension. Her beautiful perky tits pushing out of the rope bondage, her puffy pussy lips and asshole exposed for the public to enjoy. The perfect public bdsm pet. Cherry rips out Luna's perfect perky pierced tits in bondage for the whole park to see. She sucks on those perfect nipples before taking her crop out to spank her pussy lips. This pain slut begs for more pleasure from pain so Steve calls his friend Max Cortes over to get this party started. After more intense corporal punishment, Cherry gets Luna's pussy dripping wet and ready for Max to fuck her hard doors. This is true public disgrace. Luna's pussy, ass and tits on full display getting fucked hard in a crowded park while tied up in rope bondage. Steve needs a turn next and whips out his massive cock to ram down her tight pussy and she screams in pleasure and pain. Max and Steve decide to spit roast this slut and shove their dicks in both ends. This perfect slave swallows deep massive cock. To cool off the group drags the slut to a crowded underground club to get this slave to service the patrons. Everyone wants their hands all over Luna's perfect body. Of course, Luna has to prove her worth on the stripper pole, will she truly entertain the crowd, or do we need to punish her more. The cameras come out as Luna is spanked and cropped turning her tight ass red. The crown is invited to get right up in Luna, and they take full advantage of that. Fingering her tight holes, everyone takes a turn. While the action on the stage is underway, Steve and Max start up their own parties getting the crowd to suck down some hard cock. These two never stop getting the hot women to serve them with deep throat action. Finally this perfect slave gets her slutty desires as huge cocks are shoved down her tight asshole. This anal whore loves every single minute of it. The crowd is loving this hardcore action and they want in. Steve gets smothered by huge tits from the crowd as his cock is serviced by luna. Luna begs for more and gets dp double stuffed by hard ramming cocks. More and more tits from the crowd come out as the party gets even hotter. Cherry demands her pleasure too as luna lesbian fists her hand into that tight femdom dripping pussy. Finally after another round of DP action the men unload their huge thick loads all over Luna's perfectly marked perky pierced tits.",
  "directors": [],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Cherry Kiss",
      "person_id": 60511
    },
    {
      "name": "Luna Rival",
      "person_id": 60512
    }
  ],
  "release_date": "2017-08-21",
  "scene_id": 41966,
  "tags": [
    "anal",
    "bdsm",
    "Bisexual",
    "blonde",
    "blowjob",
    "bondage",
    "brunette",
    "Corporal Punishment",
    "crop",
    "discipline",
    "domination",
    "female slave",
    "femdom",
    "Fingering",
    "gag",
    "high heels",
    "humiliation",
    "lesbian",
    "pain",
    "pain slut",
    "public",
    "rope bondage",
    "Rough Sex",
    "slave",
    "Spit Roast",
    "Stockings",
    "straight",
    "submission",
    "suspension",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Perky Young French Brunette Begs For Anal Sex in Public"
}