{
  "collections": [
    "Public Disgrace"
  ],
  "description": "The big-titted and beautiful brunette Sophia Laure has traveled from France to Barcelona to get a warm Spanish-style humiliating welcome to Public Disgrace. Out on the street on their way to meet Steve Holmes and Max Cortes at a nearby restaurant, the tattooed sexy and sultry Silvia Rubi walks Sophia Laure like a dog on a leash through a crowded area of Barcelona Spain flashing Sophia's big tits and shaved pussy to the public and spanking Sophia's bare ass. At the restaurant, Silvia commands Sophia to get on her knees and walks her over to the where Max Cortes and Steve Holmes are sharing a table with friends. While on her knees, the public feed Sophia tapas on a small plate placed on the floor, like one would give spare food to a dog. With a mouthful of some type of dipping sauce, Sophia Laure sucks Steve's dick and covers it in condiments. Soon after a good face-fucking, Steve bends Sophia over a neighboring table and Silvia warms up Sophia's cheeks with a hard paddle. Next, Max Cortes and Steve take turns destroying her slutty pussy and tight ass. The public start to get hot and horny pulling their tits out and helping themselves to Sophia's, squeezing and pinching her nipples and slapping her ass. Max Cortes throws olives at her asshole then fucks her ass hard and fast standing up, holding a squished tomato on her nose like a clown while everyone has a good laugh. Steve Holmes and Max Cortes both double-penetrate Sophia several different ways. In the end, Steve offers Sophia a challenge, to make Silvia Rubi cum in under three minutes, and if she can she'll be rewarded with two hot loads. Spoiler alert, she gets the job done and gets a face full of cum, and the crowd goes wild.",
  "directors": [],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Silvia Rubi",
      "person_id": 57227
    },
    {
      "name": "Sophia Laure",
      "person_id": 60326
    }
  ],
  "release_date": "2017-06-26",
  "scene_id": 41962,
  "tags": [
    "anal",
    "bdsm",
    "big tits",
    "blowjob",
    "brunette",
    "Corporal Punishment",
    "discipline",
    "domination",
    "female slave",
    "humiliation",
    "nipple torture",
    "Paddle",
    "public",
    "rope bondage",
    "Rough Sex",
    "slapping",
    "spanking",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Buxom Brunette Sophia Laure Belittled in Barcelona "
}