{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Come join Steve Holmes one last time as we celebrate LGBTQ Pride with the beautiful busty blonde Sienna Day. This bouncy fully submissive slut is nude outdoors and running around barefoot on the dirty busy public streets. Her body is on dsiplay for hundreds to see and this gets Steve Holmes and Tina Kay excited one last time. They both bring out their floggers for an outdoor corporal punishment. The entire crowd is in awe as these two work their pain on Sienna Day's tight body. Her ass turns red as the flogger repeatedly punishes her and adds the necessary red color to the pride rainbow. After posing for countless photos and giving the police a nude show, Steve takes Sienna to our rowdy crowded bar. The patrons are ready to be served. Sienna gets down on the dirty filthy floor and crawls on hands and knees and cleans every shoe with her tongue. Every dirty shoe is licked clean by this slut. Time to put this blonde stunner to work, Steve pulls out his huge cock and Sienna takes all of it with a sloppy slobbery deep throat blowjob. A hot tattooed chick at the bar joins in on the action as well. Tina brings out the electric zapper to get Sienna jumping and then pulls out the dick on a stick for the audience to deep fuck Sienna's dripping wet shaved pussy. Tina wants in on this lesbian celebration and straps on a huge black cock. She masterfully fucks Sienna on the floor, then throws her on a table and fists her tight cunt. This pet deserves a treat and Steve unloads one last huge orgasm for Sienna to lick up every drop. Enjoy!",
  "directors": [],
  "models": [
    {
      "name": "Sienna Day",
      "person_id": 61260
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Tina Kay",
      "person_id": 58964
    }
  ],
  "release_date": "2018-06-11",
  "scene_id": 41978,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Female Slave",
    "Humiliation",
    "Lesbian",
    "Outdoors",
    "Pain",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Sub",
    "Submission",
    "Vaginal Penetration",
    "Voyeur",
    "Zapper"
  ],
  "title": "Busty Blonde Sienna Day Disgraced Fully Nude on Dirty Public Streets"
}