{
  "collections": [
    "Public Disgrace"
  ],
  "description": "It is rare that a young and beautiful female slave slut is so willing to do absolutely any degrading and humiliating thing while in a public setting. Zenda Sexy is a tiny masochistic whore whose pussy becomes dripping wet when she is tied standing spread eagle in the middle of a in busy public plaza. Two sadistic male dom's see her from across the park looking completely vulnerable and exposed to the prying eyes of anyone that passes and to the cruel and brutal hands that grope and molest every inch of her body. Quickly the male handlers lift up the back of her thin white dress and find that Zenda is wearing no panties or bra. They grope her ass and aggressively grab her perfect natural breasts. They tickle her with relentless cruelty and relish watching her body spasm from the torment of their inappropriate touching. As they spank her soft ass with a heavy leather flogger they notice that Zenda's pussy is wet with desire. She loves the attention and feeling of humiliation in public. It is painfully clear that she will do anything that the dom's tell her to do in order to gain the validation that she so desperately craves. Next they untie the her from the rope bondage and have her parade around the plaza and hoist a giant dildo in the air while severe nipple clamps bite into her incredibly sensitive titties. But her shame isn't complete until they cut the back out of her skirt and expose her beautiful white ass to whole world as she marches around baring her banner of shame. The sadists become hungry and anxious to devour every inch of this shameless slut. They drag her into a bar where a crowd of beautiful young women are entertaining themselves on a hot day. Their summer heat becomes ravenous and they tear the clothes off of Zendas body. They grab the dildo that she has been marching around with and cram it into her tiny pink pussy. Zenda winces from the pain as the giant falace is jammed into her tight whore hole. But as it pops in a smile begins to glisten across Zenda's face; this whore loves giant dicks. The customers at the bar take turns mashing Zenda's teeny cunt with the dildo until she cums with delight. The men start to feel self conscious and jealous of the women playing with their piece of meat and their cocks become engorged with desire. They toss her onto a table and take turns pounding her pussy with their massive cocks. The crowd stares and laughs with disbelief; they have never seen a whore devour cocks like this before. After Zenda is beaten with a leather riding crop and a flogger the men toss her to the ground and blow two massive loads of cum all over face and tits. The crowd just keeps laughing and reveling in the disgrace of this public whore.",
  "directors": [],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Antonio Ross",
      "person_id": 33540
    },
    {
      "name": "Zenda Sexy",
      "person_id": 57829
    }
  ],
  "release_date": "2017-12-11",
  "scene_id": 41972,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crop",
    "Cut",
    "dildo",
    "discipline",
    "domination",
    "female slave",
    "humiliation",
    "leather",
    "nipple clamps",
    "pain",
    "public",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Public Shame Slut Zenda Sexy Disgraced, Tickled, and Fucked by a Crowd"
}