{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Wearing only a see-through dress and a leather collar, Sunny Star is led with a leash through a sunny park in Madrid by Mistress Tina Kay. Tina makes Sunny sit at a bench and attach a wooden leg spreader bar to her own two ankles. This causes much attention to all of the tourists nearby who line up to watch and take pictures of the two. Tina then attaches leather cuffs to her wrists and clips them to her leacher collar wrapped around her neck. Sunny hobbles slowly through the crowded with Tina Kay pulling her by the leash. They make their way to a large fountain where Tina splashes water all Sunny’s ass to cool off how hot it has gotten, making her dress even more transparent. Tina pulls out scissors and cuts Sunny’s dress to ribbons, exposing her perky tits, pussy, and big round ass. They head to a music venue to meet with Steve Holmes where a crowd of rowdy voyeurs await to see her get humiliated and fucked. A person in the crowd rips the rest of Sunny’s dress off leaving her completely naked accept now we see that she’d been wearing a fox-tail butt plug the whole time. She gets on her knees and sucks Steve’s cock. Tina sits on the bar and gets her pussy licked. While getting zapped with electricity on her hands and knees, Sunny crawls to the next room where a band plays. Steve fucks her faces and then bends her over a table and shoves his cock in her pussy and fucks to the rhythm of the music. Steve flips her over and fucks her pussy with her legs spread. Tina then takes a turn using her fist, shoving it all the way into Sunny’s pussy. After a few whacks of the cane to Sunny’s ass, Steve takes a seat and Sunny rides his cock reverse-cowgirl while Tina flogs her tits. Then after receiving Steve’s hot load on her face, Tina tells Sunny to lie down and cleans her off with a very special shower.",
  "directors": [],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Sunny Star",
      "person_id": 61152
    },
    {
      "name": "Tina Kay",
      "person_id": 58964
    }
  ],
  "release_date": "2018-04-02",
  "scene_id": 41977,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blowjob",
    "brunet",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Electrical Play",
    "fake boobs",
    "Female Slave",
    "foreskin",
    "Humiliation",
    "Leather",
    "Leather Cuffs",
    "natural boobs",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Sub",
    "Submission",
    "unshaved",
    "Vaginal Penetration",
    "Voyeur",
    "white"
  ],
  "title": "Sunny Star Fucked in Public"
}