{
  "collections": [
    "Public Disgrace"
  ],
  "description": "It is a rare day when a woman who is so perfectly suited for rigors of Public Disgrace like Molly Saint Rose graces Kink.com with her talents. So few people are truly eager to serve and be humiliated as female sex slave. Molly starts her day off in a beautiful public plaza being led around on a leash by her mistress. She gets tossed around like a rag doll and as she bends over so a crowd of people can gawk and stare at the sight of her teeny cut off jeans. The corners of her pink pussy peek out the sides of the shorts and she blushes from embarrassment of exposing herself in public. A man approaches the two beautiful woman and asks if he can help humiliate molly. He crams a gag into her mouth and ashes his cigarette all over her face. Next they drag her like a dog in heat to subway entrance so they can carve this slut up like a sexual feast. They tear off her tight shorts and spank her perfect ass. As she gets repeatedly caned the juices from her hungry cunt start dripping down her legs with unabashed desire. Another strange man walks by and shoves his giant cock down her throat. Molly can barely speak English but she manages to spit out a garbled \"thank you\" as she chokes on dick. A crowd begins to gather and observe the impromptu orgy that is happening right out in public. They laugh at her and call Molly a slut and tell that she should be ashamed of herself. But once a girl like Molly gets a taste of dick, she can't stop until she gets all of her whore holes crammed and abused. The crowd drags her to a local bar where they can all enjoy dissecting her without prying eyes invading their sex show. Molly's clothes get torn off and she gets tossed around like a helpless balloon tied to tree that gets repeatedly tattered by a relentless and furious wind. She gags on cock as her natural tits get caned. She bounces her tiny pussy on a stiff rod while her feet and armpits gets shocked by an electric zapper. She winces in pain as a giant dick crams into her ass while a room full of strangers grope and fondle her ivory white skin. She howls and begs for mercy as the non stop multiple unwanted orgasms flow endlessly from one to the next. Molly becomes so entranced in the moment that she barely notices when two men blow massive loads of cum all over her mouth. She is a filthy mess so her mistress drags her into a bathroom so she can clean her off by urinating all over her face and body. All the while the crowd just calls her an ungrateful whore.",
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Antonio Ross",
      "person_id": 33540
    },
    {
      "name": "Tina Kay",
      "person_id": 58964
    },
    {
      "name": "Molly Saint Rose ",
      "person_id": 60861
    }
  ],
  "release_date": "2018-01-08",
  "scene_id": 41973,
  "tags": [
    "anal",
    "AprilFools",
    "bdsm",
    "blowjob",
    "Corporal Punishment",
    "Cut",
    "discipline",
    "domination",
    "Feet",
    "female slave",
    "gag",
    "humiliation",
    "orgy",
    "pain",
    "Petite",
    "public",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur",
    "Zapper"
  ],
  "title": "Petite Whore Molly Saint Rose Fucked and Humiliated in Public Plaza!!"
}