{
  "collections": [
    "Public Disgrace"
  ],
  "description": "What do you do when your slutty best friend fucks the person that you hate most in the world. For Irina Vega it isn't enough to just confront Nerea Falco about the issue in a private location where the two can hash out their differences or walk away from each other forever. Instead she brings her meanest friend and fellow whore Lady Nala to call out Nerea's bullshit in the most public of settings and shame the bitch into apologizing for her slutty ways. Standing on the edge of Barcelona's most famous museum Irina asks Nerea a simple question, \"Did you fuck my enemy?\" And with great shame and humility Nerea admits to her transgression. With the discipline of the master torturer of an ancient medieval court she says nothing and instead strips the bitch naked so her whore nature will be on display for everyone coming and going from the prestigious museum. She then has Nerea kneel before and beg for forgiveness as Lady Nala shaves her head bald. She pouts and pleads with Irina for mercy but she finds none. She is then coerced into parading around the public plaza wearing only her high heels while holding a sign that reads, \"I fucked the enemy.\" And thus begins a long march of shame all around the historic back streets and scenic tourist traps of this ancient city. Satisfied with the first stage of Nerea's punishment, the sadist Irina then takes her female slave to a local tavern so a select group of local patrons can spend some detailed and quality time humiliating Nerea in a slightly more intimate session. With the help of Max Cortes and Steve Holmes, Nerea receives corporal punishment and impact play while being beaten with a heavy leather flogger and a cane while the audience cheers on and revels in her pathetic attempts to seek approval and redemption. She entreats her best friend to understand that she knows that she was wrong to fuck the enemy but her screams are inaudible with cocks throat fucking her and hands choking her fragile neck. Max and Steve take turns fucking her whore holes and making her give them blow jobs while Nala practices face sitting and makes Nerea suck her pussy against her will. As the orgy continues Nala is gets a vaginal fisting by Nerea all the way up to her elbow and she has first of many multiple orgasms. Finally when Irina feels that Nerea has learned her lesson she allows Max and Steve to cum all over her cleanly shaved head. Pouting and promising that she will never do something like this again, Nerea is finally tossed to ground and made to clean the floor with her tongue. The crowd only looks on, laughs, and revels in her public disgrace.",
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Irina Vega",
      "person_id": 60580
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Nerea Falco",
      "person_id": 59766
    },
    {
      "name": "Lady Nala",
      "person_id": 60691
    }
  ],
  "release_date": "2017-10-16",
  "scene_id": 41970,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "choking",
    "Corporal Punishment",
    "discipline",
    "domination",
    "Face Sitting",
    "female slave",
    "fisting",
    "hand gagging",
    "hand job",
    "head shaving",
    "high heels",
    "humiliation",
    "leather",
    "master",
    "multiple orgasms",
    "orgy",
    "Petite",
    "public",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "submission",
    "Vaginal Fisting",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Petite Slut Nerea Falco Shaves Head and Gets Gang Fucked in Public!"
}