{
  "collections": [
    "Public Disgrace"
  ],
  "description": "How does as deranged group of sadists celebrate a special occasion? By feasting on the fresh meat of hot young lady in public, of course!! Yunno X serves as masochistic treat for the devious whims of Steve and his hungry group of friends. First Yunno is stripped, labeled for consumption, and then wrapped in clear plastic amidst a beautiful plaza whilst being gawked at by hundreds of tourists. Shackled to a pole with police handcuffs her handlers spank her perfect little ass and natural perky tits with their hands. She lets out tiny yelps of pain and begs for them to abuse her more. As her sadistic mistress and male dom humiliate and punish her in public, a police car rolls by and demands to know what is going on. While one of their clever friends distracts the officers Yunno and her captors saunter away, slithering naked down a narrow cobblestone street teeming with cafes and business people. They all point and stare in complete disbelief of this young whores shamelessness and wanton desire for lurid attention. Yunno is dragged through the streets until they reach the bar where one of their friends is waiting to sink their teeth into her soft and innocent flesh. A large group of people are playing pool and enjoying an afternoon drink. When they see Yunno walk in their jaws drop and drool begins to pool and ooze from the corners of their mouths. Steve wastes little time and cuts off the plastic wrap that has encased his little treat. He takes out his giant cock and shoves it deep into her mouth until she gags and chokes from his aggressive deep throat plunge. Soon another one of his friends whips his cock out and Yunno devours that ones as well. The crowd gasps and begins to grope her tits and ass. She begs for more and juices drip from her hungry cunt. Steve throws her on top of the pool table and quickly lashes her legs and arms together with tight and restrictive rope bondage. She squirms and fights against the dom's torment but her plea's for mercy get stifled when her mistress shoves her tiny pink pussy over her face and makes her eat her out. Yunno spends the next hour being tossed around like a rag doll as her pussy gets punished relentlessly buy giant cocks and powerful vibrators. When Steve finally grows tired of his fuck toy, he tosses her to the ground so he and his friend can blow massive loads of cum all over her face.",
  "directors": [],
  "models": [
    {
      "name": "Antonio Ross",
      "person_id": 33540
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Tina Kay",
      "person_id": 58964
    },
    {
      "name": "Yunno X",
      "person_id": 61019
    }
  ],
  "release_date": "2018-02-05",
  "scene_id": 41974,
  "tags": [
    "Anal",
    "AprilFools",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "drool",
    "fake boobs",
    "Female Slave",
    "foreskin",
    "Humiliation",
    "Latin",
    "natural boobs",
    "Pain",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Sub",
    "Submission",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "Voyeur",
    "white"
  ],
  "title": "Attention Whore Yunno X Humilated, Punished, and Gang Fucked in Public"
}