{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Luna Rival is a sexy little French slut who is excited to return to Kink.com. Luna and Steve take a stroll outside by a Spanish opera house. Steve canes Luna's ass while they walk then makes her hold it between her teeth. He puts leather cuffs on Luna's wrists and attaches them to a leather collar wrapped around her neck. Her dress gets untied in the front, exposing her perky petite tits and they continue to walk. They make their way to a store and Steve makes her go in to buy a rainbow flag. She gets completely naked and parades through a crowd of people, holding the flag up and behind her like rainbow wings. After that, they get to a kinky club where people wait to see the live sex show. Naked and crawling on her hands and knees, Luna greets them all by kissing their feet, then steers her head towards Steve's cock and locks on with her mouth surprising Steve with how well she can suck a dick. She deep-throats his massive meat while the public take pictures. With the help of a naked audience member, her and Steve bend Luna over the railing and spread her ass, making room for Steve's cock. He fucks her pussy hard and makes her have multiple convulsive orgasms. Steve takes a seat and has Luna sit on his cock reverse cowgirl and she fucks his cock while the people play with her tits and pussy. They return to the railing and another assistant holds up Luna's leg and Steve crams his cock in her ass. For the finale, Steve ties Luna's body to the rafters with her hands behind her back in a full rope suspension. He swings her around and fucks her pussy and ass while she hangs their helpless. Luna is then taken down and sprayed with a hot load as the audience holds up a rainbow flag, cheering with their tits out.",
  "directors": [],
  "models": [
    {
      "name": "Luna Rival",
      "person_id": 60512
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "release_date": "2018-05-28",
  "scene_id": 41979,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "brunet",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Feet",
    "Female Slave",
    "foreskin",
    "Humiliation",
    "Kinky",
    "Leather",
    "Leather Cuffs",
    "natural boobs",
    "Petite",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Straight",
    "Sub",
    "Submission",
    "Suspension",
    "unshaved",
    "Vaginal Penetration",
    "Voyeur",
    "white"
  ],
  "title": "Petite Parisian Luna Rival Gets Wrapped in Rope and Fucked in Public"
}