{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Nineteen year old Anya Krey is a slender young natural beauty who’s new to BDSM. Anya is led through the sunny streets of Madrid by her mistress Tina Kay with a leash and leather collar, wearing only a see-through black dress. Tina cuts Anya’s bra and panties off and throws them in the trash exposing her pussy and petite perky natural tits to the people they walk by. They end up at a local bar full of strangers where Tina introduces a now fully naked Anya to Antonio Ross and Steve Holmes. Antonio has her sit on his lap and shoves his fingers deep into her pussy while the customers play with her tits. Antonio leads her around the bar on her hands and knees while she’s groped by the surrounding people. She sucks Steve’s cock while he lounges on a couch and Antonio slaps her ass hard. Steve slaps her tits while Anya yells to do it harder. Then Steve gets her up on the couch doggie-style and pounds her pussy while Antonio fucks her face. Antonio takes a turn fucking her pussy and Anya still not satisfied with the strength of his fucking demands that he do it harder. Next, Tina gets her feet worshipped and makes Anya lick her pussy while she zaps Anya’s ass with electricity. Antonio fucks her some more with her legs spread while she sucks the tip of Tina’s high heel and Steve hits her with the flogger. After that, Tina puts Anya on the bar and lubes up her fist. Tina works her whole fist inside Anya’s pussy and smashes a vibrator onto her clit while Antonio chokes her, sending her into an orgasmic frenzy. The two guys trade off fucking this insatiable bad-ass deep and hard and have a difficult time keeping up. She wants to be slapped and fucked as hard as they can give it and after giving it their all and two hot loads, it proved still to not be enough.",
  "directors": [],
  "models": [
    {
      "name": "Antonio Ross",
      "person_id": 33540
    },
    {
      "name": "Anya Krey",
      "person_id": 61093
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Tina Kay",
      "person_id": 58964
    }
  ],
  "release_date": "2018-03-05",
  "scene_id": 41975,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "brunet",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Electrical Play",
    "fake boobs",
    "Feet",
    "Female Slave",
    "foreskin",
    "Humiliation",
    "Leather",
    "natural boobs",
    "Petite",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Sub",
    "Submission",
    "unshaved",
    "Vaginal Penetration",
    "Vibrator",
    "Voyeur",
    "white"
  ],
  "title": "Nineteen Year Old Newbie Anya Krey Likes it Rough"
}