{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Welcome back to the busy streets of Madrid. Today, the absolutely stunning brunette femdomme Tina Kay is back to show off her new toy. The anal slut blonde exhibitionist Selvaggia! This gorgeous natural slave loves to get naked in public and pose for the hundreds of people that walk by. Fully barefoot and nude on the filthy public streets. Her perfect natural perky tits exposed, and her round ass bounces as she dances for the public. Everyone has a front row view of her shaved wet pussy. After posing downtown, Tina takes her toy to the park for a few laps around the fountain. Selvaggia is put into tight restrictive leather bondage for all to enjoy. Once she works up a sweat, Tina Kay makes her take a cold dip in the fountain. After a hard day in the hot sun, Tina and Selvaggia hit up a local crowded bar. Selvaggia is made to crawl on her hands and knees like a dog and fetch a bone. Luckily two huge bones are waiting for her. Antonio Ross and Steve Holmes bring out their huge cocks for Selvaggia to gag on. Of course her pussy is hungry too and the two of them deliver a huge hard deep fucking before Tina Kay gets her turn with some lesbian pussy licking. Of course Selvaggia finally gets what she needs, a deep anal fucking and hitachi on her pussy. This gets Selvaggia wild with orgasms. Both studs take turns ramming it up her tight ass before Tina fist Selvaggia's ass wide open. The two guys take it to the next level with a hard DP. The double penetration gets Selvaggia screaming with orgasms which makes the guys cum huge loads all for her pretty face to eat up.",
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Antonio Ross",
      "person_id": 33540
    },
    {
      "name": "Tina Kay",
      "person_id": 58964
    },
    {
      "name": "Selvaggia",
      "person_id": 60749
    }
  ],
  "release_date": "2017-11-13",
  "scene_id": 41976,
  "tags": [
    "anal",
    "bdsm",
    "blonde",
    "blowjob",
    "bondage",
    "brunette",
    "Corporal Punishment",
    "discipline",
    "domination",
    "Double Penetration",
    "female slave",
    "gag",
    "Hitachi",
    "humiliation",
    "leather",
    "lesbian",
    "public",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Perky Blonde Selvaggia Fully Nude in Public Gets Anal Fisted & DP'd"
}