{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Lilyan Red is a masochistic pain slut that loves to be humiliated in public. Her last name pays homage to the color that she prefers her ass to be: a bruised and blistered shade of bright red. She is the kind of young, wanton slut that needs to be put in her place and cowers when scolded in public. Steve shackles her wrists and ankles with standard police handcuff that leave her helpless and completely at the mercy of his sadistic mind. He parades her around a flower market and slowly decorates her to be his whore-vase. Steve cuts holes in her slim dress and adorns her fragile figure with roses and orchids to objectify her body. Her body is now Steve’s vessel and he will use it any way he sees fit. He continues to shred her dress into pieces until her small natural breasts and teeny pussy are exposed to all the prying eyes of the innocent bystanders. Her walk of shame continues and she is dragged to a public fountain. People watch in utter disbelief as this naked woman pathetically hobbles through the water while drool oozes from her mouth gag. Her walk becomes increasingly labored as the pain of hot sidewalk singe’s the bottoms of her feet which cause her to whimper and beg for mercy. Steve knows exactly what kind of mercy a whore likes this wants and he leads her to a local bar where a depraved group of sex crazed maniacs await to devour this young woman. Every flower needs to be watered, so Steve dumps several full glasses of water all over head until she is drenched. He then throws her to the floor and shoves his massive cock into her mouth. A man in crowd gets so excited that he whips out his dicks and crams it down her throat until she chokes and gags from the face fucking. The crowd cheers and laughs at her pathetic need for validation and spanks her ass until it glows bright red. Lilyan is completely overwhelmed by the crowd and surrenders to their most base desires. She is tossed on top of a bar stool so Steve and another man in the crowd can take turns fucking her tight pink pussy. Another person lunges and crams a hitachi onto her swollen and sensitive clit. She cries out and begs to cum but the crowd loves orgasm denial and says “no.” As she fucks and sucks, the pain from holding back her cum is overwhelming and when she can barely stand another second of the torment she is allowed to cum the first of many multiple orgasms. She is tossed to floor so two men can blow massive loads of jizz all over face. She licks it all up and collapses to the floor cum drunk, choked out, and breathless for more.",
  "directors": [],
  "models": [
    {
      "name": "Antonio Ross",
      "person_id": 33540
    },
    {
      "name": "Lilyan Red",
      "person_id": 56297
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "release_date": "2017-11-27",
  "scene_id": 41971,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "drool",
    "Feet",
    "Female Slave",
    "foreskin",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Latinx",
    "multiple orgasms",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pain",
    "Pain Slut",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Straight",
    "Sub",
    "Submission",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "Voyeur",
    "white"
  ],
  "title": "Walk of Shame Slut Lilyan Red, Disgraced, Humiliated, Fucked in Public"
}