{
  "collections": [
    "Device Bondage"
  ],
  "description": "Christina Carter is a well established bondage model who likes to have her limits tested. She gets off on intense floggings and a skillful mixture of pleasure and pain.\n\nGroaning with agony as she is strapped down to a box, hogtied, with her chin placed up agonizingly high on an metal bar. cyd cuts off her shirt to expose her voluptuous breasts and adorns them with nipple clamps and weights. She begs and begs desperately for the vibrator. cyd is amused and plays his sadistic little game, asking Christina to continue pleading with him until he finally gives her what she wants.\n\nNext we hear her cry in agony as she is shackled to a post, her cunt impaled on a spiked electrified dildo. The instructions are simple - keep quiet through a flogging or get shocked. Christina has a difficult time remaining silent, but the promise of the Hitachi’s return and a few painful shocks to the tender flesh of her inner thighs make her a fast learner.\n\nIn the end, Christina reveals she has been broken and that this was the toughest bondage shoot she has ever done in her life, out of the hundreds and hundreds of shoots she has done in her career.",
  "directors": [],
  "models": [
    {
      "name": "Christina Carter",
      "person_id": 10147
    }
  ],
  "release_date": "2013-12-02",
  "scene_id": 4201,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Bondage",
    "Brunette",
    "Caning",
    "Collar",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Electric Dildo",
    "fake boobs",
    "Fingering",
    "Flogging",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Leather Belt",
    "Metal Bondage",
    "muscular",
    "Nipple Clamps",
    "Pain",
    "Pain Slut",
    "Shackle",
    "shaved",
    "Straight",
    "Submission",
    "Tattoo",
    "Vaginal Penetration",
    "Vibrator",
    "Weights",
    "white",
    "Zapper"
  ],
  "title": "KINK Classic 1 of 20. Countdown to relaunch!"
}