{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Mean and sultry BDSM Mistresses Mena Li and Lexy Villa spotted rocker suicide exotic dancer Jynx Hollywood the other day. That's all it takes around here for a lesbian domination threesome. Jynx Hollywood ends up on top of the sybian fucking machine, chained down by her collared neck and cuffed wrists. Lexy enters the dungeon and flips on the sybian while Mena introduces Jynx to her big black strapon dildo. Well, more like her throat. Deep down her throat. Fucking her throat, actually. Lexy raises the vibration and joins Mena in feeding Jynx another 10\" big black rubber dick. The Mistresses take turns intensifying the vibration, distracting Jynx from taking strapon cock face fucking. Mena hates the dress Jynx is wearing and rips it off of her, revealing bouncy porcelain perky nipples. The Mistresses want to see if her pussy matches. Jynx's ass is lifted off the sybian. Since her neck is chained in place, Jynx is kept bent over and ass up. Mena and Lexy inspect their sex slave's pussy and asshole, pleased to see pretty pink. Their black rubber dicks will look great against her pink pussy. Double penetration is the perfect test. This first timer, with her Mistresses training, blossoms into an obedient sex slave, following every order, taking every inch of cock, rough and deep. Jynx's one problem is she didn't ask permission to cum. Time for more sybian torment, vibration kicked up, Mena pushing Jynx down onto the trembling flesh pad. Jynx grasps onto her chains begging to cum desperately. Should she? Watch to find out.",
  "directors": [],
  "models": [
    {
      "name": "Jynx Hollywood",
      "person_id": 61354
    },
    {
      "name": "Mena Mason",
      "person_id": 53759
    },
    {
      "name": "Lexy Villa",
      "person_id": 53826
    }
  ],
  "release_date": "2017-09-07",
  "scene_id": 42036,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Chains",
    "Collar",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Female Slave",
    "Femdom",
    "gloves",
    "High Heels",
    "Hitachi",
    "Leather Cuffs",
    "Lesbian",
    "Rough Sex",
    "Slave",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Sub",
    "Sybian",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "top",
    "Vibrator"
  ],
  "title": "Jynx Hollywood Chained to the Sybian by Mena Li & Lexy Villa"
}