{
  "collections": [
    "Device Bondage"
  ],
  "description": "Tawni is a spunky blonde who has been a stripper for 5 years and a porn star for several months. She likes bondage a lot but claims she can't trust anyone to do it in her personal life. She likes being marked and bruised, and she even put in a specific request to be booked for a Device Bondage shoot.\nThings begin when Tawni is strapped spread eagle to a steel chair. A clear harness gag smears her pretty red lipstick all over her face. Her dress is roughly cut off with a knife and her breasts are covered with clothespins to be used as singletail target practice.\nTawni has had a long week and is tires quickly. She looks nervous, and that just makes cyd feel more sadistic. Adding nipple clamps and weights makes Tawni's breathing heavier before her hair is pulled back and tied to the chains behind her, getting her head backwards in a delicious arc. She is caned lightly, and relieved with a vibrator induced orgasm that stiffens her body as she screams in pleasure. Cyd pulls her nose upwards with a painful nose clamp and ties it off, leaving her to recover from her orgasm in this humiliation fashion.\nLater Tawni finds herself steer tied on a box, wrists to ankles, laying on her side. Two of her holes are stuffed full by poles that keep her fixed in place. She is left with the eroscillator attached to her clit to torture her for a while with its pleasurable vibrations that soon turn to pain when left in place for too long. She tries to take her mind off it by fucking herself on a dildo attached to a pike and comes over and over again until she is nothing more than a quivering heap.",
  "models": [
    {
      "name": "Tawni Ryden",
      "person_id": 12435
    }
  ],
  "release_date": "2007-02-28",
  "scene_id": 4208,
  "tags": [
    "bdsm",
    "blonde",
    "bondage",
    "chains",
    "clothespins",
    "Corporal Punishment",
    "Cut",
    "dildo",
    "domination",
    "Fingering",
    "gag",
    "Handler",
    "humiliation",
    "leather",
    "metal bondage",
    "nipple clamps",
    "pain",
    "harness",
    "straight",
    "submission",
    "vibrator",
    "weights"
  ],
  "title": "Target Practice"
}