{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Our BDSM dungeon has been busier than ever. Some of the hottest lesbian Mistresses bring their sex slaves over for some lezdom fun, like the sexy yet mean Riley Ray. She brought us all a treat when she left Marina Angel, one hot and kinky barely legal vixen, bound on the floor. Her wrists were linked to her leather collar and had a tight chain around her hips. Mistress Riley walks in after leaving her sex kitten unattended for awhile. Riley comes off sweet, yet slaps Marina's pretty face to prove she's not all cookies and cream, dropping loads of spit into Marina's mouth and onto her face. She introduces Marina to her long and fat strapon dildo, making Marina worship it between cock slaps. Marina is a good girl and treats Riley's massive rubber dick the way she instructs. Marina takes it deep down her throat, practically skull fucked versus giving a blowjob. Riley loves watching her strapon disappear in Marina's mouth. We all want to see it open her pussy up. Riley takes care of it. She gets Marina on the couch and teases her pussy with a high speed vibrator, making Marina flinch and beg to cum. You know the rule around here. All subs need to ask for permission to orgasm. She spanks her as well, enough to leave a few hand prints. Riley also makes Marina eat out her asshole, teaching her how to properly rim a worthy Mistress like herself. Now for some deep rough fucking. Riley lubes Marina's pussy up, slaps on her big gag ball over Marina's mouth and sinks every inch of her strapon deep inside Marina's pussy. Once Riley starts, she can't stop. She pounds Marina's pussy in deep, balls to clit, doggy and missionary, using the chain around Marina's waist to pull her back hard and fast. This is lesbian domination and bondage at it's finest.",
  "directors": [],
  "models": [
    {
      "name": "Marina Angel",
      "person_id": 53889
    },
    {
      "name": "Riley Reyes",
      "person_id": 55057
    }
  ],
  "release_date": "2017-09-21",
  "scene_id": 42105,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Chains",
    "Collar",
    "Deepthroat",
    "Dildo",
    "Domination",
    "dungeon",
    "Femdom",
    "Fingering",
    "Fishnets",
    "Gag",
    "gloves",
    "Hitachi",
    "Kinky",
    "Leather",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "thirdparty",
    "Vibrator"
  ],
  "title": "Marina Angel is Dominated by Riley Ray's Strapon Dildo"
}