{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Jasmine Jae has debts. Big ones. That's how she finds herself kidnapped, tied to a chair, and at the mercy of criminal mastermind Cherie Deville. When Jasmine claims she does not have the money, Cherie knows something is fishy. Jasmine has new big beautiful breasts, and gorgeous fake tits like hers do not come cheap. Since Jasmine refuses to repay her loan, Cherie takes her payment from Jasmine's body! Cherie cuts off Jasmine's panties and stuffs them in her tight pussy to get them nice and wet. Cherie crops, flogs, finger-bangs, and teases Jasmine until she comes on camera for a paying audience. This added humiliation only makes Jasmine wetter as she comes hard over and over again. Next, Cherie bites and beats Jasmine's pretty feet before shoving Jasmine's face in her juicy ass. Then Jasmine greedily licks Cherie's pretty pussy until Cherie decides it is time to start fucking her captive slut with a dick on a stick. Jasmine is desperate to come and begs for release as Cherie relentlessly pounds her tight wet cunt. After getting fucked, Jasmine cleans up her mess and sucks on the cock that was just in her cunt. But Cherie is not done yet! She continues to fuck Jasmine, and demands that Jasmine keep a vibrator on her clit as she continues to come over and over. Pleased with her slut, Cherie decides to collar Jasmine and keep her as a pet. More orgasms ensue as Cherie fucks her new fuckdoll hard in her pussy and ass. Cherie spanks Jasmine's ass as Jasmine bounces up and down on her strap-on cock. After fucking both her holes, Cherie goes in between fucking Jasmine's pussy and ass as Jasmine continues to come on her new owner's cock.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherie Deville",
      "person_id": 40439
    },
    {
      "name": "Jasmine Jae",
      "person_id": 59210
    }
  ],
  "release_date": "2017-06-08",
  "scene_id": 42114,
  "tags": [
    "bdsm",
    "bondage",
    "Breast Abuse",
    "collar",
    "Corporal Punishment",
    "dominatrix",
    "Facesitting",
    "Feet",
    "femdom",
    "Fingering",
    "humiliation",
    "Kidnapping Play",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "slave",
    "straight",
    "strap on",
    "vibrator"
  ],
  "title": "Big Tit Slut Gets Fucked by Loan Shark Cherie Deville "
}