{
  "collections": [
    "Electrosluts"
  ],
  "description": "Ingrid Mouth returns in this shock-filled update of Electrosluts! Ingrid finds herself bound and gagged in Lea Lexis' lesbian electro-dungeon. Lea is all too pleased to have Ingrid at her mercy and will not touch Ingrid unless electricity is coursing through Ingrid's body. She inserts an electrified anal plug into Ingrid's ass and cranks up the electricity. While Ingrid writhes on the floor, Lea gets the violet wand touch plate set up. Now that her touch is electric, Lea is eager to get her fingers on Ingrid. Ingrid giggles and screams as Lea's electrified fingers and tongue find all her sensitive spots. Lea uses a mini conductive flogger to shock Ingrid's wet tongue and wet cunt. Next Lea straps on a hard cold electrified metal cock for her electroslut. She slips the Samurai strap-on into Ingrid's tight pussy as Ingrid strains in her rope bondage. Once the electricity is turned on, Ingrid gets a hard deep fucking from the gorgeous Lea. Her giggles turn into screams as she orgasms and her pussy clamps down on Lea's electric cock. Once Lea is done fucking her electroslut, it's time for Ingrid to pleasure her. Ingrid is decorated with e-stim sticky pads on her belly and thighs. Lea turns up the electricity, spits in Ingrid's mouth and makes her produce more saliva before Ingrid gets the honor of licking Lea's pussy. Lea grinds down on Ingrid's face as she crops Ingrid's thighs, belly, and tits. After coming hard on Ingrid's face, Lea breaks out the taser. She once again offers Ingrid more pleasure...as long as she takes more pain! Lea sits on Ingrid's back, making her masturbate and grind down on a vibrator. As Ingrid gets closer and closer to coming, Lea continues to threaten her with the taser. And Lea's threats are never empty! Ingrid gets shocked multiple times as she struggles to come over and over again!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Lea Lexis",
      "person_id": 17836
    },
    {
      "name": "Ingrid Mouth",
      "person_id": 53766
    }
  ],
  "release_date": "2017-07-27",
  "scene_id": 42119,
  "tags": [
    "bdsm",
    "bondage",
    "cattle prod",
    "Corporal Punishment",
    "dominatrix",
    "dungeon",
    "Electrical Play",
    "electricity",
    "Electro Clamp",
    "electro dildo",
    "electro plug",
    "Facesitting",
    "femdom",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "Pussy Eating",
    "rope bondage",
    "slave",
    "straight",
    "strap on",
    "taser",
    "TENS Unit",
    "vibrator",
    "violet wand",
    "Zapper"
  ],
  "title": "More Pleasure, More Pain: Ingrid Mouth Returns!"
}