{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Blonde pain slut Dresden is nervous as she enters the dungeon of the renowned Mona Wales. Luckily, Mona knows how to make shy slaves open up. First, Dresden strips for her Mistress. Once naked, it’s time for Dresden to find liberation in bondage. Mona buckles Dresden in arm binders so her pet feels nice and helpless. Bound and unable to escape from her desires, Dresden admits she wants to be a good little ass eater! Now the real training begins! Dresden gets her tits cropped and her round ass spanked red. Dresden struggles and giggles as her feet are tickled and cropped. Dresden worships Mona’s shiny black boots and legs. She works her way up to Mona’s juicy pussy and is rewarded by her Mistress coming all over her slutty face. Then Dresden gets finger banged and gets her cunt vibrated to multiple orgasms while Mona plays with her tits. Even after coming, Dresden is still horny - she writhes on the ground and rubs her clit all over Mona’s boots. Next, Dresden is bound and ready to suffer. Mona warms her pet up with the flogger before putting small metal rubber-tipped clothespins on Dresden’s tongue and tits. Then she clamps Dresden’s slutty pussy shut with more clothespins. Once Dresden is all decorated Mona continues to use her pet’s warm wet mouth. Dresden licks her Mistress’ pussy to more orgasms and she even gets to eat her Mistress’ ass. Mona is so pleased with her pet, she vibrates Dresden’s wet throbbing pussy to more orgasms. Finally, Dresden is draped in heavy metal chains and fucked! Mona takes Dresden’s pussy first and fucks her slut nice and hard with her strap-on cock. Once she’s wrecked that hole, she turns her attention to Dresden’s ass. Dresden begs to get fucked faster and harder, and Mona gives this anal whore exactly what she asks for. Dresden’s moans get louder as Mona spits all over her, making Dresden even sloppier and more filthy. Dresden comes hard on Mona’s dick and even when Mona is done with her holes, there’s no rest for the slutty. These two babes are all over each other as Mona continues to vibrate Dresden’s cunt to orgasm after orgasm after orgasm.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Dresden",
      "person_id": 58978
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2017-08-03",
  "scene_id": 42123,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Chains",
    "Clothespins",
    "Corporal Punishment",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Pussy Eating",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "toned",
    "white"
  ],
  "title": "Liberation in Bondage: Dresden Returns!"
}