{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Magician Mona Wales is fed up with the attitude she’s getting from her assistant, Christina Carter, so one day Mona decides to put on a special magic show. First she exposes Christina’s big breasts, next she locks Christina in a cage, and finally she magics Christina into bondage. The gorgeous Christina is helpless, tied with her legs spread, and no chance for escape. Mona flogs, spanks, and slaps her assistant, making her admit that she is a huge whore and disgusting pervert. Christina struggles beautifully in her bondage and begs to come as Mona plays with her cunt. Christina’s lesson continues as she is bound and made to be a human chair for her Magical Mistress. Mona spanks Christina’s round bottom and has Christina worship her fishnet-clad feet. After licking and kissing Mona’s feet, Christina gets to worship Mona’s delicious pussy. This human chair is good at pleasing her Mistress, and Mona comes all over Christina’s hungry wet tongue. Horny from pussy licking, Christina begs to be impaled by Mona’s big cock. Mona grants her assistant’s wish, and fucks Christina hard and deep until she comes. The orgasms continue as Mona squirts all over her human furniture, before allowing Christina more orgasms and making Christina squirt all over her fingers. For her last trick, Mona makes her dick disappear in her assistant’s holes! Mona gives her assistant just what she deserves – a hard thorough strap-on fucking! Christina moans and begs to get fucked harder as Mona penetrates her pretty pink pussy. Christina then bounces up and down on Mona’s cock, ramming it deep in her cunt. In between fucking, Mona licks and finger bangs her pet’s pussy to more orgasms! Next Mona fucks her assistant’s tight asshole. Christina loves getting fucked in the ass and can’t stop coming multiple times all over Mona’s cock!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Christina Carter",
      "person_id": 10147
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2017-06-22",
  "scene_id": 42121,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Cage",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "High Heels",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "white"
  ],
  "title": "Make That Dick Disappear: Bombshell Christina Carter Returns!"
}