{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "Jasmine Jae wants it all... the money, the power, and the cock! She stages her own kidnapping, then sets up a fake ransom video, all for the purpose of extorting millions from her crooked husband. But she loves the plan a little too much. The excitement gets her pussy so hot and wet, she hungrily submits to the sexual lust of the gang that's aiding her wicked plan! She desperately begs them to fuck her, and they immediately descend on her. Jasmine sucks all their hard cocks, sloppily choking herself on them, jerking them, and working them in her throat, ever eager for more. They throw her on the couch and proceed to fuck every hole. In no time she's taking double vaginal with two rock hard cocks pounding in her pussy, filling her airtight. She loves every inch thrusting in her sweet wet cunt as she begs for more. Before she knows it she's taking DP with a dick pounding her wet pussy and another plowing her gorgeous ass. Jasmine is utterly insatiable, wanting more, more, more! When all her holes have been deep fucked hard, she begs for all the cum... EVERYWHERE! Jasmine takes an anal creampie, then a vaginal creampie, and the rest of the hot seed is blown all over her face and in her mouth. The men are spent, but Jasmine remains on her knees, lost in her world, coated in sweat, with every hole twitching and filled!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Damon Dice",
      "person_id": 57051
    },
    {
      "name": "Jasmine Jae",
      "person_id": 59210
    },
    {
      "name": "Jon Jon",
      "person_id": 35195
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Will Havoc",
      "person_id": 46285
    }
  ],
  "release_date": "2017-05-17",
  "scene_id": 42127,
  "tags": [
    "Airtight",
    "Airtight Playlist",
    "Anal",
    "Anal Creampie",
    "BDSM",
    "Black",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Choking",
    "Corporal Punishment",
    "Creampie",
    "Double Penetration",
    "Double Vaginal",
    "Gangbang",
    "Kidnapping Play",
    "Role Play",
    "Rough Sex",
    "Straight"
  ],
  "title": "The Big Bamboozle"
}