{
  "collections": [
    "Device Bondage"
  ],
  "description": "Ariel X is back and ready to submit to the most sadistic fucker on the interwebs. Ariel and The Pope have been doing scenes together for over a decade and every time the bar gets set a little higher than the last time. She has a way of inspiring him to do evil things that only she can handle, and handle with a smile. Ariel is as much of a masochist, as he is a sadist. We begin with her on her back and her pelvis thrusted in the air and held there with cold steel. Her flesh is assaulted with a plethora of impact implements that leave it red and in agony. After her pussy is fucked to his liking The Pope rips orgasms from her more than willing pussy. Next we bend her over showing off her amazingly toned body, with emphasis on that amazing ass. More torment, which leads to more suffering and screams devastate Ariel to the core. Again her pussy is drained from fucking, anal fucking, and squirting orgasms. The Pope fucks Ariel's mouth and commands more squirting from her pussy. In the final scene Ariel is zip tied to a bare wire frame box spring, that is mounted to the wall. The electricity that flows through her body is monumental. We begin with TENs pads, and quickly escalate to the cattle prod.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-06-01",
  "scene_id": 42133,
  "tags": [
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Brunette",
    "Cattle Prod",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Extreme Torment",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "The Pope",
    "the wall",
    "toned",
    "white"
  ],
  "title": "Taking One For the Team"
}