{
  "collections": [
    "TS Seduction"
  ],
  "description": "Jessica Fox is a tall, lusty beauty, back to put another eager little man in his place. This time she’s domming her boss, Corbin Dallas, who likes to call the shots from 9 to 5, but loves when Jessica run the show after hours. Jessica has him locked up in a closet, where he’s been left all night, much to his excited displeasure. When she finally returns, he’s outwardly livid, but secretly thrilled to be treated so poorly. Jessica lets him out with the understanding that his punishment is only beginning. She orders him to strip, then flogs him, swatting him in the face, then the chest, then gently over his cock. Corbin’s so excited he can’t help by grin, knowing Jessica’s going to give him everything he wants in every way he fears. First she makes him suck her rock hard cock, face fucking him and wedging it in his mouth tight, just to delight in his discomfort. When the spit is running down his neck she leads him to the couch and commands him to eat her sweet ass. Jessica doesn’t normally demand this, but Corbin’s so ready to worship her she thrills at every lick and thrust of his eager tongue. When Corbin slides his finger into her ass, she stops him right there, and makes clear that it’s HIS ass that gets fucked. Jessica puts him on his knees and fucks him from behind, owning him in the least intimate of positions, just so he knows he’s her little bitch. When she’s tired of pounding him from behind she puts him on his back, so she can loom over him and fuck him missionary. This puts him in the perfect position to cum all over himself. She scoops up his cum and feeds it to him, hammering home his subservience. Jessica then shoots her hot load onto his face and into his mouth, with the threat of putting him back into his little cage. And Corbin can’t help but smile.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    },
    {
      "name": "Jessica Fox",
      "person_id": 17013
    }
  ],
  "release_date": "2017-05-30",
  "scene_id": 42131,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Cage",
    "Cock Worship",
    "Latinx",
    "Male Sub",
    "natural boobs",
    "Role Play",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "white"
  ],
  "title": "Out Foxed, Flogged, And Fucked"
}