{
  "collections": [
    "Hogtied"
  ],
  "description": "Ashley is the girl next door that acts like the masochists pain slut that all of dream about. She has an innocence about her that is just her subtle way to make you want to hurt her more. The bondage will be more a part of the torment than just restraining her. Every time The Pope works with Ashley the brutality gets turned up an extra notch, meaning all of you that crave total domination and severe brutality will not be disappointed. Her arms are pulled into a strappado in the first scene with her legs crossed. The whips and floggers turn her milky flesh to a hot pink color in no time. The room fills with her screams of agony, and that just motivates The Pope to keep the level of intensity all the way up. Next she is put in a grueling tie that limits almost all mobility. Her exposed skin is assaulted along with her feet and pussy. Even the pleasure is going to torment her today. We move on to the suspension, which is a single point around her hips and held in place by her leg. This is one of the most brutal suspensions for anyone to have to endure. Her breath is controlled just like her orgasms and only he decides when she can have either of them. In the final scene we have Ashley's legs spread wide and her pussy is ravaged by The Pope as he punish fucks her into submission.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ashley Lane",
      "person_id": 52112
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-06-22",
  "scene_id": 42146,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "domination",
    "Feet",
    "Fingering",
    "Handler",
    "humiliation",
    "pain",
    "pain slut",
    "rope bondage",
    "straight",
    "submission",
    "suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Extreme Domination and Torment in Mind Blowing Bondage"
}