{
  "collections": [
    "Device Bondage"
  ],
  "description": "Ashley has every look that makes you think that she is that innocent girl next door. Just remember that looks are deceiving, and if you have learned anything from watching her shoots, it's that she is far from innocent. She is one of the biggest pain slut that have ever graced the pages of Device Bondage. Her masochism is so extreme that we offer you a warning that this is not for the weak of heart.\nWe begin with her standin with her hands pulled high above her head and leather belts to restrict movement and make her helpless. The Pope enters and begins cover her flesh with clothespins. all of the are meticulously placed in every sensitive area of her skin. He then takes this brutality to the next level by flogging them off of her until she almost collapse from the pain.\nNerxt she is place in the throne of suffering and locked into place with steel traps. Her head is covered and her sight is taken away. Another leather belt is added to immobilize her head, then the suffering begins again. Her body is subjected to multiple forms of brutal torment; floggers, canes, whips, etc.\nIn the final scene, Ashley is spread out on the floor in the most helpless position known to man. Don't let the simplicity of the bondage fool you; it is impossible to escape and every inch of her flesh is exposed and she has no way of stopping The Pope from terrorizing her. He controls every last thing about her including her breath. Nothing happens unless he permits it and now her orgasms will be what he drains from her in a squirting mess all over the floor.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ashley Lane",
      "person_id": 52112
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-05-18",
  "scene_id": 42147,
  "tags": [
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Extreme Torment",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Leather",
    "Leather Belt",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "The Pope",
    "white"
  ],
  "title": "WARNING!! DEVASTATING TORMENT AND EXTREME SUFFERING!!!"
}