{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Cheyenne Jewel is our muscular red head cowgirl wrangler who has beat out one of our finest wrestlers, Mia Li, to make it to the finales. She is taking out our toughest wrestler, ranked #1, our hot, sexy muscular MILF, Izamar Gutierrez. This is intense 100% competitive grappling and sexual fighting at it's finest. The action is back and forth, with each girl getting leg scissor holds, submissions, chokes, sweeps, and throws. Both girls do rough fingering on each other, trying to make the other cum on the mats. When the buzzer goes off, we have a winner. The Loser is tied up in bondage, ball-gaged, stripped of her colors spanked, tit slapped and made to take a huge winner cock while the winner wears a strap on and torments her with verbal humiliation. While the winner fucks the loser's pussy, she sneaks a thumb into the loser's tight asshole to let her know who's boss. The winner face sits the loser and uses her face and mouth to climax to orgasm. The winner's big Beautiful muscular ass bounces off of the lips and tongue of the humiliated loser. The loser is thrown in to a beautiful doggy style position that shows off the losers curves and muscular physique. While the loser is in doggy position like the little bitch she is, the winner pulls her hair and fucks her hard. Since there were two submissions in the wrestling segment, the winner gets even with the loser by making her tap out to two brutally strong Leg scissor squeezes. The Winner is deemed the Summer Champion for 2017 and calls out Mistress Kara for next season! This sex fight is over but the battle isn't over. These girls will meet next season in another exciting sex fight competition.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    }
  ],
  "release_date": "2017-08-09",
  "scene_id": 42150,
  "tags": [
    "Anal",
    "Bondage",
    "Brunette",
    "Champion",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Latin",
    "Lesbian",
    "LezDom",
    "MILF",
    "Muscle",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "sex fight",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Big 10 Summer Tournament Finale. Muscle vs Muscle"
}