{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "We've found another curious hot young thing who definitely loves sex of all kinds. She's done some BDSM play yet not at the level we offer here at Sexual Disgrace. We definitely want to see if she can endure her own disgrace. Fetish Network presents Zoey Foxx. She's introduced with our trusty sybian fucking machine, a delightful surprise for all of our sex slaves. This time around, the sybian is drilled in place high off the floor. She's kept on with cuffs around her wrists and ankles to the wall. Our hot Foxx finally meets her Master with a flip of a switch and the constant vibration of the sybian. Zoey struggles immediately to contain herself from the all the orgasms it's causing. Her Master pulls her hips down onto the sybian, clit pulsed with intense vibrations, making her ride it. He reaches up and chokes her a bit. That usually makes his sex slaves cum harder. She's doing well so far in her slave training. Next, he brings her down onto a crate in the doggy position. Her Master inspect his sex slave's pussy and asshole, pleased to see pretty pink. Foxx quickly learns how an obedient sex slave should be, following every order, taking every inch of cock, rough and deep, begging for forgiveness for being a dirty whore. Her Master goes back and forth from mouth to pussy, pussy to mouth, using her spit as lube and making her clean his dick of her cum. He shoves his dick deep down her holes, making her moan and scream like a good slut should, pounding her in. He even moves around a few clothespins around her body, pinching her sensitive skin and pierced nipples. Seems Zoey Foxx is a natural at bondage and being a good submissive whore ready for domination.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Zoey Foxx",
      "person_id": 44716
    }
  ],
  "release_date": "2017-09-28",
  "scene_id": 42170,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Choking",
    "Clothespins",
    "Crop",
    "Deepthroat",
    "Domination",
    "dungeon",
    "Female Slave",
    "Fetish",
    "Leather Cuffs",
    "Male Handler",
    "master",
    "Pierced Nipples",
    "Rough Sex",
    "Slave",
    "Straight",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "the wall",
    "thirdparty",
    "Vaginal Penetration"
  ],
  "title": "Zoey Foxx Becomes the Perfect Sex Slave with Proper Training"
}