{
  "collections": [
    "The Training Of O"
  ],
  "description": "The adorably bratty Juliette March is the Queen of all Pain Sluts and is super excited to be back for her fifth brutal round on The Training of O. James Mogul knows just how rough Juliette March likes it. She's no stranger to Kink, and we all know she likes a lot of pain. It seems as though she actually needs it to cum. James Mogul shows no mercy punishing Juliette March whenever she breaks the rules whilst being trained on how to not act like such a petulant little brat. In the first scene of The Training of O, Juliette March is gagged, standing in a rigid predicament. Juliette's slutty pussy is securely bound with rope to pieces of bamboo. One piece has a dildo at the end of it, stuck up inside her dripping cunt, all while John Strong incessantly flogs her ass and back, as James gives her a clamp for each nipple and the days lesson which is to keep proper eye line. Without a rest, James Mogul unleashes John Strong's fat cock which eagerly complies to destroy Juliette's tight anticipating ass and pussy and to pound it deep and mercilessly. After having multiple orgasms from a thorough face-fucking ass-fucking and pussy-fucking, it proves to not be even close to enough cock to satiate Juliette March's greedy, insatiable pussy. So more cock she shall have! Juliette screams like a little bitch from all the nipple abuse, pussy caning, pussy flogging, hard pussy and anal fucking, all while wearing a gas mask. The training continues with face-fucking, ass whipping, flogging and caning, until she's choked and fucked in bondage just the way her whorish needs demand. She couldn't be happier, getting tormented and punished so beautifully. The Training of O is like a spa day for the Queen of all Pain Sluts, Juliette March.",
  "models": [
    {
      "name": "Juliette March",
      "person_id": 22072
    },
    {
      "name": "John Strong",
      "person_id": 17050
    }
  ],
  "release_date": "2017-05-09",
  "scene_id": 42179,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "Breast Abuse",
    "caning",
    "Corporal Punishment",
    "dildo",
    "discipline",
    "extreme torture",
    "female slave",
    "flogging",
    "Gimp",
    "humiliation",
    "mask",
    "master",
    "multiple orgasms",
    "nipple torture",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "straight",
    "whipping"
  ],
  "title": "Petulance Training: Juliette March"
}