{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Blonde and sexy Zoey Monroe wants to be a bad girl.\nXander Corvus gave her a taste of the good life when he ensnared her into his tangled web of criminal activity and now she wants his help in pulling off a credit card scam. \"Crime is exciting\", she says and tries to persuade him with a hot and sloppy deep throat blow job. He takes the bait but warms her not to fuck everything up.\nAfter a totally botched job Xander comes home to find Zoey handcuffed to a table with a ball gag in her mouth. What happened? She is ambitious but just doesn't know the ropes. The only rope she knows is the rope Xander ties her up with to teach her a lesson in obedience. First he spanks Zoey's smooth round ass until its bright red and then he puts her on her knees in doggie style and flogs her while she apologizes for screwing up. He pulls her lacy panties down and fucks her pink wet shaved pussy with his big thick cock. He fingers her asshole and then crams his huge dick inside. Zoey needs some discipline and Xander is having a blast punishing all her holes.\nThen he puts her on her back in tight rope bondage with wrists tied to ankles so every hole is fuckable. Ball gag in mouth Zoey gets its good first in her perfect little pussy and then in her tight ass. Xander slaps her firm perky tits while he bangs her inside out until Zoey projectile squirts all over the place. Check out Blackmail Lust 2: American Criminal and watch Xander take Zoey's disobedient ass over the top while he shows her who is in charge!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Xander Corvus",
      "person_id": 46000
    },
    {
      "name": "Zoey Monroe",
      "person_id": 46520
    }
  ],
  "release_date": "2017-06-02",
  "scene_id": 42197,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Gag",
    "High Heels",
    "Humiliation",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "smooth",
    "Straight",
    "Submission",
    "top",
    "Vaginal Penetration"
  ],
  "title": "Blackmail Lust 2 American Criminal"
}