{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Beautiful brunette Casey Calvert is in over her head. Her boyfriend Tommy Pistol wants her to steal some business information from her employer. She is hesitant but after she has a great time sucking Tommy's cock she follows through until she is caught by her tall blond goddess of a coworker Alexa Grace. To gain her trust back Casey goes down on Alexa and eats her shaved pussy until she cums. After Alexa makes Casey call Tommy and tell him she's not going to steal for him anymore Tommy comes knocking on the door to get back what is his. He throws Alexa out of the house, ties Casey up in rope bondage and fucks her good while Alexa watches through the window outside. Tommy's cock is looking pretty appetizing to Alexa so she gets in on the action. A threesome ensues with pussy eating, ass licking, hair pulling, face sitting, rough blow jobs, fucking and flogging. After that both Casey and Alexa are tied up tight while Alexa and her small perky tits get off with the vibrator and Tommy fucks both of them back and forth. Alexa and her Hitachi are a sight to see as she can't stop cumming from all the action. Tommy fucks Casey in the ass and then makes both of the girls suck his dick until he gives these chicks a facial. Check out these two hot sexy gorgeous gals get cum drunk doing Dirty Business!",
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Alexa Grace ",
      "person_id": 59622
    },
    {
      "name": "Casey Calvert ",
      "person_id": 36437
    }
  ],
  "release_date": "2017-06-16",
  "scene_id": 42199,
  "tags": [
    "anal",
    "ass licking",
    "bdsm",
    "blowjob",
    "bondage",
    "brunette",
    "Corporal Punishment",
    "domination",
    "Face Sitting",
    "Facial",
    "flogging",
    "hair pulling",
    "Hitachi",
    "humiliation",
    "Pussy Eating",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "threesome",
    "Vaginal Penetration",
    "vibrator"
  ],
  "title": "Dirty Business"
}