{
  "collections": [
    "The Training Of O"
  ],
  "description": "Fresh faced and eager; the stunning new bondage whore Moka Mora was blushing with excitement when she met James and Tommy for the first time. She likes it raw and was hungry for it all. But enthusiasm for hard fucking alone isn't enough to make a girl into a real submissive. Very few have the discipline, comportment, and appreciation that James demands from his potential new sluts. Moka is pushed almost immediately to vocalize her experiences to the skilled observations of her trainer. James senses that Moka is intimidated by the experience and probes deep into her psysche and demands her attention. She lacks focus. She lacks discipline. She lacks the ability to anticipate her trainers desires. But James approaches cautiously as one might handle a spooked animal. He soothes her as Tommy wales away on her ass and pussy with a flogger. She remains focused on James, processes her first experience, and has her first success as a wanton submissive. It was little more than a meek expression of gratitude, but her breathy utterance of, \"Thank you sir,\" let's James know that he is on the right track. He throws her a bone to keep her placated and engaged by telling her very quietly, \"Good girls get rewards.\" She expressed a keen desire to experience electro stimulation and James was only happy to oblige. Electro-stimulation pads are taped to her inner thighs and she was placed into a squatting position over a vibrator. Here she learned to exude unflinching gratitude as her handler stimulates her pussy and thighs with both pain and pleasure. All the while Tommy is jamming a long dildo down her throat as if to coax the gratitude out her vocal cords with the skilled manual manipulation that one might expect from a master plumber of whore holes. Even as she gags she whispers, \"Thank you sir.\" She moans with pleasure as the vibrator edges her towards an orgasm only to be denied at the last second by the rush of an electro-shock. Exhausted from her first two scenes, Moka is now ready to have her holes examined to determine their worthiness. And Tommy is only too happy to oblige. He fucks her pussy, her asshole, and her mouth relentlessly, slamming the table that she is on clear across the room. He doesn't let up and slides his cock in and out of her tight asshole and then directly into her tiny pussy. She coo's with delight and whispers never ending thanks and praise for all the attention that she has received from her stewards. James told her at the beginning of the shoot that all good girls get rewards, so Tommy delivers her pussy and asshole a big cream pie. She says thank you over and over again as she watches Tommy's load ooze out of her broken whore holes. Moka learned her lessons well.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Moka Mora",
      "person_id": 59853
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2017-05-23",
  "scene_id": 42196,
  "tags": [
    "anal",
    "Anal Creampie",
    "ball gag",
    "bareback",
    "bdsm",
    "bondage",
    "cock sucking",
    "Corporal Punishment",
    "dildo",
    "discipline",
    "Edging",
    "electrode punishments",
    "female slave",
    "flogging",
    "Gimp",
    "Handler",
    "high heels",
    "Hitachi",
    "humiliation",
    "Male Handler",
    "master",
    "oral sex",
    "orgasm denial",
    "pain",
    "predicament bondage",
    "role play",
    "rope bondage",
    "straight",
    "vibrator"
  ],
  "title": "Breaking in the New Recruit: Moka Mora"
}