{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Hot, big ass brunette cutie Abella Danger is The Sex Toy for Xander Corvus. Every day he comes home from work, pours a drink and gets his sex toy out of the closet where he stores her. Adorned in nipple clamps, ball gag, leather straps, stockings and garters with fetish high heels Xander leads his ready and willing sex slave by a leash into his bedroom. She can barely walk because her legs are strapped together in tight leather bondage making each step challenging and precarious in those spiked heels. Abella's mouth is watering as she is excited to get the chance to please her master. Xander's fat cock slides into her mouth and down her throat. She can handle every inch of it. He gives her a good deep throat slobbering face fuck with his massive hard cock and she just can's get enough. Xander straps Abella's legs out wide open into the splits position and flogs her ass until she is screaming with pleasure. Her back arches and she shakes her curvy ass at Xander begging for more. He flogs her pussy making her squeal but it just makes this pain slut horny and want to fuck. What more could you ask for in a Sex Toy? With Abella's face plastered to the floor and her arms chained and locked to the couch Xander gives her pussy a deep hard fucking as she is upside down. Submission has never felt so good.\nOnto the bed now Abella is on her back, legs spread open and wrists strapped to her ankles. Xander flogs her pussy and perky natural tits until he crams his meaty cock back inside her. He canes her sensitive feet and fucks her ass and pussy until she cums again and again. Xander shoots his load all over Abella's ass and then puts his Sex Toy back in the closet for next time. Now that was fun!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Xander Corvus",
      "person_id": 46000
    },
    {
      "name": "Abella Danger",
      "person_id": 56157
    }
  ],
  "release_date": "2017-06-09",
  "scene_id": 42198,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Best of SAS",
    "Big Ass",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "Feet",
    "Fetish",
    "Gag",
    "High Heels",
    "Humiliation",
    "Leather",
    "master",
    "Nipple Clamps",
    "Nylons And Stockings",
    "Pain",
    "Pain Slut",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "The Sex Toy"
}