{
  "collections": [
    "The Training Of O"
  ],
  "description": "We start in a well lit white bedroom with Dolly Leigh sitting at the edge of the bed with her skirt up, fingering her pussy. James Mogul, dressed in all black is asking her questions about her fantasies while The Gimp, Owen Grey jerks off in the corner. Dolly has often had the fantasy of being taken, tied up, and taught how to worship cock and wants nothing more than to be molded into an observant obedient fuck toy. James Mogul along with the help from our Gimp, Owen Grey and his massive cock are both here to fulfill all of Dolly's slutty desires. James gets right to it and ties Dolly's wrists with rope behind her back, lowers her to her knees holding only her head and guides Dolly to Owen's cock to give her the first lesson of the day.\nCock Worship. He explains that there are four steps to cock worship; observe the cock, kiss the cock, pleasure the cock, and indulge in the cock. Although challenging at first, a few cracks of the flogger helps Dolly get it right. Next James has Dolly standing in a french doorframe, tied with rope to all six hinges along with breast bondage and a vibe tied to her inner thigh, smashed up against her pussy. Also on her thigh are electrodes sending a charge into her leg from a tens unit. Mogul commands Dolly to not cum despite how much she would like to. She lets one slip and pays for it with the flogger. Dolly holds back another orgasm as long as she can and gets rewarded with Moguls thumb right up her pussy, pressing on her g-spot, sending her flying in the air for the biggest orgasm of her life. Next Dolly is tied up and fucked in pile-driver, doggie and missionary. Owen \"The Gimp\" Grey stretches Dolly's pussy with his fat dick while Mogul crops her pussy and zaps her natural tits with high voltage if she breaks any of the days rules.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Dolly Leigh",
      "person_id": 55868
    },
    {
      "name": "Owen Gray",
      "person_id": 39181
    }
  ],
  "release_date": "2017-06-20",
  "scene_id": 42203,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Breast Bondage",
    "Cock Worship",
    "Corporal Punishment",
    "Discipline",
    "Electrode Punishments",
    "Female Slave",
    "Fingering",
    "Gimp",
    "High Heels",
    "Humiliation",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Straight",
    "Tens Unit",
    "white"
  ],
  "title": "Pleasure Training: Dolly Leigh"
}