{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Tall trim raven haired beauty Alex Harper goes to Xander Corvus's huge house in the hills, his \"fortress of solitude\" far away from it all and no neighbors for miles. She is there to sign a shady business deal, something that includes a $10,000 bonus so she is game. Upon leaving, Alex can't find her keys or her phone so there is no way out. Xander seduces her into thinking she is just right for a particular client, a buyer of sorts but first he needs to try her out to make sure. He ties her wrist with a leather strap, puts her on her knees and overwhelms Alex with his huge cock. Her full red lips slide up and down his cock, her mouth can hardly contain it all. Xander puts nipple clamps on her perfect natural tits while he thrusts his hard dick down her throat. It's a hot blow job. Alex gets scared, tries to run off and hide but Xander finds her and gives her the treatment she deserves.\nFirst he puts her on her back with her wrists strapped to her ankles so she is exposed and accessible. Her long lean legs are open wide and she is wearing some sexy thigh-high nylons. She has a sensory deprivation mask on her eyes and a mouth gag keeps her pretty lips open. Flogging, pussy fucking and anal, Xander stretches her holes out with his cock until she is loving it. Then he flips her over into doggie style, still strapped down tight, and fucks her all over again until her ass is gaping. Xander's dick looks so big in her tight little ass! How can she take it? Find out in Anal Acquisition.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Alex Harper",
      "person_id": 60270
    },
    {
      "name": "Xander Corvus",
      "person_id": 46000
    }
  ],
  "release_date": "2017-06-30",
  "scene_id": 42201,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Curvy",
    "Deprivation",
    "Domination",
    "Facefucking",
    "Flogging",
    "Gag",
    "Gaping",
    "Humiliation",
    "Leather",
    "Mask",
    "natural boobs",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Anal Acquisition"
}