{
  "collections": [
    "The Training Of O"
  ],
  "description": "It is just another day in the Corvus household. The sun is shining, birds are singing, the house is spotless, and his slave Summer Day is wearing nothing but nylons and heels and is ready to serve him when he gets home from a long day at work. What could possibly go wrong? Maybe it is too good to be true or maybe Xander has simply had a horrible day, but irregardless of reason, he is looking for a fight. Just two simple mistakes are all that it takes for him to have just cause to punish his little house slave slut. First he becomes irate at the sight of the wrong liquor being served to him by Summer. And, if that isn’t bad enough, he notices that her thumb is touching to top of the silver serving tray that his incorrectly poured drink sits upon. How can Summer be so careless? The years of training and hard work that her master has poured into shaping every detail of her life seems to be squandered in just a matter of seconds. Maybe she just wants to be punished? Xander takes pause and wonders if the perfection that he demands from his wanton house whore is even possible. After considering his options he decides to invest himself one last time to see if Ms. Day can stand up to the rigor of his huge cock, his immaculate eye for perfection, and his unflinching standards. In short, Summer Day needs correction. First she is tied tightly down with rope bondage to the dining room table with her arms spread apart. Serving trays are placed in her hands in predicament bondage to teach her to never again place her thumbs on the top part of the tray. After tenderising her skin relentlessly with a big black leather flogger, Xander decides to cleanse Summers whore mouth of its impertinence. And there is only one way to wash a mouth clean and that is by jamming a giant dick as far down her throat as possible. She gags and contorts her trachea like a skilled oral gymnast to find just enough space to suck her medicine deep into her esophagus as she gets brutally face fucked. Gasping for air, choking on her own spit, she doesn’t relent and continues to devour Xanders massive fuck stick. She is committed to proving her worth and begs to be corrected further. Xander is pleased with her progress. Eager to continue her program of redemption Summer proceeds to take his giant cock in her pussy and then in her tight asshole with some hot rough sex. She gapes as Xander switches back and forth between both of her whore holes. She moans and arches her back while being fucked doggie style and then opens her mouth wide for some ass to mouth attention. Her perfect natural tits gyrate as she rides Xander in reverse cowgirl. Her soft round ass twerks as she mounts his monster cock from the top while getting a spanking that turns her natural ass a bright shade of red. The ropes restraining her tighten as Xander finishes her off tied to a table spread wide open in a missionary position. She pleads for more and moans with delight as she gets deeply penetrated in both her cunt and asshole. Gasping, she pleads for approval and finally Xander acquiesced and rewards her with a big load of cum all over her tits and face. He feeds her the mess and she licks his fingers clean. Summer Day learned her lesson and she just might have what it takes to be a true “O.”",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Summer Day",
      "person_id": 59412
    },
    {
      "name": "Xander Corvus",
      "person_id": 46000
    }
  ],
  "release_date": "2017-06-06",
  "scene_id": 42202,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Athletic",
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Choking",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "Leather",
    "master",
    "natural boobs",
    "Nylons Stockings",
    "Oral Sex",
    "Predicament Bondage",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "Spanking",
    "Straight",
    "Submission",
    "toned",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "All Natural Blonde Teen Gets Trained to Fuck, Suck, and Serve Her Master: Summer Day"
}