{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "We’ve found another curious Latina hottie who definitely loves sex of all kinds. She’s done some BDSM play yet not at the level we offer here at Sexual Disgrace. We definitely want to see if she can endure her own disgrace. Fetish Network presents Valentina. She’s introduced to our trusty sybian fucking machine, a delightful surprise for all of our sex slaves. This time around in rope bondage, she’s kept sat on the fucking machine, wrists tied spead apart to her side. Valentina finally meets her Master with a flip of a switch and the constant vibration of the sybian. She struggles immediately to contain herself from the all the orgasms it’s causing. Her Master pulls her hips down onto the sybian, clit pulsed with intense vibrations, making her ride it. He makes her gag on his cock, penetrating her throat deep and rough. He loves watching the spit fall from her mouth. That usually makes his sex slaves cum harder. She’s doing well so far in her slave training. Next, he brings her down onto a crate on her back, arms and legs tied spread apart, giving him full access to her pussy and mouth for face fucking. Her Master inspect his sex slave’s pussy and asshole, pleased to see pretty pink. Valentina quickly learns how an obedient sex slave should be, following every order, taking every inch of cock, rough and deep, begging for forgiveness for being a dirty whore. Her Master goes back and forth from mouth to pussy, pussy to mouth, using her spit as lube and making her clean his dick of her cum. He shoves his dick deep down her holes, making her moan and scream like a good slut should, pounding her in. He even smacks her tits and face a bit. Valentina is a big rebellious from being a good submissive whore ready for domination. She will need more training.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Valentina",
      "person_id": 56659
    }
  ],
  "release_date": "2017-10-12",
  "scene_id": 42216,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "brunet",
    "Deepthroat",
    "Domination",
    "dungeon",
    "Facefucking",
    "Fetish",
    "Gag",
    "Hair Pulling",
    "Latinx",
    "master",
    "natural boobs",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration",
    "versatile"
  ],
  "title": "Valentina Endures her First Rope Bondage Slave Training Session"
}