{
  "collections": [
    "Bound Gods"
  ],
  "description": "Creepy Handyman Trenton Ducati has been trying to fight his sexual addictions, but some habits die hard... As he's working on Steven Roman's pipes, he hears a giant crash. To his surprise, the naked, he finds that Steven had hurt himself and could use a little help. As much as he resists, Trenton's sexual demons are too much to overpower, so he drags the naked hunk off for some play. Steven finds himself with a hood covering his sight and sound, as he struggles in bondage. The creepy handyman wails on the hairy stud with a riding crop and pulling on his aching bulls. Dangling from the ceiling, Steven begs for mercy, but the only thing he receives is a mouthful of Trenton's hard cock, prying deep down his throat. The creepy handyman then mashes Steven's hard cock with his feet before prying his toes in the hunks hairy hole. Ready at attention, Trenton plunges his giant cock deep inside Steven, pounding away as the bound hunk bites down on the bit gag placed in his mouth. Trenton then removes the bit gag and blasts a load of cum in Steven's face and making him suck off every drop.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Steven Roman",
      "person_id": 60102
    },
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    }
  ],
  "release_date": "2017-04-13",
  "scene_id": 42214,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "bit gag",
    "black hair",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Creepy Handyman",
    "Crop",
    "Domination",
    "Feet",
    "Gag",
    "Gay",
    "Hairy",
    "Hood",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "other hair color",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "Old Habits Die Hard - Creepy Handyman Series"
}