{
  "collections": [
    "Bound Gods"
  ],
  "description": "Hot boy next door is cleaning Mr. Colter's spa, assuming he's all alone until he notices that eery feeling that you're being watched...All hell breaks loose when Mr. Colter locks all the doors from the inside, removing any chance for Kyler's escape. Jessie tears away the boy's shirt and gags his mouth so no one can hear his cries for help. Unable to resist Mr. Colter's perversions, Kyler's brought right to the point of cumming before having his giant cock and balls tormented. When Kyler decides to fight back and spit in Jessie's face, the muscled perv decides to teach Kyler who's in charge by dragging him into the spa and repeatedly dunking his head under water. Bound to a pool table, with rope blinding his sight, Kyler gags on Mr. Colter's hard cock as a leather flogger whips his bare ass. Jessie has a turn at the boy's front, his hard cock dangling between his legs as hot wax is poured all over his body. A spider gag pries Kyler's mouth open as Mr. Colter finally gets a piece of that tight ass. He pounds away mercilessly as Kyler moans at the top of his lungs. A shower of cum drenches Kyler's face before Jessie milks every last drop out of his fucktoy's aching balls.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jessie Colter",
      "person_id": 34311
    },
    {
      "name": "Kyler Ash",
      "person_id": 59359
    }
  ],
  "release_date": "2017-04-27",
  "scene_id": 42213,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Dunking",
    "Foot Torment",
    "Gag",
    "Gay",
    "Hot Wax",
    "Humiliation",
    "Kidnapping Play",
    "Leather",
    "Male Sub",
    "master",
    "Mouth Spreader",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "spider gag",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "white"
  ],
  "title": "No Escape"
}