{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Fetish Network presents an incredibly hot pain slut Brooklyn Daniels and Mila Blaze love very much. Ready to meet her? Aryah May is left in a corner of the dungeon, wrists and ankles cuffed and linked together, potato sack over her head. It seems she’s a bit scared. Great! Brooklyn and Mila shake her up, bring her over to the leather couch, thrown on into the doggy position and the double penetration begins. Mila Blaze pulls Aryah towards her strapon dildo by her hair. Brooklyn approaches with a high speed vibrator, pressing it against May’s pussy, pushing Aryah forward to take Mila’s rubber dick deeper down her throat. A dick on the stick is pulled out and is pounded rough and rapid in her cunt. Her BDSM Mistresses slap and squeeze her breasts till they’re red, spanking down hard on her ass. Her face gets the worst of it, only because she likes it. The harder they hit her, the easier Aryah takes their rubber strapon dicks in her holes. She begs for more, easily reciting it when told. They hold her arms and legs above her head, taking more rubber cock deeper in her pussy, cunt cream gushing out her swollen hole. Sounds perfect for the sybian fucking machine. They sit her on it and torment her twitching pussy, making her orgasm more and more. Brooklyn wants to make her squirt, smacking her to sit still, pressing her clit against the flesh pad. They can tell she’s worn out, but they’re not done yet. They tie her wrists to the wall with an extended chain, legs kept spread eagle back on the sofa. They keep working her pussy, shoving as many fingers will fit. They’ve gaped her, twat walls stretched out to the max. What a good pain slut!",
  "directors": [],
  "models": [
    {
      "name": "Aryah May",
      "person_id": 56681
    },
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    }
  ],
  "release_date": "2017-11-16",
  "scene_id": 42236,
  "tags": [
    "BDSM",
    "Big Toy",
    "black hair",
    "Blonde",
    "Bondage",
    "Breast Bondage",
    "Brunette",
    "Chains",
    "Crying",
    "Dildo",
    "Domination",
    "Double Penetration",
    "drool",
    "dungeon",
    "Female Slave",
    "Femdom",
    "Fetish",
    "gloves",
    "Hair Pulling",
    "Hand Gagging",
    "Leather",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Rough Sex",
    "Slapping",
    "slim",
    "Spanking",
    "Spit Roast",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "Sybian",
    "Tattoo",
    "the wall",
    "Partner Studio",
    "Threesome",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Pain Slut Aryah May Begs Brooklyn Daniels & Mila Blaze for Lesbian Domination"
}