{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Sabrina, the dark and mysterious brunette beauty with a model's body and those smoky, bedroom eyes looks like she?d be just as at home in a ballroom or on the catwalk of a fashion show as she does in Master Bruno's dungeon with a ballgag in her mouth and a leather cat nine tails cruelly lashing her pussy. Sabrina is strapped to a Sybian with chains and made to stay on it for an eternity of increasingly intense orgasms. After submitting to the fuck machine, she gets the master?s dick. First, by way of a hot deep throat blowjob and next, deeply into her smooth shaven, thoroughly fingerfucked and whipped pussy. A nice long session of rough sex for even the hardest to please perverts finishes the first act. Next, Sabrina is secured to a small wooden box with leather straps, her legs spread completely open with a wooden spreader bar. More cruel domination including some humiliating and painful tit whipping, fingerfucking, pussy spanking, and fucking with a vibrating wand. Sabrina may be a classy lady, but she can throw down in the dungeon like a gangster!",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Sabrina Banks",
      "person_id": 55325
    }
  ],
  "release_date": "2017-11-09",
  "scene_id": 42247,
  "tags": [
    "Ball Gag",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "Brunette",
    "Chains",
    "Clothespins",
    "Deepthroat",
    "Domination",
    "dungeon",
    "Electrical Play",
    "Female Slave",
    "Fingering",
    "gloves",
    "Hand Gagging",
    "Hitachi",
    "Leather",
    "Leather Belt",
    "Leather Cuffs",
    "Male Handler",
    "master",
    "Rough Sex",
    "shaved",
    "Small Tits",
    "smooth",
    "Spanking",
    "Straight",
    "Sub",
    "Sybian",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator",
    "Violet Wand",
    "Whipping"
  ],
  "title": "Sabrina Banks #1 Sexual Disgrace Dungeon Gangster"
}