{
  "collections": [
    "Device Bondage"
  ],
  "description": "Alt goddess Kleio Valentine and her big tits return the brutal metal and leather bondage that is Device Bondage. To say that Kleio has a perfect body is an understatement. Toned, tanned, and taut, her skin shines and her tattoos decorate her complete and all encompassing aura of sex appeal. In the masterful and skilled hands of the Pope she first stands at attention in rigid bondage with her arms pulled back and big tits pressed forward. Her neck is bound in a leather collar that restricts her breath, her movement, and her gaze. Fixated and attentive on her dom she trembles but welcomes the sadism that he is going to inflict upon her. Her body is completely exposed and the Pope takes full advantage of his pain sluts desire to serve at his boot heel. The Pope tenderizes his piece of meat with a big, heavy, leather flogger. He thuds her chest and legs turning her golden tan into a perfect shade of pink. She howls and screams begging for her punishment to end, but the Pope doesn’t relent and his pleasure builds as she gasps and screams in pain. He grabs her perfect breasts and covers them with clothespins that pinch at her skin relentlessly like a swarm of angry bees. The Pope expertly extracts the clothespins with the brutal help of his favorite flogger. They rip off of her skin leaving a trail of nasty sting bites in their wake. Gasping, Kleio is ready for what she hungers for most; uncontrollable orgasms. And that is just what she gets. The Pope jams a hitachi onto her clit and grinds her most sensitive area until her legs shake. The vibrator brings her to the height of ecstasy and she begs to cum. But she hasn’t earned it yet and The Pope punishes her with orgasm denial. She begs and pleads with her master to let her cum. And just when she can’t take another second, the Pope relents and allows her pussy to quiver from the first of multiple orgasms. Impressed with the devotion of his slave, The Pope flips her over and puts her face down on the ground with her back arched and her perfect ass on display. He knows that she wants to be punished and like every ungrateful whore she desires to be spanked and be put in her place. The Pope makes her natural ass jiggle as his giant man hands spank Kleio’s meat. Her ass shines as it gets worked over by a nasty and mean leather cat o’ nine tail. Even with a giant red ball gag in her mouth Kleio screams with joy that only extreme pain can bring. Once warmed up, The Pope thrusts a giant dildo into her hungry pussy. Her tight and tiny whore hole struggles at first to accept the massive girth of the dildo. But once it slides in she opens wide and soars to the heights of ecstatic bliss. Her orgasms roll from one to the next and she loses track of where one begins and one ends. To end her day she lies on back with her legs pulled out and to side, displaying her exposed and vulnerable body for the whole world to see. Spread wide open, The Pope plunges her pussy over and over with a giant dildo. She squirms and struggles against the bondage as he relentlessly destroys her pink little pussy. The neverending multiple orgasms become painful, but she can’t stop them. Her greedy pussy betrays her better sense, and she howls as the orgasms mount in intensity. And when she can’t possibly take any more The Pope pulls away and leaves her panting in puddle of her own succulent pussy juices. Kleio Valentine gets worked over in brutal metal and leather bondage and cums with delight!!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kleio Valentien",
      "person_id": 57339
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-06-29",
  "scene_id": 42255,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Boot",
    "brunet",
    "Clothespins",
    "Collar",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "fake boobs",
    "Fingering",
    "Gag",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "master",
    "Metal Bondage",
    "multiple orgasms",
    "Orgasm Denial",
    "Pain",
    "Sadism",
    "shaved",
    "Slave",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "The Pope",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Blonde Submissive Bombshell Kleio Valentien Gets Punished and Pleasured in Strict Bondage!!"
}