{
  "collections": [
    "Device Bondage"
  ],
  "description": "Gorgeous brunette model Melissa Moore is a newcomer to Device Bondage. This beautiful slut has the perfect body for extreme restrictive metal torment. Her perfect tits push through cold steel restraints. Her tight ass bounces with every brutal hit. It is as if her stunning model face was made to scream with pleasure as her hairy pussy is petted and spanked alternating between pleasure and pain. Her long legs accentuate her perfectly designed device bondage poses.\nMade to sit with her arms out wide, her dripping mouth is gagged open for your pleasure. Her screams are amplified along with her moans of deep pleasure. Her beautiful brown eyes are blacked out with sensory deprivation goggles. She has no idea what is in store for her to come. Her tits are grabbed hard and slapped. Her perfect pointy nipples are tormented. She can barely hold it in, her screams cause her spit to flow down her tight body. Her hairy pussy is pulled and stroked. Pubes are ripped out for her screaming pleasure. While blindfolded the electric zapper torments her body with shock and suspension. Finally the hitachi is brought out for her extreme pleasure. There is nothing greater than orgasm by torment!\nNow her body is arched, strapped in leather tightly to a wooden table. Her face grinning with a beautiful smile as she waits for what devious torments are to come. Corporal punishment, flogging, spanking, and a hard beating gets her tight lipped pussy dripping wet. Fingers down her throat and a deep hard fucking by a dick on stick brings Melissa screaming with orgasm as her pussy is pounded. The hitachi is brought out again as icing on this bondage cake.\nFinally with her legs bound high in the air and her pussy wide open, Melissa Moore is ready for true torment. Her nipples are pulled and twisted causing huge smiles and screams. Her feet are tormented with hard bastinado. Needles dragged across her perfect arches and pushed between her toes as she screams. This is the true test of torment as her pussy drips wet from pain.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Melissa Moore",
      "person_id": 60023
    }
  ],
  "release_date": "2017-06-15",
  "scene_id": 42252,
  "tags": [
    "BDSM",
    "BeaverDay",
    "black hair",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Deprivation",
    "Domination",
    "Extreme Torment",
    "Feet",
    "Fingering",
    "Flogging",
    "Hairy",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Latin",
    "Leather",
    "Metal Bondage",
    "Mouth Spreader",
    "natural boobs",
    "Pain",
    "Spanking",
    "Straight",
    "Submission",
    "Suspension",
    "toned",
    "Zapper"
  ],
  "title": "Newcomer Melissa Moore Submits to Screaming Bondage"
}