{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Business executive Dee Williams arrives home after a long work day, exhausted and ready to relax. As she starts masturbating, two beautiful dominant women suddenly appear in bed above her! Cherry Torn and Kleio Valentien take one look at Dee and know exactly what she is: a huge slut who loves being used and abused! These two gorgeous Dommes strip Dee of her clothes, and pin her down. They stuff her panties in her slutty little mouth and expose her cute little clit. They tag team Dee's ass and spank it red as Dee struggles fruitlessly and kicks her legs in the air. Then Cherry and Kleio flip this bitch over and take turns slapping Dee's cunt and sitting on her face. Dee loves the attention and eagerly services their cunts. Once both Dommes come, they turn their attention to Dee's greedy cunt. Dee's pussy gets stretched open by four fingers, and finger-banged by both ladies at the same time! As the woman-handling continues, Dee's pussy gets wetter and wetter. She comes hard after Cherry finger-bangs her and squirts all over herself. Next, Dee is tied in rope with her tits all bound and her holes exposed. Cherry and Kleio flog and paddle Dee's tits, legs, and belly. They pound Dee's slutty cunt with their strap-on cocks as Dee begs for more and more. Once they fuck her pussy senseless, they turn their attention to Dee's favorite hole, her asshole. These two fierce Dommes give Dee a good hard anal fucking, warming her up for a delicious vaginal and anal double penetration. Once Dee's pussy and ass are filled and fucked simultaneously, Dee is the happiest fucking slut in the world. Dee loves getting her holes filled and comes hard all over their cocks. But her dream Dommes aren't done yet! They finger bang their willing slut to more orgasms as Dee comes over and over again.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Kleio Valentien",
      "person_id": 57339
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2017-08-17",
  "scene_id": 42274,
  "tags": [
    "bdsm",
    "bondage",
    "Cherry Torn",
    "Corporal Punishment",
    "dominatrix",
    "Double Penetration",
    "Facesitting",
    "femdom",
    "Fingering",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Paddle",
    "Pussy Eating",
    "slapping",
    "slave",
    "straight",
    "strap on",
    "tag team"
  ],
  "title": "Boss Bitch Turned Anal Whore: Dee Williams Gets Double Stuffed"
}