{
  "collections": [
    "Electrosluts"
  ],
  "description": "Young blonde Hadley Viscara is a brand new to porn and can't wait to pop her porno cherry on Electrosluts with the deviant Mona Wales. First, Hadley is a bound & gagged damsel in distress, trapped in Mistress Mona's lesbian dungeon. Mona cannot wait to introduce Hadley to the anticipation, desire, and fear that electricity brings. Mona starts with the violet wand. Hadley giggles and screams as Mona runs the violet wand all over her voluptuous body, feet included. Hadley begs to come as Mona holds a vibrator against her cunt while shocking her all over. Next, Hadley is partially suspended in bondage. Her thighs are electrified with copper wire. Mona warms up her pet by flogging her juicy tits and ass. She finger-bangs Hadley till Hadley's pussy is dripping wet and she squirts everywhere! Then Mona begins to fuck Hadley's pretty pussy with an electrified dildo. Hadley squirms to get away but proves she is a natural born Electroslut as she begs to come on electricity! Hadley loves getting fucked by electricity and comes hard over and over again for her Mistress. After wiring Hadley up with electrified closepins on her pussy, Mona pushes an electrified anal plug in Hadley's ass. Once the current begins flowing through these devices, Hadley must prove to Mona she is worthy of being called a true Electroslut. Hadley pushes through the pain in her pussy & ass to serve Mona by worshipping her ass and licking her pussy to orgasm. Mona rides Hadley's face, punches her big boobs, and squeezes her nipples as she comes. Once Hadley's closepins are off, Mona challenges Hadley to come, and teases her tormented sensitive cunt with a vibrator. But Mistress comes first! Mona squirts all over Hadley and then fingerbangs Hadley to multiple orgasms, each one more intense than the last!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Hadley Viscara",
      "person_id": 60241
    }
  ],
  "release_date": "2017-06-15",
  "scene_id": 42273,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "Cattle Prod",
    "copper wire",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "Feet",
    "Femdom",
    "Flogging",
    "High Heels",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "Nipple Torment",
    "Pain",
    "Pussy Eating",
    "Slave",
    "Straight",
    "Strap On",
    "Tens Unit",
    "Vibrator",
    "Violet Wand",
    "Zapper"
  ],
  "title": "Natural Born Electroslut: 1st Porn Shoot EVER for Blonde Bombshell "
}