{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Professional renovator Kacie Castle shows up to her next project -- Domina Helena Locke's DUNGEON! Domina Helena wants her dungeon to be perfect and puts Kacie through a session of her own devising to make sure the unexperienced Kacie gains a full understanding of what goes on in a dungeon. Kacie proves that she is eager to please and obeys Helena's instructions to the letter. She sucks on Helena's leather clad fingers and licks Helena's thigh high leather boots. Helena turns up the ante, and puts clover clamps on Kacie's nipples, before having Kacie over her lap for a good old fashioned spanking! Kacie loves the pain and moans with every spank. Helena knows what this little slut needs and treats Kacie to an intense and orgasm filled finger-banging. Once Kacie's pussy is nice and wet, Helena tastes her renovator's sweet juices. Next, Kacie is suspended upside down in rope bondage. Helena flogs Kacie's cunt as Kacie struggles in bondage. Now Kacie must prove her worth by worshipping Helena's pussy and ass. Kacie hungrily licks all Helena gives her and is rewarded by her Mistress' juicy ass bouncing up and down on her face. Then Helena fucks Kacie's pussy with a dick-on-a-stick while Kacie begs to come. Once Helena finally gives her permission, Kacie can't stop coming as Helena continues to stuff her pussy full of dick. Finally, Helena decides it's time to fuck Kacie with her big strap-on cock. Kacie sucks and gags on Helena's cock, getting it all wet for her holes. First Helena stretches out Kacie's pussy even more. Kacie loves getting pounded from behind, and soon enough Helena turns her attention to Kacie's sluttiest hole -- her asshole. She stretches Kacie's ass open on her thick cock, and Kacie goes crazy. This submissive slut loves getting fucked in her ass! Helena flips Kacie on her back and continues fucking her ass as Kacie comes over and over again. Now that her lesson is complete, Kacie is ready to renovate!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Kacie Castle",
      "person_id": 59236
    }
  ],
  "release_date": "2017-07-20",
  "scene_id": 42275,
  "tags": [
    "bdsm",
    "bondage",
    "clover clamps",
    "Corporal Punishment",
    "dominatrix",
    "dungeon",
    "Facesitting",
    "femdom",
    "Fingering",
    "humiliation",
    "leather",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "Pussy Eating",
    "rope bondage",
    "slave",
    "spanking",
    "straight",
    "strap on"
  ],
  "title": "The Making of a Good Girl: Renovator Becomes Submissive Anal Whore "
}