{
  "collections": [
    "Electrosluts"
  ],
  "description": "First time Kink model, Yara Skye is brand new to BDSM porn and electricity! She's tied upright, her limbs spread, exposed for everything the talented and fierce Mistress Bella Rossi has in store for her. Bella warms her new plaything up with the violet wand touch plate. Yara teeters in her bondage, trying to squirm away from Bella's electric touch. But she can't go too far! Bella runs her fingers all over Yara's young tight body, and makes Yara come in close for an electric kiss. And since all parts of Bella's body buzz with electric current, she uses her tongue to shock her new pet's deliciously dark skin. Next Bella grabs the zapper and watches Yara yelp and try to escape as the zapper makes contact with her body. Yara comes hard as she is made to straddle a vibrating Hitachi wand as Bella flogs, spanks, and zaps her. Next, Yara is tied down to a metal bed, with sticky pads on her belly and thighs and with an electric dildo harnessed to her chest. Bella wastes no time in cranking the electricity up and riding the Samurai to multiple intense orgasms while Yara begs for attention. Yara has the best view a dirty slut could ask for, and gets to watch Bella's juicy ass bounce up and down on her tits. Every sensation Bella feels in her cunt, Yara feels on her belly and thighs. Once Bella has had her fill of orgasms, she turns up Yara's electricity and finger bangs Yara's tight pussy to orgasm. Seeing Yara come revitalizes Bella's thirst for more orgasms! She straddles Yara and both ladies share the Hitachi and come hard all over each other!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Yara Skye",
      "person_id": 60271
    }
  ],
  "release_date": "2017-08-24",
  "scene_id": 42272,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Black",
    "black hair",
    "Bondage",
    "Cattle Prod",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Electrode Punishments",
    "Facesitting",
    "Femdom",
    "Hitachi",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "Tattoo",
    "Tens Unit",
    "toned",
    "Violet Wand",
    "white",
    "Zapper"
  ],
  "title": "First Electric BDSM Shoot for New Model Yara Skye"
}