{
  "collections": [
    "Electrosluts"
  ],
  "description": "Princess Ella Nova is help captive to Prince Nikki Darling's every whim in this genderfucked Electroslut update! Ella worships her Prince's beautiful latex, licking down her front all the way to her shiny red boots. Now that Ella is at Nikki's feet where she belongs, she is stapled to the ground, immobilized with copper wire. Once electric current starts flowing through Ella's bonds, the more Ella struggles, the more she gets shocked! Nikki spanks Ella's beautiful round ass, and plays with her Princess' pussy, enjoying Ella's screams as she strains in electrical bondage. This predicament becomes more challenging for Princess Ella as Prince Nikki fucks her pussy with a big metal electric dildo! The fucking intensifies as Nikki pushes a finger into Ella's asshole while she gets fucked. Ella begs to come over and over again as her cunt is penetrated with electricity. Next, Ella is bound with rope, and Nikki inserts an electrified anal plug in her ass. Ella sits upon a copper topped box, and when the current flows, her ass gets shocked on the inside and outside! Prince Nikki plays with Ella's tits, and flogs and zaps her captive Princess. Ella struggles to hold her ass up as Nikki dials up the electricity and finger-bangs her cunt to more orgasms. Finally, Princess Ella is given a huge metal electric butt plug and the pleasure of tasting her Prince's sweet electric cunt. Nikki turns on the the violet wand touch plate, so Ella gets a shock with every lick. Both Princess and Prince lose themselves in an enthusiastic pussy licking filled 69. After Nikki comes all over Ella's face, she turns her attention back to her Princess' holes. Ella's toes curl as she is overcome with sensations from the anal plug, finger banging, and an intense vibrator on her clit. She comes all over Nikki's fingers and afterward cleans up her slutty mess. Both Princess and Prince have an electric happy ending as their lips meet for a kiss.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "Nikki Darling",
      "person_id": 42508
    }
  ],
  "release_date": "2017-08-10",
  "scene_id": 42271,
  "tags": [
    "Anal",
    "BDSM",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "Cattle Prod",
    "copper wire",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Facesitting",
    "Feet",
    "Femdom",
    "Hand Gagging",
    "Humiliation",
    "Latex",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "Tens Unit",
    "Vibrator",
    "Violet Wand",
    "white",
    "Zapper"
  ],
  "title": "Blonde Princess Electroslut Gets Wrecked with Anal Electricity"
}