{
  "collections": [
    "Everything Butt"
  ],
  "description": "Alexa Nova has entered an exam room to see a doctor for a check up. A beautiful big tittied MILF Latina nurse escorts her to the room and tells Alexa that all the doctors are busy so she will be doing the exam on the Alexa. Alexa soon finds something is amiss when she sees huge anal toys displayed on the table. If that isn't enough, during the exam, the beautiful tan, busty nurse has Alexa disrobe right in front of her and while Alexa is bent over, the nurse starts sniffing and licking her asshole. Alexa decides to turn the tables on the Nurse. After all, the nurse seems more than willing to get sexual with the tiny red headed patient. Alexa puts the blood pressure cuff around the Nurses neck to asphyxiate her while Alexa proceeds to take advantage of the Nurses asshole. This is the sexy MILF's Anal scene Ever shot. Alexa explores Simone Garza's anal enjoyment. Simone closes her eyes and focuses on taking everything Alexa is dishes out and learns to enjoy taking things really deep into her ass. Simone doesn't have any anal experience but she pushes herself to take almost the entire slink, a feat some of our most seasoned Anal performers can't even do. Simone pushes her limits and gets 5 fingers into her ass as Alexa pushes her to try to take the full anal fisting. Simone Writhes with pleasure pushing back onto Alexa's hand, trying hard to take the entire thing. The girls are wrapping up their anal exploration when one of the psychiatric nurse burst into the room. We discover that these two lesbians have just been roll playing all along and this seems to be something they do regularly but this time they wanted to try anal on the beautiful Latina. Looks like these two will be exploring Anal a lot more and giving the Doctor's at the hospital a lot more trouble.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Simone Garza",
      "person_id": 60272
    },
    {
      "name": "Alexa Nova",
      "person_id": 57359
    }
  ],
  "release_date": "2017-08-25",
  "scene_id": 42288,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "buttplug",
    "dildo",
    "doctor",
    "dominatrix",
    "fisting",
    "Gaping",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "mean mommy",
    "MILF",
    "nurse",
    "prolapse",
    "slink",
    "sniffing",
    "straight"
  ],
  "title": "Alexa gets a rectal Exam from Pervert MILF nurse then turns the tables"
}