{
  "collections": [
    "Everything Butt"
  ],
  "description": "Izamar ( a Latina MILF) and Charlotte Sartre ( a Goth beautiful with porceline white skin) have fucked up royally. The US dropped 59 tomahawk missiles on the Shayrat air base near Homs. There were suppose to be 60 missiles dropped but these two bozos lost one. Seeing how the missiles cost american tax payers $1.5 million each, someone will need to be held accountable for this screw up and it needs to be well documented for the american people to see that the government takes these kind of things very seriously. The Government has Hired Alexa Nova to be in charge of punishes these two fuck ups. Alexa has some very unorthodox ways of showing discipline but the American people seem to respond well to her actions. Alexa's Plan may have back fired on her however. She intended on humiliating these two fuck ups by making them lick and sniff each other's assholes but she didn't' realize that theses two ladies loved licking and sniffing gaped open holes. Today she shows America the insides of Charlotte and Izamar's assholes. Each asshole is stretch to its limit(s. They are fucked with huge toys and their assholes are left open for a great deal of time. each girl is fisted until she cums. Just when Alexa thinks she has finished her job, the girl turn the tables on her and they end up fisting her and showing her exactly where she can shove that fucking missile.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    },
    {
      "name": "Alexa Nova",
      "person_id": 57359
    },
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    }
  ],
  "release_date": "2017-06-30",
  "scene_id": 42289,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "buttplug",
    "dildo",
    "discipline",
    "dominatrix",
    "fisting",
    "Gaping",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "MILF",
    "prolapse",
    "sniffing",
    "straight"
  ],
  "title": "Army Brats Lose a missile, end up putting missile in commander's ass"
}