{
  "collections": [
    "Hogtied"
  ],
  "description": "Dylan has is back and hotter then ever. She has a different kind of glow about her today, and is feeling a little more frisky than usual. The Pope suggests going more extreme with the bondage and she is ready for the challenge. The bondage will be part of the torment in every scene, and in one of them it’s the only torment she can handle. This is one of the most grueling shoots that Dylan has had to endure, and you can easily understand why upon watching it. Her muscles are stretched to spread her legs as far and wide as they will go to expose her dripping wet pussy. The pain comes in strict and unstoppable. Her skin turns to a bright shade of red almost instantly as she is tormented. Her feet are going to be a main focus in this first scene, as well as the rest. Her pussy is filled with cock and then emptied with squirting orgasms. The second position will test her on every level. She is held up with one point to the sky and made to balance on her head and toes. Her mouth is tied to her ankles to ensure the most brutal experience of the day. She is then suspended in a side hogtie and tormented more before draining her pussy with more squirting orgasms.The final scene we bend her over a wooden horse and have our way with her one last time, fucking her pussy and finger banging her tight little ass hole.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Dylan Ryan",
      "person_id": 10069
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-08-03",
  "scene_id": 42281,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Predicament Bondage",
    "Rope Bondage",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "Tattoo",
    "The Pope",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Blonde Goddess is Destroyed in Devastating Predicament Bondage"
}