{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Jasmeen LeFleur is a single, successful, beautiful lady who wants nothing more in life than to have her own child. She doesn't want to date or get married. She just wants to raise a child on her own. She's tried countless methods of artificial insemination and nothing has worked. She has heard that Dr. Mandy Mitchell has a very high success rate for her patients. She has heard that Dr. Mitchell has some old-fashioned yet reliable methods to get her patients impregnated and Jasmeen is willing to do whatever it takes to have her baby. Dr. Mitchell must perform her standard check-up by listening to Jasmeen's heart, smelling her feet and checkout Jasmeen's vagina...you know...the standard stuff. Dr. Mitchell can tell from licking and smelling Jasmeen's feet that she is a very healthy woman. Another perk of having beautiful, healthy feet is that it get's Dr. Mitchell to get a really hard erection so that the Dr. can take Jasmeen's temperature with her cock. Jasmeen is completely shocked after having her eyes closed for the monitoring of her temperature and then opening them to find that she has Doctor cock in her mouth, especially since her doctor is a hot lady. Jasmeen knows this is all part of the procedure so she eagerly sucks Dr. Mitchell's cock. The two lovely ladies get naked and commence the full procedure using one hole at a time starting with Jasmeen's mouth. The Doctors knows that Jasmeen needs to have her ovaries stimulated properly and the only way to get that done is to go in anally. Dr. Mitchell gets Jasmeen bent over in doggy style and fucks her asshole until it's gaping wide open. A good Wide gape is a sign that the ovaries are ready to take the seed. Without hesitation, Mandy primes Jasmeen's pussy to take the load. They fuck good and hard, kissing each other passionately to increase the efficacy. Jasmeen is ready to take the big hot load from the Doctor. The doctor climbs on top of Jasmeen and folds Jasmeen's body just right for the insemination. The Doctor bursts a hot creampie load into Jasmeen's pussy and gets her pregnant right there on the spot",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Mandy Mitchell",
      "person_id": 15687
    },
    {
      "name": "Jasmeen LeFleur",
      "person_id": 59623
    }
  ],
  "release_date": "2017-10-09",
  "scene_id": 42287,
  "tags": [
    "Blowjob",
    "Cock Worship",
    "Creampie",
    "Doctor",
    "Feet",
    "Gaping",
    "Role Play",
    "Straight",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Dr. Mitchell is the top Impregnation Expert. She's knocking up Jasmeen"
}