{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "Angel Face: A Sexual Revolution, is a tale of lust, desire, and envy! Riley Nixon is a freshman forensic science major, investigating an old mining town for clues into what really happened to the mine owner’s wife, a century earlier. The myth of sex and domination has Riley so captivated, she loses herself in her investigation, finding herself set upon by figments of the past, horny miners with only one thing on their mind: to take Riley as they took the mine owner’s wife, and fuck her again and again. After combing the town and the old mine for clues, Riley comes face-to-face with the miners in an abandoned house. Overwhelemd, she willingly submits to them, voraciously swallowing all five cocks in her throat as they grope her beautiful big tits. But Riley wants more. She wants to fully live the life of whorish depravity the same way the mine owner’s wife did, to get fucked hard by a revolving door of men! The miners sense this, each of them pounding her wet pussy, one after the other. They turn their focus on her asshole, pounding it deep, sending Riley into orgasmic fits as she continues to suck and stroke their dicks. Before she knows it, she’s being double penetrated in her hot, slutty pussy and hungry ass. So much cock slamming into her holes! She cums several times under the punishing onslaught of rock hard dick, pumping and stretching her with every orgasm, until she’s finally put on the floor and showered in a heavy rain of hot cum. She feels her body twitching with orgasm and tastes the sharp tang of cum on her tongue, filling her mouth. With all those hot loads she finally gets exactly what she wants… to experience the outrageous, liberating life of that slutty miner’s wife!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Riley Nixon",
      "person_id": 59619
    },
    {
      "name": "Tarzan",
      "person_id": 59796
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Will Havoc",
      "person_id": 46285
    }
  ],
  "release_date": "2017-06-28",
  "scene_id": 42309,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Tits",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Double Penetration",
    "Facefucking",
    "foreskin",
    "Gangbang",
    "Latinx",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rough Sex",
    "slim",
    "Straight",
    "Stud",
    "Tattoo",
    "top",
    "unshaved",
    "white"
  ],
  "title": "ANGEL FACE: Gorgeous Riley Nixon Double Penetrated In Desert Gangbang"
}