{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "In this epic, dystopian future Hardcore Gangbang, blonde bombshell Cherie Deville is a lust-filled Sex Witch, a warrior fighting for the right to sexual pleasure, who's only a few steps ahead of the militant hordes sent to destroy her. Isolated in the desert, Cherie fortifies her bunker and seeks strength from the spirits of the witches that came before her, so she might fight off--or better yet, SEDUCE--the savages pursuing her! When the five hunters reach her, they take her down and proclaim their judgment. But Cherie's sexual will is far too powerful. She bewitches them with her huge tits, slutty pussy and hungry ass, compelling them to whip out their hard cocks so she can suck and fuck them all! She pounces, taking every hard cock in her eager mouth, working the men into a sexual frenzy from which there is no escape. Out of control, they rip her remaining clothes off, setting her up on a piece of dilapidated old furniture for a nonstop, airtight, savage fucking! Cherie eats up every moment and descends into pure depravity as she takes every hard cock in every hole. She begs for more with her filthy mouth--for more intense pleasure, for more raging dick--and she gets it! The men DP her, sending her into an orgasmic fever as she cums again and again, always returning for a more vicious fucking. Tingling from head to toe after cumming so much and so hard, Cherie is finally drenched in hot cum. Each of the men, fully spent, shoots their angry load into her face. Fully satisfied, and after converting all five men to her wanton sexual cause, she writhes in bliss with the desert all around her, thanking her goddess for all she has received...every last drop.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Small Hands",
      "person_id": 59499
    },
    {
      "name": "Tarzan",
      "person_id": 59796
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Will Havoc",
      "person_id": 46285
    }
  ],
  "release_date": "2017-06-14",
  "scene_id": 42308,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Desert Apocalypse",
    "Double Penetration",
    "fake boobs",
    "Gangbang",
    "Latin",
    "muscular",
    "other hair color",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "SEX WITCH: Cherie Deville Takes Five Hard Cocks in Dystopian Fuck"
}