{
  "collections": [
    "Whipped Ass"
  ],
  "description": "When Mandy Muse breaks up with her stupid boyfriend, she's in tears. Luckily, her good friend Chanel Preston arrives to celebrate Mandy's newly found freedom, and open her up to the possibility of new and better relationships. When Mandy spills that her boyfriend never spanked her gorgeous ass, Chanel is shocked! She handcuffs Mandy, and spanks her friend's juicy ass until it's nice and red. In between giggles, Mandy moans with pleasure as she gets spanked, flogged, and finger-banged by her best friend. Chanel loves watching Mandy squirm as she fingers Mandy's pussy and ass at the same time. Then Chanel makes Mandy spread her legs masturbate in front of her. Mandy comes hard as Chanel flogs her cute tits. Next, Mandy is suspended in rope bondage, with all her holes exposed. Mandy takes Chanel's beautiful feet into her mouth -- licking and sucking on them like a sloppy slut. Once satisfied, Chanel spins Mandy around and has Mandy lick her pussy until she comes all over her best friend's face. Then Chanel makes Mandy worship her asshole while she comes over and over. Now it's Mandy's turn to get fucked! Chanel teases Mandy's pussy with her toes, before plunging a dick-on-a-stick deep in Mandy's wet cunt. Mandy begs to come as Chanel fucks her and teases her pussy with a vibrator. The fucking continues as Chanel works to ensure Mandy forgets all about her bad past relationships. Mandy is gagged, her wrists tied to her ankles, and positioned face down with her ass in the air. Chanel fucks both Mandy's pussy and ass with her strap-on cock. Mandy comes hard and forgets all about her loser boyfriend as her best friend fucks her and paddles her voluptuous ass. What are friends for?",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mandy Muse",
      "person_id": 54180
    },
    {
      "name": "Chanel Preston",
      "person_id": 26542
    }
  ],
  "release_date": "2017-07-06",
  "scene_id": 42302,
  "tags": [
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "rope bondage",
    "slave",
    "straight",
    "strap on",
    "vibrator"
  ],
  "title": "Break Up Remedy: Mandy Muse gets Spanked and Ass-Fucked"
}