{
  "collections": [
    "Divine Bitches"
  ],
  "description": "DJ works as construction worker and all morning long he has been surrounded by his ultra-macho co-workers. Their toned muscles shine through their tank-tops as they sweat from exerting long hours of heavy labor. DJ finds his mind wandering again and again to thoughts of sucking on the throbbing cock one of these hot studs. He always pushes the thoughts away, and quickly returns to his masculine-chauvinistic-overcompensating facade and calls all women dumb sluts and brags about his big dick breaking whores in half. But his secret thoughts that he is so ashamed of always creep back into his mind, creating a hunger that just won't relent. To suppress his taboo desires he decides to make an appointment with a call girl during his lunch break. He needs to get his dick wet and is not afraid to pay for it. DJ needs to have his masculinity validated in a vain attempt to conceal his desire to fuck and suck giant sweaty cocks. Aiden Starr sets the trap and let's DJ think that she is just another call girl. DJ quickly discovers that he is the one who is going to get fucked. Aiden reads DJs pathetic macho affectations and can tell right away that all this construction worker wants are cocks gagging in his throat and ramming in his ass. She gets right to work after taking this fools money, humiliating his teeny-tiny-weeny and the pathetic-girly panties that DJ secretly wears to work. And, Aiden beats the crap out of him. Seriously...she works over every part of his body with her artful use of the cane. Biceps, ass, back, chest...Aiden leaves giant-throbbing welts all over his body. Surrendering to Aiden completely, DJ next gets his throat and ass fucked by Aidens huge strap-on-dick. She pounds away and relentlessly punishes his greedy-pathetic-little-boys- asshole into complete and utter submission. But Aiden isn't even close to finished. After massaging DJ's prostrate she crams her fist into his asshole until DJ feels like he is cumming over and over again. But, Aiden never-ever lets him actually cum, trapping his teeny-weeny in a cock cage so he can't ever touch it. And when she is done abusing him, she lets him lick her ass while she masterbates with a vibrator. After a long day Aiden stuffs DJ into a coffin and never lets him leave. He is hers for ever!!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "DJ",
      "person_id": 20225
    }
  ],
  "release_date": "2017-05-12",
  "scene_id": 42304,
  "tags": [
    "Anal Fisting",
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "brunet",
    "Cage",
    "CBT",
    "Chastity Play",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "First Anal",
    "First Fisting",
    "Fisting",
    "Hairy",
    "hardatwork",
    "Humiliation",
    "Male Sub",
    "muscular",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Construction Workers Sexy Lunch Break Turns Into First Anal Fisting"
}