{
  "collections": [
    "TS Seduction"
  ],
  "description": "Sometimes one just isn't enough. TS Dominatrix extraordinaire Jesse woke up and was hungry for some young, hot, and athletic submissives to worship her heavenly form. Lucky for her James Darling and Corbin Dallas want to book an appointment to serve Jesse for the same day and at the same time. Unbeknownst to the two pathetic little subs they are about to be fucked and sucked with a rough sex ride that will leave them breathless for weeks. First our blonde haired vixen locks her slaves in a cage. Dressed in only their boxers and work ties, corporate moguls James and Dallas can only stare and drool over the perfection of Jesse Fem Dom form. She is dressed in beautiful sheer nylons and gorgeous patent leather high heels while reclining like a goddess on her couch. She teases her pets and pits their competitive corporate spirits against each other. Who can serve her better? Whose holes are juicier? Who can pleasure with oral sex the best? Which can devote themselves fully to cock worship? Jesse is a stern mistress and demands absolute submission from her underlings. After letting them stare from the cage for a good long while Jesse tosses them the key and lets them crawl to her across the floor. Cowering in submission they first sit at the feet of their goddess, content to just smell her divine presence. But the allure of her big tits and throbbing cock is too much for them to handle. They beg to sniff her, lick her high heels, touch her golden blonde hair...anything to show their devotion. Jesse allows them touch her and they gorge on her mystical, seductive powers. She tears open her nylons and face fucks both her subs until they gag sloppy wet drool all over themselves. After their pathetic mouth holes are warmed up, Jesse begins to explore the multitude of whore holes at her disposal. To her delight she discovers that James is a TS man with a dick that Jesse can fuck!! And the orgy begins. Jesse fucks James dick every which way while Dallas devours all the juices. After Jesse tires of James, she rolls over and pegs Dallas in his tight little asshole. She pounds away and dives deep into the inner reaches of Dallas' sexual soul. Ass to mouth over and over again...the hungry subs devour it all. In a desperate attempt to gain the approval of his queen, James offers his asshole to the altar of Jesse's divine cock. Jesse pounds away and James squeals with delight. Finally Jesse is through with her devoted holes of her toys and unloads a huge wad of cum on to faces of her devotees. They lick it clean and thank their mistress for the nourishment of her heavenly nectar.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    },
    {
      "name": "James Darling",
      "person_id": 23302
    },
    {
      "name": "Jesse",
      "person_id": 12790
    }
  ],
  "release_date": "2017-06-20",
  "scene_id": 42310,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Athletic",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Cage",
    "Cock Worship",
    "Dominatrix",
    "drool",
    "Feet",
    "FTM",
    "Gag",
    "High Heels",
    "Leather",
    "Male Sub",
    "Oral Sex",
    "Orgy",
    "Role Play",
    "Rough Sex",
    "Straight",
    "Submission",
    "TS",
    "TS Fucks Male"
  ],
  "title": "TS Dominatrix Jesse Fucks and Punishes a Submissive Man AND a TS Man! "
}