{
  "collections": [
    "Bound Gods"
  ],
  "description": "Eager submissive Scott is more than ready for his Master's arrival as he squirms bound upon the floor, his lean muscular body writhing as his breathing gets heavier in anticipation of the torments to come. Master Dakota emerges from the shadows and circles his sub like a hungry shark, revving his fucksaw and smirking as Scott jumps at the sound. After fucking his slave's mouth ruthlessly with the saw, Master Dakota cuts off the sub's jock, revealing his huge throbbing dick that's just begging to be stroked and slapped around. Master Dakota edges his slave mercilessly before tying him up to a sturdy pillar and flogging his gorgeous round ass and tight abs, reveling in the screams of his submissive as they echo throughout the dungeon. Finally the exhausted submissive is bound to the bed and faces his toughest torment yet - candles on strings shower his fully exposed body with hot wax as he squirms and screams, unable to escape his predicament. Once Master Dakota decides his slave has had enough, it's time to reward him with his huge cock, and Scott moans with pleasure as his Dom fucks his tight ass hard and fast before blowing a thick, hot load all over his face. The bound, blindfolded submissive has his big dick stroked expertly by his Dom until he shoots his cum all over himself, the now dry wax mixing with sweat and cum as he thanks his Master over and over again.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Scott DeMarco",
      "person_id": 59206
    },
    {
      "name": "Dakota Rivers",
      "person_id": 19527
    }
  ],
  "release_date": "2017-06-08",
  "scene_id": 42318,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "brunette",
    "Corporal Punishment",
    "crotch rope",
    "domination",
    "dungeon",
    "flogging",
    "fucksaw",
    "gay",
    "Hot Wax",
    "humiliation",
    "Jock",
    "leather",
    "Male Sub",
    "master",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "slave",
    "submission",
    "twink",
    "Wax Play"
  ],
  "title": "Horny Sub is Tormented With the Fucksaw and Hot Wax Pendulums! "
}