{
  "collections": [
    "Bound Gods"
  ],
  "description": "Master Pacifico, clad in full leather, walks into the dungeon to find a sleeping slave lying naked in his cage. Alex Hawk is awoken and dragged out of his cage by his collar and ordered to worship Master Pacifico's leather. The new slave pulls out his new master's bulging cock and swallows it to the hilt as Master Pacifico beats his backside with a paddle. Dominic then transforms his eager slave into his personal pet, a puppy-tail butt plug shoved up his ass and latex mask to complete the puppy transformation. Bound on all fours, Alex swallows his master's cock as the sting of the flogger whips against his exposed ass. Flipped over on his back, the bound pup has a series of clothespins clamped onto his aching balls as the flogger mercilessly beats him to a pulp, all while he's ordered to howl like a beast. A violet wand replaces the puppy-tail plug, penetrating Alex's tight hole as it electrocutes his insides. Master Pacifico then plunges his fat uncut cock into his pet's ass, pounding away before bursting a geyser of cum all over the bound pup's eager face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    },
    {
      "name": "Alex Hawk",
      "person_id": 59999
    }
  ],
  "release_date": "2017-05-04",
  "scene_id": 42314,
  "tags": [
    "Acrylic Plug",
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Cage",
    "Clothespins",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Facefucking",
    "Gay",
    "Humiliation",
    "Latex",
    "Leather",
    "Male Sub",
    "Mask",
    "master",
    "Nasty Pups Come Out to Play",
    "Paddle",
    "Pet Play",
    "Prolapse",
    "Puppy Play",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Submission",
    "Twink",
    "Uncircumcised",
    "Uncut",
    "Violet Wand"
  ],
  "title": "The Pup Master - Introducing: Master Pacifico"
}