{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Some dreams start in ways that we can easily recognize, while others seem to have been with us since birth. Alrik Angel spends his life in one dream. A dream in which he owns a company. A dream where he makes decisions that affect all of his employees and shareholders. A dream in which he is ALWAYS in control. However this is all a front. A carefully constructed shell to hide and deflect the prying and judgemental eyes of the world away from seeing who he really is. There is only one person who really knows Alrik. Cherie Deville sees right through his carefully constructed, polished, and powerful veneer and knows him in his true form; a pathetic, weak, submissive, anal whore. Alrik comes to her in desperation. He needs to serve at the pleasure of his goddess. He needs to surrender to her for the same reason that we all surrender to our chosen deities in desperate attempts to find direction, approval, and transcendence from worshiping their divine forms. Alriks every breath exudes complete and utter devotion. On his knees, mouth wide open, he begs Cherie to make him a vehicle of her holy purpose and to fill all his holes with her cosmic energy. Seeing his unflappable devotion, Cherie showers him with attention and fearful love. She begins by softening his tender skin with her bites, tenderizing him for future sacrifice. She probes his asshole to deem if this orifice might be worthy of her attention. Pleased with her findings, she flips her little bitch slave over and carefully examines his pathetic pee-hole with ever widening gauges of sounders and then probing it with her saintly finger. The pain of worship is worth the pleasure that Alrik gets from just being touched by the hand of his mistress. To bring his troubled essence into cosmic alignment, Cherie then takes her tuning forks and strikes the inserted sounder to bring his soul into accordance with her cosmic resonance. He whimpers again and again his praise and thanks for filling his vehicle with her divine touch. Cherie then traps his face him a pathetic bunny mask to teach him to not take such pride in his worthless physical form. She bends him over and fucks his tight asshole over and over again as a reminder that he belongs to her. And, just when Alrik thinks that he couldn't be more blessed, Cherie smothers his face with her heavenly ass. Alrik begs her not to stop and insists that he doesn't need to breath if his goddess is sitting on his face. Pleased with Alrik's acts of devotion Cherie allows him to cum and then feeds him his own seamen. Back in the illusion of his \"real\" life where he is showered with the prizes that come with a life for power and influence, he secretly whispers a mantra over and over again: \"Thank you Goddess Cherie, Thank you Goddess Cherie, Thank you Goddess Cherie...\"",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Alrik Angel",
      "person_id": 18176
    },
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    }
  ],
  "release_date": "2017-05-26",
  "scene_id": 42311,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "CBT",
    "cock and ball torture",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "Mask",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Sounding",
    "Straight",
    "Strap On"
  ],
  "title": "Pretty Lil' Fuck Bunny Gets His Dick Sounded and His Ass Fucked by Goddess Cherie Deville"
}