{
  "collections": [
    "Bound Gods"
  ],
  "description": "Max Cameron has just finished painting straight hunk, Mason Lear's house. When Mason learns that Max is gay, he tries to pull the \"It's 2017, You have to respect my religious beliefs\" bullshit in order to get out of paying Max for his work. Mason quickly learns that Max isn't going to take that lightly as he's dragged off to the basement and bound to the rack. He yells at the horny pervert to stay away from his dick, but no matter how much he struggles Max gets his cock rock hard. The pervy painter beats his prisoner down with the flogger to show him who's boss, but Mason isn't ready to submit just yet. Bound in a pile-driver, the bound straight boy has his ass spread wide-open for Max's pleasure. This time he shows Mason who's boss by beating him down with the riding crop & slamming every inch of his hard dick down his throat. A speculum violates the straight boy's hole, spreading him wider and wider while Max strokes his hard cock in amazement. Mason begs for mercy, offering to pay any sum to make it all stop, but he's past the point of no return as Max slams his cock deep inside his hole. He pounds away on the bound hunk, screaming through his bit gag before pulling out his cock and blowing his load all over his fucktoy. To make up for the payment, Mason swallows his cock once more and licks up every drop of cum off of Max's cock.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Mason Lear ",
      "person_id": 60275
    },
    {
      "name": "Max Cameron",
      "person_id": 57500
    }
  ],
  "release_date": "2017-05-11",
  "scene_id": 42315,
  "tags": [
    "anal",
    "bdsm",
    "Bit Gag",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crop",
    "domination",
    "gag",
    "gay",
    "humiliation",
    "Male Sub",
    "master",
    "rack",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "speculum",
    "straight",
    "submission"
  ],
  "title": "Straight Hate-Monger Gets His Ass Violated"
}