{
  "collections": [
    "Everything Butt"
  ],
  "description": "Jenevieve Hex and Amber Ivy are practicing for the Big Tag Team Wrestling show happening on Friday night. Their Coach, Cheyenne Jewel, is showing them how to pin their opponents, trap them and fuck them op. Savannah Fox barges in on their training and lets the group of big ass girls in on a deal. Savannah tells the girls that she's going to bet Big on the OTHER team to win and Jenevieve and Amber need to throw the match so that everyone can walk about with a lot of cash. Jenevieve isn't into the game. She's been training really hard and she doesn't think her sponsors will be happy if she loses. She's confident that She an Amber are going to win. Cheyenne and Savannah have an interesting way into coax the girls into throwing the match. The bend them over and spank them, Rub their tushys, ram toys in and out of their assholes until they gape, make each other clean up the ass toys with juicy Ass to Mouth. Then they strap on fuck each girl until their muscles are so worn out they can't possibly recover by Next Friday. Being a wonderful coach, Cheyenne Jewel shows the girls how to take REAL anal. Cheyenne Jewel gets her asshole fisted. Then she take the entire 2foot long Slink into her asshole, Nice and deep. Amber Ivy licks up the slink after it comes out of Cheyenne's Asshole.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Savannah Fox",
      "person_id": 47440
    },
    {
      "name": "Jenevieve Hexxx",
      "person_id": 59794
    },
    {
      "name": "Amber Ivy ",
      "person_id": 60018
    }
  ],
  "release_date": "2017-09-22",
  "scene_id": 42326,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "Ass to Mouth",
    "big ass",
    "buttplug",
    "dildo",
    "dominatrix",
    "gape",
    "gaping",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "prolapse",
    "slink",
    "straight",
    "strap on",
    "tag team",
    "wrestling"
  ],
  "title": "Wrestlers get Bribed with Anal Pain to throw the Match of the Century"
}