{
  "collections": [
    "Everything Butt"
  ],
  "description": "Lily Lane is doing a great job running her vintage hot Gothic store. She's been in business long enough to have seen and heard everything. What she's learned over the years is that she can not stand two things: People to try to shop while they are on their cell phones and Millennials. Today is her worst nightmare. Every customer who comes into her store is either blasting shitty music on their phones or having dumb conversations on their phone. Lily takes matters into her own hands. She sets up a trap for each of these annoying customers which leads them into the employee breakroom in bondage. The customers go through a barrage of anal punishment starting with spanking. Each girl is stripped down leaving their stockings on. Lily has Kacie tied up in bondage in stocking and bends her over and makes Violet Monroe sniff Kacie's ass through the stockings. The stockings get ripped so that Violet can inhale Kacie's unfiltered Asshole juices. Each girl is bent over and made to take large toys until their assholes gape open while the other girls lick and taste the inside of their assholes. Then the girls are flipped on to their backs and made to take Lily's fist all the way into their tight little soft assholes. When it's Violet's turn to take a fist she is warmed up by taking DP in her ass with two long toys that both go deep into her asshole. One the Double Penetration has opened her up, Lily rams her arm into Violet and demands that Kacie adds to the pain by trying to get her hand into Violet's stretched asshole. Lily must attend to more customers so she ties up Violet and Kacie for more punishment just in case there is going to be another addition to the party. Lily will teach any disrespectful millennial a lesson with Anal Punishment.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Kacie Castle",
      "person_id": 59236
    },
    {
      "name": "Violet Monroe",
      "person_id": 20284
    },
    {
      "name": "Lily Lane",
      "person_id": 50199
    }
  ],
  "release_date": "2017-09-08",
  "scene_id": 42325,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "Ass to Mouth",
    "Best of Anal",
    "bondage",
    "buttplug",
    "dildo",
    "dominatrix",
    "Double Penetration",
    "fisting",
    "gape",
    "gaping",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "prolapse",
    "spanking",
    "Stockings",
    "straight"
  ],
  "title": "Anal Punishment for Lame Millennials. "
}