{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Juicy BBW Dominatrix Mimosa destroys submissive male sub, Will Havoc in this bombastic BDSM update. Curvy Mimosa has time on her hands and a tough acting pretty boy in her cage. She decides to start her day with some boot worship and a nice polish. Will happily obliges. He seems to get excited by the humiliation. Mimosa soon discovers Will's secret stash of beauty products. She humiliates him further with some spanking and more foot worship but the more Mimosa dishes out, the more Will gets excited. He smells her feet and boots in ecstasy.Mimosa uses her big ass to smother Will with some epic face sitting and pussy licking. The non-stop action continues as Mimosa slides on her strap on. Will grimaces in pain before succumbing to the anal pleasure. She then commands her happy male sub to fuck her wet pussy. Her big natural tits bouncing to the thrusts. Again she denies Will further pleasure and demands he sit on her strap-on. The rough sex continues as Mimosa gifts Will with a furious hand job as he bounces on her strap on. She then allows him to fuck her pussy and gag on her cock. Finally she allows sweet release in the form of a final hard fucking and handjob before Will cums all over himself and is demanded to swallow his own sticky load.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Mimosa",
      "person_id": 57584
    },
    {
      "name": "Will Havoc",
      "person_id": 46285
    }
  ],
  "release_date": "2017-06-09",
  "scene_id": 42332,
  "tags": [
    "Athletic",
    "BBW",
    "BDSM",
    "Big Ass",
    "big dick",
    "Big Natural Tits",
    "blond",
    "Bondage",
    "Boot",
    "Boot Worship",
    "Cage",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Foot Worship",
    "Gag",
    "Handjob",
    "Humiliation",
    "Male Sub",
    "mixed",
    "natural boobs",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Redhead",
    "Rough Sex",
    "shaved",
    "Shrimping",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Swallow",
    "switch",
    "Tattoo",
    "unshaved",
    "white",
    "Yes, Mistress"
  ],
  "title": "Beautiful, Buxom Mimosa Dominates Submissive Pretty Boy"
}