{
  "collections": [
    "The Training Of O"
  ],
  "description": "Anna De Ville is a pretty petite anal whore who came to The Training of O to have her ass stretched to its limits. We start with Anna tied in rope bondage with her ass in the air and a ball gag in her mouth. Tommy Pistol spanks and stretches Anna's ass with his hands getting it ready for a big acrylic toy. Tommy then fucks her ass with the toy, violently stirring it around and pops it in and out of her ass with ease making Anna's asshole gape so big you can see all the way into her pink butt tunnel. A short distance away, Tommy has placed two glass butt plugs on the ground. He explains that the only way she'll get any cock is to waddle over and shove both glass butt plugs up her ass and waddle back. As she does so with ease, Tommy rewards her with a proper face-fucking and crams his cock and balls all inside her whore mouth. Tommy then makes Anna give back his toys. As suspense builds, Anna eventually pushes both glass toys out and reveals to us her pretty rosebud. With her ass still in the air, face shoved on the floor with her legs and wrists tied with rope, Tommy double dips and pounds Anna's ass and pussy in pile driver back and forth. Tommy then has Anna fist her own ass while he flogs her. In the next scene, Anna De Ville shoves Tommy Pistols cock in her ass in reverse cowgirl with clamps on her nipples and breast bondage and rides his cock until she cums. Anna then finds herself on a table completely naked in missionary with one leg in a frog tie. Tommy wrecks her gaping ass once again until he blows his load all over her face.",
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Anna De Ville",
      "person_id": 59053
    }
  ],
  "release_date": "2017-07-04",
  "scene_id": 42333,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "bondage",
    "Breast Bondage",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "gag",
    "gape",
    "gaping",
    "Gimp",
    "humiliation",
    "master",
    "oral sex",
    "Petite",
    "role play",
    "rope bondage",
    "straight"
  ],
  "title": "Extreme Anal Training: Anna De Ville"
}