{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When cute Ebony artist Kira Noir gets an eviction notice from sexy landlord Xander Corvus she will do whatever it takes to keep her cool warehouse space.\nKira hasn’t paid her rent in 6 months but she is doing the most inspired work of her career so this is not the time to uproot! Xander has no sympathy for her situation when he knows several other tenants could pay the bills with no problemo. Pay the rent or pack it up and get out! Well that is just not going to happen so Kira takes her shirt off to expose her small perfect tits and persuades Xander to work something out with her. What does she have to offer? She kneels down in front of Xander and takes out his massive cock. Looking up at Xander with eager eyes she wraps her full wet lips around his dick and gives him an amazing blow job that is surely worth more than the rent she owes. She arches her back in her super short shorts and wiggles her firm round ass around as he throat fucks her into submission. She knows just how to handle his landlord cock as she chokes and gags and slobbers until he shoots his load right down her throat. OK it’s settled right? A hot sloppy blow job should be enough to keep Xander at bay for a few more months until Kira makes some money with her art. Well its not that simple. Now that he got a taste of what Kira has to offer he comes back for more. But this time there is BDSM, full body suspension, corporal punishment, ball-gag, nipple clamps, more deep throat blowjobs and lots of rough sex including anal and pussy fucking! Xander ties Kira up and suspends her from the ceiling in beautiful rope bondage. With arms behind her back she has one leg up exposing her ass and pussy for easy access. He starts with flogging her and then fucks her ass and pussy with his huge hard dick while he rubs her clit. He goes back and forth from her ass to mouth to pussy to ass again and again until she comes. Next day he comes back to make up for more unpaid rent. With Kira tied up tight in doggie style Xander flogs her ass some more and gives her ass and pussy a deep pounding. Then on her back with arms tied above her head and legs spread wide open Xander fucks her out until she is begging to cum. Watch Kira and Xander work it out in this week’s sexy update Rent to Own.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Xander Corvus",
      "person_id": 46000
    }
  ],
  "release_date": "2017-07-07",
  "scene_id": 42335,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Ebony",
    "Flogging",
    "Gag",
    "Humiliation",
    "natural boobs",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "Suspension",
    "toned",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Rent to Own"
}