{
  "collections": [
    "The Training Of O"
  ],
  "description": "Tommy Pistol anxiously sits in his leather chair, picks up the phone and orders two submissive sluts. Moments later a slight jingle of chains gets louder as James Mogul, holding two leashes, slowly approaches walking two hot submissive brunette sluts on all fours, Kimber Woods and Bobbi Dylan. Mogul has Bobbi and Kimber get on their knees in front of Tommy and commands them to rub each other's pussies. James give them both matching nipple clamps and flog them as they try to make the other cum. The two then are told to get back on their hands and knees and James grabs Kimber's head and burry's it in Bobbi's ass. Tommy claps his hands twice and the two come crawling over to his hard cock. Bobbi and Kimber work together worshiping Tommy's cock as James Mogul sticks a thumb up each of their pussies and smashes vibrators against their clits. The two scream muffled screams of ecstasy while they cum with ones mouth stuffed with cock and the other balls. Later we find Bobbi Dylan with her legs bound with rope spread eagle, her small natural breasts bound, suspended, swinging next to Kimber Woods in a predicament of very her own, suspended on her side by her tits and one foot. Tommy Pistol pounds Kimber's pussy and ass then moves over and fucks Bobbi's pussy while James flogs. After the two get fucked senseless in a double suspension, they're taken down and Bobbi gets placed on a trunk with her arms bound behind her back and one foot tied straight in the air. Kimber woods crawls on all fours to Bobbi's pussy and furiously licks while Tommy fucks Kimber's ass. Bobbi and Kimber switch places and Tommy presses Bobbi's face against Kimber's pussy giving him three holes to fuck.",
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Bobbi Dylan",
      "person_id": 59345
    },
    {
      "name": "Kimber Woods",
      "person_id": 54178
    }
  ],
  "release_date": "2017-07-18",
  "scene_id": 42334,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "brunette",
    "chains",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Gimp",
    "humiliation",
    "leather",
    "master",
    "nipple clamps",
    "oral sex",
    "role play",
    "rope bondage",
    "straight",
    "suspension"
  ],
  "title": "Two Submissive Sluts"
}