{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Roommates Dahlia Sky and Juliette March aren't getting along at all. So they've sought the unorthodox counseling styles of Mona Wales, who helps them find common ground through hardcore lesbian domination! Immediately, Juliette is made to take the full brunt of the punishment, guided by Mona. Dahlia takes out her aggressions on her ass, spanking her and scolding her for being a selfish bitch. She and Mona then strip her naked, and put her to use, licking Dahlia's beautiful puckered ass and pussy. Mona recognizes that both of her clients need correction, so she cracks out her flogger, and flogs Dahlia while Dahlia smothers herself in her roommates hot wet cunt. Dahlia is then instructed to use another toy on Juliette, and works it into her hungry pussy while she gets flogged by Mona. Both roommates cum hard and wet under Mona's expert counseling. But this clearly isn't enough to hammer the message home. Juliette is then put on the floor and turned into Dahlia's and Mona's hardcore lesbian fucktoy. Mona pounds a huge strap-on into her slutty pussy before later sliding it straight into her ass. That giant strap-on then goes back into her pussy while Dahlia fucks her asshole deep and hard. Juliette cums repeatedly while getting selfishly double penetrated, cropped, spanked and flogged, eventually learning the absolute lesson... not to fuck with her roommate, because her roommate will literally fuck her back!",
  "models": [
    {
      "name": "Juliette March",
      "person_id": 22072
    },
    {
      "name": "Dahlia Sky",
      "person_id": 45819
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2017-10-12",
  "scene_id": 42343,
  "tags": [
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "domination",
    "dominatrix",
    "Face Sitting",
    "femdom",
    "Fingering",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "slave",
    "spanking",
    "straight",
    "strap on"
  ],
  "title": "Mona Wales Takes Down Two Angry Roomies In 3-Way Lesbian Dom Session"
}