{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Lusty redhead Penny Pax and gorgeous blonde Carissa Montgomery, go toe-to-toe as switch dommes (and submissives) in this scene of lusty lesbian mutual domination! Penny Pax starts out on top, reminiscing about all the women she’s dominated, but also how she sometimes longs to take on the submissive role. In the meantime however, she uses Carissa Montgomery as she pleases. She leads Carissa–who is bound at the wrists and knees and breasts–from one debasing position to another. She hungrily eats Penny’s sweet wet pussy while being cropped, and is then put on the floor where her big tits are laid bare and Penny sits on her face to get her pussy eaten even more ravenously. Penny cums hard on Carissa, then inspects her submissive’s already soaked slutty pussy. She finger bangs her while making her cum with a vibrator, then leaves her there, tied up, to think about what kind of a slut she is. But Carissa soon turns the tables, and has Penny gagged, and tied up and tied down to the bed, where she flogs her as punishment for treating her so selfishly. Carissa uses clothespins on Penny, driving her wild with pain sensations that she finds exceptionally pleasurable. When the gag comes off, she’s treated to Carissa’s beautiful, wet pussy. Carissa smothers her in her ass and cunt, taking every ounce of pleasure she can from her former domme. The then thrusts a dildo into Penny and uses a vibrator on her to drag her screaming toward an orgasm she can’t control. But ultimately, these two intensely hot women hunger to fuck each other. Carissa plows Penny’s hot pussy wide open with a strap-on, but once Penny cums, she takes the initiative away, commandeers the strap-on and fucks Carissa just as hard. She then flips her over and slams her sweet ass, fucking both of her holes until she fully submits, putting herself right back where she started.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Carissa Montgomery",
      "person_id": 52000
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2017-11-09",
  "scene_id": 42344,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "Redhead",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Lesbian Femdom Role Switch Leaves Both Women Begging For More"
}