{
  "collections": [
    "Electrosluts"
  ],
  "description": "Cadence Lux returns in this sizzling Electrosluts update! Mona Wales knows exactly how Cadence fills her free time -- masturbating to sexy women on the Internet and trying to get them to fuck her. In the first scene, Cadence is hooded, gagged, tied to a chair with her legs spread, decorated in copper bands hooked up to a tens unit. Cadence loves electricity traveling through her limbs, and her moans increase as Mona continues to dial it up. Her pussy is wet before Mona even touches it. Mona makes this little whore squirt within the first 7 minutes and tell everyone just how much her pussy likes being stuffed and used. Mona zaps Cadence's nipples and torments her with clit with vibration, before using the vibrator to squirt all over her eager slave. Cadence degrades herself as Mona plays with her body, and both ladies' lips meet in sloppy spit-filled make outs. Mona flogs Cadence's tits before cranking up the electricity and leaving her slut to fry. Next, Cadence is tied on her hands and knees with conductive tubes wrapped around her cute feet and toes. Mona dials up the electricity and tickles Cadence's sensitive feet. She flogs and spanks Cadence's ass red to warm her up for the electric metal dildo she shoves in Cadence's hungry cunt. The sensation is overwhelming and Cadence is instantly ready to come. Her pussy gets juicier and juicier as Mona fucks her fast and spits all over her. Cadence comes hard as Mona turns the current higher and higher. Then Mona lets her lucky slut lick her cunt, and comes all over her greedy face. She then fingers Cadence to more orgasms, and holds the hitachi to Cadence's cunt. As Cadence comes, Mona shocks her ass all over with the zapper. Cadence screams and shakes as the orgasm and the zappers hit her at once. In the last scene, both ladies face off to see who can make the other orgasm first! Mona breaks out the violet wand and uses it all over Cadence's body. They both lick each other's pussies and once Cadence comes, she owes Mona more orgasms. Mona is just as hungry to be stuffed as Cadence and has Cadence fist her. Mona comes hard all over Cadence's fist, and then both blondes scissor with the hitachi. Cunts grinding together, both ladies come and squirt all over each other.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Cadence Lux",
      "person_id": 51424
    }
  ],
  "release_date": "2017-09-07",
  "scene_id": 42342,
  "tags": [
    "69 Position",
    "Anal",
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "Bush",
    "Cattle Prod",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Dominatrix",
    "Electric Dildo",
    "Electrical Play",
    "Electro Clamp",
    "Electro Plug",
    "Electrode Punishments",
    "Facesitting",
    "Fear Play",
    "Feet",
    "Female Slave",
    "Femdom",
    "Fisting",
    "Flogging",
    "Gag",
    "Hitachi",
    "Hood",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "Pain Slut",
    "Pussy Eating",
    "Rimming",
    "Rope Bondage",
    "Scissoring",
    "Slave",
    "Small Tits",
    "Spanking",
    "Squirting",
    "Straight",
    "Strap On",
    "Submission",
    "Tens Unit",
    "Vaginal Fisting",
    "Vibrator",
    "Violet Wand",
    "Zapper"
  ],
  "title": "Blonde 4 Blonde: Spit, Squirt, and Body Shaking Orgasms"
}