{
  "collections": [
    "Whipped Ass"
  ],
  "description": "The slender and sexy Bianca Stone thinks she has what it takes to be a model, without putting in the effort. But her instructor Lea Lexis isn't having it. She dismisses her other students, and immediately takes Bianca to task for her sloppy attitude, running her through the motions to turn her into the perfect, slutty video girl. First she focuses on posture, making Bianca hold various positions while she spanks her perfect ass, finger fucks her deep slutty pussy, and crops her. When Bianca is anything other than perfect she gets punished. She is then put into a full suspension, dangling head-down from one ankle, while Lea flogs her and spanks her. Lea lets her down partially only to continue finger fucking her, and then sits on her face, using Bianca's hungry tongue to cum. As further humiliation she flogs her again for her efforts! Finally, Bianca is gagged and chained, while Lea shoves a plug up her ass and fucks her dripping pussy with a strap on. Bianca is thrilled to cum as Lea flips her over and fucks her ass, letting her please herself with a vibrator as she takes that long hard fucking. Does Bianca learn her lesson? Does she get to be one of Lea's whorish video girls? You bet she does!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Bianca Stone",
      "person_id": 43437
    },
    {
      "name": "Lea Lexis",
      "person_id": 17836
    }
  ],
  "release_date": "2017-09-14",
  "scene_id": 42345,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "Caning",
    "Chains",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fetish",
    "Fingering",
    "Flogging",
    "Hair Pulling",
    "High Heels",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "LezDom",
    "Oral Sex",
    "Paddle",
    "Pain",
    "Pussy Eating",
    "Rope Bondage",
    "Slapping",
    "Slave",
    "Spanking",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "Vibrator"
  ],
  "title": "Model Student:Disobedient Bianca Stone Whipped Into Shape by Lea Lexis"
}