{
  "collections": [
    "Hogtied"
  ],
  "description": "Helena Locke has an insatiable appetite. She is a hungry lady. She needs more. She demands more. Her expectations are high and frankly she is often let down. Her submissive's tremble at the spike of her stiletto heels and usually their whimpers are enough to satiate her depraved desires. However the sadistic front that she assumes as a stern task master to thankless men is all a facade. She secretly yearns to be put in her place by a real man. She wants giant hands choking her sassy throat and smacking her perfect ass until it glows an iridescent shade of nocturnal neon pink. She crawls into The Pope's dungeon and begs to be treated like a wanton whore who needs to be taught a lesson. And The Pope is only too happy to oblige. He wastes no time and strips her naked and ties her tanned skin and toned muscles with severe rope bondage. Blindfolded and helpless Helena is completely exposed to his sadistic fetishes. Nipple clamps pinch down on small and natural breasts. The Pope yanks on them mercilessly as he flogs her back with heavy leather flogger. She yelps and tries to cry out in pain but the gag in her mouth stifles her pleas for mercy. Now that he has her attention The Pope flips her onto her back and begins to tenderize the front of her body a thick vinyl club and a mean bamboo cane. He attacks her breasts and nipples and you can hear the wind as it rushes out of her taut and exposed lungs with every dull thud of The Pope's wicked tools of impact play. Then before she can catch her breath Helena is strung up in a full suspension with her legs spread wide open. Her exposed pussy and clit are like red bull's eyes and The Pope's laser sights focus on these tender targets. With a black leather riding crop he works her whore hole over making her squirm and scream as the endorphins rush through her body. Breathless and desperate for release Helena begs for mercy and The Pope obliges by cramming a vibrator onto her swollen and hungry cunt. The Hitachi relentlessly stimulates her to heights of pleasure as The Pope rips multiple orgasms from the depths of Helena's soul. Soon the orgasms become painful, unwanted, and overwhelming but once the flood gates open they don't stop. And just when she couldn't cum again The Pope flips her into a doggystyle position so he can focus on her divine and firm ass. He works it over and and turns it red with his gigantic man hands. Her pussy begins to drip as every spank makes Helena wetter and wetter. Her whole body trembles as she thanks The Pope for his attention. And in one last monumental quake of orgasmitic bliss, Helena cums all over The Popes fingers as he works her g-spot like a skilled plumper probing the hidden depths of Helena's darkest masochistic desires.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "The Pope",
      "person_id": 27779
    },
    {
      "name": "Helena Locke",
      "person_id": 59793
    }
  ],
  "release_date": "2017-10-12",
  "scene_id": 42353,
  "tags": [
    "ball gag",
    "bdsm",
    "blonde",
    "bondage",
    "choking",
    "Corporal Punishment",
    "crop",
    "domination",
    "dungeon",
    "Fingering",
    "gag",
    "hand gagging",
    "Handler",
    "Hitachi",
    "humiliation",
    "leather",
    "master",
    "MILF",
    "MILFu",
    "multiple orgasms",
    "nipple clamps",
    "Noose",
    "pain",
    "rope bondage",
    "straight",
    "submission",
    "suspension",
    "The Pope",
    "Vaginal Penetration",
    "vibrator"
  ],
  "title": "Blonde Buff MILF Helena Locke Made to Cum in Tight Rope Bondage!!"
}