{
  "collections": [
    "Device Bondage"
  ],
  "description": "It wasn't all that long ago that Gina Valentina was a virgin to BDSM and Kink.com. About a year ago she walked onto the set of Device Bondage and into the hot hands of The Pope. And once she got a taste of the sadistic treatment and diabolical bondage that we dish out, she was hooked for life. Eager to please and hungry for new experiences, she jumped at the opportunity to put her perfect little body on display and get punished for the whole world to see. The Pope didn't waste any time and quickly restrained her tanned 19 year old body in a cruel implement of classical metal bondage called the Scavengers Daughter. It breaks the will of even the most stubborn and headstrong of captives by hunching them forward and locking their legs wide open. The effort needed to be in this particular bondage quickly wears Gina a down, and the sweat and drool glistens on her skin as The Pope begins to tenderize her body. He methodically works her over to see where her buttons are and to find what makes this insatiable latin slut tick. Blind folded and ladened with nipple and clit clamps, Gina begs her master to cum. She screams as if there someone nearby that can help her. But her howls fall upon deaf ears, and The Pope gets to have his way with her. He always gets what he wants. Gina is then contorted into a doggie style position that leaves her perfect, toned, and smooth ass open for inspection. The Pope lets loose on her with his giant man hands, and makes her ass glow a shiny shade of pink tenderness. He thuds her tight asshole with a small leather switch will pounding her little pink pussy with a massive dildo. Her screams echo through the dungeon and her pussy quivers with masochistic delight. To finish her off, The Pope then extends Gina over a barrel and bends her backwards to make her completely out of control. He then sprays her exposed and vulnerable torso with hot wax and relentlessly inflicts corporal punishment on her tender nipples and pussy. When he thinks that Gina has had enough he chokes her slender neck as he jams a vibrator on her pussy. She begs to cum and The Pope delivers her to the heights of ecstasy. He leaves her in pool of her own sweat and her muscles twitch and spasm uncontrollably as she floats on the clouds of sub-space. Gina Valentina endures brutal metal bondage and rough orgasms and loves every second of it!!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Gina Valentina",
      "person_id": 58814
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-08-24",
  "scene_id": 42351,
  "tags": [
    "19-Year-Old",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "drool",
    "dungeon",
    "Fingering",
    "Handler",
    "Hot Wax",
    "Humiliation",
    "Latin",
    "Leather",
    "master",
    "Metal Bondage",
    "Petite",
    "shaved",
    "smooth",
    "Straight",
    "Sub",
    "Submission",
    "switch",
    "The Pope",
    "toned",
    "Vibrator"
  ],
  "title": "Petite Submissive Slut Gina Valentina Gets Punished in Brutal Bondage!"
}