{
  "collections": [
    "Hogtied"
  ],
  "description": "Raw sexual power. That is what oozes from the athletic and toned, MILF body of Cherie Deville. She takes immaculate care of herself and loves showing off her big tits and firm ass. She knows exactly what she wants and goes right to the source when she feels the need to be a sexual female slave. Cherie drags herself across the floor and begs The Pope to put her in her place. She wants to be a good girl but is so strong willed that she often fails to show proper submission and gratitude to her male doms. The Pope knows just how to train a wanton slut like Ms. Deville and wastes no time stripping her naked and humiliating her under his boot heel. He strings her up in tight and restrictive rope bondage. The appraisive hemp digs and cuts into her skin as she struggles and fights against being restrained in the bondage. But her efforts are futile. There is no escape from The Pope's dungeon once a female male submissive is captured. He toys with her and prods her gently with his massive man hands. Each touch elicits a whimper as Cherie anticipates the brutal touch of a stern taskmaster. The Pope begins to tenderise her body with a heavy leather flogger and works every inch of her skin over making sure to give complete attention to his piece of meat. She starts sweat and beg for mercy and The Pope abides and jams a vibrator on her wet pussy. She squirms and fights against the pain of multiple orgasms but The Pope is relentless and doesn't stop until he is satisfied. Next Cherie surrenders completely and gets tied up in a full suspension that leaves her hungry pussy vulnerable and exposed to The Pope's cruel attention. After withstanding the suspension Cherie bends over and sticks her perfect ass out so The Pope and spank it until it turns pink and raw. She screams and spasms as the orgasm after orgasm is ripped from her unwilling pussy. Eventually The Pope grows tired of her pathetic screams so he lies Cherie on her back so he can joke her out as he crams her tight pink pussy with a massive dildo. And finally after a full day of teaching, Cherie Deville is put in place as she lays panting in a pool of her own sweat and cum.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-10-26",
  "scene_id": 42355,
  "tags": [
    "AprilFools",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Boot",
    "brunet",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "dungeon",
    "fake boobs",
    "Female Slave",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "MILF",
    "multiple orgasms",
    "Pain",
    "Rope Bondage",
    "shaved",
    "Slave",
    "Straight",
    "Submission",
    "Suspension",
    "switch",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Buff MILF Cherie Deville Submits to Rope Bondage and Unwilling Orgasms"
}