{
  "collections": [
    "Hogtied"
  ],
  "description": "Tiny sex kitten Gina Valentina returns to Hogtied to suffer under the massive man hands of The Pope. She starts her day totally exposed and spread wide open while tied in tight rope bondage. She quivers as The Pope slowly begins to probe his little play thing, seeing what makes her purr and what makes her howl. With mean clamps yanking at her tender nipples, The Pope flogs her tanned and toned body with a heavy black leather flogger that prepares her flesh for the day. Grown tired of pummeling her front and back, he attacks her tiny pink pussy and tenderizes it until she squeals and begs for mercy. And for Gina, the only mercy to be found is the head of hitachi that The Pope jams on her sensitive clit and rips the first of many multiple orgasms out of her unwilling cunt. Next The Pope flips Gina upside down to disorientate and confuse his captive slave. He toys with her delicate and manicured feet to inflict pain to hidden parts of her body that she didn't even know that she had. Gina screams over and over and pleads with her dom to give attention to other parts of body. Not without mercy, The Pope abides and jams a massive dildo into her greedy cunt. Probing back and forth relentlessly, she gasps as The Pope crams a vibrator onto her clit and makes her cum and scream like the hounds of hell are nipping at her heals. Thinking that she will get some respite from the disorientation of being inverted, Gina finds herself upside down again and in way over her head. Gasping for air and breathlessly trying to keep her wits about her, The Pope shoves a massive dildo down her throat to shut her up and give her the only kind of pacifier that a whore like her can relate to. To hammer the point home and make sure that Gina knows at whose pleasure she serves, The Pope ends the day by tying her to the floor and relentlessly water-boards her until she can barely breath. And just when she is on the verge of panic, The Pope rips one last devious orgasm from her unwilling cunt and he smiles as she screams quivers under his sadistic hands.",
  "models": [
    {
      "name": "Gina Valentina",
      "person_id": 58814
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-09-28",
  "scene_id": 42350,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "dildo",
    "domination",
    "Feet",
    "Fingering",
    "foot torture",
    "hand gagging",
    "Handler",
    "Hitachi",
    "humiliation",
    "leather",
    "multiple orgasms",
    "pain",
    "rope bondage",
    "slave",
    "straight",
    "submission",
    "The Pope",
    "Vaginal Penetration",
    "vibrator",
    "water boarding"
  ],
  "title": "Tiny Sexual Plaything Gina Valentina Tied and Fucked in Rope Bondage! "
}