{
  "collections": [
    "Device Bondage"
  ],
  "description": "She's back and it has been far too long. Seasoned submissive pro's like Cherie Deville love dishing massive loads of punishment and justice to professionals of adult film world. She has fucked, sucked, smacked, slapped, and sounded every conceivable hole in every conceivable fashion over the course of her career. However, as she dishes out her unique brand of sexual justice on the world she secretly hungers to be put in her place. She yearns for a giant set of man-hands to smother her and choke her until sees God. A woman like Cherie needs to have control taken from her and then have massive orgasms ripped from her hungry holes. And, there is only one place that she goes to have this need met: DeviceBondage.com.\nThe Pope wastes little time and gets his little play thing naked and spread wide open right way. He paws at Cherie's feet like a famished bear that doesn't know its own strength and is blind with hunger. Mercifully he inflicts ceaseless waves of pain to the bottoms of her feet that yield raw gasps of anguish hushed only by the giant ball gag that stifles her pleas for help. The Pope then tenderizes her body with a mean cattle prod that gets his piece of meat inline and behaving like a submissive worthy of his time. He then bends her over and displays her all natural and athletic MILF ass for all the world to see. Using his giant hands, he makes her butt a tender shade of pinks with a spanking that stings Cherie to core and makes her hungry pussy drip with desire. She begs The Pope to play with her cunt and he obliges her by cramming a massive dildo so deep inside of her that you can see it coming out of her mouth. He coerces her to have a never ending way of multiple orgasms until she can no longer hold her own weight. And, when The Pope has grown tired of playing with his whore toy, he straps her into a sybian and watches her gyrate until every drop of sexual energy has been expelled from her body like a greedy demon stealing into the dark night. Cherie Deville gets punished and fucked in sadistic metal bondage and cums until she can hardly stand!!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-09-21",
  "scene_id": 42356,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "Bear",
    "big dick",
    "Blonde",
    "Bondage",
    "brunet",
    "Cattle Prod",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "fake boobs",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "MILF",
    "multiple orgasms",
    "Pain",
    "shaved",
    "Spanking",
    "Straight",
    "Submission",
    "switch",
    "Sybian",
    "The Pope",
    "toned",
    "white"
  ],
  "title": "Athletic MILF Fuck Toy Cherie Deville Punished in Bondage and Sybian!!"
}