{
  "collections": [
    "TS Seduction"
  ],
  "description": "Stefani Special is a tall, slender brunette who knows exactly how to get what she wants out of men...by feeding them and fucking them with her delicious cock! Today her subject is DJ, an always-willing slave who enjoys the punishment she handily doles out. Stefani cuts right to the chase, commanding DJ to verbally submit while maintaining his position in restrictive handcuffs. She uses the crop on his chest and face to show him who's boss, then yanks his underwear down and spanks his little punk ass, breaking him in with still more physical humiliation, before even allowing him to touch her at all. DJ worships Stefani's beautiful feet and tight asshole, while also being whipped with a single tail. The pain is palpable, but DJ continues to beg as ordered, craving Stefani's perfect cock in his mouth. Stefani finally allows him a taste of what he wants, unleashing her gorgeous cock for him to slurp and suck. Once she's wet and dripping, satisfied that he's done a decent enough job, she's ready to slide that hard dick into DJ's hungry ass. She turns him around and pushes it in deep, making DJ her fuck slave for the rest of the afternoon, still in the handcuffs he's been wearing all along. She plows his hole, then makes him suck her cock and lick her beautiful ass before fucking him again, all the while berating him and mocking him. DJ loves every deep inch of her wet dick, pumping in and out of his ass. Stefani finally unloads all over DJ's hard cock, then orders him to jerk himself off with her hot cum. Stefani releases him from his handcuffs so he can finish the job, but then locks him back in them when he's through. DJ is put away wet... saved for later.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Stefani Special",
      "person_id": 49148
    },
    {
      "name": "DJ",
      "person_id": 20225
    }
  ],
  "release_date": "2017-06-27",
  "scene_id": 42365,
  "tags": [
    "Anal",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Crop",
    "Feet",
    "Humiliation",
    "Male Sub",
    "Pain",
    "Role Play",
    "Single Tail",
    "Slave",
    "Straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Stefani Special doms and fucks DJ, her willing handcuffed slave"
}