{
  "collections": [
    "Divine Bitches"
  ],
  "description": "What can be said about a Goddess as divine as Kelli?? Her lean, muscular, athletic, ebony body literally glistens as the stage lights gleam off her big tits and firm tight ass. She exudes the power, authority, and raw sex appeal that makes even the boldest of men cower at her feet. Jonah Marx makes a tragic miscalculation and underestimates Kelli's formidable authority. He brazenly walks into her Las Vegas dungeon wearing only swimming trunks and sunglasses. He figured he was in Vegas and there was no need to be so formal. After all, he was there to party. What he didn't realize was that this party wasn't for him, on the contrary, this is Kelli's party and he is the main course. Kelli quickly puts Jonah in his place and slaps the bitch out of him. He is stunned and freezes like a deer in the headlights. No woman has EVER checked him before. She scolds him for his brazen disrespect and she quickly kicks Jonah's head to the ground. He grovels and pleads for forgiveness, but it is too late. Kelli grabs his wrists and shackles him spread eagle between two columns with leather restraints. She then beats the shit out of him with every leather impact tool that she can get her hands on. Heavy flogger, knotted rawhide whip, stiff crop...the kitchen sink if she could!! She works over his whole body and beats the bitch out of him. He shines from head to toe with black and blue welts and deep red abrasions. He flinches and whimpers as she beats his pathetic cock with a riding crop over and over. But as Kelli wales away at him her keen eye notices something peculiar; the more she beats him, the harder his cock becomes. Once Kelli smells the fear on him and see's his cock engorged she mercilessly beats him and cackles with delight. After Kelli has tenderised his body, she ties him down and begins to probe his whore holes. First she shows him her big, fat, black, strap-on dick and he nearly creams himself in delight. It appears that he is not only a pain hog but he is also an anal queen as well. Kelli rams her big hard dildo into his mouth and makes him gag over and over until her cock is good and lubricated. She then struts over to his tight hungry asshole and proceeds to fuck the shit out of him. He squeals with delight ass Kelli contorts her immaculate body every which way and twerks her ass as she fucks her little toy senseless. Jonah loves every minute of the attention and humiliation. To finish him off, Kelli puts Jonah on his back so she can play with his cock. She uses him like a piece of meat to pleasure herself and makes Jonah cum twice. She then sits on his face and rubs her giant, swollen clit on his tongue while she pleasures herself with a Hitachi. She cums again and again as the vibrator brings her to the heights of ecstasy. When she is through with Jonah she feeds him his own cum, slaps his face, and leaves him tied up, bruised, and broken ...and loving every divine minute of it. Kelli Provocateur showed this pathetic submissive man what real interracial power really means in Las Vegas!!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Kelli Provocateur",
      "person_id": 39587
    },
    {
      "name": "Jonah Marx",
      "person_id": 51893
    }
  ],
  "release_date": "2017-06-23",
  "scene_id": 42362,
  "tags": [
    "Athletic",
    "BDSM",
    "Big Tits",
    "Black",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Ebony",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Interracial",
    "Leather",
    "Male Sub",
    "muscular",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight",
    "Sub",
    "Vibrator",
    "Yes, Mistress"
  ],
  "title": "Ebony Dominatrix Kelli Provocateur Punishes Sub Man and Fucks His Ass! "
}