{
  "collections": [
    "TS Seduction"
  ],
  "description": "We'd like to welcome for the first time on Kink.com, the beautiful Korra Del Rio to TS Seduction. Mistress Korra Del Rio waits patiently like a spider on her web, bored in her dark dank Las Vegas dungeon where she stands idly in great contrast to it, wearing a see-thru white lacy dress with matching white panties and thigh-high stockings wrapped around long luscious legs. Meanwhile, fresh off of the Las Vegas strip, and into Korra's web of seduction, a boisterous and boastful Will Havoc struts in, wearing pink nut-hugger shorts and sunglasses. He's here to see what all of his friends have been talking about. Stunned by Korra's remarkable classic beauty and intoxicatingly domineering nature, Will can't help but immediately change his whole attitude and submits to Korra's every command. At first she makes her new male sub get on his knees to worship her feet and long legs kissing and licking all the way up until she makes him take her panties off using only his mouth. Korra buries Will's face deep in her gorgeous round ass. Korra's cock gets so rock hard from Will tonguing her hole that she turns around and furiously fucks his mouth with no hesitation until her cock and his face are both dripping with spit. Korra then commands Will to get on his back and bends him in half to have a taste of his ass and cock. Korra slaps, spanks, and tongue-fucks Wills ass while sucking and jerking his cock until Will is begging for her to fuck him with her cock. Mistress Korra gives him every inch of her cock along with an ass fucking that he'll always remember. Korra ravages his hole in doggie and when she flips him over, pounds the cum right out of them both and feeds Will every drop.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Korra Del Rio",
      "person_id": 56019
    },
    {
      "name": "Will Havoc",
      "person_id": 46285
    }
  ],
  "release_date": "2017-06-13",
  "scene_id": 42363,
  "tags": [
    "Anal",
    "Blowjob",
    "Cock Worship",
    "dungeon",
    "Feet",
    "Male Sub",
    "Nylons Stockings",
    "Role Play",
    "Straight",
    "Sub",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "TS Mistress Korra Del Rio Dominates a Douchebag"
}