{
  "collections": [
    "Bound Gods"
  ],
  "description": "Christian Taylor can't seem to get a moment's peace at work with his boss, Jaxton Wheeler constantly tormenting him. Once the timing's right, and Christian has the whole place to himself, he decides to take some time out of his work schedule to play with his hard cock. Just when Christian was enjoying himself, the pervy boss catches him in the act and decides to teach his runt a lesson. Squirming in bondage, the helpless boy pleads for mercy as the riding crop beats him into submission. Out in the store front, Jaxton strokes his big cock as he gazes upon his fuck toy, drooling all over himself from the spider gag prying him open. All Christian can do is helplessly scream while enduring a heavy flogging but his screams are immediately muffled as Jaxton's hard cock rams down his throat. Blindfolded and gagged once more, Christian's propped up with his ass sticking out. Clothespins painfully clamp across the boy's juicy ass and shoulders before his muscled boss is ready to fuck. Jaxton pounds away on Christian's hole and shooting a load across his face. But when Christian begs for release, Jaxton tells him to shut the fuck up and clean this place up, he has more work in the morning...",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jaxton Wheeler",
      "person_id": 53352
    },
    {
      "name": "Christian Taylor",
      "person_id": 60281
    }
  ],
  "release_date": "2017-06-01",
  "scene_id": 42360,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Daylight Savings",
    "Domination",
    "Facefucking",
    "Flogging",
    "Foot Torment",
    "Gag",
    "Gay",
    "Hair Pulling",
    "Humiliation",
    "Male Sub",
    "master",
    "Mouth Spreader",
    "Pet Play",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Sadism",
    "spider gag",
    "Submission",
    "Twink",
    "Voyeurism Fantasies"
  ],
  "title": "Abuse in the Workplace"
}