{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Cherry Torn is a brunette goddess, and an intimidating, determined dom to Kink newcomer, K Dynamite. His nervousness and apprehension are on full display as he submits to Cherry, and she takes immense delight in toying with that nervousness. Cherry starts out kind, teasing K with the light brushing of a flogger, before striking him with it increasingly hard. K Dynamite wears a mask with his mouth covered, so Cherry teases him with her luscious wet pussy, right up against his face. She leans over so he can feel her beautiful body against him, such an overwhelmingly wonderful sensation, as she licks and then bites his cock. The whole time all he can do is stare straight into her perfect pussy, just out of tongue's reach. The torment continues as Cherry works K Dynamite for his absolute devotion, and a promise that he'll offer up his asshole for her to fuck. He's clearly not looking forward to that pounding, but he wants to please his mistress, so he'll do what she demands. Cherry gets fucking crazy turned on by K Dynamite's fear, and just as excited by his enthusiasm. A slave can be afraid, but brave, and K is both. Cherry starts him off with a finger in his ass, just to ramp up his fears. He knows her cock is going to slide inside him soon, and she's going to peg him deep. But he's ready to please. Ready to take that cock. Cherry flips him onto his back so she can see the look in his eyes when she finally rams her hard cock inside him and pegs him to within an inch of his life. She is not disappointed. She slides that hard strap-on in and out of K Dynamite's insanely tight ass, and at the same time shoves her feet into his mouth. It's a huge challenge for him, but he take it and takes it. He loves foot worship, but he struggles through the ass fucking. Cherry finally cums hard, satisfied by the predictability of a vibrator and the eager wetness of K's hungry mouth and tongue. And once she's satisfied, she concludes that K Dynamite--while a good sport and a dedicated submissive--has served his purpose.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "K. Dynamite",
      "person_id": 60314
    }
  ],
  "release_date": "2017-07-07",
  "scene_id": 42364,
  "tags": [
    "bdsm",
    "bondage",
    "brunette",
    "CBT",
    "Cherry Torn",
    "Corporal Punishment",
    "dominatrix",
    "Facesitting",
    "Feet",
    "femdom",
    "Fingering",
    "foot worship",
    "humiliation",
    "Male Sub",
    "mask",
    "orgasm denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "straight",
    "vibrator"
  ],
  "title": "Lusty Cherry Torn Teases, Torments and Fucks K Dynamite"
}