{
  "collections": [
    "TS Seduction"
  ],
  "description": "Even the most seasoned of performers can get nervous. When the jitters come, some people reach for a drink or maybe take some deep breaths but for the tall TS goddess Sofia Sanders there is only one thing that can help her relax: FUCKING! Lucky for her Pierce Paris is all too willing to do whatever it takes to help a lady get ready for her performance. Sofia drags Pierce to her with a raw magnetic sexual pulse that instantly makes his cock rock hard. She lets him slowly worship her body, and Pierce showers her with kisses and the softest of touches. Once Sofia knows that he is hers to command she takes out her huge cock and stuffs it down his throat. Pierce devours her stiff rod and begs Sofia to plunge deeper into his willing throat. Tired of his pathetic attempts to please her, Sofia then flips her hung little bitch over and begins to probe Pierce's hungry asshole with the long hard strokes of her massive cock. Pierce moan with ecstasy and begs his mistress to peg him harder and faster. Sofia slaps her submissive man's ass and begins to probe his tight hole with her fingers. Pierce's hungry hole devours her whole fist and as Sofia internally massages his prostate while he drools and gasps, enraptured in speechless bliss. She begins to pull her fist in and out of his willing asshole and his eyes roll back into his head and he pleads with her to not stop. And just when he can't take another moment of the anal penetration Sofia drags him to the floor and jams her cock back into his mouth and cums all over his face. Pierce licks her cock clean and thanks her again and again for her generosity. Pleased with his devotion, Sofia then sucks his cock and edges him towards release. And in one last breathless moment of ecstasy, Pierce blows his load all over himself and collapses in sweaty heap into the loving arms of his goddess. Sofia Sanders fucks and fists her bronzed and hung slave in the ass and cums all over his face!!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Sofia Sanders",
      "person_id": 45360
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2017-07-11",
  "scene_id": 42370,
  "tags": [
    "Anal",
    "Blowjob",
    "Cock Worship",
    "Latin",
    "Male Sub",
    "Role Play",
    "Slave",
    "Straight",
    "Stud",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Stunning TS Goddess Sofia Sanders Fucks and Fists a Hung Muscled Stud!! "
}