{
  "collections": [
    "Men On Edge"
  ],
  "description": "The tables are turned as beef cake Trenton Ducati gets edged! Clad in leather, Trenton Ducati and Sebastian Keys start with a flog-off. This competition gets both men hot as they flog each other hard on their muscled backs and gorgeous asses. Once their asses are red, the real fun begins. Sebastian ties Trenton up tight with rope. With his arms above his head and his legs tied down, Trenton is unable to escape from the torment and pleasure that is about to come. His cock stands hard, exposed and ready for Sebastian's devious plans. Sebastian teases Trenton's hard cock relentlessly with his hands, his mouth, and a tight stroker. Trenton moans, curses, and strains in his bondage as he unsuccessfully tries to get off. His hips thrust in the air over and over again as he buries his cock in Sebastian's wet mouth and pushes his big dick through the stroker's tight hole. Every time Trenton is ready to blow his load, Sebastian backs off, delighting in denying Trenton orgasm. Sebastian continues teasing Trenton's cock as he flogs Trenton's cock and abs. Next, Trenton is bound by leather on his back, with one of his legs up in the air. Sebastian strips Trenton's foot bare and begins licking and kissing the foot as he plays with Trenton's fat cock. This foot worship only makes Trenton's cock harder and builds his need for release. Sebastian continues jerking Trenton off as he licks Trenton's cock, balls, and asshole. Trenton loves feeling Sebastian's beard scrape across his body. Sebastian worships Trenton's hairy sweaty armpits, taking in Trenton's scent and kissing and licking the sensitive skin that is exposed. Finally, Trenton is allowed to come and blows his hot thick load all over his belly. Sebastian continues teasing Trenton's sensitive head, and sucks Trenton's cock clean.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    }
  ],
  "release_date": "2017-07-25",
  "scene_id": 42386,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Edging",
    "Foot Worship",
    "Gay",
    "Hairy",
    "Humiliation",
    "kink-pov-gay",
    "Leather",
    "Male Handler",
    "Male Sub",
    "master",
    "muscular",
    "Oral Sex",
    "Prostate Stimulation",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "Tattoo",
    "Tickling",
    "versatile",
    "white"
  ],
  "title": "Trenton Ducati Submits"
}