{
  "collections": [
    "Bound Gods"
  ],
  "description": "It’s Pride week in the Bay for this week’s update, and you know that means all sorts of kinky adventures are bound to happen for all these hot men attending. Jay Austin decided to take his first trip to SF for Pride, and while wandering through Chinatown he totally found himself his first experience, whether he was ready for it or not. Someone should’ve told Jay about San Francisco’s residents and their love to go green. So when Jay Austin finishes his snack and leaves his trash behind on his walk down a back alley, he doesn’t realize Max Cameron catches him in the act and will make him pay for it. Jay gets himself so worked up being caught and grabbed by Max he immediately has a hard dick come out of his pants and precum leaking all over his briefs. Max bounds Jay up in the dirty alley and uses Jay’s mouth as punishment for being a litter bug. But he’s not done with him just yet, he puts Jay up in suspension for anyone walking by the alley to see, and flogs his ass and back mercilessly to punish Jay some more. Max uses both of Jay’s holes while Jay is shackled to a railing and screaming with pleasure for all the unsuspecting bustle of people walking the city to hear. Max’s sadistic nature and distaste for litterbugs means Jay get’s nothing but a chastity and leaves him bound and chained below a San Francisco city drain to scream for help beneath the unknowing feet, cars, and bikes of the city’s traffic forever.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jay Austin",
      "person_id": 60225
    },
    {
      "name": "Max Cameron",
      "person_id": 57500
    }
  ],
  "release_date": "2017-07-06",
  "scene_id": 42388,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Chastity Play",
    "Corporal Punishment",
    "Domination",
    "Edging",
    "Facefucking",
    "Feet",
    "Gay",
    "Hand Gagging",
    "Humiliation",
    "Kinky",
    "Male Handler",
    "Male Sub",
    "master",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Sadism",
    "Stud",
    "Submission",
    "Suspension",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Muscle Stud is Shackled & Flogged in the Streets for SF Pride Weekend"
}