{
  "collections": [
    "Bound Gods"
  ],
  "description": "Seamus O'Reilly still hasn't had his car fixed after being abused by the pervy mechanic D Arclyte, so he tries the only other shop in town. Muscled hunk Lance Hart is working away in the shop when the disgruntled ginger storms in. Lance tries to explain that he only works on bikes, but Seamus isn't having it. All hell breaks loose for poor Seamus when he's taken from behind and dragged back into the shop for some abuse. Turns out mechanics in this town talk, and Lance heard all about Seamus' previous encounter and decides it's time to have a little fun of his own. He straps the boy between two bikes, paddling his pale flesh to a bright red before attaching clover clamps from his balls to his nips. Seamus screams at the top of his lungs but it's nothing compared to the flogging that follows. Lance strokes his hard cock as he beats his fucktoy down to submission all while a painful zipper clamps down his sides. Bent over a stack of tires, Seamus takes cock from both ends as the horny biker torments him with the zapper. Lance finally pulls out his raging cock and blasts a hot, thick load all over his boy's face before dragging him off into the night for all his biker buddies to enjoy!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Lance Hart",
      "person_id": 37346
    },
    {
      "name": "Seamus O'Reilly",
      "person_id": 51523
    }
  ],
  "release_date": "2017-06-22",
  "scene_id": 42382,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Flogging",
    "Gay",
    "Hairy",
    "Humiliation",
    "Kidnapping Play",
    "Male Sub",
    "master",
    "Nipple Torment",
    "Paddle",
    "Redhead",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "Twink",
    "unshaved",
    "versatile",
    "white",
    "Zapper",
    "Zipper"
  ],
  "title": "Hot biker stud captures a hung ginger and mercilessly fucks his hole"
}