{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Annie Cruz is returning for season 15 with a mean streak. She’s known for cumming on the mats but those days may be over. She’s gained some experience in wrestling and she’s a bonafide Asian babe bad ass. Today she’s taking on one of the biggest wrestlers ever to grace the ultimate surrender mats. a 6’1 and 165lb, Lux Lives is a true amazon goddess. She has been training under Daisy Ducati to get some skills under her strap on belt. Because Lux is so big and strong she is able to over power the petite Asian but Annie Cruz puts up an amazing fight and she put the amazon into some real trouble. This is a close match up. Size vs. Speed. Both girls get fingers into their opponents. One girl rides her opponents face. By the end of the match, the girl who was able to score the most point via Finger, relunctant kissing, face sitting, scissoring, trib fucking, breast fondling and other ways of perversion is deemed the winner. The winner drags the loser into the locker room, ties her up in rope bondage with a crotch rope and chest harness and strap on fucks her until she cums against her will. The winner fingers the loser and spanks the losers tender ass until it’s pink and hot. Once the winner decides the loser has been tormented enough with orgasms, she takes her prize via the face of the loser. The winner rides the losers face until she is quivering with orgasms and then she leaves the loser in the locker room for all the other girls on the season 15 roster to take their turns on her. This is 100% unscripted competitive wrestling with no weight class. True brutal Sexual domination no and off the mats",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Annie Cruz",
      "person_id": 7776
    },
    {
      "name": "Lux Lives",
      "person_id": 60393
    }
  ],
  "release_date": "2017-08-16",
  "scene_id": 42399,
  "tags": [
    "Anal",
    "Asian",
    "Bondage",
    "Brunette",
    "Crotch Rope",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Petite",
    "Pussy Eating",
    "harness",
    "Rope Bondage",
    "Scissoring",
    "shaped",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Annie Cruz Cums While She Uses Beautiful Amazon's Face as Her Prize"
}