{
  "collections": [
    "30 Minutes of Torment"
  ],
  "description": "Like a greek statue chiseled from marble, Alex Mecum stands tall, his muscles glistening with sweat as he awaits the 30 Minute Challenge before him. Against the wall, his hands are bound above his head, exposing his beefy chest and torso for complete torment. Alex's raging hard cock throbs between his legs as Sebastian's hands rain down against his body. But Alex just begs for more, but he quickly learns that he should be careful what he wishes for...The flogger whips against his thick piece of meat sending Alex's screams over the moon as he's mercilessly beaten front to back. Strapped to the chair, a ball gag muffles the muscled hunk's moans. Tight clover clamps torment his nipples and balls, the pain so excruciating even the ball gag can't contain his screams. But that's nothing compared to the sensation of having them ripped from his flesh. Now that we've taken care of his balls, we then turn our attention to his aching cock. A variety of sounds slide deep inside his cock, fucking his insides as each sound gets bigger and bigger. Once his cock has been fucked, we let loose the depraved gimp, ravaging his hole as the riding crop torments his nipples once more. Upon his completion, Alex is then freed from his bondage where he strokes his sensitive cock and oozes his load all over himself as reward.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Alex Mecum",
      "person_id": 59595
    }
  ],
  "release_date": "2017-07-14",
  "scene_id": 42390,
  "tags": [
    "Anal",
    "Ball Gag",
    "big dick",
    "body builder",
    "Bondage",
    "brunet",
    "Brutal Punishment",
    "CBT",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Extreme Torment",
    "Gag",
    "Gay",
    "Gimp",
    "Male Handler",
    "Pain",
    "Rope Bondage",
    "switch",
    "the chair",
    "the pit",
    "the wall",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Muscled God Endures Extreme Torment"
}