{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Mr Pete gets lured into Alexa Nova's flirtatious little web in this week's SAS update: Blue Collar Justice. Hot and sweaty Mr Pete is doing yard work just minding his own business when sexy little minx Alexa Nova saunters out onto the porch in her panties. With her hard nipples protruding through her top she gives him a flirtatious but sassy glare and walks away showing off her cute round ass.\nWell if that isn't an invitation I don't know what is. But this girl has some attitude! Mr Pete knocks on the door to ask for water and she's got the looks that kill--half bitchy and disgusted with him and half I want to fuck! Mr Pete makes his way inside to dig into this delicious mess. Playing hard to get this horny bitch tells Mr Pete that if he wants it he is going to have to take it. And boy does he. Mr Pete manhandles little Alexa like a good Dominant. He ties her wrists together, takes her down in a chokehold and slaps and fingers her pussy to get her warmed up. Mr Pete can't wait to get Alexa's plump and juicy cock sucking lips on his hard dick. He plays with her pink pouty lips and throat fucks her until she slobbers all over his cock getting it nice and wet. He puts her in doggie style and slides that massive cock of his in her tight slutty pussy. Mmm finally what she's been waiting for. He fucks her and she takes it until she is screaming to cum. Now that she's had her fun she turns back into a bitch and kicks Mr Pete out of the house--get back to work! Hmm kinky. Later she tries to persuade Mr Pete to get rid of her man so they can run off together. Yeah right this horny slut is delusional. But Mr Pete wants another piece of her sweet ass so he ties her up on the bed to show her who's boss with some corporeal punishment and some over the top orgasms. One leg up one leg down she is tied up tight to the bed so her ass and pussy are spread open and easy to get. Adorned with a ball-gag and nipple clamps she gets a good flogging, caning, cropping and then the beloved Hitachi. Mr Pete knows just the spot to push Alexa over the edge as he vibes her pussy until she is moaning with delight. Then he fills her pussy and tight ass with his big cock and fucks her deep and hard. He flips her over onto her back and ties her hands to the bottom of the bed frame so her legs are wide open with her ass and pussy begging for attention. More Hitachi on her hungry pussy until her whole body is vibrating with pleasure. Mr Pete stuffs her ass with his thick cock and pounds her out until he shoots his load all over her. All in a day's work--Now that's some Blue Collar Justice.",
  "models": [
    {
      "name": "Alexa Nova",
      "person_id": 57359
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2017-08-04",
  "scene_id": 42392,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "caning",
    "cock sucking",
    "collar",
    "Corporal Punishment",
    "domination",
    "flogging",
    "gag",
    "Hitachi",
    "humiliation",
    "kinky",
    "nipple clamps",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration"
  ],
  "title": "Blue Collar Justice"
}