{
  "collections": [
    "Fucking Machines"
  ],
  "description": "It has been far too long since the long athletic legs and magical squirting pussy of ebony goddess Daisy Ducati graced the set of Fucking Machines. She dives in head first and strips naked and toys with her tight pink pussy. She teases her sensitive clit with the head of a hitachi until she is warmed up and ready to get the shit fucked out of her. Laying on a table she spreads wide open and invites the first machine to penetrate her and edge her towards orgasmic bliss. The fucking machine slowly builds with intensity until Daisy explodes the first of many multiple orgasms. She squirts her love juices all over herself and machine and smiles the devious grin of a hungry whore who only wants more. The steam from the heat of her ejaculation radiates off of the fucking machine as it relentlessly fucks her into sweaty hot mess. Next she bends over so the whole world can worship the sight of her divine ass and long luscious legs. She spreads her ass cheeks so we can peer into her pussy and watch as the massive dildo probes deep into depths of her magic pussy. She quivers and shoots another massive squirt all over herself and our set, soaking everyone to the bone. To end the day she gets on the ground and takes our fastest and hardest machine at full throttle. She squirts over and over as the machine bangs her into submission. But Daisy is insatiable and wants more and more. Lucky for her the fucking machine never gets tired and fucks her again and again like a relentless task master. And Daisy doesn’t disappoint and builds up to one last gigantic squirt that soaks everything within a ten foot radius. Daisy Ducati gets banged by our fastest and hardest fucking machines and squirts everywhere!!!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    }
  ],
  "release_date": "2017-09-27",
  "scene_id": 42393,
  "tags": [
    "April Showers",
    "Athletic",
    "Dildo",
    "Ebony",
    "Hitachi",
    "Machine Dildo",
    "master",
    "mixed",
    "multiple orgasms",
    "natural boobs",
    "Redhead",
    "shaped",
    "Squirting",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "Vaginal Penetration"
  ],
  "title": "Ebony Squirt Queen Daisy Ducati Gets Royal Fucking Machines Treatment!"
}