{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Jenna Foxxx was the most orgasmic wrestler for last season. She had so many orgasms ripped out of her, we have lost track of them all. She is so orgasmic she even won the rookie cup \"most orgasmic wrestler\" match up. Every girl who's stepped on the mats with this all natural, barely legal, ebony goddess has made her cum. While we love to see wrestlers progress in their skills on Ultimate Surrender, it's sometimes fun just to watch a rookie get used to mop the floor. Today Daisy Ducati is the Janitor and she's gonna clean house on poor little Jenna. Once Daisy Ducati get's her long lean lethal legs around you, it's over. No one stands a chance. Daisy punishes Jenna with submissions and orgasm, just the way you wrestling fans love to see it. After Daisy finger fucks orgasm out of Jenna for 3 straight rounds, Jenna can barely walk. She is dragged into the locker room and made to suck Daisy's strap on cock to get it nice and wet so that Daisy can ram the cock deep into Jenna's tight youthful pussy. Daisy takes Jenna into the shower to fuck her against the wall and fishhook her filthy whore mouth. Daisy finishes her punishment on Jenna back in the locker room. She fucks her tight hole until it's beat up and tire. Then Daisy sits on Jenna's face and users her loser mouth to get her own orgasms. After Daisy face sits and orgasms all over poor Jenna's face, Daisy leave poor Jenna in the locker room for all the wrestlers who are getting off of practice to see and take advantage of. Daisy is relentless in wrestling and fucking. She takes her Prize the way she wants to and today it's with brutal face fucking, strap on fucking, slamming girls into walls and pounding her pussy into her loser's face",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Jenna Foxx",
      "person_id": 59055
    }
  ],
  "release_date": "2017-08-23",
  "scene_id": 42398,
  "tags": [
    "domination",
    "Ebony",
    "Facesitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "the wall",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Ultimate Surrender's Most Orgasmic Wrestler Is Drained from Orgasms"
}