{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Cheyenne Jewel is an all Natural muscular fierce competitor. She likes to wrangle her girls in wrestling and then fuck the crap out of them in the prize round. Today she is taking on a rookie who is bendy and ferocious. Serene Siren is a tall thin flexible blond who thinks that her flexibility is going to get her out of holds and in to control. She thinks her calmness from being a yogini will help her keep a strong state of mind to be able to attack Cheyenne Jewel. Serene has never wrestled before and her crazy notion that she could possibly beat Cheyenne is testament to her inexperience and lack of knowledge in the way of sexy fighting. This is 100% real competitive erotic wrestling where the winner gets to fuck the loser. Serene does do a excellent job taking Cheyenne Jewel down in the first round. Cheyenne is shocked and for a few moments she is stuck and takes a finger. Maybe this bendy blond and her hippie antics may actually work. The match is back and forth action with some beautiful reversals , sweeps and takedowns. Both these girls show resilience and heart. Only one girl can win and fuck. The other is a loser and must be fucked. The loser is tied up in bondage, fucked until she is exhausted from orgasms and then her body is used for the winner’s enjoyment. Lesbian Trib fucking, toe and foot sucking, pussy licking, strap on sex…these two lesbians give a hell of a sex show",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Serene Siren",
      "person_id": 50289
    }
  ],
  "release_date": "2017-10-18",
  "scene_id": 42400,
  "tags": [
    "Anal",
    "blond",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Domination",
    "erotic wrestling",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Flexible Blond Yogini Gets Bent Until She's Nearly Broken by Muscles"
}