{
  "collections": [
    "Everything Butt"
  ],
  "description": "Anna De Ville has a serious problem with enclosed spaces. She has terrible panic attacks just thinking about small places. She's seeing Doctor Francesca Le to help her with her unrealistic terror of enclosed spaces. Anna's case of Claustrophobia is so severe that she can't take the elevator and has a terrible time going up the stairwell to get into Francesca's office. It's complete Torment for Anna to walk up the stairs in that tight small area. Francesca has been seeing Anna for a while. She knows everything about Anna. She especially knows how much Anna enjoys Anal Sex. Francesca is going to try an experiment with Anna to help her overcome her fear of tight spaces. Francesca doesn't want to ruin the surprise so she has Anna close her eyes and think of the best anal sex she's ever had. When Anna opens her eyes, she's tied up in bondage. Her breath shallows, her eyes widen. She is starting to panic and Francesca knows she's going to need to work fast before Anna starts screaming in a panic. Quickly Francesca starts fondling Anna's asshole, licking it, caressing it, putting fingers and thumbs into the asshole. Francesca gets Anna so aroused with fingering of the ass, that she's able to get her entire hand into Anna ass for a beautiful, rough Anal Fisting. Anna's body pushes against the bondage, She feels trapped but she's fully aroused. Her mind is confused. The fear is actually helping her orgasms cum harder and faster. Francesca moves from toy to toy to get Anna's asshole to gape open in a beautiful heart shape. Francesca gets gapes with a long metal toy, the a huge Blue silicon toy. To get the gape to stay open for a long time, Francesca get's Anna's asshole spread open with an anal speculum. She is stretched so wide we can see her insides in all their pink hole glory. Francesca licks and sucks on Anna gape then takes Anna into the dreaded Stairwell where she is bent over and fucked in the ass with an anal strap on. The walls start closing in on her. The fear sets in just as she is climaxing from getting fucked in the ass so hard. Anna cums on Francesca's strap on cock and is cured of her claustrophobia on the spot.",
  "models": [
    {
      "name": "Anna De Ville",
      "person_id": 59053
    },
    {
      "name": "Francesca Le ",
      "person_id": 36526
    }
  ],
  "release_date": "2017-10-06",
  "scene_id": 42403,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "bondage",
    "buttplug",
    "dildo",
    "doctor",
    "dominatrix",
    "Fingering",
    "fisting",
    "gape",
    "gaping",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "prolapse",
    "speculum",
    "straight",
    "strap on"
  ],
  "title": "Anal Bondage to Cure Claustrophobia"
}