{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Violet Monroe is on a relaxin retreat enjoying herself when she stumbles upon a cute little genie bottle. It's a little dusty from being outside for so long so Violet rubs it to clean it. Next thing Violet knows, she's tied up in white rope bondage in a cramped pillowed lair of a beautiful Asian Genie. Venus Lux is stunning in her blue Genie wardrobe which she has been wearing for centuries. Venus is elated to see the beautiful red headed human inside her genie space. Venus explains to Violet that she is tied up in bondage to help her become accustomed to being trapped. Violet is confuses since she thought encountering a genie would give her 3 wishes. Venus explains that humans have misinterpreted the translation of the legends of the genie. If you are unlucky enough to rub on a genie lamp, you will be made to take place for the genie until an unsuspecting victim rubs your new home and releases you. The Curse will put Violet in the bottle for Lord knows how long. Venus decided to show mercy to Violet and bless her with one last fucking to tied her over for the long hull of being stuck in the bottle. Venus gives herself a penis so that she can fuck Violet the proper way. Violet is immediately pacified when she sees the beautiful female genie with a big beautiful throbbing cock. Violet requests to suck on the cock even though she will be stuck in bondage. Venus gives Violet everything she could possibly need for her last fucking. Deep throat fucking, Pussy eating, fingering, pussy pounding. These two girls fuck each other with the kind of passion you would expect from a \"last fuck\". Venus even nuts a huge load into and on Violet's pussy. Saddly for Violet Venus leaves the bottle to see what 2017 looks like and after she exits she decides to put the bottle deep into the water so that no one will ever find the bottle to let Violet out. Violet must spend eternity stuck in a bottle with Venus's cum inside her and glued to her pubic hair.",
  "models": [
    {
      "name": "Violet Monroe",
      "person_id": 20284
    },
    {
      "name": "Venus Lux",
      "person_id": 41417
    }
  ],
  "release_date": "2017-08-14",
  "scene_id": 42404,
  "tags": [
    "Asian",
    "blowjob",
    "bondage",
    "Cock Worship",
    "Fingering",
    "Pussy Eating",
    "role play",
    "rope bondage",
    "straight",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "The Evil Genie With a Weenie seduces Violet Monroe with her cock"
}