{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Lea Lexis has been on fire for her last few matches. She have been dominating cute little rookies and taking a lot of ass in the process. Today We are throwing Lea to the wolves. Possibly the most troublesome rookie on the roster for Lea is this muscle bound babe, Brandi Mae. Brandi Mae is the biggest, strongest girl we have this season. She can stack up every other rookie in a pile and Brandi Mae could deadlift them all. She's strong beautiful and she's been training to finally get a \"W\" under her name. Lea Lexis is standing in Brandi's way. If you've ever seen Lea wrestle before, You know she absolutely HATES losing. She very rarely submits sexually to women on camera but she does it almost exclusively for Ultimate Surrender because she feels if a woman can best her in wrestling, out power her, trap her, hold her down and have her way with her, She feels it's only fair to submit sexually to that woman. Today Brandi wants to be THAT woman. These girls clash on the mats and Lea Lexis is taken aback by the brut strength of Miss Brandi Mae. One girl is able to take the advantage and attempts to get fingers into her opponent's pussy without them getting crushed by the powerful thighs of her opponent. This is a true display of power against power. Both these woman have powerful lethal thighs that could crush a skull. Their Back muscles bulge and undulate as they aggressively finger and kiss each other in hopes of gaining the point advantage at the end of the match. The Winner is determined and she is dragged in to the center of the mat to have her face fucked, pussy fucked and mind fucked as she is made to worship the muscles of her victor. Winner ties up the losers hands with her own wrestling outfit. Hands tied, face down, the Loser if fucked hard and then flipped over for Clit sucking and trib fucking. The Winner takes every last piece of energy the loser has out of her. The loser gives the Ultimate surrender to the winner.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Lea Lexis",
      "person_id": 17836
    },
    {
      "name": "Brandi Mae",
      "person_id": 59885
    }
  ],
  "release_date": "2017-09-20",
  "scene_id": 42401,
  "tags": [
    "Anal",
    "body builder",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Muscle",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Beautiful Gymnast Takes on Rock Hard Female Body Builder"
}