{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Penelope Reed is masturbating before bed to her favorite lesbian porno. After rubbing her clit to orgasm, she goes to sleep dreaming of being domination and helpless. Suddenly, she wakes up in an unfamiliar location, bound in rope, and at the mercy of two horny lesbian sluts, Aiden Starr and Bella Rossi! Once Penelope admits she is a filthy lesbian pervert, she gets to join the epic lesbian sex fest that ensues! Aiden and Bella start with inspecting their toy's wet cunt. Penelope moans, helpless, as Aiden exposes her breasts and plays with her pussy. She gets flogged and smothered under Bella's beautiful ass. Next she gets teased and edged and finger-banged. Her moans increase as Aiden crops her clit over and over again, harder each time. She begs to cum and is granted release for being such a good girl. Now it's time to prove what a good lesbian whore she is. Penelope worships both ladies' cunts as she gets flogged and spanked. After they both cum all over her face, Penelope rims Bella's asshole as she gets fucked by Aiden's rock hard cock. Bella cums with Penelope's face buried in her asshole, and then the ladies put a strap-on cock on Peneleope. It's time to make her fuck like a lesbian too! Penelope slips her cock into Bella's hungry cunt, and rocks her hips back and forth, penetrating Bella deeper and deeper. While Penelope fucks Bella, she sucks Aiden's cock, preparing it for Bella's asshole. Bella moans as Aiden pushes her cock into Bella's asshole, and Penelope maneuvers so she is able to suck Bella's clit while she gets fucked. After Bella cums hard with a cock in her ass, Penelope slips her cock in Bella's hungry cunt and Bella gets DP'd by two cocks! Body trembling with orgasm, Bella cums hard on the dicks. Finally, Bella and Penelope take turns licking Aiden's asshole. Once Aiden cums hard on their faces, she puts Penelope back to bed and drags Bella away for more lesbian shenanigans.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Penelope Reed",
      "person_id": 54507
    }
  ],
  "release_date": "2017-11-24",
  "scene_id": 42414,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pierced Pussy",
    "Pussy Eating",
    "Slave",
    "Straight",
    "Strap On",
    "Sub"
  ],
  "title": "Dominating Dreams: First Time Kink Model is Tag-Teamed by Horny Lesbos"
}