{
  "collections": [
    "The Training Of O"
  ],
  "description": "It is always the quiet ones that you have to watch out for. Sexy girl next door Roxanne Rae returns to The Training of O to continue her training at the hands of the sadistic Ramon Nomar. Don't let her coy smile and glasses fool you. Roxanne is a brat that needs to be put in her place and reminded at whose pleasure she serves. It is a beautiful summer day and Roxanne hasn't done anything all day besides twirl her beautiful curly brunette hair, eat potato chips, and play with her lacy panties and little pink pussy. She was supposed to have dinner cooked for Ramon when he gets home from a long day of work but instead Roxanne has been on her phone texting and flirting with people. When Ramon gets home he is furious and tries to confront Roxanne about her lack of discipline and her lazy ways. The only defense that she offers is back talk and sass. Infuriated, Ramon grabs his wanton slut by her hair and drags her kicking and screaming into the bedroom so she can receive her punishment. Ramon decides that the best way to shut his little masochistic slave up is to tie her to the bed and then clamp nasty clothespins to her tongue and her pussy. Her temperament begins to improve when she remembers her place in the home. He shoves his massive, throbbing cock down her mouth and she winces from the pain of the clothespins. She quickly wants to please her master and apologizes for her insubordination. Ramon only laughs and rewards her by jamming his dick down her throat again and again as she drools and makes a mess of herself. Satisfied with her devotion he then jams a hitachi onto her pussy and makes her beg to cum. She grinds on the vibrator purring with delight and pleads with her daddy to let her climax. Ramon is a reasonable man and allows her a brief moment of pleasure. But her delight is short lived and he quickly ties her face down and ass up with her wrists tied to her ankles in tight rope bondage. He mercilessly whips her with a set of mean black leather floggers while she begs to be taught a lesson. Once her smooth skin is tenderized Ramon jams his stiff rod into her pussy and she screams with delight. Mercilessly pounding her greedy cunt into submission he then penetrates her hungry asshole and gives her the anal fucking that she is craving. He plows away and brings Roxanne to the edge of ecstasy right before stuffing her greedy mouth full of potato chips. But Ramon is not done yet. He ties her spread eagle to the bed and starts to fuck her tight little asshole with renewed vim and vigor. Grabbing her by head he fucks her harder than her slutty ass has ever been fucked before. She screams with pleasure and begs her dom to give her his cum. And in one last moment of sweaty bliss Ramon cums all over her pussy and then spoon feeds her his massive load. Roxanne Rae learns her lesson and gets fucked in the ass while bound in tight rope bondage!!",
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Roxanne Rae",
      "person_id": 50987
    }
  ],
  "release_date": "2017-08-01",
  "scene_id": 42416,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "brunette",
    "clothespins",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Gimp",
    "Hitachi",
    "humiliation",
    "leather",
    "master",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "slave",
    "Smooth",
    "straight",
    "submission",
    "vibrator"
  ],
  "title": "Shy College Slut, Roxanne Rae, Gets Ass Fucked in Tight Rope Bondage!!"
}