{
  "collections": [
    "Bound Gods"
  ],
  "description": "This is the first time Ian Greene has gotten to experience the brutality that is Bound Gods. His bronzed and muscle laden body can not hide the fact that he is in over his head and scared about what the hung stud and brutal task master Dominic Pacifico has in store for him. Right away it is clear that Ian is going to have to earn the hard way every bit of attention, validation, and pleasure that Dominic chooses to give him or deny him. Ian is on his hands and knees crawling across the floor while dragging a heavy bucket that is tied to his stretched and tender ball sack. Slowly he snakes his way to the worship at the boot heel of Dominic's thick leather. Ian licks the filth off of Dominic's boots and shines them to perfection. The humiliation makes both of the their cocks gorge with excitement. As Ian cowers at Dominic's feet, he is repeatedly spanked with a leather crop until his ass glows a bright red hue of painful perfection. He squeals and begs for more. He is hungry for stiff cock and will do ANYTHING to get it. But Dominic is not that easy to please. He saunters across the room and makes Ian drag his swollen and aching balls over the floor with the heavy bucket in tow. Pleased with Ian's devotion, he takes out his massive cock and jams it into Ian's hungry mouth. Gaging he thanks Dominic again and again for allowing him to deepthroat his divine phallus. After gorging on his stiff rod, Ian is tied to a pole with tight rope bondage while his head is encased in a leather deprivation hooded mask. Confused, vulnerable, and shivering with terror Ian is at the mercy of Dominic's muscular body. He mercilessly flogs Ian's body, hitting his cock with tip of a thick leather flogger. Ian winces and trembles with pain. It is almost unbearable but he is determined to not disappoint his masters expectations. His endurance is rewarded and Dominic licks, bites, and deep throats Ian's cock. The blow job lulls Ian into a false sense of security and the mask hides him from Dominic's true intent. With his guard down Dominic beats him senseless but Ian's cock only gets harder. When Dominic feels like he has had enough, he flips Ian onto his back and straps him down to a table with firm leather belts and gags him a rubber bit gag. He then mercilessly fucks Ian's gaping asshole and probes the inner reaches of Ian's deepest desires. Ian's cock swells and he begs to cum but the only thing he gets is orgasm denial. He pleads with his master to allow him to cum and when Dominic truly thinks that his slave has earned it, he allows Ian to blow his load. He strokes Ian's swollen cock as thick, wet, creamy cum oozes from Ian's ecstatic whore hole. Panting and gasping with delight, Dominic jams his cock down Ian's throat. Ian's hungry mouth hole pleads to be blessed with Dominic's generous load. And Dominic delivers and nourishes his pet slave with his never ending, thick, creamy cum. Worn out and broken, Ian thanks Dominic over and over, but the only thing that Dominic has to say is, \"God boy...\" Ian Greene gets beaten and ass fucked in brutal rope and leather bondage and cums with delight!!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Ian Greene",
      "person_id": 60318
    },
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    }
  ],
  "release_date": "2017-06-29",
  "scene_id": 42415,
  "tags": [
    "anal",
    "bdsm",
    "bit gag",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crop",
    "Deepthroat",
    "deprivation",
    "domination",
    "Feet",
    "gag",
    "Gaping",
    "gay",
    "Handler",
    "Hood",
    "humiliation",
    "leather",
    "Male Sub",
    "mask",
    "master",
    "muscle",
    "orgasm denial",
    "pain",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "slave",
    "Stud",
    "submission",
    "throat fuck"
  ],
  "title": "Bronze Submissive God Ian Greene gets Brutally Beaten and Fucked Senseless by Hung Stud"
}