{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Busty blonde bombshell Phoenix Marie is an SAS agent on a mission to take down Ramon Nomar the handsome drug cartel boss. Phoenix Marie is the Rogue Anal Agent. Packed with a federal warrant to search his luxurious home with rare artifacts, will she find what he is packing away? With her tight green dress, leather boots, and stockings, Roman Nomar has his own thoughts on how to get what he wants from this firm agent. Turns out Phoenix has her own plan, she wants a cut on this drug and money smuggling. Who will set the terms to this side hustle? Roman comes out with his leather flogger and sets his own corporal punishment terms. First Phoenix needs to learn a few lessons in respect. Tied up in tight rope bondage and a ball gag stuffed in her mouth, Ramon is ready to have a little fun. Pulling aside her dress and underwear, Ramon reveals Phoenix's hairy pussy and tight asshole. He immediately teachers her a lesson in anal respect. Ramming his huge cock down her agent ass, screaming to cum! He takes that cock right out of her ass and stuffs it down her throat to shut her up. Her dress gets ripped off to expose her perfect huge tits. Those tits of course need to also learn a little lesson in pain and submission. Phoenix's nipples get clamped before Ramon continues to fuck some sense into this rogue agent. A hitachi is pressed against her clit as she gets fucked to screaming shaking orgasm. Of course, that is just the beginning. This agent needs to do her inspection. Ramon leads Phoenix around the house in rope bondage and electric zapper. Will she find what she needs, or does she need more cock! To seal the deal Ramon covers her pussy in hot thick cum.",
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Phoenix Marie",
      "person_id": 17093
    }
  ],
  "release_date": "2017-08-11",
  "scene_id": 42417,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "Best of SAS",
    "blonde",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "Cut",
    "domination",
    "gag",
    "Hairy",
    "Hitachi",
    "humiliation",
    "leather",
    "pain",
    "role play",
    "rope bondage",
    "Rough Sex",
    "Stockings",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Rogue Anal Agent: Flipping Ice"
}