{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Alana Cruise is excited for her job interview at Cherry Torn's sex store. She has the perfect resume and dresses for success. As the interview progresses, Cherry's questions become increasingly personal and soon Alana is bent over Cherry's lap getting an old fashioned over the knee spanking! Although Alana is a little hesitant with the direction of this interview, she really needs this job and she's even a getting turned on by Cherry's woman-handling. Cherry knows a slut when she sees one, and she plays with Alana's pussy until it's wet and leaking. She fits 3 fingers into Alana's cunt and finger bangs Alana until she admits she's a slut and comes hard, making a sticky mess all over Cherry's fingers. Next Alana is tied down with her cunt exposed, and her mouth in the perfect position for pussy licking. Cherry crops Alana's pussy before letting Alana show her pussy how much she wants this job. Alana enthusiastically licks Cherry's pussy as her hips buck to meet the sting of Cherry's crop. After Cherry is done, she turns her attention back to Alana's slutty holes. Alana gets a thorough dick-on-a-stick fucking as Cherry humiliates her through multiple orgasms. Then Cherry plugs Alana's ass with a metal jeweled plug. She flogs Alana's ass, getting increasingly turned on by the delicious smacks of the flogger and Alana's moans. Once Alana's ass is perfectly rosy, Cherry straps on a cock and thrusts it deep in Alana's cunt. Alana loves getting fucked and takes a thorough pounding from her potentially future-boss. She works that dick, moving up and down, getting it deeper in her pussy with every repetition. Cherry then turns her attention to Alana's asshole. She pushes her dick in and gives it a good hard fucking. After begging to come like a good girl, Alana is granted sweet release and comes hard on Cherry's cock.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Alana Cruise",
      "person_id": 60194
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    }
  ],
  "release_date": "2017-09-28",
  "scene_id": 42412,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "white"
  ],
  "title": "Invasive Anal Interview: Painslut gets fucked by potential employer"
}