{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Small Hands is back to do some more backwards ass ranch hand wreckin' in this weeks Family Role-play Homewrecker 2: The Rancher's Daughter. Stepmother Dee Williams has been stockpiling money from her rich husband and plans to skip out under the radar. But Blonde cutie step-daughter Natasha Blu wants to botch that plan and take the money for herself so she reigns in the help of trusty ranch hand Small Hands. Ms Blu saunters over to him wearing high heels and a teeny tiny mini skirt that shows off her smooth round ass. She seduces him with a super hot blow job that would convince anybody to steal for her. With her perfect natural tits bulging out of her shirt she plays with her pussy and gags and gargles on his huge cock. Will these young lovers get away with their devious plan? Lo and behold step mother Dee Williams barges in on them with her huge tits busting out of her dress and Small Hands has a change of heart.\nHe can't resist...after all he's always been a \"tit man\". He dominates the situation and before running off with the money himself he has to get a piece of these two lovely ladies. A crazy step-mom/daughter fest of rope bondage, flogging, blow jobs, zappers, fucking and pussy eating ensues. Small Hands ties Dee to the bed in a squatting position with her pussy exposed and tits roped up. Natasha is tied up tight on a table with a ball gag stuffed in her mouth and her skirt pulled up for easy action. First he crams his cock all the way down Dee's willing throat and gives her a good throat fucking. With his dick nice and wet he fucks Natasha's pussy and plays with her clit until she cums hard. Small Hands unties Dee and sets her mouth loose on Natasha's pussy. Hands gets his dick sucked while Dee voraciously eats her step daughters cunt. Time for some serious ass fucking. He ties them both up in doggie style and fucks Dee's ass until she squirts and cums all over his cock. Ms Blu cleans her step mom's cum off Small Hands cock with her lusty tongue and then he fucks her tight ass. Both Dee and Natasha get a good hard pounding in all their slutty holes. Now they are both tied up on their backs connected with rope at the ankles. Small Hands has his way with Dee and then Natasha and back again, ass to pussy to ass to mouth and back again until they are loosing it. Small Hands knows how to fuck with that big dick and he gives it good to these hungry squirting sluts until he shoots his hot ranch hand load all over their sweet faces. Wrecked!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Small Hands",
      "person_id": 59499
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Natasha Blu",
      "person_id": 60354
    }
  ],
  "release_date": "2017-08-18",
  "scene_id": 42419,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gag",
    "High Heels",
    "Humiliation",
    "Pussy Eating",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "smooth",
    "Squirting",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "Homewrecker 2: The Rancher's Daughter"
}