{
  "collections": [
    "Electrosluts"
  ],
  "description": "Engrossed in a selfie session on the Electrosluts set, bombshell Bella Rossi is taken down by surprise by fellow dommes Veruca James and Mona wales. Veruca and Mona wrestle Bella to the ground and inundate her with zaps all over her curvy body. While bound by the hot dommes beautiful bodies, Bella submits to breath play and pussy licking before she's made to come with the samurai on a stick. Then Mona and Veruca continue their hazing with a firm flogging and a violet wand treatment while Bella is hanging from the ceiling in an inverted rope suspension with electrified sticky pads up and down her leg. While hanging upside down, Mona rides Bella's face for an upside down pussy licking. Veruca gets in on the action receiving an enthusiastic ass licking. The dommes bring Bella down for a final round of lesbian electro sex and Mona finger fucks her hard while Veruca shocks her butthole with her fingers electrified by the violet wand touch plate. The session ends with some extreme fear play where the dommes exploit Bella intense fear of the cattle prod. A good time is had by all and Bella leaves a satisfied cum drunk electro slut!",
  "models": [
    {
      "name": "Veruca James",
      "person_id": 43570
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2017-09-21",
  "scene_id": 42410,
  "tags": [
    "ass licking",
    "bdsm",
    "cattle prod",
    "Corporal Punishment",
    "curvy",
    "dominatrix",
    "electrical play",
    "electro clamp",
    "electro dildo",
    "electro plug",
    "Face Sitting",
    "fear play",
    "femdom",
    "flogging",
    "humiliation",
    "kinky",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "Pussy Eating",
    "slave",
    "straight",
    "strap on",
    "suspension",
    "takedown",
    "TENS Unit",
    "violet wand",
    "Zapper"
  ],
  "title": "Bella Rossi Submits to Veruca James and Mona Wales!"
}