{
  "collections": [
    "The Training Of O"
  ],
  "description": "Welcome the stunning Melissa Moore for her first submission to The Training of O. This natural busty brunette is extraordinarily obedient and has a cock hungry dripping pussy and mouth. This slave desires a painful pleasure and is ready for her lessons. Tied up in tight rope bondage, her perfect huge natural tits are begging for attention. This slut loves nipple torment and screams from the pain of nipple clamps and clothespins. Her long legs in black lacey stockings expose her beautiful feet in high heels. Those strong beautiful legs are able to endure a full session in a stressful squatting rope bondage position. To start her lessons she is gagged with a black ball gag to muffle her screams. Her hairy pussy is shocked with the electric zapper, before being flogged and caned. This slave can endure a serious corporal punishment with a smile and wide open eyes. Finally this cock hungry slut is given permission to do what she does best. Swallow dick. She takes a huge cock down her throat over and over again. Covered is sloppy spit, this slut never looks down and keeps going back for more. Those are truly dick suck lips. Next she gets on top to show how much she can ride a dick. Deep hard fucking brings her to screaming orgasms over and over again. Finally hands firm around her throat she discovers her biggest orgasms ever from choking. The next position fins Melissa tied up tight with her asshole up and spread wide open. She has a hard lesson learning the screaming difference between stingy pain and thuddy pain. Her pussy is worked hard to a bright pink and learns that all pink pussies need cock! Finally tied up with her legs spread wide open and ready for a deep hard pounding. This slut takes a face full of cum to finish her training off.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Melissa Moore",
      "person_id": 60023
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2017-08-15",
  "scene_id": 42422,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "BeaverDay",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Choking",
    "Clothespins",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Feet",
    "Female Slave",
    "Gag",
    "Gimp",
    "Hairy",
    "High Heels",
    "Humiliation",
    "Latin",
    "master",
    "natural boobs",
    "Nipple Clamps",
    "Nipple Torment",
    "Nylons Stockings",
    "Oral Sex",
    "Pain",
    "Pain Slut",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Submission",
    "Swallow",
    "toned",
    "top",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Training a Pain Slut: Busty Melissa Moore's First Submission"
}