{
  "collections": [
    "The Training Of O"
  ],
  "description": "Introducing Skylar Snow, a brand new strawberry-blonde busty babe here for the first time on The Training of O and here at Kink.com. Skylar Snow is not here to pretend for the camera, she's here to endure a very real kinky BDSM experience. She'd like to be a sex slave, find her limits and completely submit to James Mogul with the help of Small Hands and his big cock. We start with Skylar standing naked in high heels with her mouth gagged, hands bound above her head, and her legs tied together with rope around a vibrator smashed against her pussy. Small Hands applies nipple clamps to Skylar's big natural tits and we don't hear a peep from her so he hangs three weights to the clamp's chain and still nothing. James then begins flogging Skylar's beautiful big ass and sweaty back, delivering great thuds that aren't reciprocated with any screams, whimpers, or thank-yous. James tells Skylar she's too damn quiet and it's a weakness of hers that they'll soon work on. Skylar tells James that he'll have to make her scream. Inspired by Skylar's response, James kicks it up a notch and gives Small Hands a flogger and they both get to work on Skylar's back and thick round ass until she screams for mercy. In the next scene, Skylar is on her knees, tits bound with rope, her wrists tied just below leaving her hands free to hold, present, and jiggle those tits. Skylar holds her tits as they get flogged over and over with the stinging tips of the leather. James then puts a clothespin on each protruding nipple, ties a string to the clothespins and pulls her tits around, leading her to Small Hand's cock so that she can get her mouth used and her throat fucked. Next we find Skylar's arms securely bound behind her back in a labyrinth of rope bondage. After a few zaps of the zapper right on her clit, it's face down ass up with a big black boot in her back and a big fat dick in her pussy just pounding it like an anvil with an awesome POV angle to make it seem like the viewer is doing the fucking. They flip her over and James zaps her tits and clit while Small Hands stuffs her pussy one more time until its left squirting and gaped and then Small Hands blows a fat load all over her smiling face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Skylar Snow",
      "person_id": 60403
    },
    {
      "name": "Small Hands",
      "person_id": 59499
    }
  ],
  "release_date": "2017-08-29",
  "scene_id": 42423,
  "tags": [
    "BDSM",
    "Big Ass",
    "Big Natural Tits",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Boot",
    "Clothespins",
    "Corporal Punishment",
    "Discipline",
    "Electrical Play",
    "Female Slave",
    "Flogging",
    "Gimp",
    "High Heels",
    "Humiliation",
    "Kinky",
    "Leather",
    "master",
    "Nipple Clamps",
    "Nylons And Stockings",
    "Oral Sex",
    "POV",
    "Role Play",
    "Rope Bondage",
    "Slave",
    "Squirting",
    "Straight",
    "Vibrator",
    "Weights",
    "Zapper"
  ],
  "title": "Newbie Skylar Snow Endures and Indulges "
}