{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Big ass Brunette Abella Danger models for tormented artist Ramon Nomar in this week’s Sex and Submission update. Stranded with a broken down car in the hills of California, and no cell phone reception, Abella has no other choice to knock on the door of a nearby house to see if there’s a friendly face on the other side. Little does desperate Abella know, the apprehensive Ramon Nomar has an opportunity this hot young thing can’t refuse: to be the model for one of his new art projects. Adorned with a ball-gag, ass hook, and high heels, Abella is naked and hogtied in partial suspension with a vibrator on her sensitive clit while Ramon torments her with the zapper and photographs his willing, but overwhelmed, model. He gives Abella a good throat fuck with his hard dick, pulling the hook in and out of her tight ass, and fucks her pussy until she comes.\nMr. Nomar then restrains the tiny Abella with leather straps, cuffs, and chains to his staircase for some corporal punishment. Her nipples pulled taut by clamps, the screaming Abella twists and turns, trying to avoid the double flogging on her big, red curvy ass. Ramon ferociously fucks Abella in every slutty hole until her eyes are rolling back in her head. His hard cock pounds her wet pussy, then her ass, her mouth and back again to her round, tight ass. Abella just can’t get enough of Ramon’s “modeling project!”\nAfter Abella cums a million times, Ramon puts her upside down on her back: spread-eagle with hands tied to wrists; her ass and pussy are totally exposed and easy to access. He gives her a punishing - caning and paddling on her delicate inner thighs and pussy. When her tender skin turns pink, Ramon fingers Abella’s pussy until she squirts, filling the pain-slut’s holes with his big cock; pounding her pussy and ass no-holds-barred. Finally, the sadistic artist ties Abella’s ankles to wrists to the couch with rope, spreading her wide open for more brutal corporal: caning, cropping, and paddling are on the menu. Ramon then blindfolds Abella, using sensory deprivation so she doesn’t know what’s coming - another lashing on her pussy! After thoroughly flipping her out with his wicked discipline, Ramon takes Abella way over the top with a complete and merciless ass pounding.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Abella Danger",
      "person_id": 56157
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2017-09-01",
  "scene_id": 42421,
  "tags": [
    "Anal",
    "Ass Hook",
    "Ass To Mouth",
    "Ball Gag",
    "BDSM",
    "Best of Anal",
    "Best of SAS",
    "Big Ass",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Caning",
    "Chains",
    "Corporal Punishment",
    "Curvy",
    "Deprivation",
    "Discipline",
    "Domination",
    "Facefucking",
    "Flogging",
    "Gag",
    "High Heels",
    "Humiliation",
    "Latinx",
    "Leather",
    "Leather Cuffs",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Paddle",
    "Pain",
    "Pain Slut",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "Submission",
    "Suspension",
    "toned",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white",
    "Zapper"
  ],
  "title": "Anal Artist"
}