{
  "collections": [
    "TS Seduction"
  ],
  "description": "In a spooky room, thick with haze there sits a long table in the center of it, radiating light upward. On top of the table lies Chelsea Marie dressed like a badass sexy rockstar wearing sunglasses, black fingerless leather gloves, tight neon green and blue latex, and a leather harness. She's lying on her back rubbing her tits and cock through her latex when the door behind her slowly opens and in creeps Mike Panic through a cloud of smoke wearing only tight latex underwear. We are a witness to Mike Panic's dream. A dream in which he is a submissive in a fantasy playground with his dream goddess, Chelsea Marie waiting there for him to worship her entire body. She commands him to clean her latex with his tongue, and to start at her feet. Mike then proceeds to slowly lick all of her latex from toes to tits. She buries his face in her crotch then pulls out her big tits and tells him to suck them. Mike climbs up onto the table, slides on top of Chelsea and rubs his slippery latex underwear cock to cock, humping against her slippery latex pants. Chelsea makes Mike get on his knees and she feeds him her cock and fucks his face. Next we find Chelsea on her own knees, now wearing only the leather harness and heels, sucking Mike's cock while she strokes her own, getting it good and hard for fucking Mike's ass. Chelsea then saunters behind him, bends him over the table and fucks his slutty ass deep, hard, and raw giving him every inch of her big cock. Chelsea flips Mike over onto his back and shoves her cock back inside his asshole, furiously fucking while stroking Mike's cock. Mike asks permission to cum and with Chelsea's cock buried deep in his ass, Mike explodes cum all over his stomach and Chelsea scoops up a dollop and feeds it to him. Chelsea then from the sight of Mike's fat load shoots her cum right into his mouth while Mike begs for more.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Mike Panic",
      "person_id": 41034
    },
    {
      "name": "Chelsea Marie",
      "person_id": 40544
    }
  ],
  "release_date": "2017-07-25",
  "scene_id": 42448,
  "tags": [
    "anal",
    "big tits",
    "blowjob",
    "Cock Worship",
    "Feet",
    "gloves",
    "latex",
    "leather",
    "leather gloves",
    "Male Sub",
    "harness",
    "role play",
    "straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Chelsea Marie, A Latex Wet Dream"
}