{
  "collections": [
    "TS Seduction"
  ],
  "description": "The gorgeous Casey Kisses, dressed in a geometric latex bodysuit and sexy black thigh-high stockings and heels, is having some fun in her private dungeon with the adorably submissive Lance Heart. Lance, stuck in a suspended steel cage, wearing only a leather harness and a latex blindfold, swings slightly back and forth as Casey watches in amusement. At the bottom of the cage is a hole where Lance's asshole is presented for Mistress Casey to play with. When Casey finally removes Lance's blindfold, he is stunned by her sheer beauty and his cock immediately gets rock hard and wants out. He tries to touch her but Casey denies his advances with a smile. Casey eventually lowers the cage to the ground and lets Lance lick her cock through her latex. Casey finally releases Lance from the cage and he crawls out onto his hands and knees to her and enthusiastically starts sucking her smooth hard cock. Casey furiously face-fucks Lance balls deep until he's gagging on her cock. In the next scene we find Casey Kisses now topless with her beautiful big tits out standing behind Lance heart, who's bent over a padded bench, ready for his slutty hole to get fucked. Casey shoves her cock into Lance's ass and starts pounding it deep and hard. Casey flips Lance over and without missing a beat, shoves her cock in him and continues fucking his ass while stroking his cock. Lance stares up at Casey's beautiful face and body as he gets fucked hard and fast. Casey grabs Lance's dick as she's fucking his ass and when she starts stroking it, Lance's balls explode cum all over his chest and stomach. Seeing Lance cum gets Casey so turned on, she fucks his ass even harder and tells him to get on his back quick. Lance laps up all the cum as Casey jerks her cock and shoots her load in his mouth.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    }
  ],
  "release_date": "2017-07-18",
  "scene_id": 42447,
  "tags": [
    "Anal",
    "Big Tits",
    "Blindfold",
    "Blowjob",
    "bottom",
    "Cage",
    "Cock Worship",
    "dungeon",
    "Latex",
    "Leather",
    "Male Sub",
    "Nylons Stockings",
    "harness",
    "Role Play",
    "shaved",
    "smooth",
    "Straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Tall Stunning TS Mistress Casey Kisses"
}