{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Ebony Goddess Misty Stone is holding auditions for her personal Apollo, the perfect man to do her bidding and bend to her dominating will. After a string of duds, in walks Lance Hart, oblivious to what awaits him. Misty is unimpressed at first, but after telling him to strip and seeing what an obedient, quick learner he is, she decides to give him a chance. Misty truly uses Lance for everything she desires. She oils him up and teases him. She uses his body for her own arousal, not letting him touch himself while she touches him everywhere. She then blindfolds him and shoves her long thick strap-on down his throat, making him choke and gag on it, lubing it up with his spit before she slams it into his ass. She pounds Lance on his stomach and then on his back, loving every howl of pain and pleasure coming from his filthy mouth. Lance shoots his load all over himself, and Misty scoops it up and feeds it to him. She's enjoyed running Lance through the ringer, using his body for her pleasure, and milking his prostate deep and hard. But she's still not done with the poor man. Finally she fits him with a dildo gag, puts him on his back and uses his face to fuck. Lance can only lie there, staring up at Misty's beautiful body and perfect pussy writhing above him, using him to cum. When she's finished, she leaves him there, spent and used. Next!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Lance Hart",
      "person_id": 37346
    },
    {
      "name": "Misty Stone",
      "person_id": 60353
    }
  ],
  "release_date": "2017-07-21",
  "scene_id": 42445,
  "tags": [
    "bdsm",
    "bondage",
    "CBT",
    "Corporal Punishment",
    "dildo",
    "dominatrix",
    "Ebony",
    "Facesitting",
    "femdom",
    "Fingering",
    "gag",
    "humiliation",
    "Male Sub",
    "orgasm denial",
    "pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "straight"
  ],
  "title": "Ebony Goddess Misty Stone Doms and Fucks Lance Hart"
}