{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Princess Lily Lane with her beautiful big tits, fishnet thigh-high stockings and latex mini-skirt, sits in her throne upon the lap of Ruckus as they both point and laugh at their pathetic house slave, Jay Wimp who is on his knees in a cage in the corner of the room, wearing only an acrylic cock-cage and a latex jock strap. Jay Wimp has been their slave for years and occasionally Lily and Ruckus will let him out to be teased and tormented. On this occasion Lily opens Jay's cage, clips a leash on his cock-cage, has him shove a butt-plug up his own ass and tells him to lick Ruckus' boots clean while he gets flogged. Lily then has Jay get on his back and canes his legs until both legs get covered in red stripes while Ruckus keeps tension on the cock-leash. Next Jay is ordered to get on all fours and Lily pegs his slutty ass while Ruckus shoves his cock down his throat. Lily pounds Jay's ass deep and hard as he moans into Ruckus' balls in ecstasy. Jay then is allowed to watch Lily and Ruckus fuck just inches from his face while his pathetic encapsulated cock tries to grow inside of its tiny cage. Lily lets Jay have a taste of her pussy by letting him lick it off of Ruckus' cock. Finally after being completely humiliated, Jay is told to get on his back and Lily jerks Ruckus's cock over Jays face until cum explodes into his mouth and all over his face. It's back in the cage after that and as Ruckus' cum dries on Jay Wimp's face, and his balls begin to ache from denial, there he'll stay waiting until the next time his generous Princess will let him out to play again.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Jay West",
      "person_id": 53166
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    },
    {
      "name": "Lily Lane",
      "person_id": 50199
    }
  ],
  "release_date": "2017-08-04",
  "scene_id": 42446,
  "tags": [
    "BDSM",
    "Big Tits",
    "Bondage",
    "Cage",
    "CBT",
    "Corporal Punishment",
    "Cuckolding",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "jock",
    "Latex",
    "Male Sub",
    "Nylons And Stockings",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight"
  ],
  "title": "The Princess and Her Pathetic Pet "
}