{
  "collections": [
    "TS Seduction"
  ],
  "description": "We start in a dilapidated room somewhere hidden in a dark and evil church. In tight black latex pants, leather motorcycle boots, and a white priest's collar, Father Pierce Paris kneels at a pew deep in prayer when suddenly Sister Aubrey Kate interrupts entering the scene looking dangerously sexy wearing a tight short black latex outfit looking like an evil slutty nun. Sister Kate grabs Father Paris by the harness and yanks him close and tells him she knows all the naughty things he's been doing in his spare time. When Father Paris denies the allegations Sister Kate chokes him with a flogger and tells him to suck her cock for lying to her. Sister Kate sits on the pew in front of him and pulls her white panties to the side. Father Paris sucks her cock deep and fast with enthusiasm in hopes to be forgiven. She turns around and buries Father Paris' face deep in her ass. Sister Kate then wants Father Paris' cock in her mouth so she deep throats his huge cock all the way down her throat, sucking him off while jerking her own cock. More punishment ensues for Father Pierce Paris as Sister Aubrey Kate brings a lit candle over and pours hot wax all over Father Paris' muscular chest and cock and then pours wax on her own milky white round ass. With Sister Kate's dick rock hard, she gets naked and bends Father Paris over. She fucks his ass deep and hard sending pounding echoes of skin-slapping-skin throughout the church as a warning to those that dare lie to the Reverend Mother. Sister Kate then gets comfortable and lays on a chaise lounge and makes Father Paris get on top of her to ride her dick. Wearing only a leather harness, Father Paris bounces on her cock enjoying every inch. Sister Kate then flips him over, grabs on to the leather harness on his chest and furiously fucks the cum right out of him.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Aubrey Kate",
      "person_id": 51491
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2017-09-19",
  "scene_id": 42450,
  "tags": [
    "Anal",
    "big dick",
    "Blonde",
    "Blowjob",
    "brunet",
    "Cock Worship",
    "Collar",
    "fake boobs",
    "Hot Wax",
    "Latex",
    "Leather",
    "Male Sub",
    "muscular",
    "harness",
    "Role Play",
    "shaved",
    "Slapping",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Sister Aubrey Kate Punishes Priest Pierce Paris"
}