{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "All natural, redhead Lauren Phillips has a business that helps troubled college students get back on track. Thinking she is going to the home of rich father to help his struggling son, Lauren gets lured into the secret underground lair of a devious band of clowns looking to gang bang an unsuspecting woman. She is nervous when she arrives at the address given to her, but she is desperate for money and decides to risk going into an old derelict building near the train tracks on the wrong side of town. She is quickly overrun by a gang of cackling madmen, frothing with raw sexual desire and hungry for her sweet pussy and tight asshole. Once Lauren realizes what their intentions are, she decides that this is actually a dream come true and begins to devour all five of their massive cocks. She gorges herself and squeals with bliss as she gets face fucked and gags on their stiff rods. Her pussy drips with desire and she begs the sadistic clowns to dominate her. They toss her around like a rag doll and begin to take turns mercilessly fucking her pretty pink pussy. She gags on their cocks and as she is choked pleads for more. Soon she is airtight with a huge dick in her pussy, mouth, and tight asshole. She only wants more and tries to cram two cocks in her mouth at once. Her greed and lust to be used as a useless fuck toy only makes the clowns fuck her harder and harder. In their wild passion the clowns begin to double penetrate her pussy. Painfully her pussy stretches open and she screams with delight. The fever intensifies and she begs for double penetration in her asshole. After some squirming and fighting back the men pin her down and take turns cramming two dicks in her asshole. She immediately climaxes and begins the first of an never ending wave of orgasms that flow from one to the next. When the nasty clowns finally grow tired of using her fuck holes they decide to turn her into a cum dumpster. They each take turns blowing massive loads of jizz on face while their ring leader fists her stubbornly tight pussy. As they walk away she smiles and asks for more. Lauren Phillips gets double vaginal, double anal, and fisted while being dominated by a gang bang of sadistic men and loves it!!",
  "directors": [],
  "models": [
    {
      "name": "Alex Legend",
      "person_id": 55861
    },
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2017-09-06",
  "scene_id": 42451,
  "tags": [
    "Airtight",
    "Airtight Playlist",
    "Anal",
    "BDSM",
    "big dick",
    "Big Tits",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Double Anal",
    "Double Penetration",
    "Double Vaginal",
    "fake boobs",
    "foreskin",
    "Gangbang",
    "Latinx",
    "muscular",
    "Redhead",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "All Natural Redhead Lauren Phillips Dominated: Double Anal Gang Bang!"
}