{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "We begin with the amazing and beautiful Ella Nova sitting outside barefoot on her porch, fingering her pussy inside tight blue short-shorts, bored and horny in her new home in the desert, on the wrong side of the train tracks, far away from what she's used to. Ella's Dad has recently remarried and her and her new stepbrother Tarzan already have a bit of rivalry and tension between them. Ella doesn't mind who's looking as she rubs her pussy and plays with her tits outside where she sits. Tarzan catches Ella masturbating and tells her to stop because the neighbors have been complaining. Ella gets defensive not used to such strict rules and blames it on boredom although the truth is she really wants desperately to get fucked. Tarzan explains he has friends on their way over to workout and to remain out of sight and to keep her pussy in her pants while they're there. When Tarzan's friends, Jon Jon, John Strong, and Donny Sins arrive, Ella desperately tries to hang out but her stepbrother Tarzan thumbs his nose and closes the door leaving her outside. While the guys all work out, Ella sneaks in and overhears them talking about how they all want to fuck her, and asking Tarzan if its cool. She surprises them with bottled water to break the ice and to show gratitude they all whip out their huge cocks and Ella drops to her knees and starts sucking. Tarzan feeling left out takes his dick out and joins in. John Strong begins pounding her pussy as they all take turns fucking her mouth. Donny Sins taps in and stretches Ella's pussy even wider with his big fat cock and fucks her senseless as she sucks her stepbrother's cock. Once they've all thoroughly fucked Ella's slutty pussy, they all take turns fucking her even sluttier ass. With her ass and pussy destroyed from huge cocks, the insatiable Ella Nova still wants more so they give her her one in each hole and all take turns double-penetrating Ella's pussy and ass while she jerks and sucks the rest of them ultimately ending up with a face-full of their cum and an urge for more cock.",
  "directors": [],
  "models": [
    {
      "name": "Jon Jon",
      "person_id": 35195
    },
    {
      "name": "Tarzan",
      "person_id": 59796
    },
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Ella Nova ",
      "person_id": 51866
    }
  ],
  "release_date": "2017-08-09",
  "scene_id": 42452,
  "tags": [
    "anal",
    "bdsm",
    "Blow Bang",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "Double Penetration",
    "Fingering",
    "gangbang",
    "role play",
    "Rough Sex",
    "straight",
    "Voyeurism Fantasies"
  ],
  "title": "Ella Nova Fucked by Stepbrother and His Friends"
}