{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "In her first gangbang ever, beautiful and desperately horny Nari Park is the only woman watching an adult movie in a darkened theater, surrounded by insanely horny men. As she plays with her perfect, slutty pussy, she gets more and more aroused, knowing the guys are all looking at her. The tension builds until finally one of them makes his move, changes seats and begins touching her. Soon all 5 guys are on her, taking sweet advantage of this goddess in the theater, tearing her out of her clothes, sliding their fingers into her wet pussy, pawing her perfect tits, and making her cum in only the first few minutes. Nari quickly has all their dick in her mouth, one after the other, deep throating even Donny Sin’s long thick cock. He can feel it pushing into her throat, and she takes every huge inch. Nari literally doesn’t know which end is up, or which guy is fucking her, as she’s tossed from one man to the next, and each of them starts pounding his hard cock inside her dripping holes. She cums repeatedly, squealing and moaning with every powerful orgasm. Finally, Nari is double penetrated, and fucked hard and deep in both holes. She can barely believe what’s happening as she’s also fed enormous cock while getting double fucked from behind. It’s an explosive gangbang for everyone as the guys shoot hot ropes of cum all over her face, drenching her. Nari slumps to the floor, exhausted, spent and covered in 5 loads. In her sexy, sweaty mess, she makes her pussy cum one last time.",
  "directors": [],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Jon Jon",
      "person_id": 35195
    },
    {
      "name": "Nari Park",
      "person_id": 60071
    },
    {
      "name": "Tarzan",
      "person_id": 59796
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2017-07-26",
  "scene_id": 42455,
  "tags": [
    "Anal",
    "Asian",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Double Penetration",
    "First Gangbang",
    "Gangbang",
    "Latinx",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Straight",
    "top",
    "unshaved",
    "white"
  ],
  "title": "FILM FUCK: Nari Park Cums Repeatedly As She's Slammed In Every Hole"
}