{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Daisy Ducati is a hot bar owner looking for new employees who can handle a kinky atmosphere. She has put a job listing on the internet and Chanel Santini comes to the bar to answer the post. Daisy wants to make it perfectly clear to Chanel that the bar is for kinky perverts and that Chanel needs to know her shit when it comes to BDSM and Kink. Chanel gives Daisy a demonstration of her rope work. Chanel gets Daisy tied up in bondage and then has some suggestions of her own. Chanel is certain that what that kinky bar really needs is a hot girl with a huge throbbing cock. Daisy is all tied up and it appears she doesn't have any choice other than to agree with Chanel. Daisy has to test drive her new potential employee so Daisy gets the first taste of Chanel's hard cock in her mouth. Chanel and Daisy explore each other sexually going back and forth between sensual romantic fucking, pussy eating cock sucking, toe and foot sucking, mutual masterbation and good ole fashioned rough sex pounding. Daisy needs to see if Chanel can be both a top and a bottom. So Daisy ties Chanel up in bondage for the very first time and rides Chanel and teases her with orgasm denial. After each girls gets their turn of of topping and bottoming they rope comes off and the girls are allowed to fuck each other with hard pounding in doggy style. Chanel releases a big hot load of Cum all over Daisy's ass and then Chanel licks it up. The two decide that Chanel is just perfect for the bartending position",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Chanel Santini",
      "person_id": 59709
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    }
  ],
  "release_date": "2017-09-25",
  "scene_id": 42462,
  "tags": [
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "Cock Worship",
    "Kinky",
    "Latin",
    "mixed",
    "natural boobs",
    "Orgasm Denial",
    "Pussy Eating",
    "Redhead",
    "Role Play",
    "romance",
    "Rough Sex",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Chanel Santini does a job interview with Bondage and Blow Jobs"
}