{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Mona Wales has information that she’s not going to give up, NO MATTER WHAT…unless of course there’s a big cock in the room and then she’s weak and gives up information easily. Chanel Santini is a super Spy who has been genetically modified to be the Perfect females specimen. She’s a stunning brunette with long legs, a tiny waste and giant tits. She also just happens to have a huge throbbing cock. Once Mona Wales sees the cock on the beautiful woman, things get really hard for Mona. She doesn’t want to give up information but she doesn’t have a choice; Chanel Santini is just too beautiful. Mona Wales is tied up in rope bondage and made to take Chanel’s She-cock. Mona worships every inch of the beautiful transgender woman in front of her. She sucks her cock, licks her balls, licks and sniffs her feet, kisses her breasts and gives Chanel Deep french kissing with passion. These girls seem to be making love but that can’t possibly be since they are enemies. Mona Wales gets on top of her beautiful interrogator and rides her cock so hard that they both cum and Mona feels the only right thing to do is to give her lover the information that she wants.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Chanel Santini",
      "person_id": 59709
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2017-11-20",
  "scene_id": 42461,
  "tags": [
    "big dick",
    "black hair",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cock Worship",
    "Dominatrix",
    "Feet",
    "Latinx",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "top",
    "TS",
    "ts cock",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "TS Cock Extracts Information Out Of Spies"
}