{
  "collections": [
    "Everything Butt"
  ],
  "description": "Ariel X is a professional Interrogation officer. She has been brought in to get a confession out of Leya Falcon. There is so much circumstantial evidence showing that Leya Falcon has committed a serious crime and Ariel is going to get to the rosy red bottom of this. Leya is a disturbed individual and Ariel plays this to her advantage. Ariel Knows that if she can get Leya comfortable enough, she will let a confession out. Ariel knows that Leya has a weakness for Anal Sex so Ariel licks and sniffs Leyas asshole in order to get her turned on enough for bigger things. Ariel fingers and stretches Leya’s asshole out. Leya’s asshole gets stuffed with fingers and tongues and even an Entire fist. Ariel reaches deep into Leya’s asshole, so far up she hits Leya’s G spot and Leya cums over and over again. Ariel has discovered that Leya seems to like things deep into her ass so she slides a 2-foot long slink all the way into Leya’s asshole. Too bad for Ariel that Leya isn’t even close enough to confession. She’s going to milk this for everything she’s got and she’s going to make Ariel do some real soul searching. Ariel Seems to be turning into a pervert. The Criminal mind of Leya Falcon has outsmarted the interrogator and soon Ariel finds herself doing perverted things just to please Leya. Ariel gets a giant strap-on cock and fucks Leya until she’s in an orgasm stupor. Ariel X puts her round juicy ass right on top of Leya’s nose and makes Leya lick and sniff her asshole. Nothing seems to get getting through to Leya. She’s too insane to tame. So Ariel needs to get Leya’s asshole to stay open in a gape to try to get some answers out of Leya. Ariel Gets a speculum wide open in Leyas asshole and we start to see from the inside out, who Leya Falcon really is",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Leya Falcon",
      "person_id": 46075
    }
  ],
  "release_date": "2017-11-03",
  "scene_id": 42460,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Big Tits",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "fake boobs",
    "Gaping",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Prolapse",
    "shaved",
    "slim",
    "slink",
    "Speculum",
    "Straight",
    "Strap On",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "Anal Criminal Minds"
}