{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "We take a break from introducing rookies who don't stand a chance against our veterans and get finger fucked relentlessly until they orgasm on the mat to bring in a highly competitive nail biting, back and forth match up with two of our favorite red-heads, Cheyenne \"the Wrangler\" Jewel and \"Bella \" The Annihilator\" Rossi. Bella is convinced her flexibility will be able to neutralize Cheyenne's Vegan Power. Bella Rossi Plans and sweeping her legs around Cheyenne and getting ( at the bare minimum) double control so that they can both finger each other. Bella is confident she is the better sex fighter and that she will be able to make cheyenne Cum on the mats against her will. Cheyenne is convinced her Power will allow to her mount Bella, kiss Bella so hard against her will she loses her breath and then Cheyenne will be able to sneak her fingers into poor limp Bella's tight pussy after she is worn out. Both girls put on a remarkable display of their strategy. Bella is able to do her sneaky moves and get double control. These girls finger fuck each other desperately trying not to cum. They put their Heart and souls into the match and it shows. They are both exhausted by the end of the match but one girls is victorious. The winner ties up the loser's tits and then has her way with the loser. The bands are stripped off, the strap on is rammed down the losers face. The loser is put into a matchbook press and while she is pinned down she is fucked and hand gagged. The winner is Slammed into a wall while the strap on thrusts in and out of her poor beaten pussy. The loser is thrown back on to the ground and fucked in doggy style while being fish hooked, hand gagged and having her hair pulled. The winner fucks the loser hard and then takes her prize by sitting on the losers face and getting an orgasm of her own. All the Wrestling was just foreplay and the winner cums easy on the losers face, then stands up and does a victory pose of the poor humiliated loser",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    }
  ],
  "release_date": "2017-08-30",
  "scene_id": 42466,
  "tags": [
    "Anal",
    "Big Ass",
    "Big Tits",
    "Brunette",
    "Curvy",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "Redhead",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Busty Redhead Take on Big Ass Red Head in 100% Real Competitive Match"
}