{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Savanna Fox is one of our past Rookie cup tournament winners. She is taking on this season's most promising rookie, Charlotte (The toilet) Sartre. Charlotte did a great job in her first match against Izamar Gutierrez but ultimately, she lost her first match like a typical rookie. Today she is taking on The Big Booty Fox. Savannah is known for her unconventional movies which always seem to catch her opponent off guard and put them into dire predicaments. Charlotte has studied these moves and she feels she is ready for anything Savannah throws her way. Unfortunately for Charlotte, Savannah is relentless when it comes to over powering woman on the mats. These girls give it their all. One wrestler is so determined to win, she keeps pushing herself through the entire match, trying to finger and lick her opponent even when it seems she can barely move. This match shows the true heart of our wrestlers as they put every thing out there on the mats for the fans. This is, as always, A Winner fucks loser match. When the winner is announced, she brutally face fucks her opponent then relentlessly fingers her to make her orgasm. The Winner puts on a strapon and fucks the loser into submission. Then the winner pull off her dick and puts her pussy right onto of the losers face, using her eyes nose and mouth as her personal sex toy. The winner squirts all over the loser and then makes the loser lick up all the mess. Both Wrestlers end up walking off the mats pleased from orgasm but only one walks out being able to respect her wrestling abilities in today's match. This lose will go on the loser's permanent record and she will always be a loser",
  "models": [
    {
      "name": "Savannah Fox",
      "person_id": 47440
    },
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    }
  ],
  "release_date": "2017-10-04",
  "scene_id": 42467,
  "tags": [
    "domination",
    "Face Sitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tournament",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "The Toilet Sees a Lot of Pussy and Ass!"
}