{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Dee Williams is Back and meaner than ever. She is one of our favorite veteran wrestlers who has developed quite a skill set while she's been fighting for us. She's a petite blond with huge tits and a rockin ass. Lily Lane is brand new to the Ultimate Surrender mats. She has NO wrestling experience but she's a real life bad ass so she's thinking \"how hard can wrestling be?\" Lily is a tattooed goddess with a stunning body and huge tits, Black hair and long eye lashes. She is pretty certain she is going to whoop on little Dee William's ass. Today, Lily is in for a world of hurt in so many ways. Dee is relentless as she fingers her opponent. Dee makes Lily take her lesbian kisses and fingers. Dee smothers Lily with her huge balloon tits, Squeezes Lily with leg scissor on the body and the head and even attempts her signature hold, the camel clutch. While Dee has Lily in the Camel clutch, she rams her fingers deep and hard in to poor little Lily's pussy. Lily is choked and fucked with fingers and tongue in a 100% competitive wrestling match. Round 4 hasn't even started yet and Lily is gasping from pain and orgasms. In round 4 Lily is match book pressed and pinned down while she is made to take Dee's rock hard strap on cock, hand gags, throat fucking and face sitting. Lily is Slammed into the wall with her head squished into the boards while Dee shoves her cock in and out of Lily's pussy. The Lily is thrown into the mats and face sat until Dee rides her face to orgasm. Lily is left on the ground utterly broken and humiliated and determined to come back on the mats and take out her frustrations on her opponent. This match has an Orgasm on the mats that is truly earned!",
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2017-09-06",
  "scene_id": 42468,
  "tags": [
    "big tits",
    "domination",
    "Face Sitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "Petite",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "the wall",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Big Tits Clash! Brutal Submissions in 100% Real Competitive Wrestling"
}