{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Angel Allwood is a beautiful voluptuous Blond with big tits and quite the body on her which is probably why her wrestling name is “The Body”. Today she is taking on one of our tiny, young, barely legal rookies, Alexa Nova. Alexa couldn’t wrestle herself out of a paper bag but part of the fun of seeing her on our mats is watching her squirm and fight off orgasms from a more experiences wrestler. This match is non stop fingering for Alexa. Angel let’s her bitch side come out and it’s beautiful. Angel is so mean to Alexa. Alexa seems to like the torment as she starts fucking Angel’s fingers back while Angel has her pinned on the mats, tit to tit, pussy to pussy. After 3 full rounds at 8 minutes each round, Alexa has been thoroughly finger fucked, she’s ready to submit to her victor. Alexa is tied up in tight bondage while Angel fucks her face with brutal face fucking blow jobs. Angel brings Alexa back down to the mats to fuck her pussy hard with a giant lesbian strap on. Then Angel opens Alexa’s loser asshole with the strap on cock. Angel fucks Alexa’s asshole until it’s gapping open. Angel uses her loser for what ever she wants. This is “winner take all” so Angel takes All of Alexa’s holes: Mouth, pussy and asshole. Angel then uses Alexa’s body to make herself cum. Angel does hot erotic lesbian tribe fucking, bumping her pussy into Alexa’s pussy making both girls have huge orgasms. After Angel has used and abused the loser, she leaves the poor humiliated bitch on the mats for the janitors to come in and find her there and use her the way they want. Alexa does give this match 100% but it’s simply not enough. Angel points out that all Alexa is good for is getting used and fucked….you’re welcome Janitors!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Alexa Nova",
      "person_id": 57359
    },
    {
      "name": "Angel Allwood",
      "person_id": 52348
    }
  ],
  "release_date": "2017-09-13",
  "scene_id": 42463,
  "tags": [
    "Anal",
    "Big Tits",
    "blond",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Curvy",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Petite",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Petite Rookie Red Head is Destroyed on the Mats by Beautiful Blonde"
}