{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Penny Pax is an officer of the court in her real life. This busty natural redhead makes routine housing inspections to check for illegal activity. But this gorgeous slut has her own dirty desires. Welcome to Kidnap Inc. When Penny shows up for another routine inspections she finds Ramon Nomar there. While the two ride up a dark elevator Ramon violently grabs Penny and pulls up her tight black dress to reveal she is wearing no underwear to cover her trimmed pussy. He shoves Penny inside the abandoned building and ties her up in tight rope bondage and gags her mouth so no one can hear her screams. He has a few lessons to teach Miss Pax starting with electricity. The red zapper comes out as Penny screams when her pussy and huge tits get zapped. The hitachi comes out next to vibrate and pulse on Penny's perfect pussy. The rope bondage has Penny suspended with her dirty bare feet exposed. Ramon uses this opportunity to deliver a hard fuck and pound Penny into orgasm before removing the gag and shoving his huge cock down her gagging throat. Those nipples on her huge tits need attention as well. Tight black nipple clamps come out to show her what real pain is. Moving onto the main room, Penny is tied up again in bondage with her bare ass in the air ready for corporal punishment. Her ass is flogged bright red while an anal hook is holding Penny tightly in place. Once Penny's tight ass is properly stretched out and ready, Ramon shoves his fat cock right in there for some deep anal. Penny screams for ATM and gets Ramon's cock shoved back down her throat while her pussy gets pleasured again by the hitachi. Finally Penny is tied up with her legs spread wide. Her pussy has had enough pleasure, it's time to seal those lips up tight. Ramon gets a bucket of dirty clothes pins and clamps her pussy shut. Penny screams at the pain and Ramon chokes her to shut her up. Once that pussy is sealed up, Ramon shoves his cock back up her ass for more hard anal. Ripping the clothes pins off, Ramon then grabs the cane and smacks her fat pussy red before shooting his huge load all over her.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2017-09-08",
  "scene_id": 42476,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Feet",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Kidnapping Play",
    "Nipple Clamps",
    "Pain",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Kidnap Inc."
}