{
  "collections": [
    "The Training Of O"
  ],
  "description": "Not every wanton whore can become an \"O\". Every so often an ass comes along that lacks the true discipline required to become an \"O\" but is so eager to gyrate and please that it melts the icy hearts of our handlers. Case and point: Richelle Ryan. What she lacked in BDSM knowledge she made up for with a ceaseless, dogged determination to jiggle and twerk her perfect milf ass all day long. Her squeaky innocent voice didn't fool James and Tommy for one second. They both knew right away that this whore was a cock-gobbling, sex kitten that only wants more and more satisfaction. James puts her to work and gives her two tasks to learn throughout the course of the day. The first is to say please and thank you. The second -and my god did she ever take this commandment to heart- was to jiggle her ass and tits at all times. First she was tied in place standing upright and was shocked repeatedly with and electric zapper to get her engines moving. She learned to the balance of power and was able to quickly understand that what is good for her Dom's is what is good for her. A crotch rope split her ass and pussy in two creating a harness for Tommy to grab so he could help her ass bounce. Once she was warmed up they threw her to the ground and shoved Tommy's massive cock down her throat. She gagged and drool oozed all over her tits and face. As soon as she could catch her breath, the cock would cram down her throat, making her whimpers of gratitude barely audible. But that only made her hungry for more. Her heavenly booty was then put on display so Tommy could fuck her tight pink pussy from behind. Crouched in a doggie position her firm and perfect ass gyrated as Tommy pounded her behind. Pleased with her gratitude and her commitment to shaking her ass, she was then allowed to lie on her back and take Tommy's dick as deep and hard as possible. She came over and over and just when her multiple orgasms couldn't possibly continue, Tommy blows a giant wad of cum all over precious tits. Breathless and sweating, she keeps bouncing and thanking her masters for their generosity. Richelle Ryan shakes her ass and tits all day long while restrained in rope bondage and fucked by a massive cock!!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Richelle Ryan",
      "person_id": 12887
    }
  ],
  "release_date": "2017-09-26",
  "scene_id": 42474,
  "tags": [
    "anal",
    "athletic",
    "bdsm",
    "big ass",
    "bondage",
    "Corporal Punishment",
    "crotch rope",
    "discipline",
    "drool",
    "female slave",
    "Gimp",
    "humiliation",
    "master",
    "MILF",
    "multiple orgasms",
    "oral sex",
    "harness",
    "role play",
    "rope bondage",
    "straight",
    "Zapper"
  ],
  "title": "Big Ass-ed MILF Richelle Ryan Trained and Fucked in Rope Bondage!!"
}