{
  "collections": [
    "The Training Of O"
  ],
  "description": "The beautiful buxom brunette Karlee Grey submits entirely to the dark and handsome Ramon Nomar. These two give it their all in this hot and sweaty episode of The Training of O. The scene begins with Karlee standing, legs apart with her arms raised above her head, a spreader bar between both ankles and her hands bound by leather cuffs attached to the ceiling. Ramon swings a single-tailed whip around and around repeatedly smacking Karlee's ass through her polka-dot mini skirt. He rips her shirt open, exposing her big natural tits squeezing and slapping them from behind. He asks what she wants and she replies saying she'd like all the pain he'd like to give her, and so there it begins. Ramon repeatedly smacks Karlee's pussy with a crop, applies nipple clamps to her tits and zaps her with electricity. He ties one leg up in the air, blindfolds her with his shirt and fucks her senseless until she's begging to cum. In the next scene we find Karlee completely naked on her knees, bound with rope to a wooden St. Andrew's cross with a vibrator held in place and affixed to her pussy. Karlee gets her mouth used like a whore as she sucks and gags on Ramon's fat cock over and over until her tits are dripping with spit. Later Karlee finds herself placed on a box in another rope bondage predicament face down and ass in the air, wrists bound to her ankles. Ramon gets the clover clamps and attaches one to each labia and slides his meaty dick into her slutty pussy and pounds it hard deep and fast. Karlee begs and begs to cum but Ramon is too amused by her cries and will not allow her to have an orgasm until he hears her screaming at her most desperate. In the final scene Karlee is on her back, blindfolded with her tits tied up. One foot tied in the air and the other pulled to the side by another rope. Ramon continues to torment her with zappers vibrators and extreme orgasm denial as he wrecks her pussy once again ending in an orgasmic crescendo .",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Karlee Grey",
      "person_id": 59568
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2017-09-12",
  "scene_id": 42473,
  "tags": [
    "Anal",
    "BDSM",
    "Big Natural Tits",
    "Big Tits",
    "Bondage",
    "brunet",
    "Brunette",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "Electrical Play",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "Leather",
    "Leather Cuffs",
    "master",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Oral Sex",
    "Orgasm Denial",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Slapping",
    "Straight",
    "Stud",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Karlee Grey, Begging in Bondage"
}