{
  "collections": [
    "The Training Of O"
  ],
  "description": "Chloe Cherry sits, gagged and bound to a wooden chair in a red pleated skirt that's been pulled up to show that her hairy pussy has had an hitachi vibrator secured directly beneath it. Chloe's wrists are bound behind her back with rope and her milky thighs tied to the chair with leather belts. Black rubber pads are stuck to her upper-thighs pulsing electricity into each muscle. James Mogul has some questions and stands wearing knee-high black leather boots at the helm of this interrogation holding two potentiometers. One knob controlling the electricity and the other knob controlling the strength of the vibe, depending on her answers. Next we find our adorable blonde damsel squatting with her thighs bound to her ankles wearing only white thigh-high stockings, balancing on her tippy toes, her tits bound with rope, tied to the ceiling. Tommy pistol gets his cock ready in the background as James Mogul makes Chloe zap herself with electricity while he flogs her. Soon after, Tommy Pistol walks up and stuffs his cock deep down her throat covering her face and tits with her spit. Unhappy with her open-mouth blow job, Tommy strictly reminds her to keep her lips tight as James Mogul applies the nipple clamps once again. In the next scene we find Chloe on her back with her legs spread eagle bound with rope. Mogul attaches two clothespins to her pussy and rips out an orgasm with an old fashioned vibrator pressing it on her exposed clit. Tommy comes in and fucks her pussy and ass deep and hard going back and forth. In the final scene Chloe is placed on her knees with her thighs tied to her calves and her ass is fucked fast and hard until she begs for his cum.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2017-10-10",
  "scene_id": 42479,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Discipline",
    "Electrical Play",
    "Female Slave",
    "Gimp",
    "Hairy",
    "Hand Gagging",
    "Hitachi",
    "Humiliation",
    "Leather",
    "master",
    "Muscle",
    "Nipple Clamps",
    "Nylons Stockings",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Straight",
    "the chair",
    "Vibrator",
    "white"
  ],
  "title": "Chloe Cherry Gagged and Bound"
}