{
  "collections": [
    "The Training Of O"
  ],
  "description": "It's Cadence Lux's first training and she's ready to prove herself. She has a beautiful body, perfect breasts, legs for days, and expressive eyes. First, she is tied upright and spread eagle for inspection. She is gagged with a strap of leather and flogged all over. Once her gag is removed, the games begin. One of her legs is marked \"Good\" and the other, \"Bad.\" Each time she is good, she receives a caning on the corresponding leg and vice versa. Cadence loves brutal, degrading treatment, and she cums hard, squirting, and since she asks for permission like a good girl, she receives a bright stripe on her \"Good\" leg. Next, she is bound in a chest harness with industrial clamps on her nipples. This good little cock whore delivers a messy spit-filled blow job. She strains against the ropes holding her back to choke on cock like a good little slut. Cadence is an enthusiastic cock sucker and ends up covered in spit and drool. For doing such a good job, she gets rewarded with orgasms and another stripe. Now the real fun begins. Bound on her elbows and knees, Cadence begs for cock as she gets flogged, spanked, and zapped. She loves getting her pussy filled and once she has a dick in her, she pleads for permission to cum until she is granted release. She cums hard multiple times on dick and is still hungry for more. Finally, the real and final test begins. Cadence is bound with her cunt exposed. Her nipples are clamped and attached to her toes. If she puts her leg down, her nipples will bear the pain. As she struggles to keep her leg upright, she gets fucked, flogged, and caned. Caught in between pleasure and pain, this greedy painslut cums hard. She keeps cumming through all the pain and impact play as her pussy is fucked, fingered, and vibrated. At the end of the day, it's clear: Cadence is not only a good whore, she's also a tough painslut.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2017-10-24",
  "scene_id": 42480,
  "tags": [
    "Anal",
    "BDSM",
    "Bear",
    "Blonde",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Discipline",
    "drool",
    "Female Slave",
    "Gag",
    "Gimp",
    "Humiliation",
    "Leather",
    "master",
    "Oral Sex",
    "Pain",
    "harness",
    "Role Play",
    "Rope Bondage",
    "Squirting",
    "Straight"
  ],
  "title": "Gorgeous Blonde Cadence Lux is a Good Whore"
}