{
  "collections": [
    "Bound Gods"
  ],
  "description": "Brian Bonds is a total anal slut who is apparently no stranger to the emergency room, where he has been admitted once again for shoving yet another object up his ass. Dr. Jaxx examines his patient thoroughly, exasperated with Brian's pervy glances and slutty attitude as he attempts diligently to do his job. Soon after Dr. Jaxx leaves to find a nurse, Brian slips into a deep sleep and begins dreaming of being tormented by his hot silver fox of a medical professional. Brian finds himself completely mummified in vet wrap with only his cock and nipples exposed, which soon swell with the extreme pressure of the unforgiving pumps Dr. Jaxx applies to his patient while slapping and hitting Brian's tightly bound body. As Dr. Jaxx flogs Brian's exposed ass, his cock grows hard at the sights and sounds of his writhing captive and shoves his massive uncut cock into Brian's mouth for a deep, hard facefucking. Next Brian is tied to the bed and blindfolded as Dr. Jaxx plunges one finger after the other into Brian's ass - and soon Brian is riding his doctor's whole hand like the real anal whore he is. After fucking Brian with his hand, Dr. Jaxx rams his hard cock into Brian's ass furiously, fucking him senseless until Brian can't take it any more and blows his load while being facefucked and tormented with nipple clamps. Brian sucks and slurps on the hot doctor's cock until Dr. Jaxx shoots a huge amount of cum all over Brian and the bed, covering his patient in his sticky hot load. Truly a wet dream to remember!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Tristan Jaxx",
      "person_id": 20786
    },
    {
      "name": "Brian Bonds",
      "person_id": 33737
    }
  ],
  "release_date": "2017-07-27",
  "scene_id": 42483,
  "tags": [
    "anal",
    "Anal Fisting",
    "Ass to Mouth",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "doctor",
    "domination",
    "gay",
    "Hairy",
    "humiliation",
    "Male Sub",
    "master",
    "medical fetish",
    "nipple clamps",
    "nipple torture",
    "nurse",
    "Older and Younger",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "slapping",
    "submission",
    "uncut",
    "Uncut"
  ],
  "title": "Obsessive Anal Penetration Disorder"
}