{
  "collections": [
    "Bound Gods"
  ],
  "description": "Jack Andy has a huge cock and is entirely new to Kinkmen, but his solid body is ready for whatever intense torment Bound Gods has to dish out. Cool and sadistic Christian Wilde is the lucky dom, and he wastes no time breaking in the new guy. Jack is tied to a cage and rope gagged while Christian smacks his body with his open hands and a thick billy club. The stinging and burning are nearly overwhelming as Jack screams into his gag and his skin turns a deep, fiery red. Christian releases Jack's giant cock from his jock and teases and jerks it, never letting up with the persistent beating. Jack is clearly torn between the pain and pleasure as his huge dick swings between his legs. Having served Christian well, he's then put on the floor, bound, and made to lick his dom's boots, all the way up and down like a good slave. He's spanked and flogged while being teased with the possibility of getting at Christian's thick, rock hard cock. But only once he's earned it does he finally get it. Christian whips it out and shoves it into Jack's throat, pumping his face with solid dick. Jack eats it up with a fervor, voraciously sucking and slurping on that cock, until Christian backs off and flogs his slave savagely and heavily. Finally, Jack is tied, bent over a solid wooden wedge, blindfolded, gagged and whipped repeatedly with a cat o' nine tails. The sensory deprivation combined with stinging physical sensations are nearly overwhelming as Jack wails and trembles under the punishment. But it only gets crazier as Christian rams his thick dick deep into Jack's hungry ass. The sweat pours off both men as Christian fucks Jack so damn hard he forgets all about the flogging and the billy club and the cat o' nine tails. All he wants is that dick pounding his ass, ramming in as deep as he can take it. Christian ultimately blows his huge load all over his slave's face, but before he's even done Jack is swallowing that cock down his throat hoping for all the cum he can get. Christian then makes Jack work his own long thick cock and shoot his load on his boots, then slurp it up as his final reward.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Jack Andy",
      "person_id": 60406
    }
  ],
  "release_date": "2017-08-03",
  "scene_id": 42486,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "cage",
    "Corporal Punishment",
    "deprivation",
    "domination",
    "flogging",
    "gag",
    "gay",
    "humiliation",
    "Jock",
    "Male Sub",
    "master",
    "pain",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "slave",
    "submission"
  ],
  "title": "Huge-Dicked Sub Jack Andy Gets An Intense Beating From Christian Wilde"
}