{
  "collections": [
    "Bound Gods"
  ],
  "description": "Hoytt Walker is new meat on Kinkmen and eager to take everything the leather-clad Trenton Ducati gives him. First, Hoytt is bound and blindfolded with rope while Trenton tests out his new boy's limits. Hoytt gets an intense smacking and paddling all over the front of his body - his chest, his stomach, his thighs. Hoytt groans in pain as Trenton pays special attention to Hoytt's sensitive nipples and balls. Trenton grabs Hoytt's balls, stretches them as far as they'll go, and then paddles them as Hoytt cries out in pain and begs to come. Next Hoytt is tied down spread eagle, with two vibrators on his dick and close pins on his balls. Trenton fucks this pig's asshole with a vibrating cock and teases his hard cock with his mouth. Hoytt strains in his bonds, quivering on the edge of pleasure and pain, when Trenton stuffs his huge cock into Hoytt's open and wet mouth. But with every gift comes more pain, so Trenton decorate's his slave's torso with a close pin zipper. The anticipation rises as Hoytt takes all of Trenton's cock while Trenton plays with the zipper before savagely ripping it off! Body shaking, Hoytt yells in pain. His groans continue as Trenton smacks him all over his torso. And there's more pain to come before this is all over. Hoytt is bound, face down, and gets an intense flogging on his back and ass. Once Hoytt has taken enough pain, Trenton fingers his boy's asshole and then makes Hoytt clean his fingers off. Finally, Hoytt is tied with his legs up, giving Trenton perfect access to this pain slut's asshole. Trenton savagely fucks Hoytt's hole with his thick hard cock and then comes all over Hoytt's face, as Hoytt desperately tries to lick up all Trenton's come. Then Trenton jacks Hoytt off and feeds him his own hot jizz. Finally, Trenton stuffs his beautiful cock back into Hoytt's mouth and pushes all of Hoytt's come down his greedy little throat.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Hoytt Walker",
      "person_id": 60409
    },
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    }
  ],
  "release_date": "2017-08-10",
  "scene_id": 42488,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "blond",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Crotch Rope",
    "Domination",
    "Flogging",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Paddle",
    "Pain",
    "Pain Slut",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Slave",
    "Submission",
    "switch",
    "Tattoo",
    "versatile",
    "white",
    "Zipper"
  ],
  "title": "Pleasure and Pain for Trenton Ducati's New Submissive Slut"
}