{
  "collections": [
    "Men On Edge"
  ],
  "description": "The tattooed muscle stud Kai Donec is a lazy asshole douchebag boss at the local motorcycle shop. He sits all day on his tight lazy ass and has his staff do all the hard work. He constantly berates them and makes their lives a living hell. Today is the last day for that! Brian Bonds and Sebastian Keys have had it. No more doing twice the work for this punk. No more cleaning up after all his BS! Today the motorcycle mechanics get the edge and have their Sexual Revenge! While Kai is asleep on the job, Brian and Sebastian sneak up on him. They grab the screaming Kai and put him in tight restrictive bondage. They duct tape his mouth to keep muffle the screams. Brian gets the blue mechanics jumpsuit off to reveal Kai's tight boxer briefs with a hard throbbing cock pulsing inside. They tease that cock before cutting off his underwear revealing a rock hard cut monster. The hard veiny cock is already at the edge and ready to explode. Kai's nipples are tormented and painful nipple suctions are put in that takes Kai further to that edge! Brian torments Kai's cock with a deep slobbery blowjob. Kai screams to cum, but this is revenge and torments him right on the edge. Both Sebastian and Brian get Kai's black boots off and start licking his feet and sucking his toes before moving him to the main room for display. Kai is tied up in tight rope bondage and is fully restricted. He's not going anywhere. They give him a painfully pleasurable long stroke hand job. Bringing him over and over to the edge. Kai is in pain from all this pleasure and his cock looks like it's ready to blow! They bring out the intense hitachi and smash it up to his cock head and balls for uncontrollable pleasure. A dick on a stick is brought out and shoved deep down his throat to get it all sloppy wet. Finally for the revenge finale, Kai is made to cum huge thick loads before getting tickle tormented. He can't escape and has to take 4 hands of sensitive tickling all over his body. They leave him tied up in the shop and fully humiliated.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Kai Donec",
      "person_id": 60372
    }
  ],
  "release_date": "2017-07-18",
  "scene_id": 42489,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "Cut",
    "domination",
    "Edging",
    "Feet",
    "gay",
    "Hand Job",
    "Hitachi",
    "humiliation",
    "Male Handler",
    "Male Sub",
    "master",
    "muscle",
    "oral sex",
    "pain",
    "Prostate Stimulation",
    "rope bondage",
    "Rough Sex",
    "Stud",
    "submission",
    "tickling"
  ],
  "title": "Motorcycle Mechanic Stud Gets His Road Hard Hog Ridden to the Edge"
}