{
  "collections": [
    "Bound Gods"
  ],
  "description": "Pierce Paris finds himself alone, bound, and blindfolded in a dark dungeon. His senses are hyper aware as they try to compensate for his inability to see. He can hear someone faintly breathing and knows that he is not alone. Suddenly the sound of footsteps begin to circle him like a rabid dog drooling with manic hunger. He can feel the hot breath of another man right next to his face. Pierce is trembling but he dare not move out of blind fear. Christian Wilde then rips the eye cover off of the black leather hood that is isolating Pierce from the world. It takes a moment for Pierce’s eyes to adjust to light but once they do he sees the face of his capture who is clad in leather pants and tall boots. Christian quickly pounces on Pierce and establishes that he is in complete control of the situation. He mercilessly squashes Pierce’s rock hard cock with the heel of his boot. Pierce winces and cries out in pain. Christian begins to work Pierce’s body over with a black leather riding crop, turning his skin a flushed shade of bruised red. Pierce begs for the relentless pain to stop and his Master is only to happy to oblige by shoving his massive cock down his pathetic submissive’s greedy throat. Every time that Pierce gags his cock becomes in ever more engorged with delight. After he has warmed Pierce up, Christian then binds his captive slave in tight and restrictive rope bondage that leaves his sub’s backside exposed. Christian then pounds away on his back, ass, and ball sack making the pain slut scream in ecstasy. Tired of beating his pet, Christian then suspends him by his wrists and ankles and jams his stiff rod down his dangling slave’s throat. Pierce’s greedy mouth devours his daddy’s cock and chokes out muffled words of gagged appreciation for the generosity bestowed upon his worthless body. And, like all good cum dumpsters, Pierce only wants more and pleads with Christian to peg his tight asshole. Christian is only to happy to oblige and penetrates his sub’s greedy ass from behind. He pounds away and Pierce only craves more and begs for his master to shower his unworthy face with a lot load of cum. Christian throws him to the floor and covers Pierces face with a huge wad of jizz while he steps on his slave’s worthless ball sack. And when Christian has finally had his fill, he blindfolds Pierce and leaves him in a heaping mess of cum and sweat.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2017-08-31",
  "scene_id": 42487,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "Boot",
    "brunet",
    "Cock Worship",
    "Corporal Punishment",
    "Crop",
    "Crotch Rope",
    "Domination",
    "dungeon",
    "Fear Play",
    "Foot Torment",
    "Gay",
    "Hood",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Pain",
    "Pain Slut",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "Stud",
    "Sub",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white",
    "Zapper"
  ],
  "title": "Captive God Pierce Paris: Bound in Rope Bondage and Fucked by Hot Stud"
}