{
  "collections": [
    "Bound Gods"
  ],
  "description": "Scott Riley is taking a little extra under the table in his job as a massage therapist, doling out happy endings to his customers. Jordan Boss gets word of this, and while he lies naked under Scott's roaming hands, he asks about the \"deluxe package\". Scott can't say no, as Jordan's ripped, muscled body feels too damn good, and his balls literally heave under Scott's touch. But it's entrapment from the start, as Jordan slams Scott to the table and takes everything he wants from him, giving him his hard cock and penetrating punishment as payment. He first ties Scott to his own massage table, smacks him and crops him to show him who owns who. Every strike of Jordan's hands sting Scott's sensitive skin, as he moans and screams with painful pleasure. Scott resists, but Jordan knows he wants more. He ties Scott to a chair and gives him more indeed. Scott's blindfolded and flogged, each heavy blow landing as a sudden, electrifying surprise. When Scott's skin is red and marked, Jordan shoved his thick dick into his throat and Scott sucks it good and deep. Finally Jordan puts Scott on a wrecked mattress and relentlessly fucks his sweet furry ass! Scott takes every solid inch, moaning and wailing with disbelief and pleasure, taking Officer Boss' hard anal punishment in a way he didn't know he could. Jordan fucks Scott's mouth until he cums, shooting hot, thick ropes of cum all over Scott's face and neck. He finally makes Scott cum, tormenting his ultra-sensitive cock long after he shoots. Both men are spent, and Scott promises to close up shop, but Officer Boss won't have that. He wants it all to himself.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jordan Boss",
      "person_id": 59434
    },
    {
      "name": "Scott Riley",
      "person_id": 57782
    }
  ],
  "release_date": "2017-07-20",
  "scene_id": 42484,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "domination",
    "gay",
    "hand job",
    "humiliation",
    "Male Sub",
    "master",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "Stud",
    "submission"
  ],
  "title": "Officer Jordan Boss Takes Down Scott Riley And Fucks His Hungry Hole"
}