{
  "collections": [
    "TS Seduction"
  ],
  "description": "TsSeduction is proud to present The Best of Hot TS Summer Sex Parties. These are the absolute Hottest Ts Group Sex Scenes presented for your dirty viewing desires. Yasmin Lee, Jessy Dubai, Venus Lux, Honey FoXXX, Jessica Fox, & Delia Delions are all here to group fuck in the hot summer nights. That's 6 Hot, Huge, Ts Cocks deep fucking and shooting their sexy thick loads for you.\nFirst up is Jessy Dubai wtih hot porn star Lance Hart and innocent newcomer starlet Jessie Parker. This threesome is on fire with hot squirting pop shots, and multiple wet orgasms from Jessie's well fucked pussy.Â Steamy three way sex with Jessy dominating and fucking her boyfriend and their play thing. Plenty of deep ass pounding, pussy fucking and cumming from an all night summer sex party that ends in a cum swapping kiss goodnight.\nNext up we have the sex goddess Yasmin Lee with two studs Marcus Ruhl and Robert Axel! This hot sexual fantasy role play commands your attention with Yasmin's hard dominating cock tops both Marcus and Robert into submission and explosive orgasm. This one is a real scorcher as she uses both men for her pleasure!\nThe gorgeous Venus Lux with the legendary beauty Danielle Foxx and DJ. This is the Hot Summer Threesome Tryst you have been craving. Danielle wants something new to spice up their marriage and she loves ass. They seek the help of sex counselor, Venus Lux who takes a hands on approach to helping couples! Before DJ knows it his face is then stuffed deep in his wife's pussy while he takes every inch of Venus's cock deep in his ass until he blows his load all over then it's Danielle's turn!Venus slides her hungry cock in Danielle's juicy cunt then blows her load over both their faces and tongues and the couple spit balls Venus's sweet sticky cum!\nWe've been waiting years to see Delia Delions fuck Tom Faulk and Siouxsie Q. This hot dungeon fuckfest delivers an ass and pussy pounding rammed with Delia's giant throbbing gristle. Tom and Siouxsie both fight over Delia's hot, sweet load!\nAnd finally, our biggest summer fuckfest yet! TsSeduction is proud to present the hottest scene from our feature Ts Gangbang starring Jessica Fox, Jessy Dubai, Honey Foxxx with Sebastian Keys! Everyone gets a turn ramming their huge Ts cocks down Sebastian's hungry hole and shooting their thick creamy loads all over. It's a palooza of sex, so hot and complicated and involved that you can watch this update 100 times and still see something different.",
  "directors": [],
  "models": [
    {
      "name": "DJ",
      "person_id": 20225
    },
    {
      "name": "Danielle Foxx",
      "person_id": 13307
    },
    {
      "name": "Delia DeLions",
      "person_id": 57489
    },
    {
      "name": "Honey FoXXX",
      "person_id": 20864
    },
    {
      "name": "Jessica Fox",
      "person_id": 17013
    },
    {
      "name": "Jessie Parker",
      "person_id": 50659
    },
    {
      "name": "Jessy Dubai",
      "person_id": 47035
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    },
    {
      "name": "Marcus Ruhl",
      "person_id": 47823
    },
    {
      "name": "Robert Axel",
      "person_id": 35027
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Siouxsie Q",
      "person_id": 34821
    },
    {
      "name": "Tom Faulk",
      "person_id": 57417
    },
    {
      "name": "Venus Lux",
      "person_id": 41417
    },
    {
      "name": "Yasmin Lee",
      "person_id": 13931
    }
  ],
  "release_date": "2017-07-04",
  "scene_id": 42495,
  "tags": [
    "Anal",
    "Blowjob",
    "Cock Worship",
    "Couple",
    "dungeon",
    "Gangbang",
    "Male Sub",
    "Role Play",
    "Squirting",
    "Straight",
    "Submission",
    "Threesome",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Hot TS Summer Sex Parties"
}