{
  "collections": [
    "Men On Edge"
  ],
  "description": "Tony Shore is a young handsome stud working out down at his local gym where he meets Sebastian Keys. Sebastian saunters over and spots Tony's last couple of reps and asks if he's ever been tied up before. Tony tells Sebastian that he hadn't and figures what the heck and steps over to one of the workout machines and lets Sebastian take control. Sebastian uses his rope and ties Tony's body in a standing position, wrapping his chest first a few times, tying his wrists behind his back, and finishes by securing Tony's muscular thighs to the bench press bar. Sebastian slowly cuts off Tony's shorts and jock strap letting loose Tony's big fat uncut cock already hard. Sebastian peels back his foreskin, takes a moment for admiration and starts sucking. Sebastian grabs Tony's balls and jerks Tony's cock until he tells him he's gonna explode and Sebastian suddenly stops, leaving Tony's pulsating cock bouncing around, aching to cum. Sebastian wraps his lips around Tonys big cock again and takes it balls deep. Tony wants so badly to cum and starts fucking Sebastian's face but Sebastian pulls away slowly leaving Tony humping the air because he still wont let him blow his load. Next Sebastian puts a ball gag in Tony's mouth and has him get on his back and ties both his legs spread eagle in rope bondage. Sebastian sticks two fingers in Tony's ass while he jerks and sucks his cock getting it ready for the dick-on-a-stick. Tony takes the dildo in his tight ass making his cock throb every time Sebastian hits his spot. Sebastian licks and sucks Tony's toes while he jerks his cock making Tony writhe around in ecstasy moaning through the ball gag in his mouth. Sebastian has Tony sit on a Sybian and cranks the vibrations all the way up until Tony blows a fat load.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Tony Shore",
      "person_id": 60407
    }
  ],
  "release_date": "2017-09-26",
  "scene_id": 42490,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "couple",
    "dildo",
    "Edging",
    "gag",
    "gay",
    "In The Gym",
    "Jock",
    "Male Handler",
    "Male Sub",
    "oral sex",
    "Prostate Stimulation",
    "rope bondage",
    "Stud",
    "sybian",
    "tickling",
    "uncut",
    "Uncut"
  ],
  "title": "Tony Shore, Tied Up and Edged at the Gym"
}