{
  "collections": [
    "Men On Edge"
  ],
  "description": "Sebastian Keys arrives at an empty gym, and while organizing the weights, he notices across the room the soft spoken and sexy David Emblem, gagged and suspended, bound to a punching bag with his ass out, ready to go. Sebastian immediately takes advantage of the situation, leaving the weights behind and diving face first into David's sweet ass. He spits in his hole and licks it, teasing it for what's to come. David can only moan and mutter through a ball gag as he hangs with his face up against the punching bag. Sebastian frees David's hard cock from his jock and lets his tongue slide up the hard shaft to the hungry hole, then back down again. David, bound at the wrists in the perfect position to be used and worked, struggles in the bondage but loves every moment as Sebastian sucks his cock and strokes it. Sebastian fingers his tight hole before sliding a thick hard dick on a stick in his ass. Sebastian works David's cock while pumping his hole, pushing him right to the brink of cumming. But he holds back, denying David that final release. Later, David is tied on the floor with his cock and balls bound and tethered to the punching bag, preventing him from going anywhere. Unable to touch himself, he lies there while Sebastian strokes his rock hard cock, engorged from the bondage. David is absolutely begging to cum at this point. It's been so long since he emptied his balls, and the feeling of pleasure and restraint is overwhelming. Sebastian sucks his sweet hard dick, teasing him and tormenting him. He then uses a smooth jack-off toy on his cock, sending unbelievable sensations through his body, making him feel like he's going to cum multiple times. But again Sebastian denies him, moving to his feet, taking David from rapturous pleasure to unbearable tickling. Finally Sebastian puts nipple clamps on David, adding to the full-body sensation of being bound and edged, then slides a prostate stimulator up his tight hole. David is utterly helpless, stimulated from head to toe, while Sebastian works his cock again, harder and faster, until David finally blows his hot load all over himself. Sebastian feeds him his cum and leaves him there... to be used again another day.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "David Emblem",
      "person_id": 59408
    }
  ],
  "release_date": "2017-08-01",
  "scene_id": 42491,
  "tags": [
    "anal",
    "anal fingering",
    "athletic",
    "ball gag",
    "bdsm",
    "blowjob",
    "bondage",
    "Cock Worship",
    "domination",
    "Edging",
    "Face Sitting",
    "Feet",
    "gag",
    "gay",
    "humiliation",
    "Jock",
    "jockstrap",
    "Male Handler",
    "Male Sub",
    "nipple clamps",
    "oral sex",
    "Prostate Stimulation",
    "punching",
    "rimming",
    "role play",
    "rope bondage",
    "Rough Sex",
    "Smooth",
    "submission",
    "tickling",
    "weights",
    "wrestling"
  ],
  "title": "Helpless David Emblem Gets Bound, Suspended, and Edged Repeatedly"
}