{
  "collections": [
    "Whipped Ass"
  ],
  "description": "It's the end of an era when the Dyke Bar loses its lease, but a new era begins when it sets up shop in an underground location! The lusty ladies of Dyke Bar are eager to carry on the legacy of group lesbian sexual domination, this time with Dyke Bar bouncer Mona Wales getting her glorious comeuppance! Mona's surrounded and dominated by her beautiful cohorts Mistress Kara, Nikki Darling and Bella Rossi in an intense round of slapping, flogging and fucking that continues long after last-call! This steamy lesbian action gets started as bartender Kara goes to close up the shop. Nikki and Bella get their hands all over Mona's tight body and woman-handle her into submission. Once all her clothes are ripped off her gorgeous body exposing her perky tits and shaved pussy, the ladies get to work. Mona is ready to serve this after hours party. Her face is shoved into pussies and asses, worshipping and eating out all these fine ladies. Pussy licking, ass licking, smothering, Mona is insatiable. Those perky tits need some love too and the only proper way is with intense clover clamps. Mona squeals with pain at the pleasure her nipples endure. Let's bring on more pain shall we. Kara gets out the crop and starts turning Mona's body bright red with corporal punishment. Finally they get mona on the filthy bar floor and take those nipple clamps to her gorgeous vulva. Her thick pussy lips turn bright red with excitement. The ladies take turn slapping her beautiful body before Kara and Nikki step all over Mona with their full weight. Bare feet and high heels smother that squirming body while Bella takes a hitachi to rip out huge orgasms. Taking the party to the back room, the ladies tie up Mona in rope bondage and gag her mouth with a bright red ball gag. Kara brings out the floggers and takes it to Mona's bare ass and pussy. Kara also has another surprise. A big black strap-on ready to fuck that perfect pussy. She takes her huge cock and pounds that precious pussy while the other girls choke, spit and flog Mona. Bella also wants a turn and she reveals her big black cock as well. She has other thoughts in mind and rams that cock right up Mona's ass. Huge anal orgasms echo through the bar as Nikki gets her pussy eaten out. As if that wasn't enough, Kara and Bella shave their cocks up both her holes in an epic lesbian Double Penetration. This DP erupts even more screaming orgasms from Mona. Finally Nikki gets her turn and fits her whole fist up Mona's pussy. This beautiful fisting scene gets Mona squirting all over the back room.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Nikki Darling",
      "person_id": 42508
    },
    {
      "name": "Mistress Kara",
      "person_id": 19043
    }
  ],
  "release_date": "2017-08-31",
  "scene_id": 42518,
  "tags": [
    "anal",
    "ass licking",
    "ball gag",
    "bdsm",
    "belly punching",
    "Big Black Cock",
    "bondage",
    "Breast Abuse",
    "choking",
    "clover clamps",
    "Corporal Punishment",
    "crop",
    "domination",
    "dominatrix",
    "Double Penetration",
    "Dyke Bar",
    "Facesitting",
    "Feet",
    "femdom",
    "Fingering",
    "fisting",
    "flogging",
    "gag",
    "high heels",
    "Hitachi",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "nipple clamps",
    "pain",
    "Pussy Eating",
    "redhead",
    "rope bondage",
    "slapping",
    "slave",
    "smothering",
    "squirting",
    "straight",
    "strap on",
    "submission",
    "Vaginal Fisting"
  ],
  "title": "Dyke Bar Underground: Mona Wales Submits!"
}