{
  "collections": [
    "Whipped Ass"
  ],
  "description": "College student Alex Harper is desperate for the opportunity to make up a failed test. She visits Professor Chanel Preston, who impresses upon her that she won’t always get second chances in real life. But Alex is determined and willing to do anything, so Chanel decides to give Alex a chance. Alex acts shy but is eager to get woman-handled and fucked by her hot teacher. Chanel spanks Alex’s cute ass red and strips her of clothes. She clamps Alex’s nipples, handcuffs her, and gags her with a bit so that Alex can focus on her lesson. Chanel tickles and bites Alex’s feet and slaps them with her crop. By the time Chanel starts playing with Alex’s pussy, it’s already wet and excited. Chanel finger-bangs Alex, sliding three fingers in her cunt, and working them until Alex is begging to cum. Next, Alex is tied spread eagle over the couch. Chanel flogs Alex’s thighs, belly, and tits before putting Alex to work. As Chanel sits on Alex’s face, Alex enthusiastically licks her teacher’s beautiful cunt. Chanel cums hard all over Alex’s face, and then fucks Alex with a dick-on-a-stick. Alex loves taking dick, and her pussy gapes as Chanel holds it open for further inspection. Finally, Chanel fucks Alex with her strap-on cock. First she takes Alex’s pussy, and pounding it open and making Alex admit what a dirty cock-loving slut she is. Then she fucks Alex’s sweet ass. Alex moans as her teacher fills her with cock. Alex loves getting fucked by her teacher and rocks back and forth on Chanel’s cock. Chanel fucks Alex’s holes wide open and Alex cums hard with her Professor’s cock buried deep in her ass.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Alex Harper",
      "person_id": 60270
    },
    {
      "name": "Chanel Preston",
      "person_id": 26542
    }
  ],
  "release_date": "2017-10-26",
  "scene_id": 42519,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "Teacher",
    "teachersday",
    "white"
  ],
  "title": "Anal Extra Credit: College Student Trades Ass for Good Grades"
}