{
  "collections": [
    "Men On Edge"
  ],
  "description": "Shay Stone arrives at the gym to find the David Emblem still tied up, spread eagle and exposed. As Shay rushes over to untie David, Sebastian Keys grabs Shay from behind and wrestles him down! Shay awakens, tied to a weight bench, with Sebastian and David surrounding him. Shay tries to talk his way out, but Sebastian ball gags him and cuts his clothes open. Once his big dick is exposed, David starts teasing it with his hands, tongue, and mouth. Shay struggles in his bonds as David's wet mouth moves up and down on his rock hard cock. Sebastian slips nipple suckers on his new captive and Shay's groans increase. Both Sebastian and David run their hands along Shay's hairy body and toy with him, bringing him right to the edge. Sebastian moves David's head up and down on Shay's cock, and lets Shay fuck David's eager mouth, as Shay begs to come over and over, only to be denied. Later Shay is bound standing up. David licks and jerks his cock off as Sebastian licks his sweet asshole. As Shay gets closer to coming, Sebastian starts tickling him! Shay can't stop laughing and begs Sebastian to stop tickling him. Now that Shay's been distracted, Sebastian pushes a dildo into Shay's tight hole and fucks his ass. Shay begs to come as he's trapped between David's mouth on his dick and a dildo in his ass. But the torment isn't over yet. Sebastian breaks out a stroker and uses it to stroke Shay's dick, bringing him closer and closer to the edge. Finally, as David jerks him off, Sebastian allows Shay to come. Shay shoots his load far and hard after being denied all day. David licks his cock clean, taking care to get every single drop. Once Shay is drained, Sebastian and David leave him tied up for the next gym member to find...",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Shay Stone",
      "person_id": 60392
    }
  ],
  "release_date": "2017-08-15",
  "scene_id": 42515,
  "tags": [
    "bdsm",
    "bondage",
    "dildo",
    "Edging",
    "gay",
    "Hairy",
    "Male Handler",
    "Male Sub",
    "oral sex",
    "Prostate Stimulation",
    "rope bondage",
    "tickling"
  ],
  "title": "Hairy Hunk Shay Stone Gets Bound, Tickled, and Edged"
}