{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Kira Noir and Veruca James are on a blind date. The attraction is mutual and as luck would have it, Veruca is house-sitting for a friend with a secret dungeon. She invites Kira over to check it out. Kira is curious - she's never tried anything like this before. Luckily, Veruca is here to guide her through a new kinky experience. She puts Kira over her knee and begins spanking Kira's perfectly round ass. Kira loves the red smacks stinging her ass and begs for more. Veruca inspects Kira's pussy, and fingers Kira to an intense orgasm. Next, Kira is bound with her legs in the air and a close-pin zipper up both sides of her torso. Veruca gets so turned on seeing Kira so helpless and starts cropping her feet. She tickles Kira as Kira giggles and tries to squirm away. She flogs Kira's ass and legs before sitting her beautiful ass down on Kira's face. Kira loves eating pussy and eagerly buries her face in Veruca's sweet cunt. Veruca cums all over Kira's face and rips off the zippers, making Kira scream in pain. Then Veruca brings out a dick on a stick and fucks Kira's tight pussy. Kira is super turned on and is ready to cum as soon as Veruca starts fucking her. She cums hard on Veruca's cock as Veruca plays with her pussy. Finally, Veruca straps on a cock and gives Kira a hard thorough pounding. She takes pleasure fucking Kira's sloppy wet cunt. Kira loves getting fucked and begs to cum. Then Veruca pushes her cock into Kira's asshole. Kira's ass gobbles up that cock and she cums hard while getting fucked in the ass. Then Kira eats Veruca's pussy and afterward the two make plans for a second date.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Veruca James",
      "person_id": 43570
    }
  ],
  "release_date": "2017-12-21",
  "scene_id": 42520,
  "tags": [
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "dominatrix",
    "dungeon",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "humiliation",
    "kinky",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "pain slut",
    "Pussy Eating",
    "slave",
    "spanking",
    "straight",
    "strap on",
    "zipper"
  ],
  "title": "Veruca James Dominates Submissive Pain Slut Kira Noir on Anal Date"
}