{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Avi is a crafty little daddy's girl that arrives at her Step Father's house with plans to get back to her boyfriend, but Tommy's new wife Jessica see's right through her 18 year old lies and puts her cute little ass on notice with a good hard spanking and a metal anal plug. It was Avi's misfortune to have interrupted Jessica and Tommy's date day with her bullshit. Jessica had been waiting a long time to get her round ass tied up tight, drooling on a ball gag a with a strict caning from her husband. Once her sweet ass was burning with red cane marks and bouncing on Tommy's cock she was ready to confess every dirty thought and fantasy she had been saving for this special day. It all comes spilling out of her like slobber around his cock as she gags and sucks with pent up desire: that is until his phone starts ringing with the news that Avi is coming over to escape some trouble she has found herself in. Tommy leaves his little anal angel with Jessica, who decides to take her day back and have some evil lesbian fun with this little brat and teach her about pussy clamps, anal, pussy licking, and how to take a good beating. When Tommy comes home and finds his step daughter covered in his wife's cunt he is furious, until both ladies manage to sooth his nerves and invite him into a zone of taboo sexual pleasure. He teaches his step daughter how to take a cock in her ass and follow orders as Jessica get's herself off and cleans Avi's ass off his cock happily. The end of the afternoon finds Jessica in some belt bondage and her husbands cock deep in her ass as Avi rides her face and screams around a big red ball gag. The little princess has her first tight zipper on and is going to hold her undisciplined orgasms back as long as she can because Daddy is watching, and he wants to see that she can show some self control while he gives Jessica the indulgent anal pounding she has been waiting so long for. After showing that she can be a good girl, Avi is given a full anal exploration, with Tommy and Jessica stretching and pulling open all her sweet young holes while she learns how to cum in a thousand new ways.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Avi Love",
      "person_id": 60196
    },
    {
      "name": "Jessica Ryan",
      "person_id": 51474
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2017-08-08",
  "scene_id": 42529,
  "tags": [
    "18-Year-Old",
    "Anal",
    "Ball Gag",
    "BDSM",
    "Bisexual",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gag",
    "Humiliation",
    "Lesbian",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Spanking",
    "Straight",
    "Threesome",
    "Zipper"
  ],
  "title": "Avi's Anal Training with her Sadistic Step Family"
}