{
  "collections": [
    "Device Bondage"
  ],
  "description": "It has been quite some time since this little sex package graced the Device Bondage stage with her presence. Serena Blair's toned and athletic body glistens as the stage lights kiss her tanned skin. Her perfect ass trembles ever so slightly as she stands in full attention, anxious to see what devious torment The Pope has in store for her. He wastes no times and takes advantage of Serena's helpless position. Her bare chest is exposed and her tender nipples are helpless as The Pope brutalizes the front of his submissive sluts body with a heavy leather flogger. With the patience and steady hand of surgeon, he tenderizes her tits and pussy until they turn a subtle shade of pink which lets him know that she is ready for the second course. The Pope then mercilessly attacks Serena with a stiff wooden cane, repeatedly beating her nipples and clit until she shrieks from the horrific pain. And, just when she couldn't possibly take another whack, The Pope shoves a vibratoronto her swollen and sensitive clit. Serena begs her sadistic dom to let her cum. But the answer is no. She hasn't earned it yet. The only thing that a wanton slut like Serena deserves is orgasm denial. The Pope leaves her trembling in a sweaty mess and laughs at her misfortune. Next he straps her onto a perch with black leather belts and gags her with top of a soda bottle. Drool oozes down her cheeks onto her perky natural breast. She breaths heavy, terrified of the onslaught that approaches her. The Pope attacks her tits and pussy again with a long heavy flogger and she cries out the screams of a pain slut that is in over her head. But there is no escaping this bondage and she is completely defenseless to the whims of her master. Her pussy begins to drip with hunger as her beating continues. The Pope jams his fingers into her tight pink whore hole and massages her g-spot until her whole body quakes from the violence of her orgasms. The first one always feels good, but as the second, third, fourth, and fifth of multiple orgasms are ripped from the core of her spirit, the pain seeps through her trembling body. But she can't stop it; she is completely out of control. To end the day, The Pope lays Serena on her back and spreads her legs wide open. Having grown tired of beating her clit and nipples, The Pope focus' all of his attention on the soles of her feet. He works each one over and over, repeatedly caning them until Serena can hardly breath. And, just when she is on the verge of breaking, The Pope jams a hitachi onto her swollen and hungry pussy and chokes her until she cums one last explosive orgasm. He leaves her panting, lost, and terrified in a dark, empty room, alone with no help in sight.",
  "models": [
    {
      "name": "The Pope",
      "person_id": 27779
    },
    {
      "name": "Serena Blair",
      "person_id": 31165
    }
  ],
  "release_date": "2017-10-05",
  "scene_id": 42525,
  "tags": [
    "athletic",
    "bdsm",
    "bondage",
    "Breast Abuse",
    "caning",
    "Corporal Punishment",
    "domination",
    "drool",
    "Feet",
    "Fingering",
    "foot torture",
    "Handler",
    "Hitachi",
    "humiliation",
    "leather",
    "master",
    "metal bondage",
    "Mouth Spreader",
    "multiple orgasms",
    "orgasm denial",
    "pain",
    "pain slut",
    "Petite",
    "straight",
    "submission",
    "The Pope"
  ],
  "title": "Petite Slut Serena Blair Punished and Made to Cum in Metal Bondage!!"
}