{
  "collections": [
    "Whipped Ass"
  ],
  "description": "The lesbian revolution is cumming! Party members Cherry Torn and Lily Lane are looking to recruit new members to join them in subverting the masses. Will good girl videographer Mia Li pass their tests and prove she can be bad? Cherry and Lily strip Mia of her clothes and get her on her hands and knees. Lily and Cherry take turns spanking Mia's round perky ass before tying her up. Mia is spanked, flogged, and cropped all over her toned athletic body as Lily and Cherry test her limits. Then they open up Mia's tight wet pussy with fingers and a dick-on-a-stick. Mia cums hard and then her hungry cunt swallows Lily's whole fist! Pussy stretched open around that fist, Mia cums hard again to the satisfaction of Cherry and Lily. Next, these ladies teach Mia survival skills incase she gets thrown in the slammer. Handcuffed and trapped between these two fierce dommes, Mia executes every order perfectly. She licks Cherry's pussy and gets fucked by Lily's huge strap-on cock. After Cherry cums on Mia's face, it's Lily's turn. Mia flips over and services Lily with her eager tongue as Cherry finger-bangs Mia's pussy. Mia is tireless as she works to service Lily's beautiful cunt. Lily cums on Mia's face just as Mia cums from overstimulation. Finally, both ladies focus their attention on Mia for the final test. Cherry pushes a metal butt plug into Mia's ass and Lily decorates her breasts and cunt with closepins. Mia cums hard with her pussy stretched open by closepins and a hard metal plug in her ass. It looks like Mia can be a bad girl after all.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Mia Little",
      "person_id": 51496
    }
  ],
  "release_date": "2017-12-07",
  "scene_id": 42526,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Metal Plug",
    "Pussy Eating",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "toned"
  ],
  "title": "The Revolution is Cumming: Tough Lez Babes Initiate Mia Li"
}