{
  "collections": [
    "Hogtied"
  ],
  "description": "Serena Blair is a classic, petite HogTied model. The Pope loves to lure a girl like Serena into his lair and take advantage of her gullible innocence. He feeds upon quiet, unassuming, strong-willed, good-girls, like Serena. When they are restrained in tight rope bondage and abused with cruel and sadistic corporal punishment his blood boils over into a fevered rage that can only be satiated by the muffled sounds of her screams for mercy as her fragile neck is being choked and throttled. This is the life of a true bondage and pain slut like Serena. First she is made to stand on the delicate tips of her toes as she dangles, suspended in the middle of the room. Her ass is spanked and flogged until it turns a piping hot shade of fire red. Her body spasms from the pain and she begs for it to stop. But The Pope demands strict discipline from the sluts that he trains and Serena must first show her commitment to being a female slave. After working her into a frenzy The Pope then crams a vibrator onto her clit and she shrieks with horror. She begs and begs to cum but right when she is at the height of bliss The Pope denies her the orgasm and takes the hitachi away. Wasting little time he then strings Serena up in a full suspension and laughs at her while she helplessly spins about unable to control anything that is happening to her. He plays with her small perfect natural tits and slaps her pussy. Her skin is pulled so taut from the weight of her body pulling on the ropes that the slightest of movements sends pain throughout her whole body. Unable to do anything except submit to the sadism of The Pope's hands, she begs and pleads to cum and she is finally allowed to the first of multiple unwilling orgasms that seem to never end and only intensify in magnitude. She is then flipped onto her back so The Pope can examine her perky tits. With a hand choking her out he flogs and beats the front of her body. She tenses and tries to move out of harm's way but extreme bondage is inescapable and she is can't protect herself from the dom's repeated blows. She lays broken from the humiliation and pain of submission and takes the punishment as best as she can. To end the her day, The Pope puts her on her knees with her ass in the air. He targets her athletic and toned butt and whips it with renewed passion and concentration. She fights against the bondage but is unable to avoid The Popes cruel intentions. And, just when she can't possibly take one more hit, The Pope stimulates her dripping wet and swollen pussy with a vibrator. Her back arches and sweat pours out her body as she lets out the deep, primal growl of a woman possessed by the demon of unwilling and repeated orgasms that grow ever more painful by the second. As she lays panting on the floor, The Pope walks away laughing at the sight of this greedy sluts shame.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Serena Blair",
      "person_id": 31165
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-11-09",
  "scene_id": 42523,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Brunette",
    "Choking",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Female Slave",
    "Fingering",
    "Handler",
    "Hitachi",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Petite",
    "Rope Bondage",
    "Sadism",
    "shaped",
    "Slave",
    "Straight",
    "Submission",
    "Suspension",
    "switch",
    "Tattoo",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Girl Next Door Serena Blair Restrained and Made to Cum in Rope Bondage"
}