{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Serena looks so unassuming. Her long brunette hair drapes innocently over lean athletic frame. Her smile gleams the coy grin of the good girl that lives next door. Her small perky tits peek through the slope of her blouse with barely a whisper of sexual suggestion. But little would anyone know that beneath that timid and well composed exterior lurks a hungry whore that thinks about sex 24 hours a day, 7 days a week. This is the real Serena Blair and she is hungry for multiple orgasms. She starts her day sneaking about in the dark after she thinks everyone is asleep and no one is watching. Under the cover of darkness and in the privacy of her bedroom she finds herself aroused and hungry to rub her tiny pink pussy. She slowly strips out of teeny panties and rubs her clit slowly in concentric circles as her cunt grows wet with raw desire. She wastes little time and pulls out a vibrator and grinds it on her swollen clit. The hitachi rushes endorphins to her brain and she is soon overcome with the first of many orgasms. Her legs and waist clench as she peaks and cums over and over. Now that she is warmed up she is hungry for more. The greedy little whore lets the first fucking machine take her from behind. Her toned ass bounces as the machine takes vaginal penetration from a tight doggystyle. She explodes again and again until she collapses and can no longer sustain her own weight. But that isn't enough for Serena. A greedy slut like Serena is never satisfied. She rolls over and draws the massive dildo into her pussy. Then she lays back and lets the fucking machine take her on the ride of her life. Her whole body tenses as her pussy gets relentlessly pounded by the a machine that never tires. She screams as one orgasm rolls into the next. She wants it to stop but is lost in the rush of never ending orgasms. So, she lets go and allows the machine to keep fucking her. And in one last explosion of ecstatic bliss, she convulses in ecstasy and falls to the floor in a pool of sweat and lays there like a breathless, hot mess.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Serena Blair",
      "person_id": 31165
    }
  ],
  "release_date": "2017-10-25",
  "scene_id": 42521,
  "tags": [
    "Athletic",
    "Brunette",
    "Dildo",
    "Hitachi",
    "Machine Dildo",
    "multiple orgasms",
    "Petite",
    "Straight",
    "toned",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Petite Girl Next Door Serena Blair Fucked Senseless By Machines!"
}