{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Curvy Mommy Penny Barber is busy cleaning the house for long lost Uncle Ramon's arrival and scolding her hot little piece-of-ass step-daughter for being a brat. Both ladies think that uncle Ramon is simply visiting to straighten out a small mistake in the will, not knowing that his brother did actually leave him everything, including them. He immediately starts by retracting the family Porsche from spoiled little princess Moka and makes her earn back the right to even touch the car. An over the knee spanking and flogging help her get the picture Soon she has a cute little shocked expression as she gets on her knees, handcuffed, to suck dick and get fucked with tight nipple clamps, gently kissing the bumper of the car that used to be hers.\nAfter putting Moka back in line he heads right upstairs to let the secretly submissive housewife Penny Barber know that Daddy is back in charge. Throwing her over the sink, he beats her ass red with a wooden spoon and instructs her in how she can keep paying the rent with her bouncy tits, wet mouth, and hot jiggly ass. Clamps on those big luscious tits, and a sold face fucking on the kitchen floor get's Penny's pussy wet, and soon she is begging to cum against the kitchen counter with her apron above her hips. Ramon shoves his thick cock in her ass sending her over the edge into screaming orgasms that she endures further humiliation and beatings to get. Moka discovers them there, and embarrassed yells at her Step-Mommy, only to be reprimanded by both Ramon and Penny.\nMoka is placed in a tough standing suspension and made to suck and fuck as Penny places strip after strip on her coed ass for calling her a whore. Drooling and begging and screaming apologies Moka does her best to remain composed, but eventually has to cum and does so with her feet lifted in a full suspension. After promising to be a good girl she is let down and allowed to take her Mommy's fist and lick up her Uncle's cock fresh out of Penny's hungry ass.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Moka Mora",
      "person_id": 59853
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2017-10-17",
  "scene_id": 42534,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "Feet",
    "Female Slave",
    "Flogging",
    "Humiliation",
    "Latin",
    "master",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Spanking",
    "Straight",
    "Stud",
    "Suspension",
    "switch",
    "Threesome",
    "white"
  ],
  "title": "Hot Spoiled Princess & Anal Step-Mommy Earn Their Keep"
}