{
  "collections": [
    "The Upper Floor"
  ],
  "description": "It's a battle of the blonds as a scam artist faces off against a sadistic housewife resulting in brutal sybian, squirting, bondage, anal, humiliation, & pussy clamps. Cadence Lux is a hot little whore running a her last job, but picks the wrong rich and sadistic psycho's to pull one over on. Before she arrives from the third party designer app agency, Tommy and his hot and bothered wife Mona are playing power games. Instigating her sadistic husband's wrath is a time honored tradition, so Mona coyly throws her collar on the floor leaving herself open to Tommy's discipline. Panties stuffed in her mouth and pussy, paddled and flogged until she is bound and squirting on the floor with a cock in her ass, choked out on her husbands work tie, Mona looks like a happy little sadistic house whore. Until she remembers the decorator is coming... Cadence will be sad to find that the cupboards and drawers are empty, and there is nothing in the house to steal except a single silver collar draped playfully in front of a security camera, as if for her to find. Walking directly into her fate, Cadence takes the necklace and finds herself immediately under Mona's thumbs, pussy clamped wide open, nipples in tight metal clamps, made to gush and squirt with painful orgasm after painful orgasm. Humiliated and used up, Cadence scrambles out of the house, but cannot resist trying to steal one last thing before making it out the door, landing her in Tommy's hands, and then bouncing on his cock as he and Mona decide what to do with their newly acquired toy. Answer is wrap it up tightly in black tape and place it on the sybian for a terrible torrent of orgasms while being shocked, face fucked, and made to like Mona's asshole. Once Cadence is thoroughly objectified and fucked out, she must please Mona's pussy and clean Tommy's cock as he fucks his wife's gorgeous asshole and she relishes every orgasm. Tied up and thrown on the bed, Cadence is fucked, spit on, humiliated, and gushes uncontrollably all over Tommy's dick until the stockholm syndrome sets in and she promises herself as a pet to Tommy and Mona, to keep forever.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2017-09-19",
  "scene_id": 42530,
  "tags": [
    "Anal",
    "April Showers",
    "BDSM",
    "Blonde",
    "Bondage",
    "brunet",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "Dominatrix",
    "Female Slave",
    "housewives",
    "Humiliation",
    "Latin",
    "master",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "switch",
    "Sybian",
    "Threesome",
    "toned",
    "white"
  ],
  "title": "Scamming Squirting Slut Punished by Crazy Anal Housewife"
}