{
  "collections": [
    "Device Bondage"
  ],
  "description": "After almost a year, Leigh Raven is back, bald, and better than ever. She is restrained in metal bondage, unable to move her body off the floor. The Pope emerges from the shadows and begins. He starts with a flogger, targeting Leigh's breasts and cunt. She laughs with each hit, flailing as she tries to avoid the lash. Then the Pope turns his attention to her cute bush. He pulls out her pubes with his fingers as Leigh screams in torment. Once he tires of ripping hair out, the Pope breaks out a cat of 9 tails whip. Leigh's laughs and screams as the Pope whips all her tender sensitive bits, leaving red stripes on her breasts. Leigh's shrieks and giggles continue as he uses a thick thuddy stick on her thighs and punches her chest. Now that her pussy is warmed up and dripping, the Pope fingerbangs her and fucks her tight cunt with a dick on a stick. Leigh comes hard, squirting all over herself. Next, Leigh is restrained upright. Her nipples are clamped on the most tender area, right behind her piercings. She is given the choice of adding more weight to her nipples or having her skin decorated with little clamps. She chooses the little clamps every time and ends up with clamps all over face, belly, sides, and hands. The Pope then vibrates her pussy until she cums hard. Finally Leigh is restrained on her stomach with her pussy, ass, and legs exposed. All this unmarked skin gives the Pope plenty of room to play with. Leigh squirms, trying to look back at what the Pope is doing, but she can only anticipate so much. Each strike hits her hard, leaving red marks on her ass, thighs, and legs. Leigh screams as the Pope canes her hard, leaving delicious marks all over her skin. Now, the Pope puts a blindfold over Leigh's eyes and tells her to expect electricity. If there's one thing Leigh is scared of, it's electricity. Her body tenses and her heartbeat increases as the Pope turns on the device and brings it closer to her body. He presses it to her cunt and Leigh shrieks and laughs in surprise and delight, realizing it's a vibrator. Leigh cums quickly, body shaking from a day of pleasure and pain.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Leigh Raven",
      "person_id": 59527
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-10-19",
  "scene_id": 42531,
  "tags": [
    "BDSM",
    "Belly Punching",
    "big dick",
    "Blindfold",
    "Bondage",
    "brunet",
    "Bush",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "other hair color",
    "Pain",
    "Pain Slut",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "The Pope",
    "Vibrator",
    "white"
  ],
  "title": "Alternative Pain Slut Leigh Raven Gets Whipped, Caned, and Clamped"
}