{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Young, Italian, naive, vulnerable, and exposed in the city full of perverted voyeurs. This is where Rebecca Volpetti finds herself when Steve Holmes and Cherry Kiss get their sadistic hands all over her shameless 19 year old body. Rebecca oozes an enthusiasm and raw sexual energy that intoxicates the deviant minds of the two dom's. She is all too eager to be a female slave and submits to being humiliated and disgraced in public in front of a crowd of people who were enjoying their lunches on a beautiful day. She is first striped naked and paraded around the park like a shameless whore. A gag with a cigarette ashtray attached to its end is jammed into her mouth and our handlers enjoy a smoke at the expense of Rebecca's comfort. She chokes on the smoke as it burns her eyes and gags as the sting of heavy leather floggers bruise her sensitive small breasts. The shocked crowd laughs at her misfortune as dom's coerce her into surrendering all of her control and shock her perky tits with electric zappers. They march her through the crowded streets and drag her into a local bar where a crowd of drunk locals are ready to devour her with their intoxicated gaze. The petite slut is shoved to floor and is made to unwillingly lick the feet of the bar's patrons. The crowd quickly devolves into a ruckus and begin to inflict corporal punishment on to the wanton whore. They spank her ass and it begins to glow a painful shade of neon red. This only makes Rebecca's pussy wet and when Steve takes out his massive cock, she devours it in one gulp. Her eyes tear as she deep throats his cock and eats his balls. Steve drops his pants and shoves her face into his sweaty ass and makes Rebecca give him a thorough rim job. Gasping for air she begs for more and Cherry obliges by shoving Rebecca's drool covered face into her tight pink pussy.\nSteve then tears into Rebecca's whore holes and pounds her pussy and her tight asshole relentlessly while the crowd continues to humiliate her shameless need for sexual validation. And in the height of the chaotic frenzy, Steve blows a massive load of cum all over Rebecca's face. She gobbles it all up like a greedy masochistic slut, and the crowd stares and laughs in disbelief.",
  "directors": [],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Cherry Kiss",
      "person_id": 60511
    },
    {
      "name": "Rebecca Volpetti",
      "person_id": 60698
    }
  ],
  "release_date": "2017-10-30",
  "scene_id": 42545,
  "tags": [
    "19 year old",
    "anal",
    "AprilFools",
    "bdsm",
    "blowjob",
    "Corporal Punishment",
    "discipline",
    "domination",
    "drool",
    "Feet",
    "female slave",
    "gag",
    "humiliation",
    "leather",
    "Petite",
    "public",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur",
    "Voyeurism Fantasies"
  ],
  "title": "19 Year Old Rebecca Volpetti Humiliated with Public Sex and Punishment"
}