{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Two European female sex slaves make their debut on Public Disgrace. Angel Rush and Lyen Parker have been coming to Public Disgrace orgies for quite some time and their hunger to deepthroat massive cocks and be humiliated in public has grown to a fevered state. First the two sex pets are marched through the streets of the city wearing only white. A sadistic dom splashes water all over their dresses revealing their tits and pussy to all the people walking by. They are dragged through the streets by leather leashes shackled to their thin and fragile necks. The two slaves whimper as they are scolded by their mistress, whose cruel streak blossoms as her slaves embarrassment intensifies. Eventually the two whores get dragged into a local bar and the crowd tears off their clothes. Two sex crazed men whip out their hung dicks and cram them down their submissive throats until they gag and choke from the oral penetration. The rest of the crowd takes turns spanking them with their hands and whipping them with a leather flogger. The girls cry out in pain and beg for mercy. The sadistic male with the biggest cock shoves his member into their tight assholes while their mistress urinates all over their toned and perfect bodies. Two men taking turns fucking their tight assholes and girls squeal from the pleasure of anal penetration. They cram their fingers into their tight pussies and play with their clits as they get fucked relentlessly from behind. The submissives begin to get lost in the moment and their arousal reaches a frenzied state. They begin to have multiple unwilling and continuous orgasms until the pain of their sexual release becomes unbearable. The two sadistic male handlers then toss the girls to floor and blow massive loads of jizz all over their faces.",
  "directors": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Cherry Kiss",
      "person_id": 60511
    },
    {
      "name": "Antonio Ross",
      "person_id": 33540
    },
    {
      "name": "Angel Rush",
      "person_id": 60703
    },
    {
      "name": "Lyen Parker",
      "person_id": 61051
    }
  ],
  "release_date": "2018-02-19",
  "scene_id": 42548,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Corporal Punishment",
    "Deepthroat",
    "Discipline",
    "Domination",
    "Female Slave",
    "Gag",
    "Humiliation",
    "Leather",
    "Pain",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "Spanking",
    "Straight",
    "Sub",
    "Submission",
    "toned",
    "Vaginal Penetration",
    "Voyeur",
    "Whipping",
    "white"
  ],
  "title": "Fresh Meat Angel Rush and Lyen Parker Humilated and Fucked in Public! "
}