{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Dolly Diore is a sexy long legged slender brunette from Budapest who normally is the dominant one in a scene but today she submits to Cherry Kiss and Steve Holmes in an all out public fuck-fest. Steve starts by getting his shoes shined outside on a public sidewalk by the lovely Dolly using only her mouth gag with a brush attached to it. After that, Steve and Cherry Kiss take Dolly to the crowded streets with her natural perky tits exposed to the public. They make their way to another crowded bar and a now fully naked Dolly Diore struts in and gets her ass slapped by multiple patrons. She stands bent over with her hands braced against a bench so Steve and Cherry can take turns flogging her ass. Steve wraps his hand around her neck and applies pressure as his other hand swats her pussy. Cherry takes a seat in the middle of the room and lifts up her dress with her legs spread and buries Dolly’s face in her pussy and Dolly gives Cherry a huge orgasm using only her tongue. Next, while Cherry recovers from cumming so hard, Steve and Ram whip out their cocks and while still on her knees, Dolly sucks them both. Cherry then shows them how a pro does it and slides Steve’s cock all the way down her throat. This turns on a customer so much that she stands in the middle of the room hypnotized, fingering her own pussy. Steve notices and gives her a hand and then she drops to her knees to suck him off. After that, Dolly stands bent over a booth and Steve shoves his fat cock into her pussy and pounds it deep and hard and Ram on the opposite side gets his dick sucked while a customer lets him play with her tits. Cherry puts a vibrator onto Dolly’s clit while she gets fucked sending Dolly into a mega orgasm leaving her body trembling.",
  "directors": [],
  "models": [
    {
      "name": "Angel Rush",
      "person_id": 60703
    },
    {
      "name": "Cherry Kiss",
      "person_id": 60511
    },
    {
      "name": "Dolly Diore",
      "person_id": 60704
    },
    {
      "name": "RAM",
      "person_id": 20259
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "release_date": "2018-03-19",
  "scene_id": 42549,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "Domination",
    "fake boobs",
    "Female Slave",
    "Fingering",
    "Flogging",
    "foreskin",
    "Gag",
    "Humiliation",
    "Latinx",
    "natural boobs",
    "other hair color",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Straight",
    "Sub",
    "Submission",
    "unshaved",
    "Vaginal Penetration",
    "Vibrator",
    "Voyeur",
    "white"
  ],
  "title": "Dolly Diore's All Out Public Fuckfest"
}