{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Cherry Kiss doesn't play nice. She blackmails her dear friend Isabella Clark when she finds compromising pics of her giving a blow job to someone that is not her husband. Isabella is given a choice between getting fucked in the ass by Cherry's sadistic friend or having her infidelity exposed to her husband. She fights at first but quickly concedes to the blackmailing and agrees to have her tight asshole stretched and gaped by a giant stiff cock. But before this female slave can get the dick that she craves she first must be dragged naked through the streets and humiliated in front of people in a public park. Cherry cuts all of her clothes and shackles her ankles and wrists together with police handcuffs. Isabella is then led down a public walkway by a dog leash lashed to her thin and fragile neck. She pleads with Cherry to hide her in the bushes as two horny men walk by, but Cherry just laughs and makes her disgrace herself in front of these lucky men. She continues to lead her through the streets until they find themselves at the bar where her blackmailing buddy is awaiting his piece of meat. A crowd of people in the bar salivate with depraved desire as soon as they lay their eyes onto Isabella's toned and perfect body. Cherry drags her over to a group of men that grab and fondle her big tits and spank her firm ass. Isabella hates being touched by these strangers and begs for them to stop. Cherry complies by introducing her to Steve's giant cock and jams it into her asshole. Isabella welps and orgasms immediately. Whatever reservations that Isabella had about fucking this stranger disappears once that dick is in her ass. Steve proceeds to fuck her into oblivion while a group of girls take turns holding a vibartor onto her swollen clit. Right as she cums, Cherry drags her to the ground and pee's all over giant titties. This sends Isabella into a frenzy and she jumps back onto Steve's dick and cums continuous multiple orgasms. As she gasps for air, choking on the summer heat and the giant hand that throtels her neck, Steve tosses her to floor and blows a giant load of cum all over her face and breasts. The crowd laughs and continues to humiliate this shameless whore.",
  "directors": [],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Cherry Kiss",
      "person_id": 60511
    },
    {
      "name": "Isabella Clark",
      "person_id": 43015
    }
  ],
  "release_date": "2017-12-25",
  "scene_id": 42546,
  "tags": [
    "anal",
    "bdsm",
    "big tits",
    "blonde",
    "blowjob",
    "choking",
    "Corporal Punishment",
    "discipline",
    "domination",
    "female slave",
    "humiliation",
    "multiple orgasms",
    "public",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Humiliated Whore Isabella Clark Disgraced and Anally Fucked in Public "
}