{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Rebecca Volpetti is an Italian, all-natural, petite, brunette, sex toy that is born to do one thing and one thing only: FUCK anyone and anything in her path. She comes dressed for the occasion wearing only a thin white knitted mini skirt that allows anyone to see her tiny panties and bra. She gets dragged around on her hands and knees as a cruel dom yanks the leash that is lashed to her black leather collar. Rebecca whimpers as she is chastised for failing to conform to the desires of her mistress but everyone watching her knows that this slut loves to be abused. The dom's blindfold Rebecca and then throw her into a public fountain. As the water drenches her dress they make her take off her panties and bra so everyone in the public plaza can see her natural small breasts and her teeny pink pussy. The mob of people point and laugh at the shamelessness of her exhibitionism. They yank her out of the fountain and then blindly lead Rebecca to a scenic bridge and coerce her to stumble with bare feet on a brutal walk of shame that leaves a crowd of hungry men salivating in the summer heat. Once the slut is warmed up, she is led to a local tavern where a giant gathering of beautiful women and horny men wait to devour her. They waste little time and tear off her dress leaving her smooth and flawless tanned skin exposed and vulnerable to their hands and abuse. One of the sex crazed men tears out his massive cock and shoves it deep down her throat until she chokes and gags. The crowd slaps and punches her body until it turns a tender shade of red. The other woman at the bar tear of their clothes and men begin to devour their tits as the women gorge on a feast of rock hard cocks. Rebecca is lost in the moment and each of her holes gets used like cum dumpters. She can't get enough and consumes every cock that comes near her. The men bend her over and indulge in double penetration. She squirms and cries out in a lustful agony as her pussy and tight asshole get stretched out from the double penetration. And when the orgy reaches a heightened climax the men blow massive loads of cum all over her face and tits. Rebecca slumps to the floor, licks every last drop of jizz, and begs for more.",
  "directors": [],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Antonio Ross",
      "person_id": 33540
    },
    {
      "name": "Cherry Kiss",
      "person_id": 60511
    },
    {
      "name": "Rebecca Volpetti",
      "person_id": 60698
    }
  ],
  "release_date": "2018-01-22",
  "scene_id": 42547,
  "tags": [
    "19 year old",
    "anal",
    "bdsm",
    "blindfold",
    "blowjob",
    "brunette",
    "collar",
    "Corporal Punishment",
    "discipline",
    "domination",
    "Double Penetration",
    "Feet",
    "female slave",
    "humiliation",
    "leather",
    "orgy",
    "Petite",
    "public",
    "rope bondage",
    "Rough Sex",
    "Smooth",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Teen Whore Rebecca Volpetti Beaten, Fucked, and Disgraced in Public!"
}