{
  "collections": [
    "Public Disgrace"
  ],
  "description": "19yo Anal Slut Vyvan Hill and Perky Brunette Dolly Diore are being paraded around Budapest today. They are made to strip down naked in public. Fully exposed to a vibrant and crowded public area. Vyvan Hill is a gorgeous blonde with natural big tits and shaved pussy. Her red lipstick perfectly matches her red high heels. The crowd goes wild for this young beauty. Dolly Diore is a brunette with a trimmed pussy and a perfect body for everyone to take in. These sluts are bound in leather neck collars and led by leash around town. The motorist almost get into accidents when they can't take their eyes off these stunners. The beautiful dominatrix Cherry Kiss leads these two to a very crowded and horny bar. The patrons can't wait to get in on the action. Right after they arrive the cocks come poppin out and their mouths get busy. Deep throat blowjobs for everyone. Both horny subs get busy on the cocks before switching over to some wet lesbian pussy licking. Bar patrons even get in on the action. One hot horny slut takes her top down and starts sucking off 2 cocks. Another strokes the biggest cock there and squeezes his balls tight. The two subs need more attention and are bound in beautiful restrictive rope bondage. This gets the crowd horny and the fucking begins. Each girl is fucked hard in the pussy and shake with orgasms tremors. Vyvan is an anal slut and begs for anal orgasm. The fat cocks punish her asshole and rip out squirting anal orgasm before her round ass is spanked red. The girls are like orgasm vibrators on the cocks. Finally these two are drenched in hot cum and eat it off each other.",
  "directors": [],
  "models": [
    {
      "name": "Chad Rockwell",
      "person_id": 59176
    },
    {
      "name": "Cherry Kiss",
      "person_id": 60511
    },
    {
      "name": "Dolly Diore",
      "person_id": 60704
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Vyvan Hill",
      "person_id": 61171
    }
  ],
  "release_date": "2018-05-14",
  "scene_id": 42552,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Big Tits",
    "blond",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Female Slave",
    "foreskin",
    "High Heels",
    "Humiliation",
    "Leather",
    "Lesbian",
    "natural boobs",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Sub",
    "Submission",
    "toned",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "Voyeur",
    "white"
  ],
  "title": "19yo Vyvan Hill & Dolly Diore Stripped Naked in Public & Fucked in Bar"
}