{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Luca Bella is a beautiful petite BDSM Slut. Her blonde hair and blue eyes may make this tiny beauty seem innocent but she has a deep anal craving. This slut wants to be taken hard and fucked deep in her tight holes. She loves brutal bondage and hard corporal punishment. Lucky for her Steve Holmes is here to take her out on the town. In a slutty dress, she is bound in leather cuff bondage and paraded around like a dog. This blonde bitch is shown off to the public, her shaved pussy and ass exposed. Her tits for everyone to view. Finally she is taken to a rowdy club and stripped fully naked. Her mouth hole is used first by huge cocks. The public even whips out their dicks! A dick on a stick is rammed down her throat until she gags hard. Luca needs to be restrained and luckily Cherry Kiss has the right person for this. Luca is tied up in tight restrictive rope bondage and her asshole is prepared for penetration. Cherry takes the dildo on a stick and rams it up Luca's tight asshole. It's not ready for Steve Holme's giant cock. He fucks that slut silly and she screams in orgasm. Cherry Kiss is getting turned on by all this ass fucking and she demands Steve service her anal hole as well. Steve obliges and deep fucks Cherry in her gorgeous asshole and she screams in pleasure. Later while Steve's cock is getting serviced by a beautiful blonde at the bar, het thinks it would be a good idea to shove two cocks in Luca Bella's ass. Steve and RAM get both their hard-ons in Luca's ass which is what they needed to explode huge thick cumshots all over this sluts gorgeous face.",
  "directors": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "RAM",
      "person_id": 20259
    },
    {
      "name": "Cherry Kiss",
      "person_id": 60511
    },
    {
      "name": "Luca Bella",
      "person_id": 61229
    }
  ],
  "release_date": "2018-04-30",
  "scene_id": 42550,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Dildo",
    "Discipline",
    "Domination",
    "Female Slave",
    "Humiliation",
    "Leather",
    "Petite",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Sub",
    "Submission",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Blonde Czech Slut Gets Fucked In The ASS In Budapest"
}