{
  "collections": [
    "Public Disgrace"
  ],
  "description": "With a ball gag shoved between her two beautiful big red lips, Vyvan Hill walks handcuffed alongside the Danube river, led by the lovely Cherry kiss and Chad Rockwell. She wears only a small white dress that has been pulled down exposing her firm natural tits, shaved pussy, and round ass. She parades down the stone walkway naked, as people pass them and stare. They make their way to the top of the Gellert Hill to a popular place with the best view of Budapest. There, Cherry and Chad take off Vyvan's dress, leaving her completely naked in front of all the tourists and take turns spanking her ass. Later they meet up with Steve Holmes in a bar and Vyvan gets on her knees to suck his cock. She wraps those big full lips around his big dick and deep throats his entire hog. She then gets bent over a bar and the customers all take turns spanking her ass with a flogger until her ass turns bright pink. Steve slides his cock into Vyvan's ass while he has her bent over and pounds it deep. They then lay Vyvan across four bar stools on her back with her legs spread and Chad comes in to fuck her ass while her legs get tied up in rope bondage. Chad disappears and Steve slides his cock into Vyvan's pussy while Cherry plays with her clit sending her into an orgasmic frenzy. He goes into Vyvan's ass next and pounds it until she cums hard. Cherry gets so turned on that she mounts Vyvan's face and gets her pussy licked while Steve fucks her ass from behind. Steve then lays on the floor and tells Vyvan to sit on his cock. She shoves Steve's cock in her ass and bounces up and down on it while strangers grab her tits and rub her pussy giving her one more big orgasm before getting a hot load in her face.",
  "directors": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    }
  ],
  "models": [
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Cherry Kiss",
      "person_id": 60511
    },
    {
      "name": "Vyvan Hill",
      "person_id": 61171
    },
    {
      "name": "Chad Rockwell",
      "person_id": 59176
    }
  ],
  "release_date": "2018-04-16",
  "scene_id": 42551,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Female Slave",
    "Gag",
    "Humiliation",
    "Public",
    "Public Disgrace's Best",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Spanking",
    "Straight",
    "Sub",
    "Submission",
    "top",
    "Vaginal Penetration",
    "Voyeur",
    "white"
  ],
  "title": "Sexy Serbian Submissive Anal Slut Vyvan Hill "
}