{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Angel Allwood always thought the good life would be sweet. No longer tied to her old life as an assassin for hire, she decided to get married to a rich man and retire to a life of leisure. Little did she know that nothing is as perfect as it seems. The blight on Angel's perfect little dream is her husband's 18 year old daughter Chloe Cherry. She is spoiled, sassy, entitled, and still lives at home. And, if there is one thing that Chloe can't stand it is being told what to do by her slutty step-mom. The simplest of requests for Chloe not to wear her ear phones in the house gets spit back into Angel's face from Chloe's bitchy little mouth. Chloe knows that there is nothing that Angel can do about it because she will always be daddy's perfect little girl. Shitty days always seem to get worse, and Angel's day has only just begun. After the spat with her bratty step-daughter the doorbell rings and her old assassin boss bursts through the door and back into Angel's life. She begs him to leave her new family alone and to respect her decision to get out of \"the game.\" But John Strong doesn't play by those kinds of rules and with a hand of her throat he reminds Angel that there is no \"getting out.\" In a desperate attempt to appease him from potentially causing harm to her new family she follows his instructions. He makes her strip and then handcuffs her wrists to keep her restrained. Jamming his stiff cock down her throat, she pleads with him to stop, but he makes her gag over and over. Tired of her back talking, John duct tapes her mouth shut and starts to fuck her tiny pink pussy and her tight asshole back and forth with reckless abandon. After John has had his fill, he makes Angel clean his cock off and notices step-daughter Chloe cluelessly lounging outside in the sun. His appetite quickly grows and he informs Angel that he is going to teach Chloe some much needed respect. He drags Angel to the kitchen and takes Chloe by surprise. Chloe quickly realizes that she is out of control as John tackles her to the ground, strips off her slutty hot-pants, and then scrubs her mouth out with soap. Before she can catch her breath, John thrusts his huge rod into her mouth and teaches the incorrigible bitch how to deep-throat. He then tests Chloe's little cunt and her pristine asshole to see if she is as pleasurable as her step-mom. To keep the neighbors from hearing the sound of their screams he drags them into the basement, ties them up in tight rope bondage, and stuffs their mouths with huge red ball gags, so he can further discipline his unwilling captives. First order must be established, and he has Angel teach her step-daughter the sacred rules of submission: Honorific, Eyeline, and Deportment. The girls quickly learn their place and cower at the feet of their stern and dominant man. After relentlessly punishing the smooth white skin of his slaves with hot wax and a black leather flogger, John then puts his whore submissive's on their knees. They beg their master to shower their unworthy whore holes with a hot load of his cum. John then shoots a massive wad all over their faces and makes them lick each other clean. Submissive slut Chloe Cherry and her whore step-mom Angel Allwood get tied up in rope bondage, ass fucked by a huge cock. and learn the rules of discipline!!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Angel Allwood",
      "person_id": 52348
    },
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "John Strong",
      "person_id": 17050
    }
  ],
  "release_date": "2017-08-22",
  "scene_id": 42567,
  "tags": [
    "18 year old",
    "anal",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "Deepthroat",
    "discipline",
    "Eighteen and...",
    "Feet",
    "female slave",
    "gag",
    "hot wax",
    "humiliation",
    "leather",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "Rough Sex",
    "Smooth",
    "straight",
    "submission",
    "Wax Play"
  ],
  "title": "A Mother's Job is Never Done: Anal Assassin Trains Her Step-Daughter "
}