{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Cherry Torn is without a doubt the most prolific and experienced Kink.com model of all time. She has done and seen it all but her love of fetish and BDSM seems to only grow in intensity and raw lust as the years go by. She is the kind of curvy lady that needs to be fucked senseless morning, noon, and night. Most men cannot even begin to satiate her sexual appetite so when she wants to be fucked for for real she knows that only one place in world can deliver the multiple orgasms that she craves: FuckingMachines.com. She wastes little time and strips out of her skimpy lingerie and reveals a well trimmed bush. Her tiny pink pussy peeks through the sides of her panties as she begins to play with her whore hole, first with her fingers and then with a hitachi. As the vibrator warms her up, the pussy juice begin to soak through the fabric of her panties. She smiles as her body shakes from the first orgasm of the day. Once warmed up, she just lays back and lets the first machine take her. As the massive dildo slides into her warm and wet pussy she trembles and smiles the coy grin of a greedy slut who wants it all. The machine starts of slowly, sliding gently in and out dragging the evidence of her creamy cum juices along to show the whole world just how turned on she is. Quickly the speed escalates and the machine pounds her pussy, slamming her like no man could possibly ever dream of doing. She keeps cumming over and over again until she is screaming for joy. Every time she peaks she immediately grinds her hips and goes deeper into the waves of non-stop orgasms. In a fever, she flips over onto her knees and lets the machine fuck her doggie style from behind. She pushes back and almost seizes the machines motor has her powerful pussy muscles clamp down and suck the the huge dildo deeper into her hungry cunt. The sweat glistens off her big natural tits and her divine ass quivers with delight as the relentless machine continues its sexual onslaught. And in one last explosion of sexual energy, Cherry screams and pushes the machine clear across the room and collapsed backwards into a hot sweaty heap of breathless exhaustion. Cherry’s sexual greed is satisfied, but as the camera fades her smile reveals that this satisfaction will only be very brief…very brief.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    }
  ],
  "release_date": "2017-11-08",
  "scene_id": 42570,
  "tags": [
    "BDSM",
    "Big Natural Tits",
    "Bush",
    "Curvy",
    "Dildo",
    "Fetish",
    "Hitachi",
    "Lingerie",
    "Machine Dildo",
    "multiple orgasms",
    "natural boobs",
    "other hair color",
    "shaved",
    "slim",
    "Straight",
    "Tattoo",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Fetish Queen Cherry Torn Fucked with Huge Dildos and Multiple Orgasms"
}