{
  "collections": [
    "Hogtied"
  ],
  "description": "She is back. Kink.com legend Cherry Torn returns to submit to sadist extraordinaire The Pope. A female slave such as Cherry doesn't need much of a warm up, so The Pope wastes no time and digs into his captive masochistic whore right away. With severe and painful clover clamps attached to her nipples, The Pope begins to smack her tits, feet, and ass with a stiff leather riding crop. Cherry is a pain slut and even as she shrieks from the searing pain, her pussy grows wet and excited from the impact play. The corporal punishment builds as The Pope torments her tits and yanks the clamps from her nipples. As the pain courses through her body, The Pope crams a hitachi onto her swollen and sensitive clit sending her into a frenzy of involuntary orgasms. As she is cumming the first of her multiple orgasms the sadist clamps his massive hands over her throat and chokes as her body trembles from cumming. Before she can catch her breath, Cherry is suspended in the middle of the room with only one knee perched on a small sliver of wood. The Pope ties her tits via clover clamps to a post on the other side of the room and relishes in her pain as he adds weights to the nipples clamps. He digs into her feet with the sharp end of a metal spike and torments her tender soles without mercy. As she hyperventilates from the pain The Pope stuffs her tiny pink pussy with a giant dildo which makes her quiver with delight. As her g-spot gets stimulated, she begs to cum but this only makes The Pope laugh because he relishes orgasm denial. He relentlessly pounds her cunt with the dildo and finally lets her cum until the pain of multiple orgasms becomes completely overwhelming and transcendental. Next she is tied standing straight up to a pole. The Pope loves predicament bondage and ties a crotch rope to her sensitive pussy and dangles two heavy bowling balls from the other end. This makes Cherry thrust her pelvis forward to try and relieve the pain of the pussy rope that is bisecting her tender and swollen clit. Just when she relaxes and surrenders to the bondage, The Pope jams a vibrator onto the rope that is running directly over her clit. She screams from the pain and begs for mercy. And The Pope is only too willing and makes her cum unwillingly from the intense pain that becomes pleasure. To finish her day, Cherry lays back and allows her legs to be tied and pulled out to the side with tight and restrictive rope bondage. The Pope switches back and forth between whipping her cunt with a leather flogger and stimulating her clit with a hitachi. As the pleasure and pain mounts, Cherry looses herself in the experience as orgasm after orgasm is ripped from her unwilling, squirting pussy.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-12-07",
  "scene_id": 42571,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Crotch Rope",
    "Dildo",
    "Domination",
    "Feet",
    "Female Slave",
    "Fingering",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "multiple orgasms",
    "Orgasm Denial",
    "Pain",
    "Pain Slut",
    "Predicament Bondage",
    "Rope Bondage",
    "Slave",
    "Squirting",
    "Straight",
    "Submission",
    "The Pope",
    "Vaginal Penetration",
    "Vibrator",
    "Weights",
    "Whipping"
  ],
  "title": "Bound Slave Cherry Torn Tormented in Rope Bondage and Multiple Orgasms"
}