{
  "collections": [
    "Device Bondage"
  ],
  "description": "Cheyenne Jewel is no stranger to Device Bondage's sinister dungeon. She is the kind of woman that likes to be in charge and demands the respect of the men in her life. But secretly she harbors other devious needs. She needs to suffer to feel complete. She craves for the chance to serve at the pleasure of a real man and to feel his giant hands grope every inch of her body. She sits helplessly on chair dressed only in lingerie and awaits her punishment. The Pope sneaks behind her and blindfolds her with a rough piece of burlap. She screams in terror and trembles as she pleads The Pope for mercy. But the only mercy dispensed in the dungeon is cruel treatment and humiliating words. The Pope attacks her hands with sharp barb of metal and inflicts ceaseless pain to her perfectly manicured hands. Drool leaks from the edges of the giant mouth gag and oozes down her chest, pooling at the base of her creamy pussy. She says \"no\" but with each thud of the impact play her tight pink pussy grows ever wetter with a debased desire to be abused and punished. She tries to move her hands out of the way of The Pope's wicked whacks but the tight and restrictive metal bondage makes it impossible for her to move sensitive digits out of harm's way. As she is hyperventilating from the extreme pain The Pope jams a hitachi onto her swollen clit. As the vibrator lulls her into a false sense of security the sadistic dom pokes her with a cattle prod and ruins her orgasm. She will eventually have pleasure but first she will be tormented with orgasm denial. Now that she is warmed up, The Pope shoves her into a missionary position with her legs frog tied with leather belts and chains. He attacks her shins, mercilessly hitting them with a heavy cane. The dull thud of wood on bone echos through the dungeon as she hollers in pain. After working all the nooks and crannies of her ankles and feet, The Pope takes a massive dildo and jams it into her hungry pussy. She is so turned on by the abuse that her pussy glistens with creamy juices. Before she can catch her breath The Pope then flips her onto her stomach and begins to spank her firm and perfect ass. A heavy flogger and his giant hands aren't enough to satiate his depraved desires. He wants to hear her plead for mercy so he whips her behind with a long and severe cat-o-nine-tails. It stings her flesh like a swarm of relentless bee's punishing a fool for attempting to steal their sweet treasures. Not satisfied with simply beating her ass he decides to show her the meaning of restraint by probing her tight asshole with mean ass hook that he ties securely to her neck and hair. He then proceeds to rip painful multiple and continuous orgasms for unwilling pussy. She screams and her whole body trembles and quivers from the relentless clitoral stimulation. And like all dangerous animals, The Pope eventually grows tired of toying with his helpless plaything. He leaves her drenched in sweat and steals off into the night to find his next unsuspecting victim.",
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-11-02",
  "scene_id": 42579,
  "tags": [
    "ass hook",
    "athletic",
    "bdsm",
    "bondage",
    "cattle prod",
    "chains",
    "Corporal Punishment",
    "dildo",
    "domination",
    "drool",
    "dungeon",
    "Feet",
    "Fingering",
    "gag",
    "Handler",
    "Hitachi",
    "humiliation",
    "leather",
    "lingerie",
    "metal bondage",
    "multiple orgasms",
    "orgasm denial",
    "pain",
    "straight",
    "submission",
    "The Pope",
    "vibrator"
  ],
  "title": "Cheyenne Jewel Punished with Unwilling Orgasms and Mean Metal Bondage!"
}