{
  "collections": [
    "Device Bondage"
  ],
  "description": "She's back. Cherry Torn, the crown jewel of Kink.com's bondage and fetish culture, returns to serve under the sadistic boot heel of The Pope. She dives in head first and is quickly inverted in a full suspension by only her ankles. The rough leather straps shackled to her shins dig into her flesh making the slightest of movements a lesson in primal misery. But a girl like Cherry relishes the pain. The sensations of discomfort shoot through her nervous system and make her tight pink pussy wet with joy. The Pope shackles her wrists together with heavy metal chains making her predicament inescapable. Cherry shrieks with terror as The Pope punches her big natural tits and her firm curvy ass. She tenses her stomach muscles as The Pope torments her abdomen with clenched fists and a heavy flogger. She begs to cum as her throat is choked and her breath is restricted by his giant hands. But The Pope isn't ready for his pain slut to cum, and grins from the joy of her orgasm denial. Cherry pouts from the humiliation of being a slave and not being allowed to do anything besides what her dom wants her to do. Next she is bent backwards resting only on her knees. The searing pain of being stretched out is punctuated by The Popes brutal corporal punishment that he unleashes on the front of her body. The sting of a thick cane on her sensitive tits and nipples makes her cry out and beg for mercy. The Pope only laughs and stifles her plea's by gagging her throat with a massive dildo. Once it is wet he jams the dildo into her greedy cunt and coerces Cherry to her first of many involuntary orgasms. She begs to cum as her body quivers with a rush of endorphins and adrenaline. But just before she explodes a giant orgasm The Pope denies her the pleasure that she so greedily needs. Lastly the female slave is bent over a wooden post with her ass propped up in the air held in place by thick leather belts. The Pope ruthlessly attacks her and torments her vulnerable and exposed ass with a heavy leather flogger. Each thud excites Cherry until she reaches a frenzied state and her whore hole drips with desire. The Pope then reaches his giant man hands into her pussy and uses his fingers and a vibrator to stimulate her into a transcendental state of bliss. Cherry begs to cum and finally when The Pope has grown tired of his masochistic piece of meat he lets her cum once last time before leaving her whimpering in pits of his dungeon until he wants to toy with his plaything again.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-11-16",
  "scene_id": 42573,
  "tags": [
    "BDSM",
    "big dick",
    "Big Natural Tits",
    "Bondage",
    "Boot",
    "brunet",
    "Brunette",
    "Chains",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Domination",
    "dungeon",
    "Female Slave",
    "Fetish",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pain",
    "Pain Slut",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "Tattoo",
    "The Pope",
    "Vibrator",
    "white"
  ],
  "title": "Female Slave Cherry Torn Tormented in Metal Bondage and Coerced Orgasm"
}