{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Three days caged and captive in Veruca James’ divine dungeon and Ruckus can’t hold back his baser desires any longer. He looks around and slowly beings to masturbate. But slaves don’t get away with anything in Veruca’s lair! Veruca catches him almost sticky-handed and decides this selfish whore needs a lesson. Veruca shocks Ruckus all over with the zapper. He squirms in his cage as he futilely struggles to avoid getting zapped. Next Veruca crops him all over his body, paying special attention to his vulnerable balls. Then she brings out the cane and canes both his feet and legs. She places a mousetrap on his penis and clover clamps on his sensitive hard nipples. Ruckus’ face twists in pain as he takes his punishment from his Mistress. Next, it’s time for a game of hide and seek as Ruckus is gagged and tied with one leg up in the air. Veruca clover clamps his balls before hiding her fat cock in his tight asshole. Ruckus loves when his Mistress fucks him in the ass, and can’t stop moaning. After she’s done with his ass, she hides his face under her own juicy glorious ass, smothering him as he tries to breathe. Finally, Ruckus hangs upside down in an inverted suspension. Veruca flogs his body before letting him worship her pussy and her ass. Ruckus must prove himself and gets to work burying his face in Veruca’s ass. After she cums, she brings him down to the floor so she can watch this filthy slut cum all over himself. Obviously, Ruckus doesn’t get to cum first. Veruca masturbates over him and instructs him in how to jerk off and touch his cock and balls. After she cums multiple times, Ruckus is finally allowed the pleasure of cumming. Ruckus blows a fat load of cum all over himself and Veruca makes him clean up his mess. Ruckus is made to eat some of his cum, before Veruca rubs the remainder all over his face.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ruckus",
      "person_id": 48209
    },
    {
      "name": "Veruca James",
      "person_id": 43570
    }
  ],
  "release_date": "2017-09-29",
  "scene_id": 42585,
  "tags": [
    "Athletic",
    "BDSM",
    "black hair",
    "Bondage",
    "brunet",
    "Cage",
    "CBT",
    "Clover Clamps",
    "Corporal Punishment",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Foot Torment",
    "Hand Gagging",
    "Humiliation",
    "Male Sub",
    "mousetrap",
    "natural boobs",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Smothering",
    "Straight",
    "Suspension",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white",
    "Zapper"
  ],
  "title": "Disobedient Masturbating Slave Punished and Fucked with a Fat Cock"
}