{
  "collections": [
    "Divine Bitches"
  ],
  "description": "The sexy and sadistic Cherie DeVille steps in as DJ's obsessively attentive nurse, and she's a little too eager to help him overcome his problems in the most extreme ways. She starts by binding him to a suspended metal contraption in a crucifix position, with his hands far away from his body so he can't interfere with her treatments. To focus his attention she puts 3 strong medical clamps on his balls, then teases him with pleasure, and punishes him verbally and physically when he reacts to it. She puts his big cock in her mouth and sucks it, then punishes him for getting hard. It's a no-win situation for DJ, who is repeatedly reprimanded and cropped for his total lack of self control. After exhausting this position (and her patient), Cherie puts DJ flat on his back with his legs up, held apart by a suspended leg spreader. She's now ready to test his pain response by rolling a sharp, spike wheel over his most sensitive areas. She torments his nipples, his cockhead and his puckered hole, all while demanding that he hold in his screams and only tell her if he CAN'T feel anything. Satisfied with his response (or lack thereof), Cherie moves on to the anal examination, fingering DJ's hole before sliding her hard black probe into his ass and pegging him. But DJ's enjoying it too much, and Nurse Cherie starts to think he's treating her like a whore, and not the finely trained medical professional she is. So she lets loose with the punishment, fucking him hard and deep, commanding him to respect her. Finally, DJ is strapped into belt restraints, while Cherie uses his body for her own pleasure. The lesson here is to know who's the authority, who has the knowledge to \"make it all better\" and to obey. Cherie rides DJ's cock until she cums, using him for what he's worth now that he's far enough into his treatment. She makes him cum, but she counters that pleasure with a little pain by smacking his cock as he's cumming. Finished, Cherie leaves him a beaten, berated, and infinitely better man.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "DJ",
      "person_id": 20225
    }
  ],
  "release_date": "2017-10-27",
  "scene_id": 42584,
  "tags": [
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Hairy",
    "Handjob",
    "Humiliation",
    "Male Sub",
    "muscular",
    "Nurse",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Nurse Cherie DeVille Inflicts Sadistic Medical Malpractice on DJ"
}