{
  "collections": [
    "Men On Edge"
  ],
  "description": "Huge muscle stud Draven Navarro is new to Kinkmen, but he’s ready to take it on, and his excitement is matched only by his desperation to shoot his boiling load! Sebastian Keys and Chance Summerlin work his cock and his ass, edging him repeatedly until he just can’t take it anymore. Sebastian starts by tying Draven up and blindfolding him so he can’t see what’s going on and he can’t move to get away from it. Sebastian frees him from his jock, so Draven’s big beatiful cock can get hard. Sebastian teases him, then brings Chance in on the game. Chance is also blindfolded, so all he can feel is Draven’s thick wet cock sliding in his throat, pulsing as Sebastian controls them both. Draven endures a lot of deep cocksucking as he’s repeatedly denied the right to cum. He’s later tied up even tighter, and though the blindfold is removed, he’s now got a ball gag in his mouth, so his own spit falls on his cock, making it even slicker. Sebastian and Chance work his cock and hole. Sebastian slides a dick on a stick into his ass while Chance continues to suck him. The intensity is palpable as Draven is driven to the edge and pulled back repeatedly. Finally, after fucking Chance’s feet, he’s allowed to cum. Draven shoots his thick hot load all over Chance’s toes as he roars with orgasmic thrill… A moment well worth waiting for!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Draven Navarro",
      "person_id": 59640
    }
  ],
  "release_date": "2017-09-12",
  "scene_id": 42588,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Ball Gag",
    "BDSM",
    "Blindfold",
    "Blowjob",
    "body builder",
    "Bondage",
    "bottom",
    "brunet",
    "Cage",
    "Corporal Punishment",
    "Deprivation",
    "Dildo",
    "Domination",
    "Edging",
    "Feet",
    "Foot Worship",
    "Gag",
    "Gay",
    "Handjob",
    "Humiliation",
    "jock",
    "Jockstrap",
    "Kinky",
    "Male Handler",
    "Male Sub",
    "master",
    "mixed",
    "Muscle",
    "Oral Sex",
    "Orgasm Denial",
    "Prostate Stimulation",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "Tattoo",
    "Threesome",
    "Tickling"
  ],
  "title": "Muscle Stud Draven Navarro Gets His Big Cock Sucked and Edged"
}