{
  "collections": [
    "Divine Bitches"
  ],
  "description": "The stunning goddess Chanel Preston is head of the Divine Investments Firm. This beautiful busty brunette demands your worship and attention. Dressed for business in her short skirt, stocking and high heels, this femdom mistress commands authority in her business. Today is a very special day though, it has come to her attention a pathetic worker Reed Jameson, a lead investor she has spent hard time training up, has been caught skimming. Tied up tight to a chair in rope bondage in the company basement, it's time for him to pay back every penny. Still in his business suit, his pathetic cock hangs out ready for punishment. There is nothing this loser thief can say now to save his sorry ass. Chanel stuffs his mouth shut with a red ball gag to muffle his screams from the painful clover clamps on his nipples. It's a good thing they are in the basement, because this pain slave gets a corporal punishment beating with the cane next before the flogger comes out. His thighs turn bright red before Chanel changes her focus to his sensitive cock and balls. Using her high heels she squashes that pathetic phallus as Reed squirms in pain. Chanel takes a bucket of clamps and slowly clips each one onto his sack. The pain gets Reed rock hard before Chanel takes her stocking foot and applies hard pressure to his most sensitive balls. Finally ripping each clamp off brings huge screams as she laughs in his face. And Chanel is just beginning. Tied up again in rope bondage, stripped naked, Reed is ready to pay everything back with his ass. With a big black strap-on Chanel pounds his horny hole. This deep anal causes Reed to scream even louder before she pulls out and shoves that cock in his mouth. Tied up once again with his hard cock out, it's time for Chanel to take what she wants. Pussy licking, smothering, hard fucking, and foot worshipping brings this femdom mistress pleasure.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Reed Jameson",
      "person_id": 52382
    }
  ],
  "release_date": "2017-09-01",
  "scene_id": 42583,
  "tags": [
    "Anal",
    "Ball Gag",
    "Bareback",
    "BDSM",
    "Bondage",
    "Brunette",
    "Caning",
    "CBT",
    "Clover Clamps",
    "Corporal Punishment",
    "Couple",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fetish",
    "Fingering",
    "Flogging",
    "Gag",
    "High Heels",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Male Sub",
    "Oral Sex",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Sadism",
    "Slapping",
    "Slave",
    "Smothering",
    "Straight",
    "Vibrator",
    "Yes, Mistress"
  ],
  "title": "Chanel Preston Takes Payment From Reed Jameson in Painful Installments"
}