{
  "collections": [
    "Fucking Machines"
  ],
  "description": "It has been far too long since the long smooth legs and slender majestic frame of Lilith Luxe received the multiple, non-stop orgasms that only fucking machines can deliver. She loves to show off for the camera and starts her day slowly peeling back the hem of her tight skirt. She teases her swollen clit with the a hitachi and starts to warm herself up for the hard fucking she is about to receive. She fingers her tiny pink pussy and reveals how wet she is. Don't let Lilith's cute, quiet, and innocent demeanor fool you. She is filthy whore who wants nothing more that be fucked all day long. Her hunger is bottomless and she attacks the first machine bent over with her luscious legs extended. The machine starts off slowly and gently slides in and out of her teeny cunt. But this dirty little girl is eager to please and begins to plead for the machine to go faster. Her body begins to quiver and sweat pools in the small of her back. She smiles deviously knowing that the whole world is watching as she exposes her nasty little secrets. She spanks her perfect round butt and fingers her tight asshole which drives her into a fever that only relents after she explodes a gigantic orgasm for the non-stop vaginal penetration. Now that she is warmed up, she spreads her legs wide open and lets the fucking machine double penetrate both of hungry whore holes. As soon as the engines begin to churn her smile glistens with delight. This is just what she needed. No man could satisfy her like this. The machines pound her until she collapses to the floor in a heap of pussy juices, sweat, and drool. But this is when our shy submissive female slave is the most beautiful. Despite her exhaustion she quickly recovers and is hungry for more. Her desire for pleasure is bottomless and she begs to be strapped onto a sybian. She sits back and plays with controls testing the limits of the machine. Once she understands the nuances of the sybian she quickly turns it on full throttle and screams in delight. Her teeth chatter and the machine shakes her to depths of her depraved desire. She grinds her swollen and engorged clit onto the top of the machine until she jumps into the air and collapses to the floor. She lays back and curls herself into a ball like sex kitten that has worked itself into a heated hot mess from playing with its pussy all day long.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lilith Luxe",
      "person_id": 55114
    }
  ],
  "release_date": "2017-11-22",
  "scene_id": 42580,
  "tags": [
    "Anal",
    "drool",
    "Female Slave",
    "Hitachi",
    "Machine Dildo",
    "shaved",
    "Slave",
    "smooth",
    "Straight",
    "Sybian",
    "top",
    "Vaginal Penetration"
  ],
  "title": "Good Girl Next Door Lilith Luxe Double Penetrated by Fucking Machines!"
}