{
  "collections": [
    "Bound Gods"
  ],
  "description": "It's a slow night at the bar and cute bartender Connor Patricks only has one patron to serve, the handsome Dirk Caber. It's Dirk's first time in Vegas and he's not opposed to making a couple bets. Once Dirk convinces Connor to play a round of strip pool, Dirk knows he's in for a fun night in the City of Sin! Dirk easily sinks his balls, costing Connor his shirt and belt. When it comes time to take off his pants, Connor tries to back out. But Dirk isn't having it. He manhandles Connor, ignoring his protests, and feels him up, not in the least bit surprised to find that Connor has a huge boner. Dirk puts Connor in a blindfold, collar, and cuffs. Connor struggles, blind and bound, against Dirk's hard body, but he's no match for the older man. Dirk bends Connor over the pool table and gives him a good spanking. Connor continues to struggle as Dirk brings out the zapper and zaps Connor all over his tender ass. Connor is a tough pain slut and Dirk enjoys watching him struggle. When Dirk moves to zap Connor's tongue, Connor gives in and calls Dirk what he's been secretly wanting to all night - Daddy. Dirk grins and rewards Connor with his fat cock. Next Connor is bound laying on the floor of his own bar. Dirk loves beating his boy, and flogs Connor all over his butt and back. Dirk eats Connor's ass as Connor struggles in bondage. Dirk sucks Connor's cock too, before fucking Connor's face. Finally, Connor is covered with weighted clamps. Dirk fucks his boy hard as Connor sits astride him. Connor begs for a good hard pounding from his Daddy's dick, and Dirk gives it to him. Once Connor is lost in pleasure, Dirk starts removing the clamps. Connor yells in pain as they come off and Dirk plays with the red sensitive skin now absent of clamps. Then Dirk bends Connor over the pool table for a good hard final fucking. Connor loves being rammed by his Daddy's big hard cock. When Dirk is ready to come, he pushes Connor to the floor and jerks off all over Connor's face. Connor eagerly cleans off his Daddy's cock. Connor's own balls are full of come and he shoots his fat load as his Daddy jerks him off.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Connor Patricks",
      "person_id": 47357
    },
    {
      "name": "Dirk Caber",
      "person_id": 27341
    }
  ],
  "release_date": "2017-09-07",
  "scene_id": 42589,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Couple",
    "Domination",
    "Facefucking",
    "Facial",
    "Flogging",
    "Gag",
    "Gay",
    "Handjob",
    "Humiliation",
    "Kinky",
    "Male Sub",
    "master",
    "Metal Bondage",
    "Older/Younger",
    "Pain",
    "Pain Slut",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Shackle",
    "Spanking",
    "Submission",
    "Weights",
    "Zapper"
  ],
  "title": "Hungry Daddy Fucks Younger Muscled Pain Slut"
}