{
  "collections": [
    "Device Bondage"
  ],
  "description": "Some women are born to please. They live simply to do serve at the pleasure of strong and forceful men. Lilith Luxe is just that sort of girl. She is a female sex slave that wants nothing more than to please her male dom's and handlers. The Pope wastes no time and quickly lashes his captive slut to some severe metal bondage with leather belts and straps. With her neck choked into an erect position with a metal posture collar, The Pope meticulously shaves all the hair off of Lilith's head with an electric razor. She whimpers in shame as the beautiful hair that she covets is stripped from her precious head. With her scalp raw and sensitive from the shaving, The Pope then drips hot wax all over it which makes Lilith cry out from the searing pain. With nasty clover clamps and heavy weights dangling from her cunt lips, The Pope jams a hitachi onto her greedy pussy and coerces the first of many multiple, unwilling orgasms from her whore hole. She cries from the pain and humiliation of the experience, but her wet pussy doesn't lie; she loves the attention and the validation. Next Lilith is strapped to a sybian with her legs and arms pulled straight down and bound with heavy metal chains. The Pope slowly and carefully adorns her all natural and athletic body with a thousand clothespins that he links together into one giant zipper. He weights the free end of the zipper with a heavy bowling ball and shoves the other end into Lilith's whimpering mouth. The only thing keeping this predicament bondage from ripping the zipper off of her taut and tender skin is the grip of her teeth. But as the sybian gets cranked to full blast, her clench loosens more and more as she fights to keep from orgasming. When she can't hold it in for a second longer The Pope ends her orgasm denial and allows her to cum. As soon as she lets the pleasure take hold, her grip on the bowling ball releases and the zipper is torn from her body. She screams from the intense pain and relishes the ecstasy that her swollen and sensitive clit delivers to every corner of her body. But this only makes her hungry for more. The Pope tosses her onto her back and binds her legs wide open with leather belts. He tenderizes her body with a heavy leather flogger and her chest begins to shine bright red from the abuse of the impact play. The Pope then uses a speculum to spread her tight pink pussy open so he can examine the inner regions of her soul. He prods her cervix with a blunt stick which instantly takes Lilith to a dark place. She is completely vulnerable and exposed to his malicious clinical examination for her cunt. The lack of control causes her to weep and beg her sadistic master to end her torment. But her cries for mercy only enrage The Popes blackened heart and he continues to torment his captive slut. As her body spasms and fights against the inescapable bondage, The Pope shoves a vibrator onto Lilith's pussy and rips one last mind numbing orgasm from her unwilling cunt. The Pope laughs, walks away, and leaves Lilith to rot in his dungeon.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lilith Luxe",
      "person_id": 55114
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-12-14",
  "scene_id": 42582,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "Chains",
    "Clothespins",
    "Clover Clamps",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Fingering",
    "Handler",
    "Head Shaving",
    "Hitachi",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "master",
    "Metal Bondage",
    "Orgasm Denial",
    "Pain",
    "Predicament Bondage",
    "shaved",
    "Slave",
    "Speculum",
    "Straight",
    "Submission",
    "Sybian",
    "The Pope",
    "Vibrator",
    "Weights",
    "Zipper"
  ],
  "title": "Sex Slave Lilith Luxe Humiliated with Head Shaving and Coerced Orgasms"
}