{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "Cock hungry Kira Noir throws herself at a group of warehouse employees with reckless abandon. She has been wandering the street at dusk with a mission - to find dick and fuck it. She gets what she was after! After a blow bang, multiple cocks at one, Gang Bang and multiple cum shots to her face, Kira's fantasy is finally fulfilled. At dusk, Kira wanders the streets of downtown in search of anonymous male sex partners. She's tired of being a good girl. She craves the thrill of stranger sex. The more men she can find, the better. No strings, no attachment, she doesn't even want to know their names. One evening she comes upon a group of studs, on their way to a warehouse job. She just can't resist following them to work and seducing them in a filthy warehouse. She swallows each fat cock during a Blow bang to start off. Each guy takes turns fucking her mouth before they pull her onto a couch to penetrate her eager pussy. They slap her tight body as she rides cock while sucking and keeping the rest of the studs excited with her hands. The men toss her around like a fuck doll and while they share her ass and DP her in as many combos as they can get! Kira is so hungry for cum and gets all the men to cum on her face, loading it up with as much as she can take. She got exactly what she came here for!",
  "directors": [],
  "models": [
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Nathan Bronson",
      "person_id": 58786
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Jake Adams",
      "person_id": 60459
    },
    {
      "name": "Jay Savage ",
      "person_id": 60460
    }
  ],
  "release_date": "2017-08-23",
  "scene_id": 42597,
  "tags": [
    "anal",
    "bdsm",
    "Blow Bang",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "Double Penetration",
    "gangbang",
    "role play",
    "Rough Sex",
    "straight"
  ],
  "title": "Debauchery: Cock Hungry Beauty Kira Noir Gang Banged by horny studs"
}