{
  "collections": [
    "Bound Gods"
  ],
  "description": "In this first installment of a 3-part series, \"Deep Woods Domination\", the always dominating Christian Wilde and the thick, muscled Jonah Fontana are perverts on the run. They're driving from town to town, dominating one man after another, having their way and moving on. It's been a hot, exciting time, but Jonah is starting to have second thoughts. After helping Christian subdue their latest conquest, he hesitates, then admits he can't do it anymore. But Christian is adamant that they continue. He takes Jonah down and makes his former partner his bitch. He drives Jonah out to the woods, where no one can hear him scream, and ties him to a fallen tree. Jonah will submit or else, and Christian spares no punishment. He flogs his chest and tight ass, demanding his submission. He pushes his face down to his rock hard cock and makes Jonah suck it good and sloppy. Christian is totally in control as Jonah takes what he's given and endures the punishment for his disobedience. He later ties Jonah to a tall tree, stark naked on a mountain path. Lit candles are tied into the bondage and drip hot wax on Jonah's naked, muscled body. His screams echo into the woods, but no one hears him. No one comes to his aid. He's Christian's toy to be punished and fucked at will. And fuck him he does. After sucking Jonah's cock and smacking the hot wax to intensify the burn, Christian gets behind Jonah and pushes his big thick cock into his ass. Jonah's in the perfect position to get slammed, partially bent over with his ass sticking out. Christian delights in ramming his hard cock deep inside, demanding that Jonah submit completely to him. When it's done, and Christian shoots his hot load, Jonah takes his cock back into his mouth to clean him off. It's then Jonah's turn to get off and he cums in thick hot ropes all over the forest path.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Jonah Fontana",
      "person_id": 59550
    }
  ],
  "release_date": "2017-09-21",
  "scene_id": 42591,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Deep Woods Domination",
    "Domination",
    "Gay",
    "Hairy",
    "Hot Wax",
    "Humiliation",
    "Latin",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Deep Woods Domination: Chapter 1"
}