{
  "collections": [
    "Bound Gods"
  ],
  "description": "In this second chapter of a 3-part series, \"Deep Woods Domination\", Tristan Jaxx is on a camping trip with his stepson Jackson Fillmore. During a brisk walk they discuss the recent disappearances of hikers from the nearby woods. But it's only a fleeting thought, because Tristan actually has his eye on Jackson's smooth, fuckable ass. After a night in the tent, they awake to find Tristan's other son still has not returned from his own outing the night before, leaving Tristan and Jackson to their own devices. Tristan knows that Jackson's had his eye on him, so in the calm of the morning he decides this is the right time to take him down. Tristan can't help but reach for his stepson's smooth perfect ass, then ties him up with his shirt as he wakes. He feeds Jackson his huge hard cock, giving his exactly what he's secretly wanted all along. Jackson chokes on Tristan's giant dick, but takes it down his throat as he's told. Later, Tristan binds Jackson to a fallen tree with plastic wrap, and proceeds to suck his cock and flog him, all while sliding his own cock into his stepson's hungry throat. Finally, Jackson is suspended between a couple trees while Jackson primes his sweet hole for fucking. He sucks his cock and eats his ass, then lets him down so he's in just the right spot to get his ass pounded. Tristan pumps his huge dick into him as Jackson's screams echo into the woods. The two of them fuck and suck in the great outdoors, until they both blow their loads all over each other.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jackson Fillmore",
      "person_id": 56833
    },
    {
      "name": "Tristan Jaxx",
      "person_id": 20786
    }
  ],
  "release_date": "2017-09-28",
  "scene_id": 42590,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Couple",
    "Deep Woods Domination",
    "Domination",
    "foreskin",
    "Gay",
    "Humiliation",
    "Latin",
    "Male Sub",
    "master",
    "Outdoors",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "smooth",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Deep Woods Domination: Chapter 2"
}