{
  "collections": [
    "Men On Edge"
  ],
  "description": "Jackson Fillmore & Sebastian Keys are out in the Redwoods of California cruising for dudes! The two of them hear that this is the hot spot for finding muscular men and hit the jackpot when they come across Max Cameron already gagged and tied up in rope bondage, bound and suspended to a tree. Screaming for help, this stud already has a huge boner as Jackson and Sebastian start stroking his massive cock. Like any good scout, Sebastian comes prepared for any situation and pulls out his scissors to cut free Max’s hard cock from the tight restraints. Throbbing hard, that cock needs some serious attention. Jackson starts sucking and stroking that firm meat, getting Max right to the edge of shooting his massive load. Sebastian teases Max’s nipples, tormenting him with intense pleasure. Next Sebastian and Jackson both go down on Max’s monster cock, pushing him to the furthest limits. His cock is going to explode but just keeps getting harder and thicker. Right as Max can’t take it anymore, the duo leave him tied up and exposed.\nTo everyone’s surprise, Max ends up tied up again fully naked and exposed. Jackson takes off Max’s boots and worships his feet. Sucking on his toes as Sebastian takes another turn on his huge cock. Gagged, no one can hear Max’s screams as Sebastian pulls away the pleasure just at the edge of exploding orgasm. Max’s asshole needs to get worked too. They pull out an anal hook and add that to his tight bondage. Now every move Max makes adds to his own torment. Finally after struggling, the torment is too much for Max and he unloads a massive orgasm. Thick hot white cum shoots out of his monster cock and covers his body as he screams through the redwood forrest. Sebastian rubs and torments his overly sensitive cock as Max screams even louder. And after a job well done, rescuing this find meat, the duo continue on with their nice stroll through the beautiful woods.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Max Cameron",
      "person_id": 57500
    }
  ],
  "release_date": "2017-11-14",
  "scene_id": 42596,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Edging",
    "Feet",
    "Gay",
    "Male Handler",
    "Male Sub",
    "muscular",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Stud",
    "switch",
    "Tattoo",
    "Threesome",
    "Tickling",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Hard Woods: Max Cameron Suspended and Tormented in California Redwoods"
}