{
  "collections": [
    "Men On Edge"
  ],
  "description": "Straight boy Darin Silvers finds himself gagged and bound in a dungeon with Sebastian Keys. Darin's never edged himself before and this greedy boy is in for an intense session of tease and denial! Sebastian wastes no time in ripping open Darin's shirt to expose his rock hard body. Next Sebastian peels away Darin's pants to reveal Darin's gorgeous cock. Darin moans as Sebastian takes his thick cock in his wet mouth and starts licking and sucking it. Alternating between using his mouth and his hands on Darin's dick, Sebastian keeps Darin on the edge of coming. Every time Darin gets ready to blow his load, Sebastian backs off, leaving this beefcake stranded with his hard cock bouncing in the wind. Next, Darin is bound on his back with a blindfold on. His limbs are spread wide, his asshole is exposed, and his cock is hard. All Darin can do now is wait for Sebastian to start teasing him. Darin moans as Sebastian slips a stroker down on his dick. Darin's groans intensify as Sebastian expertly works Darin's cock with the stroker. This tight hole drives Darin crazy! Darin uses his bondage to pull himself up into the air and fuck the stroker rapidly so he can blow his load. But Sebastian isn't going to let this muscled stud come yet! He licks Darin's feet while stroking his fat cock and fingering Darin's tight asshole. Overwhelmed by all these sensations, Darin struggles and curses in his bondage as he unsuccessfully tries over and over again to come. Finally, as Sebastian fingers his asshole and jerks him off, Darin blows his load all over himself! Sebastian moves his hand rapidly over Darin's dick to torment him further, and takes Darin's cock in his mouth to get every last bit of come.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Darin Silvers",
      "person_id": 38039
    }
  ],
  "release_date": "2017-08-29",
  "scene_id": 42593,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blindfold",
    "blond",
    "Bondage",
    "Crotch Rope",
    "dungeon",
    "Edging",
    "Feet",
    "Fingering",
    "Gag",
    "Gay",
    "kink-pov-gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "shaped",
    "Straight",
    "Straight Stud",
    "Stud",
    "switch",
    "Tickling",
    "versatile",
    "white"
  ],
  "title": "Straight Beefcake Stud Gets Edged"
}