{
  "collections": [
    "Bound Gods"
  ],
  "description": "In the final installment of Deep Woods Domination, Chapter 3, the huge and muscled Jonah Fontana finally gets his hands on his latest conquest, the desperately punishable Damien Moreau. Jonah wastes no time getting down to business, dominating Damien deep in the forest where no one can hear his screams. He even mocks Damien as he cries out for help. But that help isn't coming. Damien is tied up in a full suspension, hanging upside down from a tree, while Jonah mocks him, abuses him, torments his nipples, and pounds his hard cock into his throat. Jonah doles out a nonstop, series of self-pleasing punishments, with no intention of letting Damien enjoy it. He soon cracks out the flogger and flogs Damien upside down... then the oversized flogger, which he uses to utterly punish Damien's soon to be fucked ass. When Jonah believes his captive is sufficiently face fucked and tenderized, he sets him down on the ground, though still tied to the tree with his hands bound behind his back. Jonah fucks Damien's smooth, hungry ass, pounding him full of angry cock. At the same time he reaches around and jerks Damien's dick, making him suffer the pain and pleasure and restrictive bondage all at the same time. Damien soon blows his load while under Jonah's control, and then the sweaty, muscled dom shoots his own hot load, giving Damien a face full of his raging cum before plunging his spent cock back down his throat. Intent on finding Damien's family to continue satisfying his sadistic need, he leaves Damien alone in the woods, bound and helpless.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jonah Fontana",
      "person_id": 59550
    },
    {
      "name": "Damien Moreau",
      "person_id": 51956
    }
  ],
  "release_date": "2017-10-05",
  "scene_id": 42592,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crotch rope",
    "Deep Woods Domination",
    "domination",
    "gay",
    "humiliation",
    "Male Sub",
    "master",
    "pain",
    "Pierced Nipples",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "Smooth",
    "submission",
    "suspension"
  ],
  "title": "Deep Woods Domination: Chapter 3!"
}