{
  "collections": [
    "Device Bondage"
  ],
  "description": "First timers are always so timid. Cassandra Cain had never done a BDSM porn shoot before The Pope got his hands all over this fresh piece of meat. Cassandra has no idea what to expect as she dangles in the middle of the room bound in a straight jacket and leather belts. She is too scared to make a sound but you can hear her hurried breathes as she labors to breath through the sides of the giant ball gag that has been crammed into her mouth. The Pope circles his prey and begins to test the reactions of his captive female slave. He warms her body up with a leather flogger and beats her ass and pussy until they radiate a shiney red hue. Periodically one can hear Cassandras faint cries as the relentless thud of the impact play continues. With her swollen cunt engorged from the beating, The Pope fingers her pussy while vibrating her clit with a hitachi set to maximum power. Cassandras whole body quivers as the first of multiple orgasms are ripped from her unwilling whore hole. Next The Pope puts his masochistic toy on her knees with her ass up in the air. He slowly works her body over with a riding crop to make sure that Cassandra is fully focused on the attention and pain that The Pope is graciously bestowing upon her. Her wickedly torments the soles of her feet with the sharp end of a knitting needle that elicits shrieks of horror from the tiny pain slut. Her body shakes as she tries to escape from the metal shackles that completely restrain all of her movements, but she quickly realizes that she is completely exposed and vulnerable to all of The Popes sadistic whims. Just when Cassandra can't take any more pain The Pope rams his fingers into her tiny pink pussy and coerces her to cum over and over again until she is babbling in demon possessed tongues that only the devil himself could understand. Without wasting a moment, The Pope then flips this bitch onto her back and extends one leg straight up in the air so he can attack her fragile and exposed pussy. Utilizing a huge dildo he relentlessly fucks her teeny whore hole over and over again until Cassandra is begging to cum. After she suffers through orgasm denial after orgasm denial The Pope finally allows her to cum and her whole body shakes with the explosive power of a category 10 earthquake that shakes her to the very depths of her depraved soul.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cassandra Cain",
      "person_id": 60335
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2017-11-30",
  "scene_id": 42598,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "Feet",
    "Female Slave",
    "Fingering",
    "First Timers",
    "Gag",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "multiple orgasms",
    "Orgasm Denial",
    "Pain",
    "Pain Slut",
    "Slave",
    "Straight",
    "Straitjacket",
    "Submission",
    "The Pope"
  ],
  "title": "Newbie Pain Slut Cassandra Cain Coerced with Orgasms and Metal Bondage"
}