{
  "collections": [
    "Men On Edge"
  ],
  "description": "Its Camp Perv-Anon's sixty-ninth annual woodland retreat, where a small group of extremely sexually perverted men go out to camp deep in the woods, without fear of judgement or ridicule. They tell stories around the campfire, then drift off into the woods to edge each other's cocks all night, seeding the forest with massive milky loads to the soundtrack of crickets and the distant echoed growls and grunts of the other campers. The men can then finally feel relief as they go back home and live their lives as normal until next year's retreat. It's Damien Moreau's first time at Camp Perv-Anon and is excited to experience their edging methods. With the helping hands of camp counselors, Jackson Fillmore and Sebastian Keys, they show Damien exactly what happens at Camp Perv-Anon as they whisk him away and tie him down with rope on his back to a bench made of tree branches. Damien gets a ball-gag shoved in his mouth and his underwear cut off. Jackson Fillmore gets to work on Damien's cock, rubbing it on his beard, sucking and stroking it until Damien says he's gonna blow but Jackson squeezes the base of his cock and wont let him. Next they jerk him off with a fleshlight while they each take turns sucking his dick tip until he again says that he's gonna cum, but instead of letting him, they stop, leaving Damien to writhe around only to then tickle him until he screams for mercy. Next, new camper Damien is bound on his back with his hands and feet in the air as a tree branch spreader bar binds him in place. Sebastian sticks a finger in Damien's ass and milks Damien's prostate as he jerks his throbbing cock. Jackson takes Damien's cock deep down his throat and vigorously sucks. Jackson sticks a vibrating butt plug in Damien's ass and starts jerking his cock till Damien's about to burst. After a relentless edging Sebastian and Jackson let him finally blow his load, shooting his cum all over his chest and stomach. Jackson scoops it up and feeds it to him, congratulating him on his first successful night at Camp Perv-Anon.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Damien Moreau",
      "person_id": 51956
    }
  ],
  "release_date": "2017-10-10",
  "scene_id": 42595,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "bottom",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Redhead",
    "Rope Bondage",
    "shaped",
    "Tickling",
    "white"
  ],
  "title": "New Camper Gets Edged at Camp Perv-Anon"
}