{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "Chloe Cherry is instructed by her Mistress to clean the dungeon before her Mistress' man and his friends get home. But instead of cleaning, Chloe starts masturbating with her Mistress' dirty panties. She stuffs them in her mouth and in her hungry cunt while she rubs her horny little clit. When Rob Piper arrives home and finds this hot little blonde masturbating in a dirty dungeon, he decides it's time to teach this insatiable slut a lesson. His friends strip her of her school girl outfit, and make her suck their cocks. Chloe doesn't waste a second in taking their cocks in her hungry mouth and in her hands. She sucks on their cocks till she chokes and then she keeps on sucking. When they're tired of her mouth, Rob and his friends put her over a spanking bench and start stretching her pussy open with their big cocks. Chloe loves the attention and can't get enough. This is her first gangbang! She is overwhelmed with cock and loves it! When they turn their attention to her other hole, Chloe loses it. She is surrounded by fat cocks fucking her mouth, pussy, and asshole. With all her holes filled at once, all Chloe can do is moan around the fat cock in her mouth while her other holes take a hard fucking! She loves getting plowed and by the end, her asshole is gaping wide open. Once the men have had their fill, this slut gets 5 loads of cum all in her mouth and all over her face. Chloe loves the feeling of cum on her skin and rubs it all over her face and on her tits. Looks like the dungeon isn't getting clean anytime soon!",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Jake Adams",
      "person_id": 60459
    },
    {
      "name": "Jay Savage",
      "person_id": 60460
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    }
  ],
  "release_date": "2017-09-20",
  "scene_id": 42600,
  "tags": [
    "Airtight",
    "Anal",
    "BDSM",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Double Penetration",
    "dungeon",
    "First Gangbang",
    "Gangbang",
    "Gaping",
    "Handjob",
    "Role Play",
    "Rough Sex",
    "Spanking",
    "Straight"
  ],
  "title": "Lazy Submissive Gets Taught a Lesson by Mistress' Studs"
}