{
  "collections": [
    "TS Seduction"
  ],
  "description": "Alisia Rae is a 19-year-old beauty vlogger whose millions of followers hang on to her every word. Her fans have requested she do her boyfriend's makeup. Her boyfriend, Lance Hart is reluctant to put makeup on at first, but he would do anything to bring a smile to his gorgeous young girlfriend's face, even if it means embarrassing himself a little on the internet. Vlogging turns to snogging when Alisia notices how hot Lance looks in a little makeup and Lance surprises her when he's begging to try on a pair of her fishnet stockings. Alisia starts teasing him and licks his body up and down, stroking and sucking his hard cock as she sensually puts him in her pantyhose. Seeing how hard it makes Lance's cock, Alisia turns into a bratty little dom and makes her boyfriend into her bitch. She instructs him to get on his knees and suck her cock like the horny little cocksucker he is! Lance gobbles her down as she tells him how cute and desperate he looks with her cock in his mouth. Alisia is both giddy and horny as she slides her cock deep in her boyfriends ass. She fucks with the special kind of sexual energy only teenagers have. She jackhammers his holes and notices how hard his cock is getting and decides that is time that her hole gets a little attention. After all, he's not the only horny slut in this relationship. Her cock drips with excitement as he rails her tight teenage hole. Craving more Alisia crawls on top and rides his cock while her hard tan cock bounces in front of his face. She squeals with excitement as she uses his cock for her pleasure, coming all over his hot muscular body. Like a true millennial she is never satisfied, and takes his cock in her mouth until he explodes on her tight perky teenage tits!",
  "models": [
    {
      "name": "Lance Hart",
      "person_id": 37346
    },
    {
      "name": "Alisia Rae ",
      "person_id": 60480
    }
  ],
  "release_date": "2017-08-22",
  "scene_id": 42618,
  "tags": [
    "19 year old",
    "anal",
    "blowjob",
    "Cock Worship",
    "Male Sub",
    "role play",
    "Stockings",
    "straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Teen Beauty Vlogger Makes Her Boyfriend Into Her Bitch"
}