{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Abella Danger is no stranger to Kink.com. She has been restrained and fucked in every conceivable fashion. But the one thing that she has never done is peg a pathetic man in the ass and abuse his exposed and vulnerable body. She loves a challenge and is eager to show the world that she can dish it out just as hard as she can take it. D. Arclyte quickly sees that he is in over his head as Abella dives in head first and proceeds to beat, bite, and tenderize every inch of his body. She relentlessly pounds away on his flesh with her fists, her teeth, leather floggers, and clothespins. He screams and shrieks in bliss as Abella bestows her divine attention to his unworthy body. He begs her to abuse his cock and balls and she obliges by biting his ball sack and pinching his foreskin with her sharp finger nails. She teases him by rubbing her perfect ass on just the tip of his tiny throbbing cock. Tired of playing with her pet, Abella then leaves her toy in excruciating pain as she walks off set while pulling off a giant zipper from the skin of his armpits and torso. Now that she has him warmed up Abella decides to tie her little piggy down and explore his little whore holes. She quickly jams a giant strap-on dildo down his throat making him repeatedly gag and choke on his own drool and filth. She face fucks him repeatedly and D. Arclyte's cock grows harder and harder. He begs her to stuff his tight asshole with her cock and probe the inner reaches of his prostrate. Her cock dives in and out of his gaping asshole and he quickly cums as she deeply stimulates his inner whore button. Abella demands complete and utter devotion from her slave and he thanks for ceaselessly for tending to his hungry holes. Abella then ties him down and sits on his face and makes him to lick her divine asshole as she stimulates her clit with a vibrator. She cums again and again until she is completely satiated. But she is a reasonable task master who is not without compassion and decides to let her submissive man cum. She strokes his rod bringing him to the heights of ecstasy and he cums a huge load all over himself. Abella scoops every last ounce of cum off of his chest and coerces him to lick and swallow it all down. Abella Danger dominates, anally fucks, and beats a submissive man in her first ever Divine Bitches shoot!!",
  "directors": [],
  "models": [
    {
      "name": "Abella Danger",
      "person_id": 56157
    },
    {
      "name": "D. Arclyte",
      "person_id": 59025
    }
  ],
  "release_date": "2017-08-18",
  "scene_id": 42616,
  "tags": [
    "Abella Danger",
    "bdsm",
    "bondage",
    "CBT",
    "clothespins",
    "Corporal Punishment",
    "dildo",
    "dominatrix",
    "drool",
    "Face Sitting",
    "femdom",
    "Fingering",
    "gag",
    "gaping",
    "humiliation",
    "leather",
    "Male Sub",
    "master",
    "orgasm denial",
    "pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "straight",
    "vibrator",
    "zipper"
  ],
  "title": "Abella Danger Fucks Man in the Ass in her First Divine Bitches Shoot!! "
}