{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Plastic Princess Bella Rossi loves to play sweet and sadistic games with her pet, Tony Orlando. Dressed head to toe in candy colored latex atop her throne of broken toys, she explains the rules to her slave. She expects her playmates to entertain, worship and obey. Bella takes out one of her favorite toys, a hot pink flogger, and delights in the sweet symphony of his cries and the sound of the whip on his back. She strips Tony of his latex shell and unleashes furious and unrelenting lashes on his bare chest. After working up a healthy sweat, the radiant Bella demands worship. Tony greedily tongues her encased latex feet and is soon rewarded with a special treat! She showers him with the filthy nectar that has collected in her latex stockings and the filthy fucker must take it all in his mouth. The plastic princess grabs her man toy by the balls and skillfully slides him into position and smothers him with her glorious ass, depriving him of air as she climaxes. In her post orgasmic bliss she decides her pet is worthy of being marked by more than her whips. The princess straps on her pretty cock and prepares to penetrate her puppet. Bound and hooded in a doll mask, Tony is subjected to a vicious and unrelenting tickling. Out of breath and out of control Tony's ass is penetrated by her plastic penis. Bella demands more from her bottom and shoves a gloved fist inside Tony's freshly fucked asshole. She then plugs his ass with a rubber flogger to keep him stretched until she is ready to play with him again...",
  "directors": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2017-09-15",
  "scene_id": 42617,
  "tags": [
    "BDSM",
    "Bondage",
    "bottom",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Hood",
    "Humiliation",
    "Latex",
    "Male Sub",
    "Mask",
    "Nylons And Stockings",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Sadism",
    "Slave",
    "Straight",
    "Tickling"
  ],
  "title": "Sweet Sadism: Plastic Princess Torments Her Toy"
}