{
  "collections": [
    "TS Seduction"
  ],
  "description": "Sensual Domme Venus Lux awaits her next client of the day, Ruckus. Ruckus is a good slave and arrives right on time to serve his Mistress. Following his Mistress’ protocol, Ruckus drops to his hands and knees after entering and begins to worship Venus’ beautiful shoes and feet. He showers kisses all over her toes and once Venus allows him to remove her shoes, he sucks, licks, and worships her feet and toes through her stockings. Venus knows just show to tease her slaves, she lets Ruckus catch a glimpse of her glorious cock but he’s not allowed to taste it until he makes it nice and hard. Ruckus lies on his back as Venus uses her feet to play with his hard cock. Ruckus begs to serve his Mistress and taste her beautiful cock. Once Ruckus’ begging makes Venus’ cock hard, he is allowed to take it into his mouth and worship it. He then gets a sloppy wet throat fucking as Venus uses his mouth and spanks his ass. After using his mouth, Venus turns her attention to Ruckus’ ass. She slides her cock in his ass and fucks him. Then she has her slave flip over on his back so she can tease his cock while she continues fucking him. Ruckus is slow close to cumming, he begs Venus to stop so he doesn’t cum without permission. Ruckus’ begging only turns Venus on more – she pulls out of his ass, straddles his chest, and blows her hot load all over his face. Now that she’s cum, Venus allows Ruckus to cum all over her stocking-clad feet. After cumming, Ruckus cleans up his mess, licking all the cum off his Mistress’ feet. The perfect end to a perfect session.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ruckus",
      "person_id": 48209
    },
    {
      "name": "Venus Lux",
      "person_id": 41417
    }
  ],
  "release_date": "2017-10-17",
  "scene_id": 42613,
  "tags": [
    "Anal",
    "Asian",
    "Athletic",
    "black hair",
    "Blowjob",
    "brunet",
    "Cock Worship",
    "fake boobs",
    "Feet",
    "Male Sub",
    "Nylons Stockings",
    "Role Play",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Sensual Domme Venus Lux Gets Worshiped and Fucks Her Obedient Slave"
}