{
  "collections": [
    "TS Seduction"
  ],
  "description": "It's hot out when handyman DJ is finishing a paint job for rich client Jessica Fox. Thinking no one is watching, DJ slips out of uniform to get more comfortable. But Jessica is watching, and she likes what she sees. Nothing gets Jessica going like a man in uniform working up a sweat for her. Once DJ notices he's been watched, Jessica decides to get her money's worth. She makes DJ strip so she can sniff his big sweaty balls. She licks and sucks on those balls before taking DJ's cock in her mouth and giving him the blow job of his life. DJ can barely believe his luck! He reaches out to touch Jessica's gorgeous body and is immediately put in his place! Jessica slaps him and reminds him he is beneath her. She makes him get on his hands and knees to worship her beautiful shoes and feet. DJ works his way up to Jessica's beautiful cock and enthusiastically takes it in his mouth. He slobbers all over her gorgeous cock and worships her glorious asshole. Once Jessica's cock is dripping wet, she teases her handyman's asshole with her tongue before thrusting her cock in. DJ as he moans in pleasure as Jessica relentlessly drills his hole. But before DJ is allowed to come, Jessica wants hers. She mounts DJ and slips his cock inside her ass. She works his cock, taking exactly what she wants, while DJ is helpless to do anything but submit to pleasuring his employer. When she tires of using his cock, Jessica returns to fucking DJ in the ass. Overwhelmed, DJ comes hard, and Jessica rubs his fat load all over his face and in his mouth. But DJ doesn't get a break! Jessica continues fucking his asshole before moving to fuck his wet mouth and blowing her load all over his face and chest.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "DJ",
      "person_id": 20225
    },
    {
      "name": "Jessica Fox",
      "person_id": 17013
    }
  ],
  "release_date": "2017-10-03",
  "scene_id": 42612,
  "tags": [
    "Anal",
    "Blowjob",
    "Cock Worship",
    "Feet",
    "Male Sub",
    "Role Play",
    "Straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Jessica Fox Loves Sweaty Balls and Fucks Handyman DJ"
}