{
  "collections": [
    "Bound Gods"
  ],
  "description": "Kyler Ash is working in the storage room of a popular bar, except he's not exactly working. When no one's looking he whips out his phone to watch porn and jerks his big dick. His burly coworker Kaden Alexander walks in on him and decides to blackmail him... If Kyler wants to keep his job and not have the boss find out, then he's gotta give his sweet, tight ass to Kaden, and let him do whatever he wants with it. Kaden starts him out by shoving a bar gag into his mouth and tying his hands behind his back. He then puts Kyler on his knees and makes him finish his work by licking the floor clean. He then pulls him up to jerk his cock, while also twisting his nipples and pounding on his body, to give Kyler a simultaneous sense of pain and pleasure. As a reward for a job well done, Kaden pulls his thick dick out and shoves it down Kyler's throat, making him suck it deep and hard. He then ties Kyler's arms above his head and flogs him. Hard, loud strikes on Kyler's delicate white skin leave hefty red marks that burn like crazy. Fully beaten, Kyler's then made to suck Kaden's hard wet dick again, to get it ready to slide into his tight little ass. Kyler's tied to the couch in two different positions. First he's bent over a couch while Kaden fucks him with a thick dildo. Kaden then takes Kyler's ass and slams his hard black dick into his hungry hole. Kyler cums all over himself while getting fucked, with his body bound and his legs tied in the air. Kaden then towers above his head and shoots his massive load all over him. Hot ropes of cum pump from his powerful black dick and splatter on Kyler's prone naked body, bound and immobilized.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Kaden Alexander",
      "person_id": 59146
    },
    {
      "name": "Kyler Ash",
      "person_id": 59359
    }
  ],
  "release_date": "2017-08-24",
  "scene_id": 42625,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Black",
    "Blowjob",
    "Bondage",
    "Clover Clamps",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Fetish",
    "Flogging",
    "Gag",
    "Gay",
    "Handjob",
    "Humiliation",
    "Kinky",
    "Male Sub",
    "master",
    "Muscle",
    "Nipple Torment",
    "Oral Sex",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Stud",
    "Submission",
    "Twink",
    "white"
  ],
  "title": "Black Stud Kaden Alexander Pounds The Fuck Out Of Kyler Ash"
}