{
  "collections": [
    "Bound Gods"
  ],
  "description": "Chris Harder is having a rough day – separated from his hiking pack and low on water, he wanders through the woods hoping to find someone, anyone who could help him. But things are only going to get harder for Chris. He takes a fall and passes out in the middle of the woods and is found, unconscious, by wilderness survivalist Christian Wilde who has been hiding out in the woods to escape government surveillance. Christian doesn’t know what pretty boy Chris is doing in this neck of the woods, but he sure is going to find out. Chris awakens tied to a tree, facing interrogation by an unknown and angry man. Frantic to get free, Chris reiterates he’s just a lost hiker who doesn’t know anything, but Christian isn’t convinced. He slaps and flogs Chris all over his stomach and chest. He takes Chris’ cock out and begins to stroke, suck, and bite it. He pulls hard on Chris’ balls, stretching them as far as they’ll go. To his surprise, Chris’ cock gets rock hard after being beaten and manhandled. Maybe somewhere between pleasure and pain, Chris will start talking. Christian waterboards Chris and alternates between making him choke on water and making him choke on his beautiful big cock. Chris pants for air in between and all the while his cock stays hard. Since Chris isn’t talking, Christian decides it’s time to gag this little piggy. Now all Chris can do is moan around his gag as Christian fucks his tight asshole. Christian pounds that hungry hole as Chris squirms and struggles in bondage. Finally, Christian pumps Chris’ cock and lets Chris cum all over himself, before gathering his slop and feeding it to Chris. Christian’s thrusts intensify as he gets ready to cum, and he blows his load all over Chris’ cock and ass. Chris eats Christian’s cum greedily and is relieved that this trial is over. But Christian isn’t going to let Chris go just yet. It looks like Chris will be stuck in wild country for some time.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Chris Harder",
      "person_id": 57401
    },
    {
      "name": "Christian Wilde",
      "person_id": 21037
    }
  ],
  "release_date": "2017-11-16",
  "scene_id": 42626,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "Hairy",
    "Humiliation",
    "Kidnapping Play",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Wild Country: Hiker is Kidnapped, Bound, Fucked by Woods Survivalist"
}