{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "London River is a tall beautiful big tittied blonde. With her long muscular legs she towers over many of the wrestlers on the Ultimate Surrender roster. Hence the name “Tower” for London’s wrestling Moniker. London is strong and determined but is that enough to take on Ariel X. Ariel X knows London is a beautiful tan barbie and she thinks London is just another pretty face that she can sit on. She doesn’t think London is going to be able to put on much of a fight. However, London comes out very strong in the first round and because Ariel has under estimated her, London is able to take advantage of Ariel and seduce her on the mats. The wrestling is back and forth with both girls getting fingers into each other. The tensions are high which typically leads to orgasms on the mat. The wrestling gets to these powerful athletes and one succumbs to orgasms on the mats. The stronger wrestlers pounces on her prey, traps her opponent on the mats, hand gags her, smothers her, licks her armpits and kisses her until the weaker wrestler is drained dry from cuming and cuming again and again on the mats against her will. The winner is hoisted into a back breaker rack, made to deep throat strap on cock, folded into a pretzel and fucked deeply with a lesbian strap on cock. The loser is spanked, fisted and fucked anally until her asshole is left gaping open. Then the winner picks the loser up in a fireman carry and she is carried out to be fucked all night by the winner. These wrestlers have explosive chemistry. Two hot blonds with big tits fighting for control in an ultimate sex fight. This is a true “winner takes all match” The winner fucks the loser any way she wants.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "London River",
      "person_id": 56590
    },
    {
      "name": "Rizzo Ford",
      "person_id": 56943
    }
  ],
  "release_date": "2017-09-27",
  "scene_id": 42648,
  "tags": [
    "Anal",
    "Big Tits",
    "Blonde",
    "bottom",
    "Brunette",
    "Domination",
    "Facesitting",
    "Fingering",
    "Gaping",
    "Hand Gagging",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "rack",
    "sex fight",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "toned",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Beautiful, Powerful Blonde Wrestler is Destroyed on the Mats"
}