{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Bobbi Dylan is a really cute girl next door kinda girl. She's all natural, with minimal tattoos a bubbly personality and a desire to kick ass. She grew up with brothers who use to bully her so she's already taken her fair share of ass kickings and she knows how to defend herself. She's taking on one of our strongest wrestlers. A farm girl with freakish strength and wrestling ability, Cheyenne Jewel. Cheyenne has become somewhat of a bully with the rookies. She shows no kindness, barely lets them score ANY points on her and she talks trash the entire time she's whooping on them. Today, Bobbi wants to put an end to Cheyenne Rookie squashing reign. These two girls come out strong and fierce but one of these girls keeps finding herself trapped under the other one. She gets face sat with a huge ass on her face, she gets school girl pinned and kisses with powerful tongue kissing. At the end of this 100% competitive erotic wrestling match, a winner is announced and the winner drags the loser into the locker room for brutal fingering and strapon fucking against the lockers. The Winner spanks the loser until her ass is Rosey red. The winner puts her ass and pussy onto the losers face one more time and rides it until she cums all over the loser's face.The winner leaves the losers in the locker room for all the other wrestlers to come in and take their turns hazing the fucking loser!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Bobbi Dylan",
      "person_id": 59345
    }
  ],
  "release_date": "2017-11-08",
  "scene_id": 42649,
  "tags": [
    "domination",
    "erotic wrestling",
    "Facesitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Young, Natural Rookie put it all on the line in competitive wrestling"
}