{
  "collections": [
    "The Training Of O"
  ],
  "description": "Bound on a square black table with skin as white as snow, Alex Harper is positioned on her back with a red ball-gag between her teeth. Her wrists are tied firmly to the table with rope above her head. Wrapped around the end of her long legs are several loops of rope binding her ankles together and to the ceiling making her look like a sexy backwards \"L\". Mogul fingers her asshole and flogs her bare ass and pussy then brings an assortment of insertable toys of diverse material. First a clear glass butt-plug is slowly inserted into her tight hole, letting us see inside and looking quite (as James puts it) lascivious. Next an inflatable black latex plug is inserted into her asshole and James pumps in some air and tugs on what looks like a black rubber tail. After the inflatable, a metal toy is popped in and out of her gaping ass with ease. Tommy Pistol enters the scene and enters her ass for the grande finale and pounds her hole hard while Mogul applies clamps to her pale pink nipples. In the next scene Alex starts in a standing position, her deliciously perky pale tits are tightly bound with rope. With her hands also bound behind her back, James helps Alex to her knees and the nipple clamps are applied once again. Tommy instructs her how to suck his cock and she follows his commands like a good whore. Good whores get rewards so a vibrator gets pressed on her clit while James sticks his thumb up her pussy and presses on her G-Spot sending her into an orgasmic frenzy, screaming with a mouth still full of Tommy's cock. In the third scene, Alex is completely naked on her back with her ass in the air, bound in a pile-driver position, ass already gaping. James whips her pussy with a crop and switches to a vibrator, going back and forth and makes her cum hard. Tommy fucks her cunt, pounding it like a jack-hammer while James crops the bottoms of her feet. Tommy then fucks her asshole again and cleans his dick off in her mouth. In our final scene, Alex is on her back spread-eagle. With one leg frog-tied and the other leg tied to the ceiling, Tommy fucks her pussy and ass until he cums, blowing his hot load all over her pretty face.",
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Alex Harper",
      "person_id": 60270
    }
  ],
  "release_date": "2017-11-07",
  "scene_id": 42659,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "crop",
    "discipline",
    "Feet",
    "female slave",
    "gag",
    "gaping",
    "Gimp",
    "humiliation",
    "latex",
    "master",
    "nipple clamps",
    "oral sex",
    "role play",
    "rope bondage",
    "straight",
    "vibrator"
  ],
  "title": "Alex Harper, Pretty Pale and Pliant "
}