{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Maya Kendrick and Skylar Snow are backpacking through the remote, desolate mountains of Southern CA. when they find themselves lost and with no cellphone signal. Maya starts to panic and tries to read the map while Skylar ventures down into the foreboding woods to take a whiz. With her big tits busting out of her low-cut shirt she peels off her tight, super short blue-jean shorts and squats down. Someone is lurking, watching...Just when Skylar is at her most vulnerable someone sneaks up behind her and drags her off into the forest! Time passes and Maya goes looking for Skylar but she is long gone. Her clothes and phone are scattered about and Maya grows fearful when someone appears hiking down the trail. A nice, very understanding Xander Corvus agrees to help her and they go looking for Skylar together. After searching for hours they find Skylar naked, tied up and gagged on the porch of an old cabin. She is screaming and calling out for help. Who did this to you?! Xander tries to grab Maya but terrified she runs off in to the woods and leaves her poor friend Skylar alone with this scary man! With nipple clamps tight on her huge tits Xander gives her a hardcore throat fuck, slides his cock in between her wet slobbery tits and then leaves her there tied up and alone. When Maya tries to rescue her all hell breaks loose and the Backpacker's Nightmare begins! Bondage, BDSM, corporeal punishment, blowjobs, pussy eating, ass licking, anal sex. Inside this rustic cabin in the woods far away from civilization Xander teaches these sluts a lesson for trespassing on his property.\nWith both girls tied up Xander gets down and dirty with each of them double time. Flogging, pussy fucking and blow jobs in different positions all over the bed. He flogs Skylar's tits while Maya eats her pussy then Xander fucks Skylar while Maya licks Xander's ass, this threesome is a tied up, tangled hot horny mess. Things take a turn for the best when Xander fucks Maya in her ass and blows her mind and then pounds each of them one after the other until Skylar squirts and Xander shoots his hot load all over their tits. Check out this weeks sexy, scary SAS Halloween update when a backpacking trip turns into a nightmare, or is it a fantasy...?",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Xander Corvus",
      "person_id": 46000
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2017-10-27",
  "scene_id": 42664,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Facefucking",
    "Flogging",
    "halloween",
    "Humiliation",
    "Nipple Clamps",
    "Pussy Eating",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "southern",
    "Straight",
    "Submission",
    "Threesome",
    "Vaginal Penetration"
  ],
  "title": "Backpacker Nightmare"
}