{
  "collections": [
    "The Training Of O"
  ],
  "description": "Fresh meat. Sadist extraordinaire Ramon Nomar is always hungry and when he laid his eyes on the innocent, submissive, and naive body of Astrid Star he drooled with desire. He wastes no time explaining the rules to Astrid and instead ties her up in restrictive rope bondage with her tiny pink pussy strapped tightly to a hitachi. He shoves a giant ball gag into her mouth to stifle her useless questions and pleas for mercy. Ramon slowly works her body over and examines her young and perfectly formed body. Her giant tits gyrate as Ramon beats her body with a heavy leather flogger and he pinches her taut skin with clothespins tied into a nasty zipper. He teaches her the day's first lesson: To beg for his attention. Astrid whippers some muffled words to articulate her desire to serve and please Ramon. When she finally learns how to beg for attention, Ramon tears the zipper off of her body and the slaps the tiny welts with his giant man hands. He checks to see how her pussy reacts to abuse and finds her wet with desire. She is a truly masochistic fuck toy and her greedy cunt only wants more attention. Ramon throws her to floor and jams his monster cock deep down her throat. The girth of his stiff rod barely fits into her mouth and she gags from the deep throat face fucking. Gasping for air she begins to learn the rules and begs Ramon to fuck her filthy mouth until she can barely breath. Grown tired of using her mouth as a fuck hole, Ramon ties her arms and legs to a table fucks her behind. His cock barely fits into her teeny pussy. She winces as the massive cock penetrates her for the first time. But, her pussy juices explode and Ramon begins to ram his all natural female slave with an intensity that pushes the table all the way across the room. Gasping for air she showers Ramon with platitudes and thanks him endlessly for fucking her. She begs to cum over and over but Ramon doesn't feel like she has earned that right. So, he flips her onto her back and ties one of her legs in the air so he can really stuff her cunt with his cock. As Ramon fucks her, he simultaneously hits her sensitive tits with thin and severe cane and then shocks her armpits with an electric zapper. Astrid is growing overwhelmed by all the different types of pain and pleasure that are flooding her senses. But a greedy whore only wants one thing; multiple unwilling orgasms, and Astrid begs her dom to cum. Fire burns in Ramon's eyes and he rips orgasm after orgasm out Astrid's pussy and she squirts all over herself. Ramon finally grows tired of his sub and blows a massive load of jizz all over her tits and pussy. He scoops it up and crams it into Astrid's hungry mouth and she licks every last bit of it up.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Astrid Star",
      "person_id": 60587
    }
  ],
  "release_date": "2017-11-21",
  "scene_id": 42660,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gag",
    "Gimp",
    "Hitachi",
    "Humiliation",
    "Leather",
    "master",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Slave",
    "Straight",
    "Sub",
    "Zapper",
    "Zipper"
  ],
  "title": "Sex Slave Astrid Star Submits to Rope Bondage and Extreme Fucking!"
}