{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Xander Corvus is under house arrest and needs to talk to his lawyers about his inheritance before its too late. One morning while trying to get the newspaper in the driveway his ankle bracelet goes off and alerts his sexy blonde Parole Officer Alexis Fawx. Highly irritated that she has to come all the way out to his place the check on him (3rd time that week?) she makes a dirty deal with him: give me 20% of your inheritance and make me happy and I will remove that bracelet. Alexis is wearing a tight black business skirt with no panties, she spreads her legs to reveal her shaved pussy and asks Xander what his freedom is worth to him. Make me happy or go to jail. Needless to say Xander goes with making her happy so he gets down on his knees and worships her slutty pussy. With her legs spread wide open, black stiletto heels in the air, he slides two fingers inside and licks her clit and asshole until she is squirming and moaning with pleasure. He tears her shirt open to play with her huge tits while he eats her wet parole officer pussy. After Alexis has had enough she deactivates Xander's ankle bracelet off and says good day, but he grabs her and puts her in a sleeper hold so he can keep her for his sadistic pleasures. Bound and gagged with a blindfold over her eyes for sensory deprivation Xander gives Alexis some corporeal punishment with the flogger. He flogs her massive tits and her thighs, her firm lean body writhing around in pain. After a punishing flogging he throat fucks her until she is slobbering all over her badge. Then he ties her up tight on all fours in doggie and fucks her with his massive cock. Xander's dick stretches her tight little pussy out and then makes her clean the cum off. More flogging and fucking and a hot orgasm with the Hitachi. Next Xander mounts Alexis on his cock in reverse cowgirl on the couch. With her big tits bouncing and bulging around the rope he pounds her pussy up and down and all around until she squirts all over the place. He lays her down on her back for more hot non-stop cunt fucking. Alexis's clit is so swollen and aroused she cums again and again until Xander shoots his load into her mouth and all over her face. Watch sexy MILF Alexis Fawx go Rogue as the Rogue Parole Officer in this week's SAS exciting update.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Alexis Fawx",
      "person_id": 60510
    },
    {
      "name": "Xander Corvus",
      "person_id": 46000
    }
  ],
  "release_date": "2017-10-13",
  "scene_id": 42662,
  "tags": [
    "anal",
    "anal fingering",
    "ball gag",
    "bdsm",
    "big tits",
    "blindfold",
    "blonde",
    "blowjob",
    "Breast Bondage",
    "Corporal Punishment",
    "deprivation",
    "discipline",
    "domination",
    "flogging",
    "high heels",
    "Hitachi",
    "humiliation",
    "MILF",
    "pain",
    "role play",
    "rope bondage",
    "Rough Sex",
    "squirting",
    "straight",
    "submission",
    "throat fuck",
    "Vaginal Penetration",
    "vibrator",
    "Zapper"
  ],
  "title": "Rogue Parole Officer"
}