{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Blonde beauty Lily LaBeau pays for her husbands past when Ramon Nomar shows up fresh out of prison to get what he deserves. He says he did time for her husbands scheme and now he wants some payback in the form of Lily's ass and some jewels that are hidden somewhere in the house. Ramon video calls Lily's husband and taunts him with the image of his sweet wife looking desperate all tied up in bondage, a ball gag in her mouth and demands to know the location of the hidden jewels. Nothing. Ramon asks Lily\nwhere are the jewels? She claims to know nothing so he disciplines her with a punishing flogging session and a deep throat fuck. With slobber all over her natural tits Ramon vibes her pussy until she is about to come and pulls the hitachi away to deny her an orgasm. Ohh that's mean. Where are the diamonds??? Still nothing. He ties her up in doggie and pounds Lily's lily-white ass until she is screaming and loving it. His flogger lashes her back and butt while his huge cock stretches her asshole wide. She wants to taste her ass so Ramon fucks her mouth again while she cleans her ass off his cock. \"Please keep fucking me! You do it so much better than my husband.\" More hardcore anal and then deep into Lily's pussy Ramon is surely getting his payback. But he is not done yet. With Lily on her back arms tied behind her back Ramon spreads her long smooth legs open and fucks her slutty pussy. She can's get enough, he plays with her clit, vibes her pussy and makes her cum again and again as he fucks her pussy and ass in different sexy positions all over the bed until he shoots his hot load right into her mouth. Now thats some Anal Payback. But where are those diamonds? Watch to find out!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Lily LaBeau",
      "person_id": 25162
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2017-10-06",
  "scene_id": 42661,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Best of Anal",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Facefucking",
    "Flogging",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "smooth",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Anal Payback"
}