{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Asian cutie Marica Hase is Tommy Pistol's little fuck doll when Tommy accidentally kidnaps the Wrong Girl.\nSomebody hired him to find a Japanese girl in the Santa Monica mountains but in fact he was supposed to get a Korean girl in the San Juan mountains. Oops. he got The Wrong Girl. What to do? Well, how about find an abandoned cabin in the woods, some rope, bondage toys and make the best of it! Tommy throws Marica over his shoulder and carries his prize over the threshold in a dusty old lodge hidden deep in the mountains for a day of fun and fucking. With ankles, knees and wrists tied up tight her tiny plaid school uniform is hiked up showing her sexy ass and her shiny black patten leather shoes glimmer in the sunlight. He calls out \"Is anybody here?\" No, not for miles. He ties Marica to a pole on a little stage and unbuttons her blouse to help cool her off, no bra--her natural tits perky and firm just waiting to be revealed. The ball gag in her mouth is making her drool all over her breasts creating glistening streaks of spit all down her chest and nipples. He lifts up her skirt and no panties either! What is she doing out and about the countryside with no panties on?! Hmmm Tommy touches her pussy to find it so wet, she must be excite--is this a fantasy of hers? He shuts the curtains, has a shot of whiskey and lo and behold finds a treasure trove of bondage toys behind the bar. Floggers, canes, zappers oh my. Launching into a sadistic day of fun Tommy lets Marica choose the zapper or his cock? She doesn\"t like the zapper so Tommy removes her ballgag and gives her a good throat fucking to start the day off right. She sucks his cock and then stands her up and fucks her wet, slutty pussy. She is quite a sight tied to the pole leaning forward with her back arched and curvy ass up in the air.\nNext a little predicament bondage in doggie position with metal asshook tied to her hair Tommy disciplines Marica with the flogger and fucks her pussy some more. He removes the hook from her ass and puts it in her mouth to enjoy. After a deep pussy pounding Tommy fucks Marica\"s ass while she moans and squeaks and peeps and cheeps and coos--making her signature little doll sounds of pleasure. She cleans her ass off Tommys cock and sucks his balls. Finally to top off this perverted, merciless fuckfest he puts Marica on her back with one leg up so he can get inside all her horny holes with ease. He plays with her clit, vibes her pussy, fucks her every which way until she is squeaking and cuming on Tommys cock and he shoots his load all over her thighs. The Wrong Girl was oh so right for their little escapade into the mountains!",
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Marica Hase",
      "person_id": 44408
    }
  ],
  "release_date": "2017-10-20",
  "scene_id": 42666,
  "tags": [
    "anal",
    "Asian",
    "ball gag",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "curvy",
    "domination",
    "drool",
    "gag",
    "humiliation",
    "Kidnapping",
    "leather",
    "predicament bondage",
    "Predicament Shoots",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "The Wrong Girl"
}