{
  "collections": [
    "Sex And Submission"
  ],
  "description": "You are in for a treat with this weeks SAS Thanksgiving update! We got the raven haired bad ass bitch mobster wife with huge beautiful tits Lily Lane, we got the sweet and pretty long and lean girl next door and then the funny bumbling mobster Tommy Pistol who just wants to pull of his first time heist to please his wife.\nWhen the heist goes awry Tommy turns a negative into a positive and decides to have some fun with these two hot and horny ladies. Outside on the deck of a remote cabin in the woods Tommy teases Avi with the zapper and makes her squirm. Lily looking hot with her mini skirt, high heels and huge boobs busting out of her low cut top gets turned on and makes Avi eat her pussy until she squirts a geyser all over her mouth. Tommy gets in on the action and throat fucks Avi and they trade her back and forth so she is getting high on sucking cock and eating pussy. Then inside on the bed both girls are gagged and tied up in bondage, Avi in doggie with wrists behind her back and ass up high, Lily on her back with legs spread wide open. Tommy has a flogging session on his bitchy wife Lily and their cute little hostage Avi. He whips their ass and tender thighs to get them warmed up for an onslaught of fucking. First target: Lily's hungry pussy, Tommy rampages her pussy with his hard cock while her big tits bounce around in rhythm to his thrusts. Then he slides over to fuck Avi, she spreads her ass open so he can get in there and do some damage, the good kind of course. He surprises Lily with his cock in her tight ass and then fucks both of them every which way but loose. More pussy licking, ass fucking, cock sucking, toe-jobs, spit swapping, vibrators, squirting orgasms, shooting loads and fun fun fun!!! This is a sexy, wild, reckless bunch looking for kicks and thrills and they find it in this week's epic western style SAS heist Mob Rules!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Avi Love",
      "person_id": 60196
    },
    {
      "name": "Lily Lane",
      "person_id": 50199
    }
  ],
  "release_date": "2017-11-24",
  "scene_id": 42665,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "High Heels",
    "Humiliation",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Squirting",
    "Straight",
    "Submission",
    "thanksgiving",
    "top",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Mob Rules"
}