{
  "collections": [
    "Families Tied"
  ],
  "description": "Olive Glass is a rare beauty with a seductive & submissive sexuality. Her new Master is one lucky guy to have this stone cold babe collared and kneeling at his feet. Olive comes with a catch, and that catch is that she has promised herself to another for most of her life: her step-sister Alex Harper. Long ago she promised her gorgeous lesbian sister she would belong to her if only she would touch her greedy cunt. Alex does not take this promised lightly, and sends all of Olive's boyfriend packing quickly, taking ownership of her slutty little sister's pussy once again.\nThis Master has a will of steel, and does not take kindly to Alex's imposition. When Olive asks that her collar be removed while visiting Alex he delivers a strict reprimand in the form of a hot wax and intense flogging scene in tight leather bondage. Her perfect nipples are clamped and her horny cunt beaten red while she begs to have her collar and her Master's cock back again. Her submission is palpable and the chemistry thick in this intense D/s scene. Mounted up on Derricks cock she rides hard and breathlessly, begging to cum and is allowed her well earned orgasm on the condition that she deliver news of her new relationship to Alex.\nOlive creeps into the kitchen to let her sister see her collar and tell her that she belongs to Derrick. Alex's eyes flash with anger and snatches her little bitch sister up and punishes her hard and fast with a barrage of verbal humiliation and spanking. Plugging her sister's pussy up with an electric dildo and cuffing her hands behind her back, she places the electro audio setting on and has Olive lick her psychotic pussy while she moans into the microphone, shocking Olive's trapped cunt, creating a feedback loop of sadistic pleasure. When Alex has her screaming shuddering orgasm on Olive's face she arouses Derrick from the back of the house, and smiles with pleasure as he invites her to engage in a face to face battle of the wills.\nThis sexy red headed witch likes it both ways and allows Derrick to trap her pale body in a BDSM sex take down while Olive struggles to get out of her handcuffs. Spanked, cropped, and fucked in the ass in rope bondage Alex licks up every second of release. When Olive finally wrests herself free and comes into the room, her boyfriend is thoroughly enjoying all of Alex' holes and invites her to sit on Alex' face for the first time ever. The rest of the day is spent trying different hot positions as both ladies enjoy getting railed in mutual sexual pleasure and Olive licks hot cum off Alex well used cunt.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Alex Harper",
      "person_id": 60270
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Olive Glass",
      "person_id": 60453
    }
  ],
  "release_date": "2018-02-02",
  "scene_id": 42673,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Bondage",
    "Collar",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Discipline",
    "Electric Dildo",
    "Family Roleplay",
    "Feet",
    "Female Slave",
    "Flogging",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Lesbian",
    "master",
    "natural boobs",
    "Oral Sex",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Spanking",
    "Straight",
    "Submission",
    "Tattoo",
    "white"
  ],
  "title": "To Be Promised: Psycho Lesbian Sister's Sadistic Obsession"
}