{
  "collections": [
    "Bound Gods"
  ],
  "description": "In the middle of an isolated desert, Brendan Patrick is naked, bound, and tied to the bumper of a van. As the van slows to a stop, Brendan struggles fruitlessly in his bondage. His captor, Pierce Paris, emerges from the van and drags a struggling Brendan off to an abandoned structure. Brendan tries to get away, but is no match for Pierce, a tall muscled god. Pierce can't believe his luck, finding a cute little fuck slut like Brendan on the side of the road. Pierce spits on him, smacks his chest, humiliates and degrades him, and all this rough treatment makes Brendan's cock rock hard. Pierce takes Brendan's cock in his mouth and as much as Brendan wants to escape, Brendan can't help moaning in pleasure around his bit gag. He gets closer and closer to cumming, but Pierce won't allow it. He makes a close-pin zipper on Brendan's chest and continues to tease him before ripping it off the next time Brendan begs to cum. Next, Brendan is blindfolded and tied spread eagle. He calls for help, but the only one who can hear him is his captor. Pierce flogs Brendan all over his back and ass, before making him suck his hard thick cock. Finally, Pierce drags Brendan back to the van for a good hard fucking. Brendan is bound, gagged, and helpless to do anything but take Pierce's big cock. Brendan moans as Pierce relentlessly pounds his asshole. Once Pierce has had his fill, he jacks Brendan off. Brendan blows a thick load all over his stomach and Pierce smears it all over Brendan's face before giving Brendan another creamy facial. Brendan has no choice but to suck Pierce's cock clean. Now that Piece has had his fun, he throws Brendan out of the van, bound, naked, cum-covered, and ready for the next horny stranger who drives by.",
  "models": [
    {
      "name": "Brendan Patrick",
      "person_id": 55528
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2017-10-26",
  "scene_id": 42719,
  "tags": [
    "anal",
    "bdsm",
    "Bit Gag",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "domination",
    "Facial",
    "gag",
    "gay",
    "humiliation",
    "Male Sub",
    "master",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "submission",
    "zipper"
  ],
  "title": "Muscled Rope Slut Abducted, Bound, Flogged, and Fucked"
}