{
  "collections": [
    "Bound Gods"
  ],
  "description": "Like a bronze statue, muscled body builder Draven Novarro stands at attention, helplessly bound, every inch of his enormous muscles restrained and at the mercy of Mr Keys. A blindfold masks Draven's eyes, keeping the bound god in anticipation for blow that his master has to offer. Sebastian works over his slave, tearing away his jock to reveal the thick piece of meat hanging between the body builder's tree trunk thighs. Draven endures the heavy blows of Mr Keys' fist before tasting his leather flogger as it beats his muscled ass red, the warmth radiating off of Draven's godly ass, all while excruciating forceps clamp his nipples and balls. But that's just the beginning for the muscled slave...Bent over, Draven's hairless hole is exposed for his master's torment as an electrifying violet wand penetrates the slaves hole. Surges of electricity dance around the bound god's tight ass while his moans fill the dungeon. Strung up like a piece of meat, Draven hangs in suspension with a gas mask restricting his breathing as Mr Keys plunges his cock deep in his slaves ass. After a ravenous fuck in mid-air, Draven's mask is removed to receive a mouthful of his master's delicious cum before he's left helplessly suspended in his bondage for the next master of the house to enjoy...",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2017-09-14",
  "scene_id": 42717,
  "tags": [
    "anal",
    "bdsm",
    "blindfold",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crotch rope",
    "domination",
    "dungeon",
    "electricity",
    "gay",
    "humiliation",
    "Jock",
    "leather",
    "Male Sub",
    "mask",
    "master",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "slave",
    "submission",
    "suspension",
    "violet wand"
  ],
  "title": "Bound bodybuilding god at the hands and torment of Mr Keys"
}