{
  "collections": [
    "Bound Gods"
  ],
  "description": "Trapped and alone in a dungeon, Damian Taylor struggles on his knees, bound to an elevated vertical wooden post. Fastened with leather belts and rope, he pulls and writhes, looking around frantic, wondering how he got into this predicament. In saunters Jaxton Wheeler looking like he just stepped out of a Tom of Finland sketchbook, wearing a leather harness and tight leather jeans. Damian cusses at him through a leather wrapped ball-gag. Amused, Jaxton wraps his fingers around Damian’s neck and gives it a little squeeze. Jaxton taunts him with scissors then cuts Damian’s clothes off, slapping and punching his bare chest and stomach, making Damian’s cock rock hard. Jaxon grabs and sucks Damian’s cock, unbuttons his leather jeans and whips out his hog, grabbing Damian by the hair and fucks his mouth. Later we find Damian lying prone on the wooden floor with his arms bound behind his back with black rope, licking Jaxton’s leather boots clean as he gets hit repeatedly with a crop. Jaxton picks him up and sits Damian’s asshole on top of his fat cock. Damian’s ass reluctantly slides onto it and joyfully acclimates to its girth, bouncing up and down while Jaxton reaches around and jerks his cock. In the final scene Damian stands naked with his legs spread, each ankle tied with rope to two wooden pillars, hands bound with leather covers and tied to the ceiling. Jaxton walks up and pulls Damian toward him by grabbing only his cock and balls and begins flogings his chest and stomach. Jaxton turns it up and flogs his ass and back even harder. Turning it up even further Jaxton continues flogging Damian’s chest and stomach with full hard swings until Damian yells for mercy. Jaxton shows mercy by burying his cock deep into Damian’s ass and pounds the cum right out of him. With gratitude, Damian takes Jaxton’s cock in his mouth and gets a hot load in the face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Damian Taylor",
      "person_id": 46461
    },
    {
      "name": "Jaxton Wheeler",
      "person_id": 53352
    }
  ],
  "release_date": "2017-10-12",
  "scene_id": 42718,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Flogging",
    "Gag",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Punching",
    "harness",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Slapping",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Built and Bullied in Bondage"
}