{
  "collections": [
    "Bound Gods"
  ],
  "description": "Submissive muscle stud Ace Era stands between two vertical wooden pillars wearing a tight black bodysuit, black boots, and a leather mask that has him blindfolded, gagged, and breathing like Darth Vader. Each ankle and wrist is bound with rope keeping his legs spread and arms stretched out looking like a comic book hero trapped in an impossible predicament. In struts Sebastian Keys wearing all black leather from head to toe. He runs his gloved hands over Ace's protruding muscles and squeezes his ripped shoulders and biceps. Sebastian unzips the fly on Ace's bodysuit and reaches in. He pulls out his big cock already rock hard. Next Sebastian unzips the top of Ace's bodysuit and slaps his bare chest and abs. Sebastian grabs the flogger and goes full swing on Ace's cock. Ace yells muffled screams through the ball-gag as the flogging continues on his dick, chest, abs, and back. Blindfolded and gagged, Ace can't tell when or where he's going to be hit next, or with what as Sebastian discretely switches to the cat-o'-nine-tails, and slices it across Ace's back and ass without warning. In the next scene, Ace is lying face-down hogtied on a dirty mattress. Sebastian canes his ass and legs then shoves his cock in Ace's mouth. Next Ace is bound on his back spread-eagle on the same dirty mattress wearing only a rubber bit in his mouth to bite down on. He'll need it as the electricity surges into his asshole from the electric butt-plug Sebastian shoved up there. Ace wiggles and screams to the pulsing ass electrocution making Sebastian's dick even harder. Sebastian pulls the toy out and fucks his slutty asshole deep. Sebastian shoots a monster load into Ace's mouth and Ace cums all over Sebastian's leather boot, immediately lapping it up clean like a dog.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Ace Era",
      "person_id": 60600
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2017-10-19",
  "scene_id": 42720,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot",
    "Cop",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Flogging",
    "Gag",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "Mask",
    "master",
    "Muscle",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Stud",
    "Submission",
    "top"
  ],
  "title": "Ace Era: Butt-Fucked Beaten and Bound"
}