{
  "collections": [
    "Men On Edge"
  ],
  "description": "Wide eyed and innocent. That's how Sebastian likes the men that he lures into his dungeon. Jack Andy is all smiles and nervous excitement as he saunters into the slave pit, but little does he know that a master sadist is lurking in the shadows waiting for his opportunity to edge repeated and unwanted multiple orgasms from his vulnerable prey. Sebastian starts off with a bang and binds Jack in tight and restrictive rope bondage. A leather hood is placed over his head so he blindfolded and unable to see. Sebastian slowly circles his masochistic submissive, teasing him and playing with his blind deprivation. He roughly grabs at the spiked leather codpiece that that his kinky man slave is wearing, and watches as Jack's cock swell with excitement. He the digs in and devours Jack's massive cock. Teasing just the tip, he begins to edge Jack towards the first of many orgasms. Sticky pre-cum oozes out and Sebastian deepthroats and gags on his slaves fuck rod. Jack's toned and muscled body trembles as Sebastian backs off at the last second, depriving the submissive of the pleasure of cumming. Sebastian laughs as he plays with his boy toy. Jack begs to cum but Sebastian loves orgasm denial and doesn't think his pet is worthy of release. Without missing a beat, Jack is then tied with his legs up in the air and his arms bound to ground, exposing his tight asshole to unwillingly penetration. Sebastian stifles the cries for help from his captive slave with a ball gag making Jack's plea's to cum barely audible. His body shakes with depraved desire as Sebastian edges him within a heartbeat of cumming only to deny him again and again. Before he cums first his tight asshole needs to penetrated by a massive dildo. Sebastian jams it in and out and stimulates his sub's prostate making the pain of orgasm denial all the more intense. And, when Jack is sweating and begging to cum over and over again Sebastian jams his cock into his mouth allows his slut slave to cum. A massive load of jizz explodes from Jack's cock and Sebastian scoops all of it up and stuffs it all into his humiliated slave's mouth.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jack Andy ",
      "person_id": 60406
    }
  ],
  "release_date": "2017-10-24",
  "scene_id": 42722,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "deprivation",
    "dildo",
    "dungeon",
    "Edging",
    "gag",
    "gay",
    "Hood",
    "kinky",
    "leather",
    "Male Handler",
    "Male Sub",
    "master",
    "multiple orgasms",
    "oral sex",
    "orgasm denial",
    "pain",
    "Prostate Stimulation",
    "rope bondage",
    "slave",
    "Stud",
    "tickling"
  ],
  "title": "Submissive Stud Jack Andy Bound in Rope and Fucked in the Ass!!"
}