{
  "collections": [
    "Alternadudes"
  ],
  "description": "Nothing can stop these three horny guys as they start off sucking any cock they can grab. They make out in a pile of flesh until Rob and Murphy each take a side of Christian as he gets his ass rimmed and his dick swallowed at the same time. Christian takes control and face fucks Rob hard until the three of them get on the floor to make a chain.\nThey keep on sucking ass and dick and Rob gets on his knees to service both tatted hotties at the same time. He gets both their cocks in his face and gobbles and gags and spits as he services their nice hard dicks.\nMurphy is the first to stick his ass in the air and Christian mans up to fuck him deep. Christian's balls slap and bang on Murphy's ass as the rocker stud pounds his hairy hole hard. Rob takes his turn with Murphy and slides his cock deep inside to ream his tender asshole. All three trade off being the bottom hole for any dick they can get.\nThe three make a chain and fuck and get fucked until Rob gets on his knees to take Murphy's big thick load all over his face. Rob gobbles it up as he cums on his own stomach. He's drenched in jizz as Christian has a seat on the couch.\nChristian sits back and jacks his rod until his balls burst and unleash a stream of sperm all over his hairy body. Murphy and Rob vie for the chance to lick it up and they all kiss in a big cummy three-way make-out session to cap off their awesome sex romp for the day!",
  "directors": [],
  "models": [
    {
      "name": "Christian Matthews",
      "person_id": 60418
    },
    {
      "name": "Murphy Maxwell",
      "person_id": 60419
    },
    {
      "name": "Rob Benson",
      "person_id": 60420
    }
  ],
  "release_date": "2017-09-07",
  "scene_id": 42724,
  "tags": [
    "Anal",
    "Blowjob",
    "bottom",
    "Bush",
    "Facefucking",
    "Facial",
    "Gag",
    "Gay",
    "Hairy",
    "Handjob",
    "Oral Sex",
    "Rimming",
    "Stud",
    "Tattoo",
    "thirdparty",
    "Threesome"
  ],
  "title": "Rocker Dudes Have a Threesome"
}