{
  "collections": [
    "Men On Edge"
  ],
  "description": "A man and his hog. The two should never be separated. Ace Era has a special motorcycle that has been in his family for ages. It belonged to his Daddy who loved the feel of leather between his legs and the vibration of the engine in his cock. Like father, like son and needless to say this motorcycle is Ace's pride and joy. Like all good submissive boy sluts, he brings it to the best mechanics in town to be pampered and serviced. Money's no object when it comes to his baby and when Sebastian and Dominic bring him a huge bill for services rendered he doesn't hesitate to whip out his well used credit card to cover the costs. While Dominic runs the credit card, he brags to Sebastian about his bike and how he loves a big stiff ride. We will never know if the card was really declined or if guys were just fucking with him so they can abuse his hot muscled body, but one way or another Ace Era had to pay the ultimate price to get his hog out of hock. The boys quickly overrun Ace and restrain him in tight and restrictive rope bondage. Ace finds himself helpless and vulnerable to the cruel and sadistic intentions of these two wicked dom's. They shove a huge ball gag into his mouth to silence Ace's pleas for mercy and then quickly cut off all his clothes revealing his massive and stiff cock. Ace's mouth is saying \"no\" but his huge rod is screaming \"yes!!\" This little butt slut loves to be abused and edged towards unwilling orgasms. The sadists toy with him and pinch the head of his cock closed so he can't cum. They torment him with a vibartor that stimulates the tip of his penis and sends him into frenzied spasms. His whole body quivers as he begs to cum, but his cruel task masters haven't even begun to extract their payment from this boy toy. They throw him to the ground and tie his legs wide open to expose his tight asshole. They reach inside him and stimulate his prostate and watch the tiniest amount pre-cum ooze from his cock hole. Ace is blindfolded and has no idea what Dominic and Sebastian are doing to him. He fights and struggles but the rope bondage is inescapable. He is fucked and he knows it. The two dom's take out a massive dildo and cram it into his asshole and he moans in unwilling ecstasy. They stroke his cock and edge him ever so close to cumming and then laugh at him as he shakes from the the denial. He can't take it anymore and finally Sebastian allows him to blow a huge load of cum all over himself. Having grown tired of their male sexual slave the two sadist walk away and leave Ace struggling in vain to escape from the bondage. They will fuck him again tomorrow until he has paid off his debt.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Ace Era",
      "person_id": 60600
    }
  ],
  "release_date": "2017-11-07",
  "scene_id": 42723,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "Cut",
    "dildo",
    "Edging",
    "gag",
    "gay",
    "leather",
    "Male Handler",
    "Male Sub",
    "muscle",
    "oral sex",
    "Prostate Stimulation",
    "rope bondage",
    "slave",
    "Stud",
    "tickling"
  ],
  "title": "Muscle Stud Ace Era Dominated in Rope Bondage and Edged to Cum! "
}