{
  "collections": [
    "Alternadudes"
  ],
  "description": "Murphy's sink has a leak and when his plumber shows up to fix it, they both soon forget about the work at hand as Murphy reaches into Timarrie's bulging jumpsuit and pulls out a big black cock. Murphy gets on his knees and takes the big dick down his throat as Timarrie face fucks the long haired rocker dude. Murphy gags as Timarrie's cock grows bigger and fatter in his mouth. Timarrie can't keep his hands off of Murphy's tight asshole and bends down to eat him out. His tongue plunges in and out of Murphy's tasty ass, opening him up and getting him loose for what it's about to receive.\nTimarrie slowly slides his long and girthy big black cock inside Murphy's tight hole. He goes slowly at first, making sure Murphy can handle his massive meat. When it's clear that Murphy can take whatever you throw up his ass, Timarrie goes to town, and like every good plumber, he plunges Murphy deep. At one point, Murphy goes ass to mouth when he sucks on Timarrie's dirty cock!\nThese two hotties fuck hard until Murphy begs for Timarrie to cum in his mouth. Timarrie has different plans, however, and bends Murphy over to jack off on his freshly used and stretched out asshole. Timarrie dumps a massive creamy load all over Murphy's hole and then fucks it deep into the rocker. The sensation of getting another man's cum fucked into him makes Murphy blast his own load. The two of them swap cum as they kiss and feed it to each other.\nAll would be well in the universe except that Murphy still has a broken sink. Timarrie happily gets on his hands and knees and starts fixing the sink in the nude. Hey Timarrie, you can snake an Alternadude drain any time you want to come back!",
  "directors": [],
  "models": [
    {
      "name": "Murphy Maxwell",
      "person_id": 60419
    },
    {
      "name": "Timarrie Baker",
      "person_id": 60413
    }
  ],
  "release_date": "2017-11-16",
  "scene_id": 42733,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Bareback",
    "Big Ass",
    "big dick",
    "Black",
    "blond",
    "Blowjob",
    "brunet",
    "Bush",
    "Deepthroat",
    "domestic",
    "drool",
    "Facefucking",
    "Gay",
    "Interracial",
    "muscular",
    "Rimming",
    "Role Play",
    "Tattoo",
    "thirdparty",
    "white"
  ],
  "title": "Rocker Dude Gets Plunged"
}