{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Lily Lane LOVES Christmas. She can't seem to focus on anything other than Christmas even when she's at work. Her love and obsession for the holiday have interfered with her job. Her hot sexy lady boss, Aubrey Kate, thinks the holidays are really dumb. She won't even allow the office to get decorated. Kate feels the holidays are just a distraction and it makes her steaming mad that no one gets any work done around the office during the holidays so Aubrey makes it VERY VERY clear to Lily that she must have a report turned in before the end of day on the eve of Christmas. Lily assures her boss that the report will get done however after being distracted by baby Jesus videos, Lily loses track of time and runs out of the office so she can go home and wait for Santa. Lily is cozied up by her Holiday tree writing a letter to Santa in which she requests a big cock for the holidays. There's a knock at the door and Lily instantly assumes the greatest of all time Santa has delivered her wish within seconds. She invites the presumed cock into her home only to find out the uninvited guest is actually her boss, Aubrey Kate who is there to collect the report that Lily Promised. Aubrey finds the note to Santa and instantly feels sorry for Lily. Aubrey knows how she can punish Lily for not turning in the report in time AND give Lily her Holiday bonus all at once. Aubrey ties up Lily with rope bondage and chain bondage and gives Lily exactly what she asked Santa for: a big hard cock. Lily gives Aubrey a foot job, blow job and strap-on ass fucking job. Lily really takes her aggression out on her mean boss but she also shows tenderness to her awesome boss who has given her exactly what she wanted for xmas",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Aubrey Kate",
      "person_id": 51491
    },
    {
      "name": "Lily Lane",
      "person_id": 50199
    }
  ],
  "release_date": "2017-12-18",
  "scene_id": 42745,
  "tags": [
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "Brunette",
    "christmas",
    "Cock Worship",
    "fake boobs",
    "holidays",
    "Latin",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "All Lily Lane wants for Christmas is a Nice Hard Cock"
}