{
  "collections": [
    "Device Bondage"
  ],
  "description": "All natural stunner Casey Calvert returns to serve at the boot heel of her favorite male dom. The Pope tosses her into his filthy dungeon and immediately shackles her slender frame to a wooden wedge that splits her tiny pink pussy in half. Leather cuffs and metal shackles firmly and completely restrain her, exposing her tits and ass to brutal impact play and torment. Casey lets out guttural screams that are so primal that they shake the cum stained floor of The Popes dungeon. She shakes and growls as the first of many multiple orgasms are ripped from her unwilling cunt. But this is just the warm up; merely a chance for The Pope to tenderize his meat for the main course. Before Casey can regain her composure, The Pope lays her on her back and spreads her legs wide open exposing her teeny cunt and tight asshole to his cruel intentions. First he ruthlessly attacks the soles of her perfectly manicured feet. He digs into the crevices that hide the nightmares of fragile psyche. With nothing more than switch of bamboo cane he torments his female slave and revels her shrieks of terror. Her hands and feet convulse and shake like a captured seal fighting for dear life to escape from its trap. But the bondage is inescapable and Caseys pleas for mercy fall on deaf ears. The Popes sadistic fever becomes incensed. He attacks her asshole, probing his massive hands in and out until she cums uncontrollably. Sweat soaks her sobbing frame as a vibrator relentlessly stimulates her swollen and engorged clit. To finish her off The Pope shackles the soles of her feet together and her arms spread to the sides. He meticulously attaches scores of clothes pins together into a massive zipper that spans the entire front of Casey's body. He then indulges in breath play and repeatedly chokes and throttles his captive slaves fragile neck. As Casey floats in and out sub space The Pope vibrates her pussy with a hitachi and when her depraved pleasure reaches a fevered peak he tears the zippers off her body. Casey's entire body shakes as she screams and begs for The Pope to abuse every square inch of her battered body.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2018-02-22",
  "scene_id": 42756,
  "tags": [
    "Athletic",
    "BDSM",
    "Best of Anal",
    "big dick",
    "Bondage",
    "Boot",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Feet",
    "Female Slave",
    "Fingering",
    "Foot Torment",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Leather Cuffs",
    "Metal Bondage",
    "multiple orgasms",
    "natural boobs",
    "Petite",
    "shaved",
    "Slave",
    "Straight",
    "Sub",
    "Submission",
    "switch",
    "Tattoo",
    "The Pope",
    "toned",
    "Vibrator",
    "white",
    "Zipper"
  ],
  "title": "Petite Babe Casey Calvert Humiliated with Anal and Brutal Foot Torment"
}