{
  "collections": [
    "Hogtied"
  ],
  "description": "Some girls are born to serve. Cadence Lux is the kind of all natural girl next door that looks great in bondage and even better with tears gushing from her eyes as she wallows in agony. She is the kind of female sex slave that sends The Pope's sadistic tendencies into overdrive. From the moment the shoot starts he zeros in on her toned and tanned body and molests every inch of it with his giant hands. Cadence kneels perched on a pedestal with her arms tied behind her and a giant ball gag stretching the corners of her mouth open. As cries out muffled and choked pleas for mercy as The Pope abuses her small natural breasts and tits with nasty clover clamps and a leather riding crop. Juices ooze from her hungry pussy every time she gets hit. This pain slut will do anything to have multiple orgasms ripped from her pussy and she signs a deal with devil to get them. Cadence looks so innocent and helpless as she dangles in a full suspension supported only by cruel and nasty rope bondage. She winces in pain every time she moves to avoid the dom's cruel intentions but her efforts are in vain because the bondage is inescapable. The Pope spanks her vulnerable and exposed ass and mercilessly attacks her swollen clit. She yelps in pain as he digs his fingers into her tiny pink pussy. The Pope takes all the unwilling orgasms that he wants from her greedy whore hole. Cadence squirts all over the place as he chokes her out and stimulates her clit with a vibrator. The pain from the non-stop coerced orgasms becomes so intense that she begs for the vaginal penetration to end. But to be granted mercy in one part of her body only means that Cadence is only going to suffer even more in another part of her body. And suffer she does. The Pope flips his bitch on her back and attacks the soles of her feet with a long bastinado session. He digs into her foot, finding all the hidden dark recesses of her soul that can only be exposed by the searing pain of foot torment. With each cry of pain The Pope's attention only becomes more focused and her agony only deepens. And to finish his sexual plaything off, The Pope then makes her squirt over and over again until she is breathless, quivering, and dehydrated. Cadence Lux makes suffering look so good.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2018-01-18",
  "scene_id": 42752,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Feet",
    "Fingering",
    "Foot Torment",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "multiple orgasms",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "Slave",
    "Squirting",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "All Natural Cadence Lux Torment in Rope Bondage and Squirting Orgasms!"
}