{
  "collections": [
    "Hogtied"
  ],
  "description": "Porn starlet and submissive sex princess Abella Danger returns to lick the boots of her favorite dom. The Pope has worked Abella over so many times that he understand every impeccable inch of her toned body and perfect booty. He wastes little time and immediately restrains his submissive sex slave in tight and inescapable rope bondage that leaves her ass exposed for his wicked torment. He spanks Abella's butt until she screeches from the searing pain that comes from an ass that has been turned bright red. As endorphins race through her body and the thrill of a vibrator stimulates her clit, she gags and gasps for air as the sadistic dom chokes her fragile neck. Before she can catch her breath, The Pope snatches her legs and ties them spread eagle out to sides, fully suspending her by her chest and ankles. In this position he attacks her tiny pussy and rips multiple orgasms from her unwilling cunt. For the next scene The Pope ties her into a tight ball and attacks her nipples with clover clamps. He then ties the clamps to her toes so that every time she clenches from agony of his impact play, she tears the clover clamps off of her tender titties. The Pope only laughs as she begs for mercy and jams a hitachi onto her swollen and sensitive clit. Tears seep from her eyes as the the pain of non-stop orgasms make every inch of her pussy ache. To finish her off The Pope lays his bitch down and ties her legs open around some posts. He then takes a gigantic dildo and abuses her already sensitive pussy until Abella's whole body is shaking violently from the complete sensory overload. And when he has had enough of his little sex toy, he leaves her panting and broken begging to be untied and set free.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Abella Danger",
      "person_id": 56157
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2018-02-01",
  "scene_id": 42757,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Clover Clamps",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Fingering",
    "Handler",
    "Hitachi",
    "Humiliation",
    "multiple orgasms",
    "Pain",
    "Rope Bondage",
    "Slave",
    "Straight",
    "Submission",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Hot Body Abella Danger Disciplined and Made to Cum in Rope Bondage!!"
}