{
  "collections": [
    "Fucking Machines"
  ],
  "description": "It has been about a year since Cadence Lux was fucked senseless by our non-stop fucking machines. First she shows of her all natural body and small perky tits while playing with her tiny pink pussy. As fingers toy with her hungry cunt, she grinds a hitachi onto her swollen and sensitive clit. As her body tenses from the multiple orgasms that her exploding her pussy, she folds her flexible legs around her body and cums with delight. Once warmed up, she leans back and spreads her legs so the first fucking machine can penetrate her vagina with giant dildo. The machine starts off slowly and spreads her pink pussy lips back and forth as her cum juices begin to grow wetter and wetter. As the speed increases she purrs with joy as she gets pounded into submission. As she climaxes she pulls the dildo out of cunt and explodes the first of countless squirting orgasms from whore hole. Breathless, she crawls across the floor to worship the next fucking machine. She stands at attention and squats directly over a machine and smiles as it slides in and out of her. The pace quickly mounts and in the heat of the moment she grabs her throat with her hands and chokes herself as she squirts over and over again all over herself and the machine. Such a messy good girl. Now she is glowing from the shear delight of the experience; no man has EVER fucked her this hard and fast before. But a whore like Cadence is never satisfied and she grins with delight as our fast and strongest machine is prepped for her pleasure. She lays back on the floor and fucking machine plows her swollen and aching pussy until she squirts all over the machine. Steam sizzles off of the machines motor as she greedily devours all 10 inches of the massive dildo that his slamming in and out of her teeny pussy. And in one last moment of ecstatic bliss she expels a massive load of female ejaculation and slumps back breathless swimming in a pool of her own pussy juices and sweat.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    }
  ],
  "release_date": "2017-12-06",
  "scene_id": 42753,
  "tags": [
    "Blonde",
    "Dildo",
    "Hitachi",
    "Machine Dildo",
    "multiple orgasms",
    "natural boobs",
    "shaved",
    "Squirting",
    "Straight",
    "Submission",
    "switch",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "All Natural Blonde Babe Cadence Lux Squirts All Over Fucking Machines!"
}