{
  "collections": [
    "Hogtied"
  ],
  "description": "She's back!! Kink.com female sex slave legend Krysta Kaos returns so she can be punished and humiliated in The Pope's sadistic dungeon. Her petite body is toned and adorned with beautiful tattoos that show off her love of extreme pain. The Pope wastes no time and strips her naked so he can grope and abuse her tits and firm ass with his massive hands. He prods all of her orifices and stimulates her perky nipples with hard slaps and punches. She purrs and begs to be punished and The Pope is only too happy to oblige. He works over her body from head to toe with a heavy leather flogger until he cries for mercy are deafening. The only mercy that Krysta finds is vibrator jammed onto her swollen and sensitive clit. She screams from the torment of multiple unwanted orgasms. The pain becomes so extreme that she lifts herself off the ground and bends completely backwards while howling the depraved screams of masochistic whore. Next Krysta gets tied in a nasty full suspension that spreads her precious pussy wide open. The full weight of her body digs into the tight and restrictive rope bondage. Her every movement intensifies the pain of predicament and The Pope takes full advantage of her vulnerability. He takes a giant dildo and shoves it into her greedy whore hole and smiles a sadistic grin as Krysta cries out from the pain of the vaginal penetration. But her mood quickly shifts as the massive rod jams in and out of her tight and tiny pussy. As juice drips from her cunt she cums and struggles against the bondage to to escape the torment of the multiple orgasms. The Pope then ties her in a squatting position and lashes severe clover claps to her sensitive nipples. He yanks them across the room and every time Krysta moves the searing pain of the breast abuse increases. But she only craves more and her depraved lust will only be satiated after cumming over and over again. To finish his sexual plaything off, The Pope ties her spread eagle to a bed and mercilessly attacks her tits and pussy with every impact tool he has at his disposal. A vinyl flogger tears at her flesh, while a horse hair flogger stings her like the bites of thousand psychotic bees. As the front of her body glows red from the abuse, her pussy glistens with cum and she begs her dom to allow her to orgasm. Her whole body twists and contorts as a hitachi vibrates her sore pussy until she explodes one last explosive orgasm and screams from the pleasure that a masochistic slut finds from being tormented with unbelievable pain.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "The Pope",
      "person_id": 27779
    },
    {
      "name": "Krysta Kaos",
      "person_id": 25624
    }
  ],
  "release_date": "2018-01-04",
  "scene_id": 42754,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Breast Abuse",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "dungeon",
    "Fingering",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "multiple orgasms",
    "Pain",
    "Pain Slut",
    "Petite",
    "Rope Bondage",
    "Slave",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Alt Dream Girl Krysta Kaos Abused and Fucked in Extreme Rope Bondage!!"
}