{
  "collections": [
    "The Training Of O"
  ],
  "description": "With a stocking over her head and a blindfold covering her eyes, the beautiful submissive, Ella Nova is on her knees, arms stretched and tied at the wrist and thighs with rope to two vertical pipes. James Mogul flogs her back and ass as he comes up with a subject for the day's syllabus. Charles Dera enters the scene with his dick hard while Ella waits for it with her mouth open and tongue out. Charles shoves his dick down her throat and Ella sucks it with zeal. Displaying to Mogul what an obedient slut she's being, he rewards her with a vibrator for her pussy but cannot cum until he says to. James turns it up a notch and slides a clear glass butt-plug into Ella's ass and presses the vibrator hard against her clit. Ella cums hard, yelling and squirming on her knees. In the next scene Ella finds herself in another predicament, tied face down and ass up, to a wooden table. Mogul crops her exposed pussy making her repeat the word 'please' over and over to the beat of the crop. Mogul steps aside and Charles slowly sinks his cock into Ella's pussy and pounds away. In the final scene Ella is on her back, arms tied above her head with one leg frog-tied to her chest and the other sticking straight in the air, tied to the ceiling. James Mogul uses the flogger on Ella's ass, warming it up for Charles' cock. Charles once again enters the scene rock hard and tells Ella to \"open up\" as he presses the head of his cock against her ass. Charles pounds Ella's ass while intermittently fucking her mouth to clean her juices off of his cock. In the final scene, James has Ella squatting in the middle of the room holding two heavy silver trays. She must take Charles' load in her mouth without dropping them.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Ella Nova",
      "person_id": 51866
    }
  ],
  "release_date": "2018-01-16",
  "scene_id": 42766,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Straight",
    "Vibrator"
  ],
  "title": "The Supremely Subservient, Ella Nova "
}