{
  "collections": [
    "The Training Of O"
  ],
  "description": "Gorgeous blonde bombshell Britney Amber has no idea what she's getting into when she signs up for Training of O. But she's here now and must endure all the intense unknowns. Britney begins her training strapped on her back to a fuck bench, with her hands encased, her ankles bound, and a vibrator strapped to her pussy by a metal frame suspended above her. She's immediately educated in proper respect, being told to say thank you whenever she's given nice things. Nice things like cock sliding down her hungry throat, the vibrator turned on high, clothes pins clamped on her nipples and connected to the vibrator, linking her big round tits to her pussy. Seth Gamble repeatedly face fucks her as the spit runs out of her mouth over her face. Britney is then tied on her knees, with her head down on the bench as she's flogged and cropped, and at the same time tormented by the vibrator again. Seth fucks her exposed pussy and ass, plowing both holes wide open as Britney screams through her ball gag. She's taught to say please for nice things, in addition to thank you, and isn't released until she's clear on the purpose for both. She's then made to test her endurance, by riding cock for as long as she can, fast and slow, however she's ordered. In her pussy and in her ass. Both holes get fucking worked as Britney's resolve is tested and broken. Finally she's put on her back again and repeatedly fucked in both holes, and drilled again on the lessons for the day. Thank you for nice things. Please for nice things. And in the end, a fuckload of hot cum shot all over her face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Britney Amber",
      "person_id": 57340
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2018-01-02",
  "scene_id": 42765,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "blonde",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "gag",
    "Gimp",
    "humiliation",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "straight",
    "vibrator"
  ],
  "title": "Britney Amber's Intense Whore Endurance Training"
}