{
  "collections": [
    "The Training Of O"
  ],
  "description": "The beautiful young perky brunette JoJo Kiss arrives chained to the ceiling and fully tied up in restrictive rope bondage. Her mouth is gagged with fabric from her torn pink shirt. Her perky tits bursting out exposed for her master and ready for training. When Tommy arrives she is allowed to sit up straight and begin her brutal obedience training. This slut has a lot to learn and it starts with the flogger. This submissive slut is made to lift her fucking whore head and open her mouth to do her job swallowing cock as far as she can go. She needs to learn to be a proper submissive slut by keeping her eyes open while pleasuring her trainer. Next JoJo is restrained in rope with her ass spread wide open in the air, ready for more beating and training. Tommy flogs her ass bright red before pounding his hard cock deep down her tight wet pussy hole.Her tits fully exposed get slapped and squeezed hard. JoJo's mouth is stuffed with a red ball gag and her screams of pain are muffled in Tommy's training office. Alternating pleasure and pain, Tommy flogs and fucks her stunning ass. This submissive whore wants all her holes filled tight and begs Tommy for deep hard anal penetration. JoJo delivers as promised and is fucked soo hard her ass gapes for more. This slut learns the best way to please is to cum deep and hard from anal gape fucking. Finally JoJo gets what she needs, a face full of cum. With her eyes wide open, her asshole spread wide, and her face full of cum, this training day is complete.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "JoJo Kiss",
      "person_id": 59258
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2017-12-05",
  "scene_id": 42763,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gag",
    "Gaping",
    "Gimp",
    "Humiliation",
    "master",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Straight"
  ],
  "title": "Submissive Young Slut JoJo Kiss Endures Deep Anal Training"
}