{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Cute and sexy Marica Hase is The Perfect Gift for big tits Lauren Phillips and fat cock Ramon Nomar.\nLauren is stressed out from doing all the housework at their new ranch. She just wants a little help around the place so Ramon has a little surprise for his curvaceous wife: A petite and willing Asian slave girl for this kinky couple to indulge their whims and fantasies. Ramon reveals this hot little package hanging from a tree in a fetching rope suspension. Lauren is excited to have a servant of her very own and is anxious to get started having her dirty way so she starts with the flogger while Ramon gets his cock sucked and fucks Marica's pussy. Then Lauren peels off her sexy little jumper to unveil her big perky tits and makes Marica lick her pussy. The fun has just begun.\nNext Marica the slave girl is chained up in the corner with leather collar and a ball gag. Lauren is decked out in a tight black latex corset with thigh high stockings and high heels, she has two tasks for Marica to complete: first clean the floor and then clean her pussy! She throws a towel to her willing servant and makes her scrub the floor on her hands and knees. Marica's back is arched and her ass high in the air while she performs her cleaning duties. Lauren can't wait any longer to get some attention on that horny pussy, she puts one leg up on the counter, spreads her legs wide and and sets Marica to task on licking her pussy until she cums.\nLater Lauren finds Marica sucking Ramons dick while he's watching tv and disciplines her for not following orders. She bends Marica over the couch and spanks her little ass and thighs until they turn bright red. Ramon takes charge and tells the girls to take position. Lauren on the floor on her back with legs spread eagle and Marica chained and collared next to her. He punishes them with the flogger and reminds them they are there to serve him! Then he fucks Lauren in the ass while Marica eats her pussy and cleans Ramons cock back and forth until Lauren is begging to cum. All day long Ramon ties the girls up in different hot positions and fucks them with his huge cock and a double dildo until finally both girls face each other and play with their pussies until they cum and Ramon shoots his load all over both of them.",
  "models": [
    {
      "name": "Marica Hase",
      "person_id": 44408
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2018-01-26",
  "scene_id": 42768,
  "tags": [
    "anal",
    "Asian",
    "ball gag",
    "bdsm",
    "big tits",
    "blowjob",
    "collar",
    "Corporal Punishment",
    "corset",
    "couple",
    "dildo",
    "domination",
    "gag",
    "high heels",
    "humiliation",
    "kinky",
    "latex",
    "leather",
    "Petite",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "Stockings",
    "straight",
    "submission",
    "suspension",
    "Vaginal Penetration"
  ],
  "title": "The Perfect Gift"
}