{
  "collections": [
    "The Training Of O"
  ],
  "description": "The utterly fuckable Carmen Caliente brings her sweet looks all the way down to the ground as she trains to take all the cocks, at any time, from anyone. Caged, she's tied to the bars by her wrists and neck, while Tommy Pistol fucks her wet, hungry mouth and throat. She's locked in place, able only to swing her hot, perfect ass while she sucks hard dick. Tommy seals up her pussy with clothes pins, so she suffers the humiliation and pain while he spanks her and continues to drive his cock into her mouth. Satisfied that she has learned the first part of her purpose, he removes the clothes pins, sending pain shocks through her pussy, before letting her out of the cage. Carmen is then tied head-down and ass-up to a rough burlap table, while Tommy continues his relentless training. He flogs her and fucks her at the same time, then chokes her with cock so her throat and pussy are both dripping wet and tingling for more dick. Carmen begins to lose herself in the moment, enduring the pain and pleasure of being bound and gagged and simultaneously drilled. She's then flipped onto her ass, with her legs bound to a fuck bench spread wide open with her pussy exposed. Tommy takes full advantage, pounding Carmen's hot cunt and feeding her his cock, sending waves of pleasure through her so she learns her place even more. She begs for more cock. She begs to cum. She begs for it all from her Master. And she finally gets it as her reward. Tommy sits her down on his cock and makes her ride it, makes her twitch and sweat and cum as she repeats that she's to take all the cocks, at any time, from anyone. He then blasts her face with cum, and at that moment, she has learned her place.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Carmen Caliente",
      "person_id": 54927
    }
  ],
  "release_date": "2017-12-19",
  "scene_id": 42764,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "cage",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Gimp",
    "humiliation",
    "master",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "straight"
  ],
  "title": "Desperate Slut Carmen Caliente Trains For All The Cocks"
}