{
  "collections": [
    "Sex And Submission"
  ],
  "description": "While the cat's away the mice will play. When Maya Kendrick's boyfriend pays a surprise visit from jail she and her sexy play thing Kendra Spade are caught fucking around with each other redhanded! Markus Dupree can't believe his eyes when he sneaks up on his cheating girlfriend kissing and flogging some other chick but he's so horny from being in prison he decides pretty quick to get in on the action and relieve his aching cock. After a little bit of flogging and cropping to remind these beauties who is boss, the girls get down on their knees to worship Markus's dick with some deep throat, sloppy cock sucking. They want nothing more than to please him and it shows with their eager excitement. Markus ties the two of them up in doggie and goes in for some ass fucking right off the bat. Mayas tight ass can barely take his huge cock but its driving her crazy with pleasure and Kendra is happy to taste her friends ass when Markus stuffs his cock in her mouth. Ass to mouth and back again Markus fucks both of them in the ass and pussy deep and hard getting them all warmed up for the slutty squirt fest that is about to come. Flipped over on their backs with wrists tied to ankles Markus's hard cock pounds Maya's pussy out and then Kendra's hungry ass. She wants it harder and deeper and Markus delivers until Kendra's hot pussy explodes and gushes squirting again and again.The squirting never ends until Markus shoots his load all over their faces. There is no crime in cumming in this week's SAS update My Hard Time Boyfriend. Check out 19 year old newcomer Kendra Spade in her first SAS shoot ever! It's a squirt fest with pussy eating, girl on girl, ass to mouth, toe sucking, wild orgasms and more!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Kendra Spade",
      "person_id": 60694
    },
    {
      "name": "Markus Dupree",
      "person_id": 42128
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    }
  ],
  "release_date": "2017-12-01",
  "scene_id": 42770,
  "tags": [
    "19-Year-Old",
    "Anal",
    "Ass To Mouth",
    "BDSM",
    "Blowjob",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Humiliation",
    "Pussy Eating",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Squirting",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "My Hard Time Boyfriend"
}