{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Sexy blonde officer of the law Cherie Deville tells Markus Dupree that his Visa application has been denied he flips out and takes matters into his own hands. Markus needs that Visa ASAP or he will be sent back to Russia and that just can not happen. After trying to bribe Cherie she arrests him but before she can get the cuffs on his wrists he flips out and goes Russian on her ass. He cuffs Cherie's wrists together, puts her on her knees and gives her a deep hard throat fuck with his big cock. He is going to get that VISA no matter what it takes. She sucks his cock all over the room, on the couch, upside down and then they go to pound town. First he fucks Cherie's pussy and then fills her tight ass with his huge hard cock. He ties her up on the couch in doggie with a leash, leather straps and cuffs, a spreader to keep her legs open and ball gag to keep her quiet and drooling. Her lacy stockings are still on tight around her thighs as he punishes Cherie with the flogger. After some grueling corporeal Markus gets back in that ass and fucks her hungry hole till its gaping. She sucks his cock clean, he flips her over and hammers her ass making it gape again. Then with her wrists, ankles and neck strapped with a leather collar Markus fucks Cherie's ass into a new dimension. He is a fucking machine totally dominating Cherie in every way, he tosses her around like rag doll fucking and pounding her into the submissive slut she is until he covers her face with his hot cum. Now, that's the American way! But will Markus get his Visa after all? Watch sexy ass Cherie Deville and fuck wonder Markus Dupree go to the outskirts of pound town in this weeks SAS Christmas special American Anal!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "Markus Dupree",
      "person_id": 42128
    }
  ],
  "release_date": "2017-12-22",
  "scene_id": 42775,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "blonde",
    "blowjob",
    "christmas",
    "collar",
    "Corporal Punishment",
    "domination",
    "gag",
    "gape",
    "Gaping",
    "holidays",
    "humiliation",
    "leather",
    "role play",
    "rope bondage",
    "Rough Sex",
    "Stockings",
    "straight",
    "submission",
    "throat fuck",
    "Vaginal Penetration"
  ],
  "title": "American Anal"
}