{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Brunette beauty Casey Calvert is the chosen new bride of The Church of the Slaves of the Living Savior but she is scared about what she will have to do to please her master Small Hands. Anal sex is the modus operandi of this sex cult and her day has come to prove she is a worthy slave. Dressed in a sexy, short white wedding gown with flowers in her hair Casey kneels before her master to accept his hard cock into her mouth. Small Hands ties her wrists together and throat fucks Casey into submission thrusting and plunging his divine dick into her wet, willing throat. Just when Small Hands is about to bless his bride with cum Casey makes a run for it to escape the wrath of her saviors huge cock stretching out her ass. Oh but the Living Savior will hunt his prey down and have his way with her whatever it takes. After a hunt through the forest he finds her hiding and drags her back to his culty dungeon and ties her up with rope to keep her close by his side. Rope covers her eyes and fills her mouth like a gag as she is leaning over the bed with one leg up exposing her ass and pussy. First he must punish his bride for running away so he flogs her butt and thighs and then for redemption strikes her ass with the paddle until it turns hot pink. And without further ado Small Hands slides his huge hard cock into Casey's ass and fucks her further into submission. He rubs her clit and pounds her ass and pussy until she is begging for him to stop but the ceremony has just begun. Small Hands ties his bride up in a chair with her legs spread wide open for easy access and goes to pound town on Casey again. He punishes her sensitive feet with the crop and then slides his long cock into her pussy, choking and slapping her until she cums. Another round of hardcore anal and Casey is writhing and moaning with pain and pleasure. And finally laying on her back tied up tight in spread eagle Small Hands fucks his new bride's pussy and ass to the point of no return until he shoots his sacred seed into a ceremonial bowl and anoints her with his hot holy load.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Small Hands",
      "person_id": 59499
    }
  ],
  "release_date": "2018-01-05",
  "scene_id": 42779,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "brunette",
    "choking",
    "Corporal Punishment",
    "crop",
    "domination",
    "dungeon",
    "Feet",
    "gag",
    "humiliation",
    "master",
    "Paddle",
    "pain",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slapping",
    "slave",
    "straight",
    "submission",
    "Vaginal Penetration"
  ],
  "title": "Anal Cult"
}