{
  "collections": [
    "Device Bondage"
  ],
  "description": "Petite sex kitten Alexa Nova makes her first appearance in The Pope’s sadistic dungeon. Her thin and fragile frame gets bent backwards into an extreme back arch that pulls her pale skin taut and vulnerable to evil intentions of sadistic impact play. The Pope works the front of her body over attacking her perky nipples and small natural tits with a heavy leather flogger. She squirms and cries out in pain as she tries to avoid his cruel intentions. But the bondage is unforgiving and unescapable and every hit sends shock waves of pain coursing through her tiny body. As the pain increases her pussy reacts by becoming wet with desire. This pain slut wants nothing more than to please her male handler and do whatever he tells her to do. But this isn’t about what she wants and she submits to The Pope’s depraved desires. His rage reaches a frenzied peak as her body dangles helplessly from the metal bondage and so he jams a hitachi onto her greedy pussy and watches with bliss as her body spasms uncontrollably from the unwanted orgasms. The Pope then tosses his pet to the floor and spreads her legs wide open. He renews his attack on her nipples and laughs as she howls from the pain. She begs for mercy and he obliged her by digging a blunted piece of metal into the most sensitive crevices of her feet. She screams and her feet spasm like the helpless flippers of snared seal but there is no escape from The Pope’s love of helpless girls pain. He laughs as tears stream out of the corners of her eyes and becomes incensed as she yells from the pain of multiple orgasms. As soon as he is satisfied with tormenting her tender feet, he flips her over and places her into a squatting position that makes her firm and toned ass stick out. He then beats and spanks her butt until it glows bright red. Alexa whimpers muffled and choked thank-you’s as The Pope’s massive hands molest her young and tiny frame. And when she can’t handle another moment of abuse, he shoves his massive man hands into her tiny pink pussy and rips orgasm after orgasm from her unwilling whore hole.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Alexa Nova",
      "person_id": 57359
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2018-01-11",
  "scene_id": 42773,
  "tags": [
    "BDSM",
    "big dick",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Feet",
    "Fingering",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Male Handler",
    "Metal Bondage",
    "multiple orgasms",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Petite",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "The Pope",
    "toned",
    "white"
  ],
  "title": "Petite Slave Alexa Nova Locked in Metal Bondage and Tormented Orgasms"
}