{
  "collections": [
    "Fucking Machines"
  ],
  "description": "What do you do when one of the hottest girls in all of porn walks onto your set and tells you that she needs to get fucked? The answer is simple: FUCKING MACHINES!! Casey is a slim and athletic sex kitten that looks so innocent. But don't let her girl-next-door image fool you because this girl has secret and depraved desires. She exudes raw sex appeal as peels off her tiny shorts and tight blouse. Casey warms herself up by spreading her legs wide open and playing with teeny pink pussy. Her cunt is already dripping wet as she massages her clit and outer lips. Using the head of a hitachi she teases her clit until she cums the first of many multiple orgasms. But that is just the start. She then begs for the first machine to fuck her as a huge dildo crams into her tight pussy and slowly begins to slide in and out. She smiles the grin of a greedy whore who knows exactly what she wants. The fucking machine quickly builds up steam and hammers her pussy relentless as one orgasm flows into the next. Before she can catch her breath, she reclines in retro white leisure chair that allows her hungry asshole to be penetrated by a machine. Casey is an anal queen and she quickly cums from being fucked in the butt. As the machine continues to heedlessly plow her asshole she grinds a vibrator on her swollen clit and cums again and again. To end her fuck fest, Casey lays down in a spoon position to show of her firm and round ass. Each time she orgasms she quickly switches between being fucked in the ass and being fucked in the pussy. Back and forth she goes until she explodes one last monumental orgasm that shakes the floorboards of the set like category 5 hurricane.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Casey Calvert ",
      "person_id": 36437
    }
  ],
  "release_date": "2017-12-20",
  "scene_id": 42772,
  "tags": [
    "anal",
    "athletic",
    "dildo",
    "Hitachi",
    "Machine Dildo",
    "multiple orgasms",
    "straight",
    "Vaginal Penetration",
    "vibrator"
  ],
  "title": "All Natural Sex Kitten Casey Calvert takes on Anal Fucking Machines!"
}