{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Big ass, hot Latina Kristina Rose wants a divorce and she's gonna take her ex for everything he's worth. That is until the divorce lawyer Derrick Pierce shows up with some dirt on conniving Kristina that puts her in a very precarious position. What transpires next will blow your mind! Derrick makes Kristina put handcuffs on and suck his cock every which way but loose. On all fours with red stiletto heels and her curvy sexy ass in the air Derrick throat fucks Kristina till she's slobbering and choking on his hard dick. He's going to get just what he wants from this scheming, no manners bitch! Then he flips her over on her back and makes her play with her pussy while she swallows his cock even deeper. There is no rest for the wicked. Derrick ties her up in tight restrictive bondage, stuffs a ball gag in her mouth and whips her into a frenzy with the flogger. He teases and taunts her with the zapper and then fucks her wet slutty pussy deep and hard. After pounding her pussy he busts out the Hitachi and vibes her pussy until she is moaning in pleasure. The last thing Kristina wants is to get fucked in the ass and that is just what Derrick has in mind. He stretches her tight hole with his driving, throbbing cock and then makes her lick it clean with her filthy little mouth. Kristina has been very rude to Derrick so he teaches her a lesson with the cane. On her back and confined in rope he hits her perky tits and then lashes her pussy and her delicate feet until she is wailing in pain. Nipple clamps squeeze her hard nipples and he punishes her more with the flogger. He vibes her clit relentlessly and hammers her bombshell ass and slutty pussy until he sprays his load all over this vivacious vixen's voluptuous body. Anal Coercion has never been so persuasive!",
  "models": [
    {
      "name": "Kristina Rose",
      "person_id": 20560
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    }
  ],
  "release_date": "2017-12-08",
  "scene_id": 42774,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "big ass",
    "blowjob",
    "bondage",
    "choking",
    "Corporal Punishment",
    "curvy",
    "domination",
    "Feet",
    "gag",
    "Hitachi",
    "humiliation",
    "nipple clamps",
    "pain",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Anal Coercion"
}