{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Raven haired cutie Gina Valentina has been misbehaving. She has a whole list of infractions going against her, including \"dick biting\" and Ramon Nomar is going to teach her a lesson about manners. Tied up and gagged with a leather collar and tight nipple clamps on her perky little tits Ramon disciplines Gina with the crop and flogger. He takes her gag out and Gina sucks his cock all sloppy and slurpy until she can't help herself and bites his dick. She just can't learn so Ramon unties her and sends her off into the wild to live like the animal she is. She runs off into the unknown with her perfect ass jiggling into the distance. Well Ramon likes fucking Gina too much to really let her go so Let's Hunt some Cunt! In an exciting chase scene Ramon stealthily tracks her down in the woods and drags her back to his slave quarters to finish punishing her and having his dirty way. He ties her up in doggie with wrists tied behind her back and goes to town on that fresh cunt he hunted down. Ramon fucks Gina's pussy spreading her wide open with his big dick. He puts the Hitachi on her clit and rides her cunt until she is screaming. Of course she has to ask for permission before cumming and Ramon makes her work for every single orgasm. Then Gina is tied up on the couch with the vibrator looking sexy and getting off. She is getting her pussy ready for more fucking. Ramon crops her tits, fingers her ass and gets her pussy so wet its dripping. A combination of the Zapper, vibrator and Ramon's pounding cock send Gina into pleasure town hollering with wild, non-stop orgasmic bliss. Hunting season is on!",
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Gina Valentina",
      "person_id": 58814
    }
  ],
  "release_date": "2018-01-12",
  "scene_id": 42780,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "collar",
    "Corporal Punishment",
    "crop",
    "domination",
    "gag",
    "Hitachi",
    "humiliation",
    "leather",
    "nipple clamps",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "submission",
    "Vaginal Penetration",
    "vibrator",
    "Zapper"
  ],
  "title": "Cunt Hunt"
}