{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Happy newlywed Marica Hase arrives to meet up with her husband with stars sparkling in her eyes. She's so excited to fulfill her fantasy of a doting submissive trophy housewife, however, she has no idea the dominance she's in store for! Her new husband lays down the new rules of their bedroom BDSM arrangement - she now has to fuck all of his friends! They rip off her underwear and dress, bind and tie her beautiful, tight body up with rope while they take turns fucking all of her holes. She opens her mouth wide to get filled with four huge cocks ramming down her throat! The studs take turns holding her down and sexing her up! They grab, grope, tie her down and fill all of her holes with huge cocks. It's all part of Marica's twisted game - every time she struggles to break free, she knows she's going to get a load of cock in her hands, mouth, pussy, and ass! The more she resists, the more hardcore this gangbang turns out for her and she LOVES every minute of it! She squirms with delight as these four huge men bang her wide open! She loves all the corporal punishment coming her way. Marica truly submits when she's tied down in rope bondage, stuffed airtight full of cocks, and fucked by all four cocks. The guys take turns stuffing their huge cocks in her tiny asshole while she's bound in rope. Before she goes to bed in her dream submissive cage, they cover her up with their hot cum! Marica's newlywed life is filled with humiliation, rough sex, anal, double penetration and degradation all at the hands of her new master husband.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Jay Savage",
      "person_id": 60460
    },
    {
      "name": "Marica Hase",
      "person_id": 44408
    },
    {
      "name": "Nathan Bronson",
      "person_id": 58786
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2017-10-11",
  "scene_id": 42799,
  "tags": [
    "Airtight",
    "Anal",
    "AprilFools",
    "Asian",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Cage",
    "Corporal Punishment",
    "domestic",
    "Double Penetration",
    "foreskin",
    "Gangbang",
    "Hand Gagging",
    "Handjob",
    "housewives",
    "Humiliation",
    "Latin",
    "master",
    "muscular",
    "natural boobs",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "versatile",
    "white"
  ],
  "title": "Newlywed Submissive Gets Gang Banged By Husband's Friends"
}