{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Little Avi Love is finally meeting her favorite star - the devastatingly beautiful Miss Julia Ann! Avi sneaks past the security guard, surprising Julia in her dressing room, only to find that she's in for a surprise of her own! Begging to do anything for her dream celebrity crush, Avi is bent to her knees and begins slowly, sensuously removing the stockings from Miss Julia's delicately arched feet. Sucking toe by toe, Avi's gorgeous green eyes gleam as Miss Julia lavishes her with attention - first choking her slender throat, then stripping Avi to her lingerie. Though innocent as to Miss Julia's ultimate intentions, it's clear from Avi's eager desire that she's loving every lingering graze of Miss Julia's fingers, every whispered command, every breath Miss Julia tears from Avi's gasping lungs. Continuing to toy with her devoted pet, Miss Julia tosses little Avi over her knees, spanking her taut ass and spreading her tight, wet pussy wide for inspection. Gasping in pleasure, Avi's puffy nipples are clamped as Miss Julia begins slapping her inner thighs, tickling her wriggling toes, and smacking her wrinkling feet. Avi gasps in pleasure - her tight pink hole growing wetter and wetter. Sliding in one finger than another, Miss Julia teases little Avi, who begins to writhe and moan, begging for more. Miss Julia delivers, turning Avi's flesh bright pink with slaps and pulling at her nipple clamps, Avi grinding her dripping cunt on the vibrator. Her body contours, shaking, as she cums hard under Miss Julia's hand. Having only begun to break-in her newest play thing, Miss Julia binds Avi - back arched - to a chair, dangling her wet panties into Avi's mouth and stealing her breath little by little, choking Avi until her eyes roll back in heavenly submission. Completely consumed in her fantasy, Avi finally gets a taste of Miss Julia's gloriously cunt! Grinding her pussy over Avi, Miss Julia smothers her with her fantastically divine ass - Avi struggling against her ropes and gasping for breath. As Miss Julia cums again and again into Avi's hungry mouth, it's clear that Avi may just be Miss Julia's new favorite fan. Rewarded for her willing body, Miss Julia fucks Avi's greedy hole with her cock - the sides gripped by Avi's glistening pink lips as she cums hard again, stretching the bondage and crying out in pleasure. But Miss Julia's not finished yet - she wants to test Avi's limits. Binding her new little slut with irons, Miss Julia thoroughly fucks Avi - delighting in the desire and begging and dirty talk she pries from her innocent fangirl. It's clear what Miss Julia wants now - can Avi prove to be her biggest fan? Miss Julia shoves her cock deep into Avi's puckered pink asshole, stretching it wide and deep as Avi begs for more and more, fully embracing the dirty whore she truly is. From missionary to doggy, Avi's tight asshole is ravaged to Miss Julia's ultimate pleasure, and this little fangirl cums over and over and over again, finally proving herself worthy of Miss Julia's attention.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Avi Love",
      "person_id": 60196
    },
    {
      "name": "Julia Ann",
      "person_id": 32896
    }
  ],
  "release_date": "2018-01-04",
  "scene_id": 42795,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Choking",
    "Corporal Punishment",
    "Crying",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Lingerie",
    "Nipple Clamps",
    "Nylons And Stockings",
    "Pussy Eating",
    "Slapping",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Submission",
    "Tickling",
    "Vibrator"
  ],
  "title": "Miss Julia's Fangirl Fantasy: Innocent Avi Anally Dominated"
}