{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Nikki Hearts has fallen behind again at her job working at Lea Lexis' motorcycle shop, and Lea is tired of it! She refuses to make apologies on her employee's behalf and decides it's Nikki's turn to face a frustrated client. So when Helena Locke arrives to pick up her bike, Nikki is put to task. Nikki can't tell Helena when her bike will be done, only that it's not ready. Helena is not pleased and now Nikki must make it up to her with good customer service. Luckily Lea is here to guide her. She commands Nikki get to her knees and worship Helena's lean body. She smells Helena's scent and kisses her all over. Then Lea and Helena strip Nikki of her mechanic's suit. It's time to see if Nikki can put in the work without getting distracted. They paddle her over Lea's knee until her ass is bright pink. They take turns flogging and spanking her and using her mouth for their pleasure. Nikki services Helena with pussy licking as Lea tests Nikki's multi-tasking abilities. She plays with Nikki's cunt and Nikki cums hard. Next, Nikki is bound and outfitted with a strap-on cock. Helena slips that cock in her cunt and works it up and down, as Nikki struggles unsuccessfully to touch her beautiful body. Lea sits on her face and Nikki is trapped between these two dominant women as they use her body. Once Helena cums, it's Lea's turn and she cums hard as Nikki gets spanked while licking her perfect pussy. Finally, Lea and Helena strap-on cocks and tag team Nikki. Helena slides her fat cock into Nikki's pussy while Lea flogs her and fucks her mouth. Nikki's moans get louder and louder as her holes get worked open by these motorcycle goddesses. When Helena is done with her pussy, Lea pushes her cock into Nikki's tight asshole. She makes Nikki spank herself as she thrusts in and out of Nikki's ass. Nikki is allowed to rub her pussy and cums hard with Lea's cock in her ass. Then Lea and Helena take turns using Nikki to orgasm. Once they're finished, they leave Nikki to her work. Maybe now she'll be able to focus.",
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Nikki Hearts",
      "person_id": 52257
    },
    {
      "name": "Lea Lexis",
      "person_id": 17836
    }
  ],
  "release_date": "2018-02-01",
  "scene_id": 42797,
  "tags": [
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "femdom",
    "Fingering",
    "flogging",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Paddle",
    "Pussy Eating",
    "slave",
    "spanking",
    "straight",
    "strap on",
    "tag team"
  ],
  "title": "Lazy Mechanic Nikki Hearts Gets Tag-Teamed by Boss & Client "
}