{
  "collections": [
    "Men On Edge"
  ],
  "description": "Blonde stud Peter Marcus is no stranger to edging. Chastity turns him on and he enjoys edging on a regular basis. But can he handle being edged by Sebastian Keys and Chance Summerlin? Peter shows up on time for an edging session and is surprised by a rough take down. He is bound in duct tape and rope, blindfolded and defenseless. Sebastian and Chance waste no time in ripping the clothes off Peter, revealing a toned hairy body. They suck his nipples and play with his fat uncut cock. Chance teases Peter’s cock with his wet mouth, licking it and sucking it as Peter grows more desperate to cum. Sebastian jacks Peter off as Chance licks his balls. Every time Peter is about to blow, they pull away, leaving Peter hornier and harder than ever. Peter squirms as Sebastian tickles him relentlessly. Next Peter is bound on his back. Chance teases his cock as Sebastian sucks his toes and licks his feet. Finally, they turn their attention to his asshole. Chance slips on a black glove with varying tips and uses each one in Peter’s ass. Peter’s hungry hole swallows each finger easily. His hips buck as Chance sucks his dick, keeping him right on that edge. Every time Peter is about to cum, they pull away. Then they slip a vibrating prostate plug in Peter’s hole. This plug pushes Peter closer to orgasm than ever before. His ass clenches down on it and he struggles to blow his load as Chance continues to work his hard cock. Peter cums hard, blowing his hot sticky load all over himself. Chance greedily licks it up and sucks Peter’s cock clean.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Peter Marcus",
      "person_id": 60684
    }
  ],
  "release_date": "2017-12-12",
  "scene_id": 42807,
  "tags": [
    "Athletic",
    "BDSM",
    "Blonde",
    "Bondage",
    "Chastity Play",
    "Edging",
    "Feet",
    "foreskin",
    "Gay",
    "Hairy",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Redhead",
    "Rope Bondage",
    "Stud",
    "Tickling",
    "toned",
    "Uncircumcised",
    "white"
  ],
  "title": "Hairy Experienced Edger Meets His Match"
}