{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Pathetic trustfund baby Casey V has been hopelessly drawn to the Countess Richelle Ryan's mansion. For over a year, he's been sitting outside, hoping for a glimpse of the Countess, longing for her to notice him, dreaming about her eyes, her breasts, her ass. He enters the mansion in a daze, is he finally here in his Mistress' inner sanctum? Casey downs a drink offered to him by the illustrious Giselle. He is promised the Countess will change his life. She leans in, closer to him than ever before, and begins to blow lightly in his ear. The blowing intensifies and suddenly he is bound and kneeling before the Countess. She is amused to see him so. After all his longing, he is finally allowed to bask her presence. Now he will learn what it means to serve. Countess Ryan makes Casey worship her latex clad breasts and ass. Casey licks long paths, following the curves of the Countess' body. He worships her heels and feet. She digs her heels into his soft boyish body, and crops him, demanding to know how he ever thought he could win her. Next, Countess Ryan has Casey bound with his ass in the air. The bit gag in his mouth makes him drool all over himself like a sloppy little slut. The Countess takes what is hers -- Casey's ass! She rams her strap-on cock in his tight asshole and takes no mercy, pounding his hole as it pleases her. Casey groans in pleasure and pain, saying the Countess' name over and over like a new mantra. Finally, the Countess decides to let Casey worship her cunt and ass. She smothers him with her glorious ass, before letting him lick her pussy. As Casey enjoys what must be heaven, the Countess vibrates her clit and cums all over Casey's pathetic greedy face. He becomes another slave who lives only to please the Countess.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Casey V",
      "person_id": 60675
    },
    {
      "name": "Richelle Ryan",
      "person_id": 12887
    }
  ],
  "release_date": "2017-10-13",
  "scene_id": 42808,
  "tags": [
    "BDSM",
    "bit gag",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "drool",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Latex",
    "Latex Darlings",
    "Male Sub",
    "Noose",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight"
  ],
  "title": "Dangerous Curves Ahead:Trustfund Kid is Dominated by Fierce Curvy Babe"
}