{
  "collections": [
    "Bound Gods"
  ],
  "description": "Welcome back to Trenton Ducati’s BDSM Dungeon. This leather clad muscle god is ready to punish his slaves. His black boots demand worshipping and his riding crop is ready to deliver the torment. Straight stud Mason Lear with his hairy chest and full beard is ready to serve his master. His tight jeans come off to reveal his tight ass and cock, ready for inspection by Trenton Ducati and his crop for corporal punishment. Mason’s muscular chest, thighs, and ass take a beating soo hard they turn red, while his cock gets thicker and harder. This pain slut begs for more. Now Mason’s cock is at full upright attention and is begging for torment and cock punishment. Trenton knows how to deliver a brutal beating to Mason’s thick cock. Now it’s time to pay respect to the muscle god. Mason is made to worship Trenton’s perfect muscular chest all the way down to his licking his leather pants before his hard cock comes out for deep throat cock sucking. It’s time to turn things upside down and Mason is bound in rope bondage, with his ass in the air fully exposed and his head bent down low. First the punishment, Trenton brings out his huge flogger and tears that ass up red. Mason is screaming with pleasure as his asshole gets ready for Trenton. But before that happens there is one more devilish round of torment. Mason is bound and blindfolded in leather and strapped up with electrocuting pads on his leg and cock. Trenton continues to increase the shocking pain as Mason screams until he can’t take anymore. Finally its time, Trenton turns Mason around and delivers a huge deep anal fucking. Mason’s ass is pounded hard as he is bound to a metal mattress. Mason takes a huge ass fucking before he is turned around and has a huge load of cum shot on his hairy face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Mason Lear",
      "person_id": 60275
    },
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    }
  ],
  "release_date": "2017-11-09",
  "scene_id": 42802,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Big Ass",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Pain",
    "Pain Slut",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Straight",
    "Straight Stud",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "Leather God Trenton Ducati Dominates & Destroys Straight Stud"
}