{
  "collections": [
    "Bound Gods"
  ],
  "description": "Straight Stud Blaze Austin is a freeloading brother-in-law that needs to finally pay for his ways. This hot hunk muscle stud has been taking advantage of Jaxton Wheeler’s family for too long and needs to pay in pain. Tied up tight in restrictive rope bondage and stripped naked, Muscle Stud Jaxton get’s his revenge on his loser brother in law. Jaxton Wheeler starts with brutal aggressive cock and ball torment, punching his straight brother’s package til he screams out loud. After Blaze’s nuts are swollen and tight, Jaxton stuffs them in a ball stretcher which gets his brother’s cock rock hard before jacking him off to the edge. When Blaze just can’t take any more, Jaxton Wheeler stops and starts punching Blaze in the chest, turning him bright red. This loser is going to learn a lesson one way or another. The flogger comes out next and this stud’s ass is beaten raw. Screaming will do him no good, not til Jaxton has his way. After some foot worship, Jaxton shoves his huge hard cock down Blaze’s throat for a sloppy deep throat penetration. Tied up with his hands behind his back and no where to run, Blaze takes the hardest pounding fuck of his life. Jaxton pounds his ass before flipping him over and shooting his hot thick load all over his pathetic free loading face. Lesson learned.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Blaze Austin",
      "person_id": 60689
    },
    {
      "name": "Jaxton Wheeler",
      "person_id": 53352
    }
  ],
  "release_date": "2017-11-23",
  "scene_id": 42804,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Crotch Rope",
    "Domination",
    "Foot Worship",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Pain",
    "Punching",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Straight",
    "Straight Stud",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "Straight Stud Blaze Austin Paying In Pain"
}