{
  "collections": [
    "Bound Gods"
  ],
  "description": "Mike Maverick is taking his time spit-polishing his boots while the rest of his formation is on duty. This doesn't sit well with Drill Sergeant Hardass Dirk Caber. Dirk confronts Mike and belittles his boot polishing skills. Unsatisfied with his soldier's work, Dirk makes Mike get down on his hands and knees and lick his boots clean. Despite Dirk's instructions, Mike istill fails to get his boots properly cleaned and now he's in double trouble. Dirk strips Mike of his uniform, and slaps him all over his chest and back. He breaks out the crop to see what Mike is really made of. Mike yells as Dirk's hands and implements hit his body. He struggles to stay in position as Dirk humiliates him. But the harder Dirk hits him, the harder his cock gets. And Dirk knows exactly how to treat this hard cock - he beats it and then pushes Mike's head down on his own erection. Next, Mike is gagged and bound, with his unpolished boot tied to his cock. Dirk loves seeing his soldier helpless. He spits on Mike's cock and rubs his beard all over it. He teases the head before sliding it deep in his throat. He smacks and flogs Mike all over his torso and cock. Once Mike's skin is nice and red, Dirk puts clamps on his nipples and begins flogging and teasing his cock all over again. Mike squirms in bondage but is unable to escape Dirk's skilled mouth and precise smacks. Finally, Dirk has Mike tied with his legs open and spread. Dirk slides his fat cock into Mike's asshole and pounds the shit out of him. Mike loves every second and blows a huge load all over his belly and chest. Then Dirk pulls out and cums on Mike's face. Mike cleans off Dirk's dick. Punishment complete.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dirk Caber",
      "person_id": 27341
    },
    {
      "name": "Mike Maverick",
      "person_id": 59133
    }
  ],
  "release_date": "2017-12-14",
  "scene_id": 42803,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot",
    "Corporal Punishment",
    "Crop",
    "Crotch Rope",
    "Domination",
    "Flogging",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission"
  ],
  "title": "Lazy Soldier Gets Humiliated, Punished, Fucked"
}