{
  "collections": [
    "Bound Gods"
  ],
  "description": "Leather Daddy Dominic Pacifico knows exactly how to make slaves suffer, and he is not in a good mood today. His lucky captive today is beefcake Draven Navarro, and Dominic can’t wait to inflict some pain on his bitch. Draven is bound and helpless, his muscles flexing against the rope binding his chest and arms. Dominic is ready to give this beefy boy some pain and goes straight for Draven’s super sensitive nipples. His tugging has Draven screaming in pain, and he’s barely begun. Dominic slaps, canes, and flogs Draven all over his hard body, and the more pain Draven takes, the harder his cock gets. So Dominic bands together bamboo to clamp down on Draven’s balls, cock, and tongue, cutting off blood flow and making Draven’s cock and balls extra sensitive. Draven screams in pain as Dominic canes his pinched cock and balls. Dominic pushes Draven to the edge and Draven takes it all. Next, Draven is bound and suspended by a single ankle as Dominic fucks his mouth. Draven chokes as Dominic rams his dick down his throat. Once he’s had enough of Draven’s wet mouth, Dominic breaks out the flogger. He hits Draven hard, all over his legs, feet, ass, and stomach. Finally, Dominic brings Draven down and gives him a reward – his dripping hard cock. Dominic pounds Draven’s ass, slamming his cock into Draven over and over again. Once he’s had his fill, Dominic blows a hot load all over Draven’s face and makes Draven clean it all up. Dominic then jacks Draven off and Draven explodes – cumming all over his stomach. But Dominic doesn’t stop, he keeps on rubbing Draven’s sensitive head as Draven struggles to get away and begs him to stop.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    },
    {
      "name": "Draven Navarro",
      "person_id": 59640
    }
  ],
  "release_date": "2017-11-02",
  "scene_id": 42801,
  "tags": [
    "Anal",
    "BDSM",
    "Big Ass",
    "black hair",
    "Blowjob",
    "body builder",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Gay",
    "Humiliation",
    "Latinx",
    "Leather",
    "Male Sub",
    "master",
    "mixed",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Tattoo",
    "unshaved"
  ],
  "title": "Bodybuilder Draven Navarro Takes Pain, Extreme CBT, and Gets Fucked"
}