{
  "collections": [
    "Bound Gods"
  ],
  "description": "Muscled mustached Chad Stone is in for a lot of firsts in his first scene EVER! Once Chad gets chained up in metal bondage and blindfolded, and Sebastian Keys is ready to break in this new slut. He inspects Chad's body, slapping it, punching it, and stretching his cock and balls as far as they'll go. He makes Chad worship his leather gloves, and plays with Chad's hard nipples as Chad struggles in bondage. After sucking Chad's cock, Sebastian lights a candle for hot wax and sensation play. Chad moans as the hot wax drips all over his body -- his cock, balls, thighs, stomach, nipples, chest, and shoulders. Next, Chad's nipples are clamped with clover clamps, and those clamps are tied to the floor. He is wearing a spider gag, keeping his mouth accessible for the hard cock of leather gimp, Dominic Pacifico. Chad eagerly sucks the hard cock in front of him, his efforts making the clamps on his nipples tighter and tighter. As he sucks the gimp's dick, Sebastian flogs him hard, on his back, ass, cock, and stomach. Chad takes it all, all while continuing to suck Dominic's cock. Now it's time for the gimp to use Chad's other hole. Chad is suspended, gagged, and fucked by a good hard gimp cock. Bound and helpless in rope, all Chad can do it take the hard rough pounding and yell around his gag. The gimp blows his load all over Chad's face and makes him clean up the mess. Finally it's Chad's turn to cum. He makes a sticky mess all over Sebastian's hands and squirms as Sebastian teases the head of his sensitive cock.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Chad Stone ",
      "person_id": 60693
    },
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2017-11-30",
  "scene_id": 42805,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "clover clamps",
    "Corporal Punishment",
    "domination",
    "First Pornstar",
    "gag",
    "gay",
    "Gimp",
    "gloves",
    "hand gagging",
    "hot wax",
    "humiliation",
    "leather",
    "leather gloves",
    "Male Sub",
    "master",
    "metal bondage",
    "muscle",
    "punching",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "slapping",
    "spider gag",
    "Stud",
    "submission",
    "Wax Play"
  ],
  "title": "FIRST SHOOT for Muscle Stud Chad Stone"
}