{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Mandy Muse is a sweet brunette with an adorable smile... and a big ripe fuckable ass! She's working out at the gym after hours, when 5 horny guys descend on her and take her down. Before she knows what's happening she's stripped naked, tossed down on the floor and chokes down five hard cocks. The guys waste no time using her, slapping their dicks on her face and pushing them into her throat, while she struggles to accommodate them all. But she makes it work, and the guys immediately move in on her tight wet pussy. While still sucking cock, she's propped up on one leg, spread wide and fucked. With every slam against her sweet ass her skin smacks loudly. It's a long hard fuck for Mandy as she's hog tied and all 5 guys fuck her wet, dripping pussy, her hungry throat, and her tight, plump ass. Ultimately Mandy's filled airtight, with a cock slamming her pussy, another pounding in her ass, and a third plugging her throat. She can hardly contain herself as every one of her holes is fucked relentlessly. And when it's all over she finally gets her reward for her great workout... a ton of hot cum shot all over her sweet little smile!",
  "directors": [],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Cyrus King",
      "person_id": 60686
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Jay Savage",
      "person_id": 60460
    },
    {
      "name": "Mandy Muse",
      "person_id": 54180
    },
    {
      "name": "Ray Black",
      "person_id": 60687
    }
  ],
  "release_date": "2017-10-18",
  "scene_id": 42800,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "Brunette",
    "Choking",
    "Corporal Punishment",
    "Double Penetration",
    "foreskin",
    "Gangbang",
    "Handjob",
    "Latin",
    "muscular",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Slapping",
    "slim",
    "Straight",
    "white"
  ],
  "title": "Mandy Muse Gets Her Big Ripe Ass Bound Up and Gangbanged"
}