{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Welcome Olive Glass, to Divine Bitches! Olive can disarm a man with one glance, leaving them helpless. Her beauty and power show no mercy. She chops slave Eli's ego down into little bits and builds him back up a better specimen. She starts with pouring hot wax all over his back and thighs. Stuck in a cage, with no escape, all Eli can do is scream as his Mistress starts her training. Seeing how well he takes his first punishment, she lets him out of his cage. He kisses her feet, thanking her for making him better. He crawls on the floor after her, just like her dog. She positions him over his cage and flogs him relentlessly all over his ass and back. Then she flips him over to tenderize his front. She paddles his sides, thighs, and belly. Her pristine milky white skin is relentless when brushing up against Eli and he can barely control himself. She whips him into shape, pegs his ass with hard strap-on fucking and even uses the fuck saw power tool deep in his ass. The joy on her face when he takes it for her is priceless. Eli's body shakes with the intensity of the fucking and he begs over and over again to cum but is denied. She then uses him for her pleasure and denies him any of his own. She sits on a dildo gag strapped to his face and as she rides it, all Eli can do is stare up at his beautiful Mistress' cunt. Seeing his cock straining in chastity, she laughs delighted, before taking it in her mouth to further torment her slave. Mistress Glass is a Goddess you will not be forgetting anytime soon!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Olive Glass",
      "person_id": 60453
    },
    {
      "name": "Shawn Fox",
      "person_id": 51998
    }
  ],
  "release_date": "2017-11-07",
  "scene_id": 42809,
  "tags": [
    "BDSM",
    "black hair",
    "Bondage",
    "brunet",
    "Cage",
    "CBT",
    "Chastity Play",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "First Timers",
    "Gag",
    "Hot Wax",
    "Humiliation",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Vagina Dentata: Olive Glass Unleashes Her Perfect Cunt Onto Slave Meat"
}