{
  "collections": [
    "Men On Edge"
  ],
  "description": "Casey Everett is a cheerful, lean ripped guy, who finds himself reduced to being the prize between horned up dudes Sebastian Keys and Chance Summerlin. The two of them take him while he's hog tied and rope-gagged, rolling him onto his back. They play with his hot body, kissing the trail of hair leading down his abs to his delicious cock. Casey is at their mercy while Chance sucks his dick to get him hard, and Sebastian toys with his nipples and reaches down to jerk his cock in between sucking. Casey's is also tickled, on his body and on his feet, then stroked and sucked again, taking him through every physical sensation, edging him and denying him repeatedly while he screams through the rope, begging to cum. He's then tied to a chair, sitting backwards with his cock aimed straight down and his perfect ass sticking out. Chance continues to work his cock, sucking him and stroking him right up to the edge, as Casey begs and begs to cum. Sebastian slides an electric butt plug into that perfect hole and cranks up the electricity. Casey's ass milks that plug, pulling it inside himself to shock and milk his prostate, making him feel like he could blow his load at any moment. Finally, Casey's flipped around in the chair and Chance goes whole-hog, sucking and slurping on his cock, rapidly bringing his balls to a boil. Sweaty, worked up and desperate, Casey finally blows his load, erupting with hot cum all over himself.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Casey Everett",
      "person_id": 60450
    }
  ],
  "release_date": "2017-11-28",
  "scene_id": 42806,
  "tags": [
    "BDSM",
    "Bondage",
    "Edging",
    "Electrical Play",
    "Feet",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Straight",
    "the chair",
    "Tickling"
  ],
  "title": "Two Dudes Repeatedly Work Casey Everett's Cock To The Brink"
}