{
  "collections": [
    "TS Seduction"
  ],
  "description": "The wait is finally over. TS superstar, Natalie Mars, appears in her VERY FIRST TOPPING scene with a man EVER! And not only does she top him, she tops you right along with him. You remain right by her side during the entire journey. Good luck trying to hold out until the end. This woman is a natural beauty with a hard driving cock like you've never seen before. Gabriel Dalessandro is helpless under her power. This lucky slave gets let out of his box to worship Natalie like the Goddess she is. He takes her cock deep in his throat working tirelessly to pleasure his Mistress. He enthusiastically worships Natalie's delicious asshole. He takes all her spit, and eagerly submits to her every desire. And when she's ready, she rams her cock into his greedy hole all the while she talks directly to you and what she would be doing with your cock. She knows your true secret desires and what a pathetic worm you are. Aren't you lucky you get to watch? She tells you to touch your cock. She knows you want to cum, but she wants you to wait until she's ready. Can you take instruction and please your Mistress? Gabriel takes a hard pounding first on his stomach and then on his back. He moans with every thrust, so grateful and fulfilled with Natalie's gorgeous cock inside him. For being such a good slave, she gives him a reward you'll never experience -- she lets him cum in her mouth. Finally, Natalie blows her load all over her lucky slave's face and makes him suck her beautiful cock clean. He's been a good boy -- are you one too? This is one film you DO NOT want to miss!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Gabriel Dalessandro",
      "person_id": 20692
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    }
  ],
  "release_date": "2017-11-14",
  "scene_id": 42811,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "black hair",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Cuckolding",
    "kink-pov-str",
    "Latin",
    "Male Sub",
    "natural boobs",
    "POV",
    "Role Play",
    "Slave",
    "slim",
    "Straight",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Natalie Mars Cuckolds the World: TS Star pounds slave, delivers JOI"
}