{
  "collections": [
    "TS Seduction"
  ],
  "description": "Looking like a naughty Vargas pin-up in a sexy latex uniform, Nurse Chanel Santini is feeling bored and horny, smoking a long cigarette in the private Doctor's office where she works. In walks a muscle stud named Colby Jensen, looking nervous wearing a short-sleeve dress shirt with a crooked tie. Colby has trouble reaching orgasm and would like to see the Doctor but he's informed that the Doctor is out today. Nurse Chanel can fix it and commands Colby to go behind the curtain and get naked. Reluctantly, Colby undresses while Nurse Chanel gets comfortable. She pulls her latex panties to the side setting her big beautiful dick free. Chanel strokes her cock to the silhouette of Colby's hard cock and tells him to come out from behind the curtain. When Colby sees Chanel stroking her stiff hard cock he immediately gets on his knees and starts sucking. Its everything he's ever wanted, a beautiful dominant woman with a big beautiful cock to worship. He sucks her cock balls deep, choking and gagging on it with delight. Chanel returns the favor and gets to her knees to enjoy his cock in her mouth. She indulges in his cock while telling him the plans she has for his ass. Having not had a dick in his ass before, Colby again shows a little reluctance. Chanel bends him over an exam table and gently presses the head of her dick against Colby's tight ass until it slowly slides in. Colby cant believe how amazing it feels as Chanel starts pounding her dick in his ass faster. Next, Chanel flips Colby over onto his back to pound his ass deep and hard with his legs spread. After fucking the cum out of him, Chanel tells Colby to stand up and switch places because its her turn to cum now. She lies on her back and strokes her cock. Colby gets to his knees and sucks her cock, Chanel takes over and jerks her hot cum out of her throbbing dick, dripping down her knuckles and thighs.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Chanel Santini",
      "person_id": 59709
    },
    {
      "name": "Colby Jansen",
      "person_id": 34457
    }
  ],
  "release_date": "2017-10-31",
  "scene_id": 42810,
  "tags": [
    "Anal",
    "big dick",
    "black hair",
    "blond",
    "Blowjob",
    "Choking",
    "Cock Worship",
    "Doctor",
    "Hairy",
    "Latex",
    "Latin",
    "Male Sub",
    "Muscle",
    "muscular",
    "natural boobs",
    "Nurse",
    "Role Play",
    "shaved",
    "slim",
    "Smoking",
    "Straight",
    "Stud",
    "switch",
    "top",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "white"
  ],
  "title": "Tender Loving Care: Nurse Chanel Cures Colby With Her Hard Driving cock"
}