{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Our favorite BDSM swinger crowd returns for a new S&M party with the incredible masochist and squirting slut machine Melissa Moore to induct into the House. It's a war of the good girls, as Kira Noir and Melissa Battle it out over who is the most submissive cock sucker, the most willing to bend her will, take the pain, and give her orgasms to The House. Bound in rope, their nipple pulled tight with clover clamps, both sluts are made to answer the House's questions while not cumming in an athletic squat. The submissive whore not being interrogated sucks off a guest of honor with a huge cock while the crowd get's hot and bothered, ready to make scenes of their own. It is determined that Melissa wins this round and steals all the cock for herself while Kira only gets the tip.\nDavey is back from last year with her playmates Endza and Jessie Sparkles. Tied to the ceiling, whipped and made to lower her dripping wet cunt onto Enza's fist, Davey is truly a bottom to be reckoned with. Her clit piercing is attached to a chain leash with with her lither body is controlled and made to cum under the pain and fisting. Davey isn't the only submissive to get a fist. Melissa Moore is an ejaculating little slut who has never had a fist in her until this night. As she cums uncontrollably for the House Aiden Starr slips a fist into her tight little pussy for the first time. Melissa's face is priceless as she reaches back to feel for how much is in her and end screams with shock. She then cums like a good little whore, soaking her Mistress' tits with hot squirt.\nMeanwhile the other guests are getting busy. One submissive girl gives her entire head of hair to her Master, allowing him to cut all her hair off and beat her ass bright red. Dominant rope ropes are suspending gorgeous women left and right, slutty swingers are blowing eachother and cumming in all the corners, and one of our favorite couples Dragoness and Eric are no exception. Shy and beautiful Dragoness chokes and gags on her Master's gigantic cock and she entertains the crowd with her hot body and submissive fucking. She is a beautiful girl, and looks even better with a hot load of cum on her face.\nLook forward to more parties, and especially part two of this incredible party. The gangs all back together again.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Melissa Moore",
      "person_id": 60023
    },
    {
      "name": "Owen Gray",
      "person_id": 39181
    }
  ],
  "release_date": "2017-10-03",
  "scene_id": 42814,
  "tags": [
    "anal",
    "athletic",
    "bdsm",
    "bondage",
    "clover clamps",
    "Corporal Punishment",
    "Cut",
    "discipline",
    "female slave",
    "First Fisting",
    "First Pornstar",
    "fisting",
    "Hand Gagging",
    "head shaving",
    "humiliation",
    "master",
    "oral sex",
    "pain",
    "Pierced Pussy",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "squirting",
    "straight",
    "swingers",
    "threesome",
    "tribbing"
  ],
  "title": "The Upper Floor Returns With a Squirting Slave Fuck Fest"
}