{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Alura Jenson is a literal bombshell of a woman, with platinum blonde hair, a huge gorgeous ass, and massive, gigantic tits. Typically she's a dom, but today we get to see her taken down and fucked by five horny, ravenous guys. To start, Alura is caged, with her wrists and huge tits bound. The men study her, eager to take on this curvy woman and fuck her into submission. When she's released from the cage, she's immediately overwhelmed with cock. She's got cock smacking against her face, sliding in her throat...she's surrounded! They all want a piece of this sweet ass. As a dom, Alura might be able to handle one guy. But five? The men quickly make use of her holes, moving on from her sweet wet throat to fuck her desperate, hungry pussy. She's partially suspended from the ceiling, bent over with her ass out, as each of the men takes turns pounding her pussy and then feeding her their cocks. Her huge tits hang low as she gets plowed. But even if she's overwhelmed, there's more to come. Alura's put on the couch and DP'd deep and hard, filling her throat and holes air tight. She loses herself as the object of lust, repeatedly fucked and DP'd until she begs for the guys hot loads. She gets four huge loads all over her giant tits, and one massive cream pie in her heavily fucked cunt. The guys leave her there, fully used, now needing to please herself. Alura slowly starts to gather herself back together, only to find she's utterly fucked, sweaty and wrecked.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Sam Coxxx",
      "person_id": 60672
    },
    {
      "name": "Rico Strong",
      "person_id": 30846
    },
    {
      "name": "Alura Jenson",
      "person_id": 54567
    },
    {
      "name": "Alex Legend",
      "person_id": 55861
    },
    {
      "name": "Slim Poke ",
      "person_id": 60692
    }
  ],
  "release_date": "2017-11-01",
  "scene_id": 42812,
  "tags": [
    "Air Tight",
    "anal",
    "bdsm",
    "blonde",
    "Blow Bang",
    "blowjob",
    "bondage",
    "cage",
    "Corporal Punishment",
    "curvy",
    "dominatrix",
    "Double Penetration",
    "gangbang",
    "MILF",
    "role play",
    "Rough Sex",
    "straight",
    "submission",
    "takedown"
  ],
  "title": "MILF Dominatrix Takedown: Gigantic Titted Dominatrix Gets Bound & DP'd"
}