{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Lisey Sweet is an adorable blonde sweetheart, with a dark dirty need to get used and fucked. In her first gangbang she takes five huge dicks in every hole as the guys use her up and fill her airtight. She starts out in her cage, left there overnight by her master, Ricky Johnson. In the morning he rewards her good behavior by granting her greatest wish: to get gangbanged by 4 of his friends. Ricky locks her down with her ass up and paddles her ass and flogs her, making her beg for the gangbang she's about to receive. When they guys come in she's excited but immediately overwhelmed, as they waste no time shoving their big dicks in her throat, in her pussy, and deep in her ass. Lisey has no time to think before every one of her holes is getting stretched and fucked by tons of hard dick. But she loves every second of it, taking all the cocks wherever they're fucking her, screaming her brains out as they savage her holes. Lisey's then put in a sling and fucked like a piece of rotating meat. The guys spin her around and whoever her pussy falls on, he gets to pound her. Helpless on her back they guys take turns plowing her slutty cunt, leaving her begging for more. Finally Lisey gets what she really wants, a long hard DP and a seemingly perpetual airtight fuck. She takes those huge dicks in her ass and throat and pussy again and again, always wanting more, until she gets a creampie in her pussy, then another in her ass, then a cumsoaked drenching all over her face. Filled with cum in both holes and licking it off her face with her tongue, Lisey finally gets what she always wanted... and then some.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Isiah Maxwell",
      "person_id": 45211
    },
    {
      "name": "Justin Hunt",
      "person_id": 48973
    },
    {
      "name": "Lisey Sweet",
      "person_id": 60674
    },
    {
      "name": "Nathan Bronson",
      "person_id": 58786
    },
    {
      "name": "Ricky Johnson",
      "person_id": 58838
    }
  ],
  "release_date": "2017-12-13",
  "scene_id": 42813,
  "tags": [
    "Airtight",
    "Anal",
    "BDSM",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Cage",
    "Corporal Punishment",
    "Creampie",
    "Double Penetration",
    "First Gangbang",
    "Gangbang",
    "Hand Gagging",
    "Handjob",
    "master",
    "Role Play",
    "Rough Sex",
    "Straight"
  ],
  "title": "Caged Gangbang Slut: Submissive Lisey Sweet Gets Holes Cracked Open"
}