{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Melissa Moore is a craven whore that can't get enough sex and pain, but her drive to be a good girl throws her salacious nature into conflict as she struggles to maintain good behavior and hold her orgasms. Kira Noir is a complete bondage angel and good girl, getting railed with a huge cock in her ass she she writhes in a tight suspension. There is just a glimmer of sadistic competitive pleasure as she watched Melissa struggle to maintain her orgasm control strapped down o the Sybian with the whole orgy chanted for her to cheat and steal an orgasm. When she final succumbs, screaming with pleasure, she is shocked within an inch of her life and made to choke on cock while Kira can cum as much as she pleases.\nDavey is tied down, has her clothes ripped off and set up in a predicament with candles dripping wax on her exposed thighs and milky white tits. As long as she holds still she is fine, but once Jesse starts dripping hot wax directly onto her sensitive clit and single tailing her pussy she starts wiggling around and screaming, send more hot wax onto her body. Endza is kind enough to remove the wax carefully from her cunt with a dull blade. Her freshly shaven cunt is dubbed up and double fisted by Endza and Jesse while throws her body against them trying to get fucked harder and harder. When she cums she growls like a tiger and then howls as they stuff an entire Hitachi head up her pussy and leave her to whimper.\nMeanwhile the entire party has gone off into sexual excess, with hot girls grinding orgasms out on their Masters' boots, Syren de Mer having her big boobs slapped around by her Daddy, babes tied in extreme suspension and fucked in mid air, and plenty of blowjobs and swinger couples furiously fucking on the couches.Â  Kira is all hot and bothered, covered in many zippers and grinding out orgasms on Owen's thick dick while trading for zipper pulls. She is truly a submissive little slut and clearly gets off on the zipper pain as much as she does the cock.\nLats scene finds our good girls in a war to bed for and take the most cattle prod strikes. Both are distracted in turn by Aiden Star's pussy and Owen's cock. Kira manages to beg cleverly and quickly, while Melissa loses herself in the fucking, cumming and squirting like a fountain and earning herself the nick name Slave Garden Hose. Can this squirting undisciplined slut ask for enough electrical strikes to earn herself the chance for further training?",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Melissa Moore",
      "person_id": 60023
    },
    {
      "name": "Owen Gray",
      "person_id": 39181
    }
  ],
  "release_date": "2017-10-31",
  "scene_id": 42815,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "cattle prod",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Folsom",
    "folsom_st",
    "Hitachi",
    "Hot Wax",
    "humiliation",
    "master",
    "oral sex",
    "orgy",
    "pain",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "squirting",
    "straight",
    "suspension",
    "sybian",
    "threesome",
    "Wax Play",
    "zipper"
  ],
  "title": "Nympho Slave Slut Soaks The Folsom Orgy with Squirt"
}