{
  "collections": [
    "Families Tied"
  ],
  "description": "Maya Kendrick is a coltish fair beauty with the mind of a sailor. She knows what she wants, and it’s her hung satanist boyfriend railing her in the ass and making her beg like a little slut for punishment. However, her prim and proper step-mother is tasked with keeping her under control when Dad is out of town and decides to get creative in her step-daughter control methods. Offering her own body in exchange for ending things with Maya, Helena has no idea what she is in for. Spanked, humiliated, made to beg, pussy clamped and drooling, tied to the ceiling and shocked while she begs for that thick teen dick in her sweet snatch. Cumming for the first time in months she smiles with relief until she realizes the deal is off and Xander is going to be keeping them both. Maya is none to pleased to find out about Helena’s scheming, and is quick to steal the dick bvack, gagging, deep throating, and taking a strict flogging, paddling, and caning on her bouncy little butt. Marked red and ready to get fucked, she begs and shows off her submissive prowess while Helena watches her precious step-daughter get her ass stuffed with hard cock. This little anal slut can take it, and licks her shocked Mom’s cunt while she gets those anal orgasms. Mom is then tied up, bouncing on Xander’s dick and getting punished every time her out of control little angel cums without permission on a wild bondage sybian ride. Revenge is sweet when she gets control of the zapper and punishers her teenage nightmare’s ass for all the stolen orgasms while she get’s her own deluge of dick, cumming like a whore. Back in charge, Helena shoves Maya’s head around, showing her how to deep throat and suck dick, mounting her up and making her ride Xander and cum on command for once. Mommy will finally get what she really wanted, her gorgeous little bitches face glued to her pussy and a hot load of cum in her tight cunt. Hot update, not to be missed….",
  "directors": [],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Xander Corvus",
      "person_id": 46000
    }
  ],
  "release_date": "2017-11-24",
  "scene_id": 42820,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "Family Roleplay",
    "Female Slave",
    "Flogging",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Paddle",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Sybian",
    "toned",
    "top",
    "unshaved",
    "white",
    "Zapper"
  ],
  "title": "Daddies Little Anal Angel Turned Out By Repressed Step Mommy"
}