{
  "collections": [
    "Families Tied"
  ],
  "description": "When cute little rebellious teen Vienna returns home for a surprise visit with her new creep boyfriend Smallhands, she is aiming to torment her parents, but instead finds they are gone and her older sister Vanessa is home for the week end. Vanessa is a gorgeous uptight coed and is having none of Vienna's shenanigans. Dismissing Vienna as a slut after paying Smallhands out for picking up some Hot Topic mall teen, she throws her headphone back on and goes back to working out. Determined to get under Vanessa's skin, Vienna drags Smallhands up to her old bedroom and invites him to teach her all about the BDSM sex he has been trying to convince her to try. The resulting scene is a very real first timer experience of begging for cock, intense face fucking, flogging, spanking, paddling, and submissive fucking at the hands of a sadistic top. Vienna is dragged out on to her balcony, bent over the railing, and made to have a screaming orgasm for all the world to see, with Vanessa is in the front row seats.\nLater Smallhands gets lost in the mansion and wanders into Vanessa' room looking for the bathroom. He starts backing out apologetically, but Vanessa makes her move, telling him if he really wants a good lay he should try someone with some more experience. Smallhands doesn't like being told what to do, and Vanessa is one hot stuck up bitch, how could he refuse? Throwing her on the bed, he starts in immediately spanking her hard with verbal humiliation, making he admit she is a greedy cum slut while paddling her round ass red, throwing her on the floor and cropping her sensitive pussy. He cuts up her nice yoga gear and throws tight metal clamps on her sensitive nipples. Face fucking her and making her cum repeatedly on the floor like a dog, she is thoroughly humbled. When she is finally in tatters and ready to submit fully, he puts her in tight belt bondage, clamps her pussy lips, and fucks her to pieces, switching freely between her ass and cunt as she screams into her ball gag and begs for more. She is rewarded with a relentless pounding and electrical shocks from a zapper. All the noise obviously draws Vienna's attention. Upset, she comes in screaming, but Smallhands reminds her that she did promise herself to him and if she really wants to done with the game so soon? Vienna has always thought her big sister was hot, so now with her all tied up and speared on her boyfriends cock, she has a chance to get in on the fun. Vienna eagerly watches and learns how to submit from Vanessa, cleaning her boyfriends cock off every time it comes out of Vanessa's ass, and waiting to cum in unison with her slut sis.\nThe rest of the evening is spent with the girl's giving each other revenge orgasms on the sybian, clamped and tied up tight, they are both throat fucked and made to beg. Both sister's eagerly lick each other's pussy's while Smallhands takes his fill of their nubile hot bodies and covers them with the biggest load of cum we have seen in a while.",
  "directors": [],
  "models": [
    {
      "name": "Small Hands",
      "person_id": 59499
    },
    {
      "name": "Vanessa Sky",
      "person_id": 60690
    },
    {
      "name": "Vienna Black",
      "person_id": 60681
    }
  ],
  "release_date": "2018-04-13",
  "scene_id": 42822,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "Family Roleplay",
    "Female Slave",
    "Flogging",
    "Gag",
    "Humiliation",
    "master",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "other hair color",
    "Paddle",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Spanking",
    "Straight",
    "Sybian",
    "toned",
    "top",
    "white",
    "Zapper"
  ],
  "title": "Sister, Sister: Secret Anal Whore Shows Her Little Step-Sis The Ropes"
}