{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Lydia is brand new and is looking to fuck as much as she can while she is here. She has a slender and tight little body with a very hungry pussy. We let her show us her what she is hiding under that innocent little outfit, then make herself cum all over our floor. We get her set up for her first machine and it does not take long before we have this little kitten purring. Her pussy starts to quiver as the orgasm pour out, then she begins to squirt uncontrollably; the whole time screaming \"Thank you\". Once we find the right rhythm we milk every ounce of cum out of her pussy. Next we stand her up and then bend her over to accentuate those long legs and to give us a better look at that cute little ass of hers. The machine pounds her tight pussy until she cannot take it any more and pushes the dildo out. This won't stop us, because we are going to just put it back in a fuck her until we are ready for a different machine. When she thinks it is finally finished, we ramp up the speed one last time for another squirting orgasm that totally drains her of her juices. In the final scene we lay her down on her side and start the machine. It doesn't take long before this little whore spreads her legs nice and wide to show us her money maker as it gets fucked furiously. The look on her face when she realizes her pussy now controls this situation i priceless. And as much as she may think she is finished, her slutty pussy needs more of the powerful machines to make her cum. We continue this process until we have drained every drop of cum out of her willing pussy.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lydia Black ",
      "person_id": 60714
    }
  ],
  "release_date": "2018-01-31",
  "scene_id": 42837,
  "tags": [
    "brunette",
    "dildo",
    "Machine Dildo",
    "squirting",
    "straight",
    "Vaginal Penetration"
  ],
  "title": "Slender Brunette Newcomer Gets Her First Taste"
}