{
  "collections": [
    "Families Tied"
  ],
  "description": "Uppity gorgeous ivy league professor and her step-daughter think they have a big dick summer fuck boy when intern Xander comes to stay for the summer. Professor Alana Cruise wastes no time showing Xander the lay out of the house, his room, and then her wet hot dripping cunt ready for some dick. Xander is shy at first, but soothed by her talk about revolutionary work relations and everything being natural, he goes ahead and dommes the shit out of her with a strict flogging, face slapping, spitting, and spanking. When her rich ass is bright hot red and raised in the air she takes her from behind, fucking her into complete cumming submission. He doesn’t both asking before sliding right into her tight ass, fucking her like a cheap whore and humiliating her for cumming without permission by throwing her on the floor and choking her out with his own tie while she gets herself off with her hand. Much to his surprise, after cumming she jumps up like nothing happened and reminds him to prepare their conference presentation for the next day, leaving the room as quickly as she came onto him.\nDevious little teenage beauty queen Avi Luv entertains herself with trying to embarrass Xander, letting him know he isn’t the first scholarship student her mother has invited to the house for sex and that he won’t be the last. Her big green eyes widen with surprise and pleasure when he reaches up and grabs her by her arrogant little neck, throwing her down on the family couch and spanking her ass a deep red. Covering her tight little tits with clamps, he taunts her and throat fucks her in turn. She seems to lapping it all up until he puts a tight clamps on her hungry little clit and fucks her with deep long strokes on the living room floor. Placing the clamps from her tits to her mouth, her stretches her face into a degrading grotesque smile and fucks it with his cock. Stunned, she takes everything he has to give her. Heavily clamped with metal clovers, he bends her over backwards in a stressful bondage tie and fucks her while waiting for her mother to come home.Â  Avi’s face and cunt are left completely vulnerable for fucking, and Xander uses each hole in turn until her Professor Cruise comes homes and has her face shoved in her daughter’s well used cunt to lap it all up. Playing them off against one another, Xander watches them shift the blame and takes floggings for their part of play in this family tragicomedy of errors. Beaten red and screaming in tight rope ties, Xander takes him time fucking all their holes, watching them come around to love his cock and eating each other’s pussy’s with taboo pleasure.Â",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Alana Cruise",
      "person_id": 60194
    },
    {
      "name": "Avi Love",
      "person_id": 60196
    },
    {
      "name": "Xander Corvus",
      "person_id": 46000
    }
  ],
  "release_date": "2018-03-02",
  "scene_id": 42833,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Choking",
    "Corporal Punishment",
    "Discipline",
    "Family Roleplay",
    "Female Slave",
    "Flogging",
    "Humiliation",
    "master",
    "MILF",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Submission",
    "top",
    "unshaved",
    "white"
  ],
  "title": "It's Only Natural:MILF Professor Made Anal Slave by Step-Daughter"
}