{
  "collections": [
    "Families Tied"
  ],
  "description": "Skylar is a hot nubile young lady, looking ripe for sex with her nose buried in a book. She's stressed about everything including her upcoming Spanish exam and private tutoring session. Her Hot Step-Mommy tries help her calm down with some breathing exercises, but Skylar just ends up gazing into her Mom's cleavage. Syren gives her a noogie and tells her to get laid, winking as she leaves Skylar with her hot Spanish professor, Mr Nomar. Sexually frustrated, stressed, and unable to interpret all the mixed messages, Skylar goes for broke and tries unzip Ramon's pants and suck her way to a passing grade. Mr. Nomar is not going to make it that easy for her and makes her beg for his dick in Spanish, seducing him slowly while he rips her out of her school girl uniform and pushes her sweet young face balls deep onto his cock. When she starts giggling as she speaks Spanish again we ties her ass up tight, covering her voluptuous tits with clamps, tying her sweet pussy open, and shocks her inexperienced clit with an electric zapper while she attempts to learn her damn lesson. When she still doesn't show any progress her plunges his fingers into her snatch and fucks a deluge of squirt out her like a screaming fountain of cum. Suddenly relaxed and able to speak spanish, she begs him to fuck her and her take a couple more rounds out on her bound body, dicking her down while she cums like a little undisciplined slut. When Syren arrives back home with the groceries she finds a concerned Ramon waiting for her. He is curious if she gave Skylar the idea to seduce him, and what kind of lesson is that to teach a young girl. Syren tries to offer money, then apologies, and then finally a blow job, but that's not what Ramon is looking for. He gives that anal slut MILF a major beating, reddening her huge tits with a flogger, spanking and caning her big beautiful ass, and making her smell his dick until she is granted permission to pounce. After a throat fucking she is thrown on the kitchen floor and fucked in the ass until she begs for her orgasms like a good Mommy. Little does she know, Skylar is still home and tied up in the next room. Ramon reunites the ladies and takes them on a whirlwind family bonding experience as Syren teaches her fresh faced academic how to suck dick, bouncing on a man's cock, take a cattle prod, and submit to bondage sex in the pursuit of the finer things in life. Skylar gleefully licks her Mommy's cunt and takes a cream pie that drips out onto her mother's face. Big tits, big asses, great chemistry. Don't miss this one.Â",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    },
    {
      "name": "Skylar Snow ",
      "person_id": 60403
    }
  ],
  "release_date": "2018-01-19",
  "scene_id": 42830,
  "tags": [
    "anal",
    "bdsm",
    "big tits",
    "bondage",
    "caning",
    "cattle prod",
    "Corporal Punishment",
    "couple",
    "discipline",
    "Family Roleplay",
    "female slave",
    "humiliation",
    "master",
    "MILF",
    "oral sex",
    "role play",
    "rope bondage",
    "Rough Sex",
    "spanking",
    "straight",
    "Zapper"
  ],
  "title": "The Perfectionist: Anal Seductress Teaches Co-ed to Squirt for Grades"
}