{
  "collections": [
    "Families Tied"
  ],
  "description": "Penny Barber is bustling around the house preparing a cookie plate for her thick dicked step-son to get home for Christmas. Her husband is safely scheduled to return a day late, leaving her lots of time to get all her slutty holes filled and get her round ass punished for all her misdeeds this year with a strict belting and caning. Huge tits bouncing in her Christmas sweater she runs right into a holiday disaster: her step-son making out with his goth girlfriend he brought home for Christmas. Cookies come crashing to the floor as Penny regards her new rival Ivy LaBelle. A curvy perfect body to match Penny's with plenty of attitude, iconoclast Ivy is having none of Penny's holiday cheer, and drags her boyfriend upstairs to fuck her in tight bondage, flogging her wet cunt, and spanking her big round ass. Xander takes Ivy to task for thinking she's superior to his step-mother, but nothing prepares him for when Penny charges right up the stairs and calls him out of his bedroom in a clever bid to get some. He politely tries to stay out of trouble, but Penny get's right on his cock and tell's him she needs her punishment. Her handsy bullshit activates a sadistic flare in him, and he throws her over the couch, spanking the shit out of her, belting her ass, and giving her a strict caning. Putting her in tight belt bondage he plows her ass hard and fast, making her scream and cum like a whore in the living room. However, even that isn't enough for Penny. She waits like a cat for her prey in the living room all night, and eventually is rewarded when Ivy appears to steal some cookies from Santa's platter. She gives Ivy her Christmas present early: a big metal butt plug to prepare for her step-son's monster cock. Before she can get fucked, Ivy has to endure confessional, having hot wax dripped all over her tender flesh, flogged off, and made to hold her orgasms back while holding heavy buckets of coal. When Penny is sure this little goth slut is good enough for her step-son, she commences in training her how to take a huge dick in her tight ass, smothering her new step-daughter in her tits and cropping her swollen red cunt until she cums, shuddering and screaming in front of the Christmas Tree.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Xander Corvus",
      "person_id": 46000
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Ivy LeBelle",
      "person_id": 60683
    }
  ],
  "release_date": "2017-12-22",
  "scene_id": 42832,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Caning",
    "christmas",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "Family Roleplay",
    "Female Slave",
    "Flogging",
    "holidays",
    "Hot Wax",
    "Humiliation",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Smothering",
    "Spanking",
    "Straight"
  ],
  "title": "Cock Crazed Step-Mommy Just Wants Anal For Christmas"
}