{
  "collections": [
    "Families Tied"
  ],
  "description": "A politician is exposed by her slutty little dick hungry step-bitch. Family made to do everything the reporter wants: anal, bondage, corporeal, clamps, & electro.\nAngel Alwood is barely keeping her huge slutty tits buttoned under her satin blouse as she maintains her veneer as a conservative christian woman. She's in the a high pressure race for governor, running on the family platform. She smiles and makes prayer hands for the camera as her precocious little step bitch Lisey plots her revenge. Exposing her step-mother's history of orgies and cheating is Lisey's main intention, but hey, the reporter is cute and she hasn't seen a hard dick in months... Soon Lisey is on her back, getting her little liberal arts school ass spanked red, shocked and slobbering all over the reporter's huge cock. Once in a bondage pile driver getting railed in the ass and choked out with a belt, maybe she had some second thoughts, but they are soon washed away with a deluge of orgasms.\nAngel comes home to find her precious little christian angel bound on a sybian ride with a strange man next to her, but the picture really comes into focus when he presents his upcoming twitter post, a photo of Lisey posing with all of her mother's sex toys. Lisey leaps to her feet, and takes her mother down a in a storm of shit talk one would not expect out of a little blond like Lisey. Pearls ripped from her neck and made to suck dick at the hands of her teen, Angel snarls and exposes her true nature, swallowing down Ramon's cock, and screaming in pleasure as she is made to lick her daughter's ass, ride the sybian, and take flogging and clamps on her voluptuous tits.\nThe rest of the day is spent teaching Lisey good life skills, like stealing all the orgasms, how to ride cock like a good girl, taking it in rope bondage, canes, pussy licking, and how to get your little bitch face covered in cum.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Angel Allwood",
      "person_id": 52348
    },
    {
      "name": "Lisey Sweet",
      "person_id": 60674
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2018-01-05",
  "scene_id": 42831,
  "tags": [
    "Anal",
    "BDSM",
    "Best of Anal",
    "blond",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Family Roleplay",
    "Feet",
    "Female Slave",
    "Flogging",
    "Humiliation",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Sybian"
  ],
  "title": "The Family Platform: Anal Whore Exposed by Slutty Step-Daughter"
}