{
  "collections": [
    "Device Bondage"
  ],
  "description": "Roxanne and The Pope create some of the most intense power exchange ever seen on the inter-webs. The energy between them is explosive and like all of their interactions before this one, it's going to be intense as fuck. Roxanne starts out strapped with leather belts to a pole with her hands above her head, and balancing on very small platforms. After ripping her clothes off and putting her on display, The Pope begins his sadistic terror on her. She is flogged, choked, slapped and made to cum. Then the platforms are removed and Roxanne finds her self hanging above the ground and totally helpless. Next she is bent over in a doggy style position with her arms in a brutal strappado. There is severe impact on her body from floggers all the way to The Pope's fist beating her flesh into submission. Her mouth and pussy get fucked hard and fast and then she is made to orgasm more. In the final scene Roxanne is on her back in a predicament position that will only become more grueling as the scene goes on. The Pope enters and puts a septum clamp on her and pulls her head up. It's not long before her neck gives out and she has to be released from the clamp, but that doesn't stop these two. The intensity continues to grow and after the orgasms, Roxanne is subjected to more brutal breath play to finish the day.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Roxanne Rae",
      "person_id": 50987
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2018-01-25",
  "scene_id": 42835,
  "tags": [
    "BDSM",
    "big dick",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "The Pope",
    "unshaved",
    "white"
  ],
  "title": "Careful What You Wish For"
}