{
  "collections": [
    "Hogtied"
  ],
  "description": "The legendary Angela White has decided that she wanted to be tied up and tormented, and only wants the best of the best. She decided that The Pope was the only one that she would bestow this honor to, and he gladly accepted. We begin with her in a standing position with her hands above her head and her legs spread with a spreader bar. As soon as The Pope puts his hands on her you can see her eyes roll back in lustful desire. This busty slut has been waiting a long time for this moment and now it's finally here. She is flogged and clamped to get the juices flowing, her ass is spanked and her hair is pulled, yet she has the most seductive look in her eyes as he administers her punishment. She tries to not cum to prevent it from ending, but The Pope has other plans for this slut. Next Angela is pulled into the air in her first suspension and the torment begins, but this time she is subjected to brutal bastinado with foot caning and rubber bands. There is amazing breath control and then The Pope fucks her pussy into squirting orgasms. The final scene starts with Angela in the air for her second suspension of the day. She is caned all over her body and then The Pope attacks her soft soles with more bastinado which fills the dungeon with her screams of pain. She is finished off with a face fucking and then pussy fucking with more squirting orgasms. This is a day for the record books and we were thrilled that Angela decided to let us pop her bondage cherry.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "The Pope",
      "person_id": 27779
    },
    {
      "name": "Angela White",
      "person_id": 60688
    }
  ],
  "release_date": "2018-02-15",
  "scene_id": 42838,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "caning",
    "Corporal Punishment",
    "domination",
    "dungeon",
    "Fingering",
    "Handler",
    "humiliation",
    "pain",
    "rope bondage",
    "squirting",
    "straight",
    "submission",
    "suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Angela White's First Time in Brutal Bondage and Tormented"
}