{
  "collections": [
    "Fucking Machines"
  ],
  "description": "We begin with Lyra stripping away her clothes and showing us her magnificent body. It's flawless, so we sit back and take it all in as she exposes her flesh to us. She leaves the socks and boots on, as too not give us everything at once. Now that her pussy is exposed she can't help but touch it. Then Lyra picks up the magic wand and starts to masturbate and give us multiple orgasms. Once her pussy is primed and ready to fuck we set up the first machine. She is in a missionary position with her legs spread wide. She has the perfect little vibe that doesn't block any of the good parts, so we get to see all of the penetration that we want to see. Next Lyra is standing and we start with her ass facing out to us in all of its glory. She is fucked so hard that she begins to try and find other ways of getting her pussy fucked while standing above a fucking machine. She writhes around and eventually we get her to turn around and face us, so that we can see her in all of her orgasmic bliss. Next she is face down on the floor with our most powerful machine placed between her legs. We start out slow, and slowly turn up the intensity until Lyra can hardly even speak. The room is filled with moans as Lyra's eyes roll back in her head. We finish her off with a sybian ride. This is her first time ever and you will see how much she loves it. Before the ride is over, she turns around to show off that ass one more time with a massive orgasm.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lyra Law",
      "person_id": 58708
    }
  ],
  "release_date": "2018-01-17",
  "scene_id": 42842,
  "tags": [
    "Blonde",
    "Brunette",
    "Machine Dildo",
    "multiple orgasms",
    "natural boobs",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Sybian",
    "Tattoo",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Sexy As Fuck Blonde Babe is Machine Fucked"
}