{
  "collections": [
    "Device Bondage"
  ],
  "description": "Dahlia begins in a brutal predicament with her legs spread wide and her arms pulled back into a strappado. She knew from the first moment that she was put in the device that she was fucked. Her ass sticks out like a target for The Pope to take aim at and destroy. He spanks and flogs her until he grows bored and moves on to her tits. Clothespins are applied to her natural tits, then he moves behind her to start canning her feet. The bastinado almost brings her to tears, but not yet. She struggles against the cold steel and leather, but there is no escaping this bondage. The Pope fucks Dahlia's mouth and pussy to command orgasms out of her willing pussy. Next Dahlia is in a pile driver position with her limbs locked into steel traps. The Pope makes his way to her tender soles and attacks with sadistic rage. He terrorizes her feet with brutal bastinado until the room is filled with her screams. Once Dahlia has been pushed all the way to the edge with torment, she then gets a mouthful of cock and then her pussy is fucked mercilessly until she can't cum anymore. In the final scene she is on her back with her legs spread wide. She is the most vulnerable at this point. Her body is beaten and abused before The Pope makes good use of her whore holes on final time. Dahlia is drained and exhausted and is finally released from the sadistic clutches of The Pope.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Dahlia Sky",
      "person_id": 45819
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2018-02-08",
  "scene_id": 42843,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Machine Dildo",
    "Metal Bondage",
    "natural boobs",
    "Predicament Shoots",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "The Pope",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Blonde Damsel is Distressed in Brutal Devices and Tormented"
}