{
  "collections": [
    "Bound Gods"
  ],
  "description": "Welcome Addison Blue to a special holiday Bound Gods update! Addison decides to go to bed early but Santa Daddy Jaxton Wheeler has other plans. Jaxton creeps up on a sleeping Addison and decides he's the perfect present - for himself! Jaxton pulls Addison from bed for some holiday fun. Addison is bound in leather straps and admits to Santa that he has been a naughty boy. Jaxton spanks Addison's ass red and slaps it with a leather strap. Ass stinging, Addison cries out in pain and promises he'll be a dirty ass whore for Santa. Santa can't wait, he licks Addison's ass in anticipation for what's to cum. Next Addison is bound in rope and garland. He is blindfolded and every sensation is amplified. Jaxton rams his cock down Addison's throat and gives him a good throat fucking. Addison gags on dick as he struggles to take all of Santa's big cock. Santa puts clover clamps on Addison's sensitive nipples and tugs them as he uses Addison's warm wet mouth. Finally it's time for Santa to fill his flesh stocking. He stuffs candy cane after candy cane in Addison's sweet ass, delighting in Addison's moans and squirms. Hog-tied with rope, there is no escape from this big beefy Santa and his devious desires. Santa licks those candy canes and spreads Addison's ass cheeks to admire his handy work. Then Santa removes the candy canes from his boy's ass and replaces them with his rock hard cock. Addison moans as Jaxton rides him hard, pounding that warm hole. Jaxton pulls out and blows his load in Jaxton's mouth. Then he jacks Addison off on a Christmas cookie and feeds it to him, icing and all.",
  "models": [
    {
      "name": "Jaxton Wheeler",
      "person_id": 53352
    },
    {
      "name": "Addison Blue ",
      "person_id": 60775
    }
  ],
  "release_date": "2017-12-21",
  "scene_id": 42848,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "christmas",
    "clover clamps",
    "Corporal Punishment",
    "domination",
    "gay",
    "holidays",
    "humiliation",
    "leather",
    "Male Sub",
    "master",
    "pain",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "Spoiled Brats",
    "submission",
    "takedown"
  ],
  "title": "Santa's Slut: Rough Takedown Sex for First Time Kink Model"
}