{
  "collections": [
    "Hogtied"
  ],
  "description": "Ashley is known for how intense she likes to play. She is true enthusiast of rope bondage as well as brutal torment, which makes her a perfect fit for Hogtied. Every position will push her ability to tolerate what The Pope has planned for her. It will not be an easy day and she knows that, but the level of intensity is yet to be disclosed to her. We begin with her tied in a corner in a stress position with her made to squat and her neck pulled tight in the other direction. She is fucked before The Pope even enters the scene. He enters and instantly goes to work issuing torment to her entire body, but most importantly her pussy. After the brutal attack with floggers and crops, a crotch rope is added and then a bowling ball is added to hold this pain slut in place. Next she is in a doggy position and is made to endure a brutal flogging before she is fucked into massive squirting orgasms. Her pussy is drained of all of it’s slut nectar and she is left to recover for the final scene. We open with Ashley on the floor with one leg pulled in the air. She is flogged more as well as made to suffer through a nasty bastinado session. She is made to orgasm more which leads to more squirting, and then she is pulled into one of the most brutal suspension in history. The “hanged man” is a suspension that has the captive hanging from one ankle. All of her weight hangs from such a small amount of rope, which is why this is so fucking brutally extreme.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ashley Lane",
      "person_id": 52112
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2018-03-01",
  "scene_id": 42841,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Crotch Rope",
    "Domination",
    "Faces Of Pain",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Girl Next Door Ashley Lane in Extreme Bondage with Squirting Orgasms!"
}