{
  "collections": [
    "Bound Gods"
  ],
  "description": "Smooth Stud Casey Everett has been a bad boy this year and needs to pay for his nasty habits before the new year. All tied up in rope bondage and restrained to the filthy floor, this handsome god is stripped naked down to their jockstrap with their ass up in the air ready for a new year's beating. Master Hunter Samson with his full beard and clad in his dungeon leather harness and vest is ready to beat this boy senseless for his amusement. He gets his toys hair hole ready with some rimming before his riding crop comes out to teach a lesson in pain. Casey's screams are muffled with a gag before Hunter Samson's big veiny cock comes out to stuff down Casey's throat. Later pretty boy jock Casey is blindfolded and restrained to the wall with his legs spread wide open. This clean cut stud's next lesson is shocking. The electric toys come and go right up his ass. This gets Casey Everett rock hard and ready for his cock to get deep throated. Finally a brutal fucking is delivered by Master Samson. His huge cock pounds Casey's hair eager hole. Tied up in rope suspension again, Casey struggles with pain and pleasure. The pounding causes this bound god to scream and both men shoot huge loads. Casey is ready for the New Year.",
  "models": [
    {
      "name": "Casey Everett",
      "person_id": 60450
    },
    {
      "name": "Hunter Samson",
      "person_id": 60747
    }
  ],
  "release_date": "2017-12-28",
  "scene_id": 42850,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crop",
    "Cut",
    "domination",
    "dungeon",
    "gag",
    "gay",
    "humiliation",
    "Jock",
    "jockstrap",
    "leather",
    "Male Sub",
    "master",
    "pain",
    "harness",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "Smooth",
    "Stud",
    "submission",
    "suspension",
    "the wall"
  ],
  "title": "Master Samson Brutally Trains Clean Cut Jock Casey Everett"
}