{
  "collections": [
    "Men On Edge"
  ],
  "description": "Tall and athletic muscle stud Hunter Samson visits KinkMen's dungeon for the first time. Right from the start his rock hard cock is throbbing with anticipation. As he methodically gets restrained with tight and severe rope bondage, his cock gets examined with black leather gloves. He purrs as he submits to the sadistic whims of two male dom's. Slowly the tip of his penis is licked until pre-cum begins to ooze from his cock hole. As two sets of lubbed hands massage this huge cock he begs to cum. He pleads with his handlers to allow him to blow his load but they only laugh and revel in the orgasm denial. The two dom's take turns sucking his balls and deep throating his cock. They keep edging him closer and closer to cumming and each time they laugh as Hunter trembles from the pain of being denied his orgasm. But the torment has only just begun. Next Hunter gets thrown on his back with his legs tied in a spread eagle. The edging takes up again and within seconds Hunters begs to cum. But the sadists have only just begun to torment their masochistic male slave. They jam a huge dildo into his tight asshole and stimulate his foreskin with a hitachi. As the dildo massages his sensitive prostate he mumbles garbled requests for mercy from the sides of a huge gag that is stuffed into his mouth. As his nipples are squeezed by severe clover clamps he edges closer and closer to cumming. And when he can't possibly contain himself any longer his male dom's allow him to blow a massive load of cum all over himself. As Hunter is fed a big handful of his own jizz, he revels in the joy of pleasing his sadistic dom's and serving their most depraved desires.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Hunter Samson",
      "person_id": 60747
    }
  ],
  "release_date": "2017-12-26",
  "scene_id": 42852,
  "tags": [
    "athletic",
    "bdsm",
    "bondage",
    "clover clamps",
    "dildo",
    "dungeon",
    "Edging",
    "gag",
    "gay",
    "gloves",
    "Hitachi",
    "leather",
    "leather gloves",
    "Male Handler",
    "Male Sub",
    "muscle",
    "oral sex",
    "orgasm denial",
    "pain",
    "Prostate Stimulation",
    "rope bondage",
    "slave",
    "Stud",
    "tickling"
  ],
  "title": "Tall Stud Hunter Samson Tormented with Rope Bondage and Orgasm Denial "
}