{
  "collections": [
    "Men On Edge"
  ],
  "description": "Pierce Paris is in the slammer for trying to carry pot back over the Canadian border and border patrol cop Sebastian Keys isn't looking to let him off easy. After two days in this small cell without masturbating, Pierce is all pent up. He eagerly accepts a deal with the horny border patrol agent and ends up tied up, blindfolded, and helpless. Sebastian cuts off his underwear to reveal a nice long fat cock. He can't believe he's gotten so lucky -- this is going to be fun. Pierce's dick is rock hard before Sebastian even touches it and it only gets harder once Sebastian starts stroking it. Sebastian teases Piece with his hands and his wet mouth. Every time Piece gets close to cumming, Sebastian pulls away, leaving Pierce to thrust his hard dick into nothing but air. Then Sebastian breaks out the stroker and jacks Pierce off with it. Pierce loves the sensation and gets even closer to cumming before being denied. Next, Piece is bound and gagged. Sebastian plays with his nipples before putting clover clamps on them. Pierce is a huge pain slut and loves the added sensation. He thrusts into Sebastian's hands and mouth, trying to get off. But Sebastian has other plans for Pierce first. He spins Pierce around and pushes his fingers into Pierce's tight asshole. Pierce's ass swallows those fingers right up, so Sebastian inserts more and more fingers until almost his whole hand is in Pierce's ass. Pierce rocks back and forth on Sebastian's fist while Sebastian jerks off his cock. Pierce begs to cum over and over again, pleading with the border patrol agent for release. After ripping off the clamps and smacking Pierce's chest and abs, Sebastian finally allows Pierce to cum. Pierce blows a fat load all over Sebastian's uniform, and is relieved, thinking he's home free. But it's not over for Pierce yet, he still has to make bail and pay Sebastian back for dry cleaning.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2018-01-09",
  "scene_id": 42851,
  "tags": [
    "anal",
    "Anal Fisting",
    "bdsm",
    "belly punching",
    "blowjob",
    "bondage",
    "clover clamps",
    "cop",
    "Corporal Punishment",
    "domination",
    "Edging",
    "gay",
    "humiliation",
    "Male Handler",
    "Male Sub",
    "master",
    "oral sex",
    "pain",
    "pain slut",
    "Prostate Stimulation",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "Stud",
    "submission",
    "tickling"
  ],
  "title": "All-American Stud Pierce Paris Gets Edged and Fisted by Border Patrol"
}