{
  "collections": [
    "Pascals Sub Sluts"
  ],
  "description": "KINK.COM CONTENT DEPARTMENT NOTE:\nMonsieur Pascal only allows us to use a very limited number of his sluts at any one time. Every time we put up a scene we have to take one down. Since he has been a bit tardy with his latest batch of scenes, he asked us to republish a classic one from years past. This scene has not been on our site for 2 years. We selected this particular scene because it features the amazing Mea Melone whom many of our members have come to love. Rest assured a fresh batch of scenes will be coming up soon.\n\nMea Melone is a 26-year-old Czech beauty with a body to die for and a lusty appetite for sex in all three of her hungry holes. But she’s a novice when it comes to rough sex. She simply never had it. Fast-forward to the end of the day and Mea’s on cloud 9. Best sex she’s ever had in her life, she laughs, not quite believing what’s just happened. Her solo scene kicks things off beautifully. Andy instructs her to strip off and display herself, then tells her to use the wand to get herself off. It doesn’t take her long. Then I step in and take over, controlling her second orgasm, bringing her to brink, stopping her, etc. I tell her to get my dick off and wank it. It sends the bitch crazy. Then for the scene we set it up so that she’s Anita’s half-sister (Anita, of course, being my girlfriend). Mea’s never seen my porn before so we sit her down in front of the monitor and in no time she’s so turned on she’s reaching out to squeeze my dick. Cue the gorgeous bitch pulling down my trousers and completely swallowing it down to the hilt. I get her up on the table, right in front of the office window, and fuck her in doggy then make her to squirt all over the desktop. We move to the lounge and I make her cum fucking her arse in mish. I facefuck her hard after that, then make her cum again in cowgirl. And it just goes on and on, more ramming, more squirting, just more more more of Mea Melone. And she glugs down my spunk at the end with nary a pause. Wife material, ladies and gentlemen, no word of a lie. (And then I fucked after the pics as a Saturday Extra and came up her arse.)",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Mea Melone",
      "person_id": 60621
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2020-07-16",
  "scene_id": 42859,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Collar",
    "Domination",
    "Facefucking",
    "foreskin",
    "Leather Belt",
    "natural boobs",
    "Public",
    "Rough Sex",
    "Squirting",
    "Straight",
    "Sub",
    "Submission",
    "Partner Studio",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Mea Melone: Virgin Sub's Best Fuck Ever"
}