{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "We love strong women at PascalsSubSluts, women who are open and a good laugh but don't take any bullshit. And who, of course, love to let it all go at the hands of a bastard gentleman with a throbbing argument for them to submit and obey. Well, they don't get much stronger than Kiki Minaj. Mess with this bitch and you'll know it. Treat her good and she'll have you in stitches. The girl's a star -- reality telly's loss, reality porn's gain. She's also an internet slut and serves PascalsSubSluts wonderfully. She's tough and her scene's rough. She plays a babysitter who's looking after my GF's sister's baby. We're supposed to be looking after it but we've had to do a shoot at the last minute. We get back to find her wanking off to gay porn on Andy's computer -- \"tube site I hasten to add!\" (Andy) -- while the little darling's shrieking its head off in the next room. But since she didn't hear us come in (cos she's got the headphones on) and Andy's got her on vid pulling up her knickers in a panic (cos his camcorder's always on), she fast finds herself under strict instruction by two dirty old men to pull them down again and finish what she started -- else the taped evidence be submitted to her childcare agency and you wouldn't like that now sweetheart, would you? Alas once she's made herself cum she's still got work to do because she's given me such a raging hard-on that... well, you know. Needs must. And blackmail is such a happy lubricant.",
  "directors": [],
  "models": [
    {
      "name": "Kiki Minaj",
      "person_id": 60630
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    },
    {
      "name": "Andy Baxter",
      "person_id": 60614
    }
  ],
  "release_date": "2018-04-03",
  "scene_id": 42868,
  "tags": [
    "Big Ass",
    "Big Natural Tits",
    "Blowjob",
    "Brunette",
    "Choking",
    "Creampie",
    "Deepthroat",
    "Facefucking",
    "Gay",
    "Hitachi",
    "Interracial",
    "masturbation",
    "PIV",
    "Spanking",
    "Straight",
    "Sub",
    "Submission",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Kiki Minaj: Babysitter Punished 4 Wanking On The Job"
}