{
  "collections": [
    "Pascals Sub Sluts"
  ],
  "description": "KINK.COM CONTENT DEPARTMENT NOTE: Monsieur Pascal only allows us to use a very limited number of his sluts at any one time. Every time we put up a scene we have to take one down. Since he has been a bit tardy with his latest batch of scenes, he asked us to republish a classic one from years past. This scene has not been on our site for 2 years. We selected this particular scene because it features the incredible Lucia Love whom many of our members have come to love Love needs to fuck, she craves to fuck. Bringing her back for a third session was a no-brainer - especially since she’d started shooting anal since the last time we saw her and developed a serious appetite for pain. We kick things off with her suspended from the hook. We stick a gag in her mouth and she starts drooling down on to her dress. Then P rips the dress off and clips clothes pegs to her beautiful, milky-white body. He fucks her straight afterwards then we flick the pegs off. He lets her down and fucks her throat really hard, just the way she loves it, then orders her to get herself off by straddling his leg and rubbing her cunt up and down on it. She obeys and cums. And then after that she gets fucked in her cunt and arsehole and well, you just can’t take your eyes off it, folks. And P makes her squirt into a bowl then makes her drink it at the end, then she drinks his spunk. It’s top-notch.",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Lucia Love",
      "person_id": 58209
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2020-08-13",
  "scene_id": 42865,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "big dick",
    "Big Tits",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Choking",
    "Clothespins",
    "Domination",
    "Facial",
    "foreskin",
    "Gag",
    "Leather Cuffs",
    "masturbation",
    "natural boobs",
    "Pain",
    "PIV",
    "Redhead",
    "Rough Sex",
    "Squirting",
    "Straight",
    "Sub",
    "Submission",
    "Suspension",
    "Partner Studio",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Lucia Love: Anal Goddess, Pain Junkie"
}