{
  "collections": [
    "Hogtied"
  ],
  "description": "Phoenix is a personal friend of The Pope's and she is willing to let him do things to her that no ones in the entire world is allowed to do. She loves being helpless in strict bondage, but that is where it ends. She does not like to be spanked, vibed, or tormented in any way; this is where things get interesting. Knowing that she doesn't like these activities, she signed up to work with one of the most sadistic heathens in the industry. We begin with her locked away in a steel cage writhing around in her sexual desires. Phoenix is here to let all of the demons out and can't wait for The Pope to get her tied up and have his way with her. She is tied in a standing position and then the bondage is manipulated to put her in a stressful predicament position to ensure her suffering. Clothespins are applied to all of the sensitive spots just to put a smile on everyone's face. Next we put her in the air in a signature suspension of The Pope's hat has her whore legs spread wide open and available for whatever he wants. After more torment, he administers more orgasms that have her begging for it to stop. In the final scene she is on her back with her legs spread as much as possible for full access to her pride and joy; her beloved pussy. The Pope torments her feet with brutal bastinado before having his way with her pussy for the final orgasms.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Phoenix Marie",
      "person_id": 17093
    },
    {
      "name": "The Pope",
      "person_id": 27779
    }
  ],
  "release_date": "2018-03-29",
  "scene_id": 42886,
  "tags": [
    "Ball Gag",
    "BDSM",
    "BeaverDay",
    "big dick",
    "Big Tits",
    "Blonde",
    "Bondage",
    "brunet",
    "Cage",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "fake boobs",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Rope Bondage",
    "shaved",
    "Straight",
    "Submission",
    "Suspension",
    "Tattoo",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Phoenix Marie and Her Big Tits are Captured in Bondage and Tormented"
}