{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Maxim Law is a cute, blonde girl next door who just wants some help moving her boxes out of storage. But when the movers arrive, they quickly change their plans, and Maxim is left in a bind. They won't be moving any boxes, because their sights are set on her alone. They quickly overpower her, kissing and sucking on her big natural tits. Before she knows it she's up on a table, locked in metal bondage, taking five hard cocks in her throat and pussy, turned into a spit-soaked, sloppy mess. But she still wants more, and the guys want more too! They swap the metal bondage for a leather arm-binder. Maxim is locked up in the contraption with her arms behind her back with no way to use them, or even move them. The guys throw her around between them, pounding her hot wet cunt and driving their big cocks into her throat. Even after so much dick and savaging, Maxim still isn't finished. She's released from her bondage so she can take as much double penetration as possible, filling her airtight. The guys take turns drilling her pussy and her ass, one after the other, flipping her over back and forth, stretching that pussy and asshole out and plowing them deep, making her gape. Finally, fully fucked and wrecked, she takes their huge loads on her face, slurping it up like a greedy slut.",
  "models": [
    {
      "name": "Maxim Law",
      "person_id": 60400
    },
    {
      "name": "Cody Steele ",
      "person_id": 60685
    },
    {
      "name": "Cyrus King ",
      "person_id": 60686
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Ray Black ",
      "person_id": 60687
    }
  ],
  "release_date": "2017-11-15",
  "scene_id": 42914,
  "tags": [
    "anal",
    "bdsm",
    "big natural tits",
    "blonde",
    "Blowbang",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "Double Penetration",
    "gangbang",
    "gape",
    "leather",
    "metal bondage",
    "role play",
    "Rough Sex",
    "straight"
  ],
  "title": "Maxim Law, Blonde Girl Next Door, Bound and Gangbanged by Horny Movers"
}