{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Pervy Corbin Dallas is jerking off furiously when his stepmom Julia Ann walks in on him. There he is, in her bed, smothering his face with her panties, and Julia's furious! After a quick verbal dress down, Julia realizes that this isn't going to be enough to put her stepson in his place. So she climbs on the bed and gives him what he wants...and then some. First she stuffs her panties into his mouth, berating him and mocking him the whole time, daring him to keep jerking off. Then she takes his cock in her own hand and shows him how it's supposed to be done. Corbin's excited but confused, especially when Julia starts taking her clothes off and making him wear them. She puts him over her knee and spanks his ass, but that's just the beginning of the punishment. She then ties him up and cracks out a huge fucking strap-on. But that giant cock goes straight into Corbin's ass, and Julia delights in plowing him deep and hard. She orders him onto his back and then continues fucking his stretched hole, commanding that he make himself slide on it like the little pervy momma's bitch he is. She jerks him off while he fucks himself on her strap-on, and makes him cum even as she's telling him to hold it. The next punishment is wiping his load all over his face and leaving him there. Finally, Julia brings out the big guns and Corbin's put into an inverted suspension and made to eat her pussy until she cums...repeatedly. The blood rushes to his head as Julia pulls his face straight into her wet pussy, using his mouth and tongue to cum. When she's finished with him, she gets up and leaves him there, to think about what he's done.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    },
    {
      "name": "Julia Ann",
      "person_id": 32896
    }
  ],
  "release_date": "2017-11-22",
  "scene_id": 42919,
  "tags": [
    "BDSM",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Handjob",
    "Humiliation",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Smothering",
    "Sniffing",
    "Straight",
    "Suspension"
  ],
  "title": "Mommy's Little Pervert"
}