{
  "collections": [
    "TS Seduction"
  ],
  "description": "Standing in her dungeon wearing a hot black latex corset with matching latex thigh-highs, Chelsea Marie is already in full swing, flogging the back of her submissive D. Arclyte, who dawns only a black leather hood and a black leather jock as he's chained to the floor on his knees. She removes his hood and continues to flog him repeatedly, intermittently stopping only to jam her cock down his throat, smothering his mouth and nose until he's starving for air. She tells him that her boobs are getting jealous and shoves his face in-between them guiding his tongue to wear she wants it. She pulls his head away and grabs at her own breast and squeezes it, shooting breast milk out and lactating all over his face. Next Chelsea shoves a ball-gag in D's mouth and makes him get on his hands and knees and spanks his ass red until he's begging for her cock. Chelsea commands D to get on her bed and tells him again to beg to get his ass fucked with her beautiful cock. With D on his side, Chelsea shoves her hard cock in his ass and fucks it raw. She flips him over onto his knees and fucks his ass some more, deep and hard. Making her own asshole jealous she commands D to now fuck her, and without hesitation they switch places and Chelsea gets on her back and spreads her legs. D slides his cock into her ass and pounds the cum right out of her releasing a massive load that D quickly cleans up with his tongue. Finally she wants his cum too and climbs on top of him and jerks his dick fast and it doesn't take long to send his cum flying too which he now also has to clean up. Wishing D a happy birthday, Chelsea puts the black leather hood back on his head and tells him, \"Until next year...\"",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chelsea Marie",
      "person_id": 40544
    },
    {
      "name": "D. Arclyte",
      "person_id": 59025
    }
  ],
  "release_date": "2017-12-12",
  "scene_id": 42921,
  "tags": [
    "Anal",
    "Blowjob",
    "Cock Worship",
    "Corset",
    "Domination",
    "dungeon",
    "Flogging",
    "Gag",
    "Hood",
    "jock",
    "Latex",
    "Leather",
    "Male Sub",
    "Role Play",
    "Smothering",
    "Straight",
    "switch",
    "top",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Chelsea Marie Flogs and Flip-Fucks with D. Arclyte"
}