{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Real life partners Domina Helena Locke and D. Arclyte team up for this sexually charged, sensual, and rough scene! After crashing into Helena in a grocery store, D immediately drops to his knees to pick up his frozen meals. Looking up at Helena from the ground, he realizes there's no place he'd rather be than serving, worshipping, and adoring the Divine Bitch before him. Fast forward to their dungeon, and D is clad in a leather jock strap and harness, while Helena towers above him, wearing thigh high boots and sexy shiny latex. D learns his place fast as Helena slaps, spits, punches, and pushes him to become a better man. D is choked between Helena's beautiful thighs as Helena laughs with pleasure. Next, D is suspended in rope bondage as Helena fucks his ass with her big strap on. Helena's cock drives D crazy and he begs to cum as Helena pushes her cock deeper and deeper into his ass. Then she brings him down to the floor and spanks his ass all over as D yells in pain. After she gets his pathetic ass all rosy, she returns to fucking her ass, as long and as hard as she wants. Finally, D is tied spread eagle to a bed while Helena towers above him. He worships her beautiful feet, licking between the toes and deep throating her feet as much as he can. Then this lucky pet gets to lick Helena's cunt and gets smothered under her voluptuous ass. After the breath play, Helena rides D's cock, pleasuring herself with her pet's body. D trembles, gripping the bed, trying not to cum as Helena's pussy slides up and down his hard cock. Once Helena cums, she turns her attention back to D, and works his cock till he sprays all over himself like the filthy slut he is.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "D. Arclyte",
      "person_id": 59025
    },
    {
      "name": "Helena Locke",
      "person_id": 59793
    }
  ],
  "release_date": "2017-12-05",
  "scene_id": 42922,
  "tags": [
    "bdsm",
    "bondage",
    "CBT",
    "Corporal Punishment",
    "couple",
    "dominatrix",
    "dungeon",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "hand job",
    "humiliation",
    "Jock",
    "latex",
    "leather",
    "Male Sub",
    "orgasm denial",
    "pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "harness",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "strap on"
  ],
  "title": "The Femdom Lifestyle: Real Couple Plays Hard"
}