{
  "collections": [
    "TS Seduction"
  ],
  "description": "Dr. Amanda Jade sits at her desk listening to her patient Corbin Dallas spill his guts on the chez lounge about his obsession with being dominated by powerful women. The thought of his female boss bending him over and spanking his bare ass across her desk runs through his head daily and Corbin is afraid he cant live a normal life as this obsession gets in the way of work and his social life. Dr. Amanda Jade suggests trying a new non-traditional method as she slowly gets up and walks from her seat to the front of her desk. Her patient Corbin looking confused but pleased cant take his eyes off of her long sexy legs and big round ass under her tight red skirt. Dr. Jade commands Corbin to crawl to her on his knees and kiss her feet. He works his tongue around her toes and up one leg and then the other. Dr. Jade turns around and lifts her skirt exposing her beautiful ass for him to worship. She shoves his head deep into her ass and tells him to get naked and bend over her desk. Amanda takes a paddle out and repeatedly spanks Corbin's bare ass raw and hard, teasing his asshole and balls. After that she whips out her cock and commands Corbin to give her a blowjob. She throat-fucks Corbin's face reminding him not to look at her and Corbin obeys like a good little cock-sucker. Dr. Jade lifts one leg onto her desk and tells Corbin to lick her asshole and so Corbin enthusiastically licks and licks like its his favorite flavor of ice cream. Next Dr. Jade has Corbin get on all fours and she fucks his tight ass with her hard cock. She pounds the come out of Corbin with his legs spread eagle and finishes by shooting her hot load all over his face.",
  "models": [
    {
      "name": "Amanda Jade",
      "person_id": 58284
    },
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    }
  ],
  "release_date": "2017-11-28",
  "scene_id": 42920,
  "tags": [
    "anal",
    "blowjob",
    "Cock Worship",
    "domination",
    "Dose Of Domination",
    "Feet",
    "Male Sub",
    "Paddle",
    "role play",
    "spanking",
    "straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Dr. Amanda Jade, a Healthy Dose of Domination "
}