{
  "collections": [
    "Everything Butt"
  ],
  "description": "Private Missy Martinez was taken by the resistance while on a routine scouting mission three months ago. America never leaves a soldier behind so they have launched a rescue mission to find her and they have sent the best Recovery Special Agent in the industry, Lily Lane. Lily finds Missy tied with ropes and chains to a tree in the amazon jungle. Lily Lane releases Missy from bondage and is in for a surprise. While Missy was missing, the resistance convinced her that America didn't understand their mission and was doomed to fail. The resistance only wants to spread their love for anal sex so for three months solid, Missy's asshole had been gaped opened, licked, sniffed, and fucked. Missy soon began to understand the mission of the resistance and she wants to turn Lily Lane into one of the chosen. Lily plays along. She gets her ass licked, sucked, and fucked by Missy only to trick Missy into thinking that she's on her team. Lily gets Missy tied up and then uses a variety of Large anal toys on Missy's asshole. Missy takes her anal punishment with thick and long toys. She has never taken the two foot slink before today and Lily pushes her to take nearly the entire thing. Missy also has never taken a fist in the ass before and Lily gets her to take all five fingers. Then Lily ties Missy up even more and fucks her ass good and hard with an anal strap on until she cums over and over and turns back in to an American loving Private.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Missy Martinez",
      "person_id": 59648
    }
  ],
  "release_date": "2017-12-15",
  "scene_id": 42927,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "bondage",
    "buttplug",
    "chains",
    "dildo",
    "dominatrix",
    "gaping",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "prolapse",
    "slink",
    "straight",
    "strap on"
  ],
  "title": "Missy Martinez, Anal Rebel ASSault"
}