{
  "collections": [
    "Bound Gods"
  ],
  "description": "Feeling horny on a hot night, Jay Austin leans his back against a wall in a dirty alley somewhere downtown, rubbing his cock through jean shorts, cruising for guys. He unzips his fly and pulls his cock out of his underwear and jerks it until its hard. Muscle-stud, Myles Landon happens to walk by and stops to watch Jay play with his cock and starts rubbing his own. Without exchanging any words, Myles grabs Jay's cock, kisses him deeply, and drops to his knees to suck his cock. Myles punches Jay's chest and stretches his balls while he blows him. Myles then takes his own leather belt off and starts spanking Jay's ass with it while he makes him lick his sweaty armpits. Next Myles whips out his big dick and Jay immediately goes to town on it, trying hard to fit every inch down his throat. Myles thoroughly fucks his face then pulls out some rope from his backpack. Next, Myles ties Jay to the alley's wall in rope bondage, standing with his arms above his head with his ass popped out. Myles plays with Jay's cock while he licks, spreads, and smacks his ass then grabs his flogger. He flogs Jay's ass and back hard until his skin turns pink, then reties Jay facing forward and attaches a metal clamp to his balls, sticks a gag into his mouth, then continues flogging Jay in his chest, stomach, and legs. In the final scene, Jay is tied to a wooden box on his back with a blindfold on with both legs spread. First Myles sticks a finger up Jay's ass, playing with his prostate, sending shockwaves through Jay's involuntarily writhing body. Myles shoves his huge dick into Jay's tight ass and fucks him deep and hard. Jay moans in ecstasy as he's brought to orgasm with Myles' thick cock buried deep in his ass. Myles fucks his ass even harder and faster, pulls his dick out of Jay's ass and cums all over his chest and stomach, then walks over to his mouth and plunges it down his throat one last time and tells him to suck it dry.",
  "models": [
    {
      "name": "Jay Austin ",
      "person_id": 60225
    },
    {
      "name": "Myles Landon",
      "person_id": 60444
    }
  ],
  "release_date": "2018-01-04",
  "scene_id": 42930,
  "tags": [
    "anal",
    "bdsm",
    "blindfold",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "domination",
    "flogging",
    "gag",
    "gay",
    "humiliation",
    "leather",
    "leather belt",
    "Male Sub",
    "master",
    "muscle",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "spanking",
    "Stud",
    "submission"
  ],
  "title": "Street Meat: Back Alley Bondage"
}