{
  "collections": [
    "Everything Butt"
  ],
  "description": "The Greatest Gift Given was wrapped days ago, For Dee Williams its a redheaded submissive; A Red-headed hoe. Violet wiggles and giggles with nerves, and Dee sneaks in on Christmas to give Violet what she deserves. Some Spankings and Gapes and Anal will come, into the puckered Butthole will Dee put her thumb. Tis a night for being thankful for everythingbutt, and all of the girls doing anal until their asses won't shut.\nViolet Monroe is all wrapped up in rope bondage for Dee Williams. Dee comes into the Christmas home and instantly starts licking Violets wett meaty asshole. Violet has been waiting for Dee with a butt plug in so that her asshole will gape big and wide for us once it is removed. Dee licks and sniffs at her submissive's asshole. Dee pops the toy in and out of Violet's ass making her gape and wink for us. Violet pushes her anal limits just for everything butt fans. She take Quadruple anal. She is stuffed as far as she can be and when the toys come out she is gaping wide open from having explosive anal orgasms. Dee face sits her submissive, making Violet lick her asshole and pleasure her as she smothers Violet out with her round juicy asshole. Violet stuff's Dee's asshole with a toy. Dee's tight ass envelopes the toys and wraps tight around it. Dee orgasms again and again all over Violet's face. Dee puts on the biggest cock she has ever seen and fucks and fists Violets tender ass. Both girls flip over and fuck their pink meat holes until they cum, giving everyone a VERY ANAL CHRISTMAS",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Violet Monroe",
      "person_id": 20284
    }
  ],
  "release_date": "2017-12-29",
  "scene_id": 42939,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Bondage",
    "buttplug",
    "christmas",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "holidays",
    "Lesbian",
    "LezDom",
    "Prolapse",
    "Rope Bondage",
    "Straight"
  ],
  "title": "A Very ANAL Christmas with Dee Williams and Violet Monroe"
}