{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "This is NOT the rookie cup finale, This is the INTERIM ROOKIE CUP MATCH. London river was eliminated from the tournament last week, however, because of scheduling conflicts, Serene could not shoot the finale until next week. Who ever wins this match up with take Serene on in the finale for the title of Rookie cup Champion. Either Johnny Starlight will take on Serene or London River will get a shot at revenge with Serene and we will be able to see who would win a match if it were to go all full three rounds. Today is a brutal match up. It's almost like watching a rookie take on a vet for the first two rounds. But once one of these wrestlers figures out her opponent, the game changes. The wrestler who was behind in points gets brutal revenge in round 3. She traps her opponent with leg scissors and quickly racks up sex points. Is it enough to catch up and cum from behind? This match shows that the 2017 rookie cup tournament is THE best rookie cup to date. So much passion put into these 100% competitive erotic wrestling matches. These girls are putting their bodies through brutal punishment for the chance to fuck their opponents. In the end the winner is called and she drags her prize onto the mats for Deep throating face fucking, a thumb in the ass hole to warm it up for powerful, rough anal so hard it leaves the loser's asshole gaping. Winner poses victoriously above the loser and makes her suck her toes and feet. The winner then sits her big beautiful ass on top on the loser and smothers her while she fucks her face and uses it to cum.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Johnny Starlight",
      "person_id": 60491
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2017-12-20",
  "scene_id": 42942,
  "tags": [
    "Anal",
    "Brutal Punishment",
    "Champion",
    "Domination",
    "erotic wrestling",
    "Facesitting",
    "Feet",
    "Fingering",
    "Gaping",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Johnny Starlight vs London River"
}