{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\nProgress Review: Previously, trainee has proven able to succum to total helplessness, being led naked and blindfolded into the bowels of the Armory. She is turned on when she is degraded and ordered into hard manual labor. She proves determined to train. Trainee responds well to instruction and appears genuinely willing to submit and adhere to a structured protocol, but she does require immediate and harsh discipline when rules are broken.\nShe appears to thrive on being used like a piece of property, responding well sexually. She possesses a very tight little pussy and ass, her oral skills are good but she has a tendency to scrape her teeth on the cock. She does indeed orgasm from hard penetration, her body contracting around the cock in a most satisfying manner - good enough to earn a bed to sleep in that night.\nTrainee was kept overnight in the Armory, her quarters invaded in the middle of the night. Her response to her privacy being stripped away was slightly stoic but she performed for the whip and reacted well to a hard fuck and vibrator while tied in tight rope bondage.\nTraining Goals:\nInstill focus and self discipline\nImprove ability to remain present when being hurt\nBasic slave positions\nBasic protocol - properly addressing dominant, limited eye contact\nTrained to entertain with filthy stories\nRecommendations: Continue her work at the dirt pile under Isis Love's supervision. Order her into the stocks and single tail her ass as Isis tests her ability to swallow her strap-on.\nGive her a thorough sexual workout by ordering her to fuck and suck at the same time, back and forth between the two dominants until she is orgasming out of control with her face buried in Isis's hungry, demanding cunt and her pussy stuffed with hard cock. Spray her with come and send her to her quarters to complete her video journal.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Sarah Jane Ceylon",
      "person_id": 12772
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    }
  ],
  "release_date": "2007-06-20",
  "scene_id": 4294,
  "tags": [
    "anal",
    "bdsm",
    "blindfold",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Gimp",
    "humiliation",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "single tail",
    "slave",
    "stocks",
    "straight",
    "vibrator"
  ],
  "title": "The Training of Sarah Jane Ceylon, Day Two"
}