{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Welcome to the Ultimate Sex Fight Championship where the hot, curvy, and all natural redhead Barbary Rose is taking on the beautiful and slender Natalie Mars. What we have here today is a bonafide sex fight, where kissing, penetration, pins, blow-jobs, pussy licking, and face-sitting all earn you points towards winning the Ultimate Sex Fight Championships. Giving the other lady an orgasm on the mats would grant an 'Instant Victory' to one of these gorgeous ladies. Today the duration of this round will be twelve minutes of action packed girl on girl sex wrestling. Watch as these girls go back and forth between having control of the other, rolling around naked pressing on top of each other, sitting on each others faces. Just when one looks as though she's going to win easily she's distracted with an ass in her face and cums hard on the mats giving her opponent a TKO, a 'Tongue Kissing Orgasm!' declaring her as the Ultimate Sex Fight Champion. The winner ties the loser up with rope and gives her a deep and sloppy throat-fucking. After that, the loser gets dragged into the locker room while she's still in rope bondage and the winner spanks her ass till it turns pink and then the loser gets fucked deep and hard doggy-style, cumming on the winners cock over and over again. The loser is then rammed into the shower for more hard pounding fucking, more face sitting, more face spitting, throat-fucking, foot sucking, and gets a nice hot load of cum right down her loser throat. Loser gets choked, throat-fucked, hair-pulled, face-sat, and turned into a cum dumpster, all for losing The Ultimate Sex Fight Championship. This is \"winner fucks the loser\" rules and may the best woman win!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Barbary Rose",
      "person_id": 54183
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    }
  ],
  "release_date": "2018-01-01",
  "scene_id": 42955,
  "tags": [
    "blowjob",
    "bondage",
    "champion",
    "Cock Worship",
    "curvy",
    "Facesitting",
    "Facial",
    "oral sex",
    "redhead",
    "role play",
    "rope bondage",
    "sex fight",
    "straight",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Ultimate Sex Fight Championship: Barbary Rose vs Natalie Mars"
}