{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\nProgress Review: Previously, the trainee's performance with two dominants was stimulating. Her sexual availability is remarkably slutty. Her ability to orgasm from pounding penetration is gratifying.\nThe process through which she experiences pain is opening up. New techniques and requirements of training are taking her into unfamiliar territory and she is adapting well. She displays a very strong commitment and willingness to learn.\nGoals Progress:\nFocus and self discipline: still easily distracted and requires more work here.\nPresence during corporal scenes: shows improvement,finding more intensity in scenes when present\nSlave positions: covered 'attention', 'present ass' and 'down' but vastly overestimates her ability to maintain them.\nBasic protocol: has received several canings for breaches of protocol\nRecommendations: Further position training in head box, focusing on stress positions and endurance. Add measures of objectification and humiliation by stuffing a hard cock into the glory hole on the head box.\nCorrect her with a harsh caning for earlier mis-steps in addressing her dominant, see that she gets the point.\nLock her in quarters to meditate on filthy stories to entertain her dominant, which she will deliver while riding a rubber cock to orgasm for his amusement.\nTeach her a lesson in boot cleaning, leather history, and cock worship. Cover her face in come and dismiss her to begin on her homework assignment for the evening.\nExtra Studies: Clean a half dozen pair of leather boots by tomorrow morning.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Sarah Jane Ceylon",
      "person_id": 12772
    }
  ],
  "release_date": "2007-06-28",
  "scene_id": 4295,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Boot",
    "Caning",
    "Cock Worship",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gimp",
    "glory hole",
    "Humiliation",
    "Latin",
    "Leather",
    "master",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Slave",
    "Straight",
    "top"
  ],
  "title": "The Training of Sarah Jane Ceylon, Day Three"
}