{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "This should have happened a lot sooner. The moment that TS goddess Casey Kisses and latina porn princess Mercedes Carrera lay eyes on each other they knew that their depraved desires were about to be fulfilled. Casey wastes little time and immediately puts Mercedes in her place and demands that she worship her huge rock hard cock. Mercedes is only too happy to serve her mistress and gobbles her divine dick and balls. She gags and chokes while deep throating which makes her mistress pleased with her devotion. To reward her succubus, Casey flips her bitch over and shoves her massive wang into her tight pink pussy. Mercedes huge tits bounce up and down as she gets rammed by the stiff cock. She begs to orgasm but Casey isn't ready for her submissive female sex slave to cum and instead revels in the torment of Mercedes orgasm denial. The fever intensifies as Casey fucks Mercedes from behind. Her toned and perfect ass shakes and trembles as Casey fucks her doggie style But Mercedes hunger for cock is bottomless and she begs Casey to let her deep throat her dom's dick every chance she can. Casey's sadistic nature gets the best of her and she coerces her submissive to surrender to her cruel whims and fancies. Casey plays with her perky tits and flips her golden blonde hair as she revels in the sight of her playthings devotion. Mercedes begs and pleads with her master to allow her to taste her precious cum. And Casey is only too happy to oblige and blows a massive cream pie in Mercedes tight little whore hole. She plays with the jizz and spoons it into her mouth devouring her mistresses divine love nectar. She ends her day by showering Casey with praise and thanks for her attention and sexual generosity.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Mercedes Carrera",
      "person_id": 55286
    }
  ],
  "release_date": "2018-02-12",
  "scene_id": 42956,
  "tags": [
    "Athletic",
    "Blonde",
    "Blowjob",
    "Cock Worship",
    "Latex",
    "master",
    "Orgasm Denial",
    "Role Play",
    "Slave",
    "Straight",
    "toned",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "TS Goddess Casey Kisses Creampies Submissive Slut Mercedes Carrera!!"
}