{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Beta-male DJ has no idea what's in store for him when he enters Divine Bitch Mona Wales' vintage shop. But Mona does. She sees boyfriend potential and wants to know if he can serve. She starts with bullying him into a straight-jacket. Once he's bound, she gets him on his knees, worshiping her beautiful stocking clad feet. DJ is so taken aback by this goddess, he acquiesces to her every desire. He agrees to be her new boyfriend and now Mona must discover if he is up to task. She crops his cock, slaps his face, and makes him eat her sweet cunt. She smothers him with her pussy and has him lick her asshole. DJ can't enough of Mona's pussy but once she cums on his face, she grows suspicious he does this with all the ladies. DJ gets a hard spanking and promises Mona he'll be her loving slave forever. Next, DJ is bound with his head in a box. Mona flogs him and humiliates him. She shuts him in the box to remind him that he is nothing but an extension of her glorious self. To drive the lesson home, she pummels him with her fat strap on cock. DJ moans as Mona gives him all her loving via her hard cock, filling his hole with 10inches of silicone. Reducing DJ to the nothing he is gets Mona all hot and she cums while fucking his asshole. Finally, Mona test drives her new cock. DJ groans, trying not to cum as Mona bounces up and down on his cock. Mona sticks her feet on DJ's face and commands him not to look at her. Mona cums hard multiple times and squirts all over DJ's body. She continues to humiliate him and tells him he may never get to cum if he's her boyfriend. DJ agrees and watches Mona walk away, happy with his new position.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "DJ",
      "person_id": 20225
    }
  ],
  "release_date": "2017-12-19",
  "scene_id": 42964,
  "tags": [
    "bdsm",
    "bondage",
    "CBT",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "humiliation",
    "Male Sub",
    "orgasm denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "spanking",
    "straight",
    "straight jacket",
    "strap on"
  ],
  "title": "Mona Wales Trains Her New Beta Bitch Boytoy"
}