{
  "collections": [
    "TS Seduction"
  ],
  "description": "In a private room surrounded in red velvet, Honey Foxxx dances seductively in red lace lingerie for the clean-cut Lance Hart, who sits on a black leather couch, in awe of her beauty. She slowly grinds her delicious round ass on Lance's lap and feels his hard cock through his slacks. As she stands, Honey pulls Lance up by his necktie and pushes his head down making him lick her long black latex high-heel boots. He licks all the way up to the end of her boots then takes them off while Honey lounges on the couch. Lance licks, sniffs ,and sucks Honey's toes through her red thigh-high stockings. Honey then turns over onto her knees, pulls her panties aside and shoves Lance's head deep into her ass. Honey pulls Lance's hard cock out and sucks it, making Lance's eyes roll to the back of his head. Honey then leans back and wraps both feet around Lances dick and jerks it through her red stockings. She pulls her huge cock out and Lance immediately dives head first into her lap to please and worship her amazing cock. Lance stretches his mouth around her cock like a python eating something twice its size and sucks it slow and sensually making it rock hard and ready for his ass. She has Lance then get on his knees and shoves her long fat cock into Lance's ass and pounds it deep and hard. She fucks him in pile driver next, driving her long cock all the way down Lance's stretched hole. Then they both get back on the couch and Honey slides her meaty member into Lance's used hole once again and fucks the cum right out of him. After Honey shoots her load all over Lances stomach and chest, she makes him get on the floor and then takes her stockings off, scooping both of their loads up with her bare feet and makes Lance lick them clean.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Honey FoXXX",
      "person_id": 20864
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    }
  ],
  "release_date": "2018-01-09",
  "scene_id": 42967,
  "tags": [
    "Anal",
    "Blowjob",
    "Cock Worship",
    "Feet",
    "Latex",
    "Leather",
    "Lingerie",
    "Male Sub",
    "Nylons And Stockings",
    "Role Play",
    "Straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Sensual Sex in the Champagne Room with Honey Foxxx and Lance Hart"
}