{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Bella Rossi is a gorgeous, red-headed domme who knows how to treat a man. When Mike Panic arrives late for his session, Bella steps it up a notch. In true corporal form she spanks his ass first and foremost, telling him not to apologize and instead to take the punishment he’s due. And that punishment is yet to be determined! Bella gags him to keep his mouthy trap shut, then crops him then flogs him, to make sure he knows his place when he’s in and out of her dungeon. She seeks out his nipples and put tight clamps on them, then his ball sack, which is especially sensitive. Bella genuinely delights in tormenting her subject. She laughs at his suffering and revels in his pleas. She then corners him into saying he’d do anything if only she’d relieve the pain on his balls. “Anything” includes a lot. Bella ties him down so he can barely move, then pegs his desperate ass hard and deep. He loves every moment of his punishment, but Bella always makes it just a little less pleasurable than he’d like. She drenches him in hot wax and continues to fuck him. Finally Bella pushes Mike’s limp cock into his own foreskin and clamps it away, so it can’t be seen or touched. She straps a dildo gag on Mike, then rides it, using him explicitly for her own pleasure. She cums repeatedly, then removes the gag and makes Mike eat her pussy and ass while she cums yet again. When all is said and done, Bella has had her way, and Mike is left a withered, pouting mess.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Mike Panic",
      "person_id": 41034
    }
  ],
  "release_date": "2018-01-02",
  "scene_id": 42963,
  "tags": [
    "Athletic",
    "BDSM",
    "Big Tits",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Femdom",
    "Fingering",
    "foreskin",
    "Gag",
    "Hot Wax",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slave",
    "Straight",
    "Tattoo",
    "white"
  ],
  "title": "Gorgeous Sadist Bella Rossi Torments An Unsuspecting Mike Panic"
}