{
  "collections": [
    "TS Seduction"
  ],
  "description": "TS Foxxy lounges alone in her apartment reading a magazine on a black leather couch in sheer pink lingerie, waiting for her pizza to be delivered. When DJ the shy delivery guy arrives with the wrong pizza, Foxxy decides to take advantage and invites him to sit on the couch next to her to make things a little uncomfortable. She strokes his chest and asks if he wants to have a little fun. Reluctantly, DJ succumbs to Foxxy's seductive nature as she pulls down her top revealing her perfect tits. Foxxy unbuttons DJ's pants and pulls out his already rock hard cock and strokes it as her other hand pulls his head into her tits. She pulls out her own hard cock and DJ gets on his knees and starts sucking. Foxxy putts DJ over her knee and spanks him hard with one hand and with the other puts three fingers in his ass. Next, Foxxy tells DJ to take off her stockings and worship her feet. DJ licks, sucks, sniffs, and kisses every one of her toes. After that she makes DJ get on his back as she places her big round ass on his face. In a hot sixty-nine, DJ licks Foxxy's pretty asshole while she strokes, sucks, and bites on his massive hard-on. Foxxy turns him over and sinks her fat cock into DJ's asshole and starts pounding it deep and hard. She flips him over onto his back and jerks his cock as she fucks his ass hard again. Foxxy then pulls her cock out of DJ's ass and climbs across his body shoving her cock into his mouth making him taste his own ass. She grabs the hair on the back of his head and fucks his face until she cums. After Foxxy shoots her load she grabs a slice of pizza to munch on while she finishes off DJ's cock using only her feet, dripping his cum down her toes.",
  "models": [
    {
      "name": "TS Foxxy",
      "person_id": 20055
    },
    {
      "name": "DJ",
      "person_id": 20225
    }
  ],
  "release_date": "2017-12-26",
  "scene_id": 42966,
  "tags": [
    "anal",
    "big tits",
    "blowjob",
    "Cock Worship",
    "Feet",
    "leather",
    "lingerie",
    "Male Sub",
    "role play",
    "Stockings",
    "straight",
    "TS",
    "TS Fucks Male",
    "TS"
  ],
  "title": "Special Sauce: Delivery Boy Fucked by TS Foxxy!"
}