{
  "collections": [
    "Everything Butt"
  ],
  "description": "Lauren Philips is a level over 9000 Yoga instructor. Everyone loves her private instructions. Once you take a class with Lauren, You will be able to hit ANY pose. Lauren has a unique way of getting people to open up and let go. She knows that sometimes our minds distract us and don 't allow for us to get a full stretch. Lauren has found that making the body go against it 's natural instinct by trapping the muscles in can allow for deep stretching and relaxation. A lot of yoga teaches its students to breath to help cleanse the body. Lauren gets her students to breath deep by putting her nose to their asses while they breath in and out. This gives the student a feeling of relaxation but it also give Lauren a nice full breath of her favorite kind of air. Today, Maya Kendrich is doing a one on one class with Lauren in a Zen room. Lauren helps Maya advance her Yoga by putting Maya into bondage and making her muscles do what they don 't seem to want to do. Maya learns to relax from Lauren 's putting fingers in and out of her ass. Lauren puts her tongue and spits in Maya 's ass after she stretches it out using her fingers as fish hooks. Then Maya in bent over and gaped open with a huge black plug. Maya is in bondage while her asshole opens wide and we get a good look into her pink meathole. Since Lauren is teaching yoga she make Maya move around while she 's in bondage to check her core, her balance and her mental strength. Maya is rewarded by being able to lick, sniff fuck and eventually FIST Lauren 's sweet round ass. Lauren gets her rope and fashions a strap on harness out of it so she can fuck Maya 's hole until it 's stuck open.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    }
  ],
  "release_date": "2018-01-12",
  "scene_id": 42961,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Bondage",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Lesbian",
    "LezDom",
    "Prolapse",
    "harness",
    "Straight",
    "Strap On"
  ],
  "title": "Yoga Girls Do Anal Bondage Stretching Until They Gape"
}