{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report, Final Day\nGoals Summary\nFocus and Self Discipline: The head box has been invaluable in instilling focus into this one's pretty head. She has learned to concentrate more on tasks, service two dominants at the same time, and present reflective anecdotes for her dominant's amusement.\nPresence: While our trainee came to us with a plethora of experience, her ability to remain present during scenes was less than acceptable. She has rounded out this skill, and her willingness to be led in this direction speaks to the depth of her submission.\nSlave Positions: Trainee eagerly learned several important positions. While other dominants may have different requirements, exposure to these positions was successful in teaching her the importance of stamina, self awareness, focus and discipline.\nProtocol: The trainee is especially adept at presenting a submissive, alluring presence, and the protocol training only enhances her demeanor and gives her the tools and focus to present herself in a dignified and erotically present manner. Very fucking sexy.\nFinal Recommendations: Dress her in full latex with hood and blindfold, leaving her slut mouth accessible. Drill her on the slave positions she has learned and remain quick to correct her with stinging cane swats.\nBind her in various uncomfortable and humiliating positions and order her to service TJ Cummings with her mouth, pussy and ass for our amusement. Tell her what a good little whore she is as she sucks cock and presents her holes to be fucked, and finish the scene with a cum shot all over her latex clad face.\nTake her back where she started this whole journey - the dirt pile. Order her back into manual labor to clear her mind and contemplate the week's training. Quiz her on what she leaned here, and dismiss her with the highest recommendations as a well trained and motivated slutgirl.",
  "models": [
    {
      "name": "Sarah Jane Ceylon",
      "person_id": 12772
    },
    {
      "name": "TJ Cummings",
      "person_id": 12891
    }
  ],
  "release_date": "2007-08-03",
  "scene_id": 4296,
  "tags": [
    "blindfold",
    "latex",
    "slave",
    "submission",
    "discipline"
  ],
  "title": "The Training of Sarah Jane Ceylon, Day Four"
}