{
  "collections": [
    "Everything Butt"
  ],
  "description": "Meditating in her studio, Leya Falcon is a natural holistic reiki healer with long blonde hair, big tits, and a beautiful big ass. Today, London River enters Leya's reiki studio to help channel some good energy. After a reiki session, Leya learns that London's butthole chakra is out of alignment and preventing her from achieving true happiness. Leya has London lay down so she can adjust her butthole chakra back into alignment. She proceeds to stuff a huge butt plug in and out of London's ass. She pulls it out and looks inside and checks to see if the chakra has aligned, alas it has not so she must stretch her hole even more and moves on to larger toys to get the job done. London goes deeper and harder into London's asshole. She eventually gets her entire fist into London's asshole and punches her chakras back into place. Leya needs to get deeper however. She grabs the worm toy and snakes it deep into London's asshole. Leya then has London use a toy on her own asshole and has her lick all the butt juices off of it to get a taste of what a true butt-hole chakra alignment should taste like. London then puts a big black toy thats larger than her head into Leya's perfectly aligned asshole. The two must connect on a deep level so Leya gets tied up with rope to show how free she is spiritually. She could be bound physically and still feel freedom while her asshole gets foot-fucked, licked and sniffed. To finish off this hole-istic session, Leya Falcon gets a strap-on and fucks London's butthole hard, fast, and deep until it's gaped open, ready to accept the good wholesome energy flow that Leya has channeled into the room.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Leya Falcon",
      "person_id": 46075
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2018-01-26",
  "scene_id": 42962,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "big ass",
    "big tits",
    "blonde",
    "buttplug",
    "dildo",
    "dominatrix",
    "Gaping",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "prolapse",
    "straight"
  ],
  "title": "Hole-istic Healer Fists & Fucks The Butthole Chakra"
}