{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Shoe salesman Lance Hart has no idea what’s in store for him at work today. He thinks it’s just another day of sneaking sniffs of women’s feet as he helps them try on heels. When he assists customer Cherry Torn, Lance can’t resist smelling her stocking-clad feet. But Cherry Torn is on to this little foot pervert. She doesn’t mind some enthusiastic foot worship as long as she gets to expose Lance for the slut he is. She presses her heels into his erection and makes him worship her shoes and her feet. She strips him of his clothes and blackmails him into fulfilling her every desire. Eager to please, Lance complies and gets to sniff Cherry’s feet and heels. Cherry uses her feet to play with Lance’s cock and is hardly surprised to see this dirty boy is leaking pre-cum everywhere. She ties Lance up and flogs him all over his chest. She spits on his face and laughs at his pain. Then she slides her cock right into his tight little asshole. Lance loves getting fucked and begs to cum as Cherry pumps her cock in and out of his ass. But no one cums before Cherry! Cherry suspends this slut in the air and uses him to get off over and over again. Lance greedily licks Cherry’s hungry cunt as she orgasms. Finally Cherry lets Lance down and puts his cock in her pussy. She rides his cock, keeping Lance right on the edge of cumming. Her juicy ass bounces up and down as she torments him with her sweet cunt. After she’s had her fill, she jerks Lance off and he blows his load all over himself. Cherry wipes her feet in his mess and Lance eagerly sucks Cherry’s cum-soaked stockings.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    }
  ],
  "release_date": "2018-01-16",
  "scene_id": 42965,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Foot Worship",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Nylons Stockings",
    "Orgasm Denial",
    "other hair color",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Sniffing",
    "Straight",
    "switch",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "Cherry Torn Dominates and Fucks Foot-Sniffing Pervert Lance Hart"
}