{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Today we give you an exhibition match with one of our most powerful sex fighters taking on a brand new rookie. Daisy Ducati may very well be the wrestler with the most orgasm ripping fights to her name. She has ripped orgasms out of her opponents countless times and today is one of her strongest matches to date. She is taking on the petite, all natural tattoed, Sheena Rose. Sheena puts up a good fight but the size and experience difference makes it impossible for Sheena to get any good holds. Daisy pummels her opponent, traps her on the mats, kisses her, fingers her, taunts her verbally. Sheena loves the punishment and quickly and repeated cums on the mat again and again. She does try to fight the orgasms but Daisy's muscles are too much for her. She succumbs to the power of Daisy and releases her orgasm all over the mat. For the Prize round, Daisy fucks poor little Sheena into submission. She fucks hard and fast while she shoves her feet into Sheena's face and makes her suck and lick her feet and toes. Daisy flips the little wrestler into doggystyle and fucks her tight little asshole hard and fast. Sheena is the Ultimate Orgasmic wrestler and makes the perfect loser. She hates losing and hates getting fucked for losing but she cums against her will again and again. Daisy picks up her opponent with ease, over her shoulder and lifts and carries her off the mats.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Sheena Rose",
      "person_id": 52312
    }
  ],
  "release_date": "2018-01-10",
  "scene_id": 42960,
  "tags": [
    "domination",
    "Facesitting",
    "Feet",
    "Fingering",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Petite",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Orgasm Ripping Match: Daisy Ducati vs Sheena Rose"
}